[
    {
        "post_id": "mzn319",
        "author": "hiBitchh",
        "title": "Some motivation to do leetcode.",
        "url": "https://www.reddit.com/r/csMajors/comments/mzn319/some_motivation_to_do_leetcode/",
        "score": 489,
        "num_comments": 32,
        "created_utc": 1619525608.0,
        "selftext": "**Donald Knuth**, one of the most prominent computer scientists in the history of algorithmics, put it as follows:\n\n\n“A person well-trained in computer science knows how to deal with algorithms: how to construct them, manipulate them, understand them, analyze them.\nThis knowledge is preparation for much more than writing good computer programs;\n\nit is a general-purpose mental tool that will be a definite aid to the understanding of other subjects, whether they be chemistry, linguistics, or music, etc.\n\nThe reason for this may be understood in the following way: It has often been said that a person does not really understand something until after teaching it to someone else.\n\nActually, a person does not really understand something until after teaching it to a computer, i.e., expressing it as an algorithm...\n\n\nAn attempt to formalize things as algorithms leads to a much deeper understanding than if we simply try to comprehend things in the traditional way.”",
        "permalink": "/r/csMajors/comments/mzn319/some_motivation_to_do_leetcode/",
        "comments": [
            "Here's another one:\n\n> \"Bad programmers worry about the code. Good programmers worry about data structures and their relationships.\"\n- Linus Torvalds",
            "Literally make it a part of your life. If you think no one else is doing it, you’re wrong. I used to hate Leetcode because of the UI and ads but it started to grow on me because I could mentally see the difference it was making on me. Don’t try and speed through it instantly. That’s how you get bored. I try the 3-method: 3 easy; 1 medium and 1 easy; or 1 hard a day. Start with 3 easy per day for a couple weeks, then bump up to a medium and easy per day, then start trying the hard ones. Spend the entire summer doing it, and boom you already have about 150-300 coding problems complete. This only takes me around 15min-1hour. Don’t be afraid to use online help. It’s good to learn more as you code. Happy coding!",
            "There is definitely some amount of crossover into practical software engineering that comes from doing leetcode. I did my capstone project this semester and there was a few instances (typically involving arrays and hashmaps) where I understood the problem better because of my leetcode knowledge. I also went from not even being to do easy (think reverse linked list or two sum) to being able to confidently do mediums and some hards. You will get better if you don't give up!",
            "I keep this in mind:\n\nNo Leetcode, no hope\n\n(for people like me with \\~100% failure; does not matter if others get their dream job without LeetCode).\n\nAnd have not skipped my daily dose of LeetCode for >8 months.",
            "That is true, in my databases class we are going over the implementations of databases behind the scenes (B+- Trees for instance), and having a good knowledge of data structures and algorithms really helps you understand why certain things are done the way they are done, and also helps you understand it better and faster",
            "Leetcode saved my ass on my data structures midterm so 🤷",
            "Wanna make money when you graduate? Leetcode! If you don't, then don't! \n\n&#x200B;\n\n/s",
            "“if you know how to effectively use algorithms and data structures you’re going to have a much better chance at interviewing for a job in the technology industry than if you don’t” - Robert Sedgewick Professor at Princeton",
            "Brings back memory from my Data structure and Algorithm class at my CC.....definitely a motivation boost",
            "LeetCode is definitely one way to do it but if your school has a high quality algorithms course, I think doing well in it to the point you understand the algorithms, their runtimes, and their implementations is good preparation.",
            "welp shit if don knuth says its good then we have to do it",
            "Here's my favorite quote from my favorite programmer: \"If you don't do leetcode, you suck ass\"\n\nBy me. I'm my favorite programmer",
            "Thank you. Need motivation for the grind ahead of me this summer.",
            "Ok, but to be fair, everyone here is posting good quotes about understanding algorithms, which I totally agree with.\n\nThe disconnect happens when everyone immediately uses that to equate to leetcode. Leetcode is a good way to practice coding algorithms, but to really learn algorithms one should hit the books and do some exploratory analysis/coding oneself. Leetcode is only the start, and can get boring quickly",
            "Guys, How do I actually learn algorithms and data structures to implement them in my Leetcode problems ? what resources do you guys use?"
        ]
    },
    {
        "post_id": "17zwq0p",
        "author": "DJA121",
        "title": "I did it without 1 Leetcode problem.",
        "url": "https://www.reddit.com/r/csMajors/comments/17zwq0p/i_did_it_without_1_leetcode_problem/",
        "score": 488,
        "num_comments": 72,
        "created_utc": 1700508676.0,
        "selftext": "My internship search is now at rest. After over 150 applications. 4 Rejections, and 2 Final rounds. I received an offer from a bank as a tech intern. I am a Junior at a state school, and the title is true. I have never done leet code or any equivalent to prepare for interviews. It has been a stressful process and I had many instances where I thought I would not get hired. Stay confident and keep applying to internships every week. From this process I have found it is more of a numbers game than anything. \n\n&#x200B;\n\nI needed somewhere to share this. Good luck to all.",
        "permalink": "/r/csMajors/comments/17zwq0p/i_did_it_without_1_leetcode_problem/",
        "comments": [
            "A lot of the people on this sub have a myopic view of tech jobs.\n\nHigh paying jobs usually require some technical assessments, but some non tech companies will give assessments that are not leetcode based.\n\nI had an interview where I was asked how a program in C executed.  Sounds easy, but it is harder than you think.",
            "Congrats dude! The two internships I did also had no leetcode. Just had the typical behavior talk and discussed a project on my resume. Like you mentioned tho, it’s a numbers game. In other words, you should still study leetcode to maximize the potential job interviews you can pass.",
            "Believe it or not i got a SWE internship at Microsoft after 5 hours of behavioral interviews (yes really, 5 one hour interviews) and 0 technicals. It was mostly to do with the specialized nature of the position and i was probs one of the only people with related experience. I can tell you though it was some of the hardest behaviorals ive ever gotten lol. Ended up getting a return offer, im probs one of the only SWEs at MSFT that hasnt done a technical LOL",
            "List of actual non leetcode things I have been asked/told to do, in place of leetcode:\n\nHow long will it take you to learn C++?\nDescribe the architecture of a project you've built.\nX year was palindrome and a leap year.  What was the last year prior to that that was a palindrome and a leap year? (aka, logic puzzles)\nExplain containerization.\nTake this data structure, reassemble it into this data structure, and then output it in html.\n\nLeetcode isnt the be all, end all.  Source:  staying vague for the sake of anonymity, but all of the above except for 1 took me all the way to the final interview, and at least 1 hired me.",
            "W",
            "How did you pass your OAs and interviews?",
            "Still gonna do Leetcode cuz I like it",
            "I did it without a CS degree, it is a numbers (and networking) game.",
            "I got hired by a tech company 3 months ago and also didn’t do a leetcode test. I didn’t even have a coding exam. I was quizzed on the tech stack and general OOP/CS topics.",
            "Look at my search post. I never do leetcode and I have had a lot of interviews and offers.",
            "having done over 300 lc questions, interviewed with roughly 10 companies last season — none of them ask more than an easy or medium. moral of story, have good swe foundation, with moderate leetcode skills will get you something somewhere",
            "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)\n\nLion amongst sheep",
            "Nice! I haven’t even made an account on there yet lol",
            "[deleted]",
            "Same I got 7 offers with only 9 leetcode problems (I focused a lot on behavioral)",
            "[deleted]",
            "How does the job description look like?",
            "Curious, did you have to do a background check for this position?",
            "Good luck buddy",
            "I also did it without any Leetcode problems solved... because I solved them on Codeforces!",
            "I always prefer talking about cs concepts and my approach and experiences with a tech stack rather than being grilled on a problem i would never encounter in real life. I get really bad test anxiety, so all three of my internships i didnt do a single coding question interview.",
            "Only 4 rejections?",
            "Do u have a really high gpa?"
        ]
    },
    {
        "post_id": "179yhc6",
        "author": "369INFINITY369",
        "title": "How tf does $100+ per hr resume look like",
        "url": "https://www.reddit.com/r/csMajors/comments/179yhc6/how_tf_does_100_per_hr_resume_look_like/",
        "score": 489,
        "num_comments": 239,
        "created_utc": 1697549609.0,
        "selftext": "i am really curious to know how an 100+$ per hr resume looks like, if your hourly pay is $100+ per hour, i  really appreciate if you could share what technologies do you use in your work, your skills and any projects that you have made that may have gotten you the job,   \n\n\nit would be really awesome if you could share your story, how did you get there?, your experience and any tips if you have ,that would be really helpful ",
        "permalink": "/r/csMajors/comments/179yhc6/how_tf_does_100_per_hr_resume_look_like/",
        "comments": [
            "I do not make that, but some of my friends are at or near that (Point 72, Akuna, DRW). The things that they all have in common is that they go to top 10 programs (MIT, UIUC, GTech), and they are very skilled with OS/Distributed Systems/Networking/Low-Latency C++. None of them had any crazy internships before that I can recall.",
            "After looking at these comments- Maybe im content earning an average wage lol.\n\nI’m not a math god nor am I grinding for and shelling out the money for a top 5 school…\n\nI just would like enough money to live comfortably",
            "I make $150/hr, and the key for me is being good at competitive programming, combined with going to a T3 school.",
            "[deleted]",
            "I make $127/hr (total comp) as an iOS engineer at big tech. \n\nMy resume follows generally accepted ATS rules, clean descriptions, organized, fits in 1 page, and only put what is relevant.",
            "Today's dose of Pain completed.",
            "[deleted]",
            "Some of my fellow ex interns make that now. They all go to a T5 CS school, have internships at places like NASA, and some extras like math contests/hackathon awards. No idea what their projects look like",
            "[deleted]",
            "[deleted]",
            "1) 20 years of experience in IT.\n2) T1 > T2 > T3 support > system analyst > system analyst lead > PO > solution architect > delivery manager \n3) got quite a few projects behind my back, as a support was one of few key users in HPSM implementation (top 10 bank), as an analyst worked on a few inhouse risk management platforms, went into big data solutions (later got hunted into delivery manager role in another top 5 bank). \n4) List of stuff I worked with is quite big, hahah. I can use pretty much every integration pattern that was popular in last 20 years, worked with physical servers (windows/linux/os400), cloud stuff (openshift, cloudera, aws, kubernetes), big data stuff (hbase, solr, spark, yarn, hive, etc), and usual sql things (oracle, postgre, mssql). I can read Java, JS, Python, but I actually don’t like coding.\n5) We prototyped and successfully implemented real-time access to big data sets, and another bank straight-up hunted me to make a similar software.\n\nEdit: not USA though.\n\nEdit2: T20 school, but no higher education (dropped out).",
            "$100 an hour new grad (excluding equity bonus). FAANG internship + T15 school.\n\nNo competitive programming. Did competitive math in HS but not a god - only could solve 6-8 on the AIME.",
            "The only way I could see myself getting to that point is in some sort of senior or managerial capacity.",
            "This brings me great pain",
            "T5 school, started programming when I was a kid, had experience and projects with tech they used, got a great internship",
            "General resume points:\n\n- Political science major, CS minor\n- T15 - T50 school for CS, depending on the list\n- No internships in CS\n- 1st job ~150k TK (2.5 years)\n- 2nd job (supposedly) ~250k TC (1.5 years)\n- 3rd job (supposedly) ~350k TC (very recent, current)\n- Tech stack is mostly java, backend.\n\nSpecifics that actually helped me with my offers:\n\n- Somewhat charismatic compared to normal CS people.\n- I got most of my 1st job interviews out of college from school career fairs.\n- What helped me land my first job is a web app that I could show on my phone, one that clearly wasn't a simple school project, one that I could talk about at length.\n- Filled in my LinkedIn. 2nd and 3rd jobs (as well as most of my interviews after my first job) start out as recruiters reaching out to me on LinkedIn.  \n- I negotiated. I got ~90k TC bump on the initial offer for my 2nd job (two rounds of negotiating). I got ~30k TC bump on the initial offer for my third job (one round of negotiating).\n- I got my 3rd job bc my resume happened to get put in front of some people who I interacted with at my first job (did not work directly with them, just hung out with them a few times lol).\n- US citizen\n\nMore specific about the above:\n\n- All jobs in the Bay Area, CA\n- All roles within the payments domain\n- Took me like 6 months - 1 year of searching to land my first job. Pretty decent at leetcode but still failed a handful of interviews (maybe 5ish) before I got good enough at interviewing.\n- Fired from my second job because I kept questioning someone higher up (my guess).\n- I use \"supposedly\" at my 2nd and 3rd jobs because they aren't public. 2nd job priced their shares based on projected share price like 4 years down the line (lol). 3rd job's shares have been bought back at that price. Both larger unicorns.\n- I am generally average in productivity because I value my work life balance. Certainly not a go-getter lol.",
            "Assuming 2000 work hours in a year, I make 250 an hour. Went to a Top 15 undergrad school. Been in Big Tech for about 5 years. Code in C++ (I suspect this doesn't matter as much). Solid project leading experience and track record of being the engineer on the team that solves and anticipates problems for the whole team (of 150+ people). Decently charismatic for a software engineer (cringey as hell for me to say, I know, but a little bit of social skills goes a long way in this field)\n\nI wouldnt call myself a math wizard, but I would say that I am very passionate and enthusiastic about math and other technical concepts, and it comes across easily if you talk shop with me.",
            "If you don’t go to a top school then get a 16+ on the Putnam exam.",
            "Companies pay top dollars for people with proven ability to solve difficult problems. Your pay is directly correlated to this.\n\nDon't focus on table stakes information.\n\nGreat CVs talk about projects, outcomes and results.",
            "!remindme 22 months",
            "I've actually seen some very high end professionals posting their resumes online. They all looked like \"wall of text\"",
            "I didn’t go to any top school or had any notable internships basically do cool personal projects and learn how to sell yourself",
            "1. Bachelor's degree in CS with decent government internships. Medium to bottom school in Canada. Highest honours.\n\n2. Master's in theoretical CS. A top school in Canada.\n\n3. 3 years at a Fortune 50 in Canada\n\n4. Now 1.5 years at a Big Name in the Bay area\n\nI think the hiring manager at #3 cared a lot about grades. So that helped. I also studied a ton for the interviews. And I got to #4 in early 2022 when hiring was hot.\n\nI think specific languages and frameworks don't matter much in your early career. You're expected to learn. Later on you can get pigeon holed though.",
            "Went to a shit school. Grinded leetcode. Went to a startup for 4 years. Went to big tech. Laid off immediately(250k tc). Accepted a new role that pays even bette. Algos and distributed systems are key.",
            "$100+ means you go to a top 5 school, are good at competitive programming, can talk about most programming topics (and not in a memorized way but in a genuinely interested kind of way), and got lucky to find a company with openings. The odds of that are super low. At this point, just focus on finding a job and don't worry about compensation.\n\nI know people who had $15/hr internships making $200k+/year and others who had $25-50/hr internships (the gold standard when I was in college) making $100/year. Your internship compensation has almost no bearing on which company you join or how much you'll get paid full time.",
            "I use excel and alteryx lol. Just get experienced at something niche",
            "Top school, competitive programming, and high iq. Those three merged together",
            "I clock in at $125/hr. I work in the niche of automation. I create tools, processes, and systems that allow other engineers to focus on creating new customer facing products and features that directly increase revenue. \n\nInstead of trying to become a 10x better engineer, I put my efforts on making 100s of engineers twice(or more) as fast. And it pays. \n\nI went to a public state school, and I graduated in 2021.",
            "BSc CS + Stats top 100 university with scholarship\nFreelanced during college as a software engineer\nNo internships, didn’t even bother applying\nTried my own startup with a bunch of friends but it failed miserably\nImmediately got a job at a top big tech company upon graduating.\nMade pretty decent achievements at the big tech company, including cutting their cloud bill by a 7 figure sum per year.\nLater moved to HFT, worked at a few different HFTs.\n\nSkills: C#, Python, R, Kubernetes, Docker, Cloud, a little bit of SQL, C++, I used Java early on, Excel (be very good at it), VBA (gross I know).",
            "Trading so not cs but 2 trading internships 2 swe, multiple publications, t10 school math cs, extra curriculars, os class project",
            "What rankings are y’all using for schools here? USnews?",
            "10yrs exp. CMU MS. Always highest performer on the team. And yes that means extra hours sometimes. Was recruited to new companies by CTO, Director etc i used to work for. For me it was inventiveness. I want to problem solve everything. This doesn’t translate well to marriage lol.",
            "Went to a state University, worked as a support engineer, started doing build and release ci/cd work, moved in to distributed systems supporting hadoop, moved into Kafka. Worked really hard, and have been really fortunate to have had great management support for a lot of those years. You don't need to be a good programmer and you don't have to shell out to be in a top five school. Work hard, find something you're good at (no, not something you love), keep plugging, and be selfish about your career and don't expect anyone to give you anything.",
            "$300k TC is $150h. There are a lot of full time and independent contractor positions out there.",
            "Citadel, Jane Street, HRT",
            "For a full time job? Just a very standard 2-3 internships. For an internship? Math god",
            "[deleted]",
            "[deleted]",
            "I worked really hard to break into tech, worked hard after I got my first job and job hopped intelligently. I got there in 3 years.",
            "It has better grammar than what you’ve posted here, to be certain",
            "If I told you we'd be in competition",
            "* 10 years of experience\n* TS/SCI Full Scope\n\n^^^^^",
            "At current stock price, I’m making $210/hr, but +/- 40. \n\nResume just says T3 and C++, and at the time I got the job, said 2.5 years of exp.",
            "!remindme 24 months",
            "5th year f/o at Southwest, base is 164/hr guaranteed 75 hours a month. Join us in the skies. We need more pilots. Pay is good. Job is great.",
            "it looks pretty much like any other resume but with $100 per hour skillsets and history of performing those skillsets.",
            "Good question",
            "I make about that. iOS developer (Swift) at a SF-based startup, about 4-5 years experience",
            "I thought that I was nice with it for having 3 internships and going to a decent school, this whole thread just served as grind fuel lol",
            "!remindme 12 months",
            "Only kid I know to do it had 2 years at Amazon as an intern and goes to CMU",
            "If you combine everything, my comp will be over 200 an hour for next summer. Skills are I studied math and leetcode lmao",
            "Made that amount interning, turned down FT offer for more.\n\nWent to a top5 (within Canada) school, and did a lot of competitive programming. \n\nTBH for me it feels like luck more than anything. Previous employment was just at small no name startups, no impressive side projects or anything. In the interviews, I said \"I don't know\" a lot. If you roll the dice enough sometimes the stars align.",
            "$100 tc or base? I'm at ~$97 base so I guess I'm not qualified to answer.",
            "Usually has a nursing degree or experience.",
            "125/hr TC when I got hired.\n\nBarely T30 school, only class projects on resume. Transferred there from a not even T100/200 school after two years. Didn't do any coding before entering college.\n\n4.0 GPA, had two hackathon prizes that were kinda BS as one was due to my team being the only one using a certain company's API, and the other was a \"most entertaining\" award that we won by making a dating sim with humanized computer languages as heroines.\n\nDid pretty damn well on codesignal (841 on the old grading standard) and had a good interview.\n\nNo T5 school, no math olympiad or full on application / side projects. Above average grade for sure but everything else is attainable with effort, I feel.",
            "my boss was brown uni grad 8-10 years at google, he was 200$ per hour. so porbably half the experience",
            "I make 300k a year which I guess is $144 hourly… from following my dreams dammit… I work in ultra niche computer graphics programming, which apparently is important for robotics",
            "These comments...🥲",
            "take this as you will but i work on a salary not hourly and since i joined a fintech company im currently with id guess i probably work 4-6 hours on average per day and ive told my boss that and hes ok with it because i produce a shit ton relative to other engineers in the company. depending if you count total comp, i make in the range of $105-$170 per hour remotely in the midwest. I dont have a degree, went to college for 2 years and dropped out to start a business. after a year of that i got an offer by my current company. so about 2 years experience.  \n\n\nthe best advice i could give is to follow your interests/passions and hopefully those interests are lucrative. Id rather do something i love and not make much than do something i hate and make a lot more. luckily my interests lied in finance and blockchain which is a niche skillset that pays more.  \n\n\nas for my resume, i had to revise it dozens of times before it got attention. trust me, its all about presentation. And if you know your shit and you are really good at what you do (following your passion makes it easier to achieve this), all you need is to get past the recruiter and get to the knowledge/technical test and youll be set. my resume was filled with everything a normal resume would have and i said i quit college because of covid which was partially true. and i put my niche skillset items on a pedestal to show that i am adaptable. you dont wanna put shit that everyone else has as your highlights (like reactjs, javascript, html/css, etc.)\n\ni hope this helps and if you have any questions feel free to ask.",
            "As an engineering manager at a tech startup managing a machine learning engineering team. I make \\~$250-300k / year (\\~$125-150/hr) depending on bonus. This is probably pretty market for my type of position.\n\nSelf-taught programmer at a T50 school (although I did work at Jane Street right out of school). \\~4 years of experience at this point.",
            "man CS really is just all about the money now huh",
            "Just took a job in FAANG for ~$293k total comp. Went to a mid-tier school (state school not known for engineering but not bad), then had an internship at a mid-tier tech company my junior year. My senior year I just was grinding LC and got a lucky break to get into FAANG. First year TC was ~$110k, then transitioned after a year to somewhere making ~135k. Over the past 4 years that’s grown to ~$250k and I just accepted an offer going back to the original company for $293k. Once your foot is in the door with a large company it opens up a lot of opportunities that make the next steps easier and easier. My resume isn’t anything spectacular, minus the company names. One page with backend experience (primarily focused on SRE-type roles)."
        ]
    },
    {
        "post_id": "148iyil",
        "author": "JuZNyC",
        "title": "Personality matters",
        "url": "https://www.reddit.com/r/csMajors/comments/148iyil/personality_matters/",
        "score": 486,
        "num_comments": 117,
        "created_utc": 1686672602.0,
        "selftext": "The CEO of the company I just started at just told me I was picked because of my personality and after our interview they didn't even look at the remaining candidates. I don't know if that's a good or a bad thing, I don't want them to feel like they picked the wrong person just because I'm outgoing but it apparently has a big impact on me getting hired.",
        "permalink": "/r/csMajors/comments/148iyil/personality_matters/",
        "comments": [
            "I found that the more similar i was to the interviewer the more likely i passed. \n\nMatch their energy and if possible ask how their day and come off as relatable. If the interviewer is still and bored minimize small talk and help them get done early. If the interviewer is fake happy be fake happy.",
            "I was hired because of my personality. The person they were considering was very fucking skilled but he was awkward and his mom came with him to the interview. He was also very cocky.",
            "I'm still surprised that this has to be stated at all, to anyone. Of course it matters, only the \"ugh I am so annnxxious!\" angry basement dwelling anti-social weirdos are the ones that feel because they know python they shouldn't also have to work and interact with people on a team in a pleasant manner. \n\nYou have to be liked and personable, I don't care if you can program. How easy/pleasant is it to work with you.",
            "Honestly being a fairly social and charismatic person sometimes be having me hype to be in this field, because of the competition on that front is weak. As hell. When someone on here be posting that \"I can't get a job even though I've got this stacked resume of internships!\" I be thinking... \"you might just be an insufferable person and they could sniff that through the interview\".\n\nThey ain't pick a wrong person, cause the right person is whoever would do a good job, and that includes being a person the CEO and others doesn't mind being around day in day out. There is someone that gets picked for a job where they work with a team of people, maintain relations and communications on top of being technically proficient enough that you are able to pick up whatever tech stack they're working with. Maybe there was someone much more technically qualified than you, but that person was maybe a smelly ape. They didn't want to work with the smelly ape, so they picked you because you seemed like a good person to work with and competent enough to be taught.",
            " Yea I got my internship even though I didn’t do very well on the technical side of the interview. I got along great with the hiring managers and they basically told me and the other intern we got hired because we seemed like good fits for the team and our skills would be easily transferable with a bit of time.",
            "We’re humans, not robots. Very few products and systems of substance are built by one person in the dark, which means they’re built by teams of people. Personality and culture fit matters quite a bit in the exercise of making all those people work together effectively.",
            "This makes me feel so much better",
            "Don’t worry if you aren’t some crazy kid that’s been programming since they were in middle school. \n\nBeing able to connect with people, make them laugh, and set them at ease is by far what will take you from broke college student to earning big money. \n\nYour personality and how you take care of your body matters. Confidence can make or break you.",
            "This is how it works, everyone would rather have someone they get along with on the team with average skills then an insufferable genius.",
            "Yeah, most of the people they interview are competent engineers. But they need someone they can actually stand working with.",
            "CS nerds when they realise being socially awkward and doing 100 leetcodes a day isn't going to get you a job 😱😱😱",
            "This should be pretty obvious. Making people like you is a huge advantage",
            "I feel like all of us collectively in the tech world, needed to see this. This is proof that social skills do matter. Thank you for sharing, OP. Definitely saving this for when I graduate.",
            "What do you do if you’re both socially awkward and stupid?",
            "I literally got through the phone screen of a big tech company because I was a fan of RedBull Racing - it bodes well to have a personality more than just being a leetcode monkey",
            "You crossed the finish line first and still doubt that you didn't run as fast to win. \n\nWake up, jobs are given by employers to candidates who check the right boxes of their requirements. At this moment you are just a square peg fitting in a square hole. \n\nAs for the self doubt, don't worry life will give you umpteen situations to do that.",
            "If you look like the interviewer and act like the interviewer, your odds increase pretty dramatically. The more relatable you are, the better chances you have. Unfortunately this causes hiring biases, but whatever, that’s how we live.",
            "Does the CEO have a tech background? If they have some experience it could be they see the ability for you to grow into the role, talent or not.",
            "We had a dude who joined our team that had a crap ton of experience, but was let go because his ego wouldn't get out of his way. On top of that he was pretty arrogant and sexist. While this is an extreme example, personality is huge when it comes to fitting in with a companies culture. Especially if its on a team that meets with clients.",
            "Personality is such a BS arbitrary indicator. So anti-meritocratic.",
            "CEO's tend to be outgoing and tend to hire people exactly like them. Coincidentally that also has nothing to do with one's ability to perform tech roles.\n\nAnd this is why CEO's are usually excluded from interviews for technical people, at all but the highest level. The average CEO knows as much about hiring tech people as choosing ERP architecture.",
            "there are other factors as well. personality just doesnt' cut it, stop spreading this falsehood.",
            "Are you female cause that sounds like an HR issue",
            "This is a very very very unfortunate reality.",
            "[deleted]",
            "Very surprised it has to be stated but of course it matters!\n\nWhen hiring someone, you are hiring a future colleague you will probably spend a lot of time working with everyday. So it's your best interest to pick someone you will enjoy working with. When it comes to interns and new grads, the gap between school and enterprise is so huge that hard skills don't matter really much. Instead the openness would bring much more value.",
            "Getting along with people at all levels, being easy to work with, and working seamlessly in a group is even more important than technical knowledge or education in many circumstances",
            "Appreciate their honesty",
            "Seems like every time I got a gig on upwork was simply because I lived in the US and spoke fluent English. Also because full stack TS.",
            "See it as a good thing--the vast majority of tech workers are emotional brick walls and really have no developed ability to interact with people in what one would consider a \"normal\" fashion.",
            "Interpersonal skills are pretty low in tech. I feel I have strong personal skills and ok tech skills but I have found success landing jobs because of it. My bosses tend to put me on team projects with external teams to help bridge the gap between teams. I work in cybersecurity currently"
        ]
    },
    {
        "post_id": "13l7qtp",
        "author": "break-dane",
        "title": "something i have noticed",
        "url": "https://www.reddit.com/r/csMajors/comments/13l7qtp/something_i_have_noticed/",
        "score": 488,
        "num_comments": 58,
        "created_utc": 1684436701.0,
        "selftext": "I noticed in group projects at my university, students that would work hard and produce results for the team, generally ended up getting jobs rather quickly after graduating. almost every student that gave minimal effort on group projects, are still looking for jobs to this day. I graduated a month ago, and the classmates i speak of have graduated between 2022 - now. People don’t realize how beneficial these projects are towards landing a job. having a final product to share during an interview and being able to speak for 5+ minutes about your contributions goes a long way.",
        "permalink": "/r/csMajors/comments/13l7qtp/something_i_have_noticed/",
        "comments": [
            "Good idea. If we trick people into believing this then we can coast on group projects more easily.",
            "I don’t think it’s the project themselves that are beneficial and getting these people jobs. Just a correlation.\n\nIt’s that they’re applying the same motivation, care and focus on their job search and prep. and that it comes through in their interviews. They’re better candidates because they work harder in general.",
            "I generally carried my groups and am still looking. Honestly my group projects can be hard to talk about because they want to know about the teamwork but meanwhile at times I couldn't even get my teammates to respond to an email let alone contribute in any meaningful way.",
            "Anecdotally, I left school with a similar impression. Myself and another student did almost everything for every group projects our junior and senior years. We both ended up working for same company after graduation. One of our other group members who was consistently the do-nothing was working at subway the last time I was in my hometown. It was awkward to order a sub from a peer i was in college with. Not that there’s anything wrong at all with service industry jobs but since he was also in school for CS I can’t imagine things worked out the way he had planned.",
            "Dont think its projects helping them land jobs. More like a more driven competent person is more likely to land a job etc is also more likely to put effort into these projects",
            "it’s not the project. it’s that those individuals actually have more self awareness and initiative to not only start their job search early but make themselves employable through other means. that little bit of project work is nothing on them.",
            "Anecdotal evidence is anecdotal evidence. Not every project is beneficial for jobs. I would say most are not and to think they are is quite naive or your major just has projects that are similar to jobs?\n\nEither way I know plenty of “coasters” in projects and plenty of “hard workers” and there isn’t a correlation to employment. This is for CS.",
            "That’s encouraging! Anecdotally, I’m always the primary contributor/leader in my group projects and I got a faang internship this summer. We’ll see how those projects translate into my ability to actually do the job though.",
            "Lol no employer ever asked about my schoolwork, either individual or group. I did my capstone project and later interviewed at the place where I did it, and tried to bring it up but the hiring team was disinterested and I didn't get the job.",
            "Quite funny because my friends in college we shared a place:\n\n - One of them only started their dissertation and picked a tutor after like 5 final notice emails\n\n - One of them cheated in an exam and forgot to even open the paper before submitting their answers\n\n - One of them would get just about passing grades\n\n - None of them showed up to a single lecture and just studied off the notes at the end of the year\n\nWe woke up at 10pm and smoked weed and watched tv shows\n\n2 are HFT one is FAANG 2 are in Fintech. 6 figure average TC",
            "People underestimate just how *many* people with a CS degree end up not working in this field as they can't find a job afterwards.\n\nThis isn't uncommon at all.",
            "It’s not just the project…or the experience…it’s the difference between having a strong work ethic or not.",
            "I would theorize that it's just as likely that those who have motivation to do well, in this case completing a group project, are more likely to succeed in general.",
            "Hiring manager / interviewer perspective:\nWhen I walk into an interview with a new candidate, I have one huge goal — figure out whether this person is the one in a group who works or the one who coasts. I dont care if you have an incredible resume with 50 projects on it. I will ask questions about them and it becomes very obvious whether you were engaged in that work or not. I can’t tell you how often a candidate has something like a game on their resume and can’t even explain the basics of it or articulate what they did or how they did it. Don’t tell me you were in charge of inventory on your Minecraft clone and then you can’t tell me anything about the item types, data structures, etc that you used or any problems you encountered and had to solve.\n\nThe coasters are weeded out because they have no idea what the people actually completing these projects did and they can’t fake it.",
            "I wasn't the leader in my first pair programming project since the guy already had a job for the past 3 years with that language. but man was it nice when I saw I'm keeping up with him and learning about new features we didn't learn yet from him. When we argued on why we weren't passing a test and then I just asked to make the changes to show him I'm right, and it working then explaining what I thought the issue was better after having actually implementing it and my thoughts being clearer, that's the moment my mini impostor syndrome was gone and I knew I was actually keeping up with him. \n\nAlso, we were both REALLY satisfied with our code at the end of that. it was really clean and organized and there were no particular notable inefficiencies we had to compromise on.",
            "I always ask to work alone. I’m not putting other names on my work since I always end up doing 90% anyways.",
            "Not at all they just started applying earlier lol",
            "or you can be like one of my friends who copied all of his projects from github, got good at leetcode, spent the rest of his time partying and fucking bitches, and still landed a FAANG internship his freshman year. The dude has it all. Lucky bastard.",
            "I'm thinking, people who worked hard in a group probably grind leetcode hard, too. And people who are lazy, probably are not.  So it makes sense that hard workers with more honed skills get the job.",
            "For many people I know, it's the opposite. They put minimal effort on group projects, so that they can spend all their effort on leetcode, job search, interview preparation, internships/co-ops, etc. They got jobs much sooner than those people who spends a lot of time on group projects.",
            "in it most, if not all, people who could solve projects singlehandedly were just already experienced.",
            "I've always been in the former hardworking category but for one assignment project involving stack traces and buffer overflows I was a backbencher who just went along for the ride. It hurt my confidence for quite a while and made me avoid applying for C++ jobs after graduation even though I'm decent at it.",
            "Every group project I've ever had follows the Pareto principle in team member contributions: 20% of the team contributes 80% of the output, while the other 80% subdivides the remaining 20%. Hell, my capstone project last semester had 2 levels of Pareto: I did 80%, 20% done by the other 2 team members. Of that 20%, one of them probably did 80% of it lol giving a work distribution of 80%, 16%, and 4%...but hey, we got an A",
            "Just venting on a pair programming assignment I had:\n\nI had a pair programming project and some girl that approached me before offered to join when I asked in the course group so I agreed. \n\nThe project was making a small game and 4 algorithm questions with recursion. \n\nI told her I wanted to start together so we're on the same page but she never showed up making excuses that she doesn't have time because of other courses. Lo and behold we're 3 days before the submission date and didn't even start.\n\nSo I gave her 2 of the algorithm questions and asked her to do them. I did the other 2 made sure they passed tests and started working on the game. \n\n2 days later she gives me her solution I explicitly ask her how it went and if they pass the basic tests and more advanced tests that were shared in the forum. She reassures me that she got help from someone and that it went well and passed all the tests. So I move on and continue working on the game to finish it cuz at this point it would take longer to explain to her what's I'm doing than finishing it on my own. \n\nSo I finish the game with 30 minutes away from submission and submit all the exercises including hers. (Which runs the basic tests automatically) and her solutions DONT FUCKING PASS THE BASIC ONES. \n\nI was dead tired at that point and wasn't in a state to do recursion questions but I push through and finish the first but slightly after the deadline which means it was for nothing cuz there are big penalties on late submissions. \n\nThat was so infuriating, why would she fucking LIE to me about them passing and even reassuring me that she got help so it will pass the more advanced tests.",
            "It is more so a reflection of the person's work ethic and determination to land a job.",
            "Idk if this is true, in most of my projects only 1 person was ever lazy, and yet still most of us don't have jobs...",
            "A surprising amount of CS majors seem to dislike programming. If you dislike programming you’re not gonna work on projects and you’re gonna have a harder time getting a job. For better or worse it’s pretty apparent when someone actually enjoys programming in interviews.",
            "so the people who work hard to build software end up being the ones who get paid to build software…?",
            "It’s true, only the rock stars get great jobs. You have to bring something to the table, those students bring nothing but extra complexity."
        ]
    },
    {
        "post_id": "v1bxjg",
        "author": "DesperateSuperFan",
        "title": "Based on my experience and observation Sociable students got much better jobs than socially awkward students.",
        "url": "https://www.reddit.com/r/csMajors/comments/v1bxjg/based_on_my_experience_and_observation_sociable/",
        "score": 485,
        "num_comments": 79,
        "created_utc": 1653950744.0,
        "selftext": "CS majors tend to be introvert. But there were few extravert students. These students usually get better job(like FAANG ones or FANNG tier Soft ware engineer jobs) than introvert students who are better at  extravert students at grade/programing skills. So one of keys to get a great engineer job is trying to be as sociable as possible.",
        "permalink": "/r/csMajors/comments/v1bxjg/based_on_my_experience_and_observation_sociable/",
        "comments": [
            "This reads like someone who is trying to deconstruct the mysteries of being a human lol.",
            "[deleted]",
            "Correct me if I’m wrong, but I’m guessing what you mean to say is that students who seem to have good social skills tend to get better jobs. If so, I don’t think that comes as a surprise. A significant part of landing a good job is sticking the interview, which requires them to express their thoughts eloquently and present themselves pleasantly.",
            "Introversion means interacting with people drains your energy. It doesn't mean you don't like interaction.",
            "Social skills are extremely underrated in CS. They have been for the past decade. That's why, as a lazy person, I focus on them. It's one of the lowest-effort ways to beat the competition.",
            "Well yea. To get a job you have to interview… with a person. And a lot of ecs involve social interaction. I’m positive that the fact that my conversations with my interviewers went so well was why I got the job. Like yea the coding was a huge part but conversations help you stand out.",
            "I think that saying that most CS students are introverts is a lame ass excuse. People will self-identify as introverts because it makes them feel better about their lack of social skills. I doubt that this is a minority population among 'introverted' CS students, especially as it becomes easier and easier to avoid normal social interaction thanks to modern infrastructure and technology. \n\nIt's obviously important to be able to communicate professionally and work with others, because software systems are so large that it's rare for one person to have the time and skills to create a product on their own. This effect is magnified in large companies, where the systems have been build by tens or hundreds of thousands of people. \n\nI agree with OP; learning to communicate and be more social is the most important skill for getting hired, especially for more junior positions (and the people with poor social skills in senior roles are either geniuses or very lucky).",
            "Best tip I was given: interviews are basically a vibe check.",
            "I think being attractive helps a lot.",
            "Unless you found the perfect job working all by yourself from your home, being able to interact with others is very important. It’s much easier to teach people the skills needed for the job, than it is to teach someone how to interact with people. 10/10 most people would rather work with someone that isn’t as good technically but gets along better in the office environment.\n\nYou may not like it, but that’s how it is. It pays to know people, it’s a harsh reality of the corporate world.",
            "There’s definitely a baseline of hard skills you’ll absolutely need, but you cannot operate in a bubble. It isn’t going to work.",
            "There are a ton of people who are way smarter than me in my program; people who took physics 1 and 2 and calc 1-3 in high school and nailed those classes. However, as a tradeoff for the time they put into purely studying, most of these guys never played sports and never developed the ability to work with others. I am one of the few people who ended up getting an internship this summer and I've already nailed next summer down through connecting with  recruiter in person.",
            "People have shot me down here many times for pointing this out.  Be someone you'd enjoy working with all day every day.  Get good with your conversational and interview skills.  It helps.",
            "introvert != socially awkward",
            "I mean, good interviewers do better in interviews. Yeah.",
            "It goes beyond the entry level job. Being sociable and proactive will lead to faster promos, management which in turn other companies will poach you. You never have to worry about job again. \n\nWith grain of salt, you are a decent coder. I was one of 3 first year hires out of like 20 to get promoted under my VP. The thing is I graduated ug in 3 years while likely the others promoted where masters or definitely older. What I did was I spoke to every engineering manger and my bosses boss and build good relationships with 3/4 of them. I went out of my way to communicate and share personal adventures and trips I did during covid to Grand Canyon and Alaska. I thanked them for their time. I took on their programming tasks while over delivering on mine. I *questioned* why they did things. I spoke out loud in calls with vps and senior VPs. They will not remember my name but always remember my question. So yes become more human. Go out of your way to convey, connect and collaborate. You will succeed. My base bumped from 106 to 155 without even negotiating. \n\nI have more stories like during hackthons. But thats for another day. I have a program for more well rounded tips and how you can get good at communicating over 2-min pitches after solve weekly eng projects given by Directors of product at google, etc. dm for discord",
            "This is damn near any professional setting, not just CS. Easiest way to explain it: a personable individual who can sell themselves well will beat out some mumbling, fumbling individual who has the personality of a dead fish.",
            "I was banking on the idea that I could make up for a bit of my coding skills with my personality lol",
            "Maybe somewhat true up till FAANG but definitely not quant. My quant friends awkward AF but if you have IMO medals who cares",
            "Consider introverts versus extraverts applying for jobs. I often recommend not applying online and instead trying to get connected with a human recruiter.\n\nAn introverted student says, \"oh, I don't know anyone at the company. I'll just apply online.\" The introverted student's resume never gets seen by anyone and ends up in a digital trashbin of applications.\n\nAn extraverted student asks their friend to connect them with their friend who knows the recruiter. The extravert gets the recruiter's email, reaches out with an interesting intro, and gets a conversation started. And that's more likely to lead to an interview. Or they ask a ton of friends and even random acquaintances to put them into a ton of companies' referral systems.\n\nI've seen it in action, where extraverted people with lower GPAs, and worse technical skills get ahead of highly technical introverted people. By networking and reaching the right people, the extraverts \"get ahead of the line\" - and of course, in US culture, they win by going the extra mile on the personal level.",
            "You can have a social skill and be introverted. Vice versa, you can be extroverted and have no social skill.",
            "Something that shocked me was how social this job is. I always thought programmers were 1 man armies who were left alone and they just produced neat stuff. \n\nNoooope. Time for our sprint retro, to go over all the daily sprints, which take place after all the design meetings, sub groups, and dozen little calls or interactions a day from everyone from the PM to CTO to build ... anything. Like goddamn, it's extremely social.",
            ">like FAANG ones or FANNG tier Soft ware engineer jobs\n\nwdym? Hella introverts get this shit. I wouldn't mark this as some god tier standard.",
            "Thanks for pointing out the obvious. To this day I treat it as a hobby or leetcode thing. Always improving this aspect of myself.",
            "You can’t expect companies to overlook this. Nobody wants to work with asocial people, especially asocial people. Team dynamics and motivating each other is a real thing. I’ve worked with such people and it is a nightmare. They can’t even take a joke. They get angry and frustrated easily. They are not easy-going. Nobody wants that. \n\nFor CS jobs:\n\naverage CS skills + average communication > great CS skills + shit communication",
            "Yeah this is true. The interviews i cracked i was totally being over the top social (as i would put it), talking to interviewers and cracking a few corporate-appropriate jokes. It's important to not overdo it but so very important to not give one word dismissive answers when asked questions.",
            "This! Although I don’t consider myself the best programmer I always get through my interviews cause I can keep a good conversation and even make them laugh. Gotta keep in mind they want someone they want to work with so if you sound enthusiastic and fun they’d rather have that than someone who has the technical skill but lacks social skills and by that I mean how you deliver yourself as a person and how your personality can contribute to the team as well.",
            "Makes me wonder if the obsession over LeetCode style interview results is to distract people from admitting that that maybe wasn't the portion they actually \"failed\"... Soft skills aren't as easy to grade, and it's easy to write off as nebulous and subjective when it's really an important thing.",
            "CS students tend to lack soft skills and they don't really care to change that lol. I'm 100% certain that my ability to \\*appear\\* social and engaging has propelled me towards opportunities my peers were more deserving of. The funny thing is I feel like once you enter the workforce, many programmers and teams tend to be incredibly social and warm people?",
            "tbh i do not fully agree. I have met a lot of people who are very outgoing in my college but they just end up partying all day and not pay attention to getting a job or even leetcode. I think if you put everything else the same, like same motivation, drive, skill level and etc, then perhaps very sociable people are more successful. But at the same time, I also do find more sociable people tend to not care about getting better jobs as much",
            "Sometimes I wonder if these posts are made by real people or not. They just sound like a bot talking. Who would've ever guessed that being sociable betters your chances of landing a good job?",
            "[deleted]",
            "We know lol. Being yourself can make you homeless or not.",
            "You don't have to be the life of the party but you need to be able to communicate EFFECTIVELY. Part of getting good jobs means being part of a team and knowing how to work well with your peers. This is team sports 101. Good teams know how to lean on each other, resulting in a team that is greater than the sum of it's parts. This is what makes those teams so great. You can be an introvert and still learn how to be a great team member. You aren't supposed to speak incessantly, just communicate thoughts and ideas. That is what you are being paid for.",
            "This is the unfortunate truth.  I know someone that was illiterate up to a later age (late teens I think) that makes maybe $100k a year running a chain of restaurants, and it's all because he knows how to work people (manipulate/charm).  Then there are people that are very smart but so socially awkward that they are unemployed (due to stuff like anxiety).  I fall in the socially awkward category so don't make much money (I'm not in computer science) but a lot of it literally has to do with how you interact with people.",
            "Facts, gotta have good people skills"
        ]
    },
    {
        "post_id": "134is9v",
        "author": "Fatefulwall7",
        "title": "I fucking hate fucking school",
        "url": "https://www.reddit.com/r/csMajors/comments/134is9v/i_fucking_hate_fucking_school/",
        "score": 490,
        "num_comments": 205,
        "created_utc": 1682937316.0,
        "selftext": "Im going into my senior year and I’m so tired of this shit. My algorithms class honestly just feels like a toxic sweat fest designed to tear down the student’s mental health and moral. My instructor assigned a very difficult project a week before finals week (due on a fucking Saturday) and then started talking about his expectations and how difficult the final is going to be one day before the project was due. Algorithms should be an interesting and fun experience, but I feel like schools just get off on making it miserable for us and it honestly just makes me hate coding.",
        "permalink": "/r/csMajors/comments/134is9v/i_fucking_hate_fucking_school/",
        "comments": [
            "[removed]",
            "Used to love coding. had a passion. University took all of it away.  \n\nI asked one of my professor why and they gave such unreasonable amount of work.\n\n the bullshit answer was given of course... \"in the real world bla bla bla...\". Like bitch fuck you.  You don't have to write 1500 lines of code in a week.  Can't ask for help from peers.  Oh and don't use any library that will make it easier.  Fuck you.  Fuck cs.  Fuck university. \n\nI'm in senior year and I'm constantly asking wtf I'm still doing this bullshit.",
            "😂😂😂  Wait until you get to the real world and have to deal with Agile.  You think professors are bad, wait until you have a Scrum Master.",
            "I’m with you. Especially since I’ve had a job offer since December I have had very little motivation. \n\nI have 72 more hours until I’m finally done with it all, a double major in computer science and audio engineering technology, and my algorithms final is in 3 hours. I’m ready for it to be done, so ready.",
            "I don't know man, I would like to be in fucking school.",
            "If your school algorithms is a misery, wait till you meet algorithms in job interviews",
            "You probably don’t want to hear this but when you get older you realize any hardship is literally a fraction of your life and you will forget about it very soon, you can drop out and work at McDonald’s for minimum wage if you’d prefer, or you can suck it up, remember that millions of people have been in the same position, and think about that 6 figure job you can have in 4-5 years.",
            "Sorry you’re having to deal with that. \n\nI’ve worked as a software engineer for a higher education company and have had to work with a lot of university professors. \n\nSome of them are lovely people. A lot of them are fine. A few are absolute twat waffles that enjoy shitting on people and making their lives miserable. Sounds like yours is one of the latter. \n\nSlog through it though. I’ve enjoyed being in the workforce (mostly). It’s VERY different from school IMO. Sometimes I’ve had to crap out 1500 likes of code in a couple of days and others I’ve done like 10 lines in a week. \n\nIt just depends on the situation and the company you work for. \n\nI don’t think university really prepares you beyond the technical skills. There are a ton of other soft skills that you’ll pick up, and you’ll see that universities just cannot replicate the real world super well although not for lack of trying.",
            "Yeah school sucks lol. Need a drastic overhaul to the system",
            "School is hard but come on. Just get it over with.",
            "I love my cs courses, but WHY TF DO I need to spend thousands to go learn about art and certain history. Like ppl say “To GeT GoOd OvErRaLl KnoWlEdgE”. Like no bro, I ain’t gonna remember this shit two weeks after the semester is done. School could be so much cheaper if we didn’t require the bullshit general courses.",
            "Oh buddy. If you think school is hard and boring, I have bad news for you.",
            "Omg I feel you so hard. My algorithms midterm is today and I've been studying for days but will still need to stay up until 7 AM studying tonight since there is a shit ton of content to cover and we're not allowed a cheatsheet :/",
            "Unfortunately school is the only thing I can fuck.",
            "https://preview.redd.it/jfeyogefjaxa1.jpeg?width=1200&format=pjpg&auto=webp&s=1ef80a0cd19803443aa10fc034535492230ed660\n\nSums up your situation",
            "The reason why I left cs",
            "Don’t go to college. Go to a trade school and become a welder, mechanic or plumber.",
            "Hey, I graduated and it's totally worth it after you get that first job. Keep with it. I get it, I hate school too. Never liked it. But just get the degree and move on with your life. You never have to go back if you don't want to. \n\nPeople act like a full time job is worse, but I've been working for 15 yrs and I'd take a full time job anyday over school.  I always hated school but did what I had to do.",
            "There's a school for fucking?? Wtf. Why didn't anyone tell me about this",
            "Don't fuck then. Try studying",
            "I also don’t like having intercourse with school",
            "Just wait until you start working professionally lol. 24/7 on-call weeks.",
            "If you hate impossible deadlines you’re not going to have a good time after school.",
            "Ah, college students talking about how things “should” be.",
            "Blame the system. Most teachers/professors, once they are tenured, suddenly \"stop teaching\" because they know they can't get fired for being a bad teacher. I've honestly had a few good professors, but most of them were volunteering to teach, out of enjoyment, rather than doing it for a living.",
            "Welcome to college. U'll get paid a lot when u graduate. Risk and reward. Give and take. Your choice your decisions. Not gonna sugar coat it. You chose to do it.",
            "Algorithms was easy for me.",
            "Sounds like you suck at Computer Science, and you are just blaming it at school (classic dude who just got into the field for the money)\n\nI graduated first class and CS was just a breeze",
            "Well, stop fucking it then.",
            "I totally understand where you are coming from but i implore you to look beyond this. I'd say, i would LOVE it to be where you are at right now. I know it fucking sucks to be in your position today but i BET that once you graduate, youll see that life was a LOT easier back in school. I too have to put up with similar situations such as the one you presented but in the workplace. My boss sucks, his skills are OUTDATED but he micromanages the HELL out of me and demands to get things done within 24-48 hrs for big projects. He is extremely condescending.\n\nI would LOVE to get up and take another class or job but i have bills to pay and given the current economy I cant do that. Sucky school days prepare you for what's ahead and i dont mean to dismiss what you're going through but, at worse, you're going through medium mode. When you have a job, you're playing hard mode. Keep it up and keep grinding. Take it as a lesson learned.  \n\n\nAlso, dont get me wrong. Life does suck but there's a big chance that you'll land an awesome manager who will build you and appreciate all your work. It's not impossible to find that person/mentor. I'd say your professor is just a \"Boss\" you need to defeat for now.",
            "God you gave me flashbacks to failing it once. Exactly the same situation 70% exam score 30% insane algorithm projects. Nothing about it was realistic. I hope the best for you don’t give up and try your best always!",
            "I 100% understand your frustration. My senior year, I was burnt out as hell and my mental health was seriously suffering. I got through it tho. Many people like me did as well, and so will you.",
            "Wait until you meet product owners.",
            "Stop fucking your school, that doesn't seem appropriate.\n\n&#x200B;\n\n&#x200B;\n\n/j",
            "Then don't fuck it -_-",
            "University is one of the most effective means to kill a passion for building things with code. Try to not let it get to your head to much and push through. The workforce is so so much better. I love my job, I absolutely hate school.",
            "A friend of mine failed an assignment for 2 minor errors, despite all her code working. One of them was including the header for boolean in C. I forget the other but it was just as lame.",
            "Good (or bad depending how you see it) news:  in about a year, none of it will matter",
            "Just sounds like a shit teacher with a terrible strategy. As a student you are a kind of prisoner. Even companies can do this kind of shit. I hated school at times. I have hated jobs at times. don't let the bastards get you down. You can't or shouldn't quit school near the end, but once you have a few years of exp. you can raise issues of poor treatment and get another job. Hang in there.",
            "I agree what made the assignment difficult? Number of pages?",
            "That’s why most cs and tech ppl drop out/choose a more non-traditional career path than others. In fact, I would bet on the collapse of traditional education in the next 6-10 years, Iand would be seriously surprised and disappointed if that would not be the case. No such system should persist that long (too inefficient, too expensive, little added value for self-taught ppl, discriminatory, very bureaucratic, and extremely time consuming).",
            "School is hard. That’s why I double major in CS and Media Communications just in case if I don’t want to be a software engineer. Now I work as a developer.",
            "I feel university much more focus on academic integrity than learning efficiency. Cheatings are bad. But, unnecessary restrictions are also bad. \n\nSometimes, academic integrity rules reduce the efficiency of learning and coding skills and sometimes unnecessary. It makes us more worried about making sure that we are not accidentally making too similar code/logic to other codes than making the most efficient solution or better code.",
            "I wouldn't say work is \"easier\", but it's hell of a lot more manageable. School is a ridiculous gatekeeping shit show. I hate professors, they don't usually aren't even engineers. \n\nIt benefits the company *usually* to keep their employees mental health in check, and make sure they don't overwork. It is definitely hard but I have an actual life now...and I get paid.",
            "I miss school years where my only responsibilities were doing homework, learning and not worrying about paying debts",
            "It's basically a math class disguised as a cs class. IDK how people do it without actually just moonlighting as math majors, it's weird to jump into proofwriting like that. I don't know what your algorithms class looks like but mine was 80% graph theory, it may or may not be useful to look at supplemental online resources to get comfortable writing proofs related to djikstra's algorithm etc etc",
            "If you hate fucking school dont fuck it",
            ">moral\n\nThe spelling you're wanting here is 'morale'.\n\nAnd yes, college is, by definition, a hazing. This is what it's for. If it was just casual and fun, then employers wouldn't place any stock in the degree to begin with.\n\nThe ability to gut out a difficult task correctly on a short deadline is, 100% what your employers are looking for when you enter the workforce. Because **BELIEVE ME**, it will be asked of you. Someone is going to hand you a burning-hot problem which needs to get fixed *right now*, and every hour you're not fixing it, the company is losing tens if not hundreds of thousands of dollars.\n\nLook, I'm not going to tell you it's fair (it isn't), or that it's justified (it isn't), but what you're really trying to get out of this is a leg up on your competition when it comes time to apply for work. Just gut it out, and look forward to dealing with real problems, instead of made-up ones.",
            "It's not just you that hates CS school.",
            "Wait till you're out of University and your director gives you five number one priorities and you have to figure out which one is actually number one and finish all of them by next week",
            "Don’t listen to the students who say rate my professor isn’t representative of a teacher. Those bad reviews are there for a reason. I’ve managed to avoid bad teachers by consistently making sure I get one with decent reviews.",
            "Not that it’s much help for you at this point, but I’ve found a lot of success with doing side projects. It helps me stay engaged and passionate because I’m doing something fun and it also builds my skills a lot faster than school would because it’s hands on and you can iterate through versions as fast as you need and want to. \n\nThe dual purpose of this is that you’ll end up in a position from absorbing all of this info on your own that school is only just filling in the gaps of what you already know. And you’re a much more proficient coder and you can write those 1500 lines of code for the week in a much shorter time. \n\nTo maybe you or to anyone else in a similar situation: the solution isn’t to give yourself rest and time to recover, but to double down over your breaks and try to learn more and get ahead of the curve. Homework goes a lot faster and school is a lot easier when you have a wider base of knowledge.\n\nCS is hard as hell and I know it’s a lot of work right now. The only way to beat the thing is to fight it when it’s not already beating you up and that means doing a ton of extracurricular stuff during breaks.",
            "Paying to program is hard to justify, but once the role is flopped and you are *paid* to program, it all gets better. You're also able to work on what you want outside of work which can really bring the excitement back. Everything gets better after graduation.\n\nSource: recent graduate.",
            "Just wait til you start interviewing. I hope you like writing code on whiteboards and comparing the size of your algorithm schlong with that of your interviewer's. As if they don't go right back to their desk and Google shit they forgot or don't know yet.",
            "You’re not alone.",
            "Did you know i work about the same number of hours you have to go to school but i dont have homework or tests",
            "How would you fuck a school?",
            "no tear down = fail ADS\ntear down = also fail but u learn smth",
            "Well don't fuck school then...",
            "Don't mind me asking, but which country and state is this in? I'm currently looking for schools to do my degree and trying to avoid schools which places too much unecessary stress and pressure on their student. \n\nI want a decent work-life balance in my career life and would like to attend schools which promote decent study-life balance since burnout is always bad for health and unsustainable long term. So, I would like to avoid it whenever possible.",
            "It will benefit you in the future your still young so you don't understand. When you get to the real world the didn't you miss or the stuff you forget will get you fired you won't fail a grade so take it as a blessing in disguise",
            "What's the task for the project?",
            "You shouldn’t do things just because they are fun. You need to work your brain to do things even if you don’t want to, even if they are not “fun”. That’s the tip for you. If you think this is hard, your colleagues think it too. You can work together with people to do it. \nAnd yeah, I’m not saying isn’t going to be hard, it is. But keep on trying, it’s going to click sometime!",
            "I am on my last generals now I feel you. I feel like I am babysitting the class just no motivation right now for anything but programming",
            "yes. It is there to tear you down and make you want to quit. That is the intention for classes like DSA that are weed out classes. Don't get weeded",
            "Agreed. I can’t wait to graduate. Unfortunately I still have one year left.",
            "Fuck school! Fuck all this bullshit what the fuck! \n*slams textbook closed",
            "I agree my school is ass"
        ]
    },
    {
        "post_id": "12tldjp",
        "author": "Urtechdaddy",
        "title": "A 1.6 billion dollar in Valuation, $50+ million in revenue and still can’t pay an intern?",
        "url": "https://www.reddit.com/r/csMajors/comments/12tldjp/a_16_billion_dollar_in_valuation_50_million_in/",
        "score": 485,
        "num_comments": 52,
        "created_utc": 1682038967.0,
        "selftext": "https://jobs.lever.co/truepill/ed80836b-6d98-4462-9864-d0bf48236f68\n\nI understand that there’s a recession looming over the industry but a company this size should be able to pay at-least  minimum wage. They probably spent more money on the job post than what would’ve cost them to pay an intern.",
        "permalink": "/r/csMajors/comments/12tldjp/a_16_billion_dollar_in_valuation_50_million_in/",
        "comments": [
            "good call out. holy shit they should be paying their interns at their tier. they’re not even a startup anymore, they got bought out or something.",
            "> Truepill is unable to hire within the following states: Alaska, Arkansas, Delaware, Hawaii, Idaho, Indiana, Iowa, Kansas, Kentucky, Louisiana, Maine, Maryland, Mississippi, Montana, Nebraska, New Hampshire, New Mexico, North Dakota, Oklahoma, Oregon, Rhode Island, South Dakota, Utah, Vermont, Washington DC, West Virginia, Wisconsin, Wyoming\n\nThese must be all the states that don't allow exploitative unpaid tax-dodging internships.",
            "[deleted]",
            "Don’t work there regardless. I know quite a few that got laid off from there and management just lies nonstop. One day they had money, the next they cut half the company lol",
            "[deleted]",
            "We need more posts like this",
            "If they can't afford to pay interns, they shouldn't be trying to find an intern. This is just a whole new level of greed.",
            "[deleted]",
            "This isn’t even as bad as I’ve ever seen. I saw an unpaid internship position that required 5 years of experience lmaooo. But this is insane truly",
            "good call out. This is nothing but corporate greed",
            "Apparently they did [four](https://techcrunch.com/2022/09/29/truepill-a-digital-health-unicorn-conducts-fourth-round-of-layoffs-in-2022) rounds of layoffs in 2022 (!!). Not a good optics of the company I suppose...",
            "They spent their money on virtue signaling.",
            "You don’t want to work here anyway.\nThey just did a bunch of massive layoffs. (Probably why they’re not paying interns anymore 😒) \n\nAnd they’d probably work you to the bone. My friend who was laid off from here was putting in 60hr+ weeks.",
            "[deleted]",
            "Unpaid internship > no internship. Sucks, but I'd rather eat someone else's lunch. If it's unpaid you also get to demand that your work is much more educational vs grunt work",
            "How do you think they're making all that revenue?\nRemember, people and companies get rich by not sharing :^)",
            "You’re paid in experience. CS is spoiled thinking every internship needs to pay well, but in reality, most internships outside of CS, finance, and engineering are unpaid.",
            "It's not about what they can afford, it's about what you're willing to accept. A degree is good for getting a first job, but an internship is even better. I've known a lot of CS majors who would willingly take an unpaid internship to pad their resume. I don't think it's right, but there are some CS students out there who are this desperate",
            "It's not that they can't pay, but the job market currently favors employers so they have a surplus of applicants willing to work for free. At this point it's just simple math free interns are cheaper than paid interns.",
            "Things like \"not paying interns\" are how they got to that revenue/valuation. When you care about the number more than people, you can make the number very big."
        ]
    },
    {
        "post_id": "zuqtsr",
        "author": "Orangebird1",
        "title": "Advice on picking up a minor?",
        "url": "https://www.reddit.com/r/csMajors/comments/zuqtsr/advice_on_picking_up_a_minor/",
        "score": 486,
        "num_comments": 114,
        "created_utc": 1671943635.0,
        "selftext": "hey guys, I’m a 20 year old male college student and I’ve really been thinking about getting a minor. There’s a background check and I’m not sure if it’s worth the effort or if I should I should just get one from a local community college instead (I heard minors are easier to get there). For anyone who’s picked up a minor before, did it benefit your life/career in any way or did you do it just to kill time?\n\nEdit: just to clarify, I mean declaring my intent to get a minor with my degree\n\nEdit2: why do people think I’m talking about children\n\nEdit3: I am not a pedophile, just a curious college student who wants to learn\n\nEdit4: despite all the troll comments I want to sincerely thank everyone who encouraged me to pursue a minor 😀. will be talking to my advisor when I can",
        "permalink": "/r/csMajors/comments/zuqtsr/advice_on_picking_up_a_minor/",
        "comments": [
            "That post title 😳",
            "As someone who has picked up a minor in college, I have no regrets. Sure, doing a minor could put a little more stress on your life, but overall I think it’s worth it.",
            "[removed]",
            "[removed]",
            "[removed]",
            "I just got a whole email about this and all I could see was the title. You got me fucked up",
            "average cs major",
            "[removed]",
            "[removed]",
            "[sauce](https://www.reddit.com/r/csMajors/comments/zuk6r6/are_minors_worth_it/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button)",
            "Put your hands up if you thought OP meant a child",
            "OP, if there is an interest you have outside of CS/SWE you should do it. You’ll likely never be in college again so take classes you want to, alongside your major of course",
            "NEVER pick up minors",
            "you scared me with that title",
            "[deleted]",
            "LMFAO I definitely misread this title. I need a get my head out of the gutter",
            "Merry Christmas",
            "major is the one you make money off of, and if you enjoy it you don't need a minor. if you're only doing it for money, a minor is something that you really enjoy doing in your free time.\n\ngood luck!",
            "Might wanna reevaluate that title dawg 😂😂😂😂",
            "Based off of your ability to choose phrasing for a title, I might suggest a literary minor. Anything to help you see what everyone’s talking about",
            "[removed]",
            "Honestly I just chose the easiest minor in my college so my gpa looks like I’m really smart and college is less of a load",
            "math - you're probably close to a minor already              \nstatistics - and probably not too far from this                                    \nbiology - there is so much going on with bio and CS -- this is definitely worth it",
            "Couple of ppl I know from my engineering school, they were initially biomed majors and decided to pick up a CS minor in their 3rd year. After taking the required classes for the Minor (intro to programming with python, data structures, OOP, algorithms, and some electives), they ended up getting a SWE job out of college",
            "I’m sorry I have nothing of worth to contribute but I let out the most guttural laugh at my brief confusion over the wording. I knew you had to be speaking of school but just for a millisecond I was worried.",
            "Holy god I came here ready to send you to the gulag. My apologies",
            "Lol.",
            "I chose something not related to cs at all, psychology. Have fun with it.",
            "I took a double take.",
            "I don't think this is a good idea",
            "Sus",
            "Not in industry yet, but I did a math minor after dropping my math double major. I don’t think it does much other than filling some empty space on my resume, no recruiter asked about it. But seriously, consider real applications for your intended subject minor. Minor in math gave me some idea of higher level math; I will probably never use it again in software engineering.",
            "Bless your heart 😂😂 the edits are killing me",
            "I suggest you word this differently",
            "Please bro phrase it better me and my friends were looking at Reddit now they think I'm a pedophile",
            "Merry Christmas op haha",
            "> 2: It's sexual or suggestive content involving minors\n\nNo trolling please; it's clear that this is meant to be a legitimate post.",
            "Depends. I'm 29 yo and I wouldn't consider a minor unless I'm entering a more specialized field. I know some talented friends of mine who only graduated with a BSCS degree, and they were able to find a great SWE job. I plan to do the same since I don't want to spend any more time at school. Seems like you have a lot of time on your hands, so do what works best for you. If you think that will help you in some way, by all means, pick up a minor. Just do yourself a favor and finish school as scheduled or sooner.",
            "Just in case you’re actually curious and not just shitposting: I picked up a minor in cybersecurity and it was good in the sense that I now know more about cybersecurity than if I didn’t get the minor but I don’t think it’s getting me a cybersecurity job lol",
            "(grooming jokes aside) It's only \"helpful\" if it gives you a skill that you like. \n\nLike a Japanese minor is helpful since their are few times in your life you will get to practice learning japanese conversationally without living in Japan. A kineseollogy minor is helpful since you can become certified as a personal trainer in your free time. A teaching minor is helpful since it gets you certified to teach. \n\nIn my opinion, if you don't have a tangible skill you are seeking and you are aiming to take a few extra classes, you are better off taking graduate courses and reserving them since you could normally transfer 9-12 credits to a masters porgram or PhD later in life. It is smart since these courses will be free ( you will be charged full time tuition for 12 or 16 hours right? ) and they will dramatically reduce any burden you have should you chose to go to grad school. \n\nIf you want a minor that doesn't have a tangible skill, I'd say don't do it . You may find a minor you like better later anyways . Besides, your resume will get so full so fast after your first / second job, your minor will probably evaporate from your resume.",
            "You pick a minor in college and you pick up a girl at a bar. \n\nMay be it’s time to minor English or Literature.  \n\nThis advice is coming from non-native English speaker.  Prepositions in English are a bear to master, but when you get to make jokes like a local when you do.",
            "I went back to school after dropping out to get a minor. I needed to learn and was struggling. \n\nNever in my entire career have I been asked about a degree or not been able to get my dream job not having a degree, so wouldn’t expect this to have a huge impact on your professional life.\n\nSeemingly, even my little personal minor seems to bump up often since it’s rare to see someone that went to school for something more than a degree.",
            "Pick a minor in a business discipline like business administration, marketing, accounting, etc. there’s a lot of good ideas here that really will come in handy if you start a business one day. \n\nYou might not think you will, but who knows? I didn’t really plan to but then life happened and I was like fuck it, sure, let’s give it a shot! \n\nI had a business in my early twenties, unrelated to cs or tech, and it was small online thing. I basically sold sports memorabilia on sites like eBay and Amazon and others. I didn’t go to college before, I worked a lot of odd jobs, so I could reinvest time & focus into my business and keep it going when I wasn’t making anything or losing money. The odd job $$ was enough to sustain. It was all really risky. And ultimately, I went negative and it got to a point where it didn’t make sense to keep it going, so it failed. I learned a ton though, it was worth it.\n\nHowever, the reason why it failed is because really I just had no idea what I was doing. I thought I knew the concerns of business. I had worked for them, seemed obvious. But I didn’t *run* businesses before. That’s the difference. \n\nI thought it was just all practical ideas that one could observe. Like I used to do when I worked the odd jobs at businesses. And maybe they are somewhat like that, but having a little direction in terms of important concepts would’ve definitely helped. I didn’t have that haha. I didn’t know terminology or ideas or concept of things I probably was dealing with at the time. And I also didn’t know how to leverage my skills more or what skills made sense where, cause I didn’t know how to code back then and wasn’t actively practicing math haha. I was doing a lot of buy/sell actions like trading stocks, but with sports stuff, there’s a shit ton of science & business ideas there, I had no idea haha. \n\nIt’s really hard to just guess and for things to work. 99% of the time they will fail. And that’s why I failed, I was just guessing, empirical reasoning solely, not verifying my knowledge, not finding other ideas that were already there, etc. the task of running the business was a lot because I was the sales, the researcher, the maintainer, the customer service, the advertiser, everything. It’s a lot of work!\n\nThat said, pff hell yeah, I’d do it again tho. It was really fun even though it failed haha. It made sense going for a science after, these skills play nicely with that area. Now, I can leverage my coding skills to do my own analytics and not have to make the same mistakes again in my next venture once I get more perspective. CS *is* awesome in many ways, but not all. But, yeah still having an idea of business concerns would be valuable. I’m thinking grad school for it myself cause I’m done with the cs degree. \n\nTL;DR do a minor in business. If you run a business one day, this information will come in handy. It doesn’t need to be tech related even, it could just be any business. If you do that, this knowledge WILL help you for sure!",
            "really had me in the first half there",
            "If you pick up a minor and transport him/her across state lines without parental permission, you'll go to jail.",
            "Unless you plan on incorporating the subject of your minor into your CS career, I dont think a minor is worth it just for the fun of it. Most people dont even put their minor on their resume. I saw that you’re interested in education. Maybe you can try to volunteer at a camp or a library to teach a CS related class. Its encouraged to have interests besides CS but I dont always think its worth the time and money to take classes for them unless you’re specializing in something for your career. \n\nIf you have free time in college and just want to explore, there are ways to do that outside of a classroom. You can learn a language on your own, pursue hobbies, join organizations meant for networking, intern, etc. or anything else that will make you a stronger candidate in the post-grad job market. A fun minor will probably not be the reason why an employer does or doesn’t hire you.",
            "You might want to consider a different title.",
            "**Chris Hansen has entered the chat**\n\n“Why don’t you sit down. Have a cookie. And we can discuss phrasing and presentation.”",
            "Do it in las vegas or another country where its legal",
            "I got minors in English and Art, it was something I enjoy and also want to focus more on front end/UX design so it blends nicely. Minors can help you, or it can just be something you’re interested in! Also certain minors have more requirements than others, so that may be something to consider as well.",
            "Bro your title is a freaking clickbait and praise the lord for nobody has contacted the cops rn\n...\nMf you'll be in deep ship by now 😂😂😂",
            "FBI open up….",
            "Loving the edits haha",
            "FBI OPEN UP",
            "Jesus Christ dude make a different title, VERY misleading",
            "LMAO I NEEDED THAT LAUGH X3"
        ]
    },
    {
        "post_id": "kor66v",
        "author": "awesomega14",
        "title": "Does anyone feel depressed thinking about their future?",
        "url": "https://www.reddit.com/r/csMajors/comments/kor66v/does_anyone_feel_depressed_thinking_about_their/",
        "score": 484,
        "num_comments": 67,
        "created_utc": 1609563371.0,
        "selftext": "I'm very close to graduating with my degree and I'm constantly terrified by the uncertainty of whether or not I will be able to have a career after graduation. I'm terrified by the thought that I will never be able to get my foot in the door and I will end up in poverty for the rest of my life. I don't want to imagine myself spending the rest of my life in the same town I grew up in, working shitty low-paying jobs with no escape. I don't know what it is about tonight but those thoughts feel especially oppressive at the moment. Does anyone in this sub get really bad anxiety thinking about these things? How do you deal with that anxiety?",
        "permalink": "/r/csMajors/comments/kor66v/does_anyone_feel_depressed_thinking_about_their/",
        "comments": [
            "I think you should stop listening to people on these subreddits who think that life ends if you don't grind leetcode until you get a faang job.\n\nThink about how many jobs there are in tech that a CS degree will qualify you for, that are not strictly the top-tier most well-paying software engineering gigs, but that still could afford you a really nice life: web dev, sysadmin, app development, the list goes on.\n\nAnd think about all the people who do well in these industries *without* a degree.\n\nYou'll be fine. Subreddits like this are toxic.",
            "this sub is really sad to read",
            "It’s even harder if you changed your major into CS from something else. The feelings of imposter syndrome are always there.",
            "You will be fine. Just make sure your resume is good,  apply every day and to many places, you can pass technical and behavioral parts of the interview and eventually one company will give you the foot in the door you need to take your career to the next level. \n\nYou literally just need one foot in the door and you will be fine assuming you can handle the rest.",
            "I don't know what advice to give you on this issue but I want you to know that you're not alone. I have exactly the same fears. I've been poor or \"working class\" my entire life and have always hated my hometown and environment. Its taken me longer than most to get this far into my education because of that. I don't have any internships under my belt and very little work done on side projects because I've had to work to support myself, so I think getting that first job is going to be a herculean task for me. What I'm going to do is probably just grind out leetcode when I can and continue on for my masters I guess. I'll probably be in the 800+ apps before getting a job camp, if I had to predict the future. All we can really do is just not give up.",
            "\"Worry is the interest paid by those who borrow trouble\" - George Washington.\nI also like Will Roger's take \"Worrying is like paying on a debt that may never come due\".",
            "Something I think about to ease my thoughts like this is how many people without CS degrees get into tech and coding jobs. \n\nSome of my close friends that graduated with degrees like electrical engineering, physics, or even chemical engineering have gotten into programming jobs at big tech companies and write lots of production code. \nEven some other interns at my internship aren’t pursuing CS degrees. My coding manager doesn’t even have a CS degree but would kick my ass in writing code.\n\nMy point is, just know that people who are getting or have CS degrees like you and I are much more qualified than they are to have coding positions; it’s literally all our degree is about. And if they can find coding jobs then we’ll have an even easier time than they.",
            "As someone who went through the same thoughts last year, trust me that you will be fine. I had nothing going for me, and had no out of class experience to show. I had a 3.2 gpa and only 2-3 major class projects to show. I applied to every job I could for 3 months post grad (had been applying to more 6 months prior to graduating) and felt hopeless constantly receiving rejection emails without even an interview. I only landed 3 interviews in total. One before my graduation, and I failed the technical interview. One recently after graduation, did better but the job opportunity fell through. And one 3 months after graduation, me, the hiring manager, and the project manager connected very well and they were happy to train me to do the job even if I was under qualified. It’s a security engineer position, which isn’t my ideal career, but it’s a starting point. My boss even has me help with development projects on the side so I get experience for that and can change jobs later to what I wanna do. Sometimes it’s just about finding the right environment and for the company the right person for the team isn’t always the most qualified, but the one who fits in most. You’ll be fine, it may take a bit but you’ll find the right fit. You probably have more going for you than I did. \n\nAlso go easy on yourself come May. There’s still a pandemic and most people are jobless. It’s hard to land a job in such a time",
            "I think those levels of anxiety are unfortunately pretty common nowadays where the job market is extremely competitive and people our age are having difficulties just trying to live decent lives after University. I have the exact same anxieties of not being able to leave my town as well. I've been stuck in my shitty town for a while now (I did a Bachelors in Business before I started Comp-sci) and just the thought of being able to leave and pursue a better life somewhere else seems like a fantasy. But I think it's motivating in its own way, I'm very motivated now to improve my material conditions and I'm sure you are too. \n\nYou seem very introspective too, which I'm seeing manifest as imposter syndrome but you have to remember you JUST HAVE TO GET PAST THE INTERVIEW PROCESS. You can work on hacking that process in a different number of ways (i.e. Leetcode grinding, mock interview practice, behavioural question practice, networking). After that, even if you were under-qualified (which I doubt you would be for a new-grad) you could work on improving your skills on the job. \n\nDon't sell yourself short. You will make it.",
            "I don’t understand why you feel that way. This is literally the best major when it comes to financial stability lol",
            "I think most people have these feelings every once in while. You aren’t alone. This sub isn’t the end all be all for software dev. Neither is cscareerquestions. Your path won’t fit what you see here. That’s ok. You will find a job. Want to work at fang? You might not go straight there.  And that’s ok. You will be ok.",
            "A lot of the kids on this subreddit that claim Leetcode grinding -> some Big N job are just stubborn and naive. There’s also a desire to confirm your own life choices by projecting them as the “clear and only option” onto others. If everyone here was even just 2-3 years older, the perspective would be quite different.\n\nThere is endless opportunity in tech, and it does not begin and end with $140k salaries and 60 hour work weeks. You’ll find your place.",
            "I hope your mindset is not:\n\nLow paying shitty jobs = anything non FAANG",
            "Articles and statistics often show that IT is the best field for financial and career stability. There is no way you will end up in poverty for the rest of your life. Just take a deep breath, and try to stop worrying about it too much.",
            "Have you not been attending career fairs, doing internships, and/or working for your department???\n\nEven with my mediocre software dev associates, I was offered 2 jobs at 50k+. With there being so many companies looking for CS majors, I don't understand this fear.",
            "Imposter syndrome at its finest. I’m in the same exact situation.",
            "Dude just put yourself out there!!!! You're going to be fine!",
            "I didn't have a programming background before university and I did fast-food jobs to support myself while studying so I didn't have a chance to work in internships or get relevant exp. Was ashamed of my blue-collar background and being a few years older than my peers who already were at a better level than me. I had a bad case of imposter syndrome.\n\nI recommend this book, which has helped me gain the confidence to apply for placement in my final year. [https://www.amazon.com/Foot-Door-Getting-Industry-Programmer-ebook/dp/B0813XNFNF](https://www.amazon.com/Foot-Door-Getting-Industry-Programmer-ebook/dp/B0813XNFNF) . Its pretty short and only $3.24 on Kindle. Well worth reading.",
            "[deleted]",
            "I'm a sophomore CS student and have no concerns about getting a job post graduation. I come from a sales background and there are lots of sales jobs out there for people with a technical degree that pay very well. I will also be able to get project manager jobs with this degree and the certificate. I'm really not worried that I will end up unemployed. My plan is to get an internship or two before I graduate that I can do along with my full time job hopefully. \n\nI know there's a lot of stress on this sub about not landing a job right out of school. When it's this job market it's harder to find entry level jobs. However, may I suggest reading, Cracking The Coding Interview. I've started reading it and applying the advice that is to be found in there. I've since changed and updated my resume, begun networking, joined programing social groups, started a github page, joined leetcode, and [hacker.io](https://hacker.io). The goals I have are to land at FANG or another giant tech or fintech company. Hopefully it will happen. It's up to me to make it happen. The way I see this degree and opportunity path is that initially the hardest working of those in this degree get the best opportunities to start with. \n\nKeep your chin up, start applying, and start practicing interviews. You can do this!",
            "Sometimes I feel like people are TOO optimistic on this sub. When I graduated, I could find any other job in consulting or business for two years!  I was a math, econ major so the idea there is a plethora of “good” jobs is a fallacy, especially if you live in Boston, New York City, LA etc. if your parents don’t have connections and you don’t have the right degree you might be stuck like I was - tutoring for 15 dollars an hour until you decide to get a masters in CS",
            "08' was a career killer. However you would be better off looking for work then than now. Do with that as you will.",
            "Hey man, same position as you almost to a T. All I can say is once you graduate it’s just applications and applications. As long as your resume is decent enough with a project(s) and you have a somewhat acceptable tech/language set under your belt in the end I think you’ll be fine. I’m no expert but here’s my advice: \n\nAs for the leetcode grinding, everything in moderation. I’m trying to work on it more often just to keep myself sharp since my last semester really made me soften up a bit. \n\nMy recommendation would be to breathe and try to relax as far as your mental health goes. As for finding a job, I’d say apply for full time jobs, not just internships at this point (my last interview and the one next Wednesday aren’t for internships, but full time positions), keep yourself sharp with your own study methods (data structures/algorithm basics), and make sure you are also sharp on what you say you know on your resume. My friend who graduated before me took nearly 3-4 months to find a job this past summer, so there’s hope my man. Good luck.",
            "I joined this subreddit because my son is persuing a cs degree so I read lots of the comments and try to learn from you guys,about what his future holds.  If I can just put my two cents in, to help someone out.  Don't fixate on immediate gradification and rewards.  This is not a sprint but a marathon, about a 40 year marathon. Don't sweat the small stuff, and what seems like a big deal is usually not after a short time.  Don't worry about being at the top right away, you might miss something on the way up. Your generation is very smart and the competition is fierce but enjoy yourselves and don't burn yourselves out. Life is to short not to enjoy",
            "I graduated in bioengineering 2019 and here in india you can't do anything with graduation in bioengineering. So i decided to switch in computer science which I did. The way I was prepared, me and my friends were thinking that I am going to get job in the 1st company I would apply. But here I got job in the 47th company I applied for. After loosing so much good opportunities I wasn't thinking much of compensation and all. There are so many opportunities out there for computer science people. Just don't overthink and do the right thing. Surely you'll get a job very soon.",
            "If everything else fails, you can always apply at a WITCH company ( Wipro, Infosys, TCS, Cognizant, HCL  and others — like Revature ). I haven’t really looked into those companies but supposedly they hire almost anyone. They do make you sign a 1-2 year contract, but they train you, and then they ship you off to any company that needs software engineers. It might not the best SWE job but you should make it an option — at least as last resort. \n\nI just got my first internship (3 semesters before graduation) but I know that if I end up not getting a full time offer shortly after graduation, one of those companies will have to be enough.",
            "This title seems like its from a circlejerk subreddit for CS.",
            "I was in your shoes last year on this exact date.\n\nFrom the beginning of 2020, I spent 8 months grinding leetcode. I'm also an electrical engineer, so I'm still on a journey discovering where I'm most useful to society. I still am griding leetcode even today for an interview at one of the big 5 (an interview out of many companies applied to over the course of all of 2020). It took me 6 months to land a job at one of my lower choice companies, but I managed to save up a solid 9 months of expenses in the 4ish months I've been working for this \"lower choice\" company. My present savings rate is 2 to 1, so every month I work, I can pay for this month's expenses and also bank enough for 2 more months. If I were at FAAMG, that rate would go up to 3.25 to 1. I'm not losing sleep over that. Honestly, I wouldn't lose sleep over a 1 to 1 rate either. In fact, in any case, I'd just be trying to improve my situation. If I were at FAAMG, I'd just work on my VC pitch.\n\nIt's strange, but today, I do have something the FAAMG employees don't, and that's the ability to actually help some people (fresh grads like you) get into my company (that means message me if you're interested in help). My recommendations actually carry some weight, and the skills desired at this company aren't just about fast algorithms.\n\nI'm not going to try comforting you or telling you it's all going to be okay. But there is a strategy. We hit up friends to refer us, keep submitting applications, and study leetcode. It's a numbers game.",
            "Idk if this is the response you would hope for but on top of all the advice telling you that you can still find a tech job, I honestly feel the exact same way and one thing I kind of fall back on is the option to become a teacher :’(( I know it’s not very high paying but it’s definitely different from working minimum wage :’( and personally I feel like being an instructor has been really rewarding and not as difficult cause you don’t have to leetcode your way in :’(( \n\nI think a lot of ppl also tell me you can also find jobs in non CS fields and still have a good career too! \nBut yah I’m also a senior and I’m really worried too so if you ever just need to rant or vent feel free :’(",
            "Hey I think these are irrational thoughts that come with anxiety. I have these thoughts sometimes as well but I was trying to start going to therapy I think that is a smart choice to think about!"
        ]
    }
]