[
    {
        "post_id": "kkxiy9",
        "author": "Thisdrawingsucks",
        "title": "From 2.3 highschool GPA to 80K offer without highbrow internships, coding challenges, or even close to a 4.0 college GPA by applying to hundreds of internships (with breakdown of application stats)",
        "url": "https://www.reddit.com/r/csMajors/comments/kkxiy9/from_23_highschool_gpa_to_80k_offer_without/",
        "score": 484,
        "num_comments": 109,
        "created_utc": 1609044880.0,
        "selftext": "After a long five and a half years of CS at the University of Utah I've finally graduated with an offer from my dream company. During those years in college I saw constant pressure to practice online coding challenges and to get an internship at Google, Microsoft, etc, but truthfully I dislike the sound of either of those, I wanted to go into healthcare\n\nBy my third year I still didn't have any internships and had probably a 3.3 GPA, so without much direction I just started applying to as many internships as I could. I applied while in class, I applied during my lunch breaks, I applied at every moment I could find time. By the time I got an internship I racked up almost 230 applications (less than 5 had cover letters and I had no personal connections to any companies I applied to). This is what those applications resulted in\n\n* Number of Internships Applied to: 227\n   * Rejections: 136\n   * Did not hear back: 68\n   * First Round Interviews before accepting first internship: 19\n      * ADM, UPMC (x2), State Farm (x2), TIAA, Southwest Airlines, Principal, CarMax, Prudential, Amazon, Bank of America, HCA, Mayo Clinic (x2), Tenet, Centene, Qurate\n   * Second Round Interviews before accepting first internship: 5\n      * Prudential, Southwest Airlines, UPMC, Mayo Clinic (x2)\n      * Second Round interview that came after I accepted first internship: 1\n   * Made first round interview but didn't want to interview for: 4\n      * ADM, Principal, HCA, Statefarm\n   * First Round Interviews after accepting first internship: 11\n      * Centene, Qurate, Principal (x2), Statefarm, Nordstrom, NextEra Energy, Verizon (x2), Stryker (x2)\n\nWhy I think this strategy works: Assuming all CS students are good candidates to a certain percentage of internships, if you just keep applying to internships the numbers will work themselves out eventually. What did I have going in my favor? Disregarding a very average 3.3 GPA, I was a unique candidate. I was the captain of the jump section of my track team and was pretty personable in interviews. I also had a  web scraping project to my name that was complete minimum viable product.\n\nMy biggest tips:\n\n* Get an internship even if it isn't your \"dream internship\" during your sophomore summer or junior summer if you plan on going for a senior summer internship\n   * This is going to really give you some leverage for the next internship application cycle\n   * If you happen to not get your dream internship the next year then you have a good backup spot and some leverage for when you apply to real jobs\n   * This will give you some pay leverage whether at internships or jobs\n* Focus heavily on being personable\n   * I can't tell you the difference it made that the manager hiring and I felt like we had a good connection. These people are going to be spending a decent amount of time with you, so they'd prefer to enjoy that time even if you're not the most \"prestigious\" application\n* You can really stand out with unique qualifications\n   * By the time I graduated I spent over a year as the president of track and field at my school\n* Start early (September/October)\n   * I have a suspicion that many internships don't get as much attention in the first week or two postings have been up if they're really early in internship season\n\nI used this strategy again the next year and now have a total of over 500 applications submitted, although it's easier the second time when you have an internship on your resume. Hopefully this will inspire people to stop taking leet/coding challenges so seriously and to focus more on diversifying their skill sets!",
        "permalink": "/r/csMajors/comments/kkxiy9/from_23_highschool_gpa_to_80k_offer_without/",
        "comments": [
            "Jesus bro the people on this thread lmao. Looking down on an 80k salary shows the pompousness of the sub. Congrats on the dream job, good tips",
            "Congrats on landing a great job! This sub is delusional if they think 80k is something to snub their noses at. That can afford you a really nice lifestyle and you’ll only go up from there!",
            "Good on you OP! Thanks for the break down",
            "[deleted]",
            "congratulations man!!! this is an amazing story",
            "where did you find your internship applications?",
            "I agree. This person can take their 80k salary job experience and eventually end up making 250k-350k+/year with stock options and bonuses…and if they decide to invest or create a company who knows! Amazing news and congratulations to u/Thisdrawingsucks from a fellow engineer :)",
            "I always tell people that scraping projects are overdone and not something you want representing you but it actually got me the interview that landed me my internship for next summer.",
            "You inspire me brother, I had only applied to maybe like 20 internships and each time felt like I'm an imposter. Was really ashamed about my previous blue-collar work experiences as well as I had nothing relevant to put on my CV but I'm slightly in a better position now as I have gotten a placement with a charity, it's not a tech company but at least its something relevant to put on my CV as I will be building them an app.",
            "Wow wonderful read OP, Congratulations",
            "Congrats. Your persistence is impressive.",
            "I’m not sure if this is the right place for this (pretty sure this doesn’t violate the rules either) but if I’m a Highschool student that wants to attend The University Of Utah and major in CompSci, is there any advice you can offer? Should I ask at r/Uofu ? Is it too early to start thinking about this? Thanks!\n\nEdit: I am asking for ideas/topics I should familiarize myself with, worded this very badly lol",
            "Stryker is my dream company to work for!",
            "Congrats! Super proud of you :))",
            "Aww a fellow Ute making >80k first year out. Love to see it, doesn’t happen too much.",
            "congrats man, I'd love to be in this spot in some time.",
            "Congrats dude, fellow U of U student here",
            "So what company did u end up with?",
            "!RemindMe 2 days",
            "Congrats brother!! Keep prospering and spreading gratitude, its contagious! \n\nIf I may: What were your degree major and minors? Are there any particular technical skill sets you had, that you found useful and common amongst the companies intern requirements? If so how did you go about developing said skills?",
            "[deleted]",
            "Congratulations. Keep up the good work!",
            "Congratulations!! Great to hear about your journey! And wish you the best on future endeavors! Cheers 🍻",
            "Congratulations!!!! \nAs someone who is also interested in healthcare and a CS major, what do you plan to do in healthcare?",
            "Centene! In the same boat - want to go into healthcare tech. I also haven’t touched leetcode haha and my numbers are pretty similar to yours. Got an internship offer for Centene I’m thinking about accepting. Do you have any input on their SWE internship?",
            "!RemindMe 2 days",
            "No offense but that sounds like a lot of work for getting an average position. If you go to the career fair at the U and talk to the hill force airbase they’d offer you a position with similar TC with just the interview on the spot.\n\nEdit: The tips he shared are still valuable, I was interested to see why OP chose to do that since I’ve been to the same career fairs at his school.",
            "[removed]",
            "Has someone developed a program that will fill out applications for me?",
            "What do you mean by personable? Like, I'm pretty awkward and tend to not be good at these situations. What did you usually do/say to be personable? did you find something in common that you had with the person who was interviewing you?",
            "So was your gpa a 2.3 or a 3.3?"
        ]
    },
    {
        "post_id": "19bqa90",
        "author": "Frrenchhh",
        "title": "How we feelin?",
        "url": "https://i.redd.it/kbi0oxswsodc1.jpeg",
        "score": 486,
        "num_comments": 44,
        "created_utc": 1705796544.0,
        "selftext": "Fuck this",
        "permalink": "/r/csMajors/comments/19bqa90/how_we_feelin/",
        "comments": [
            "If this is real, you must have started applying pretty late (within a few months, probably like 60% of companies will have rejected rather than ghosting), so you might have better luck as time goes on.",
            "Life sucks I guess",
            "i've added a counter widget and for each apply i do i increase it, rn i reached 57 and just one rejection, someone kill me",
            "![gif](giphy|l3xxTjIXYy3gchiH3L)",
            "Oh God this is the worst one yet",
            "I m about the same",
            "Is it better or worse that mine is the same but half rejected half no answer",
            "Automatic email companies have raised their prices. They see how many rejection emails are going out and doubled the subscription plan. All we're seeing here is businesses re-trenching and deciding the rejection email is an unnecessary luxury.",
            "Same here buddy",
            "What website do y’all use to make this?",
            "How does one make this style of chart?",
            "you got this :)",
            "How to make this graph",
            "Sucks man, just keep applying. In the current market, It's all a number game and fastest finger first in some cases.",
            "Basically",
            "im worse haha keep ur head down and keep grinding tho!",
            "I'd love to see some of you do this for your dating apps",
            "Are you actually reaching out to the company and following up? Making connections on LinkedIn?"
        ]
    },
    {
        "post_id": "149w533",
        "author": "Fun-Ring9571",
        "title": "why are some of y’all stupid fr?",
        "url": "https://www.reddit.com/r/csMajors/comments/149w533/why_are_some_of_yall_stupid_fr/",
        "score": 481,
        "num_comments": 48,
        "created_utc": 1686815094.0,
        "selftext": "i was reading that post on that girl that talked about how she was harassed in her dms and as i was reading the comments, a lot of idiots were in the comments like “it’s not all men” BUT WHY TF IS IT ALWAYS A MAN? y’all don’t realize how insensitive and just plan stupid you sound. generally, (and yes i’m generalizing) you men need to reevaluate yourselves. most of you are old enough to have common sense and know shit like this is really harmful, not only to women but to other men who are genuinely good people but labeled as whatever because of how other men treat women. like grow tf up\n\nedit: LMAO not some of y’all butthurt by this. instead of you working on yourselves, you wanna come under here and act like incels. i hope you eventually learn to grow up and get some help. God bless 🙏🏾",
        "permalink": "/r/csMajors/comments/149w533/why_are_some_of_yall_stupid_fr/",
        "comments": [
            "The comment section is quickly turning into a pointless battleground. Locked.",
            "What happened ? Can someone bring me up to speed ?",
            "Jesus these comments are depressing… if you feel personally targeted by this post you’re the problem lol",
            "\nEdit: This is not a defense of the actual losers on the post. Not even a defense of the people who say NoT AlL mEn. Just my opinion about how the way we talk about these things leads to such defensiveness. \n\nI think we can all agree that 9/10 times it is a man and at the same time not blame men as a whole for the behavior. \n\nThe reason people have a strong reaction when people speak in generalizations is because no one wants to be lumped in with a negative group. It’s very easy to slip into sexism and racism and all the ism’s when you refer to a whole group of people by a negative trait.\n\nSo what is your argument? The “good ones” should know it’s not about them and they don’t need to say validate themselves? Sure maybe some people can do that. I know when people say men do x and y they’re probably not talking about me because I’ve never done x and y. At the same time, it still rubs me the wrong way because I’m a man and you are in fact referring to me when you say “men” regardless of how you add caveats. \n\nIt’s correlation and causation. Terminally online men exhibit these behaviors, typically ones who have fallen into redpill spaces, not men. Men are correlated with the behavior, but it’s not because they’re a man. Being a man is a common trait of people who exhibit the behavior, but it’s not BECAUSE they are a man.\n\nI completely understand why people get angry if you refer to men as the problem, and at the same time I agree we need to solve the problem and that the problem is almost always with a man. These things can all coexist.",
            "Eventually you learn that expecting people to act appropriately anywhere, let alone anonymously on the internet, is completely futile and will never happen. The best you can do is respond appropriately and try to mitigate problems. Look at Twitter for an example of my point. I understand the frustration though.",
            "Thank you so much for your support. I was the OP of that post. I want to emphasize that I was not getting **harassed** the mere purpose of that post was a rant (such as yours) not an actual cry for help. I have chosen not to take any actionable steps about those creeps, since I don’t see a point in getting them banned when they can just make new accounts. I once again want to reiterate that I am not feeling harassed, just sad and felt like ranting lol. Again ty for your support 🩷",
            "[deleted]",
            "Talk to the mods. This is way off topic. A post like this isn’t going to do anything. Talk to the mods and report those people to Reddit for harassment.",
            "It’s an anonymous app, what if the “female” user you message is actually just a dude with a cute avatar lol?",
            "[deleted]",
            "just plan stupid",
            "[removed]",
            "I did nothing and got blamed? wtf",
            "Why is it always a man? Maybe because girls usually don't want to pick up other girls?",
            "[removed]"
        ]
    },
    {
        "post_id": "v2hq0p",
        "author": "lamentable-days",
        "title": "Leetcode is actually great",
        "url": "https://www.reddit.com/r/csMajors/comments/v2hq0p/leetcode_is_actually_great/",
        "score": 482,
        "num_comments": 77,
        "created_utc": 1654092141.0,
        "selftext": "In fields like law or finance, you basically have to go to a top tier school and be a top performer in order to get a top tier job.\n\nLc levels the playing field so hard, you don’t need to worry that others are more knowledgeable than you because they’ve been programming as a hobby since they were 8, you don’t need to worry that your university sucks… none of that.\n\nImagine places like google basically saying “yeaaah we’re only hiring from MIT, don’t even bother if you’re not from there” the way many law firms or high finance do.\n\nI’m grateful that lc exists, with just a few months of effort, I landed bill gates and rain forest. Would be unfathomable for my equivalent, education wise, to land the same in their respective fields whether it be law, finance or even medicine. In university I remember thinking I’d be happy with a mediocre job, after all how could I not? Many of my peers were programming since they were kids, and there I was barely programming except in a school context.\n\nNow thanks to lc, I can say I have a better job than most people from my uni even those who spend 24/7 programming. \n\nThank you lc, for bringing some fairness into this world and giving people like myself a shot at making it.",
        "permalink": "/r/csMajors/comments/v2hq0p/leetcode_is_actually_great/",
        "comments": [
            "Yea as much as people complain about L33tcode, we definitely have it much easier than other similarly paying professions and it’s free. If you decide to get premium for 160 or whatever that’s still better than paying for licenses/certifications in other professions.",
            "[deleted]",
            "god i love leetcode, i wish i could marry it.\n\nspeaking of which, it's time for me to do my 200 daily problems",
            "Any tips for starting lc? I’m in school for programming (C++) but I want to do lc for those interview questions . It seems pretty intimidating",
            "[deleted]",
            "Of course LC is great and helpful! It’s just boring af",
            "Although you have a few good points, I disagree with the idea that being good at LC is even comparable with having actual experience. After all, they're hiring a SWE, not a LC master. Going through 24/7 coding sessions at a company builds your intuition... sooo underrated these days :(",
            "Exactly my thought. Yet people are fucking complaining about it and saying it's not a real test of their abilities. While that might be true if you're a senior or an architect who doesn't do much code anymore and does more big picture work, it has been proven more than once that people who are good at leetcode can be good engineers. I hate the new wave of hate on leetcode because problem solving interviews is one of the main reasons i majored in CS, because I know i'll actually be tested for my problem solving skills rather than the arbitary bullshit they test people for in other jobs.",
            "Do you mean land Microsoft when you say \"landed bill gates\"?",
            "so im just not smart enough for failing lc, thx for pointing out the obvious 🥲",
            "Hijacking your post....I am planning to start learning JAVA and LC...Where and how as a COMPLETE BEGINNER (starting from ground zero) can I learn Data Structures & ALGO??",
            "I’m learning Java but I want to ask if I do Java to just do Leetcode, would that be sufficient? Or do I also need to build projects and do client side and server side programming too?",
            "I just treat it like puzzles and love it",
            "WHo even practices leetcode? I just get my dad to call around and get me an internship",
            "Wow. I love this post. Thank you for giving me hope."
        ]
    },
    {
        "post_id": "ti142j",
        "author": "javaHoosier",
        "title": "Bartender, back to school in late 20s, to faang in 5 years. AMA",
        "url": "https://www.reddit.com/r/csMajors/comments/ti142j/bartender_back_to_school_in_late_20s_to_faang_in/",
        "score": 480,
        "num_comments": 83,
        "created_utc": 1647713426.0,
        "selftext": "Always fascinated by programming, but wasn't great at math. I mentally convinced myself it wasn't for me. Self teaching wasn't working for me either, but couldn't shake the desire to keep trying. I eventually decided to go back to school in my late 20s and just go for it. First 2 years I heavily questioned whether if computer science was for me or not. My junior and senior year I started to find my groove.\n\nI had one internship and then I took a terrible low ball offer after graduation in Silicon Valley, there for 2 years. Used that as a stepping stone. This week I just signed my faang offer.\n\nAs for leetcode. After some practice I got decent at the questions. I'm no where near great at it and never practiced hards. I definitely didn't live the narrative where you eat/sleep/leetcode. I just did two questions or so a day for about 2 months. Baked into my daily routine.\n\nThat being said it was a lot of work overall, but my goal with this post is to provide an anecdote that you don't need to go to a top 10, start at faang, or grind your life away to achieve this.\n\nAMA",
        "permalink": "/r/csMajors/comments/ti142j/bartender_back_to_school_in_late_20s_to_faang_in/",
        "comments": [
            "Respect",
            "Good job OP, I had a similar progression. Bartender for a few years, then back to school, now I've started my career. Good stuff on the faang offer. Not for me, I decided to go into a passion field - video games. Pay is weak, but I love my company.",
            "Congrats!!\n\nAs an undergrad student who hasn’t worked a full time position yet, im curious what your primary goals are coming into your new faang job given ur past experiences?\n\nWhere do you want to be in the next 5 years?",
            "Love seeing another bartender here! I’m in my early 30s and almost my entire work history is serving/bartending. How did you spin your service experience to be relatable to CS to get those first internships/jobs?",
            "\"My junior and senior year I started to find my groove\"\n\nCan you elaborate more? What clicked for you?\n\nAlso are you the type that dived deep into the curriculum and built project around that (algorithms / optimisation / the more \"academic\" topics etc) or wandered off to hobby projects by self learning topics (games / creatives / frameworks etc)?\n\nWhat role are you taking? Front / back end / full stack / dev ops?\n\nCongrats, respect and thanks!",
            "Good post, thanks, and congrats",
            "Congrats! Curious on total comp, only if you can share:)",
            "Can I ask, how was leetcode in the beginning for you? I'm going to be a junior next fall, and I can't help but looking at solutions for problems I don't know off memory? Would you suggest using google or seeing function libraries to help with leetcode?",
            "Did you work full time and do school part time? If you did school full time, how did you support yourself?",
            "Congrats OP!",
            "Nice work.\n\nI also worked in bars/restaurants for over a decade. Went back to school early 30s, I graduate this May and I’ve received multiple 6figure offers. #feelsgoodman",
            "First, congratulations. I know it wasn't easy. I also come from the same industry. I completely understand the self doubts and self questioning. But you did it!! And I'm so fucking happy for you :) \n\nI'm also in my late 20s. I was a sous for 5 years and a bartender for 4 years and I made the choice to try and get a Electrical Engineering and Computer Science degree! And I have 2 more years left to go. \n :)",
            "Great",
            "inspiring",
            "I'm in my early 20's in a similar position. you give me hope <3",
            "Amazon",
            "Congrats. I am also going to start working at FAANG this summer as a new grad full time. Do you have any tips for when I start working? Such as how can be successful, level up quickly, and have good relationship with the manager. Maybe even how long will it take before I feel I'm contributing and not in onboarding process?\n\nAsked the recruiter these questions and they said manager will reach out closer to start date.",
            "[deleted]",
            "Nice. Howd your resume look like? What projects you made?",
            "2 Questions.\n\n1. Tabs or Spaces\n\n2. \n\nfunc() {\n\n}\n\nOR\n\nfunc()\n\n{\n\n}",
            "I’m also in my late 20s and a former bartender trying to make the switch! Reading this is definitely encouraging. Did you do iOS development at your old job too? Did you do a lot of iOS development in school to help set you on this path or did you pick it up along the way?",
            ">  I just did two questions or so a day for about 2 months. Baked into my daily routine.\n\nI might have ground beef for a brain but this would be a good 1-2 hours daily for me. How much time did it take you?",
            "Goated post",
            "Congrats! That's impressive. What CS classes did you take in college?",
            "What language did you use to practice Leetcode?",
            "Thanks for AMA! \n\nAbout the stepping stone thing is it harder to interview at faang as someone with multiple yoe vs as a grad",
            "How did you pay for school? How much of your time was dedicated to school? \n\nI work 5 days a week and am self learning (going well) but sometimes I can’t shake the feeling that I’ll need a CS degree to succeed in this field.",
            "Same here! Bartended my entire 20’s. Went back to school at 25, did 3 internships, now have my dream job developing software for missiles. I’m the laziest shit I know, if I can do it anyone can!",
            "I'm also going in my late twenties into my early thirties, did you ever feel like this put you on the back foot",
            "What was your first step? Did you go to community college, or did you apply straight away to Bs programs?",
            "[deleted]"
        ]
    },
    {
        "post_id": "13ihckr",
        "author": "None",
        "title": "I'm just tired",
        "url": "https://www.reddit.com/r/csMajors/comments/13ihckr/im_just_tired/",
        "score": 477,
        "num_comments": 75,
        "created_utc": 1684178004.0,
        "selftext": "I'm tired of reading \"after careful consideration we are pursuing other candidates\". At this point, I don't even open the emails anymore. I'm tired of not hearing back from a single company in 2 years of studying CS.\n\nI'm tired of telling myself I'll do better next term only for it to get worse. I'm tired and jealous of seeing others doing better while I sink into the abyss.\n\nI'm tired of having to deal with work visa issues because I was born in a cuntland.   \nTo whoever says it gets better, go fuck yourself!",
        "permalink": "/r/csMajors/comments/13ihckr/im_just_tired/",
        "comments": [
            "Just recently got my new-grad offer effectively rescinded. Too many people in this world chasing the little money that has been allowed to flow back into the common peoples hand. \n\nIt really sucks because it seems like the actual line between making it and breaking it is all up to luck. The advice my grandparents gave was “Life doesn’t get easier but when you look back all your problems will seem small”. All we can do is chug along, no one is unlucky forever",
            "It'll probably get worse before it gets better. I've been struggling to get a job since graduating. I don't dare try and remember how many times I've read that line. Most likely the worst time to get an entry level cs job or internship in decades. Everyone says its getting better but I don't see it.",
            "The rejection emails don’t stop, even if you get (and start) an internship\n\nSource: personal experience",
            "cuntland? is that UK?",
            "Yeah I’ve gotten like 1200 of those emails at this point out of 2600 applications at this point I am either emailing them or tracking down a human email address and asking them directly why I wasn’t chosen what needed to be on my resume compared to the others etc. And surprisingly some have responded with helpful stuff usually it has to do with location",
            "Hahahaha you code cucks are FUCKED! So glad I went to get my PhD in BigMacs at Hamburger University.\n\n/s",
            "Dude I feel you so hard. I've become so jaded from seeing \"after careful consideration we are pursing other candidates\" a bajillion times every morning in my inbox.",
            "Life is like a cock, it gets hard and it gets soft. However, it doesn't stay hard forever! My little cog you must keep churning, things will eventually get better.",
            "I feel ya OP. I read those same emails every day. It’s truly a crime to have a stem degree and still not be able to land anything, but that’s the reality we live in right now. I do think that eventually, maybe a few more years, the market will crash. When the market crashes, companies will be begging for us applicants again. But for now we’re just gonna have to sit here and wait, while keeping our skills up to date.",
            "But…\n\n^(it does get better)",
            "[deleted]",
            "it will be the worst job market for tech probably in history. Even worse than 2000-2003. Sadly it's probably not even half way done, and will get worse, especially for startups.",
            "Not what you want to hear but you are right. Getting in the door with only doing the minimum is luck.\n\nYou need to do more:\n- Network\n- More Leetcode\n- More mock interviews\n- Personal projects\n\nIt's bullshit but you are competing with the best of the best for a very small amount of jobs right now. Wishing you the best, it sucks. I remember feeling similar when I was in college.",
            "Embrace the immigrant journey. That’s what makes you tougher than 99% of people born here.  From: an immigrant myself.",
            "Don’t feel bad lol I have experience in the field and a very good resume and I’m 0 for 8 in all of my last interviews.\n\nI went through 4 rounds with a company last month and they ghosted me.\n\nI get an interview on average 1 out of every 100 applications when a few years ago I was fighting recruiters off with sticks.",
            "If this makes you feel better, I was admitted to UVA as a transfer applicant and would probably have to turn it down due to its insane OOS fees and probably go back to my ASU. UVA was my dream university!!",
            "Is it just me or would you find the line \"pursuing other candidates\" offensive?  Normally you get this line from a no-reply email from an ATS software.  Just say \"We won't be able to move forward\" and that's it.",
            "So one definition of insanity is doing the same thing over and over and expecting a different result. It seems that you are not competitive with other applicants for the jobs you've been chasing. Change your target position! There are hundreds of thousands of laid-off technical people with sterling 4 year degrees and sparkling work experience. Your 2 years of study just isn't going to get you an interview. Without an interview, nobody knows how much you know.\n\nReset you target to something that does not require a degree, maybe a smaller company, maybe an employer that you can network your way into instead of applying to a posted position.\n\nAdapt and overcome!",
            "This post makes me glad that I’m not studying CS. Good luck OP.",
            "I used that email for motivation cos at least I got an interview then I think of what I might have done wrong then I improve on it",
            "r/itgetsbetter",
            "This is something I haven't thought about when it comes to CS.  I've been researching going the IT route.",
            "I would think back to why you chose CS in the first place. Likely you didn't choose it simply because of employment prospects (if so, then maybe another choice might be more fulfilling!). Focus in on the non-monetary reasons and get good at those - you might find companies applying to you!",
            "I feel you man, I truly do. Endlessly apply and not even expect any good new anymore, still unemployed right now. Also born in a cuntland and tired of worry my visa issues. Hang in there man, not just you feel this way, we are all in the same boat.",
            "I understand ur pain but whereas I’m in a position where I can’t even get any work experience because work authorization is unexistence so it’s always a NO rejection for me lol.",
            "you are still in second year, you have 2+ more summers or regular semesters to find internships. \n\nHonestly, I would say look around yourself like your friends, seniors, classmates those that got jobs and internships, how did they do differently from you? Hang out with them... hit gym, go party, and study with them.   \n\n\nfind a gf/bf and go to volunteer at animal or homeless shelters. There are more things in life than just 0 and 1. You will learn to appreciate more.   \n\n\nAll the best buddy!",
            "Perservere",
            "Where were u born?",
            "Grt aws/azure cloud certificates",
            "I feel you OP. I was in the same boat a couple years ago. I applied anywhere I could. Eventually ended up moving to the middle of nowhere for a dev role that paid below the average rate. I learned a lot during this position and eventually visa stuff worked out too. Everything will work out. Just keep applying and don't give up hope. Also pick a niche within CS: security, DevOps, devsecops whatever you like the best and build up on it. Good luck!",
            "Do a masters",
            "When did you actually start applying?"
        ]
    },
    {
        "post_id": "151amvp",
        "author": "owlwaves",
        "title": "One thing we can learn from r/PhysicsStudents",
        "url": "https://www.reddit.com/r/csMajors/comments/151amvp/one_thing_we_can_learn_from_rphysicsstudents/",
        "score": 478,
        "num_comments": 91,
        "created_utc": 1689525082.0,
        "selftext": "Just an interesting observation I made...\n\nOut of boredom, I decided to visit other major-related subreddits and I started browsing r/PhysicsStudents\n\nI was expecting a lot more doom and gloom since Physics majors have not-so-good job prospects, especially with just a degree in BS\n\nAs CS majors, we have much better job opportunities than physics majors.\n\nYet, I was a little surprised that there weren't many doom-and-gloom posts if at all...let alone posts about anything career-related.\n\nThere were a few posts about career advice but even then most people in that subreddit were rather chill compared to the constant doom and gloom we see in most cs subreddits. There were some posts about bad job prospects as a physics major ofc but that didn't seem to be the main recurring theme for r/PhysicsStudents \n\nI'm just saying maybe we should take a chill pill and make the most out of what we can. Keep that grind but be calm and have the courage to weather out the storm.",
        "permalink": "/r/csMajors/comments/151amvp/one_thing_we_can_learn_from_rphysicsstudents/",
        "comments": [
            "Physics is a very hard major and has worse career prospects than engineering so the people majoring in it do so because they are genuinely passionate about the subject. Most CS majors, on the other hand, couldn't care less about computer science and are only in it for the money and the prestige. That's why this sub is much more job-oriented than physicsstudents",
            "[deleted]",
            "I mean it's probably because of two reasons that aren't really mysteries.\n\n- People go into CS thinking finding a (well paying) job is easy. Therefore when that expectation is shattered or challenged, you have doom and gloom posts. People going into Physics don't an expectation tp a similar extent.\n\n- The ratio of people going into CS because of money vs because of passion is probably way higher than for Physics majors.\n\n\nEdit: A possible third reason is the grueling journey of job hunting as of late. Namely, I doubt many other majors typically submit hundreds of applications on top of interview prep on top of preparing their portfolio via projects outside of school. But competition and saturation make that an uncommon experience. Sure the alternative for many other fields is extra like 2+ years of school, or a job that typically pays way less with less potential for career growth, but constant rejections due to this game which is also luck-based and numbers-based is demoralizing.",
            "I think a lot of people get into CS, and expect to have jobs lined up by the time they graduate. lots of false promises from tiktok and bootcamp ads.",
            "Physics class size is 1/10 of CS + Some grind for finance, others academia + they touch grass far more often",
            "cause this cs is filled with dummies who only want quick cash. \n\nthe huge influx of money chasing cs majors who in any other scenario would have been business majors have diluted the field .",
            "Hate to break it to you, but physics majors work as software engineers all day long… and are damn good at it lol",
            "Nah physics major don't have bad prospects - the students are just less bothered about money and thus don't go for the high paying jobs the CS students do. CS is by far a way more toxic major. \n\nI've met plenty of crap CS students just in it for the money. Pretty much every physics student I know is not that way - there are no posers in physics.",
            "CS has too many people only interested in CS because of social media popularizing that they’d all make easy six figures out of college at FAANG. There are tons of CS majors that aren’t actually interested in CS. It’s very rare to major in Physics without liking Physics.",
            "Lots of people get into CS because they think it’ll be an easy degree and guarantee a high paying job so they can’t weather any potential down turns in the job market. I mean look at how many repeating posts we get, you would expect people actually passionate abt the subject to be able to pull up google.",
            "All I know is that C wall for Intro Physics hit way harder than both my Calc II and Programming II classes. 😭",
            "No one is going into physics for the money, lol",
            "Some people in this sub think that as soon as they graduate they have a guaranteed 6 figure job. They fully believed the lies tiktok sold to them and put in minimum effort to upskill and network. Then they come here and complain about CS being useless lol",
            "In the 1980s, I shared an office with a guy who had a PhD. in Physics. He was working as a Fortran programmer/IMS DBA. I taught him Mainframe Assembler.",
            "one thing i have learned from reading this sub reddit is that every single person here needs to get laid, touch grass and or some combination of both",
            "People just buy into media narratives too much. The headline \"The jobs that pay people tons of money in companies with filthy rich CEOs are having trouble\" are great and gets tons of clicks.\n\nThe reality is that CS jobs are fine. Sure getting 300k/y straight out of school is harder. But getting 80-150k/y is still common and probably will be for the next 15-30 years. People need and want tech, and people need someone to develop it.\n\nThe economy WAS in a rough place post covid. It's getting better and will return to full speed (if it hasn't already). We will still make more than physicists for the foreseeable future.",
            "Honestly, that's probably why I take it chill. I actually like Computer Science, knowing that it generally pays well is a bonus.",
            "more passionate CS talk, it’s goated",
            "[deleted]",
            "A LOT of people get into CS for money. Most People get into physics cuz they like physics. If CS had shitty job prospects and resulted in like average salaries, this sub would be more interesting",
            "Probably because a chunk of students go into cs or engineering for the money and job prospects. Whereas in areas of study like physics or maths people do it for the love of the subject and less about the high paying jobs at the end.",
            "Tbh when I joined this sub, I just thought this sub is meant for asking questions like this",
            "I knew someone that was a physics major, they went into teaching. \n\n&#x200B;\n\nIt is possible to get a good position though, someone from my HS majored in physics and they got a securities analyst position right out of school.",
            "I totally agree with this and could say that few people are actually \"passionate\" for computer science. Let me explain - What's the first thing you see when you hear Physics major ? Dedicated few people who are constantly learning within a domain that is not constantly growing at such a fast pace as CS. Compare that to CS - You see dudes chilling out and making top bucks. You can do that by ending in top companies. And you do that by learning the latest technologies being used. This becomes a cycle and hence what gets discussed most is getting a job",
            "Physics majors mog the fuck you of any CS major, and if they learn a bit of programming can kick the shit out of CS majors in the job market.\n\nGet dunked on.",
            "People in that sub haven't yet been hit by reality, plus they love their field more. People in this sub are way closer connect to the real world, and so adequately recognize the challenges ahead of them.\n\nWhich is why, ironically, in 5 years a way higher fraction of people in this sub will be working in something related to their major than people in r/PhysicsStudents.",
            "If you think physics majors have bad job prospects… you need to wake up lol. Programming, instrumentation, and experiment design is all a major foundation of a physics education. These are highly sought after skills, in a wide range of industries. And it’s important to note that most physics majors don’t pursue careers as what people would think of as a traditional physicist. I’d even go as far as to argue that physics students have better job prospects after graduating, so long as money is not your only indicator of a good job. Actually I do argue this point nonstop with my CS friends on the hunt for a cash grab.",
            "how many of them have to grind leetcode"
        ]
    },
    {
        "post_id": "11n09vu",
        "author": "Terrible_Republic_59",
        "title": "Palintarded",
        "url": "https://www.reddit.com/r/csMajors/comments/11n09vu/palintarded/",
        "score": 478,
        "num_comments": 52,
        "created_utc": 1678387889.0,
        "selftext": "Why does palantir keep interviewing new grads, pushing them through to the final stage, telling them headcount is filled, and then the next week posting the same job on LinkedIn again?\n\nAre recruiters just trying to get their numbers up so they don't get laid off like the ones that recently did?\n\nSource: Happened to someone I know mid December, happened to me mid January, and happened to someone I on this subreddit mid February, all for US positions SWE/FDSE.",
        "permalink": "/r/csMajors/comments/11n09vu/palintarded/",
        "comments": [
            "100% agree - was led on for 1 month (after 3 months of interviews) and was continuously told that I’d receive a written offer EOW and that I should ask the other companies which had given me a written offer to push back the deadline. Went with another company after pushing back the deadline and hearing nothing from the Palantir recruiter about my status\n\nVery unprofessional and 0 consideration for the applicant.",
            "Glad i ghosted them",
            "Man this is so stupid. Ik how it feels coursera did this to me.",
            "[deleted]",
            "this exactly happened to me too for summer swe intern. wasted my thanksgiving break studying the systems design interview",
            "i ghosted them this year after a recruiter reached out with me and we had a call. she proceeded to message me another 3 times on linkedin asking me to formally fill out an application…",
            "Just the fact that they use that shitty interview platform called Karat is enough to hate Palantir IMO",
            "I applied there last year and the recruiter told me that after the initial karat they were going to call and discuss the next steps. That call turned out to be a full blown behavioral interview. Got rejected right after that 🙃. Very unprofessional imo.",
            "bad title",
            "Most of you lack the qualifications of a grad student of an h1b .",
            "I know someone who works there"
        ]
    },
    {
        "post_id": "10x6fix",
        "author": "oopsidaisiess",
        "title": "A side project I am really proud of!",
        "url": "https://www.reddit.com/r/csMajors/comments/10x6fix/a_side_project_i_am_really_proud_of/",
        "score": 475,
        "num_comments": 43,
        "created_utc": 1675880025.0,
        "selftext": "Right before the new year, my new grad offer got rescinded. This severely affected my mental health and I was really close to falling back into depression. Exactly 3 days after hearing the news, I decided I won't be a victim and that I would work on my self and my technical skills all throughout January. \n\nHappy to say that I went to the gym 5 days a week and finished working a side project [chatbase.co](https://www.chatbase.co). It's a website that lets you upload any PDF and creates a chatbot that can answer any question on it while citing the sources.\n\nAnyway I just wanted to share my successes and how I bounced back after hearing bad news.",
        "permalink": "/r/csMajors/comments/10x6fix/a_side_project_i_am_really_proud_of/",
        "comments": [
            "Very cool.\n\nEdit: that’s putting it lightly. GOOD FUCKING JOB. You didn’t sit around with your thumb up your ass. You worked out and improved your mental and physical health. You focused on honing your skills and built a kick ass tool. You and your parents should be very proud.",
            "dope shit",
            "This is a genius idea!!!!!! Very impressed any company would be lucky to have you!!!!",
            "This is awesome.\nSeriously.\n\nAlso, if you haven't already, talk to a lawyer about copyright law *now*. The legality of processing other people's copyrighted works to create a derivative work - even as a service modifying legally owned content for someone's private use - that's murky. See Disney vs VidAngel, for example.\n\nThat said - this is so legit! I WANT TO USE THIS FOR AWS DOCUMENTATION.\n\nAhem. Consider that a feature request while I go finish my Hobbiest-level sign up!",
            "Damn dude. Well done. \n\nNext time you’re doubting yourself, remember that time your offer got rescinded and you worked on a cool project and stayed healthy by going to the gym.  You just proved to yourself that you won’t let life knock you down.",
            "Did you use machine reading comprehension",
            "Good shit dude! That’s a legit project I’ll try it out it seems great help for studying!",
            "The site says that you’re using one of openAI’s engines, but it also says that you can “build a chatbot”. \n\nAre you simply feeding the document to one of OpenAI’s language models through API?\n\nHow is this different than me feeding GPT3 the same document and then asking questions?",
            "You hiring entry level?",
            "Did you use chat gpt api for the analysis ?",
            "Cool idea, would love to see the repo if possible or you can dm me",
            "this is so sick. website ui is also dope",
            "Whoa this website is psych ! \nJust out of curiosity, what payment service did you integrate into your site ?",
            "You must be really proud of this, it's sick as hell :))). I'm happy for you and wish you luck with the new grad search out there! I imagine it feels frustrating and discouraging to have an offer rescinded. The conditions out there certainly aren't too great so I empathize, it must be difficult...",
            "Aww this is so awesome!!! Congratulations, OP!! Celebrating this success with you :)",
            "That's an awesome project and come back from a low. Good work.",
            "This. This is what I’m talking about. Props to you, good shit.",
            "this is so cool",
            "Phenomenal, the UI is clean af too",
            "Bro this shit is so inspiring I wish to be a creative dude like you know man. Love this bro.",
            "Freshman here, is your project on GitHub? Would love to see how you accomplished something like that haha",
            "nice !",
            "This is great? What models are you using? I want to learn more about this.",
            "Woow, this is soo cool !!!",
            "super cool. did u generate embeddings for the texts? if so what sort of database are u using to store? pinecone DB?",
            "Damn, I just started drinking a bottle of whiskey a day and thought that was impressive",
            "yo amazing job!",
            "This is amazing!! How did you do it?? Is it open sourced?",
            "Insanely inspiring. Love it man :)",
            "Which company? Name and shame",
            "This looks super cool.\nI was going through the website and you mentioned you will add a feature to get scrape data from clients website. Let me know if you need help in that.",
            "Freaking cool, congratulations on all your hard work paying off !!",
            "This project goes insane, respect",
            "This is amazing- as a side point though, how do I convert a webpage (such as the AWS documentation) into a OCR readable pdf?",
            "Your ratemyclasses website post being pinned on ufl is doing great things for your clout. This website is super cool. Can't wait to see what else you make!",
            "Also, how do I shorten a PDF that is too large for the system to handle?"
        ]
    },
    {
        "post_id": "ih4zwh",
        "author": "csthrowaway1009",
        "title": "Interned at FAANG and Unicorn and I still bomb interviews",
        "url": "https://www.reddit.com/r/csMajors/comments/ih4zwh/interned_at_faang_and_unicorn_and_i_still_bomb/",
        "score": 475,
        "num_comments": 48,
        "created_utc": 1598468365.0,
        "selftext": "A lot of people out here get discouraged when they come across a algorithm problem they can't solve, so I just wanted to provide a perspective. \n\nI interned at Google/FB and a top unicorn. Had a phone interview today and I bombed it. Question wasn't even that hard in hindsight, I got a bit flustered and wrote code that didn't make sense and was full of bugs as interviewer pointed them out. \n\nThese interviews don't get easier just because someone has interned at top tech companies. It's still a b\\*\\*\\*\\*. I often still mess up on simple problems and question whether I'm a good programmer/engineer. Point is, it's ok to fail and to be discouraged - it happens to everyone but don't for a second think that you are somehow lesser of a CS student than your friends who have shiny internships. A career in tech really is a long journey and this is just the beginning for all of us. \"making it\" does not mean finally getting a FAANG offer, trust me.",
        "permalink": "/r/csMajors/comments/ih4zwh/interned_at_faang_and_unicorn_and_i_still_bomb/",
        "comments": [
            "I interned at FAANG and still don’t even GET interviews, much less bomb them.",
            "Needed to hear this. Thank you",
            "I had an internship at Google. I was about to finish my masters degree and I had JUST gotten the highest grade in graduate level graph algorithms. Facebook came to campus and was conducting in person phone interviews per se. I go in and the guy gives an intro and goes \"suppose I have a tree structure and I want to print out the different levels, how would I do that?\" \n\n\nI respond \"I would do BFS!\"\n\nHe goes \"YUUUUUUP! Can you code it?\"\n\nI go \"YUUUUP\". And then I proceed to completely bomb it. I freeze. I completely forgot that BFS uses a queue, so I was trying to do for loops. I was beyond embarrassed. I capped my pen, apologized, and walked out. \n\nIt was a good lesson that being good at school doesn't directly correlate to interviewing. Of course, I then went on to bomb interviews at any company I could think of. I eventually passed an interview for a small startup that lost money after 4 months. I then got a job at a really good start up which got purchased by big N and everything is swell now.",
            "You had to code something during your phone interview? The fuck",
            "Posts that ground our expectations are much welcome and do a lot to help prevent a toxic expectation of greatness.",
            "What is Unicorn?",
            "Thank you! I was feeling like I’m so stupid. This helps a lot.",
            "These technical interviews are such bullshit. \n\nThere is no correlation between being able to write good code and knowing algorithms. You learn as you go.\n\nWhat makes a good programmer is the ability to write code that is correct, self explanatory, and well documented all at the same time. \n\nShit is ridiculous. Fuck FAANG I would never be a code monkey for these evil fucking companies that track their users and create the content that is causing the destruction of society. Creating the mind control tools.",
            "holdup so they ask u a question and u pretty much gotta memorize it ?",
            "At least you have faang experience so you are going somewhere. I am not even landing a single internship and sometimes it really makes me think if I will ever get a swe job.",
            "I needed to hear this. This isn't a Sprint... It is a marathon",
            "Glad to hear it’s the same for all of us haha 😂",
            "This problem vanishes with practice. Leetcoding under pressure is a separate skill from being a good worker. Totally reasonable to stumble on the real deal. Just gotta grind out mock interviews the week before so it’s muscle memory.",
            "[removed]",
            "It might not be super helpful, but your perception could be fucked and you're interviewing better than you think? I landed a great job post grad and I 100% thought I was a dipshit and would get ghosted. Idk man, it depends on how well everyone else interviews/the reqs of the position.",
            "[deleted]",
            "How did you get an internship at a FAANG with such poor interview skills? nepotism?"
        ]
    }
]