[
    {
        "post_id": "1252fpz",
        "author": "Economy_Version_3760",
        "title": "Finally!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/1252fpz/finally/",
        "score": 481,
        "num_comments": 120,
        "created_utc": 1680037798.0,
        "selftext": "After 400+ applications I finally got my first internship offer. I honestly can’t believe it.",
        "permalink": "/r/csMajors/comments/1252fpz/finally/",
        "comments": [
            "Hell yeah! Congrats!!! It's your first step, you're gonna do great :))",
            "Is it a SWE internship?",
            "LETS FKN GOOOOOOO!!!! Keep it up fam",
            "Congrats! The first one is always the hardest.",
            "Congrats! Which year?",
            "Congrats! I just accepted my first offer today as well! It feels good to finally have it out of the way. Hope yours goes well",
            "Care sharing your gpa kind sir or madam?",
            "Congrats! As a junior, I can’t express the relief I had after getting that offer. If you feel like it, could you share info?\n\nMine is a private finance firm in NYC, $28/hr. I’m an international undergrad, junior at a no name uni.",
            "Congratulations! You deserve it! I wish you nothing but the best in your future!",
            "Which company?",
            "Awesome! I can’t imagine how accomplishing this feels. Can you share what you think made you stand out?",
            "Congrats man, this season was rough. You never know when one is gonna pull through. I put out ~210 applications this season for a total yield of 2 offers. I had friends who submitted 12 and got an offer. Really is just a roll of the fucking dice.",
            "Which company it is?",
            "Are you an international student studying masters program?",
            "Yoo congrats!",
            "Can you DM me the company name?",
            "startup or midsize company？",
            "Great!",
            "Congratulations! Hope your career pans out and you achieve what you want in this field!",
            "Congrats!",
            "Congrats man!",
            "Congrats! May I ask you when did you apply for this job?",
            "Go you!!!",
            "Congrats!!",
            "Congrats! It feels great. Ride that feeling out until it starts, then put in the work and get that return offer (;",
            "Congrats mate! Have a great start to your Professional Career.",
            "I can't believe it either :P. Congratulations",
            "How many interviews did you do?",
            "congrats",
            "Congrats!!! Your hard work paid off!!!!!! So happy for u bud!😋",
            "Congrats man! How was the interview process? That’s what I am so nervous for if I get accepted I feel like I’m not ready",
            "Congrats! How was the interview process like?",
            "SLAY",
            "Definitely the best feeling ever. congratulations !!!!!",
            "Whoop whoop! Congrats on your accomplishment.",
            "Is it for Amazon SDE intern position",
            "How did you get nothing after 400 applications lols? Can you tell us more about that? I'm no top student but I at least get some interviews and almost 99% of the time I completely don't know something they want and they let me go.",
            "Congratulations 🎉🎉, \n\nWould you mind sharing how many times you had to upgrade your resume in this process? I have been applying on LinkedIn and all I've gotten so far are rejections. IDK what to do, it really is a stressful process.",
            "LETS FUCKING GO!"
        ]
    },
    {
        "post_id": "jh1q94",
        "author": "None",
        "title": "Today I bombed lc medium problem so bad that the interviewer asked whether I wanted to reschedule the interview and act as if this never happened :(",
        "url": "https://www.reddit.com/r/csMajors/comments/jh1q94/today_i_bombed_lc_medium_problem_so_bad_that_the/",
        "score": 477,
        "num_comments": 73,
        "created_utc": 1603509260.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/jh1q94/today_i_bombed_lc_medium_problem_so_bad_that_the/",
        "comments": [
            "Wow lucky to have a great interviewer",
            "at least you get another chance!",
            "Dude interviewing you must've instantly foound out you are sleep deprived. Nice person. You are very lucky! I hope you can clinch the position, good luck!",
            "thats amazing! if only more interviews were like this haha",
            "Wow what company is this?",
            "lol, what question did you get ?",
            "Fuck me am I glad companies in my country don't do leetcode style interviews. I much prefer actual take home assignments that at least test some actual practical knowledge.",
            "that’s great. just grind your ass off before the next round",
            "Nothing like a cool interviewer.  Makes all the difference.",
            "Look if you aren’t feeling up to something, don’t be afraid of rescheduling man, you’re an adult who can make their own decisions",
            "Grind or die",
            "Wow. Looks like you also got interviews with a ton of prestigious companies, and you don't go to an elite school. Why do you think you're getting so many interviews?",
            "at least u can reschedule lol",
            "Nice, definitely not a sad moment but a extremely rare happy accident."
        ]
    },
    {
        "post_id": "t18y7z",
        "author": "AnonymousCSRantAcc",
        "title": "I went from 0 lines of code to Google in a year",
        "url": "https://www.reddit.com/r/csMajors/comments/t18y7z/i_went_from_0_lines_of_code_to_google_in_a_year/",
        "score": 480,
        "num_comments": 85,
        "created_utc": 1645808825.0,
        "selftext": "I really feel like you can do anything as a CS major, and although my story isn't standard I think there's some value in it.\n\nI went to a business school for a semester fall of 2020 and hated it. I had never written a line of code but I happen to learn the absolute bare bones of python in one of my business classes. After a semester of continuing to learn Python and researching CS/Data Science, I decided to pursue that path. My school sucked for CS, I was warned by the upperclassmen, and overall I didn't like the small school vibe so I dropped out in the second day of the spring semester.\n\nMonths with nothing on my plate, I decided to dive into projects and leetcode. Somehow I managed to get an internship at a local small tech company doing web dev (React and C# [ASP.Net](https://ASP.Net)). Honestly I think the company made a mistake in hiring me, but it played in my favor and I was able to learn fast enough at the internship to keep pace.\n\nAn important note is that when covid hit a year before, I spent a lot of time reading self help books, working out, meditating, building good habits, and I think all of that was key in keeping myself disciplined and motivated to learn without a formal academic environment.\n\nFor leetcode, I read a data structures and algorithms textbook and did a problem or two a day. Easys were a struggle at first, but eventually, I got to the point of comfortably doing mediums.\n\nAlso, I am lucky to have parents that we're able to let me grind away in my bedroom rent-free for a few months. I did keep a part-time job just for some cash flow but most of my time was learning to code and making YouTube videos. That doesn't mean I wasn't reading books, rolling a TON of Jiu Jitsu (got a blue belt in this time period), and visiting my friends to party and hangout at their schools. You can grind AND have a well-rounded life.\n\nWhen internship season came this last fall I was a CS student at a large state school taking intro to CS, calc 3, linear algebra, physics, and intro to computer graphics. I applied to a ton of companies, did a few OA's, but pretty early in the process I had an interview with Amazon and I got the offer. I pretty much stopped the grind after that because classes were becoming too much to do while leetcoding heavy. I did get denied from General Motors, FaceBook, Capital One, and a couple other's who's OAs I failed.\n\nIn January I got a Google OA months after applying and went through the interview process. I did apply with a referral from someone I interviewed on my YouTube channel.  I got in. After only intro to computer science which I hadn't even finished when I applied.\n\nThere is a lot of luck in this story with the good parents, local internship, and other little things, but I want the moral of the story to be if you really grind anything it is possible. I think that the luck sped up the timeline, but that so long as I grinded it out I would have been able to make it eventually.\n\nSo thats (in very broad strokes) how I went from 0 lines of code to Google in a year (and a half-ish). I am picking Google over Amazon. The offer expired while I was in project search so that was nerve breaking.\n\nAsk me anything.\n\nThe DSA book was Data Structures and Algorithms in Python by Goodrich.",
        "permalink": "/r/csMajors/comments/t18y7z/i_went_from_0_lines_of_code_to_google_in_a_year/",
        "comments": [
            "Sounds like a lot of hard work and a lot of luck. Best of luck and congrats on your internship!",
            "I’d love to ask you about BJJ. Did you come from a wrestling background? I’m hoping to make the switch now that I’m in college. How many days a week were you hitting the mats before you got blue? Also congrats!",
            "Dang",
            "[deleted]",
            "That's inspiring. I'm a hs senior learning Java and trying to get into projects and leetcode soon, but it's hard staying consistent. I would like to know what self-help books you read!!",
            "Congrats! It does sound very lucky though that you got past resume screen. I know many experienced students with years of work experience in tech and projects not get to OA at Google. Good luck!",
            "I did the same with Amazon. Started coding in November 2020, had Amazon offer a year later. Y'all can do it, just stick to the grind.",
            "how did you taylor your resume with limited CS experience besides the internship? I am in a similar situation so I am wondering. And did you get into the role that many hires new college graduates or just a general software engineering role?",
            "Congrats from a fellow BJJ blue belt! Awesome story",
            "[deleted]",
            "congrats!!",
            "Amazing!",
            "Proud of you!",
            "What dsa book and how long did it take you to go through it?",
            "Congrats! What books would you recommend?",
            "how do you study, if applicapble? im about to go to college next year, and want to get a headstart",
            "What school you at rn if you dont mind me asking?",
            "wow that's awesome. congrats man",
            "What book did you use to study algos?",
            "I'd award you if I wasn't broke asf. Thanks for sharing man. I just started LC grinding this feb.",
            "ayy that’s super cool. i’m a business student that started coding in quarantine and now i work at nuro. i also train muay thai religiously too! let’s connect!",
            "> eventually, I got to the point of comfortably doing mediums.\n\nWhen you say comfortable, how long were these mediums taking you?",
            "I love this, the importance of self discipline particularly resonated. I'm a graduate dev and been doing all that good self dev with the newfound spare time. It's been so wonderful, slowly building up discipline and getting back into old hobbies, plus I actually ENJOY learning now! Honestly never been happier (at least til the world went to shit again). \n\nHope you get everything you want out of that internship :)",
            "> There is a lot of luck in this story with the good parents, local internship, and other little things, but I want the moral of the story to be if you really grind anything it possible.\n\nlol",
            "BTW. I was no stellar student in highschool, but did take a lot of community college classes.",
            "Lol you calling rent free life with mommy and daddy a “grind” lmfao stop. I can’t imagine how hard your privileged life must be for you.",
            "[deleted]",
            "Would it be okay if I saw your resume? I’m hoping to gain some insight as to what kind of previous experience gets you an interview.",
            "what resources did you use ? Congrats btw OP",
            "How hard were the ds interview questions?",
            "Hey what textbook you read for DSA?",
            "Very inspiring my guy"
        ]
    },
    {
        "post_id": "p4f0tt",
        "author": "None",
        "title": "Got an Amazon SDE summer internship! (went to unknown undergrad school, got C in CS classes) + timeline of interview process",
        "url": "https://www.reddit.com/r/csMajors/comments/p4f0tt/got_an_amazon_sde_summer_internship_went_to/",
        "score": 475,
        "num_comments": 72,
        "created_utc": 1628971337.0,
        "selftext": "I am speechless. I went to a no name undergrad school, got C in data structures, algorithms, discrete math, and other classes and got into fucking FAANG!! I have been practicing leetcode for few hours everyday for past 3 months and it really works guys as long as you are consistent! \n\n\n* Bio: Grad student at a state school, 1 IT internship experience and 1 SWE internship experience at unknown companies.\n\n* Offer Details:\n\n    * Salary: $9350 per month pre tax (NYC total income tax will be like 33% lmao)\n\n    * Rent Stipend: $2425 per month after tax\n\n    * Location: NYC\n\n\n\n\n**I was not in US during interview process but this is the timeline in eastern time:**\n\nFriday, July 16, 2:16AM - submitted application\n\nThursday, July 22, 4:09PM - got invited to 2 part OA (not 3 parts with debugging)\n\nMonday, July 26, 5:42 AM - finished part 1 and part 2 of OA \n\nFriday, July 30, 2:52 AM - final interview scheduling invite\n\nWednesday, August 4, 2:19 PM - Another final interview scheduling invite lol\n\nThursday, August 5, 2:28 PM - final interview time confirmation\n\nMonday, August 9, 4:00 PM - final interview\n\nWednesday, August 11, 3:00 PM - portal update to new location\n\nThursday, August 12, 2:38 PM - offer letter!\n\n\n**Detailed explanation of interview process and prep:**\n\n* Part 1 of OA was hacker rank coding assessment. I got full test cases for first problem, and half the test cases for second problem. In part 2 work simulation, I tried to answer every question using leadership principles. For example they repeatedly asked would I push the deadline to fully finish a project or would I finish the core parts by deadline. I always answered finish it by deadline because Amazon has notorious culture of tight deadlines.\n\n* I got invited to schedule the interview on 7/30 and I selected the 8/2 monday and 8/3 tuesday timeslots. They didn't even confirm my interview selection and did not reply to me at all. After 8/3 passed, they finally got back to me on 8/4 wednesday and asked me to select new timeslots! \n\n* 2 years ago I made it to final round of amazon as well and I crammed like 50 most frequent Amazon questions on leetcode. They asked me an objected oriented design question which is so different from a normal leetcode algorithm question, I bombed it lol. Apparently the question they asked me was 70th most frequent amazon tagged question on leetcode so I almost got to it during my cram session 💀\n\n* This year for prep I didn't do any Amazon tagged questions because I am also preparing for interviews with other companies. Past 3 months I did around 150 leetcode problems (mostly medium and some hard) in a depth first manner. Meaning I would do 10 two pointer questions, then 10 bfs questions, then 10 topological sort questions, etc. You want your brain to understand each pattern well and only focus on mastering that one pattern. Don't move back and forth between 20 different problem types. As bruce lee said, \"I fear a man who practiced one punch 100 times more than a man who practiced 100 different punches once. \" \n\n* My tip for doing leetcode: After doing a problem delete the whole code and code it again. Write down what mistake you made and what key thing you learned for each problem in a notebook. When you do a new leetcode problem, code it again from scratch the next day and one week from that day. Reviewing is probably more important than doing a new problem. \n\n* My tip for behavioral: Come up with 1-2 example per leadership principle and in your answer use STAR format. Also drop in some leadership principle words without making it obvious for example say \"I wanted to **satisfy the customer**\" or \"I took **ownership** of the project.\" \n\n**My tips for coding interview:**\n\n1. First ask questions to clarify everything like is there a null input, negative numbers, are we returning the length of an array or the actual array?, etc. \n\n2. Write down on the board or screen how you would do an example manually using pseudocode or plain english. \n\n3. Optimize pseudocode and explain time and space complexity.\n\n4. Only at the very end, code your solution and test it using examples.\n\nedit. \n\n**I forgot the most important coding interview tip: Communicate!! During the entire coding question round, talk slowly and clearly. Never be silent for more than few seconds. Let the interviewer know everything you are thinking. Even if you are writing \"x = x+1\" say it out loud and explain why you are adding 1 to x.**",
        "permalink": "/r/csMajors/comments/p4f0tt/got_an_amazon_sde_summer_internship_went_to/",
        "comments": [
            "Congrats!!",
            "Lol idk how to format the bullets and subheadings",
            "> Salary: $9350 per month pre tax\n\nThat works out to something like $70/hour?",
            "This is super helpful! Thank you. And congrats!!!",
            "[deleted]",
            "[deleted]",
            "Good stuff!",
            "Congratulations, and great post. This is an incredibly thorough timeline and brief of the Amazon recruitment process, and you provide tips that can be applied to all technical interviews. Very valuable.\n\nDo you know if Amazon sponsors visas for work in the US? Like, I'm from Canada, and I know some companies do TN visas (i think TN i could be wrong) for FT SWE positions but companies offering visas for internships are usually more sparse ime",
            "Congratulations buddy.",
            "congrats!",
            "I just want to say congratulations and also I appreciate you detailing your grind and hardwork to show others how it is done instead of just making a post that says “yaah i got in”. Best of luck!",
            "No offence but what is your gender, ethnicity and age?\n\nAnd did you go to private school?",
            "Wow, congrats! I didn't know Amazon paid this much! Good job!",
            "[deleted]",
            "[deleted]",
            "That’s so awesome! Congratulations!",
            "YEEEEEEEWWWWW",
            "Where do you see the housing stipend amount? I couldn’t find it anywhere in the packet, only the monthly.",
            "I believe the NYC / Bay Area salary is more due to taxes. They're giving out $8500/mo for the Seattle region.",
            "Congrats. Could you describe the interview in more detail?",
            "For the coding OA, what kind of problems did you get? DFS, BFS, algorithms, etc.?",
            "Congrats man! How hard was part 1? I just realized I have the two part OAs as well and thought I would have a little bit more time to prepare for the coding assessment. Any last minute tips?",
            "What project or other coding experience did you have. (Asking so I know what tech/languages i should learn)",
            "How was your interview technical questions?",
            "Congratulations!",
            "This was so so insightful, I love posts like this which so in depth with the process. \nI had a few questions, if you don't mind. \n1) Are you a US citizen or an international citizen ? \n2) What were the levels of questions ? Easy/ Medium and what were the topics ? Graph ? Trees ? \n\nAnd also, congrats for the offer !!",
            "Wait, Amazon interns are making more than Amazon FTs?",
            "Where are you located? Whats your uni? Hope you don't mind telling!",
            "Congrats!",
            "Congrats. Can I dm you for some questions about OA2?",
            "Congrats man 🎉, I’m a junior undergrad also looking for internships. Working hard for it 🤞.",
            "Was it through a referral cause for me the problem is getting an interview in the first place!",
            "How long do they give you to accept your offer? I'm not sure if I should apply yet because some of the other companies I like haven't opened their applications yet, so I want to try to make it so that I have options.",
            "what is the best approach to learn DSA from scratch ?"
        ]
    },
    {
        "post_id": "15hceny",
        "author": "Tam_Ken",
        "title": "I got a return offer from the company I interned at this summer!",
        "url": "https://www.reddit.com/r/csMajors/comments/15hceny/i_got_a_return_offer_from_the_company_i_interned/",
        "score": 472,
        "num_comments": 45,
        "created_utc": 1691088553.0,
        "selftext": "I had a meeting today with my manager and got my offer, I was insanely anxious for the half hour or so leading up to it and couldn’t do any work. It feels like most of what I see on this subreddit is doom posting, so I figured I would share some positive news for once",
        "permalink": "/r/csMajors/comments/15hceny/i_got_a_return_offer_from_the_company_i_interned/",
        "comments": [
            "my manager told me today on my final feedback review that I was performing on a junior engineer level rather than an intern and i crossed the intern expectation bar by much but they cant offer me a return offer because im an international student and they're currently not doing visa sponsorship for entry level roles :(. But congrats on your return offer!",
            "When do you graduate? If I graduate 2026 is it appropriate to ask my manager for an offer? Its a big enterprise company. Also congrats!",
            "Congrats 🎉",
            "north pocket plant illegal impossible literate school normal meeting paltry ` this post was mass deleted with www.Redact.dev `",
            "Congrats. I just asked yesterday but I am waiting for a reply. My company is in a hiring freeze rn",
            "W",
            "At what point in your learning do you intern? Asking cause I'm about to start to learn cs",
            "Congrats",
            "Congratulations",
            "Congrats !!!",
            "Congratulations OP!",
            "Right on!",
            "Congrats ! 👏🏾"
        ]
    },
    {
        "post_id": "xawx0q",
        "author": "lowhearted",
        "title": "Yes, this new grad cycle is horrible",
        "url": "https://www.reddit.com/r/csMajors/comments/xawx0q/yes_this_new_grad_cycle_is_horrible/",
        "score": 472,
        "num_comments": 87,
        "created_utc": 1662835837.0,
        "selftext": "I've seen a few posts/comments on this sub asking if new grad is usually this bad. It usually isn't. *Majority* of companies that I applied to last year (for internships) don't have any new grad roles this year, while they did last year.\n\nEvery one of the FAANGs is on slow hire or freeze.\n\nWith the interest rate hikes, layoffs, and overall bear market, everything is on low headcount right now! If I didn't have any return offers, I would probably go back to school for another year.\n\nGo down the list of the pittcs intern repo and check for yourself how many companies also have new grad opportunities.",
        "permalink": "/r/csMajors/comments/xawx0q/yes_this_new_grad_cycle_is_horrible/",
        "comments": [
            "I just hope I can get a job man.",
            "Yes. I still see quite a lot of internship opportunities available. For companies, this is the best approach to take since interns are temporary so there's not much risk. When/if the economy recovers to a level for expanding HC by next fall, they can always extend return offers for those interns. For new grads, it's much trickier since financing a FTE is much much more riskier for companies. It is sad to be a 2023 CS grad (but probably still better than 2001 CS grad xD).",
            "As an international student who’s about to graduate this Dec, I can barely breathe looking for a job in this cycle.",
            "It’s definitely worse than it’s been in the past, but I really think choosing to go back to school for a year is definitely an overreaction at this point. It’s still only september.",
            "And ofc I’m the one bum that did not get a return offer outta all my fellow interns 🥲",
            "Man it's rough even with Meta/Amazon on my resume, I can barely get an interview/OA. I can't imagine how it is for those without any experience. I graduated already thinking I could get a return offer, but the hiring freeze might make me go back for masters hopefully.",
            "Amazing how fast things change. 5 years ago CS students were basically guaranteed a job as long as they had above a 2.8 GPA.\n\nI remember my CS classmates chasing through school not giving a shit.\n\nNow most of tech has straight up quit hiring new grads unless you interned with that specific company. And even then, interns aren't getting full time offers right now because of freezes.",
            "Yeah…My return offer was delayed, but I eventually got it. The amount of return offers that my company gave out ended up being lower than they projected when I accepted the internship though (I asked). While my return offer was still being considered during the delay, I applied to a ton of other places (aka, the 40 some postings I was able to find) and got ghosted after the OA’s despite usually solving all the problems/getting what *should* have been a good enough score to move forward any other year.",
            "In this economy, what level of job is attainable with a prior Amazon internship? Seems like for companies with equivalent pay to amazon, the hiring bar for resume screening is insane and I can't pass any.\n\nI have revised my resume multiple times.",
            "Did we actually expected any better?\n\nI mean, economy is in a  free fall in 1st world and China, inflation is not bring controlled and society is kind out of whack...\n\nAs for FAANG freezing hiring - of course they would. It's only them - most of the IT sector is slow now.\n\nRetail and trade is hiring, though.",
            "Got an offer, no pay though. Lmao I didn’t even bother contacting back",
            "Ofc its during a bad cycle when Meta betrayed us meta interns. So much of “Meta, Metamates and Me” motto",
            "It’s only going to get worse. The fed is still raising rates to intentionally crash the economy. The reason inflation is so high is because people are spending so much. And they won’t stop spending until the economy gets worse. So far inflation is still very high so expect more pain for the next year.",
            "Welcome to the recession.\n\nAs a '06 grad, I can tell you the suck but should get better in a couple years.",
            "With an internship at Tesla and Ubisoft and a Master's degree, I haven't gotten one interview yet! And I'll graduate in Dec.",
            "I would absolutely NOT go back to school for a year. A masters or PhD is mostly useless for outside academia. Especially from a no name university.                                \n                      \nI graduated in 2019 from a party school and the amount of “I’m paying for this degree so I automatically get a C” students I saw was absurd. The degree itself is becoming more devalued.             \n                                  \nIf I was a struggling new grad I’d fight for any relevant experience (geeksquad, IT, intern, consulting, etc) and keep applying for new grad roles until I get my first SDE title.",
            "Any summer  intern at Redhat got a return offer?",
            "I heard the same thing back when I graduated…the fact is, due to outsourcing, this hyper competitive market with falling wages is the new normal.",
            "I hope this cycle isn't as bad next year 2024 grads",
            "[deleted]"
        ]
    },
    {
        "post_id": "1ajbs3k",
        "author": "Jerry-Aggie",
        "title": "Finally, I got my first full-time offer",
        "url": "https://www.reddit.com/r/csMajors/comments/1ajbs3k/finally_i_got_my_first_fulltime_offer/",
        "score": 475,
        "num_comments": 95,
        "created_utc": 1707121757.0,
        "selftext": "After applying for almost 1000+ SDE positions, I finally got an offer from Bambu Lab!!! This is a unicorn company that makes 3D printers, and I think it has great potential.\n\nDo you guys have any knowledge about their products? Some advice plz.",
        "permalink": "/r/csMajors/comments/1ajbs3k/finally_i_got_my_first_fulltime_offer/",
        "comments": [
            "Never seen a comment section this brutal before. Dude just wanna feel good, but got shut down instead.",
            "I own a printer from them.  Great hardware and even better software integration. As someone who isn’t pathetically insecure about my own career prospects, congrats!Definitely a win.",
            "I love how people are trying to put OP down as if they're not unemployed and struggling to even get a call back lmao",
            "Ruthless comment section",
            "Congratulations. You beat 90% of other CS students by having an FTE offer. But I'd also suggest to continue interviewing. Just as a fallback.",
            "Lmao anyone who talks bad about your offer is jealous of it",
            "Congratulations",
            "People really trying to dig up dirt on the company OP got an offer from - they are not the CEO, just someone looking to get professional experience, which they will get. It is okay to be happy for other people",
            "I can smell this comment section",
            "Congrats! Take every opportunity to learn as much as you can - start ups are great places to get a packed resume.",
            "no hate but definitely not a unicorn company dawg",
            "What’s wrong with Bambu Lab? They might be hated by the 3D printing community for being closed source but they definitely are up and coming. Great job OP",
            "Congratulations! Good stuff",
            "congratulations. that’s huge",
            "Congratulations!🎉",
            "You should continue interviewing. They don’t seem to have a good future.",
            "Grats bro, dont listen to the haters.  Im not a 3d printing guru and I cant tell you if their products are good or not but i have heard of them and was considering buying one at one point.  So make of that what you will.",
            "Congrats!!",
            "![gif](giphy|ZhvduEq5hWKYsmhRAJ)",
            "No knowledge. Advice?\n\nRead their documentation and go through repositories.\n\nIm always doing it first two weeks of work. Then everyone is super impressed with me i hear opinion 'man you are here a month and it feels like You work here for years amazing!'\n\nThen i can be lazy for years because first impression is what matter the most.",
            "Man you guys suck LOL smelly CS majors praying on downfall",
            "https://preview.redd.it/m1k702bdztgc1.jpeg?width=608&format=pjpg&auto=webp&s=7548d690b8bc6f07a3fcd2c476e8ae7a094975f9\n\nMy emotions be like after reading the comments.",
            "Congratulations 👏",
            "Congratulations!!! That’s amazing",
            "Congratulations!! getting an offer in this market is a win",
            "Hopium",
            "A fellow aggie, by any chance?",
            "Nice job. They’re printers are pretty good. My research lab has 4 of them. Out of curiosity, what kind of work are you doing? Is it pure programming or is it also some hardware stuff with embedded systems?",
            "Wow! a full time job offer? Man that is really something to be proud of! You can now join the rest of the hard working Americans in this country, Congrats!",
            "Congrats! The market is super tough rn :)",
            "Congrats OP.Idk much about Bambu labs but may I ask, did you change your resume throughout this application process?\nWas there a point at which you started getting more callbacks?\n\nAlso how many interviews did you get from the applications?",
            "[deleted]",
            "Amazing work, congratulations",
            "Can you share your stack and prior experience ?",
            "Did you graduate already? Did you have any internships?",
            "Not a unicorn more like a flop 😂 but congrats tho for the 🅱️nternship",
            "[deleted]",
            "Congrats about the offer, I don't think the company is gonna have issues as some other guys say, every company has done recalls in the past.\n\nBut holy hell dude, 1000 applications? How, why. Didn't you after like 100 applications think \"maybe i'm doing something wrong, or maybe my resume is trash\" ?",
            "This is an shill post",
            "![gif](giphy|G4ZNYMQVMH6us)",
            "https://www.theverge.com/2024/2/4/24061794/bambu-lab-a1-3d-printer-recall-heatbed-cable-damage",
            "screw the other comments, be the one that turns this company around. run that bitch. but yeah keep interviewing for sure lmao",
            "Congrats, a huge 3D printer associate I know said those are the printers they would personally get.",
            "Congrats!   \n\n\nKeep on learning and do your best!!",
            "Congratulations!!!! Dont mind the comment section, people are jealous and envious",
            "Congrats! They have some of the best printers out there!",
            "Congrats!!!",
            "Worlds collide - I’m a SWE and tinkerer, have 2 Bambu printers. Honestly you should buy a printer so you can learn more about their products.",
            "Congratulations! Good luck on starting your career. ",
            "Congrats bro enjoy!!",
            "Epic!",
            "You’re first full time offer? You can get offers that are part time?",
            "Well done man!! Keep grinding though",
            "congratulations",
            "70k in NYC or SFO way different than 70k in Pittsburgh or Indianapolis....Just saying"
        ]
    },
    {
        "post_id": "16imvf7",
        "author": "-Niio",
        "title": "Interviewer said I had seen this problem before, I had not.",
        "url": "https://www.reddit.com/r/csMajors/comments/16imvf7/interviewer_said_i_had_seen_this_problem_before_i/",
        "score": 472,
        "num_comments": 43,
        "created_utc": 1694708862.0,
        "selftext": "Basically title.\n\nI was interviewing and they gave me a problem. I talked through two solutions. They responded \"You have seen this before.\" I said \"no I have not.\" They DID NOT believe me. I coded the solution. The problem was fairly easy, I think most people would find it. Maybe others had been struggling with it?\n\n&#x200B;\n\nThey gave me another problem afterwards. I did say I had seen this problem before. They responded, \"Thank you for being honest this time.\" I coded the solution and it was fine.\n\n&#x200B;\n\n??????? The rest of the interview was rough, they seemed extremely dismissive and uninterested. I just want a job plz\n\n&#x200B;\n\nEdit: I would say company name but it would dox me. Small (publicly traded) hardware-tech-oriented company. 60-70% here would know their name, but not many people work there. Sub $50B company.",
        "permalink": "/r/csMajors/comments/16imvf7/interviewer_said_i_had_seen_this_problem_before_i/",
        "comments": [
            "[deleted]",
            "I honestly don't think this is a company's fault, but more of a single employee ruining it for the whole. I would message your recruiter about this experience. If the company culture is good, they'll take it seriously.",
            ">They DID NOT believe me.  \n>  \n>\"Thank you for being honest this time.\"\n\nI would definitely complain to the recruiter about this kind of behavior. I would never communicate this way in a professional setting, even if I were 99% sure that a person is lying.",
            "Interviewee fails test: *Should have prepared more* \nInterviewee nails test: *Must have cheated*",
            "company red flag",
            "Once they said \"Thanks for being honest this time\" I would've just hung up. But I'm desperate so I probably wouldn't have done that.",
            "What company so we can avoid it",
            "spray them right in their face holes with a water bottle and say No with an authoritative voice. maintain eye contact, spray them again, and give them a little eyebrow raise with a small head nod. \n\nnormalize spraying misbehaving adult shaped people with water bottles.",
            "Even if they hired and your first task was to fix a bug and you did it in an hour, they would say:\n\n“You fixed this bug before.”",
            "Then the companies only real recourse is not to use hacker rank/leetcode problems or accept that this is the norm of people memorizing patterns because it seems to be a large part of this industries hiring process. \n\nYou can't get pissy and expect people to have never seen the problem or something similar when a barrier to entry is knowing how to identify those problems quickly and coming up with an optimal solution.",
            "For some reason there are a lot of asshole interviewers in CS",
            "You don’t want A job. You want a job with a decent company culture so you won’t get burned out in a month",
            "Is there a even point in telling someone they have seen or haven’t seen the problem before? IMO thats such a dumb way to interview someone. They should be evaluating your explanation skills not your raw problem solving skills.",
            "This is ridiculous. So they want someone with decent DSA skills or whatever question they asked you but who has never practiced or seen potential questions? smh. \n\n&#x200B;\n\nMy two cents:\n\nIf you get the offer, expect a very toxic environment/coworkers; \n\nIf you don't get the offer/next round, consider yourself lucky, even if you don't think so at the time.\n\n&#x200B;\n\nWith all of the bad experiences people are sharing, I'm wondering if it's just the norm in our industry, or if it's because the market is 'flooded/bad,' causing companies to act this way.",
            "Was it Garmin? This almost exactly happened to me when interviewing at Garmin haha",
            "name and shame",
            "I don’t see the problem of seeing a problem before . Lol that’s a good thing … means you’re been studying and trying hard . Fuck that guy that interviewed you .",
            "You should reach out to his boss and put him on blast for being an insufferable, rude shit.",
            "What were the problems?",
            "[deleted]",
            "What an AH thing to say.  As someone who has interviewed, I can't imagine ever saying something like this.\n\nWho cares if you saw it?  I would just consider that study/prep?  Maybe there is the odd person who can study the EXACT right things and get through a rigorous interview/testing process while not having adequate technical skills.  But I suspect that is pretty rare.  Being able to discuss back and forth and answer questions should be pretty telling if the interviewer actually has technical skills.  \n\nMaybe the poor thing was feeling inadequate.",
            "You wouldn't want to work there anyway. Imagine this is how they treat someone in an interview how they will treat you if you are on their team.",
            "don't work with/for people who don't trust you even tho you just met and you're qualified",
            "Thanks for not sharing either problem or the company name. Super helpful",
            "Having been on the other side, this is a real issue.\nWhen you interview and I present such a question, I make it clear that what I care about is the thought process, not the final answer, so if the interviewee has seen this question, they should say so, so we don't waste our time on a question that won't give us and information.\nHaving set expectations with the candidate, if we get the feeling that they've seen this before and aren't telling us, it's a huge red flag, because that would mean they're lying.\n\nI wouldn't confront a candidate about this, but if I still have suspicions at the end oh the interview, I'll reject the candidate.\nI'd much rather err on the side of missing a good candidate than hiring a bad candidate. A good candidate will likely find a job elsewhere easily. A bad hire will waste my company's time and resources until he can be properly evaluated and (if necessary) fired.",
            "What did they ask exactly?",
            "2 honest questions：“where u from”&“where are they from”",
            "Lol Veeva?",
            "Can you tell us what was the problem atleast?",
            "This happened to me at IBM in 2014",
            "Definitely email the director of talent acquisition or the hiring manager stating honest review of the interviewer in a respectful manner. They’ll give you another interview"
        ]
    },
    {
        "post_id": "113nseq",
        "author": "TEMPERA001",
        "title": "Average Based csMajor user",
        "url": "https://www.reddit.com/r/csMajors/comments/113nseq/average_based_csmajor_user/",
        "score": 477,
        "num_comments": 75,
        "created_utc": 1676544429.0,
        "selftext": "1. TC Maximizer\n2. Lifts weights\n3. 0-4 very close friends\n4. Introvert",
        "permalink": "/r/csMajors/comments/113nseq/average_based_csmajor_user/",
        "comments": [
            "5. Leetcode promoter    \n6. Does not leetcode",
            "0-4 , range inclusive on both ends lmao",
            "I feel attacked",
            "[deleted]",
            "Forget about how many Leetcodes you’ve done. What’s your bench",
            "So the average man, but with a computer?",
            "Based",
            "I feel like a small subset go to the gym but most CS kids I know are bean poles",
            "It’s not really TC Maximizer, but TC Minimax. More people here would take prestige or a company that would lead to more tc than just purely TC max",
            "[removed]",
            "yeah pretty much",
            "Seems legit",
            "Offended.",
            "Also plays video games",
            "Wait how u know that bro?",
            "1. Nope, not me.\n2. Nope, also not me.\n3. Correct.\n4. Extrovert pretending to be an introvert to get accepted into the cs culture, myself.",
            "[Object (object)]",
            "That looks like the description of a lacrosse player at an ivy. I'm 25 years principal architect, director of engr in my last 2 jobs. It's just coding. When I worked at google maybe they asked harder questions, not leet code, but mostly it was just code. Leet code seems to get you a job at a few companies, coding on large existing projects is what gets you a career.",
            "5. Thinks uploading a resume counts as applying for a job.",
            "I don’t to any of these things and I am an extreme extrovert",
            "😎",
            "I'm all of them except #1",
            "What is TC?",
            "this is giving flashbacks",
            "damn, never felt this called out before\n\ngood job nailing that on the head",
            "Man I still watch vanoss today…it’s been 10 years",
            "ok but whats the point of having more than 4 or even 3 close friends? i ain't gonna talk to all my acquaintances 24/7",
            "1. me\n\n2. not me, im fat\n\n3. me\n\n4. me",
            "im actually quite opposite 🤓",
            "Weights and introverts are in conflict. More likely is the following: lifts weights and extrovert. Does not lift weights and introvert",
            "what is TC Maximizer",
            "I already noticed in the past the we computer guys have lot in common.",
            "Being an introvert is the opposite of based"
        ]
    },
    {
        "post_id": "11wudop",
        "author": "2001ThrowawayM",
        "title": "I DID IT!!!",
        "url": "https://www.reddit.com/r/csMajors/comments/11wudop/i_did_it/",
        "score": 473,
        "num_comments": 42,
        "created_utc": 1679343340.0,
        "selftext": "After about 380 applications starting all the way back in August, going to a no name university with not the best grades, countless interviews, and 100+ rejections, I just got my offer for the summer!!! Holy shit, I can't believe it. \n\nIt is fully remote also!",
        "permalink": "/r/csMajors/comments/11wudop/i_did_it/",
        "comments": [
            "huge congrats! good on you for grinding out the apps",
            "Was it from cold applying? I need some hope because I plan on grinding out a shitton of apps over the next few days",
            "Congratulations!!! What was the interview process like for a fully remote role?",
            "Legend mateeeeee",
            "Good job! Enjoy the rest of your semester!",
            "Nice",
            "Let’s fucking go buds",
            "So there is hope",
            "Whaaaat only 380? Damn man you are so lucky congratulations please pray for me",
            "[deleted]",
            "Mind sharing your resume? I relate in the fact that I go to a no name school and considering how my calc 2 class is going I won’t exactly have the best grades either, I would really appreciate it",
            "So happy for you!!!😇",
            "Congrats! :D",
            "Gz gz bro",
            "internship or ft?",
            "congrats",
            "Congrats 🍾!!!",
            "GOAT 🐐",
            "Congrats! How did you get the companies you initially applied to?",
            "Is offer from a startup or big tech? Just have no idea whether big tech is still hiring now or totally hiring freeze already",
            "Congratulations 🎊🎉",
            "Gz big dog"
        ]
    }
]