[
    {
        "post_id": "oeo1vs",
        "author": "Fourty_tw0",
        "title": "I'm basically a living stereotype.",
        "url": "https://www.reddit.com/r/csMajors/comments/oeo1vs/im_basically_a_living_stereotype/",
        "score": 468,
        "num_comments": 178,
        "created_utc": 1625547251.0,
        "selftext": "Be me\n\nAsian Male\n\nWears glasses\n\nSocially Awkward\n\nHentai protagonist haircut\n\nWeird Accent\n\nHobbies include anime, video games, and coding\n\nWonders why I can't meet new people\n\nAnyways, how well do you fit the CS stereotype?",
        "permalink": "/r/csMajors/comments/oeo1vs/im_basically_a_living_stereotype/",
        "comments": [
            "Don't mind me. I'm just enjoying reading through this Pokedex.",
            "My stats:\n\n6ft, 205lbs\n\nintj\n\nregular at the gym\n\nafrican\n\nheavy introvert\n\ncs degree, work as a swe\n\ndone 140+ leetcode (someone has to acknowledge this because my interviewer didn’t give me any leetcode.)\n\nInto Anime, stratergy games \n\nglasses for screen time\n\n6/10 social life\n\nnot socially awkward but dont meet new ppl often (just moved to a new city)\n\nhairline might be fading already…",
            "If it makes ya feel any better,\n\n6’3\n\nBlack+athletic \n\nDesperately wish I was good enough to have imposter syndrome, am an actual imposter. \n\nStill can’t meet people :)",
            "Ayo hold up are you me??",
            "My stats:\n\nAsian female \n\nScrawny as hell\n\nHunched back, nerd neck, fucked posture \n\nGlasses, bad eyesight \n\nImposter syndrome \n\nAccent (but I get it why you said “weird” accent instead of “Asian” accent. I don’t have an Asian accent but i do sound weird asf)",
            "Black female\n\n6\"0\n\nIncredibly socially awkward (I would rate my social life a 5/10, my sister is my best friend 😭)\n\nImposter syndrome\n\nCoffee addict\n\nHobbies: gaming, anime, food\n\nFind it impossible to make new friends and I'm only 21 :(",
            "Asian female\n\nWears contacts but has dry eyes 24/7\n\nThe only girl on my team at internship\n\nListens to rap and rnb\n\nMost of my close friends are guys\n\nSwitched into CS from science major\n\nInto fashion",
            "Late 20’s. High school dropout. Hispanic with awful upbringing. Had to start from prealgebra in the military. Former alcoholic when in my early 20s. Now dad at the end of my junior year. Pretty much opposite of a stereotype I think? I don’t see the stereotype in school just a bunch of people hating life like I do in school. I just try to be a good programming partner. I leetcode a lot too… helps me be better at logic overall imo… but I am addicted to video games.",
            "Ayo everyone here 6ft ???!!",
            "Lesbian, girly latina who loves makeup *but* computer/hardware wiz and a huge techie. So in that area, I do stand out a lil.\n\nHoooowever.....\n\nI am *the* stereotype of that clumsy as f science nerd that literally falls while walking straight on the sidewalk. I also have asthma so every now and then I'll need my inhaler. Sometimes I feel like Sofia Vergara, and sometimes like Carl from Jimmy Neutron. Lmao",
            "White / Asian female\n\nLoves being in a sorority\n\nEnjoys shopping and crafting\n\nArt major -> CS major / art minor\n\nGraduated in December at 26 years old\n\nTrying not to think about my technical interview in three hours because I am the impostor",
            "Female… I guess not",
            "Lmao reading these comments we should start a discord server for all of us",
            "Which anime have you been watching recently? Trying to get back into it\n\nBut yeah, that’s also me…",
            "Asian/Mexican\n\nShort, okay posture, uses glasses at night. \n\nI skateboard and make music in my downtime.\n\nHeavily into fashion.\n\nMy best friend is my dog, cloud.",
            "Indian male\n\nthin af but very tall\n\nnon-existent social life\n\nalways infront of the computer\n\nimpostor syndrome\n\nworried about my future",
            "[deleted]",
            "I'm not the CS stereotype at all. Sometimes, I feel a little left out from my classmates and school experience because of this. \n\n\nI'm a super social Mexican American mom of 2 who has absolutely no interest in video games and anime. I find video games boring. I just don't have the attention span for them.\n\n\nI'm into reading, gardening, hiking, exercising, and learning cool stuff off the internet. My classmates are mostly all young, childless adults who love gaming and reference anime all the time. I get the references because my husband and son are super into gaming and anime. And I know all the video games they play as well. But I definitely wish I enjoyed these things to have something in common with my classmates and be able to build friendships with them. \n\n\nSo from my perspective, be proud of being the stereotypical CS major. Just work on your social skills and you'll be fine.",
            "My stats:\n\nMiddle eastern female \n\nWears glasses but looks cute without them on\n\nIn a sorority\n\nCompSci major\n\nEnjoys CS but kind of wants to drop out and be a trophy wife",
            "white dude\n\nsocially awkward \n\n< 5 good, close friends \n\nhave had between 0 and 5 GFs, inclusive \n\nformerly athletic \n\nprestige TV/anime are my jam \n\nEDM/Trap all day evry day \n\nmodest coding ability\n\n....that's all folks",
            ">Be me  \n>  \n>Your typical Asian Cis-Male  \n>  \n>Your cookie cutter computer nerd CS student  \n>  \n>Wear glasses and have shitty eyesight  \n>  \n>Fat and appears like someone with a restraining order  \n>  \n>Neckbeard + Unshaved beard  \n>  \n>Socially awkward and cringe  \n>  \n>Addressing women as \"M'lady\" while tipping fedora  \n>  \n>Brag to others about his *superior* taste in anime  \n>  \n>Acts like a pretentious asshole because I'm in CS and people think I'm smart  \n>  \n>But secretly having inferiority complex, self-hatred, and imposter syndrome  \n>  \n>Have never seen real pussy or experienced womyn's warmth before\n\n**I'm the living stereotype of CS students. What have I done wrong with my life?**",
            "Bro u can change ur haircut? It’s summer time rn so it’s the time to experiment and see what u like. Meeting new people is also something I’m struggling with so I can relate as another Asian male",
            "White female\n\nCross major with political science\n\nAvid gym bunny, 5'4 average build\n\nCurrently doing a machine learning internship\n\nNo accent, but used to live in Poland when I was younger so I got those Eastern European drinking genes\n\nBlonde hair + pasty skin\n\nI love literature and philosophy, and I am also a writer (which surprises some people)\n\nHowever I do have the classic \"bitch bob\"\n\nTwo half sleeves of tattoos \n\nActually likes talking to people\n\n&#x200B;\n\nOverall people are like \"CS... and \\[that\\] university? What the hell?\"",
            "White male\n\nAthletic\n\nGood with technology\n\nMiserable at coding because I'm to afraid to actually try. \n\nLegitimate imposter syndrome. \n\nScared.",
            "Sharing cuz I’m tired of Leetcoding:\n\nAsian\n\nBad posture and bad eye sight as well\n\nKorean accent\n\ncoding and computer games\n\nLike ramen\n\nLike staying home\n\nAlways changing hair color",
            "I feel like the cs community is split into two extremes of fitness. Half of us live for the gym and the other half are the total opposite... Anime is popular across the board though",
            "Stats:\nAfrican girl\n\n5’5, 130lbs\n\nCame off as extrovert, but I am an ambivert. I am lowkey a crack head\n\nI don’t appear like the stereotypical CS\n\nLoves fashion, dress like I am going to a fashion show\n\nLove Wikipedia and reading self help book\n\nLove playing sims\n\nTerrible posture, I have back issues \n\nI am faking my way through cs\n\nI love painting - art in general\n\nI love history and travelling \n\nListen to alot of different genre(rnb, French pop, pop, rap, reggae, soul)\n\nWatch a lot of teen drama shows, occasionally watch anime\n\nTrack athlete however I ain’t athletic at all just my genes saving me\n\nFood lover",
            "White Male \n\nIn a fraternity\n\nLikes working out, technology, partying, sports\n\nStarted CS a year late cause Engineer my first year\n\nPretty much hit for internships next summer \n\nThinks I’m doing well in CS then sees what y’all are doing",
            "My Stats!\n\n* 20yo Hispanic Male\n* 6' tall at 270lbs (though losing weight, 40lbs down so far!)\n* Wants to grow beard but cant\n* Used to do music professionally\n* Really damn awkward when talking to new people...well sorta...idk, send help please!\n* Photography and film making on the side\n\nThough I am chill to be around! Or at least I hope. Honestly me caring about other's people mental health is the best positive I have. (That being said if anyone needs to rant dm's are open! I work,study, and live in CS. I know how y'all are. I know y'all want the occasional rant!)",
            "American born Indian male (too light skin for most Indians so they think I’m white, other people just think I’m some other random race)\n\nGym + fitness \n\n5’7 Hooper\n\nListens to rap\n\nAll of my friends are business majors so the day drinking and 🌿had to slow down\n\n7/10 extrovert but if I meet new people I’m hella shy\n\nMy majors are in the flair",
            "White male\n\n5’11” 110lbs\n\nAwful vision, awful posture \n\nHobbies: running,basketball,coding,video games.\n\nLike staying home",
            "Omg, you’re like the guy version of me! uwu\n\nAsian female who’s vertically challenged \n\nSocially awkward \n\nBleached blonde hair\n\nHobbies: Anime",
            "Let me guess parents mad at you because your not Doctor yet?",
            "I feel like I don’t fit them at all lol\n\n5’2 biracial female \n\nExtrovert \n\nHobbies include hanging out with friends, going out, cooking, animal crossing, and overestimating my alcohol tolerance \n\nKinda boujee",
            "Asian female\n\n5’2\n\nNo glasses \n\nI don’t meet new people that often\n\nOnly done 30+ easy leetcode\n\nWeird accent (I’m bilingual- Vietnamese and English)\n\nI do work out tho\n\nLike staying home\n\nAnime anime anime\n\nPeek-a-boo hairstyle (half black + half red pink)\n\nImposter syndrome is real\n\nSenior year in CS\n\nCurrently working as Web Developer",
            "Hispanic Female\n\nWears glasses\n\nWas socially awkward but have gotten better slowly over the years. I need alone time tho.\n\nReally long hair because COVID and lazy to go cut it\n\nNo accent but I got sick recently and sound like a chain smoker\n\nHobbies include anime, video games, and coding\n\nHappy to not meet new people unless we end up hitting it off",
            "[deleted]",
            "I’m probably 40-50% of the stereotype. High school me was 90-95% and the more annoying variety.",
            "do you look like tech lead from youtube?",
            "Latin male\n\n5’ 7”\n\nGay\n\nInto fitness & weight lifting\n\nTrain Brazilian jiu jitsu \n\nSocially awkward yet also socially outgoing, depends on the context and how I feel that day\n\nSoftware developer\n\n“Gamer” - I ONLY play Zelda games \n\nInto electronic music, specifically heavy bass stuff",
            "Black female\n\n5’4” a little under 100lbs\n\nSuperhero nerd\n\nStyle has been described as looking like a business major but more chill and casual \n\nSwitches wildly between being an introvert and an extrovert \n\nCoffee addiction \n\nImposter syndrome \n\nWears contacts and glasses\n\nI have been asked if I’m lost on my engineering campus so not exactly the cs stereotype in appearance",
            "Haven’t showered in a week and a half.",
            "My stats: \n\n6 ft, Asian (Chinese)\n\n190 lb \n\nRegular at the gym, also practice MMA. Played football in HS as well\n\nIn a Frat\n\nLove cooking & coding\n\nWorking at Amazon this summer, will be in Coinbase for the fall",
            "Eurasian/hapa girl\n\nBlue eyes, large glasses\n\n5'4\" 106lbs\n\nHobbies: manga/manhwa (reading Positively Yours rn), coding\n\nI haven't made any friends either",
            "Asian\n\nBorn in the US\n\nGrew up in India\n\nStudy CS in India (sophomore)\n\n220+ leetcode\n\nBut since I'm a US citizen, want to work here, cannot get any internships in the US because of my international University even tho i have 2 internships in India\n\n6 feet, white with heavy indian accent, mix of American and Indian\n\n180 lbs\n\nHobbies : soccer, coding",
            "Be me\n\nWhite male\n\nStandard build\n\nStandard height\n\nShort brown hair\n\nGeneral American accent\n\nNo sports\n\nProgrammer/game developer\n\nSocially adequate \n\nImposter syndrome\n\nReddit",
            "White Male\n\nBisexual\n\n6ft\n\nNo internships.",
            "My stats:\n\n- Brown male (pakistani origin, but born in the UK and raised in Canada).\n- 5 feet 8 inches (everyday) - 5 feet 9 inches (on the best of days) tall\n- Do boxing, BJJ, kickboxing, and wrestling.\n- Outgoing, but covid and my own decisions fucked my social life up (working on fixing what I have done)\n- Hobbies include: coding on my free time, watching MMA, studying Philosophy, working out (lifting weight + martial arts)\n- Currently doing my second internship (just finished my sophomore year) .... its a small company, but I love working here.\n- Average coding skills (IMO)",
            "I fit pretty well into the CS stereotype:\n\nAsian Male\n\nWears Contacts\n\nPretty Hectic Social Life\n\nBig Weeb\n\nHobbies including running, swimming, public speaking, coding (I’m a workout addict and I workout for 2-4 hours a day)\n\nAm an actual imposter. Not just imposter syndrome",
            "White chick \n\nAmbivert - I’m very social but I also like alone time\n\nWears glasses (astigmatism that’s getting worse)\n\nHobbies include video games, reading, watching movies. \n\nI’m neither cool enough to be cool nor “nerdy” enough to be really smart or really into things. (Ex I love Star Wars but not enough to know all the comics)",
            "Female, white (Italian), with pale as fuck skin cuz I hate the sun. Graduated with my Master’s in comp sci at 23. Still 23. Married (straight). Polyglot (7 languages). Terrible eyesight (not Coke bottle glasses, but still). Average height (5’4”/163cm). Surprisingly good social skills, but horrible anxiety. The living definition of “imposter syndrome”. Hobbies include sewing and gardening.\nSo… probably not what most would expect from a programmer.",
            "My stats:\n\nAsian Male\n\nWears Glasses\n\nSocially awkward but *awesome* at pretending that's not the case\n\nImposter Syndrome\n\nLOVE staying at home\n\nReally hope to make new friends. You can see why this is conflicting with the above\n\nBeen coding since I was 12, 17 now.\n\nHobbies include video games and coding.",
            "6 3 varsity volleyball player who can actually talk to women",
            "Trans (yes I have programming socks)",
            "Mexican Indigenous Female at 29 yrs old. \n\nAlso wears glasses\n\nIntrovert but will force self to go to outings with friends and coworkers. Much closer with my family. \n\nLong dark hair parted on the side with long fringe (same hairstyle for the past 11 years)\n\nNo accent \n\nHobbies also include anime, video games, decorative planning/scrapbooking, pub crawls. Currently started going to the gym and it’s actually been nice?\n\nVery hard for meet new people as well, how do we make friends as adults??",
            "I don't prefer to state my gender  \n\n\nI'm a Hyperpolyglot that just happens to be a coder. I'm nowhere near imposter syndrome as I'm merely a coder. (and Sys Admin)  \n\n\nMy hobbies include Language, Science, Philosophy.   \n\n\nI'm and ENTJ.  \n\n\nI'm far worse than the stereotype in every facet...",
            "Looks like 4chan has invaded Reddit haha",
            "Do you think Kobayashi would have drank less and missed her chance to meet Tohru if she didn’t have to code in Java?",
            "I don’t at all lol. Hispanic male, no glasses, into soccer, music, sneakers, like to workout, I like to hangout/party with the homies, Mexican/American accent, smoke a lot of weed, cs degree with a swe job. I’m just a little awkward around people that I meet, that’s about it.",
            "Not interested in people but if they talk, then so would I.\n\nA good accent but weird face with glasses and hentai protag haircut.\n\nCode, learn new shit is my hobbies. Watch animes but not many and usually watch one when it's complete so I can binge it.\n\nAsian male.\n\nWonders why I am dumb.",
            "basically the same minus the hair",
            "6ft 150 lb, has sense of style, African, dreadhead, good w the ladies, gamer, B+ A- student",
            "At least coding is your hobby. Can’t say the same about me and many others. But yeah other than that I’m you. Oh and without the hair part.",
            "Not asian and have an ok haircut but otherwise spot on lol",
            "dude we are both have same stats and we both love rezero.\n\nare you my dad's secret love child",
            "Honestly not really at all. I'm tall, fit, have good social skills and am somewhat older than most other students at my school.",
            "Change asian to italian 🥸",
            "6'0, 175lbs\n\nWhite male \n\nAthletic\n\nState school\n\n**Imposter syndrome**\n\n**t500 overwatch player**\n\nsocial life 8/10",
            "White 5’11 late 20s Infantry vet, muscular/athletic. Stoner, chef, rapper, parent, philosophy/politics. Idk I’m a nerd who got lasik and exercises",
            "-Pale\n\n-Wears glasses\n\n-Introverted \n\n-Addicted to caffeine and nicotine\n\n-Has bad back from sitting all the time at my desk \n\n-Stutters\n\n-Gives long boring explanations about computer topics I find interesting to friends who have no clue what I’m saying \n\n-consistently stays up past 2am working on projects\n\n-plays video games, and reads articles about computer science. \n\nHow did I do?",
            "My stats\nMexican Male\n\n5’9\n\nAthletic \n\nSocially awkward\n\nOnly a couple of friends but I’ve had a gf for the last 4 years\n\nNew to CS and graduate in 2 years so I’m currently freaking out",
            "Red hair, glasses, a bit socially awkward, hobbies are chess and playing guitar. Work as a calculus/CS tutor. I’d say I fit lol. I have a fiancé though so I’ve got that going for me I guess haha.",
            "Black dude \n\n5'11 \n\nwear glasses\n\nplay basketball/workout watch anime/ shows\n\na little shy but extroverted\n\nlowcut hair because im african\n\nonly black cs kid in my class"
        ]
    },
    {
        "post_id": "1cl2059",
        "author": "punchawaffle",
        "title": "I am pleased to inform that I've graduated CS",
        "url": "https://i.redd.it/l3n2gcuneoyc1.jpeg",
        "score": 472,
        "num_comments": 29,
        "created_utc": 1714944561.0,
        "selftext": "I'm still looking for jobs, and have applied to a few Masters programs. Got a few interviews, and processing for one job is taking a long time 😭. Anyone have any leads, or suggestions? ",
        "permalink": "/r/csMajors/comments/1cl2059/i_am_pleased_to_inform_that_ive_graduated_cs/",
        "comments": [
            "My degree is technically IT majoring in CS. Im going to be sad looking at my lame ass degree hanging on the wall later this year.",
            "Im looking for a job too. You are now my enemy 😈",
            "You gotta graduate Joe next bro",
            "Congratulations bro. \n\nFuture plans? Specialization or any specific interest?",
            "Welcome to the overly saturated job market and layoff frenzy!",
            "Congrats, now you can roll it and put it u-\n\nCongrats man.",
            "Research your Master's choices (and whether you want it)\n\nI kind of applied unconvinced and it turned out to be both an organizational mess and bringing very little of value knowledge wise so far. So it's the middle of the first semester and I'm torn between dropping it and going full-time at my current job or trying to power through with 0 motivation just for the paper",
            "The easy part is done. Now is the level that will either kill you or make you. Good luck",
            "I want to say go straight for the masters, skip the headache of applying now and hope the market is better in a year or two but honestly who knows if it will be better at this point. If you want help finding a job, I built a platform that applies to jobs on your behalf and also has a job board of \\~300 entry-level swe/swe-related jobs. Hopefully it can help you out, congrats and best of luck in your search!\n\nCheck it out at: [https://autoswe.com](https://autoswe.com)",
            "Start building projects",
            "Congratulations",
            "congrats!!",
            "Congratulations man",
            "congratulations man🎉\n\nany internships?"
        ]
    },
    {
        "post_id": "18xskry",
        "author": "14475553",
        "title": "Summer 2024 Internship Search!",
        "url": "https://i.redd.it/mqg1ehz97aac1.png",
        "score": 470,
        "num_comments": 42,
        "created_utc": 1704312266.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18xskry/summer_2024_internship_search/",
        "comments": [
            "Background Info:\n\n* CS major with a Minor in Math and Cybersecurity \n* \\~3.5 gpa\n* Top 40 Computer Science School 😤\n* Internship Role: IT/Network Engineer Intern\n   * I actually failed my Network Class last semester 😔\n\nMoral of the Story: Never Give Up!",
            "Hey, did you tailor your resume to each application?",
            "Just how do people apply to so many?",
            "Do you by chance go to Penn State or Ohio State",
            "Did you apply for IT Engineer or help desk? Congratulations",
            "where r y’all even finding all these internships to apply to? i can barely find like 20 in my area 😭",
            "Where’d you generate the image from?",
            "Hey OP! Excited to hear you're diving into the summer internship search for 2024. What strategies or techniques are you using to find those opportunities? Any specific platforms or networking approaches that have been helpful for you? Would love to exchange some tips!",
            "How do you create these images to track how many you applied and to track progress ?",
            "Verizon?",
            "How many projects did you have on your resume?",
            "are you an international student?"
        ]
    },
    {
        "post_id": "yquiam",
        "author": "uw-police",
        "title": "linkedin is a bloodbath rn",
        "url": "https://www.reddit.com/r/csMajors/comments/yquiam/linkedin_is_a_bloodbath_rn/",
        "score": 474,
        "num_comments": 58,
        "created_utc": 1668025494.0,
        "selftext": "bruh \n\ngive job pls",
        "permalink": "/r/csMajors/comments/yquiam/linkedin_is_a_bloodbath_rn/",
        "comments": [
            "When you filter the positions by entry level, new grad, and associate and literally all the results are for 5+ YOE only 💀💀💀",
            "The job section is a boodbath, but every feed post is \"I'm happy to announce....\"",
            "give job",
            "Pls bb girl give job I kiss you",
            "Did anyone had luck getting at least phone screens  from companies ? Everyday I receive tons of rejections as if they were automated to be sent very next day of application submission. \n\nMy heart has turned stone, stronger than ever seeing 100s of rejections already 🫠",
            "I graduated several years ago, but I saw this post and it resonated with me. Just know this: you will get the call eventually. You’ll ace the interview. You’ll get the offer. It just takes time. As stressful as it is to be waiting to hear back on a job, try to enjoy it if you can. Life moves quick and this period of unemployment might be your last chance to soak in some quality, long-term r&r. Go eat ice cream for breakfast. Go swimming at 2 am. Fwiw, it’s not always easier when you’re experienced and looking for a new role… that takes time too. Hope this helps someone!",
            "everyone should be given job",
            "I saw it getting worse a month ago I literally saw the number of jobs on handshake shrinking everyday. If you didn’t start applying in like early August it’s pretty tough.",
            "I still have recruiters reaching out to me every week lol.",
            "Keep doing easy apply till jib job 👍",
            "Best I can do is 10 year unpaid internship with hopes that the budgets will increase so we can hire you at $10/hr",
            "watch out for the scam postings",
            "give offer",
            "It's time I start looking for a IT staffing agency that can put me on a $45/hr job. I might have to sell my soul to the devil for a year after all.",
            "Im so glad I have a new grad job lined up through intern conversion. Sounds fucking awful applying now. Tech is in shambles",
            "yeah bro tell me about jt",
            "We wants it, we needs it. Must have the precious. They stole it from us.",
            "We wants it, we needs it. Must have the precious. They stole it from us.",
            "Just apply even it says 5+ YOE",
            "Bruv meta laid off 11,000 employees, Lyft laid off 13%, twitter cut half their workforce, Amazon paused corporate hiring, Apple under a hiring freeze. Take your first good offer.",
            "everyones fucked this is scary asf"
        ]
    },
    {
        "post_id": "1c3lckn",
        "author": "luew2",
        "title": "Devin AI fakes their demo",
        "url": "https://v.redd.it/34bxuiwolduc1",
        "score": 468,
        "num_comments": 37,
        "created_utc": 1713070359.0,
        "selftext": "I called this a month ago\n\nhttps://www.reddit.com/r/csMajors/s/U4HJ9Bh0lb\n\nOG vid: https://www.instagram.com/reel/C5sgyBXrL0C/?igsh=MWN6bG9kM3lmaDlzZQ==",
        "permalink": "/r/csMajors/comments/1c3lckn/devin_ai_fakes_their_demo/",
        "comments": [
            "Lets hope they keep faking till the next 50 years...",
            "Maybe they could hire a 1000 indians and tell them to pretend to be Devin and raise a trillion dollarinos",
            "Marketing >>> Everything else",
            "Steve Jobs moment",
            "Wow, so it's just like me on demo day frfr. It's closer to being sentient than I ever imagined!",
            "The current state of tech is absolutely pathetic lmao",
            "Why not post the original video instead of a stochastic  influencer parrot that is  basically repeating what's in the video?",
            "Is it just me or is the mouth out of sync with the voice?",
            "Where’s the people who shit on me for calling them frauds? B-b-but they won olympiads!!! Exp > PhD!! DeepMind!!! 🥺🥺🥺",
            "Gurgly voice",
            "![gif](giphy|5VKbvrjxpVJCM|downsized)",
            "Fuck Frank Niu too tbh lmao",
            "The overall concept is inevitable, I never thought this specific model was decisive ",
            "CS  majorsrejoice with this news!",
            "Is that Hamilton Morris’ voice?",
            "The whole industry is fake it til you make it anyways lol",
            "What about swe-agent? Supposedly, it's better than Devin and open source"
        ]
    },
    {
        "post_id": "y2dk1k",
        "author": "cupof2",
        "title": "What’s an average Computer Science student like vs those who get into FAANG?",
        "url": "https://www.reddit.com/r/csMajors/comments/y2dk1k/whats_an_average_computer_science_student_like_vs/",
        "score": 475,
        "num_comments": 283,
        "created_utc": 1665604208.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/y2dk1k/whats_an_average_computer_science_student_like_vs/",
        "comments": [
            "Reading these comments makes feel a lot better about myself lmaoo",
            "They have hobbies",
            "the average cs student isn’t in this sub",
            "Tbh a large part of it depends on you being able to see and be seen by recruiters and get in front of interviewers for FAANG to be able to show what you know. \n\n* Apply early, broadly, and to any job that you can. If you don't apply you won't be seen.\n* Get a referral from people that work there.\n* Have several tangibles on your application that recruiters are looking for: research papers, popular technical skills, previous internships, etc.\n* Do well on OAs (that's a given)\n* Know your shit for interviews, be able to describe your experiences well.\n* In interviews, ask questions about the job that show you researched the role well. Some people don't ask anything and it's just a back and fourth that doesn't show that you know your role for the job.\n\nGoing to a good school is not enough, I go to a CSU and I've had more opportunities than my friends at UC Berkeley just by doing that.",
            "They've touched grass",
            "Im at a big 12 state school. Most students cant even read in a csv file. They cant transfer basic control flow concepts from java to another language. They continue building off of code that doesnt even compile. They dont know what leetcode is. Only 5 undergrads got an internship this past summer, including me. Not faang. They go semesters without touching code.",
            "Well i dont know anybody who has got into FAANG but i can tell you that most of my classmates arent all that great. Most people dont have the obsession to try to up their game and they just go through school fairly casually. I still havent met anybody else who does leetcode IRL. I dont blame them though, most of them are like 19/20 and barely have their heads on straight. I feel like a god starting school at 28. Its amazing ehat the extra years teach you in terms of drive, and comitting to be the best at something. Most classmates are more concerned with having fun and chilling with their friends. Im just lucky that i hot that out of my system already.",
            "Average CS Student: Insecure about applying before they finish their degree.\n\nFAANG-ers: Applies to every posting, in descending order of pay (on [levels.fyi](https://levels.fyi) and so on.)",
            "(source: went to a decent state school, ended up at FAANG so also worked with the types of people from other schools who ended up there)\n\nThese are all correlations, but overall:\n\n* Having interests outside of CS. Lots of them played music, ultimate, chess, constructed crosswords, etc...\n* Being more social than the average CS major. Not necessarily party-every-weekend social but they weren't loners.\n* Putting in the hours to really understand the curriculum and, for projects, finish to near-perfection. Generally didn't complain about the workload either.\n* Having experience with CS in high school or earlier. (I didn't say the list was fair)\n* Being a TA or doing undergrad research. Or both.\n\nOther than that, internships -- but that was obvious.\n\n*ETA: there are, of course, exceptions to all of these except putting in the hours. Doesn't matter how smart someone is if they don't create output.*",
            "The average CS student doesn't even think about getting an internship",
            "The average cs student puts too much emphasis on school/GPA and thinks that by simply obtaining a cs degree and getting a 4.0 that they’ll make 200k+ outside of college.",
            "Haven’t heard one person say leetcode at my school so far.",
            "My friend, a 4th year CS student, still doesn’t know how to get the sum of all elements in an array",
            "I’m currently interning at FAANG for my senior fall which is pretty late. I’m an average cs student (2.8 gpa) at University of Arizona so you can take that in account😂. The interview questions for me were very basic(probably 3rd semester material for most schools). I was stressin last semester because I didn’t get any internships yet but just applied in the summer and got one.",
            "5 years ago there was such a massive shortage of CS graduates I remember seeing classmates with borderline 3.0 GPAs getting into FAANG and Unicorn startups.\n\nMy oh my how times have changed .....",
            "I’ve met a lot of CS students even from top schools and they have no clue to HOW to figure things out themselves… that’s honestly the most underrated skill that keeps people from succeeding. Everything’s not gonna be well defined like tests and projects are in school. The people who are able to problem solve ambiguity are the people who get into FAANG... unless you memorize leetcode and get lucky but those guys honestly have a hard time as an engineer once they’re in",
            "The average student are the one go to state school and get a job at local company. They probably don't  even need to lc.",
            "It's frustrating how people are really looking down at \"State Schools\"....",
            "I can't speak on behalf of FAANG but I'll speak from my perspective of being in ML.\n\nThe people who \"excel\" at ML (think researchers at top schools, engineers at FAANG/DeepMind and such) are those that literally breathe and live ML. They do \"projects\" and code for fun. You can't really fake it because you get miserable really quickly if you're not that kind of person. I personally enjoy having hobbies, meeting friends, occasionally getting drunk, taking my girlfriend out, etc. I'm not trying to shit on those guys, good for them, but I find it very doubtable that they'll look back and say they lived their lives to the fullest.",
            "The latter applied.",
            "#define average CS student",
            "one has social life and relationship while the other have a shit ton of cash \n\nsource : ex-faang intern",
            "The average CS student works for WITCH",
            "I got into faang. I have a boyfriend. Lol that means I get laid",
            "I always thought FAANG was the norm, and I was just below average 😂",
            "The average CS student is thinking about the bitches that are going to be at that house party coming up Saturday night and getting wasted out of their mind",
            "The average CS student does the bare minimum to scrape by their degree. Those who get into FAANG learn frameworks in their free time, personal projects, hackathons, mock interviews, apply to 300+ internships, read CTCI, complete Neetcode 150. There are no secrets or shortcuts, follow those steps as an undergrad and you'll likely interview and receive an offer from FAANG.",
            "Average CS student goes to IT not SDE.",
            "Prob 50-75k depending on the area vs 115-225k depending on the area and company.",
            "They touch grass",
            "I know a few who got into FAANG directly after we graduated from our top-25 CS program. I wouldn’t say they were way smarter (although they were smart and had high GPAs) but they were very focused and disciplined. I knew several who would meet up weekly and do interview prep during their senior year. They never partied, didn’t do drugs or drink, and were very diligent regarding homework and such and always pulled their weight in group projects.",
            "FAANG - They are good at DSA and problem solving.",
            "2 years of grind basically (for someone it might be more than 2 years for someone it might be less than 2 years)\n\n\\#copy-pasted\n\nTwo Years of Extreme Hardwork Anytime Makes Your Rest Years of Life Comparatively Easier:\n\nLet me elaborate with few examples:\n\n1. If you did great hard work in XI and XII and got into a good college, then comparatively, you will face fewer struggles later in life.\n2. If you didn't get a good college, but you did great 2 years of hard work in college and got into good company, then your rest of life will be comparatively easier.\n3. If you didn't get into a good company after college, but you did extremely great work of 2 years to switch into better companies, then the rest of life becomes easier.\n\nOpportunities are always there, but we need to do much hard work before to excel in those opportunities :)",
            "I enjoyed college, spent time with friends, went to bars, did fun stuff. Didn’t ever really put much effort into school, got decent grades but not perfect. Didn’t matter to me tho bc I never did homework past 5. Never even considered applying to FAANG, I had a couple recruiters (Meta) reach out on linkedIn and I told them I wasn’t interested. Graduated without honors, but a good enough GPA to score a full time job making 90k. I love it. I work maybe 5hrs a day on average, our team does fun stuff like bowling and lake days randomly (on company time). I work from home except for thursdays, I go in office and we go out to lunch + cocktails. I still don’t understand why people want to work for faang, I make plenty and enjoy my life too.",
            "I am an average student and I work at FAANG",
            "People who start their careers at FAANG are probably the know-it-alls that no one was friends with because all they talked about was school and getting good grades and were a snob. I was like that in journalism undergrad (I’m doing CS masters), ended up getting a job at the best ad agency in the country two months after graduation….then ended up developing chronic pain and suicidal thoughts from working around the worst people I met in my life and having no life…lol. It’s not worth it everyone. Take it from someone who’s done it.",
            "Y’all fetishize these people too much. Go read marx, learn about capital and labor relations, understand capitalist realism, and prepare to be depressed as you enter the work force where you’ll learn about raters who are paid 5 cents an hour to label data for a model that improves clicks by 1.2% and your coworkers talk about them like dogs. Sincerely someone who works in FAANG",
            "Holy shit this makes me feel better",
            "My dads friend went to Penn state Behrend and ended up working for SpaceX, NASA, Microsoft, Google, and apple before retiring at the ripe old age of 42.",
            "My school is really known for getting FAANG and big tech companies internships. I go to UCSD and all the tutors and TA have big names internships. I know someone who did 5 internships within 4 years. (Samuel liu <-- search him up on Linkedin)",
            "if someone interned at FAANG they’ll make sure you know it lol",
            "I’m below average lol (2 faangs tho).",
            "My class and I all went off to various FAANG and FinTech companies. We were all decent students. But what I noticed was those of us who applied for new grad jobs early (the fall before graduation) all had one lined up by the end of the school year. Those who waited had a harder time because the pool of available jobs for new grads was mostly full. Also, some of my classmates did the leetcode grind, and some (myself included) didn’t. I’m of the opinion that it’s a combination of timing and selling yourself. Learn to interview and communicate well. To be totally honest, how good a student was didn’t seem to factor into what job they landed.",
            "I go to FIU and the average CS student is pretty lost in my opinion. There is a group of us that are very involved and have gotten internships in FAANG including myself (Diversity hire ftw). But I’d say the average student doesn’t really know about leetcode, or these internship opportunities.",
            "Social life vs cash I guess",
            "I see a lot of average/below average students get great jobs and internships without having to grind. Many people fail to realize that there’re tons of companies outside FAANG/tech space that pay great money. However, that was 3 years ago, and so many things have changed since COVID.",
            "Nothing",
            "They all want internships but can’t code a for loop that prints their name 10 times if there was a bullet at their head",
            "#1....CS has absolutely nothing to do with being eligible to work at a FAANG/MAAMBA, or whatever purely technical entity there is. Most CS graduates actually work on projects that are not purely software or software application related.",
            "CS major who went to UW (which is admittedly a top cs school). I was an average GPA cs student. Smack in the middle. Think I managed to get a FAANG internship because my resume had a lot of personal projects, and because Amazon was hiring like there was no tomorrow.",
            "In my country computer science is becoming such a sought after field that only the best students can enter the course. The minimum requirement for entry in some schools for CS here is a perfect / close to perfect score in our national examinations. In my university, there’s also a compulsory internship requirement where students have to take either two 3 month internships or one 6 month internship before they are allowed to graduate. \n\nSo yea I would say that even the average CS student in my university is pretty high caliber, scored close to or a perfect score in the national exams, would have 2-3 internships upon graduation, and probably heard of and started leetcoding since sophomore year....:/",
            "Can we stop calling it FAANG and start calling it MANGA instead",
            "Frauds, cheats, and bullshitters",
            "I've been a programmer for decades. Have lead more interviews than I can remember. Never once have done anything leetcode related. Never. Why? Because it's absolutely horseshit and doesn't tell me a fucking thing about you other than you can remember the solutions to puzzles. \n\nThe interview process for many companies these days are a joke. \n\nFor me, 1 maybe 2 interviews. Really the thing I'm gauging is if you've worked on projects that are even tangetly related, what your experience was, and do I think you'd be a good fit socially at our company (are you nice, are you able to put aside ego when needed, bonus if your funny). \n\nFor a programming test, it's always related to what you'd actually be working on if you got the job, and your allowed to use Google and stack overflow because that's what people use everyday on the job and that's fine! Giving you a test where we take away the tools you'd actually use is just fucking stupid.",
            "In an intro class, our midterm is tomorrow in java. The topics go from primitive data types -> oop ending at building constructors. Students legit don't know how to initialize variables and play League of Legends in class. The students that play games aren't those secret elite hacker genius student either. They legit just don't give a fuck. \n\n&#x200B;\n\nThere's also a surprising amount of students who are told if they miss two labs or more they won't be eligible to take the mid term. So alot of the questions on Piazza are them asking if they can still take the midterm if they missed 2 labs....Like so many of them just don't show to class that the teacher had to make the exception to allow students who missed 2 labs max to take midterm. \n\n&#x200B;\n\nSchool was not what I expected at all. Anyway I went to my first job fair, and there were alot of recruiters and state jobs, some \"prestigious\" companies from the local area like Regeneron and GE, but no Google/Apple/FB etc. We do have a field trip that's a first come first serve to NYC where we can talk to alumni who work at FAANG, and since we're in NY our applications get first pick, but most students just don't give a shit.",
            "I actually thought I was below average as a CS student. I didn't do any CS classes in high school but I taught myself python pretty well, I knew about leetcode, FAANG, and internships even before starting college lol. I'm in my first semester and I don't have any internships tho smh.",
            "I would say just the work ethic on learning and adapting and of a bit of  that luck. The school does matter a bit just for networking  but it only means u gotta work harder in creating connections  if attending state school /cc",
            "I'm tryin hard to build good projects, do leetcode, and maintain good GPA man. I just wanna get one internship before 3rd starts T-T",
            "Way less scars",
            "Tradeoff. Ave students are happier and those get into faang are richer. Just do not compare yourself with others, in the past, I felt jealous for not having memorable school life as ave students and not being excellent as students with faang offer.",
            "Mostly luck tbh",
            "These comments are making me feel like I'm not a failure as I thought and like I actually have a high chance of getting into FAANG compared to what I thought lmaoo",
            "Luck",
            "i feel like the average hardworking cs grad will get to faang at some point. but those that do faang early (in my limited experience): \n- don’t make getting a job their entire personality (ie. are normal people) \n- had early exposure to cs / already did internships in hs\n- personally know people already in the field \n- don’t see faang as that big of a deal \n\nsource: go to a decent state school in ca (not berkeley or ucla). am a faang freshman intern with other faang freshman intern friends and faang sister. am friends with plenty of people that are not faang.",
            "I’m a strategy consultant, but I’ve worked with many devs that got into FAANG. Maybe it’s just my experience, but most of them were prestige-seeking douchecanoes.",
            "Average Cs students are doing something else like teaching cs at a high school... (by average I consider any students with an average grade of B which is thw national average gpa in USA)",
            "coding isnt there hobby",
            "Went to a state school that isn’t top 100 in CS, was Summa Cum Laude with a 4.07 GPA and departmental honors. Completed an undergraduate thesis and two NSF REUs and one industry internship at a large but not FAANG company. Not magically gifted at leetcode I actually struggle a lot with it, I’d say average leetcode proficiency in this Reddit. My classmates didn’t do any of this, most did some form of research but nobody made effort to establish industry internships. Each year we had internship panels, each year it was <5 people in the department (graduating class size about 45). I now work at a “FAANG” company, but looking back I really didn’t do much in my undergrad besides school, video games cause of pandemic. I have no doubt my class mates could get into FAANG companies, many I’d say were smarter than me, it really came down to knowing what to do earlier on to not scramble later on."
        ]
    },
    {
        "post_id": "ohqs3p",
        "author": "cromagnonninja",
        "title": "Leetcode sucks",
        "url": "https://www.reddit.com/r/csMajors/comments/ohqs3p/leetcode_sucks/",
        "score": 473,
        "num_comments": 92,
        "created_utc": 1625950730.0,
        "selftext": "Keep doing it anyway. Daily reminder that 2022 intern season is creeping up!",
        "permalink": "/r/csMajors/comments/ohqs3p/leetcode_sucks/",
        "comments": [
            "Well, LeetCode is what I grinded in order to get the job. But I'm starting my job on Monday and I still feel useless because I don't know anything. To make things worse, I look at the LeetCode problems now and go \"How did I even do these problems?\"",
            "That last sentence made my heart skip a beat. It feels too soon to start grinding. I also have ptsd from all the interviews during midterms. My mental health fucking threw itself off a cliff. I'm praying that my current company gives me a return offer. I will offer a virgin sacrifice. Just ANYTHING to get out of the impending grind and rejection.",
            "Facts, all the homies hate leetcode",
            "IB/law/med interviews are way easier IMO. They literally ask you \"why do you want to be [career]\" and that's a legitimate interview question -___- \n\nmeanwhile we got junior SWEs about to jump through fiery hoops over tanks of sharks",
            "Imho, leetcode isnt everything. Your softskills ale equally important - if not even more - than technical skills. You can be the best programmer out there, but if you communication is shit because all you do is leetcode in your dark room, then you're not going to make it buddy.\n\nHonestly. Try gaining some soft skills experience by contributing to open source projects (through a slack channel for examle). Much more benefitial for your personal development than leetcode",
            "[deleted]",
            "Ppl whine about LeetCode and I get it, but also what is another field where you can grind brain teasers for a few months and make six figures with a bachelor's degree? We can complain all day about how LC is not 1:1 with what you'll do at your job but that still sounds like a worthwhile trade to me.",
            "Not to justify Leetcoding practice and the broken tech interview system that we have, but history has it that the alternatives to standardised test framework (e.g. standardised exams, technical interviews) are usually even more unfair — filled with nepotism and insider connections that largely benefits the rich and well resourced. Take comfort to the fact that at least for Leetcoding culture, even though the interview process is dumb and algorithm qns are mostly irrelevant to the real job, it can be overcome by hard work and practice.",
            "Thank you! But how do I start?",
            "Is leetcode good for COMPLETE beginners? I take my first CS Programming courses in the fall! (It’s intro to computer programming and intro to C++)",
            "Try out pramp.com, helps with accountability",
            "[deleted]",
            "What's the alternative for learning CS, then?",
            "This is scary",
            "just stop doing leetcode fwiw",
            "Sometimes I don't know if it's leetcode sucks or I suck at leetcode",
            "I just flat out refuse interviews that require it.",
            "Grind codeforces instead",
            "Meh not really. Get into a hobby like competitive programming and it's just some simple shit"
        ]
    },
    {
        "post_id": "1c00b3x",
        "author": "Haunting_Arm5149",
        "title": "I think McDonald’s make more ?",
        "url": "https://i.redd.it/001c1zaf5itc1.jpeg",
        "score": 470,
        "num_comments": 53,
        "created_utc": 1712689573.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1c00b3x/i_think_mcdonalds_make_more/",
        "comments": [
            "given that this is like a legit publicly traded tech company (~250 million revenue annually), my guess is that this is actually supposed to be a monthly rate",
            "Welcome to CS.",
            "It could be 125k/yr too and that I think is more likely because companies generally post the expected annual income",
            "CS is the new gender studies 😔",
            "\"Over 100 applicants\"",
            "Depends on what IN means here, Indiana or India",
            "Found the position, apparently it is located in Bangalore and not Lake County, IN. So that might explain the salary…",
            "According to this subreddit, some people would still take that offer.",
            "in Indiania 12.5k a month is a lot.",
            "That's obviously a mistake from the HR software.",
            "Falls through the chair crying laughing",
            "99 of the applicants were Indians",
            "Yikes",
            "That's not even minimum wage for a year in my state",
            "They got the decimal all fucked up there",
            "That'd literally be below minimum wage 😂😂😆"
        ]
    },
    {
        "post_id": "1bixl32",
        "author": "lilwoaji",
        "title": "Should I apply?",
        "url": "https://i.redd.it/qk1vs1inbdpc1.jpeg",
        "score": 465,
        "num_comments": 25,
        "created_utc": 1710887741.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bixl32/should_i_apply/",
        "comments": [
            "They know your skills are worthless in this market😂",
            "It might be a waste of time, as they prefer graduate degrees.",
            "Simple. Can you process money data into the cash register database? Can you predict which add ons the customer might want on their drink? Can you visualize the cash being transferred? If yes then this might be the role for you.",
            "I'm sorry but how do the skills they highlighted have anything to do with a barista ? \n\nIt's almost like they are mocking you... wtf ?",
            "BAHAHAHAH WHY NOT?",
            "Sure, you can make the coffee into an AI.",
            "I mean if you want to add another rejection to your sankey diagram I’d say go for it.",
            "I believe the barista position also requires a very deep understanding of LSTM networks, so this will be tough",
            "At this point you don’t choose the career, the career chooses you XD",
            "Do you already now more about the interview process?",
            "It’s a job! - your mom",
            "Does anyone know what their technical interview is like?",
            "Starbucks AI",
            "In this market, I wouldn’t risk it. APPLY!!!!",
            "Don't waste your time - you're not qualified.",
            "Kindly check for the same position on their careers website ! If so then reach out to the recruiter at the company on LinkedIn.",
            "yes apply, and recommend me so we work together, make a startup with the res tof CS/SWE baristas and then be a contractor with Starbucks for data science."
        ]
    },
    {
        "post_id": "18w6rep",
        "author": "Dazzling-Rooster2103",
        "title": "Salaries vary greatly by location, do not get down on yourself by seeing $150k New grad offers in California if you live in a rural area, and are making less. (Data from Bureau of Labor Statistics)",
        "url": "https://i.redd.it/pcvp1s1n8w9c1.png",
        "score": 471,
        "num_comments": 72,
        "created_utc": 1704143257.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18w6rep/salaries_vary_greatly_by_location_do_not_get_down/",
        "comments": [
            "That random dark blue in Oklahoma is because Google has servers out there. I applied but couldn’t get an interview. Would’ve been an hour or so commute for me.",
            "Why is Alaska so high?",
            "Now do Canada",
            "Also, those $150k new grads are the top percentile in the new grads world, too. Most new grads right now are unemployed. So having a decent paying software job right now as a new grad is huge. Even if you're not making FAANG tier salary out of the gate.",
            "Also you’re living a hell of a lot better out in the sticks on 80k than in California on 150k",
            "https://www.bls.gov/oes/2022/may/oes151252.htm",
            "Should’ve made 5 or 6 ranges.",
            "Why is the last band so large",
            "interesting that pay transparency states like colorado have the highest salaries, too.\n\n&#x200B;\n\nseparately, isn't it weird that the \"annual mean wage\" is a range?",
            "I’m trying to get an internship in Huntsville which is that dark blue spot in north Alabama. I’m about 30 mins from there. Really want to get out of Alabama but I’m a freshman so it would be nice.",
            "One thing to take into account is that some faangs, such as Google, have an official multiplier for compensation between locations. So an employee doing the same thing in an office in one city could be making two thirds of one an employee in another city does",
            "Alaska making mad bank with the unlimited salmons they’re probably selling",
            "[deleted]",
            "[deleted]",
            "True, but also companies pay WAY lower than they should to adjust for cost of living and inflation in less cost of living markets… Cali 150k shouldnt be met with 80k in growing areas of florida (orlando/tampa)",
            "[deleted]",
            "I was really confused on why that part of NC was dark blue, then I remembered that I lived in one of the extremely poor areas 15min away from the millionaires lmao.",
            "from what i’ve seen new grad offers that high are honestly not that common. that’s for people with at LEAST 1-2 years experience already",
            "Working in a dark blue region making light blue wages. Shit.",
            "I think that last bracket is still very disingenuous. Raise the floor on that by 10-20k and you'll see a huge cutoff in most markets.",
            "What about the ones in Seattle with 0% state tax?",
            "Well obviously.",
            "Why in my country software engineering start with 15k-18k usd per year ):",
            "A lot of posts like this forget that the big companies not only have higher salaries but also provide bonuses AND stock options which offsets all of this COL talk.",
            "What does this mean?",
            "Can someone write a program to equalize cost of living and compare these after? Being paid 60k in Mississippi isn’t the same as getting paid 150k in Austin, TX. Even though living in MS is dirt cheap, you’re significantly better off in Austin.",
            "I am in Colorado, I don’t see anyone around me making that much money in software development"
        ]
    }
]