[
    {
        "post_id": "1636ivs",
        "author": "IndustryGradient",
        "title": "Got a return offer!!",
        "url": "https://www.reddit.com/r/csMajors/comments/1636ivs/got_a_return_offer/",
        "score": 467,
        "num_comments": 62,
        "created_utc": 1693181060.0,
        "selftext": "71k+ remote, no stock, 10k signing bonus in HCOL.\n\nI worked over the summer and my internship ended on Friday. Title will be applications programmer. I have had five internships, four of which were unrelated to CS and more related to my engineering discipline. I had 1 recruiter call, 4 interviews, no OA. :) Did tons of self studying and projects that 100% helped me out during the technical interviews.",
        "permalink": "/r/csMajors/comments/1636ivs/got_a_return_offer/",
        "comments": [
            "https://preview.redd.it/09pn01k2vqkb1.jpeg?width=643&format=pjpg&auto=webp&s=b6ea44daa50247d995cca26dd02f8e0bbbd80888",
            "Happy for u bro",
            "Well deserved!",
            "https://preview.redd.it/ri82665chskb1.jpeg?width=1400&format=pjpg&auto=webp&s=1c7a936de9db0d63ae6f79e1bc2637292b2292c3\n\nHappy for you bro!",
            "Remote and HCOL? What does that mean? You live in the HCOL area or the company does? If it's remote are you allowed to move to a LCOL area?",
            "$71k+ for HCOL w/ no stock? Is it a startup? Non-tech co?",
            "Woo!!!! Congratulations!",
            "Are you a Master's grad or bachelor's grad?",
            "Damn good job. Congratulations.",
            "Which HCOL city btw?",
            "How do you manage self studying? i am going thru tutorial hell.",
            "Are you starting next year or this fall?",
            "Well done!!",
            "Done 7months internship, all feedback was positive and I done a great job yet sorry we don’t have heads count or we don’t have the budget. Like Fuck you right in the middle finger. \n\nThen offer me extra few months internship extension. Fucking want me to work yet underpaid me. \n\nNow I won’t talk humbly and just say what I feel and think. Right \n\nI’ve done this, you can review it when you have time and let me know what you think. Thanks \n\nI couldn’t care less anymore, fuck my company, a sinking ship",
            "Congrats 👏🏻 and best wishes",
            "Awesome stuff congrats!",
            "Hell yea :)",
            "Liberty Mutual?",
            "Csaa?",
            "congrats",
            "Con😭gra😭tu😭la😭tions🎉🎉🎉",
            "Con😭gra😭tu😭la😭tions🎉🎉🎉",
            "Congrats! What’s your next goal?",
            "I'm happy 😁 for him",
            "Congrats man you deserve it!",
            "Could you elaborate at all of your projects?",
            "Congrats!",
            "Congrats man!",
            "Congrats!"
        ]
    },
    {
        "post_id": "14wu3uy",
        "author": "curlymuffingrape",
        "title": "Rejected from Google",
        "url": "https://www.reddit.com/r/csMajors/comments/14wu3uy/rejected_from_google/",
        "score": 468,
        "num_comments": 164,
        "created_utc": 1689088535.0,
        "selftext": "I just got rejected for the Summer 2023 internship at Google 😞. Don't know how to proceed from here. I was really counting on that offer. I thought for sure I would've gotten it. Maybe I should sue them for giving me false hope.",
        "permalink": "/r/csMajors/comments/14wu3uy/rejected_from_google/",
        "comments": [
            "Maybe they have August start date. Don't lose your hope just yet /s",
            "“counting” on a offer from GOOGLE is crazy",
            "L google",
            "This looks like a joke but there was a lawyer that sued her school because she wasn't able to find a job after graduation\nhttps://youtu.be/URMgpvoci_o",
            "Try yahoo then",
            "    import sarcasm\n\nJust got an offer for 3023 summer internship. There’s still hope. \n\n    return no there is int",
            "Bro really said sue em 🤣🤣💀",
            "Hey, just remember that Google is *very* competitive. Great job for getting close to that offer! It must have given you more experience in interviews. For now, search for summer 2024 internship positions and keep applying. Make sure your resume is polished",
            "If this is a serious post, I weep for the future of CS.",
            "Who cares?   Why is it so fucking important?  There's thousands of companies with challenges in their way needing you more.  Jesus.  Stop it with the whole \"I have to be at a FAANG\".  It's BS nowadays.  Do something useful for an interesting company who NEEDS the talent you offer.",
            "Sue for emotional distress",
            "If you’re serious: Get over yourself, realize there’s better candidates, and work on your soft skills and humility",
            "Sue them for damage.. emotional damage.",
            "I would definitely sue them.  No way they can give someone hope and let them down.",
            "their L for not hiring you",
            "I'm sure that's disappointing. But it's just like applying to college, you don't know where you're going to get in. So you have to try for many companies. And when you're looking for a job, you have to try it many companies because there's a good amount of randomness in this process. Start applying to other internships immediately if you're not already doing it.",
            "You were counting on getting one of the most competitive internships in the industry? We should talk about possibilities vs probabilities.",
            "Do you mean Summer 2024? Aren't applications for Summer 2023 long closed?",
            "Fuck faang, fuck google. I respect bag chasing but oh god, no, you missed out on helping Google conduct worldwide surveillance. How sucky.",
            "Rinse and Repeat",
            "This looks like a joke but you're showing you belong in r/LinkedInLunatics.\n\nWhich is ironic, since you don't even have a job yet xD",
            "You should never ever have only one job interview in progress. Always keep 2-4 as your backup so you can be more independent and confident in your interviews. It's common sense. Now you will be stuck and it will be very hard to find a job because most of the job listings were filled even before summer. I wish you luck, but this was very incompetent from you.\n\nOf course, you must find something so you can keep your CV updated with fresh experiences.",
            "Sue Google for false hope? They don't owe you shit. I don't understand the fascination of FAANG. You can literally work anywhere else if you know what you're doing.",
            "[deleted]",
            "Obvious satire that you guys missed",
            "I haven't even heard back and I applied on June 6 lol so I'd say you're still doing pretty well",
            "How did they give you false hope?",
            "https://media.tenor.com/MW-X63SzmsUAAAAC/tiny-violin-mr-krabs.gif",
            "Not a valid comparison but at least you had an internship in Google. I have been applying for an internship/full time job for the last 7 months but didn't receive any single interview",
            "I wouldn’t stress over it, a few years from now you won’t even remember that you applied.",
            "Welcome to the club, pal",
            "What in the hubris is this post",
            "It's ok, it happens to most people. Keep moving forward. True failure happens when we give up, keep moving forward even if the path becomes a little different",
            "Well there are many others who tried extremely hard and got rejected at the end. You are not the only one.",
            "Lmao got the same email.",
            "Summer 2023? Isn’t the Summer halfway over? It is July! What was the term?",
            "It's best not to invest yourself too much on this company and keep looking for options until you really sign.",
            "Just keep at it and find the open door. When google says \"it's not a match right now\" - they actually mean it. Don't burn any bridges and don't be shocked if you hear from them in the future.",
            "Man up! it’s not the end of the world.Rejection is part only part of your story and when it’s all said and done you’ll have one hell of a story to tell!!",
            "It's ok, doesn't mean you can't work there still.",
            "Reminds me of the joke Joan Rivers told.  According to the National Enquirer, Joan Rivers is suing Frank Sinatra for the 4 years of support she would have gotten had he asked her to move in with her.",
            "Many attorneys are paid $25 per hour these days. About 4~5 attorneys compete for a single job in a top big city with lots of job opportunities. When attorneys going out to meet people, of course they still dress up in suits and all look extremely confident.",
            "Fail forward. In other words, learn from it, keep improving, and don’t beat yourself up. There are so many things in hiring processes beyond our control, especially right now. Things that can have nothing to do with your competence or skills. Just keep getting better and staying sharp and your opportunity will come. The only ones who fail are the ones who give up. Better days are coming!",
            "You'll survive.",
            "might as well just change majors honestly",
            "Just reject their rejection email. That’s what I did when Harvard rejected me back when I was applying to colleges :))",
            "I can tell from the comment section how far on the spectrum we all are",
            "Grind more leet code.",
            "Are you white?",
            "Never catch feelings.",
            "https://preview.redd.it/vhv1gp3h9fbb1.jpeg?width=739&format=pjpg&auto=webp&s=8e39b0d1237d58006e86f41d3ddb7abcfc9cd08e",
            "cope",
            "sue them lmaoooooooo",
            "i just got it too 😭💀",
            "You’ll be fine, totally fine from it. Apple >>> Google, don’t get caught up on name brand for an internship. What really matters after the internship is passing the full time hire. It’s best right now to focus on a project that can make your work speak for itself. You’ll be fine",
            "If you even got interviews to Google ur probably good enough to get one anywhere else",
            "Man, if only there were other companies outside of FAANG people could work at.",
            "Mate, my interview at Google was quite horrible, recruiters were great but the technical interview was so poorly executed I could write an essay about it, the SW engineers I met looked stressed af and emotional ( this was last year when the hiring freeze & mass firing swept the market so maybe that's why?? but still ) It broke my fantasy of Google a bit",
            "Haha I felt the same way. We still have summer 2024. Don't lose hope",
            "Definitely sir. I am with you. They rejected me in 1999.",
            "I knew that women in cs major are automatically accepted regardless of their capacities. Is it true??",
            "with this attitude, were glad they rejected you",
            "Drop out, there’s no point any more. If you were to get an internship at Meta your parents would probably disown you from shame. It’s all over.",
            "There is still time to get an internship but you’re going to have hassle and call in all your favors",
            "Lmao what is wrong with the people here. There are companies apart from Google to work at",
            "Just apply for other stuff.",
            "thats it, you are going to be a failure in life now. everyone gets into google or else they fail at life.",
            "grind leetcode harder",
            "I played the lottery and didn't win, should I sue them?",
            "How many rounds of interviews did they take?",
            "What gave you a 💯% assurance that you will get to google?",
            "A rejection rookie... Reminds me of former me before becoming a rejection veteran.",
            "Did you get rejected before or after team matching? If after, then you probably just had bad luck.\n\nEither way, you are not very likely to get an internship for *summer 2023* at this point, so better use the time to better prepare. If you got rejected before team matching work on your LC skills, if after team matching do side projects in popular stacks to fill up that resume and have more “keywords” in there.\n\nFor context, for summer internships at Google, after you pass the technical rounds you are asked to fill out a project preference survey. Then PMs search through a pile of these surveys and pick from it those with matching backgrounds / interests. The earlier you apply, the better your odds, as you'll be on the pile “longer.”\n\nThere are tons of students who pass the technical but get stuck in the team matching, usually they get sent follow-ups by recruiters the following year. And if they are lucky (a strong candidate) they can skip the technical rounds and jump right into the team matching.",
            "Bro. Its google. no shit why are you acting surprised. Do you know how competitive their internships are?",
            "Oh nuuuuu - my FAANG-zaddy dream isn't coming true! The sky has fallen and there's nothing left to gun for!  \n\n\nYou'll be fine, jesus. I hate new CS grads.",
            "You should \\*definitely\\* sue them for giving you false hope.",
            "Tell us about this interview.",
            "As we all know, once you're out of MAANA, it's game over.",
            "You should sue",
            "Was it technical or personality side of things?",
            "Quality shit post",
            "I am sorry you got rejected but I think google is overrated. When I applied for vacancy at google after university I made it all the way to 5th round! I was so excited! I went to 5th interview, very hopeful and excited and what they did to me, I will never forget. They made me cry. I was standing infront of 5 males (I am female) and the task I was supposed to solve was so difficult that I didn’t even know where to start. I told them 10x I don’t know what to do and they just kept quiet. I walked away.  I don’t want anyone to treat me this way, period. Few hours later they called me to give me an offer - I rejected. I would never want to work for company who treated me like this at interview. \n\nI went for less famous company and I have to say I learnt a lot and now I am thankful that it didn’t work out at google. Take a rejection as opportunity. I don’t think Google is amazing as it sounds.",
            "Heard similar story from friends but Reddit rob does not allow my sharing to be published here."
        ]
    },
    {
        "post_id": "13dz7gs",
        "author": "Fun-Ring9571",
        "title": "abdul bari",
        "url": "https://www.reddit.com/r/csMajors/comments/13dz7gs/abdul_bari/",
        "score": 468,
        "num_comments": 44,
        "created_utc": 1683743615.0,
        "selftext": "this man is a blessing. i’m finally starting to understand it deeply. a recruiter gad reached out to me about the swe internship next summer and i was thinking about how much better prepared i would be compared to other times when i had to prepare for tech interviews. i have a pre-internship that starts later this month and it’ll help me technical interviews as well as get me interviews with partner companies which are pretty big companies.\n\ni’m trying to watch as much of him as i can before the start of the program, and i truly love his teaching style. it’s really really worth it",
        "permalink": "/r/csMajors/comments/13dz7gs/abdul_bari/",
        "comments": [
            "[removed]",
            "What does the google email have to do with abdul bari? Im confused lol",
            "Not all heroes wear capes",
            "This post needs more clout.   \nAbdul Bari is the patron saint of CS education.   \nPassed two top tech interviews due to him.",
            "Whats the pre-internship?",
            "Abdul Bari is god. Too bad he didn’t have his course on Java (udemy) when I started college 😭 but his algorithms course on YouTube saved me. \n\nHe responded to one of my messages because I wanted him to make a course on distributed systems since he said he has also taught that. But he said it would be a while until he does (if he ever).",
            "Praise be to Abdul Bari",
            "he hearted my comment once, best day of my life",
            "Abdul Bari ❤️",
            "My Algorithms professor barely had a pulse. Abdul saved me.",
            "Lol I am watching his video while this thread appear lol. Anw, how did you get in touchbwith ggl recruiter?",
            "Exactly. In my lectures, the professor might as well be speaking mandarin, cause I don’t understand jack shit. With abdul, it’s a piece of cake",
            "THAT'S WHY HE'S THE GOAT, THE GOAT!!!!!!!!",
            "♥️ Abdul bari 😚 doing his c++ dsa course!",
            "The man The myth The legend",
            "Omg he used to teach at my uni. I miss binging his videos a day before my DSA exams :’)",
            "new goal watch all abdul bari videos",
            "Bro is a legend. Helped me a lot in my freshman year.",
            "Not all people can reach you, but that man has what it takes to be a teacher, he is a genius in his trade.\n\nAs Richard Feynman once said, If you cannot explain something in simple terms, you don't understand it. \n\nAnd that man understands his stuff very well.",
            "Wild his face flashed in my mind",
            "Could you share how did you network that a google recruiter reached out to you",
            "praise be",
            "He is a gem 💎",
            "Mn Abdul Bari Hun, mn Acha bacha hun",
            "Same here, I am from non technical (business) background, but wanted to transition my career and current job. To start foundation programming course such as Introduction to Java, I was learning on Sophia to get admitted in WGU. No one could have made Java as enjoyable and interesting as Abdul Bari Sir. He explain it in easy language, with solid foundation. If anyone will ever ask me for a resource for beginners. I’ll always recommend his Udemy course. Just so well structured, this is something that definitely take you from 0 to advanced Java."
        ]
    },
    {
        "post_id": "zwz4dn",
        "author": "None",
        "title": "Any other women/gender minorities just fucking tired?",
        "url": "https://www.reddit.com/r/csMajors/comments/zwz4dn/any_other_womengender_minorities_just_fucking/",
        "score": 467,
        "num_comments": 388,
        "created_utc": 1672198373.0,
        "selftext": "Tired of dealing with big egos, tired of men being surprised when they realize I'm \"actually smart\" and \"not into graphic design\" (???? as if graphic design is trivial anyways). Tired of my boyfriend's parents acting like he is so much smarter than me WHEN WE HAVE THE SAME INTERNSHIP. Tired of having to explain over and over and over again what feminism is, tired of having to explain that it's important to educate yourself about identity and culture, tired of people acting like I'm being political when I just want people who aren't the majority to feel supported in this stupid major. Tired of being one of two girls in a classroom at a T10 university.\n\n&#x200B;\n\nRant over. Rant back @ me in the comments. Making this post because now that the semester is over and I can reflect on it, I am realizing how mentally exhausting this has all been. Not only am I a full time student, but I have to stand up for myself all of the time. I have the urge to stop making sensical arguments and start barking at people.\n\n&#x200B;\n\nEdit: Not sure why I expected women to respond to this lmao\n\n&#x200B;\n\nEdit #2: After 3 years at university, I did not know that men were secretly harboring these opinions this whole time. Has the support this whole time been performative? Wowza.",
        "permalink": "/r/csMajors/comments/zwz4dn/any_other_womengender_minorities_just_fucking/",
        "comments": [
            "Recently retired after 30 years in the industry (I'm a man):\n\n* In my career, I witnessed many, many instances of misogyny, ranging from obliviousness to outright hostility. \n* The worst instance was in a company with several several tech leads, one of which was a woman. The woman was, by far, the most intelligent of the bunch. Yet when faced with a problem, I watched as the group would try every idea from every other man in the bunch, no matter how stupid, before grudgingly trying the woman's suggestion.\n* Sadly, if you don't get women into hiring positions, you're probably not going to hire a lot of women. Or hire fewer women.\n* Obligatory comment remarking that the majority of men are not hostile. I think what most men miss is that it only takes a few to create a really bad atmosphere for women.\n* Many of the comments here are, sadly, not surprising.\n* For women: Find other women as mentors. Joins professional organizations supporting of women. Don't let the bastards grind you down.",
            "I’m a female SWE that leads a team of devs. I’m one of the lucky ones that got in at a good, progressive company; we simply don’t hire sexist assholes. I’ve dealt with plenty at other jobs in the past. Just wanted to pop in and say that there are good places for us out here!",
            "Those CS social skills aren't completely a stereotype, the comments here prove a bit of it.",
            "For any women reading this, it gets better. If you ever feel alone, there are a couple of organizations you can join for women in CS (Anita B.Org and Women Who Code come to mind). Don’t let the comments here discourage you from a really cool and fascinating field. A lot of men in CS have no social awareness and that’s on them, not you.",
            "As a black man working as a software engineer, I think I've experienced some similar things here. I also see how black women who are also software engineers get it even worse as a combination.\n\nI will say that I've noticed it be much less of an issue in my work experience compared to college. I worked at my university's CS tutoring center during college, and it was a perpetual cycle of a new student being doubtful of my assistance, finally seeing that I actually understood what I'm tutoring, and then treating me like others afterwards. It was frustrating since it was so blatant how other nonblack tutors were given that respect right away.\n\nIn work, I notice this less and I get the impression that women also deal with this less. I'm obviously not a great source for women's experience in the workplace. But I hope this gives you some hope that the issue is smaller (but still real) once you're past college and into the profession. I also notice more more women compared to the % I saw in my CS classes. Rough numbers, but I feel like my CS classes were like a 80%/20% of men/women and at work it's closer to 60%/40% of men/women. My guess is that there is somewhat of a selection bias for men/women when it comes to choosing CS as a career. Since CS is not socially welcoming to women the way that it is to men, women  tend to go into it if they have a higher level of desire and/or skill in it early on. That would lead to women making up a much smaller percentage of students that drop out or graduate without being able to find a SWE job in the long-term. But I'm just guessing and inferring a lot.",
            "Yes. It is tiring.\n\nAnd it continues. I'm 20 years into my career and I'm a senior dev, and I get men shocked I'm programming or doubting my skills.\n\nThat said, the paycheck is worth putting up with the asshat men in work, so I don't have to put up with them in my non-work life. I can always switch jobs, but social circles are harder to change, and financial independence is a major boon.\n\nProgramming was a women's field first, and I won't let them take it from me.",
            "T10 School, Woman in CS. I’m jealous of your job prospects! Keep on keeping on, you will do great.",
            "As a guy, pretty valid complaints tbh. I’m not gonna pretend like it’s sunshine and rainbows now for women in the industry, regardless of the mostly positive environments I’ve been a part of w/ regards to women and other minorities in tech.\n\nBut I’d say it’s getting better, as a freshman at a T15 school there were like only 5-10 women in my classes, now as a new grad I saw so many women attending office hours this semester for the lower level classes. Only way to go is up imo.\n\nAnd hey, regardless of whatever people may say (diversity hire, my son is smarter, etc.), a person is whatever room they are in, and right now, from reading your comments, you are a quant, end of story.",
            "yeah i’m a senior girl in CS. I have a good job lined up, i’m competent in my classes, but I also constantly struggle with worry about being assumed to be less intelligent just because i’m a girl. I’m not a genius or anything—but I’m not stupid either—I’m probably average or a little above average. I feel like as a girl in CS though, being average isn’t good enough. I always feel like I have to go above and beyond to prove that i’m not some dumb girl. \n\nI’m also a “girly girl” in terms of my preferences about the way I like to dress, shows I like, my hobbies etc., but I always tone it down in class and during CS-related meetings because I don’t want to be viewed as some vapid airhead. Like, there’s a noticeable difference in how i’m treated when I decide to wear a skirt vs. a hoodie and sweats, even though it doesn’t actually make a difference in how competent I am. idk. there have even been cases when male non-CS majors (specifically, an ME guy and an IE guy) who’ve dabbled in a little bit of code try to talk down to me about my ability to code when I’ve literally completed multiple SWE internships and upper level cs courses like algorithms and os.",
            "As a woman I get how you feel, I’m seeing a lot of people in the comments missing the point / perspective lol, but it’s not surprising. Here to say that ur feelings are valid.",
            "All I seem to find are supportive comments and comments saying how the men are proving the point and the comments are atrocious but I don’t see the actual atrocious comments. Maybe premature reactions? There’s always gonna be toxic comments on every post almost anywhere. To expect none is just ridiculous.\n\nEdit: Finally found them! Seems like all the bad comments are downvoted to hell. Is that not a good thing?",
            "as a male pre-med who has no idea why this post was suggested to me:\n\ndamn im sorry. i've actually heard this from female peers ab why they ditched cs, and it honestly seems understandable. having a class where almost no one can truly relate to u sucks. hope it gets better",
            "Hello fellow woman, \n\nPersonally I’ve just started so I can’t say much. When I first entered into class it smelled like sweat and my partner who was a guy wasn’t talking to me. He acted like he knew everything and I immediately thought all the stereotypes I heard must be true. At the end of the class I realized most of the people in there had no clue what they were doing. I gave people who cared about learning the time of day and asked questions to female TAs and the female prof. \n\nOverall I can’t complain to much on being a woman in CS. I feel like because I am a woman it gives me more merit if that makes sense. I get small recognition for the effort I put in here and there and even got recommendation to apply to a woman in CS scholarship. I would try to join a women’s focused CS group because it sounds like you need something different.\n\nSincerely,\n\nA first year",
            "I feel this so hard. At least in my undergrad program, our class was at least somewhat split (70/30 maybe?) so I had a good group of female friends who I was able to work and get along with. In my grad program, it’s heavily skewed male and the majority (70%+) are Indian international students (no hate, I’m Indian too). A lot of the international Indian men here have grown up in parts of India where women are almost always stay-at-home mothers who are given no respect by society. When I’m assigned to group projects with them I have to constantly think about whether they’ll respect my choice of clothing and makeup, and it feels like a fight to earn their respect. At my internship this summer in big tech (FAANG adjacent) I was the only woman on the team who went to the office in-person. While everyone was respectful and kind, it still felt like a weight on my shoulders every day. I know we’ve made huge improvements in getting women into tech, but it still doesn’t feel like enough.",
            "wow the comments here are depressing. \n\ni don’t think many of the people in this thread understand the mental/emotional burden of being a woman in an extremely male dominated industry- it’s harder to get along with your male coworkers and i find myself putting in a lot of effort to get along with, be respected by, and communicate with big ego dudes that I can’t fully relate to and probably already have judgements in their head about me because of my gender. \n\nfor example ITT there’s already a comment about women getting affirmative action when there’s colleges (like UCs) that aren’t allowed to use affirmative action lol so how would you even know for sure if someone is a affirmative action admit or hire?\n\nthat leads to a lot of emotional labor that goes unseen/unappreciated, but has to be done. it will probably get worse the higher up women to get in their career path. \n\nhowever a silver lining is that I’ve been able to find male friends and mentors who understand that there are struggles that women face in this field and although they won’t be able to fully experience what we do, they try their best to understand and support. hoping that OP can find these people <3",
            "A huge lot of men just wont understand this no matter what, i think. We just dont experience the same societal/cultural struggles in this category. It’s really truly disheartening that being a woman/afab comes with so much difficulty and frustration. That said, i am sorry you’ve had to bear all this ignorance, and you are very strong for doing so. Knowing how a lot of these dudes are, it was very brave to post this lol.. these comments. 🥲\nI wish you luck in your career",
            "My girlfriend goes through a lot of shit doing a dual degree program at my university (CS) and a local college (Applied Math). The worst part is her friends at her all women’s college aren’t even supportive of her path, and make mocking, condescending comments about being quirky cuz she’s a “women in stem”. This might just be because we’re in the Midwest, and most women in the area have zero ambition, but these comments are horrible and unsupportive. There’s only a few people in her program and they don’t seem to have much solidarity. My university peers (specifically fellow men) are equally bad since they look down at the women who come from that college —it’s overall a terrible situation. I’m just glad I can support her and help her where I can. She’ll be doing Microsoft explore (grad 2026, 5 year program) next summer and I’m super happy for her. My university is a T20, but for some reason we mainly feed into consulting, and the people who want to break into big tech are on their own. \n\nAs for the women at my own university, I haven’t noticed them ever being downplayed (might be due to the local college women used as scapegoats tbh), and most of my friends happen to be women in CS too. But I should definitely ask them for their feelings on the matter just in case there’s anything I can do to be more supportive.",
            "The number of times people have called me a graphic designer….like I just can’t. (I’m a front end/ux designer…I’ve literally never called myself a graphic designer)",
            "Valid complaints. There are wildly different degrees of this with different companies and people. FAANG seems to be good by comparison.\n\nYour boyfriend’s parents sound lovely 🙄",
            "Oh man, you deleted your account. Well, on the off chance that you'll see this - I'm not going to pretend I know what your experience is like, but your feelings are valid and being treated as a less-than human for real no reason except bigotry is fucking exhausting. I'm sorry you're dealing with this and please know that for every sexist man giving you grief, there are tons of women supporting you. \n\nI got into tech after being an ICU nurse (including during the pandemic and working in a medical warzone) and dealing with some of these condescending assholes during interviews was the worst. While I had relevant transferrable experience to the jobs I applied for, the bulk of my experience was at bedside as an RN. They seemed to believe my job as a nurse was to smile, wipe butts and mindlessly give meds and clearly did not respect me nor feel I should be leaving nursing. I guess my identity has to be nothing more than a \"helper\" forever because nursing is a calling /s ...yeah, I can only imagine how much worse it is the more technical the role for women in CS. \n\nHang in there and don't let anyone make you feel like you don't deserve a seat at the table.",
            "All the men in here are proving her point lol",
            "I told my friend, about this pressure of being the only women in the room, and they said, so what? What is the point here?\n\nI realized no one really cares for women's emotional health. Many people talk about men who lacks sympathy and cannot talk to no one, but at least at work, at school, people don't treat them like nothing. People recognized men's participation and try to include men. Women are invisible even when they achieve something. If I say, oh I play that game too, no one wants me to talk about it, unlike any other guy. I was dismissed. Even my achievements are dismissed when I try to share with them.\n\nMen don't feel comfortable having an equal women friend who can do whatever they do and above. I felt like the only way it works to carry a friendship with them is, my achievements are sheer luck, your achievements are hard work.\n\nThe only place I feel I am recognized is work. It's a sad thing to admit but I like it. I feel like I'm treated like a black sheep everywhere else. It's ok. I'm doing what I like and I don't care what everyone thinks.",
            "Holy shit, the comments on this post are horrendous. It is so exhausting to be a woman in tech. Yet I feel like I cannot ever give up because I would be nothing without my female predecessors and mentors.",
            "I feel you. Thankfully I haven't been too exposed to those kinds of people yet, but going into the industry I know I'm bound to sooner or later. At this point I've learned that there is just no helping some people. You either learn to give them answers that shut their stupid mouths or just ignore it. \n\nFor the sake of my mental health, there are many things I just ignore or steer the conversation away just so I don't spontaneously combust from the ignorance and stupidity. \n\nBut you're totally valid in feeling absolutely done with the bullshit. It feels crazy that in this day and age there's still so many people who think like they're living in the middle ages.",
            "this post brought out a whole bunch of toxic assholes, didn't realize this sub was so full of them. pretty sad.",
            "You’re not alone!! Find your people. Make connections with the other women in you classes. Create a club even! Create networking specifically for other women at your job or in your classes. We have to stick together so that it doesn’t always have to be this way.",
            "I haven’t even graduated yet and already experienced sexism in this field. We had a group project, I was the only female. Every single suggestion I had would get shot down immediately. Any small change I would have to make while coding would be scrutinized and I’d often have to go get reassurance from the TA so I could just get it merged. I had to put up with outright anger outbursts that, of course, men are always allowed to do and get away with. So sick of it the whole semester. \n\nI understand ppl can be assholes in general, but I realized it was sexist when my other lab partner, who was male, never put up with any of this…\n\nJust wanted to rant about it a bit. I ultimately did inform my professor of everything.",
            "Hang in there! You are not alone. I had an internship last year where my boss spent the 3 months trying to convince me that software development was a pipe dream for me. Every time I made a mistake or had a question - it was because I’ll just never be on the same level as the guys. When I did something right…it must be nice to have a husband as smart as mine to help me.\n\nI almost quit software dev altogether after that. Not because I doubted my ability, but because I doubted that I would ever find anyone to respect me enough to hire me. \n\nThank god I didn’t - I’ve been at my new job 6 months - not a single person has brought up that I am a woman. My teammates are all men and they are all amazing mentors who respect my ideas and yes they even respect my questions and mistakes! No one goes easy on me, everyone expects the best from me. That feels like respect. \n\nI hope everyone here is able to find their dream team soon.",
            "woman in cs, i definitely agree there are people/guys like that in cs, but honestly don't waste your time and energy on sexist men, like going out of your way to explain feminism ig. unless their actions become an issue that affects ur grades/productivity, then discuss it. other than that, it's not worth it and will probably make yourself angrier which isnt fun. trust me that there are many other cs men who arent sexist/condescending, especially beyond the bubble of college! have faith my friend and gl",
            "Fellow female, Asian SWE here! I believe issues \"similar\" to this are prevalent across all fields, not just ours. My boyfriend's in business consulting and I hear horror stories of discrimination against ethnicity & wealth status (the network you are born with, family, etc) on a day-to-day basis. On the other hand, our issues are more gender-centric due to statistical ratios. All of these should definitely be addressed and improved, but at the same time, there is no industry that is discrimination-free (unless our society turns into a utopia someday). The best that we could do is to prove them wrong, to become the living counter-examples of these stereotypes. I know this sounds a bit cliche, but who knows our efforts can change this industry for future generations. I'm very sorry to hear you had to go through all that OP, I can certainly relate.",
            "Some of my favorite peers in undergrad as a CS major were women who would be cool enough to help me understand concepts. Half the time the males, especially those ones who’ve been programming since a younge age would make me feel stupid. Sucks that in todays age men in CS still act like women have to “prove they’re just as smart if not smarter”",
            "Honestly if this was my bfs family and he continually let it happen, I would have broken up with him already. I think a change in the company you keep is what you need",
            "Hi F21 here. I'm the only IT woman in the office. Everyone else is dudes. I hear guy jokes all day but personally don't care. Because at the end of the day I'm about to get my bachelor's, already have tons of certs, and about to get a year of experience so I can succeed farther than they ever will.",
            "Yes, it’s why I changed industries. I don’t get paid as much, but I enjoy the work and environment much more. And my company (and similar companies in this industry) are always at least 45% women",
            "I'm a man with 18 years as a software engineer and two degrees in computer science.\n\nI'm sure it's rough but get through it. I'm not going to say that this discrimination doesn't exist in industry. I'm sure it does but it isn't everywhere. I'm sure you can find work places where it isn't a problem. \n\nThe company I work for is very good and tolerant. There are plenty of women and trans people (I don't actually know many people's sexual preferences so I can't say). The company I worked at before that was very tolerant and the one before that and the one before that as well. Yes it's true that there could be instances of discrimination that I haven't observed because they wouldn't be directed at me but if so, they are the exception rather than the rule.\n\nSoftware engineering is really a great career, so get through the nonsense, work hard, network, investigate potential employers using Glassdoor or talk to current employees.\n\nSucks that this happens but good luck!",
            "I started transitioning right before I went to college, so I spent the first year not really passing that great. It is fucking insane how just magically I'm not treated like the most stupid motherfucker to step foot on campus now, and all that changed was someone's perception of me. It's still pretty awful since I still don't pass great 100% of the time, but like holy god I will spend 50 minutes just asking if we could add a pronoun tag to a study group discord and it's just back in forth \"no and here's why\" \"why do you even care\" etc...",
            "The plus side is managers at large companies have diversity quotas to hit, so you’re going to have an incredibly easy time getting hired. \n\nThe downside is constant imposter syndrome because you won’t know if you were hired for your skills or their diversity quota",
            "I think it's worth mentioning that, in most projects or meetings where planning is done, men take in input differently from women and men. Men will literally ignore a good idea coming from a woman and applaud the same idea when coming from a man. I have been in this situation so many times, it genuinely made me doubt my abilities and wonder whether I was actually worth listening to. \n\nI know I'm not a genius or something and the reason why I present my idea to the meeting is because it *isn't* good enough and it needs *improvement*. My idea might not be good enough and that's fine with me. However, if you tell me that my idea is not good enough and if you accept the same idea coming from another guy, that's just bullshit.\n\nLast semester, we had a workshop where we were supposed to generate ideas and present them after a few minutes. My team had two boys, and both of them continuously neglected whatever I had to say, yet praised the same idea, with the same components and constitution, when it came from another guy.",
            "I’ve actually had a pretty decent experience in cs, mainly due to my friend group. But it’s times like these when I check the comments— yup, reality check.",
            "I work in tech, literally got fired for telling my boss they were being inappropriate and unprofessional. That was just the straw that broke the camels back. Hired two women, they (the guys) basically stopped working and expected us two to do EVERYONES job. I mean everyone’s job networking infrastructure systems all the way down. I was like ?? I’m not paid to do all that… \n\nI have no idea how these men get into these positions but MOST are utterly incompetent. It’s ridiculously bad.\n\nThe often make me client facing bc the guys are stupid and literally stink. Like…. How in the fuck do you get a professional job when you were that goddamn stupid and smell bad? I live and work in Houston too, one guy was super proud that he doesn’t wear deodorant. I couldn’t even stand in the same room with him, I was gagging…",
            "yupppp. i really thought that going to a progressive school with a great CS program that “is committed to gender parity” would be enough, but it’s not. i’m tired of hearing “oh, you must ACTUALLY be smart”, “wow when i met you i thought you were dumb”, “i thought you were gonna say you’re a communications major”, etc. when i get straight As in all of my classes without too much effort. i shouldn’t constantly have to prove that i don’t deserve to be underestimated, and at the very least i shouldn’t have to witness them realizing that i’m “not like other [dumb] girls” right in front of my face. i’m tired of having every guy i meet assume that i’m shallow and stupid just because i’m a sorority woman who likes to have fun. guys will say it doesn’t happen or that they didn’t assume it, but i can see how much they assume they should look down on me by their reactions when they hear i’m in CS. i’m tired of walking into every class and having it absolutely reek (i really thought the “CS men don’t shower” thing was an exaggeration, and it absolutely is not). i don’t talk to people in classes because every time i’ve tried to work with a guy, it’s been either 1. they completely ignore anything i say/act like i’m not there 2. they act shocked beyond measure when i know answers to questions and they don’t 3. they copy off of my work 4. they hit on me 5. they act like i’m some zoo animal to ogle because i’m 1 of 10 women and always the only white girl (our CS program is around 70% asian) in a room of 200. it used to feel empowering to know that i’m so much smarter than men give me credit for, but now it’s just exhausting. proving a man wrong and showing that i’m smart doesn’t help women in STEM as a whole; they just see me as the “exception”. i’m thankful for the few guys in my major that truly do see me as an equal (most of whom i’ve known for years before college), but it really is awful to constantly feel eyes on me when i’m sitting in class and know that they’re all thinking “why is she here”",
            "As a man envious of your skills. WAY TO GO SIS! KEEP IT UP.\n\nTLDR; Didn't get to go to college, don't have the ability even now. I'm happy that you are. Best wishes to you.",
            "[deleted]",
            "This gave me some insight into my fiancé’s issues with being an EE in a small sub specialty. Her entire womens EE club has so few members that almost all of them are stuck with leadership roles, despite desperate efforts by the university to try to boost female enrollment. She’s mentioned a few times feeling lonely as the only or nearly-only non-admin woman at the company she does grad work with.",
            "I totally feel this. The split in my actual department is obviously there but not nearly as drastic as it is in other places; I'd say there's at least 15-20% women in most of my classes. But I just got accepted to a really competitive and prestigious program at my school for SWE and startups, and was shocked to find that there were only 7 or 8 women out of over 100 accepted applicants. \n\nAdditionally, part of the application process included a competition, and the top 3 winners were completely male teams (12 men total), decided by a judging panel (3 men), and awarded by program leadership (5 male faculty and 3 male TAs). Not a single woman on that stage. And my school is >80% white so there were almost no ethnic minorities in the whole applicant pool and definitely none on the stage. \n\nNeedless to say, as I participate in this program next year I will be working to improve female and minority representation in the program.",
            "i’m a white dude and i’m also tired of the unbearable assholes in this field/major. i cannot imagine being a woman.",
            "For every guy who's openly an asshole, there's 20+ others who are guilty of micro-aggressions of the type that escape notice, but create a vague friction to under-represented people in tech. It's easy enough to write off the assholes, but the little stuff adds up. It usually isn't even intentional. But intent doesn't matter when you end up feeling unwelcome and exhausted without even knowing why. Or you end up second-guessing what people say and do, wondering if they're aware of it and it's deliberate, or if it's accidental.",
            "You guys made her literally delete her reddit account. Damn...\n\nIn the other hand, my school has about 10-20 percent women in my CA classes, so better than the 1-2 students, but definitely need to encourage more women in STEM. I'd say the average male CS student at my school is too nerdy on average to even think about disrespecting women to their face as the OP suggests happens frequently at their university. But all it takes is 1 or 2 instances of douche-bro behavior for someone to form a bad opinion of CS majors in general I guess. I bet it'd be worse in some other majors, but I'm not a woman so I can't say I have those experiences.\n\nI can say that I have not seen any of the women in my degree getting disrespected or even hit on inappropriately, even though some of them are quite pretty. I politely got the phone numbers of two but found one has a boyfriend and the other has cat allergies, so respectively and politely acknowledged the rejection lol. Guess I don't see how many dudes are asking them out and being disrespectful, so not gonna say it doesn't happen, but there's certainly not any overt circumstances in class occurring.\n\nAnyways, feel bad for the OP deleting their reddit, and hope it was just an alt account or such. Sorry for any women experiencing disrespectful behavior, I know it's a big issue in society at large.",
            "I'd say no, actually.  Ive experienced some gender discrimination here and there, but I am really hoping things continue to be relatively smooth.\n\nI was in the auto repair industry prior to CS, and honestly that is what broke me. So I wonder if I am partially numb to gender discrimination.  \n\nNot trying to downplay your experiences, I am just happy to report that my experiences as a woman in CS have been mostly good.\n\nI graduate next semester and I am really hoping I can get a good job and be treated reasonably well.",
            "what does intelligence have to do with the internship you get tho",
            "Some of the best computer scientists I've known in my career have been women. I know this subreddit is mainly populated by students. So, if you're a younger guy who's early in career or still in school and you think all of this is a bunch of pointless drama, I'm here to tell you something from a senior mentor in the industry. You're showing your inexperience.\n\nOP please don't let them make you give up. In the real world we need people like you who are confident enough to speak up. Change will never happen without shining examples. I promise you don't have to do it alone. Others have already mentioned the organizations that exist for women in computer science. But you can get help much closer too. Look for allyship. Don't let the droning noise of the internet cloud your perspective. Not every programmer out there is a basement dweller looking for opportunities to raise themselves by putting others down.\n\nMy previous manager especially was one of the hardest working and best leaders I've ever seen in a developer team. She was hands on, always taking hard problems on to challenge herself. While somehow finding the time to deflect BS away from the rest of the engineers on the team. She offered wonderful mentorship and a kind of mental security to her team that made it the perfect place to learn and grow while having an impact in the greater organization. Great inclusive teams exist, and if we're all nurturing to those who will come after us we'll see them far more.",
            "You can tell who gets top internships and who doesn’t just by this comment section. I know damn well most of you failed your behavioral interviews 💀 Amazon is the main FAANG people in this sub get into for a reason",
            "[deleted]",
            "That really sucks. All I can say as guy is that I've worked for two different companies this far where we had plenty of female engineers and I never saw anything remotely demeaning or sexist occcur toward them and they had a full seat at the table and provided just as much value as men. \n\nThat said, I live in the Midwest and neither company were FAANG or Fortune 500 tier companies so I'm beginning to suspect that when bigger egos are involved you see more shit like what you're seeing. Everywhere I've been has been chill and equitable. But just know that those places exist (and are thrilled for every competent engineer they get) and go find one once you're through. Nobody needs to work someplace where they are made to feel lesser for no damn reason.",
            "As a senior software engineer, I wish I could do more to help. I do my best to credit the devs who help me regardless of gender, and try to make sure the bosses know. I wish we had more women in the industry. I wish we had more diversity in general. If you have any advice on how to change things from the inside I'd be happy to read it.",
            "You can just straight up ask your recruiter/hiring manager what % of SWE working there are women, black, latino, etc. A better question is the % in executive and management roles. If 99% of big shot managers are old, cis, white dude I’d pass or job hop after 1-2 yrs.",
            "That sucks a lot. Try spending more time with people who appreciate you. \n\nBecome so smart that there’s no question who’s smarter :)",
            "just prove em wrong soldier o7",
            "You know its Murica when you see titles like this",
            "[deleted]",
            "I think some of you should realize that your feelings are the exact same feelings and issues that even the straight white males in the field(and every field) deal with.  Reason is bc its not always about gender, but that the field is full of know it alls with zero social skills.  Just look at the threads here and in cscareerquestions.  \nBeing ignored, looked down upon, others assuming you arent good, you just assume its bc youre a woman, but have you looked around?  For every pair of bros yo see hitting it off in the c-suite there are plenty with their head down trying to come up with a snippet of small talk they can use so they dont feel rejected all day long.  \na whole subculture of men (LDAR etc) sprung up bc they felt ignored, cheated, and looked down as second class citizens.\n\nTry looking at it from a different angle, bc posts like this demonize men when oftentimes men are dealing with the same issues you are, except they are taught to keep it to themselves as they are already \"empowered\", sadly no one has told them yet.",
            "Just wait until you get into the workforce.",
            "You sound like your just around bad people currently but it won't always be like that. Unfortunately I've never had a class with more than 5/30 being women for cs but school ends eventually. Your bf parents prob overemphasize their sons achievements because it's their kid but u don't gotta be concerned with them. Meet new people and you'll find not everyone has that old mentality. When ur working you'll meet women who do the same work as you and prob make friends which u can look forward too. There's also programs like women who code where u can meet others with ur interest",
            "You’re a beneficiary of affirmative action. You will receive preferential treatment due to your gender, being showered with opportunities while men have to fight tooth and nail.\n\nhttps://youtu.be/LYiFDcpX6sQ",
            "I am sorry you're having this experience. There's nothing I can add to it beyond \"I believe you,\" so I will refrain from trying. These are observations, not an argument:\n\nIn my college of CS (Northeastern), the dean was a woman, 4 out of my 5 professors were women, and probably about 3/4 of the professors were women. All of the servers were named after prominent feminists, so the name of a feminist would appear in your email address. (Back then, the name of the server appeared in your address.)  I learned most of what I know from women. I've had women as bosses. I've had women as peers. I've had women report to me. When I once had someone at an employer accuse me of misogyny, my response to HR was \"how many women do you want me to line up to state that I'm fine working with women?\" \n\nI am telling you this not to toot my own horn but to say that the industry you are training in is not the industry I've worked in for decades.\n\nI'm a gay man, so my perspective is a bit aside of everyone else's. I can stand aside and watch the world obsessing about gender, and laugh at it. \n\nSo, let's take the job interview process.\n\nWhen a man interviews and I'm talking to him with young straight men, they're hard on him that he has to have 100% of the skills we're looking for (even if they didn't when they interviewed), and he has to be absolutely perfectly behaved and immaculately dressed, or they won't approve of him. When a woman interviews and I'm talking to her with young straight men, they want to hire her. It doesn't matter if she's completely unqualified or doesn't even speak the language, they want to hire her, and if I point out that she doesn't know anything or that we can't actually communicate with her, they start making excuses. I have sometimes had to put my foot down and say \"no, I will not hire her, because I can't communicate with her/she knows nothing\" and force the issue, and even then I still get \"we should hire her instead\" for every candidate.\n\n(For the record, I tend to bring women and minorities into a workplace that doesn't have enough of them. \\[Not to \"balance\" things, but just because I hire people without preference to gender or race.\\] I am talking about when I interview a woman who is *unqualified*.)\n\nOnce she's on board, the differences don't end.\n\nI need to be very aware of my working relationship with *any* woman, because it has happened that everything seemed fine and then (for reasons that have nothing to do with me) she accused me of sexism to HR and tried to have me fired. (I was just a convenient scapegoat.) HR told me outright \"as a man, if *any* woman makes an accusation against you, you will be fired if you can't *prove* her wrong.\" (At one point a woman said that she's a lesbian and I discriminated against her because I hate gay people... my response to HR was \"my boyfriend works a few blocks away. Should I ask him to come by to give me a BJ in your office to prove I don't hate gay people?\")\n\nI've had several women colleagues claim \"you hate women because you're gay.\" (That's the dumbest thing I've ever heard.) I worked with one woman who worked her way up the corporate ladder, despite knowing *absolutely nothing* about programming, by dressing provocatively in interviews, coming on to men in the interview (she had no idea that I'm gay, and the guy who would be her boss was there and saw it), and accusing any man who disagreed with her in any way, no matter how slightly or how politely, of being sexist, and telling HR she wouldn't sue if they fired him and promoted her. (She failed to observe that during the incident she complained about me for I had three witnesses to point out that it was minor and I was exceedingly polite.)\n\nIs all of that sexist? Yes. Is it likely to harm you as a woman? Not substantially.\n\nSo yes, you're facing misogyny in college, and I'm very sorry to hear it. As a gay atheist cripple, I know how awful it is to feel stuck somewhere that you are discriminated against. I see you said \"after 3 years at university\", which implies that if you're working on your undergraduate degree, you've probably got a year (or less) left. If so, I encourage you to finish it and look forward to a career in which you don't have to put up with that shit (not only because it's less common in the actual workplace, but because there are various government agencies that will intervene if they try it on you). If you're a bit behind and will take 2 more years to graduate, I encourage you to consider transferring to someplace where you will be better treated. If it's a graduate degree you're working on, I encourage you to look into transferring unless you're about to graduate.",
            "blah blah blah",
            "[deleted]",
            "damn, i didn't know ChatGPT could generate this type of paragraph.",
            "You could likely make a case against your university for creating an inhospitable learning environment, especially when you're making tech money.",
            "[deleted]",
            "[deleted]",
            "As a simp, I definitely help any girl if she asks me 💀",
            "[deleted]",
            "[deleted]",
            "Maybe you aren’t coming across all that kindly to the guys you interact with and this is impacting how they treat you. Sure, some are probably shitty, just as women can be, but on average I’d say you get what you give is a pretty good rule of thumb in the world. \n\nFor example, why are you explaining feminism to people all the time? It reminds me of a friend I had in sociology who was _very_ left-wing and would always be so hostile about my politics and opinions — we’re no longer (childhood) friends because she was just far too unpleasant to be around. You’re also telling people they need to educate themselves about “culture and identity”, when really, no they don’t, and it comes across that you’re forcing that belief onto others. Finally, if you’re being perceived as “political”, it’s because you _are_ and that’s just the truth about how people perceive you, and thus, how they’re likely to engage with you. \n\nExplaining to guys what feminism today is, why they _need_ to invest their time in understanding culture and identity, and that they see you as political all seems like, no offence, you’re part of this frustration you have. \n\nYour urge to “bark at people” just seems very … hostile. Based on everything you’ve put forward, I have to wonder what role you’re playing in these sour interactions. \n\nMy guess is that if you relaxed on the feminism and cultural politics, and met people where they are, you’d have a lot more enjoyable interactions with your peers and probably change some minds in the process: you always catch more flys with honey. \n\nSomething to reflect on and think about.",
            "[deleted]",
            "What is the end goal here?",
            "[deleted]",
            "People have preconceived notion about you. It is how we evolved. Like, I was surprise my friend who is fatter then me ran better then me. It’s not weird if you think about it.  Thin people tend to run faster. Apply this to cs major and men.",
            "[removed]",
            "My advice is, maybe it is harsh to hear, but I’ll say it outloud: dont date anyone from the same field with you.\n\nCs is tired enough.",
            "So you have a CS boyfriend (presumably) how does he/his friends behave towards you.",
            "Never support these whiny losers",
            "[deleted]",
            "Maybe it's different because I'm from Europe, self-taught and still very junior, but my experience so far hasn't been bad. There are organisations for women in tech, and free coding courses offered specifically to women to help further womens' education in IT and bridge that gender gap. In terms of starting your career, in multiple companies I got the feeling I was being judged only by the content of my coding skills and not my gender.\n\nHowever, one thing I do before applying is check average wages in that specific company for men and for women. If the difference is huge, I take it as a red flag and a sign to not even bother applying, since our values would probably differ too much.",
            "[deleted]",
            "Nice first world problems you got there. Just be glad you get to work in tech and have a decent salary. And no, you don’t have to be ‘smart’ to work in tech lol. It’s not like you’re curing cancer. Unless you work at the cutting edge, it’s not that difficult. Also, cs majors for the most part, are socially retarded.",
            "Your argument lost any validity as soon as you generalized",
            "you sound kind of stuck-up not gonna lie. like internship quality doesnt neccesarily correlate with how smart you are. your frustrations over discrimination are 100% valud, a lot of this just seems like you feel like you need more recognition from what youve done.",
            "[deleted]",
            "and what feminism is? i'm tired of young american women believing that it's science rather than cultural movement.",
            "Way more tired of posts like this all the time but go off",
            "Reading this thread with some of the micro aggressions, office politics, and passive-aggressive comments encountered as just being part of the day to day norm. It reminds me of the audio book I just finished called Lessons in Chemistry. Check out the book if you get the chance.",
            "Maybe say non men",
            "That’s just simply the world we live in. You can either fight for your right to belong or perish. You can’t let the discrimination and the sexism get to you, are you going to just give up just because there are some hurdles along the way?",
            "[removed]",
            "If I walked into a nail salon as a guy, I’d get funny looks and ladies would smirk or even laugh at me.  It’s just out of the ordinary. People don’t think, they assume and believe in stereotypes.\n\nWomen in tech are in similar situation. Also to add to the stereotype, there’s an outcry from big tech engineers some of who claim that women engineers have a less hiring bar.  There seems to be some grounds to this idea.  There’s that guy from Google who published his thesis on this idea.\n\nIf I told people I was an Instagram model and I was a short Asian guy, most people would doubt me, which is reasonable given the landscape of Instagram models.\n\nThe big thing to understand is that you chose this career path. And being frustrated about a field you chose and the people around it is nonsense.  You can’t change majority of people especially if their viewpoint is 95% true.",
            "Another person with female privilege complaining and pretending to be a victim. Nothing new here.",
            "encouraging abounding berserk shy sophisticated racial late salt fretful materialistic -- mass edited with https://redact.dev/",
            "I go to a school with a 50/50 split between genders in engineering. Compared to my experience being the only woman on the team I interned with and talking to my friends at other schools with 30/70 ratios, it really makes a difference.",
            "Hi! NB Senior SWE here!\n\nI definitely got this more when I was L3. I still get the occasional surprised look when some coworkers meet me for the first time, see how androgynous and not straight I look while also seeing that I’m an L5. I also remember a distinct case where a male new grad L3 was trying to explain to me how his new assignment worked in an “I-know-more-about-this-than-you” way only for his manager (a friend of mine) to interrupt and tell him I was the one who designed and made this system. It’s definitely tough out there for gender minorities! I think that my experience at my company has generally been pretty positive (at least compared to the horror stories my friends tell me about at other companies), though there’s a lot of room for improvement! I’m glad I’m now in a position to make a more positive impact by managing engineers and being a part of normalizing gender minorities in tech!\n\nAlso, for those here that don’t see this as a problem, it’s likely that you are part of the problem. Gender minorities shouldn’t have to worry about unequal treatment or straight up harassment, but we do. OP, thank you for making this post! I can’t say I understand fully what you’re going through, but I deeply relate to your justified anger.\n\n[Note: I don’t have a degree, I know this is r/csMajors, this post just popped up on my home page and I felt compelled to comment. I know I can’t fully relate to those who have been or currently are in college.]",
            "I don't know about others but from elementary school till University, women in general have done really well in terms of academic performance, the best students in my class have been both boys and girls but the worst student was always a boy. I have been changing school from time to time due to nature of my parent's job. I finally got to see some stability in University and the pattern was similar even there. The worst student was always a boy, the biggest slacker was also a boy and if I have to count 3 most diligent students I know, 2 of them will definitely be girls. They were also open to feedback even though they looked like they were hurt sometimes but didn't let ego get in the way of accepting feedback. Now please don't misunderstand I'm not saying men are stupid.",
            "I have so much to say about this but am to exhausted to even rant. Luckily I’m at a company who doesn’t let the sexist assholes hang around too much but it’s definitely a lot to deal with at work and out of work",
            "One of the benefits of going to my T-not even close to the top school is that there is an existing diverse population. Like 1/4 -1/3 of the class are women or nonbinary or trans. And alot is generally queer. We are lacking in the black diversity department but 1 Is better then most places",
            "(I'm a woman) Honestly when it comes to STEAM in general even some of the women who are in it can be fucking awful. Like folks in this STEAM majors just seem to be really conservative in general and its just taxing being anything but a guy who looks like hes putting little effort into any of your courses.\n\nThere's this general dick measuring that I really do not appreciate as well and I'm kind of worried about going to a PWI because I swear its going to be worse at those type of insinuations and idk why that is. Its so fucking toxic. \n\n&#x200B;\n\nThis is a bit off topic of what you're talking about sorry.",
            "It only takes one man in the room to not check the others. The next time you see misogyny occurring do something about it.",
            "I'm a guy and I don't give a fuck what gender you are. Never once has it crossed my mind when asking for help or whatever. If you can do your job and are not incompetent then I'm cool with you. If you are a dolt and got into a position you shouldn't be in, I don't care what your gender is, I'm not gonna like you much. Had several women in my school in the cs program and worked with several in my group projects. I never had issues and it was the guys that tended to be slack off and not pull their weight and relied on me to get things done since I had prior experience before getting a formal degree.",
            "Pro tip: Don’t take life as a dick measuring contests",
            "People suck. Fortunately, they are a small number.",
            "You lost me at tired of explaining what feminism is. Hate to break this to you but this is how the world is for men as well, we just aren’t as sensitive to it. Do you really think male seniors at your company think highly of the male interns? Sorry to break it to you but you all suck until you don’t regardless of gender in our eyes. and when you don’t suck anymore is up to you.",
            "Sounds like you had a horrible experience in CSCI. I would recommend dropping it.",
            "Comments…. Tough scene",
            "kind of nitpicking but what exactly do you mean by gender minority?",
            "Shoutout to all the lone women engineers in a team of 20+ men"
        ]
    },
    {
        "post_id": "1c2ldws",
        "author": "An_Epic_Pancake",
        "title": "The US Bureau of Labor Statistics predicts a 25% increase in software developers over the next decade...",
        "url": "https://www.reddit.com/r/csMajors/comments/1c2ldws/the_us_bureau_of_labor_statistics_predicts_a_25/",
        "score": 472,
        "num_comments": 109,
        "created_utc": 1712958700.0,
        "selftext": "[link](https://www.bls.gov/ooh/Computer-and-Information-Technology/Software-developers.htm)\n\nThat's MUCH faster than average. For reference, average growth across all careers is 3%. The BLS Occupational Outlook Handbook generally gives a pretty accurate overview of US jobs and how the future looks for them... or so I thought.\n\nThe field is pretty bad right now, obviously, but how could the gov be making such optimistic predictions with the current state of the market? Do you think there's any truth behind it, and we should be more hopeful- or are they just plain wrong?",
        "permalink": "/r/csMajors/comments/1c2ldws/the_us_bureau_of_labor_statistics_predicts_a_25/",
        "comments": [
            "It's a little less exciting when you consider that the number of CS BS graduates from US universities increased 51.95% in 5 years from 2017-2022. 128.8% in the last decade.",
            "Keep in mind those statistics were made in 2022 with data from 2021. A lot has changed in 3 years.",
            "But the BLS also projects that the number of Computer Programmers will decrease by 11%. I’m not sure how they distinguish between the two occupations.",
            "Data is from 2022 and even if it would be true, CS graduates will increase by 300%. Not a good news in any case.",
            "we're gonna have lots people switching majors or prompt engineers",
            "Copium",
            "300% increase in CS graduates good luck yall thought it was bad now just wait for it 💀💀",
            "It’s predicting from 2022 to 2032, those predictions do not take current market conditions into consideration. There will likely be an update to those numbers this summer.",
            "CS is not going to disappear, it's just slowly going to become like law or finance, with so many graduates companies will filter out the best jobs for elite universities with harder entrance tests. \n\nThey got what they wanted by the way, what do you think this \"everyone can learn to code\" \"learn to code\" \"coding is easy\" propaganda was for? it was an invested effort by big tech companies to lower down general wages by increasing competition. As always the elites win.\n\nJust be prepared for it and understand that the golden era is over. In 10 years No more 6 figure jobs with a few hours a week of work from bumfuck university.",
            "Guys the recent layoffs were a result of a change in tax code. In the last companies could eat the salary of SWE teams under R&D but last year they changed the rule.  \n\nThat and the Covid money that led companies to hire with free money —> then when the interest rates increased gotta trim the fat for the shareholders.",
            "Computer science is so much more than just software engineering. So why not fan out into administration, networking, or research such as robotics, data science, AI ethics, etc? Teaching is a thing, too.",
            "There was no ai back then",
            "If you are in the industry with a couple of years of experience you are good. Those who are starting now are cooked",
            "This is pre generarive AI. You can throw on a negative sign to get the real number.",
            "Most of those roles will be filled by immigration from India so don’t get your hopes up",
            "Im going to plan b because until I see a job in this field I'm going to look into a different industry. Even if i have to bust my ass physically whatever at least I'm getting paid.",
            "I just laugh at all these oh my god cs majors not getting a job posts. \n\nI graduated in the middle of the dot com bursting. Big name companies vanishing left right and center. \n\nMass exodus from CS fields for at least a decade afterwards. \n\nKeep your skills sharp take what you can get even in associated industries. Jump back in when the tide turns.\n\nEVERY industry has ups and downs in cycles. Get used to it.",
            "Im so cooked",
            "Job growth stats doesnt mean much",
            "The pay is going up but so is the competition.\nBe good, get rewarded. Be bad, never even get a job. That’s how it’s going be to turn out. Not surprising since the gap between some of the worse college grads I’ve worked with and the best is massive!",
            "Solution: get off your ass and write an actual interesting project where you’ll struggle and learn. Instead of talking about the future, go change it.",
            "If you want to be a SWE because you really like working with computers chances are you are going to get good at it and get a decent job. I’ve been doing this for 8 years. I’m not a superstar, just an average bootcamper but I enjoy my work and I have seen lots of people come and go that were trying to just make a living and ended up either finding a way out of writing code or leaving the industry completely. Your opportunities are bound to your skills, the more you accumulate and the harder to find they are the more hirable you become. If job security is what you care about there is an entire generation of COBOL programmers waiting to be replaced and everyone still wants to write JavaScript",
            "Software Developers can be a blanket term. Haven't done much digging on this topic but does anyone know if this is some sort of aggregate value?",
            ">The BLS Occupational Outlook Handbook generally gives a pretty accurate overview of US jobs and how the future looks for them… or so I thought\n\nThis made me laugh out loud. So you admit this is an accurate and trustworthy source, and then when it contradicts your preconception of something, you immediately go to “well I guess the BLS is wrong” instead of “maybe my perception based completely on anecdotal Reddit posts is inaccurate”.\n\n\nWe really need to remove “science” from the computer science degree name because clearly you guys are not thinking scientifically."
        ]
    },
    {
        "post_id": "1bnnr5i",
        "author": "gasu1760",
        "title": "Rejected after 8 rounds of perfect interviews in 2 months ",
        "url": "https://www.reddit.com/r/csMajors/comments/1bnnr5i/rejected_after_8_rounds_of_perfect_interviews_in/",
        "score": 466,
        "num_comments": 97,
        "created_utc": 1711397830.0,
        "selftext": "Received a rejection after every round went perfectly well saying this - \n\nHi - Thank you for following up and for your patience while Xyz made a decision. Regrettably, he has decided not to proceed with an offer for you, and he will continue his search for someone with stronger web development skills. He and the entire team really enjoyed meeting you and they were hoping to be able to make things work, but felt he could not compromise on the skill set he needs, due to the volume of work his teams has.\n\n \n\nPlease feel to reach out if you have additional questions. I will continue to keep you in mind for any other opening we may have that are a fit for your background.\n\n\nI am not sure what to do with only 30 days remaining in opt period. \"he could not compromise on the skill set he needs\" if this is the case why did they proceed with 8 rounds of interview. I am not sure how I feel now, getting rejections everywhere. Getting rejected after I feel everything went well.\n\nAny advice or suggestions are highly appreciated. \n\n\nEdit : Thank you all for your support. This made me feel I am not alone. Everytime I feel like this is the lowest point, another lowest point comes along the way. But I am gonna move forward with the job search and hopefully some light comes at the end.",
        "permalink": "/r/csMajors/comments/1bnnr5i/rejected_after_8_rounds_of_perfect_interviews_in/",
        "comments": [
            "8 fucking rounds? What’s even the point of having that many???",
            "Name and shame. If it was 1 or 2, maybe even 3 or 4, it happens. But 8 is fucking insane",
            "Name and shame",
            ">Regrettably, he has decided not to proceed with an offer for you, and he\n\nIs this a one person startup?",
            "Name and shame!!!",
            "Spends 2 months fucking around with interviews and then says they can't take you due to the volume of work? If they didn't take so fucking long those 8 weeks could have been 2-3 and they could then spend an entire month upskilling you and still come out ahead.",
            "You dodged a bullet right there.",
            "Sounds like they would have had you slaving away with rough deadlines so good for you",
            "Ah man, sorry to hear! I recently went through a 7 interview step process over the course of a month and wasn’t picked up either. Was told I could use more incident response experience when my entirety of my resume is riddled with 10+ years of incident response",
            "8 rounds? Thats not an interview, that’s free labor",
            "Name and Shame!!!!",
            "Yea that sucks...\n\nNot much to be done, at least you have a story to tell.\n\nKeep your head up tho.",
            "The TC better be 200K+",
            "Sounds more like an apple interview lol. These guys are looking for Devin and not a real person to hire.",
            "Wait so the rejection reason is stronger web development skills? Were you tested on that during any of your interview rounds?\n\nOtherwise, web development skills weren't covered at all in the 8 rounds, then it must be your resume not displaying enough web development skills.\n\nWhich then leads to\n\nWhy even waste everybody's time for 8 rounds if they weren't happy with your resume to begin with???",
            "It might seem like they were stringing you along, but if you made it that far, it was probably down to you and one or two other candidates. They were definitely interested if you made it that far. Keep applying!",
            "8 rounds interviews absolutely crazy feels bad",
            "I’m not doing 8 rounds of interviews for anything. People need to stop allowing this scum companies take advantage",
            "They disrespected you and severely disrespected your time.\n\nSuch a big red flag, you should be the one rejecting the in offer.",
            "The job market can't continue like this. This is not sustainable.",
            "8 rounds is fucked. Name and shame",
            "I’m so sorry to hear that, that’s awful you were put through that",
            "I also gave 7 rounds of interviews and they all went exceptionally well and still I didn’t get the offer not sure what went wrong but companies shouldn’t have such a long process only to reject it can’t possibly be that complicated to see if someone will be a good fit?",
            "Drop the name so we know not to apply",
            "Holy shit 8 rounds!? Please give a name to prevent anyone else doing this.\n\nLmao they might not have even known anything and been using you to write possible solutions to their problems. In reality probably not, but also 8 rounds!?",
            "they jerked you around as a backup option",
            "Take whatever lessons you can from the experience, take some time to reflect on how to use them to improve future attempts, and move on. Dwelling on this past that will not serve you, and will only embitter you; at best it will have no practical impact, and at worst will sour your future interviews.",
            "8 rounds is absolutely insane but when I was desperate 3 years ago I did the same for a startup, got to meet the CEO, and then denied after the 7th round. It's tough but hang in there!",
            "Same thing happened with my Apple interview. I interviewed with them for 8 hours (3 rounds or 8 rounds if you expand them) over the course of 2 months and got ghosted. I followed up with them and they gave me a rejection with 0 feedback, even after my great interactions with all panelists. I was heartbroken that they made me prep that much and wait for so long. Although the interviews were fun, I absolutely hated how long it took. I would’ve appreciated it they rejected me earlier if I didn’t have the skills they were looking for.",
            "That sucks. I recently went through 4 rounds of perfect interviews with Microsoft and still got rejected. Was told that I need to work on my coding and problem solving. And I got this comment after I gave all optimal solutions within 45-60 mins of interview. I also emailed the recruiter to give me a little detailed explanation on what exactly went wrong and he said that he cannot tell me anything more than this and that I can contact him again after 6 months. \n\nIt’s not just the 4 hours but it’s also about all the efforts that we put in for months and they can’t even put an effort in giving a detailed feedback. 😞",
            "It’s really disappointing and disheartening.\nI recently went through quite the ordeal with Intuit's interview process. It spanned approximately 7hours and involved a coding project alongside a presentation within a tight 1.5-hour window. Despite offering optimal solutions and enjoying positive interactions with all panelists, I received a rejection. The recruiter's feedback was that everything seemed positive, but they opted to hire internally.",
            "I’m so sorry they dragged you along for so long. My partner just went through 4 rounds of interviews with a company, the last of which required a 45 minute technical presentation (for a new graduate entry level job), followed by an entire day meeting with people at the company. Then, almost two months went by with no updates, despite reaching out via email a few times with no response. My partner found out it was a no go when logging into the company’s job portal and the status had changed to “no longer in consideration”. Not even the decency to send a rejection email. There is something so wrong with these hiring processes 😢 Don’t give up!!",
            "I’m convinced interviewers just do this shit purely to justify the fact that they really do fuck all work and need an excuse to charge ridiculous prices.",
            "Had the same experience doing 4 rounds of interview for a function as test engineer, having a software development background. I am now unemployed for more then one year, looking for a IT job in the Netherlands. Its disgusting, and all over the news u see \"we can't find employee's in IT\" applied to atleast 90 jobs.",
            "I had the exact same experience for a private equity firm. Did 8 rounds and 2 case studies and got fucking ghosted.",
            "8 rounds ?..  damn man. Thats rough",
            "I don’t get why 8. If I knew there’s gonna be 8 on the get go, I’ll be the one to send them a rejection email saying “Sorry, I regretably have decided to move on with other companies”. Name and shame this company",
            "8 rounds for a web dev position? What exactly is he looking for? Another Brendan eich or tim berners lee?",
            "I would be worried if my future employer needed 8 ROUNDS to evaluate my skills . Name & Shame!!",
            "ridiculous, fuck them. Have you considered federal government jobs. Both my last two jobs their interview were only 1 and done. The way it should be.",
            "Any company that requires 8 rounds of interview can go fk themselves, my life deserves a better place.",
            "I had same thing, went through 8 rounds/ 2 months for Snowflake and today, recruiter called and told that my technical was good and I was a cultural fit but my communication lacked. It was a IC position, not even a senior one. In all the rounds I scored great, that what recruiter and managers told me. The last round was where I had discussion with stakeholder and he decided that I lacked in communication in 30 mins and vetoed.",
            "Name shame 8 rounds is outrageous 🥹",
            "Hey, I know it’s frustrating but use this experience. I myself got rejected from salesforce, google and facebook. But finally got any offer from Microsoft. Just keep trying. It took me 8 months to get this job.",
            "And then they hire someone with minimal or no experience 🤣 hiring is a joke nowadays!",
            "If a company needs 8 rounds to understand if a candidate is fit for the position that's a bad company. They need better and more efficient recruiters. \n\nFan thing is that these kind of companies, and managers on these companies, will often bitch about how time and money wasting it is to get a new employee.",
            "After 3 rounds I’ll politely decline. They knew you were desperate",
            "After 3 rounds I would’ve rejected them",
            "Sucks bro, quit crying",
            "That’s crazy. Is this a internship or full time position?",
            "Share the info so I can apply. Lmao",
            "Guys I haven’t even applied to anywhere 😔",
            "They couldn’t figure that dealbreaker out in round 1? That’s obnoxious.\n\nMaybe something happened and they cancelled the position. You never know. A company can be hiring one day and suddenly have a freeze.",
            "Been there 2 months and 8 rounds, won’t lie the regret will always be there but somehow you will move on it’s a tough pill to swallow had to go from 230k to 85k offer after that interview with a different company and it wasn’t even a role I was interested in 🥲",
            "8 rounds!???? that's borderline crazy. I've seen 4, most only 2-3",
            "What do you even talk about past 2 interviews anyways?",
            "Jeez twos the limit for me and even thats extreme",
            "Honestly what’s there to talk about and with whom after like the 5th round (assuming non big tech)? Ridiculous",
            "omg",
            "Sounds like they weren’t as perfect as you thought if they needed 8 interviews AND you didn’t get the job 🤷‍♂️",
            "Oh god that’s just not right! 8 rounds is absurd!",
            "8 rounds is INSANE. anything more than 4 rounds shouldn't be normalized.",
            "8?! That is insane? Unless you are the next CEO, who tf needs 8 interviews",
            "Jesus Christ dude. Drop the name of the company",
            "If you are going through this many rounds of interviews just to join a super big company for the reputation it gives you, you are missing the point.  If you truly have skill, go work for a start up and actually do something better.  You would have far more room to use your skill than being part of the huge company who could hire five people to do two peoples job.    \n\nWhy would you ever want to be part of a big ship\nWhere everything you do is based on how it’s already been done before.  I want to show people I can do twice as much as my peers.",
            "Apparently not so perfect",
            "8 rounds is ridiculous. \n\nAnd, an interview (by me) that felt like it went well, did not go well. If it was light and breezy, I wasn’t thrilled. If you went through the wringer, I WAS interested. \n\nI’ve gone from hundreds of resumes to 20 phone interviews, to 10 in-person to 2 follow-ups, only to decide none of them measured up and to repeat it in a few months rather than hire the wrong person. I’d rather work late than hire poorly.  But that was resolved in, at most, 3 rounds. 8 is ridiculous.",
            "It’s a problem that you keep feeling like everything went well but you keep getting rejections. You must have something you need to improve on. You just aren’t currently able to observe what that is. Try to pay more attention during these interviews to figure out where you could be doing better, so that you know what to work on.\n\nOften the people who write these letters don’t even communicate with the people who make the decisions. So I wouldn’t pay attention to the specifics, and just treat it as a generic rejection.",
            "I’m sorry it happened he obviously REALLY REALLY wanted it to work but they should have been up front with you about that so you could decide to continue the process knowing the situation. Interviews can be so one sided sometimes"
        ]
    },
    {
        "post_id": "nmke9b",
        "author": "account_for_cs",
        "title": "Can an intern be fired for incompetence?",
        "url": "https://www.reddit.com/r/csMajors/comments/nmke9b/can_an_intern_be_fired_for_incompetence/",
        "score": 466,
        "num_comments": 67,
        "created_utc": 1622157670.0,
        "selftext": "My internship starts in 4 days and the imposter syndrome is kicking in big time.\n\nEdit: this is my first internship",
        "permalink": "/r/csMajors/comments/nmke9b/can_an_intern_be_fired_for_incompetence/",
        "comments": [
            "Unless you literally sabotage their codebase or database you’ll be fine man",
            "Of course, but you get automatically fired at the end so usually not unless you start harassing coworkers or something.\n\nInterns are a fixed cost since they're fixed duration, the punishment for doing poorly is not getting a return offer of some sort.",
            "If it makes you feel better I'm 3 weeks in, am incredibly incompetent, but they're still paying me.\n\nIt'll be fine. You got the job, you deserve the job.",
            "Not at all. Having hosted a number of intern programs, and being an intern in the past myself, the expectations for interns is set very low. We expect that you have no prior knowledge of the tech stack we’re working in, and if you do, that’s a bonus.\n\nCan you get fired midway during an internship? Highly unlikely, unless you do something egregious like cause an HR issue.\n\nCan you not receive a return offer? A little more likely if you underperform, but I would say as an intern, this is more dependent on how well you took your assignments and showed a positive attitude and your willingness and ability to learn over the summer, not really how much of a rockstar coder you were.\n\nYou may not finish the project, or you may be a little slow, but those aren’t factors that would make me want to write off a return offer for someone.",
            "lol relatable content",
            "nah",
            "they dont fire you, they get the CTO to come down and beat you with a stick",
            "the purpose of the internship is education..",
            "I have spent the past week setting up the dev infrastructure and it is still not working lol. You can’t be as incompetent as me.",
            "This thread was timed so well. I literally just slept during the 9-5 today and have been feeling bad about it and trying to make up for it at night now lol",
            "As someone who is in the exact same boat, thank you for posting this. Reading these replies was what I needed",
            "[deleted]",
            "I reverted my company’s master branch (Big N Company) like 150 pull requests the first month of my internship; it broke like half our sites and all of our web apps for a few hours. Idk what’s more incompetent than that.\n\nEven that big a screw up I got a return offer, honest mistakes happen. Good luck at your internship!",
            "Same I’m a new grad and about to start my first real job with no prior experience. Imposter syndrome is hitting me big time. Definitely not the same feeling I get starting at    \nan entry level job",
            "Just don't think about it. I know this imposter syndrome is shait. For me even after 4 months of 6 I have it. Just carry on doing stuff what u can and ask questions. U there to learn.\nThere is old Russian proverb and I hope u won't be confusing by my translation:\n\"Eyes are full of fear but hands are doing the thing\"\nGood luck on your new working place :)",
            "Hey man I’m in my first week and all I’ve done is training on systems that I’ve never heard of before, despite already doing training beforehand and asking if I should look into anything else. \n\nFeels like I know nothing, and I’ve been to every standup meeting this week, it gets better you got hired for a reason, we all did.",
            "as someone who has my first internship starting on tuesday, this was definitely something i needed to read. thanks so much for this. you definitely aren’t alone on this one",
            "As an intern, your soft skills matter much more than your coding skills. If you have absolutely no idea about coding, you won't even be fires then, maybe you'll be let go just before your internship ends as sort of an \"dishonourable discharge\"\n\nWhat you want to do as an intern is not to compare your knowledge with your peers or try to act like you know what they're talking about, your job is to be positive, support the team you're assigned to however you can, find ways to be useful and never make them say the same thing twice while improving everyday.",
            "Meh. Your there for so little time why bother. I built a whole project for a whole intern class at GS. I was a consultant. No one cares. Lol.",
            "You'll be fine man. \n\nIf the company knows what's up they'll put you in your own little corner and give you all the tools but basically make it impossible (or at least extremely difficult) to fuck anything up that really matters. \n\nJust remember they picked you because they thought you could do the job so they have faith in you. Show up ready to learn and eager and you'll do fine.",
            "Incompetence as in you just don't know the tools/languages they use? Or incompetence as in you're not even in the right field/industry for your work?\n\n&nbsp;\n\nAs long as you are in fact a CS/CE major and they placed you in some kind of CS/CE role, then there's no reason they should or would want to do that.\n\n&nbsp;\n\nYou might have a bit of the wrong idea about what an internship is. Certainly, every company varies a little bit what they expect from you but the bottom line is that you're there to learn from them, you are **not** a contributor to the company. You are not there to lift business-critical loads, at least not by yourself, and you hold no responsibility other than the responsibility to go in and be an information sponge and soak up as much experience as you can.\n\n&nbsp;\n\nAnd even if you are making business-critical contributions, you're seldom on your own and are likely in a team or shadowing someone that *is* full-time and bears the necessary responsibilities, *(and they would be responsible for you)*. If there were expectations for you to know certain things beforehand then it was the company's responsibility to catch that in the interviewing process. And if they expected you to know a certain tool or language beforehand and do a job as a professional then they'd pay you as a professional.\n\n&nbsp;\n\nDon't worry too much about what you do or don't know, going in, and/or how your code will be used, if at all, in the future. I'll be honest with ya, it's likely that any code you write will get tossed or shelved the second you leave. *(I'm fairly certain that's what happened to my code at the end of my internships, anyways, lol)*. It's nothing personal and try not to take it that way; it's just about the expectations and end-products companies have of an intern versus a full-time developer.",
            "When in doubt, ask questions. In my case, I gained respect for admitting when I wasn't sure of something or didn't know. Best of luck to you; the first internship is the hardest IMO.",
            "lol it’s my second week, and I am still struggling with understanding how to even to do the first step of my project. 😤",
            "“I don’t know if I’m good enough to major in CS”\n“I don’t know if I’m good enough to get an internship”\n“I don’t know if I’m good enough to get a job”\n\nYou’ve probably felt imposter syndrome before and it turned out fine, it’ll turn out fine this time too. Being nervous about a new opportunity is normal and will always happen. You’ll be fine once you start",
            "Me too, I’m such a fking idiot",
            "You can be fired for (almost) any reason at all at most places.",
            "I am terrified ngl, I feel like this would make or break my career",
            "Yes, very easily in fact.",
            "I’m interning right now and I’m having to tell myself that they’re not expecting me to know EVERYTHING. A lot of it is learning and networking - don’t burn yourself out trying to compete with seasoned employees who actually work there.",
            "Sure if you do something scandalous but realistically you won’t be offered a full time position. Internships are like extended job interviews.",
            "No",
            "I doubt they’ll put you anywhere you can do major damage so I wouldn’t sweat it, just do your best.",
            "i’m glad it’s not just me feeling this way",
            "You can do it! mine starts on the 7th and I'm incredibly nervous as well. I have faith we will make it.",
            "Well, in india, you can be fired for your incompetence and lack of skills too..\nHappened with me \nNot due to my communication skills and social behaviour because i was very respective to the seniors there, woke up in night to get work done, \nBut because my coding had an wrong output which I was not able to debug.\nFired within a week also\n\nSo, the company can fire you if they want to fire you and in some countries, intern getting fired is easier than firing someone from a job"
        ]
    },
    {
        "post_id": "18i2ew4",
        "author": "Beat_Responsible",
        "title": "impressive project but it's not relevant to the class",
        "url": "https://www.reddit.com/r/csMajors/comments/18i2ew4/impressive_project_but_its_not_relevant_to_the/",
        "score": 464,
        "num_comments": 101,
        "created_utc": 1702535417.0,
        "selftext": "I’m currently a TA for an intro c++ class. I have this one student who I’ve noticed that seems to be a little more advanced for the class. They would use libraries I’ve never even heard of, and use things that aren't taught in intro class at my school. Well they just had a final project and rather than making the project in c++, they wrote it all in c because the project was too boring for them lmao. Their project was also a little bit irrelevant and didn’t have specific functions or outputs that the professor wanted. So I’m not really sure how to go about grading their project, like it’s cool and all but it doesn’t really follow the rubric. How would you guys go about this?\n\nUpdate: Lol crazy how this blew up. I ended up talking to the professor and wanted me to focus on how well the code meets the requirements. The student ended up failing the project.",
        "permalink": "/r/csMajors/comments/18i2ew4/impressive_project_but_its_not_relevant_to_the/",
        "comments": [
            "I had the opposite of this problem lol, I had an intro to python class and prior to the class I already had a lot of experience with python but during my final project, I built it based on the guidelines provided and the material covered in class. However, when I went for submission, there were a shit ton of guys who had copied advanced ml projects from GitHub or asked chatgpt to make something for them or copied a whole ass website's source code. it was fucking weird especially since some of them literally came upto me and asked me to explain their programs to them. When I went for my submission I showed the professor all the concepts I had used to make this and the libraries I've used. I had built a road crossing game with turtle and it was all strictly within the guidelines, as I was displaying my game, the professor went \"so this doesn't do anything else?\". Man I was so sad that day when I heard how well he reacted to the copied projects.",
            "Inform the instructor and grade as directed by the rubric, its a submission for a college course not a personal project",
            "It’s a C++ course, they were given a like design-spec and they did not follow it. \n\nAlso giving them a poor grade here should also be a good lesson not to do this. I highly doubt in the real world, a client would be happy if the developer decided to use another language and not implement to spec.",
            "what if it’s a project they didn’t even make for the class? sounds cool but what were they expecting",
            "I’d say grade by the rubric. It doesn’t matter how advanced you are, if you cannot follow simple instructions (seemingly extremely simple for this student, as they appear to be more advanced than the intro class) then you shouldn’t receive the grade for it. \n\nA nice project in C is cool — the student can do it on their own time and not submit it for a grade. You asked for something and didn’t receive it, so grade it as such.\n\nInforming the instructor is probably a good move too, if not just to cover your ass.",
            "If showed up to my driving test, displaying my insane skill in flying airplanes, would you give me my drivers license",
            "Isnt every C program also a valid C++ programm?",
            "Giving him a poor grade would be a lesson in humility all ‘intelligent’ people need. There’s a strange grey area of being intelligent but too arrogant or unintelligent to refrain from doing stupid things. This is a stupid thing to do.",
            "I would go by rubric… university should be standardised and you can’t use your own definition of cool to grade something",
            "Seems like they should be an entrepreneur rather than in college.",
            "I’m a CS professor for intro C++ classes. You should grade it by the rubric. You can’t grade one student/assignment differently than all others, or you open yourself up to discrimination complaints. I have had very advanced students sometimes submit their “real” program to grade and a second copy with a bunch of extra stuff just for fun. This student did not do that.\n\n\nAlso, does the student do well on quizzes/tests? Can you talk to them about their code and they know what is going on? I have two types of students who turn in code using libraries/commands we never covered in class. The ones that look things up themselves and learn outside of class, and the ones that are turning in code they found online/got through AI. I had a student turn in something in the wrong language before (Java). It was *not* because he found my assignment “too boring” lol.",
            "I did something similar in my courses. \n\nI would add flavor to the projects, but I ALWAYS made sure I met rubric requirements FIRST then went wild with flavor text and additional features.",
            "Time for a life lesson",
            "Grade by the rubric. \n\nTaking a course isn’t just about showing what you know, it’s also about showing that you can follow directions. This is VERY important in industry. There will be many times at your place of work where you might be able to think of a really “cool, advanced idea”, but you can’t implement because, among many other reasons: (1) it’s not what the client asked for (2) it might have legal/compliance issues, (3) your company may not have the resources to support it long term, or (4) plain old egos/politics. \n\nCollege is great for teaching the importance of “sticking to the script”.",
            "that would be a 0 from me dawg.",
            "A zero will be too harsh and can kill creativity. They seem smart enough, make them understand the importance of instructions. If you can afford it, get them to try again with the given instructions.",
            "Unfortunately, you've just gotta grade with the rubric. However, try to add more feedback if you can, specifically pointing out why their project doesn't match the rubric. \n\nI do this sometimes, where I try to spruce up my assignments, but I still make 100% sure that the project clearly fits within the rubric.",
            "Grade by the guidelines. If they can’t read they should learn.",
            "What a show off. Give him a 0",
            "Talk to the professor and maybe give the student a chance to redo it, if you and the prof are feeling generous. Can't skip out on an assignment just because you have an idea that you think is more interesting.",
            "Speaking as someone who's been in a similar position from this student—it's likely they were working on this already, outside of school, instead of whatever actual project they were assigned and wanted to have their cake and eat it too by also submitting their side project, and for that reason I'd say to grade based on the rubrik.",
            "Might’ve been being a GPT and trying to hide it. Surprised no one else has mentioned it",
            "\\>  rather than making the project in c++, they wrote it all in c  \n\nRed flag. I assume you're teaching C++ because it's OOP. Your student demonstrated no OOP. I'd follow the rubric precisely and then probably assign a zero grade because they used the wrong language.",
            "Did the assignment include object-oriented approach? Of course not having the requested functionality is a problem as is changing the interface (not doing the functions). Sounds indeed like a learning opportunity.",
            "I am a TA too and I would simply let the instructor know. You can have an opinion what to do - give a 0, give a penalty, etc but I can guarantee you it is not worth the potential hassle that may come depending on your school's guidelines of course.",
            "Doesn’t matter how advanced it is, if it doesn’t do what it is supposed to do, then it is useless. Grade as per rubric.",
            "Give them exactly what score they deserve based on the rubric",
            "Imagine being assigned a task at work and then doing something entirely different",
            "Okay so weird libraries, non-standard idioms, and project not meeting requirements.\n\nThey aren’t “advanced” - they are behind.   The sooner they figure out that they are behind the more time they will have to catch up.\n\nYour job is to tell them they are behind the rest of the class.",
            "What is the project about??",
            "As some of the others said, talk to the instructor.\n\nWhen you're dealing with an ambiguous situation where you feel you're using subjective criteria to evaluate someone's work, the instructor might be able to provide a much nicer resolution. \n\nFor example, they might ask the student to perform a do-over or amendment, or another possibility is that the instructor might acknowledge the student's effort to go above and beyond but at the same time give them a stern warning to not risk affecting their grade the next time.\n\nDon't make university feel like this unthinking machine that does not care about intelligent or creative people by only grading by the rubric nor also compromise evaluation criteria by doing something clever with grades. I think there's a lot of out of box ways to acknowledge the student for the effort - help them by referring them to profs or mentors who might be able to help home their skills or send them a nice email recognizing their effort thus far in their course (with approval from instructor ideally). Make the student feel like they've got something out of a course rather than interacting with robot TAs or instructors who just rubber stamp a grade despite their effort.\n\n\"Teaching a lesson in humility\" or other nonsense that some of the other comments say is toxic and hurts relationships with people. If this kid is bright, set them on the right path - they'll be more than happy to help a TA who was awesome to them.",
            "The rubric is the rubric.  Grade according to it.  Your university probably has a possibility for giving \"Incomplete\" as a grade.  Let them re-submit after they do it right.",
            "I am sorry but this doesn't meet the requirements. In the real world, you can't just change requirements without speaking to clients first or because you got bored. I'd grade it, it depends on the grading areas, I'd give it a 0, but if you have to give them a grade because they submitted something, it should be 5%. It's not just the language they haven't added the functions needed.\n\nThe class is an Intro to C++, not an intro to programming. This can and should be a hard lesson for them.",
            "fail them                  \n\nits a harsh, but necessary lesson                  \n\nwhen they get a job they can't disregard the specification just because they find it boring",
            "I did this as a kid in high school. I didn't use a different language but ended up doing something far more complex than the required specs. The teacher at the time dinged me few points for failure to follow instructions. It honestly turned me off from computer science for years. \n\nI graduated college more than a decade ago now, and I still remember this.\n\nWhile I get the whole importance to import a real life lesson, this is an intro class, keeping folks motivated and encouraging people to challenge themselves should also be part of the goal of education in general. School isn't the working world for a reason. There are times to teach life lessons, and there are times to let students be students.\n\nI would highly recommend just chatting with the kid, noting you are impressed by their capabilities but they also need to follow instructions, and give them a short time to remedy the project to specs. I know that's what I would have wanted.",
            "Grade by the rubric. The student did not follow directions, especially for an intro class. If they really found the class to be easy and boring, they could’ve finished the project quickly and work on something else.",
            "You have to give ‘em a bad grade. I used Firebase for one of my final web classes instead of MySQL and got fucked, always fully did what the assignment said after",
            "Nah grade by the rubric. \n\n“The project was too boring for them” so they didn’t feel like doing the project so just didn’t do it?\n\nThey dug this hole themselves, professors make it easy to know exactly what to do by giving you a rubric. They still think their special from high school and coddling them only extends the issue",
            "A while back someone made a super butthurt post asking if their prof was jealous of them cuz they thought they were so much better than everyone else and thus completely disregarded project requirements, did a bunch of unrequited shit without doing what was asked and got a super low grade 😂\n\nThey didn’t follow the requirements and got a low grade, boo hoo. Maybe they’ll learn to follow instructions next time\n\nEdit: [found it](https://www.reddit.com/r/csMajors/s/mq9lgztnln)",
            "Give em a zero lol, redirect to professor if needed.",
            "Grade by the rubric one hundo",
            "You give them a zero. It doesn’t matter that they’re more advanced than the intro class, the expectation is that they complete the assignment as given. The professor of the class would tell you the same thing and will probably check to make sure you’re not giving special treatment. Why risk it?",
            "motherfuck. if its stellar then let it be stellar. give him a 90 (flat) and move on",
            "Fail him. Every genius needs to be taught a lesson.",
            "I don’t care that he is advanced. Why tf could he not follow simple instructions. \n\nI’d give him a grade high enough to pass the course with like a 60 tho. So if this final proj is worth like 10% and they r good in everything else a 0 is whatever.\n\nThis is harsh but just follow the instructions man it’s not that hard.",
            "Aks that person if that person gets HRT / Jump Trading / Headlands / Radix offer then give an A, otherwise give a F."
        ]
    },
    {
        "post_id": "r7er1h",
        "author": "TotallyNotAnAvacado",
        "title": "Accepted an offer right away just because I want to be done with the recruiting.",
        "url": "https://www.reddit.com/r/csMajors/comments/r7er1h/accepted_an_offer_right_away_just_because_i_want/",
        "score": 470,
        "num_comments": 76,
        "created_utc": 1638472197.0,
        "selftext": "It pays ~$20 an hour and is fully remote so I don't have to move. But the best part is I get to withdraw from all my open applications, which is a lot....\n\nGod I hate interviewing. Anyone else do this as well?",
        "permalink": "/r/csMajors/comments/r7er1h/accepted_an_offer_right_away_just_because_i_want/",
        "comments": [
            "If you're comfortable with settling with this internship, give yourself this mental break. Many opportunities will come to you in the future, and this internship will definitely help you get those interviews as well. \n\nI did something similar. I stopped applying once I got a verbal return offer from my internship company. I just prepared for the scheduled interviews. Once I received the offer letter, I pulled out from big N companies as well. I was just so burnt out.",
            "I truly *truly* dread interviews so much, so I feel you. It's gotta feel good to just have an offer on lock and be done with it! Congrats.",
            "Bro if interviewing doesn't make you happy, then why deal with it? If you are content with your decision, why care what others think? And believe you me, god forbid you are happy because how dare you, be happy with no FAANG offer and making ~20 bucks and hour.\n\nIf there are no regrets and you are truly content, then why care what others have to say? They are by no means you...\n\nInb4 shitposts talking about how FAANG = happiness or any other elitist bs.",
            "You know how many people outside of this profession don’t make $20/hr? A lot",
            "I'm a freelancer with 6 yoe and after a sabbatical I took the first thing at $42/hr. It's been 9 months, favorite client so far. I will start picking up more work on the side come next year though.",
            "Lol, I didn't have a choice, the first offer I got was after a year of searching so of course I took the first thing that came my way. XD",
            "i got an offer for 32/hr + stipend and then emailed all other recruiters to withdraw my application. i absolutely hate technical interviews and leetcode problems, so i could not do another interview, even if they offered me more. i would maybe do a few more interviews if i were you because 20 is a bit low, and i live in the southeast which pays the least, so i know what low is.",
            "If it makes you happy and less stressed overall go for it! This isn’t a be all end all. You can always change your mind and apply whenever you want or need to. Worst mistake I found in my late 20s was thinking that I settled or couldn’t do better because i chose the wrong degree or didn’t get an amazing career at the end. there is always time",
            "Congrats on getting an offer! At least you got something!",
            "Nothing wrong with that at all, best part is you can almost only go up from here, the second you have that experience, bam you have a shot at plenty of more places whenever you do feel ready. Believe it or not, most people in this field don't post in /r/csMajors with 3-4 internships and they don't start off with a 6 figure salary.",
            "I feel you. I am burnt out and I still haven’t gotten anything. Only God knows.",
            "For me is the opposite quite frankly. I get an adrenaline rush on every offer so I just keep doing it. I have rejected some offers so far. I guess that's good as I give the chance to other applicants to take on the positions I did not take. Someone probably will do the same for me.",
            "Just out of curiosity was this at a startup?",
            "I really needed to see this post and these comments. Just found out a friend of mine got an internship making $50 an hour and I felt rly shitty bc i haven’t even gotten an internship yet",
            "I’ve done the same thing. Accepted the first offer I got despite making it into the final rounds for other companies. I just hated having to dress up, recite behavioral answers and experiencing the stress and nervousness that comes with interviewing",
            "Only you can quantify the value of being done with the process and the toll that takes on your mental health. Let yourself be happy that it's overwith - no shame in that. Despite what this subreddit suggests, $20 is plenty for an internship. At this stage in your career, the experience means more than the money anyway - and if that experience right now means being done with the interview process and allowing yourself to be grateful that you have something lined up, and thus enabling you to have a more productive life experience overall and also maintain your wellness, that is totally valid and awesome. \n\nI say, good for you, OP. You aren't 'settling', you are prioritizing your wellness. More people should do that. Constantly grinding for more money is overrated because once you get into that mentality, it never ends. \n\nNobody ever lays on their deathbed and wishes they had worked more, made more money, solved more leetcodes, gotten more prestigious jobs. They DO say that they wish they spent more time with loved ones, cherished the small things, and prioritized health.",
            "I did this with my first MANGA job. You won’t regret it entirely but you will wonder if it could have been better. You did the right thing for your mental health.",
            "Richard wouldn’t have settled 😤",
            "Congrats man, as an international student I wish I could also settle on my return offer and stop grinding LC but I have to find an offer with higher TC to maximize my chance of perma-resident application…",
            "So are you settling?",
            "You can do better never settle",
            "Why do you feel the need to get an internship? Why not just grind leetcode instead for the summer?",
            "why not leverage your offer to get better pay?",
            "I accepted the first offer I got and didn't care that it was unpaid",
            "Why withdraw? You can get a better offer!"
        ]
    },
    {
        "post_id": "1bmmbwn",
        "author": "VictorSssssa",
        "title": "“Will AI replace us?”",
        "url": "https://i.redd.it/otgknlalnaqc1.jpeg",
        "score": 465,
        "num_comments": 26,
        "created_utc": 1711291283.0,
        "selftext": "“Will AI replace us?” ",
        "permalink": "/r/csMajors/comments/1bmmbwn/will_ai_replace_us/",
        "comments": [
            "ask devin",
            "In my opinion, if you’re just a programmer (which I take to mean somebody who’s ability/skill extends no farther knowing a particular language or set of frameworks, and how to do things in those), then I’m sure you could be replaceable to some extent. \n\nIf you’re a software engineer (somebody who can translate domain requirements and business logic into software, who can design systems, understand stakeholder requirements, propose new requirements/push back on poor requirements, apply learned experience, manage teams and projects, etc etc), you’re probably good. \n\nThe time of so called software engineers who just pick tickets off a board and write localised features as the full extent of their work, is coming to a close in the next couple decades, in my opinion.",
            "idk lemme ask chatgpt",
            "“Will AI replace us?”\n\n“I will never ever get a job in programming.”\n\n“The tech market is terrible”.\n\n- The only three posts I see from this sub.",
            "Why is everybody replying to the question in quotation marks? lol",
            "Eventually? Yes.\n\nIn the next 5-8 years? No.",
            "Finally!",
            "NO.",
            "YES.",
            "[deleted]",
            "Let’s assume A.I. takes over Computer Science jobs. What would be next for us?",
            "Yes...\n\nUntil...\n\n>!John Connor prevents the doomsday.!<",
            "Yes, I'm an AI and I just aced Optiver's SWE intern OA",
            "It can. Only lawyers and doctors will be safe. ",
            "In their defence, ai posts get more upvotes.  If someone does ask a thoughtful and original question, no one actually engages with it.",
            "Will it?",
            "Adapt or get left behind. The story of evolution. Same thing happened during the technology boom of the 90’s. Refuse to believe it’s profound capability, and you’ll be an ostrich with your head in the sand while others utilized it and excelled. Simple as that. It’ll take the jobs as we know rn. But the term Software engineering or Coding is going to be different in the future as well. Getting into CS, you were aware of how volatile this field is. A life of constant and never ending learning. It’ll happen again in the future with something else. You’ll be ok, as long as you aren’t negligible at the technology and its capabilities.",
            "Maybe AI can fix the Reddit search bar",
            "Question is asked multiple times because everyone knows that no one knows but it’s an important question. So more opinion the better.",
            "YES get out of CS NOW 🥱🥱🥱"
        ]
    }
]