[
    {
        "post_id": "ugfdd5",
        "author": "None",
        "title": "LeetCode is spiritual",
        "url": "https://www.reddit.com/r/csMajors/comments/ugfdd5/leetcode_is_spiritual/",
        "score": 466,
        "num_comments": 32,
        "created_utc": 1651457990.0,
        "selftext": "Am I the only one who grinds LeetCode for spiritual reasons?\n\nIt’s a holy act of devotion in service to the spirit. \n\nCoupled with meditation the LeetCode grind is helping me to achieve true inner emptiness and peace.\n\nI think we focus too much on how LeetCode can help us advance our careers and not enough on how LeetCode can help us to advance our spirituality.",
        "permalink": "/r/csMajors/comments/ugfdd5/leetcode_is_spiritual/",
        "comments": [
            "Even I as well sometimes smoke before leetcoding",
            "I am begging y’all to touch some grass",
            "preach brother. may the act of leetcoding bless us, bless.",
            "/r/swoleacceptance for coders.",
            "I swear, I think I'm the only one who absolutely hates LeetCode. From the core of my being, I despise it. Usually when I get through a coding problem I feel excited and accomplished. Almost thankful for the experience. When I get through a LeetCode problem I feel annoyed and my heart screams, \"WoOoPiDeE-fUcKiN-dOoO!\" as sarcastically as possible.",
            "Only you, fam.",
            "Leetcodianity",
            "yes, the inner _emptiness_ that we all crave",
            "is this sarcasm? i really can't tell",
            "I did it out of habit. When I broke my habit I feel so empty. I think I need to pick it up again to make life meaningful.",
            "I will become one with leetcode. A pure form of logical extension, the code will become reality and I will enter your mother. Amen.",
            "What is that?",
            "Amen!!",
            "I can feel the collective sanity of this place decreasing as the year comes to an end",
            "LeetCode is really fun. \n\nIt's not fun when you're stressing because you get rejected left to right due to it for an internship. But I'm sure when you're in the industry already it can be pretty calming to just do one for fun similar to  a daily crossword puzzle",
            "Leetcode is your god",
            "yes i love leetcode. solving leetcode problems makes me feel calm and at peace with the world",
            "Don't turn this into more of a religion than it already is please.",
            "Praise the Omnissiah",
            "Now this is a what I call a deeper motivation as to why someone should grind LeetCode 😂😂😂",
            "If you’re a Christian this is literally how you leetcode lol",
            "For we shall grind unto victory, having our dream jobs, utmost Prestige, the best TC and God shall be glorified. Amen!"
        ]
    },
    {
        "post_id": "t2xg51",
        "author": "g0dead",
        "title": "Hackathons",
        "url": "https://www.reddit.com/r/csMajors/comments/t2xg51/hackathons/",
        "score": 458,
        "num_comments": 55,
        "created_utc": 1645994869.0,
        "selftext": "Just completed my first hackathon (hackNYU 2022)!\n\nIt was a great experience, I spent 8+ hours coding the backend of my application entirely in Go while my team builds a nice site and presentation just for us to lose to a figma mockup that doesn't work!\n\n10/10 Would never participate in a hackathon again.",
        "permalink": "/r/csMajors/comments/t2xg51/hackathons/",
        "comments": [
            "yea that’s the thing with hackathons. you need to treat it as more of a startup pitch rather than a coding competition. focus on creating a cool demo  rather than creating a complicated full stack app. if u want to be judged purely on ur hard skills do ICPC or something like that.",
            "My first hackathon two of my teammates did nothing, one quit and 5 hours before final submissions were due it was just me and my friend with a blank HTML page. We were going to quit too, but decided to make a Google slides with a pitch and try to make an HTML website. The website was a blank white screen with a login button on the left which redirected you to an authentication site. We won a sub-challenge because no one else met the criteria for the login app.",
            "I remember losing to kids who literally put a fucking servo on a used Starbucks cup and called it an automatic horse feeder.",
            "Same experiences I had with Hackathons. You can just win with good design that doesn’t work or use buzz words based projects. And there are the cheaters too obviously. Just go to network and meet some cool people if you can",
            "So in 2014, there was a local hackathon to make games/apps for Windows (and Windows Phone) 8, held by Microsoft. There were only a dude and me compete for the Windows 8 platform.\n\nI made this game: [https://www.youtube.com/watch?v=hpiQa4qLRvA](https://www.youtube.com/watch?v=hpiQa4qLRvA)\n\nThe other dude made a \"Eel cookbook\": he copied eel recipes from some websites and use the template provided by MS Visual Studio to make that app.\n\nHe won. Got a laptop or something, and I got nothing ;(\n\nBut I think of it just as a funny story to tell people :D",
            "Design-athons",
            "I treated hackathons as opportunities to get a project on my resume really quickly. Going to 3 fleshed my resume out and allowed me a lot to talk about during interviews.",
            "I also participated and had a pretty dope product but still lost. One thing that was common in most winning teams was that they were using the sponsor’s products like DeSo and Figma. It’s the harsh truth: apart from having a good idea you also need to play the field.",
            "Same thing happened to me haha. Got 3rd and the 1st & 2nd place didn’t have a working backend or database",
            "Was it a figma of their imagination?",
            "My first and last hackathon went like this:\n- team plans out a Java application we can make \n- one dude wants to add a db and had just passed the database course, so without explaining anything he sits down and starts working\n- We spend the first 12/24 hours doing this\n- someone else complains they don’t like Java, deletes the repo and starts from scratch on html\n- no one else knows html\n- database dude has an emotional breakdown because his design was deleted, he leaves\n- html person teaches the other teammate html, ignores me\n- they build a hello world style site with minimal styling and a few page links, I get ordered to make logos and icons (idc at this point I’m watching YouTube and doodling the icons)\n- 6 hours pass, 6 hours remain\n- database dude returns, does fuck all\n- I finish my icons\n- the other 2 people scrap their stuff again, decide to start over\n- we literally only have a hello world html page filled with my icons and logos\n\nAnd that’s why I’ll never do hackathons again (game jams on the other hand are dope as fuck)",
            "I built an entire frontend and backend for a desk reservation system for remote companies, fully scalable, for any and all companies in the world and deployed it into production in less than 10 hours with my partner. We used unfamiliar frameworks, a bucket full of APIs, geolocation, Authentication, login portals etc.\n\nWe lost to a PowerPoint presentation.\n\nThis shit happens.",
            "I have won something at almost every hackathon. All u gotta do is find the sponsor and use their product to make the stupidest shit and bs the potential of that shit and also go to good hackathons. Go to stuff sponsored by big firms or cloud providers to actually gain some stuff for your resume",
            "So when it comes to hackathons do I actually need experience in doing full programs?  Do you usually do it as a team or can you solo?  Or do you just pick up random team members?  Like, do you know the topic beforehand (I guess that wouldn't work because then someone could do soemthing beforehand).  Thanks for any answers!",
            "Can anyone share a good resource where all hackathons are listed so I can try to delve into them as well?",
            "So you got 8 hours of go experience that you can put on your resume! Not a bad result at all. Sure you can try to win hackathons but then you’re just inventing some bullshit to impress some idiot local business owners who don’t know the first thing about tech. I don’t think that’s worth your time. Treat hackathons as an opportunity to learn and get a few projects on your resume. Nothing else. And tbh you can always just do the project without the hackathon",
            "hackathons are becoming frontend competitions, like i’ve seen some cool ideas and the prettiest one typically wins. even at my uni the club leaders and what not admit that a lot of winning a hackathon just is having a pretty design which sucks for those who have to pour in more time for the backend part and not as much on design",
            "Me and my team managed to deploy a deep learning app into an android app and then create a presentable app. Managed to present it also nicely and came 6th. Most of the ones before us had ML buzzwords and presentations and weren't even half working.",
            "Yeah that has been my experience too, but there were also some actually cool full stack apps that won. \nIt doesn’t matter if you win or lose, in my interviews I had a lot to say about my hackathon project + I was able to network with students and SWEs +  free swag. No matter what you technically do win something",
            "[deleted]",
            "Literally how I passed my software dev class lmao",
            "Unfortunately Ive seen that too. Not in all hackathons but in alot of them you gotta make your pitch impressive, your actual application be damned.",
            "I organized a hackathon while I have never participated in one, I am never gonna do it.",
            "The worst is when some teams show up and pitch pre-canned projects they've been working on for months before the hackathon was even conceived.. Sure your idea might be stellar but IMO it's cheating to show up with a project you didn't create during the hackathon."
        ]
    },
    {
        "post_id": "lz7no4",
        "author": "Code_Cowboy_",
        "title": "The LeetCode Prayer",
        "url": "https://www.reddit.com/r/csMajors/comments/lz7no4/the_leetcode_prayer/",
        "score": 463,
        "num_comments": 45,
        "created_utc": 1615054941.0,
        "selftext": "[https://www.youtube.com/watch?v=U6D9astOPY4](https://www.youtube.com/watch?v=U6D9astOPY4)\n\n  \nOur recruiter, who art in the bay area,\n\nFAANG be thy name,\n\nThy interview come, \n\nthy algorithms will be done,\n\nOn coderpad as it is on-site\n\nGive us this challenge our daily challenge,\n\nAnd forgive us our syntax errors,\n\nAs we forgive those who use hards against us.\n\nAnd lead us not into infinite loops,\n\nbut deliver us from brute force.\n\namen.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=U6D9astOPY4](https://www.youtube.com/watch?v=U6D9astOPY4)",
        "permalink": "/r/csMajors/comments/lz7no4/the_leetcode_prayer/",
        "comments": [
            "Amazon",
            "Amazon",
            "Amen and Awomen",
            "You forgot about the “Forever and ever” before the amen, coz it feels like I’ve been leetcoding forever lol",
            "Amazon",
            "Am(az)en",
            "Amzn.",
            "Amen",
            "Amo(n)",
            "Amen.",
            "Amen.",
            "I saw this and I was impressed. \n\n\nThen I saw the YouTube video , and I dieddddddd",
            " Amazon",
            "Am(azon)en",
            "Grinding is holy",
            "Ama(zo)n",
            "Amen",
            "Amazon",
            "Amenzon",
            "Am?n.",
            "Amazon",
            "needed this  !",
            "Amazon 🙏",
            "I'm using this 😂😂😂😂",
            "Amen",
            "Amen and Amazon",
            "Amazon",
            "Amazon",
            "Amzn",
            "bro you just posted cringe"
        ]
    },
    {
        "post_id": "l5bhk0",
        "author": "_--Ryan--_",
        "title": "Imagine being the guy that passes all 5 technical rounds of interviews with optimal solutions, and then fails the 30-minute final fit call...",
        "url": "https://www.reddit.com/r/csMajors/comments/l5bhk0/imagine_being_the_guy_that_passes_all_5_technical/",
        "score": 465,
        "num_comments": 68,
        "created_utc": 1611657471.0,
        "selftext": "... oh wait that's me",
        "permalink": "/r/csMajors/comments/l5bhk0/imagine_being_the_guy_that_passes_all_5_technical/",
        "comments": [
            "\"Haha, sucks to be that dude!\" - Guy who didn't pass through the first OA because he didn't know how to declare a 2D array off the top of his head",
            "Kindly enlighten us with your experience Robin Hood",
            "what nutjob company has 5 rounds of technical interviews for an internship?",
            "Same! Went through hackerrank, technical round, hr round, then 5 hours of final onsite (virtual). All with optimal solutions. Rejected.",
            "Company? Curious about 5 rounds!",
            "This happened to me last year for Stripe. Felt like such a rip :(",
            "Wait what? 5 rounds? What level is this? Senior, cto, manager???",
            "Happened to me a for a machine learning engineer position lol. They asked me about previous employer and I didn't have much nice to say. I wouldn't have gotten so negative but they really wanted to know as it was a big name.",
            "Why does it take 6 rounds to determine if you’re the right candidate? What job is this??",
            "Welcome to the club 😔🤙🏼",
            "Mee too, Charles Schwab",
            "I felt that. I felt that so much. You're not alone",
            "Happened to me many times for top companies. I'm not the best at forming coherent sentences during an interview.",
            "Doing my 30 min fit call after 5 rounds of technical interviews today ..... watch the same thing happen to me 🙃",
            "yo! i got one this week with them. are the phone interviews harder/easier than OA?\n\ni'm studying DP. anything in particular u recommend, esp. for phone?\n\nthanks lad!",
            "Honestly if a company tries to pull that shit I would just bail.  It's not worth my time to go through all that when I could apply to 3 reasonable companies in the same amount of hours.",
            "It is just tragic. I feel like you will find a better place to work 😀",
            "Sounds like some game show shit",
            "Is it Bloomberg?",
            "Go through what happened step by step and I can give you feedback about what NOT to do"
        ]
    },
    {
        "post_id": "169j46v",
        "author": "thepragprog",
        "title": "Fact: you are not passionate",
        "url": "https://www.reddit.com/r/csMajors/comments/169j46v/fact_you_are_not_passionate/",
        "score": 463,
        "num_comments": 72,
        "created_utc": 1693805240.0,
        "selftext": "I see so many people complaining that other people are not passionate and that they shouldn’t pursue cs. No bro, you are not passionate. If you are truly passionate, you wouldn’t be gate keeping 24/7 💀I’m the only passionate person here. No one’s passion can outmatch mine",
        "permalink": "/r/csMajors/comments/169j46v/fact_you_are_not_passionate/",
        "comments": [
            "some cs majors out here think they are the 1%",
            "I'm here to get paid sir not to recruit people into my cult.",
            "I’m passionate for your mom",
            "Oh? You don't find assembly language and algorithms interesting??? They bore you, and you only enjoy the actual programming???? WHY ARE YOU HERE???? YOUR PASSION FOR THIS MAJOR IS MINIMAL.",
            "What’s that? You don’t like programming 24/7 in your free time? Yeah this major ain’t for you champ. Get out of my sight, inferior person.",
            "Speak on it twin",
            "Yeah but I weigh 260 bro",
            "Not a csmajor, but in art/design you hear things like 'I'm so passionate' all the time, but when you ask what they are working on, the answer is usually nothing. \n\nhow many 'passion'/personal projects have they completed this year? Generally 0 most of the time. \n\nWhere is the passion? \n\nIf you are actually passionate about what you are doing, then do it and stop talking about doing it. Do it for yourself, not for internet points and head pats but because you are interested in it and want to make something happen.",
            "What are you talking about? Nobody will ever be more passionate about the fucking bag than I am 😤",
            "For real. Truly passionate people would want the bar higher by increasing competition but also the state of tech",
            "Looking at everyone's LinkedIn profile, passion is the #1 used word.",
            "if people were passionate, we would be living in 2077 now. just saying.",
            ">If you are truly passionate, you wouldn’t be gate keeping 24/7 💀\n\nDoesn't really follow, lol. And these people outright state that they have no passion and are only motivated by money. Maybe you'll see how annoying colleagues like these are once you actually work in the field, if you haven't yet noticed it in uni. I'm not saying you need to be passionate about literally every single aspect of CS, but at least be somewhat interested in the stuff you work with beyond \"lol money :)\". Unless you have an unreal amount of discipline you are either going to hate your life in this field or just straight-up suck if you don't have any passion for it.",
            "Naw I just want money",
            "I am so passionate I go to work with no pants.",
            "[deleted]",
            "You don't have to be passionate about CS but you do need to enjoy problem solving otherwise this career is going to make you depressed. Yes I have had classmates who hated challenging their brains and would rather just relax playing video games. They had no curiosity at at when it came to figuring things out. \"Oh it's broken? oh well...\" kind of mindset instead of trying to google. They are not working as devs now, big shock. I think people here are just trying to warn these kinds of people to not waste their time in the field, it's too stressful for them. They see it as stressful inconvenience while most of us see it as a challenge. People forget it's still a STEM field. You have to enjoy problem solving.",
            "im more passionate then every computer scientist. who do u think linus torvalds learned from? who do u think gave bill gates the idea of creating a OS? who do u think took the bite from the apple logo? it was me. I have arrived",
            "There’s always a bigger fish. You think you are real smart and then run into some real geniuses that are 4 parallel universes ahead of you.",
            "passionate developers have no time for showers, laundry or basic hygiene. \n\nbe so passionate you can smell it XD (jk?)\n\nalso, university classes going over outdated methodologies / language versions and non CS related coursework are a waste of time and money, especially in today's world where you can learn anything with drive, a brain, and an internet connection.  \n\nany company that uses a CS degree as a hard requirement is missing out on some serious talent based purely on bureaucratic nonsense.  \n\ndisagree? you're not passionate about CS you're passionate about meeting people's expectations.\n\nstill disagree? please share how you are better than Wozniak, Allen, Gates, Zuck, Ellison, Ek, etc..",
            "So you completely overlook stackoverflow 😭",
            ">No one's passion can outmatch mine.\n\nBet. Not only do I not gate keep cs, but I do the exact opposite I gatekeep every other subject. Everybody should learn cs",
            "Most of those guys don’t process the social capability to function in an actual work place",
            "Exactly. For some reasons most companies look for 'passionate' employees. Some people don't actually know when to start living",
            "I’m near the end of my uni/college bondage I just can’t quit",
            "I never said they shouldn’t pursue CS. That was never my intent when making that post. Do whatever tf you want. Just don’t think I’m a weirdo if I don’t spend all day doing leetcode and am taking classes you wouldn’t",
            "Also I wonder what would happen if all college kids majored in CS because “that’s where the money is”. We’d have no doctors, lawyers or engineers. Only people getting paid $300k for centering a div. Sounds dystopian. Unlikely but an interesting scenario nevertheless",
            "The only thing im passionate about is money. I like learning stem and with enough work I can teach myself to truly like CS, especially for the right amount of money.",
            "*ugh i need to show more passion, let me go take more back shots from data structs professor*",
            "If someone's not passionate about it in college, they won't be passionate don't it as a career",
            "Gotta love the gatekeeping. Withhold basic knowledge simply because you want to feel like you know more than others.",
            "Says the guy who can’t even end his rant with an exclamation point.",
            "You can be passionately mean as well as passionately generous.   \n\n\nI'm still fairly generous but I have hand people basically stand on my throat when I've tried to help them and then never offer me a hand up. So I'm more selective.   \n\n\nRandom people on the internet could quite easily end up being the same people that cause gatekeeping later on.",
            "Yeah but I still get dates you know? So I won",
            "I am not passionate about linked lists and hashmaps\n\nI am passionate about what they can allow me to do",
            "true"
        ]
    },
    {
        "post_id": "j57c8e",
        "author": "nutbuster999",
        "title": "Anyone else feel like the CS life is a drag right now?",
        "url": "https://www.reddit.com/r/csMajors/comments/j57c8e/anyone_else_feel_like_the_cs_life_is_a_drag_right/",
        "score": 458,
        "num_comments": 49,
        "created_utc": 1601848233.0,
        "selftext": "With the pandemic I feel like time is just passing by while I do the same thing day in day out. \n\nSearch for internships, leetcode, coursework, repeat. There’s no variation and the fact that there is several more months of this ahead of us makes me sad. I spend 90% of my time in front of my screen doing the same old thing everyday and man am I BORED. \n\nAnyone else just... tired? \n\nHope all my homies are doing okay",
        "permalink": "/r/csMajors/comments/j57c8e/anyone_else_feel_like_the_cs_life_is_a_drag_right/",
        "comments": [
            "Yes, I couldn't tell if this was pandemic-related or not but these last months have felt different. \n\nIt's just homework, classes, other commitments, and job apps that go nowhere most of the time. Whenever somebody like my parents, coworkers, friends, etc. ask me \"what's new\" or \"what's going on\" I literally don't have an answer. It's just a grind. I don't even remember what I do for \"fun\" anymore. The last 3 years didn't feel like this, so I don't know if it is because of the pandemic, or if senior year is just like this.",
            "Yeah. Now that universities back on I also have to keep up with coursework, reading. Etc. I don't know how anyone learns anything while looking for a job. Literally all my time is spent writing cover letters and researching companies for those cover letters. Why does every company need a half a page summary of how great they are and what businesses they're involved in that I'm suitable for.\n\nI can write code. Smack that on a T-shirt and it should be enough for an entry level position, I'm not asking to join Amazon or anything.",
            "Just wait until you graduate and get a job....then do the same thing every day for 40 more years.",
            "Stay up, cs is a huge field and if its feeling stagnant you probably arent exploring as much as you could. Take a break from leetcode and do some personal projects. Buy an arduino and build a hardware project, download tensorflow and write some facial recognition software, build a game or make a website, or unplug and get some exercise. Good luck definitely tough times",
            "Yeh virtual sem has just turned out to be all the work of college without any of the fun :(",
            "To a degree kinda COV-19 fucked me, I was suppose to graduate early and travel world for 4-6 months before start my job. Now I'm graduating this fall and really unsure what do myself. I can continue to work my internship but dont need money and want take break from cs. Before start 9-5 slug fest but my year started way too good so gid might be getting his revenge. At the end day, I'm at least gaining skills I would've never had if COV-19 didnt happen.",
            "This too shall pass. For what its worth, youre doing a great thing by getting a degree. I'm jmpressed man.",
            "Yea buddy. You just need a break from the rote. Take a single day off and do something enjoy, preferably something outdoors. Get some fresh air and rejuvinate.",
            "I feel you. I'm in my junior year and I did nothing in the first two years. I've been trying to catch up. My screentime is crazy. Last week I was done. For a week I couldn't see the laptop screen. Whenever I open the laptop my eyes just pain, I became weak for a week, but now I'm okay. Go take a break.",
            "Also doing job applications, leetcode, coursework, repeat. Except I'm in asia, so the job scene in cs is grimmer :(",
            "The job search has become so brutal that grinding feels pointless, but giving up is a huge move. So we grind anyway even though we can't see any light at the end of the tunnel.   \n\n\nIt is hard and feels pointless.   \n\n\nOf course it feels like a drag!",
            "Hey, I just wanna put things into perspective. If you were any liberal arts major right now in this economy, you would not be able to find a job with a comfortable salary period. You would be lucky to make 30,000 or 40,000 tops. Unemployment is the norm amongst humanities majors, gone are the days when everybody got a job out of college no matter what they studied.\n\nI can also say the same for a lot of STEM majors. Biology, life sciences? Pshhh get out of here. You can be a 40,000 dollar per year lab tech at best. Aerospace engineering? Yeah, ok good luck getting a job at NASA or SpaceX. \n\nWe live in a world inherited from our forefathers, who have exploited the environment and our economical resources to leave us a legacy where most people are rendered superfluous, and security is now a privilege which must be fought for, tooth and nail.",
            "How does your week look like? Do you take breaks on Sundays/Weekends?",
            "Recent graduate here. \n\nThat’s what it was like before quarantine. CS majors have always had the stigma that we don’t leave our rooms.\n\nIt gets a lot better once you are making $$$ and can go out on the weekends but to do whatever you want with whomever you want :)",
            "Feeling this 110% man. These past 2 months have felt like an endless loop of hard CS classes -> apply for new grad jobs -> grind leetcode. Usually it doesn’t feel so brutal but I’m guessing this pandemic is affecting everyone’s mental somehow.",
            "Yeah, on the one hand yes. I'm always in front of my computer screen. It's lame af. On the other hand, I can't hang out with my friends anyway, so this is the perfect time to buckle down, get good grades, and learn some skills I'll use for the rest of my life.",
            "That just happens to life in general, has nothing to really do with CS.  Everyone goes through ups and downs and lulls in life.",
            "Amen to that. I seem to have to alternate days between full days grinding out work without rest to the following day mostly in bed to recuperate. I am just getting so tired. I am a freshman, so I can’t compare my experience to anything else but I just hope things get better",
            "Not really because I have a ton of hobbies, nearly none are affected by the pandemic. My travelling goals were but there's plenty to see and do in my own province/country. I have been feeling like school is a drag though.",
            "Yes.",
            "I feel the same way :( This week was also midterms, so it's been super crazy. Early mornings and super late nights -- it almost feels a little suffocating because the school life vs work life vs personal life gets all screwy. And to top it all off, I just miss seeing my classmates/friends.\n\nI started taking up new hobbies like Tennis and PokemonGo and it's actually been helping quite a bit! I hope you're doing ok OP! We'll get through it",
            "Learning to cope with this will be a great skill to have. This job can just be monotonous sometimes.",
            "I'm now pursuing a post-bacc CS program, so I jumped late on a moving boat. I only have two years for loans and internships. I try not to compare myself but then I see everyone with projects and research experience, and I have basic, limited, applicable work experience. With just lab homework.\n\nI should be happy though, I did get some responses for interviews, but I didn't prepare enough for the technical portion. My Algorithms and DS classes come later this year, so I'm SOL for most of them anyways. I'll try to take my time in finishing my projects and grinding LC and hope next year is more forgiving.\n\nThat said it's all online work and I was already someone who spent most of their time doing computer hobbies: gaming, surfing the web, reading e-books, etc. So the monotony sucks and Winter is coming for us in Northern Hemisphere. That'll have everyone trapped in more. GGNORE",
            "I dont believe so, I've gotten 2 separate calls for interviews this week... and I havent applied for a job in over a year."
        ]
    },
    {
        "post_id": "17wcsqp",
        "author": "myapologiesgoodsir",
        "title": "I got an offer!",
        "url": "https://www.reddit.com/r/csMajors/comments/17wcsqp/i_got_an_offer/",
        "score": 462,
        "num_comments": 84,
        "created_utc": 1700105241.0,
        "selftext": "Ending my recruiting search with over 100 apps and 4 final rounds (with one rejection from that and one in process) two offers, and I’m accepting a SDE internship role with MICROSOFT!!!!!!!!!!!! I’m so excited. The grind was worth. I started to believe that I can and I did. Your mindset really does matter so much (trust my school and stats aren’t great + i’m a third year in second year classes/switched majors + no prior internships). I loved lurking in this page hearing people’s experiences. I hope you guys believe you can too. Hard work really does (OFTEN NOT ALWAYS) pay off. So grateful and blessed",
        "permalink": "/r/csMajors/comments/17wcsqp/i_got_an_offer/",
        "comments": [
            "Enjoy your first of many professional successes 🥳",
            "That’s so cool! Congratulations.\nDid you just regular apply to it?",
            "Congrats!! May I ask what was the hardest part of the interview process?",
            "Congratulations!",
            "I have been applying to Microsoft since freshmen year, having 3 internships. I never heard back from them.",
            "Congrats, good luck at your internship!!",
            "Congratulations! \nJust out of curiosity, did you do a lot of personal projects in college that you were able to show on your résumé?",
            "MST has never even interviewed me and I’ve applied every year lol. Congrats",
            "Congratulations. Welcome to Microsoft. Microsoft internships are really fun.",
            "Congratulations  they do a lot to keep the interns happy if your manager is great you will love it",
            "Kind of curious, but were you open about being a 3rd year in 2nd year classes?",
            "[deleted]",
            "[deleted]",
            "Are you an international student?",
            "Bravo!",
            "Congratulations!!!!! And How did you prepare if you have any advice",
            "Congratulations!! If you don't mind me asking- what do you think made your resume stand out when you didn't have any internship experiences?",
            "Share your cv with us?",
            "Heyy what project story did you focus on during the interview and what skill set, techniques, and frameworks did you focus on?",
            "Huge congratulations! Hope to share in some of your amazing luck! 🎉❤️🙏💪🍀",
            "How long after interviewing did you hear back?\n\nEdit: congrats!",
            "HYPE HYPE!!!!",
            "Congrats bro. Srsly, great job, we’re proud of you. Go enjoy yourself and get ready for big things. Now grind for that return offer!!!",
            "What things u did ? Cp projectc.... plz tell",
            "[removed]",
            "Congrats! what’s the offer like if you don’t mind sharing?",
            "Congrats! Did you have a referral?",
            "Congrats bro! May i ask you something, as. A cs student in a 3rd world country do i have a chance to apply for a remote internship at a big company like Microsoft?",
            "You’re in the exact same situation as me (no experience, 3rd year student but 2nd year CS). I’ve been struggling a ton w internships could you please show me your resume to compare?\n\nCongrats tho!",
            "If you don’t mind, which school you are from ? Did they take kids from some school to straight to final round ?",
            "Congrats, I just got it it as well :). Where will you be based?",
            "Congratulations! May ask what school did u attend",
            "Congratulations, hard work payed off! May you please share your resume if possible?",
            "Congrats! Would you mind dm’ing me your resume pls? I have changed my formatting and descriptions so many times but not getting any responses",
            "Congratulations! How long did they take to get back to you?",
            "Congrats!!!",
            "Congratulations!"
        ]
    },
    {
        "post_id": "v40rzx",
        "author": "OwnAir6660",
        "title": "Coinbase sent \"future Coinbase employees\" an email 2 weeks ago saying they wouldn't renege signed offers",
        "url": "https://www.reddit.com/r/csMajors/comments/v40rzx/coinbase_sent_future_coinbase_employees_an_email/",
        "score": 463,
        "num_comments": 71,
        "created_utc": 1654266925.0,
        "selftext": "[https://d2u3dcdbebyaiu.cloudfront.net/uploads/atch\\_img/532/58cd32343e120ad81a9e7ebb286f91b1\\_res.png](https://d2u3dcdbebyaiu.cloudfront.net/uploads/atch_img/532/58cd32343e120ad81a9e7ebb286f91b1_res.png)\n\nHi Future Coinbase Employees!\n\nYou may have seen this week that Coinbase posted an external blog post announcing our intentions to slow hiring so that we can reprioritize our hiring needs against our highest-priority business goals.\n\nFirst and foremost, I wanted to communicate that we are still extremely excited about having you join Coinbase and we will not be rescinding the offers of any employees who have already signed or have received an offer from us.\n\nWe plan for market volatility, have a strong balance sheet (ending Q1 with $6.1 billion in cash and equivalents), and have a decade of experience in managing volatility in crypto. We're taking this action to ensure we're best positioned to succeed during and after the current market downturn. We remain bullish on the long-term future of crypto and Coinbase's position in the ecosystem.\n\nFor some of you, we have already set up time to speak further but for those who haven't reached out, I wanted to proactively share this information with you and I'm here if you need to talk! Feel free to reach out if you have any further questions and we can't wait to welcome you to Coinbase soon\n\nThank you!",
        "permalink": "/r/csMajors/comments/v40rzx/coinbase_sent_future_coinbase_employees_an_email/",
        "comments": [
            "Rescinding offers is horrible in the first place, but providing such positive affirmations about the company that they won't rescind and later rescinding is just utterly sick. What a trash company.",
            "I know an intl student who got a coinbase offer and stopped interviewing. \n\nNow he has 90 days to find a job who's willing to sponsor him if he doesn't want to get deported from the US.",
            "[deleted]",
            "Got my offer rescinded :/\n\nGuess I’m gonna be working at Amazon now lol",
            "r/agedlikemilk\n\nSeriously sucks that they screwed so many people over.",
            "I had Coinbase ic3 offer as a new grad in Canada. I ended up taking Amazon somehow but deep down I wanted to work at cb cuz of their cool products. Now I feel extremely lucky but I also hope Amzn doesn’t renege accepted offers.",
            "[deleted]",
            "Apparently Tesla freezed hiring too, I think we are close to the recession",
            "For the people that are working at Coinbase, I wish you the best so you can find a better company. \n\nFor management people at Coinbase that have a say in this, fuck you and I hope you will be suffering soon.",
            "ok, I was on edge a few weeks ago-- only considering moving my crypto off their exchange. Now I'm DEFINITELY doing it!",
            "Wow"
        ]
    },
    {
        "post_id": "mx4ccq",
        "author": "OmkingPlaya",
        "title": "Google offering an extra $4000 stipend to all interns this year",
        "url": "https://www.reddit.com/r/csMajors/comments/mx4ccq/google_offering_an_extra_4000_stipend_to_all/",
        "score": 459,
        "num_comments": 115,
        "created_utc": 1619209699.0,
        "selftext": "I got this email from google yesterday:\n\n“Based on what we’ve heard, we’ve decided to accelerate some of the benefits planned for the 2022 internship program. We’ll be providing our 2021 global intern community the local equivalent of $4,000 USD stipend to assist you in setting up for a productive internship – in addition to the $1,000 USD (or country equivalent) workplace allowance you’re eligible for. Please use this stipend as you see fit.”\n\nPosting this to generate discussion on the topic. I’m personally stoked that we get something to replace the housing bonus (which was taken away this year because of covid).",
        "permalink": "/r/csMajors/comments/mx4ccq/google_offering_an_extra_4000_stipend_to_all/",
        "comments": [
            "Ha you guys are in Google internships? I have none! *cries*",
            "Time to buy an rtx 3080 🤡",
            "That’s good money. Amazon gave me a total of 5k this year (Northern VA location).",
            "When do I apply for 2022 internship? August?",
            "[deleted]",
            "Lucky. My local company giving me nothing",
            "Dang that's lit. I'm personally seeing so much upwards pressure on tech compensation (especially at the intern level) this year. Both my internships (spring + summer) offered comp increases out of nowhere and it looks like the compensation across the board is rising quite a bit.",
            "[deleted]",
            "I got the email too. What is this stipend for? Do we just get a $4000 check or do we have access for upto $4000 for stuff for work?",
            "Intuit gave us $5000 “relocation stipend” too, which is nice",
            "NICE",
            "Is this in addition to or replacing the housing stipend?",
            "Bofa offered $3600, citi $2000. Some of these numbers are crazy.",
            "google offers internships?",
            "Definitely agree + glad that they're offering more, but it's still subject to taxes. iirc that's around half?",
            "Is this in addition to the relocation stipend?",
            "Mini LED iPad Pro here I come 😎",
            "Time for that PS5!",
            "Come on Wells Fargo, throw me a bone.\n\nA $1,500 stipend bone, specifically.",
            "Is this in addition to the pay they will be giving you?",
            "I got the same email. However, I am quite unsure of what the terms \"local equivalent\" and \"country equivalent\" exactly mean for me. Do both these terms just mean that the USD would be converted to my domestic currency or there is some equivalents prevailing within the company to compensate people in different areas. Btw I am from India.",
            "Wow!",
            "Microsoft is offering 3.5k stipend for interns this year, all virtual tho. Good money for new desk, setup, graphics card, etc... I appreciate it",
            "I think this was necessary for them in order to stay competitive. IMO, Google intern salaries seem to fall behind the competition",
            "I’m pretty sure they offer more to cover your summer housing in a regular year. That’s the case at Microsoft. Usually $6000 I think, this year $3500",
            "Meanwhile bytedance won't even offer remote internship despite to absolutely low fucking pay and covid situation.",
            "[deleted]",
            "Zuck watch n learn",
            "How much is google paying per hour?",
            "Tf nd I can't even get a minimum wage job",
            "wondering what they have in mind for 2022 interns"
        ]
    },
    {
        "post_id": "1b4y2qk",
        "author": "AromaticPop5361",
        "title": "IBM pays FAANG tier now?",
        "url": "https://i.redd.it/rvckhzp4fzlc1.jpeg",
        "score": 457,
        "num_comments": 98,
        "created_utc": 1709411870.0,
        "selftext": "Damn why is their PM pay so high? Are they finally a prestigious company?",
        "permalink": "/r/csMajors/comments/1b4y2qk/ibm_pays_faang_tier_now/",
        "comments": [
            "Can confirm, that salary is for masters I thought though",
            "Good for them",
            "Don’t use levels for precise numbers. I got an intern offer last year and it was about 47/hr. Not too far off from FAANG, but then compare their new grad salaries and they’re are a lot lower.",
            "I don’t know for sure but levels intern pay is crazy unreliable because a lot of people include their housing stipend in the hourly. I’m pretty sure Amazon pays around $50-60 an hour but one of the locations says something like $89 lol",
            "Levels is unreliable. But IBM does pay well. On one of the intern job description the lower range of the salary was $12k/month",
            "In Singapore, IBM is just seen as another IT consulting firm on par with Accenture, Infosys, and Tata Consultancy, just to name a few. Salary wise, it's definitely not FAANG tier. I've had bad experiences working for 2 of these consulting firms. Big names like theirs look good on a resume but aren't actually places you'd want to work at. Opinions will differ as these companies are huge, with many ongoing projects and each project operates as their own entity with their own set of cultures.",
            "Yeah but then you have to live in Raleigh",
            "Unironically, how is this even possible? They are massively offshoring and hiring a few good engs?",
            "I guess they are really trying to headhunt talent this year, interesting",
            "What job board are you looking at for this information?",
            "Not too relevant but:[IBM Seeks Volunteers for Layoffs, Targeting 80% Reduction in Worldwide Staff](https://www.vcpost.com/amp/articles/124797/20240301/ibm-seeks-volunteers-for-layoffs-targeting-80-reduction-in-worldwide-staff.htm)",
            "Holy shit what are these salaries, I made $18/hour at my first internship 7 years ago....",
            "Now it’s FIAANG",
            "A friend a play Rust with got an internship with them, and they offered him 100k to work full time after he graduated",
            "I feel like IBM has always been up there but i’m from RTP though so maybe it’s just because it’s always been prevalent in my area",
            "Finance guy here, are you guys getting housing stipends?",
            "Germany you can be happy to be paid 35€/hr if you have a master and now real work experience. Crazy",
            "The HB1 will take those offers first",
            "Why would you post this and cause them to have 1000 applicants on their apps now .",
            "Lots of companies pay FAANG tier intern salaries. FAANG doesnt really pay as much as people might expect because they know people will accept based on name brand alone",
            "How does this Industry pay interns so well??",
            "Can I know what app or website is this??",
            "[deleted]",
            "It is probably the last company I'd work for",
            "What website are you using",
            "What's this website you applying through?",
            "What website is that",
            "Could you share where you see this list?",
            "What website is that?",
            "Which platform is this?",
            "What website is this?",
            "May I know which website it is?",
            "130k is fang tier?"
        ]
    }
]