[
    {
        "post_id": "q7pfdx",
        "author": "Relevant_Country_672",
        "title": "Thanks Jane Street",
        "url": "https://www.reddit.com/r/csMajors/comments/q7pfdx/thanks_jane_street/",
        "score": 462,
        "num_comments": 13,
        "created_utc": 1634174956.0,
        "selftext": "I applied to Jane Street on October 8th and got rejected on October 12th. I was actually really happy that they weren't one of the companies that just never send a response. So thanks Jane Street, I really appreciate not being left on read :)",
        "permalink": "/r/csMajors/comments/q7pfdx/thanks_jane_street/",
        "comments": [
            "Congratulations",
            "[deleted]",
            "[deleted]",
            "We stan Jane Street",
            "years ago, I applied to Deloitte and got rejected in like an hour or so. No even a joke.\n\nI had the pleasure of accepting AND reneging their offer two months ago. \n\nDon't give up. lol",
            "They rejected me within a week. I appreciated their closure.",
            "I applied  to P and G at around 5pm on Sunday and got rejected at 11 pm. Thanks for not even seeing my resume.",
            "I applied the day it opened and haven't heard back since :(",
            "I guess thats better than \"ahoy!\" x2"
        ]
    },
    {
        "post_id": "19bts99",
        "author": "uatemyduck",
        "title": "To all the \"know-it-alls\" in CS group projects...",
        "url": "https://www.reddit.com/r/csMajors/comments/19bts99/to_all_the_knowitalls_in_cs_group_projects/",
        "score": 459,
        "num_comments": 60,
        "created_utc": 1705807159.0,
        "selftext": "Nobody cares that you did machine learning when you were in 6th grade. Nobody cares that you did competitive programming in high school. Nobody cares that you've done 3 internships so far.   \n\n\nWhy do you need SO much validation? Just be happy with yourself. Stop sneaking in self-compliments and brags into the conversation. The only reason people group with you is either because you'll do all the work or they want a referral.",
        "permalink": "/r/csMajors/comments/19bts99/to_all_the_knowitalls_in_cs_group_projects/",
        "comments": [
            "Just one up them and say you've been coding since you were in the womb and interned at FAANG at age 5.",
            "My experience with a lot of CS/SWE folks, working or studying, is this is their one (or one of few) aspects in life they are very good at something so some feel they need to remind everyone constantly. It’s no different in other industries/majors.",
            "Baby you learn to love them. Gives you some extra free time tbh. Way worse to work with lazy people who don’t know shit.",
            "In my experience though most of the time it’s those on the receiving end who are reading too much into it. If it’s relevant when they brought it up then it’s fair game. It’s not a big deal for them and their friend group are usually equally as capable so no one feel like they’re bragging. They can elaborate and continue the convo and have back and forth discussions.\nIt’s usually when these sort of people should group with and interact with other people they forgot the mere action of mentioning relevant experiences can hurt their feelings.",
            "You can't survive in this industry without overselling yourself. And who said nobody cares 💀💀\n\nSounds like someone's really salty asf.",
            "its the system thats fucked. those ppl probably defined their lives and entire identity based on such things. its quite literally the only thing they live by. remove those, they'll just be an empty shell. But why is that? idk. all i do know its fucked up those ppl dont got an external outlet, say, family, to talk about such things so they end up doing it to their colleagues and peers. theyre just victims of it all",
            "I'm willing to bet they just kind of mentioned it in conversation and you're the one having an irrationally strong emotional reaction to it cuz you're the insecure one",
            "That's all fine as a student, but you'll find rather quickly when you get out of school that you will be your only reliable and honest advocate. It's a myth that your work will speak for you.\n\nYou need to learn to advocate for your own talent, productivity, passion, and willingness to complete projects. More often than not, it's the self-promoters who succeed and get those raises and promotions, not necessarily the most talented.",
            "They are gonna get better job offers and you will have to act all nice congratulating or liking their post on linkedin hoping for a referral",
            "Cope thread",
            "If you don't care then why don't you group with somebody that doesn't do all the work?",
            "While I am not particularly that great at cs, I kinda know what it might be like. My mathematical skills were my what defined me. I’m usually a bit unconfident and always feel small in my spaces. My skills were the only place where I felt strong and confident. Whenever I had the chance, I loved showing it off. I’m sure a lot of them also need the validation because they still feel insecure. Who knows what may have happened to them to push them to feel this meek? I don’t think they are bringing it up to put others down but put themselves up.",
            "sounds like your dog water",
            "Ah so you are that person who leeches on other work on group projects\n\nAnd you've even manage to insult lmao",
            "Lol salty",
            "Don’t call me telling me about all the offers you got when I haven’t gotten one yet, I don’t care badman 🙏and yes, I’m hating.",
            "\\>  Why do you need SO much validation \n\nuhh isnt this another validation seeking post",
            "Lol mad cuz bad",
            "If they know it all just make them do most of the work and coast to an ez A",
            "It’s hard but you have to stay willing to work with other cs majors. I didn’t have a solid group to work with until senior year, and it was hard to finish all of it myself :(",
            "Comments are really proving you right lmao. Very big difference between being proud of achievements and constantly shoving them down others throats. I have multiple internships and a pretty solid resume, I rarely talk about any of it - I find that shit insufferable, truly.",
            "Because: autism.",
            "someone's salty that they're better",
            "“They will always be better than you”",
            "lol if they were truly knowitalls, theyd be working in industry already, not in class with you\n\n\neasily remind them of such",
            "Nobody cares that you know nobody cares",
            "I worked as Ta while I was in the grad school. We used to call it undergraduate symptom. There will be atleast one slide during final project presentation where know-it-all people are showing their literal code, lol!!! No one cares if you wrote 2000 lines bro, no one! Specially those spaghetti like codes are already unreadable let alone in a tight slide.",
            "People who say the most usually know the least",
            "If they’re being annoying about it, then I just say that’s cute and make something up to one up them.",
            "The comments here is why I fucking hate the people in this major. Like I feel like im the only one who is actually passionate about comp sci and everyone else is just passionate about \"proving\" that there better than other people jfc. I should have just majored in mechE lmao.",
            "For a sec I thought I was being @'ed for every single group project where I was always literally the only person (and maybe one other people half the time) to even make an effort to contribute to a CS project.\n\nI'm tired of being the one doing all the work while all the kids who claim to be so talented do jack shit.\n\nI'm with you, my friend\nscrew those goddamn know-it-alls\n\nI did a project in a club where basically we were making a networked arcade cabinet. I was working on building the API to connect a bunch of parts. The whole time I've got this one wizkid (who is really skilled at devops and webdev) throwing backhanded insults at \"whoever was working on the API\" for not making it a certain way. I vehemently dislike devops and webdev btw, so it's not like I'm as capable of picking up skills as though I were Dennis Ritchie :/",
            "I had someone like this who had to do a final project with me for a HS coding project. I ended up having to do it all because he really wasn’t a know it all 🤠I wish more people would instead encourage people to learn those things early on instead of gatekeeping everything."
        ]
    },
    {
        "post_id": "xbxmtd",
        "author": "hairytongs",
        "title": "Hustler’s University Timeline",
        "url": "https://www.reddit.com/r/csMajors/comments/xbxmtd/hustlers_university_timeline/",
        "score": 457,
        "num_comments": 35,
        "created_utc": 1662940379.0,
        "selftext": "I recently applied to Hustler’s University’s SWE intern position but haven’t gotten an OA yet? Anyone familiar with the timeline? (I applied w a referral from Andrew Tate as well)\n\nEdit 1: Just got the Hackerrank!",
        "permalink": "/r/csMajors/comments/xbxmtd/hustlers_university_timeline/",
        "comments": [
            "He kept asking me \"what color is your Bugatti?\"anybody know what lc question is this",
            "Yeah I did my interview 2 days ago. I got a LC hard (that I thought was easy), and my interviewer said I was a \"Top G\". Does anyone know what that means? I think I did well but I'm not sure",
            "I got rejected by getting punched in the face by the G, all because I vape. Toughest application so far",
            "Did you send in 100 applications for 100 days",
            "[deleted]",
            "Completed Hackerrank a week ago, I had a phone screen with HU recruiting manager yesterday. She was asking me some questions and a weird French song started playing in the background. Andrew Tate himself then joined and asked if I am a high value man (I said yes of course), then he promptly left. Did this happen to anyone else?",
            "L M A O this thread is hilarious",
            "They asked me to drink 5 gallons of sparkling water during the phone screening. Did somebody have the same thing? I'm still farting from last week, hopefully I get an OA.",
            "If you haven't learnt French, you better now. They always have a singing question about top g's theme song.",
            "I applied a month ago and today while refreshing my application portal I got an \"Uncaught Type Error: Cannot read property\" in the console? Does anybody know what this means? I'm really nervous does this mean I got an offer",
            "TOP G Remember to drink sparkling water otherwise you're a brokie!",
            "Got a perma ban from applying cause I drank regular water during my interview??",
            "Common Tate W",
            "I did the final round but got rejected, it's super hard. You have to code a program that registers them in a human trafficking database.",
            "wait whats your misogyny score :/",
            "I had my onsite last week, was way tougher than my Citadel onsite. Make sure to be ready to do 1000 pushups and eat a bunch of raw onions on the spot.",
            "They made me use an Iterative Quick Sort to find the BETA in their member database.",
            "Where is the shit post tag?",
            "[deleted]",
            "Read this as Hitlers University’s Timeline…"
        ]
    },
    {
        "post_id": "v48l68",
        "author": "None",
        "title": "You've all learned a lesson.",
        "url": "https://www.reddit.com/r/csMajors/comments/v48l68/youve_all_learned_a_lesson/",
        "score": 458,
        "num_comments": 97,
        "created_utc": 1654289085.0,
        "selftext": "3 years of bull markets and everyone thought that if some fuckers say that a company has a 10B valuation then it's solid as a rock.\n\nWell, now that markets are correcting and we are going into a recession, you can see what companies are really worth it. \n\nThere's a reason why Amazon, Microsoft, Google have been around for decades. Not your overvalued unprofitable gig economy crypto furniture delivery startup.",
        "permalink": "/r/csMajors/comments/v48l68/youve_all_learned_a_lesson/",
        "comments": [
            "Where am I gonna go for my crypto furniture delivery needs now",
            "People out here accepting job offers smh",
            "Everyone seems to be talking about the recession on reddit, where can I read more on this topic?",
            "I made a good 250k from crypto and even I wouldn’t touch crypto related jobs lol",
            "[leetcode.com](https://leetcode.com) is still going strong. Solid company right there",
            "Never ask a software engineer for economics advice: ultimate Dunning-Kruger just because they’re paid a lot.\n\nA few weeks ago, people were still drinking the koolaid saying that software engineers will always be highly paid, and that’s there’s a never ending demand for them, that the laws of supply and demand didn’t apply. 💀",
            "That’s why u work for banks. They just get bailed out anyways",
            "What’s a correction? Are our jobs safe?",
            "\"There's a reason why Amazon, Microsoft, Google have been around for decades\"\n\nLmao 2 decades, it's been 2 decades. It's very possible that in another 2 they're not even around anymore. Go look at the top companies 2 decades ago, do you recognize any of them?",
            "Both Sun Microsystems and Silicon Graphics were around for longer than either Amazon or Google have been.",
            "I agree with your points, but you seem a little too agressive, thinking that we don't know this shit won't last. We do (atleast most people I know do), we just want the money not change the world like CEOs say.",
            "When times are more certain and predictable, you spend more money and time on ambitious but risky efforts, which is how the world gets companies like Google, Amazon and Microsoft.\n\nTimes aren't as certain right now, so it's harder for folk to take risks. Markets aren't correcting bloated valuations - they're reflecting a decrease in the risk threshold for people because times are probably gonna get rough.",
            "More like 12 years of bull markets",
            "Better go be a server most reliable job when things get shut down",
            "Crypto is the next big tech, so yea startups are always risky but they're very important for development. There are literally departments in the companies you listed using crypto tech to build the next products."
        ]
    },
    {
        "post_id": "qx1s1n",
        "author": "uw-police",
        "title": "To all the companies asking for a cover letter -",
        "url": "https://www.reddit.com/r/csMajors/comments/qx1s1n/to_all_the_companies_asking_for_a_cover_letter/",
        "score": 459,
        "num_comments": 28,
        "created_utc": 1637275693.0,
        "selftext": "Dear hiring manager,\n\ngive job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job\n\ngive job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job\n\ngive job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job  give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job  job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job  give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job\n\n job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job  give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job  give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job give job\n\n\nHope to hear from you soon!\n\nWith warmth,\n\nuw-police",
        "permalink": "/r/csMajors/comments/qx1s1n/to_all_the_companies_asking_for_a_cover_letter/",
        "comments": [
            "feel free to use it as your own!!! 🥰🤗",
            "Somehow I knew op goes to Waterloo judging by this post alone.",
            "No exclamation points?\n\nClearly you lack motivation, so while your skills are impressive we won’t be able to consider you \n~Hiring Team\n\n\nBut in all seriousness, all my homies hate cover letters and I refuse to apply with one. Luckily my application to OA ratio is pretty high so I can live without it",
            "If they pay minimum wage AND require experience OR have a cover letter requirement I skip and hide them",
            "Wait what is that you want given to you?",
            "Saving for later",
            "Wait till they email ceca",
            "You're the best user in this sub.",
            "So iconic I'm shaking and crying and pissing .",
            "I’ll just don’t apply if they require a cover letter",
            "Someone actually did this who applied to my current company. They didn’t even require a cover letter lol",
            "Feels like, I will not only get ghosted but also blocked :(",
            "job me needing now, job for me?",
            "How important is cover letter when applying?",
            "S.readlines()\nS.split()\nS += “blow”"
        ]
    },
    {
        "post_id": "1axct3t",
        "author": "cool-throw-away",
        "title": "It's not your fault, but its not TikTok's either",
        "url": "https://www.reddit.com/r/csMajors/comments/1axct3t/its_not_your_fault_but_its_not_tiktoks_either/",
        "score": 460,
        "num_comments": 72,
        "created_utc": 1708624459.0,
        "selftext": "The tech market isn't oversaturated because of TikToks, and employers aren't firing devs because of AI. There's a deeper cause that's often overlooked, especially by younger devs who are being hit hard by the downturn.\n\nI'm writing this because I see too many people pointing fingers at \"Day in the Life\" videos for market saturation. **That's not the issue.** These videos have existed for years. If they were the problem, the industry would have tanked long ago.\n\nOther common scapegoats include bootcamps and AI advancements. I don't claim to be an expert in AI, so I can't make broad claims about whether or not AI will take our jobs in the future. But I can confidently say this: GPT-4 is not ready to run production-ready software. As for bootcamps, I believe they fill an important niche. Not every dev making CRUD apis or buttons in React needs to know what a Red-Black tree is. At my last job, my team's Staff engineer was a self-taught university dropout. Tech values skills over credentials, and fetishizing degrees won't take us anywhere good.\n\nSo, what's the real cause of the downturn? I'd like to propose that it's *interest rates*. High interest rates are driven by inflation, a direct consequence of excessive money printing. The money printed during the pandemic hasn't been distributed fairly. Since 2020, the world's 10 richest men have doubled their net worths, while average people see their purchasing power shrink due to inflation. When borrowing is expensive, companies naturally cut back on spending – including R&D budgets that support engineering jobs. And with each layoff, stocks shoot up and investors get richer and richer. The system is rigged against us right now, and there's not much we can do about it.\n\nYoung devs are understandably angry at the world because the market isn't providing them a path to a decent living. This systemic failure absolutely justifies their anger. I urge those devs to direct that anger towards those truly in power, not fellow devs. People in tech for the money aren't the enemy; they're trying to provide for themselves and their families.\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/1axct3t/its_not_your_fault_but_its_not_tiktoks_either/",
        "comments": [
            "I don’t think enough people are acknowledging that the markets also over correcting for hiring way more people than they needed. On top of everything else going on, it’s just simply clear that companies can run just fine, and continue to scale, with less employees. \n\nIt’s like, in the 5 or so years before the layoffs started, companies were hiring at maybe 200% of the rate they should have been. And now they’re hiring at maybe 75% of the rate they should be. The convergence will happen but it won’t be the return to madness many people expect.",
            "hard agree that tiktok is nowhere near new, tech has been perceived as cushy and extremely high-earning for a long time. i know dudes whose initial interest in CS came from that owen wilson movie *The Internship*. shit came out in 2013",
            "Bro woke up and decided to spit facts",
            "Nah, let me get angry at relatively impoverished foreigners, people who worked harder than me, and random people on tik Tok please",
            "Oversaturation is a larger cause than just rates, this happens with any career historically with high pay and lower bar to entry.\n\nOnce it gets flooded the wages depress and people leave, it is cyclical .\n\nTelling people it is just the rates missing the forest for the trees .\n\nThe reality is there was an intention to push people into programming for exactly this reason to decrease labour costs.\n\nIf you love programming don't let this discourage you.\n\nHowever if you are into this just for money, pain and burnout awaits you.",
            "This take is too smart for this sub, these people are losers and just want someone to blame lmao",
            "5 years ago you could go to a random college, graduate with a 3.0 GPA and no projects, and walk into a 6-figure job without having to prepare. Meanwhile this was not true for any other industry.\n\nArbitrage opportunities don't last forever. It was never sustainable for CS majors to make the most money for the least effort.",
            "[deleted]",
            "High money printing can only happen in low interest rate environments. Prolonged periods of low interest rates is what creates high inflation. \n\nWe had extremely low interest rates from 2010-2021. It was going to be sooner or later that we need to pay back for that time. I personally don’t see interest rates decreasing any time soon. This is the new normal especially with the market at all time high.",
            "Unfortunately OP's take might sound better than the TikTok bashing but is also not 100% correct.\n\nCompanies that build things that make money are still hiring - the rise in interest rates has caused all the unprofitable or risky projects to be scrapped, because borrowing money for free to finance the possible next big thing isn’t free anymore. Low interest rates have not incentivized companies to do due diligence or market analysis, instead they were incentivized to churn out software and features that no one might need.\n\nDon’t let yourself get discouraged, there are still jobs out there that hire - competition is stiff and you might not work on the latest tech, but that was always the case, even in the past.",
            "Honestly, I always have trouble with the very idea CS is \"oversaturated\", at least, in comparison to most other careers.\n\nJust off the top of my head, the only careers I can think of where one can basically just \"walk in and get a decent job\" are police/Correctional Officers, Security dudes(not that decent of a job tbh), and Medical professionals(Nurses, Doctors, etc.). Most white collar work is \"oversaturated\" and most good paying blue collar work is also \"oversaturated\"\n\nThe former 2 typically have fairly shit pay and a decent amount of risk, while medical professionals have their own challenges such as tons of schooling, very hard work, weird schedules, etc.\n\nCS being how it was if anything, was a massive outlier.",
            "just sell dope",
            "I blame the rates going to near zero during Yellen’s time.",
            "Totally agree. Thank you for this",
            "Thank you",
            "CS still isn't oversaturated. It's only oversaturated at the top companies where everyone wants to work. It used to be normal to get any job you can and plan on moving for it. Are there really no defense jobs in Virginia or CS jobs in Texas? I call bs. Yes, gone are the days of people with 3 yoe getting easy $500k jobs. Too bad.  Take what you can get and jump when the time's right.",
            "AI hasn't caused layoffs because it's replaced workers but because companies are redirecting their efforts towards AI and don't need as many web and mobile app developers. \n\nIn 10 years it might directly replace some developers.",
            "fuck capitalism",
            "everyone knows it's the 2T and then high interest rates. you could have summarised the post in one line. cmon bro",
            "Wait the reason is really... the reason people have been talking about all along?!",
            "the only correct answer. thank you!",
            "It’s really over when you start blaming TikTok for your problems",
            "Yes there are less jobs but there are also more job seekers and yes two things can be true at once",
            "There's cyclicality to all industries, rapid growth then slowdown and maturity. Interest rates 100% contributed meaningfully to the layoffs, anyone who disagrees is ignorant, willful or not. It's not as black and white as supply and demand of labor. It's also how easy it is to make money or increase shareholder value.\n\nMy observation is that expectations were also likely skewed. People posting the \"life-in-a-day\" videos are usually something FAANG or of that tier. This was very competitive to get into to begin with, even when money was free. That said it's easy to feel scammed, the reality is the industry is trimming fat because share price comes first, and not all initiatives are profitable, even if they're interesting or have social utility. Higher interest rate directly and significantly penalize tech stocks.\n\nSince this is csMajors, I would say the \"programming\" skill set is here to stay, but don't get sold a dream. Most don't graduate and fall into 400k pay+stock TC right out of uni. Those who do are a mix of both extremely skilled and lucky. 99% of people aren't that. That said, massive pay packages are still out there if one has the leverage to demand it (this is kinda stupid to say because it's nearly always true, in all industries).\n\nAnecdotally, looking at peers who made it through the multiple rounds of layoffs, they're all super strong engineers but also incredibly hard working, constantly upskill, and sociable.",
            "I'm new. Did this happen before in the tech market or is this the first time ever? And is it gonna recover or it's permanent?",
            "[deleted]"
        ]
    },
    {
        "post_id": "tkecom",
        "author": "latticepath",
        "title": "I got an offer from HRT!",
        "url": "https://www.reddit.com/r/csMajors/comments/tkecom/i_got_an_offer_from_hrt/",
        "score": 464,
        "num_comments": 84,
        "created_utc": 1647986432.0,
        "selftext": "I had no offers up until now and didn't think HRT was at all possible for me. Perseverence and not giving up really pulled through. I'm so happy that I kept trying despite stumbling this entire season. I'm so grateful that I got this opportunity and cannot believe how much these guys are paying, I'll basically wipe away all my student debt in one summer. This is crazy.\n\nFor those that still do not have an internship, it's still possible. Don't give up.\n\nEDIT: lot of people asking about my background. I’m not comfortable giving too much away since I think I can be identified as there aren’t that many HRT interns\n\nFor my prep, I just reviewed my schools OS course. Just know your fundamentals well. Other than that, knowing the details of your data structures and algorithms course and system courses well and practice leetcode.\n\nFor my background, I’ve interned at FANG level companies. My grades are decent. My school is decent but not a target, in the top 100",
        "permalink": "/r/csMajors/comments/tkecom/i_got_an_offer_from_hrt/",
        "comments": [
            "Congrats on your hormone replacement therapy",
            "someone found an old comment I made a year back on the intern salary thread. amazing how much things can change\n\nhttps://www.reddit.com/r/cscareerquestions/comments/m4r05j/official_salary_sharing_thread_for_interns_march/gqwjppz/",
            "Congratulations! What role is it?",
            "What’s that paycheck gonna be lookin’ like?😂\n\nI know I’m asking what everyone’s thinking.\n\nI’ll take one for the team, guys",
            "Congratulations! Can you tell us a bit more about your background? What do you think got you through the process?",
            "First of all, congrats!\n\nBut how does one get HRT as their first offer, let alone in late March? I'm surprised you don't have at least 10 other offers already.",
            "Congrats! Is there anything in your resume, projects, interviews or background that you think helped you stand out? Tips for the interview?",
            "Congrats man! If you don't mind, can you please share how you prepped for the interview?",
            "[deleted]",
            "So you're gonna pull up in your Rolls?",
            "Congrats! Do you think marks were a big factor? If so, how were your marks like if you don't mind me asking?",
            "Hey, is there any highlights on your resume ? I have 5 internships mainly in C++ with one as quantitive developer. I did well in the OA since I solved those questions before but they never call me :(.",
            "how was your interview exp, what were you asked, lc prep etc?",
            "Congrats! Could you please post your anonymized resume here?",
            "Do u think grades/GPA matter?",
            "Congrats!!!!! \nDid you have a faang internship before? \n\nDid they ask any math based questions or swe questions",
            "SRE Intern?",
            "Congrats mate! I bungled HRT's OA. Do you mind sharing the role and possibly compensation details? I'm now trying to target full-time",
            "Can I DM you about the final interview? I want to know what you did right. I got rejected after the second round.",
            "Big up to you for landing something that’ll pay your loans off!",
            "Woah! 2022 or 2023? I had no idea HRT still had openings. Internship or full time?",
            "Do you go to a top cs school ?",
            "HRT = Hudson River Trading?",
            "NYC or chi?",
            "HRT, the greatest Formula 1 team ever?! Congrats!",
            "damn bruv are you international or domestic student ?",
            "Whats HRT",
            "I know one guy who made it there. He is top 30 in cp but nevertheless, congrat buddy!",
            "how many hours will you be working per week?",
            "when did you apply?",
            "Congratulations on the offer! How did you prepare for your interviews?",
            "dude congrats!! mind sharing the steps you took in the interviewing process? and what resources you used most for the probably aspect?",
            "Congratulations!! Goals.",
            "Congrats, so i wanted to ask does school name play a role for quant?",
            "Congrats man. i failed my HRT OA. I’m glad things worked out for you.",
            "How did you prepare? What was your strategy in the months leading up to this?",
            "Aaaw!! Congrats!!🎉 This feels amazing!🥲 can I message you?",
            "Are you an international student??",
            "Congrats!",
            "Good stuff homie!"
        ]
    },
    {
        "post_id": "1bqar12",
        "author": "CodeGaze",
        "title": "Got a CS degree august 2022 and can't land a job. Been unemployed since. What am I doing wrong?",
        "url": "https://www.reddit.com/r/csMajors/comments/1bqar12/got_a_cs_degree_august_2022_and_cant_land_a_job/",
        "score": 454,
        "num_comments": 154,
        "created_utc": 1711670109.0,
        "selftext": "I've been doing the odin project to learn some technologies that can make me more employable, l've done projects using HTML, CSS, JavaScript, which I never learned in school. I only ever did Java, c/c++, python in school. I've applied to many places through linked in and one of them was through a referral (that job wasn't even SWE, it was like a tech support role and they went with someone else despite making it to the final round). l've tried applying to QA Engineer roles incase software engineering was too much to ask for right after college, no luck there either. I've tried to just learn more skills and update my resumes, went to a resume workshop at my college but my college email just got deleted since it's been a while since graduating. I feel like I wasted my time in school and now I don't know what to do. I've applied to internships too, one of them was qualcomm through a family friend that works there, nothing happened. I'm losing hope on life and confused as to what school was even for . I'm based in San Diego CA.\n\nEDIT: Thank you to everyone who has replied and messaged me not only encouraging words but actionable things I can do and guided me to resources I can check out and places I can apply. I created a discord server for anyone who is in my same position to hold each other accountable and help one another: https://discord.gg/qbbyHnWV",
        "permalink": "/r/csMajors/comments/1bqar12/got_a_cs_degree_august_2022_and_cant_land_a_job/",
        "comments": [
            "I have found the key to getting jobs is networking",
            "> \"Got a CS degree august 2022 and can't land a job.\"\n\nSounds like you're in a tough fucking spot. But let's be real, a degree doesn't guarantee a job. The world's a competitive shithole. Are you considering how you're differentiating yourself from the horde of other CS grads?\n\n> \"l've been doing the odin project...\"\n\nGood on you for learning more shit on your own. But how are you showcasing this to potential employers? Are you just listing these skills, or do you have kickass projects that scream, \"Look, I'm a damn coding wizard\"?\n\n> \"I've applied to many places through linked in...\"\n\nFuck, applying en masse is like throwing shit at the wall and hoping something sticks. Are you tailoring your applications? Each job's unique, and if your resume looks generic, it's going in the trash.\n\n> \"l've tried applying to QA Engineer roles...\"\n\nNot getting a QA job doesn’t mean you're fucked. Maybe it's not about the role but how you're selling your skills. Are you making it clear how your coding experience translates into potential success in QA?\n\n> \"I've tried to just learn more skills and update my resumes...\"\n\nLearning new skills is great, but how are you weaving these into a narrative that makes you look like a fucking catch for any employer?\n\n> \"I'm losing hope on life and confused as to what school was even for.\"\n\nSchool gives you a foundation, not a red carpet to a job. It's a bitch, but have you thought about what value you can offer beyond academic credentials?\n\n> \"I've applied to a DoD company...\"\n\nFizzbuzz is basic shit. If you're acing that and still not landing jobs, maybe it's not your technical skills that are the problem. Ever considered that it could be something else, like your interview technique or how you come across personally?\n\n> \"I’ll try. You’re making it sound like those jobs are guaranteed though.\"\n\nNo job's a fucking guarantee. You're facing the harsh reality of job hunting. It's brutal and often unfair. What are you doing to stand out and not just be another face in the crowd?\n\n> \"My network isn’t too big and my skills are too basic perhaps.\"\n\nNetworking is key. It's not just what you know, but who. How are you working on expanding your network? Remember, it's a two-way street; you need to offer value too.\n\n> \"Im a first generation college student.\"\n\nThat's tough, but it's also a unique story. How can you use this to your advantage, to show resilience and self-motivation?\n\n> \"Ive had interviews but no offers.\"\n\nYou're getting interviews; that's a start. But why no offers? What’s going wrong? Is there a pattern in the feedback you're getting, or are you not asking for feedback at all?\n\nFace the shitstorm head-on. Adapt, learn from each rejection, and don't let this fucking grind wear you down. Where can you go from here, using what you've learned?",
            "Have you tried defense companies like BAE? There are a ton local to the area. Clearancejobs and USAJobs will have their postings.",
            "Man shit like this scares me",
            "You live in a saturated area. Come out to the Midwest",
            "Im assuming just core java, c/c++, python?\n\nHere is the unspoken truth: School does not prepare you for swe. Entry level jobs require knowledge well beyond what school teaches. You were supposed to be self studying swe concepts during your degree. If you are relying on your school education to get you a job, then you fucked up.\n\nHTML, CSS, Javascript is supposed to already be secondhand nature by the time you graduate. If they arnt on your resume, you will get automatically filtered out. This field isnt like other fields where they will train you. You are expected to self learn and already be good from the get go.\n\nThe above wasnt true 6+ years ago. If you look at old threads you would see people got offers just by talking about their shitty 2 week cli project from their intro course.\n\nYou have to pick a tech stack such as (angular, .net, mysql, docker...) and build fully fleshed out sites with ci/cd, login, registration, authorization, cloud tech such as queues and object storage, unit tests, integration tests, kubernetes, migration and scheme versioning of your data store, documentation, monitoring, logging, deployments, proper readme files, design documents, or related docs, and good architecture. Try to get users on these sites. List these sites on your resume.\n\nAnother option you could add on to is: Go back to grad school with the intention of doing more internships and networking.\n\n  \nTake my advice with a grain of salt. I graduated in dec 2022. Got a swe job for 1 year. Laid off, and im now unemployed without any luck.",
            "You're probably not doing anything wrong, just a tough line of work to get into.",
            "Same graduation year as me and same situation in San Diego lol",
            "If you’re struggling, it’s probably your soft skills. My CV has a basic structure, profile 4 line, 4 soft skills with 4 lines each, then an outline of relevant jobs, summary for each and skills learnt (solid examples). Followed by education, community involvement volunteering and hobbies. I have finished in 2022 as well, only applying for two graduate roles and getting both. I am starting a new job soon, only applying for one and getting it.",
            "SD has a pretty week job market. With companies all moving to hybrid you should move to LA or the bay area. There's really no reason why you shouldn't be able to get a job with java, python, c++. Apply to banks and swe jobs at non tech companies. The bars are much lower for those jobs.",
            "Maybe look at an open source project you're interested in and try to obtain the skills necessary for contribution",
            "There are other ways to skin the cat.\n\n1. Lower your expectations and take any job to start, even support if it's in a company that has a proper IT department (so you can network up)\n\n2. Posting through LinkedIn is a losing game. There are other ways to get in front of companies/people \n\n3. Without experience I personally found a portfolio to be great for something to show and for my own confidence. \n\nI help people on the side with all this. Dm me if you want direct help.\n\nSource: career changer in late thirties doing devops after 3 years experience",
            "Not a CS major, but recent bootcamp grad who got a job 4 months after graduation. I would recommend not applying on LinkedIn unless that is the only option provided by the company. A lot of the time, companies only put their listings on Linked In to get traffic to their own application site. I found job postings on LinkedIn, then would go to the company site and find the posting in their careers page and apply there. I find that this shows a more genuine interest in the company than someone who just mass applies to every role posted on LinkedIn. Companies want people that are passionate about their projects. Any extra effort you can put in can help. \n\nMake projects that show you are passionate about coding. I enjoy sudoku puzzles, so I made a Java project that consumes a public API to generate a sudoku puzzle and find every possible solution. I used to be a casino craps dealer and loved that job, so I made a CLI app where the user can play craps. \n\nFor both of these projects I can talk for about 10 minutes about cool techniques I learned. They want to see that you are able to transition things you enjoy in real life to code. \n\nIf you think your tech skills are not the issue then it might be personal skills that limit you. perhaps try recording yourself answering some questions and watching it back. \n\nIf you have any access to career resources from your school, ask if you can do some mock interviews and get some feedback.",
            "Same!! 2022 buddy!! Was thinking about getting masters in the meantime but then don’t wanna get more into debt… this sucks… I suck🙄🙄",
            "I would try to get a non CS support job in certain fields that require some analytical/logical thinking and then try to transition into a CS role in that niche, think logistics, banking support, etc\n\n\nIn this job market, CS grads are overwhelmingly saturated, I don’t know how your resume, etc looks like, but if you’re checking off every box, it can still end with you not getting a job if you’re not hyper focused on certain roles with certain experience",
            "Have you tried applying to gov work? Lots of job opportunities and most of it is fulfilling.",
            "I don't know if you'll see this but apply to temp agencies or consulting companies like Accenture that offers apprenticeships. I know some temp agencies take on people with no experience.",
            "You can try hitting two birds with one stone by building a portfolio of interesting projects, things that interest you, even better if they might interest others as well so you can potentially turn it into a start up or open source project. The goal is to pick up new skills while building a portfolio of interesting projects that can showcase your skills, the outcome of each project should be a live website or at least a demo video you can link to from your resume. I’m an applied scientist at Amazon (graduated 2017 and with a PhD in CS) but still have my own side projects out of pure interest, helps me have a chance to work on stuff I don’t usually get to",
            "USA is pretty big you should be able to land a job. I actually applied somewhere in florida but told them i wanted to be remote for this position and they were ok",
            "What does your resume look like? Market is tough but first impressions is always important and your resume is your first impression when looking for jobs. I’m assuming you have no internship experience during school, do you have any projects on your resume? \n\nI understand that it can be demoralizing going so long without a job, it’s a very valid feeling. However don’t forget this is just one phase of your life, you still have many years to go, the market will come back around.\n\nI’m rooting for you!",
            "Show us your resume.",
            "If you can, it's also worth trying out running a small B2B business on your own where you help other small businesses or projects integrate technology. Doesn't have to be complex, could be just you and a few friends building web apps or microservices. If you can prove you can consistently generate profits from a successful business and have other small business owners trust you with their tech stack or software engineering process, it would be a great talking point in any interview. Not only does it prove you can develop production-ready software, it also proves you can communicate well with stakeholders and business owners. I run a (very) small chatbot business on the side and I found that in almost every interview I attend, it always gets brought up positively.",
            "did you do internships while in college??\nyou can try self paced internships at Forage.com",
            "Have you been totally unemployed, or you’re just unemployed vis a vis programming jobs? Because I work with a guy who’s in your same situation, and he’s currently employed running a machine that puts capacitors and resistors on circuit boards, and it really underutilizes his skills (which would be more the kind of skills I have, given my manufacturing background, but they have me doing bigger stuff, which rarely involves writing software). So my coworker and I go out to a bar on Saturdays and we play dueling leetcode, just to keep the rust from accumulating on our skill sets. Once I think he’s got his feet back under him, because he’s rusty as hell and has a lot of bad habits, then we can work on a project. \n\nGet a job, first off. I’m not saying that dismissively, at all, like in a, “You lazy bum!” kind of way. It’s just going two years without any employment is going to look kind of lousy, and it’d be nice to have some folding money. It’s fine if it isn’t the kind of job you’d put on your CV, but… something about work kept me going for a lot of years when I felt nothing was going right, and those jobs were hot garbage. But they got me up in the morning, and I had money to live on. Not great money, but money to last until I got my shit together and went back to college. Nothing you’ve said says you don’t have your shit together, so at least you’ve got that. And, even at a shit job, if you can demonstrate that you were able to make process improvements, with hard numbers that can be referenced, even a shit job can go on a CV.\n\nAnd don’t worry so much about languages. Once you really connect with how programming works, where you develop a whole philosophy around it (I’m the high priest of a local flowcharting cult), picking up languages is something you can do very quickly.",
            "I graduated at the same time as you and also with the same rough academic experience. I noticed that when looking at job listing, a lot of them were looking for c# developers, as well as other languages that I didn't know. After about a month or two of looking, it kind of hit me that nobody was just going to hand me a job, so I had to make myself a more attractive candidate. I also kind of had to humble myself and realize that I wasn't very good at c++ at all. Both of those things together led to me sitting down and actually trying hard to learn a new language, which was c#. And that worked. I followed a couple of tutorials online that centered around easy portfolio building apps, and I also wrote and hosted my own website. All this to say, what was helpful to me was looking at the job market in a more analytical and transactional way. I wasn't getting hired because the tools I offered to an employer weren't desirable. Also, please don't take away that you should learn c#. I think you should look at postings and see what languages commonly pop-up and try to learn those. It just happened to be c# in the listings that I was seeing at the time.",
            "Not a cs major but i would recommend you to keep apply",
            "Try applying to entry level roles in tech at Fortune 500 companies. If you have one or two google internships on your resume, it’ll help. If not, reach out the recruiter. 100% should help",
            "Schools don't teach skills needed for a job, they just teach basics of CS mostly using Java, Python. This is a big downside even after spending so much for tuition and the degree not being useful for employment.\n\nI really wish they also teach Microservices, Spring, React, HTML, Containers, Cloud like AWS.\n\nI know these are developed specific to corporate companies and new tech comes every year,  but it would be great if coursework keeps adapting to latest industry tools, at least in 1 course as an elective .\n\nThis puts some earning potential use to the degree.",
            "Schools don't teach skills needed for a job, they just teach basics of CS mostly using Java, Python. This is a big downside even after spending so much for tuition and the degree not being useful for employment.\n\nI really wish they also teach Microservices, Spring, React, HTML, Containers, Cloud like AWS.\n\nI know these are developed specific to corporate companies and new tech comes every year,  but it would be great if coursework keeps adapting to latest industry tools, at least in 1 course as an elective .\n\nThis puts some earning potential use to the degree.",
            "What I've found success with is the following:\n\n\\* Create interesting personal projects (not just some project from a tutorial)\n\n\\* Go to events, competitions, networking meetups, etc.\n\n\\* Get a couple of courses/certifications to show off\n\n\\* Present everything really well on your resume and LinkedIn (Arguably the most important step)\n\n\\* Apply to a lot of jobs, and reach out to people on LinkedIn who post about opportunities at their company.\n\n\\* Ace coding assesments and interviews by grinding LeetCode and doing mock interviews.\n\n\\* Repeat.\n\n  \nBonus: Specific coding languages don't really matter to many companies (unless you're doing front-end), they look for problem solving skills that are able to be applied through code. Just practice a ton of LeetCode problems on whatever language you feel comfortable and you should do okay.",
            "It’s all number game. I am 2024 grad and applied 10k jobs. If you didn’t yet, I highly recommend",
            "TBH the need for software developers in areas like web technologies is close to nothing nowadays, if you go for it probably you are going to end like a sys admin (what is actually a great job but no close if the thing what you want is to get into code). Aside from improving your network I suggest getting into video game development, robotics, data science or desktop dev is a better field with better opportunities\n\nPD:  As you may guest am a sys admin (hopping some day change to robotics and cloud dev).",
            "Start making friends in the companies you’re applying to! Friends as in silly goofy but civilized, gonna go get coffee/dinner friends! GOOD LUCK 👍🏽 😊",
            "Do you have your CV online somewhere? I recruited for CS positions in Germany and can say that we kicked out a lot of applicants because of their CV content, structure and grammar..",
            "I changed to Pre-Med because fuck that whole process.",
            "Do you have friends / mentors in the CS field that are successful in the field that you can go to for advice? If not, feel free to message me and maybe i can hop on a call with you. I've been working in the tech industry for 5+ years now (backend) and I like helping people get into the industry",
            "My friend successfully changed to cs and made into google two yrs ago. You can do it too. Leetcode more! You will get there!",
            "I am surprised no one has mentioned this but in addition to your resume, you also need to send in a cover letter. The resume only lists your skillset but a cover letter will describe how your skills will be utilized based on the job description.\n\nYou can do all the portfolios about all the projects you have done and list them but a cover letter is a conversation to the recruiter as to how useful you can be. Just sending a cover letter will put you miles ahead of others who are submitting resumes the same as you.\n\nAnother thing is personality. You have to hide your desperation in the interview. If I were to interview and if I just get a hint that you are desperate for the job, that will just put me off. You have to fake it till you make it. Answer only what you are asked. Make light joke, small talk, pepper your descriptions with personal anecdotes if you will. Interpersonal skills are mandatory. If you have sheltered yourself in the past four years with little human interaction, or you don't know how to carry yourself among strange people and have conversations, you will need to learn this so you don't give a \"creepy, depressed, anxious\" vibe in your interviews.",
            "Ngl almost 2 years outta school it’s probably over for you.",
            "Offer free work and try to transition it into paid",
            "You are doing a lot wrong if you can't get a software job in the US.\n\nFocus on React and build a project using that, non trivial, rebuild Reddit for example."
        ]
    },
    {
        "post_id": "yylhmp",
        "author": "Significant-Ladder16",
        "title": "Accepted an offer, but Google just now got back to me saying that I have moved on to final rounds 💀. My first round was October 12th",
        "url": "https://www.reddit.com/r/csMajors/comments/yylhmp/accepted_an_offer_but_google_just_now_got_back_to/",
        "score": 453,
        "num_comments": 91,
        "created_utc": 1668781885.0,
        "selftext": "Should I still interview? This is the first time that I have ever been in a situation like this. I accepted an offer from Nike.\n\nEdit: I am not a CS student, I’m a ME. I am going for the APM role, but at Nike I’m doing automation engineering.",
        "permalink": "/r/csMajors/comments/yylhmp/accepted_an_offer_but_google_just_now_got_back_to/",
        "comments": [
            "Just do it",
            "The worst possible thing if you interview is you get rejected or turn down the offer, which leaves you in the same position as now. Interview, you may get the offer!",
            "I’d 100% renege Nike if I got a google offer. Go for it",
            "google has been taking forever for me as well lol. I wouldn’t give up a shot with them tho. it’s been especially difficult to land a google internship this season",
            "Do it, Nike is good but google is google. Renege any day for google. You will regret it if you don’t.",
            "If you pass, they'll have a reason to interview you next time because clearly you meet their hiring bar. If you do nothing, that's just as good as failure because you're still unproven talent.",
            "Even if you pass the final rounds, you’re competing with a long line of students waiting to be project matched with Google. Definitely interview with them but don’t renege your current offer anytime soon",
            "Go for it",
            "Do not turn down your offer yet. Let google know you have an offer and if they can expedite this in a professional letter. Then, interview and still keep your offer. Keep offer until you can a definite from google because you don’t want to end up losing an offer on a maybe.",
            "By the time google offer you the position, you will have completed a year or two at Nike. \nGave my final round in July, still no hope on offer 💀",
            "Yes and tell them you have an offer, you'll get expedited",
            "If I remember correctly, Google will honor an \"offer\" for a year. If anything, you can stick it out at Nike for a year and pick up a thing or two then move onto google. If you do well on your google interviews, you'll have it on record to make it easier to transition later. As far as I know, Google significantly reduced their headcount especially for lower levels, so it would be wise to hold onto an offer in hand rather than risking not having a job at all while you still go through the google loop.",
            "Just interview and you can always rescind your acceptance to Nike. It will burn the bridge but you gotta do what’s best for you not the company",
            "Look out for yourself and interview. You never know what’s gonna happen",
            "Interview for Google. If you get the offer id renege Nike since Google is significantly better, but if you do not get offer, congrats on Nike!",
            "Often times with the amount of applicants for a position it can take weeks to interview everybody and make a decision. Making it to finals with Google is awesome, and personally I would follow through with Google and keep Nike as a backup if possible. You can always renege an offer.",
            "Sure, do it. No guarantee when it comes to team match so just keep with the Nike offer. If you do get an offer just explain to Nike the comp difference is too much to pass up, everyone will understand.",
            "I think you need to learn a special word that's start with R if you get google.",
            "do it my dude",
            "I’d just stay with Nike, unless google has way higher pay. Nike sounds like a cooler place to work at to to me",
            "Hmm Nike actually pays SWEs pretty well don’t they? New grads at Google make around 200k. If Nike offer is comparable I wouldn’t bother.",
            "Worst case scenario you don’t get the job at Google best case you can sit on two offers and pick what you would rather do. Has a professor give us the advice that you should almost always interview at every chance you get because you never know what opportunities can come",
            "Accept the offer and take the interview. Who gives a fuck. Companies pull offers all the time. I had this situation when I was in college. Negotiating didn't go as well and I accepted an offer so I had a job and finished a final round. I finally got an offer from the other company and accepted and called the prior one thanking them for the opportunity but I've decided to go with a competing offer. Do what's best for you and what you feel comfortable with.",
            "Congratulations! You should go for it. Also, is this for internship or full time? And undergraduate or graduate student?",
            "How hard was the interview process at Nike?",
            "Play both sides. Still interview but don’t renege Nike until google has actually accepted you and given you an offer.",
            "Try and work and both at the same time 😂",
            "Definitely interview. Whatever you end up doing in the end, interviewing more is always a good idea. Think about the future. When it’s time to apply for new grad roles you will have more experience interviewing and may get competing full time offers. This gives you leverage to negotiate your total compensation.",
            "Stick with Nike.",
            "How good was the offer you accepted?\n\nThe Google hiring process can be really long. Just because you pass the final rounds doesn't mean you'll get placed anytime soon.",
            "I would hang onto Nike and interview with Google and see what happens.",
            "This may be unpopular, but go with Nike. I do not trust any big tech company (or really any tech company’s) decision making at the moment.",
            "just curious when did you apply? I thought google had a hiring freeze",
            "Always always accept all offers and renege later.",
            "How long after your OA did you hear back about moving to final rounds?",
            "Yes interview - \n\nEvery hire has a 90 day probation period. \n\nI feel it should be the same for you. Test out the new company while interviewing",
            "Backdated first paycheck included?",
            "Tell your Google recruiter that you accepted an offer and if they want you they need to move quickly. Recruiter should be happy to expedite.",
            "If you pass Google's final round you'll enter months of \"team matching\" limbo that might end with not getting a real offer at all. Go ahead and go through the process, but don't count on it panning out.",
            "Google is a lot of peoples dream job that they'll never achieve.  You gotta at least try for it, its a huge opportunity",
            "Yes interview!!!",
            "got googled",
            "Took me 8 months",
            "How can this even be a question?",
            "What level of google is this for?",
            "What's the role you're interviewing for?",
            "Google could implement a hiring freeze/layoffs any week now... the rest of the tech companies are doing it.",
            "Bird in hand is my philosophy."
        ]
    },
    {
        "post_id": "xzwae1",
        "author": "New_Sundae_2231",
        "title": "Fuck",
        "url": "https://www.reddit.com/r/csMajors/comments/xzwae1/fuck/",
        "score": 457,
        "num_comments": 69,
        "created_utc": 1665349464.0,
        "selftext": "Fuck",
        "permalink": "/r/csMajors/comments/xzwae1/fuck/",
        "comments": [
            "True.",
            "I graduated college not too long after the 2008 crash. Going on my 11th year of active duty.",
            "just do more leetcode",
            "Shit",
            "What's going on?",
            "While(True){ console.log(“fuck”) }",
            "Fuck me",
            "fuck;",
            "Relate.",
            "Jerome Powell",
            "How I feel about every college assignment rn",
            "Fuck",
            "< fuck />",
            "what happened",
            "Amazon",
            "Fuck",
            "Me. Please!!!",
            "True",
            "Fuck",
            "Fuckkkkkk AHhhhhhhhhhhhh meow woof woof",
            "//fuck();",
            "Shit",
            "relatable.",
            "fuck leetcode",
            "I'll take what CS majors don't get for 500 Alex",
            "yeah, who cant relate to that?",
            "Fuck",
            "Felt this",
            "If you insist 😏",
            "Mood",
            "Same 😭",
            "Tru tru",
            "Can you?",
            "Kim K",
            "fuck"
        ]
    }
]