[
    {
        "post_id": "kv3m4o",
        "author": "shmeebz",
        "title": "Hard to relax",
        "url": "https://www.reddit.com/r/csMajors/comments/kv3m4o/hard_to_relax/",
        "score": 455,
        "num_comments": 41,
        "created_utc": 1610375112.0,
        "selftext": "Anybody else find it really hard to just relax. I always feel like there is something I have to do and if there isn't something I have to do I feel like I should be studying some skill or stack or leetcoding or *something*. This is partly fine because it means I'm motivated but when it comes time to just chill I feel like I can't turn my brain off and just play a game or watch a movie without some nagging feeling that I am missing something or falling behind. I'm lucky enough to have an internship lined up finally and I expected this feeling to go away when that happened but it didn't.",
        "permalink": "/r/csMajors/comments/kv3m4o/hard_to_relax/",
        "comments": [
            "I feel exactly the same. Between school and internship prep I really exhausted myself and feel like I trained my brain to not relax. What helped me is every time i notice I have that feeling, just remind yourself that you don’t NEED to be productive 24/7. In fact, it’s counterproductive. Don’t be ashamed of taking breaks and living your life- life’s more than just productivity.",
            "Yeah it tends to happen both as a student and when you are working from home. For a while try setting up a space even a small space where no school work or anything is allowed. Only relaxing and doing something enjoyable. Set up time to do something in that \"relaxing space\" for 30 mins or an hour a day, whatever doesn't matter much\n\nAt first it will be difficult but keep at it and you will eventually train your brain to slow down and allow you to relax and play games or whatever it is you want to do. Eventually you might not need that dedicated space anymore and will be able to calm your mind down easier wherever you are.",
            "As a 26 year old freshman who has only taken two CS courses so far, I feel this all the time. I feel so far behind everyone else and there isn't a clear path to catch up.",
            "Agreed!!!!!",
            "Guided mindfulness meditation has really helped me clear my mind!",
            "I graduated but I still have the tendency to pick up everything, every single thing. Disruptive to prioritization",
            "I thought this was just me. I always have felt like I needed to be learning something but I feel like that’s the nature of our background since we are wired to self learn as that’s what programmming consists of. I will put my laptop away and watch a sometbing but then I’ll be reading medium articles related to that thing I was thinking about learning lol it’s hard to get it out of my head. I think it comes from a internal interest though more than anything.",
            "weed is a life saver for bed time",
            "Yes this has been me. Between school work or working on my personal project and soon starting to learn DS&A. It’s definitely a great thing that I’m not lazy and actually motivated but I don’t want to get burnt out. I’ve been trying to spend time with this girl I’ve been talking but I also need to find other things to do. I like going outside and exploring but we’re currently in a deep winter freeze and there’s very little indoor things to do bc of the virus. I might start watching Netflix or Hulu to relax my brain a bit.",
            "I’ve also always felt this. Tbh for me this isint the result of “capitalism” or a productivity obsession. For me and for a lot of other people it’s just our personalities. Like I can’t not be doing something, and staying still (like watching Netflix or sleeping too much) it drives me insane. So honestly, if that’s just who you are and what your  personality is don’t worry about it. For example when I force myself to relax I am not relaxing. I let it come to me more naturally. So you need to figure out  if this need to be productive stems from your personality or internal insecurities.",
            "[deleted]",
            "how is this first post I see and its literally what I am going through...",
            "It’s easier to relax when you convince yourself it is actually making you more productive. If I don’t get good sleep I loose out on productivity the next day. I usually don’t get good sleep if I don’t relax for a few hours before bed. I tell myself it is important to relax for 3 hours before bed from 9-12pm and that my one job is to enjoy whatever I am doing during that time. There is no fomo because I have already decided it is what is in my best interest to be productive for the next day",
            "I have felt like this for a while (past 5yrs) and I am still getting used to it. This line of work requires you to get comfortable with being uncomfortable all the time. There will always be stuff to learn and always be someone ahead of you. Take things at your own pace and celebrate the small wins. If you pause and look back I am sure you will realize you have accomplished a lot more than others. If you can't enjoy life now, you won't be able to enjoy life when you do manage to get ahead of others. Life shouldn't only be about getting a job at some high tech company - there's more to it.",
            "I totally feel this! I have this idea in my head that once I land an offer I want, I’ll be free. But I think as driven people we want to keep doing things and improving. I found if I told myself that X time before bed, I’ll put my laptop away and read. Set a time where you want to workout during the day, or work on a new hobby! There’s other ways to “feel productive” even if you’re not doing career related tasks, I think scheduling grind time and chill time can help! Also try to reflect on your day and give yourself positive affirmations about whatever you did or do a meditation, it has helped me to be less critical of myself!",
            "Make yourself a schedule. Plan out when you want to be doing these things vs not, and when you’re not, you’ll know that it’s planned out and won’t have to worry about what your missing",
            "if that's what you enjoy then you shouldn't care about relaxing that much i guess?\nI meant,the work satisfaction high?  you feel motivated doing these stuff? Enjoy taking pride in technicalities and stuff?\nThen you're a happy guy.Just make some prioritization to do other stuff like family and rest etc.\nBut if you are not enjoying don't you think you'll burn out?",
            "I have figured it out. Take a day off and most importantly, disassociate yourself from the field for that day. If you are planning to relax, temporarily forget the pursuit.\n\nI told myself for today: \"I am not a CS student. I don't want to be a software engineer. I don't even know what that is. I am just chillin.\"\n\nThen the following day, you can just turn your programmer brain on again",
            "One tip I would give is to write down the stuff you need to do. That gets it out of your subconscious so you're not always thinking about it. It's like making a physical copy of your worries and looking at it every time you wanna see what you have to do.",
            "I’ve been feeling this way HARD lately. It’s like anytime I’m doing anything other than homework or LC I feel guilty.",
            "I had the same feeling after 7 months of constant grind, and even after i got FAANG offers it was really hard for me to relax and appreciate the moment, i had a constant anxiety that i forget to do something.\n\nGoing to short trips out of the city just to enjoy the nature or hike really helped. I tried to disable all phone notifications and not allow them to disturb my while I am out of town.",
            "LOl sorry man you must be so confused by this message it looks like I accidentally hacked into your account and wrote exactly how I was feeling.",
            "I have actually made it a point to start reading now for enjoyment. I feel like I read so much technical jargon or documentation when learning that I forget about reading for relief and enjoyment. \n\nI just started the lord of the rings as my book of choice to decompress with when I am feeling overwhelmed. I find it helps take my mind off technical stuff just enough for me to feel refreshed after reading for about 20-30 minutes.",
            "I’m dreading the rest of my time in college because of this. I feel like to get a decent job you need to be in the know of everything, be working on personal projects, network, learning something new, fine tuning your resume or hustling for an internship. I know next to nothing about coding and I just downloaded Python. I feel like I’m gonna miss out if I’m not constantly moving to do something productive.",
            "Me for the last 5 years",
            "That's capitalism for you babyyy! The constant need to \"appear\" productive.",
            "Exercise, call a friend, or write a book. Turn that anxiety into energy!",
            "Same.",
            "Same as it condition as of you. But additionally, I feel and gone into deptression as I had nothing to do OR I just fucked up my brain after seeing success of people of my age on social media",
            "Dudeerr I can relate which isn't bad. The problem starts when I tell you I just graduated high school and I'm yet to start university. I just can't not think about it.",
            "Enjoying life is part of a productive life"
        ]
    },
    {
        "post_id": "1bnahmz",
        "author": "litbizwiz",
        "title": "We are so back!",
        "url": "https://i.redd.it/u8fjgikelgqc1.jpeg",
        "score": 455,
        "num_comments": 64,
        "created_utc": 1711363190.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1bnahmz/we_are_so_back/",
        "comments": [
            "Why my name man",
            "It's not Devin that is scary, it's how fast it was built and the fact that there are multiple companies doing it, meaning it is very possible to do",
            "context?",
            "Who tf is Devin?",
            "Is this why recruiters are messaging me again?",
            "Till GPT 7 or Gemini 3, it's just hype ?",
            "It doesn’t matter it’s the whole cultural shift and automation is downright still a threat to everyone on this thread. Prepare, adapt, survive.",
            "Common, you’re grasping at straws:)\nIt’s a matter of short few years until devs will be redundant. I’m amazed every time of GPT can write tests for my code , productivity is up to the roof! You do understand it takes up a place of a junior automation engineer and what not ? It’s the bottom of the food chain. AI already takes up the place of a junior dev in many cases. Soon enough it will take the seniors place as well…",
            "I am really sorry but what does this graph mean?",
            "Devin?",
            "Deno who?  TypeScript Wha?  No, don’t know any Devin, sorry.",
            "I search “devin” twice yesterday for Devin Booker, my bad",
            "None of it is still going to replace Devs, just yet. I’m finishing up a full stack bootcamp and stuck on a react issue. Tried using BlackBox.ai to help bridge the gap and it just broke my code over and over and over. Sometimes even only producing half scripts, giving crazy syntax errors and overall garbage. It looks cool/scary in a demo video but overall all its still trash.",
            "it will rise once they update it again..."
        ]
    },
    {
        "post_id": "19520qh",
        "author": "PranosaurSA",
        "title": "Got rejected from an 18$ / hr job. I decided today is the last day I’ll apply to another CS job",
        "url": "https://www.reddit.com/r/csMajors/comments/19520qh/got_rejected_from_an_18_hr_job_i_decided_today_is/",
        "score": 454,
        "num_comments": 90,
        "created_utc": 1705084092.0,
        "selftext": "This is in California where the minimum wage is about ~16-17. \n\nI have one last interview today for DevSecOps role  and it’s the last one I’ll do. It’s one of the few interviews I’ve landed \n\nIt wasn’t a software job but a job as a technician for making some fixes on computers to resale \n\nThe interview went well I thought, although they wanted Cisco experience I told them I had experience playing around on Cisco routers in GNS3 and Quagga for classes. Most of my fixing computer experience is dead simple stuff outside Linux systems admin stuff like dealing with pad/NSS/sssd/ldap/Kerberos/Certs for dealing with service authentication. \n\nI am going to try to get a teaching credential although I have no idea what I’m doing . Starting salary is a lot higher than most jobs I see in Tech outside of super competitive outside of companies and jobs wanting 3-5+ years experience",
        "permalink": "/r/csMajors/comments/19520qh/got_rejected_from_an_18_hr_job_i_decided_today_is/",
        "comments": [
            "Post anon resume.\n\nEdit:  According to your post 3months ago you don't have a CS or CE degree but have a degree in Aerospace and Mechanical engineering.  Why are you applying to CS jobs then?",
            "Stop being corny. I’ve gotten rejected from hundreds of jobs paying 1/4 to 1/2 of the job i landed for the summer",
            "Sincerely, have you tried learning how to code? I don't have a cs degree but that didn't stop me. I'm seeing a lot of enterprise sysadmin keywords here. Maybe familiarize with a Single cloud provider like Azure and learn Powershell, or GCS and Bash.\n\nIn any case, figure out what skills you possess, find jobs that fit that description. It's fine to learn on the job but not during the interview.",
            "Just a student but I think u should work in the feild ur degrees in and then just apply to internships on the side so u can atleast feed urself",
            "This is a bit dramatic…",
            "Wish you luck 🫡",
            "At this point, use your intelligence and work for the other side. The state cant feed us anymore",
            "You think teachers get paid more than most tech jobs? This is the highlight of your post.",
            "don’t quit the person that got it over u defo had a connection\n\nif u have the skills you will land smtn",
            "Teaching is always an option",
            "[deleted]",
            "Teaching cert is super easy to get in AZ with an engineering undergrad. Plus they pay $50k over 10 months which kinda feels like $60k if you think about it LOl",
            "corny",
            "quitting is stupid.",
            "Stop. It’s possible to get cs jobs, all my fellow friends are now employed and the companies we all work continuously hire. So no, it’s not the field.",
            "I left teaching to get into tech. Not gonna find many teachers who would recommend starting down that path unless.",
            "This is super dramatic. Even with a degree you often won’t get anywhere without experience and/or certs. You have to be willing to start at the bottom and make your way up. I could recite best practices from a textbook but do I actually have experience implementing that in production, no. Best thing to up your own experience would be to build a home lab. Go see r/homelab.",
            "You do understand it's the ecomony right now with all the layoffs in tech and adjacent industries due to over hiring. Still not as bad 2008/9 tech crash. \nThe 18$ job most likely felt you'd jump ship at the first chance you get. \nI don't see that you've posted your resume for review on r/engineeringresumes yet. Head over and read the wiki and follow it to a T. Post both your cs focused resume and your me/aero resumes. Ping and I'd be happy to review your resumes. \nUnless you really want to teach I don't recommend this route. At the community college level would be the easiest. Not all require masters to teach especially in the Continuing Ed dept. \nTeaching is not easy or for the faint of heart. 3 of classmates with industry experience but didn't have a degree were hired to teach current tech after they finished their associates while working on their bachelors. It's a lot of work creating lesson plans, managing students, finding another way to explain a concept to students that aren't having that light bulb momemt. \n\nConsider private tutoring for SAT prep and all the Me and CS courses. There is definitely money to be made there.\n\nJust know you are not alone. There are folks that have put in well over 600 applications and are still grinding to get a job.\n\nAlso, head over to 100devs, join the discord. Do the 100 hour project. Should take you less than a month. Review your portfolio.",
            "I think you should stop being picky with the pay and keep going. There are a lot of more competitive people with lower expectations that you that can get the job done well so you have to keep trying"
        ]
    },
    {
        "post_id": "r3u1i9",
        "author": "None",
        "title": "Someone just cracked an almost $600K New Grad Offer at HRT",
        "url": "https://www.reddit.com/r/csMajors/comments/r3u1i9/someone_just_cracked_an_almost_600k_new_grad/",
        "score": 455,
        "num_comments": 142,
        "created_utc": 1638068102.0,
        "selftext": "Saw this posting and it completely blew away my mind: [https://www.levels.fyi/offer.html?id=fa8c7cac-bd58-5d0b-8ae7-343eae904567](https://www.levels.fyi/offer.html?id=fa8c7cac-bd58-5d0b-8ae7-343eae904567)  \n\n\nSomeone got a $595,000 offer, as a new grad Algo Dev at HRT. This has to be the highest new grad HFT offer I have seen, beats even top Citadel new grad offers by a very large margin.  \n\n\nThoughts? What sort of candidate gets such an insane new grad offer since the folks who get those 450K Citadel offers are very exceptional to begin with?",
        "permalink": "/r/csMajors/comments/r3u1i9/someone_just_cracked_an_almost_600k_new_grad/",
        "comments": [
            "[deleted]",
            "work there for 3 years you’ll be a millionaire lol",
            "[deleted]",
            "Whoever this person is definitely is on this sub. Maybe it’s OP subtly flexing",
            "how much of a fucking genius do you have to be to get these jobs. it took me weeks to even wrap my head around quicksort 😭",
            "Fuck i cant even invert a binary tree…",
            "Probably the kind of guy who won the national mathematics championship in China. I've heard some companies poach those winners really hard.",
            "Damn. I can only imagine how tough the interview process must be. I’m only a sophomore in CS so I wouldn’t know but still.",
            "How reliable is [levels.fyi](https://levels.fyi)? Can people lie about their compensations?",
            "160 IQ individual",
            "Harvard/MIT math + CS",
            "I’d bet T5 school and Top 3% of graduating class, that or daddy is an upper exec 😏",
            "[deleted]",
            "Ain’t no fucking way bruh",
            "I cant even reverse a sentence and append a period",
            "Now I feel like shit with my $50+ per hour internship 😂",
            "Do you have to get your papers published at IEEE and go to an Ivy league to get a job like this ? \n\nVery impressive 👍 I would literally die if I get money of that volume ...",
            "I just stumbled on this sub, in my eu country I just got offered 20 times less than that for a fulltime newgrad position. You guys are living in a parallel universe lol.",
            "I want to cope just to feel better about myself",
            "Are these data points verified?",
            "I suppose this fellow is on the Knuth/Dijkstra/Ritchie/Neumann caliber of brilliance.  *Shrugs*\n\nOh well, I will go back to implementing some trivial linked list. *Sigh*",
            "Noob question here. What is HRT?",
            "\"...at HRT\"\nAh yes, the widely known abbreviation, HRT.",
            "Nepotism?\n\nDamn, downvoted for asking a legit question",
            "remind me! 3 weeks",
            "[deleted]",
            "All I can think if I went here is this\n\nhttps://youtu.be/GkM6zTqG5SQ"
        ]
    },
    {
        "post_id": "1c9pct6",
        "author": "None",
        "title": "Anybody have been on a date this year?",
        "url": "https://www.reddit.com/r/csMajors/comments/1c9pct6/anybody_have_been_on_a_date_this_year/",
        "score": 453,
        "num_comments": 48,
        "created_utc": 1713725172.0,
        "selftext": "Finally got a date with a girl after 200+ applications, booked in on Wednesday.\n\nWhat kind of questions do they ask? \n\nIs lying about your height a big deal?\n\n",
        "permalink": "/r/csMajors/comments/1c9pct6/anybody_have_been_on_a_date_this_year/",
        "comments": [
            "Username checks out",
            "Tell me about your hobbies in O(1) time.",
            "Don’t tell her you studying CS, then she’ll know you’ll be working at McDonald’s after graduation",
            "tell her your favourite coding language and assert dominance in the very first interview",
            "Make sure you have your income tax return ready.",
            "Swiping for 4 years and no date and still a jobless virgin, wish me luck 🙏",
            "She will only ask for LC hard",
            "Where is your diagram? Did you get it by referral or cold application?",
            "Lying about your height is fine, but lying about how long it took you to do a Leetcode medium is absolutely not acceptable. It is important for any healthy relationship to set realistic expectations and boundaries, even from the get go.",
            "share your resume pls",
            "Bro got a call back",
            "Not yet but it’s only April.",
            "Mostly behavioral, you’ll be fine",
            "I'm laughing so much at this",
            "If she complains about your height tell her you were not lying just off by one.",
            "Haha is this subreddit gone toward dating and stuff .",
            "Haven’t gotten any OAs for this yet, where do I apply?",
            "Remember to grind leetcode just in case.",
            "Welcome to dating wealthy families, they just want the best for their kid, it's why I walked away and dated poor, they look at me as the greatest thing to come in their daughters lives knowing that I can fully support her",
            "Is this code for a job interview? If so, no...And of course, no ass either...You saw that desperate plea yesterday for more ass. Dude was totally in the wrong field/major. No jobs, no ass.",
            "When you’re gonna make good money the options will be endless",
            "You really hit post on this after typing it out",
            "Not when the job market is like this",
            "It is a big deal to some",
            "TC?",
            "Had a date today. Was asked to design a database of a food delivery app.",
            "Bro's promise<date> returned a response.",
            "How does one prepare for this?",
            "Y’all are gonna be shocked… I have a bf! Who is also an engineer."
        ]
    },
    {
        "post_id": "14xo1yc",
        "author": "2001ThrowawayM",
        "title": "Citadel received more than 69,000 applications for their 2023 internship program, a more than 65% increase year-over-year, per Bloomberg.",
        "url": "https://www.reddit.com/r/csMajors/comments/14xo1yc/citadel_received_more_than_69000_applications_for/",
        "score": 460,
        "num_comments": 140,
        "created_utc": 1689167067.0,
        "selftext": "Their is a pay wall for the article, but basically, good luck getting an internship with Citadel LOL.\n\nhttps://www.bloomberg.com/news/articles/2023-06-27/wall-street-intern-pay-finance-wages-surge-with-citadel-at-120-an-hour",
        "permalink": "/r/csMajors/comments/14xo1yc/citadel_received_more_than_69000_applications_for/",
        "comments": [
            "This is why I think is hilarious when people come on this sub and say something like “I passed all test cases except one do I still have a chance?” ……you never did",
            "Oh no! Their acceptance rate dropped from 0.5% to 0.3%!!!\n\nIn reality, I doubt this makes a huge difference. The vast majority of applications were auto trashed, so even though there's a 65% increase, the increase in qualified candidates is probably nothing as huge",
            "Story time? lol\n\nI went through the interview loop with Citadel last year. At the end, a recruiter reached out and matched me with a team, but that team uses Python and Go. My specialty is C++ and I'd rather do some high performance stuff, so I asked them if they could match me with a C++ team instead. The recruiter said they'll see what they can do, but instead I got a rejection letter the next day.\n\n/cue months of beating myself up for turning down that opportunity.",
            "Am I the only one that feels like I'd be stressed as fuck even if I got the internship? lol",
            "It was always good luck getting an internship with Citadel lol. Idk why people are acting like this is a gotcha moment",
            "Citadels recruiting strategy is pretty weird. On their website they literally brag about the number of international science Olympiad medalists they have working for them",
            "Isn't it all the same 100,000 people applying for all of these internships?",
            "Makes sense. Some parents groom their kids to be in these sorts of firms since a very young age - think all the math competitions, coding competitions, tutoring, etc. The list goes on. If you haven't been preparing for these kinds of roles since high school and your parents haven't pushed you into it, good luck competing with the kids that have.",
            "Are citadel CS internships highly sought after? This is a finance company",
            "That's like if every single person who graduated with a CS degree in 2009 applied",
            "[deleted]",
            "I mean yeah they pay $120 an hour",
            "Nice",
            "U g h",
            "Everything is a rat race",
            "It's definitely competitive, but it's definitely possible to at least get an interview.\n\nI go to an okay T50 school and only got a \\~90-95% on the OA, and still got a round 1 interview. Obviously, passing all 3 rounds of interviews is a completely different story, but at least it's possible to get a chance."
        ]
    },
    {
        "post_id": "z4guxr",
        "author": "questi0nmark2",
        "title": "LPT from a greybeard to CS students: dump the toxic benchmark of Big Name recruitment.",
        "url": "https://www.reddit.com/r/csMajors/comments/z4guxr/lpt_from_a_greybeard_to_cs_students_dump_the/",
        "score": 456,
        "num_comments": 74,
        "created_utc": 1669392070.0,
        "selftext": "I just read [this](https://www.reddit.com/r/csMajors/comments/z3xshn/new_grad_2023_recruiting_summary). \n\nThe post and comments were divided between humblebragging and despondent resentment over a redditor's tale of humble victory in interviewing for the biggest names in Big Tech. At one point, as the aggro grew, OP dissed someone for their tier 2, top 0.1% job, compared to his own multiple tier 1, top 0.01% offers.\n\nYawn.\n\nExcept: it looks like so many of you are building your identities, your sense of purpose and definitions of career success, by whether you can pass a horrible and narrow selection process to land a job in a massive corporation and make at least 6 figures, or be condemned to Looserland.\n\nThis is depressing to watch, must be even more depressing to live! \n\nYou have, and are honing, a fantastically powerful set of skills. You get to build the very fabric of our civilisation, for good and for ill. You get more chances at good jobs (more on that next), than the vast, vast majority of humanity, even in rich countries. \n\nBut you choose to define a \"good job\" as a zero sum game to get into a tiny number of companies which may in fact be a terrible, terrible fit for you personally. Or a great fit, but not as good as another. Or a superb, exceptional fit: but not the only one available. \n\nPause. Take your eye off the telescope. Look around. There are sooooo many cool companies out there. Some are big,  some are tiny. Some are eventually going to be bought by Big Tech. Some will never even have a conversation with anyone from Big Tech. But they can offer you a chance for growth, for impact, for friendship, for quality of life, for reinvention, for diversity. These things matter a lot more than brand size!\n\nSure, money matters, it's nice and all. And yes, 99.9% of companies will pay you less than a top hedge fund. But have you considered the opportunity cost of that pay rise? Who will you NOT get to hang out with, learn from, as a result of spending most of your life in that space? What kind of friendships, learnings, insights might await you in less well paying but more personally aligned work? Sure you could do with 6 figures at 22. But do you need 6 figures? Will 6 figures be even healthy for you? \n\nI have worked in fintech. With really lovely people. In edutech. In health tech. In civic tech. I have consulted for Big Tech, and for grassroots communities. And I tell you: the wide, wide world outside big tech is messy, uneven, but so rich, so interesting, so varied. \n\nLiterally no one cares past high school,  whether you're with the popular kids. It's a toxic motivation. The wrong reason to feel good about yourself. The wrong reason to feel bad about yourself.\n\nInstead, my advice is: decide what kind of human being you want to be; what kind of genuine personal relationships you want to have; what kind of impact you want to have on the world. \n\nMeasure yourself against THAT benchmark. And I guarantee, whether you get a Big Name interview and job or not, will look like a MUCH smaller problem. There will be plenty of fantastic software engineering jobs that pay you decently,  and allow you to accomplish the benchmark I suggest, often in richer, better ways than a job in Big Tech. Even if no one on Reddit has heard of that company. Even if no one outside Mombaza, or Philly, or Mérida or Geneva or Hong Kong or Cairo has.\n\nBe your best self. Be productive. Be happy. Be decent. Be financially secure. Be excited. Be useful. Be a good human. \n\nI promise you that building your self esteem along the above criteria will take you further, and if you are determined, resilient and creative, will give you professional success along the way, and even recognition. Whether that involves working in the richest 100 companies, or in the 100 million awesome companies you haven't heard of yet.",
        "permalink": "/r/csMajors/comments/z4guxr/lpt_from_a_greybeard_to_cs_students_dump_the/",
        "comments": [
            "Well, that post you referenced, it was a general consensus that the guy was a pompous ass. Someone even pointed out that Jane Street notoriously cares about personality, and he didn’t get in with perfect technicals, should say enough lol.",
            "I think a big reason for this is that CS has drawn in a lot of high achieving students that have been chasing prestige all their lives because of the money. Asian households especially can put a lot of external pressure on their children since prestige is valued a lot more in their cultures. So now in CS you get a lot more people that would’ve been chasing a big 4 consulting job for the prestige and students who would’ve became doctors/lawyers otherwise; very different from having only students that have grown up tinkering with computers and technology like past generations of CS students.",
            "Literally why I want to intern at a small start medical startup that is video game adjacent. Satisfying projects that help people but still video games. Their latest project is an AR game to be used to get patients up and moving for physical therapy as they have fun going around scanning little markers, having cute characters pop up and playing mini games with them. There are so many ways you can get involved in your fave industry, eyes on the prize doesn't necessarily mean big tech, small tech is just as valid.",
            "I'm a 35 years old woman in my junior year in college. I worked before in teaching sciences in my home country. One thing that I see all the time is the need of validation of my classmates. It feels like a show off all the time: cars, grades, internships, classes, etc. \n\nWhen I met my career advisor she asked me what I was looking for in a job. I told her: stability, good benefits, and ability to keep learning. She was surprised and happy that I wasn't pursuing a big tech company. It's not everybody's cup of tea. I suppose, as older as you get, your priorities change. Your experiences help to fix your expectations and also, to define who you are. \n\nWe, as individuals, are taught to define who we are by what we do. We introduce ourselves  like: \"hi, I'm a doctor\" instead of \"hi, I work in healthcare.\" \nMany kids are obsessed over a job because it is who they are, or maybe they believe that's who they are. Eventually and hopefully, one discovers that oneself is more than a occupation, one is more than a title, one is more than a label. \n\nAnyway, thanks for the post. I saved it to reread when I need a push to keep going. Have a great weekend!",
            "I get where you're coming from but there's nothing wrong with chasing high salaries if it'll genuinely make you happy. Some people want to take care of their family, finance hobbies, or retire early.",
            "To be fair tho, all else equal, I'll take the extra 100k every time, esp at the start of my career",
            "Yea, it’s super obnoxious, and this is partly why I don’t like working with juniors/new grads: the perspective is just so whack. Not everyone can do it, and that’s okay, but don’t pretend like “hard work” alone is doing the heavy lifting when your credential is!\n\nFor the rest of us, people like me who career switched and clawed their way up by getting a CS masters, or CS majors from other schools, if you put the work in well all end up at the same places. It might take a few years, but the tech community of people capable of solving difficulty interview problems is not actually that big.\n\nOP from that post is about to learn a hard lesson, and that’s that success on the job will depend on how well they work with others. Go around, piss people off, your not going to make it very far…",
            "I hate the attitude which you're accurately describing. I see it on another large CS-related sub. The people who are like this have believed they're special and smart their whole lives. They have nothing else to identify with. They might have been made fun of in school. They probably didn't have many dates with their preferred sex. All they have in life to feel good about is their career success. They have, they are, and they will suffer needlessly. They have, they are, and they will miss many moments of joy in their lives.\n\nMoney from Google and money from a local tech company is the same. Spends the same. Saves the same. Depreciates the same.\n\nAlso. Doesn't matter if you're salaried at $250k/year or $60k/year. You're unfortunately still a wage cuck. You are someone else's \"human resource\" to be managed and profited from. You are working class just like restaurant staff, janitors, farmhands, etc. You're not better than anyone else.\n\nLove your post. Just wanted add something.",
            "Can I ask you, OP: any advice for a 30 year old cs junior in college on balancing the thoughtful search for a good personal fit, and the fiery inner-race to provide for my young family? (Have an almost 1 year old). I feel like I could use a greybeard’s perspective on the feeling of competing with all of these talented younger people who don’t have families to provide for.",
            "Thank you for this times a million billion kajillion.",
            "Good post, but to play devil's advocate, it's much easier to avoid building your identity around career success and money when you already have them, as I am assuming you do.",
            "This is a good take on this sub. It can be toxic from posts like the one linked. It’s funny how everyone chases after the HFT high paying jobs but ultimately are “wage slaves”. If you really wanted to produce income you’d be thinking from the innovation point of view like Bezos, Jobs, Gates, Zuckerberg like at a startup, not big tech or a HFT.",
            "This sub has an obsession with “faang”, but “faang” as an acronym has largely fallen apart.  The problem is, since it’s so easy to get into faang now thanks to amazon, people want to cling to the old exclusive days to validate themselves while ignoring the truth that they’re not so special anymore.\n\nPeople are starting to see through it now but I think there’s still some ways to go.",
            "Thank you for your hard earned wisdom u/questi0nmark2. It is truly impressive we got lesson if ur lifetime for a few seconds. Speaking of which, how can someone interested in working in varied tech like health tech edtech grassroot communities etc can do this? I would love to know that. Thanks, u/spacejunkievirus.",
            "[deleted]",
            "Thank you. Been saying the same thing. It’s like the toxic benchmark of “top 10 schools”.",
            "Thanks for this :) That post was probably one of the most contentious ones I’ve seen in a while on this sub",
            "Fwiw I've work for a couple sought-after companies (dunno why I lurk on this sub...) and my main thoughts are:\n1. These places are dysfunctional, and\n2. It's so lame to work at a big company, I need to switch to a small company where my co-workers are interesting human beings and I actually have agency\n\n\nSeriously, the rad people don't stick around at these places. They know better than to let their souls get crushed.",
            "[deleted]",
            "[deleted]",
            "So much virtue signaling...",
            "Thanks OP\n\nI'm interested, what did you do in health tech?",
            "I volunteer and mentor with a lot of CS majors and wholeheartedly agree. Hyper focused on the top companies and looking for a quick way to get in. I started off making 40k out of college and worked in a variety of industries building my breadth and depth of experience. This will sustain you. Insane amount of book knowledge with no practical skills makes for a bad coworker."
        ]
    },
    {
        "post_id": "t0mcvk",
        "author": "1_b3",
        "title": "Getting into FAANG to meet crush",
        "url": "https://www.reddit.com/r/csMajors/comments/t0mcvk/getting_into_faang_to_meet_crush/",
        "score": 449,
        "num_comments": 78,
        "created_utc": 1645739268.0,
        "selftext": "So my crush works at FAANG and I work at a different company. We went to the same school but never got to meet but I had a huge crush on her. She is not a social media person so never found her online anywhere. 5 years went by and I'd forgotten about her but recently found her LinkedIn profile and man, looking at her picture brought back all the memories and it so happens that she works at FAANG.\n\nThis is my motivation now to get into FAANG. \n\nWhen will you find yours? :P\n\nNot sure if she's taken but worth a shot.\n\nWish me luck!",
        "permalink": "/r/csMajors/comments/t0mcvk/getting_into_faang_to_meet_crush/",
        "comments": [
            "You should DM her and ask for a referral",
            "Fixating on one person is a bad idea, mostly",
            "Well, I guess different things drive different people. \n\nLMAO",
            "Crush? Girlfriend? I am just FAANG-sexual bro.",
            "[deleted]",
            "Huh ... idk if this is cute or creepy",
            "[deleted]",
            "I’m trying to get into faang to buy an ///M4 lol",
            "kinda creepy if you’re this into her and haven’t even met her yet. remember to think with your head not with your dick",
            "Getting faang and your dick wet niiiice",
            "stupidest thing i have ever heard",
            "I hope you stub your toe!\n\n&#x200B;\n\nI am only jealous by the fact you are aiming for something. I feel like doing nothing but that is torture as well. Fuck.\n\nAnyways, headup to not tell her about this post or she will be fuckin creeped. And also stop it. Its creepy.",
            "troll. no way anyone past junior high actually thinks this way",
            "Don’t be sad if she says no. There are plenty of them out there.",
            "Yeah well don’t end up being a workplace stalker who wrecks havoc at work like you see in the news. Creepy.",
            "Are you trolling or what? This is Disney movie material, it doesn’t work irl. Get over it.",
            "I once knew a girl who got into Harvard law school to chase her ex who was engaged to a Vanderbilt. He dissed her the whole time. But she got a prestigious job out of it, and everything worked out for her in the end. Godspeed on your quest.",
            "Been watching too many movies son",
            "Lol, imagine going through all the interviews - only to find out she already has a FAANG boyfriend.",
            "Good for you! My cr was in faang and that was my motivation too! I applied to another company located in the same city. I got in! Now I ended up even further away from my cr because the company put me to a different branch.\n\nIt's still good! Just want to say thank you cr.",
            "You are creepy af",
            "I enrolled into a computer engıneering major to chase some girl.\n\nThere isnt a single day I do not regret this.\n\nPlease think well before making lifechanging decisions chasing after some ppl u dont know.",
            "New to the sub. I’ve been seeing these shitposts a lot on here. Are these all made up jokes or are some for real??",
            "Good luck. I hope you two end up together and are very happy ❤️",
            "> never got to meet but I had a huge crush on her.\n\nOh I'm sure this will end well...",
            "10/10. Quality shitpost.",
            "You need to find a cure for your oneitis. Plenty of   Fish (pun?) in the sea.",
            "• Ruins self to get into FAANG to ask out crush\n• Gets rejeected",
            "Go for it. Worst case scenario you get rejected but still conserve the faang job.",
            "Imagine getting into FAANG after days of grueling hardwork to realise she's with someone and you get reminded that everyday you go to work....",
            "did u find out if she is single or not though ?",
            "You are obsessed with that girl. Better go into FAANG for bigger pay.",
            "Not a good idea man",
            "This is giving me Joe from You vibes.",
            "I wish someone liked me that much.",
            "Bro, wish u luck. She must be waiting for u. Best reason to get in faang ever",
            "y’all got no game huh 😂 just hit the dms brother 😂 if she’s interested you’ll know right away versus potentially wasting years of your life chasing fantasy girl through FAANG"
        ]
    },
    {
        "post_id": "n213m3",
        "author": "thindingaling",
        "title": "Kinda crazy to think Google started out as a side-project of some PhD students",
        "url": "https://www.reddit.com/r/csMajors/comments/n213m3/kinda_crazy_to_think_google_started_out_as_a/",
        "score": 454,
        "num_comments": 39,
        "created_utc": 1619809921.0,
        "selftext": "can't even remotely compare my own lmao",
        "permalink": "/r/csMajors/comments/n213m3/kinda_crazy_to_think_google_started_out_as_a/",
        "comments": [
            "[deleted]",
            "It was a side project? I thought it was the focus of their PhD haha.",
            "Really hoping the Todo list app I copied from a YouTube tutorial makes me a millionaire",
            "[deleted]",
            "Yep it was literally just a bunch of hard disks in a Lego rack. Not even joking. It got banned from use on Stanford because it its excessive network usage lol. It’s on display at Stanford somewhere I guess.",
            "In fairness I think Sergey Brin was always kinda of brilliant. Like the idea of the search engine wasn't new but he basically built Google's algorithm from scratch based on his own hunches about what a good engine would be like and he grew it over years. It's weird how do much praise is heaped onto Mark Zuckerberg for creating what was essentially a basic CRUD site (in PHP) at the right time for it to blow up but not onto sergey + Larry + several others for coming up with a really good idea, investing the time and effort into it (+ not falling for the abysmal yahoo acquisition offer) and growing it into something actually useful to society. Like google as a company is pretty much just as evil as they said they were never gonna be and the search engine requests far too much personal data for my liking but my god I can't deny it's the only engine that really gets me to what I need and that's praiseworthy.\n\nEdit:\n\nAlso just checked, the guys 47. That's over twice my age and my god what he's accomplished is amazing.",
            "Truly the American dream.",
            "It wasn't a side project, it was literally part of their PhD research and they were PhD students at **Stanford**.",
            "And DARPA lol",
            "[deleted]",
            "I’m pretty sure Spark, now Databricks, was also a PhD project at Berkeley.",
            "Jeff Dean gave a great talk about the early days of Google back at SOSP History day in 2015:\n\nhttps://www.youtube.com/watch?v=4_BeSgiNoQ0",
            "I think their background mattered a lot."
        ]
    },
    {
        "post_id": "1cl0tur",
        "author": "Tiny-Masterpiece-412",
        "title": "The future looks bleak for CS students in America",
        "url": "https://www.reddit.com/r/csMajors/comments/1cl0tur/the_future_looks_bleak_for_cs_students_in_america/",
        "score": 456,
        "num_comments": 98,
        "created_utc": 1714941446.0,
        "selftext": "Just scrolling past this subreddit would show the dire situation of CS students in the US. Just for some context, I go to a top 10 university for CS and still, a high percentage of undergrad students most of whom are domestic can't get any internship or jobs after graduation. It's even tougher for international students pursuing Masters. \n\nCompanies have realized they don't really need so many people and that's why so many layoffs and hiring freezes are there all over the place. With Artificial Intelligence getting better and better, it seems certain that a lot of developer jobs would get automated and the situation would get even more difficult in the future. Further, to cut costs, companies are outsourcing jobs to cheaper parts of the world. Why pay someone 100k in the US, when someone can do the same work with 20k in a third world country? \n\nI know people studying psychology and sociology easily find work after college. Sure, their salary is just 50k or so but still, it's better than being jobless like the average CS major. The people that I talk to in other parts of the world like Asia or Europe are not facing this problem. Their statistics are something like applying for 50 jobs, giving 5 interviews, getting 2 offers, and on the other hand, even domestic CS majors in the US have to apply to 500 or so jobs and some of them still can't get anything.",
        "permalink": "/r/csMajors/comments/1cl0tur/the_future_looks_bleak_for_cs_students_in_america/",
        "comments": [
            "I know that a lot of us are in the tech bubble but other professions still have it worse. Most of my friends in other majors except for Nursing are doing bad too it is just the state of the market. From what I am seeing, CS is starting to become like high finance where networking and the school you go to will matter more and I think the path of \"self-teaching\" and dumb bootcamps are over. \n\nOne thing I am concerned about is that we don't have any legislation to limit the amount of offshoring and I can't believe that we as a country haven’t learned from what happened in the rust belt and the offshoring of manufacturing jobs. I highly doubt it will be as bad though but offshoring isn't a purely cost saving measure anymore because a lot of the talent at these LCOL countries are pretty good rn.",
            "The mental gymnastics you have to go through to think it’s easier to get a job with a psych/sociology degree than a CS degree is exactly why you’ll struggle to get a job.",
            "I’m sorry but you’re insane if your doing a long term market forecast based on Reddit posts. Please go outside",
            "What kinda of T10 school has a high percentage of jobless cs grads. I’m pretty sure every single top school has something like 99% find employment or go to grad school.",
            "Big tech and fintech are most prone to layoffs. Quant/HFT have naturally high turnover rates.\n\nGo work for Geico, they’re offering around $110k + $10k sign on bonus for their new grad tech development program. It’s also fully remote. If you think that’s low, well then there’s the answer as to why t10 students aren’t Getting offers.\n\nAs for why US companies are paying big money for local vs. low money for foreign talent, well those are questions for CEOs and stakeholders. If you want to avoid getting laid off for that reason just get a gov/dod with security clearance… you’ll know for sure you won’t be replaced for someone overseas.\n\nAlso, statistics don't tell the whole story. There will always be students in any major that will end up underemployed. People studying psychology and sociology easily find work after college, but they don't find work relevant to what they wanted to do. I was a retail hiring manager for years before quitting in 2023, and a majority of applicants I had for part time sales had a BA in Psychology. Did we pay $50K? not even close, they got hired for the bottom of the ladder positions.\n\nA big chunk of CS grads are likely to end up underemployed as well, be it retail, food, sales, IT, you name it. It's not exclusive to CS.",
            "Edit: lmao this dude's post history is a ride. He's bombed 30 straight interviews, got a chance at FAANG and fumbled it. It's all bullshit. His failure is now the market turning against CS majors.\n\n> So I did onsite at a FAANG company today. Got 2 questions and was unable to solve both of them. The only thing I was able to come up with was brute force that was obvious. My brain froze in the middle of the interview and so did my computer in the middle of the interview. I prepared so much and it was my every dream to work for this company. This last interview totally destroyed me mentally.\n\n—\n\nAnyway, hate to break it to the sad doomer CS majors who can't interview their way out of a paper bag, but the self-taught, bootcampers, and no-name state school CS majors aren't going anywhere. If you're capable, you'll find a position. Being capable includes understanding how and where to apply, presenting yourself, and knowing your value-add. If you can't do this, the degree is meaningless because you can't problem-solve at the most basic level.\n\nOne of the best things about this field is its relative meritocracy and how unpretentious and deliverables-driven it is. All this handwringing and pleading to limit the labor supply is trying to kill that. The good thing is it won't.",
            ">I know people studying psychology and sociology easily find work after college.\n\nCool. Relatedly, I had a great grandmother who smoked 3 packs of cigarettes a day and lived to 95 years old.",
            "You need a serious reality check man, the market is the worst it’s ever been but I’m at a 70-80th ranked school and I know plenty of people with FAANG+ internships, some as sophomores. It’s not our school prestige that got them there it’s their work ethic, our school has NO prestige. The fact that that your think it’s easier to get a job with a psychology or sociology degree rn should immediately show you that you’ve spent way too much time doom scrolling through this subreddit",
            "You think getting a sociology or psy degree will make it easier to get a job? I dare you to switch. In the words of Samuel Jackson \"I dare you, I double dare you, m$#_!er!\".",
            "who says the avg cs major is jobless💀",
            "AI has nothing to do with these layoffs.",
            "I'm in south Africa and a few months ago a cyber security guy was talking in an interview abt how his earning 135k from here",
            "Lmao at the comments saying UMD isn't a top 10, it's still pretty damn fucking good of a school.\n\nThe people who go to these top schools are expecting and only applying out to the FAANGs and such of the world. I'm currently a PhD student at the same school I did my Masters and Undergrad at, all in Computer Science. The school's CS ranking has gotten worse over the years on USNews, but the perception of the school itself has gotten a lot stronger. CS ranking isn't even in the top like, 90. I had six job offers ready for post-Masters. But what I think helped was that I'm in a city with millions of people and that city likes hiring from the school now that it's popular.",
            "Yep, game over. Anyone in CS rn should drop out.",
            "There is a similar trend in Europe as well, although it's progressing slightly slower due to more employee-friendly environment and overall less volatile market. But yes, long-term prospects aren't great unless you are highly specialized or/and within top 5-10% of your respective field.",
            "Is that really true? According to statistics for 2022 from The Federal Reserve Bank of New York (See: [The Labor Market for Recent College Graduates](https://www.newyorkfed.org/research/college-labor-market#--:explore:outcomes-by-major)), *new-grads* in CS have a 4.3% unemployment rate with a 16.7% underemployment rate (defined as working in jobs which typically don't require a college degree). Using underemployment as a metric, Computer Science is the 6th best major. Seems like it's just the people who can't find jobs making these doom-and-gloom posts. Don't let it get to you. Reddit + online sampling bias is crazy. I agree that \"Just scrolling past this subreddit \\[shows a\\] dire situation of CS students in the US\" but... this is *extremely* biased. If you're strategic and patient you can most likely find an internship/job. To give a positive example, I'm a domestic student - switched from Mechanical Engineering to CS. With a reasonable amount of effort, I was able to get 3 internships within 1 year of switching. Only projects I had on my resume were game-dev stuff that I just followed tutorials to make. Maybe all 3 of those were just luck idk but hopefully it helps show that it's not all too bleak for domestic students.",
            "Then go for accounting. Accounting is heavily in demand.",
            "You’re not applying in the right places. Software engineers are needed in every company worth a salt and a CS degree is the easiest way to get an entry-level position as a software engineer.",
            "Wait so do you go to a T10 school or do you go to UMD?",
            "UMD is fuck no way t10. What are you smoking?",
            "I've started to not mind these posts so much; I'm loving CS and have no worries about my future career. Perhaps this fear mongering will burn off all the extra fat this industry gained in the past few years - it is almost Summer after all, time to slim down.",
            "Stop fear-mongering.\n\nCS will be alive, just the power dynamics will probably shift.  From “get any decent CS degree and swim in offers from top companies” to “get degree from actually top tier school and you have pretty good chance getting decent job”.",
            "AI is no where close to replacing humans in any capacity. The FAANG literally hire talent to stop the competition from having a leg up on them when interest rates were low. Now they need to trim and that’s the outcome. \n\nFurthermore, if a graduate CS major can’t find a job it’s because they have expectations of working on a Google like campus with Google like perks which is an outline and not a standard.",
            "Sociology is one of the most unemployed majors",
            ">Just scrolling past this subreddit\n\nJust FYI, survivorship bias works both ways",
            "I suggest accounting",
            "Holy this guy is insane lol his comment and post history is either turbo incel talk or bitching about wanting to cut the number of CS students to reduce competition even though he himself is average at best 😂",
            "It’s never been good. The market is doomed for big corps. The need is fake for entrepreneurs. There is no real innovation, all just bubbles and monopoly. The game is also broken for job seekers.",
            "These posts are getting posted ad nauseam and trite. The job market ebbs and flows and CS majors will be in high demand. There is an aging workforce that needs to be replaced. CS (and its underlying components) will always be in demand in the long term. Short term gyrations are just that.",
            "I honestly don't see myself doing anything else. Tech has been the only field I actually had fun studying. There will be ups and downs yall.",
            "This is full doomer. Yes, the market is garbage, and will be till spending picks up after the Fed drops interest rates after inflation is back under control. The pandemic lead to massive hiring drives since there was potential then that there isn’t now.\n\nBut to think _sociology_ gives a better chance than goddamn CS, which literally powers the information era, is some other type of delusion. Yes, the market is hard, I am genuinely anxious as well. But changing my degree to, idk, psychology or engineering is no better for me, because CS is still brilliant as a career pathway.",
            "Degree =! Job offer. Degree means you are able to learn,study, finish tasks, work with people etc.\n\n\n\nBut a real world experience is what employers are looking for.\n\n\nThat's what internship's / side jobs are for.\n\n\nYou have to network in order to get job contacts.\n\n\nSadly for you OP, instead of finding the issue within yourself, you' are blaming whole market.",
            "bro, are you okay? do you need help?",
            "This is why people like you should focus on AI",
            "If you’re in a t10 go to something business related",
            "what's the scope of machine learning after 6 years? I'll be starting my undergrad this year.",
            "It’s like just strolling past all universities would not paint the liberal haven.",
            "This sub makes up a very small percentage of cs majors who are graduating. If the real world was as bad as this sub makes it out to be, no one would work in CS.",
            "Trust me, the situation is the same here in the EU. Also, our salaries are way lower than the US.",
            "Getting a job in the EU is easy if you’re from that country lol. A lot of EU employers always prefer natives because they know the customs and language.",
            "It’s not bad right now"
        ]
    }
]