[
    {
        "post_id": "lio1tg",
        "author": "VincentYards",
        "title": "600 rejections later, Got an Internship!",
        "url": "https://www.reddit.com/r/csMajors/comments/lio1tg/600_rejections_later_got_an_internship/",
        "score": 453,
        "num_comments": 44,
        "created_utc": 1613173500.0,
        "selftext": "Howdy,\n\n**TLDR:** Don't give up! *The grind pays off*\n\n3 years, 600 rejections later, just got an internship from the place ***that shall not be named***.\n\nWhat I think made the difference in getting responses:In the last 4 months, I added 2 new projects, that made my response rate go from 0 for 400 applications to about 7 for my last 200 application push. Not amazing, but after no responses from all my prior, I felt like I cured COVID.\n\nMy major focus for these projects were to make them either flashy/cool or useful to solve a real life problem I had and that anyone could use. For both, I had a genuine narrative of why I did the project, what it solved for me, and me going from dumb to competent in my journey of learning how to make it.One was a web-scraping project that has a discord bot to tell me when NVIDIA 30XX is in stock and runs on AWS.Other was a computer vision project that tracks social distance violations.Funnily enough, didn't know how to do either, both ended up being less than 500 lines of code. My tip, lean *heavily* on libraries, apis, and code from others. A lot of my learning (and positive interviewer comments) came from learning to connect things together, not innovating from the ground up. Not ragging on the latter; however, it's dramatically easier to make\n\nWhat didn't make a difference:Any classes I took, GPA, not having internships. Actually removed a prior internship I had on my resume because I only used Excel and always got negative comments from career fair people about it.\n\nAdvice to anyone in my shoes as of 6 months ago, use awesome premade tools to make awesome products.\n\n**Most importantly**, what I've learned and saw in myself, applicable to everyone working their heart out...  \nYou're not an idiot.  \nYou're not gonna work at the coffee shop forever.  \nYou're not a failure.  \nAnd yes, yes, you're good enough to be a software developer.\n\nEDIT: ***that shall not be named*** *=* ~~^(amazon)~~, I'm just a boy trying to meme  \nEDIT2: I'm a senior going to be a super senior.",
        "permalink": "/r/csMajors/comments/lio1tg/600_rejections_later_got_an_internship/",
        "comments": [
            "[deleted]",
            "I was literally gonna say “let me guess, Amazon?”",
            "congratulations and thank you for the tips. Hope you have an amazing time at [redacted] this summer.",
            "Why can the company not be named? Why not just say it?",
            "Can someone give me the first letter of that company which shall not be named so I know what yall are talking about 😂",
            "\"You're not gonna work at the coffee shop forever.\"  I sometimes think about taking a leave of absence from work to go back to my university's coffee shop :(\n\nCongrats btw",
            "The grind pays off!!! Great job and good luck :)",
            "It’s just frustrating dude like I’m tired of the bullshit sending applications and getting nothing. Might as well teach myself shit at this point since companies don’t even want to teach me anything",
            "Congratulations! You're a rockstar.",
            "tell me about this awesome premade tool.. are you taklking about softwares like rpgmaker? lol",
            "[Redacted]",
            "Congrats!",
            "Are you a sophomore or junior?",
            "Did you apply to Amazon before and get rejected initially?",
            "600 rejections!!???????",
            "Congrats! I'm going to be a fresh grad soon and I was starting to feel so defeated. Thanks for the tips, it made me want to keep trying!",
            "Congrats, OP! Not a CS major but apparently people are saying maybe Amazon isn’t prestigious enough (in terms of why people are hesitant to name their internships now). That’s so ridiculous. Who tf cares? The quality of an internship shouldn’t be measured by how hard it is to get into but by what you come out with. If you’re just trying to say you got into X company, but you come out with nothing memorable, then you’re missing the point. General you, btw",
            "Congratulations! Happy for yeah but I’m curious to how you got an offer from arguably the best place possible? Are you applying to the NSA or something?",
            "> For both, I had a genuine narrative of why I did the project, what it solved for me,\n\nDid you have a website to tell your narrative?\n\nI don't get how the project could have helped your response rate increase if before you didn't get any response so there would be no chance to tell your narrative then either."
        ]
    },
    {
        "post_id": "17q801f",
        "author": "3dmatrix3",
        "title": "Name and Shame: Yext",
        "url": "https://www.reddit.com/r/csMajors/comments/17q801f/name_and_shame_yext/",
        "score": 454,
        "num_comments": 18,
        "created_utc": 1699400198.0,
        "selftext": "Yext gave out a verbal return offer for me mid August 2023, and rescinded that offer recently. Said there were technical and FP&A (Financial planning and analysis) reasons that would delay the written offer letter for two weeks. Yext has delayed it for two months. I've asked for periodic updates on the written return offer, where the recruiter has reassured me several times that headcount was confirmed, that I'd get and that delays were due they were software migration so they couldn't generate an offer letter. \n\nYext also rescinded last year's new grad offers as well. \n\nJust letting y'all know what to expect if you get an offer with them.",
        "permalink": "/r/csMajors/comments/17q801f/name_and_shame_yext/",
        "comments": [
            "Thank you so much for letting us know. I believe I also heard sum along those lines about what happened last yr for this company",
            "That’s so ass. Fuck Yext",
            "Thought this was about Yeat the rapper at first lol",
            "They also rescinded like half of the summer 2023 intern offers last season. I had a good experience working at yext but I can’t say I’d recommend it to anybody anymore",
            "Companies like them will eventually fcked up",
            "Wow. This is disgusting",
            "Thank you for your service.",
            "if it makes you feel better i was told i’d get a verbal return offer from my past summers company early october at the latest. never got it so i reached out and the recruiter said wait till janurary. glad i started applying but damn does it suck to have to wait like that",
            "fucking bean counters",
            "lmaoo i talked to them at the career fair and the recruiters even assured us none of that would be a thing 🫠🫠 guess it was a lie",
            "u/3dmatrix3 were you trying to negotiate with them when this happened?  I'm asking because I'm in offer stage and they appear to be very unwilling to negotiate and used the tactic of reminding me they have other candidates in the pipeline.",
            "I have a friend who joined this company last year and has found that the company often goes back on its word, making promises but never following through.",
            "That’s fucked up. Do you know if they rescinded all return offers?",
            "Omg. Screw these companies and best of luck",
            "That is awful. I'm sorry to hear your story, but screw them for leading you on and lying like that.",
            "yext used to be great"
        ]
    },
    {
        "post_id": "16mk919",
        "author": "dvnci1452",
        "title": "Why is Netflix considered a good tech company?",
        "url": "https://www.reddit.com/r/csMajors/comments/16mk919/why_is_netflix_considered_a_good_tech_company/",
        "score": 452,
        "num_comments": 112,
        "created_utc": 1695107791.0,
        "selftext": "Its mentioned in FAANG as if it should stand beside Apple and Google on one hand, but Microsoft isnt there on the other hand. Its a glorified production studio imo.\n\nGAMFA for the win.",
        "permalink": "/r/csMajors/comments/16mk919/why_is_netflix_considered_a_good_tech_company/",
        "comments": [
            "FAANG was NOT meant for whatever this forum uses it to mean. It was originally coined to depict the stocks that has been rising up a lot the past decade in shows like Cramer and so forth.\n\nCompletely irrelevant to how many people here use it. That said, Netflix historically had lots of engineering feats.",
            "[deleted]",
            "their reliability engineering is among the best and has a big influence on the industry, including formalizing chaos engineering practices",
            "Did you see how much it pays its new grad swe vs Microsoft?",
            "1) It WAS a massive company on the up and up for a really long time that became a cornerstone of western entertainment. It has a massive tech base because it services pretty much every household in the west and COULD afford to experiment with new tech in anything they had their hands on. Now that they ran out of customers and actually have to start competing with content instead of serving shit and licensing foreign IPs on the cheap their money needs to be reallocated more and more. \n\n2) Much smaller team compared to other FAANG teams, Netflix is much more exclusive than other traditional FAANG teams making it an autistic fixation for prestige hags.\n\n3) FAANG is totally arbitrary and is essentially US News college ranking for people who care more about titles and prestige (tiger cubs). Netflix is in FAANG because it’s been in FAANG for a while therefore it must be prestigious and therefore has to be in FAANG.",
            "Netflix is arguably the most elite company in FAANG currently",
            "It was good. I remember they had a data science test in early 2000s or something in supervised machine learning.\n\nStudied about in some course, their engineers probably have enough repute to be considered a good tech company.",
            "FAANG was a stock abbreviation . It def was not meant for us CS overachievers",
            "Read Netflix's technical blog. Its one of the absolute best tech blog out there. They were and still are tech pioneers in a lot of things.\n\n[https://netflixtechblog.com/](https://netflixtechblog.com/)",
            "Netflix has the best culture. They rarely hire fresh grads. Their teams are elite. I think this is the best way to go in tech.",
            "Im wondering the same thing. In my opinion it should be MAGMA now (Meta, Amazon, Google, Microsoft, Apple).",
            "Prob so it wasn’t FAAG",
            "Netflix the streaming technology company, is definitely a \"hyperscaler\", where the engineering challenges (networking, caching, CDNs) can not be (economically) met with regular COTS solutions.",
            "They are an insanely capable engineering org that pays unbelievably high amounts.",
            "Read about their microservice architecture and their data throughput, TPS, user logins and other tech parameters before ranting about why they don't belong in the list.",
            "Wow you're dumb",
            "Netflix pays the biggest salaries and recruits the best engineers.  If someone is a software engineer at Netflix, you immediately know they're in the top 15 - 20% of their craft.",
            "Yes, a good tech company but not a good streaming company.\n\n![gif](giphy|qN8mwUPAt7gByge3W1)",
            "faang is for big tech that pays good. Microsoft pays ng $160k while the average faang pays $200k. Netflix pays like $250k",
            "It's weird that no one seems to care what the company business is. As long as they, individually, make bags of cash, work remotely, and get to do cool technologies then who cares how the money is earned, I guess. NetFlix lets people watch TV on their phones: not all that exciting.",
            "Although NetFlix has developed a brand and sustainable business model, and as you suggest, is merely a “glorified production studio”, it has yet to establish itself as a “tech company”.",
            "It's MANGA you prick",
            "faang was coined in the early 2010's when streaming was the new thing taking over and Netflix was leading it.",
            "They're took out blockbuster guys... \n\nIs that considerably \"good\". \n\nProbably, I wouldn't waste my gas to rent a movie and return it in the next day.",
            "Unlimited pto",
            "Faang is a stock thing originally. Also Netflix has crazy pay and Microsoft is know to have fairly mid pay when it comes to tech and it’s not that hard to get into either",
            "If you look at salary, Microsoft is no where close to FAANG.",
            "People used it a lot 8 years ago",
            "FAANG was initially only focused on salary, where a job at Google would pay 2x what the same job would be somewhere else. Netflix used to pay above market rates for every position, with the saying that \"average performers would be given a generous severance package.\" I don't think they pay top of market anymore but they're still compensated more than most developer roles.",
            "FAANG is backwards looking. The stocks that did well became FAANG.  This doesn't mean they have good quality or financials.",
            "Exceptional engineering culture, huge, all cash salaries. Need I say more?"
        ]
    },
    {
        "post_id": "pxh9la",
        "author": "None",
        "title": "The dopamine rush of solving an annoying bug might be a top 10 feeling of all time",
        "url": "https://www.reddit.com/r/csMajors/comments/pxh9la/the_dopamine_rush_of_solving_an_annoying_bug/",
        "score": 453,
        "num_comments": 20,
        "created_utc": 1632867091.0,
        "selftext": "I know it's been said before, but goddamn it really do just be hitting different.",
        "permalink": "/r/csMajors/comments/pxh9la/the_dopamine_rush_of_solving_an_annoying_bug/",
        "comments": [
            "I feel like writing code is a bipolar experience\n\nAt my internship I’d get stuck on a bug for hours/days and feel like the most useless POS out there. Then once Solved I’d feel like the king of the office, ready to start goin around signing autographs",
            "It only feels good because of all the pain and suffering leading up to discovering the solution. Like not having a drink for 24 hours and finally guzzling a bottle of water.",
            "Haha fr fr! Also \n\nLeetcode successful submission > Sex.",
            "Poly drug addict here. Can confirm it is top 10",
            "Took a UI course some months ago, basically we just had to do projects with GUI and hand them in.\n\nI spent 2 days debugging this Android app (never did Android before) and it turns out that for this one specific IF block I had to reset some background variable manually. I still don’t understand why it worked,",
            "And the worst feeling would be debugging a bug that doesn’t actually exist because you forgot to recompile your code",
            "I think this is the main thing that seperates programmers from other people. The brain writing to get a dopamine hit from solving such an abstract problem.",
            "Top reason I went to major as computer science :D",
            "Solving it is amazing, banging your face on the keyboard for hours beforehand sucks.",
            "I still have memories from my Operating Systems course when I'd spend like 3 hours troubleshooting something which was mostly just me staring at the code and trying to follow along the logic of it and not understanding the issue. Until one glorious moment something finally clicks. It was always something incredibly easy to actually write too, like a line or two of code or modifying a condition. And when the tests finally run all the way through and pass after hours of not passing...goddamn. It's the best.",
            "Up there with freeing a stuck popcorn kernel from your teeth",
            "It’s even better when I’m the only one student who got a project done with 100% after debugging and testing my code for hours. Most failed and had to resubmit to probably pass this week. Professor is well known to give hard projects and I will do everything I can to do a good job especially that feeling of solving the problem.",
            "[deleted]"
        ]
    },
    {
        "post_id": "18eotnv",
        "author": "Competitive-Pen-1661",
        "title": "Did I do good guys",
        "url": "https://i.redd.it/4awqqf0gic5c1.jpg",
        "score": 451,
        "num_comments": 67,
        "created_utc": 1702160976.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18eotnv/did_i_do_good_guys/",
        "comments": [
            "Jesus. How long did this take? Internship or full time?",
            "Fuck yeah you did good congrats mate you earned it",
            "now that is what I call unwavering determination",
            "![gif](giphy|1wQy1m37i9rF7TJ0dx|downsized)",
            "A job is a job. Congrats!",
            "Realistically how long does 1k applications take?",
            "better than me",
            "You did great",
            "Congratulations! As a current sophomore, did you do any personal projects or the like, to display on your résumé? If yes, could you describe it a bit? Thanks a bunch, and wishing you good luck!",
            "Care to share some details about your resume? Like, degree not no degree, how many internships if any, superficial stuff, no need to anonimize anything. I'm a freshman still and think 1000 applications is quite unique over the top, even though people say it's usual. These numbers are crazy, I wonder what to expect in 4 years.",
            "Can you share some details about the offer you accepted?",
            " Are people like bulk applying on linked in to get to 1000 allocations?\n\nLike jobs I am looking for ask for two page cover letters and I’d be lucky to write 4-5 custom applications a day if I was hustling",
            "You didn’t give up and got an offer. That’s a W.",
            "Not very smart tbh. I would just apply for those 44 that won't reject/ghost me to save so much time",
            "By the way, in which platform you are drawing these images.. i have seen a lot of these type of images. But don't know platform or website.",
            "How do you guys get such graphs of applied and rejected jobs?",
            "Oh my goodness",
            "No",
            "Is this for summer internship or full time ng?",
            "[deleted]",
            "no",
            "Congratulations bro 🎉",
            "Ya did good fellow csMajor 🫡",
            "Rest more weary soldier",
            "What graphic website is this?",
            "This is how my new grad application process is looking… good you are locking in internships, this will make you feel safer"
        ]
    },
    {
        "post_id": "x6i1u0",
        "author": "SnooRecipes1809",
        "title": "How do people have the mental space to LC during the school year?",
        "url": "https://www.reddit.com/r/csMajors/comments/x6i1u0/how_do_people_have_the_mental_space_to_lc_during/",
        "score": 451,
        "num_comments": 82,
        "created_utc": 1662389440.0,
        "selftext": "I don’t see how it’s consistently possible on a daily basis. Coding and working with algorithms is mentally expensive even if you can make time for it after hours; we’re expected juggle like 15 credits, hand in assignments, take exams with abysmal curving, and then spare a couple extra hours a day to solve imaginary abstract puzzles.\n\nWhen you’re not doing that, you’re filling in repetitive webpages of personal information in internship job postings.\n\nI’m pretty bad at LC Mediums and I don’t see myself getting adequate in time for interviews because of school, idk.",
        "permalink": "/r/csMajors/comments/x6i1u0/how_do_people_have_the_mental_space_to_lc_during/",
        "comments": [
            "Just give up sleep and social life and u r good to go. Jk, it become a habit and don’t do ‘hours’ 30 mins is a good start",
            "Personally I make sure to do the LeetCode Daily Challenge every day. It's a random problem that I don't have to waste my time choosing. I spend 45min at most.",
            "\"One leetcode a day will keep unemployment away\" I don't know who I heard this from but just thought it was sadly funny.",
            "Unless you are going for a MAANG company doing daily LC exercises probably isn't as important as you think.  I went through the interview process twice now, once after college and again now a few years later.  The few LC problems I have gotten have been laughably easy.  Most companies are moving towards more realistic coding exercises to see if you can write clean code, unit tests, etc...  For example, I recently got a technical exercise that was to create a simple REST API and then expand on it.  My first job out of college had me write a math library in Python and unit test it.\n\nIf you are concerned about LC I would suggest focusing primarily on knowing the implementation of certain algorithms and the time/space complexity of your data structures.  There is a finite number of data structures and algorithms out there.  Instead of trying to memorize every LC problem, know your DS and Algo's and then apply the appropriate one to the LC problem.  i.e.  \"Oh a look-ahead algorithm with a hashmap would be good here\"  It seems so many people are grinding LC like they trying to memorize every possible solution and that doesn't seem like it would be effective to me.\n\n*Edit:  One thing I should add is that every other part of the interview process is just as important as the technical.  Reddit acts like the technical challenge is the lynchpin of the interview process.  It really isn't.  I've interviewed potential hires in my last role and I watched us choose people who were mediocre on the technical over people who were great technically primarily because of their soft skills and their culture fit.  It won't matter how well you crush the technical if you flop during the informational and/or panel portion of the interview process.*",
            "I don’t know what year you’re in, so maybe this won’t help, but next summer make sure to start applying the minute postings go up (July!). Last year I was applying and interviewing up until a month before internships started, this year I already have an offer for summer 2023. I’m going to do one more interview, make a decision, then not worry about applications until next summer. \n\nThat also means you can do a little LC through the school year and ramp it up as soon as the spring semester ends to prep for July.",
            "For me, I had times where there wasn’t much to do for school and I’d do a ton of LC for a week. I would never sacrifice social events for LC unless I have a confirmed interview in the next week",
            "Yeah this is something I couldn’t capture. Respect to people who grind hours on LC while doing class work and working on internships",
            "I'm a new grad, it gets worse when you start working and have to worry about taxes, grocery shopping, bills, rent, etc... \n\nEspecially if you have a decent job it becomes next to impossible to get the motivation to do LC.",
            "A question a day, over a 4 month period of one school semester is enough time to finish Blind 75 which is enough to at least have some confidence. From there, do NC150 or redo Blind 75 or whatever other questions you'd like.",
            "When I was doing LC, I made it a daily habit. I made sure to do at least 1 hour dedicated to LC. Even if you don’t solve it in an hour, youre still learning.",
            "Just wanted to add to this.\nI personally am going through the same thing.\nBut I also have problem in remembering the approach I used. I sometimes revisit the problem I solved earlier and have hard time remembering the solution/approach I used to solve it and this makes me feel so dumb :(\nHow do you guys tackle that? \nAny tips?",
            "I don’t go to lectures. Most of it is a waste of time and I learn on my own way faster",
            "Schoolwork was pretty easy",
            "I work 40 hrs a week, take 5 classes and study LC just have no social life basically 🙃",
            "Did this. Went to the ER for severe burnout. Learned my lesson and now I'm solving for fun when I have time, but ngl it's pretty addictive and often end up overdoing",
            "Thank you for reminding me that I haven't done Leetcode today",
            "skill issue",
            "I can't dp for shit. All medium to hards are do for some khicidi so frustrated. I might change to simply ither simpler sites but lc is good to build concept. The linked list, tree section is good",
            "Have you considered maybe you aren’t cut out for programming?",
            "Mainly I LC grind in summer as I have more time. \n\nFrom Sep-April I take it easy. 1-3 questions per day.",
            "That’s the treak, you don’t 😂",
            "Knowing this is part of the job hunting process is what helps keep me motivated.",
            "Non stop Adderall abuse brother",
            "My approach is to get a really good grasp of algorithms and data structures. LC seems to have some bogus exercise recommendations when your starting. With a good grasp of data structures and algorithms, you can dive directly to the bad ass exercises and learn your way out a you drown.",
            "200K TC, millionaire by 30",
            "[deleted]",
            "I haven’t done more than about 5 LC questions ever so it’s definitely not required as long as you can learn those skills another way",
            "People are different. Don't compare yourself to other people. Just do you're best in college and don't' worry, unless you're applying for summer jobs/internships and such.",
            "If you have enough drive, it's not that bad",
            "Feels easier to do the daily LC than to start my schoolwork/work-work for some reason."
        ]
    },
    {
        "post_id": "t4kccq",
        "author": "Kind_vibes",
        "title": "What is the computer science equivalent of “The Mitochondria Is The Powerhouse Of The Cell”?",
        "url": "https://www.reddit.com/r/csMajors/comments/t4kccq/what_is_the_computer_science_equivalent_of_the/",
        "score": 455,
        "num_comments": 153,
        "created_utc": 1646173987.0,
        "selftext": "Saw this posted for engineering majors, I’d love to hear our comp sci version of this lol",
        "permalink": "/r/csMajors/comments/t4kccq/what_is_the_computer_science_equivalent_of_the/",
        "comments": [
            "Index starts from zero",
            "Stackoverflow is the powerhouse of the programmer",
            "An undirected graph has an even number of vertices of odd degree.",
            "when in doubt\n\n**hashmap**",
            "[deleted]",
            "Hello world",
            "public static void main(String[] args){}",
            "Std::cout << “Hello World.” << “\\n”;",
            "System.out.println(“Hello World!”)",
            "\"Everything is an object\"",
            "P = NP",
            "Without a doubt it’s `Hello World`",
            "Merge Sort is O(nLog(n))\n\nalways repeated, never really thought about much",
            "A monad is just a monoid in the category of endofunctors.",
            "Linux is the powerhouse of the server",
            "C is the Powerhouse of the Kernel",
            "Everything is just ones and zeros.",
            "Reverse a linked list?",
            "The CPU is the brain of the computer.",
            "#include<bits/stdc++.h>",
            "A is 65, a is 97",
            "Reading documentation is equally important , if not more, than actually writing code.\n\nEdit: Being able to comprehend what you are reading is in there too.",
            "a monad is a monoid in the category of endofunctors",
            "#Include<stdio.h>\n\nint main(){\n\nprintf(“Hello world”);\n\nreturn 0;\n}",
            "array off by one error",
            "A bit is a binary digit.",
            "When in doubt, printf(“Hello World”); is all you need to debug.",
            "It's a feature, not a bug.",
            "React is actually a library, not a framework",
            "System.out.println(\"Hello World!\");",
            "A byte is 8 bits",
            "\"A computer consists of input, processing, storage, and output.\"",
            "Trust the Natural Recursion",
            "2 sum",
            "What does this question even mean? I took biology and that statement/tidbit of information was not particularly notable for any reason against the backdrop of the subject itself. It's just one of the many things you learn in biology. Any other statement of fact from biology could replace it and hold the same amount of colloquial weight, so why is this being posted as if people think of it as being standout or notable for some reason? If what you're saying is that it's repeated over and over, then that's just not true. We learned about it, and then moved on in high school and college, and I never hear anyone talk about it outside of academia.",
            "If\nElse\nElse if",
            "CPU is the brain of the computer.",
            "Hello world",
            "Centering a div gotta be it",
            "P=NP?",
            "arrays start at 0",
            "Make sure your curly bois { has a friend.",
            "The execution core is the powerhouse of the CPU.\n\n(Everything else is just memory and memory dynamics.)",
            "PEBKAC",
            "fun fact 0 = 1\n\n| fact x = x * fact (x-1)",
            "A pointer is a pointer is a pointer… wtf just tell me about memory management",
            "For hardware, I'd say it's the northbridge. It connects the CPU and ram, and to the southbridge which lets the peripheral, bios, etc. communicate with the CPU.\n\nSoftware are a set of instructions that hardware look for to follow. For software, I'd say it's the compiler that converts code into machine language. Depending on the compiler used, code can behave differently in terms of efficiency, order, etc.",
            "Y’all are all wrong! It’s “the cpu is the brain of the computer”",
            "RAM lol",
            "Hmm. Accurate but useless information in line with \"the mitchocondria is the powerhouse of the cell\"... my vote is for assembly as the basis of all programming. Technically accurate, but also pointless.",
            "Leetcode...all of it...",
            "LEETCODE",
            ";",
            "1 + -1 = 0 with 2's complement representation.",
            "Bubble sort is an O(n^2 ) operation.",
            "GOTO considered harmful",
            "Sorting cannot be done faster than O(nlogn).",
            "LeetCode is the powerhouse of life",
            "“Hashmap search is amortized O(1) time”",
            "\"...and then you increment the program counter\"",
            "This might be too actually helpful but ~99% of times you have to deal with array data, use a vectorized function rather than iteration so the compiler can optimize with multiple cores.",
            "JavaScript is fucking ugly",
            "The CPU is the PU of the C",
            "Fibonacci Series",
            "Transistor? Hardware wise",
            "CPU is the brain of the computer. Been learning it since 1st grade!",
            "Premature optimization is the root of all evil.",
            "CTRL+C\n\nCTRL+V",
            "Spaces vs tabs",
            "The CPU is the powerhouse of the computer",
            "The Big3",
            "Have you tried turning it off and back on again?",
            "Trust the natural recursion",
            "Discrete mathematics especially set thory, group theory , abstract structure and GRAPHS.",
            "String are immutable",
            "1+x <= e^x for all x",
            "Rtx30 GPU's are the powerhouse of a community (quite literally) and O(logn) the powerhouse of all algorithms",
            "Trust the recursion",
            "can you reverse a linked list?\n\nor\n\nthis is recursion",
            "Invert the bits and add 1",
            "LC is the powerhouse of FAANG. (or visa versa)"
        ]
    },
    {
        "post_id": "1ak17uf",
        "author": "finessedme",
        "title": "2024 Junior Summer Internship Search, all it takes is one person to believe in you!",
        "url": "https://i.redd.it/fkvw1wxc6wgc1.png",
        "score": 453,
        "num_comments": 54,
        "created_utc": 1707193460.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ak17uf/2024_junior_summer_internship_search_all_it_takes/",
        "comments": [
            "My man got 1 shot and took it all the way.",
            "Feel free to ask me any questions, happy to help out!",
            "3 rounds for an internship? Jesus",
            "Hey, how the resume look?",
            "What’d the website for that ?",
            "Did you get a referral at the company where you got the offer ?",
            "Can I see the resume?",
            "Way of the Samurai. Congrats!",
            "I’m genuinely so happy for you and I wish you best of luck!",
            "The real depth first search",
            "we should start roping in tandum now to get elons attention. yall could use the extra workout too and some soap",
            "Can you send me your anonymous resume if you don't mind. \n\n\nMany congratulations either way",
            "Bro can u send resume anonymous ofc",
            "I'd love to see the resume if possible. Congrats!",
            "If I missed anyone who asked to see my resume just shoot me a chat or message and I'll get back to you after classes today :)",
            "we should start roping in tandum now to get elons attention. yall could use the extra workout too and some soap",
            "It seems that in your case, it took three.",
            "wow nice, back here 5k applicants, 1 accepted for a lowtier local company"
        ]
    },
    {
        "post_id": "1bwwycp",
        "author": "Comprehensive-Room30",
        "title": "My 2024 internships hunt",
        "url": "https://i.redd.it/7d3uoggazqsc1.jpeg",
        "score": 447,
        "num_comments": 74,
        "created_utc": 1712360624.0,
        "selftext": "I got an offer for F500 company, $38/hr, remote, swe intern \n\nI started to apply in October and then stopped. Started to apply again in March. The job I got was from a March application, so really not too late. \n\nI just want to say, I didn’t apply to many companies because I was having a really hard time in my life and thought I was not a competitive candidate enough to do so. \n\nI go to T20 school, only have normal class projects, 3rd year with only experience doing non profit work, and teaching. \n\nAnyways, I didn’t think it would happen, the amount of applications I did really shows I didn’t think it would happen. But I feel like it truly wasn’t too late and it is possible for people whose resumes aren’t crazy loaded ",
        "permalink": "/r/csMajors/comments/1bwwycp/my_2024_internships_hunt/",
        "comments": [
            "👍",
            "&#x200B;\n\nhttps://preview.redd.it/u6lz1xrt9rsc1.png?width=527&format=png&auto=webp&s=381e9ecad566750f6edf30811f2177c86cf67b3c",
            "Congrats man, best of luck with your first steps into hopefully an enjoyable  and accomplished career!",
            "I would like to know what’s OPs profile and their job hunt/applications strategy. \n\nI’m happy for you OP, congrats!",
            "OP please share your resume, blur your info and the names and all but I just wanna see the format and how you sentenced everything, that’s a massive step to get started.",
            "Did you have prior work experience in cs and were your class projects advanced? Gpa? Seems unreal how 13 apps and you got an offer. Congrats 🎉",
            "and some have the audacity to say the college you go to doesn't matter lol",
            "That's the bare minimum number of my applications per day . Lol. 🤣🤣\n\nAnyways good luck to you !!",
            "Congratulations! Be proud of yourself everyday and I hope you enjoy what you do. 🥳😊",
            "Damn only 13 applications? Shit I’m finance major over here and have 300+ applications with 1 offer…",
            "Congratulations! I’m dreaming of a remote internship opportunity. Are you at all concerned about that aspect?",
            "Congrats",
            "38 for an intern? I make 38.50 as a full-time employee. Tell me what you know",
            "What app do you guys use for this post ?",
            "Can you explain what app is this? You have to put the data manually or how is work?",
            "Congrats! What did you use to create this?",
            "Which tool you use to make it?",
            "What school do you go to?",
            "can we chat?",
            "Ya'll really need to learn some new charts.",
            "What tool did you use to generate this graphic. This is the second time I’ve come across it and it’s rather interesting.",
            "lisan al gaib",
            "How was the technical portion ?",
            "[deleted]",
            "Bro what app is that? Was trying to find something to draw these trees for a long time",
            "Shiiiiiiiiiiiiiiiit",
            "Keep on the grind bud",
            "Congrats!!",
            "did you send daddy a thank you note?"
        ]
    },
    {
        "post_id": "wswher",
        "author": "Easy_Ad_271",
        "title": "I got rejected from Chick-fil-a with no OA but got offer from FAANG",
        "url": "https://www.reddit.com/r/csMajors/comments/wswher/i_got_rejected_from_chickfila_with_no_oa_but_got/",
        "score": 442,
        "num_comments": 61,
        "created_utc": 1660964311.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/wswher/i_got_rejected_from_chickfila_with_no_oa_but_got/",
        "comments": [
            "Must be gay",
            "You sent in your application on a Sunday",
            "bc you didn’t demonstrate exceptional chicken frying skills 🍗",
            "Go find God.\n\nCome back after you found God.",
            "What’s your CodeSignal? Must have been 666",
            "It was their pleasure",
            "Is the FAANG Amazon ?",
            "Y’all think they filter out overqualified candidates ?",
            "Should have applied to los pollos hermanos, heard great reviews about that place",
            "God stepped in",
            "Some hiring people just aren't that bright. When I was still working in restaraunts, I got rejected from places like fucking Cracker Barrel, because they didn't think I'd be able to handle the \"fast-paced environment\". 1 month later I was working in an upscale restaurant making more money than Cracker Barrel could have possibly offered a line cook.",
            "Probably found your social media and saw you were not a homophobe.",
            "POV: you realize that there is indeed a right answer to \"I identify as a ...\" on applications.",
            "Based on your post history you appear as more of a Popeyes type hire tbh.",
            "They filter out non-christians. I know so many people with faang offers that didn't get interviews but the dumbest people that had \"youth councilor\" in their resume all got callbacks",
            "You missed out on a lot of free lemonade.",
            "Honestly I’m not surprised.  Totally different jobs with totally different requirements.",
            "Wait you didn’t get a video interview?",
            "Nice joke man",
            "[u/nitrix347](https://www.reddit.com/user/nitrix347)",
            "Is this for a SWE position? I checked their career site and couldn't find any SWE internships.",
            "same lol",
            "life b like this",
            "I almost choke on my water",
            "Slay",
            "yield protection",
            "Amazon"
        ]
    }
]