[
    {
        "post_id": "1au77it",
        "author": "killuazivert",
        "title": "I APPLIED 30 MINUTES AGO😭",
        "url": "https://i.redd.it/xurn20j99fjc1.jpeg",
        "score": 1882,
        "num_comments": 129,
        "created_utc": 1708296063.0,
        "selftext": "You literally can’t make this up",
        "permalink": "/r/csMajors/comments/1au77it/i_applied_30_minutes_ago/",
        "comments": [
            "\"After careful consideration\"",
            "New record!",
            "Normally this means a predefined criteria wasn’t met. Like not in the right location or non-us citizen for positions that won’t sponsor. For this particular role it’s probably wrong graduation timeline. This program is targeted mostly toward second years",
            "Human intelligence was not involved in this decision",
            "Very common, most likely some important criteria is not being met.",
            "30 minutes apparently now is 'very long' lmao. \n\nbet no human was involved.",
            "Not quite the record. I applied to Dell a few months ago and got rejected in about 15 minutes  😂  😂",
            "Bruhhh I applied on august 11th I still do not have a response, not even a rejection. Amazon is trolling us",
            "Those are all internal roles, Amazon is not hiring any external L4s currently and probably never will for a while. It’s all through intern conversion only currently",
            "Decision made by robot overlord.",
            "That too on a Sunday lol",
            "Speed run",
            "They only wanted uw students for that position iirc",
            "Ah I work for Amazon. If you don’t meet one of the qualifications, the system will just kick you out",
            "Careful consideration is crazy",
            "Amazon Recruiting is /very/ efficient. Next year they will use PrimeAi to reject you before you even think about applying.",
            "They were waiting for u to apply just to reject you (don’t worry they do the same to me)",
            "Better than stringing you along for interviews knowing full well that they already have someone else in mind.",
            "An inside referral is almost mandatory.  A lot of these job postings come out with someone already in mind for the position.  Listing the vacancy is a formality in a lot of cases.",
            "On a Sunday??? Ouch",
            "Lmao",
            "It's possible they're about to make their hire and are dispositioning old candidates. How long has the post been up for?",
            "At least they were quick, haha?",
            "External L4s are not really being hired at Amazon right now (except student programs/newgrad). However, those are more likely to come from previous interns with return offers",
            "Who knows; maybe you previously applied to a position that you were wholly unqualified for and they blacklisted you. I doubt that Amazon would do this, but I know someone who does, because she got tired of getting 2000 resumes for a senior engineer position from people who just graduated college and from people with no education at all; people who just apply for everything. So, when you’re thinking, “I’m just gonna apply for every job out there, because it’s a numbers game,” just remember that it can work as negatively as it can positively.",
            "means either a. your resume sucks. or b. the questions u answered before applying sucked",
            "Ur resume is probs ass",
            "RIP in pepperonis",
            "That's nothing, I once got a rejection email 10 minutes after I applied",
            "I'm lucky enough to make it through ATS so I get a rejection after a week instead of 30 minutes...",
            "be like that, that’s kinda why I don’t mind spamming",
            "Ping resume and job id if you need referral",
            "*not that careful",
            "A side note for anybody who comes across it - any time you go through an application process asking if you have x-y-z- experience, just answer yes and/or the maximum for each question.   \n\nThose questions are tied to automated systems that will screen you out without ever considering you. And the recruiters I know (fairly high level, at large companies) have said to ignore them.",
            "i’m a current jr dev, i’ll refer u. pm me",
            "Zon once gave me a 2 minute rejection",
            "This is the problem with Application Tracking Systems today. Even if you have a very awesome resume showing all your capabilities but if it is not parsed correctly or doesn't fit the very strict criteria with no human involvement. Bitter!",
            "I've been rejected by John Deere in 1 minute. Maybe i should post mine. 🥲🥲\n\nAt least straight forward rejection is better than ghosting.",
            "https://preview.redd.it/vnclxo531ijc1.jpeg?width=828&format=pjpg&auto=webp&s=8e800d89784ba63d73e634a63dd63021dc6c4209\n\nThat’s happened to me before but it was 1 hour not 30 minutes",
            "Rejection was send with Amazon Prime",
            "Another FANG wannabe",
            "I got rejected within a minute once lol",
            "I hate to break it to you. But I’m the other candidate.( I’m yet to land an internship at all)",
            "they did NOT carefully consider 😭",
            "are you on a STEM OPT? this happens to me a lot if they’re just not down to sponsor 😣",
            "This happened to me but with a resume. Got rejected within an hour too 🤣",
            "Hey that's better, at least they reached back",
            " You are getting rejection emails from Amazon? They just ghost me",
            "nahhhh low-key happened to me, 30 mins after assessment they were like \"thank you for blah blah blah, blah blah not taking you further\"",
            "Either the role is closed, or you applied their within the last few months.",
            "That’s that Amazon Prime rejection at work. Same day shipping.",
            "After AI consideration.",
            "Amazon still hold my record for fastest rejection. They probably already met a threshold of applicants.",
            "I applied yesterday for an internship role abroad but today I got the rejection from Amazon only",
            "When I apply to Amazon I don’t get any reply despite having “under consideration” for 5 months, so I guess it’s better for you 😅",
            "Sorry ai said no",
            "Amazon uses a program to handle the initial scan of resumes. You can use online tools to scan the job posting and your resume to identify what is missing to get you through the initial scan. ",
            "t least they did not ghost u",
            "Where are you from?",
            "Thanks for making me feel better 😭",
            "I had one where the rejection email came literally 2 minutes after I had submitted my resume lmao. Humbling asf",
            "I got rejected by cashapp in 5 minutes",
            "Were you expecting longer?  They're going to skim your application for a good 30 seconds.  Kind of nice you got the heads up early and weren't in a limbo.  But like other were saying too, coulda just been automated",
            "AI done denied you",
            "They answered quickly. They refused the apply automatically. \n\nhttps://preview.redd.it/qknh0vc8nnjc1.png?width=374&format=png&auto=webp&s=a3d750e82023151b4cb920461e9890595ce185bb\n\nKeep trying bro, one is going to be yours, you deserve it. Best of lucks!",
            "Is this really a SDE role? There is no such things as Jr SDE.",
            "All the Entry Level roles will be part of student program. So will always have New Grad in the title.",
            "The other day I got an INSTANT rejection lol. Probably because I clicked need sponsoring. But it was literally after pressing submit",
            "They are using software and I think you didn't get past 1st round of selection.",
            "At least you got after 30 mins , the moment I clicked on the submit , my status changed to NO LONGER UNDER CONSIDERATION",
            "Dw, i think i hold record for getting rejected in 2 minutes literally",
            "I am applying for more than a year. \n\nUse keyword - no luck\n\nuse keyword + impact - no luck\n\nuse impact - no luck\n\nuse referrals - no luck \n\nuse reach out + referrals- no luck\n\ndo targeted applications - but if i don’t know whether they are hiring for this position or not, how would i target that!\n\nget certifications- no luck\n\nbe active on linkedin - no luck\n\nAnd there are people who doesn’t do anything like above, gets the interview call. Too new grad for experience hire and too experienced for new grad hire",
            "what you filled in your application? what about resume?",
            "That’s nothing I had a 6 min rejection",
            "Bruh",
            "are you international?",
            "AI has done it again",
            "Bro. Try 600 applications and 2 offers… you have some work to do.",
            "They were very careful - recruiting needs some new policies",
            "Oh, this was just a typo. They spelled “automatic” consideration wrong.",
            "Gotta get that time lower, I got auto rejected before the confirmation for applying came in"
        ]
    },
    {
        "post_id": "1cbkahn",
        "author": "PlanetElement",
        "title": "What's wrong with y'all?",
        "url": "https://www.reddit.com/r/csMajors/comments/1cbkahn/whats_wrong_with_yall/",
        "score": 1856,
        "num_comments": 110,
        "created_utc": 1713917350.0,
        "selftext": "I swear, I'm absolutely at my wit's end with my fellow CS students. First off, can we talk about hygiene? Is it really that hard to take a shower and do a load of laundry once in a while? Cuz yall mfs stink. The labs smell like a locker room after double overtime.\n\nY'all always talking about some weird shit; why does every conversation have to dive into the strangest possible topics? I was in the CS building the other day and some ppl were talking about horse semen or something. It's always multiverse this, meta that, like bro it's time you meta woman. Stop pulling repos and start pulling some bitches.\n\nEver heard of touching grass? Sunlight is free. Some of y’all do more LeetCode problems than you take steps in a day. Maybe the gym? Or a club? Maybe a party that isn't LAN? I’ve seen more activity in a dead GitHub repo.\n\nSeems like some of y'all missed the normal human patch in ur latest update. Can we please just reboot the whole vibe here? And get CS away from this archetypal basement-dwelling, stinky code-monkey stereotype we seem to carry around.",
        "permalink": "/r/csMajors/comments/1cbkahn/whats_wrong_with_yall/",
        "comments": [
            "Wake up babe, new copypasta just dropped",
            "These things are harder than getting a FAANG job.",
            "\"Stop pulling repos and start pulling some bitches\"\nLost it",
            "Yeah that’s why I regret not being a math major. I took a math proofs class for fun and there was a 50-50 ratio of cute  babes to dudes",
            "Horse semen topic seems interesting tho",
            "I read this in Chris Rock's voice.",
            "This whole post was a setup for “it’s time you meta woman”. \nGave me a good chuckle with that one",
            "Bro you have 40k karma 💀",
            "Honestly, this narrative is kind of getting outdated with the overflow of people in cs. As a teaching assistant, I see much more people who need to be outside less and, instead, spend more time coding.",
            "Lmaooooo at my university I was a handful of cs majors that ACTUALLY had a social life and took care of themselves. Literally had 3 friends total in my degree because the rest smelled, had no social skills, or both!",
            "There’s not much girls in their classes so they concluded showering ain’t worth it",
            "It’s important to be well rounded.",
            "![gif](giphy|4G1RMIPGFz5lxQpK18|downsized)\n\nStory of our life man.",
            "We need a social cycle called non-stinky CS students, every new applicant must pass a smell test by 5 members",
            "Reads like a ChatGPT text with all those references to CS.",
            "CS is and always will be the home of the weridos and oddballs. Because those are the people who are going to sit in front a computer and learning programming.",
            "    git pull bitches",
            "> Stop pulling repos and start pulling some bitches.\n\nLmao",
            "Banger roast post 🔥",
            "The first 500 level CS class I walked into was such an assault on the senses it was insane.",
            "I'm not in cs but I love this reddit it's funny😂😂",
            "I'm married and I have a son now. My wife makes fun of my fear of sunlight. My son is 3 and he closes curtains for me when I come downstairs. He says, \"Papa likes it dark!\"\n\nStudents, you can keep avoiding the sunlight.",
            "Holy your roasts are actually funny and creative. I will use ALL of them the next time I see my fellow engineers.",
            "I, computer science student, Female, would definitely talk about horse semen",
            "College was when I realized I was a rare breed. Loved coding but was also pretty much a Chad in the social side. Partied hard with the other majors and still got better grades than most of the CS kids. In class, you will probably find less than a handful of us like this.",
            "TC or GTFO",
            "Alright, this is satire, but it's awesome for you because hygiene is literally a competitive advantage. The same goes for general presentation and sociability. Luckily, we work among a bunch of antisocial know-it-alls, so as long as you remain relatively well-adjusted, you'll always have work.",
            "I bet chatgpt wrote this",
            "And worst part is some people are doing it just because its the norm. Its okay to have a social life/have love interests or go clubbing but they'd probably be ostracized for it and made to feel youre not working as hard as them. I lived on campus for awhile and that was the experience",
            "New meta (woman)",
            "Cross post this to r/creepasta",
            "When my cs program moved to almost all direct admits I knew this day was coming",
            "🤣",
            "Water is a very expensive commodity.",
            "Head down, nose plug on, you’ll do better than everyone else in CS once you graduate because being able to communicate with non-technical folk is the rarest & most valuable skill for CS",
            "mans doing gods work.",
            "don't do this bit",
            "More leetcode questions than steps is crazy(I’ve only walked to my desk today and genuinely have solved more leetcode problems than steps)",
            "Well not the worst experience",
            "I was not expecting to be brutally assaulted when I opened my reddit but here I am",
            "My friend’s new boss has ordered that the in-house dev team must keep one (room) window open at all times.",
            "> like bro it's time you meta woman\n\nThis was the gem",
            "This describes my roommates who are all CS majors, they never leave the house even when it’s a gorgeous day, don’t have any friends or go to any parties (they’re seniors) and constantly talk about how women are evil because they’re all trump incels. It’s disgusting.",
            "doll foolish terrific important expansion hungry stupendous memory enter shelter\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I'm fine",
            "Bro it’s time you meta woman\n\n🤴",
            "I can’t stop laughing because I dunno if you are joking or not…\n\nAlso, I’m an incoming freshman into a CS degree and the hygiene thing really scares me…",
            ">Ever heard of touching grass?\n\nYes, but I refuse to touch grass.",
            "Unfortunately, the whole subreddit was lost at \"double overtime\"",
            "you're corny",
            "My favorite pastime back at uni was watching my gf try to interact with these spergs. We'd get the most confused, nervous, random reaction from them when she asked them the most trivial shit. It was like watching a person segfault. I'm glad to know that it still didn't change",
            "It sounds like you're feeling frustrated with the culture and behavior you're encountering among your fellow CS students. It's understandable to want a more balanced and socially engaging environment, especially when you're spending so much time together in labs and classes.\n\nHygiene is definitely important for everyone's comfort and well-being, and it's unfortunate when it's overlooked. Bringing it up tactfully in a group setting or speaking with your peers one-on-one about the issue might help raise awareness.\n\nAs for the conversations veering into strange or inappropriate topics, it could be helpful to gently redirect the discussion or suggest more inclusive topics that everyone can participate in comfortably. Finding common ground and respecting each other's boundaries is key to fostering a positive atmosphere.\n\nEncouraging more diverse activities outside of coding, like sports, social events, or just spending time outdoors, could also help break the cycle of constant tech talk and encourage a healthier work-life balance.\n\nUltimately, it might take some effort to shift the culture, but even small changes can make a difference in creating a more welcoming and balanced community within the CS program",
            "Don't feel bad that you don't understand the topics the smart kids are talking about. Just focus on tennis, it's okay, totally nothing wrong with that..",
            "I havent washed my clothes the entire semester and no shower for I think a week lol sowe."
        ]
    },
    {
        "post_id": "178gyxf",
        "author": "liquidInkRocks",
        "title": "I hate my job but it pays $135 / hr with overtime bonuses.",
        "url": "https://www.reddit.com/r/csMajors/comments/178gyxf/i_hate_my_job_but_it_pays_135_hr_with_overtime/",
        "score": 1853,
        "num_comments": 165,
        "created_utc": 1697381318.0,
        "selftext": "When we meet a deadline we get gift baskets and massive Amazon gift cards on our desks. When my code builds with no errors or warnings (C#) I get Friday off. My project team has regular outings to Saks 5th Avenue and we get to pick out purses and stuff. The company is an unbelievably funded startup but the VCs never come around and bother us. I'm paid a base rate of $135/hr and I get a 50% rate increase for overtime hours, which are almost always optional. \n\nBut, I just hate the place. They have a golden lab that wanders around and it eats my snacks when I leave my office to get a massage. My parking space is, like, at least 100 yards from the building and sometimes there's bird poop on my car when I leave to go home. Also, no one likes to play Quidditch so I have nothing to do at lunch time. \n\nI just don't know what to do. I have to decide something soon because I'm getting promoted and they want me to take over some new project with Kotlin and AI and ML. I just know they will throw more money at me to make it that much more harder to decide. ",
        "permalink": "/r/csMajors/comments/178gyxf/i_hate_my_job_but_it_pays_135_hr_with_overtime/",
        "comments": [
            "Well, if it helps at all, a lot of imaginary workplaces are difficult to handle.",
            "Same job, our company has a pet python..",
            "Yeah I was stuck in a similar situation. I left a 250k job to support my GF’s onlyfans content creation.",
            "People's irony detectors can't be this broken bro wtf \n\nI guess that just speaks to how many people are accustomed to pampered CS grads making 100k WFH and whining about petty shit on this sub, to the point where they think that this could be a real post",
            "Truly this is proof that CS is the WORST field and no one is more oppressed than software engineers",
            "Damn bro it's not like you can like leave it in the cabinet or something so the dog doesn't eat it",
            "Finally someone I can relate to. Got promoted to principal engineer and they gave me a lambo as a bonus. But I can’t park my Lambo under the shade and it sucks so much. I hate it so much, help.",
            "I try to make sure to ask during the interviews about Quidditch. that is usually a deal breaker for me. 400 grand a year? no quidditch? naw sorry.",
            "Hey babe wake up. It’s Sunday on r/csmajors",
            "I'm sorry about your experience, Caroline Ellison",
            "You had us in the first half chief 😂",
            "🤣 Well played, OP, well played...",
            "What you can do is literally order doordash if the lab eats your snack. Question is, can you find a job that pays you more minus it costs doordash.",
            "Sounds like you're working at OpenAI xD",
            "I almost thought you were serious. $270k (40\\*50\\*135) is not an impossible wage for a dev with say 5 years of exp. But no one every had a job where their car got pooped on by birds, that's beyond the pale.",
            "absolute 5 year old child post",
            "It's not remote? That's a shitty job. You should leave. You can do wayy better.",
            "No lunch time quidditch is a deal breaker for sure.",
            "This is the most first world problem shit I’ve ever read. Get your head out of your ass",
            "I know this is a joke but I could not be in a place where personal pets especially dogs are able to just wander around openly in working spaces. I love dogs, their love for you is on par with a mother's love, but god damn they're nasty",
            "I love these irony posts as I’m still in school making like $30 an hour lmfao. What I would do to be half these people posting in here about how hard it is to make six figures working average hours with the most insane benefit packages of all time",
            "Is this a joke post? What kind of of place hires a CS major on a hourly basis?",
            "I never understood the unironic versions of this post. Like, you hate your job, but make bank? Then save up a nice nest egg and quit for a job you enjoy lol",
            "Get these fake humble braggers out of here",
            "Vai-te encher de moscas… oh boneco!!",
            "Bro is suffering from success",
            "Damn 🤣🤣🤣 you should quit and write a book on 135 ways to get roasted on internet",
            "Should probably unionize",
            "Work is work",
            "[deleted]",
            "I literally thought this was serious at first because some ppl on this sub do make posts like this",
            "The golden lab is a SVP and does whatever it so chooses",
            "Shut up",
            "Horrible, just horrible. I'm so sorry for you man.",
            "Watched it morph into a troll post real quick 😂",
            "What a winge",
            "For real… this suffering… I can’t bear it anymore :(",
            "What job is this???",
            "The privilege in this shit is insane",
            "lol damn id love to have your problem and make that much .",
            "what a disaster! if they really cared about you they’d let you park in the office",
            "I think even I hate you a little bit",
            "Raise your hand, if you actually believe this is a real post? And if like me, you’re certain that this is bullshit, who has the free time to invented imaginary job in order to solicit heartfelt feedback from hapless strangers on the Internet? Don’t you have any real problems you could actually be open about? \n\nIf this is actually a real post, you are the most ungrateful, narcissistic, unlikable poster I’ve read today (and I was reading posts about religious texts allowing child rape prior to this).\n\nI tend to think it’s fake, because there’s absolutely no reason for a company to allow their employees to go buy purses at Saks 5th Avenue. Unless the owner of the company has like, a daughter that gets commissions there, and they’re trying to help her out? Otherwise that makes zero sense. Plus the type of job you have sounds like a male dominated workplace, male techies generally aren’t chomping at the bit to go shop at Saks for Louis Vuitton purses (give it a few years, we’re halfway there, but not quite there yet).",
            "Nobody said it was going to be easy, suck it up",
            "Troll rating: 6.2/10",
            "[deleted]",
            "donate one of us ur job, go back to college, study gender studies, become the supreme leader of LGBTQ and hold concentration camps to whoever is straight",
            "Boo hoo",
            "If you become a weirdo who likes 90% cacao chocolate then that golden lab won't be a problem for much longer 😉",
            "You should be happy minorities like you get the quant jobs",
            "Man life is soooo hard... i only make 135 dollars an hour.. and omg... i gotta walk 100ft. Omg the birds poop on my car! I have it sooo hard.\n\nMy god guy, do you hear how entitled you sound?",
            "Wow lol",
            "Tambout Sax Fif Abnue bapa? Great store never been there.",
            "Wow, a funny shitpost on here. That means we’re gonna see 100 people copy it for the rest of the day.",
            "I’m so stupid I didn’t realize this was a joke till the Quidditch line… In all fairness though sometimes this sub really sounds like this 😂",
            "Damn, it's hard out there. We really in a recession 😔",
            "With every piece of satire, there is some inspiration from reality. I am very curious as to if there exists posts like this from actual entitled and ungrateful pricks.",
            "Report the company to the Dept. of Labor for inhumane treatment. Nobody deserves the kind of suffering being inflicted on you.\n\nStay strong.",
            "bro no other place is better than this. stay",
            "Please send referral ?! Ot pay sound amazin",
            "Well, earn money, invest and quit when u have earned enough",
            "Ask for a different parking space. Then your day starts with a morning run, and physical exercise boosts your mood. \n\nAnd start bringing some sane food. Your poisoning the poor lab, you cruel bastard!  And if you feel down you can take the dog out for lunch and then you get another exercise.",
            "this",
            "This made me soooo mad for a minute oh my god 😭",
            "Worst part is im sure there were many companies like this during the last 3 years 💀",
            "I feel you bro. Can you send me a couple 100$ bills to wipe my tears? But seriously, you probably have enough saved to quit and find a better place.",
            "You make in one hour what I will make in my entire 8hr shift today",
            "Top tier troll post",
            "I think I'll be working at your workplace tonight\n\nbecause I will be dreaming",
            "Your toes are soggy",
            "Wow your life is so hard for making that type of money lmao quit complaining",
            "don't mean this as a dig, but rather a chance for introspection:  I doubt the root issue is the job.  The benefits objectively outweigh all the downsides.  To me it sounds like you're unhappy in general and it is tainting your perspective.  You will have an extremely hard time finding a job even half as good as what you have really.  Perhaps it's a sign that you should be your own boss.  Maybe you're not made to be an employee.  I'd guess either that or there is something else in your life (could be anything from a situation to an undiagnosed mental health issue) that is souring your thoughts and making it too easy to see the bad and not easy enough to see the good.\n\nI'm a total stranger so I can only go off what you've said, but I'd honestly be shocked if after a lot of introspection you still came to the conclusion that the problem is the job.  I don't mean this in a negative way whatsoever but I think the issue is you, or at least your brain.  \n\n\nEDIT: I accidentally messaged the mods about this comment.  totally irrelevant, sent to the wrong sub.  if you guys review this comment and are confused, it's just because I am dumb.",
            "Pass the job to me",
            "135 ?!?! Dude suck it tf up you have it alot better then most people.",
            "Huh. A guy who doesn't know how homelessness works and is a crazy right-wing bigot complains when his $280k/yr job has minor inconveniences? It's almost like *you're an asshole.*",
            "Riiiiight...",
            "Saks on 5th is some seattle ass shit huh",
            "Now does your work have job positions open in hardware side, like Data Center type hardware or sales? My buddy in IT has a job that pays $100/hr but if he can get something better and a company more stable, he rather have higher pay and more stability. He loves money, so he wouldn't mind money being thrown at him.",
            "Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost Itsjustashitpost",
            "This post isn’t real it’s annoying. Someone is creative writing.",
            "Wtf - listen I get it every job has its positive and negatives but wtf at $135hr and 50% for OT. Suck it up or just move on.",
            "Lmao",
            "u need a change job to monufacture",
            "I’d believe but no C# jobs are paying that much 😉",
            "Please don’t tell me “anti-purse” is an actual, real new “domestic terrorist” right wing hate group",
            "Wow what a flex!"
        ]
    },
    {
        "post_id": "18atcnh",
        "author": "Non-fic-Reader",
        "title": "Cancelled interview on me 1.5 hrs before interview on purpose?",
        "url": "https://i.redd.it/529rj57k7c4c1.jpg",
        "score": 1840,
        "num_comments": 78,
        "created_utc": 1701721448.0,
        "selftext": "Prepared for the interview last night only to see it cancelled in the morning.\n\nI can’t help but notice a pattern that the interview invitation timing (11:30am) and also the cancellation timing (9:30am) suggests that it might have been a scheduled send email.\n\nDid they cancel it late on purpose by using schedule send?\n\nWasn’t interested much in the position either, just wanted interview practice honestly but still mad…",
        "permalink": "/r/csMajors/comments/18atcnh/cancelled_interview_on_me_15_hrs_before_interview/",
        "comments": [
            "If this was Spotify, they laid off 17% of their workforce today.",
            "Sounds like they just cancelled the internship position altogether. Most rejections/cancellations usually don’t hesitate to tell you that they found someone better than you lmao.",
            "lol i had apple do this to me",
            "You’re reading too much into this mate.",
            "It can happen, have been through a few re-orgs. It completely fucks up your internship project. And re-orgs usually comes as a surprise.\n\nEspecially true for FAANG",
            "I was laid off on a Friday after being in talks to onboard an intern that next week. I still wonder how they broke the news to him. I felt bad because I was locked out of everything that morning, I couldn't reach out to him to cancel the offered internship, and I'm sure HR had to send an email just like this to him. Sorry this happened. Common in the workplace. :/",
            "Shit happens - and they were likely told at 8am that the position was gone.\n\nBe thankful that they didn't waste your time interviewing you and then telling you the position was gone. That happens too.",
            "Dodged a bullet; if that is the type of planning organization going on, work there sounds terrible",
            "Back when I did internships long, long ago, they kept mass layoffs/restructuring a secret until the very day and minute of the announcement. They probably timed this letter to be sent at the same time when some exec called in everyone in the office to announce the restructuring. It's nothing personal against you, they just didn't want it to leak early.\n\nFortunately I got to keep my internship but I only had a week left anyways.",
            "name and shame!",
            "Are you international?",
            "[deleted]",
            "> Did they cancel it late on purpose by using schedule send?\n\nNo",
            "I had a company cancel an interview legitimately one minute before, asking to reschedule. I gave them my availability. Then they said the position was eliminated due to funding cuts. Wild",
            "I know this is terrible. I got my internship offer revoked weeks before I was supposed to join the company. That hurt so bad. While all of my friends joined their companies as intended, I lay doing nothing. Such short notice and the terrible market didn’t help either.",
            "Monitor the position. If it’s reposted they’re mining candidates for shit and giggles.",
            "Tell him to fuck off",
            "Name and shame",
            "You can’t “notice a pattern” with an n of 1. Stop overthinking this.",
            "That shit will happen all the time. There was a career fair style interview from 12-4 and they sent an email that they cancelled it at 3",
            "Might not be malicious. I know some people at work who don't like to send emails after hours, so they schedule them for the morning. Or some people that start at specific times or schedule times to look up emails and type up and send important emails the minute they start.",
            "I don’t know why this sub is showing up for me (former biotech technical product manager, majored in molecular biology). But the tech job market is shit right now due to layoffs so they probably are being 100% honest and are telling you as soon as they could get themselves organized to once info on cuts was made known to the rest of the company. It’s not something they really let out until they’re ready to cut things as cutting positions like that without some sort of internal PR plan would cause worker confidence to falter",
            "Who is it?",
            "\"Cancelling the internship, only the real ones know why. Nobody hmu\"",
            "Omg same, but 15 mins before the interview",
            "Happened to me once found out from an inside source that the specific project for which the internship was advertised had lost funding.",
            "This would be a too elaborate and easily falsifiable lie. I don't think they would need an excuse like that to cancel on you.",
            "This has been the norm for me for the past couple months. I keep making it to the final interview stages, then out of nowhere, I get a message theyre restructuring and they will not be hiring till Q1 2024",
            "Bruh they chose someone else. Move on",
            "I had no one show up to my interview and when rescheduling they decided to cancel the internship",
            "Idk exactly why the position isn't available... the job market has been turbulent.\n\nAs far as the short notice goes... bro probably forgot he was having the meeting until he checked his calendar after stand up.\n\nSorry it went down like that."
        ]
    },
    {
        "post_id": "l781w2",
        "author": "j1u9001",
        "title": "Citadel vs Melvin Capital internship",
        "url": "https://www.reddit.com/r/csMajors/comments/l781w2/citadel_vs_melvin_capital_internship/",
        "score": 1828,
        "num_comments": 81,
        "created_utc": 1611866259.0,
        "selftext": "Hi guys, so I got an offer from citadel and obviously the tc is really high, but there’s this new innovative hedge fund on Wall Street called Melvin Capital, which is backed by multiple high profile hedge funds. They gave me an offer recently and even offered to pay me in GME shorts, which could be worth many times what it’s currently worth since that company is gonna go bankrupt anyways!\n\nCitadel TC: 13k/month\n\nMelvin TC: possibly infinite\n\nI think I will go with Melvin but any feedback is welcome guys!\n\n^^^Posted ^^^from ^^^internet ^^^explorer",
        "permalink": "/r/csMajors/comments/l781w2/citadel_vs_melvin_capital_internship/",
        "comments": [
            "Love the crossover on my feed. Well done my man.",
            "Citadel, they got $30b. Maybe less now 🤣🤣",
            "Top ten reddit crossovers",
            "Neither, apply to robinhood.",
            "Take both internships without telling the other company. Sneak into the offices late night and cancel the shorts. You’ll be the hero we all deserve",
            "Both will close shop coming week. Sorry, but you have to get another offer.",
            "[deleted]",
            "Choose neither. Intern at Gamestop instead, and ask to get paid in $GME stocks/calls 🚀🚀🚀",
            "very nice.",
            "lol i love it u funny",
            "Your post is like GME, going to the moon.",
            "Looking at these kind of posts make me depressed. I barely struggled to secure an internship paying 5k/month, and this guy is debating between 13k and infinite. I'm done",
            "LMFAOO I love this lol!",
            ">possibly infinite \n\nsorry but melvin capital is lying to you. the maximum gain of any short position is only 100%",
            "Well done sir 🎩🧐👏",
            "Apply for internship at r/WSB and take AMC GME to the fucking moon",
            "Jesus lol",
            "Bro reject both. GME TO THE MOON 🚀 🚀",
            "MELVIN NO CAPITAL 📉📉📉",
            "to Jupiter and Mars 🚀",
            "$GME 🚀🚀🚀🚀🚀🚀🙌🏻💎🙌🏻💎. 🦍 STRONG TOGETHER",
            "Definitely accept the offer! And then punch the CEO in the face during your face day at work!",
            "Lmfao as a Software Engineer who used to work at Citadel, this was hilarious.",
            "\\*Chef's kiss\\*",
            "imagine the company is actually shorting GME to pay for this guy's internship employment :D they are getting screwed over an intern",
            "Apply to Tyson Foods for unlimited tendie compensation",
            "Apply to the SEC instead and help put these guys in jail.",
            "Do some speculative internship acceptance\n\nAccept both on under the assumption that us degenerates will hurt one of the companies enough to cancel their internship program\n\nez clap",
            "Can you provide some guidance on how to get internship at Citadel?",
            "More like \nPosted from Netscape navigator.",
            "I can offer you an internship at the WSB hedge fund",
            "lel",
            "Do they own Robinhood?",
            "I read this and I was like either this is the wildest coincidence ever or a hilarious meme",
            "[deleted]",
            "is this a software engineering role or what?\n\nand how to get into these companies.\n\nI am from India, can you guide a bit ?",
            "APES. TOGETHER. STRONG.",
            "I’m happy to see my that we all have the same interests",
            "They are going to pay you in shorts?\nDo you realize what is happening right now?",
            "I cackled. Needed a good laugh today, thank you!",
            "LMAO this aged like MILK. Gamestop is never going bankrupt. GME to the moon 🚀🚀🚀🚀🚀",
            "You should become a whistleblower and be set for life.",
            "Alhumdulillah, racism is haram",
            "."
        ]
    },
    {
        "post_id": "160ff11",
        "author": "Potential_Leg7679",
        "title": "I thought the rumors of CS being full of geeks was over-exaggerated but holy cow...",
        "url": "https://www.reddit.com/r/csMajors/comments/160ff11/i_thought_the_rumors_of_cs_being_full_of_geeks/",
        "score": 1817,
        "num_comments": 292,
        "created_utc": 1692913884.0,
        "selftext": "So I started college this week as a freshman, went to all my gen-ed's and everyone was chill, contributing to the lecture in healthy doses and providing a very comfortable classroom environment. Then I stepped into my CS class and it was the complete opposite. It was a free-for-all of unhygienic geeks talking over each other, during the lecture this one kid was constantly butting in and trying to add his own details along with unfunny nerd jokes that nobody laughed at except the professor in a form of pity. All the rest of us stayed quiet whilst the loud guys gave nobody else a chance to answer ANY questions. There was a palpable feeling of cringe in the room the entire time.\n\n\nI had heard the rumors but didn't think my CS class would feel like a literal Star Wars convention... please tell me these guys get weeded out pretty early lol",
        "permalink": "/r/csMajors/comments/160ff11/i_thought_the_rumors_of_cs_being_full_of_geeks/",
        "comments": [
            "First few weeks, those guys are all peacocking and trying to assert themselves — give it to midterms and they’ll get quieter and quieter as their first marks start rolling in.",
            "Tech has always been full of geeks. That's like walking into a business classes and being shocked by the number of upper middle class white guys.",
            "You should've seen covid zoom classes. It was pretty much twitch chat.",
            "I'm in my senior year of CS, I generally don't see those people anymore. Most of the people I talk to are generally laid back. \n\nBy the point you're in the final classes, people know you are able to answer/figure out what's asked of you.",
            "Yeah you’ll have to deal with that for a good bit but it gets better, a good portion of CS majors quickly develop awareness for how bad their hygiene is in the first year or 2.",
            "I remember joining my first intro to CS class and our first assignment was to pretty much print to the console and do some basic variable manipulation. When our professor was explaining the assignment to us, a kid with the most obnoxiously nasally voice asked, “Uhhhhh, can we use arrays on this assignment?” And the teacher just glared at him and asked why on Earth would you need to use arrays on this fucking assignment. At that point I knew that CS stereotypes were in fact real…",
            "[deleted]",
            "There was this guy in Data Structures that every single day would roll out this giant anime girl mousepad. It was this extremely over sexualized giant pad. He also had anime stickers all over his laptop.\n\nHe failed and I never saw him again.",
            "as a massive sperg i shall volunteer to teach all the neckbeards hard life lessons. my lessons will cover: 'on the virtues of showering', 'the 57 types of smiles and what they mean', 'no, they're not flirting, they get paid to greet you', 'other people have thoughts, too', and much more!",
            "[deleted]",
            "> this one kid was constantly butting in and trying to add his own details along with unfunny nerd jokes that nobody laughed at except the professor in a form of pity\n\nthis is a canon event",
            "I met one of these guys in a math class he was a senior and he was so annoying and the class was hell to the level that even the professor started to make fun of him cuz he was so extra. But from my experience, I feel like those ppl are rare cases and the exact opposite from smart they just act to be and you can easily put em into their place even in the very thing they claim to be good at and they are also not normal between the nerdy ppl community or anything so ignore it. It’s not gonna be always like this over your four years experience.\n\nThis guy I’m talking about dropped after two weeks and the class was chill and good vibes for the rest of the semester from the students who were actually smart and positively contributing in the class discussions with our very cool professor.",
            "I tried to ask a guy next to me a question in one of our hands on classes and he looked at me and barked at me. You meet all sorts of characters in CS lol\n\nI’m working in industry now and it’s a lot better though",
            "I’m dreading career fair for this reason. It was musty as fuck last year.",
            "What uni/college (hell even country is a good hint) is this?\n\nWhen I took 101 people just shut up and took notes, and those who already knew what they were doing just ignored everything and probably stopped showing up in a week or so.\n\nSmall classes I take it? If anyone was causing a ruckus in the lecture hall there'd be complaints to follow real quick. Or maybe I'm just old.",
            "> this one kid was constantly butting in and trying to add his own details  along with unfunny nerd jokes that nobody laughed at except the  professor in a form of pity.  \n\n\nDamn poor kid, did you have to do them like that? lmao",
            "Yes they get weeded out almost instantaniously",
            ">please tell me these guys get weeded out pretty early lol\n\nHaha, yeah that guy is the sysadmin in your company and essentially treated like a god because if he gets fired 1/2 the systems will shut down. \n\nThose guys don't get weeded out early, certain companies they make up 90% of the engineering pool.",
            "Now fast forward to when they’re forty years old…",
            "[deleted]",
            "What did you expect?",
            "I don’t mind the geekiness tbh but just wait till you start noticing those that try to belittle everyone else. They usually treat you like you’re incapable of anything for not knowing as much as them. Yes , unfortunately, the hygiene think is real. Here in California you get a lot of people with swamp ahh",
            "this is why i never fucking go to lectures man",
            "Stereotypes don’t exist out of nowhere",
            "I've experienced this as well. I feel there are a lot of social rejects who believe \"I am misunderstood because I'm smarter than everyone else.\" Usually they have no evidence to back that up and spend most of their free time playing video games / consuming media. They picked CS because they like video games and think they will become a game developer.\n\nUsually they drop out after realizing that snapping together a gaming PC doesn't mean you know anything and it requires actual work. Then they go back to Mama's basement. In the workforce it's mostly normal guys who are slightly shy / nerdy.\n\nThose who go to boot camps are similar but are often less nerdy but more lazy / burnouts who think they found a get rich quick scheme and are \"beating the system\".\n\nI work with one of the bad ones. He's incompetent and believes anything he doesn't understand is \"over complicated\". He's unwilling to learn anything new because of his arrogance.\n\nThe rest of my team is humble and we all learn from each other. We are all capable of going to meetings and acting like normal adults.\n\nIt is a hassle dealing with a lot of these arrogant / obnoxious people but you should realize that if you are humble and able to work on a team you will have a huge advantage in the workforce.\n\nI love my job but I do wish there were more people with other interests besides gaming. A lot of people look down on me for not playing video games, they treat me like I'm an outsider or something haha.",
            "It attracts the gamers. I game myself, but only play awful games where u have to try to get good (league, csgo, etc.). The single player mutts and pseudo intellectuals will die during calc 1 or 2.",
            "Yeah theres a place for them in our field.\n\nYou have 2 kinds of developers: the monkey in a box that never does anything other than tickets. They are generally an optics nuke or too autistic to put in front of any customer/management types for requirements and demos.  Sometimes these guys become your context masters on old projects because they can make some nuts solutions.  Oppenheimer wishes he made this non-lethal cringe nuke instead of the bomb. \n\nYour second type is the rizz king. Nat 20 persuasion check. They should be speaking and in leadership roles, and sometimes they only get the job because they can do the technical really well because leetcoding is easy; but because leetcode sucks for actually evaluating a dev, they might still be useless as an actual coder.\n\nBoth of these guys have their perks and you should put them in their spots on your team.  If you have an autistic rizz king, they’re probably the only thing holding that project together.",
            "Honestly it’s true lol.   Feel like cs major is full of weirdos who are way over competitive.  There’s usually like five “normal” people in each class who find each other.  \n\nGood news is the real working world isn’t like this, people are normal there.",
            "In the real world people won't hire you if they don't like you. So zero skill points in empathy and social skills will screw these guys over. No one wants to work with a (1) know-it-all (2) incompetent people (3) people with zero 'emotional' intelligence. They should honestly have a class for all the autistic people in comp sci teaching them basic normie skills and fail everyone who acts obnoxious in the class. It would probably increase their employability more dramatically than their entire 4 year degree.",
            "Just wait until you notice how many dudes there are…",
            "I don't know if this is a CS thing or a 'gen ed' thing. I took a gen ed philosophy class and it was pretty chill. I liked it and thought I'd try to pick up a minor in philosophy.\n\nMy second philosophy class was almost exclusively philosophy majors and they exhibited all the same 'look how smart I am' behaviors.\n\nAnyway, I know the conventional wisdom is 'They are insecure and the really talented students don't feel the need to participate in such things'; in practice I found that's rarely the case. I mean, it gets better...most of them will calm down, but it's also likely that some of the most annoying will also be some of the most knowledge.\n\nThey've also tied feelings of their selfworth to their performance in class. It might not be healthy, but it is a great motivator. They will 'try hard', study a lot, spend extra time on the assignments, etc etc.\n\nThe arrogant 'My Mom said I should be a programmer because I got the printer to work' types will shut up real fast once they realize they don't know anything...but I found them to be a much smaller issue than the arrogant students who were actually really good students.",
            "Hmm. I took a some CS courses in community college. Nobody seemed to want to speak. I almost wish there were some unruly people being vocal in the class. It was embarrassing when the instructor would ask a question and everybody was trying to hide.\n\nI do remember back at my 4-year college, taking a physics course, and some dude thought he knew a lot and was pretty vocal. It was amusing. Some other students did not agree, and started yelling at him to STFU.",
            "Yup. Came into school for CS at 22 from the Marines. Definitely a different type of person than I was used to being around.",
            "The classes get harder and some students can’t keep up so they change majors. This does decently well to weed out some of this behavior but it’s generally the case that CS is for geeks because they’re the only category of people who are told that this is for them. \n\nA good professor will be able to influence their students. For example, my Data Structures and Algorithms class (one of the first rather difficult roadblocks in the CS path) a student sat in the very front as close to the professor’s podium as possible. He had an answer to every question that nearly always was more detailed than needed. The student would also often just blurt out an answer, hamstringing the rest of the students in their ability to contribute.\n\nAs a result the professor would often quietly and calmly interrupt the student and ask him to please raise his hand if he wants to respond. It’s a good thing that the student wants to participate but the professor recognized that everyone should have a chance so he’d often generally let students answer once and often ask for “new hands” to allow other students who hadn’t participated yet to do so. If no one new had a suggestion then he would allow the overachieving type to answer and refine his answer afterwards into something we could all understand.\n\nIt seems to me like someone like that may have some condition of ADHD or autism or something being that he was unable to grasp the social queues given by the context of the professor not choosing him as frequently as the student may have liked but the professor did well to handle the situation appropriately. I think this is absolutely key. \n\nSo yeah it definitely gets better as you get deeper. Freshman students are figuring out if this is really for them and forming social bonds through humor or references is one way that this can be done. More experienced students are more solid in their ability to behave appropriately but at the same time CS is just a nerdy industry so it may be worth getting used to the idea that the majority will probably always be rather nerdy. It’s just that students mature over time and can still be nerdy but not so rude.\n\nThis seems like a “these students are freshman” problem rather than a CS problem imo",
            "I'm an old man, went back in my late 30's to get my CompSci degree and I luckily saw none of this. Everyone was on the up and up and mostly, not overly nerdy to the point where you want to punch someone.",
            "This is very true even after 5 years. I stopped trying to socialize with people in this major except a small group of friend i made the first year, which most of them actually stopped studying cs and moved to a totally different field.\n\nI stopped going to lecture, did the assignments and went to exams and went on with my life",
            "It’s true in the workplace as well. Run if you’re normal",
            "Honestly, it's going to vary a little depending on your school. Try finding upper division courses, and pop in to just listen during the lecture / audit the course a couple of times throughout the semester. Vibes absolutely will change as grades hit",
            "Those are the guys that are either geniuses with no social skills, or think they're geniuses, also with no social skills",
            "It's the quietest people who are the best. I should know, I made friends with all of the top programmers of my year (not necessarily the best grades but most ambition outside of class) and they all for the most part sat aside while the others were yapping about. Hoping the situation is more clean this next year, I start 2nd year in a couple weeks :)",
            "It doesn’t stop… did an internship this summer and some of the SWE interns had no filter, no social awareness or EQ, and absolutely couldn’t carry on a conversation. Felt like I was living in a TikTok with their attention spans. Starting to realize how big social skills are in the work place and just in a public setting (like a classroom) in general, very much needed and I think COVID + TikTok (social media in general) really has thrown a wrench into that.",
            "\\>please tell me these guys get weeded out pretty early lol  \n\nThese are ubermenscks . Theyll be there till the end",
            "I never had that experience in any of my math and cs classes…… the smelly thing is a rumor though for sure. Haha",
            "So yeah, we're all dumb they are just having their 'periods', it's gonna pass. Or not...\n\nhttps://preview.redd.it/9reb77o4t5kb1.png?width=888&format=png&auto=webp&s=13014cb3408ecf06106e44be5f2fc4bb96f0e230",
            "When did you get the OA?",
            "Senior year it gets…. STINKY.",
            "At my school the CS students are antisocial delusionals. Took a CS class i needed for my financial modeling minor. The professor wanted us to break off into groups and form study mates, but she used the word  \"friend\", this fat guy freaked out.",
            "First off, congrats on your journey. Secondly, I’m sorry because CS brings in a broad range of people. I graduated with a CS degree in 2021, and I definitely met people from “I shouldn’t be here” to “I have a server in my apartment to host applications” to talking in memes and cringe. You’ll still meet great people throughout your time. Try to find a group you can click with. You guys will want to stick together when your projects get wild.",
            "Of course, what did you expect? Engineering and CS in general attract social rejects, coding in your room all day is not exactly something your average good looking neurotypical person is going to want to do. They go outside and socialize and get validation and have sex with girls",
            "just find one other normal person! then you get to make fun of the dorks and it's funny.",
            "It's the same after 5 years. I made a small group of friends the first year, but most of them actually moved to a totally different field. The stereotypes are true.\n\nI stopped trying to socialize with people in this major and stopped attending classes, I just went to exams and completed assignments on time, and I went on with my life.",
            "Once you're in junior/senior year you will be surrounded by much more chill people. There might always be that one guy that's a complete weirdo, but for the most part majority are normal. Don't pay attention to the guys that brag 24/7 about their coding stuff either, focus on yourself and studies. Also make the gym a habit if it isn't already.",
            "Yeah some people are saying it gets better. It doesn't.\n\nThat said you will deal with much worse than awkwardness when you enter the workforce.",
            "> I had heard the rumors but didn't think my CS class would feel like a literal Star Wars convention... please tell me these guys get weeded out pretty early lol \n\nNow from what I've experienced there's 2 types of these nerds: \n\nThe first one is the gamer, who thinks they are fit to study CS just because they sit on their computer and play video games all day. They get weeded out because they are usually dumb lazy bums with very surface level CS knowledge (enough to gloat in the first semester) and never expand on it.\n\nThen, however, there are the nerds who coded since they were 10 and are genuinely passionate about CS. They are also socially unaware and obnoxious, but they will always be better than you. \n\nFor my uni we lost about 70% of students along the way and most of them were gamers, weebs, or people who were in it solely for the money. I'd also say the remaining nerds got a bit calmer over time. So yes, it gets better. The distribution shifts so there are more normal people and the remaining nerds get less obnoxious.",
            "I'm happy this was never an issue at my college. Everyone in my class was normal for the most part. There were geeks but nothing cringe. Some people brought their gaming devices and played games between class. Other than that everything was normal.",
            "And this is why I attend online lol",
            "The lack of self awareness from OP is telling. \n\nRemember you ARE one of the “geeks”",
            "“I’ve been coding Python since I was 10 years old, CS is so easy.” “Wait, we have to do math in this course??”",
            "I had to take a single CS class for my associates and it's a different breed for sure. Lots of unkempt young dudes. Baggy clothing resting on chubby formless bodies, head hair sticking up, scraggly facial hair. \n\nOne guy wore the same Rick and Morty shirt every class we had (2x a week). We were doing a lab and something on his computer wasn't working correctly one time and he yelled \"god fucking DAMN IT!!!\" and slammed his fist on the keyboard, breaking the keyboard.",
            "It is like that, and honestly it was hard for me to make friends with many classmates in college. I would highly recommend making friends with non cs majors, even other engineers are lots of fun, I found it’s almost exclusively cs majors for some reason.",
            "They get a lot better really fast or they drop. Most of the people I’ve met in my upper levels in undergrad have been very professional and sociable people.",
            "Yeah, been there. Cant wait to graduate so i can get away from it. They are all tryhards and it messes with your confidence. Im just tryna be a normal , chill dude and i feel like its rare in CS lol",
            "Just wait until you enter the workforce, you'll be in a team of people who are often quite smart but have literally zero awareness. They'll be asked to give a presentation on their work, or describe some process to non-technical individuals, and they'll delve deeper than a dwarf into the intricacies of Haskell compilation for 45 minutes and be completely unaware that literally zero people in the room give the tiniest of fucks about what they're talking about.\n\nThe idiots will get weeded, but the socially awkward nerds will not. If you want to make more money than them, make sure you can at least grasp the basics of whatever specific rabbit hole they're diving down and then explain it in layman's terms to stakeholders, and you'll be first in line for promotions.",
            "I’ve interviewed a fair number of these guys (they’re always guys), who will even get into arguments with you in interviews. They can be crazy opinionated about things they only half understand. And mostly what they make painfully clear, is that they have no idea of the real world business implications of a lot of tech. Nothing makes you less hireable than that imo.",
            "Half of them will drop out, so there's that at least",
            "Theyre not even that smart compared to math and physics\n\nEmbarassing is right",
            "I call those kids \"commuters\"",
            "My experience completely contradicts this. Most of my classmates have some nerdy interests, but are were hygienic and overall pretty fit. Exercise was common, and interest in sports and similar was high. In fact, most of my classmates reminded me of \"brogrammers\" from the Silicon Valley show lol.\n\nOne thing that held true was the overwhelming representation of white cis males. Very few women, but those who were in the program were hygienic as well, and many were quite cute lol.\n\nMaybe my school is an outlier?",
            "lol majority of your classmates won’t even be working as software engineers once they graduate. Only a small minority who know their sht and are competent will get a swe job",
            "It really is unfortunate we have to share a major/career with the cringiest and unhygienic people.  It’s like they can’t even help themselves because something always comes up on the first day EVERY SINGLE SEMESTER.  I swear to god sometimes they’re not even coding lmao, but what people do when they fake hack something as a joke and just slam their paws on the keyboard at Mach speed",
            "This is why I’m not totally against diversity hiring for women. A lot friendlier and easier to work with then your avg CS urkel\n\n\nUpdate/Edit: the Urkels are mad lol",
            "I don't see the problem with it. I was always more of a athletic/jockier guy but thought it was fine. Dont like band kid types though",
            "Everyone's just excited to be around people that they assume have similar interests to them, and excited to learn about something that interests them for once. \n\nIt can be surprising if you spent a lot of time and energy trying to fit in and be popular in high school, to suddenly learn none of that matters in the real world.\n\nSounds like you're the odd one out.",
            "I think you are not using the term nerds and geeks correctly. What you meant was anti social, or akward people. Some one can be a nerd, a geek and be social in a good way.\n\nAlso, news flash for you, yes most people on computer science amd software engoneering are nerds who would of thought. *insert shocked pikachu meme face*",
            "itll last for like 2 years, then the students get better and way less awkward. Took me till junior year to start seeing NORMAL people in my CS classes that could actually hold a convo and wouldnt only talk about coding. My freshman year i literally had to move seats because i couldnt handle the smell from this fat kid, i dont know if theyre self aware or just oblivious to the world",
            "Lacking hygiene in what sense?",
            "It's the first year man, they get filtered out later",
            "Not everyone is a brogrammer lol",
            "What a whiney post",
            "This is not very nice potential leg. Maybe cs isn’t for you…",
            "a lot but not all who behave this way get weeded out, they're not as smart as you think they are",
            "I know exactly what you mean lol",
            "They’ll never say anything funny. Usually when anybody laughs at their “jokes” which are really lazy references to gaming/anime etc, it’s because it brings up a sense of community.",
            "people figure it out better…the quieter ones are usually the smarter ones",
            "> please tell me these guys get weeded out pretty early lol\n\n Nah, it's the reverse, it's the non-geeks who quickly discover they have a skills problem as soon as they hit the first discrete math or DS&A class.",
            "The only way around this is to sit in the front row and pretend they aren’t there. If you get to know the professors they may just call on you.",
            "Stereotypes exist for a reason.",
            "Yes my classes everyone is a know it all its very annoying",
            "Star Wars convention xD. So true tho, best to try and make friends outside of class lmaoo.",
            "Wait until the upper level CS classes.",
            "one of the worst smells i've ever had to endure was from a cs girl. she was also the daughter of one of the professors. i was a TA and she'd come in on saturday mornings to show the work. it...was...horrific.\n\nat my school there were way more girls in comp eng than comp sci. less nerds...more realists.",
            "Most people that talk the most are not very good. Wait till second term to see them quite down .",
            "They won't get weeded out likely. But, if they don't change their demeanor, like talking over people and being arrogant, unless they're like a God-tier coder usually they'll have a hard time passing behavioral interviews, because they tend to overlook that being likable is also part of getting hired.",
            "You can just say exaggerated.",
            "Oh god, I'm teaching first year students in a week. After years of only teaching older students, I almost forgot how bad it can get. \n\nThanks for the reminder.",
            "it only gets worse as the normal ppl flunk out unfortunately",
            "Surprisingly in all the CS classes I've taken, I've never had an annoyingly loud or smelly kid.",
            "😂😂😂",
            "Was a guy at my school that wore a clip on tail",
            "Usually in the first year, you'll see lots of peacocks hanging around. But once the second semester or second year starts, some of them will be out.",
            "Is it strange that I’ve not had this experience in any of my CS classes? At the very least no one has been a nuisance.",
            "I definitely see what your saying but as you get to the higher level classes there is much less of the “obnoxious” type.",
            "It’s usually bad in the first few months then the worst one leave CS because they find it too difficult",
            "I go to a community college.  Haven’t noticed anyone who is hygiene challenged yet in my CS class but there are three people with blue hair in a class of 35 which I found to be funny (I used to have blue hair).  I went back the second day of class and one of the blue haired kids dyed his hair green and was mean mugging the girl with blue hair.",
            "I was in the same boat mate. First week of uni I tried to socialise with the people on my course but eventually I gave up and have made my friends elsewhere😂",
            "There’s no way everyone on this chat is agreeing and complaining, and not a single redditor is admitting “yeah that was/is me”",
            "There are two types of these peacocking students. 1) Ones that are really fucking average (or worse). These ones will shut up when they realize that they are really not very good at this. They usually form clusters with other average peacocks and try to have a “who has a bigger dick” competition with them. These ones will leave you alone.\n2) The ones that are actually competent. They should also quiet down once they realize that some of the other students who don’t need to be so cringe can perform as well (or better) than them",
            "bunch of 17/18 year olds that don't have a parent pestering them to shower everyday does that lol",
            "State school I presume?  I went to Sac State for a couple weeks and even junior level classes were like being in a room with out of control High Schoolers.",
            "Thank god I’m taking my first two years online",
            "I feel like my experience has been that everyone is silent. No one answers questions or talks to each other. At least not for most of the semester, around the end they start to warm up to each other. I often end up answering the professors questions because otherwise we just sit in awkward silence",
            "What options as a US student do I have for obtaining a degree online from a reputable university? Because frankly these scenarios scare me.\n\nThank you.",
            "Probably doesn't need to be said, but do everything in your power to avoid working with these guys on projects. Miserable experience every time.",
            "It’s to assert dominance. Usually by senior year 90% are gone",
            "They don't get weeded out, the nongeeks do. You should also expect all your future coworkers to be exactly like this as well. If it's uncomfortable abort the mission and pursue something else.",
            "A lot of them will not get weeded out, but they'll be here in 3-4 years asking why they can't get any internships or job offers despite their amazing leetcode skills.   Then people will ask if they bathe or shower or have any social skills and be downvoted for it",
            "> please tell me these guys get weeded out pretty early lol \n\nI think they just grow up over time. Keep in mind that almost everyone in that room is 18 or 19 years old\n\nI've been working as a developer for a bit over 6 years so far, and this behavior is long gone from everyone I work with. Even the new grads. Or, at least I'm fortunate not to observe anything like that in my corner of the industry\n\nI think every generation of CS people discovers the same jokes, e.g. \"vim vs emacs\" \"tabs vs spaces XD\". And similarly, they will learn get tired of them as well",
            "I was lucky enough to have most my introductory cs classes online. Don't get me wrong I've still had exams where I'm sitting in a packed lecture hall and felt like I've needed an alternate time because of how bad the smell has been. If you're lucky your prof will add a hygiene clause to the syllabus",
            "Nope, also it's just as bad in math, if not worse. Honestly the solution here is just to stop going to lectures lol, most cs courses are easily completable with just online material.",
            "u got me worried - starting as freshman in CS. I'm an athlete and social, how am i gonna make friends?",
            "As far as the guys being weeded out that’s not going to happen.  If anything it seems like you’ll get weeded out with that mindset.  Not only are students what you would consider “geeks” young American born faculty are honestly probably geekier than the students.  Yes there will always will be people who are annoying but I don’t think that’s unique to cs I’ve had similar experiences in non-cs courses.  As far as hygiene idk.",
            "I dropped out of CS and I'm so much happier now in finance. I like social people who have a life. No offense.\n\nWish I quit sooner.",
            "I came into uni without much of any experience in CS and there was an ungodly number of fresh CS students who clearly had some personal experience and the ego to pair. Funny thing is, despite my 40-person CS1 class being filled with these kids, only myself and one other person passed our first practical exam.",
            "In my first 2 day orientation I was with the geekiest group I had ever seen. I'm somewhat nerdy but still felt very out of place. As soon as school started it was much better and continued to get better throughout school.",
            "I work with an engineer whose hobby is full on competitive medieval combat. When I found out it barely phased me since most of us are weird AF in our own ways.",
            "Get over yourself dude",
            "keep in mind there is a higher percentage of students in technical majors who are neuro-diverse. Think of it as a good opportunity to learn to interact with vastly different peers.",
            "Yeah about your 4th semester all of those dudes are gone and they’re yelling into the wind about how smart they are and how unfair it all is, meanwhile you’ll be chugging along. It ain’t about being the smartest. It’s about being a hard worker and humble. Carry that and you’ll go further than you can imagine. Don’t engage in wasteful idle chat about drama. Who gives a shit. That won’t give you the middle / upper middle class dream you have.",
            "Was the opposite for me - everyone was super chill (150 people so I can’t be for sure) and no bad odor lol",
            "harsh truth: most of them will get weeded out because they are way to over confident in their abilities, but some of them (a very small amount) are legitimately smarter than you and are just assholes about it.",
            "+1 on the unhygienic part, like Jesus christ you do know shampoo and conditioner are two separate things. As well as you can't wash your face with the bar of soap..",
            "Imagine joining a field specifically known for attracting socially stunted outcasts, and then getting upset when the people around you aren't literal chads... jesus christ, wtf is wrong with people that they cant have a single ounce of sympathy for someono who genuinely doesnt know any better because of the lifetime of bullying and ostracisation they have received."
        ]
    },
    {
        "post_id": "1bihmqm",
        "author": "None",
        "title": "Y’all need to start networking. Sorry ",
        "url": "https://www.reddit.com/r/csMajors/comments/1bihmqm/yall_need_to_start_networking_sorry/",
        "score": 1807,
        "num_comments": 304,
        "created_utc": 1710846417.0,
        "selftext": "Does it suck that it’s harder to find a job? A lot. Are there jobs out there? Yes, obviously.\n\nAspiring software engineers don’t exactly fit the stereotype of hard networkers, but unfortunately, that is how you are going to get a job.\n\nI know I’m going to get downvoted into oblivion because no one wants to hear that they need to network. Everyone hates networking. I hate networking. But it’s necessary and going to get you a job.\n\nRemember, networking is just getting people to trust you. How do you get people to trust you? Meeting new people. How do you meet new people? There are a million ways to do that, and they all suck. But they’re necessary. \n\nI’m ready for the hate\n",
        "permalink": "/r/csMajors/comments/1bihmqm/yall_need_to_start_networking_sorry/",
        "comments": [
            "But I took a class on TCP/IP already!!",
            "[deleted]",
            "“Leave your house” “Talk to someone” half of this subreddit already gonna give up lmao\n\n(for the record I agree with your points and did in fact land a role from a hackathon)",
            "There’s a post like this once or twice a week in this sub and every time they say it’s an “unpopular opinion” it can’t be unpopular if it’s always here. There should really stop being a mindset of one thing is the reason people aren’t getting jobs. It’s usually a combination of things. And some things are easier to fix than others. Networking is just another one of those factors. Some people may find networking easier especially living close or on campus, or in a city where events are always happening. Others may struggle to even find anywhere to network. Not to mention the whole mental aspect of it. It’s belittling when you don’t know the factors that play into everyone’s situation.",
            "I sent out about 100 apps with a stacked resume and wasn’t able to land a role and felt very stuck in the rat race. Went to one career fair and was able to get an offer after genuinely vibing with the recruiter for about 20 minutes with no leetcode / them even looking at my resume. I don’t think I’ll send another cold app again, def not the way.",
            "We should go touch grass!",
            "Network = Networth!",
            "Good book recommendation: “How to Win Friends and Influence People” by Dale Carnegie",
            "I agree with you... After I graduated, I applied 800+ no luck maybe 5 interviews top. I tried networking and was able to get chances higher and much easier imo and that's how I landed my current job cuz I messaged to hiring manager from job post I saw.",
            "[deleted]",
            "I got two calls (didn't materialize into offers though) so far and both were not in companies where I applied through referral. I'm quite social but I believe at entry level only networking is not going to help and lack of networking is not the only reason you don't get the job. Visa plays a bigger role than networking.",
            "I feel like while networking can be important, this is pretty unactionable advice especially given how socially inept some people are. So for my socially inept friends here is a guide.\n\nOption 1: Simple start messaging recruiters and cold calling companies. The tag line would look something like\n\nHi my name is X, I am a student at Y. I have some insert experience or projects example that is relevant to Z role. Would you be willing to have a quick chat about B role at your company?\n\nYou are really just playing the numbers. I haven't personally done this, but one of my friend swears by it and he works at Citadel now so...\n\nOption 2: Attend events and network for the long haul\n\nThe easiest referral you can get is from a friend. You wont feel awkward asking for a referral from someone you've known for a while. The best way to make friends in the same field are places like hackathons, CS student union, CS classes, maybe some sweaty LOG lobby, etc. You are making friends with people who don't currently have a job, but will in the future. The more people you meet, the more people you can get a referral from when inevitably one of them gets a job in the future.\n\nOne of the problems I've seen people mention is that they don't know how to stay relevant to these people. Example, they met at a hackathon once two years ago, but they don't think the person will remember them. This my friend is what LinkedIn posts and Instagram stories are for. You may not have talked to the person in a while, but if they still have you added and you post once a month or something, they'll probably remember you.\n\nEven if they don't, typically most people will just give you the benefit of the doubt.\n\nOption 3: Ask friends of friends\n\nThe most significant referrals a person can typically get are not primary connections, but secondary connections. So not your friend, but your friend's dad or something like that. Many people who go to university have professional parents working at mid to large sized companies. If you are friends with their moron of a son Jimmy, they will be willing to give a reference to Jimmy's friend (You).\n\nI hope this was insightful, now go forth and make friends. Like anime has taught you, friendship is magic or some shit.",
            "The reality is that the fundamental reason the hiring process exists is to increase the chance of hiring a trustworthy candidate - but if you are already someone that is trusted (by someone internally) then your odds of bypassing part of the hiring process go way up. Building skills is definitely important, but don't forget networking.",
            "I can’t agree more! I got my current job from networking & referral!",
            "What happens when you've  been  doing that for over a year and still can't get a job?",
            "For anyone dreading this, networking doesn’t have to be showing up to some formal event and schmoozing. I got my first job through a guy I played League with back in the day. My friends and I have gotten referrals through people we met as part of a rave group. Etc. If you have other friends who are SWEs and hang out with them (either online or offline), you’ll expand your network naturally, albeit at a slower rate than actively going to professional events or reaching out.",
            "Can we all agree that going to a meet ups and networking in general will positively impact your chance of finding a job? And of course it is not the only thing you need. You need a solid portfolio, well written CV etc. \n\nWe have to start treating software engineering jobs like any other job now. Cold applying to a job is not enough for most sectors. For example  If you want a good law job all you have to do is start networking before you graduate. And please do not regard to those “ I got my job via cold applying posts”. When did you get your job via only cold applying? Probably before 2023.\n\nIf you are choosing or have chosen this career as it is an easy way to get paid good or you love playing video games and spending a lot of time on your computer, I am warning you, you will find hard time finding a job from now on.",
            "Stop pushing this. Nobody wants to befriend some sweaty guy who thinks his life depends on networking. The only reason networking worked for me is because I am chill about it, and approachable. Yes, I never approached anyone. Even if you get an interview with networking, you won't be the only person interviewing, and in the end the best one will be chosen, so you have to git gud. Be actually good at your craft, and not just a whiny bitch who cries about others having better friends.",
            "While I agree and got my first job last year through the same, I hate the knowledge that the same CS guy who is good enough at networking to get a job through it would've made just as good a Realtor or Financial Advisor or some other \"Schmooze job\" that's all about sucking rich teets to get ahead.\n\nEdit: spelling of Schmooze?",
            "Opening my port 80 to network with all.",
            "cs in networking ok...\n\ntcp or udp ? udp seem more easy",
            ">How do you meet new people? There are a million ways to do that\n\nThere are a million ways to meet new people, but people who are actually good and can get you into an internship or a job are very rare.\n\nI for one, talk to any living organism who seems useful, kind of worked out since I managed to get 1 internship but I f'ed up the interview 😁. And he wasn't even someone from uni, he was my neighbor. Most events are useless, they just tell you to use the link and hope for the best, a lot of the time, the company representative has no idea what the hiring criteria even is.\n\nSame thing for \"Talent Acquisition\" employees, I talked with one extensively on LinkedIn, met IRL at competition, where she told me my GPA wasn't enough 😁",
            "Easy mode networking.\n\nDon't be an asshole to your college mates, work along with them well,make sure they know you are good.\n\nHell , on who I got by networking the college mate and I were aiming for the same chick, we were decent human beings at it , so we did not have any grudges.\n\nDisadvantage: your career will be a bit behind as it will have to wait until they have one year in this job or so , so they can recommend you.\n\nBut, if you can't even do that, well...",
            "I don’t usually downvote the truth, so upvoted instead.",
            "I think tech is becoming the new finance, very high income potential but only for those that are connected in the industry",
            "Networking requirement is wrong and unfair. It's breeding ground for nepotism. Hiring should be completely blind",
            "I tried networking a lot, but didn't help much. Like how do you even do this? Go to events sure, but why would some random person you met want to refer you or help you?",
            "Applied to 100 places cold, 0 tech phone screens or interviews. DM’d founders and engineers with a project that I wanted to demo, and got two offers at two startups. Totally true.\n\nKeep in mind though this basically applies to kids at non T30 schools. Going to a good school is the real distinguisher",
            "And how is this supposed to help anything? All networking does is get me the job over somebody else, it doesn't make the horrible market any better. Networking is just a race to the bottom to see who can devote the most time to something pointless. You don't want CS to end up like the business majors sending out hundreds of networking emails a week\n\nUnrelated, but there is also a fundamental difference between friendships and networking relationships. If you wouldn't care about somebody (any more than anyone else) if they weren't doing something for you (besides being friends), then that's not a friend. This isn't necessarily bad, but it should be clear to the involved parties what the intended relationship is. People need non-networking relationships in their life in order to stay sane",
            "Your points are valid I see the reasoning but my personal experience has been the opposite. Maybe I’m just an outlier.\n\nMy childhood bestfriend’s working at one of the largest companies of the state, he graduated early with a diploma, I graduated 2 years later with a Bachelor’s. He’s an Intermediate Software Developer now and referred me, sent me screenshots himself tho I didn’t ask and he really did endorse me hard to his senior. The recruiter was a different woman, she viewed my profile once and I didn’t even get a 1st interview after all that referral from an Intermediate Software Developer.\n\n1 of my other friends who’s a software developer herself made her friend who’s a Product Manager at her firm recommend me, again the recruiter took one look and never heard back.\n\nNow, all this would’ve made me think my profile looks really bad that I get one look rejections after strong referrals.\nBut I have received 9 first interviews since January and went on to 2nd/3rd rounds in 4, all of them through applying online through LinkedIn/Indeed with just Resume, no Cover Letter either.",
            "This! Everyone on this sub posts about how they are getting rejected despite hours and hours of leetcode… like don’t you feel the need to reassess? Networking and showing leadership/team skills through school clubs and orgs is SO vitally important. I am a lead for a SAE Motorsport team and that is easily what makes my resume stand out and is why I had a pretty easy time securing an offer for this summer.",
            "Where do you find discords or slacks",
            "Guys networking lmao",
            "It helps to be a Chad in ever profession",
            "Calling it networking makes it unlikable.. If we look at it as ‘sharing ideas with similar people’ activity, then it could be fun. Improve yourself in personal way besides professionally, and people will want to work with you. That is my experience ",
            "I have not encountered this problem \n\nIs it the American market that have the most difficulty and it is over represented?\n\n\nIs it selectiveness ? \nTechnology consultants, Functional/technical analysts, data analysts, data engineers, IT in boring none tech companies and erp/crm implementors, these are all roles for which i see a lot of vacancies floating around and they are all roles a cs major could take up if they put in effort. \n\n\nMy question is  do cs majors (on this sub) only want jobs as developer/programmer/architect or is it only my region (western europe) with a high demand?",
            "“Its not what you know, but who you know”",
            "Networking is 100% the best way to get a job, but realistically, the time to network is BEFORE you graduated, and when you already have a job. making friends with people who will eventually move around to other companies and can give you solid referrals, then it snowballs from there.\n\nIf you neglected this and are trying network only due to unemployment. it is going to be real difficult to jump in. The only people that can help you get interviews are people who are already employed.",
            "I don't disagree. Hell, I strongly agree.\n\n&nbsp;\n\nIDK though- the generic advice of \"Just get out there and network\" by itself seems sorta useless to me when not followed up with solid examples on how. I think most people already understand to some degree that landing a job involves social interaction and soft skills. It's a life lesson that everyone learns sooner or later.\n\n&nbsp;\n\nThe how part is what people need more guidance on and IMO is what is usually lacking. Following up with only \"there's a million different ways to\" is not helpful.\n\n&nbsp;\n\nHere's a few starters:\n\n* Find out about career fairs at your university/community college\n* Look-for and attend tech-meetups in your area (java meetups, js meetups, etc.)\n  * Hopefully this one is obvious, but in case it's not:\n     * Meet people that are already employed that likely use the things that the meetup is about\n     * Gain insight into the exact kinds of skills companies need from the employed people in the meetup\n     * (Not guaranteed but) Occasionally learn about opportunities for roles specializing in the things the meetup is about\n* Find out about smaller businesses in your area\n  * LinkedIn is a good place to discover these places, but don't assume that the integrated one-click apply is going to do anything *(sometimes recruiters may accidentally have it on or something but may not be checking responses, so contact the recruiters directly and ask about opportunities)*\n* Find student-groups/projects/organizations that you find interesting and contribute to those\n  * Things like uni robotics teams that actually go to competitions- not only because other employers may look at that as meaningful experience, but also because everyone on your team is a potential lead too",
            "You should be able to get a job based on merit, a valuable skill set, the ability to communicate, and integrity. I think most would agree with this. \n\nUnfortunately, that’s not the case. OP is right. What really matters is who you know.",
            "So are you going to share the results of your networking endeavors with us or are you only here to regurgitate what you read on Reddit for karma?",
            "Dawg I went to my schools career fair and I tried my best effort to introduce myself and everyone seemed so nonchalant and anti social…",
            "But how do I network? I try to contact HR. No reply. I try to contact someone from the company. No reply. \n\nWhat should I do? I really need help. \n\nI absolutely regret being introverted and shy. I don't wish this on my worst enemy. :(\n\nIt is really tough out there. \n\nHelpful tips/tools/tricks will be appreciated.",
            "Senior with 9 YoE here. I’ve utilized my network to get almost all my jobs. Here were the network sources:\n\n1. Alumni network: this is a low effort network that can be valuable. Help each other.\n\n2. Former coworker: if you’ve been laid off, follow the others.\n\n3. Family: nepotism works. You don’t have to work for your parents, but use them to meet people if they know people.\n\n4. Meetup groups: I helped build a few startups and got freelance contracts this way.\n\nNotice that none of these were “networking events” where you go and stand around with other people who want a job. They weren’t random LinkedIn requests either. Networking isn’t about meet n greets, it’s about making friends. They don’t even have to be tech adjacent, you can work embedded in non-tech industries as developer. The point is, stop networking with the concept that it’s \n\nnetwork connection —> job\n\nIt’s more like\n\nMeet someone —> build relationship —> help one another\n\nYou all got this.",
            "Fuck you, I would normally say you’re right but these graduating years have it harder than we did. In fact, I wrote a similar thing for my college subreddit a year or so ago.\n\nhttps://www.reddit.com/r/rutgers/s/7hjCxNiZXz\n\nTimes have changed, calling everyone out by saying they aren’t “networking” correctly is pretty fucking tone deaf. \n\nMy brother who is a sophomore cannot find any internships, his friends can’t too, and I can tell you for a fact that they network and are outgoing people.\n\nThe tech market is at a low, graduating cs people have to work harder than we did. And you sound like a goddamn boomer.",
            "How do we do that? Any advise or guidelines?",
            "big news. basically it’s what people from top-tier schools always did ever since 😅",
            "*Reads this*\n\n*Sends mass connection requests to 1000 people on LinkedIn*\n\n*Networking*",
            "Why do you hate networking? having some beer with people in the field and watch  some talk, whats not to like?",
            "I'm actually a bartender at the local corporate watering hole and have referrals to 20+ businesses, some being quite big, and the truth is they are just not hiring juniors at the moment. Is it because they know there is a giant pool of mid to senior level employees looking for jobs? I can't say. Will it turn around? It should.",
            "Its true though\n\nFound my fiance soon-to-be wife by stumbling on a Discord server\n\nWe started a coffee chat over headphones. Thats how it works",
            "Calling it networking is scummy as fuck. Just make friends. Go rock climbing, or go to a board game cafe, or do pub trivia, or cosplay at an anime convention. You'll meet 20 people in tech on day 1. Do those activities a dozen times and you'll have friends who are invested in your success and will be on the lookout for opportunities for you.",
            "Make friends at uni/college",
            "Y'all",
            "tldr get lucky",
            "Everything in life is networking these days. I mean, EVERYTHING.",
            "I’ve tried saying this several times to others and most people feel like it’s a personal attack and downvote me. Networking and following up with applications will help you get noticed out of the thousands of applications that are circulating.",
            "Honestly this is the way. I went to 1 party/basement show in Brooklyn and met 2 big tech guys that offered me referrals and resume advice. 3 other people who offered me referrals for non-tech roles. I got my first job at a start up from going to a figure drawing class and befriending the partner. If you live in a big city and go to a social gathering and wonder why many people have amazing roles it’s likely because they know a guy who knows a guy. It’s kind of crazy.",
            "join a sports club typical for office people. talking golf or better team sports. short talks in the changing room can change your life. just ask ppl for occupation, tell a bit about your situation during breaks. ppl would say company xy is looking for workers. beeing good in said sport helps. ppl think you are competent if you are (technically) good in sports.",
            "But what if I enjoy wasting my time with 100s of applications a day 🥺",
            "Okay so if networking is the only way to land jobs these days, what is the point of me working so hard to get a BSc then? And why dont hiring managers stop advertising posts online  because I mean it goes both ways( at least it should). And then what of all the people who dont live near campuses or anywhere that hosts networking events? \n\nPeople say this is an unpopular opinion but istg I see posts like this almost every week on this sub.",
            "I’m 99% sure all that would happen is you would befriend somebody who works at a company, they’ll put in a referral for you, you’ll apply, then they’ll either ghost you, or put you through a second interview before just choosing an internal candidate LOL",
            "Fax bro, just cold email ppl from your school. You will get an interview, stop being a baby.",
            "I am robot. beep boop. Can you recommend me some ways of networking?",
            "Networking is literally the easiest way to get interviews and internships period. Especially junior senior year. If you meet the right people, they can guarantee you an internship.",
            "Thinking about 1% chance of receiving an actual offer is a real struggle in the economy\n\n![gif](giphy|evt1YM3txiOk6eBBWl)",
            "How to do it without being cringe, awkward and corporate bootlicker?",
            "[deleted]",
            "But what if you're bad at conversations and social networking overall?",
            "You're talking about routing and shit right? RIGHT?!",
            "I know this topic is mentioned a lot lately, but is there a thorough guide on now to network in CS field that I can follow as a nerd?",
            "I believe that the entire system of submitting resumes should be done away with, the only purpose it serves is to maintain the illussion that working hard matters more than who you know.",
            "This is the truth, and great advice. People in this sub just sit on a computer and blindly brute force applications all week in a city or company that they've never heard of and that has never heard of them. Then they make pity party posts about sending 1000's of apps with no responses",
            "lol I read this as networking like computer networking 😂 then after scrolling halfway, I realize it’s social networking",
            "So I’m a mathematician (finishing my PhD this semester) by trade but I just got a senior-level researcher job at a UARC through a computer science conference. I 100% agree that networking, while not a sure-fire guarantee, is one of the most effective ways to secure a job. \n\nIn my opinion, the main benefit of publishing papers and internships is the networking that comes along with them, which lead to so many opportunities. This is the advice I give all soon-to-graduate students, especially those in the applied mathematics (including computer science).",
            "I love networking. Dm is you want to talk.",
            "OP I agree with you",
            "I think if you look at it as \"networking\", then it is definitely going to suck. In my experience random networking events are usually pretty useless. It's more important to find people that share a common interest. Then it's just about communicating and connecting on that topic. I call this \"making friends\". The more curious you are about things the more friends you'll make. This is the beginning of building a network.\n\nThe problem is a lot of people want to see results right away. That's not the way a network works. Building a community trusted peers takes time but ultimately will result in the best types of work. Like 80% of the job openings are filled through the \"in-network\". Generally all the jobs that hit the job boards are the ones nobody else wanted, or they couldn't fill for some reason.\n\nMy recommendation is don't waste time going to random networking events that \"suck\", instead read up on things that interest you and look for names of people working those projects. Then go find their LinkedIn profile or the profiles of people working on those projects. Make connections with them. At least they'll be meaningful relationships that get you closer to what you want. Also they'll be able to help guide you on learning the kinds of things that are valuable to their company.",
            "Just go to job fairs",
            "I really wish I could pay someone to network for me.",
            "Some of y’all need to learn how to make friends before networking tbh",
            "As a CS major, I have always felt that some of my peers automatically consider themselves smarter than business majors and that they don’t need any networking to land jobs or internships because they are good at what they do. This is only half right. If we don’t introduce ourselves to people from industry, there’s practically no one who knows what we are good at.\n\nI agree with your points so much! I guess this post was needed after reading so many on how CS majors are not getting jobs and that the field is dead.",
            "Fake jobs posting , they are just wasting people’s time to show they are working. And at the end, they go ahead with  an “internal “ Hire .  Dog shit !\n\nDuck such recruiters!",
            "Preach🙌",
            "I was getting excited because I like networking, then I realized he talked about the other type of network...\n\nI agree with OP view, as SE/IT people we're, for some reason, one of the professional career with the most turn over (changing company) so I guess having a strong network of fellow engineers and *errr* manager/RH/head-hunter/recruiter is important I guess",
            "i networked really well and im not the stereotypical networking person, i genuinely care about my relationships and all the SWE jobs i applied to i got at least 3+ referrals and AM qualified, still didnt get the job. its genuinely really mf tough out here",
            "networking = professional ass kissing. but sadly u just gotta do it",
            "Lol , im heading out to a career internship fair at my university in an hour . But yeah , i have come to accept that networking is a skill too , being able to show that you actually want the position enough to come out of your shell and shake a few hands .",
            "Had a connection at a big company, I go to a no name school with a bad GPA but still managed to get the job because i had someone refer me and I killed the interview. If I had applied without the referral i would’ve been ghosted for sure.",
            "I HATE... that I didn't meet you sooner **!**  **!**  **!**",
            "I mean, you don’t have to. You’d be surprised how many incompetent devs there are. If you can actually hold yourself together in an interview and appear personable, then you’d do much better than be a mediocre dev that’s good at networking. I’d bet good money that the people complaining about not finding a job aren’t the best devs.",
            "Yes and no. It all depends on how centralized a company's university recruiting process is. For large tech companies like google, a close family friend L8 principal engineer that you've known since childhood has no pull in getting you through the resume screen any more than your L3 new grad classmate who just started yesterday. Both will simply fill out that they had a close working relationship with you on the referral form and thats the end of it. What can help is if you have an inside connect to the university recruiters, but they get hundreds of messages a day and its far from a guarantee that you will contact the one among the dozens/hundreds of them who will handle your resume. For these companies its best to get a referral from anyone and be done with it.\n\nFor some smaller companies without hyper centralized university recruiting teams, networking can help. But for the elite ones, you will still need to get past a certain resume bar that is higher than traditional big tech anyways. For some random no name company in the midwest? Sure networking can help you with a mid resume get past the resume screen\n\nTLDR: For almost all F500 and other large companies networking won't help as the process for their swe/IT department university recruiting is WAY too centralized. For some smaller companies, sure it can help but its not going to get you into smaller elite unicorns without an elite resume to back it up.",
            "Whats the algorithm to follow for networking?",
            "Many CS majors are some of the most social I’ve met, surprisingly, I only found out after getting into the field how important socializing and networking is, in addition to the technical aspect",
            "As fireship once said, it's not what you know, it's about who you know",
            "Yep. My current job wasn’t listed ANYWHERE publically available. In fact the company didn’t even know if they wanted to hire someone for my position, but I happened to know someone in the company and thats how I knew there might be something there for me. \n\nWe interviewed, they liked me/my nerdiness and they hired. No line. No technical. No waiting. The need existed and I came along and offered to fill it at a rate much cheaper than a more experienced dev, and it was a no-brainer for them since they didn’t have to spend more money, time, and energy continuing to search. \n\nAll that was only possible because of a casual conversation with someone “in the industry”, with no explicit goal of “finding a job”.",
            "Sucks my college has a shit career fair for CS majors.",
            "Yep, I got a job from doing a presentation at a meetup about mobile development. A team manager who was at the meetup talked to me after, and asked to get coffee later in the week.\n\nThe official process of applying to offer took about 3 weeks.",
            "People keep saying that we need to start networking. What does that even mean? Walk around sharing cards with our names and phone numbers? Genuinely asking.",
            "I’ve tried networking and am getting super-annoyed with how much time and energy it sucks out of you. I’ve even had a person willing to provide a referral for a position that was unfortunately de-listed before it could go through, just to be turned down when asked again because “he doesn’t know me well enough.” Then why would he be willing to provide the referral the first time? It’s getting ridiculous out there.",
            "Can someone help me understand where i can find the opportunity to actually network? I have gone to career fairs and every time it’s filled to the brim with CS students with 30 minute long lines for each booth. When you actually get to the recruiter it becomes an explanation on how you can apply online, even when trying to just talk to the person genuinely. I feel lost",
            "Successfully network with people to hear that their companies are on a hiring freeze 😔",
            "Is there any way to network through online ??",
            "[deleted]",
            "Wow so you found a job and come here to gloat about it.  Good thing maturity isn't a prerequisite to finding a job."
        ]
    },
    {
        "post_id": "xd2frk",
        "author": "SameSameb",
        "title": "TikTok - Worse than a rejection",
        "url": "https://www.reddit.com/r/csMajors/comments/xd2frk/tiktok_worse_than_a_rejection/",
        "score": 1785,
        "num_comments": 126,
        "created_utc": 1663059520.0,
        "selftext": "The worst they can say is no. Right? Well guess what…\n\nI recently applied for a TikTok internship because I really liked their product and was interested to learn more about the technical challenges they are facing while growing so quickly. I have a good CV with great grades from a top university and multiple projects and work experience. \n\nHowever, I really wanted to stand out from other applicants because working at TikTok was a dream of mine for a while.\n\nAt the beginning of the summer I decided to start a project that is related to TikTok in some way. I thought it would be a great way to show my dedication. \n\nI spent several months building a mobile app which enables TikTok users to see detailed analytics about their follower engagement and track who unfollowed them etc. I published the app on the app store and mentioned it in my CV. There I explained my motivation behind it, the tech stack that I used and included a link to the app store listing.\n\nOn the very next day I did not only receive a rejection, but also a trademark infringement complaint from TikTok asking me to remove the app from the app store. Reason for this being that my app uses the word “Tok” in its name.\n\nI guess I should have just grinded leetcode over the summer…",
        "permalink": "/r/csMajors/comments/xd2frk/tiktok_worse_than_a_rejection/",
        "comments": [
            "Don't worry your app and its feature will appear in TikTok in 3-6 months",
            "brooo that’s a violation! but don’t worry, we didn’t scrape and also got rejected 😂",
            "Leetcode forever baby",
            "Never used Tiktok before but you mentioned that your app can do analytics on user's follower engagement, which means your app is scraping data from the app?\n\nThen, it is a good reason for them to take action. Ya, you will feel disappointed but they are not doing wrong on this matter (except the Tok part on your app name, unless your app is named as TakTok or something that is very similar to TikTok.) \n\nI think major social network service providers stated in their T&C that no data scraping is allowed on their user data on the platform,  you did that and you let them know right in front of their face. So... \n\nI am by no mean work under them or a professional in legal. But, the thing that you learn from developing the app will be yours, so not a total loss.",
            "Bruh got cancelled 💀💀💀",
            "[deleted]",
            "> really liked their product\n\nFirst mistake",
            "Sell this app to another company for some hundreds and post on tiktok🤣🤣",
            "ShitTok is great alternative name for TikTok",
            "That’s why you don’t dick ride",
            ">I guess I should have just grinded leetcode over the summer…\n\nYeah learned that lesson last summer, spent the entire summer developing my passion project and thought it would wow interviewers.\n\nWell only one interviewer even brought up, and was impressed by, ANY of my projects and it was a little automation script I did over a weekend. Not the mega project that I poured my heart and soul into for hundreds of hours 💀\n\nSo this summer all I did was leetcode",
            "That’s tough 😭",
            "I guess maybe apply for Instagram reels",
            "Don't put all your eggs in one basket. Learn and move on",
            "This sounds like a villain origin story",
            "Never meet your heroes",
            "how could such high aspirations end like this 💀💀💀💀",
            "app name?",
            "This is the tech version of getting smited. 😂",
            "Tiktok sucks. I passed the OA and my application status has been resume screening for over 3 weeks. Not even a rejection",
            "Tik tok a dream job? What in the actual fuck. Working for a Chinese malware company? Wtf!",
            "“eat-leet-shit” that’s the circle of life — oogway",
            "Ngl I feel like they did wrong by not hiring you, but idk what their legal team was thinking",
            "Being rejected by a company that adds no value to the world is totally fine",
            "Congrats on launching the app! That is a bigger success than getting the internship IMO.",
            "Btw, getting sued by a mega corporation is a surefire way to make a name for yourself and usually backfires for the megacorp suing the individual. \n\nIgnore the letter and go to the media when it eventually escalates. This is the way of the startup founder.",
            "Your first mistake: dreamming about working for tiktok. Like seriously, it’s cool and all, but who tf want to work for a chinese company?",
            "Bro thought the CCP liked him",
            "Honest question because I really want to understand: why is TikTok a dream job?",
            "I feel it is unethical because you are basically scrapping data. So this can also lead to removal  of app that you are stealing user data. (Not an expert here but just my thoughts)",
            "Apply to their competitor",
            "The reply from that company makes me fell sad. Hope OP gets a better job offer",
            "Don’t worry they’ll be using this in no time 💀",
            "Sure you got rejected but that sounds like a really dope project, especially if you deployed it. Maybe try releasing it under a different name? I wouldn’t be surprised if the app impresses a bunch of other companies.",
            "For those of you that asked about the techstack: As you can imagine, some of these scraping tasks can take a lot of time. Sometimes up to 20 seconds depending on the size of the profile. Therefore I have multiple containers deployed that pick up the processing tasks from a message queue and run it asynchonously in the background. \nThe app communicates with a main webserver written in python (FastAPI) and checks if the user exists on TikTok etc. If that is the case, the webserver creates an entry in a database (Firestore) and writes a message to the queue for the other workers to pick up. This way the latency for the user is minimal. I also have another container deployed that updates the entry in the database and sends push notifications to the users if someone has unfollowed them (Cloud Function written in Python). This function is executed once every day by a cloud scheduler and also deletes profiles if there are no longer on TikTok. \nI tried to make sure that the app can scale easily if needed by queueing the scraping tasks and handling them asynchronously. For the scrapping I wont go into the details. You will obviously need a rotating proxy network and handle all kinds of errors.\n\nEdit: The app itself is made with Flutter",
            "Why the fuck do you want to Intern at the Chinese government mate",
            "tick tock = cancer",
            "Change the name, take the experience, apply to literally anywhere else that would be incredibly happy to have you for the skill you've shown. TikTok just showed they're one of the worst companies to try to apply to.",
            "oh shoot my site plays tik videos and I named it after them. should I change the name to TicTac video player?",
            "Why would you want to work for a company run by the CCP who commits genocide on people because of their religion? Give your head a shake bro",
            "So you’re not going to actively work with the CCP toward ruining young minds and destroying western society? Awww man what a bummer.",
            "What else do you expect from a Chinese based company? They love stealing our information but as soon as we remotely look their way they get mad.",
            "Business is about enslavement. You are always to be just a cog to be exploited. Only the slave masters who control the capital and sign the subsistence checks decide who has gone too far. You just threatened their very existence. Those three letters are lethal ffs",
            "Can a kid named ikTo sue them ?",
            "Hello everyone",
            "F\n\n\nNah but fr, drop the name of the app — I’d love to check it out :)",
            "[deleted]",
            "what tech stack did you use? \nand a pro tip: promote your app on tiktok fuck them",
            "crazyyyy😂",
            "Villain origin story?",
            "wait what LMAO, i was like this is no big deal until I kept reading",
            "That sucksssssss. You could use that to get into any top tech company though. Google likes stuff like that.",
            "Leetcode Forever. These companies say they want to see \"passion\" but what they really want is your ability to problem solve (i.e. leetcode).",
            "always check robots.txt and similar!",
            "Fuck TikTok. I had a tech phone screen scheduled for them at fucking 10PM EST (first red flag), i think the interviewer was PST, but even so, who has an interview scheduled past 5PM.\n\nI still join the google meet and wait 20min… the interviewer no shows. Next day the HR emails me and asks why I no showed. He then says he’ll do me a favor and give me another chance. This time I didn’t bother joining. Fuck that cringe ass app.",
            "Well, that escalated quickly",
            "Because it is a communist Chinese app….wake up",
            "They’re definitely gonna use your features on tik tok’s code 🤣",
            "That's what you get for trying to work at Chinese-government owned company lmao",
            "."
        ]
    },
    {
        "post_id": "18m82jf",
        "author": "chodeman1000",
        "title": "TECH COMPANY MASTER TIER LIST",
        "url": "https://i.redd.it/zs8wa7xfja7c1.jpeg",
        "score": 1784,
        "num_comments": 412,
        "created_utc": 1703008776.0,
        "selftext": "Salary, prestige, WLB, and exit opportunities are being taking in consideration. List is ordered.",
        "permalink": "/r/csMajors/comments/18m82jf/tech_company_master_tier_list/",
        "comments": [
            "making a tier list like this is some gremlin shit",
            "This post is my sign to leave this sub",
            "Not sure bout this one",
            "Wait, why is Grindr an S tier company 💀",
            "boeing aint amazing but new grad hits 6 figs and I legit work like 10-15 hours a week so WLB is S+",
            "who let him cook?",
            "Palantir, Riot, Splunk and TikTok in the same tier as Yahoo, PayPal and CapitalOne\n\nMeta S tier lmao",
            "Nvidia should be S",
            "Goldman F tier",
            "[This](https://www.reddit.com/r/ITCareerQuestions/comments/12hvcy9/cs_new_grad_looking_for_entry_level_it_help_desk/) you?\n\nImagine making a tier list of companies when you're not even in the industry yet",
            ">>list is ordered \n\ndoordash above optiver 😭",
            "This is so random.  Any one of those companies (and many others) can lead to other opportunities and be a great first time job for a new grad as a SE.  Salary levels are all over the place here depending on company and location and exact role.\n\nI also think WLB is a fairly subjective and depends a lot on ones ability to contribute fully while having some personal boundaries they are willing to enforce as a young adult.  A lot of new grads aren't great at that at their first job.  There's a reason first jobs last on average about 2 years.",
            "has bro seen robinhood and snap stock?",
            "There’s Nvidia and Intel but AMD didn’t even make the cut 💀",
            "Interesting seeing kids talking about 'exit opportunities' having never worked in their lives.",
            "GRINDR???",
            "I worked at Albertsons and had FAANG recruiters in my inbox daily, definitely S tier",
            "Can someone explain why Epic is in F tier? They account for most of the US's electronic health record systems.",
            "bro put southwest as a tech company",
            "Netflix will burn out all but the strongest of engineers and you'll be fired just after your first review, or will be working weekends and neglecting your family to keep up, if you're mediocre.  \n\n\nAdobe should probably be C-tier, because they are *notoriously* stingy with RSU refreshes. They only go to \"top performers\", are much smaller than the new-hire RSU grant, and frankly, you'll probably make less in years after your new-hire grant expires than you did before, unless you can promote all the way up to a P50 or P55 engineer in that time.  \n\n\nAmazon should be A-tier. Massive salary the first two years, followed by massive RSU vesting the final two years before you'll need significant refreshed to keep your pay at the same grade.  \n\n\nNo experience otherwise, but outside of FAANG, pay and opportunities aren't much different. Netflix has absolute top of bracket pay, and due to it being *all* salary, I think it's the best deal. Most other companies that aren't stingy with RSU refreshes will be on par with the others.",
            "This just shows how privileged and out of touch a lot of CS majors are. I think it also shows why you idiots are jobless 18 months post grad",
            "What's wrong with WF?",
            "Everyone’s confused about grindr and not Albertsons, is the grindr meme more obscure?",
            "dick rider",
            "How are coinbase and dropbox this high lmfao.\n\nApple > Amazon for normal swe is such a ngmi take",
            "from what I have heard Discord is a horrible place to work at",
            "Least bootlicking cs major",
            "Tesla’s WLB is A?",
            "A little presumptuous to title this \"Master Tier List\" when you haven't worked at any of these places.",
            "cursed list 💀",
            "lol",
            "Lol! These are the kind of posts that keep me coming back to this subreddit.",
            "you spent time out of your day to make this?",
            "if you recognize all of these terribly cropped logos, your mind is irreversibly broken",
            "I don't appreciate the fact that my favorite company, Mind Geek, is catching strays with this post",
            "have you been a part of all of these companies?",
            "NVIDIA S",
            "Damn IBM that low? My parents keep hyping it lol",
            "Wait, Vanguard as a tech company? And what did they do to be put in the F tier? Lol",
            "This sub is getting more cringe by the day. It's bouncing between people crying not being able to get jobs cause \"it's must only be the market and definitely not me not being desirable\" and people making fkn tierlists on what company to get into. This tech culture made by nerds looking at careers like it's a trading card game with people trying to find shortcuts, not looking inwards on maybe they themselves are the reason they can't find a job, and tier-making companies while simultaneously complain why companies don't treat them nicely is vomit inducing.",
            "I would love to work for anthropic one day…",
            "Dang not even including SpaceX lol",
            "Maybe I’m just not a tech enthusiast but I haven’t heard of some of these companies. I thought I applied to hella companies But after seeing this list I guess I missed a lot 💀",
            "Where is Flexport 💀 I made more than all A tier companies and some S tier as a new grad..",
            "Yeah I’m not taking this list into account for anything",
            "lol why Deloitte F tier?",
            "I understand the prestige behind Discord, but haven’t you heard of their toxic work environment?",
            "Albertsons == Snowflake by transitivity. You heard it here first.",
            "Where are companies like Arm, Arista Networks, SpaceX, … ? You have an airline and walmart over them?",
            "Congrats on Airbnb, Snowflake, Databricks, Netflix, LinkedIn, DoorDash, Notion, Figma, Duolingo, Pinterest, Asana, Atlassian, DropBox, DataDog, Uber, Lyft, Plaid, Discord, Coinbase, Robinhood, Bloomberg, Slack, some of Microsoft, non AP Tesla, Square, ZipRecruiter, Snap, and Amazon.",
            "Albertsons S++ no?",
            "Lol why is Vanguard F tier?",
            "This is the most r/csmajors post I’ve ever seen",
            "whats the company in front of grindr, the undisputed best company",
            "It's crazy how many people are just accepting this list as fact.\n  \nOP's username is chodeman1000.\n  \nOP's post history is clearly a new grad.\n  \nOP deleted a post about him struggling to secure an IT help desk job.",
            "A tier ordering is fucked put citadel ramp roblox at the front and databricks is def not better than those.\n\nlyft doordash microsoft amazon def not a tier, bytedanxe is. \n\nreddit too low, snap too high, hugging face too low, robin hood too high.\n\npalantir is easily A, tesla B\n\njane street & akuna MIA.\n\nwhat is the W company??",
            "What does it mean if Wells Fargo rejected me ?? F in the chat",
            "Grindr? S tier?",
            "i sent this to my dad who works at albertsons bro told me to stfu",
            "Everything in this list is arguable at best. Stop romanticizing prestige, it doesn't exist. Move to the Bay and you'll know what I mean. Everyone and their mom works at FAANG",
            "How’d this Blind post get to Reddit?",
            "Slack and crm on diff tiers. Delete this",
            "Tesala A tier 🥴",
            "I guess Grindr does have excellent exit opportunities lol 💀",
            "SalesForce B is a wild take",
            "Is snowflake worth being in S tier!!?",
            "I would be happy to work in any of the F tier companies 😂",
            "Most soydev thing I've ever seen in my life.",
            "not my company being in F 😳",
            "Knock Meta and Netflix down a tier and move the Quants up. Move grindr up one.",
            "Some of the highest on the list are the absolute worst places to work. Who cares about prestige when your life is shit",
            "Roblox has gotta be cushy with all the minors they employ for slavery wages",
            "yeah maybe don’t choose your next company based on a tier list from a subreddit",
            "OP is tripping with that S tier",
            "How is Meta S tier 😂",
            "Google before Citadel and 2sigma?",
            "For a purely monetary stand point it would be difficult to beat Palantir. Especially if you move to Saudi, that no tax thing is pretty hard to beat.",
            "doordash that high 😭😹",
            "In all fairness… this list isn’t that bad.",
            "Could you make a post to explain more details on how you rank these? I would appreciate it. Thank you",
            "LOL how is Tesla and twitter A/B tiered? Having to work for Elon alone would be enough to drop it to C at best",
            "Why are Netflix and Meta ranked higher than lets say Google?",
            "[deleted]",
            "Drop Cap One a grade or two. It’s not remotely in th same category as Oraclez, Adobe, Salesforce, and a bunch of other names on there.",
            "Where is stripe",
            "Don't trash talk Epic like that. Their campus makes it look like they are hiding a spaceship.",
            "This is by far the dumbest post I have ever seen on this sub",
            "where's Etsy?",
            "Rippling not even listed",
            "Glad to see Epic at F, they really don’t deserve anything more than that",
            "Msft should be higher since the stock price has grown so amazingly",
            "Yeah dawg def gonna take a job at notion over Microsoft.  Good call",
            "No Samsung?",
            "Amazon will break you should not be A tier 💀",
            "I approve",
            "Yeeeeaaaah Grindr is definitely not S tier. Shit meme.",
            "Capital One should be in C",
            "Imagine thinking Meta is an S tier company. Better off working for a 10-person family company with a tyrant CEO than Meta. Zuck doesn't care about you bro",
            "Meta is S tier? The company almost single-handedly responsible for the destruction of public discourse that also makes a garbage product used only by your grandparents? Get the fuck out.",
            "> prestige\n\nTell me u indian without saying that",
            "not sure why Meta S tier and the other fanng or Microsoft are A tier. Meta company is not as stable than other fanng companies, cos Meta is losing money/ Netflix also quite a risk besides providing streaming service and nothing much.\n\nAirbnb covid destroyed it. Coinbase crypto company, doesn't look good at all.\n\nNvidia seems more like as S tier, the AI era brings it height, plus a lot of people love their gpu.\n\nEpic game like high B tier, the graphic is wow, it would become S tier if Microsoft took over Epic, instead of just buying the gear of war game entity.",
            "does verkada have good resume value tho?",
            "Please go outside, fucking weirdo",
            "I wanna work my ass off to get into grindr.jk",
            "Twitter shouldn’t be that high",
            "You forgot only fans",
            "Should I be worried if I got rejected by all of them? 👀",
            "You gotta wait until sunday to post something like this - also forgot the shitpost flair \n\n/s",
            "Good thing I got rejected from Epic I guess",
            "I agree",
            "whats the first one? it looks like the aldi logo  \n\n\n&#x200B;\n\nhttps://preview.redd.it/p6slkn2ohb7c1.png?width=1200&format=png&auto=webp&s=4d2d16bc9ed0398b83e23bd9a68381cef1eb6cae",
            "Why is the NSA so low?",
            "Why is Albertsons considered a tech company?",
            "Idgaf id do anything to work at MindGeek",
            "GRINDR!?!? 💀",
            "[deleted]",
            "albertson W",
            "[deleted]",
            "I might be out of the loop but grindr in s tier? location, images, bio? what's so special about that?",
            "No Garmin?",
            "Amazon and Apple should go down a teir due to low pay/low wlb.",
            "Albertsons too low, should be in its own tier",
            "This is ass",
            "How is Tesla ok at work life balance? Amazon even? All I hear is how i overworked everyone is.",
            "Damne, all these companies are better than mine",
            "Damn you got it like all wrong",
            "i hate this subreddit",
            "ibm C? they pay peanuts and havent made an impact since ibm watson lol, how they same level as GS🤭",
            "what about samsung? anyone have any opinions on it?",
            "Decent list NGL but headlands to S and airbnb snowflake should be A. Maybe hugging face A.",
            "Where SAP?",
            "1) what is your methodology?   \n   \nB) how the fuck is Albertsons a tech company?",
            "Deloitte is a tech company?",
            "where is eeeee",
            "Honeywell not even in the list?",
            "Not my new grad role being F tier 😀",
            "Lockheed being above vanguard and wells fargo is fucking insane",
            "Can anyone confirm EPIC belongs in F tier?",
            "awesome!",
            "Dawg I’m lucky if I get an offer anywhere",
            "Hmm isn't IBM the dream?",
            "Anthropic S tier lmao\n\nShit product",
            "I truly love how the NSA is sandwiched right between Blizzard and John Deer",
            "Discord isn’t worth A tier imo, the internal culture changed a ton around 2020, although I guess it’s still worth it because of the salaries",
            "Least unhinged CS major",
            "Where would you put Chevron?",
            "Where would Unity be…",
            "Get a life",
            "Why is google not S tier?",
            "Why is Epic in F tier? I’ve generally heard good things about them.",
            "Zillow should be tier A",
            "I don’t understand the meaning of this? \nPlease someone help🥲🥲",
            "Duo gonna find you putting him in A",
            "Wait... is that Albertsons??? Is that legit???",
            "Def a little sad Salesforce is B out here I work there and it’s the best place ever. People are amazing hours aren’t long and they’re so flexible with your needs",
            "Lol Amazon at 4. Is this a paid post ?",
            "Fuck snowflake",
            "Albertsons?",
            "this was definitely made by someone with little to no professional experience",
            "Is Hudson River a good place? Got an OA after shotgunning apps but didn’t bother submitting.",
            "where telecom?",
            "yall fuck ass mfs making this list like yall can get into these companies like bro take what you can get atp in the economy",
            "Nearly 50% in A and S... I don't think you know how tier lists work...",
            "Microsoft is too big to categorize like this . it has amazing roles and equivalently shitty ones",
            "What's wrong with intel",
            "Tfw only your competitors made the list 🤟😔 1 day, young grasshopper",
            "Walmart is B tier once you become a senior engineer.",
            "Nvidia should be placed in B (coz they re not serious)",
            "Where is Pornhub?",
            "ALBERTSONS?!",
            "Poor telecoms always thinking they are tech companiess",
            "airbnb in S might be the worst take of 2023",
            "I won't put Asana into A tier maybe like C",
            "Back in my day Salesforce was S++++ tier",
            "I used to work for two sigma.. great place to work for.. should be in top tier",
            "What the hell is this?",
            "Blizzard? D or lower",
            "This post and many of the comments below have made me want to quit this sub. Bunch of inexperienced kids.",
            "I think the germans Bosch and Siemens must be included in tech companies list as well, due to their huge annual investment in advanced tech and research in the areas of artificial intelligence.\n\nAlso Samsung not being in this list is a declared crime.",
            "My brother in Christ literally put Jhon Deere and Walmart as tech company and forgot Samsung, Siemens, Accenture, Bosch, LG, TCS, DiDi",
            "You need mental help",
            "Where do you work OP?",
            "Nah that’s crazy Wells Fargo wlb is amazing and pay is over 6 figs",
            "I can’t even tell what some of these are. Where can I get a written of this list?",
            "Honestly pretty accurate. Let me start with what I love: Pinecone in A tier. That company more than deserves that and its nice seeing it get some love. It's really gonna be a great company moving forward and is one of the best startups to work in right now. I also love the trolling and respect for lore with Albertsons in S tier. Now to my gripes, I definitely feel like Hugging Face is A tier. Also Microsoft is B tier. Shitlassian and Datadog are also B tier. I know there are a lot of you who interned at Datadog and Microsoft but hear me out, they;re just not on the same level as Apple and Snapchat. While youre at it put Amazon in F-tier. Trash sweatshop. Besides that though great work!",
            "Very surprised government agency. It’s also in the list?",
            "As a former Amazon employee, Amazon is way too high in this list.",
            "Workday over JPMC? Can anyone with experience lmk why?",
            "SAP didn't even make the list eh?",
            "Sorry, but Albertsons is fucking terrible. Steer clear of them.",
            "This is an amazing representation of information in a signal infographic image.",
            "Splunk being B tier? As a current employee, I'm begging you to be so for real",
            "Weird that E doesn't exist lol",
            "Love to see the airline company I’m interning at (United) didn’t make the list, but Southwest and Delta did. It’s so over I should reneg",
            "Grindr bro ?",
            "USA students just choose their internships according to the tier list, while internationals struggle to get unpaid internship."
        ]
    },
    {
        "post_id": "19btarz",
        "author": "Current-Pair-5137",
        "title": "Applied to 60 apple jobs today alone lol",
        "url": "https://i.redd.it/1mdro5tsjpdc1.jpeg",
        "score": 1785,
        "num_comments": 150,
        "created_utc": 1705805587.0,
        "selftext": "I am not getting anything back, so I am getting desperate",
        "permalink": "/r/csMajors/comments/19btarz/applied_to_60_apple_jobs_today_alone_lol/",
        "comments": [
            "60 apples a day keep unemployment away",
            "Apple recruiting is really disjoint so this is actually the right way to do it. You can even interview for multiple teams at once",
            "Hope you get one ! 🤞",
            "You're not trying if you haven't hit at least 100 Apple applications. They take 5 seconds",
            "How do you look up jobs? Like for me I'm looking on Indeed, LinkedIn, Google search, etc. for accounting jobs. How do you do it for the IT world?",
            "Good luck getting response from apple. Apple has the worst careers site plus they just hire internally more than external. They will put up a role and sometimes it’s for a h1b worker who is slogging away in their cohorts as a contractor for years.",
            "Keep us updated!",
            "This is me with ibm lol",
            "Bruh at it since 7 in the morning to 5 in the evening. Respect. Hopefully I can do the same next year!",
            "Dm me for uber referral. They have ml roles open",
            "What, did you only apply to apple jobs?",
            "I’m looking forward to the post where you finally get the job, whether it’s at Apple or another great company. Already manifesting it for you!",
            "!remindme 6 weeks",
            "The problem is that you're not using Apple Mail",
            "All the best man!",
            "the grind never stops",
            "Good luck Marcus!🤞",
            "I once did 40 SpaceX applications",
            "this won't turn out well",
            "Applying to several different roles within one company is one of the biggest red flags for recruiters…",
            "did u rewrite a CV each time",
            "There’s no way you’re a good fit for that many roles. You’re just wasting everyone’s time.",
            "r/madlads",
            "I’m just applying only specifically to JP Morgan",
            "Fortunately I only had to apply once to get my first SWE job there due to my college’s connection with Apple recruiting.",
            "hi markus",
            "Are they hiring new grads?",
            "Niggas growin",
            "That sounds like you don't tailor your CV and cover letter for each apppication and go for quantity of quality, which is a sure way to stay unemployed for a long time. The number of apppications is just too much to actually be high quality for each one, and in this market that means you're not getting it. Not to mention you very likely do not have the skills and definitely not the experience for all 60 different jobs. You'll probably be rejected from all 60 of these because your competition just decided to do 2-3 well-tailored, well researched and well written high quality apppications with a good cover letter for the specific position, contacted recruiters, did market research, gained necessary niche skills to stand out, networked etc. If your application doesn't stand out and is not well researched, you are just one in hundreds (thousands in case of apple) of applicants the company receives and throws into the garbage after skimming through once.",
            "Well obviously, you are not qualified for pretty most of these lol",
            "All 60 for one role or different?",
            "Should I as a student not from USA or in usa apply? Or will they reject the moment they'll see that they need to sponsor me?",
            "What does 60 mean? Like did u apply sixty time with different email id? Or there r actually 60 openings?",
            "So….. you wanna work at Apple?",
            "Whats your skills",
            "chad.",
            "Wishing u luck OP",
            "I did like 102",
            "HI MARKUS ( ͡° ͜ʖ ͡°)",
            "Get this guy a job at Apple Jesus Christ",
            "!remindme 60 days",
            "Eager waiting to see if you got any positive response on any one of those.",
            "If this is anything like Amazon’s hiring system it’s very bad to do this. By applying for more roles your resume gets put into this giant queue for a general recruiter to sort through which will really add additional time for screening in which a lot of roles will be filled.\n\nInstead pick one or two roles and reach out to the HM, then only apply to those roles. That way the recruiter assigned to the open position will be the initial resume reviewer instead of a general recruiter.",
            "Best of luck to you, keep us updated!",
            "Bad idea. Recruiting will see it and assume you aren’t particularly serious as you are not targeting your applications",
            "This gives me the motivation to apply all the relevant positions at one firm Ive been eyeing at",
            "Please don’t lose your hope! I edited my resume which I never really worked much on it seriously after New Year’s after 1 year of unemployment upon moving to the US and tomorrow is my first day at work! I still can’t believe I got lucky even though the job and pay itself isn’t the highest ever but it’s still my first job in the US. If I could you could since the day before yesterday! Best of luck!\n\nPS: I cherish this job after even Walgreens rejected me😫😅 but thank God they did",
            "y’all let me know when there’s an update",
            "What’s your resume looking like?",
            "Just become an Apple Store employee and get hired internally bro",
            "[deleted]"
        ]
    }
]