[
    {
        "post_id": "1b6o9se",
        "author": "Gloomy-Pineapple1729",
        "title": "John Carmack agrees with Nvidia's Jensen Huang: “Kids shouldn’t learn to code anymore\"",
        "url": "https://www.reddit.com/r/csMajors/comments/1b6o9se/john_carmack_agrees_with_nvidias_jensen_huang/",
        "score": 447,
        "num_comments": 136,
        "created_utc": 1709591374.0,
        "selftext": "\"I wanna say something and it's going to be completely opposite of what everyone says. Almost everyone who sits on a stage like this will say 'It is vital that your children learn computer science' and in fact it's almost exactly the opposite. It is our job to create computing technology so that nobody has to program. And that the programming language is human. Everyone in the world is now a programmer. This is the miracle of artificial intelligence\" - Jensen Huang\n\n&#x200B;\n\n\"Coding was never the source of value, and people shouldn’t get overly attached to it. Problem solving is the core skill. The discipline and precision demanded by traditional programming will remain valuable transferable attributes, but they won’t be a barrier to entry.\n\nMany times over the years I have thought about a great programmer I knew that loved assembly language to the point of not wanting to move to C. I have to fight some similar feelings of my own around using existing massive codebases and inefficient languages, but I push through.\n\nI had somewhat resigned myself to the fact that I might be missing out on the “final abstraction”, where you realize that managing people is more powerful than any personal tool. I just don’t like it, and I can live with the limitations that puts on me.” - John Carmack\n\n[https://x.com/id\\_aa\\_carmack/status/1762110222321975442?s=46](https://x.com/id_aa_carmack/status/1762110222321975442?s=46)",
        "permalink": "/r/csMajors/comments/1b6o9se/john_carmack_agrees_with_nvidias_jensen_huang/",
        "comments": [
            "jensen can tell them kids to carve the gpu's with their bare hands for all I care, as long as the stock keeps going up.",
            "I am going to make a killing fixing the mess people make copy and pasting AI code with no understanding. Just because I can use a pencil, a calculator and a hammer doesn't mean I can design and build my own house.",
            "People who are relatively new to the field (or are students) make too big of a deal about coding.\n\nCoding is, by far, the easiest and most fun aspect of being a software engineer. It's a privilege that is granted after you have fought all of the production fires, nailed down the requirements after extensive talks with clients and your tech leads, and gotten an approved design.\n\nL3's get to code a lot, because it's the only thing they really know how to do. You code less and  less after you hit L5 and try to get to L6--not because you become a slower programmer than the \"younguns\", but because you become responsible for actually understanding the problem space and solving problems. Code is just a means to an end, and shouldn't be glorified like it's some sort of inifinite-skillcap talent that continues to get more and more useful as you get better at it --- there is certainly an asymptotic ceiling to it, and it the ceiling is surprisingly low in most software fields.",
            "You see a lot of kids coming through now that think, as long as I can code the same way I speak English, I don't need to think about anything else.  I can bin off personal skills, orgnaisational, emails, career development.  As long as I have this one or two languages nailed, I've made it from now to retirement.  \n\nUnfortunately, they find out the hard way this gets old very quickly, and then they have no idea what to do.  Now they can't even get the job in the first place.",
            "Carmack is so rich he hasn’t cared about anything for decades. Don’t take your advice from people like that.",
            "I mean it’s all fun and makes sense. Issue is, using language if you have to specifically describe your desired task and intent, there is no way that is clearer and easier than pseudo code. \nSo maybe you can have weak syntax skills if the models are trained often enough or the languages don’t mutate. \nBut telling the LLM what you need will end up being code unless you have some boilerplate business need that is already templated to hell and back in GitHub and you simply didn’t know.",
            "Whenever I ask chatgpt to write my code it sends back some smug snippet with half of the methods and libraries made up.",
            "I agree with what he is saying. I am using ChatGPT extensively to avoid writing boring code. I want to solve the problem fast and I am thinking about the approach and architecture. Coding itself is just moving bricks.\n\nThe problem is that if coding is no longer a barrier to entry salaries will be brought down to earth. Sad times.",
            "Carmack's right. Anybody can write code. It's not some sort of wizardry. The thing that always made Carmack great was the manner in which he solved the problem at hand. If you look at the Quake III engine, it's just an incredible work of architecture, and that's before you even start looking at the code. \n\nNow, by, \"Anybody can write code,\" I mean you can take someone who took a couple of Java classes in community college, hand them a bunch of UML diagrams, and they'll knock out the code you're looking for, but they might not be able to come up with the structure that got you to making those UML diagrams. *Writing code is not the hard part*. That's why a lot of programmers are going to get replaced by AI, and rightfully so. But it'll take longer for people who really understand architecture to get replaced. It'll happen, eventually, but at some point you end up in a situation of diminishing returns, where someone will say, \"Okay, make a 3D engine,\" and then have no idea what it should do, and the AI won't know what they mean, either.",
            "Yeah but that's what being a software engineer has always been about. It's not about coding per se, it's about problem solving. And that's why I think CS majors have a huge edge over bootcampers, and I don't think many companies understand it either. We have the internet, and now LLMs, so it's not that hard to go from one language to another. Software engineering is more about how you're going to implement the requirements of the client, and working with them to implement the best possible product, within the constraints of time and budget. Taking those decisions over what frameworks to use, libraries to use etc is the problem solving.",
            "What they really mean is \"be fullstack\". Or even better, fullstack+, which means understand how to talk to users and do marketing.\nI practice, we're far from having AI maintain code bases, especially legacy onces, so programmers are going to have to keep on programming.",
            "So you're telling me, if I use chat gpt for all of my assignments, I am problem solving, and will be fine?",
            "Head of a company whose whole value is tied to AI being the future says what? \n\nAI sucks for coding. I have regretted every time I have used ChatGPT or Copilot to write even basic code. I don’t see it getting any better for at least the next five or so years. It may never fully learn how to solve problems or write complex architectures. So, yeah it’s too soon to be taking these statements at face value.",
            "Yeah kids should learn to design parallel computation arch",
            "I am sorry, I needed to read read the article twice becuase I was laughing so hard. Here we are (In South Africa) struggleing to find devs. Because who programs the Ai.",
            "Seems like we will just have a natural language spec, that won't be all that different to code imo. You tell the AI what you want and specify the parameters in detail to avoid misunderstanding. Basically still coding, without having to know a specific coding language.",
            "I see people misinterpreting this. \n\nThat's fine. \n\nNeed to trim the excess supply in CS that accumulated over the years.",
            "TLDR: Coding is already commoditized, and the only ones who don’t realize this seem to be billionaires and frightened students.\n\nIt’s kind of like claiming that having the ability to read and write music (… not create, mindlessly notate scales for textbooks) is somehow your personal moat. No, it's your ability to take that input and transform it into something meaningful and contextual, something that helps and uplifts others.\n\nI'm not referring to the future; that's what development is today. Someone else mentioned L3s doing all the coding, and that's right. It's because they are missing the process and domain knowledge that actually gets shit done. It’s why intern programs are really just campus tours and the only thing they really bring to the company is a streamlined hiring pipeline.\n\nThe future isn’t going to be dropshipped from LLMs, lmao.",
            "As a newish grad I agree, very excited for the prospect of working on bigger and more complex problems. I love to code and spend almost all of my time doing it, but since coding has been created we have been doing nothing, but abstracting it to higher levels for easier understanding and building bigger things. The inevitable evolution of this was to get it to human language so I’m not really sure why every one is so shocked? Maybe it’s because they didn’t expect it this quickly?",
            "Gambling always makes money 🙃",
            "Go into medicine",
            "These people are nuts. Kinda makes sense how the hiring of devs is so jacked. People that don’t know shit are trying to talk about knowing stuff.",
            "I think anyone who’s good at and has made a career out of writing code understands that coding is and always has been but a tool. It’s an applied domain, it makes life easier in general but is not a domain which has any value in and by itself. \n\nThe coolest problems solved through code are always cross-domain applications, from medicine to driving and so on. So I’m not sure why anyone is surprised. \n\nYou should still know how to write code, you should know how to apply it to a domain of your choice and you should be good enough to solve problems in that domain. But you still need to be aware of/knowledgable in domains other than programming.",
            "I respect carmack a lot. I disagree with this sentiment. If you are a good problem solver you know that we have a long way to go before human language can be used to create real products or new research by code generation. Perhaps one day we will get there. Even if we do you need people to analyze the results or know where to put the generated code at. Plus not to mention the legacy code based that exist\n\nI'm not saying these guys are wrong I'm saying that this type of thinking is a goal that still requires people to work hard and get better at problem solving. Learning and improving your ability to code will continue to pay dividends.\n\nI'm sure we will have a higher level language similar to human speech but that's a ways off and as long as it's code being generated then we still need good programmers. It will just be a big productivity booster",
            "Time to start consultancy firms with really really lucrative rates.",
            "The real skill that someone only using AI wont have is problem solving. Cant tell chatgpt to code something when you dont know whats wrong. Additionally, chatgpt gives me wrong code most of the time and says things that are incorrect. It has gotten even worse in my experience. We are not close to having it replace SWEs.",
            "Kids should not learn to cook hence restaurants exist. End of my TED talk.",
            "I think it’s silly to make this declaration for children who wont be entering the workforce for 10-15+ years. No one knew what the world was going to be like today when I was a kid. The important thing is to let kids get their hands dirty and make things. And to make things today they need to learn how to use today’s tools. The concepts they learn today will help them as software development continues to abstract further from the hardware.",
            "Yeah agree, instead they should do tik tok and only fans.",
            "Anyone that’s used chat bots extensively as a dev is going to find the idea that they going to replace us any time in the near future pretty laughable.\n\nBusiness leaders have been trying to sell no code/low code solutions for decades.  ",
            "Sigh, another \"coding is going to die\" comment from someone who is bias.",
            "Of course Jensen, who makes a shit ton of money selling gpus to power AI, wants AI to take over programming",
            "This is getting ridiculous",
            "I hate these posts.",
            "I feel it is a similar story to how calculator can replace mathematicians.",
            "Where are all the dumbasses now who said AI will never replace programmers huh? This sub used to be filled with so many idiots 😂\n\nSwitch to nursing or law, or actual engineering.\n\nCS is dead."
        ]
    },
    {
        "post_id": "17xdk2z",
        "author": "a2c_alt2",
        "title": "New grad is crazy this year",
        "url": "https://www.reddit.com/r/csMajors/comments/17xdk2z/new_grad_is_crazy_this_year/",
        "score": 444,
        "num_comments": 83,
        "created_utc": 1700222576.0,
        "selftext": "Last year, I had interviews with half a dozen companies, even DoorDash (which was then canceled because they laid off half the company), and netted two different high-paying internship offers. Now I'm applying with an all but finished degree on my resume from a prestigious school, MORE experience than last year because I have my entire internship from this past summer on there, and I have not gotten a single interview, phone call, or non-automatic email. I'm lucky to have a solid TC return offer which I just signed so that I'm not completely jobless, but this is insane. Most of my friends don't have return offers, have put out hundreds of apps, and are in the same spot as me with responses. I didn't think it could get worse than last year, but I guess it could.",
        "permalink": "/r/csMajors/comments/17xdk2z/new_grad_is_crazy_this_year/",
        "comments": [
            "Just failed the final round of my 2nd ever interview this recruiting season, and I have nothing else in the pipeline. I feel you man",
            "Amen, RO saved my ass. it’s especially tough this year.",
            "i’m a hold over from last year and i can’t get anything this year either. i’m working an unpaid internship now and applying for PhDs because what else can i do",
            "Rainforest?",
            "It’s gonna be a rough few years for tech. Eventually people will stop going into CS and the industry will recover but for now there is a huge glut of applicants relative to postings.",
            "It is getting worse every year. The backlog is so much and jobs aren’t there. Last year I got two offers when I was a fresh graduate. Now I have experience and my skills are also way better than earlier. I am not even getting a single offer. I feel it is going to get worse.",
            "thug it out",
            "Same boat brother, last year got like 5 interviews, even did multiple rounds with Square which I thought I would never even get a look in, got a job, subsequently got fired this June, and haven't got a single interview applying since",
            "Try over 800+ applications. Not a joke",
            "I’m so fucked",
            "I feel this pain so badly. 200+ apps and counting, my only luck has been career-fair related, which is a really long time ago…",
            "true so far I have only in a full interview loop with on company after 300+ apps.",
            "[deleted]",
            "Even with return offers, one’s gotta apply for other companies to net better offers and have alternatives if something unforeseen happens",
            "I thought 2024 new grads were having an easier time than 2023 new grads?",
            "If I can ask this here, my kid is currently applying for CS. This forum keeps coming across my feed and all I read about is the rough labor market for you guys. \n\nDoes computer engineering overlap with CS? Should someone preparing for college consider CE?  What’s the job market like for that field?  Or is it pretty much the same?  Thanks",
            "Supply and demand my friend. Supply is too high, for anyone entering this field for the bucks now is not the time.",
            "glad i'm not a CS major (well, sort of, but not really)",
            "Same boat man. Haven't had a single interview yet after applying consistently. Didn't get RO either from both internships. Only thing saving me is unemployment but that's only for 6 months.",
            "Well this makes me feel better about not getting a single internship yet",
            "Same here, even with Amazon and a masters degree I’ve only gotten one OA so far (which was sent instantly). Hoping for the return offer at the very least.",
            "I swear, the market is so bad!! I have an RO too, but now I fear losing it cause of the weird market situation. Hope things get better soon cause I graduate next year. Masters kinda feels like the wrong decision cause I had a solid job back at home :(",
            "Networking goes a long way, like a TON (half of my interviews came from referrals or connects). Been a miserable interview cycle (ive been thru like 9 processes) I'm only working rn because of the connections I have to startups and ctos from school. Wasn't at a target school, just worked my ass of learning on the side\n\nMy employment isn't stable either rn, on a month to month contract as they need me. We just gotta take what we can and never stop learning. Eventually when things kick up we'll be ahead of the curve",
            "Made it to final round with Google after 3 months and got rejected at the end. I feel exhausted.",
            "what’s TC?",
            "I mean, if the job market is that bad, start working on your own projects. Sitting around complaining all day isn't going to fix anything",
            "Thankful to live in germany. Our IT isn't paid as well, but the job market still has high demand. Only working as a paid intern right now tho.",
            "How many apps?"
        ]
    },
    {
        "post_id": "1661bj7",
        "author": "Realistic-Board6514",
        "title": "Does Anyone Actually Fucking Work At Netflix??",
        "url": "https://www.reddit.com/r/csMajors/comments/1661bj7/does_anyone_actually_fucking_work_at_netflix/",
        "score": 442,
        "num_comments": 73,
        "created_utc": 1693457235.0,
        "selftext": "Netflix is always known for being the “N” in MANGA or FAANG, but does anyone actually fucking work there??? I know people who work at Apple… and Google/ Alphabet, Meta, etc. I’ve never met a person that works at Netflix. I think maybe I met an intern once? But I’m starting to think the company is run by mice or Oompa Loompas or some shit. What do y’all think?",
        "permalink": "/r/csMajors/comments/1661bj7/does_anyone_actually_fucking_work_at_netflix/",
        "comments": [
            "Netflix has a couple thousand engineers. Amazon has like 70k.",
            "They’re too busy watching Netflix to talk to other people about their job",
            "Netflix has also historically not hired new grads or interns, so there’s a much lower chance you’ll just run into people. They’re offering them now, but that really only started within the past few years. That’s on top of how much smaller they are than other companies, as others have mentioned.",
            "It's ran by lizard illuminati.",
            "Cuz they didnt want it to be called FAAG",
            "My boi Frank Niu did",
            "ThePrimagen",
            "I know someone. She graduated ‘23 from my school (northeastern) and was my TA at one point. She was so well tempered and organized I’m not surprised she got Netflix.",
            "Always wondered how Netflix made their way into that acronym. They're nowhere near as powerful as Google or Amazon.\n\nMicrosoft would be a better company to consider part of \"tech's top\".\n\nWho makes up these terms anyway lol.",
            "I’ve never met anyone working for any of those. Maybe that means none of them are real",
            "Netflix runs on the switch of programmers and Amazon and it doesn't matter how many are always working.",
            "Their culture is different which is probably why. High turnover is what I’ve been told and studied. Not in a particularly “bad” way. just people come in work on projects that propel them to go somewhere else in a higher position. optimized for burnout.",
            "Simple. They don't hire new grads, but pay top salaries for seniors. They are also nowhere near the size of Amazon for example",
            "They rarely hire fresh grads.",
            "I’m interning there rn :)",
            "Oompa Loompas 💀😂",
            "You ever see the post office scene in Men In Black II? \nThat’s how they mailed out all the physical copies. Those are the engineers now.",
            "My friend got an offer. He denied and join another big company instead. The interview was extremely hard and exhausting.",
            "Did you know Primagen works at Netflix? Lolz",
            "I wonder they get free Netflix Subscription ;)",
            "Netflix only hires senior engineers. If you at the start of your career you’re probably only networking with junior and intermediate engineers, so yeah I wouldn’t expect you to know anyone who works there.",
            "Netflix is more like a quant trading firm than a FAANG tbh",
            "I heard they replaced Netflix to Nvidia with the change to MANGA 😂",
            "I always thought that the N was for Nvidia?",
            "If any of them are in this thread. Please change the player so I don't need [this chrome extension](https://chrome.google.com/webstore/detail/netflix-fullscreen-unfocu/gbfknkdpfiipfljnhokjecajeleleijh#:~:text=With%20%22Netflix%20FullScreen%20Unfocuser%2C%22%20our%20extension%20ensures%20that%20pressing,after%20clicking%20the%20fullscreen%20button)",
            "I'd say the N in FAANG is pretty much Nvidia now. I mean Meta isn't even Facebook anymore so FAANG is more just a word to mean \"Big top mega corps\".",
            "They do not hire new grads, only phds and 3+ years exp. They pay above market rate and expect excellence. If you didn’t go to T10 don’t expect to join Netflix.",
            "Ik 2",
            "Last hiring season it felt like Netflix was hiring more external new grads than the rest of faang",
            "Netflix is a much smaller company in terms of number of employees compared to the rest of FAANG",
            "Lol I have a friend that works there. Fullstack. 24. He was not a new grad, but his second job out of college",
            "They only hire seniors.",
            "Trash on Twitter ( or I should say, X) does.",
            "No. Its all AI.",
            "Shit company anyways",
            "Afaik netflix is pretty small compared to the rest of big tech + They  only hire senior swes",
            "Is Netflix even really a big tech company? They offer a streaming service, but they are heavily involved in the production of films and shows. That's kind of their main thing and I don't think they have any services besides that unlike google or Amazon for example",
            "Never understood why netflix was even part of \"FAANG\" and not something like msft",
            "Honestly dont know how my friend got in but good for him only person i know that got into netflix new grad",
            "I get the sense that Netflix is rather exclusive. Met a total of 4 people in my life who got hired there, two from my own alma mater.",
            "Yeah. I don’t know why people put it there. It’s way smaller than a lot of those companies. And probably doesn’t hire nearly as many as Google, Amazon, Apple, Microsoft etc."
        ]
    },
    {
        "post_id": "z8zi32",
        "author": "1234oguz",
        "title": "$20/hr, and Move to New York, Lol?",
        "url": "https://www.reddit.com/r/csMajors/comments/z8zi32/20hr_and_move_to_new_york_lol/",
        "score": 447,
        "num_comments": 244,
        "created_utc": 1669834059.0,
        "selftext": "Just had an interview with a company that offered $20/hr for a Blockchain SWE internship in New York.\n\nI did some mental math during the interview, and just asked to end the interview early since (Including transportation, housing, and food) I would have to pay for the privilege of working for the company. I have no offers rn, am I delusional to reject a company over $20/hr? I made $17/hr as a cashier almost 2 years ago... I feel like I'd rather work on projects, and try to start a startup over the summer instead.\n\nWhat are your thoughts?",
        "permalink": "/r/csMajors/comments/z8zi32/20hr_and_move_to_new_york_lol/",
        "comments": [
            "Lol that's a stupid ass offer. Good on you to end it early. They probably outsource everything to keep costs down. And if they do have local devs, I cannot imagine them even breaking 70k in NYC. Sad.",
            "you did good. not everyone just has couple grand to drop on an internship 💀 especially in nyc\n\nedit: i came back and reread this thread and a lot of people are saying how this was dumb. i know this cycle sucks and any offer is better than no offer, but literally, even if this cycle was good, some would never be able to afford housing in a random state, NYC on top of that. I’d rather take a shitty pay with housing or stipend, because it’s less worry. even if I was getting paid like $55/hr, i probably wouldn’t be able to afford first month until pay🤷‍♀️ i’m sure many can relate. don’t take housing compensation lightly, it’s a big deal in an offer.",
            "$20 is peanuts for NYC. Holy cow, some companies are so cheap.",
            "I had a similar thing happen. Got an offer to work on a AAA VR game for $15/hr remote. The catch was I had to live in LA with no relocation or stipend. Math was not adding up so I didn’t take it and was a plumber for the summer while working on projects, ended up making more as a plumber than I would’ve at this AAA studio",
            "Accept and keep applying. You don’t know when you’ll get another offer, if any before summer 2023.",
            "What company?",
            "The fact that you got an offer shows that you have what it takes to get another one. There are plenty of companies still hiring, accept it and keep grinding.",
            "I wouldn’t accept an internship that didn’t provide housing either. I feel like if you started the interview though you should at least finish it. I feel like the extra hour or two couldn’t have hurt and you only stand to gain by getting the offer even if you don’t accept it.\n\n\nEdit: housing or stipend. Sorry I thought it was obvious that I meant both since the focus was on the cost.",
            "Yeah fuck that",
            "It's looks good on a resume better than having just cashier alone. I don't know where you are from, but where I live.  All the cashiers turned into self-checkouts",
            "Lc and projects you got this",
            "Everyone saying “any experience > no experience” missed the fact in OP’s post history that they have had a past internship at a big tech unicorn and a 4.0 at a target university. Even if they do not take the offer and “do their own thing”, OP will end up fine recruiting for new grad in the future.",
            "I would’ve taken the job tbh. You can get a summer sublet in New Brunswick (where Rutgers is) for cheap, and take the train into NYC. Lots of affordable areas in NJ if you look outside of the Hoboken/JC/Union City area. \n\n$20/hour is too low for NYC, but if it’s your only offer, then that’s unfortunately what you’re worth rn. You also could’ve accepted the job and kept looking, and then reneged if you got something better. \n\nPersonal projects are nothing compared to actual paid SWE experience, sorry.",
            "Realistically you could have done fine on 20 dollars an hour in NYC and not had to lose money. Sublet one room (look around fordham) for 3 months in the Bronx - 3000 in total, transportation (subway) - 500 (overestimate), food - 1500. Let’s assume this is a 12 week internship, 40 hours per week - you make 8,700 after taxes in NYC. 8,700 - 3000 - 500 - 1500 = 3,700 to save or spend at your leisure. \n\nBut I don’t know you, what you value for living situations, transportation, safety, etc. Living in NY isn’t easy, I’m not saying the above math is reason to have taken that offer, I’m just saying it is very possible to not lose money (unless you account for the loss in money that could’ve been saved if you had worked elsewhere)",
            "A lot of people in the comments seem to be missing the fact that any offer >>> no offer.",
            "Okay as someone living in New York and as someone who successfully lived in New York on $2.5k a month, I'm gonna be devil's advocate.\n\nOn Airbnb or Facebook marketplace you can find an easy 1 bedroom studio over the summer for $1600-$1900 monthly studio in Brooklyn, Queens, or Staten island (where you can find $1300 1B) . If you cook your own food and use public transport, I think it is more then doable to live off of less than $2100 and save the rest.\n\nNow, 20 per hour is about 2400 per month take home after taxes and 401k deductions. ( But you save more and are taxed less if you live in, say, Brooklyn or Queens .... basically outside of manhatten)\n\nI'd say take the internship if you are okay with knowing you won't make as much as many of the people living there. My  2 cents.\n\n&#x200B;\n\nEdit - Also, In ALL of my faamg interviews, my start up experience was most of the conversation so the work of building stuff in a start up will be valuable in your career but lmk if you want me to talk more about that",
            "Speaking from experience if you don't go out to eat like every single day you should be fine with that compensation in NYC. There're usually a lot of students that will go home or travel during summer so you can sublease their apt for lower price and you don't need to spend a lot on moving. I'm assuming you'll be working full time thou.",
            "Honestly… I know that’s too little. But I’d take it. Especially if I need the experience and I’m on a deadline.\n\nBut good for u for not taking it, especially if you can afford to.",
            "Can you ask them to make it a remote internship?",
            "Do you think no one in NY makes under 20$/hr?\n\nGet roommates and live on a 20$/hr budget",
            "blockchain experience is gonna quickly be a chain around your leg tied to a block of concrete",
            "I do think there is a benefit to having an internship versus just working on projects. I think some people expect a bit too much when it comes to internships. I’d personally value the experience and resume value over whatever they pay you.\n\nFor context, I had a software development internship at the department of justice in the cyber division going into my junior year of college. It was based in Virginia/DC with no relocation (I was in California) and paid $15/hour. I still took it and luckily lived with a distant cousin near there.  Although it didn’t pay much, I definitely think it helped my resume.\n\nThe next summer (going into my senior year) I was a software engineering intern at Northrop Grumman in Aerospace Systems. They paid me $26/hour with no relocation. For a broke college student, I was ecstatic and also felt it helped my resume.\n\nI’m now almost 3 years graduated from college and have worked full time at Microsoft (2 years) and currently work at Google. So although my internships didn’t necessarily offer any great benefits or pay, their contribution to my resume and skills I think made a big difference, versus if I just did my own thing. \n\nThat’s just my opinions so take them with a grain of salt but good luck!",
            "It’s not a good internship but literally any experience is better than no experience.\n\nOne bad internship > almost any project",
            "Yeah fuck that they are just crypto douches taking advantage of a juniors devs desperately trying to get in",
            "Bro, this market is absolutely garbage. In my opinion it’s better to have an offer than nothing. You can keep grinding while at least having something to fall back on. Been looking thru the comments, don’t come asking for advice only to tell people off & disregard everything without thinking about the advice people trynna share man lol",
            "Dodged a bullet. Scam artists.",
            "Lol it depends on what part of NY. Anywhere south of Westchester, $20 is not enough to live well in NY. you're gonna be spending more than you're earning.",
            "Nah you played it correct",
            "Hell No $20 an hour is dodo I get paid 25 for help\nDesk in nyc",
            "Blockchain is 100% scam, so it’s best to avoid in general.",
            "💀is it remote? Bc no way can anyone survive enough on 20/hr in ny",
            "Where was this?",
            "You should reject anything regarding blockchain lol",
            "You simply just pick up a bartending serving job too to make it work.  How is that hard?",
            "Ask if there is a relocation stipend",
            "If I financial support to do it I would for the experience, but if I couldn’t afford to then yeah makes sense to drop it",
            " Name and shame",
            "Name and Shane",
            "$20 an hour?!? Is housing and food included? That’s enough to use the subway there and a cheap coffee.",
            "Possibly contact universities (there are a fair few) in NYC and see about dorms or possible housing stipend to be an RA? Lots of kids go home for the Summer leaving dorms unused.",
            "It was a good choice, I would expect $30 at the very least for New York for an internship. They should put the $20 per hour money into their full time developers salary, basically an extra $20 per hour. I highly doubt the full time employees of the companies are getting even a decent amount compared to other what other common are paying",
            "Should have gotten an offer, accepted it, then ghosted the company last minute because of how shit their pay is.",
            "The housing in NY is astronomical, so it's a wise move to reject the offer. If you were living with parents in NY it might work, but it's not a good offer otherwise.",
            "Ask for remote. One of your first lessons as an intern is to communicate your needs. The second lesson is to propose solutions. $20/hr remote makes sense for both parties.\n\nAlso gives you a chance to take another internship.",
            "I got a full-time swe offer at a blockchain startup. Base is 120k, Palo Alto.",
            "I know people that got offended that for on campus internships for ASB",
            "Damn I would pay a company $20 an hour to let me get an internship on my resume before I graduate. I would do anything at this point I need some kind of professional experience",
            "Name N Shame.",
            "Good call.",
            "Its an internship. Don’t look at the dollar amount but rather the experience you gain from it",
            "Unpopular opinion: You should’ve taken the offer and reneged if you got something better. Internships have alot of intrinsic value via resume brand. Trust me, it’s day and night between work experience vs no work experience applicants in terms of competitiveness for new grad positions",
            "It depends if you are willing to pay money out of your pocket to gain VALUABLE experience and if they do really offer VALUABLE experience. Valuable experience would be work experience that would give you an edge over other people that might be applying for the same future job you want.\n\nThe problem is that it might be a company taking advantage of you because they cannot afford you.\n\nNY is tough and you need to go to NY with a solid job offer in your pocket.  If not, you will be a slave looking for work for minimum wage.",
            "Bro, I know people in rural Indians working at distribution centers for 21 an hour. Like 40 an hour New York money. Screw them and their joke wages.",
            "Yeeeeeeahh I make $25/hr in Florida",
            "You made the right call, though personally I wouldn't have even interviewed with anything blockchain to begin with.\n\nI know you young'uns probably don't have a whole lot of leverage, but asking for pay up front is generally recommended. Though, wait, didn't NY pass a law like that where they have to state it up front?",
            "Anything blockchain is a scam looking for marks. You’re passing the test by walking away.",
            "They are smoking good crack my friend",
            "It’s a pretty crap deal for NYC but not having an internship and having is a really big deal for your marketability after graduation.  Based on your comments, I think you aren’t taking this seriously enough.",
            "Send me the place you applied to since I actually live in NYC. As you can tell I am down horrendous. 😹",
            "Next time just laugh pick up your shit and leave.",
            "Been there. I was struggling to find employment for about 6 months after graduation. Got offers similar to OP ~ 50k w/ 1.5K relocation to Austin, TX. I declined these type offers several times. Just recently accepted an offer for ~ 70k with 15k bonus to SLC.\n\nThe right offer will come, just wait.",
            "You can work at any bank and the starting is 18.",
            "$20/hr? I’m guessing you applied to a startup.",
            "$20/hr? I’m guessing you applied to a startup",
            "Surviving off 20 per hour in NY is hard. If there is a remote option 20 would be ok",
            "You could get remote call center jobs for that pay without a degree. Pass.",
            "Ask how do you expect me to live on that in nyc. Let them squirm a little bit",
            "Finding housing in NYC would be difficult while making 20/hr. Im surprise there aren't more reddit threads where students interning in newyork try to find roommates with other redditors interning in the same city."
        ]
    },
    {
        "post_id": "lt4qal",
        "author": "Fronoco",
        "title": "International Google Interns cancelled for Summer 2021",
        "url": "https://www.reddit.com/r/csMajors/comments/lt4qal/international_google_interns_cancelled_for_summer/",
        "score": 446,
        "num_comments": 65,
        "created_utc": 1614365254.0,
        "selftext": "Hello everyone,\n\nI just had a call with my recruiter, she told me that they recently got an update from the US Government.\n\nThey won't be able to process/sponsor work authorization **(J1 visas)** until at least 2022 for their interns, so all international applicants **who need a visa** will be withdrawn from the project matching pools.\n\nPretty unlucky we got so far only for travel issues to ruin our plans, but wishing best of luck to everyone applying again next year!\n\n*PS: You should still contact or wait for info from your recruiter, this is simply what my recruiter informed me for my situation with no visa and no authorization to work/live on the US. I have no info about F1 or any other individual situation.*",
        "permalink": "/r/csMajors/comments/lt4qal/international_google_interns_cancelled_for_summer/",
        "comments": [
            "Is this Google specific, or did the gov do smth that impacts all international internships ?",
            "That’s actually awful. Good luck in the future though",
            "Damn that sucks so bad!! Hoping you guys will be able recover this well",
            "I actually saw this coming in January and asked my recruiter to transfer me to the EMEA pool. I have an offer from Google, Zürich now.\n\n\nBut I think F1 students can still work during the summer under CPT.",
            "That's so fucked man. Wishing all international students the best of luck!",
            "This sucks to hear, and I honestly feel for everyone who lost their internship because of this. But this has me wondering... would they cancel the TN Visas as well? Sorry, if this question seems stupid.... it's pretty confusing to differentiate between the different visas.",
            "That's terrible. Hope you find something else to do over the summer.\n\nI think the update might have something to do with the presidential order P.P. 10052 as explained here: [https://travel.state.gov/content/travel/en/News/visas-news/extension-of-presidential-proclamation-10052.html](https://travel.state.gov/content/travel/en/News/visas-news/extension-of-presidential-proclamation-10052.html)\n\nI don't think the order impacts F-1 students.",
            "Dang. Sorry about that. I didn’t think the Biden administration was gona be like that lol. Lowkey it’s been a disappointment so far. Good luck in the future.",
            "I'm so sorry for what happened :( . All the best for the future. \n\nI have something to ask you. How did you make it till there, sir? I have heard that they never hire international students for an internship due to the visa, although they say that they hire international students, they don't in reality. I'm one of those who's trying to apply next year for an internship at a big-N in the US. Can you please educate me with the steps you took? It'd be very helpful for someone who has no friend or a family member who works for Google or even has knowledge about in this field.",
            "Does this apply to an international students living in Canada (with work authorization)? If I remember correctly they had an option to do the internship from Canada remotely, but what if the team is US based? Will J-1 Visas still be required?",
            "Google STEP international student here: I got the same news :( wishing good luck to all my fellow international students.",
            "Imagine people working so hard to actually land an internship at Google for this fuckery to happen. Disgraceful.",
            "[deleted]",
            "[deleted]",
            "I am so sorry to hear that! You'll definitely go somewhere terrific in the future!",
            "Would this apply to students working remotely from Canada?",
            "That sucks!! Can’t they do it online?",
            "[deleted]",
            "God awful",
            "What about Canada ??",
            "All politicians are the same. What a surprise. Sorry, this makes me sorta angry",
            "I'm planning to do my masters in us next fall. \n\nIs it a good idea to do so or shld I apply in 2023 or 2024 when things settle down?\n\nWill F1 students be affected from this ban this year?",
            "Have any of you heard any news about Pre OPT work authorization for F-1 visa?",
            "I had a call with my recruiter 3 days ago but he didn't tell me anything about this. Do any of you know if this is different for those of us who are already matched?",
            "True, my recruiter told me you are in Canada, I consider you in Canada to avoid J1."
        ]
    },
    {
        "post_id": "wm871w",
        "author": "hashashin_2601",
        "title": "I am faking that I write typescript",
        "url": "https://www.reddit.com/r/csMajors/comments/wm871w/i_am_faking_that_i_write_typescript/",
        "score": 445,
        "num_comments": 57,
        "created_utc": 1660267665.0,
        "selftext": "Hey everyone. So I am a Frontend Dev intern. My stack is React, TS. I don’t know TS. For last two months I an writing JS and whenever I get errors I add :any. This is not right I know. How do I get good with TS?",
        "permalink": "/r/csMajors/comments/wm871w/i_am_faking_that_i_write_typescript/",
        "comments": [
            "LOL",
            "If it's for real, you should know what you are expecting: string, number, custom type, etc.\n\nPlease at least use a union instead of any, if you can.",
            "Bro 😭",
            "How do you even pass code reviews bruh",
            "Based and any pilled",
            "dw u aren’t the only one, as long as u add the .tsx at the end of the file and it compiles, ur good",
            "Do y'all not use a linter wtf lol",
            "Holy fuck. I would fire most of you guys if you were on my team.",
            "don't worry, instead of any you can use\ninput: string | int | boolean | null\nkeep adding more until you've covered all types :)",
            "Just had 2 interns finish their internship with us. Next week I am going through all their code and fixing all of the (x: any)'s. Going to be lots of fun.",
            "My cs friends would say Google",
            "Could be worse. Had someone at my lost job get assigned a large project then left to code for a month without review. They used lodash to bypass all type enforcement. Every line looked like `_.set(thing, \"ridiculously.deep.path[i]\", _.get(_.get(...`\n\nTheir rationale? \"This way I don't have any warnings for explicit any!\"",
            ": Any saves lives LMAO just do leetcode with typescript",
            "Start studying.",
            "You are writing valid TS code. Congrats.",
            "Didn't see you were an intern and thought this was surely just trolling (still not sure). Still pretty funny.",
            "no code reviews??",
            "What you can do is just change the file extension to \\`.jsx\\` to remove all those annoying TS errors btw.",
            "TS is a bs language anyway. Consider yourself an activist.",
            "This comment section man LMAOOO",
            "Lol same tbh",
            "What about code reviews? lmao",
            "LMAOO",
            "I’m gone ☠️",
            "I don’t understand… typescript is literally just js with enforced typing? You can just declare types in js code and it’s ts",
            "I pray God you are just trolling. Seriously.\n\nAnd If you are not... they will find you, and shoot you in the leg.",
            "[Here](https://www.typescriptlang.org/docs/handbook/2/objects.html). You're welcome.",
            "Damn I have to use TS for for the backend and I got by using any till husky(linter) started acting up and I literally had to fix everything lmao. I still suck at typescript but I just suck a little less now. As a python dev I love JavaScript, typescript feels like going back in time to C++ lmao",
            "Fraudster",
            "This is hilarious",
            "brooo.....\n\nyou can take this course on udemy it will help a lot\n\n[https://www.udemy.com/course/understanding-typescript/](https://www.udemy.com/course/understanding-typescript/)",
            "I used to use :any on my first few weeks with the language. Then my mentor intervened and showed me exactly how to assign correct typings. One thing that helped me find the typing of something I don’t know is printing the ‘typeof’ of the input.",
            "Read one of the thousand TS books on Amazon. \n\nEmployers even reimburse you on them",
            "LMAO",
            "I would just study it 😂",
            "LPT: Just make all ur files .tsx 🧠",
            "Bruh it’s literally j JavaScript w types come on😭",
            "That’s… a joke right?"
        ]
    },
    {
        "post_id": "wadbxq",
        "author": "Rhystery",
        "title": "Easy interview companies 2022?",
        "url": "https://www.reddit.com/r/csMajors/comments/wadbxq/easy_interview_companies_2022/",
        "score": 450,
        "num_comments": 144,
        "created_utc": 1659023231.0,
        "selftext": "What are they",
        "permalink": "/r/csMajors/comments/wadbxq/easy_interview_companies_2022/",
        "comments": [
            "This is my list from personal and anecdotal experience and from looking at company tagged Q’s. Note that results may vary because when leetcode Q’s are asked in technicals there is always some randomness. \n\n\nNo technical: Ford, GM, Lockheed, Northrop, Vanguard, John Deere, 3M, nationwide, (any midwestern company or extremely non tech focused company). \n\nEasy technical (results may vary I’ve seen random leetcode hards at these places but majority of questions are easies): JP morgan, Cisco Meraki, IBM\n\nMedium technical (expect to see a leetcode medium, but if you’ve solved blind 75 then you should pass these companies technicals 80% of the time, they won’t ask non-pattern questions and I’ve not seen leetcode hards): Amazon, Oracle, Goldman Sachs, Capital One, Facebook, Lyft, AirBNB, pretty much Fortune 500 tech company that I haven’t listed in hard/impossible.\n\n\nHard: expect to see tons of complex mediums and high chance of a hard. You should solve the grind150 list in its entirety to be fully prepped: Microsoft, Google, Citadel, Uber, Palantir, unicorn startups, Snapchat, TikTok.\n\nImpossible: Code and Pray: Jane Street, Akuna (every question was just a WTF for me. Leetcode doesn’t help that much, they expect you to know TCP/networking concepts and system design. Every question was either about multi threading/networking or a 150 line leetcode hard)",
            "The difficulty of an interview is pretty much proportional to how good of an opportunity it is. If you want decent pay for an “easy” interview process, apply to non-tech F500 companies with niche software needs",
            "Jane street is pretty easy for anyone starting out their career",
            "If you are searching for companies that don't have Leetcode interviews, have a look at this repository: [https://github.com/poteto/hiring-without-whiteboards](https://github.com/poteto/hiring-without-whiteboards)",
            "As much as I hate LC, I have also noticed that I gained the least amount of growth at companies that didn’t question me in some sort of technical way. These companies usually were career stoppers, great for those who have no desire to propel growth imo since the tech stack used is also outdated. \n\nI’m currently transitioning into the data science field, and managed to secure a data science internship, the company absolutely grilled me and made me feel like I had no shot with the interview, yet they liked my passion for learning and that I was “vocal about my thought process” during the interview and decided to give me an internship. \n\nRejection is a bitch, and idk your situation so you know what is best for you, but still all I wanna say is that don’t let rejection and bs LC process deter you from reaching your potential.",
            "The government",
            "Liberty mutual",
            "Workday is easy - medium for new grads too but it’s on site",
            "Intuit is fairly easy",
            "After reading through people's experiences is it safe to say that keep applying and in the company that you are destined to get into ull be asked qs u know and will get in there ? What I mean to say is, everything is luck based.",
            "Be careful with companies that offer easy interviews. In my experience those are the kinds of jobs you show up for and they aren’t really what you expected.",
            "!RemindMe 1 day",
            "Additions based in my experience:\nRubrik - very hard\nExpedia - easy to medium",
            "Amazon for internships",
            "Wells Fargo",
            "LC tagged Palantir questions don’t seem super difficult. Palantir used to be super hard to crack, but not anymore.",
            "Lyft warned about medium LeetCode, but  I was lucky to get a hard one ;)\n\nIt was window sliding in string based on a medium task.",
            "Its random just do a lot",
            "JPM",
            "I did hacker rank for sr developer at indeed (remote) $170k a year few tricky multiple choice because random command line questions that you either know or don’t \n\nAnd one finish the code and when you successfully type it all out lol and hit run \nYou should get …. And it was timed I think I had 1 hr for the MC and 30 min to complete the code",
            "just get good at interviews omg",
            "!RemindMe 1 day",
            "!RemindMe 15 days",
            "New Relic",
            "!RemindMe 15 days",
            "JPMorgan Chase, mine was just a single panel interview at a virtual job fair 2 years ago.",
            "Folllowing",
            "stackoverflow",
            "RemindMe! 1 week",
            "easy"
        ]
    },
    {
        "post_id": "imiyjn",
        "author": "realizmbass",
        "title": "Learn to debug. I didn't talk to a single professor all 4 years because I read the error message and went to the specific line of code. This will cut your programming time in half, instead of having to talk to your professor or stop a lecture every time your code fails.",
        "url": "https://www.reddit.com/r/csMajors/comments/imiyjn/learn_to_debug_i_didnt_talk_to_a_single_professor/",
        "score": 450,
        "num_comments": 65,
        "created_utc": 1599236349.0,
        "selftext": "There's too many times to count when someone would stop an entire lecture or lesson because their code failed, and then the prof would spend 5 mins trying to help the person debug when it could've been done in like 10 seconds by the student.\n\nI realize this is not the case 100% of the time, like you may have problems with your software versions and hardware limitations, but the vast majority of these stoppages could've been solved by reading the error output.\n\nRant over.",
        "permalink": "/r/csMajors/comments/imiyjn/learn_to_debug_i_didnt_talk_to_a_single_professor/",
        "comments": [
            "I’ve never had a class where coding in class was part of the lecture.",
            "With that said, not talking to professors isn't really something to be proud of. Ask questions! Go to office hours! Cold email! This is how you get to know people.\n\nEDIT: see OP's reply",
            "[deleted]",
            "I honestly feel like general debugging skills should have it's own dedicated class (maybe with a side of useful and relevant non-coding skills as well)\n They could teach about debugging while you write code, debugging someone else's code (literally like 80% of my job right now, lol), common types of errors in different languages, registering dlls in the GAC and what that means, how to make an installer for a program, that kind of thing.",
            "I remember in CS1 a ton of people in my class would argue about these coding hypotheticals on what would you code reply with if you did x. It was super annoying, just make a test in your editor in 30 seconds and see what the language ACTUALLY does",
            "I literally cannot imagine not knowing how to read modern error messages. In most IDE’s you just click on the error and it brings you to the line. Literally just google the erorr",
            "> I didn't talk to a single professor all 4 years because\n\nwhat a waste of opportunity                 \nyou paid all that money, had all those PhD's to talk to               \nand you're bragging about not talking to any of them for 4 years",
            "How do you even make it through school without debugging ....",
            "This needs to be said?",
            "Uh... this is a very basic skill lol. I've never seen this happen in one of my classes; often student corrections are actually straight up correct.",
            "If you didn't talk to a single professor for 4 years you failed yourself. Professors are great sources of information, provide networking opportunities and are excellent resources.",
            "In my first semester, intro class, another student asked the professor to help him figure out an error. \n\nThe professor walked over, looked at the screen and said \"your style is terrible, fix your indentation, then I'll look at it.\"\n\nA few minutes later, the student said \"oh nevermind, I figured it out now\" and the professor said \"yeah, I know\"",
            "Can't imagine stopping a lecture because your own code during the lecture isn't working... why are people coding during a lecture anyway?",
            "My professor would laugh in my face if I tried that. But again, they don’t know what the problem is half the time either.",
            "Although i agree that we should learn to debug, i wouldnt \"brag\" about not talking to your prof. Questions should be encouraged. Just for those ppl who might be afraid to ask questions.",
            "Even if you can figure it out it can be helpful to talk to your professor or go to office hours.\n\n I remember I had some professors where I'd just go to their office hours, hang out, work on the program so if anything did come up I could ask, and listen to what questions other students had. \n\n\nObviously it depends on the professor and how much space there is in their office/outside their office. But I had some complain no one came and it's a good way to force yourself to get some work done as well as meet some other people in the class who care about doing well. Plus it can be good to be on good terms with your professor.",
            "I wouldn't even say that's debugging as much as it is common sense if you're not actually using a debugger and are just going to the line in the error message.",
            "Does anyone know a good JavaScript debugger? I can't seem to find any",
            "Coding... in a lecture? Sounds like a nightmare to manage.",
            "How do you do this?",
            "In addition, if you happen to read the documentation you avoid hours of google/stack overflow. However, sometimes the documentation handles terms you are still not familiar."
        ]
    },
    {
        "post_id": "zhg8w9",
        "author": "dee_gamer",
        "title": "Got an offer !🥲🥳",
        "url": "https://www.reddit.com/r/csMajors/comments/zhg8w9/got_an_offer/",
        "score": 446,
        "num_comments": 41,
        "created_utc": 1670638892.0,
        "selftext": "Omg, I graduate in a week and finally got an offer, decent salary and remote, so I get to stay with family, I have other interviews with other places, but the peace of mind of having an offer before walking for graduation is so nice.",
        "permalink": "/r/csMajors/comments/zhg8w9/got_an_offer/",
        "comments": [
            "job got ✅\n\nmuch happy 😊",
            "Congrats. I can't wait to post this when I get an offer one of these days :)",
            "Congratulations 👏👏. Like zyzz said: we are all gonna make it",
            "Congrats!",
            "That’s awesome! being able to stay near family is such a huge perk. Take some time to relax before starting the job!",
            "Congratulations :)",
            "Congrats :D",
            "Congratulations OP !!\n\nCan you share your experience and process ?",
            "Congrats!",
            "How will you go for outings? Interact and meet eith your teammates? Does company give you WFH setup allowance? I got a remote job offer as a recent grad.",
            "So happy for you stranger ! I hope One day I’ll be able to make the same type of post on here. Best of luck",
            "The happy ending",
            "A decent salary is better than no salary.",
            "Congratulations🎉",
            "Congrats :)",
            "YAYAYAYAYYY! Congrats my dude. I am so proud of you. You so deserve this opportunity, and I am sure you are going to crush it in the future. :)",
            "Way to go, congrats!",
            "Congratulations 🎉",
            "Congratulations!",
            "Congrats! Happy for you! <3",
            "Congrats I have no clue who you are but I’m smiling 🤝🏾",
            "Congrats hope it all works out 🎉🎉🎉🎉",
            "Do you mind sharing company"
        ]
    },
    {
        "post_id": "1agt87d",
        "author": "Future_Assumption_33",
        "title": "Be more likeable",
        "url": "https://www.reddit.com/r/csMajors/comments/1agt87d/be_more_likeable/",
        "score": 442,
        "num_comments": 124,
        "created_utc": 1706841891.0,
        "selftext": "Word of advice for those of you failing behavioral interviews: you are in a likability competition. Stop losing.\n\nI have 3 technical interviewers in my family. All of them will tell you the same things:\n\n1. Having an accent can hurt you, unless it is a European accent (French, British) in which case it helps.\n\n2. Attractiveness is important. Be physically fit and well groomed.\n\n3. Be funny. People want to hire people who will make their workday less boring. It’s hard to reject a qualified applicant, but it’s way harder to reject the applicant who made you laugh.\n\n4. Be conversational and relatable. Have interests and hobbies to talk about.\n\n5. Care about the company and ask questions to show you’ve done research.\n\n6. Have answers prepared to talk about past experience. Biggest strength, biggest weakness, missing a deadline, overcoming an obstacle, directing a team, and speaking up for quiet people are stories that they will ask for in most interviewers. Be a good story teller and talk about how you learned because you’re not perfect.\n\nI hate seeing posts in this sub about “somehow got rejected from my behavioral after doing so well. I smiled and talked the whole time.”\n\nBehavioral interviews are not sanity checks for your pulse and existence. These companies want workplaces with likable people so their other employees don’t want to leave.",
        "permalink": "/r/csMajors/comments/1agt87d/be_more_likeable/",
        "comments": [
            "So I just wrapped up an interview last week. I literally check every single box you pointed out. The only thing that went wrong was me not knowing the answer to 2-3 technical questions. But everything else was on point. They told me I should be hearing back within 2-3 weeks.  Which should be by Feb 13th. I’ll update this if I get it and that should be one proof towards this theory. Otherwise imo this would be invalidated, at least for me. Cause I felt like me and the interviewers bonded and it was a pretty fun interview. 2 whiteborading questions, I nailed one and solved the other with a little hint. Everything else went great so🙏🏼. Will update by Feb 13th.\n\n\nEdit: didn’t get it, they went with another candidate. God is great and I’m sure I’ll get something better. It was for Intel.",
            "In summary: you know the CS major stereotype? Don’t do that. Do anything but that.",
            "One of the best posts I’ve seen on here. Most of the offers I’ve gotten have been solely because of the behavioral, I’ve never really had to grind leetcode at all.\n\nI’m not a conventionally good looking person either, I just know how to not be too awkward and keep a conversation going. Soft skills make up 60% of interviewing and sometimes the job.",
            "This is an excellent post. Fellas reading this, this is single handedly some of the best advice I've seen on here.\n\n\nThink about how many people you know that don't really know much but have internships. This is why.\n\n\nBut OP, I wouldn't say an accent harms someone that much. It is mostly about how easily the interviewer can understand them",
            "We dating the interviewer?",
            ">Have answers prepared to talk about past experience. Biggest strength, biggest weakness, missing a deadline, overcoming an obstacle, directing a team, and speaking up for quiet people are stories that they will ask for in most interviewers\n\nThis one is often overlooked but important. I always ask candidates about their failures and mistakes, things they learned, and how they would do it differently if they could go back. This is a critical part of demonstrating your value as a long-term employee.\n\nEveryone in a tech field has past failures and mistakes. If you cannot talk about them openly, this means you are either hiding something (maybe even from yourself) or you lack valuable experience.\n\nWhen you make mistakes or bad decisions in your career, remember this and think about them often. Grow from them and be prepared to explain how you grew from them.\n\nTrying to present a \"perfect\" image in an interview is a red flag and looks suspicious, no matter your intent. Don't be that guy. You aren't fooling anyone who is worth working for.",
            "Above all, they care that you have a smile on your face and try to not look too tense",
            "How does having a European/British accent help? Like is it in the sense that it isn't a disadvantage, or can it actually have a benefit/positive impact of some sort?",
            "![gif](giphy|CAYVZA5NRb529kKQUc|downsized)\n\nTime to looksmaxxx",
            "Step one: be attractive \n\nStep two: don't be not attractive",
            "Meet point 2( the groomed part I’m fat lol), along with 4,5, and 6. Not a funny guy by no means but Haven’t failed a behavioral yet within the 6 years I have been on the market",
            "It's true \"Networking\" which is the best way to get a job, basically means be likable.",
            "I haven’t seen a post as good as this one on this sub in years lmao.",
            "Lol, so I'm Nigerian who moved here 6 years ago. I still have an accent, I guess I'm screwed. 😅",
            "can I get a referral from those 3 tech recruiters in your family?",
            "So I have to Looksmaxx and be Humorpilled?",
            "I really don't know how I can fix the accent part. For context, I have a quasi Bengali-Southern US accent that sound really fucking weird when I speak, though some calls its attractive (mostly when I'm leaning on the Southern US accent heavily).\n\nThough I do agree with everything else.",
            "Blud said \"get rid of your accent\" and \"stop being ugly\"",
            "So basically, the industry needs to change and behavior interviews need an overhaul. Because basically, fuck any smart person who's knowledgeable in CS, just because they're an introvert who isn't good at socializing. Where that has no impact at all in the product of the company. And not being social doesn't automatically equal that person is an asshole who won't get along with other employees.",
            "I literally qualified all the tech rounds but always got rejected at behavioral \n\nThe only reason I got placed in my present company is cause they liked my tech round so much that they skipped behavioral round only for me☠️",
            "The more you guys are unlikeable the easier it is for me to get my job 😌",
            "“Dont be autistic” ok bro",
            "When a career is saturated, there will be discrimination based on looks. Just do something your better looking, better connected peers aren’t doing. Then you will eventually get hired.",
            "[deleted]",
            "you can be physically fit and well groomed and still be unattractive. genetix don't care about how you're dressed/whether you go to le gym or not.",
            "[deleted]",
            "*\" Having an accent can hurt you, unless it is a European accent (French,* ***British***\\*) in which case it helps. \"\\*\n\nOn what planet does having a British accent help someone, in the United States having a British accent is an invitation to being bullied, harrased, mocked or to be generally disliked or worse killed. I can't think of any other accent that puts you more at a disadvantage than a British one (in North America especially but other parts of the world too).",
            "Agree with all except 2. I haven't seen any correlation there , but if you mean \"don't use a College hoodie and shower\" yes ... But it's also easy to see how many has this disdain for more social or manager roles, and they shows to me they probably are hard to work with and can not understand the other side or adapt to demands ",
            "[deleted]",
            "What hairstyle is preferable for men? Are bangs out of the question or should it be parted to the side?",
            "I’m sure this guy is referring to my post about Microsoft. Good advice besides the part where you quote me by saying “I smiled and talked the whole time”. \n\nYou can dm me to ask what I talked about instead of assuming I wasn’t relatable or that I can’t hold a conversation. If you were talking about someone else’s post then disregard. \n\nI’ll try to fix my accent too?",
            "Sorry but this seems only relevant to companies without standard interviewing processes like big tech. Just look at all the exceptions to this post that work there (cough heavy Indian accents)",
            "Ma' G be spitting all the facts out. 💯 ✨️",
            "Wait.. this is almost the exact same advice i was given to have sex during my freshman year at uni. Im a virgin",
            "So it’s dating?",
            "Ok"
        ]
    }
]