[
    {
        "post_id": "12fp85o",
        "author": "None",
        "title": "A Guide to grinding Leetcode",
        "url": "https://www.reddit.com/r/csMajors/comments/12fp85o/a_guide_to_grinding_leetcode/",
        "score": 444,
        "num_comments": 29,
        "created_utc": 1680967412.0,
        "selftext": "Leetcode is famous for being a perfect platform for practicing coding problems and to master coding interviews, unlike others, it is not for competitive programming, this guide will help you to get started with Leetcode without losing hope too early.\n\n[A Guide to grinding Leetcode](https://theabbie.github.io/blog/leetcode-grinding-guide)\n\n## Follow a list\n\nBiggest reason why people don't find DSA interesting is because they are unable to discover good problems which are easier to solve, simply solving popular questions with no track of questions will bore you very quick. Even worse, you might try solving a really hard problem and lose motivation when it wasn't that hard, you just had to get a grip on it. That's why it's absolutely necessary to follow a list of questions, that way you won't have issues discovering new questions.\n\n**Solving problems in right order is very important,**\n\nyou might see question marked easy which isn't actually easy, the solution will be small, but sometimes, it isn't easy to come up with that solution if you haven't done simpler version of it, thus, it will be demotivating,\n\n[Blind 75 Leetcode Questions](https://leetcode.com/list/xi4ci4ig/)\n\nThis is an awesome list which is asked in interviews and is ordered by actual level of difficulty with prerequisites coming before harder questions, if you follow this, you'll feel interested, once you have done most of this, do problems in “similar questions\" section below each problem till you master that category.\n\nOnce you feel confident, you can use this,\n\n[Leetcode Patterns](https://seanprashad.com/leetcode-patterns/)\n\nand solve problems by category, this will help you master a data structure or some algorithm.\n\ndon't get afraid by “hard\" questions, there is no hard problem which can't be broken up, try to break it, you might not be able to solve it but you'll convert it to much shorter set of problems which can be solved with some practice.\n\nThinking abstract and looking at bigger picture is very important, try to convert it to a standard problem. Leetcode is addictive if you improve gradually, try it.\n\n## Avoid looking at solutions easily\n\nIt's not bad to look at solutions, afterall, you can't know everything and learning is necessary, however, looking at solution just after few minutes of brainstorming is bad, you have to give your absolute best and try every possible \"inefficient\" solutions you could come up with.\n\nFirst phase is to figure out what Algorithm and data structure will be used, if you are able to determine what data structure will be used, you can check the **Related Topics** section to verify if your assumption was correct, and if after few minutes you can't figure it out, you should still check the data structure that will be used and then try to figure out how and where it will be used in given problem.\n\nIf you are able to come up with a solution which works correctly, just isn't the best one, that's still a success, coming up with a brute force solution is a bare minimum in an interview.\n\nYou can try improving the brute force solution by using some optimizations, that might not lead you to the optimal solution, but improving a solution is a great skill. After spending an hour, if you can't solve the problem, you should usnderstand that you just aren't well versed with the given algorithm and should try solving related problems with that data structure and understand how it works.\n\nYou should avoid looking at solution, a solution you made yourself will help you much more, you should abandon the question and maybe revisit in future when you have some experience with that data strucure. That way you can also track if you made some progress with that technique and if you could solve a new problem given to you in an interview,\n\n## Interview Questions don't come with hints\n\nOne thing to remember is that Interview questions won't tell you what data structure will be used for the problem. That's something you can only master with practice, the patterns and requirements of problems determine what's going to be used.\n\nThere is no substitute for practice, reading about algorithms will sure improve your range of thinking, but practice is what will help you master it.\n\n## Be Consistent\n\nThis goes without saying that practice needs consistency, simply overdoing once and abandoning for months will be destructive, it doesn't take much to take out some time everyday for Leetcode, as far as discovering questions is a concern, you can use Daily Challenges to keep the consistency and maybe also earn Leetcode coins which might buy you a Leetcode T-Shirt one day.\n\n## Turn Demotivation into learning opportunity\n\nThere will be times when you can't solve a problem despite all efforts, that's very common and bound to happen, but some question being too hard is not something that should demotivate you, every question is a learning opportunity, you can always learn it. Demotivation should be avoided and that's only possible if you have confidence in yourself and will to learn as much as you can.\n\n## Participate in contests\n\nEventhough Leetcode isn't a competitive programming platform, there are contests which allow you to try out brand neew problems and even compete with others. They have categories of 1 easy, 2 Medium and 1 Hard, and solving 3 is more than enough. Once you have enough confidence on your problem solving ability, these contests will help you gain interview experience as they don't have any hints and solutions aren't available during contest. This is pretty close to a real interview experience where time is limited.\n\n## Keep Hustling\n\nLeetcode is an addiction and soon you'll fall in love with it, all you need to do is start, there is only one good time to start anything great, NOW, just do it and you'll sure be satisfied with your decision and be proud of yourself. That's all, It's never too early and never too late.",
        "permalink": "/r/csMajors/comments/12fp85o/a_guide_to_grinding_leetcode/",
        "comments": [
            "Hi, thank you for the guide. Could you also add some tips on how to approach problems? Or point at any post that is relevant to that? \n\nI watched Professor Leonard's math videos where he explained \"An Approach to Problem-Solving,\" where he gave tips on how to solve word problems:\n\n1. Read the problem carefully\n2. Do not immediately make equations,\n3. Look for similar or exact formulas,\n4. Identify the variables/the unknown/the \"something,\"\n5. Identify where the \"equal\" sign is,\n6. Assign variable,\n7. Make **verbal model** => Here is something that really interests me, he began changing and rearranging the words into math equations after identifying each variable and constant.\n8. Solve the equation\n\nI found that this verbal model helps solve problems by rearranging words to follow standard equation writing, hence also helping in making logical reasoning followed by pseudocode writing.",
            ">Leetcode is an addiction\n\nTLDR",
            "Is there a DSA class/course that you recommend before jumping into the LC grind?",
            "Yay another Leetcode guide . Successfully saved",
            "At what point can i actually start doing leetcode questions as a beginner programmer though?",
            "A nice guide! \n\nI have this thing where I get irritated as I want to know the patterns of the problems.\n\nIf I solve with the list and if I end up looking at tags/ solutions I feel like that pattern or type is something that I haven’t practiced so I just go through solution and then solve it.\nAnd then after a few days(sometimes in an interview) if I see the same problem I can’t solve it :( \n\nBecause of all this I am loosing confidence and am panicking easily and now have almost quit leetcode.\n\nToday’s leetcode contest had an easy problem with 2D arrays and I panicked since I haven’t solved 2D array problems in a while.\n\nAnyone else who had same issues?",
            "Also I recommend these links\n1. Forget the problem. Understand the situation. https://codeforces.com/blog/entry/106346\n2. Prove your solution. How do you know without a doubt your solution works? https://codeforces.com/blog/entry/111849\n\nCodeforces may be overkill but these articles can be applied to general problem solving. You can also try Atcoder. It’s disgustingly good (you’ll know what I mean).",
            "I kind of realized the only place in this field where you can avoid LC is the EM route lol. No wonder we're so oversaturated with useless managers. Too bad big tech is going to flatten their structure and reduce EMs. Guess that option is gone.",
            "TC or GTFO",
            "How well should you be able to code before three blind 75? I’m a freshman rn and don’t really feel like I know anything yet",
            "Leetcoding is like lifting so do you even lift bro?",
            "As someone who have been coding for a while but haven’t heard of leetcode until recently, is leetcode mostly coding exercises that one would encounter on job or is it one of those code practice websites that required algorithmic thinking/approach? Cuz if it’s the latter I find in practice “algorithms” are kind of rare in coding",
            "Remind me! 1 day",
            "Is there a resource that offers practice problems for programming 1/2. Essentially pre DSA questions."
        ]
    },
    {
        "post_id": "roasya",
        "author": "KingBacon42069",
        "title": "What are some of the skills a CS student must learn during University?",
        "url": "https://www.reddit.com/r/csMajors/comments/roasya/what_are_some_of_the_skills_a_cs_student_must/",
        "score": 445,
        "num_comments": 103,
        "created_utc": 1640442732.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/roasya/what_are_some_of_the_skills_a_cs_student_must/",
        "comments": [
            "Not all schools teach this, but learn shell scripting, working in a Unix environment, and git/git branching workflow before you graduate.",
            "* somebody already mentioned the video series from MIT: “The Missing Semester of your CS Education”. This is necessary, but not sufficient.\n\n* public speaking / presentation / writing skills.  In industry, this will have more impact on your career than anything you remember about big o notation or complexity classes.\n\n* teamwork.  Nothing that you do of any significance will be done alone.  You will need to learn to work with people.  You will need to work with people who are miserable to work with.\n\n* Tooling *around* the software development process.  The Missing Semester covers some of this, but you’ll also need to know about requirements gathering, workflow management, the various kinds of testing (unit, integration, testing, etc) and operational stuff (networking, databases, operating systems, managing complexity, etc)\n\nGetting a well-rounded exposure to all of that is what will advance you to a mid-level position quickly.",
            "honestly, the most important skill I learned is the ability to learn. Everyday a new problem comes up and you’re expected to google and learn to fix it",
            "The ability to approach things logically. Splitting large projects into smaller manageable chunks till you can do them. Some problems seem impossible at a glance till you apply this. \n\nOn top of that: time management, social skills and where technologies are used.",
            "[deleted]",
            "Social skills +1. Learn how to be friendly and social. College is a great time to hone that skill. Also make a ton of friends. They’ll be your network 10 years from now. Not the random stranger you meet at an IT conference and never talk to again.",
            "Soft skills",
            "You think you know git till you get on the job",
            "Social Skills",
            "Soft skills:\n\n\\- Knowing when/how to look things up,\n\n\\- long-term planning,\n\n\\- time management,\n\n\\- balancing obligations (work + school + social life + projects + interview prep),\n\n\\- learning how to learn,\n\n\\- and, most importantly, SOCIAL SKILLS\n\nHard skills:\n\n\\- Data structures and algorithms (don't give me some bullshit about how you'll never use these because you most definitely will),\n\n\\- interacting with the command line, \n\n\\- databases and how they work,\n\n\\- memory management\n\n\\- distributed systems,\n\n\\- parallel computing,\n\n\\- being able to write CLEAN code that makes sense to an outsider (i.e. your TA),\n\n\\- coming up with a good solution from limited context and choosing how best to implement that solution (i.e. practical assignments),\n\n\\- and thinking about software on all levels (everything from the underlying hardware to the broad network systems that let me simp for Ben Awad in real time)\n\nObviously, there's quite a bit of theoretical nonsense that doesn't apply to 90% of software engineers (looking at you, prolog), but if you feel like you aren't learning anything valuable, you probably weren't paying attention\n\n(p.s. if anyone knows a practical use case for prolog please tell me)",
            "Programming",
            "How to exit out of vim",
            "Leetcode",
            "In my job I've used tons of OOP concepts that I'm glad I learned conceptually. I had to learn Git on my own so if you learned that in university you'd have a nice head start. Otherwise, as long as you pay attention in classes you should be ready for the job as long as you're willing to jump in and learn.",
            "Stress management, reading carefully, and patience",
            "Data structures and algorithms, join clubs for hands on experience that classes don’t teach like how Git works",
            "\\+ to be successful on the job",
            "Yikes. All the 'social skills' comments here is making me scared as literal fuck. :/",
            "Do not neglect DS and Algo skills. Builds problem solving and logical thinking skills to a whole another level. Plus it's asked in the interviews so goes hand in hand.",
            "Data structures. A lot of hacker ranks i been through involve using a data structure to manipulate an array, an array list, etc",
            "proper writing and leadership",
            "Compilers.",
            "Being conversational",
            "I’ll add that just taking classes isn’t enough. You’ll need to learn outside of class. This is why people suggest creating your own app. You’ll have some base knowledge and you’ll soon learn that you have gaps in that knowledge. You’ll look up some ways to do some action x. It will be sloppy , but the next time you see an app doing the same thing you’ll want to see how they solved the same problem. Also doing your own app you’ll get much better at debugging. If you get a chance join the free courses of Codepath if they offer it at your school. It helps bridge programming class to actual developer job. You’ll be using git to commit and push, work as team(which also is nice to learn how to handle issues and tickets when multiple people working on different parts of the code at the same time). And for heaven sake learn how to hide your api key in GitHub but still able to access it. I was an instructor for fall session and it was great seeing the students learn all the above.",
            "Hygiene",
            "How to get internships",
            "I hate all of these answers... If all I learned from school are DS, algos, Google search, and social skills, then frankly why the fuck did I go to college? You guys must all be sophomores or something.\n\nIMO the key skills are:\n\n* being able to reason about software at all levels (hardware -> network),\n* being able to iterate from big picture idea to implementation with clean™ code, \n* gaining enough context to come up with your own ideas/opinions about how software is built",
            "Build systems, containerization, ci/cd and deployments",
            "📝",
            "Time management. Know how long it will take you to write a clean piece of code. From design to testing.",
            "Learn how to communicate clearly, this also includes communicating with non technical folk. Specially people in management and sales.",
            "Social skills",
            "Self sufficiency and people skills.\nTrue that SWEs code and design  but just like any other industry, we tend to spend a lot of time dealing with people.\nAlso be prepared (mentally) for a rough ride, the industry isn't always as glittery as it seems!",
            "Unit Testing",
            "Googling for resources, brainstorming keywords to google.",
            "I would say MIPS language from computer architecture. I’ve been asked about it in every interview.",
            "Git, explaining your project to non tech people."
        ]
    },
    {
        "post_id": "14fd9ct",
        "author": "Far-Toe7220",
        "title": "Where are my fellow 2. GPA’rs",
        "url": "https://www.reddit.com/r/csMajors/comments/14fd9ct/where_are_my_fellow_2_gpars/",
        "score": 438,
        "num_comments": 191,
        "created_utc": 1687366987.0,
        "selftext": "Can we get an F in the chat\n\nwe got this boys",
        "permalink": "/r/csMajors/comments/14fd9ct/where_are_my_fellow_2_gpars/",
        "comments": [
            "I’m there, I fucked and didn’t care enough at the start of college lmao\n\nEdit: *I fucked up",
            "I barely got into my prestigious CS program because the requirements were especially low after the dot-com bust. I graduated with a C+ average and trivially got a job in the booming pre-2008 economy.\n\nNow I'm shitposting on reddit based on my irrelevant life experience.",
            "Can we get an F on the transcript",
            "I currently have a 2.5, but it's not a bad thing. I was able to get 4 internships so far, two of which being Chess.com and General Dynamics",
            "Don't worry yall, companies dgaf about GPA. Had a 2.5 and now making 120k at 1.5 yoe",
            "At one point had a 2.6 GPA in undergrad, but got it up to a 3.4 and now have a 4.0 with my Masters :)",
            "used to, but now it's a 3.2 lets go",
            "2.1, after working a 9-5 school seemed liked a joke and I just put minimum effort into it",
            "\nOther than making it harder to get an internship gpa doesn’t really matter lol, get that degree guys don’t give up!",
            "I graduated with a 2.5 overall gpa. I had good grades (3.5 core gpa) in CS courses but for GEs I literally had the mindset of “sick I have a 78% in the class and the final is only 15%, so I can just not take it and pass with a D”. I was on academic probation for the first 2 years of college. Because my GPA was so shit I couldn’t get an internship (or didn’t bother trying at least).\n\nGot an okay job at a small startup out of school for $90k a year, 1 year out of school I got a $210k offer, a year later got a promo which got me to $230k target TC, but with stock growth it was like $290k, year 3, stock dipped but got a decent raise, so target TC was $250k and actual was still about $290. GPA literally means fuck all outside of internships.",
            "Always had under a 2.9. Somehow I have an internship at a big bank",
            "Lots of people with internships that also have GPA's underneath 3.0. Good stuff, keep it up y'all🙌🏿",
            "How y’all finding jobs/interns left and right after grad😭I’m ‘bout to finish school and sending out 20 apps on LinkedIn a week getting no interviews",
            "I graduated with a 2.8\n\nI've worked for Amazon and Google",
            "[deleted]",
            "Graduating with 2.9 GPA with a 200k+ TC job lined up. Meanwhile I know MANY high 3.8+ GPA kids at my school struggling to get a job… there’s far more to a resume than just GPA.",
            "Not 2 but close lmaoo",
            "got a 2.9x, interning at my dream job after sophomore year. i’d say for jobs and such they care more about how well you present yourself and your knowledge than sheer grades",
            "I failed out of college twice (video game addiction) before finally graduating with a degree in psychology (2.8 GPA).  \n\n\nA couple server admin certs, a lot of shitty work, and 10 years later I'm making \\~300k as a devops engineer.  I know its not FAANG, but I'm doing alright for a poor kid from KS.  \n\n\nNo one has ever asked about my GPA.  Not once.  College is bullshit, so long as you can teach yourself / work hard.",
            "2.6 and FAANG gang, wya? \n\nObviously don’t try and do what I did, I put in way too many hours + a mix of good luck to get where I am now. Don’t let a bad GPA discourage you from getting to where you want to go!\n\n(And no, I’m not at Amazon)",
            "Most of my friends who had sub 2.5 gpa in college now work 6 figure jobs. They knew how to enjoy life and hustled where it mattered. They were good at making connections and school was just a way for them to make connections.",
            "Here. Finished Community College with a 2.5, it doesn’t mean I’m stupid I barely applied myself. When I do apply myself I get B+ and higher. I applied myself for the last 2 weeks of Calculus 3 grinding my ass off for the finals. Before I had an F and finished with a C+. Coding as well, I’m not a shit coder just barely apply myself. But I go to a 4 year now and need to apply myself and have hunger in me to learn because I’m 25 and I’m not getting younger.",
            "i have three semesters left to get my 2.6 up to a 3",
            "I don't have a degree, yet here I am in tech lol 🙃",
            "Graduated with 2.8 or 2.9, something like that. Had 2 internships and a part time job before graduating that turned into full time as soon as I finished. The right jobs know that GPA is not indicative of your work ability",
            "Was on academic probation my first two semesters, was able to work hard and get it to above 3.3 by end of Junior year. Keep grinding",
            "2.8 with 3 internships. Currently at a top private company. Sanity over good grades for me.",
            "Graduated with a 2.8 and have been gainfully employed for 4 years. You can do it guys!!",
            "Graduated with a 2.1 gpa in uni, now work a better paying job than the valedictorian. Go figure",
            "I had around a 2.5-2.7 all throughout college until my junior year. Finished with a 3.2 and good job",
            "Graduated with a cGPA of 2.7 (min required for internships)back in 2022 after 6 years of school (and a LOT of unnecessary credit hours). \n\nTook a job in ICT security. I am currently a senior analyst making 125k+ a year. Just emigrated to Australia to lead a new team. \n\nThey never once asked for my actual cGPA, only knew it was high enough to be eligible for internships.",
            "Graduated with a 2.8 from a state school you’ve never heard of , still got a six figure job out of college, and just got into grad school trust me guys you’re gonna be fine. Internships are wayyyy more important than gpa",
            "I have internships but I’m worried I won’t get into grad school. I wanna go to GMU",
            "Yea, your gonna have to above and beyond to prove your ability. No resting on the laurels of your degree unfortunately. Good thing in technical degree most people don't care.",
            "1.4 with two internships under my belt. Dont really care about my gpa lol. I do wish I would've went to a better school though",
            "2.4/4.0 CGPA. Just started a job paying 120k after 2 years out of school… Don’t let it hold you back!!",
            "Sitting at a solid 2.97 on my current university gpa 😔\n3.1 overall though.",
            "2.9er here less gooo",
            "Well it depends is it 2/4 or 2/5",
            "GPA doesn’t matter. Have had two internships at big name companies while homies with 3.5+ are at home rn",
            "F. Failed my first Unix and C course in 1993 and never recovered.",
            "Here! Want to do masters in cyber security from abroad but no university is accepting me",
            "No one has ever asked for my grades ever. I don't actually know my GPA, I know it was below a 2 but I still graduated. Even my security clearance didn't care. 20 years later no employer even gives a fuck about my education. \n\nI'm about to pick up my Walmart order of juice boxes and hamburger helper and I'll let the guy know I graduated as a software engineer pre 9/11, surely he will care.",
            "[deleted]",
            "im terrible at math and writing courses\n\nhi there",
            "Cs get degrees!\n\nBut really though, I’ve been told that your diploma is just the ticket to an interview. How you conduct and present yourself in the interview will de the decider of whether you the job.",
            "I tried hard I'm just an idiot lml",
            "While I get that a lot people are way smarter than me with low GPAs, I’d like to understand how you get to that point. I was working full time and pregnant and definitely suck at cs but never got below 3.2.  If it’s for lack of effort then why even go to school at all especially with how expensive it is? Couldn’t you just do projects and master leet code?",
            "Y'all keep that up, it makes me applying for grad school easier.\n\nI understand this is a shitpost, but I'm an old guy (36) in the school and regret my crappy grades when I was 18 and 19.  Now that I'm back in school changing careers, no matter how hard I work, I can not graduate with top honors.  Because of grades 17-18 years ago.\n\nI know you guys don't care, so keep on keepin on I guess.",
            "Not me, stay safe tho",
            "2.6. Class of 2015.\n\nWe out here vibing. I make $85k at a job that barely requires work. Just gotta ride that out until retirement/I get bored.",
            "It’s your CS GPA that counts 😤",
            "Hey fam!",
            "Enrolled in my States flagship school in the Gen Ed department hoping to transfer into the comp science department. However I had a really bad semester once due to mental health issues and ended that semester with 2 F's 1 D and a C. It wrecked my GPA to a low 2 and couldn't get into the schools computer science department. Applied to Transfer to a different schools computer science department and they accepted me. Luckily the new school doesn't carry over GPA's for Transfer students and my mental health recovered so I ended up graduating with a 3.5 GPA.",
            "2.8 here for the past two years. Thank god swe doesn’t need a transcript lmao",
            "F",
            "F",
            "Don’t worry about it - graduated with a 2.85, worked at a subpar job for ~85k for a year out of school to get some experience and then left and now make > 200k in finance. If you know how to grind non stop you’ll be okay. Just need to put the work in (70-80 hours a week for a year)",
            "Press F to pay respects",
            "Getting a 3.0 GPA is free",
            "GPA only matters to hiring managers if you don't have any substance on your resume. Have a Github portfolio, be involved in projects, join the IEEE and become involved in the CS based sub groups that are available, conduct and publish research (especially if pursuing graduate level work), start exploring and conducting work outside of the typical undergrad course work (explore high growth fields like Adversarial Machine Learning, Deep Learning, Algorithm development, Cybersecurity (Sensors and Detectors), etc.)",
            "I made it out this year guys🥹",
            "I had a 2.7 in undergrad…working full time during the day and taking a full course load at night. It hasn’t hindered me. Got my masters with a 4.0 20 years later.",
            "I have a 2.9, was as low as a 1.7 at one point. Im very happy with how im doing career wise at this point. Just sad that I don’t really have an option of doing a Masters anymore if I decided to down the road",
            "2.5 reporting in, following this sub I was convinced we didn't exist",
            "After your first job, no one is going to give a flying !@#% about your GPA",
            "And here I was feeling salty that I failed discrete math.",
            "Hey, I graduated a double math/cs major with a 2.8 gpa, and here I am now with two jobs, a masters and working on a phd. It's not the end of the world!",
            "in the end what matters is experience. if you're having trouble with that you can do research over the summer for free, and then do an internship for free, and then finally get real money with a full time job. it might take working weekends, applying for funding from school, or some other kind of finessing, but i believe in you",
            "Any accredited online CS degree programs from *reputable* institutions?",
            "Graduated CS with a 2.99 😭 fucked up 2 semesters and finally got my shit together and tried to make better grades. I want a masters but like dunno if I’ll be accepted. Either way, F 😭😭😭😭",
            "Here, but I am in the netherlands where 2. ish is the norm",
            "I got a 2.975 :/",
            "I worked for 5 years after bachelor’s, jumped through 3 companies and now in grad school. Hopefully, it will turn out to be better this time.",
            "i’m here! classes got difficult along with mental health struggles, resulted in a nasty F on my transcript. don’t stress too much about it. i got plenty of internships either way after that. of course it’s encouraged to get decent grades, but it’s not the end of the world if you fail a class.",
            "Graduated with a 2.7, never once has any recruiter/HR/company asked about my grades/transcript. It literally doesn’t matter as long as you pass the classes and get that piece of paper",
            "Finished undergrad with a 2.8, but I think the lowest I had was 2.5. I got my first job and got accepted into grad school",
            "2.35 GPA and I just started a job Tuesday. Not fang, only alright pay pay for CSCI majors (35$/HR) and on site, but it is within my tiny hometown. So only a 10min commute.\n\nReason for bad GPA: refused to accept that maybe I had adhd and never got help. Got help, was good to go from there. \n\nIf my dumbass can do it in this economy, y'all absolutely will once it gets better :)",
            "Dw man I’m a senior rn and I failed my first 2 semesters cause COVID hit hard that first year . So I have around a 2.8 Cumulative and am currently working a faang internship.",
            "graduated with a 2.9, got a decent job straight out of college. All will be well.",
            "2.9 and landed the job of a lifetime straight out of school without a single internship",
            "I'm a college dropout currently working at my first dev job, full remote, and it's my dream job working on the exact topic I would do as a hobby",
            "F",
            "2.37. My gpa carried over from 21 years ago. I was a horrible student. It is more like 3.5 since I re-enrolled in 2021.",
            "I graduated with a 2.48 from a school that you’ve never heard of unless you went there. I make six figures, have a free T10 masters whenever I want it through work, and all within 3 years of graduation.  The people who are obsessed with making money and going FAANG are just compensating for parents that wish they raised a doctor.",
            "Your gpa is only relevant when getting your first position out of school. After that no one cares.",
            "Yea and I’m miserable af someone pls teach me how to study for exams that’s my downfall"
        ]
    },
    {
        "post_id": "usdvlw",
        "author": "biogirl787",
        "title": "Went through 4 rounds of interviews since March and got rejected this morning. Could use some words of encouragement right now",
        "url": "https://www.reddit.com/r/csMajors/comments/usdvlw/went_through_4_rounds_of_interviews_since_march/",
        "score": 441,
        "num_comments": 62,
        "created_utc": 1652883173.0,
        "selftext": "Im so upset I want to cry and also be mad. So many emotions. Its incredibly hard to hear this especially when the clock is ticking post grad and your financial independence is on the line. If any first gens can relate, dm me.",
        "permalink": "/r/csMajors/comments/usdvlw/went_through_4_rounds_of_interviews_since_march/",
        "comments": [
            "1. If you went through 4 rounds of interview, then you were likely a valuable candidate. That should be good consolation to keep in your mind through this time of disappointment. They probably liked you a lot. \n\n2. In addition to that, you can always send a polite request for feedback on your performance as a candidate and ask what went well and what could have gone better. This is a good way to get candid feedback from people and that can help you prepare for the next opportunity. \n\n3. Don't lose your momentum. This is my own biggest weakness. Discouragement is plentiful on the path to success. Don't let it derail your efforts. \n\n4. Pace yourself. Pace your expectations. Things will happen but do your best to avoid burnout. \n\n5. You are a human in a competitive market. There will be many ups and downs. Persistence is our best chance. You got this.",
            "Stay hard motherfucker",
            "WHO IS GUNNA CARRY THE BOATS!!!??? \n-David Goggins",
            "I know a couple of people who didn’t have a single internship all through school but still managed to find jobs before graduation/within a year of graduation. everything is fine, don’t worry and push through",
            "Keep going we have all been there",
            "Not the end of the world, and this point in time represents just a small blip on the radar of your career!\n\n\nDoes your school offer any kind of career services you can leverage?",
            "Have you tried asking for referrals on blind?\n\nOr perhaps getting a resume review or mock interview?\n\nYou'll be fine just keep applying",
            "The interview process in most tech companies is broken but for a good reason. \n\nIt's not you. It's the companies. Their interest lies in being super selective. Especially, if it's a FAANG company, they have lot of people trying to work for them. They can afford to be super selective\n\nMost tech companies spend a lot of during onboarding. Also, a SDE can do a lot of good but can also do a lot of harm. FAANG companies in particular give a lot of freedom to employees, to do great things.. but that also means that employees can do bad things.\n\nAlso, the interview process is inherently an error prone process. For both interviewer and interviewee. There is no way they can know you as a person in 6 hours of talking to you. There is always a risk that they are making a mistake.\n\nSo, from the company's perspective there is always a risk that they are making a mistake. This could be that they reject the person they should have hired, or they hire the person they shouldn't have hired. The cost of  hiring the person they shouldn't hire is much much higher than the cost of rejecting they should have hired. Rejecting someone only costs them 6-8 hours of company time. Hiring the wrong person will cost them those 6-8 hours, plus about 6 months of salary, plus whatever damage the person does.\n\nIn a nutshell, the interview process is geared to err on side of rejection. If they reject you, it's very likely it's because they just didn't get to know you enough. Or maybe you just need a little more exposure to challenging problems.\n\n\nI've been in 30+ Amazon interviews, and there's been only 1 where the consensus was that this person should never work at Amazon. It's always been \"eh we didn't get enough evidence\" or \"meh this person needs to get a little more experience here\". Many times, we are on the fence, but Amazon tell us to reject if we are on the fence. Many times, we think the person meets the bar, but Amazon wants the candidate to raise the bar.",
            "its very normal and expected for your first job as a new grad to take a lot of applications and rounds!! i would say don’t stress too much, just keep applying and don’t stop applying as you go through rounds until you have a written offer in hand (and even then if you think you can do better, you can keep applying). all you need is one yes!! and as long as you don’t give up you will eventually get a yes",
            "Also went through four rounds of interviews, maybe even 5, a few months back and got completely ghosted after they said i was going to get an official offer, discussing salary, etc. A few weeks later, I got an offer that was almost 50% higher, with insane benefits, in the field I wanted. Keep grinding because it will get better, friend.",
            "just keep applying",
            "Remember man, rejection is the first key to success, its really unfortunate however nobody would be anywhere if they hadnt failed at something important once",
            "Don’t worry mate! Something better is out there for you! \n\nMy wife went through 8 rounds of interview and didn’t get a response from the company till now. The interview process started 2 months ago lol",
            "cry. be mad. you’re valid in being upset. this industry can be unforgiving, and this isn’t going to be the last time you will be wildly disappointed. but once you’ve had a bit of a meltdown, you can let the emotions past. \n\nnow that you’ve mourned the loss of this opportunity, you can let that fuel you. grind more leetcode. send out more applications. make yourself a personal website. add a project to your repo. \n\nthink about what you didn’t do the best at in the interview. the topics you stumbled over, the experiences you didn’t explain very well, the questions you couldn’t answer. go back and try to answer them better. write it down like you’re answering an essay prompt, and then read it out loud. reword it until it sounds like a great thing to say in an interview.",
            "I hope you know that many other have also gone through the same thing, just know that things will still look bright for you even if it’s tough, it’s always best to push forward!! I was rewatching a show recently and though it’s a bit silly, this quote has helped me a lot\n“Don’t let someone else’s opinion of you become your reality”\nJust because this one employer rejected you does not mean that it sets your future or reality, like someone else in this thread said, if you were able to get through 4 rounds it’s obvious that you were a very strong candidate, maybe it’s just a sign that there’s a bigger and better opportunity with you in another place or company! Optimism is key even if it’s incredibly hard. You got this, i’m first gen too :) all the best and good luck 💞",
            "Try to see if you are able to find if you performed not so well at some point from your perspective. I could find these in some of product case type problem so I knew I had to improve on them (still doing it would love some suggestions )   .   If you are not able to figure out what went wrong that is the only situation you think about and if it happens consistently then either you might be unlucky or not able to comprehend the knowledge to know if you performed upto the mark.  \n\n\nUltimately , might sound cliché but use them as learning opportunities and try not repeating same mistakes agian.   \n\n\nFor motivation part : My personal belief is each interview I give adds to a threshold of my chances some might  add more value some might less but when I cross that limit , I will get a job.  It is just a matter of time and effort.",
            "hey hang in there. I know how you feel, thinking that you just wasted several weeks for no reason. The reality is that you didn't, you are now a stronger candidate and more well versed in interviewing. And I know you will come back stronger, so keep pushing.",
            "I also just went through 4 rounds of interviews and got rejected last week. I felt the same way. I shook those feelings here are my realizations that maybe you can relate to:\n\n- The company was not a great fit for me. Since they didn't align with my passions this could have led to some greater problems down the road. \n- I tend to dream about all the nice things about the company I'm interviewing for which makes it a bit worse when rejected. \n- As my friends pointed out, there are so many options out there especially in this field.\n- Maybe the timing wasn't right for the company.\n- That was my first set of technical interviews and I recognized many ways I can improve for next time.\n- Making it to the 4th round means we were highly considered, and probably also have high odds elsewhere.",
            "Part of the process . \n\nTake every interview as a learning step for next .",
            "I’ve felt like I could never get an internship or job at one point. It is indeed just a numbers game.",
            "Guess you’re not good enough sorry bucko",
            "You should have studied more leetcode. And train to stop choking under pressure",
            "[you can do it!](https://c.tenor.com/NII7Z9YQLsMAAAAM/go-for-it-you-can-do-it.gif)",
            "Keep going, you got this!",
            "Can totally relate, stay strong.\n\n[let’s talk about rejections](https://youtu.be/-acoJbjtuI8)",
            "You made to all 4 rounds, don’t worry and keep applying. Lots of opportunities coming your way!",
            "At least you tried!, Keep working hard and It will pay off!",
            "When you eventually get a job, no matter how long your job search you will finally feel vindicated",
            "Just went through 4 interviews and was rejected also. Hang in there",
            "lol i went through 6 rounds and there was SUPPOSE to be a 7th round. Got the rejection call today and I just laughed at their faces.\n \nI know it sucks donkey balls but you will get over this!",
            "Literally just got rejected 10 mins ago. In the same exact position as you. You're not alone",
            "Take at least two days off. Do absolutely nothing “productive”, hang out with friends, watch movie, go to the gym, go see your family, whatever. Not sure how feasible it is for you, but burn out is real and you definitely also want to take care of yourself.",
            "use that anger to grind the shit out of leetcode",
            "A friend of mine applied at 150 places before getting hired at his current spot. I know it can be rough out there",
            "Just keep chugging. Opportunities arise every single day. You will find your place soon enough",
            "It’s alright, I had a final round today too which I probably did not do well in. Have to keep head high and use it as a learning experience for the next one!",
            "PMA - positive mental attitude \n\nLife’s hard, staying strong in difficult moments is harder but you’ll pull through and look back at this moment as a development step and ultimately be happy with your choices.",
            "Please email them for feedback. Plenty of free templates to go off of. This is important to put you at ease",
            "Don’t lose hope.",
            "Technology is everywhere so a better place is on your path in the future. I’m a firm believer in everything that happens happens for a reason. In life we get hit hard with struggles but those struggles are meant to make us stronger and better people. You got this. Your future is bright.",
            "Let the job posting write your resume. Take what’s in the posting and do some slight word smithing. This will get your resume picked up by the automation and into interviews. Obviously only copy and paste line items over from the job posting that actually belong on your résumé\n\nGet referrals on blind. \n\nLook at aerospace and defense, automotive, and other industries within the military-industrial complex like that who’s individual contributor compensation does not normally scale up during good times as fast as compensation at bigger tech companies, FAANG, etc. Those companies are still hurting for people and hiring like crazy, while big tech is experiencing hiring freezes and layoffs because they pay extremely high wages (and give out tons of equity) to talent when the stock price is performing well. Defense and aerospace don’t do that—they simply pay “a competitive fair market wage” based on median pay for software engineers (based on YOE) in that area. \n\nSo yeah your first job might be making 60-80k instead of 130k + equity but at least you’re “in” - and within 3 years you’ll be making 100k+ with some experience under your belt to jump over to big tech, if you’d like.. assuming they’re back to hiring\n\nI’d do it soon, too, since all those folks who left aerospace and defense and automotive and so on for big tech salaries might be looking for a job within the next six months. Hope not, but the layoffs and freezes have already hit big tech and start up worlds",
            "AYE YOU GOT THIS 🤞🏽🤝🏾",
            "How about start your own project... maybe a crypto project.",
            "aww, you got through 4 rounds which means you are capable! I would contact the recruiter about how you can improve as you did make it To 4 rounds. \n\nAlso, how many rounds were there?",
            "Everything is going to be okay!"
        ]
    },
    {
        "post_id": "tm6k8q",
        "author": "None",
        "title": "Some of y’all need to take some statistics classes",
        "url": "https://www.reddit.com/r/csMajors/comments/tm6k8q/some_of_yall_need_to_take_some_statistics_classes/",
        "score": 439,
        "num_comments": 101,
        "created_utc": 1648125619.0,
        "selftext": "More of a rant than anything.  It’s great that you guys know how to code and all and do ML stuff in your major, but it’s quite annoying when y’all just want to throw neural networks at every dataset that gets thrown your way. Ooh, and the best part, argue and make excuses when it didn’t go well. Like it’s great that y’all come into data science positions with your AI classes and shit but please take some statistics classes. And no not your one semester engineering statistics classes. Like multiple classes, including regression, GLMs etc. I’m not perfect and know it all, but working with cs majors is so frustrating cause y’all think you know everything cause you won one hackathon.",
        "permalink": "/r/csMajors/comments/tm6k8q/some_of_yall_need_to_take_some_statistics_classes/",
        "comments": [
            "Yeah lots of people I’ve met want to collect all the “AI,” ML,” Blockchain,” etc. buzzwords but will refuse to take math courses lol",
            "Yeah, definitely can see where you're coming from. If you wanna go into data science stats classes are a must. It's just like how data scientists take python and r programming classes on top of their regular math courses. I personally am not going into the data science field because I am not a fan of statistics. However, a to of people kinda just get into data science with the flow of things and haven't taken stats classes because of that. Most of the comp sci students I know that are going into data science have taken several stats courses because it's part of their required coursework as a data science focus. So, my point is if you're kinda thrown into data science, you obviously haven't taken those courses but if you're going into your degree knowing that you wanna go into data science take those classes I guess if it's not a pathway embedded in your coursework.",
            "Most CS students dont do ML and thus dont need to know stats lol but yea I can see that being annoying",
            "But it's so hard 😞",
            "You’re right but when the teachers are bad, is it really worth the extra money and time to add the non required classes 😔",
            "Was a ML engineer for the DoD and then went to grad school for applied statistics. Turns out most ML classes scratch the surface and I was using a fraction of the tools available. Especially necessary, now that I'm a scientific researcher for a university. \n\nSpringer's Applied Predictive Modeling and Introduction to Statistical Learning were the textbooks that really cracked open my potential.",
            "I agree with this, when I started cs I got interested in the math courses and wanted to take more useful math courses and my math professor recommended me looking into data science, and I never realized how theoretical prob and stats can be. But I’m glad I took the courses and continuing to learn stats along with cs. \n\nIt’s super important to know what you’re talking about when presenting data, because nowadays everyone tries to manipulate data to match whatever they want people to think. I think everyone should take some basic stats class.",
            "[deleted]",
            "I have worked as an ML Engineer professionally for 2 years now. OP is right in the sense that if you're in college you should take more statistics classes but it's not just about that. You can always learn these things later as well. Some people learn better by doing - taking a problem and trying to solve it within the given constraints.\n\nAs you do your thorough literature review, you will come across interesting ideas and you might want to try them. My point here is that ML is very, very vast with too many new methods even within the neural network space and it's not possible to know all of them so don't feel down if you're not the most comfortable with a specific math technique.\n\nJust keep an open mind and be ready to learn tricky things when the need arises.",
            "Even Yan LeCun said cs is poor preparation for ML/AI, take math or theoretical physics + some programming courses if you want to go into that field.",
            "Which courses do u mean?",
            "I'm a data science student and lots of times I'm made to feel like we are unnecessary by three primary groups: compsci, stats, and natural sciences.  I'm always game to defend it because I can see why it's important, but data science has some pretty fuzzy definition boundaries which can make it hard to explain.  I found it much easier to convince others by using specific use cases.  This is an excellent use case and I'll be adding it to the ammo box.",
            "Lol then hire the right people",
            "You sound like my professor.",
            "Too bad I completed my university a couple of years back. OP (or infact anyone here), can you provide some good online statistics/math courses that a developer who will soon start working on ML/AI to benefit from? I have taken a Linear Algebra course or two but that's it. Would like to learn more.",
            "I'm biased since I generally did better in math/stats classes than CS classes but math and stats are fun",
            "I'm a pretty cookie cutter dude who simply just graduated with a CS major and knows how to solve leetcode problems, how exactly does stats apply to the field in the context of this post?",
            "[deleted]",
            "Beginning cs classes reward a lot of kids who get lucky with resources and think that makes them smarter . It gives them a God complex that leads to the issues you're taking about",
            "i can do stats work and i can learn math easily, but if you were gonna give a stats problem in front of me, i would have look up the equation despite recognizing said problem. Am i a dumbass for not memorizing every single thing in my math courses? I could recognize concepts but not the arithmetic work.",
            "I didn’t realize data science positions hired vanilla cs bachelor grads.\n\nKind of on the company to hire statistics people if they need statistics skills.  If they hire a history major, they shouldn’t be shocked if they can’t code.",
            "Stats is why I'm going into front end",
            "[deleted]",
            "but I watched a youtube video and did a udemy course /sarcasm",
            "YES",
            "Yeah, I had the same rant a while ago and channeled through humor r/programmerhumor:\n\nhttps://www.reddit.com/r/ProgrammerHumor/comments/sfljct/data_scientist_ml_engineer/?utm_source=share&utm_medium=ios_app&utm_name=iossmf"
        ]
    },
    {
        "post_id": "q3i1lr",
        "author": "pablopistachioo",
        "title": "Just received my first offer!",
        "url": "https://www.reddit.com/r/csMajors/comments/q3i1lr/just_received_my_first_offer/",
        "score": 438,
        "num_comments": 29,
        "created_utc": 1633638957.0,
        "selftext": "I can’t believe this. I’m a sophomore and I just received my first SWE internship offer. It’s not a tech company. It’s a big multinational manufacturing company. I like using the word multinational. I still cannot believe it. It’s so close to where I live also. I don’t have to move wow. They called me to tell me, I didn’t pick up because I was studying for my machine organisation and assembly midterm which is tomorrow. So they left me a nice voicemail and then I called them . The person said “ Hey I got a good news for you!”\n\nI’m just so happy . It’s hard as an international student, but I know next summer I’ll be independent and I can pay my rent on my own for a bit. Can’t believe its SWE internship. Wow \n\nI still have to study for my midterm lol and I have a couple more interviews the following weeks.\n\n\nEdit: wow I was studying hard and didn’t check this. Thank you everyone. Didn’t know this would blow up. I still can’t believe it.",
        "permalink": "/r/csMajors/comments/q3i1lr/just_received_my_first_offer/",
        "comments": [
            "you sound so happy haha congratz Im happy for you!!",
            "MULTINATIONAL",
            "Let's GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "Let's fucking go!!!!!",
            "Congratulations!! So happy for you!!\nI'm an international student myself, I know the struggle..",
            "Congrats!",
            "Good job and congratulations!!( also good luck on your midterm tmmrw)",
            "Woo hoo, sweet!",
            "Fuckin’ A man!",
            "Lesgooo, very happy for you. I know exactly how you feel !! xD",
            "Good shit. Snow ball that internship to full time :D",
            "Multinational congrats! I think I remember a post from you some weeks ago about you struggling to find one. You deserve this moment. Congrats again!",
            "Congrats!!!! I can feel the good vibes and happiness from your post.  Hugs!!!",
            "congrats!",
            "OMGGGG congrats!!!. Hopefully I'll get one too :)",
            "Congratulations!!! All the best.",
            "Congrats. Do you need any database ppl?",
            "Congrats op",
            "I’m happy for u too, keep it up brother!",
            "[deleted]"
        ]
    },
    {
        "post_id": "zl7ylx",
        "author": "SomePersonalData",
        "title": "The semester is finally over",
        "url": "https://www.reddit.com/r/csMajors/comments/zl7ylx/the_semester_is_finally_over/",
        "score": 439,
        "num_comments": 75,
        "created_utc": 1670967902.0,
        "selftext": "Just did my last final. Linear algebra. I’m so tired. I’ve consumed more caffeine this week than have in the past 2 years, not even joking. Also got broken up with today. Not sure why I’m using this sub as my journal. But goddamn it’s over. I feel like I just won a war",
        "permalink": "/r/csMajors/comments/zl7ylx/the_semester_is_finally_over/",
        "comments": [
            "[deleted]",
            "I actually have one more assignment, fuck. But still.",
            "Linear algebra was a beast for me. It made me question whether I could even complete a degree in CS!\n\nYou've worked immensely hard, and like everyone else has said, take some time to relax over the winter break. Happy Holidays!",
            "Congratulations, try to go get some rest and recover emotionally and physically.",
            "Just finished linear algebra this semester, too. I know CS classes are technically \"math\" but I never have to take another mathematics class ever again! I took college algebra back in 2015, and after many years, I am done with math classes. Now, it's just upper grad CS core classes for the next 4 semesters 😎",
            "That's awesome. Couple more weeks then you do it all over again. Get broken up with again too.",
            "I have algo and ml exams plus a paper all due today. But after that I'm free.",
            "I got a 70 on my linear algebra final. Added that will my other grades I will get a B in that class. It’s finally over",
            "Finals week is filled with more stress than USMC boot camp",
            "Mine won’t be until next Wednesday lol",
            "Good job! LA is often the last math class a CS/SWE major has to take and sometimes the hardest as well. Are you all done with math now?",
            "I'm sorry that this is happening to you right now man. College sucked really hard for me and I thought things would never get better. Take a day to have a good meal, a hot shower and long walk. You did well, you deserve it.",
            "Exam ended last week for me, been doing so much better now! W",
            "Linear algebra beat me with a stick. Worse I’ve done in a math class (thank god I only got 1 math class left)",
            "I finished next Wednesday, which will also be my last day of college since I’m graduating this semester. It’s going to feel like I won the NBA Championship Game 7",
            "my last final is a 1 page paper",
            "[deleted]",
            "Congrats! Same thing for me. Took me 5.5 years and I feel SO relieved. Enjoy the freedom, friend",
            "I have an architecture Final on Thursday and I’m so damn burnt out. I had back to back Theory and Programming Languages finals on Monday and I don’t wanna",
            "Fellow rambler??",
            "It seems that most of us would agree that linear algebra was the low point of the degree, and my exam (I’ve since graduated, but still feels like it was yesterday) was likewise absolutely miserable. \n\nTook it during COVID era and my final had 13 questions, each one took an hour or more, and it was due the same day it was released. I feel your pain and want to congratulate you for being a fucking menace and getting through it. Keep pushing on mate you’re gonna be alright",
            "Lmao I broke up with my ex a month ago, but yeah my final day was yesterday. I’m about to get back in the gym and restore balance this break.",
            "Same!!! Linear algebra final today, gf of 3 years we broke up a month ago. 1 last final tomorrow tho, wish me luck lol.",
            "Bite me. When I was in college we had Christmas break from about Dec 21 to Jan 2, Then 2 weeks of classes, a one week \"reading period\", about a week of finals. Two week semester break and classes resumed in mid February.",
            "Fuck. I have three finals next week. 😅\nHappy Holidays!",
            "Wait until u get to theory of computation, I passed linear algebra but this killed me",
            "Should I be glad we don't have linear algebra 😳 just calculus and statistics",
            "I just want my grades so i can officially be done with this semester.",
            "It's crazy... I feel the same.... Why was this particular semester so much more depressing than the past two?",
            "My linear algebra final was… 13 years ago… glad the credit transferred",
            "I'm sorry to hear about your recent breakup and the stress of finishing your final exams. It sounds like you've been through a lot lately. It's completely normal to feel a range of emotions after experiencing such intense events, and using this forum as a journal can be a healthy way to express and process your thoughts and feelings. It's also important to remember to take care of yourself during this time. You may want to consider taking some time to relax and unwind after all the hard work you've put in. And remember, it's okay to ask for help if you need it. Good luck!",
            "any tips on algorithms? i can’t wrap my head around it",
            "I had trouble in my Database Systems final but passed. Wished my Data Struc was more hands on though /:",
            "I just took my midterm.  Someday I'll be a warrior too!",
            "I found that pointing out an error in an Algebra textbook can really get a professor worked up.  I had to take my shoes off, but I just couldn't make \"One hour twenty minutes\" equal 120 minutes.  Must have been Spirit Airlines course plotting.",
            "I got an A in linear algebra 2, so you should do pretty good. As for your breakup, sorry for your loss. This is why people shouldnt be in relationships in college though. Womens hypergamous nature in that setting isn't conducive for them. Just be friends with and it leads anywhere after school, then you wouldve had time to screen them out",
            "I still 4 four finals :) so I haven't even begun but congrats",
            "Mine is tomorrow"
        ]
    },
    {
        "post_id": "va1y1l",
        "author": "seaworthiness7",
        "title": "LEETCODE IS DOWN",
        "url": "https://www.reddit.com/r/csMajors/comments/va1y1l/leetcode_is_down/",
        "score": 436,
        "num_comments": 53,
        "created_utc": 1654967373.0,
        "selftext": "Website Appears to have recovered. Back to the grind\n\n~~Website is loading slow, and test cases are timing out with internal error. This is worse than an AWS outage.~~",
        "permalink": "/r/csMajors/comments/va1y1l/leetcode_is_down/",
        "comments": [
            "Go to the park?",
            "Talk to the people of opposite sex",
            "Touch grass",
            "Codewars is still working. All is not lost",
            "The end is nigh",
            "Shocked the President didn't make an announcement",
            "but how can you be a software engineer if you cant l33tcode?",
            "PANIC.",
            "I was about to post about it",
            "HOLY SHIT",
            "Getting Connection Timed out errors now",
            "Now I will never get a job at FANNGMULA 😭😭😭",
            "It’s working now",
            "THIS IS NOT A DRILL I REPEAT THIS IS NOT A DRILL",
            "lmaoo I thought it was my internet just trippin",
            "Good.",
            "good",
            "Sorry, that was me messing with their servers. Won’t happen again",
            "Oh god, the world is gonna collapse",
            "it sometimes happens, especially when their weekly content opens, at 830AM (MT) or 830PM (MT)"
        ]
    },
    {
        "post_id": "sw64xx",
        "author": "55_percent_slut",
        "title": "Holy F***, I just made it in to Google",
        "url": "https://www.reddit.com/r/csMajors/comments/sw64xx/holy_f_i_just_made_it_in_to_google/",
        "score": 439,
        "num_comments": 91,
        "created_utc": 1645262787.0,
        "selftext": "Honestly in a state of complete disbelief. I just changed my major to CS three years ago. I struggle so much with everything in CS and I don't know how this happened. \n\nThis sub changed my life. Thanks for all the LC motivation and actual onsite prep tips.\n\nAlso posting this here and cause I can't share this with anyone but two people in real life 😭 so thank you for the nice comments",
        "permalink": "/r/csMajors/comments/sw64xx/holy_f_i_just_made_it_in_to_google/",
        "comments": [
            "Congrats that's amazing! \n\nI have just passed the phone screen and have my 5 45-min interviews in two weeks!  \nDo you have any tips? Was there any type of questions that you got most (graphs, trees, etc.?)",
            "When you join, ping me. Lets connect on hangout !\n\nWelcome to Google. You will have a good time.",
            "Hey congrats! I am also in constant disbelief because i got an offer last week from amazon. I know how you feel man. I couldnt sleep well the first 3 nights after i got my offer. Congrats once again!",
            "What was your method of solving lc? Like 3 a day or just 1 a day?\n\nAlso did you revisit the problems?",
            "That's great. As someone who started, less than two years ago, these kinds of personal success stories are motivating.",
            "congrats dude ! . I am lost as to how to prep . I struggle even with easy ones on LC because of which i get bad anxieties/interview fear many times .",
            "Congrats !!! Im praying I do well on my second up coming interview. Im applying for the IT Solutions Engineer.",
            "congrats lets hang out at google when it opens up!",
            "Congrats!",
            "Welcome!",
            "Congrats!!!\n\nWish you the best",
            "Congratulations!!",
            "did u have any previous internships or good projects",
            "Hey Congrats!\n\nBe happy in your accomplishments and confident in your abilities it was a huge one!",
            "How did you get in? How did you prep",
            "I felt the same way. Congrats ☺️👍",
            "Congrats! That’s awesome. Was this for a new grad role?",
            "Holy SHIT DUDE THAT'S AMAZING\nCONGRATULATIONS!!! YOU DESERVE THIS!",
            "I'm so excited for you. I'm about about start grinding LC, wish me goodluck",
            "Congrats, now you have to exit the rat race.",
            "Congrats! What onsite prep tips do you recommend?",
            "[deleted]",
            "Good job!!!",
            "Yeah well so did I and I’m not even 20 yet they just straight up let me in. They’ve always let me in lmao. If you could connect to google search until now I’m pretty sure you’re just an idiot haha. Its so easy you literally just type www.google.com in the browser search bar and press enter. Either an internet problem or a you problem. I hope you’re kidding though.",
            "Google is the new Amazon",
            "[deleted]",
            "If you don’t mind me asking how much previous experience did you have and were they any previous FAANG’s you did? Also was this a new grad role",
            "Hey man what's ur leetcode count E:M:H",
            "Hey dude did you get a role for full time or internship? I am in the process for full time and have questions about some of the steps if you dont mind"
        ]
    },
    {
        "post_id": "ryq49f",
        "author": "nickvader7",
        "title": "It’s absolutely astonishing",
        "url": "https://www.reddit.com/r/csMajors/comments/ryq49f/its_absolutely_astonishing/",
        "score": 440,
        "num_comments": 170,
        "created_utc": 1641612251.0,
        "selftext": "It’s incredible how different my recruiting season has played out compared to what I read on here. Maybe it truly is survivorship bias that I read on here, but I go to a T5 CS school, have had my resume reviewed by other students (with internship experience), actual developers at Microsoft, et al, applied to over 100 places, and have received zero interviews. \n\nEither you guys are rock stars, or I’m a complete idiot. Maybe both.",
        "permalink": "/r/csMajors/comments/ryq49f/its_absolutely_astonishing/",
        "comments": [
            "Definitely survivorship bias. People rarely post about not getting anything.",
            "Neither of your last two sentiments are true. Leave this subreddit OP, it will only bring you down. You *will* find the right job. It took me over a year and a half to do so—it will be worth it in the end. Don’t give up.",
            "[deleted]",
            "Sophomore here at a T5 school as well, have research and previous internship experience, 50+ applications sent out, still have received zero interviews.",
            "My school was tied for first according to US News, needed 374 applications before getting offer.",
            "If it makes you feel any better,\n\nI'm 36, graduated in 2008/09 with dual 3-yr college diplomas in Programming and Networking, and graduated again in 2013 with a Bachelor's of Business Administration and graduated again in 2014 with a Bachelor's of Computer Science.\n\nI first looked for work in 2009, sent thousands of resumes and heard NOTHING back, hence the extra schooling. I have been a developer in the automotive supplier space for the past 8 years, still at my first job out of university. I work for an auto supplier out of necessity because it is the only job I could find. The pay sustains me and my family in low COL area, but it's not great.\n\nWhile I would love to work at a big tech company, I'm not willing to move from Canada to the USA to do so, nor am I willing to move to a Canadian city where small houses cose over a million dollars. This has limited my job search to some degree, though I would take another job at a company where \"the software is the product,\" if I could find one that would hire me. I can't find such a company; my resumes are not responded to, hence why I've been in the same crappy place for 8 years and counting.\n\nI don't hop on this subreddit to look for help, I'm here to help others and to spread the word that it IS possible to get work and live a good life in spite of not receiving any internships. Because there is INTENSE survivorship bias. You see all of the \"which internship should I accept because I got 3 offers at top companies!\" posts, but the rest gets buried.",
            "Post your resume",
            "What year are you in school?",
            "Have you tried on campus recruiting? Referrals? That’s the best way to get your foot in the door and honestly the hardest part is actually getting the interview. \n\nI know quite a few people that are definitely not rockstars that are at FAANG/Big N etc primarily b/c they applied through those channels.",
            "by any chance, do you usually answer \"will need sponsorship\" or \"not authorized to work\" to the questions about work authorization? Whenever I've seen situations like this, sometimes the work authorization is an issue. I think that's the only demographic info that companies can view and subsequently filter candidates on (but I may be totally wrong on this)\n\nAlso, do you only apply to big/well-known companies? Try applying to small, local places. At the very least you will have interviews that you can practice at! If you're an underclassman, even a generic no-name internship is better than nothing. And plenty of people do internships like that, but ofc no one is gonna be on here going \"ya i interned at Big Bobby's Tool Supply over my sophmore summer\"\n\nFinally, have you been writing cover letters for each company? It does take tons of time and effort but it might help especially if you're a competitive applicant. Try having your cover letters reviewed and see if that helps.\n\noh and a very small last thing!! if you've only been applying in the past few weeks, give it some time! The holidays just ended and with the corona going around, HR might be backed up at a lot of companies. you might hear back soon still :)\n\ngood luck, dont let this place get you down. The people doing average will rarely announce and humblebrag about it. The fact that you're being proactive about this means you're already in a pretty good place.",
            "Build your LinkedIn. I've gotten a bunch of interviews from the recruiter finding me on there and reaching out. It's definitely worth investing in your online professional presence.",
            "Thank you for this",
            "This sub is kinda filled with over achievers / wanna be over achievers is what I also felt. You have to take the answers here and think if it works for you.",
            "Omg finally a relatable experience. Go to a T10 CS school, 90+ applications, 2 interviews, past internship/research/projects. this sub def has survivorship bias",
            "Post resume",
            "have you tried applying to local companies ? i know here the local companies interview more and we meet them at our school career fairs. the interview is typically a behavioral and really easy coding challenge",
            "A couple years ago, I applied to >550 places.\n\nLess than 15 of them went to the first-round interview stage.\n\n8 to a second round.\n\n4 to a final round.\n\n3 to an actual final round (one ghosted me and silently removed me from the applicant pool when i asked for a different day of the week because it was finals week and I didn't have a 4-hour block free in my day).\n\n1 offer for an internship *for the next year*.\n\nYou'll find something eventually. But it's a shitty numbers game. For new grad IIRC average is every 40 positions applied to is an additional 2.5% (multiplicative), so you basically cross the 50% chance threshold at 680 applications.\n\nFor internships there's even more competition-- don't give up.\n\nE: >550, not 550",
            "[This is the job hunt.](https://images.app.goo.gl/BR1XH6ykVhMrrpa79) Took me a little over two years to get my first internship",
            "Same, I go to Berkeley which is considered pretty good in CS with a not terrible resume and nothing. Plus the occasional coding challenges I get I bomb still even after algorithms and data structures classes",
            "I’m sure it’s true but this one is hard to believe. Can you post an anonymized resume or something?",
            "[deleted]",
            "OP I think we go to the same school and I’m so sorry that this is happening:( it took me forever too and for a while it felt just the same - like why can’t I get ANYTHING? Take a deep breath and just know that this would work out 🥺 a lot of startups and mid - small size companies are still recruiting, you can do this! And at the end of the day, you just need ONE internship, it really is a numbers game.",
            "Senior here at a bottom tier CS School, have been a dev full time since freshman year",
            "nah man it's hard out here, ive applied to 100s of places and gotten 3 interviews after a lot of struggle",
            "I was in a group chat filled with people who got interviews at meta, everyone for rejected except like one or two. \n\nBut you'll only hear about those 1-2 guys that got the job. So yeah, as people said here: survivorship bias.",
            "I feel you man. I have done over 200 applications and so far I have just got 1 real interview.",
            "Same here. \n\nI go to a small school (no idea what a T5/4/3/2/1 school is), have a great resume, GitHub profile etc. and I have had 0 offers so far. I’m a junior. \n\nSadly, I think it’s much easier if you go to a bigger/more well known school.",
            "I mean I go to a podunk university and half-assedly applied to <100 places and got like 10-12 interviews. My resume isn't that great, just one internship at a no name company and 3 web projects.",
            "This sub is full of trolls and assholes OP. Don’t believe anything you read here",
            "R/resumes or post here to get it reviewed.",
            "Cornell may be top 5 in US news and a good school, but the reality is its name isn't going to help with getting interviews quite as much as HYPSM/CMU/Cal. So you need to have a strong resume to compensate. Still though, you should be able to get interviews almost anywhere with the experience you have, just need to highlight it better in your resume.",
            "T5 CS school = UIUC lmao",
            "[deleted]",
            "Are you a junior?",
            "Are you a sophomore?",
            "Post resume. I get a lot of interviews but I’ve been messing up my technical interviews and trying to improve that. Dm it to me if you don’t feel comfortable posting it.",
            "It maybe because you don’t have keywords in your resume matching job descriptions, and try cold emailing and LinkedIn connecting or referrals",
            "Try running your resume through a ATS parser. Maybe the information isn’t translating correctly.",
            "When you guys say T5 school, do you mean T5 in USA or worldwide?",
            "So glad you posted OP, I’m feeling so discouraged/burnt-out right now waiting/applying and I just hate this feeling of uncertainty :( I’m so glad i’m not alone though !!",
            "Building your connections by uploading your resume and reaching out to recruiters and professionals in the field will improve your luck by 90%. Tech isn’t different from any other field. Companies like hiring and helping people they know and like. Your school, experiences, skill level 8 times out of 10 mean nothing if you don’t know someone who can get you in the door. I suggest attend your school’s career fairs and put yourself out there more! Good luck you still have time.",
            "Timing matters a ton. I had a poor resume but was able to get interviews because I applied early.",
            "Maybe you should hog some referrals?",
            " Bro folks in here only post about their positive experiences",
            "[removed]",
            "What school tho if you don’t mind sharing",
            "It is survivorship bias \n\nI only became active on Reddit and other forums after I got my job, started posting and engaging on SM platforms like crazy, ended up feeling toxic deleting those accounts and creating new ones. \n\n\nPoint is it took me 4 months to get my first job(Feb 2021) and before that I was just lurking around reading everyone’s experiences, understanding and preparing for the game. \n\n\nAnd it wasn’t too good only reading about ‘success’ stories but you don’t really have time or the strength to share stuff when you’re struggling (IMO) but you’d very much like to share the challenges you faced, etc when you’re ahead of them bc it feels ‘nice’ to look back at that time.",
            "How soon did you start applying?",
            "What’s T5 CS school? I’m still confused",
            "and you are not willing to move for jobs, it’s the key. Lots of great jobs in big metropolitan cities, but not rural areas, that’s the same principle anywhere in most of the world today",
            "out of the 100 apps how many OAs did you get?",
            "Now when you say zero interviews, do you mean at interviews scoped to top companies? There's no way you couldn't at least get your foot the door for an interview *somewhere*",
            "Have you not received any HackerRank challenges either? Also is your resume made on word/google docs? Maybe your resume isn't being parsed properly.",
            "[deleted]",
            "Everyone I know at FAANG had a referral. Honestly super happy for them though partly because I now have referrals too for the future.\n\nEdit: realized I sorted by week and not month. Didn’t realize this post was almost a month old"
        ]
    }
]