[
    {
        "post_id": "1b5llg1",
        "author": "thepragprog",
        "title": "Unpopular opinion: You don’t need passion for CS to make money and get jobs",
        "url": "https://www.reddit.com/r/csMajors/comments/1b5llg1/unpopular_opinion_you_dont_need_passion_for_cs_to/",
        "score": 437,
        "num_comments": 130,
        "created_utc": 1709484345.0,
        "selftext": "It’s all about drive, competitiveness, and desire for a better life. U don’t even have to be passionate about CS specifically to get a high paying job. U could be passionate about a project ur building, design, money, or many other things that eventually lead u to become a good engineer. ",
        "permalink": "/r/csMajors/comments/1b5llg1/unpopular_opinion_you_dont_need_passion_for_cs_to/",
        "comments": [
            "I always felt like passion is just a gatekeeping buzzword or an excuse to overwork employees. \n\nI remember an engineering manager at a reputable company in my country gloating about how he expects juniors to be passionate and occupied with work and CS related stuff for 16 hours a day to have a future in the industry. I don’t even think I consistently pulled half of that yet I am doing much better than that clown or the employees in his company would ever do.",
            "Didn’t care much for programming and despised math. Dropped from CS to a Computer Information Systems degree. Ended up working at a multitude of FAANG companies in SWE/PM roles. Eventually left tech and moved on to something else. \n\nWill agree 100% with the OP. Even though I didn’t have a passion for coding, I put in the work and then took a lot of pride in being good at it. I think that many people try to become passionate about something too early on in the process.\n\nIf you’ve never coded before, how are you supposed to have a passion for it?\n\nI think a better thing to be passionate about is your own improvement in all aspects of your life. \n\nI wasn’t passionate about cooking, until I became great at cooking and got to cook myself a ton of tasty meals. I wasn’t passionate about fitness, until I became fit and saw all the benefits that come along with it. I wasn’t passionate about gaming, until I found out that I’m a pretty badass tank in WoW. \n\nEven in the professional world, I’m not PASSIONATE about my job. But I do love the things that I can get from being great at my job. \n\nI have an awesome salary. Work with awesome people. Get to travel. Get to buy the toys I want and indulge in the hobbies I care about. I’m on track to retiring before I am 50. \n\nThe list goes on and on. \n\nSo find what you are good at and develop those strengths. Eventually, you’ll take pride in those skills and might even spark a bit of passion.",
            "True but you also need to either enjoy some of the work or have insane mental fortitude. The whole “passion for the job” is such bs. I don’t think Lawyers who sign up are all passionate about law; they just doing it because it’s a lucrative career",
            "You don’t need passion but you do need at least an inkling of genuine interest in the field to not be miserable, which already discounts a majority of the general population.",
            "[deleted]",
            "I was told to have a passion in my work when I scooped ice cream, that word has no meaning for me now.\n\nI work for money, you hired me to make more money. If either side of the balance goes off we split ways simple as that. Passion only works when you work for nothing in hopes for some positive net outcome.",
            "99% of people aren’t passionate about their jobs and it’s been that way for almost all of human history. Most people in the world don’t have the privilege to pursue things they love as a career, or aren’t lucky enough to have the thing they love pay well.",
            "The idea that you need to love your job and devote yourself to it 24/7 otherwise you are worthless and absolutely unhappy was made by white corporate men trying to enslave the working class.",
            "If you asked senior engineers if they have a passion for cs 7/10 of them will say no. Given that the managers & bosses aren't around.",
            "I think just liking bits and pieces here and there make the difference between someone who studies hard and hates it, and someone who does the same but likes a little bit, no job is something someone will enjoy wholeheartedly.",
            "Copying my last comment:\n\nJust depends on their discipline. People on this sub jerk off to “passion” but the reality is doing it for the money is completely fine. If everyone followed their passions they’d be broke and depressed.\n\nI as well as most of my friends are doing it for the money and so far everyone’s perfectly fine and doing better than most. Some already graduated and have jobs within top F100 companies, others have internships at amazing companies (FAANG, faang adjacent, etc).\n\nI settled for less as of now, still top F100 (30 ish) but will prob pursue FAANG at some point just for fun. And I’m doing it mostly for the money. It’s not for everyone though.",
            "Being passionate and working hard is the best combo 🏆\n\nHonestly in any field there are definitely a few strong people who get by on paying the bills and being competitive. However are they happy? Probably not.\n\nIf they took the same hard work and passion towards something they love they not only would be happier but also would probably accomplish more.\n\nThose are my personal thoughts, I am now thinking about life after graduation. Yes it would be nice to buy a house, car, and vacations. But after that… what’s next? This is something I’m still searching for but likely happiness and relationships",
            "That’s where burn out comes in. I knew a guy first semester back in the fall get kicked out cause he failed. He said “oh I’m interested in computers” but he didn’t have a niche. Having a general interest is fine, but employers want someone who knows their shit, and is passionate.\n\nI wish this whole “leet code” and “applying to 500 jobs” bullshit would stop. People aren’t getting hired because they don’t have expertise and background. If you put on an application “fluent in x language” and don’t know like the logic behind it, no one’s gonna hire. Plus a degree is helpful.",
            "Counterpoint: How are you going to be successful in a highly competitive field when your competition has passion and you don't? How are you going to stand out?",
            "Bro missed the perfect opportunity to recite Dwayne Johnsons song in that first sentence",
            "this is simply the uncomfortable truth. totally agree",
            "How is this an unpopular opinion? I have met 100 just a job engineers for every 1 who is truly passionate about doing the thing. There is a lot of work that needs doing that frankly isn't suitable for a passionate engineer.\n\nThat said, there are no rockstars without passion in my experience. Every truly great engineer I have met, without exception, is absolutely driven to make the best possible thing.",
            "[deleted]",
            "Maybe in the pre-2020 job market.",
            "You just need to complete your assigned tasks at work",
            "You don't need passion for anything, just to the work. Passion just makes it so you are less likely to hate it.",
            "This post is exactly why the field of CS is oversaturated at the moment.",
            "I think passion is something you develop, not something you're born with.\n\nI initially went into CS because it seemed somewhat interesting and because it paid well. I was always a competitive student, so I tried in my classes and got good internships a job, but I never really went out of my way to learn about the field, do projects, etc.\n\nI started putting in a lot more effort when I started working fulltime - partially because I felt I was really raw and was \"underperforming my level of talent\" (if that makes sense), partially because some of my coworkers were incredible, and largely because I wanted to get promoted quickly (both because of money and because I'm competitive.)\n\nNow I still put in a lot of effort, and while the money/promos is definitely part of it, I've come to realize I enjoy being good at what I do, at building things that aren't complete shit, and at solving somewhat interesting problems. I would've never considered myself passionate about CS, but I guess what I just described is passion.",
            "I would go even further and say the people who are extremely passionate about CS are less successful than those who just want a high paying job. The people who are incredibly passionate about CS to the point were they hyper fixate on it often times go for a PhD and often make less money over the lifespan of their career compared to someone who is motivated by money instead of passion for an academic discipline.",
            "Great",
            "You don't need passion for anything to make money.  You only need talent and drive.",
            "Isn’t this true for like anything in life",
            "Based on",
            "I don't think anyone in this job market is passionate for their jobs. Corporate life sucks no matter what you do. But everybody tries their best for their home and their family. \n\nYou may be passionate about your projects and learning new stuff but corporate life is always a hassle and will be no matter the job you do. Only the bosses like it.",
            "But who's going to get the job? The person with passion and they show that through extracurriculars like clubs or personal projects. They also most likely have a good GPA and have the skills to be a programmer.\n\nOr the person who lacks interests in CS and is only going for the money with no projects to show and a bad GPA? Plus, mediocre skills.",
            "That is actually the popular opinion.\n\nHence why the field is getting flooded and will end up with less money and jobs until only those with passion will want to join.\n\nThe warning experienced people are trying to give is that pain is ahead for Devs joining who don't love it as the requirements to constantly learn and grind will burn you out harder and faster.\n\nBut hey most people won't listen to this and will complain in 5 - 10 years.",
            "True but are you happy?",
            "You need to be at least competent at what you do.  In the end you will be competing against some people who are both passionate and competent.  If you are the boss, who are you going to keep ?",
            "Someone is speaking facts lol",
            "If you’re anything like me, you would go insane working in a career you wasn’t at least very interested in. I can’t focus at all on anything I’m not interested in either - I’ve literally fallen asleep at my desk trying to do just that.\n\nI get it that some people can apply themselves to anything they put their mind to, and I envy them, I really do, but is that what the average person is like?",
            "> U could be passionate about a project ur building, design, money, or many other things that eventually lead u to become a good engineer.\n\n2 out of  3 things you specified sound like something that would be part of your job... that you enjoy. So mentioning it seems counter to your point.\n\n&nbsp;\n\nThe third, i.e. money, tends to produce work that is the bare minimum in quality if not accompanied with *some* degree of interest. Granted not every piece of sw in every sector needs to be 10/10 high-quality but then again those are not the areas that challenge you and make you a good engineer either. They just accept whatever passable work you produce- sometimes even subpar work, since those in charge sometimes lack experience in SW to know when work is subpar.\n\n&nbsp;\n\nPoint is- pay-scale is still coupled to quality of work and quality of work is still coupled to interest in said work. There's some space to be paid ok-ish and do mediocre work in this field, but can we please stop trying to fully decouple the notion of quality from the notion of interest/enjoyment? It's just not true, not for SWE, not for anything. That's just dissident from how humans work.",
            "lol, good luck with that. You’ll burn out so god damn fast",
            "Thats what passion is lmao",
            "But at least you have to be talented or you can't even do the job. And if you are talented, you will probably enjoy it anyways.",
            "The game industry is a great case study of how workers get exploited for their passion.  It’s also a technology field with high margins, but it’s one of the lower paying dev roles because it’s easy to swap you out with another game dev who’s willing to crunch to work on his favourite game.",
            "If you lack the passion then in the long run you could lack the drive to keep on pushing, which means you then also lack the competitiveness.\n\nThat's why people say you \"need passion\".",
            "Most people don't expect someone to code all day every day but it's really easy to tell, and it happens pretty often, that you can tell who just do X/Y projects to get X/Y jobs is just a worse engineer than someone who is interested and specialize in something they spend the time, effort, and interest in. Certainly not pointing at Web Development.",
            "There definitely needs to be at least some extent of interest in learning the skills needed outside of class in order to get jobs and internships, having the drive to seek out opportunities and research on campus. A lot of people lack that drive and determination to do so or can’t bother to Google search these things. \n\nThere’s someone at my school (T500) who took on TA roles, asked for research with a professor who accepted, and taught AI in outreach programs to kids and now he’s working at NVIDIA. Don’t gotta go to a high ranking school just gotta ask and be proactive in pursuing experience and skills.",
            "CS is a long game that’s in constant flux. You can’t beat someone who is passionate about their work over the long haul.",
            "To put it simple, it’s just hard work and a lot of dedication.",
            "Yeah but having a passion for CS is better and will lead to a better work-life balance in your life. People who are going after the money tend to be miserable in the field and switch to something else. Not everything about life is making good money. Passion is what makes someone motivated to do well in something. If your passion is to chase a high paying salary then you're just selling your soul to the devil.",
            " \n\nPassion to me is just someone who likes their job, and shows pride in their work.  Not the one who sleeps under the desk or responds to a slack over the weekend.  Those are done out of fear or not knowing better.",
            "I feel like more than that you need to have a tolerance for challenge, and in some ways, be thrilled by it. I am in cs/data science because I love how much I get to use my brain and how you can never know enough. It’s fun. If you are not passionate about problem solving, you will burn out.",
            "I feel like people say you should be passionate because being passionate about CS means you naturally have more drive. If you don’t have that “passion” it’s obviously possible but just more difficult and less enjoyable",
            "Raindrops are technically purple in color, but appear to be transparent due to the diffraction of light.",
            "Never follow passion, follow opportunity.",
            "I understand, but you need a little passion to be in this field. Especially in this market. If you don’t self learn/create any meaningful projects to showcase, why would someone hire you compared to the 999+ other candidates.",
            "Passion is tricky but let me tell you from personal experience if you work at a well paying company in a position you don’t enjoy at some point money is really not that important. For 4 years I worked as Area Manager and let me tell you I hated this side of business every day but hey it was great pay. Now all I want is to focus on working in projects that make me happy",
            "Nope, you just need a job",
            "I think it’s grit but passion for something sure makes it easier. Grit is also a book by Angela Duckworth I highly recommend on this topic. To have grit to me means you never ever stop, but at the same time you are not arrogant or ignorant to not bend. Sometimes after the 25th fail, it calls for a perspective shift, it doesn’t mean give up. Read the book."
        ]
    },
    {
        "post_id": "191cczj",
        "author": "Low_Technician_4442",
        "title": "Suicidal and Depressed",
        "url": "https://www.reddit.com/r/csMajors/comments/191cczj/suicidal_and_depressed/",
        "score": 437,
        "num_comments": 177,
        "created_utc": 1704687761.0,
        "selftext": "Grad student here (international)\n\nGave interviews at 14+ companies for internships (including Netflix, NVIDIA, Moderna + some startups)\n\nAced them all, but as it turns out no luck at all\n\nRecruiters always happy, they always say you are the best candidate we have talked to and we think you fit good in the team. But next week its a reject.\n\nAll my friends got internships, hell some got FT and I am here applying with a heavy loan on head. Been taking therapy and going to mental counselling sessions but its not helping.\n\nNow I’m looking for any job possible, even if its a desk job, I just need money to live.\n\nIs it worth doing masters and should I just leave the country?\n\nShould I just quit and hide under my blanket?\n\nI don’t know what to do\n\nHelp me out guys!!!",
        "permalink": "/r/csMajors/comments/191cczj/suicidal_and_depressed/",
        "comments": [
            "14 interviews is crazy. I'm in the same boat and I got one interview for full time 😭",
            "You guys getting interviews? 14 of them?",
            "I faced same stuff in 5 interviews recently. \n\nThe first one with Apple didn't go well. \n\nIn the second interview for a Machine Learning Engineer position at a university, I'm the second choice pending the first candidate's decision. \n\nThe third interview had a coding error – I accidentally used \">\" instead of \"<\", causing a runtime error. It’s on a text editor, like 0 help. It just stated Runtime Error. I was using Python as the interviewer requested. My main languages are Swift & Java. \n\nThe fourth and fifth interviews went smoothly, and despite my meticulous self-critique, I didn't identify any significant errors. Unfortunately, I didn't secure either position, one being an 8-round interview at a FAANG company and the other a 2-round interview at another FAANG.\n\n\nI’m an international as well. Currently working as volunteer at the University to stop my OPT clock. Working 20 hours a week for free from past 6 months. It sucks. I’m currently working on a good side project, which I believe has the potential to get some traction. Hopefully, it should work.",
            "[deleted]",
            "Honestly, you getting so many interviews is a really good sign that you are a strongly desirable candidate and you’re hitting all the right marks to get noticed by recruiters. Like many people here are saying, it’s a remarkably terrible market right now. I just went thru 6 good interviews with a great referral, got told to expect the offer in the next email, then got rejected without explanation (later found out it was bc unexpected layoffs)—truly, the market is affecting things A LOT. Also, the field is always more competitive for international students in US markets bc more limited sponsorship spots, so props to you for standing out so much! \n\nIf you can, I think sticking out your Masters is for the best bc a completed degree is worth a lot more than half a degree and it also gives you time to keep applying to internships/jobs and hopefully for the market to recover. \n\nAlso, you may already be doing this, but you might need to lower expectations for which company you work for and compensation. It sounds like you’re heavily targeting the tech companies, but the advice I’m hearing is to go after the tech jobs at non-tech companies (food companies, airlines, etc) bc there’s a rising need for those jobs and they’re generally don’t get as many applicants as the tech companies/startups. You can always switch later, but the mindset I’m hearing about from even established engineers is to hunker down with whatever you’ve got until the market is better and then you can grow your career. Like it’s gonna be damage reduction for a few years, then you can focus on growth.\n\nI’m sorry you’re having such a tough time. From the amount of interviews you’ve gotten, it sounds like you’re a good, talented candidate. I wish you luck with your job search!",
            "It’s not you. It’s a very shitty market.   Take something for now and move to something better when the market improves. You got this",
            "https://preview.redd.it/2nnl3n0mw6bc1.jpeg?width=650&format=pjpg&auto=webp&s=df9fd803e288062fba9e29d3fc3fb8d1033ccdba",
            "I can understand. When things that affect your livelihood go wrong it takes a big toll on you. I’ll let other people in the comments give mental and career advice, but I can offer this: be happy with what you have or what’s available to you. As much as Reddit and the economy will tell you otherwise, having a low income for a couple years while you figure things out does not mean life will be pure misery. I was very broke in my young years and consider those the best years of my life. I don’t know if this will help, but just know life is not misery if your salary is not what you want.",
            "Getting 14 interviews is crazy in the current market. I don't have any advice but I hope everything goes well for you!",
            "14 interviews and 0 internship sounds likr you didn‘t aced them wtf you told them buddy 😂",
            "It'll get better. \n\nYou got 14 interviews, which is a lot more than what most get. Instead of thinking you were perfect in the interviews, look back on them without bias, figure out your shortcomings.\n\n I mean no disrespect but without external issues (visa/employment/grad-date/headcount filled before interview review\"), if you had a \"Aced\" an interview, you'd have the position.\n\nThink about your interviews, think about your behavior, your technical answers, your explanations, think about every part of the interview individually, and work on them. Ask your friends to mock you, practice talking to yourself in the mirror, whatever it takes. \n\n  \nAnd if you can't get a position by the end of it all, don't get depressed as long as you gave it your all. Look for other roles at your university, you can work on campus or beg your professors for research positions, work on your own projects.\n\n  \nYou can't control the job market or the economy, but you can control who you are. Build up yourself as best as you can, and I promise you it will get better. Higher education is an investment, and as another international student, I bet that once you start your first full time position, you and your family's quality of life will become significantly better than what it would have been.\n\n  \nKeep that in mind, and keep going. Best of luck.",
            "Honestly, internationals get it harder bc (1) visa and (2) perceived high-conversion rate <most internationals probably will not have a long tern plan in XXX country and will most likely go back to their home country after making some bucks >  just my opinion tho. Hope this helps you NOT INTERNALISED the trauma. If it helps,  some non-target, 2:2 degree in english, HR bozo is looking at your CV, so their judgement is eh.",
            "Bro we are not even getting one call here, they must be seeing something in you,keep applying one day you will crack it",
            "Hey I would suggest not tying your life and purpose to getting a job you want. While I know we need money to survive, I don’t think it’s healthy when you are feeling this way because of rejection. Which we all face rejection and it doesn’t hurts. I would suggest you ask for feedback on why they rejected you. If your technical rounds were good i would suggest you look into the behavior round of the interview. Most companies will almost guarantee reject you if you don’t pass that that round because the behavior round is test to see if you will fit into the team. Which is important to. Me personally I was rejected 2 times because they simply didn’t think I would fit into the team. I passed the technical round and a system design round and they ultimately felt I wasn’t a good fit.",
            "i graduated last year, applied for over 1000 jobs got 20 interviews and got 0 offers. I with either leave the country or hide under your blanket. Cause i ended up with depression that i wasnt good enough and then ended up getting a basic job not even in CS to survive. I currently wish you the best and hope your life works out cause mine didnt.",
            "Can you share your location? Just asking cause you should try local companies too (small companies who sponsor H1B)\n\nTry Mathworks EDG role if you haven’t already.  Few others are- American Airlines, Blackrock, TikTok is hiring a lot in Seattle, mind tree, slack, meta, Zillow, Amdocs, etc. \n\nDownload Blind app and ask people for referrals. \n\nGetting interviews is not the goal so IMO don’t waste opportunities if you’re not prepared. It’s only going to demotivate you. Don’t rush. Prepare well and then give the interview.\n\nGetting 14 interviews is a lot!! That means you are not well prepared, you should be able to secure a job after 5/6 interviews max. \n\nThat being said, worst case scenario try consultancies. (But a good one, some are black listed)",
            "“Aced them all.”\n\n“You’re the best candidate we’ve talked to.”\n\nClearly you didn’t and you aren’t. \n\nIt’s just life, I’m afraid. Your first taster of the real world. \n\nEach of these companies have 1000s of applications every year and common sense tells you that your odds of getting a job at one of them is very slim, even before you factor in stuff that isn’t in your control (nepotism, luck, looks + personality, nasty or disinterested interviewer, etc etc). These things all matter, sadly. You’re also in a very saturated jobs market, and CS seems to be the flavour of the month when it comes to degree choices. Look for jobs at smaller firms and transition to a bigger one at a later date. Failing that, take a job doing anything (doesn’t have to be CS related) and apply again next year.",
            "I’m sorry to hear this. The market has been god awful this year and even the best candidates have been struggling because of lack of job opportunities.\n\nLook into working at your school, in research, it department or teaching assistant that is paid.",
            "Brother I have given barely 2-3 interviews, and still no job. Be thankful and move on.",
            "Welcome to adult life, don’t be to hard on yourself and keep going to therapy. \nWe are in the same boat brother, you are not alone",
            "Stop it. 1000+ apps. only made it to one final interview. No internship or full time yet. It gets harder. All rejections. Im numb",
            "It's definitely not your fault. The market is bad.\n\nI have seen people still struggling to get just any job after graduating. \nYou seem in a better condition as you know your shit. It won't be long till you get the fruits of your efforts. \n\nMore power to your warrior!",
            "everyone is giving you encouragement and i agree with all that, but please maybe also see a therapist if you can!",
            "I mean it’s so hard to say without knowing the interview sessions. If you want I could give you a 10 min mock interview and give you feedback.",
            "Hey I don’t know if its going to help but let me tell you my story\nI was supposed to be graduating in December 21 but I extended my semester because of shitty market and got a job in January but couldn’t join as I didn’t have EAD\nThen searched for next semester nothing then asked the same company that gave me offer before they said okay we can consider you but I didn’t get my opt on time and company took the offer back and yes I paid for express after that I went to all possible conferences but didn’t get any lead already 4 months into my opt \nSo you can do your karma and apply and study market is lot better when compared to last year\nAnd this country or job is not more than your life\nComing back to your loan, you will pay it trust me\nIt might take more time but you will pay it out and NOTHING IS IMPORTANT than your damn LIFE\nSo stop being a bitch",
            "14 interviews isn’t something to get down about dude, you’re clearly extremely talented if you’re getting interviews and acing them, it’s a matter of time before you find something I’m sure of it. It might feel like you’re truly unhirable, but trust me if you’re even getting interviews (and being told you’re doing well) then you’re doing something right! Just a matter of time before you get lucky and find the right fit or if it finds you.\n\nIt could be a lot worse, hell I’m 26 about to graduate and I couldnt even get an internship and I’m struggling to even land interviews as I’m starting to apply to ft jobs. \n\nI hate being this guy too but try and take this in the best way possible. I know it sucks to pour your heart out in a post and tell us all about what you’re going through and to have some rando come in and tell you well hey I have it worse; it feels really cheap. But you kinda gotta look things differently if you’re gonna land a job let alone thrive in a workplace for your own well being. \n\nJust like there are some that have it much better than you, there’s alot (sometimes even more people) that have it alot worse off. Don’t let your mind trick you into feeling this way. Try and take a step back, assess your situation. You’re doing well in interviews, awesome; keep doing that! Maybe something isn’t landing in terms of your soft skills, maybe that could use some work. Maybe you’re putting too much stock into the extremely coveted jobs and you’re not a good fit for some reasons outside of your control. \n\nPoint being it’s never as bad as you think, from the little knowledge I’ve gathered from your post you seem to have really good technical skills if you’re landing and excelling at interviews, but maybe your soft skills are lacking, or you’re not networking enough. I know that parts stressful and feels like a dead end, but it’s how the idiots you went to school with land jobs, so try and put yourself out there in whatever capacity, whether that be connecting with people from your uni, or communities online. \n\nEither way man just keep your head up, you’re doing something right. try and control what’s in the box you live in before you go outside of that box!",
            "Go on pramp or interviewing.io and pay for the expert interview and get the feedback from that person if you're really doing well in the interview. 0/14 indicates some problem. You should expect to convert 1/5 interviews. \n\nThere's also mentoring-club.com which you might try first. \n\nAlso, it seems silly to do sponsorship for visa at bachelor's level. At least with a master's you can say your skills are more specialized. Even then I don't think it's genuine need but rather the employer taking advantage of your status to keep you at entry pay longer and in your lower role longer. So in light of this exploitation to simply avoid more expensive domestic candidates, I'd think visa sponsorship is best reserved for PhD, as in people with truly rare skills.",
            "I know the feeling bro. I really think you should try open source contributions. Plenty of programs and opportunities. I myself got an internship during contirbuting to Open Source. Applying is not working anymore",
            "I don’t mean to invalidate your feelings, but you are kicking ass my man. Just stay diligent and keep your head up. If you’re getting that many interviews with that those kind of companies, you are surely a strong candidate overall.\n\nI’ve been where you are, getting to the point of desperation. My company would probably hire you, but it pays 60k a year starting and you’d have to move to Mississippi.\n\nTbf though, 60k in MS is equivalent to 120k in the Bay Area, so it’s not a bad wage. A lot of people just don’t want to move to MS.",
            "Don’t fret/worry too much. \n\nI’m a dev with nearly 20 yoe and I’ve been through the interview grind a couple of times.  I also have interviewed potential new hires several times, so I know what it’s like on both sides.  \n\nThe last time I was job searching, about 7-8 years ago, the market wasn’t as bad as it is now.  But I was interviewing with over 10 yoe and it still took me several months to land something, and I had about the same number of interviews as you 14-20.  I even got flown out a few times.\n\nAnyway, my point is that, getting on offer is very subjective.   You can have all of the skills and knowledge, and be a great fit, and still not get an offer.  This is because the hiring manager will likely narrow down the candidates to about 3-5 candidates per position.  And they only get so many hiring tickets (or positions to fill).   And they may get 3-5 perfect candidates and can only pick one.  At that point …. It’s just up to them “clicking” with you.  And there is little you can do to make them more likely to choose you.  I find it’s kind of like speed dating.  Sometimes for whatever reason, a particular person just clicks with them. So don’t take it too personally.  Because what clicks with one hiring manager may not make you clock with another.  There really is no way to know what clicks for them. \n\nJust keep up with the applications and don’t fret about passes too much.  If you’re getting feedback that you’re a good fit, you have valuable and desirable skills.  You’ll get a hit eventually.  It suck’s but ya got to just keep going.",
            "+700aplication, around 10 OA, 1 phone call. You’re special if you got 14 interviews. Your are in better position than 90% people here, put your shit tougher and keep grinding",
            "My two cents: If you still like the subject matter and have the option, keep at the masters while looking for a good job and interviewing occasionally. If you get an offer you can hit pause on the masters. Work on mental health during this period as well with daily exercise and sunshine, social hobbies and if possible a romantic relationship (perhaps someone you meet via the social hobbies), maybe even some therapy. Things will get much, much better for you. TIME is the only non-renewable resource, and you are young, so it's on your side. Keep swimming.",
            "Are you only willing to work in flashy tech companies and startups???",
            " “End it”, \n\nThat’s what most people say.\n\nMost people on this sub will only share their story on how it’s worse. It’s even worse if you are international and Indian cuz they don’t really care. Indian be hating on Indian here.",
            "14+ interview that's a positive sign brov, keep applying.",
            "you’ll be alright 14 interviews is no joke tho",
            "you were in the same boat 2 years ago lmao  \n\n[Lost. Darkness. Alone. Failure. Sad. : gradadmissions (reddit.com)](https://www.reddit.com/r/gradadmissions/comments/txt04d/lost_darkness_alone_failure_sad/)  \n\nif your title is serious then get a therapist don't post on r/csmajors.   \n\nthere is literally nothing wrong with going back to your country. (unless you're Palestinian like me, then in that case, I know someone who can sponsor you)",
            "I’d say work on your communication skills. Adapt more to the environment you’re in since you are international and try showing your leadership traits. Also let loose and show that you’d be a nice person to have around the work place besides your coding skills. This is the only thing I could think of since your coding skills are well developed. Hope this helps. Worse thing you can do is quit. Never ever quit. You’ve got this!!",
            "How on this planet you got 14 interviews? I would just die for 1",
            "[removed]",
            "I just asked reddit to reach out to you. Thank me later.",
            "[deleted]",
            "How can you be depressed when you got 4 interviews? I am an international graduate student. I didn’t give any interviews. I should be suicidal and depressed. You will crack the next one. Stop thinking and go study!",
            "How did you fail all 14 interviews?",
            "Recruiters probably look at your reddit and see this as the title. Who would want to hire someone with mental heakth issues from the get go?",
            "That's crazy that you got all the interviews at top tech companies and feel like you did well, but the results aren't positive. Keep going! I think you will land something fire because those interviews are really hard to get, and you must be good. But I'm just wondering, if you aced all of them, what should be the reason that you get rejected? Do the recruiters just have someone better/faster at solving things?",
            "14 interviews is great dont place your life worth on getting a job. That being said try to apply to companies that are not top tier you can easily get a great job at a f1000 or f500 even though they are not FANG.",
            "Scam people dude.",
            ">(international)\n\nTry Canada or London offices. You can relocate back to the US after a year or two. You'll have much better luck there.",
            "Yes. Go back to your country",
            "Edit Added: \n\n\"Interns are being paid by me as well.\nI do not have to do my business as per your expectations and tell you that I have the necessary funds.\n\nGo tell the moderators of For Hire section to change that to your terms.\nThe For Hire section allows unpaid internships. So obviously those who think they are entitled for a pay will abuse me here. The \"For Hire\" Section of Reddit allows unpaid internships.\"\n\n-------\nX\n-------\n\n\n\n\nWe are hiring: a) Website designers and developers. b) Appointment Setters. c) Sales Closers. d) Bloggers. e) Copywriters. f) Business Development Associates. g) Email Marketers.\n\nUnless you demonstrate results, first 2 months is unpaid internship. Learning curve will be very steep and very deep and world class depending on how you are collaborating with your communication, commitment, and compromise. I am hiring interns for my agency. Salary is paid to the right candidate from the start. For all other candidates, Salary is paid after demonstrating you can do money tasks very well and not only repeatedly always repeat tasks. DM me for your internship. I have a whatsapp channel and I am starting all interns on the internships with training provided on the job right from scratch.\n\nI am sorry to see you be here. I think you are an ideal fit for something. Would you like a business development role or an appointment setter role along with a partial digital marketing role? Unless and until the intern demonstrates results, I am offering internships without any pay because I am not guaranteed returns on my time, money, energy and training investment on the intern. I offer you world class training for the role you choose. While there are no salaries for interns for all roles \"unless you are chosen as someone who can deliver results\", For BD role and Appointment Setter role and Sales Closer role, I pay a good amount of commissions per sale say around $300 Starting per sale.",
            "Hi could I DM you?",
            "Sorry, I can't help much as I'm also struggling at the moment. But I think finding the answer to why you got rejected is important here. You must be missing something.\n\nTry emailing the recruiters asking how could you do better or what skills you have missed. I did this and I figured out the reason I got rejected.\n\nI wish you all the best.",
            "Hey don't get depressed.Keep tryin .it's not ur fault it's just the Market which is shitty",
            "Im a first year, and everything i see if either people more capable than me, ahead of me, which contacts/work experince etc. Ive already given up. There is no way im getting a decent job or internship or whatever. Its just not gonna happen. The industry already in a shitstate from everything you can read, and its only gonna get worse. Gnna enjoy my time at uni, and then just well yep, you seem to understand.",
            "What country are you from habibi?",
            "Canada?",
            "Same here 😞",
            "Can you share your resume before you do anything stupid ?",
            "If you're interested you could work in telecommunications and make outbound calls. Not very interesting but it does earn you a living. You can do that while you keep applying further :)",
            "I don't know you but based on what you said you can do it.",
            "Try lowering that bar and applying at smaller companies where you’ll have a better chance, you might not be as good as you think you are to have 14 interviews and not land 1",
            "Hang in there. Same state, I had only 1 interview for an internship which I bombed and 0 interviews for FT in the US till this point but I am not gonna give up. And you shouldn’t too.",
            "You may not get what you want when you want it exactly. In the meantime, hold a job, any job, including unskilled labor. Too many graduates often think their degree necessarily precludes them from getting their hands dirty in manual or unskilled labor jobs — nothing to “look down” on with a sense of superiority. \n\nJust get a job. Sometimes, you might even find openings even in retail/sales for something Software or Data related posted!",
            "Work any job u can so you can make some money. Hit the gym, start Journaling, meditating, eat right. All of it while you are still applying and interviewing. The job won't fix your mentality. Fix your mentality then you'll get the job. Good luck brother",
            "It’s not you. It’s the market + international. Sorry",
            "Hey at least you’re doing really well in your interviews",
            "nothing much i can do to help sadly. but i want to say i feel you. hope you get something, eventually",
            "Hey OP, I'm really sorry to hear about your troubles. I'd love to hook you up with a free 3-month sub for Simplify+. Shoot me a DM!",
            "Hey OP, maybe i was dumb, but i submitted 217 applications to secure my first internship. Maybe you can feel better about your situation after knowing mine.",
            "i’m sorry you’re going through this. after i graduated (in 2004, only having done freelance work, personal projects, and no internships) i applied to probably 100 jobs. handful of interviews (which i sucked at)\n\ni ended up going to a professional temp agency. got placed as an entry level developer. foot in the door. i’m not sure if that’s an option for you but some places do temp-to-hire and some employers may sponsor (though i don’t know if that’s more difficult to find nowadays)",
            "Well… you ask for startups and big tech companies. Maybe ask for a smaller company?",
            "It’s not the companies it’s you. Honestly you should have at least one offer for every 10 interviews you do. Yes they can lie and say you did good, but if you didn’t get the job it wasn’t good enough. I say just practice interviewing more. Seems like you have an abundance of opportunity that your throwing away because you’re not interviewing good enough.",
            "freelance is always an option, atleast while you try to find a place to work full time",
            "I don't think market will improve in 1-2 years as AI will replace more roles.",
            "if you're getting interviews but not offers is there a chance that maybe your interview skills arent super great? like not to be harsh but you are obviously a desirable candidate. maybe theres somewhere behavioural/technical that you can sharpen up on!. dont give up you are doing so well already :)",
            "Follow these steps\n\n1. Exit Instagram and facebook\n2. Watch this https://youtu.be/a5Z7pZgVfcQ?si=dc0VRW2Nrc4NGc-A\n3. Stop comparing yourself with friends and start asking them for referrals.\n\n4. If you’re already in debt won’t recommend you to go for Masters.\n\n5. Try again and again and again, repeat\n\n6. if you’re feeling low, start watching Sadhguru videos\n\nA human life is not designed for material things such as money which is just a piece of paper. If you’re in debt it’s hard to understand but I am hundred percent sure that you’ll be able to clear your loan and right after that just focus on basic needs for human happiness.\n\nThat is a healthy relationship healthy food, tension free sleep, house large enough to accommodate your family, transport medium which just covers your requirement.\n\nLive life!!!",
            "I want to put out a potentially controversial opinion that you might not have done as well in the interviews as you have thought.\n\nIf they interview you, that means the position is open and they are considering you for it.\n\nHave you asked a senior engineer you trust will give you an honest opinion to mock interview you?",
            "This is truly one of the saddest and most \"computer science\" thing I have stumbled across in a while. Your depressed cuz u can't get hired somewhere as a STUDENT wow brotha welcome to the real world not. OMG knowing what ur talking about isn't enough to get me a job?! Who knew you had to be an actual person😱😱😱 .",
            "Maybe you should reconsider and take a look back at your interviews. Revise the resume, practice with others to see what you're doing wrong. It's crazy to have 14 interviews. Like that's really impressive tbh. I am 21, had 4 interviews and got the 4th one. Also consider job fairs, reaching out to instructors, and friends to hook you up. \n\nDo you have social media that's inappropriate? Maybe you're failing background checks.",
            "Try applying for contract positions like Accenture. Pay is usually higher but contracts are usually 6 months to several years. Get money and experience and taste what the market is hungry for",
            "what country? keep trying man, many are on the same boat, keep your body healthy and something will come",
            "Hit the gym bro. You’ll feel better and look better too"
        ]
    },
    {
        "post_id": "18qkjqc",
        "author": "SimpleIllustrator215",
        "title": "They send this mail after I ace their OA",
        "url": "https://i.redd.it/f16d710ekg8c1.jpeg",
        "score": 438,
        "num_comments": 52,
        "created_utc": 1703517582.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/18qkjqc/they_send_this_mail_after_i_ace_their_oa/",
        "comments": [
            "They should open up a position for email developer.",
            "Note to self 📝✍️: stop naming variables cheeky names like \"fuckFace1\" and \"assHat2\", they could get published to the user by accident",
            "Someone aced it before you.\nOr they took the position off.",
            "It’s automated, and a shitty automation at that {{candidate_name}} lol",
            "Sometimes i wonder who these other applicants are and what they did differently",
            "They HAVE to be hiring HRIS developers LOL",
            "Should just start replying to these responses with \n\nThank you {{companyName}} {{recruiterName}} \nfor the opportunity to apply for {{positionThatImNotRemotelyInterestedIn}}.\n\nI have found employment with {{organizationWithReasonableCompensationPackage}} and am no longer interested in the role of {{data...EOL CR/LF^M\n\nSincerely {{camelCase}}",
            "I'd email them asking to fix their email automations",
            "Recruiter at Meta did me dirty too",
            "well done [u/{{CANDIDATE\\_NAME}/](https://www.reddit.com/user/SimpleIllustrator215/)  , but hopefully you'll be luckier next time!",
            "Well I can’t blame them for trying to automate emails, id do the same",
            "They so didn't care that you aced their OA that they didn't even bother to template the email before sending it. It's like they are saying \"you know what, acing the OA doesn't mean you do well on the job, so foff\". I don't even know what they want anymore 😪",
            "CANDIDATE_NAME I…",
            "I’m not sure you know that many (many) people “ace” OAs. 🙄",
            "I hate aced exams, aced exams are bad, regardless of the side I am on.\n\nIt is the same criteria either way, they tell me that the exam was not difficult enough and an unknown number of people aced it and it makes it almost useless as a metric. \nThink of it as options for YoE as you and your only options are : 0, 1 and above 2.",
            "That doesn't mean anything. It's just something in the email notification pipeline not working to replace the variable name with your name. It's not like there was someone who sent you an email manually. Everything is automatic",
            "The {{candidate_name}} literally proves that it's a automated email. \nIt's not functioning as it should.\nThey didn't check cuz it's supposed to be automated.\nSo better to not lose your brain cells with that stupid ass mail and move on to next company.",
            "same lol",
            "Reminds me of a college rejection letter the way they formatted the last two sentences",
            "On the same boat here op. With a different firm but yeah.",
            "Maybe many other people aced their OA too. So, it came down to other unknown factors as well. Lot of latent variables.",
            "I’m confused.\n\nIs your name not {{CANDIDATE_NAME}}??",
            "Please accept our apologies.  We received tens of thousands of applications for this opening and reviewed each one manually.  We wanted all of the applicants to know their status and had to use an automated system to notify you.  Regrettably, an error occurred within the system, resulting in the omission of your name. We are very sorry for this mistake and are reviewing our candidate communication process to prevent this error from happening in the future. "
        ]
    },
    {
        "post_id": "jsx0iw",
        "author": "RussellFighter",
        "title": "I'm a Leetcode Engineering major",
        "url": "/r/cscareerquestions/comments/jsrmtw/remove_cs_and_replace_with_leetcode_engineering/",
        "score": 439,
        "num_comments": 63,
        "created_utc": 1605196452.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/jsx0iw/im_a_leetcode_engineering_major/",
        "comments": [
            "Bro for real tho, CS programs should add a course with CTCI as the textbook and leetcode for homework lmaoo",
            "Must rename the sub r/LeetcodeMajors",
            "Actually at my school, all our Data Structures and Algorithms DP HW was leetcode mediums and hards",
            "Leetcode alone doesn't get you the job anyways.",
            "[deleted]",
            "> to guarantee entry into a top tech company\n\nI mean, getting to the interview stage of these companies is the hardest part. I *wish* you could get into Google just by practicing leetcode a bunch, but unfortunately you still have to have an impressive-looking resume to be able to land an interview in the first place.",
            "I'm a 'cut and paste from Stack Overflow' major",
            "I don’t think Leetcode questions are all that good for interviews. Perhaps just how you approach solving them. But if you already knew the answer, then it’s not really helpful to know how you would be as a coder.\n\nThat being said, it’s not like I have a better suggestion. The last interview that I had, they asked me how to look at just the top few lines of a file (using the head command was correct and apparently no one else got that right). They also asked me for some differences between Java and C/C++. Were those good questions? They were good for me since I knew the answers and could explain them rather thoroughly but I’m not sure how good that is.\n\nI’m no interviewer but I think that the best thing would be to ask about how someone worked on a personal project because that can tell you a lot more about what someone’s actual coding process is.\n\nWho knows, clearly no one since no one agrees.",
            "Leetcode doesn’t cover anything that isn’t in any standard algorithms class. Idk why people can’t figure it out",
            "Dont even talk about indian elite colleges, 90% of the undregrad is involved in Competitive programming all the time, nothing else.",
            "Leetcode",
            "Finally, I was wondering how long it would be before someone spelled it out.",
            "Starting a religion for DS and algos with the CTCI as part of our core scriptures. Tax breaks and more religious holidays than the competition!",
            "r/shittylifeprotips",
            "This made me laugh",
            "Legit. I hate it",
            "We do have course like this in university.\nIt’s called competitive programming."
        ]
    },
    {
        "post_id": "yrpwzx",
        "author": "Skyler_White",
        "title": "any way i could salvage this? i accidentally insulted my interviewer's wife",
        "url": "https://www.reddit.com/r/csMajors/comments/yrpwzx/any_way_i_could_salvage_this_i_accidentally/",
        "score": 433,
        "num_comments": 65,
        "created_utc": 1668109978.0,
        "selftext": "I was at a restaurant a while back and this woman was sitting next to me. I was by myself (IDGAF about eating by myself because I'm not some normie) and this woman started bragging about how much money she made as a realtor last year. A few minutes later, she put down her phone and started glancing at the menu.\n\nWithout skipping a beat, I decided to pull my phone out and pretended I was having a conversation. I said how I was sitting next to this realtor who didn't know know her job was going to be replaced by an iPhone app within the decade, and how people could by houses from their smartphones pretty soon. Honestly, I hate people who brag about money. It fucking pisses me off. It made me think about the people in California who struggle to buy houses because of the real estate market. She kinda looked over with a puzzled expression on her face. Her husband came back from the restroom and she explained what happened and he confronted me.\n\nWe kinda got into it because I said his wife is more than capable of standing up for herself. He kind of embarassed himself because he was raising his voice while I was stoic and calm. Marcus Aurelius.\n\nThey ended up moving to another part of the restaurant. Before I left, I went to the maitre d and told her I wanted to pay for his wife's food to establish dominance over him. I even told the maitre d to buy her a glass of the most expensive champagne they had. Their total bill was only a fraction of what I made in my summer internship.\n\nAnyways, the next week I had my last rounds of interviews at the Goog. Guess who it was. We went through the interview normally and he gave me the hardest fucking leetcode question. He asked me to program in front of him instead of writing down my solution on the whiteboard and I used the name of the restaurant as one of the temp variables lol. I did it in less than five minutes and provided the optimal solution. I even loudly yawned while doing it. Before I left I said \"I know freshman dropouts from the local community college who had this problem as their first lab assignment in their introductory programming class. Give harder problems unless you want that caliber of programmer to work here.\" His upper lipped twitched.\n\nToday, they told me I didn't get the position. Gee, I wonder why?\n\nI have reason to believe he didn't hire me because of our previous altercation. Can I hire a lawyer for discrimination? When he saw me, he immediately should have gotten another interviewer because he's inherently biased.\n\nAnyways, I'm not to worried about it. I had an internship at another FANG and when I get that I'll be making 150k easily there.",
        "permalink": "/r/csMajors/comments/yrpwzx/any_way_i_could_salvage_this_i_accidentally/",
        "comments": [
            "only this one, no shitty copycats",
            "bro what where's the shitpost tag 😭",
            "You missed the part where the interviewer is incredibly impressed (and aroused) by your intelligence and decides to offer you a job as CEO of Google and decides to leave his wife for you\n\nWouldnt make the story any less realistic",
            "most entertaining story i've read in this subreddit",
            "no way this is real lmao",
            ">He kind of embarassed himself because he was raising his voice while I was stoic and calm. Marcus Aurelius.\n\nBased.",
            "This is google fanfiction",
            "Wtf is happening in 2022 💀",
            "how is most of this comment section getting wooshed holy fuck this sub is priceless sometimes",
            "Creative enough to write quite an entertaining story, stupid enough to not put a shitpost tag. The duality of CS",
            "You got me on “I named a variable after the restaurant”💀",
            "Why are so many people taking this seriously, this shit is funny as fuck",
            "At least you didn’t kill his dog like that [other guy](https://www.reddit.com/r/cscareerquestions/comments/95dgrx/i_am_absolutely_mortified_and_embarrassed_beyond/).",
            "Quality shitpost imo",
            "Top tier shitpost",
            "and then you woke up?",
            "There doesn’t seem to be a legal basis for a lawsuit. The interviewer can’t use things like race, age, etc as a reason to deny you but you can be denied a position if the person just doesn’t like some other aspect about you (ie, your not a good fit). How people behave in public is a factor in my opinion and based on your description of the confrontation, it seems like a legit reason to deny you a job. The fact that you’re considering a lawsuit is further evidence that you would not have been a good fit.",
            "Where did this copy pasta come from?",
            "the Goog",
            "r/thatHappened",
            "Is it sunday?",
            "you totally could have fucked his wife.  should've gone for it",
            "You forget to mention that the interviewer being amazed by your calibre left his wife for you.",
            "this almost reads like one of those 4chan greentexts",
            "i guess the moral is to act more decently in public or towards anyone since you don't know when or how you'll meet them next",
            "How are so many people commenting very seriously about this??",
            "This is the same breed of Reddit post as that one story on the A2C subreddit",
            "this is a BEASTLY shitpost",
            "he bursts out laughing and says it’s pronounced stow-ic, not stoike\n\nbreak down and cry in the street",
            "Post of shit this is",
            "In a few years, during a lonely night, you will think back on how you posted this fan fiction on reddit, and a part of you will cringe.",
            "LOL.",
            "probably happened, look at this guys post history. he sounds pretty autistic",
            "I realized it was faken when you wrote “to establish dominance over him”, but funny story nonetheless",
            "Is your other \"FANG\" Amazon? (Don't worry /u/doubletagged I got you)",
            "Pretty sure this isn’t real. If it is you’re not a very nice person and honestly not surprised you didn’t get the job. People hire people they would want to work with and your type of attitude would be an absolute nightmare.",
            "This is the most r/csMajors thing I’ve ever seen. Man’s disconnected from reality",
            "Uh yeah no that did not happen lol",
            "pov: you read the last sentence, thinking you'll be making 150k in god knows when in this economy, and then you suddenly don't care about what is posted here",
            "[deleted]",
            "r/cscareercirclejerk",
            "You are a fucking King!",
            "Fresh stuff, I like it",
            "Leetcode",
            "Username checks out",
            "Run for president",
            "Fantastic."
        ]
    },
    {
        "post_id": "vv3p8i",
        "author": "Vilified_D",
        "title": "Enjoying internship so much, don't want to return to school",
        "url": "https://www.reddit.com/r/csMajors/comments/vv3p8i/enjoying_internship_so_much_dont_want_to_return/",
        "score": 436,
        "num_comments": 62,
        "created_utc": 1657379286.0,
        "selftext": "I'm enjoying my internship a lot. I'm supposed to graduate this upcoming spring but god I feel like school is so lame in comparison to this. I'm learning stuff all the time, improving my skills, and making some cool stuff. I just feel like whatever I do in school is gonna be so boring compared to what I'm doing now.",
        "permalink": "/r/csMajors/comments/vv3p8i/enjoying_internship_so_much_dont_want_to_return/",
        "comments": [
            "Agreed. Though now I’m gonna dominate the ping pong scene when I go back to school",
            "lol felt the exact same way. Working is so much fun, school is miserable and stressful 💀",
            "Not having a deadline every 11:59 is the biggest plus imo",
            "A lot of times though interns are given more fun and easy projects than FTE. But ya I like working more. I have so much more free time in evenings and on weekends and my life is so much less stressful. College is still really fun though",
            "YUP before i used to be those “ew 9-5 i don’t wanna be a cog in the corporate machine” type of job hating ass mf but now that i’m doing this, this shit is millennials better than miserable ass school. like it’s enjoyable and people respect you and this is a miles jump from retail/food service type jobs i used to work and just is better. like school isn’t the same it’s literally feels like a side quest and i can’t prioritize it anymore, no matter how much i try it feels like the bottom of my list of priorities but nonetheless idk how imma go from working back to uni",
            "same, esp with the office ammenities. School sucks ass",
            "i feel the opposite way.",
            "Try to bring up something about wanting to work part-time if possible. This may or may not work if you're graduating in Spring. \n\nCompany I'm interning at allows it and since I'll be graduating in December it's pretty much a no brainer to do it so that I don't lose out on anything with the team",
            "But you get to see your friends!",
            "What internship is this bc I'm learning nothing n can't wait to go back to school",
            "Yes, same for me! My team has been so nice to me, I love my project, I'm learning a lot and I feel like I'm actually contributing to something in the company. On top of that getting paid is the icing on the cake. Can't wait to graduate next year and return to work if I get a return offer.",
            "This is a mood when I did my first internship last summer 😂😂😂. The 9-5 life is amazing because hey, no exams, no stress, and you get to make money while you’re at it 💰💰💰",
            "I enjoyed post college life better too.  But finish the degree.",
            "Yes, internships are more fun than most of the college classes.",
            "You could always ask to go full time immediately. The company probably needs devs.",
            "How the fuck do people enjoy working more? Y'all really spend 40 hours a week studying for school 💀",
            "Too relatable, just one more year",
            "I feel the same. Might try to do some off-season internships if I can!",
            "Are you borrowing money to pay for school? If so, fuck em. Work experience coding is worth more. College drop outs in CS are pretty commong and its usually not a negative.",
            "Feel the same way! Can’t imagine myself sitting in a classroom environment either zoom or in person again",
            "Work gets really hectic too, a few years down the line. I recently had to start guiding a few new members of the team along with working on my own responsibilities and deliverables.\n\nNot that this is exactly the same as the stress which uni brings, but just wanted to mention that it's not all perfect on the other side either.",
            "Literally just thought the same thing last week",
            "Agree 100%, gonna miss it for sure. Gonna be nice to see friends every day again though",
            "Which company gave you such a positive experience?",
            "i felt the same way, I was thinking of taking a gap semester and working as an intern for the fall. Has anyone done this? Good or bad idea? I’m leaning more towards this but it will be harder for me because I have a lease at college and i have to find housing where I am now. Any advice?",
            "Exactly , same. I don’t wanna go back 😭😭😭"
        ]
    },
    {
        "post_id": "lwra2c",
        "author": "Soooal",
        "title": "Professor in current semester: \"I believe that not using the current technology when learning math makes little sense, so we will learn both Linear Algebra and Discrete Math using Python libraries\"",
        "url": "https://www.reddit.com/r/csMajors/comments/lwra2c/professor_in_current_semester_i_believe_that_not/",
        "score": 439,
        "num_comments": 33,
        "created_utc": 1614769435.0,
        "selftext": "Just something that made me happy, we did both Calc 1 and Calc 2 with pencil and paper and before this year the Linear Algebra and Discrete Math courses were done in the same way as well. Dunno what happens in other unis but unis in my country operate with outdated tools in math classes, so thats very refreshing",
        "permalink": "/r/csMajors/comments/lwra2c/professor_in_current_semester_i_believe_that_not/",
        "comments": [
            "This sounds like a really good idea as long as you aren't using any functionality that takes away from your learning.",
            "Wow numpy for linear algebra would have saved me lots of time on homework",
            "I have mixed feelings about that.  Like it opens a lot of doors to allow you to solve more complex problems faster, and it mimics what you do in the real world.  However, a lot of the value of math is learning that structured, logical thought process that helps you solve problems.  I feel like plugging values into a library robs you of the reasoning through equations.\n\nSince it’s easy to teach yourself math online, I guess it doesn’t really matter as long as you get a general understanding",
            "That's cool. In my linear algebra class we learned it traditional way but we also had a lab. In the lab we used matlab and python. This was back in 2006",
            "That's how my school does LinAlg and Discrete too.",
            "PDE with python! Yay",
            "My teacher in community college taught Discrete Math with Python and it was awesome, I learned so much more than if we had done it with usual pen/paper and standard tests.",
            "At my school Calc 1, 2, 3, and Linear Algebra are done with no calculators allowed :(",
            "So what's a good, free text for this learning plan?",
            "Ahahahha the math courses I had were along side with the math majors, good ol' pen and paper and not a slight hint of computers or programming in the courses. \n\nWish I had had math taught in programming, guess I now know how to solve an integral by hand, yay, super useful.",
            "I love that! It is also a good idea to show cache friendly ways to perform matrix multiplication!",
            "My school didn’t do this for any classes, but I used python to help myself in Abstract Algebra. Writing algorithms for stuff like generating permutations or calculating quotient groups really helps because you see instant feedback on if you’re correct.",
            "I think MATLAB is more *the shit* in terms of computation technology\n\nEdit: I didn’t expect so many people to hate MATLAB :( I thought it does well what it’s meant to do",
            "This is how it is at UC Berkeley for the CS and Stats majors. They have their own linear algebra, diff eq + circuits course that teaches it all exactly like this. \n\nThe stats major also has a unique way where it builds up most of the fundamental stuff using data science rather than strictly calculus. There is ofc still calculus but less focused.",
            "God bless you. Took Calc 1 and legit asked my teacher if I could hand in a function that could solve my homework equations rather than having to do it on paper and make tiny algebra errors.\n\nUnfortunately I asked after handing in my assignment, but he totally said he'd have let me.",
            "That's weird",
            "Would have loved for them to this at my school but would never happen. For my theory of computation course, the professor took this approach and had us make automata and other things using the coding language of our choice and people complained it was too difficult, so he removed the coding aspect of the course.",
            "My university doesn't require linear algebra, but is starting to require a course that does some linear algebra concepts using Python libraries. I'm taking it right now and will say it is really nice to see how these linear algebra concepts integrate with CS and show us that math does do have a place in our CS studies.",
            "We used mat lab in my linear algebra class. Mostly for matrix operations when stuff got more complex and it was more then just knowing how to do basic matrix operations and my professor wanted us to focus on bigger concepts"
        ]
    },
    {
        "post_id": "1avmrlh",
        "author": "Big_Zookeepergame711",
        "title": "I got screening rejection last week but now interview?",
        "url": "https://i.redd.it/vrsqve4dvrjc1.jpeg",
        "score": 437,
        "num_comments": 28,
        "created_utc": 1708448778.0,
        "selftext": "How does this happen!?",
        "permalink": "/r/csMajors/comments/1avmrlh/i_got_screening_rejection_last_week_but_now/",
        "comments": [
            "I wouldn't say shit and just go along with it lol",
            "It has happened with me in last cycle, I got rejected for Amazon (new grad) but after a week recruiter reached out to me. But after my assessment (100% score) I was ghosted. I don’t know if she was playing around or whatever, but later I got to know that the recruiter was laid off and also Amazon did a hiring freeze",
            "Had this happen to me. Failed screening for winter internship, but they gave me an interview a month later for summer and I got the offer",
            "IBM don’t know bruh just do the interview",
            "i imagine they kept your application for future consideration and reached out when another applicant backed out of the interview/job offer. just go for it",
            "Happened to my friend also. He was later accepted after his interview. Something must be wrong with IBM’s hiring system lol.",
            "Maybe it’s a glitch or automated when they sent out the rejection?",
            "Go for it! Only two things that can happen: \n1) You continue to apply for more jobs.\n2) You work at IBM.",
            "Ok one of my previous roles, I never heard back from the company. When I followed up, I got a rejection letter the next day. Then two days later, recruiter calls me and says it was an error and I'm actually the top candidate and gave me an offer. Who knows. 😂",
            "You better accept it, it might be the same position in a different team",
            "My friend had something similar happen to him. Got an email saying he was no longer being considered but then got an email a week or so later asking him to provide references and do the next round of interviews. Told him not to say anything and he ended up getting the job lol",
            "This actually happened to me. I applied to this internship then got a rejection letter after failing the technical. Two weeks after that I got a second interview and I even told the interviewer that I think they made a mistake. Fast forward and I got an offer. Just know that they picked you for a reason and you will never truly know why. Just make the best of it.",
            "That's not too uncommon. I've had many companies reject me only to reach out for an interview within a few weeks. Take the opportunity",
            "Is this a scam? It has the keyword “Kindly” with some grammar errors",
            "Dude its an intern position probably their first choice backed out or accepted another position its pretty normal, you have any idea how many open positions are there in these companies?? its difficult to run the process smoothly...idk if youre just flexing or its just a silly question",
            "it was just the automated system that didn’t pass you and they went thru the resumes manually\n\na lot of the jobs i’ve gotten via referrals never pass the initial software screening (due to lack of keywords in the resume they set to weed out a lot of the candidates that aren’t what they’re looking for) i’ll get that initial automated rejection, then the hiring ppl will send another email scheduling the interviews, or they’ll just call me and schedule something that aligns with everyone’s calendar",
            "location?",
            "IBM is an absolute shitshow. I applied once, got rejected, got sent a coding test any way which I apparently failed because they rejected me again, got an interview anyway, got sent a second copy of the same exact coding test for some reason (which I brought up to the recruiter, and they just responded with confusion in barely intelligible English, and I kept getting reminder emails to take it but I never did), and then made it to the second round interview (both interviews went rly well), got completely ghosted by the company for 6 months until they randomly started spamming me with surveys asking me how my interview experience went (which I obviously have not filled out). Fwiw the two people I interviewed with were nice but I would stay from IBM, judging by their horrible recruitment process…. the company cannot be much better if that’s their standard",
            "kinda random question, how can you be an intern and a manager at the same time"
        ]
    },
    {
        "post_id": "15oaqn9",
        "author": "None",
        "title": "What's with all the extremely negative posts on here lately?",
        "url": "https://www.reddit.com/r/csMajors/comments/15oaqn9/whats_with_all_the_extremely_negative_posts_on/",
        "score": 432,
        "num_comments": 235,
        "created_utc": 1691764842.0,
        "selftext": "God damn it. Every other post is someone ranting about their immense regret of majoring in CS. Did ya'll really think CS is some easy path to a six figure salary? Maybe that was true at some point, but CS like every field requires effort, determination, and pure hard work now. If you hate CS and still chose it for the money, than with all due respect, it's partially your fault. Why choose something you hate just because the money is good?\n\nIs the job market bad right now? Yes, there's no denying that. Will it improve? Most likely. It's so fucking annoying seeing every post talking about regret or the usual \"don't major in CS, CS is dying, AI will take over.\"",
        "permalink": "/r/csMajors/comments/15oaqn9/whats_with_all_the_extremely_negative_posts_on/",
        "comments": [
            "Daily reminder to everyone thinking about entering this field\n\nhttps://preview.redd.it/ydufh7nsbihb1.jpeg?width=1290&format=pjpg&auto=webp&s=5c2f16ec838404dad4ce505b6597eb4040bd9330",
            "The people getting jobs aren’t coming here to tell you.\n\nI assure you, places are hiring and people are being hired. I know quite a few people who just graduated that got jobs. I only have a couple of years of experience and regularly get interview requests from recruiters.  \n\nBut everyone doesn’t get a first job starting at 200k that is fully remote and requires 1 hour of work per week. You may have went to a great school and did everything right but that doesn’t make you special in tech. You may have to settle and continue working toward your dream job. It happens to most.\n\nAlso, a shit ton of the people I am seeing here complaining are not US Citizens and are either here on visa or trying to get in/back into the US. And companies almost always have a preference for hiring citizens over foreigners.",
            "[deleted]",
            "> ya'll really think CS is some easy path to a six figure salary? \n\nThe thing though is that CS is not easy (except for fringe braniacs) and that's why most people just drop it.",
            "Well everyone and his/her mom wants to major in CS.\n\nIt's just normal supply and demand.\n\nImagine tomorrow a good chunk of the next generation worldwide (this isn't even just 1 country but pretty much a global phenomena) decided to major in accounting. And working professionals too tried to switch to accounting.\n\nAs important as accounting is for instance, it doesn't have anywhere near the number of jobs to satisfy that much supply. \n\nIt's just normal supply and demand. I wouldn't be surprised if it takes almost a decade until markets settle. It does take some time for people to become aware of the current job market (and that it might not be as temporary of a phenomena as they would have liked to believe) so the trickling down effect would take some time.\n\nWhile it might get a bit better in the near future than the current state of the market, the longer term trend is clear. There's just more supply of aspiring candidates than the number of entry jobs available. And you are going to be competing globally. I would expect job markets to become even more fierce due to this simply supply vs demand nature.\n\nI don't understand why people are in denial and presume the job market cannot get worse. It's all just supply and demand. With the entire generation and the next told to code, do you really think entry markets wouldn't get more and more saturated than it is today? Seriously, this is like the fools past two years in which I was trying to advise none of this was sustainable but the majority of redditors didn't listen.",
            "Too many people in CS the whole industry needs to be nuked. Hopefully once this all ends we can experience the hayday once again.",
            "Keep ‘em coming 😂 less competition for the rest of us",
            "there is no demand for junior engineers. all of the demand shifted to mid-senior+.\n\nonce you have 2 yoe, interviewing gets much easier.",
            "I am employed, so I'm not here to join the negativity for no reason, but i see a lot of it. I will say I follow several other IT subs and I see a lot of similar stuff. A lot of devs claiming laid off with 5 yoe with 200+ applications and no offer. It's scary stuff, hard work and determination is fine and dandy but people have kids to feed. \n\nIf you get laid off, which can happen to anyone, and then you can't find a job after investing 8+ years of your life into a career, that's something worthy of negativity. If I were 18 I'm not sure if I would choose CS at this point. AI isnt even really in the picture yet, and that's coming in some form or another.",
            "Buncha people who weren’t in the industry in the past and don’t have a ft job now pretending to be experts on the future when they can’t even develop enough common sense to pass interviews for a human sexual partner",
            "I imagine it’s all the people who watched social media of people saying “how I got a 200k tech job with a 3 month boot camp” \n\nThat world is long gone and I think people are just frustrated",
            "MechE lurker here: this is generally the same thing that has occurred in all engineering disciplines over respective technological timelines. \n\nMechEs - once CAD came around, don’t need drawing rooms full of engineers anymore.\n\nEEs - tbh the strongest of the groups as far as in-demand over time, but once digital processing came about, the need for analog expertise took a nosedive. \n\nCS - greatest advantage is also its greatest weakness, as it’s much easier to just overhire a ton of engineers then layoff. Not as much capital expenditure tied to each job, which is why pay was higher, and SW companies are so dang lucrative. Y’all are the factory! \n\n\nI hope this breeds a new generation of self starters, we need a new twitter so bad.",
            "CS was never an easy path to a six figure salary.  I was majoring in it back in the 90s and while some people were getting six figure salaries, it was not because it was easy.  CS was never an easy degree to obtain.\n\nThe only people that CS may be easy for are individuals that are good at math.  Because calculus, and analytical algebra, and statistics is easy for them.  And even then, some of those people are not necessarily good with programming without some effort.\n\nYou don't learn anything anyway.  You learn at home doing stuff on your own time, outside of the classroom.  You learn by setting up configurations of equipment you bought with your own hard earned money, taking risks, breaking stuff, figuring it out the hard way.  How many people are actually putting in effort, on their own they aren't getting college credit for and they aren't getting paid for, with no reward other than the fact that they solved a problem?  And how many of them can prove this or demonstrate this on an interview.\n\nWhat you are seeing is disillusionment because people complain that there are not enough POC in tech, or there are not enough STEM, or people want to work directly in the industry, instead of just doing the work wherever they can.  So they were finessed into taking up CS and actually got the degree but the truth of the matter it is not in them they were never built for it and do not really care about tech outside of the classroom.\n\nWould you hire that person?",
            "Because it's rough right now",
            "I feel like there's been this level of anxiety for a decade now in the CS field. It happened when I was applying for jobs and it never seemed to have gone away.\n\nI won't lie, CS entry level jobs are difficult to apply for. It's a skill-based process that people graduating with a CS degree aren't very well equipped with. My university had a special class to teach people majoring in tech how to apply for jobs. It's also not going to necessarily be a good money guarantee thing. My first developer job was well below what I was expecting to get, and it seemed to be the case for anyone who wasn't a 10X type coder.\n\nI got a job with higher pay later on, but that took time and specialization efforts towards something I wanted to do. I had friends who went into it simply because they wanted the money, and they got burnt out very quickly in the job application process. If I was going to get a job simply because I wanted to get a lot of money, I would've picked a different field all together.",
            "A lot of people have had it the worst because they didn’t really try hard in uni. Gaining experience, trying to make connections, doing projects, and just overall expanding their technical capabilities were not on their agenda other than just going to school and “learn”. CS is an opportunity to apply your skills and enter the industry for a median 90-100k entry level job. People just think they earn their degree at a T50 school and not have any internships or connections. Rather it would be more wise to gain experience from a lower ranked university if you’re a more competent individual. It really is a grind, but you have to grind the right way. It has been getting a bit annoying. All this on top of the over saturated entry level market for CS. It’s only gonna get harder from here.",
            "Who cares let them stop new people from majoring in CS",
            "Because boo hoo can't get a 150k$ part-time work from home job anymore. Cry me a river.",
            "Now every universities should limit their CS seats. And tech companies should only hire CS or CS related major graduates. Nowadays I see folks from business and hotel management getting involved in web and app development.",
            "I think it's just brewing and when one person vents people who've been holding it in want to vent too",
            ">Did ya'll really think CS is some easy path to a six figure salary?\n\nWell, that's what the influencer on tiktok and YouTube were saying. That's what so many job sites have been saying. It's no surprise to me how young people might believe what they're told over and over.",
            "No, the job market won’t improve. There is no reason for it to improve. Competition is only getting more intense, and AI tools and many useful tools in general, are making the entry barrier less valuable. Why should the job market recover? The economy has pretty much recovered as employment is at an all time high. Clearly not true with tech",
            "These people take huge amount of student loan to major in CS, they do want return for their money before usurers come for them.",
            "I thought it was an ongoing meme lmao",
            "No clue. Mechanical Engineers still make bank and get good jobs all these years later. I don't know why an economic crunch has people foretelling the end days.",
            "I think the market will improve, but not the level that people are looking for.\n\nCOVID jobs were an anomaly, not the norm. The days of 150k+ out of college aren’t the norm, they are the exception, and now the demand has gone down people will have to accept that.\n\nYou can still get a great job, people here are just mad entitled thinking they deserve 100k for doing what is essentially jack shit.\n\nTalk to people in the healthcare industry, or other industries that make a difference, and you’ll feel better about your hours/job/pay. \n\nAlso finding a lot of cs majors that straight up can’t code in a development environment. Not leetcode, hackerrank any of that, but actual development, and problem solving when you won’t find a direct answer on stack overflow, but an answer that you may have to mold into what you need it to be. \n\nAnd I think a lot of those people are the ones that thought they’d be able to breeze into these jobs not realizing the people grinding leetcode can usually code or at least learn themselves back to speed in a couple months.",
            "This field is over saturated, like seriously over saturated now. People will start making more average (50k-80k) wages and the job will no longer be as prestigious as it once was. If you disagree look at current job openings, average salary trends, or just talk to someone in the industry. My company won’t even consider hiring juniors anymore for IT/Software roles (software company of over 2k employees)",
            "They majored in CS because they were delusional. Virtually no one is going to make 150k fresh out of college, but these people are too naive to understand that. \n\nEdit: it just occurred to me that the people who have trouble finding jobs might be similar to those “geniuses” who don’t shower. Solving problems won’t get you a job when you’re not likable.",
            "Everyone’s afraid of AI these days but am I the only one who is genuinely excited about it? I mean why not expand our CS education and learn more about AI?",
            "Brodie. CS IS an easy path to 6 figure salary 🤦🏼‍♀️. Just do your internships do your projects and as a new grad you most likely STILL will be making more than median salary (in the US).\nTry seeing how long it will take you to get 6 figures in a non stem major.",
            "It’s end game, you know the fourth turning of a 80 year cycle, CS sux",
            "Just going through bls.gov…\n\nIf you have no desire other than just another swe, then yes, life will suck.  However, CS is more than just swe and most of the industry is still booming by the looks of it.",
            "It is just most of the CS students consider themselves the \"smart one\". For GPA and Leetcode, you have a criteria and you know if you follow them, you might achieve at least a good score. However, in real life or some job hunting scenarios, there's no guideline, no criteria, or nothing to guarantee you get a job. \n\nPS: AI is just another blockchain.",
            "> Did ya'll really think CS is some easy path to a six figure salary?\n\nA lot of us did, yeah. Because the universities we attended sold us on that expectation. I finished my undergrad over 15 years ago and only began making above market rates in the past five years. People are well within their rights to kvetch about the state of the job market given most of the layoffs have been done to artificially inflate stock values.",
            "Every time I see one of those posts my existential dread of my future increases",
            "Probably for Incoming freshman",
            "people think they have to make faang money and do everything great all the time and don’t realize that the more pressure you put on yourself and the more you chase that wild goose, **the more pressure you put on yourself and the more you chase that wild goose** no one is stopping to smell the roses they just want 140k out of college",
            ">Why choose something you hate just because the money is good\n\nright, if people just want money, all the attractive guys and girls should just go be prostitutes. They can earn very handsome money",
            "No sir, hard work is not getting you a job right now. There simply aren't any jobs for new grads. This is like saying that by working hard you will increase the value of bitcoin. It's not up to you, its up to the market.\n\nThis is not to say hard work won't pay off. It will. But right now anything you do or don't do is almost completely useless, no job cares if you are studying on your own, or reading python books or contributing to an open source project, or doing leetcode problems... hence the frustration. These things will pay off, in months, years to come but right now the reality is young people are not getting tech jobs, when people who are 1, 2 years older have their high paying, high status jobs. It hurts, we were promised something and it was taking away from us, we feel cheated. If you don't wan't to see negativity in the sub, well, you can leave for a while or redirect people to another subreddit that is more appropriate. People in our situation (unemployed for months after graduation) want to know they are not alone and find a place to discuss and get exposed to good ideas to do something better on these grim times. Be more understanding.",
            "I’m not entirely sure what’s completely going on in the CS market but there’s one aspect of my CS classes that I’ve noticed differentiate it from my EE. In my EE study groups, class lectures , etc there’s not a big discussion in where you see yourself working at. There’s of course some talks but there isn’t this big consensus in regards to certain companies and instead a ton of the talk directly involves the lessons itself. My CS classes does have a ton of theory discussions among students but there’s such a huge portion of students that just won’t stop mentioning FAANG. It almost feels like there’re not majoring in CS and they’re chasing a FAANG degree. FAANG this , FAANG that , etc. Theres nothing wrong with wanting to aim high and wanting the best job but in CS it’s become more of a need than anything else",
            "Well, I didn't really plan on making six figures anyway. I was hoping to at least land a relatively low paying position like maybe 45k-50k. I didn't think it would be easy but I at least thought that it would be \\*possible\\*, but now I feel like I wasted 5 years of college for nothing because I'll never be able to break into the industry and I'll be stuck working the same shitty low paying jobs I would have if I had never gone to college in the first place",
            "Some people don’t realize the difficulty that goes into the field and the dedication required to have success .. I truly believe independent contracting is the way to go .. that’s just my opinion",
            "Now it’s time for all the posts complaining about all the negative posts. \n\nNot everything requires another post.",
            "Meanwhile as someone who loves programming that’s trying to get a job, I’m having a really tough time even getting an interview…"
        ]
    },
    {
        "post_id": "128igci",
        "author": "NationalGenerosity",
        "title": "Targeted after using “master” and “slave” terms",
        "url": "https://www.reddit.com/r/csMajors/comments/128igci/targeted_after_using_master_and_slave_terms/",
        "score": 435,
        "num_comments": 484,
        "created_utc": 1680345685.0,
        "selftext": "I’m high school robotics we used these terms all the time, so I kind of used them without thinking. Some people in the class said something along the lines of “that’s not the correct language” or something, and I asked why. They have an explanation on how it reinforces structural racism and that I should use the words “source/replica” or “parent/child”. I said I disagreed because parent/child isn’t always the same thing and source/replica is not widely used, but I feel like for no reason I’m now looked at as that one racist student and I should’ve just agreed. Should I apologize to the class and say that with further thought and research I see that I was wrong and will use the new language?",
        "permalink": "/r/csMajors/comments/128igci/targeted_after_using_master_and_slave_terms/",
        "comments": [
            "Start calling it 'Dom' and 'Sub\" instead. You get to be PC, but with the added benefit of making everyone uncomfortable",
            "April fools?",
            "In terms of version control I've gotten used to Git's 'main' instead of 'master'",
            "The industry is moving away from their term “master”. Main is a good replacement. And people definitely don’t use “slave” anymore. Worker is a good replacement, like in the context of “worker threads vs the main thread.” Supervisor can also be a replacement in some contexts.",
            "I get the anger but it just seems like the wrong hill to die on. IMO",
            "Interestingly enough the only time I heard of “master and slave” terms was in embedded systems/discrete maths and I also raised an eyebrow because it seems outdated. \n\nI think using parent/child analogy is better.",
            "id let it pass if a guy used master/slave once by accident but if he insisted on using it after other students asked him not to (because obviously cmon) im gonna think of him as a 4chan user/on the spectrum/a bit racist",
            "I work in the industry and nobody says master/slave anymore. Like I literally cannot remember the last time I heard anyone say that. It’s just not the terminology that’s used anymore. Things change. \n\nIf it makes people uncomfortable, then idk why you want to say it so badly. You clearly know you’ve done something weird if you’re posting on Reddit looking for approval. \n\nI can promise you that if parent/child works fine for us in the industry, then it’ll work fine for you in your high school robotics class.",
            "It's probably more of a loaded term in the US because of vestigial reasons. Save yourself alot of headache and don't use the word; it's not the hill to die on.\n\nYou could argue that slavery is not inherently racist; and you'd be right. The largest slave market in the world right now is in sub-Saharan Africa. There is ongoing slavery in China, India, Bangladesh, Iran, Russia, UAE that doesn't have a racial undertone. \n\nIt's frankly kinda historically ignorant to think that slavery only refers to the transatlantic slave trade, since slavery among other atrocities has been a part of human history for a long time.",
            "I always think the CS sterotypes are over the top and not true, and then I read a post on Csmajors that tells me that they are well deserved, the social awareness is non-existent.",
            "Still used in automotive and plumbing 🤷🏻‍♀️",
            "I pray to god that this is a april fools joke.",
            "I still use master/slave personally as it is a general concept because none of the \"parent/child\" or \"primary/replicant\" terms really describe the relationships as fully as master/slave and all my teachers and textbooks use the term. \n\nIt's a dumb point for other people to argue that you change personally, however, in a corporate world it's best to adapt to whatever vernacular that they are using. My coworkers in my previous job constantly called git \"vc\" and called ui views as \"screens.\" Ignoring the whole racism angle, it is important to use the same vernacular as your peers in order to communicate ideas consistently. If you're the only one using a different term to describe something, it's going to confuse people in documentation and people won't understand what you want.",
            "Source/replica, parent/child, main/develop, boss/worker, leader/follower, supervisor/worker…this is the problem.  Too many people pushing for too many replacements.  There must be a standard if we want to replace a standard.",
            "I think you should use their language but not mainly because of what it implies (mabye just a little) but because learning to adapt to the same way of work as your current team/employer is important, its a lesson in flexability if not anything else.",
            "Have you actually done the \"further thought and research?\" Maybe do that before you say you've done it",
            "We should make master and minions the common parlance. \n\nMaster gives tasks to its minions to complete. The little goblins are running amok in the system doing their master's bidding!",
            "We should change the naming convention to 'Master' and 'Servant'. ^(it's a lot like life)",
            "controller/peripheral",
            "My employer recently informed us we couldn’t use master and slave to name the circuit boards anymore (which literally have the names printed on them lol); one of the suggestions was “Maestro” and “Performer”",
            "The place i work has a pre checkin validation script that flags non inclusive words like this \n\nLeader follower , primary secondary are the new norms .",
            "What the fuck is this post",
            "In the end, I think it boils down to this: if the times have changed, and a given word is considered gauche by more and more people, then you adapt and avoid using it.\n\nI understand the arguments for why in principle people think this shouldn't matter. But it doesn't matter what those arguments are, because this is already decided by society. It's like a euphemism treadmill. For instance, when all of these terms were used medically in the past, why is \"r\\*tard\" a slur, but not \"idiot\" or \"moron\"? It's just the way the words have evolved. You have to abide by it. You can argue that this isn't rational, but it doesn't matter what your opinion is, society's decision on what is acceptable or not is already set.\n\nAnd frankly, usually the sort of people who want to argue in favor of being able to use these words that society has deemed unacceptable - it's often a certain type of person. It's the 4chan type, someone who is at least \"a bit racist\" that /u/smellsliketeenspiwit describes. You know that type? I can imagine what they'd say already. Something about their free speech being curtailed, supposedly. A jab against people who are woke. A dog-whistle here and there. I feel like those people are less interested in seriously defending free speech - it's more like they just want to use the slurs and be provocative.\n\nI'm not accusing you OP of being like that - since you're here actually second guessing what you said. But, that's what making these arguments will generally make you perceived as. Besides, if it's making people uncomfortable, why not use the other terms?\n\nIn my workplace we got rid of \"master/slave\" about 2 years ago. I don't exactly work for a group of social activists, it's a finance company whose objective is to make money. But, changing these terms is not such a big deal, so why not just adapt to the new terms?",
            "Some people just look for something to get offended about, you can’t please everyone I guess",
            "It's more important for you personally to not rock the boat and accept the new terminology. You're not going to go very far in any career if you're being a challenging edge-lord and insisting on using language some may consider offensive just because it was historically used. That's really not a good argument.  \n\n\nAlso, if you're in high school, you're part of gen-z and your whole generation is very, very inclusive. If you stick with this sort of thinking, you're going to have trouble your entire life.",
            "You've already come across as really, really weird. I'd just let it go, and just don't bring it up again.",
            "I use slave child to make sure there is no confusion",
            "lol",
            "Source or primary and replica are extremely common",
            "Primary and Secondary",
            "Primary/Secondary",
            "Primary/secondary.",
            "Primary and secondary?",
            "In industry, lots of companies are changing vocab to be more descriptive. I personally like Leader/Follower. It’s more descriptive, nicer to say, and has roots in social dance 💃",
            "We call it coordinator and worker now",
            "It's true, databases are now referred to as primary/secondary or writer/reader etc. It might seem strange to begin with but all major vendors have switched terminology. Just run with it.\n\nApologise if you wish and say you didn't realise terminologies have changed and you see why, or just leave it.",
            "Is this an April fool's joke?",
            "I guess you need to switch that term to avoid upsetting people. I personally couldn't care less about what term is used. Imo people seem too stuck up about language? Could anyone explain exactly how using the master-slave terminology could possibly 'reinforce structural racism'? How does this even relate to race? I'm pretty confused lol (could just be me being not culturally aware as an international student though, in which case, do enlighten me)  \n\n\nEDIT: I do see how it is a somewhat dated/crass term to use and that switching to primary-secondary, main-worker, etc. is probably better, therefore. But I don't get specifically why someone would get upset over its usage?",
            "These terms have been deprecated in the industry. For example, we used to use master and slave for setting up LDAP. Now, openLDAP documentation referred to them as ‘producer’ and ‘consumer’. They are replacement of master and slave, respectively.",
            "It is disturbing how soft this generation is",
            "Nah they’re just a bunch of busy bodies who aren’t really capable of making a real difference, so they engage in these little witch hunts so they can feel like they’re contributing. You’re not going to win if the prof is on their side. If the prof isn’t saying anything, then just don’t push the issue for rest of semester and move on.",
            "As a black man (even though slavery is much broader than US slavery but I’m sure this is what they were alluding to), no need to apologize, nor change your terms. I work in tech myself and don’t really use these terms for what i do specifically, but know there are applications where they will be needed. Just like “male and female” adapters, it seems wrong nowadays with politics, but we all know damn well these terms aren’t meant to offend but to do our freaking jobs.",
            "We switched to use primary/secondary a long time ago.  Language matters.",
            "Never apologize for using the correct technical terms.",
            "I don’t think you did anything wrong. If that’s exactly how it should be described, you describe it that way.\n\nI’m seeing this type of behavior in the corporate world as well. For example, we recently redid many of our product agreements. Instead of having dozens of contracts, we now have a “Master Agreement” with product appendices. We’ve been referring to that as a project team internally for quite a while. \n\nSomeone the other day, new the organization and the project group, basically scolded all of us for using that kind of language and said it needs to be the “Primary Agreement” with “Secondary Product Appendices”. They effectively inferred that we were reinforcing racism culture by using the term “Master”. \n\nWas sorta hard for me to wrap my head around, because in no way, shape, or form was that the intent or even cross the minds of any of us working on these agreements. But here we are.",
            "Words are all made up. Sometimes in your life, the community consensus about what those words mean will change. You can either adapt or you can be weird about it. \n\nI find that the people who can’t adapt are generally pretty boring and obnoxious, but I guess it’s a good way to find your people.",
            "I mean, if you want to be technical about it, \"master/slave\" also isn't really an accurate description of how we have historically used the term in computing. Slaves are not obedient robots which do a master's bidding, they are living beings who act out the orders of their masters out of self preservation instinct. No terminology is going to be perfect so it behooves us not to nit pick *too* much. Prefered terminology for things changing over time is natural and common, for many numerous reasons, but it never causes more unnecessary consternation when it's \"woke\" in people's minds.\n\nIMO, the implication that only crazy \"woke\" activists would want to use language that is nuetral and accurate is an odd take that arises more out of the \"anti woke at all costs\" style of politics than any rational thought.\n\nManager/worker, main/secondary, leader/follower are all terms that I think are both more accurate than master/slave, anyway.\n\n>I said I disagreed because parent/child isn’t always the same thing\n\nMasters and slaves are both human so that in tech they aren't always the same thing is a critique one could levy against the master/slave terminology, too.\n\nSide note: The etymology for master/slave actually supposedly came from master and slave cylinders in cars which took after the root words for \"giver\" and \"taker\" in German. So something not just got a little lost in translation, but unintentionally (thinking optimistically) added.",
            "Wrong hill to die on",
            "Lead, follower, primary, secondary, host, main, active, backup, source, replica, copy...  \n\n\nYou can be part of the solution by literally only changing how you speak or you can be an AH. The choice is yours.  \n\n\nFact is the industry as a whole is moving away from racist terms and in 50 years it'll be something people will look back at and cringe.",
            "The solution is to propose new terms for the concept of the origin and its derivatives. The terms slave/master are deeply problematic and they absolutely have to be replaced.",
            "What's the issue with just updating your vocabulary to accompdate a more widely acceptable term? I agree with most comments that this is not the hill to die on, and it'd be really weird to keep insisting on using master/slave when using something else works just as fine and gets the point across.",
            "primary/replica is a more descriptive and useful nomenclature. \n\nforget about the politics (which is a distraction). forget about claims about \"reinforcing structrural racism\" (which is dubious). just go for clarity. master/slave isn't an especially good labeling scheme regardless of cultural context and sensitivities. it's not worth fighting to keep using something that was a bad choice to begin with.",
            "I'm assuming you're referring to the usage of these terms in regards to parallel/distributed computing in which case the industry standard terms now are \"manager\" and \"worker\" and \"master\" and \"slave\" is no longer used.\n\nEdit: \"main\" is also common in place of \"manager\" when it comes to threading",
            " Yeah, it’s dumb, and totally performative in nature. But like others have said, just not the hill to die on brother.",
            "I'd say if someone was genuinely hurt then an apology would be nice. Some people, especially those young enough to be in highschool, like to find stuff to be offended over. So if someone is actually hurt, go ahead and apologize. If they are using what you said to act all self righteous while simultaneously shitting on you. Ehhhh you can apologize if you want but I wouldn't. \n\nI will say master/slave isn't used anymore in the industry and haven't been for some time. Words and connotations change over time. Words aren't like math where the logic and meaning of math rings the same over time. For master you can swap in parent, hub, supervisor, main. For slave you can swap in child, worker, sub-process, node.\n\nPart of being a team is knowing when to debate your point and when to just go with whatever the team says. Weigh the risk-to-reward ratio and ask if it's a battle worth fighting.",
            "[deleted]",
            "I have a project where we still use the terms internally (in the code) but everything user-facing has a different name. The trick is simply to use a different defining feature. We had a similar debate about the term \"whitelist\"",
            "Serious question; Is the term 'master' by itself (without a slave) frowned upon? Because it infers a master/slave relationship?",
            "Well, I'm still the master bater",
            "Do we still call plug connections male and female, or can I just call them penis and vagina.",
            "The industry is certainly moving away from these terms and you should too.",
            "Wait until people find out about “male” and “female” plugs.",
            "One thing to remember as a CS Major is that what we learn in school and internships is, in general, supposed to prepare us to have a career for the next 40+ years. So they SHOULD be teaching us things the way they WILL be, not necessarily the way they WERE.\n\nIf 60% of the industry still uses master/slave terminology but the other 40% has transitioned to parent/child or main/worker, it would make more sense for them to teach us the parent/child terminology. Even if more than half of companies still use master/slave TODAY, by the time many of us graduate that number is likely to change. So they’re likely to teach us the more “up and coming” terminology anyway because that makes us better prepared for the future of the industry.",
            "From Google's C++ Style guide. \"*In all code, including naming and comments, use inclusive language and avoid terms that other programmers might find disrespectful or offensive (such as \"master\" and \"slave\", \"blacklist\" and \"whitelist\", or \"redline\"), even if the terms also have an ostensibly neutral meaning.*\" \n\n[Source - Inclusive langauge section](https://google.github.io/styleguide/cppguide.html#General_Naming_Rules)",
            "Wait until they hang you on \"whitelist\" and \"blacklist\"...\n\n(Actually, we can't use the word \"hang\" anymore, and we had to terminate someone with the surname Lynch because lynching is racist.",
            "This is changing all over the industry and has been for several years now. The tech industry has been doing a fairly good job of enacting social behavioral improvements and modernizing its language. Don't get in the way, you'll look like an idiot.",
            "This is definitely a thing, so try to learn and adjust. \n\nMaster bedroom or master bathroom is now viewed the same, as it implies the bedroom or bathroom of the master and can be considered racist to some.",
            "I wouldn’t worry about it, the people who actually matter don’t care about shit like this.",
            "I liked  Dom/ Sub, thought I'd riff a little  \n\n\nPimp / Ho ?  \nOwner / Employee?  \nGOAT / bitch?  \nJim / Dwight?  \nTop / Bottom ?",
            "> Should I apologize to the class and say that with further thought and research I see that I was wrong and will use the new language?\n\nare you a coward ?                  \nare you a sheep that follows the crowd ?                \nare you stupid ?                 \n\nif the answer to any of these questions is yes, then you should apologize \n\nif the answer to all of these questions is no, then you should not apologize",
            "Making the mistake once is fine.  But once it’s been explained, if you continue, it comes off as totally racist. There at many terms you could use.. as you well know.",
            "Personally I don’t see the problem with master in the GitHub context. Master isn’t used only for slaving, and you don’t think of that context when you hear the word master. But when you use slave with it, then it isn’t okay. Woodworkers are also moving away from the term slave.",
            ">Should I apologize to the class and say that with further thought and research I see that I was wrong and will use the new language?\n\nHell no. People will find the stupidest things to find \"offensive\".\n\nIt's called what it is because that's what it does. If they don't like it, then they should go design a different device that achieves the same outcome. (from a CpE perspective)",
            "It’s a thing. Your job will likely have the exact same attitude. Just get with the new terms imo.",
            "My god, the level of wokeness is unbelievable.",
            "most embedded textbooks use master and slave for serial communication protocols, really hard to go back and change everything",
            "No, because you’re not wrong. \n\nDon’t bow to idpol morons that live in cuckoo land. Slave/master is an accurate description of the relationship. If they want to cry about it then that is their personal problem for them to resolve personally.",
            "Welcome to the new woke world. Everything is PC. Institutions have been attacked by politics, so people have to use precise words to get through the day. Sorry it happened to you.",
            "It’s honestly up to you, but words are important. The only thing worse than people trying to police others’ words is those who use words explicitly to incite these images, and perception is reality. If its important to you, then by all mean stick to your guns but prepare to face the consequences of the perception. If it’s not (it really *shouldn’t* be) then apologize for giving the impression and strive to do better.",
            "Bullshit. Master is used to describe an image or organization of correctness, the proper version is the Master version. Master Copy, Master key, Master Image, Master Cylinder, Even the MAST of a boat is the most upright and supportive structure for all the functional parts of the ship... Knowing this makes you the MASTER because of your authority to perceive and communicate effectively.. now go dominate them. Telling you to change your behavior without functional discourse and legal boundaries **IS EXACTLY WHAT SLAVE DRIVERS DO.**",
            "just use main and dev, that’s what a lot of the industry has moved to",
            "You’re not being “targeted” you are; however, being an ass. If you say something, and it upsets someone near by it cost you $0 to just say something else. \n\nJust tell them “hey, didn’t really think about what i was saying the other day, my bad” and that’s literally all it would take to end this.",
            "There is a movement within industry to use more inclusive and gender neutral language. It costs you nothing to do so, and respects your colleagues. It's really up to you to decide what kind of message you want to send about the kind of person you are. If you're bent out of shape over this, you'll definitely limit your future employment options.",
            "\nYour classmates are stupid and you shouldn’t care what stupid people think.",
            "As for your post... yes, fucking apologize.    \nYou're there to win friends and influence people.    \nWho knows who will have a job waiting for you.\n\n\nAs for the terms:    \n\nfor robotics:    \nuse worker/boss or parent/child.    \nI like parent/child since it baically has the same relationship/dynamic as when we use it in terms of processes/gui windows, etc.\n\nmaster/slave is inaccurate for git anyway, since \"slaves\" \nwould often tell the master \"what to do\" (I.e., `git push`).    \nWithin the context of a git repo, \"main\" has several meanings which would make perfect sense in the english language.\nTherefore, the term is nebulous.    \nFor those, I kinda like `base` and `variant`.",
            "The world around us is becoming woke , especially the IT world as the big social media companies are the ones that promotes this wokeness in their platform, so even though you are perfectly correct in your stance, people are going to get offended.",
            "The words “master” and “slave” are simply not racist when you are using them to describe code. If people find this racist, there’s a good chance they’re the one making a racial association themselves, struggle with that, and are projecting that onto you.\n\nUse whatever words you want to, just use them appropriately. Never apologize for something you’re not sorry for, and don’t just conform to people’s demands. It’s just wild to me that people bike shed vocabulary.",
            "Arguing back with “source/replica is not widely used” is probably the worst possible thing you could’ve used to justify continually saying “master/slave”",
            "Do not apologize. Sometimes, it is best to apologize, whether it be for technical or cultural errors, but I do not believe that is the best option in your particular circumstance.\\* What I would do if I were you would be 1) just start using \"parent/child\" for this class to placate their fragile minds or 2) continue using \"master/slave\" but this may agitate them further. Depends on how ballsy you're feeling.\n\n\\*This generation of students doesn't really have the mental capacity to \"uncancel\" someone once they're branded so you're not gonna get any networking out of this so might as well just focus on grademaxing. \n\nAt the end of the day, this is just one course and a bunch of your classmates won't even make it to the end of the degree. They don't/won't matter, and after the class is over you probably won't even see the majority of them ever again. Depends on school size. Another user in these comments said \"drink the kool-aid or you'll die of dehydration, unfortunately\" and it's a humorous yet true statement about how the US is right now so you might as well play along.",
            "Hopefully April fools? But if not then yes, you should apologize and revise your terms. Companies and teams are diverse, no point to die on the hill of making everyone uncomfortable. Using master/slave once when contextually appropriate is fine but if people ask you to stop and you don’t that makes you seem like some type of white pride 4chan weirdo trying to prove a point.",
            "did this happen after they changed Boba Fett's ship name?",
            "My intro to computer engineering professor still uses master/slave lol. But yeah just apologize. Less about who’s right and more about not having people hate you",
            "For saying this isn't a hill worth dying on, OP is sure doing a heck of a job dying in this hill ...",
            "Imo slave / master does not “perpetuate structural racism”, though I prefer leader and follower anyway",
            "When I was a kid, they used to use the terms master and slave for floppy drives.  The primary floppy drive with all the electronics was the master, and any drives that couldn't function as an independent or standalone drive were slaves.  I didn't even make a connection to actual real world slavery until I opened up the slave drive to repair it and then found that everyone inside of it was dead.  The horror, the despair and carnage were deeply palpable.",
            "Tell them to suck your dick - thats the only valid response to their bullshit.\n\nOr rename the master branch to \"lgbtq\" and the slave branches to \"they/them\"\n\nAsk if you need more ideas",
            "Isn't that a violation of the first-amendment?",
            "“Targeted” should just change your language, made friends with your class mates, instead of writing  about it on the internet and making yourself look like a d*ck. It’s not that serious. \nI don’t care either way but if someone is offended by it and I literally give two shits about the word… I’m not going to throw a hissy fit. Pretty sure you did the socially awkward/4chan thing, doubt anyone thinks you are racist tbh but at min hard to work with. You need to learn not to care sometimes bro. Like",
            "You should apologize instead of sticking to your guns here. Whether master/slave is actually perceived as offensive or not (it's not to me, but my ancestors weren't enslaved in this country so ¯\\\\\\_(ツ)\\_/¯), the software industry has largely moved on from that terminology for all but legacy systems and their documentation. The replacement depends on context though, since there's a general desire to be more descriptive than \"this thing has primacy over the other thing\".",
            "Why don't you change the terminology? Focus on what matters. Don't be one of those alpha nerds that gets caught up on the small things.",
            "Manager/worker is typically used in place of master/slave",
            "dom/sub is somethin i use bc it’s funny",
            "Controller/agent",
            "I find it interesting how few people picked up on the embedded context here, I guess everyone interested is majoring in EE now.  ;)\n\nThe terminology is a bit of big of a bigger problem at a lower level.  Some names are easier to replace, I2C for example has settled on controller and target.  SCSI was always initiator and target (I think?). Main works in a lot of scenarios, say “main clock” (“master clock” is where this terminology started in the 19th century) but there are still outstanding problems.  For instance, what do you do about the term “bus mastering”?  Clock producer and clock consumer?  Bus maining and multimain bus?  I haven’t seen attempts on some terms like that yet. \n\nRegardless, the same concept having many different names is extremely common in computing.",
            "big fan of using dom/sub instead",
            "My dream as a kid had always been to be a Pokemon Source when I grow up. Life's unfair.",
            "Main/secondary…? I too have been recently reminded this is sometimes no longer acceptable…",
            "I've heard of this and don't follow tech or robotics, no idea why this even showed up in my feed.  If you want to make it in a field like that (or really any field) you need to stay current and show your ability to adapt.  I'd just start using the acceptable terms to show you've adapted to the norms and your peers will get it.",
            "What about the terms host/client or server/client?",
            "Master / Replica here.",
            "Why not use CEO and Intern?",
            "Just call it Master-pupil",
            "Controller and Agent.",
            "naa, just use primary and secondary, or parent and child. There are times when the written instructions like for older hard drives when jumpers have to be moved and wording on the drives are master and slave.",
            "Yes, you should. And for future reference, \"This is the way we did things at my high school\" rarely goes over well in college.",
            "My comp arch professor didn’t say anything when introducing master slave flip flops",
            "Controller/worker - that's the best equivalent in robotics terms.",
            "Stupid answer:\n\n\"Stop calling it that!\"\n\n\"Calling it what?\"\n\n\"The slave algorithm.\"\n\n\"Don't you dare say that word! It reinforces embedded racism\".\n\nPerfect.",
            "Well, those were the official terms for devices on an IDE bus, so maybe ask the people complaining to take their argument to IEEE and you'll do whatever they (IEEE) recommend.",
            "Leader and follower are the terms one of my CE profs taught us for flip flops or other circuitry/electronic components. Parent/child makes me think of a graph and source/replica doesn't really describe it well. Leader and follower work fine imo but I guess they're not common knowledge. They tend to describe the relationship well tho"
        ]
    }
]