[
    {
        "post_id": "klwsac",
        "author": "Oibvuen3a",
        "title": "I get such an adrenaline rush when i finally nail a program and watch it running as intended",
        "url": "https://www.reddit.com/r/csMajors/comments/klwsac/i_get_such_an_adrenaline_rush_when_i_finally_nail/",
        "score": 434,
        "num_comments": 25,
        "created_utc": 1609182666.0,
        "selftext": "Its kind of funny actually, im nowhere near a good level and what takes me hours to solve for others it probably takes mere minutes.\n\n But i still cant help but feel so happy and energetic when i finally nail it. CS is my second major and the satisfaction compared to the problem solving from my first major doesnt even come close. Its actually insane how energetic it makes me feel.\n\n Maybe i will get burnout in the future but for now i want to enjoy it as much as possible. I may spend an entire day working on a problem and i wont care at all if i solve it in the end (although i wont be as happy if i dont haha)",
        "permalink": "/r/csMajors/comments/klwsac/i_get_such_an_adrenaline_rush_when_i_finally_nail/",
        "comments": [
            "I feel the exact same way! Getting all the bugs and edge cases fixed gives me such a rush. CS is my second major too, but is my one true passion :)\n\nWhat’s your 1st major btw? Mine is neurobiology.",
            "Keep chasing that dragon.\n\nPretty soon you'll be orgasmic when an external package installs.",
            "[deleted]",
            "I get the same rush if I pass most of the test cases on hackerrank on my first run.  It is very rare mind you, because it would be a shame if I didn't try to use .length() on an array at least once in my stupid loops.  But it is the one of the best feelings.",
            "I've been a professional developer for 12 years now and have been programming since I was kid in the mid 90's.  \n\n\nI still get that feeling. It's great",
            "I think once you experience that rush, you're hooked into programming. That's the exact reason why I studied CS in college, the rush bit me early in high school",
            "The rush of a normalized, cleaned dataset with no missing values is a different kind of rush.",
            "There’s a psychological term for it but i forgot what it’s called",
            "I feel this even if all i did was a calculation function :)",
            "To me it feels like when I first started learning guitar and I nailed a riff. Didn't matter if it was something as simple as Smoke On The Water, it was ME that did it and I got a little rush from it. Even when it's a simple program or even a basic function I get working, I get the same little rush.",
            "I’ve been on vacation for 10 days and this 100% explains why I’m so depressed. Thanks OP",
            "I remember spending 2 months working on an algorithm that solved puzzles for a puzzle game I was making. When I finally got it working I was jumping up and down like those NASA scientist when they land a rocket on another planet",
            "Lol that feeling is how I knew I was in the right major. I definitely get unhealthy with it sometimes because I get really into the problem and I can't sleep. (This is even bled a little bit into my postgrad job. I'm not good at balance). I remember a few times where I accidentally pulled an all-nighter to finish a lab that wasn't even due because I just got so into the problem. Try to do better than me and invest time in some hobbies 🤣",
            "I get this same kick while pushing on GitHub some new feature that I have worked on for days.",
            "[deleted]",
            "And you know what the best part about CS is? Now that it runs properly once, it’s always gonna run correctly. If your configuration files are all in tact it’s gonna run even on all intended devices correctly. Always! Even at your 1000th attempt! Even when you are sleeping and even when you run it after you wake up!"
        ]
    },
    {
        "post_id": "15c0y0b",
        "author": "BigBellyBigDream",
        "title": "Leetcode does not actually feel that bad",
        "url": "https://www.reddit.com/r/csMajors/comments/15c0y0b/leetcode_does_not_actually_feel_that_bad/",
        "score": 434,
        "num_comments": 120,
        "created_utc": 1690558891.0,
        "selftext": "I've started my \"leetcode grind\" in preparation for interviews this fall and I'm going to be honest, it's not that bad. I've been working through leetcode 75 and doing a couple problems each day and I already feel like I understand and can attack problems much faster.\n\nI was dreading it because I see people complaining a lot about how useless it is but it's a great way of practicing raw programming even though it doesn't technically apply to any \"real world stuff.\"  \n\n\n\\*\\*EDIT: Take this with a grain of salt I'm still a noob and early in my leetcoding career. Just was happy to see that I feel like I'm getting some takeaways from this!",
        "permalink": "/r/csMajors/comments/15c0y0b/leetcode_does_not_actually_feel_that_bad/",
        "comments": [
            "Tbh, the early stuff isn't too bad for me, like I can easily get arrays/hashing up to graphs. Then I hit backtracking and DP and immediately shit my pants.",
            "Just realize that you have the time and energy to do leetcode right now. Seize that moment and you'll thank us later.\n\nA lot of people who complain about LC do so while working 40+ hour works and juggling things like kids and what not. Your priorities most likely don't include that yet.",
            "Honestly leetcode is nothing, compared to all other exams I've given and all other grind things I've grinded. Sometimes it can be frustrating, but no reason to stop, or even complain about it.",
            "Only one solution, do, 2 leetcode every day as soon as you start your first job, dont know the solution read it and tomorrow try the same thing again, by the time you let go/ want to change job it wont matter. Don’t forget leetcode do it constantly and you career is guaranteed good engineer or not it doesn’t matter as long as you can lc. « learn the game, dont hate the players « ",
            "People cope so hard when it comes to LC, saying things like oh you don't need it and oh it's ok if you don't get it. \n\nBut really it's pretty easy if you just sit down and do a couple 💀it's so much easier compare to the complexities of large code bases.",
            "Other people have to do easy stuff like “get medical degrees” and “go to law school” to get six figures. Meanwhile us oppressed software devs have to withstand the absolute torture of solving a couple riddles.",
            "Surely you can see that just starting doesn't put you in a strong position to speak about this lol.",
            "It’s not the beginner questions people are complaining about lol\n\nLeetCode interviewing needs to die out. I’ve seen too many people who are a better fit for a job not get it because some other guy studied leet code for two years straight instead of building practical programming skills and impressed an interviewer. \n\nAnd then you get him on the job and he doesn’t know how to do shit that we actually do on a daily basis.",
            "It makes me want to cry because I can’t even do easies on my own.",
            "It’s fun, until you are stuck during the interview due to nervousness then knowing that you are gonna be unemployed a bit longer.",
            "[deleted]",
            "\n\nNever in my 4 years of experience have I ever needed to use any LC problems or solve any dumb puzzles like that. \n\nThat's why getting back into LC is annoying. It's purely for interviewing and getting a job, nothing more. \n\nOnce you get an offer, you forget about it until the next time you're job hunting. That's how it's always been.\n\nPeople are annoyed that it's unrelated to actual work and we have to spend extra time of our lives to do it.",
            "I remember when I did 2 sum for the first time too.",
            "Unpopular opinion but big agree. People who whine about it are mostly young NEET folks in cscareerquestions sub, who lack the grind mindset. Or your entitled 45 y/o John Doe who is a “senior” at some insurance company in the Midwest and refuses to “learn without getting paid”. 💀 But John Doe believes he’s director level material because he has grand insights on system design - so you can’t judge a fish by it’s ability to climb trees ya know. \nSadly for them, big N wants people who can talk the talk and walk the walk. If John Doe is as good as he thinks he is, big N will straight up make an exception for him as they would for any leading expert in any field they really want working for them. John Does are a dime a dozen. Don’t be like them. Be like L6 staff engineers in blind (except the mean part) who are both fantastic programmers and designers of systems.",
            "People say LC doesn't apply to real world problems, but idk. I've used graph traversals like DFS/BFS now and then when getting related data entries, requesting concurrent operations, or processing images. Hash maps are very commonly used. Recursion is nifty. It's important to know what operations are costly and not.\n\nMaybe a simple CRUD website won't use data structures/algorithms much. But, sometimes you do. Probably not as hard as a leet code hard though.",
            "Hoping to hijack the thread a bit for some advice on learning leetcode: \n\nI'm a returning 2nd bachelor's student so my course timeline is a little different than the average student. I only have two summers available for internships but I won't take a Data Structures or Design & Analysis of Algorithms course until after my first summer. I'm hoping to get an internship during both summers, so should I just go ahead and start learning leetcode asap, even before I take these courses? So far, I've only taken an intro programming course. My next two semesters are OOP C++/Java, Computer org. & Assembly, and math courses.",
            "The real test is when you can solve problems you’ve never seen before. It’s easy to solve problems over and over again, which helps with pattern recognition, but, especially with time pressure and the interviewer judging you the entire time, it becomes a lot harder. But yeah I guess when you’re doing leetcode in a comfortable environment and you know you’re not being judged, isn’t that bad tbh. Ik for me if an interviewer was looking at me the whole time I’d be second guessing a lot of things unless I really knew how to do the problem, which may not happen.",
            "cow expansion rinse salt rainstorm lunchroom skirt homeless weather concerned ` this post was mass deleted with www.Redact.dev `",
            "is there a structured way to go abt leetcoding or is it mostly just tossing yourself into it? also any courses for brushing up on the actual data structures?",
            "\\> even though it doesn't technically apply to any \"real world stuff.\" \n\nTwo real world things:\n\n1. You don't get to see all the test cases.\n2. You might need to optimize sometime.",
            "Oh the problem is spending your freetime after your fulltime job doing leetcode.\n\nThere are hundreds of better things to do or learn for an experienced dev.\n\nAnd if it were only top companies with thousands of applications that used LC it would be fine. After all they have thousands of applications. But even small companies think they are the shit and use it.\n\nBut i'd take LC all day before a take-home. The problem is that the whole interview process is a huge time sink for devs (even experienced ones).",
            "I tried. I hit the 40 problem mark and then just hit a brick wall. I just cannot go any further. Ah well, I have no experience and no SD projects either. Better stick to data Analyst jobs.",
            "what upsets me is the people who think it's a completely self-contained skill that will never have any implications in the real world\n\nlike... DSA is what programming fundamentally is. All programming is dealing with data, and manipulating that data with algorithms. How could you possibly say that it has nothing to do with \"real world\" programming",
            "What experience with DS&A did you have prior to starting?",
            "Leetcode is pointless. I rather have to do a system design problem than any type of leetcode problem where all you have to do is memorize the stupid problems instead of focusing on more important skills that would apply to the real world.",
            "Vocal majority by those who went into it for the money",
            "[deleted]",
            "Whatever you have to tell yourself",
            "Monta vista high school",
            "humble brag or regular brag?",
            "Lol I remember when I did my first few easies too",
            "[deleted]",
            "LC is easy until you start looking deeper into the CP and check for ATCoder-Codeforces and other stuff. Then you understand that LC is for learning DSA, to apply them you go to other judges.",
            "[deleted]",
            "Try DP",
            "Yeah Leetcode is not hard (even the Hard problems are pretty trivial), it's just a grind.",
            "Do the neetcode list and set up an Anki for it"
        ]
    },
    {
        "post_id": "qqulmm",
        "author": "deah12",
        "title": "Lol Amazon",
        "url": "https://www.reddit.com/r/csMajors/comments/qqulmm/lol_amazon/",
        "score": 434,
        "num_comments": 35,
        "created_utc": 1636551384.0,
        "selftext": "Invited to interview with Amazon, there are no times available. Asks the recruiter what to do about this.\n\nReply was\n\n\"Time slots are filled on a first-come, first-serve basis. **If there are no timeslots available, we have filled our** **interview** **availability for this session.** This invite is **not** a guarantee of an interview. If future opportunities arise, **we** will reach out with a new invite. \"\n\nAnyone have a similar experience?\n\nEdit:\n\nBold is by the recruiter and not by myself. This is for an internship position in the states.",
        "permalink": "/r/csMajors/comments/qqulmm/lol_amazon/",
        "comments": [
            "Sounds like you need more bias for action",
            "Lol at least you got the invite to schedule. I got email saying I passed the OA and next step is a phone interview and I’ll get an email to schedule within a few days. Never got it, reached to recruiter, she said she will be sending out invitations to schedule soon. Then got ghosted. Good shit",
            "Sounds like you're one of those employees that take pee breaks. Definitely not what they are looking for here at Amazon.",
            "I had a very contrasting experience. Hadn’t gotten the interview confirmation for a week, so reached out to the recruiter. Apparently the recruiter couldn’t find my survey response so she asked me for my preferences and was ready to schedule an interview the next day (11/10). Mine’s for the full-time role.",
            "I was going though some shit and didn't select a slot for 3 days after getting the email. They sent me an email saying all the slots were filled for now but they'd send another link for the next week. Filled that one immediately.",
            "I also got a survey with dates which were in the past. I replied back to the mail and the recruiter was nice enough to reset my survey and provide the updated one. I also ended up getting the offer :)",
            "Damn that really sucks. When did you apply btw?",
            "Overbooking like they are an airline.",
            "wait why can't they just move you to the next session/week then?",
            "A friend had this happen with microsoft.",
            "Really? Amazon did that? To me their interview process is the best I had attended to. They provided me time slots, interviewer details, and also links to prepare for the interview.",
            "Country?",
            "2 weeks ago I filled in my interview availability, they said \"none of those spots are available\" and told me to send them my availability for the next two weeks. I sent them my availability and they interviewed me. Not sure why your case is different.",
            "Lol i got the invitation last friday and half of the dates available already passed. The other half are for this week, i filled out as much as i could and still havent heard back.\n\nNice job jeff",
            "amazon is so stereotypical-cs major at this point. so many people do the sde internship it’s driving me insane now",
            "It all evens out in the end. Those of us with years of experience, can't stop Amazon recruiters from bombarding us with offers for interviews."
        ]
    },
    {
        "post_id": "1astv12",
        "author": "Live-Character-5272",
        "title": "Should i change my major?",
        "url": "https://i.redd.it/jimlxgh9v2jc1.jpeg",
        "score": 431,
        "num_comments": 90,
        "created_utc": 1708146071.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1astv12/should_i_change_my_major/",
        "comments": [
            "director and managerial peeps are competing for entry level now? lol",
            "If you like computer science/programming then no. If you’re only doing it to get easy six figures then yes.",
            "Yes.",
            "Why does everyone keep asking this as if we know your personal situation and mindset",
            "Engtal has been posting shit nonstop for months. gotta be bullshit",
            "Show us the location of the applicants",
            "I feel like remote jobs of course are going to have more applicants.. anyone could look up remote SWE jobs and just apply",
            "Full remote entry-level position with a 180k base salary/year, of course everyone is going to apply.",
            "isn't it the case o nlinkedin just clicking to see the job counts as an \"application\"",
            "Yes.  More room for my ego",
            "Yes.\nIf this is enough to make you reconsider your major, then honestly you should get out.",
            "LinkedIn cannot track external websites. The applicant #s are just counting the # of people who clicked the apply button.",
            "they’re mostly  indians or peope just spamming any remote job",
            "Yes",
            "Yes change your major",
            "Yes",
            "Probably because it’s remote",
            "Bruh thats a contracting agency",
            "yes you should",
            "God I keep seeing this crap. I don’t know why people are worrying about this. Computer science is such a broad field, and you go to the thing that everyone is trying to do.\n\nIdk what year you’re in, but I found that in my first semester back in the fall, I found my passion. That’s something I feel that hurts a lot of people coming into CS. They don’t know what to do. I’ve seen a few people who were in CS who didn’t care. Where are they now? Out of college, or becoming an English major at a community college.\n\nAll I’m saying is, find what you’re interested in quick, and make yourself a hot commodity.",
            "Yes",
            "lol, generation z is fucked all way the down",
            "its a remote job u bum of course there are a billion applicants (most of whom are Indians)",
            "You have a masters degree. It’s too late",
            "It’s fucked beyond repair",
            "465 applicants with the senior level applies to the entry-level software developer position?\n\n19 director-level applications? \n\nAm I only reading it?",
            "Imagine competing with senior level engineers who are okay with being paid less because they’re probably more financially stable to take that risk. Imagine competing with someone with a master’s. 😨😰",
            "Unless you want to get a phd, stay with cs. I make more than anyone I know that doesn’t have a phd",
            "Change your approach",
            "No",
            "No. Like please just stay. Don't saturate other majors bruh.",
            "Guess I shouldn't use linkedin.. noted, and here I thought competing against 50 was bad enough.",
            "3 years too late.",
            "Yea",
            "So happy I’m in MIS",
            "Easy apply",
            "You should remove remote"
        ]
    },
    {
        "post_id": "141mcee",
        "author": "Distinct-Meringue561",
        "title": "Google opened applications!",
        "url": "https://www.reddit.com/r/csMajors/comments/141mcee/google_opened_applications/",
        "score": 430,
        "num_comments": 193,
        "created_utc": 1685987198.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/141mcee/google_opened_applications/",
        "comments": [
            "Me after submitting my resume with 0 internships and 2 Mediocre project: 🥱\nSee ya in Cali",
            "anyone know if new grad is posted?",
            "no way its due in a week😭😭😭",
            "Has Google opened and closed intern apps multiple times in the past? Will it be open again sometime later based on previous years?",
            "Better start leetcoding tomorrow to prep for this",
            "The posted the application this early lol? And it’s due June 12th 🤯",
            "Did anyone get the OA after applying ? Or only people that got contacted by recruiters",
            "why tf does it close so early ??!?",
            "Link for anyone interested [Software Engineering Intern, BS, Summer 2024 ](https://careers.google.com/jobs/results/73287692785197766-software-engineering-intern-bs-summer-2024/?company=Fitbit&company=GFiber&company=Google&company=YouTube&distance=50&employment_type=INTERN&jex=ENTRY_LEVEL&location=United%20States&q=Software%20Engineer&src=Online%2FGoogle%20Website%2FByF&utm_campaign=ByF%20SWE%20intern&utm_medium=careers_site%20&utm_source=Online%20)\n\nAlso posted on [AlanChen4/Summer-2024-SWE-Internships](https://github.com/AlanChen4/Summer-2024-SWE-Internships/tree/main) :)",
            "[deleted]",
            "delete this rn so less people know smh /s",
            "Well looks like its time to hop back on the LC grind 😔",
            "They close June 12th???",
            "Does anyone know when the Apm internship opens?",
            "It says you must be in the penultimate year of your degree. I'm gonna be a sophomore next year but might as well apply right?",
            "If it closes so soon, what are people saying about current summer internships? Just a line that says “current/incoming intern at [company]”? I just started onboarding and don’t know my project, but also don’t want to wait for a second round later in the year",
            "Wtf already I haven’t even started my internship for this summer yet",
            "Just to confirm, this is fully in-person with no option for remote, right?",
            "So if we apply to this can we apply again later this year? Also isn't this super early?",
            "Does anyone know when STEP opens?",
            "This lines up with what I heard. Hiring is paused for 6 mo after layoffs. Their last layoff was January 20 and it's been almost 6 months since then.",
            "When do early career / new grad role open up? I could’ve sworn I saw it",
            "Holy Hell!",
            "Will u be able to apply fall24 or anyother internships/jobs from google incase u dont get summer 24 internship? Is there any number of attempts limit?",
            "Applied. Does anyone know when New Grad applications open?",
            "If I'm a senior that's going to graduate in 3 weeks can I still apply lol. I'm still currently pursuing a degree",
            "Should I include a cover letter for this?\n\nEdit: also I put yes for having experience in 2 languages but I only have experience in 1 right now. Could I just learn a little bit of a second language and call it good? I think I'm expecting to know another language before next summer but I put down 'yes' for a better looking application.\n\nEdit 2: also does me pursuing my Bachelor's but pursuing my associates first still count as me pursuing my bachelors? I have not gotten my associates yet but I'm going to be pursuing my bachelors if I'm not already pursuing it right now.\n\nIf anyone can help me it would be very much appreciated.",
            "It's for Bachelor only.",
            "Just after they laid off a shot load of people. Hmmm",
            "Is it worth applying as a rising junior? (graduating 2025) (I'm honestly nervous if they won't consider my app based on graduation date, by September I should be a junior but idk)",
            "!RemindMe 3 days",
            "Can europe students apply too ?",
            "Can a current high school senior apply for this lol",
            "Should I apply now or do applications open later? I'm an incoming freshman rn",
            "I don’t see anything on the website. Can you share the application link?",
            "I forgot to attach a transcript for one of the roles :(\n\nIs it a required part of the application like can my app still be considered lol",
            "Did anyone get the OA?",
            "!RemindMe 3 days",
            "Me fr",
            "!RemindMe 3 days",
            "stupid question -- for the education part of the application, should i include the university i transferred from, and the transcript from there?",
            "Does this mean the market's finally gonna open again for Juniors?!?!?!",
            "Apps for what?",
            "anyone else getting a CORS error when trying to upload their resume 🤔",
            "!RemindMe 2 days",
            "!RemindMe 3 days",
            "For MS, I haven’t even start school yet. Anyone know what to submit for transcript?",
            "Just for new grads?",
            "Can I apply again in September if I apply now (with a slightly worse resume than what it would be in September)?",
            "🙏",
            "Should I apply to this as a sophomore? Or only STEP?",
            "Is it worth applying if I still have surface level skills and my current resume is getting me rejected everywhere?",
            "Can I apply to both this and STEP?",
            "Would it be worth it to apply now with an ok resume and then reapply with it opens up (it probably will right?) with a better resume and more personal projects? Or should I just wait till it opens up later and apply when I actually have a better resume?",
            "Does anyone see a job id? How can you even ask someone to refer you without the id?",
            "Does the location you select in the application matter? Are some locations more competitive than others? Just curious",
            "but i thought they already picked vince vaughn and owen wilson",
            "layoff enrolment you mean?",
            "what do we say for our experience section for our current internships this summer???",
            "\"ability to speak and write fluently in English\", I meet a qualification they might as well just hire me now",
            "Does anyone know when new grad opens?",
            "Internship or SWE?",
            "Did anyone hear back or get contacted by recruiter for Fall internship, MS?",
            "where is the link…",
            "that’s early 😅 haven’t even gotten the chance to LC or work on my personal projects yet",
            "anyone have a link on where to apply?",
            "is this for intern?",
            "sorry if this is a stupid question but what is this for (what role)?",
            "Is the market healing?",
            "Been seeing a lot of SDE3 openings in Google lately.",
            "Been seeing a lot of SDE3 openings in Google lately.",
            "[deleted]",
            "How can you even edit your resume to list previous (only 1) intern experience? My current intern started on June 1st and I am literally starting the first week. \n\n  \nAlso I planned to develop a website side project (tweaked from Educative projects with some custom data backed in mongodb) until the end of June but now it seems like I cannot catch it up X\\_X too early",
            " !RemindMe 3 days",
            "Are apps open for new grad or entry level",
            "Did it close? I thought I had until end of day but I can’t find the opening anymore."
        ]
    },
    {
        "post_id": "11y5rxy",
        "author": "dihydrogen9monoxide",
        "title": "I just spent 45 minutes debugging, to find I used > instead of >=.",
        "url": "https://www.reddit.com/r/csMajors/comments/11y5rxy/i_just_spent_45_minutes_debugging_to_find_i_used/",
        "score": 433,
        "num_comments": 84,
        "created_utc": 1679456608.0,
        "selftext": "grrrrrrrrrrrrrrrrrrr",
        "permalink": "/r/csMajors/comments/11y5rxy/i_just_spent_45_minutes_debugging_to_find_i_used/",
        "comments": [
            "[deleted]",
            "Don't worry, it gets worse.",
            "I'm 10 years into my career and still do this shit. One good reason to make sure you write unit tests ;-)",
            "I went on browsing for an error in the code that didn't exist.. i had the file name wrong🥲",
            "Cache invalidation, naming things... and off by one errors.",
            "Holy fuck all of these things and similar are really infuriating to me. is that normal? Like I know everyone will be annoying if you realized that the \"bug\" was a stupid careless human error but I feel so angry that it has wasted my time, I want to slit the computer in half and smash my desk",
            "i’ve spent 6 hours debugging realizing i was compiling the wrong file the whole time",
            "45 min? Impressive. Literally.",
            "My favorites are when you mix equality and assignment between different languages cause you're jumping around so much just to find that your code isn't testing for your base case but assigning to it and that's why your loop/condition is being squirrelly.",
            "As a CS major of 25+ years, let me give you a really good tip. \n\nPick a Style and stick to it, you either use > or >= but not both.",
            "Skill issue",
            "45 minutes? Seriously that's not long. Shit Happens.",
            "I spent 25 min yesterday debugging when I realized I did: ‘ ‘ instead of ‘  ‘",
            "I failed an OA coz I had camel cased instead of snake case, even tho my solution was right…",
            "grrrrr indeed",
            "Part of why TDD is so good.",
            "write better unit tests",
            "Learn to use a debugger bruv",
            "ChatGPT would have caught that",
            "use test cases next time dumbass",
            "aka monday morning",
            "This will happen to you more times in your career than you'll care to admit.\n\n\nSource: my dumbass that did it twice last week",
            "Typos are annoying but on the plus side they are the easiest to fix!",
            "One way to never repeat the error is to always use >=. /s",
            "I did the same thing only to find I used a = instead of a == once in ~600 lines of code.",
            "Been there done that more times than id like to admit 🤣",
            "Welcome to the club buddy!",
            "You think that’s bad, wait till you start working with configs and realize a missing value in one part of someone else config that you inherited from caused your program to work without crashing but produce garbage output",
            "be like that fr",
            "Coding made me realize I really don’t know how to spell😭😭",
            "Off-by-one bound/indexing error? Numerical comparison in a computation? Curious....",
            "Only 45m...?",
            "Sounds like you're very productive. Call it a day honestly",
            "Gotta love those bugs. I one time spent a week debugging a = that should have been an ==. I missed it, my friends missed it, even the professor missed it.",
            "Only 45? Wait till you get into industry and spend 20 hrs chasing a bug because an int is not a float",
            "This is the real job right here. Lol. The little things. The simple things. If I had a penny...",
            "First time? Welcome brother.\n\nIt doesn’t get better, you just get used to it.",
            "It’s a right of passage, welcome 🙏",
            "Only 45 minutes?",
            "wait until u use = instead of ==",
            "Welcome to the club.\n\nI’m a Sr Developer/tech lead and spent half a day trying to figure out why a new application wasn’t getting the correct secret value. Well the file where I had copied the secret and environment variable name from had a typo. I spent several hours because I copied something from a .env file in another project that had a typo. Shit happens.",
            "Grrrr 😠",
            "I was working on a data structure project and my code key producing core dumb. I spent the entire day debugging and went to tutor hours. They pointed out that I had a missing semi colon (java).",
            "The worst bug I’ve ever experienced was when I copied a line of code from my professors slides, spent 6 hours trying to figure it out only to realize that since the font was different, when I did a string compare, it always evaluated to false since the font was different.",
            "That's what we have QA for, right, right? :D",
            "Just found a bug today where I ended a statement in python with a ,",
            "First time?",
            "i think one of the things that have helped me most with feeling imposter syndrome is that i'm an intern with a nasa contractor and me and my mentor had a mental breakdown for upwards of an hour and a half over why our stuff wasn't working until we realized we didn't have BEGIN and END in our stored procedure lmaooo. it's nice to know that even the real nasa guys are out here making dumb mistakes",
            "Not too bad",
            "Use a debugger tool. It would have taken less time to catch this error.",
            "I spent 4 hours debugging a process that uses someone else's script calls. Turns out the arguments to the scripts (host names) must be passed in lower case or the script fails silently.",
            "I spent over a hour going over every damn character in a project until I noticed something off. I had a lot of pieces that had the red squiggly lines under them (idk what it's called) but there was 1 that had a blue line under it. I deleted that small part, typed it out again the exact same but now with a red line and it worked.\n\nI fucking screamed",
            "Consider pasting your code into ChatGPT and asking it to find potential human errors. This could potentially save you a lot of time and certainly has helped me find errors. These kinds of problems really are frustrating, but that's just how it is sometimes. Keep powering on though!",
            "Had a bug today in someone else’s code. It was trying to use buttomVisibility instead of buttonVisibility. Obviously, that was a conditional render and was easy to spot but oh boy it could have been so bad"
        ]
    },
    {
        "post_id": "mqxg3o",
        "author": "None",
        "title": "Finally got an Internship",
        "url": "https://www.reddit.com/r/csMajors/comments/mqxg3o/finally_got_an_internship/",
        "score": 433,
        "num_comments": 55,
        "created_utc": 1618426880.0,
        "selftext": "Took over 80 applications with 20+ interviews and finally one job offer.\n\nThe pay isn't the best at $10.50/hr (less than my job at Chipotle with $13.50/hr), BUT it's at a growing company starting to reach an international market that's just starting to get out of the startup phase (5 years old). And I'll definitely be making quite a few contacts there in addition to the job experience.\n\nNever give up guys, this was one of the last five jobs I was going to apply for.",
        "permalink": "/r/csMajors/comments/mqxg3o/finally_got_an_internship/",
        "comments": [
            "Congrats!  Don't worry about the pay for your first internship, it will adjust accordingly.  I had a similar path - my progression was:\n\n1) Factory non-tech summer job - $15/hr\n\n2) First internship - $11/hr - midwest\n\n3) Second internship - $26/hr - midwest\n\n4) New grad job - $155k/yr - seattle\n\n&#x200B;\n\nHope this internship goes well and you learn a lot!",
            "nice, that response rate is pretty insane lol",
            "my first internship was -unpaid- since I had a 2.0 gpa and graduated with no internships since I was a depressed, unmotivated, slacker.\n\nI now make 450k.\n\nit doesn’t matter where you start as long as you start, and it doesn’t matter where you are as long as you keep moving\n\nCongrats and keep up the good work, the sky is the limit!",
            "Way to go!  It's posts like these that are keeping me going in my internship search.  I've been fortunate enough to have several interviews the past few weeks.  Just hoping to finally get that one 'yes'",
            "The best part is the your next job won't know what your previous job paid unless you tell them. Congrats!",
            "my first internship was $10/hr! now I'm getting several times that. I bet you'll get some incredible experience. Congrats!",
            "That's awesome! Don't get discouraged about the pay especially if it's your first internship. Just do your best and enjoy the process. Hopefully, it'll be easier to find another one next year with the experience!",
            "The pay might suck but is all about learning and adding experience to your resume which will put you ahead once you graduate in the job market. Congrats",
            "Money's the last thing to think about as an intern tbh... Learn and contribute as much as possible. \n\nCongratulations!!!",
            "Excellent! The main thing is  you'll be learning, and getting a resume builder this summer.\n\nCongrats!",
            "Better than nothing and you still get experience. Good job.",
            "Are you a college student or high school? I’m not asking to make you feel good or bad I’m just curious? \n\nI got an internship at an established company and people were saying my pay was low for industry but seeing this maybe not. I would’ve thought even start ups pay nicer.",
            "Congrats man these companies know we are desperate so underpay us",
            " Congrats"
        ]
    },
    {
        "post_id": "ky6kdi",
        "author": "awesomega14",
        "title": "Is there a CS career sub for people who aren't necessarily interested in Big-N/FAANG?",
        "url": "https://www.reddit.com/r/csMajors/comments/ky6kdi/is_there_a_cs_career_sub_for_people_who_arent/",
        "score": 436,
        "num_comments": 133,
        "created_utc": 1610752807.0,
        "selftext": "I feel like 90% of the posts on these subs are about companies like Apple, Microsoft, Boeing, Netflix, etc. but there aren't a whole lot of posts for normal students that are just trying to get their foot in the door of this industry and aren't necessarily capable or interested in these high-prestige jobs. Is there a sub for CS students who are just trying to get any kind of job (unpaid, minimum wage, whatever) rather than the most prestigious and high-paying jobs possible?",
        "permalink": "/r/csMajors/comments/ky6kdi/is_there_a_cs_career_sub_for_people_who_arent/",
        "comments": [
            "If anyone wants to attempt something like this (r/cspovertymajors? idk), I'm fine partnering up in terms of sidebar links and an announcement, even if I think the idea is mildly doomed, or at least much harder to execute than it may initially sound.",
            "This sub isn’t very good for anyones mental health.",
            "This sub makes me sad. But idk why I keep coming back to it",
            "I thought I signed up for a sub full of CompSci nuts who love algorithms and code but instead I got LinkedIn :)",
            ">Boeing \n\nthat's a normal company and not bigN lol",
            "Yea, the \"FAANG or bust\" crowd can be maddening at times.  I worked at one, from my experience it's not that it's all cracked up to be, unless you like being a tiny, easily replaceable cog in a big machine.",
            "Alright create r/CsMajorsNormal already",
            "I just wanna make video games man",
            "I always see these posts on the top of r/cscareerquestions lmao. I swear the anti-FAANG circlejerk is just as big as the FAANG one 🤷‍♀️ No one's stopping anyone from posting questions that aren't about FAANG",
            "Working at FAANG would be cool, but I am not willing to put in the immense amount of work. I would be equally satisfied working elsewhere, to be honest.",
            "[deleted]",
            "I feel ya, it's hard enough breaking in and I don't think I could deal with the FAANG crowd. I work at a small startup, make decent money, I'm happy enough with that. Lots of flexibility",
            "This sub makes me feel dumb",
            "Lol I kinda like this sub. At least a place to talk about internships. r/CS career questions is pretty much all people who are trying to switch careers to cs",
            "My dream companies are Microsoft (solely because I think their non-software products are underrated and I like their logo and employees enjoy working there), Stryker, and Johnson&Johnson. Medical device is underrated.",
            "This sub is infected like Blind. You have that mentality of faamg worship for too long, and you will lose a lot more than money.\n\nr/jobs is more realistic. r/usaJobs is good too if you’re interested in a fed job, which is also a good path by the way. Government jobs are very nice. Some of them are so good that it literally does not feel like you’re working, like collecting free money and reputation.",
            "r/learnprogramming or maybe even r/college\n\nI’m sure there’s plenty of CS kids in both who are interested in learning. I’ve said this before here and I’ll say it again - but this sub is essentially r/CSProdigiesGetInternships. The majority of people here attend top school. There’s nothing wrong with the CS grind and I really admire it. But if you’ve come here to ask normal CS questions, this is not the place. Very rarely will find those gem posts here but literally every post here is about an OA or specific internship questions.",
            "r/learnprogramming is pretty friendly",
            "I'm in the camp where I don't give a rat's a\\*\\* about Big-N/FAANG or getting a job at Tesla cause I hate Elon Musk and his company practices as an example.\n\nThis sub is hyping a career that is essentially an office job where you can use a computer in some advanced terms and that's how I see it. You're not really in a career where you are doing actual good for the public like a firefighter, teacher, or nurse; you're in it for the money, thus why people mention Big-N/FAANG so much: it's money.\n\nHell, I'm in it for the money too, but I'm not gonna throw my resume at those companies cause I have ethics and morals. If I can get a government job that my skills are needed for, I'll be over the content hills. I don't care much about getting a 6-figure job right out of the gate or willing to move (I'm located in the Bay Area, so I'm good), I'm just here for the advice, stories, and free snacks.",
            "Lol please I want this sub to chase faangs, so I can chase sports teams, gives me less competition for the places I REALLY want to work.",
            "r/cscareerquestions",
            "I started writing a big thing but I deleted it. I just want to let you know there’s a shit load of six figure jobs that have nothing to do with Facebook or Google. The more I read about FAANG jobs the more I feel like they probably suck. It took a while but I do great. You’re not going to be the genius at google. You think they make the guy who came up with nosql jump through hoops? How many coding tests do you think that guy did. Lol.",
            "OP, you really need to stop making the same kind of posts over and over again and go on a self deprecating path.\n\nThere is light at the end of the tunnel.  Please seek some help to address all of the anger and frustration.",
            "This sub is sad but when you look at [levels.fyi](https://levels.fyi) you get instant motivation.",
            "I don’t know of a subreddit, but let me tell you, most of the careers are NOT at those companies, and it doesn’t mean it’s a crappy job.\n\nI got a degree from a school most people haven’t heard of, got a job a year before graduating college (in 1992) working building code on products for a company that sold multimedia presentation software.  I moved to a small (< 50) person company that wrote software for the U.S. State department.  I wrote code that tracked the removal of landmines from Bosnia, a system that tracked export control so Poland could join NATO, helped run an export control conference for 10 years in Oxford, England for former Soviet Union countries who used my software to control their borders, traveled to more countries than I can remember, met the President of Estonia, walked the Great Wall, spoke on a software engineering conference tour for more than a decade, ran a software engineering conference for several years, was an editor for O’Reilly, and have made great money doing all of those things.  On the East Coast, living in a comfortable suburb in Northern Virginia where housing is affordable (well, compared to Silicon Valley).",
            "I mean what would you talk about? \"Any advice for interviewing at this 50 person company none of you have ever heard of\"? \"Here's how I got a job in IT at the company my mom works for\"?\n\nThere's not much to say that's specific to unknown companies. As a student the prep work is the same. Most people aim high and wind up settling.",
            "do you work at Boeing? lol",
            "Ngl, cscareerquestions is kinda full of shit. Lately I've read a post by a freshman trying to get a dev internship and these faang sexuals are telling him how he's practically useless without knowledge of ds. I'm like what? This guy got no work experience, if he can't get into a faang company then, any company will be better than not working at all. Folks were telling this guy to take the summer off and shit. I'm like bruh. I work at NYC and there are tons of internships that dont require ds. In fact, my first internship in 2017 was one that did not required ds. They just taught me as I went and I was actively learning through youtube, udemy and books.",
            "Lmao leetcode or gtfo noob",
            "r/cscarrerquestions",
            "It’s still this one. It’s kind of hard to ask advice for a small workplace, so I imagine many posts are about big companies. There are many of us who don’t need a Big N job and would be fine working anywhere.",
            "/r/csCareerQuestionsEU, only if you're European tho"
        ]
    },
    {
        "post_id": "xp1y31",
        "author": "None",
        "title": "After getting my first dev job, I now completely agree that grinding leetcode is absolutely meaningless and all OAs should be removed from the job hunting process.",
        "url": "https://www.reddit.com/r/csMajors/comments/xp1y31/after_getting_my_first_dev_job_i_now_completely/",
        "score": 436,
        "num_comments": 152,
        "created_utc": 1664240842.0,
        "selftext": "I'm still going through grind 75 in my free time just because I want to have that completed and under my belt. And I do believe that knowing data structures and algorithms is useful. With that being said, I haven't performed any search, binary tree, list, or DP algorithms since I've been working. It's so dumb and it should not be used as a metric in deciding if someone can be an effective software engineer or not. Personal projects and the ability to verbally explain the work they've done should be used rather than doing a binary search on a string.",
        "permalink": "/r/csMajors/comments/xp1y31/after_getting_my_first_dev_job_i_now_completely/",
        "comments": [
            "Congrats! You won't be using any of that knowledge for the rest of your career either (unless you apply at another FAANG/FAANG-wannabe).\n\nLeetcode is crossword puzzles for SWEs and should be treated as such.",
            "I think OAs are okay because it levels the playing field + shows work ethic. \n\nAnyone willing to grind out and study data structures solely for the basis of getting job shows some serious commitment. Even if it's a bit wasted effort, it's a easy baseline to show someone's work ethic and prove they aren't lazy.\n\nBut more importantly it evens the playing field. I don't have any connections. First gen college student in entire extended family. I dont go to a top CS college. I'm not particularly outgoing or extroverted. All these factors work against me and really are out of my control.\n\nWhat do I have? The ability to put effort into studying data structures, and a fair even playing ground where I can be objectively compared against other candidates based on coding test scores.\n\nConnections only go so far until you can't pass a coding test. Naturally good at talking only goes so far until you can't pass a test. I think OAs prevent bias in initial screening and make the playing field fairer. \n\nSomeone coming from educated successful family who goes to top 10 school with tons of charisma will forever look better than me on paper. I can't compete with that. But giving a prereq coding test and deciding who to move to the next rounds based on that? Thats fair. The amount of effort you put into studying and prepping is a variable that you can control, making it a fair place to judge from.",
            "any idiot can rehearse talking about their projects  though lol, real or otherwise",
            "You forget the main idea that 100s of thousands of people apply to a single swe position. Now of that 100,000 ppl, 30000 pass the resume screen and 15000 can easily watch some YouTube video and start some API implementation/debugging through a interview or HackerRank, but only 5000 or less of those applicants actually have the logical and implementation skills to do a LC medium. A large purpose of LC is a filtering technique. Anybody can lie about projects pretty easily",
            "It proves they’re a competent coder though. Which for most companies is a baseline requirement for a swe no ? So maybe should be weighted differently but has to have a place in recruitment imo.",
            "“I don’t use binary trees” != “DSA questions are not correlated with job performance”",
            "Agreed. Maybe not useless, cause it can provide a good foundation on recognizing efficient code, but that'll come with good work experience. Grinding leetcode is just memorizing patterns and algorithms, anyone can do it if you keep practicing.\n\nIn the real world, knowing proper systems design, coding design patterns, knowing how and when to google for answers is way more realistic. When or if you ever actually reach the point where you need to code something that requires heavy algorithms that for whatever reason isn't already implemented in a library for easy use, you'll be able to google for the most efficient algorithm for your use case anyway.",
            "Dude we all know it’s an intelligence (IQ) test. You’re not the first to discover that LC problems have zero application in real life. And to a large extent they do measure intelligence, problem solving ability, and show case your way of thinking.",
            "Sweet.\n\nDo you have an efficient way to comb through thousands, if not more applications to reduce them to an amount where it's cost effective (or even makes sense) to start giving them more attention with actual human hours?\n\nNo?\n\nNice, so it's the same post repeated all over again.\n\nIt's not the best system, no. But it's the best they have at scale. Sure, you'll cut off a good number of qualified candidates, but at the same time, you'll get a lot more through to the next round.\n\nAutomated OA's are kind of a solution at scale-- if you're a small company or a company not getting a large amount of apps, yeah, don't do this. If you're getting tens of thousands-- you've got a lot more to gain than lose.\n\nSure, it sucks for the applicants. But it's not for the applicants' benefit-- it's for the company's.",
            "I disagree with this. In order to solve a leetcode problem during a job interview you need at least to think and create something useful and efficient that solves the problem which a lot of people don't want to do and this serves as the first filter to know you and see if you can perform well as a software engineer.\n\nSomething completely different is people not wanting to study or grind leetcode if they are not good enough at it. Despite the technical interview there are a lot of things going on during the time the interviwer is asking you about your experience. Don't think this only the leetcode problem.  \n\n\nI keep making this analogy with mathematics. Probably an engineer does not need the hard math that is taught at university level and you won't use it if you're not getting into academy (masters or PhD) but what you do need is to think in an abstract way, come out with a feasible solution to a problem and provide proofs, that reasoning is what math can teach you.",
            "Leetcode is purely there so that the process can be automated. It is not about whether or not it will cover a part of your actual career - it won't. Anyone who actually writes their own sort implementation (for example) as part of work should have their head examined.",
            "Most tests are really easy though. It’s just there to prove you’re a competent coder that can work under pressure.",
            "Yeah but you could essentially say that about a degree aswell. Doesn't teach you any tangible skills for the workforce. More of proving that you have the confidence/discipline to complete it and can do so in a competitive market. Sure it gives you a good introduction to the industry and gives you a head start, but more of proving to the employee that your atleast competent.\n\nRemember you don't just get tested on your leet code skills. Alot of it has to do with personality and how you present yourself. The practical programming are to just tick one box of many.",
            "Any high paying companies that won't ask LC ?",
            "This is universal truth and everyone knows that this is the only in way if you want to get into FAANG Companies.\n\nCompanies are also doing very little to change this long hiring process.",
            "No one's talking about code optimization code which is required in the SE role. Practicing leetcode and DSA is the only way I see to write optimised code. 🤷‍♂️",
            "I agree there is a company called byteboard that the assignments are to read project proposal and give inputs on it. Second part is to implement the functions of the project proposal",
            "100% agree.\n\nI spent my entire summer building a fullstack social media application in mern stack all by myself.\n\nI learnt unit testing, api desing, api gateway, backedn and frontend only to get asked leetcode questions during my placement.",
            "Word bro",
            "I did about 3 leetcode problems before I called BS. I've got better shit to do",
            "Glad this random entry level SWE has debunked a billion dollar industry of technical recruiting. I’m sure all the FAANG companies will read your Reddit post and completely shift strategies!",
            "[deleted]",
            "I’m sure those who holds a computer science degree should be exempt from doing coding questions. They didn’t go to college 4 years without learning about coding and the technical aspect of software development. \n\nThe only people who needs to grind coding are those without a degree and experience.",
            ">\"Personal projects and the ability to verbally explain the work they've done\"\n\nThis is the way",
            "It’s to filter out dummies who just google solutions .",
            "I mean leetcode style questions might not be useful for you, but consider the companies perspective. These types of questions are a quick and easy format that can be used to test new potential employees. The interviewers save a ton of time using these types of questions, and that can't be ignored. They may not be the best way to judge somebody's actual skill as a SWE, but it is good enough for their purposes. If you can show up, solve a few mediums, and have decent enough code while doing so then that still says something.\n\nIt's really hard to evaluate a large number of people quickly and thoroughly. That is why schools almost always have a curriculum and use tests for evaluation. These companies could waste tons of money testing everybody thoroughly and the benefits might not even be worth it.",
            "The only place that I applied to that didn't ask traditional leetocde type questions was mcKinsey. I just did their hackerrank OA yesterday. 5 questions. They were about making sql queries, a simple web page and express calls.",
            "Isn't it because its easier to evaluate and filter based leetcode than personal projects? My guess is that the probability that a new hire that leetcode is a better engineer than one who doesn't is somewhat significative (for some unknown reason). These big tech companies spend a lot of money on the interviews,  so that's why I guess their data must show some correlation. \n\nAlso, in my first dev job I used a sliding window approach to improve some query times. Then I did an internship where I used basic linear algebra base transformation to reuse some already implemented functions (I worked with some graphic stuff). My feeling is that those things are not frequent, but they do appear sometimes. But you are going to see it only if you already know that type of stuff. I'm not claiming that it is very useful, it's just that it is not useless.",
            "I think the minimum requirement for most of the jobs, especially those from the big tech, is a computer science degree.\n\nIf data structures and algorithms are fundamental cs concepts, then anyone who holds a cs degree should have studied them and these concepts are expected to be on their finger tips by the time they thought of joining one of the big techs because only a proof of that can show you read cs and actually understand these concepts, and one of the platforms to help you prepare for this challenge is Leetcode.",
            "Personally I think the main value in Leetcode is less about the algorithmic understanding and more about the ability to identify schemas in high level problem descriptions. I can implement any data structure you ask me to, but the ability to identify which one I need out of a newly worded context stumps me way more than it should. \n\nIt's helps you weed out people who can solve a math problem on a piece of paper from people who can come up with a solution based on abstract factors in the real world. In real life, that solution usually ends up being very specific and non-algorithmically intensive but I think people underestimate how impressive being able to tell what leetcode \"template\" they're looking at in a stressful interview setting is.",
            "No i disagree software engineering is saturated with boot camp grads and even people with degree who don’t necessarily have the skill to be in the field the tests help filter out some of the people who have no skill . True sometimes they are too hard i myself struggle with some of these assessments during my current senior year application process but the grinding makes us better",
            "Well, complaining about it isn’t getting you anywhere, is it?"
        ]
    },
    {
        "post_id": "j40lqz",
        "author": "danielr088",
        "title": "Got accepted into a Google mentorship!",
        "url": "https://www.reddit.com/r/csMajors/comments/j40lqz/got_accepted_into_a_google_mentorship/",
        "score": 432,
        "num_comments": 25,
        "created_utc": 1601665001.0,
        "selftext": "This might not sound like much and it’s not an internship or anything but I got accepted into a Google Mentorship and Development program that my school (mind you, a community college) has partnered up with Google to do. I’ve been wanting a mentor for a little while for some sort of guidance because I’ve been feeling a bit lost. So I guess this should be interesting and helpful. I‘ve been feeling pretty down this week and this actually made me really happy. Just wanted to share!",
        "permalink": "/r/csMajors/comments/j40lqz/got_accepted_into_a_google_mentorship/",
        "comments": [
            "This is extremely valuable. Maybe they can later give you a referral :)",
            "Nice work! Great to see community colleges offering good resources",
            "Congrats!",
            "I did something similar and it kickstarted my career. Take full advantage of all the networking and make sure to start grinding leetcode bc this will help you get interviews with top companies if you play it right.",
            "congratulations!! no achievement is too small! REMEMBER THAT!",
            "I dont understand,  what is this google mentorship?",
            "YES SIRRRR!!! Only going up from here man rock on",
            "Congratulations!!! You’re going to do AMAZING",
            "hell yeah!!!",
            "Way to go! Best of luck!",
            "Good for you,buddy:D",
            "That's awesome!!!Congrats",
            "Congrats, it's great man , Have a good time there",
            "Congrats bro! Definitely something to be proud of. Go get them!",
            "That's amazing, congratulations! I hope you learn tonnes from it! 😊😊😊",
            "That’s awesome!! Congrats!!",
            "Don't downplay your accomplishments, that's amazing! Congrats!",
            "Congrats! :)",
            "Heyyy I just got my acceptance letter yesterday as well! Congratulations! I cant wait to see what kind of training they have in store for us...",
            "So happy for you!!",
            "Congrats!! It's super important to celebrate wins! Hopefully you get some good advice out of the experience!",
            "Congratulations!!! I hope that you would have a great experience from this program. Did you have any interviews with Google after submitting application for this mentorship program?"
        ]
    }
]