[
    {
        "post_id": "15sftis",
        "author": "NourDaas",
        "title": "Diversity Hiring Myth - How it’s really done",
        "url": "https://www.reddit.com/r/csMajors/comments/15sftis/diversity_hiring_myth_how_its_really_done/",
        "score": 428,
        "num_comments": 357,
        "created_utc": 1692161425.0,
        "selftext": "\nI’d like to start by clarifying that I am not a recruiter myself, but I have a relative who works as one. He is involved in recruiting Software Engineering positions at a Fortune 500 Company that places a strong emphasis on diversity.\n\nI talked to him about their approach to “Diversity Hires,” . Their actual strategies are much more complex:\n\n\t1.\tUniform Bar for Interviewees: All candidates who make it to the interview stage are held to the same standards. Only if two candidates are at the same performance level will the company choose the one who belongs to an underrepresented group (e.g., women).\n\n\t2.\tExpanding the Underrepresented Pool: The company actively works to increase the pool of underrepresented candidates. This is achieved through various methods:\n\n\t•\tTargeted Outreach: They reach out to specific conferences, clubs, and groups where underrepresented individuals may participate.\n\t•\tStrategic Selection: When faced with a large applicant pool (e.g., 1000 applicants), but only able to interview a fraction (e.g., 200), they ensure that the selected pool is diverse by implementing quotas (on the pool) not on those who get hired. (Big Difference)\n\n\t3.\tInternship and Early Career: For individuals at the internship and early career stages, the company does enforce %20 quota. This is specifically applicable to summer term internships and is intended to help those still in the learning phase. At this stage merit will be created. So if more underrepresented people are given a chance here, in the future it will create a more diverse pool of potential employees who meet the hiring bar. This does not mean they pick underrepresented people simply for being underrepresented. But what happens is they have 1000s of qualified applicants. They will choose a diverse set of these applicants.\n\nI will give you a case study so you can understand my point better:\n\nImagine there are 1000 applicants for an internship (on average it requires you to be a 3rd year student with experience in two programming languages)\n\nMany of these applicants will meet the criteria. Let’s say 300 people meet it. Out of those people, recruiters will then select a diverse set.\n\nThis means all selected people have met the requirements.\n\n\nAs a woman, it hurts when I got told I achieved what I did because I am a “diversity hire”. Since I did an interview like any else and was able to solve the hard questions that got thru at me. I studied hard, gridded leetcode. Applied early, practiced for interviews a lot. \n\nYou should stop blaming others for your own failures, instead, try to work on your self and have accountability. Just my 2 cents and a rant on being called a “diversity hire”.",
        "permalink": "/r/csMajors/comments/15sftis/diversity_hiring_myth_how_its_really_done/",
        "comments": [
            "i dont think this sub will understand or care enough. the entry lvl grind has become so tough i think people are looking at something/someone to blame it on now",
            ">Only if two candidates are at the same performance level will the company choose the one who belongs to an underrepresented group (e.g., women)\n\nehh",
            "I’m sorry, but pretty much everything your relative said confirmed the “myths”",
            ">You should stop blaming others for your own failures, instead, try to work on your self and have accountability. Just my 2 cents and a rant on being called a “diversity hire”.\n\nYeeeeah well some hiring managers have literal quotas to fill with URMs that has a direct impact on my bonus at a F100 company so yeah, not every URM hire is a diversity hire, but some definitely are. The world is not black and white.",
            "Being involved in an actual recruiting process myself, I can tell you that obviously no one/company is silly enough to admit on paper that they don’t “held every candidate to the same standards”.\n\nLet’s admit that most of our jobs aren’t that hard, companies barely ever need the “best” candidate. They just need someone who is “good enough” to do the job, and can also fit the business KPI (like gender/race quotas).\n\nSo it really doesn’t matter if there are 100 or 1000 candidates that have way better qualifications and interview performance than you do. If you are from underrepresented group and “good enough”, you’re in, the rest don’t matters.\n\nThat’s the kind of opportunities that you, as the underrepresented candidate, has access to, that other people, no matter how good, don’t.\n\nI just find it funny that when it comes to acknowledging one’s own privileges, one suddenly becomes so naive and ignorant.",
            "You kinda just confirmed the “myths” that everyone already thought about diversity quotas.",
            "Nobody on the internet can say whether you specifically were a diversity hire or not. But your argument that diversity hiring is a myth is terrible. All you did was provide an anecdote that your relative engages in diversity hiring practices that makes it easier for women to get hired at their company. And that's precisely the point. DEI necessitates it. Your chance of getting a job is far easier than a comparable man. And this relative ease holds true all the way down the ladder of desirable to undesirable jobs.",
            "1. Strategic selection at the \"who gets interviews\" level STILL DIRECTLY DETERMINES WHO GETS THE JOB by directly opting to ghost equally qualified majority applicants.\n2. Internships and early career hiring quotas DIRECTLY DETERMINE WHO GETS INTERNSHIPS AND EARLY CAREER EXPERIENCE UPON WHICH THEY CAN BUILD THEIR CAREERS YOU CRETIN. THAT IS DIRECTLY CHOOSING MINORITIES OVER MAJORITY CANDIDATES SOLELY ON THE BASIS OF RACE, GENDER AND AGE WHICH IS OSTENSIBLY ILLEGAL, provided the group being suppresed is not a member of the majority applicant group, i.e. white males in which case it is the letter of the law to say \"eh, fuck em\" and toss their resumes in the trash unless they have <5 YoE because WE GOTTA HIT THOSE EARLY CAREER QUOTAS. This later results in those over selected minotity canidates having \"better qualifications\" because THEY GOT THE INTERNSHIPS ON EASY MODE AND THE MAJORITY CANDIDATES GOT GHOSTED ON THEIR INTERNSHIP APPLICATIONS AND WERE DENIED THE EQUAL OPPORTUNITY TO EARN THEIR EARLY CAREER QUALIFICATIONS.\n\nYou are dense as a brick if you don't see anything wrong with these policies...\n\nAnd OP, was that a LC easy, medium or hard on your interview? I got ONE shot at a google interview, they asked me to turn on my webcam, glanced up from their phone and pulled up a random LC Hard and told me I had 10 minutes to solve it in C++ for a job that only required Python. That MFer was playing angry birds with his volume up and glancing up periodically and saying \"yup\".",
            "So for point #1 is the loser informed truthfully or by some generic email, making that person doubt their skills?",
            "This sub is so full of socially stunted idiots that it makes me ill. One day you have maladjusted nerds complaining about how they don’t get jobs because of diversity hires (this does happen but it is not common that a less qualified candidate is pushed ahead of another for diversity quotas) and the next day you have equally maladjusted nerds spamming essays about how the system is 100% flawless and is totally needed because if not they would never get hired (women and certain minorities do still face passive discrimination that diversity quotas assist but the system is not perfect). \n\nPeople here are so reactionary and black and white in their world view. It’s the same reason we get bombarded by posts by nerds claiming their life is over because they didn’t get a FAANG internship their first semester freshman year and asking if it’s okay to ONLY make 80k at a non-tech firm doing what they like to do. Grow up.",
            "just here to give a different perspective that it IS hard to be a minority in a field… being a female in tech, it’s much harder to make friends, which can really be disadvantageous in situations such as job prep. i know a lot of friend groups who share interview questions they were asked, hackerrank screenshots etc which directly affect your chances. and other aspects such as group work, sharing assignment answers or help, giving each other referrals, etc also play a part. plus tech being a male dominated / male associated industry deters a lot of females from entering, or even considering tech as a career path from a young age, so naturally it would be harder to gain experience early (which a lot of males do, due to early exposure). i don’t think it’s necessarily a bad thing to neutralise these with diversity hiring advantages",
            "Why does this topic keep surfacing? It just confirms to me that men in the SWE space are generally hostile toward minorities in their line of work. For the love of Christ, everyone who is not a White, Asian, or Indian male isn’t just inherently worse at the job because they’re doing it, but that’s what it seems most of you are becoming frustrated enough to believe.\n\nQualified minorities are treated like unicorns, because that’s the definition of being a minority, they’re rare. If under represented minorities were screwing over qualified majority applicants in any significant way, then wouldn’t there be more in the field? More at your job? Most likely, but that doesn’t seem to be the case. You know what is? Even after all the diversity efforts from the company, 90% of the companies STEM employees are still White, Asian, and Indian men.\n\nA lot of you are frustrated that the market is in shambles and it’s significantly harder to find work… but that’s everyone across the board, even folks with experience are having a hard time. Stop explicitly blaming minorities for your lack of employment at big tech, it’s not their fault. And when you have this sort of blanketed ideal toward minorities that they’re all diversity hires and therefore less qualified than yourself, you’re really just being as racist and discriminatory as the thing you’re pointing your fingers at. If you can’t be better, then you have no right to ask others to be.\n\nAs a minority who has worked in big tech in the past, who has been jobless and looking for work for over half a year now, I can assure you that no one is holding out a red carpet for me. I grind LeetCode and sys design just as much as the rest of you. I’m not worse at my job just because I’m different than the majority of SWEs.",
            "Wow, you sure convinced me you’re not a diversity hire 😂",
            "The strategic selection part saying (BIG DIFFERENCE) made me laugh. Being denied the chance to even show your worth due to race/gender is wild.",
            "So step 2 is where the racism is codified. Got it.",
            "Isn’t it women who are constantly rioting for equal rights and equal opportunities in jobs.\n\nMaybe for all women “You should stop blaming others for your own failure, instead, try to work on yourself and have accountability”",
            "Honestly, I would be absolutely satisfied if the Diversity hiring practices were completely abolished IF AND ONLY IF I never am mansplained technologies again, never interrupted in meetings again, my ideas are never shot down again, if I can automatically be respected for my position/experience and listened to, if men stop being weird or flirty at work and an asshole after rejection, I mean shit I could go on. There are so many institutional sexist practices, whether you are aware or not. I don’t even know all the subtleties of working while being a different color than white, but I bet it’s absolutely disheartening, discouraging, and overall disgusting as well.\n\nThese diversity practices are implemented in most industries in order to combat the bullshit minorities have put up with their entire lives that have inherently set them up to have worse confidence, worse privilege, etc.",
            "Sounds like a post made by a diversity hire.",
            "Still means that if you're part of the candidates in an overrepresented group, you're more likely to get cut. Not out matched, just cut because of your race",
            "[deleted]",
            "I always remember what my grandfather said to students that were discriminated against when he got accepted into Yale, \"You should stop blaming others for your own failures, instead, try to work on your self and have accountability. Just my 2 cents and a rant on being called a legacy student.\"",
            "Heterosexual white male == Skills issue",
            "This sub is going to the shitter because it is now about diversity and politics.\n\nLet's repeat this again: If at any point in time a hiring decision is made based on your race (or sex), it is racism (or sexism). It is as simple as that by definition.\n\nRacism: Prejudice, discrimination, or antagonism by an individual, community, or institution against a person or people on the basis of their membership of a particular racial or ethnic group, typically one that is a minority or marginalized.\n\nThis is what is happening here, and no argumentation can change that fact.",
            "Companies being hiring whoever they want. If they want to hire their friends friend son, they’ll. If they want to hire the barber who did a bootcamp last summer, they’ll. If they want to hire a women, they’ll. If they want to hire a Asian, African , European, etc they’ll. They’ve doing this the whole times, if u didn’t get the job move on and look for other opportunities.",
            "\"Hey guys it's all a myth\" than proceeds to post complete opposite.\n\n> For individuals at the internship and early career stages, the company does enforce quotas.\n\nYou are a diversity hire. Got interviews on a silver platter and those \"hard\" questions were LC easies.",
            "[deleted]",
            "The White fragility and male ego in here is crazy 😂😂 call me a diversity hire all you want I’m getting the bag and you’re not 🤡",
            "Especially at the evaluation stage biases kick in. We’ve all had that interviewer who simply didn’t like us. Or what about those fun behavioral interviews? Those are bias fueled free for alls at the end of the day. If your interviewer likes you, good. If not…well. \n\nSo overall interviews themselves are bias minefields. Barely anything is truly merit based. Thus, these measures still are important to uplift minorities because the bias is set against them in ways it isn’t when it comes to your typical nerdy white or Asian guy with a semblance of social know how.",
            "I’m guessing that even for your friend, despite there not being a direct quota, there’s an understanding that the pool of individuals he has to hire *has* to be diverse and fit a certain description - they’d obviously need to report something like that to their own superiors.",
            "I hate to say it but what your relative said absolutely confirms the problem of diversity hiring. Some people may think diversity hires are inferior in their skills. Personally I think that's an overly simplistic way of viewing diversity hiring and I think most people who have a problem with it share that sentiment. People's problem with it is, nobody should ever be at an advantage or disadvantage due to anything that classifies as a \"protected trait\". That is almost the textbook definition of the verb of \"prejudice\". \n\nYour feelings are totally valid as well. They are partially my argument against diversity hiring and that's, it creates space for resentment to build between coworkers on the grounds of they were hired due to something other than skillset. It puts people like you in an awkward spot even if you were absolutely the best person for the job. It sucks a lot.",
            "I'm involved in hiring developers for a fortune 500 ( a name you all know ) and diversity hiring isn't a factor. Relevant experience is, and we are incredibly wary of recent grads with little real experience for obvious reasons.",
            "does disability also help? I once had severe depression and the doc says that count as disability. I never click I am cause I worries this will disqualify me. I guess the fact is opposite?",
            "Is it a conspiracy theory? No it't NOT.",
            "I’m sorry but doesn’t this exactly pinpoint the reason why is this an issue afterall?",
            "You say it’s a myth, but your post clearly shows that diversity hires do exist. Especially the part about the quota. Diversity hires get opportunities for interviews simply for being part of that minority.\n\nNow, I also want to emphasize, diversity hires doesn’t mean less skilled as some in the comments are implying. It’s still based upon skill as they must still pass the technical test.\n\nThat being said, I’m not against diversity hiring and think it’s good that, when I graduate and land a job, I will hopefully have a diverse group of coworkers.",
            "It’s crazy how the moment you’re the one who’s privileged , all of a sudden, it’s either you deserve it or it doesn’t exist. But when it’s the other way around it’s ok to say opinions like “it’s cause he’s white” “ it’s cause he’s Asian” but saying factual topics that we all know exist like diversity hires, black, Hispanic, and women in tech , all of sudden it’s racist, sexist, and I’m disregarding their hard work. Hard work is relative just because you’ve grinded leetcode and prepared for interview doesn’t mean anything. Everyone has, it’s mindset like that makes everyone else not like diversity hires. Just accept the fact that you were privileged because of your sex, skin color or your sexuality. \n\nthere’s no relation and correlation between you being harassed in school/work and you being more deserving of whatever you have right now. That’s like saying it’s justified for me to get the easier route because I was bullied, personally I would feel disrespected to know I got the easier route. And if you don’t think you got the easier route, just imagine if you were white or Asian male, and see if you would gotten the same opportunity. There’s no a single opportunity we have that you don’t have. What is white privilege ? \n\nPlease… just accept the fact you got the easier route and we can all move on.",
            "It is hurtful because not only does it devalue our real hard-earned accomplishments that were often made while being actively undermined (yes, it is a common tactic) but it sends a message that we will never belong. Imagine going to a job where you love the work but it feels like the people don’t want you there. I know this as I am a very well-educated, skilled, experienced and talented underrepresented computer scientist and engineer.\n\nIt will require thick skin to handle this, but my advice is to develop a good support circle outside of work, get what you can out of an opportunity so that it will forward your career, but do not hesitate to get out of that role if it will not advance your learning as it could damage your spirit, and do not give up as you will eventually find the right place for you and/or an influential ally that will see you for the excellent talent that you are and will genuinely value your participation in their organization. \n\nAnd speak up for yourself in a calm and professional manner and document your experiences. If the organization does not properly address your concerns for the behaviors you are experiencing, then you really should consider moving on at your convenience. To this end, you should also learn how to appropriately assert your legal rights to opportunity and a workplace free of harassment.\n\nBut never give up! You deserve the opportunity to pursue the career that you desire for yourself.",
            "Thank you for posting this OP. A lot of people on this sub are bitter and burnt out, and can’t see outside of their own stressed out bubble. You might get a few hateful comments on here but you’re not alone in this thought at all.",
            "this sounds way more accurate to how it’s actually done",
            "I just want to let you know, as the field becomes more and more saturated, as I mentioned countless times on this sub and r/cscareerquestions,\n\neven people that meet the requirements for the job WILL be rejected.\n\nWhy? Because there are 100 qualified applicants to choose from out of the 2900 that applied\n\nSo people who are not that intelligent will use \"diversity hires\" as a scapegoat, believing that they didn't get the job because such a hire was chosen over them, when it is not likely the case statistically,\n\nIt's amazing that we STEM majors think we are the smartest, yet we can't understand basic principles like supply and demand.\n\nI actually want more people to study CS so we can see what happens to the field in a couple of years\n\nhttps://preview.redd.it/zpmovbgbygib1.png?width=472&format=pjpg&auto=webp&s=8e2b726d8d2ceb4e3227131b55fc7b8bfd6a959c",
            "A quota in the pool is fundamentally unfair. There could be 3 Asians, 5 white ppl, 1 latino , and 1 blk person in the pool. If there are quotas on the pool, the Asians could be more qualified, have better GPAs, etc. than the latino and never get a chance to interview. Point 1 May be true, but it doesn’t matter if you remove the competition that is better.",
            "In the Harvard/UNC supreme court documents, black applicants with a 4/10 academic score were admitted at a higher rate that Asians with a 10/10 academic score. This score represents a numerical value assigned by Harvard’s admissions.\n\nIt’s far more than a tiebreaker, it’s a total advantage based on nothing but race.",
            "If women in tech have it easier, why is tech overwhelming male? Companies are still struggling to retain female talent. Women are dropping out of tech due to bullying and ostracism. Tech does nothing to stop it.",
            "Y'all need to chill\n\nIf you're a white man, I'm sorry, you can't say you're \"disadvantaged\" or that other people are on \"easy mode\"\n\nYou have *life* on easy mode. Yes, everyone has their shit, but it's quite likely that you have less shit on your plate than the \"diversity hire\" that \"stole your job\".\n\nIt's only easier for POC and women to enter the field when you ignore the fact that early STEM education is still discouraged and rarely provided to them - you might've been coding since you were in middle school, but only because you had access to a computer and your family didn't push you away from it.\n\nMaybe on some level affirmative action-type stuff is \"unfair\" and \"robbing the best for the job\" but it's a necessary evil to shift things so that we won't need them anymore, so that a little girl can pick up coding without feeling alienated for it, so that she can reliably get a job without these initiatives because the company culture is as much for her as for anybody else.\n\nThis isn't some sorta shadowy conspiracy to \"rob the white men of jobs\", the only reason it feels like a loss for any of you is because you had the advantage and now things are moving to a level playing field.\n\nAnd yes, in some sense this applies to Asian men as well. I know you're probably not as well-off as the average white guy, but at the end of the day, there's a lot of you in the field and we all know it's not because you're inherently better or something. You likely had influences in your life pushing you to thrive in CS that other people didn't necessarily have.\n\nEach and every one of us is working our asses off here. Can we just be happy for each other instead of accusing people of being incompetent because they happened to fulfill a diversity quota? \n\nYou're all brilliant people, and if I had my way each and every one of you would have the opportunity to apply yourself and get paid good money doing what you love. But unfortunately, that's not the reality we live in. \n\nSometimes as an industry we have to make hard choices, and sometimes those choices mean taking opportunities from the prodigy to give them to the kid who hasn't quite gotten the chance to shine.",
            "Let's say there's 99% non-diverse, 1% diverse applicants in an applicant pool of 1000.\n\nThat's 10 diverse applicants and 990 non-diverse.\n\nLet's say the company wants to change the representation to 90% / 10%.\n\n10 is 10% of 100.\n\nSo that's 900 applicants who get thrown out of the \\*pool\\*, who don't even get to interview, purely based on the color of their skin and their gender. Is that ethical?",
            "Who fucking cares if the diversity hiring “myths” are true or not? If you’re up in arms because you have a good resume and you think that alone makes you entitled to good things over other people then you’re either naive or willingly ignorant. In any nuanced view on society it’s obvious that life is stacked against some people the second they leave the womb for no fault of their own.\n\nIf you grew up in a happy suburban family in an upper class family who could afford to send you to private high school, and you have no idea what it’s like to go to school hungry or be treated differently because of your race or talked down to because you’re a woman, then it’s not remotely impressive that your GPA is 0.25 pts better than the poor black kid who goes to your college and has been on food stamps for the last 7 years.\n\nIf you want a group of people to be mad at, minorities is a weird one to pick. Pick the dad who hired his best friend’s idiot son over you I promise it’s more common than you think.",
            "It’s really weird that there are apparently so many diversity hires in software engineering yet minorities still remain OVERWHELMINGLY a minority in the field. \n\nIt’s not the statistically unlikely hire that kept you from one role. It’s the sea of white dudes who have the jobs you want. You’d expect science majors to understand that, but it’s probably part of the reason you’re not getting the job.",
            "Yall realize this was written by a guy posing as a girl right? Likely to affirm everyone’s suspicions about the hiring process and get karma. Please don’t blindly trust everything you read",
            "I would like to challenge your post and hear your genuine opinions on this, if you are willing to debate. \n\nIn actuality, humans are diverse in a multitude of ways. Gender, sexuality and race are only 3 categories in a pool of a million different other categories. So what makes a female candidate’s perspective stand out from a male candidate’s simply because of their gender? If you’re telling me that the code that a woman writes is better than a male somehow? Or that a woman contributes more to Google’s search algorithm because she’s a female? If so, then I would understand the need for diversity hiring based on gender.\n\nWhat I don’t understand is why there are these proxy “categories” to judge someone based on what their group might represent in the talent pool. E.g. the African American community is on average less well-to-do thus hiring African Americans give a leg up to impoverished coders. Why can’t you just directly hire based on social class instead of use this arbitrary proxy then?\n\nUltimately, I would argue that this discrimination will always come be present as long as diversity schemes exist. Unless you’re saying that diversity hires provides NO BENEFIT at all to hiring (which defeats the purpose) how can you then say you were hired based on merit ALONE when you clearly got an advantage over others in the same position?\n\nI’m not saying you don’t have the skill to do your job because ultimately, I wouldn’t say SWE is so difficult that it’s impossible to learn for most qualified applicants. But why are you against the “diversity hire” phrase when that was clearly an advantage for you in the process?",
            "This doesn’t negate from the fact the the applicant pool is cut from the very beginning. You said it yourself when they receive 1,000+ applicants. So instead of looking at resumes and seeing which applicants would actually be the best fit on paper before interviewing (literally what a resume if for) they are systematically pulling applicants based on  diversity factors. This alone is the issue with this practice and the recruiting process as a whole.",
            "There are specific programs for diversity hires , a major one is google steps. Getting an internship there will open up many doors. Also candidates do not get the same assessments , diversity hires tend to get an easier version and have less rounds",
            "I've been told directly by someone in charge of hiring at a very prestigious company that they have a new requirement for some departments to hire exactly 50/50 split on women and men, not only do I trust this I see this number being 100% accurate with new employees.\n\nSo when there are way less woman in the field but they get the hired way more, unless woman are inherently significantly better than men as SWE they are hiring less qualified woman, as I heard again personally from the person doing the hiring.",
            "everything you listed should be illegal. if we removed everything you just listed then no one would call you a diversity hire",
            "[deleted]",
            "> This does not mean they pick underrepresented people simply for being underrepresented.\n\nIt does though. At least for the internship/entrylevel stage. Which is also what this sub is mainly about.\n\nAnd this shows if you work with the \"diverse\" new hires tbh.",
            "As a woman in CS, I don't want my gender being attached to anything about me. I want to be seen as a person good on the theoretical side of CS and is skilled at using graphs and theorems from graph theory. My gender wasn't something that I controlled and worked towards, but my interests and focus area in CS was something I developed with passion.",
            "Things might work like this in the software industry but when I was in uni and recruiters for FMCGs and other manufacturing corporations would come along, they had this female-male quota of 75-25 for hiring and this resulted in many of the guys abandoning their fields of education for a career because jobs were already scarce.",
            "chop sharp dazzling friendly direction plough grab butter tidy spectacular ` this message was mass deleted/edited with redact.dev `",
            "OP, thanks for posting it, even though the reaction was predictable. Don't expect the entire bro club to understand, but some may.",
            "1 piece of anecdotal hearsay is demonstrative of absolutely nothing, and that \"strategic selection\" bit is discriminatory in itself. You not being able to understand why that is, while also applying a dubiously reliable sample size of 1 firm's practices to the market at large are 2 indicators that you may in fact actually be a diversity hire.",
            "So heres the thing.. we can all only speak to our experiences and what we've seen. I think we can all agree that if you put in the work you deserve the credit. \n\nBut from what I've seen 'diversity hires' would be people who never even studied for cs. Ex. in my last company they hired healthcare management and business majors. The closest major to cs that a 'diversity hire' had was IT, which in my college was 10x easier than comp sci. So as much as I would like to believe that diversity hires are given the same level of scrutiny, from my experience, they're not. And that's not to say that all companies don't test 'diversity hires' hard, it's just the ones I have seen don't.\n\nWhile I knew people struggling to find internships and jobs out of college as comp sci majors, I knew 'diversity hires' who have never done a leetcode in their life. People who have never had to work nearly as hard in their major. Granted this was a few years ago so maybe with the market being oversaturated companies may have ramped up the difficulty. \n\nThe truth is it's a complex situation. For guys, we have it far easier in a field like nursing. At the end of the day, it's all supply and demand.",
            "Well this is kinda like college admissions. Your SAT can only go so high. Colleges STILL reject applicants that spend 16 hour days. Even a 1590 gets rejected everywhere. How much higher can you go? What’s the ceiling? At the end of the day people will kill for virtue signaling. For some liberals it’s their lions pride, their bread and butter, their entire known existence of right and wrong. Do I hate diversity hiring? Only if it’s at the expense of other uniquely, talented, diverse individuals who come from possibly similarly broken backgrounds, I hate that so much you can’t change my mind.",
            "So if we are eliminating diversity as a factor then surely we are eliminating employee referrals right? Because just like a hypothetical pic who is a 7/10 who gets picked over 9's and 10's why should having someone vouch for you get you ahead of qualified candidates?",
            "Yes, all of this confirms exactly what people are complaining about. No one thinks that idiot URMs get hired over genius white males, but all of the points you mentioned show *exactly* how URMs are advantaged",
            "You said it yourself. If 2 people are tied, they WILL make a diversity hire. So diversity hiring does in fact exist. If it didn’t, it would be a 50% coin flip",
            "What classifies as underrepresented? If it’s based on population, I would say over 80% of hires in fang are eastern, either Chinese or Indian.",
            "And now talk to one of them who is a good friend, and preferably in an informal context after they had a few beers.\n\nThen they will tell you this is just the official version and their real marching order is just to make it easier for minorities, as easy as is going to be needed to hit a given target.",
            "OP are you low iq?"
        ]
    },
    {
        "post_id": "xk828n",
        "author": "TechForDaWin",
        "title": "Job Application Websites",
        "url": "https://www.reddit.com/r/csMajors/comments/xk828n/job_application_websites/",
        "score": 431,
        "num_comments": 47,
        "created_utc": 1663774180.0,
        "selftext": "Workday, ICIMS, brassrings  👎👎👎👎👎👎👎\n\nGreenhouse, lever.co, linkedin easy apply   👍 👍👍👍👍👍\n\nTLDR; Had to rant cuz some of these websites are actual garbo",
        "permalink": "/r/csMajors/comments/xk828n/job_application_websites/",
        "comments": [
            "You'll catch me writing essays in MS Paint before you catch me applying through Workday again",
            "Greenhouse is goated",
            "[deleted]",
            "I love uploading my resume, then either having a shitty parse of that resume that means I need to copy/paste and/or retype everything, or a system that parses nothing and just requires input of everything in my resume separately.",
            "Ripplematch is trash too",
            "Brassrings doesn't even work half the time, I have been applying to LM jobs on it, and most of the time it throws an Error message when trying to log in to check your applications.",
            "[deleted]",
            "TLDR?! It’s like 8 words and some thumb emojis! Tf?!",
            "Add SAP SuccessFactors to 👎. All these boomer ass companies gotta get their shit together.",
            "Wait until you meet taleo.",
            "Linkedin is my fav",
            "Honestly workday is really good except you need to create account for every company you apply for",
            "Use simplify and Espanso... Nothing is gonna scare you then.",
            "let me put all of you on rq: [simplify](https://chrome.google.com/webstore/detail/simplify-%E2%80%93-autofill-your/pbanhockgagggenencehbnadejlgchfc)\n\nyoure welcome",
            "Workday ain’t that bad, pretty much what I exclusively use at this point :/",
            "I can confirm that I have about 200+ Workday accounts.",
            "Home Depot",
            "Workday is sometimes fine but I hate ICIMS. Brassring is stupid af",
            "Couldn't agree enough \nGreenhouse all the way",
            "or the ones with the really puffed fancy UIs that make you think it's going to be a long af complicated application process but when you scroll down it's as easy as lever/greenhouse",
            "I'm curious I'm not American so I'm wondering if they're any sites that would help international csmajors get a job after graduation",
            "All those pale in comparison. Go try and apply for a Volvo internship",
            "My favorite part about looking for a job is all the scam text and phone calls that started receiving again /s",
            "Damn tired of the lever captcha, greenhouse ftw",
            "lever.co is so based"
        ]
    },
    {
        "post_id": "oh2vwu",
        "author": "danielr088",
        "title": "I just got an internship for this Summer!",
        "url": "https://www.reddit.com/r/csMajors/comments/oh2vwu/i_just_got_an_internship_for_this_summer/",
        "score": 432,
        "num_comments": 16,
        "created_utc": 1625859235.0,
        "selftext": "I was just accepted into an internship at a local startup. I'm a former community college student that just graduated this Spring semester and its been impossible to get anything.\n\nMy former Professor randomly emailed myself and couple other former students about an opportunity at midnight the other day. I reached out to the person at my school's career center and they were able to set me up to speak with the CEO of the startup. I'll be working on a project at the startup for about 7 weeks, until the end of August. I'm so ecstatic to finally gain professional experience for my resume!!! I still can't believe I actually got an internship for this Summer!",
        "permalink": "/r/csMajors/comments/oh2vwu/i_just_got_an_internship_for_this_summer/",
        "comments": [
            "Congratulations man! This just goes to show it’s never too late for an internship and to always keep trying and keep your hopes up. Happy for you :)",
            "Congratulations dude! I was on a similar boat with CC and an internship with a startup - great things to come for you!",
            "congrats! startups teach you so much",
            "[deleted]",
            "I’m so happy for you man :) This is only just the beginning",
            "Proud of you man, go get it🙏🏼",
            "Congratulations dude! Happy for you and good luck!",
            "Congrats!! 🎉 Do you have any advice for us who are still looking, please?",
            "Congrats!",
            "Congrats bro!",
            "How were you able to get an internship if you already graduated in Spring?",
            "Congrats! Wishing ya all the best."
        ]
    },
    {
        "post_id": "1b5jymd",
        "author": "Fwellimort",
        "title": "Top CS Schools Show Amazing Career Outcomes Even In Today's Environment",
        "url": "https://www.reddit.com/r/csMajors/comments/1b5jymd/top_cs_schools_show_amazing_career_outcomes_even/",
        "score": 427,
        "num_comments": 217,
        "created_utc": 1709480162.0,
        "selftext": "In the current environment in which entry level jobs are harder to get, I decided to give a check of how graduates from top schools are doing. And much to my surprise, it looks like at aggregate, they are doing amazing and there's no real changes in the job market.\n\n&#x200B;\n\n[Carnegie Mellon University](https://www.cmu.edu/career/outcomes/post-grad-dashboard.html)\n\n2023 was a rough year for many CS graduates. It was a rougher market than usual.\n\nBut then when you check out CMU CS career outcome for Bachelor's, it looks like the job market was booming.\n\n* 13 people to Jane Street. Such an insane outcome here.\n* Median salary is $135k and average salary is $150k. This implies the median graduate is getting into top tech firms because top tech firms have median salaries around this range (salary ignores bonus and RSUs).\n* 16 to Amazon (13 Amazon + 3 AWS), 13 Jane Street, 9 Microsoft, 7 Google, 7 Meta, 4 Netflix, etc. All insane numbers. And this was in 2023.\n\n[2023 BS in CS at CMU](https://preview.redd.it/c419p4rnz4mc1.png?width=2246&format=png&auto=webp&s=4f30d2247fdcafc38c22c2eaaeb34b1cd1526514)\n\nAnd the numbers only get better for those with Master's and Doctor's at CMU. It looks like Jane Street loves CMU graduates (both undergrad and grad).\n\n&#x200B;\n\n[Cornell](https://sonformatter.curiousconcept.com/#)\n\n2023 again was a rough year for CS. But again, the results seem similar to CMU CS\n\nhttps://preview.redd.it/hiugjfpo05mc1.png?width=1774&format=png&auto=webp&s=e32d02cad1dbe1f01651e2c59eb52690716fbd0b\n\n[Princeton](https://tableaupublic.princeton.edu/t/CareerServices/views/First-destinationData/Employment?%3AisGuestRedirectFromVizportal=y&%3Aembed=y)\n\n2023 again was a rough year for CS.\n\nBut again, great outcomes.\n\nhttps://preview.redd.it/2eb0c0pg15mc1.png?width=2324&format=png&auto=webp&s=e2ebe0e1b291268e6fd6453c17e9b94973fe0dc2\n\n&#x200B;\n\nIdeally, I wanted to track all Stanford, MIT, UCB EECS, CMU and many more. But most schools don't seem to have data for 2023. However, I think the 3 schools I listed is more of an indicator of career outcomes for CS graduates at the top schools.\n\n&#x200B;\n\nI wanted to post this for one reason only.\n\nIf you are a high school student who is serious about Computer Science and have the academics to get into top schools, then please seriously consider attending the elite schools. The job market for those who are graduating from schools like CMU for CS is still booming and honestly seem to be doing better than pre-pandemic. Companies seem to really value graduates from top schools especially since the pandemic.",
        "permalink": "/r/csMajors/comments/1b5jymd/top_cs_schools_show_amazing_career_outcomes_even/",
        "comments": [
            "The most insane part about this is the same amount of people going to Jane Street as Amazon 💀. A couple of years ago Amazon would’ve had like 5-10x more people going when big tech was actually hiring.",
            "In an economic downturn when there are less jobs available the bottom always does worse. The top 10% will always be fine",
            "Umass had a decent amount and its a mid state school",
            "This is the power of connections and location. This is interesting  to see",
            "There’s a large correlation vs causation here. These universities have <2% acceptance rates for cs, so you need to be incredibly smart and have world class abilities to get in. I bet if you took the same students and put them at t50s like UC Davis the outcome would be similar",
            "If you’re cracked, you will get good placements at most schools. \n\nThe thing is, almost all of the students at the elite schools are cracked, so those schools have insane placement rates.\n\nSchool prestige only matters for the first internship in my view",
            "Man the US salaries make me so envious",
            "No name university graduate here who probably has no chance anywhere at all. Seeing these stats just makes me feel worse and regret not grinding harder in high school…",
            "Ended up at a no-name while friends went to an elite school. Felt the need to fit in, grinded very hard and got opportunities that they never had early in their uni careers, roles at big name companies. Felt awesome that I'm on a roll. 2023 comes around and there's just not many external postings and no return offers due to company headcount. Elite school got their own postings, and despite their lack of 'great' work experiences, landed roles at better companies with greater salaries than I have ever dreamed of, and here they are set for life.\n\nDespite all of the grind and effort that I have put in and getting to the top of my class, the ones who won in the end went to the elite school. I wish I took senior year more seriously back in high school. It feels like I'm repaying a debt that will always be there, all because I didn't try hard enough that one time where effort mattered the most. I'm still unreasonably salty over this and still can't let go. I curse myself for being too career-oriented",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Please please please for the love of all, look deep into the post histories of anyone commenting on prestige or the like here. If they aren't in a hiring role with some seniority, why listen to anything they have to say as more than their opinion?\n\nThis sub is particularly awful around the midway and end of semester periods. Tons of students will come in here to complain about their failures in securing an internship/job, they'll bemoan this or that external reason that isn't likely to be accurate. On the flip side you'll have a bunch of others (usually from these prestigious schools) who will essentially want to humble brag.\n\nIf you're grinding it out and looking, keep at it. If it's not working, change something, but please again unless these people seem like they actually have some kind of real insight (And aren't just some 1-2 year exp kid person trying to fear monger), don't believe anything they say.\n\nKeep your mental health in check!\n\n&nbsp;\n\n***TL;DR:*** Don't trust random people on the internet, especially now. (Yes some irony has to be attached to this comment)",
            "just FYI, I went to UC Berkeley (2023 grad), and the numbers are kinda dumb lol. I for one am struggling and still unemployed. I know some others from my class that are too, With and without internships. Most of these numbers are self reported, making them worthless (i never have responded to anything)\n\nJust for reference, the student speaker at my cs graduation even made a joke about how a lot of us were going to remain unemployed lmaoo. Top school does definitely help with me hearing back at least, but it’s not the end all be all many of you believe it to be. A lot of these people could have had connections etc (just like a lot of the people that i know that have jobs did).",
            "This median salary statistics are always inaccurate because people with no/low-paying job don’t answer the survey\nSource - I was one of them",
            "I was a top state school grad; straight into big tech, team was collapsed and dissolved, went straight to a google cloud accelerator company after.\n\n150k plus straight out of school.\n\nNow I’m at a series A leading projects.\n\nThis is a trimodal career. You know if you’re this caliber. Be honest with yourself about the career difficulty you will experience.\n\nGood luck to all of you.",
            "School name does matter since you’re the cream of the crop at the top. But in terms of the actual hiring process it’ll help in the resume screening, but the rest is up to you. \n\nMeaning if you pass the screening (with good projects, experience, knowledge, etc) you can still be successful. School is important but past the top like T10 it’s irrelevant. Unless you’re shooting for the absolute highest jobs, I don’t think it matters as much as you think. \n\nBasically: helpful for screening but it is NOT everything. \n\nSource: Google, Amazon and Apple interviews for me and my friends at a non Ivy school. Don’t really know the ranking but it has some prestige",
            "If you’re smart enough to get into CMU cs, you’re probably smart enough to go to a T100 and still land Jane Street while saving your money. The downside is that at your state school, it’s easy to coast and not become Jane Street material, while Carnegie Mellon will be hard and likely get you quant interviews no matter what. So at a T5 school, you’re paying to be forced to work hard, but in theory, you can just force yourself to work hard.\n\nThe best advice I can give to prospective comp sci students is to start working on impressive projects right away - if you’re willing to go through the CMU admissions process and pay their tuition, you should also be willing to get into web dev or game dev or something else that interests you *before college* and have a massive leg up on your peers.\n\nEdit: also your school probably has really good CS clubs that you should get seriously involved in right away. Don’t get scared away if on the first meeting you have no idea what people are talking about, keep going and get cracked like them\n\nEdit 2: I’m shocked that Jane Street took more CMU new grads than Microsoft, Meta, or google, btw. I guess FAANG was really not hiring new grads last year. Doesn’t look like they are this year either outside of Meta",
            "Uoft and mcgill are sending more and morepeople to the USA to work in big tech. Work hard in a good university and you’re fine",
            "Everyday I curse myself for not being born in the USA",
            "Basically CS is turning into Investment Banking. Software Engineering will just be over-run by acronyms like \"Target Schools\".",
            "Seems like the world is burning around you, but you step outside, take a breath, and realize everything is alright.",
            "people need to realize the school you go to doesn't define your career outcomes. these schools only act as an extra filter for these companies to help them find talented and smart people. if you are as talented as these people that go to these schools, you will get these kinds of jobs. Its just that of course there will be these less kinds of people at less prestigious uni's",
            "It’s self reported",
            "Not CS. \nOP is clearly on a high horse with this epic post and humble brag follow up responses. Would have been not the case if they didn't throw around their ivy schooling xx times. As if people can rewind time and spawn resources to propel them towards an ivy tier education. Way to further cloudy the hopes of many that have already been darkened by this sub. \n\n\nEveryone else reading: OP may have an ivy education, but you all have something they don't have. ",
            "This doesn’t really mean much, rich people always do just fine",
            "[deleted]",
            "Or if you are a high stat and motivated student, dig deep wherever you end up.\n\nMy kid (who had stats to apply anywhere) graduated from a non-elite state flagship CS program last year and started comfortably into 6 figures (+ relocation + stock) in a MCOL area.  Sitting next to a T10 graduate.   I will say his employer hires from ALL over.  But hires at a 1% rate.  They don't care who you are if you can't pass their multi-hour techincal test.\n\nAlso, note that CMU grads are placing heavily into the HCOL areas.  You really need to do the math on that.  The forbes cost of living calculator is a good way to compare\n\n[https://www.forbes.com/advisor/mortgages/real-estate/cost-of-living-calculator/](https://www.forbes.com/advisor/mortgages/real-estate/cost-of-living-calculator/)\n\nThe marketing at CMU knows how to present data to make their outcomes appear in the best light possible. And dont' get me wrong.  If you get admitted and can afford CMU, I'm sure you can have a great experience there.  It's not surprising they can graduate motivated and well prepared students.  I find it weird when students think they need to do marketing for high end schools and create more panic in students that can really do great in a range of programs and it's more about THEM than the name of their program;.\n\nETA - well what do you know, not an insubstantial number of CMU grads are working with my kid.  Who knew.",
            "To anyone who says school matters. Unless you are in T10 or applying to incredibly selective places, it doesnt. Ill tell you none of the jobs I got i could tell you didnt care where i went to school, only that i had specialized experience in infrastructure technology. Go get certs and niche experience, it will give you a huge leg up. People just want prople who show interest in learning/ growing and arent annoying to talk to. Thats it",
            "[deleted]",
            "There’s really only 4 schools that matter: Berkeley, Stanford, MIT, CMU. Ivy League get outa here!",
            "How is the recruiting like at UIUC?",
            "I graduated from cmu cs in 2018 and I don’t know a single one of my classmates that did not either go into faang+, phd at an elite university, or an mba of their choosing. Not to mention the other countless double major or minors in CS who also placed in faang+ jobs.",
            "I'm sure everyone can afford that",
            "You should really look outside of the cs major for amazon there’s a lot of cs adjacent that have a lot of spots",
            "I’m sorry but these stats are not consistent.",
            "I'm trying to transfer to other colleges now",
            "Work at a peer firm of JS, can confirm there is a lot of love for CMU grads.",
            "Is Amazon supposed to be good now? Their pay is only a little above normal average. Defo noticeably lower than big tech average",
            "My state school is still holding a 90-95% hire rate for CS students. \n\nPeople need to look at job statistics / median salary for schools the same as prestige.",
            "Those elite schools will teach you what a linked list is soooo much better than some shitty state school. Why I've heard that MIT graduates know what a \\*doubly\\* linked list is! Not just that bush league single linked bullshit you'd get at Illinois State University.",
            "not to be weird but isn't CMU CS -> Amazon a bit underwhelming since Amazon has so many state school kids too?",
            "This isn’t good at all, and it pretty much shows the current job market is quant or bust. The fact that epic, Siemens, and cadence design are able to get any cmu grads at all shows how bad things are. Meanwhile mediocre iq devs that graduated some garbage school were able to land faang jobs 2 years ago.",
            "I will add that my company is listed as one of those hiring here and that is not the case. We hired people in 2022 who were yet to graduate for 2023. I am involved in the college hire program and for the most part they are canceled with no clue when they will be brought back up. There is still some potential for graduate students but no undergrad will be getting a top tech job in 2024 or at this pace 2025. Not from these schools at least and not through college programs. Plenty of you might apply outside of the college programs and still get in in what we deem the industry hire process but you’ll be competing against people who have taken a leap down thanks to the job market. \n\nThis is bad data delayed about a year for offers made really in 2022 and very early 2023.",
            "This is really an example of CS becoming a bit of a an elitist career. No longer a magical bridge to 6 figures. \n\nI agree, definitely go to a top school or simply be a top candidate (top % at T30 school). To those like myself where it’s a bit too late, consider specializing maybe",
            "When has the top schools in any industry ever had it rough dawg."
        ]
    },
    {
        "post_id": "18x7794",
        "author": "Creepy_Lunch_5478",
        "title": "I love when a company schedules a 5 hour final round interview for after break and then cancels it the day before",
        "url": "https://www.reddit.com/r/csMajors/comments/18x7794/i_love_when_a_company_schedules_a_5_hour_final/",
        "score": 433,
        "num_comments": 57,
        "created_utc": 1704246838.0,
        "selftext": "...after i spent my whole break studying for it",
        "permalink": "/r/csMajors/comments/18x7794/i_love_when_a_company_schedules_a_5_hour_final/",
        "comments": [
            "These companies are getting too fucking ballsy, I'm tired of it.\n\nI hate this field.",
            "Name and shame",
            "Sorry I would never agree to a 5 hour interview holy crap lmao",
            "A 5 hour final interview? \n\nred flag",
            "They scheduled it but forgot to cancel before the break sorry lol",
            "I could never maintain focus for that long",
            "What do you even do for 5 hours?",
            "5 hours?! hell no",
            "The quality of the position applying for and the quality of the company / culture is inversely proportional to the length of the interview process",
            "Just a reminder, you're just a number to a big company. They truly don't care about you, and neither should you care about them.\n\n You put your effort in, at the end of the day, that's what's important. Yeah, it sucks, but you'll get something else.",
            "What are with these comments? Superdays are pretty standard for a lot of companies and a lot of industries. 5 hours is a breeze compared to what they used to be (in person, 8 hours, for 1-2 days). \n\nI’m not saying they are fun, and I’m not saying it’s right for them to cancel on you the day before, because that’s fucked. However, the comments saying this is a “red flag” are a little bit Charmin Ultra Soft.",
            "What do they ask on 5 hours interview?",
            "You’re cooked buddy",
            "Rippppp",
            "shocking soup slimy snow hurry one axiomatic reply worry stupendous\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*"
        ]
    },
    {
        "post_id": "19fet3k",
        "author": "MarkZuccsForeskin",
        "title": "me during the technical interview",
        "url": "https://i.redd.it/i76ikqaigmec1.jpeg",
        "score": 432,
        "num_comments": 8,
        "created_utc": 1706204007.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/19fet3k/me_during_the_technical_interview/",
        "comments": [
            "![gif](giphy|W5rfDvofwyNb4hCWfn)\n\nThe interviewer:",
            "You’re hired",
            "Sir this is a wendy’s",
            "you guys are getting interviews?\n\nhttps://preview.redd.it/h00urq2q8vec1.jpeg?width=210&format=pjpg&auto=webp&s=ec5ac968fd911fe601617cc6fc7d7af0f56e14dc",
            "The power of attraction. 📝",
            "😂😂😂",
            "Oooooo 2 sum"
        ]
    },
    {
        "post_id": "17osjo4",
        "author": "PixelSteel",
        "title": "i realize it's funny day, but this is my situation rn compared to before :(",
        "url": "https://i.redd.it/rauzilar1nyb1.png",
        "score": 431,
        "num_comments": 31,
        "created_utc": 1699237598.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17osjo4/i_realize_its_funny_day_but_this_is_my_situation/",
        "comments": [
            "A picture is worth a thousand words.",
            "Just keep applying my brother graduated earlier this year and spent months applying but got an offer of 75k and took it( No internships or major projects).",
            "People who graduated in 2021 and 2022 were just lucky enough to get in these companies before the gates closed",
            "How do you make a chart like this?",
            "I got 77k plus 10k sign on bonus graduated 2022 Dec buy start date was pushed to july 2024- 25k stipend. I’m doing my masters. Considering current job market why not lol.",
            "I’m a bit late to this but what software is used for making these graphs ?",
            "All market not you",
            "how do you make this diagram ?",
            "Reminds me of my app cycle last year 🫠"
        ]
    },
    {
        "post_id": "13hho8t",
        "author": "No_Island1663",
        "title": "Professor making us submit code into turnitin",
        "url": "https://www.reddit.com/r/csMajors/comments/13hho8t/professor_making_us_submit_code_into_turnitin/",
        "score": 433,
        "num_comments": 136,
        "created_utc": 1684084340.0,
        "selftext": "Someone in my algorithm analysis class told the professor that people are using chatgpt to do the hw assignments. The professor lost his shit and gave us a lecture on that we won’t learn anything that way. I agree with him, but at the same time I had to teach myself everything in his class because he’s very bad at teaching. Anyways he got very mad, for the final he’s having us export our code into a pdf file and submit it into turnitin. I have never submitted my code into turnitin so this will be a fun experience. He thinks that he’ll be able to know if someone used chatgpt to do the final. Im also interested in seeing how my plagiarism report will look like.",
        "permalink": "/r/csMajors/comments/13hho8t/professor_making_us_submit_code_into_turnitin/",
        "comments": [
            "This sounds like a beyond stupid way to catch ChatGPT or code plagiarism unless TurnItIn has a special checking software specifically for code.",
            "> for (int i = 0; i < 5; i++) \n\n\"I noticed that this line was flagged as heavily plagiarized, I'm going to have to fail you.\"",
            "Lol, my professor challenged us to use ChatGPT to try and complete homework assignments and said we deserve the A if we can get it to work for us",
            "our course makes us to 1 on 1 interviews with TAs where they ask us questions about our code to see if we acutally understand what we submitted",
            "Pdf? turnitin? For code ????",
            "As someone who used turn it in to check for plagiarism...that's not going to work well for coding assignments. Unless it's changed a lot in the last few years turn it in checks for matching text and text fragments. Since coding is a logic process to put text and language in a specific order to achieve a desired outcome...Everyone's work will come back as highly plagiarized.\n\nBut if the students aren't idiots they can have chatGPT write code, verify that it works, check to make sure there isn't anything that wasn't taught in class in the code, swap out some code for less effective code, change some variable names, and add a ton of their own comments. Nobody would be able to prove for sure that chatGPT was used. \n\nChaptgpt is a language model. In its current form an instructor should be able to create any significant coding project in a manger that chatGPT can't create code that will work without the student going through and doing some major debugging effort. If they can do that they know the coding process enough they should pass. If the assignments are so simple chatGPT can solve them without that it's the professors issue.",
            "This would flag basically every line unless you’re doing a lot of crazy inlining lol. Every loop, standard library call, declaration, etc lmao",
            "As an opposing viewpoint, I'm a Professor (non-TT) in a STEM program at a small university that uses Turnitin for code assignments. The goal is not to detect students who use very similar methods because in most cases the students will be completing the same assignment and therefore the methods will be almost identical.\n\nThe real use is to detect groups of students who all submit identical code, with zero changes except their name. Yes, there are only a few ways to define a function. But if your function, which does several data cleaning steps before outputting a dataframe is identical to three others students' function, I'm going to assume you cheated.\n\nStyle differences, variable naming, and all sorts of individual aspects will cause your code to look different. I only want to identify exact submissions so I know whether people have cheated.\n\nThe ChatGPT angle is a new one. I'm not sure if ChatGPT generates identical code to identical prompts or not, but it could absolutely be used in a similar way.",
            "Lmao ChatGPT is horrible at algorithms, it will give you smth that looks right & it will sound confident, but most of the time it gets them pretty wrong.",
            "Why not just use Moss LOL",
            "One of my professors asked for Word docs because they were easier to process through plagiarism checkers. I’m not sure if that’s valid, since I imagine they’re capable of running OCR and looking for patterns that way.",
            "Why not the prof just have handwritten test be majority part of the grade. So that he doesn’t have to worry whether people cheat or not on Prog. If they pass the test then they good.",
            "Doesn’t seem like that big of a deal tbh.",
            "That's a terrible way to check. Code is not unique, unlike scientific journals and papers. And there isn't an exact way to \"cite the code.\" There are no IEEE, ACM, or APA standards for citing code.\n\nCode is meant to be replicated. If not, how are scientists will repeat and reproduce other's research?",
            "I know there’s software that can check if something has come from gpt but turnitin is not one of them lmao",
            "The more I learn about professors the more pathetic I think most of them are.",
            "It is not necessarily about detecting ChatGPT. By adding text in the “institutional repository” of Turnitin (and any such tool), allows for automatic similarity comparisons between student submissions.",
            "Lmfao my professor actively encourages us to use ChatGPT and other online resources for our coding assignments. This is for my data structures course but he also teaches an Intro to Java class and encourages the new CS students as well to use AI bots.\n\nAll due respect but your prof sounds a massive tantrum-throwing asshole.",
            "Don't get me wrong, I think it's bad when students do that. But why the f do some people feel the need to go out their way and tell about others. Very concerning behavior for an adult tbh.",
            "> *The professor lost his shit and gave us a lecture on that we won’t learn anything that way.*\n\nYour grammar is not doing you much service here",
            "What asshole told? Screw them!",
            "[deleted]",
            "My university professor has a very cool way of checking the plagiarism, what he do was basically checks all the previous students and current students code for similarities and if it shows a 65% similarity he would fail both of those students assignments plus the students that cleared the course won’t get away as he would inform the other teachers and they would give the students in their class zero on their recent assignments, the whole university hates that professor but I loved him as he was really talented and have a deep knowledge on what he was teaching.",
            "Lol does he not have moss",
            "Your professors not wrong, all the kids who used chat gpt their entire senior year at my school are jobless or much lower paying jobs",
            "    I had to teach myself everything in his class because he’s very bad at teaching.\n\nOh so you had to study? How horrible.",
            "I thought turnitin could not read from pdf files",
            "My professor has open Google+ChatGPT assignments and exams",
            "prof should just use gradescope",
            "Use a code editor that tracks history.  Submit the edit history to your professor, or just save it unless/until you're accused.\n\nSad that it's come to this, but that's the way it is until people figure out how to deal with AI.",
            "If he is also looking at plagiarism check, then it will be trouble. One of my professors did that, for computer networks subject. It showed high plagiarism with the keywords of C like int, include printf. And it cited some Fibonacci series code as source.",
            "Sounds more like a threat to scare students.",
            "It’s foolish to not use chatgpt to help you learn. \n\nIt’s even more foolish to use chatgpt to avoid learning.\n\nI think mostly everyone agrees with the former.\n\nUnfortunately the latter does not seem obvious to some of the defensive commentators here.",
            "Use it as a tool not to cheat. . When learning I forgot how to do simple loops all the time.. ChatGPT'will destroy your learning process.",
            "turnitin flags literally everything, my \"page 1 of\" was flagged so many times I eventually starting inserting it as screenshots before exporting to PDF and somehow that made the character recognition not work for those portions. I'm sure they've updated it though since then.",
            "As you probably know, turnitin has a new AI detector software that came out a bit ago. However, most professors recognize that it is too early to use it as hard evidence since its a new system and has flaws in it. So if you do get accused of plagiarism, i would bring up how many in academia are not certain about the validity of turnitin ai detection software.",
            "i mean... code isnt like essays, you cant have a lot of ways to solve a problem at the same level, especially in school, like you have to stick to the algorithms thaught, and to the implementation you have been thaught, in the language you are learning, not like english where you have an ocean of words to express the same idea, i mean i dontt see anything you can do beyond changing variable names?   \n\n\nGL",
            "!",
            "absolute bullshit"
        ]
    },
    {
        "post_id": "qylsme",
        "author": "abcdthrowawaynsj",
        "title": "(Top 12) Highest Paying Companies for New Grad",
        "url": "https://www.reddit.com/r/csMajors/comments/qylsme/top_12_highest_paying_companies_for_new_grad/",
        "score": 430,
        "num_comments": 147,
        "created_utc": 1637464575.0,
        "selftext": "This post is inspired by the [Highest Paying Tech Companies for New Grad](https://www.reddit.com/r/csMajors/comments/k0ze86/highest_paying_tech_companies_for_new_grad/). I have collected some information from [levels.fyi](https://levels.fyi) and [cscareers.dev](https://cscareers.dev) and compiled the top paying tech companies for the 2022 cycle. This post focused on first year total compensation as it is normal to be promoted from L3 to L4 in 1 to 2 years, thus recurring TC is not focused in this post.\n\n&#x200B;\n\n1 . **Stripe** : 134k Base Salary, $79k Stock per year, $73k Signing\n\nFirst Year TC: $287k\n\n2 . **Meta :** 124k Base Salary, $55k Stock per year, $85k Signing\n\nFirst Year TC: $264k\n\n3 . **Rippling :** 140k Base Salary, $101k Stock per year, $10k Signing\n\nFirst Year TC: $251k\n\n4 . **Roblox :** 146k Base Salary, $69k Stock per year, $35k Signing\n\nFirst Year TC: $250k\n\n5 . **Lyft :** 135k Base Salary, $65k Stock per year, $35k Signing\n\nFirst Year TC: $230k\n\n6 . **Robinhood :** 135k Base Salary, $44k Stock per year, $50k Signing\n\nFirst Year TC: $228k\n\n7 . **Uber :** 130k Base Salary, $44k Stock per year, $50k Signing\n\nFirst Year TC: $224k\n\n8 . **Asana :** 142k Base Salary, $50k Stock per year, $30k Signing\n\nFirst Year TC: $222k\n\n9 . **Palantir :** 135k Base Salary, $55k Stock per year, $30k Signing\n\nFirst Year TC: $220k\n\n10 . **Snap :** 140k Base Salary, $58k Stock per year, $14k Signing\n\nFirst Year TC: $212k\n\n11 . **Google :** 141k Base Salary, $48k Stock per year, $21k Signing\n\nFirst Year TC: $210k\n\n12 . **Doordash :** 135k Base Salary, $44k Stock per year, $20k Signing\n\nFirst Year TC: $199k\n\n&#x200B;\n\nI hope this post helps.",
        "permalink": "/r/csMajors/comments/qylsme/top_12_highest_paying_companies_for_new_grad/",
        "comments": [
            "Ah yes SMRRLRUAPSGD.",
            "If you are putting in companies with paper money stock like Rippling then add Nuro.",
            "What do you need on your resume to get an interview at these companies?",
            "This really isn’t accurate. Some issues just off the top of my head:\n\n1. Missing several Quant firms that hire new grad SWE (e.g. Two Sigma, Citadel, Jane Street), all of which in the 300k - 400k range\n\n2. Missing other companies as well. For example, Palantir is 220k/year",
            "Why would you put the absolute highest Facebook returning intern offer and then not do the same for the other companies? Google can go much higher. \n\nThis whole list is just flat out wrong. You’re missing Nuro, Databricks, Scale AI, Brex, etc. which pay more than a lot of the companies you have on your list",
            "[deleted]",
            "Meta is inaccurate since that is for rockstar intern. The real TC is around 230k for the first year. You are also missing companies like Databricks, Snowflake, Nuro, Brex, Chime, etc. that all pay 220k+ for new grads.",
            "Company: Hey kid, want to make more money than 99% of the world and probably both your parents at just 22 years old? \n\nStudent: Sure! How do I get a job?\n\nCompany: So just prepare some question on leetco-\n\nStudent: REEEEEEEEEEEEEEEE",
            "where do you find signing bonus data?",
            "I don’t know what TC means and at this point I’m too afraid to ask.",
            "shoutout to Rippling and Asana. 99% of this sub sleeps on Enterprise companies",
            "u forgot Nuro. first year tc 251",
            "Lol @ people mocking meta/google saying its low tc/low prestige nowadays",
            "Where’s LinkedIn ?",
            "Did you pick the highest possible offers you found after negotiation? Uber, Meta, and Google look totally inaccurate, though I guess someone could negotiate up to that point with very high competing offers. Or rockstar offer with Meta.",
            "WHAT IN THE WORLD! 85k signing bonus is BONKERS! I have been living under a rock!",
            "Location, location, location, most of these look like NY or San Fran TC. When you account for location, return intern at Amazon isn't that much different than new grad at Google.",
            "I think you're missing Netflix at 300k total comp; [levels.fyi](https://levels.fyi) just added a new tier.",
            "Amazon doesn't pay much to new grads?",
            "Would love to see a UK version of this",
            "Does new grad refer to people who have completed their undergrad study (bachelors)?",
            "Where did you get the info for Meta, looking at levels right now and it looks like the average for E3 is 180-190k",
            "My 150k looks like 🥜 :(",
            "Could you also do this for Europe?",
            ".... I need to get into cs",
            "Wow! Thanks",
            "How many working hours per week for each company in the list? I would expect higher TC with longer hours. Your input is appreciated",
            "Netflix not on here?",
            "This information is kind of misleading if you're trying to make formal decisions or believe this is the total compensation for every new grad at the respective company. So just take it as an interesting post, these offers are insane, but these are pretty much peak without lots of factors to consider.\n\nFor example, location, how signing bonuses are distributed, vesting schedule, negotiating and incorrect data given by randoms on levela.fyi.\n\nI will say these companies do offer generally 200k+ TC in HCOL areas.",
            "[deleted]",
            "[deleted]",
            "Note: meta bonus mentioned is only for returning interns and stripe stock vesting is different, stock is vested each year: meaning the value of the stock is calculated at the start of each year rather than how most companies do a 4 year vesting schedule. So the upside is not as high",
            "Where’s Salesforce? Even non returning interns make 200k+",
            "Uber seems a lot higher from what I see on [levels.fyi](https://levels.fyi) so how did you arrive at the numbers you got?",
            "Hey could you please share more of your methodology in how you arrived at these numbers? Because this suspiciously looks like things were pulled out of your ass, especially since you made a throwaway account just for this.\n\nYou claim to have gotten this information from [levels.fyi](https://levels.fyi) and [cscareers.dev](https://cscareers.dev) but as other commenters have pointed out, a lot of things are askew.",
            "I have seen 600k nee grad offer at citadel which will make it to the top of the list for sure",
            "you forgot all the hft and hedefunds that generally pay 250-400k for new grads.",
            "RemindMe! 1 day",
            "Can you do one for all companies as well?",
            "My palantir signing bonus was 45k and tc is 235k as a returning intern",
            "this is completely wrong considering quant firms pay 2x all these salaries for new grad",
            "Isnt Netflix like 350k?",
            "[deleted]",
            "[deleted]",
            "remind me! 1 week"
        ]
    },
    {
        "post_id": "msj7qr",
        "author": "bignthrowaway4473",
        "title": "A comprehensive guide to getting big tech offers from a low ranked school",
        "url": "https://www.reddit.com/r/csMajors/comments/msj7qr/a_comprehensive_guide_to_getting_big_tech_offers/",
        "score": 436,
        "num_comments": 32,
        "created_utc": 1618630506.0,
        "selftext": "**Preface**\n\nI keep most of the specifics ambiguous so that I don't get doxxed but I try to give as accurate of a reading of my position as possible so that you have an idea of what's capable/likely.\n\n\n\n**Why listen to me?**\n\nI'm a senior graduating this semester (Spring 2021) at a low/non-ranked university. My school is somewhere between ranks 75 and 150 on [this list](https://www.usnews.com/best-colleges/rankings/national-universities) and also between ranks 75 and 150 on [this list](https://www.usnews.com/best-graduate-schools/top-science-schools/computer-science-rankings). I've interviewed at and gotten offers from 2 of (Google, FB, Apple, MSFT) and am going to be working at one of them when I graduate, and have gotten an offer from a unicorn that is one of (Airbnb, Doordash, Roblox, Tiktok, Square, Robinhood, Coinbase, Dropbox), I've done many big tech interviews so I'm familiar with the process, and I've been in positions where I've struggled to get interviews like many of you.\n\n[Here](https://i.imgur.com/aMIDAwB.png) is a Sankey diagram of my Fall 2020-Spring 2021 application season. Note that I have 26 OAs and only 11 next rounds. I don't think it was like this in the past (but maybe someone can testify for/against it) but some companies have started to resume screen *after* the OA instead of before. My leetcode count is 84/214/56 (easy/med/hard), my leetcode contest rating is >1800, and my codesignal is >845 so I'm pretty confident about how my performance on most of these coding challenges go and am familiar with the level of difficulty of the problems I see on these OAs. Despite this, I've only received 42% callback even though I'm confident I've optimally solved all problems in my OAs for 24 out of 26 of them (this is a pretty bold claim but if you take into consideration that the majority of the OAs are *significantly* less difficult than leetcode contests then it no longer seems so farfetched. I mean, seriously, most of these OAs are a joke. Citadel and Tiktok had notably difficult ones, most of the codesignal ones are pretty standardized and the hardest questions you'll get on these are harder meds or easier hards.)\n\n\n\nNon-doxxable (at least I hope so) background\n\nI went to a normal public school and did a lot of math competitions and some coding competitions. Didn't really do very much coding at all until my freshman/sophomore year of college though and any of you could probably be better at coding than high-school-me within 3 months.\nHad good success at math competitions and many interviewers have actually asked me about these competitions during the behavioral portion of interviews, in addition to them being very very good precursors for developing problem-solving ability prior to digging into CS.\n\n\n\n**Note that this isn't a guide you should follow year-to-year, but instead a general outline of progression. If you get lucky enough landing interviews and can manage to skip a year (for example, getting a SWE internship at big N your sophomore year) then you're probably familiar enough with the process to no longer need to follow a strict guide, or you can just follow the advice as a step-by-step process instead of strictly year-to-year.**\n\n\n\n\n\n\n**Freshman Year**\n\nThis is when you have to be the most resourceful. Leverage any on-campus opportunities you have (other departments, IT offices, friends, family, etc.) to get any internship you can that lets you apply well-known technologies (Java, C/C++, Python, SQL, JavaScript/HTML/CSS, etc.). Mine paid <$10/hr and I wasn't doing it for the compensation; it was a great learning experience and I had supportive and helpful mentors/managers that just wanted to see me learn. Most of these interviews will only be behavioral. Just don't be a dick and you're good.\n\n\nMake friends, party a lot, and have fun. You're still in college after all. Grades do matter though, so try to keep them up. You just don't necessarily need a 4.0 to get interviews.\n\n\n**Sophomore Year**\n\nGetting some internship experience and working on personal projects can get your foot into the door for a lot of companies that like to interview *a lot* of people, and most of these can be very helpful as \"feeder companies\" to top companies (name-recognizable so that recruiters have some sort of indication of your capabilities and potential - similar to how companies love to hire from HYPMS + Berkeley/CMU because the average competency of those students is high). Amazon is the most accessible resource I'd recommend since they weigh OA very highly (if not entirely) for receiving interviews and I've been able to get OAs from them with next to nothing on my resume.\n\nLeverage sophomore and diversity internships (**especially** if you actually fit the target demographic). Many top companies have sophomore internships that have lower bars (both resume-screening and interviewing wise) and often lead to an automatic interview for the junior SWE positions. Some of these are, but not limited to: Google STEP, Microsoft Explore, Facebook University, Twitter University/Academy (?), etc.\n\n\n\n**Junior Year/Senior Year**\n\nGoing to combine these two since they're very similar processes, but instead of applying to SWE internships junior year you're just going to be applying to \"SWE New Grad\" postings senior year.\n\nThis is where it starts mattering a lot, and where I started taking the process a lot more seriously. As a student from a low ranked school you're going to have to make every interview count. Hopefully the previous internships you have will help you get interviews for more selective companies. It's hard to fully identify whether my previous internships helped due to confounding variables (covid recruiting season) but I think they did help a lot, since my callback from top companies was much better than in the past, despite the generality of recruiting being much worse this year, especially for new grads.\n\nMake a plan to leetcode regularly, keep track of applications via excel/spreadsheets or notion, and practice behavioral questions. The behaviorals aren't difficult to pass but you should make sure there aren't any common questions that could catch you off-guard; they're just a sanity check. Don't act like an arrogant prick and you should be fine. One of the best resources I've found that is uncommonly used is leetcode contests. They function as a time-sensitive environment (similar to interviews) that doesn't give you a hint at the topic of the problem beforehand. Often times doing random problems or doing problems off a list of topics gives you an idea of how to solve it before you even start, which eliminates some of the skill necessary to identify the approach. Grokking also saves you a ton of time by categorizing common topics and a providing built-in IDE to work with. $80 for a year subscription of it and $35/month for leetcode premium both go a long way.\n\n\nResources I've used for preparing for interviews:\n\n* CTCI (everyone's heard of this, it's a bit outdated especially in terms of difficulty of problems, but it's a great start)\n* Leetcode (duh)\n* Leetcode contests (underrated resource)\n* Grokking the coding interview (underused and also underrated resource)\n\n\n\n**Miscellaneous Advice**\n\n\n\n*Take every hint from your interviewer very seriously*\n\nOften times if you're going down a completely incorrect path, your interviewer will try to help you out with cleverly masked hints. Make sure you're listening to everything your interviewer is saying and don't lose track of anything. It's fine to ask them to repeat what they've said or to just ask for a moment to think. I often do this and while it's extremely important to vocalize your thoughts, I'll take 15 seconds of silence brainstorming every possible relevant approach over spouting nonsense that signals to the interviewer that you have no clue what you're talking about. \"Rubberducking\" is a very useful skill when practicing problems and can help you identify painpoints and obstacles. I wish I was better at simultaneously speaking and processing everything/running through all the possibilities, but I'm not. And that's fine. (As far as I know). Just don't take it too far and have 10 minutes of complete silence between you and your interviewer; pass ideas through them if you need more time to think. You get additional time to think while they're giving their thoughts on your brainstorms.\n\n\n\n*Quant/HFT*\n\n\nThis is a topic that everyone seems to be discussing about nowadays since these firms have very high bars and pay a lot. I know a lot of people that now work at these firms from high school competitions (they even start recruiting (maybe not recruiting for positions *right now* per se, but familiarizing talented kids with their names so they know to apply later once they start college) as early as high school, many of these firms came to math competitions and gave out swag/held presentations) and if your goal is big tech then I wouldn't recommend pursuing these opportunities (as a trader) unless you already have previous math competition experience or have already taken probability/stats courses. The interviews are only tangentially related to big tech interviews and you may not have time to prepare for both; they often ask leetcode but also supplement it with probability/stats brain teasers and much more. Some common topics you should be familiar with are bayes theorem, markov chains, general statistics knowledge, etc. They're also a lot more flexible with what your major is; you can major in physics, math, statistics, computer science, whatever as long as you're from a good school and demonstrate competency.\n\n\n\n*Learn how to filter information from the Internet*\n\nThere's a lot of useful information on this subreddit and /r/cscareerquestions but I've seem some pretty egregious advice being upvoted. Some people will have their linkedin or name attached to their reddit profiles too and I've seen the same people give advice about trading firms or top tech companies while having absolutely zero experience working at or passing interviews for these companies. It's like the blind leading the blind... Learn how to filter this out. If you're hearing something for the first time then do what's in your power to find other sources that verify this information. If it's hard to find anything, it's unlikely that person is giving helpful advice.\n\n\n\n*Don't cheat yourself*\n\nWhen I'm tired or frustrated I'll peek at the solution/discuss page for leetcode problems I'm working on, but it's generally not a great thing to do unless you're completely stuck. I'd recommend spending at least 45 mins on a problem before giving up and reading the solution, and sometimes you can make a lot more progress reading the solution instead of wasting another 2 hours staring at a problem until something pops into your mind.\n\n\n*Mediums are the best \"bang for your buck\"*\n\nI realized pretty early on (maybe ~40 or so problems) that easies didn't teach much, but they're a good precursor if you're uncomfortable with mediums. Easies are probably enough for most sophomore programs/internships. Mediums and easier-hards are generally what you'll face for big tech. Hards can be more common for very selective unicorns.",
        "permalink": "/r/csMajors/comments/msj7qr/a_comprehensive_guide_to_getting_big_tech_offers/",
        "comments": [
            "Hey man, thank for posting this — I am also heading into a state uni, and I think this is extremely helpful as an upcoming freshman. \n\nDo you have any more advices as to what I can do the summer before I head for the fall semester ? Also how many courses should I load myself up with and how to balance that with job, exercising, clubs, sleep and friends ?",
            "what is an \"OA\"",
            "Interesting post. As background, I graduated in CS/Math many moons ago (from a currently ranked top 30 CS program - public U).  I have hired in tech/CS and my spouse currently also does so for an east coast based fortune 500 software company as a tech VP (also a public U grad).  AND one of our kids is currently doing CS at a top 15 program on the linked list (not a private - chosen because it was a debt free economically sound choice).  \n\nThis is going to sound like rhetoric, but it's MUCH more about you and what you do your college years and how you show initiative, tech skills, leadership, people skills, etc.   Heck, some schools that rank high get reps as certain companies as putting out less technically competent grads.  Every company is different.  Everyone hiring is different.  Don't take it personally if you don't get an interview.  My kid is at a top 15.  Plenty of grads out of that program flounder too.  Employers aren't lining up - everyone has to create their own experience and make their own case for hiring.  That doesn't mean their isn't nepotism but there isn't a lot of point to fighting that battle. \n\nThe big companies get so much hoopla and press.  Both my spouse and I actually job hopped several times as young professionals.  I learned and was given so much more responsibility at the smaller quirkier start ups.  Your first job doesn't need to be your last job.  Find something in the direction you are hoping to go, give it 18-24 months and start putting out feelers.  My public U spouse manages MIT grads regularly.   I know plenty of people that went from obscure company A to fancy company B with the right experience and references. And I also know plenty of people who weren't super impressed working for fancy company B anyway.  As you move through your career to change jobs, it becomes as much as finding a fit for a place you would find pleasant to work and not trying to mold yourself exactly to what you'd imagine some fantasy company might want.\n\nGood luck new grads and congrats!",
            "[deleted]",
            "Wish I saw this when I started college. I'm in my penultimate year now. All I can do is LC away and hope for the best for 2022 new grad",
            "Ironically, posts like these make looking for an internship only harder.\n\nEdit: *landing an internship*",
            "If you had the option to, would you have gone to a higher ranked school?",
            "Thanks a ton! You must be one of those math genius I saw in my high school years.",
            "I think the most important part for low ranked school students is getting the interview... pretty much everyone knows how to crack the interview and study for it, however the biggest problems these low ranked school students face is sending out applications and not receiving an interview for it. Most of this post was mostly talking about leetcode tips and tricks and what questions for what kind of company.",
            "For me it was at a no name school it was:\n\n&#x200B;\n\nApply -> Online Tests -> Interview -> Offer\n\n&#x200B;\n\n&#x200B;\n\nI think we're seriously over complicating things here",
            ">and any of you could probably be better at coding than high-school-me within 3 months\n\nLOL, you're underestimating people in this subreddit",
            "Any other companies like Amazon, that maybe pay less than them but give interviews mostly based on OA?",
            "What is OAs?",
            "Are you supposed to start doing Leetcode from freshman year?",
            "Thanks so much for giving true suggestions",
            "Thanks for sharing",
            "Did u put ur competitive programming stuff on ur resume? If so, do u think it helped for the unicorns?",
            "This is some great advice for even today's job market"
        ]
    }
]