[
    {
        "post_id": "14dh122",
        "author": "iishadowsii_",
        "title": "Is it just me or does this read like a question written by someone who's never written a line of code in their lives?",
        "url": "https://www.reddit.com/r/csMajors/comments/14dh122/is_it_just_me_or_does_this_read_like_a_question/",
        "score": 428,
        "num_comments": 121,
        "created_utc": 1687186928.0,
        "selftext": "&#x200B;\n\nhttps://preview.redd.it/xonbrl9woz6b1.png?width=683&format=png&auto=webp&s=5d4d7d62c5a67603adf013c6c91ac32023eee382",
        "permalink": "/r/csMajors/comments/14dh122/is_it_just_me_or_does_this_read_like_a_question/",
        "comments": [
            "What the hell is an unusual talent? Writing code with your toes?",
            "solved fizzbuzz",
            "my unusual talent is that i can stare at a leetcode question for 3 hours and still not have a single line written",
            "I think it’s just a weird question for any career, not just for software engineers.",
            "It's really a stupid way to ask \"are you a rockstar engineer and are we going to hit jackpot hiring you for cheap?\"",
            "hello world",
            "My unique talent is creating bugs I never considered were possible",
            "This sounds like a question HR made up",
            "probably, but the gist of the question is to highlight some difficult or specific coding problem you overcame that shows something unique about your approach etc.\n\nat the end of the day HR is always involved in hiring so jump through the hoops or sink.",
            "Does the unusual talent of writing enough undocumented spaghetti code to feed an army count?",
            "I print ‘goodbye planet’ instead of ‘hello world’",
            "\"I can follow the code I wrote a year ago without any comments\"",
            "to write code with my asscheeks",
            "I always despise questions like this. What is “unusual” talent vs usual? Who defines this? \n\nIt would be different if the asked a question like “Tell me about a coding problem you found complex and how did you solve it?” Because something like that is more about your experience and what YOU found complex not just in some general sense where the definition can vary per person.",
            "Sometimes when I'm really tired, I type code with my nose, but the code never compiles. That's my unusual talent.",
            "Smartest HR person",
            "I wrote my Fortran code while high one time does that count",
            "Just you imo. A bunhc of things you can say:\n- Refactored big piece of script to 1/4th of it's size\n- Optimized that little thing in a cool way\n- This feature is often done this way, however I came up with a cool way to do it like that\n- etc.\n\nBasically throw anything you've done and you've been proud of post factum.",
            "Write codes on paper.",
            "lol",
            "\"I can write procedural code, like everyone else.\" Isn't that unusual?",
            "i can print \"hello world\" in 6 languages. does that mean anything.",
            "Hr... they are the least skilled and most annoying people in the world",
            "No. It is not a question at all. It is a prompt. Being a prompt, and not a question, it does not read like a question regardless of the writer’s experience.",
            "\"I have the unusual talent of bringing down production more than any other engineer in the company.\"",
            "Possibly written by someone whose native language is not English who is not using the word unusual correctly.",
            "What does that even mean lol. Unusual talent? A more appropriate thing would’ve been to ask what you’re good at when it comes to software engineering so you could explain some of your skills.",
            "Not just you, I agree. Also what the fuck is that question?",
            "This question could be an opportunity to:\n1. Eliminate the braggadocios who when given the opportunity to parade surge forward with the motto, \"carpe diem!\"\n2. Expose the top level talent by giving them a chance to frame a fulfilling moment in their history by highlighting that one special success and the process.  \n3. Ad infinitum\n3.",
            "\"I can write a program that returns 1 if the program can end in finite time, 0 otherwise\"",
            "GCC -o GetAWomanPregnant.c Currently_Have_Two_Trophies.txt",
            "Still better than \"how many lines of code have you written in {insert language}???\"",
            "Y'all mf idiots, they just want some bullshit like every other application you've ever done in life. It's not that complicated",
            "This chain hilarious!!! 🤣",
            "I think in context \"unusual talent\" means \"greater than average aptitude\" like your \"unusually\" good at coding",
            "Which application is this lmao",
            "I printed “hello world”",
            "I actually really like this. I would discuss my other roles throughout SaaS (product and customer success), how they have contributed to my education, and how they’d inform my performance as a junior SWE.",
            "My unusual talent is multitasking while on daily calls. I can write code, supply laughs in the chat with work appropriate memes and gifs, while my 2 year old daughter is climbing my back, sometimes covering my eyes.",
            "did a 360 no scope twoSum with my eyes closed",
            "I onc wrot 500 lins of cod without using the letter E",
            "What the hell do they mean by \"unusual talent?\"\n\nDo they mean someone who can code in esolangs or do they mean someone whose code will work despite defying all syntax rules?",
            "They will either get it or discard you right away.\n\nJust write: wrote interpreter for brainfuck.",
            "\"Fixed Y2K\"\n\nThat's it, no explanation lol",
            "Man if you don’t just copy that shit into chatgpt and go with whatever it spits out, you ain’t shit.\n\n😂 😂 😂",
            "I write code on my phone",
            "Your code runs on the first try??????",
            "LMFAO WHAT",
            "I once coded mergesort in JavaScript at 1am while half drunk because I had a test to do for a job application that I almost forgot about. Given that I can’t even do that sober, does that count as unusual talent?",
            "Unusual talent is completely subjective.",
            "\"I can quit vim in a single command\"",
            "Kinda feels like a template in the software their HR team uses to build job application forms, along the lines of\n\n\n\"This position is for applicants who can demonstrate unusual talent in <ROLE_AREA>. Please give an example of a time you demonstrated an unusual talent in <ROLE_AREA>.\n\n[textbox_element]\"",
            "name drop!!",
            "This question feels like it was written by Chat GPT",
            "I once solved an interpersonal staff issue and enthusiastically participate in team building exercises. \n\nThere that is unusual for a programmer.",
            "I'd leave an overly elaborate \"optimized\" solution to FizzBuzz. Here's an article (in Russian) with a few of those: https://habr.com/ru/articles/540136/",
            "just a bunch of blabber tbh, just write about of project you have done in past",
            "Want a real answer? “My unusual talent is solving problems with minimal time spent changing code. My greatest accomplishment is solving a problem with zero code changes or down time. Interview me to find out exactly what I did!” (If asked by anyone with a shred of competence, just say you changed a security permissions setting to throttle API calls beyond a certain rate, preventing future overloads).",
            " Nice try buddy. Chatgpt couldn’t answer this one?",
            "Are they going to pay you the sort of money that unusual talent commands?",
            "I write code on prod and push on Fridays.",
            "My unusual talent is saying, “nah, this still won’t work” and then being correct",
            "This is the type of questin Elon Musk asks.",
            "its a perfectly fine question               \n\nthey want you to sell your self\n\nits just a different way of asking \"give an example of a problem you've solved\"",
            "Is this DE Shaw?",
            "Someone told me I couldn't do something and I didn't give up and figured out how to do it.",
            "It's just badly worded\n\nYou know what they mean, just answer the question.",
            "This is still better than the post from the other day where the question asked was \"How many lines of code have you written\".",
            "Simple, you just write \"I have BDE\""
        ]
    },
    {
        "post_id": "jlceu8",
        "author": "NecessaryGrape101",
        "title": "So drained",
        "url": "https://www.reddit.com/r/csMajors/comments/jlceu8/so_drained/",
        "score": 420,
        "num_comments": 32,
        "created_utc": 1604119132.0,
        "selftext": "Applying for hundreds of internships knowing that 90%+ will reject or ghost me. Not even being sure I'll even get a single offer when all is said and done. Online classes where professors double up on workload because they think that makes a difference. Paying the same amount of tuition as an actual education. Living at home with parents who don't understand boundaries. Not having any social interaction for the better part of a year. The most important election of our lifetime yet happening in the midst of a pandemic. Stocked up on groceries in case the city breaks out in riots in a few days. \n\nI'm drained.",
        "permalink": "/r/csMajors/comments/jlceu8/so_drained/",
        "comments": [
            "Hey, I definitely resonate with this.\n\nI definitely recommend making a Discord server with friends who may be in similar predicaments and chat with them on the regular. I actually run a server with some of my college friends where we just share internships we find with one another, do resume review, cover letter review, and mock interviews, in addition to chilling and playing games sometimes, whether it be Among Us, Jackbox, etc.\n\nWhile it's important to be on the grind, it's also as important to stay well-rested so you can continue on that grind.",
            "In the same boat. I keep myself going by knowing that my hard work today is gonna set me up for a better tomorrow. Take a few minutes every day to think deeply and find what makes you tick. We got this.",
            "Are you going to give up? If not then just continue doing this. People break too easy, and yes it’s gotten harder. Give yourself a small break and continue doing your best.",
            "I can relate so much. Everything feels like its falling apart so I try ro focus on university but Im failing at thay and Ive applied to 20+ with not so much as a rejection letter. \n\nStay strong, we will find our way :)",
            "Tell yourself that each rejection is a badge of honor. It mens you're trying, and fighting. It means you're doing the right thing. Improve what you can, but be proud of your rejections.",
            "Are you me?",
            "You got this my dude. Keep up the grind and remember to take breaks!",
            "I think you watch the news too much. Don't be an idiot, but there plenty of things a young person can safely do during this time. Get some exercise, have socially distant meetups with friends, and whatever you do wear a mask. \n\nNot getting an internship during an uncertain economic time is nothing to be ashamed of. Don't stop trying, but lower your expectations and start thinking of alternative ways for you to have a productive summer this year. For context, I mentored a student this summer through my company because we cancelled our internship program. He ended up getting an instructor position with a coding camp. Made some money and good connections with the company that cancelled on him, and now he's interning with us this summer.",
            "Hey dude yeah it sucks but just gotta push through. I can refer you to a non profit online internship. It’s for a good cause and obviously unpaid but you will learn a lot and it will look good on the resume. That internship is what got me my first job. The CTO gives you tons of 1 on 1 time and you can learn so much from him.",
            "drain gangggg",
            "Don't apply to 100s of internships it's better to hand pick 5 a day and take your time to tailer your resume to them by trying to pick up keywords from the job posting. Majority of companies filter through resumes with software before a human reads it and if your resume does not have key words from the job posting then they more than likely aren't even seeing your resume.",
            "Quite relatable. Watch SNL to decompress and listen to trap. You'll be fine. :)",
            "I get this way a lot. I recommend taking a half hour to put on some chill music and make a nice list of all the things that fill up your gas tank. Then put the list up somewhere you will see it when you feel this way, and stop to do one or a few of those things. Could be big, could be as small as having an oreo. Doesn't matter as long as it feels good and reminds you why you want to keep going :)\n\nAlso: a lot of people are absolutely tanking their mental health with an all-or-nothing approach to COVID. You have to find a healthy balance between keeping everyone safe and getting horribly depressed, alone and hopeless. Minimize your risk, but recognize that not exercising, not getting some sun, and not seeing people all come with risks as well.",
            "You'll be ok dude. We've all been there. I was at my lowest when I applied to a firm that I fully expected to get an autoreject from. I ended up getting an offer for an internship and now I'm back full time. It's hard, and it's not easy. Just gotta keep going.",
            "Man, good reminder on the groceries thing. This year sucks. Hope you get a few moments of peace, OP.",
            "I can help you improve your resume if you’d like. I have a consulting service to help students improve their resume and interviewing skills. Before I changed my resume I used to never get any offers, but after it was day and night"
        ]
    },
    {
        "post_id": "17ymc06",
        "author": "koreanfraud7",
        "title": "the 10 stages of cs students",
        "url": "https://www.reddit.com/r/csMajors/comments/17ymc06/the_10_stages_of_cs_students/",
        "score": 419,
        "num_comments": 51,
        "created_utc": 1700359383.0,
        "selftext": "1. learn that cs pays a lot\n2. be a cs major\n3. pull all nighters for assignments and exams\n4. just to fail all of them\n5. apply to 400 internships\n6. work on projects\n7. grind leetcode everyday\n8. just to get no interviews\n9. be depressed \n10. jump off a cliff",
        "permalink": "/r/csMajors/comments/17ymc06/the_10_stages_of_cs_students/",
        "comments": [
            "Me when I failed at step 2 💀",
            "11. Realize that reddit isn't a great source for advice for your career.",
            "8.5. Gets no girlfriend",
            "I’m 2.5 lines away from reaching to step 10, help me lol",
            "1. Become disinterested in pre-med because it’s boring after an 800 SAT bio\n\n2. Look for other majors that actually require problem solving\n\n3. Go into engineering\n\n4. Choose CS since it’s easier than EE and pays more\n\n5. Learn about leetcode and grind blind75\n\n6. ignore grades in classes and just do leetcode\n\n7. Get an internship at FAANG during an off season while theyre hiring anyone due to bull run\n\n8. Use that experience to catapult you into another internship from a recruiter reach out\n\n8.5. your girlfriend also got a job at the same company\n\n9. get a remote 6 figure TC return offer for NG\n\n10. get hobbies outside of CS and learn to have WLB",
            "for most people in this subreddit:\n\n1. usaco gold or higher in high school\n\n2. study cs in t5 university\n\n3. land faang -> quant -> $400k NG role\n\n4. happy life",
            "The list should have started from 0",
            "1. be in it only for the money\n2. thus be worse at CS than people with genuine interest\n3. wonder why nobody wants to hire me\n\nIt's a mystery",
            "Speak for yourself",
            "0. Develop the CS attitude of entitlement.",
            "Honestly, I have never done all nighters for assignments",
            "9 happens randomly in every stage🙌 10 no, never, life is good and I just need to randomly crazy",
            "Damn even this thread has snarky responses reeking of “I got a position so therefore it’s the same exact situation for you”",
            "Y’all are grim nowadays. I guess I did the CS degree during its golden age. I only experienced steps 1, 2, 3 & 6.",
            "Someone at my old university just did 10 not even joking",
            "Why am I getting fentanyl-prevention ads on this sub…",
            "1. Remove the top half of a running blender with a saw and place in it your face",
            "natural selection",
            "Anyone at number 8 😃😃😃"
        ]
    },
    {
        "post_id": "14sg1fp",
        "author": "EitherAd5892",
        "title": "2024 new grads advice from a 2023 new grad",
        "url": "https://www.reddit.com/r/csMajors/comments/14sg1fp/2024_new_grads_advice_from_a_2023_new_grad/",
        "score": 425,
        "num_comments": 139,
        "created_utc": 1688664725.0,
        "selftext": "Get ready folks to start grinding for those ft jobs. Finding your first job is the hardest task you will ever face in your life, 100x harder than your most difficult class in college. I’m a 2023 new grad and I kid you not I underestimated how brutal the job hunting is until I’ve gone through it myself. Don’t expect to make big $ unless you work for big tech or hft. You can still make decent $ but not crazy six figures. I’m talking something like 70-100k range will be your realistic expectation for total comp. I’m a 2023 grad fyi",
        "permalink": "/r/csMajors/comments/14sg1fp/2024_new_grads_advice_from_a_2023_new_grad/",
        "comments": [
            "Bro I'd be fucking overjoyed if my first job started at 80k",
            "For someone planning to graduate in December 2024, when should they start applying for new grad jobs ?",
            "I graduated Dec 2022 and still haven’t found my first job. I’m a veteran with a shit ton of valuable leadership experience too. It’s tough out there for new grads",
            "Fuck that. I want 200k minimum with free food/drink benefits and will do anything in my power to get it. I don’t care if I’m sleep deprived, no friends, sex deprived, anything. I will get my desired job even if it kills me.",
            "[deleted]",
            "To unscare people a bit:\n\nIf you start early (like now) as I did you may have an easier time.\n\nGot multiple 160k+ TC offers. Many of my friends are making in the 150-220k range.\n\nIt's doable",
            "2022 grad here. Landed my first job in southern NH as a Jr. .NET Developer for 52k a year. I was very lowballed. 6 months in I got a 10k raise and at 1 year another 3k. At 14 months my total comp is ~67k. My advice is even though getting screwed out of money infuriates you, not making money at all does even more. A good majority of my graduating CS class never made it into the field. I had to help my closest friend in the major get a job at my firm because he had been searching for a year with no luck. Be thankful for any opportunity you get that will give you good experience for that future dream job.",
            "70-100k is a lot for the average person, you guys should have realistic expectations.",
            "As a current deli clerk, I'll take it",
            "Dawg what I’m struggling to find a job that pays $60k a year and I’m a 2023 grad 😭",
            "It all depends on the job market.\nI know for a fact that 2022 grads got their jobs with less effort as compared with 2023 grads.\n\nHopefully 2024 grads will find it easier.",
            "I had a job right after graduation. Class of 2021. I thought I had it the hardest that was until the year 2022 and 2023. I was extremely lucky to land a job at Microsoft. I'm now interviewing with byte dance, meta and Google.",
            "2023 grad and he spitting facts. I believe in you guys tho fr",
            "Yeah lol like mfs be acting like they can’t get experience at a good company and transition to tech after like 5-6 years of experience",
            "yeah, 6 figures are on the high end for new grads but then again cs is usually in the groups of high end among all the graduates... nearly everyone i know who do software engineering got 6 figures either right out of school or got salary raised to 6 figures within a year or so. big tech will always pay 2x the average in your area and so will most VC-backed startup companies. your boomer companies like banks, targets, and games studios ect wont be paying that much but on the other hand, these companies do not usually whiteboard you with stupid leetcode. if you want high compensation, grind leetcode and work on your interviewing skills as if it your new found job,",
            "This is why I've started networking already for placements for next year. Can't run the risk of not landing anything even though I just got a job at a tech startup.... never know what could happen down the road so 24 grads, start reaching out to recruiters now to know when to apply for next year! I'm hearing a lot of mid-August as of now since they're waiting to see what hiring needs look like for 2024.",
            "My manager wants me to stay for the fall and it bummer I have to go back to school. I think I got a return offer",
            "ok.  So I tried to read through all your comments, I didn't see anywhere what job you went into.  \n\nTry being helpful.\n\n\\- What made the search hard?\n\n\\- Did they ask for transcripts?\n\n\\- Did you look in more than one area, aka, were you willing to move?\n\n\\- What salary were you asking for, what did you find?\n\n\\- What job did you get finally?  What were you looking for?\n\n&#x200B;\n\nAny of these questions answered would be more productive than basically repeating what you already said.",
            ">Finding your first job is the hardest task you will ever face in your life\n\nI'd say raising kids is the hardest task you will ever face in your life :)\n\nTo bring a bit of light to the end of the tunnel: I agree the market is tough and companies are picky right now. However, there are more resources today to help people find opportunities, improve their resumes, or practice interviewing (I'm building one now!) than there were 4 years ago. And there are some strategies to improving your chances (intern at big tech to get return offers, negotiate multiple offers for more TC, ask for referrals). If you think you'll never get a well-paying job then it can be a self-fulfilling prophecy.",
            "facts.",
            "are you a 2023 grad perchance",
            "70k starting sounds like a dream to me",
            "I somehow got a job offer back in february and it took me less time to get than my internship",
            "My first job out of college was 32k, took the job cause I needed the experience, 1 year later, it’s at 36k but I need a new job like yesterday. Everything is too expensive! Sadly I’m struggling to get even an interview😭",
            "idk about hardest task you'll ever face in your life lol but it is tough right now",
            "I ain’t reading all that",
            "As someone graduating in 2026 should I be worried? /s",
            "I am 100% content with finding jobs that even would only do 40-50k but I have no tolerance for bullshit from employers especially when I know I'm being paid less.",
            "Know your worth, get a couple years of experience and then switch jobs often.",
            "May 2024 grad here. Need advice on if online applications even matter in current situation or shall I just try to get the referrals?"
        ]
    },
    {
        "post_id": "13tmxh5",
        "author": "rahulkpandey",
        "title": "Hyper-practical Tips to Succeed in Your Internship",
        "url": "https://www.reddit.com/r/csMajors/comments/13tmxh5/hyperpractical_tips_to_succeed_in_your_internship/",
        "score": 421,
        "num_comments": 51,
        "created_utc": 1685234213.0,
        "selftext": "I messed up a lot as a Meta intern, here's what i learned... Here is my humble attempt to distill 10+ years of tech experience into tactical tips that separate good and bad interns.\n\nMy experience ranges from a 3-person startup to 400 people at Pinterest to 25K people at Meta. This advice is designed for full-time software engineering interns working at a company with a well-defined intern program (i.e. at the bare minimum, you have a dedicated Intern Manager).\n\nI'm breaking my advice into 4 sections: (1) onboarding efficiently, (2) working with your manager, (3) writing the code, and (4) working on a team.\n\n# Onboarding efficiently\n\n* Act with urgency to get onboarded. Internships are very short, and you need to ramp up quickly to justify your return offer.\n* **Don't be afraid of \"over-asking\"**: if you're polite and include context, you will be fine no matter how many questions you ask. Prefer real-time modes of help (like chat) over email.\n* Don't rabbit hole trying to explore every part of a codebase or environment. There will be lots of things you don't understand when you enter a massive codebase, and that's ok.\n* Aim to merge your first Pull Request (PR) or code change by the end of week 1.\n\n# Working with your manager\n\n* Your intern manager (IM) will play a critical role in your internship experience. **You should have a recurring 1:1 meeting with them**, ideally at a weekly cadence.\n* **Make clear that you want feedback**. Tell your manager (and others) that you treat feedback as a gift, and you act on it quickly.\n* Instead of asking \"*How am I doing?*\", ask questions that give you more signal like \"*Relative to your expectations of progress at this point, how far along am I?*\" You don't want to be surprised with negative feedback at your mid-cycle or terminal meeting.\n\n# Writing the code\n\n* As an engineering intern, **your raw coding output is, by far, the most important metric**.\n* **Keep your code changes focused**. The size of the change will depend on context, but 25-250 LoC is a decent target.\n* Make sure that every code change has an explanation. Add a \"context\" section explaining your higher-level goal, e.g. the goal of your intern project.\n* **Attach a test plan to show that your code works**. A detailed test plan helps reviewers trust your change and also turns the PR into a high-value artifact. Bonus points if you add a screenshot or video.\n* Respond to code review comments quickly (within 30 minutes) and gracefully. Keep an eye on code review notifications.\n\n# Working on a team\n\n* **Broadcast updates to the team regularly**, especially as you hit major milestones. Include a clear description of the problem you're tackling, your progress so far, and your request for feedback.\n* **There should be at least one written update that has a permalink**. Imagine putting a portfolio together of your work -- you want to link to something. A standup update is not enough!\n* Schedule at least a few 1:1s with the key people involved in the project. Talk to them about your project, but also their broader career. The network you develop at an internship can be one of the key assets.\n\nI added a bit more detail to these points in [this blog post](https://www.jointaro.com/blog/the-ultimate-software-engineer-internship-survival-guide/) if you're interested :) Good luck to all summer 2023 interns!",
        "permalink": "/r/csMajors/comments/13tmxh5/hyperpractical_tips_to_succeed_in_your_internship/",
        "comments": [
            "Going into week 5 and yet to submit a PR... (my assigned team is a new effort and the key-man was on vacation for 2.5 weeks lol)",
            "A comment and a recommendation.\n\nI've mentored 4 interns and mentored folks who are mentoring interns.  Holy shiiiiit pisss are you aiming high.  I think if you perform half as well as this guide suggests (and you're learning stuff and things), you're doing great.\n\n1-on-1s is great advice, talk to lots of folks.  If you're interested in grad school / academia, see if your fte mentor or SDM can find you some folks with ms/PhD to talk to.  They can give you valuable insight into later education decisions.",
            "Merging code in the first week? Whooo if I didn’t feel the pressure before, I do now. Starting my first internship in 2 weeks. It’s good to have goals!",
            "[deleted]",
            "Fucking hell",
            "Great tips, just like to add one thing that I notice lots of interns (and even new hires) not doing - asking why a certain task needs to be done. When given a task, try your best to understand why it needs to be done and what's the problem you're trying to solve. If you can't answer that, then you should ask why until you can. Only when you understand the why, can you find the best solution. Too many interns just do what they're told at face level without understanding and give solutions that are totally off.",
            "Wow I thought this was nicely written thank you !",
            "Lol what? My first week was setting up my mac, accounts, messing with bash, and starting to install arch Linux...",
            "This is bullshit",
            "Definitely ask tons of question, but realize that your intern manager is not your personal search engine / debugging tool. Give them context which shows you’ve put effort into solving the problem yourself and helps them better understand where you’re getting blocked. For example\n\nBad question: I’m trying to add a new dependency on a library, but it’s not working. Do you know what’s going wrong?\n\nBetter question: I’m trying to add a new dependency to library XYZ, but am getting an error. Looking at the logs it says there is a conflicting version number. I looked up the error message on stackoverflow and tried the solution suggested in this post (link), but am running into the same error code and am stuck. Any ideas on how to move forward?\n\nNot only does this make it easier for your teammate to understand and help solve the issue, but it also shows you value their time and will make for a good future teammate.",
            "I feel like these \"hyper-practical\" tips are based on your experience at Meta, and hence are hyper-specific for Meta internships. I have a friend who was an intern there, and holy heck was he under constant pressure to deliver merge requests and hit whatever metrics necessary to earn a good feedback. If you're a Meta intern, these might be good advices, but if you're not, don't read too much into this.",
            "I’m an L4 at Amazon, I honestly think this is all great advice. Merging code in the first week is a good goal to shoot for. Don’t kill yourself working if you can’t, but it would surely wow your teammates and boss if you did.",
            "A lot of this is unrealistic and quite honestly, unnecessary. \nYour expectations should be what your manager wants you to do, and if you as an intern think it's unrealistic you should tell them as it's also probably their first time mentoring an intern. \n\nTalk with people, make connections, communicate with your mentor and the rest of your team while asking for stuff like advice and if there's anything else you can do. \nThat's really all you need. Don't try to rush anything or feel as if you should finish projects within your *first week*,  none of that is required and absolutely ridiculous to do.",
            "Thank you!",
            "> As an engineering intern, your raw coding output is, by far, the most important metric.\n\nI feel this heavily varies by company. I'm not sure this was even tracked at any of my internships, aside from maybe at Google. I know this is very important at Meta though.",
            "RemindMe! 9 days",
            "Damn, I wish I could be an intern from Belgium in the U.S.\n\nI heard many said it is hard / impossible to go to the U.S. as an europe intern?\n\nThanks for the tips tho",
            "Rahul always has the best advise",
            "Not sponsored link or whatsoever, but I found this article written by this past intern very useful\n\n[https://blog.devgenius.io/how-do-i-secure-the-return-offer-9b14f074ebc4](https://blog.devgenius.io/how-do-i-secure-the-return-offer-9b14f074ebc4)",
            "This is too Meta specific, that’s literally what you need to be a top return intern at Meta",
            "This is great. I’ve been following Taro for a month now and love how I can immediately apply actionable steps as a new grad in my company. I would want to subscribe to the yearly premium one.\n\nDoes anyone have a Taro referral code that I can use to join? You get $100 cash and I get 20% off."
        ]
    },
    {
        "post_id": "xt9e2c",
        "author": "Infamous-Location-51",
        "title": "120K job at 18",
        "url": "https://www.reddit.com/r/csMajors/comments/xt9e2c/120k_job_at_18/",
        "score": 423,
        "num_comments": 169,
        "created_utc": 1664666844.0,
        "selftext": "Hello! I am currently 18 in community college finishing my internship. Near the end of the internship the company gave me an offer of 120K USD salary for a full time software engineering role. I thought that it would be after I finish college, but the company said I can start January of 2023. I am conflicted because I wanted to transfer to a college to get into software engineering, but the job offer I received is similar to starting pay out of college. I wanted another opinion as I am not sure if I should continue to work at the company or go to college. Also, the company is a top software company internationally.\n\n&#x200B;\n\nEDIT:\n\nHello everyone, I read all the comments and chatted with some people that gave me some solid advice and I saw that a lot of people are thinking about how I am bragging about the situation. First I want to make it clear, YES I am excited to receive this offer, I know it is crazy for a person at 18 to receive this and we are in a recession, but my whole plan had been shifted as I wanted to go to community college for two years, transfer and get a degree. I also have strict asian parents, that dont understand the idea of studying while having a job. I also really had no idea.\n\nI haven't responded yet to anyone down in the comments. I had honestly only been looking for a second opinion on this matter and did not even know the option for full time working with studying (Thank you). I know a lot of people are expecting me to be some genius, or someone who prepared super early, but the truth is nothing like that. For the internship, I had experience in working at a local company for front end development, won some awards in High School, taken AP CS A, IB CS 2, and created some personal projects that meant something to me. I did whatever I saw on youtube, making my resume better, leetcode, and reading cracking the coding interview. By complete luck through the use of mass applying, a company had been willing to take a chance on me. By the end of the internship, the company stated to me that we are extending offers, and they were opening a new department that needed more .NET developers. I know a lot of people are disappointed right now thinking I am something that I am not. I did not have a great resume with many experiences, sure I might have been above average for a person who started CS at my age, but compared to a 4 year graduate, it definitely not that good. I am sure many people are dissatisfied or disappointed and that is why I have not responded until now. I feel like it had been being at the right place at the right time as I feel like I have similar experiences to a lot of people getting internships. If anyone is interested about the specifics in my stats I will state them below.\n\n&#x200B;\n\nCongressional Award Winner for CS\n\nGold Excellence in CS (High school) basically the department chair picks students that have a proven ability in CS\n\nTaken 4 years of CS at my High School  (Exploring CS, AP CSP, AP CSA, IB CS 2)\n\nCS Instructor then promoted to head CS Instructor then to front end developer. (1 year)\n\nCS Instructor again for a data science learning company\n\n**Personal Projects**\n\nasp.net, c#, html, css (what got me the internship because it had direct correlation to the projects they wanted their interns to work on)\n\njava xml - saw this really cool video about a simulated virtual ecosystem online and decided to create it in java, then make it into an app using android studio.\n\n&#x200B;\n\nI will also start responding to people in the comments or people who pm me, so let me know your questions down below.\n\n&#x200B;",
        "permalink": "/r/csMajors/comments/xt9e2c/120k_job_at_18/",
        "comments": [
            "DO BOTH. You could even take one class a quarter/semester and just get your degree slowly while raking in that sweet, sweet cash. Seriously, you will come out on top because you'll be able to pay for your own education while you're getting it, which is really difficult these days. Also, having 100% relevant work experience by the time you graduate will put you in the top tier of people your age. You are super lucky!",
            "Go for job. In IT world exp trumps degree. Dont ditch college, do it part time, one/two course at a time. This will help you save money for tuition too.",
            "I’d like to see the resume that gets an 18yo 120k",
            "Hi, I'm a person who was in a similar spot spot and ended up making 110k at 17 remotely while working on my college degree at the same time. I also had considered full-time for 140k in-person in SF but I realized the opportunity cost compared to getting a college degree was poor (I was confident I could get over 140k out of college).\n\nNot having a college degree for life will tremendously hold you back in terms of security and job hopping (hence leveling). Your career will last you over 50 years, and the security and growth provided by the degree is invaluable. You also have to consider the company - what's the chance of you getting laid off or the company losing runway and going belly up? If you get fired, are you confident you can find more interviews at other companies without a degree? In my case it was a startup, and while it had runway, I knew if I got laid off it would be very hard for me.\n\nThe remote option was also best for me because college is by far the easiest way into FAANG and big tech. Internships are OP, and I ended up getting first-year internships at Apple and Stripe at 17 and 18 respectively. The optimal decision here in my opinion would be where you could somehow do both at once. If that isn't possible, I would still go towards the college degree since FAANG out of college pays more and gives you life-long security. That's a bit more subjective though and you have to be confident you can land a better job out of college.\n\nI'm happy to DM if you have more questions.",
            "Theres a lot of people out there working full time 40-50 hours a week and at the same time going to school. In addition to that, those full time jobs are not even related to the field. You are in a very good spot. Take it now, and continue your college!\n\nEdit: I am one of those people.",
            "Wow, you are in an amazing position. Take it!",
            "At your age, take the job, go to college part time to get your degree, and save and invest some money. You can have both, don’t let anyone tell you otherwise. If you think about 4 years of college would cost your $480k, would you do it? At your age, if you are disciplined with your money, you’ll be able to live a good life and not work till your 60.",
            "As others have stated, take the job and pursue college part time. If you start aggressively saving for retirement at 18, you are going to be miles and miles ahead of your peers and very well off in the long run. Making that much at 18 is bonkers. Make wise decisions.",
            "Tbh its a great offer. But idk the company or future growth. Your choice man, you can always come back to finish ur degree",
            "First of all Congrats! And second, take the position for Christ sake !!\n\nI am genuinely interested to know about your skills, or at least see your resume, I am sure it will inspire many people here",
            "Just do 2 courses a semester. Spring/Summer/Fall. \n\nIf you are 18, you definitely have a few general ED classes free. Take them online if you can. You can easily achieve a B with minimal effort in these. \n\nWithin your major, your gonna have vary interest and difficulty of subject. \n\nDo one a semester of your interest/more difficult classes. \n\nIf you have zero general ED, we’ll since you obviously got a job at 18. You understand your starting classes. \n\nLike programming 1/2, basic DSA. I assume you know about data bases, we’ll that means intro to databases is a cake easy class. \n\n\nAlso tell your company to give you 30 hours while you get your education if time is a worry. \n\nOne lucky ass mf for getting that at 18.",
            "My recommendation would be to take the role as a software engineer. It’s a great opportunity. Look into part-time options for your Bachelors degree like Western Governor’s University. It’s an online, self-paced, accredited degree. Tuition is around 4k for a 6 month term but your employer might cover the costs.",
            "Experience is worth much more than a degree, you can honestly work your way upwards into a better company in the future. Furthermore, a lot of top companies will sponsor your schoolwork in the future, you can get a masters or finish ur bachelors part-time using that without paying. I would highly recommend you take the job and congrats!",
            "This is crazy lol all I’ve ever heard from cs majors is horror stories about how they can’t find work or get paid almost bare minimum.",
            "Depends on how much you value the college experience of socializing and networking and having fun, etc. as a full time university student.",
            "Fuck me I’m a surgeon, made less than that out of college",
            "[deleted]",
            "There’s no objective right answer. If you prep right, getting a 180k+ job should be no problem, and you’ll be hopping jobs anyway if you ever want more money",
            "That is great. You should consider doing studying along with work tho because having at least a bachelors degree is useful",
            "I have now 2.5 your and in college; and I'm getting ghosted.\n\n༎ຶ⁠‿⁠༎ຶ",
            "Mfw reading 17-18 yo’s making 6 figure salaries",
            "So this is the person I competed with, but took my job 😂",
            "What is your financial situation like? If your family is rich as hell, and is going to pay for you to college + support some of your interests and hobbies, I would go to college instead. You're going to make a bunch of life long friends your age, learn a bunch of soft skills, learn good foundational skills, be able to do research and internships in a variety of different fields, and leave with a degree. If your family is poor, or you're going to have to borrow money for college it seems like a no brainer to take the job and accumulate credits slowly.",
            "Take the offer, only if you have the skills to do the job.\n\nOnce you start working, a college degree for the same field is much less valuable. Professional experience alone proves your skills as a swe.",
            "[deleted]",
            "bullshit",
            "College is a tool to get a job. If you got the job, there is no need for college. You can always finish your degree later",
            "120k is not similar to starting pay after college. Take the job.",
            "I would take a “gap year” and accept the offer. While on the job, save the money toward tuition, apply to schools. I expect that having this job of your CV would improve the quality of schools that would accept you. I don’t think you’d be successful at convincing your parents that no college is a good idea. This way, you still get the work experience and the full college experience after a year.",
            "Red flags.\n\n1. CS is not offered at 2-year Community Colleges. \n2. 120K is a nice round number. How convenient.\n3. No one finishes an internship in October. It's the middle of the semester.\n4. It doesn't make sense for them to wait until January to hire someone who is so important to them.",
            "I wouldn’t take it. Not having a degree might hold you back significantly. \n\nAsk if you could work part time and try to do college full time. I disagree with a guy saying to take 1-2 college classes a semester. It’ll take way way to long to graduate. \n\nIf you are only taking 1 class a semester, that is about 14 years to graduate. 1 or 2, Give it about 10. Ridiculous. \n\n120k is not a once in a life time opportunity. That is pretty average for a Software engineer today. You might regret not going to college for the experience later on, or you might be held back by the fact that you do not have a degree. All for what? 120k before taxes?\n\nWith your level of skill, landing a job like this is cake for you, but you can also work to land an HFT offer first year out of college that pays you 500k+. That’s more than if you work at this company for the next 4 years, all in one year only. \n\n\nThe bottom line is that this is not some crazy opportunity, it’s a dime a dozen in this world.  Do not let instant gratification dictate your decisions.",
            "Same thing for me at end of freshman year but lower tc, ended up accepting and working full time while still doing school through remainder of cs degree. Graduated with about 4x the salary I started with as I continued to job hop while in school",
            " I'd go for the job, then take a look at the tuition reimbursement options at your new job and do college part time.",
            "Do part time college and job",
            "Honestly, if you can snag a job offer of $120k right after school, college isn't for you.",
            "Colleges only good for your career when it comes to getting your very first job, after that people focus more on your first job than what you did in college. Many of my coworkers didn’t get a degree in a related field.",
            "I am able to do it doing both work and school full time. However, I had to ensure it was both remote for this to work out I couldn't imagine missing deadlines on either school or work.",
            "& then there is me, 24 working from home as a help desk analyst making 38k",
            "That’s similar to starting pay out of college??? I need to move there immediately",
            "Do both. If you can get the degree online try that if you want but you’re young and you have plenty time for jobs. Definitely get the degree and if you can also get the job, do both but definitely get your degree.",
            "I’m also in camp do both. You can ask the company to help pay for school, but you will likely get their standard tuition reimbursement which I think is less than 10k/year. \n\nSomething I haven’t seen is - can you ask for a reduced salary with an expectation of 30 hours/week instead of 40?  Many companies support this now.  I extended my internships into 30 hour roles during my junior and senior years of college and it was tough, but manageable with my full time course load.  My roles were paid hourly which was great for me because I could work full time during school breaks.",
            "Take the job and finish school part time, most companies offer some kind of tuition assistance, like 5-10k per year. Most jobs won't even care about your degree once you have experience, they just care that you have one. See if you can find an online degree program.",
            "That’s a tough one. I’d probably go for it but keep refining the skills you were supposed to learn during a degree for future positions in your free time",
            "Do college part time.\n\nCompleting the degree will prove useful later on in Life.",
            "You can always go back to college. Take the job and learn some hands on skills.",
            "Go for it.  In the adult work world no one gives a flying fuck about your degree. Experience is everything.",
            "i’d get the degree. you’ll likely get a job out of college paying even more than 120k",
            "Go for the degree, you will thank yourself long term.\nSigned: someone who was in a similar position and delayed my degree by 6 years\n\nEdit: here is the reality. Software engineers are in demand and 120k is good for 18 but the company might not let you grow to your full potential and you’ll end up realizing that getting formally trained in CS at a good university will unlock a lot of doors for you and if you’re smart you can literally go work anywhere you want. FAANG is paying new grads 180+ out of the gate. Go get it done while you’re young, enjoy college, and then enjoy your absolute freedom and incredibly high pay as a top tier engineer. Don’t take the easy route at a boring company that won’t push you.",
            "Bro plz give more context. What did you do to end up on a position where you don’t even have schooling and you have a 6 figure offer?",
            "Do both. But try to enjoy college. Money isn’t everything.",
            "cool man",
            "Take it ASAP.",
            "take the money immediately. After you make enough, you can go back to college full-time or even part-time while holding a job.",
            "Take the job and do college at the same time, be it part time if you have to. Experience is more important than what school you went to. It by 22 you have 3-4 years experience as a software engineer you’d be way ahead of your peers who went to prestigious schools and had perfect GPAs. \n\nBe happy, you made it",
            "Ask if they will pay for the degree. While you work there",
            "I'd take the job and pursue your degree online. Congratulations on such an awesome paying job!!!",
            "Mfw 20 and can't even land a basic internship :(",
            "I’m good friends with the head of infrastructure for one of the FAANGs. He’s godfather to one of my kids.\n\nOne of his early jobs was as a .net engineer. His first employer paid for his masters in CS, and then he then joined this FAANG pre-IPO and headed a team that developed their own programming language.\n\nHe’s made a true fortune, and I think it’s safe to say that you’d be ahead of where he was at your age if you take that offer and work towards a degree while working.\n\nIf you decline or defer and go to community college I’m pretty sure you’d be behind where he was at your age.\n\nI’m happy to relay this in writing or in person to your parents",
            "First off, congratulations! Don't mind people saying that you're bragging; they're just envious.\n\nI would really think personally what are your expectations with college, because if you work you will get way more expertise than any college would give you. And that's not saying that it's impossible to do both, but it's a matter of opinion. Me, as an international, I wouldn't have an option but to finish my degree since it would be easier for me to get a VISA and stay in the U.S. for a while (that's what I did). But to be honest, if I didn't have to think about VISA and stuff, I would accept the job offer and try to finish my college degree while working. I was in doubt of quitting Computer Science during my 2nd year because I just wanted to get into the industry and learn the new tech, but I had no option. \n\nI feel like you already realized that is way more fun to work in tech rather than be in college studying it. So do what you think will be best for ya. Don't let others interfere with you personal opinion, even your parents.",
            "God damn congrats man every time I get on this subreddit I’m reminded more and more about how I needa get my shit together",
            "I'd suggest working at the company and doing online college like WGU.",
            "Can I dm you? I'm in a similiar position and can pursue a job at 18"
        ]
    },
    {
        "post_id": "1caqgd4",
        "author": "No-Boysenberry-4183",
        "title": "What's harder - getting into a top CS school or cracking into FAANG+ ?",
        "url": "https://www.reddit.com/r/csMajors/comments/1caqgd4/whats_harder_getting_into_a_top_cs_school_or/",
        "score": 421,
        "num_comments": 218,
        "created_utc": 1713830939.0,
        "selftext": "I'm referencing to prestigous well known schools (Duke, UChicago, Harvard, Princeton, MIT, Stanford, other Ivys, etc)",
        "permalink": "/r/csMajors/comments/1caqgd4/whats_harder_getting_into_a_top_cs_school_or/",
        "comments": [
            "You can get into FAANG with a <3.0 gpa from a shit tier university. Not saying it's easy, but certainly easier than getting into t10 CS.",
            "Umm well seeing as you effectively have infinite chances to get into FAANG and limited chances for T10s… I’ll say T10",
            "[deleted]",
            "I go to a T15 and can’t get an interview anywhere, let alone FAANG, after just under 400 apps.",
            "Why is this even a debate? To get into schools like MIT or Stanford for CS, the candidate not only need a very high GPA (a 3.9-4.0 GPA is the bare minimum), but they are often top competitive programmers, have won math olympiads, or have worked at top tech companies in high school. These schools are some of the best in the world for a reason. Whereas for FAANG, someone from a no-name school with a terrible GPA can grind Leetcode for 6 months and get into Amazon.",
            "Most of the students from the schools you listed do not get into FAANG as new grads.",
            "top CS school for sure",
            "These days faang hiring is a lot slower than it was in 2021. Competition is intense and companies don’t want new grads but prefer experienced folks as new grad market is flooded. I am very worried about future CS grads as supply of graduates is increasing  at a crazy rate while the demand for them is dropping a lot more. AI is also making workers a lot more productive. A 100 engineer project can be done with lot fewer engineers with help of AI to generate code for you. AI specialization should still be valuable for next 5-10 years but generic SWe demand is going to be low lower at faang. Apple and Google are not growing much and are pretty stagnant. Netflix is not a big employer to begin with. Only meta is still going well now and hiring. Amazon is the least desirable faang and they may also not hire like in the past",
            "Honestly, a top school is much harder these days since most top schools like Michigan, Berkeley, UIUC, etc. cap admissions for CS so it isn't enough to just get into the school but you also have to be really good to get into the CS program at these schools. And unfortunately, I don't think it'll become any easier getting into a top school. A job at FAANG realistically requires you to grind for maybe a year wherase a top school is most of high school and also when the market gets better getting a job at FAANG will become easier.",
            "In a public city college and had FAANG internships with a 2.9 GPA currently a 3.2. So would say FAANG is easy compared to getting into a top school especially the one ending in zon compared to the other Faang I interned at they had the easiest interview",
            "It takes 4 years of high school and like a 2 years before high school to have a chance for a top undergrad school (especially the T20 privates in US News).\n\nIt takes me a few hours at most to prep for a tech company. Let alone the fact you can apply every 6 months to a bunch of places and have a redo. \n\nFAANG+ is a joke to crack. Getting into a top school is extremely difficult to crack (and you only get one chance). Let alone for the latter, you have to sell your childhood (when you aren't even mature) to all sorts of extra curriculars.\n\nAttended Columbia Univ (when US News ranked it regularly T4) and also passed bars for Amazon 2x/Apple/Google (for FAANG) and many other tech firms.\n\nFAANG+ out of college is hard to get in mostly because you don't get the interviews. That's not on you. Just on luck. Since the pandemic, companies have been more liberal with online assessments but overall, the difficulty is really the part out of your control (getting into the loop). The actual interview questions for new grads are absolute jokes that an elementary kid can do.\n\nThe real pain is the politics working at FAANG+. Each day a small piece of you dies. That's the price you pay. And the constant stress of another layoff or offshoring. At some point, it just isn't worth it.",
            "I don't even know why FAANG is so desirable anymore. These companies are run by scumbags who are trying to control the flow of information, erode every remaining shred of privacy, as they are outsourcing and kicking their own employees to the curb at an unprecedented scale.",
            "Imo top CS school",
            "Much easier to get into FAANG+ than a top CS school (but don't lump UIUC, GTech, UW, and UT Austin in with the rest of the list; those are easy to get into in-state). Think of it this way: if you're USACO gold, you can pretty easily pass any FAANG interview (after at most a little bit of practice). Meanwhile USACO Gold barely even moves the needle in college admissions, you need Plat for a nontrivial boost and camp for a very large boost.",
            "Top CS school is more difficult by far, Amazon is a FAANG and has a very low floor tbh\n\nI used to work at Amazon and one red flag it was time to leave was a newer guy at an informal happy hour trashing \"Brandon\" for \"making gas expensive\", guy had a pack of cigs on his desk too and I'm just thinking \"nah in what universe do I belong on the same pay grade as someone who hates Brandon and smokes cigs?\" And I left and got a big pay bump and more skilled coworkers\n\nAnother guy I actually liked a lot and I think he'd be fantastic at sales or marketing but coding was not his forte, lot of noob mistakes in his CRs\n\nAmazon's minimum bar for hiring entry-level is really quite low, you don't need a killer resume, a top school, elite coding skills, etc",
            "I’m out here T5 and not able to get anything 😢 (I’m international I knew the issue when coming to study here)",
            "Top cs school. Most of my Purdue friends got into FAANG.",
            "Getting a job with a big name tech company isn’t really about where you went to school. Not saying something like MIT or Harvard isn’t gonna help you, but it’s 100% not the end all be all. It’s basically a game of getting past the resume scanning robots, getting your resume chosen by a person, and impressing people in the often long and convoluted interview processes. No, of course I’m not at all jaded by tech interview nonsense.",
            "Top cs school. Went to shit state University and studied leetcode for couple months and got offer from G",
            "different. if ur good at telling stories then college is easier. if ur actually good at coding then finding a job is easier",
            "All my friends from a “non-top CS school” who wanted FAANG ended up getting FAANG. Some even didn’t decide to do CS until halfway through sophomore year.\n\nCollege admissions seems a lot more randomized.",
            "Why does everyone want to get info fang. These companies are literally the closest thing to evil as you can get.\n\nI've always been in smaller businesses and it's been the best. No stress. Sure a bit lower pay but I'm having a good time still",
            "faang+ is a very low bar to clear imo.\n\nthat said college admissions is a very different game than the job search. many skills and experiences are not easily transferable. as someone who goes to a t50 state school, getting offers has been much easier for me.",
            "Has going into a top CS school become that difficult?\nHow does it compare to going into medical school?",
            "FAANG+ way easier. They are the largest tech companies.",
            "Top cs school",
            "Got into top CS",
            "At the risk of violating political correctness, it is quite different based on your background. If you are URM school is easier to get into, FAANG+ is hard. If you are not URM as in you are the 'overrepresented' in CS groups top school is very hard, FAANG+ is easy. top CS schools and FAANG+ are not looking for the same group of people at all.",
            "FAANG",
            "Bro! What’s harder is having people skills!!! I went to a regular college and I work for Apple.",
            "Top CS school for sure. I got offers from 3 of them and went to a school I’m not even sure is top 5 in my province.",
            "I think the question should be what provides the better RỒI in terms of effort and time invested? I will say it’s FAANG both in the long term and short term apart from few edge case scenarios where other people in the world choose top school candidates due to halo effect. A strong peer group is a big advantage in these schools which can play out big if you do take advantage of it",
            "Okay okay. I work at a FAANG and got into T5 CS MS program.. should i go for it as international student? 😭😭 isn't market too bad?",
            "Depending on race, socioeconomic status, and background, because it's something like compare Apple and oranges. \n\nThe things clear is definitely there is superficial and luck factors.",
            "These are two very different cases. Comparing apples to oranges really.\n\nThe concept of “whats harder” applied to colleges and FAANG+ is, in my opinion, inapplicable. You see a bunch of cases of kids going to feeder schools that cost $30,000 a year for highschools that churn out a ton of students that go to top schools every year. These are all around the country. I’d say it’s almost expected that these students go to top schools because, since they have more wealth, it’s easier for them to have access to more resources to get into these institutions. \n\nThere are many stories of people having books ghostwritten for their college apps and I have seen consultants getting paid upwards to $20,000 for application reviews and 1:1 help for common apps. College apps have become nothing but a matter of “how much money do you have”.\n\nSo, when it comes down to it, I do think getting a top job within CS is harder. You (usually) can’t rely on your family’s wealth to get you through many of the challenging interview processes that are given by FAANG companies. I’ve seen a ton of students from top CS schools not get a single offer for the summer this season- why? Well, this could be a few reasons. Lack of understanding the material, lack of actual personable skills, not able to network, etc. its very easy to, in a market where higher education is a bare from entry, say that your school name could carry you through. I’m sure it has for many people. But I think people in this thread are severely underestimating the amount of people who apply to these high profile opportunities.\n\n[A googler’s experience](https://www.businessinsider.com/what-its-really-like-to-be-a-google-intern-2013-5) from 2013 said that they had 40,000 people apply and only 1,500 people were accepted- which is an acceptance rate of 4%. Now imagine how high those numbers might be ten years later in the current job market.",
            "I got rejected from UT Austin but got into AWS so definitely faang lol",
            "UT Austin is a special case.  If you aren’t a Texas Resident, you have 4% of spots open to you.  Even if you go to UTD or UTSA like I did, transfer students like me only have 10% of spots open to them.   It’s really awful.",
            "I dropped out of a public state-funded university and work at FAANG. Never in my wildest dreams could I have fathomed attending a top CS school (depending on your definition). That being said, I meet plenty of people from those schools that are absolute dingbats and tried for years to crack FAANG. Focus on getting into the best school for what your long-term interests are, or at least what school gives you the best options in case you aren’t sure. Focus on figuring out what you want to focus on and you’ll be fine. Prestige only gets you a good party conversation at a certain point.",
            "Getting into a top CS program",
            "I went to Berkeley for CS and started full time work in a FAANG right after graduation, I feel like most of my friends at Berkeley didn’t end up in FAANGs though; they’re def all very smart and driven, but landing in that specific set of companies right away is a combination of mostly luck, technical skills (which most T10 CS students should have), and honestly interview skills that you kinda have to learn by doing.",
            "Top10 school",
            "Why does it matter? Honest question. How does this information help you in any way shape or form?",
            "Still having passion after school or entering the work force",
            "I went to a top CS school…just not for CS.  \n   \nCurrently work for a FAANG+ company.",
            "FAANG is more about luck, due to sheer # of applicants. Since you can write a script and mass apply.",
            "There’s more to life than being the top 1%. You can have a pretty great life going to a 2nd tier state school.",
            "Well yeah it’s easier to get into FAANG, you have your entire career to try. I’d wager your chances go up dramatically as you get more experience.",
            "skirt cagey nail library mighty innate fragile oil yam subtract\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "I’m at FAANG now and I went to Oxbridge ( not sure where it ranks compared to American universities  ). \n\nGetting into Oxford MSc was harder. ( getting into Cambridge for my BSc was even harder weirdly ).",
            "People sleep on transferring. Getting in straight from high school is hard, but I had Cs and Bs, went to a shit college for a year, got good grades, and then transferred into a T10 CS program.",
            "I'd compare T10 to quant, not FAANG (one of the A's, and nowadays the G too, make the FAANG rates much easier).\n\nIn general though, I think that job hiring is \\*more\\* fair than school hiring (they both have a lot of BS/luck involved). But with jobs you can try a bunch of times, you're assessed on clearcut criteria, and I know lot more people that went from no-name university to FAANG/quant... but I barely know anyone at a T10 who wasn't from a huge high school/feeder/magnet program ... most T10 college kids got lots of school and financial support to where the path to a top school is much easier. This still exists from T10 to a job, but the support is definitely less.",
            "I went to a top 20 comp sci school.\n\nFAANG+ requires a work ethic I do not yet possess.",
            "yeah top cs school is harder. in my \\*state\\* school, you need a \\*4.3\\* GPA to get in. Although that is the only requirement, a 4.3 for a public state funded school is just fucking insane.",
            "School, FAANG is luck of the draw based tbh one you get to a certain school level",
            "I got into a CS10 as a transfer student from a local college (GT). Here in Georgia we have the REPP program that partner with certain schools so as long as you’re in state and have a high GPA, taking all the required classes + more, good essays, etc., you have a fair shot of getting in. I was rejected once before getting in though LOL. I would say it’s harder to get into t10 vs MAANG.",
            "Keep in mind that University of Wisconsin-Madison has a very high CS acceptance rate because anyone can declare the major once they get in",
            "Tough question 🤔\n\nI would say top CS school is harder. What it eventually comes down to is the cost to break the barrier. FANG is easier consider most prep materials are free. College consultants are way more expensive.",
            " Getting into a top CS school is infinitely harder simply because you really only get one shot at acceptance. \n\nGetting into faang is a matter of spamming applications every six months, so yea. Way more opportunities to break through.",
            "T10. Faang has luck and connection elements. From working I have come across people there who are clueless.\nYour education and skill do not stop developing after undergrad. People who continue to learn and develop skills during their career get better than slackers.",
            "top university and it’s not even close. anyone can grind leetcode for a year or so and get lucky. you can always reapply. \n\ngetting into a top university as an 18 year old requires a lifetime (in the scope of an 18 year old) of achievements. \n\nlook at the applications of these top schools who matriculate. they are all valedictorians with perfect GPAs and test scores. \n\ni don’t think these achievements make you a good engineer. hence why it’s not required at big tech either.",
            "i’m surprised that i keep getting interviews to at faang but i just can’t be fucked to grind leet code so i never get too far",
            "It's not comparable because they require different skillsets. In order to get into a top school, you need to be smart and work hard. In order to get into FAANG, you need to network and market yourself well. Success in industry is 90% nepotism and 10% competence.",
            "Way easier to get into a FAANG. My friend works at a FAANG and he didn’t even go to college. (He did terribly in high school and got rejected from every school. Even community colleges) \nLiterally went to high school, took one computer science course. Studied independently over the summer. Then he did a 3 month coding boot camp, got a job at a start up for like a year. After he got that work experience he applied to Apple and got the job. All about how much work you put into it.",
            "Getting into a top CS school — you have only one chance (two if you’re willing to transfer). FAANG+ gives you unlimited chances.",
            "Anyone can get into r/OMSCS, but good luck finishing",
            "Anyone can get faang+. Not everyone get Duke, UChicago, Harvard, Princeton, MIT, Stanford, other Ivys, etc",
            "It’s just luck either way … way too many fantastic candidates and shitty DEI and affirmative action policies make it mostly luck based",
            "People are saying FAANG, but the percentages, say otherwise.",
            "personally I wouldn't include ut Austin and umich, that's just me tho",
            ">At a certain point, it's luck.\n\nOr money. Or legacy parents. Or some other metric that they want to fulfill. I think blaming luck is a bit too nice.",
            "The school you go to matters very little at the end of the day. T10 school vs T100, it literally doesn't matter. One will give you a leg up with networking, but that's about it. \n\nKeep in mind folks parroting stuff here about school are single data points mostly from people who haven't even started their careers yet, that happened to win a numbers game to start an internship. It's not some magic formula a select few people have cracked. Work hard, learn your shit, be sociable, network your ass off, be flexible, and be lucky. School helps a little on networking and maybe landing an initial screening, but that's about it. You have way, way more control over all the other aspects to where school is negligible."
        ]
    },
    {
        "post_id": "14zvuiz",
        "author": "CyberChefsCookin",
        "title": "I'm so sick of ya'll applying to anything 💀",
        "url": "https://www.reddit.com/r/csMajors/comments/14zvuiz/im_so_sick_of_yall_applying_to_anything/",
        "score": 423,
        "num_comments": 18,
        "created_utc": 1689377822.0,
        "selftext": "A company in my area accidentally posted an internship with no details, no description, no majors listed, no requirements, only thing listed was \"intern\", and it already has 30 applicants. This isn't even a joke it actually happened and YOU ALL ARE STILL APPLYING TO IT. \n\nAnyhow adding [www.linkedin.com##li:has-text(Promoted)](https://www.linkedin.com##li:has-text(Promoted)) to your Ublock gets rid of all those redundant linkedIn posts  ",
        "permalink": "/r/csMajors/comments/14zvuiz/im_so_sick_of_yall_applying_to_anything/",
        "comments": [
            "https://preview.redd.it/5mzvqp47v0cb1.png?width=682&format=pjpg&auto=webp&s=f62b555d0b29c0ed417fcff6d4f8ddc79317f3bc\n\nCs grads/students be like.",
            "[deleted]",
            "The grind don't stop",
            "[deleted]",
            "I swear some mf wrote a program to apply to every posting that had the word intern in it",
            "maybe some people deployed some automated bots that apply for whatever cs jobs",
            "Lol it's nice that you haven't gotten to the point where you apply to any available posting",
            "skill issue",
            "Say it with me: The best ability is availability",
            "This is why you shouldn’t trust the numbers on LinkedIn for example… so many idiot just spamming applications with no idea what the job even is",
            "The application numbers don’t mean anything because they’re often the same job posting renewed each year and the numbers don’t reset",
            "30 applicants. I don’t think that is ALL OF US.",
            "No fucking way these are all promoted posts and they don't outright state them as such?  Wild."
        ]
    },
    {
        "post_id": "w4qffb",
        "author": "Seedless--Watermelon",
        "title": "Microsoft starting to post New Grad and Internship postings.",
        "url": "https://www.reddit.com/r/csMajors/comments/w4qffb/microsoft_starting_to_post_new_grad_and/",
        "score": 423,
        "num_comments": 56,
        "created_utc": 1658434217.0,
        "selftext": "I have been refreshing Microsofts new grads portal for weeks and they are finally starting to remove the old postings and upload new ones, some consulting and finance ones have been added today. Be on the lookout for any SWE openings, I suspect they will be uploaded shortly.\n\n [https://careers.microsoft.com/students/us/en/us-ur-intern-results](https://careers.microsoft.com/students/us/en/us-ur-intern-results)\n\n[https://careers.microsoft.com/students/us/en/us-full-time-results](https://careers.microsoft.com/students/us/en/us-full-time-results)",
        "permalink": "/r/csMajors/comments/w4qffb/microsoft_starting_to_post_new_grad_and/",
        "comments": [
            "[deleted]",
            "As a fair warning the Microsoft hiring pipeline is rather long (4-6 months) and they are slowing hiring right now. For those of you who apply, be patient",
            "Nature is healing ❤️‍🩹",
            "Don’t they have a hiring freeze?",
            "Nice",
            "Are they open to remote fully does anyone know? Very interested but not in the state.",
            "I just applied to their Neurodiversity program. 🙌🏾😊 Thanks to whomever posted this.",
            "What exactly do I apply to for New Grad? Neurodiversity?",
            "Recently got a full time offer as a new grad. Been seeing loads of posts on LinkedIn with people announcing they got an offer. MS is definitely hiring a lot right now.",
            "Is it for summer internship ?",
            "Thanks!",
            "Awesome, thanks for sharing 👏",
            "!Remind me 2 days",
            "probably will be a freeze for SWEs.",
            "!Remind me 2 days",
            "Does Microsoft do remote?",
            "New Grad roles are live now"
        ]
    },
    {
        "post_id": "ov7h1f",
        "author": "outragedpenguin",
        "title": "I GOT A JOB!",
        "url": "https://www.reddit.com/r/csMajors/comments/ov7h1f/i_got_a_job/",
        "score": 423,
        "num_comments": 39,
        "created_utc": 1627739347.0,
        "selftext": "As title says.\n\n&#x200B;\n\nME SO HAPPY! And this is for the deadbeat who can't even code very well :D Hope springs eternal peeps, truly",
        "permalink": "/r/csMajors/comments/ov7h1f/i_got_a_job/",
        "comments": [
            "Congrats 🥳!! You’ll do great! Any advice for us who are still looking, please?",
            "Congrats man.",
            "Congrats 🎉",
            "Congrats",
            "Congrats!",
            "Way to go OP, let the journey continue!!",
            "Could you share some non-identifying details? Like loosely what sort of company, and your qualifications? Just curious haha  \n\n\nCONGRATS!!!",
            "Congrats! I’m sure you’ll do great :)",
            "Yayy congrats!! Super happy for you :)",
            "Congrats!!",
            "Yayy congrats !!!",
            "Congrats man, happy for you",
            "Congrats! 👏",
            "Congratulations! I wish you best of luck with your new job and career. \n\nStay blessed and stay happy.",
            "plasi kari",
            "Hell yeah! Go get your paper brother.",
            "congrats nice job",
            "CONGRATS!!",
            "Awesome!"
        ]
    }
]