[
    {
        "post_id": "16ibi0i",
        "author": "crushed_feathers92",
        "title": "Saw a job having 185,253 applicants!",
        "url": "https://i.redd.it/1l8skd8486ob1.jpg",
        "score": 422,
        "num_comments": 59,
        "created_utc": 1694675448.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/16ibi0i/saw_a_job_having_185253_applicants/",
        "comments": [
            "How is anybody supposed to filter that?\n\nI guess in India there's karma so you can schedule multiple lifetimes for the selection process",
            "It’s based in India. That’s probably normal over there considering they have a population of more than 1.4 billion",
            "Wasn't there a thing on linkedin, where same job post can be reused for multiple cycles and the applicant number just cumulates?\n\nI swear i heard that somewhere.",
            "The overpopulation is insane",
            "However in India ... Probably out of all the applications only a few hundred are actually good enough/ qualified to do the job",
            "I know everyone says this is a problem that will boil away but can I be a little cynical here?\n\n\nWe’ve never had this many people attempt and graduate this degree. It’s skyrocketed. Meanwhile the economy for it is horrible. The biggest and best companies are doing massive layoffs. Every tech company is reevaluating their structure and feel that less employees is just as effective if not more profitable than more employees.\n\n\nThe economy in most areas of the world right now is scary. computer and tech in general is not only going to be exacerbated by the economic issues but also the problem of way too many new graduates to be able to possibly employ everyone.\n\nCS entry level positions are genuinely scaring me.",
            "Crazy shit. Meanwhile in Germany I get 3 offers a week, my customers from other countries are trying to get me to work for them and my current company has a worker shortage so bad they have to get people out of their holiday to finish projects.",
            "Sounds like a great job.",
            "This is what happens when you push CS to everyone's throats.",
            "[removed]",
            "https://preview.redd.it/hyrmmjzvjcob1.jpeg?width=1125&format=pjpg&auto=webp&s=639edeb6a5749a6465a98db5d91af403d0c591da\n\nI search the company name on LinkedIn , I saw the other position of this company, it looks normal",
            "I think something wrong here only 36 reviews tho it seems wrong I can expect this many application but not within 16hours no way and that too looks like a funking startup",
            "Well, it's in India where they have over 1.4b people so this makes sense.",
            "Wow, this is why I’m considering to save 60% of my salary rest assured that a lay off is yet to come through soon. Sorry India it’s like this for you guys.",
            "Well, I'm glad I'm not majoring in CS rn.",
            "So they need a person with both BCom and BSc degree😂😂",
            "Wait what? Bcom? What are they going to do here? Cry about balancesheets not tallying?\n\nEdit: more I read it, weirder it gets!",
            "They first remove 95 to 99% resumes because they don't want to hire unlucky people.",
            "Recruited another data analyst to shortlist applicants",
            "Well it’s India, so kinda makes sense I guess."
        ]
    },
    {
        "post_id": "130d96d",
        "author": "sorrowlnight",
        "title": "Gosh I love CS",
        "url": "https://www.reddit.com/r/csMajors/comments/130d96d/gosh_i_love_cs/",
        "score": 418,
        "num_comments": 66,
        "created_utc": 1682580751.0,
        "selftext": "Don't you get that adrenaline rush every time you finish coding something really hard where you came in thinking that there was no way you could have solved it? \n\nForget about the money, that feeling is why I get out of bed every morning and move 30 inches to my pc and code.",
        "permalink": "/r/csMajors/comments/130d96d/gosh_i_love_cs/",
        "comments": [
            "Right now no. Not really. \n\nI’m stuck on a weird bug that keeps crashing my application even though everything looks fine. I’ve been debugging for 2 days now and i fucking hate CS. \n\nI’ll see you after the issue is solved and I’m back with loving CS. \n\nMe and CS are in a toxic relationship",
            "[deleted]",
            "Don't worry the soulless company work post graduation will grind you down,\n\nYou'll make six figures sure, but you'll work for a company that is using software that was written before you entered puberty, by some firm they acquired 20 years ago and the original devs have long since retired.\n\nAnd any request for modernization will be denied on the grounds of unesscary risk taking. And you will just continue to maintain this barely functioning app on lifesupport for the next 30 years, or until it systemically implodes and management decides to aquire another firm that is offering a better product. \n\n\n\nSeriously that's how 75% of the industry works unfortunately.  You'd be amazed how much of the world economy is running on code from 30 years ago.",
            "Alternatively, you can smoke some weed.",
            "I miss that feeling…..",
            "So Leetcode? 🤣",
            "What ????",
            "Don't let the hater tech bros get to you, god I hate this subreddit sometimes. It's fucking magic and it's awesome, it's why people do it as a hobby and not just a job. See any hobby plumbers? Didn't think so. It's an interesting and fulfilling careers and can be a fun hobby.",
            "May I suggest [Advent of Code](https://adventofcode.com/).  They even have a subreddit r/adventofcode.  There are 400 puzzles to solve.  The first 7-10 days of each year are pretty straightforward.  Then you start to get into some BFS and DFS.  During December, it feels good to solve a Day 22/23/24 puzzle. I will never get in the top 100.",
            "25yoe here.\n\nYes.  I still love that rush.\n\nI'm a C addict.",
            "Oh my, sounds like someone is head over heels in love with coding. I totally get that rush you're talking about - it's like you're on top of the world and nothing can stop you. Who needs caffeine when you have the high of a successful coding session, am I right?\n\nBut let's not forget about the money completely. I mean, we all need to eat and pay rent, right? But hey, if you're passionate about coding and you're getting paid to do what you love, then that's just the cherry on top of the coding sundae.\n\nKeep on coding and chasing that rush, my friend. And if you ever need a break, remember that there's a whole world out there waiting to be explored (but let's be real, coding is way more fun).",
            "I prefer the rush from looking at my bank account on Thursday",
            "No better feeling",
            "yes yes yes!",
            "When I figure it out, yes.\nWhen I'm debating ending it all over a God damn project that I don't understand,  no",
            "Get a life please",
            "Those moments are usually very hard won! Like long, hard debugging sessions. I really enjoy it too but I need a very good financial reward if I'm doing it for someone else's company.",
            "god i wish this was me",
            "i hate you pretentious CS majors",
            "Lol, it's just a job.",
            "Lmao, wait until you get into the industry...sorry to break out for you, but college code is nothing like production. Good luck thou!",
            "ikr;",
            "Yep, no actual coding classes for me this term though sadly.",
            "Seems good until feedback from users demand more.",
            "The fuck? Never. I do get a sense of accomplishment but never so much that I get adrenaline pumping.",
            "It’s an oldie, but I think we gotta bring back the Futurama “Not sure” meme for this one",
            "I kind of used to have that feeling but not anymore because ChatGPT can solve problems in matter of seconds.\n\nEven if it doesn't solve something perfectly, it can give a good naive solution in a matter of seconds.\n\nEven if the naive solution isn't correct, it can give you a solution that takes you to the right direction in a matter of seconds.\n\nThe question is, can you do anything in a matter of seconds? No.\n\nI get it, it's the process that matters. That is, you thought it was going to be hard, you were struggling and now you figured it out. That's cool, I get it.\n\nBut when you know that ChatGPT can just do what you did in a matter of seconds, it just takes that feeling away. Because why waste time when you can be efficient by using ChatGPT?\n\nSure, you can work away at a solution but that's not going to be practical at work either. At work, you need to try and be efficient.\n\nTo me, when I know that ChatGPT can solve a problem in seconds, I just feel the coding knowledge I have is not so useful. I know, I can solve something but ChatGPT can do it 5 times faster and can even give a solution that's 5 times more efficient.\n\nAnd so then, who are you at the end of the day? Someone that took time to solve it. And how is that useful? How are you beneficial?\n\nPersonally, instead of solving different problems, I enjoy doing like a project since that takes creativity because you are using different tech stacks and trying to create something you want to make. At least this involves a lot more thinking than just solving a problem.\n\nBut funnily enough, there is AI that can make a simple full stack app for instance, which is someone's project. And then you just feel useless because of that. \n\nBut that's how I feel.\n\nIf you feel good, then that's what matters.",
            "No I don’t feel an adrenaline rush but I do sometimes want to cry",
            "I feel that when I plan code not necessarily after I complete it.",
            ">there was no way you could have solved it?\n\nI guess I haven't felt that way in over 20 years. I have learned in my career that everything can be solved. It's just a matter of creativity or expense. There's always a way. Now sometimes something can't be solved *within the constraints* like time or money, but there's always a solution if you have enough of either."
        ]
    },
    {
        "post_id": "uh44fd",
        "author": "duckducklo",
        "title": "I'm happy to announce I will be a idle student specialist (ISS) this summer!",
        "url": "https://www.reddit.com/r/csMajors/comments/uh44fd/im_happy_to_announce_i_will_be_a_idle_student/",
        "score": 419,
        "num_comments": 20,
        "created_utc": 1651538633.0,
        "selftext": "I am thrilled to be excited to be enthusiastic to be gleeful that I am starting a new position where I will be sitting in a comfortable manner in my room in front of my desk consuming entertaining content on my computer AND phone simultaneously! Yes, 8 hours a day, 5 days a week, every single week! I couldn't have done it without my fellow classmates who took all the jobs so I wouldn't have to! I look forward to eating and sustaining this piece of flesh I have control over in a comfortable manner!",
        "permalink": "/r/csMajors/comments/uh44fd/im_happy_to_announce_i_will_be_a_idle_student/",
        "comments": [
            "you forgot to ping the recruiters and companies that you rejected after much consideration",
            "Thanks LinkedIn",
            "Reasons why I’m not on LinkedIn: *This post*",
            "Well deserved!",
            "You have been diagnosed with mild to moderate based-ness.",
            "TC?",
            "should i post this on my linekdin",
            "Commenting for Better reach",
            "[deleted]",
            "honestly wish i could go back to being an ISS",
            "my dream job",
            "I remember my college years when i got one of these offers every summer. \n\nNow i have to go to an office and work :(",
            "This sub is going downhill fast. Shitposts are cool but I feel like there should be a bar to entry 😬 congratulations you sick dog"
        ]
    },
    {
        "post_id": "r0w0xq",
        "author": "shravanslays",
        "title": "Recruiter flirted with me in the final round. Does it mean I got in?",
        "url": "https://www.reddit.com/r/csMajors/comments/r0w0xq/recruiter_flirted_with_me_in_the_final_round_does/",
        "score": 423,
        "num_comments": 53,
        "created_utc": 1637726965.0,
        "selftext": "My recruiter at one of the top companies was pretty hot and she was smiling in a cute way throughout the interview. She also gave me her address and told me to come over to collect my offer letter if I got in. Does this mean anything? Can I have hopes on the fact that I might have gotten in?",
        "permalink": "/r/csMajors/comments/r0w0xq/recruiter_flirted_with_me_in_the_final_round_does/",
        "comments": [
            ".....Then I woke up.",
            "You’ll be getting a job. What type of job I don’t know.",
            "These shitposts are getting more creative for sure.",
            "[deleted]",
            "This happened to me once. The recruiter gave me her address and said we should do some DP. I didn’t really feel like solving dynamic programming problems though so I passed",
            "Sounds like you could be getting in something.",
            "peak r/csmajors fanfiction, thinking that grinding leetcode with get you a FAANG offer and a hot girlfriend",
            "She’ll want to give you more than an offer letter",
            "TECHIE FUCKS BIG TIT RECRUITER FOR THE FIRST TIME 2",
            "I did have my final round with the HR on a couch once...",
            "This happened to me in my last interview. The interviewer gave me his email and phone number at the end in case i have trouble with the next online interview.\nEdit: got the offer",
            "Sorry, If you didn’t get an HR round where the recruiter invited someone else to come in towards the end of the interview, then you very likely didn’t make the next round. Better luck next time though!",
            "The only letter u gonna be collecting from her is that fuckin child support demand letter if you keep playin w that thot ass recruiter. U better than that king",
            "😂😂",
            "You are getting in all right",
            "r/thatHappened",
            "When you learn how much recruiters make for each successful candidate, you'll ask yourself why every recruiter isn't flirting and smiling at you during interviews.",
            "Final round at LC",
            "Tell me how the novel turns out",
            "Don’t fall for it. This is a trap. They are trying to see if you are a real CS major because true CS majors practice abstinence",
            "Somebody is getting a job and then another job.",
            "You’re about to receive more than an offer",
            "No lie when I interviewed at Facebook, the person who asked me behavioral interviews was an attractive Latina with big breasts. She was wearing a jacket. \n\nBut midway, she took her jacket off but she had to lurch her chest forward to do it - she was wearing a shirt that showed somewhat a decent amount of her cleavage. It took all my strength not to take a peek when she stuck her chest out but I could see it from the corner of my eyes since we were sitting right in front of each other.\n\nIn the later half I did catch a glimpse but I think she noticed. 🙃 \n\nI didn’t get hired at Facebook. This was last year around February. I was also somewhat sick - probably from covid. Damn she was hot.",
            "Oh u gotten in all right",
            "this",
            "entire TC going to be paying the child support in 9 months",
            "i can't believe we're out here writing fanfics"
        ]
    },
    {
        "post_id": "1348yyo",
        "author": "sugarypi3",
        "title": "I passed my discrete math class with a C+. I am so happy right now-",
        "url": "https://www.reddit.com/r/csMajors/comments/1348yyo/i_passed_my_discrete_math_class_with_a_c_i_am_so/",
        "score": 420,
        "num_comments": 85,
        "created_utc": 1682904393.0,
        "selftext": "I know a C+ isn’t smthn to write home abt, but after failing the first two exams with a 31 and 28, I studied my ass off for the third exam in hopes of not having to take the comprehensive final exam, and the teacher emailed with my current grade in the course being a C+. I was so sure I would fail with a D or F, but I somehow pulled thru 😭 he probably curved the score but idc, I am so happy that I never have to look at this class again.",
        "permalink": "/r/csMajors/comments/1348yyo/i_passed_my_discrete_math_class_with_a_c_i_am_so/",
        "comments": [
            "I swear I saw a post of someone crying about his C+ in discrete math just an hour ago...",
            "I had the same reaction when I passed computer architecture with a C+ lmao. I got a 16% on one of the test lmfao.\n\ngood job bro. enjoy your summer",
            "Good job man, any tips for the class? I'll be taking it next semester",
            "C+ in Discrete Math is something to be proud of for sure. I took that class twice and almost failed the second time, not to mention I saw many of the same faces from the first time. Good job, you did great.",
            "How I felt after physics lol",
            "Getting a C+ in discrete math is when I stopped worrying so much about getting straight As. I was so happy with my C by the time my class was over.",
            "I need to un-CS myself. My brain has been CSed to the point that I saw OP passed a class with C+, and I thought “a new language in C family”?",
            "I think discrete math really changes you as a person. If you could pass a really tough module like that, there’s certainly a lot more you can do if you put your mind to it. Congrats!",
            "If you struggled with Discrete Math, you should take Real Analysis.",
            "Hahaha congrats!! Enjoy ur summer!!",
            "The ultimate CS major weedout class. Also passed discrete math with a C+.",
            "Congratulations!!\nI still have my discrete final coming up this week",
            "Just passed my Discrete Structures class with a C+ as well. I fully get it!",
            "I have a C right now before the final which is on the 12th, please give me your good study energy to get me to a C+ also.",
            "It’s not discrete if you tell everyone…oj. Good effort bud.",
            "I also got C +. Looking back at it, it should have been an easy A for me if I only wasn't taking it during lockdown. \n\nBut yea don't let anyone take this away from you. It's a difficult class. You should be very proud.",
            "Took Discrete Math at a community college with my Uni's approval. I got an A without even trying. It was like, computer organization (truth tables and the like) all over again for me. I'm surprised to see people struggling with this one. \n\nOf course, the dude that taught it was a PhD in Math and was just a very smart fucking guy. Made the course easily understandable.",
            "how did you took exam so early",
            "Nice job! Happiest hit of my life when I got my C as well. That class ate me alive.\n\nI hated our text book and instructor. Just when you're getting to the juicy part in the instruction or book, it says \"left as an exercise for the student\". Like tf.",
            "Same I just found out this morning I passed discrete math with a C+ too. I hated this class so much I’m so happy it’s finally over 😭😭",
            "Discrete math is hard, well done",
            "dude good job discrete math / structures is horrendous at my school. Big win honestly",
            "Putting the c+ in c++",
            "I get how you're feeling, passed myself with a C+ too 😭 was just so happy it was over",
            "A huge congrats. This is one of the classes that people in easier majors never have to experience. Mainly the mental fortitude of seeing your average grade in the low 30s, feeling like a miserable failure and second guessing yourself, only to come out the other side and live the good life. Discrete math was one of the worst classes for me, and taught me a lot about perseverance. You made it, OP! Go celebrate! 🥳🥳🥳",
            "Remember the scientific mantra: C's get degrees ;) congrats!",
            "HAPPY FOR U OP!!! This is literally how I felt after getting C+ in real analysis lmaoo the euphoria of just barely succeeding goes hard",
            "I saw \"C+\" and I came here to self-righteously inform you it's actually C++. nvm! \n\nCongrats on passing!",
            "Our discrete maths class did not have exams, only work.",
            "What's the difficulty comparison between calc2 and discrete math?",
            "Fuck yeah man! Only shitty part is you probably have discrete math 2 😅",
            "Studied so hard to try to get the same grade for my discrete math exam too. So relieving to get it done, but I'm glad it should be worth it in the end. Usually there's a curve for us too at the end, so maybe I'll get a B-? Still pleased with a C+ too.",
            "Never have to 'C' that class again 🫡",
            "I got my Discrete final in about 17-ish hours I am so terrified"
        ]
    },
    {
        "post_id": "vc79kk",
        "author": "OwnAir6660",
        "title": "Coinbase lays off 1,100 Coinbros (18% of workforce) days after CEO Brian Armstrong tweeted at unhappy Coinbros: “Quit and find a company to work at that you believe in\"",
        "url": "https://www.reddit.com/r/csMajors/comments/vc79kk/coinbase_lays_off_1100_coinbros_18_of_workforce/",
        "score": 420,
        "num_comments": 47,
        "created_utc": 1655223748.0,
        "selftext": "Were interns affected?",
        "permalink": "/r/csMajors/comments/vc79kk/coinbase_lays_off_1100_coinbros_18_of_workforce/",
        "comments": [
            "Interns were not affected in this wave.",
            "This should all be a reminder that company stability matters when considering offers",
            "But the reason a lot of these employees work at Coinbase is because they believe in the company… and look where that got them",
            "[deleted]",
            "I'm glad I was rejected earlier this year. I'll never work for a company like this.",
            "... And this is why you should never feel bad about reneging offers. Companies will drop you without even blinking",
            "A recruiter from there hmu in April but I went somewhere else. I decided to check out her LinkedIn out of curiosity… turns out she was laid off. We both would’ve been cooked 💀",
            "shitty stuck up CEO.",
            "Is calling people who just lost their jobs and are worried about how they’re gonna feed families and pay bills  “Coinbros” necessary?",
            "Highly doubt if developers were laid off.",
            "I've seen a lot of posts on LinkedIn of new grad hires getting their offers rescinded."
        ]
    },
    {
        "post_id": "j73r4h",
        "author": "tingleswarp",
        "title": "Intern season 2021",
        "url": "https://www.reddit.com/r/csMajors/comments/j73r4h/intern_season_2021/",
        "score": 417,
        "num_comments": 37,
        "created_utc": 1602120195.0,
        "selftext": "Not gonna lie. I wasn't going to write this post but something changed after reading comments over the last so many posts about finding jobs and interns. I'm in the same boat as these people and this really sucks. Interestingly, with all the negativity in the comment sections, somehow it is actually calming in our chaotic semesters. It feels nice to not be the only person who's going through this.\n\nBut the one thing that's keeping me together is the fact that I am just waiting it out. I was a sophomore last semester and I'm pretty sure I am applied to 100+ companies, and I started early too. My friends were getting coding challenges, interviews, while I was getting rejection emails after emails. I still knew that somehow I would land an internship even though it was already February. By the time we had arrived in February, my friends had already given up. They had given up to a point where they didn't even go to the career fairs for the spring semester. I still believed so I did. That was the best decision ever because I got in touch with two recruiters, one of them moved forward with an interview and I clutched it. Right before college shut down due to COVID. I waited for the moment and when I got it, everything just started to work out for me.\n\nThe point being, it doesn't matter what's going on. By stressing yourself about what's gonna happen in the future, you're stressing yourself two times. Just wait out. You got a rejection? Who cares, apply to two more then. But just don't give up. Nothing's wrong with you or your profile. You just need to wait for your chance and then pounce like a mother\\*\\*\\*\\*\\*\\*.\n\n&#x200B;\n\nEdit 1: Thank you so much everyone for welcoming this post and for the awards. Really glad it worked out :)",
        "permalink": "/r/csMajors/comments/j73r4h/intern_season_2021/",
        "comments": [
            "Thank you for this!",
            "Thank you so much for this! Today I just got rejected from two jobs after I held interviews with them, and honestly, it made me feel like shit. I'm currently a sophomore with little work experience in the industry, so it has been tough. But reading this over really makes me want to continue forward and land an internship I really love!\n\nGood luck to you and everyone else on your search!",
            "Very well said. As a sophomore last semester, I followed the followed the same attitude as you and I lucked it out too! This year, a lot of the companies that usually had their postings up by now haven’t posted yet because they haven’t gotten their budgets yet. So I’m guessing that there’ll be plenty more opportunities next year. Hang on everyone, we got this!",
            "Great post. CS is a career that can last a lifetime. No reason to stress if the first couple years were a bit rocky. Especially when you look back it after 10.",
            "Well said!",
            "I really needed this especially when I got rejected twice yesterday from two interviews. I’ll be having an interview tomorrow and I’m just wishing for the best! Thank you for this!",
            "Thank you, this is really inspiring",
            "This post is so wholesome! Thank you for this and I agree!",
            "Thank you for this post! I’ve not applied to many internships unlike I see others did on this sub but this post gives me some hope! You’re so nice to yourself and others. Dm me if you wanna support and motivate each other further or just talk",
            "Hope is a discipline",
            "Thanks needed this. I look forward to land my first internship but I know its gonna be rocky but nothing to stress and ruin my mental health. If I can't get one, look for the next one.",
            "I totally agree! i have been having a tough semester and things weren’t looking good untilI got an offer from amazon yesterday! Keep grinding and good things will come.",
            "Hey I was offered to apply at an internship for 2021 summer by Schneider electric. The program is called digital engineering development program. I sent my resume and told me I wasn’t qualified because I wasn’t in school. But seems like you are, if you’re interested I can pm you the email of the person and you just send your resume to her. Maybe they pick you..",
            "Thank you for sharing this!",
            "Thank you for this post! It was super inspiring",
            "thank you",
            "For real. It sucks but the other option is no internship or job. If you want it act like it. Keep working, it’s hard but so is everything else in life worth having.",
            "I've had a 100% rejection rate lately. This didn't happen a year ago when I had an even less impressive resume. I think a lot of companies are more selective in hiring interns now because of the economy. I still apply though, but more in a stoic way.\n\nI've been less stressed about internships itself, and more stressed about being under-qualified for the industry overall and my mediocre university CS experience so far.\n\nI graduate next year. At least I have some side projects but it definitely feels like a challenging road ahead.\n\nMaybe I should have went to a bootcamp and then got industry experience in less time  than I spent in college? who knows.",
            "WELL SAID!!!! Good luck to everyone who is applying for an intern or full-time job. This year is tough but I believe each of us can make it out and nail this challenge. JUST remember that you are not alone. All the best for everyone seeing this."
        ]
    },
    {
        "post_id": "1btqfcz",
        "author": "fork_bong",
        "title": "There are too few people taking CS as a major",
        "url": "https://www.reddit.com/r/csMajors/comments/1btqfcz/there_are_too_few_people_taking_cs_as_a_major/",
        "score": 419,
        "num_comments": 89,
        "created_utc": 1712034144.0,
        "selftext": "Things are easier to build than ever. Yet every website I go to sucks. Have you ever visited the website of a news company? Reddit posts are layered on top of each other. I don't know if any of you have the money to Doordash but that app makes me think my grandma designed it. The one time I see a worthwhile post on LinkedIn I've already refreshed the page and the post is gone for good. Google search will literally ignore the words you type. Tell me one travel website where the date filter/selector doesn't make you angry. I would pay triple the money on every move to never go to Uhauls website ever again. And while we are at it, when is someone gonna build R2D2?\n\nTell me there isn't room for a few hundred thousand more of you. I could use a good laugh.",
        "permalink": "/r/csMajors/comments/1btqfcz/there_are_too_few_people_taking_cs_as_a_major/",
        "comments": [
            "You wrongly assume that quality is strongly correlated with market share. \n\nThey can all make their apps better. They simply don't have to as you have nowhere else to go.",
            "I like this. I’ve literally thought the same thing about all these shitty websites. So I reached out to a few local ones near me, told them like “hey just wanted to let you know there’s multiple visible bugs, unreadable text, and error boxes where images should be. I’d love to fix them for you! What do ya say?” They often sound annoyed like I’m trying to sell them insurance or something. I think also it’s a mindset of “well it still gets the job done and that’s what matters”",
            "April fools ended a few hours ago",
            "you confusing the UX designer with a SWE. Here is your MBA",
            "\"bad design\" might not be a bug as you think, websites and apps exist to make money, awkward and aesthetically \"bad\" decisions are made to optimize for making money rather than building the most functional and pleasing open source software.   \n\n\nall technical skills in the end are in service of business decisions and market forces, if you want to make money that is.",
            "CS won't help you with UI/UX design, and CS degrees don't make you a competent web dev. CS is the study of the science of computation. not web design and development",
            "is this satire? There have been multiple articles the last few weeks about the massive influx of CS grads to colleges lol and why would a CS major even be a good front end designer anyway?? Are you learning React on top of building a compiler ..?",
            "Websites sucking is usually not a developer problem but a business problem. If they wanted to pay more to hire more competent developers they could have done so. \n\nIts naive to think that developers alone are the ones who are in full control of a websites quality.",
            "How about \"There are too few **talented** people taking CS as a major\"\n\nMore CS grads doesn't solve all the shitty websites you describe. You need quality grads.",
            "Why is the android reddit app so glitchy. It takes like 30 seconds to dm a single image",
            "Nobody has a crystal ball to say if there are too few or too many in the short term; there is turbulence. But long term, software is only going to keep growing. We are still very early days in terms of society's adoption of tech, and every new venture has tech as a core component. There are only too many CS majors if you believe AI will replace everyone.",
            "I browse Stellantis websites for cars (I like Jeeps) and I always think CS people will have paid work to get done as long as bad web UI like that exists.",
            "There is a very obvious and evident over saturation of people going into CS/SWE",
            "Facts why are so many websites so shit even some big companies have the shittiest most annoying glitchy websites, so strange... I feel like so many swe are actually shit and put in minimal work tbh",
            "Oh boy, do not look for hotels in Japan :)\n\n\nYou'll legit throw your screen out the window.",
            "The people in here 4000 job applications deep will be angry at you not realising this post is about them.",
            "While I don't believe that there are too many people majoring in CS, I don't think that throwing more engineers at a crappy website will necessarily make it better. Sometimes you just need better engineers who actually know how to do the thing they're being asked to do, and aren't just getting by by the seat of their pants.",
            "CS as a major probably won't help to fix shitty design. You'd need more people from majors related to Design, Art or HCI if the school offers it (like CMU).",
            "People don’t want to get a CS degree for the salary that those sorts of jobs would pay. It wouldn’t be much.",
            "I’m doing my masters in computer science even tho I know I could learn it on my own. There are 2 reasons for this. The first is that I don’t think I could learn a lot of the math skills required on my own. The second is that a lot of companies are starting to no longer hire self taught programmers because they suck a lot of the time. Also when I say the math required I am referring to the math required to work with AI algorithms",
            "That’s what happens when you offshore jobs.",
            "Sounds like you want a design or UXUI major, not CS",
            "I will have to disagree.",
            "Someone's gonna have to program all them billions of new microchips everyone's so hung go all of a sudden to build! Might as well be me!",
            "This is nothing to do with the number of CS majors. To me, these people are the tool builders. \n\nPutting together web sites requires good tool users. They don't need to write replacements for Apache, MySQL or Python, they need to be good at using them. There is also the customer interaction part. They need to be good listeners and explainers. You don't get this with a CS major. \n\nAnyone can hang out a shingle and say \"I'm a web designer.\" A lot of people have and clearly there are a lot of bad ones. Perhaps you mean to say that there needs to be education paths that create qualified designers. This harkens back to how guilds got started.",
            "Tbh, a lot of this problem is that software and websites aren't allowed to be \"finished\" they have to keep adding and expanding while incurring tech debt so the business side can tell investors they're doing something new. It's a key part of the enshitification of the internet at large.",
            "bases and optimism pilled!",
            "U-Haul’s website is a crime against humanity.",
            "More people makes things cheaper more than it makes things higher quality. Even those who want to debate this point will often fail to understand what higher quality actually means in this context.\n\nThose sites won't change because they have no reason to change. The website isn't the product for those companies. They just need good enough. And... Ready for it... Changing them won't help them make more money.",
            "I'm taking a CS program but when I look at jobs/ internships there doesn't seem to be as many front end as there are backend positions.",
            "It might be because these sites are designed with what the general population desires in their sites or what the engineering thinks the general population desires.\n\nAnd these are not designed to please people with advanced technical skills or people computer science degrees?",
            "Didn't you see the Nvidia event, they had stars wars style robots on stage",
            "Didn't you see the Nvidia event, they had stars wars style robots on stage",
            "Well most people taking CS confess they only want money. Money fine. I want money too. I also have passion.",
            "At UBC (University of British Columbia Vancouver), there are so want to major Comp Sci that they had to increase places and even then the admission cut offs are rising.\n\nOn the other hand we have like 20 people majoring in History graduating per year.",
            "As companies and ownership becomes increasingly consolidated and markets expand globally, companies don’t have to maintain high quality products or platforms (websites in this case) to maintain high revenue streams. So they decide it’s not worth it to hire more software engineers to make their website 10% better.",
            "Y’all should try the pax website. It’s for a vape that uses flower(weed). It is horrendous!",
            "You had me at doordash. Their product team sucks so bad I actually looked them up on linkedin and messaged them about how stupid their app was.... even though I've spent like 50k on it",
            "I don’t get this, same topic different wording not even a few minutes ago. A post saying too many people take CS. I haven’t checked if it’s from the same person but it’s annoying. I’m going to leave this sub.",
            "If you think these people and companies with shitty websites will pay good money to make it better, I got something to sell you. 😂🤣\nShitty products and websites are there because they don't want to pay for quality. More people are gonna help with this how? You just wanna meme on the flavor of the week.",
            "A lot of these aren’t really to do with devs. It’s mostly dipshits in charge that want things a certain way without doing market research or giving proper requirements.\n\nSometimes doing the right thing requires 10+ meetings that keep getting rescheduled and then some prick can still say no without a good reason so you just say fuck it, do it as asked and then go home on time.",
            "The good news is that as more people major in CS there is opportunity for other jobs salaries to go up.",
            "That's not due to programmers, that's due to really toxic team structures.",
            "Yea agree",
            "A big one for me is when I swipe right on the iPhone screen and it shows the 3 big news articles, I’ll see one that interests me and immediately it refreshes and shows the new list so you can’t find the one you were reading the headline for",
            "Fr, some of u guys gotta drop out and leave some SWE internships for the rest of us",
            "there is a want , but not a need!!!",
            "There aren’t enough UI/UX designers. They are the ones that build and design our future.",
            "Let the market sort it self out automatically when companies stop shedding developers. People will start taking CS again.",
            "... too few people in CS?\n\nIn what world????  \n[https://news.slashdot.org/story/23/05/22/0225210/us-colleges-see-a-surge-in-cs-majors-fewer-humanities-majors](https://news.slashdot.org/story/23/05/22/0225210/us-colleges-see-a-surge-in-cs-majors-fewer-humanities-majors)"
        ]
    },
    {
        "post_id": "pwvxok",
        "author": "SATGang",
        "title": "Took a shit during an interview",
        "url": "https://www.reddit.com/r/csMajors/comments/pwvxok/took_a_shit_during_an_interview/",
        "score": 416,
        "num_comments": 22,
        "created_utc": 1632793971.0,
        "selftext": "This is a true story and it happened to me today. I was taking a hireview interview for a summer 2022 internship. The interview was split into video responses to questions and a 30 minute mc part with 20 questions.\n\nWhen I got to the mc questions I started to feel an uncontrollable rage of shit start to push on my ass and I realized it was time to go. I was taking the interview in a study room in my dorm so I had to run back to my room, blast the toilet and come back in time to finish the interview.\n\nI still had enough time luckily to finish the questions, but let me just thank god real quick it wasn’t a live interview.",
        "permalink": "/r/csMajors/comments/pwvxok/took_a_shit_during_an_interview/",
        "comments": [
            "Lol 😂. At least you will get to blame your shit later. I hope you won’t have to. Anyway for what company? JPmorgan ?",
            "Not going to lie, I clicked on this thinking you shit your pants during an on-site interview",
            "Quality shitpost",
            "Lol active fear of mine.",
            "Good job poopy boi",
            "put that on your resume",
            "💀",
            "Pathetic. Jesus, you should be banned from this glorious sub for your absolute lack of willpower. WiLL YoU DaRe TO take a shit when your  on the clock ????? even if you really, really need to???? No, of course   you wouldnt!!!!! Now I wont be so hard on you and all you other young-ins who eat  avocado toasts and $6.90 coffeees! See, in my day when we needed to take a shit, we didnt need to go to the washroom. We just got to it, shitting our pants and all. Remember this: We're doers, not whiners like you  kids, and after we'd shit our pants, we'd get up and sit back down on it, to level it out in so that our seat would get warm and fuzzy. those first few moments were espesically great, warm and cozy. Now if you had the runs, thats different, then you just shit your pants and wear a pair you brought from home. that's this old mans wisdom for you kids. Bring an extra pair of pants. Also. NO ExuCuses. fuck that shit!!!!!!!!",
            "[deleted]",
            "Dude this is so funny. I once held my online office hours like this. Shit can happen anytime, shit is natural",
            "Lol, it is always your shit destroys everything.",
            "This story is beautiful lmao",
            "How did you find the MC section? Is it like leetcode or debugging?"
        ]
    },
    {
        "post_id": "yus14p",
        "author": "CashewWest",
        "title": "Big tech is gimmicky now",
        "url": "https://www.reddit.com/r/csMajors/comments/yus14p/big_tech_is_gimmicky_now/",
        "score": 416,
        "num_comments": 134,
        "created_utc": 1668411067.0,
        "selftext": "After all of the layoffs, does anyone else feel like working at a big tech company is just so unreliable and has lost its prestige? \n\nFAANG was my #1 goal not too long ago, but now I feel like it is too much of a risk to grind for a position like that when there is no stability.\n\nAlso, seeing Meta employees take a free shuttle to work everyday just makes it feel like adult daycare. \nUnrelated but jw if anyone else has felt like this.",
        "permalink": "/r/csMajors/comments/yus14p/big_tech_is_gimmicky_now/",
        "comments": [
            "Prestige was always an illusion, maybe more people realize that now.  Big names can look good on your resume, and in many smaller cities these companies will still offer some of the highest salary.",
            "[deleted]",
            "Faangsexuals will always be there",
            "The rats realized they’re in a rat race",
            "*checks paycheck*\n\nNo, I don’t think it is",
            "If students who go in into whatever major is making the most at the time, besides premed, are changing their minds, that is fine by me! Bye",
            "I don’t get that adult daycare comment. Taking a free shuttle to work is a benefit that I personally wouldn’t take for granted if I don’t have a car. Not sure how there can be a negative perspective on that lol",
            "Well “faang” as a grouping now is mostly dead or fragmented.  It was originally created by the genius Jim Cramer for stonks, then CS nerds with a superiority complex started parroting it outside that context.  \n\nAnyways since then meta has blown up, Netflix’s growth thrown into question, Amazon’s hiring bar hitting the ground and all the company’s nastiness exposed (also they just started layoffs), Google slowly moving towards amazon style pip and failing to launch new products, and Apple still somewhat hanging in there but were the first big tech to push RTO (keep in mind apple is worth more than all those combined).\n\nSo yes, it’s sensible for you to feel that way.  But still there are other big tech companies that are still doing well, and some flashy up and coming companies that are slowly taking the spotlight.\n\nNow here’s the kicker:  Because “faang” is no longer exclusive at all, all those people getting into “faang” now still desperately want to pretend it is so they could flex it.  And thus we have the meaningless obsession of prestige on the subreddit.  But the truth is they’re only there because every faang, amazon most drastically, lowered their hiring bars.  That, ontop of some of the companies spectacularly exploding now, leads to your conclusion.",
            "I've said this so many times, I think even today but I left faang for YC during its infancy. While 90% of the YC  projects suck nowadays. But working at a startup revived my love of coding and building instead of endless meetings. The majority of people are also not just leetcode engineers which refreshing but the pay definitely doesn't match up unless your startup IPOs which I've been fortunate to experience :)\n\nLet me post my whole text chunk, it's about being a senior dev but it's also about my experience working at faang.\n\nI've met wayyy too many senior engineers who say they're working on a design and spike, schedule 20 meetings each one about some overengineered shit, bringing up non existant security issues, addressing possible scaling needs that we wouldn't need to worry about 10 years down the line. Which would then reduce my working time by 20-40% cause I'm sitting in these useless design meetings arguing about something that we could've just feature flagged. They then would get a promo based on some over complicated shit and potential revenue that would wow leadership and then leave once they had to execute. Meanwhile I'm picking up the slack, fixing their breaking down the over engineered shit, and helping build the system out. I swear to god I never want to end up at faang or any company with greater than 1k employees. It just becomes such a shit hole of shitty devs who can interview really well, and want to make their mark by overcomplicating every little detail and think it's the norm because things move slowly anyways and every other senior engineer is doing it too.God bless the senior engineers that are good at designing shit without dragging their feet and god bless the amazing senior and staff engineers who would at least understand how to build what they were designing and helped me get to where I was now as a senior dev.If anyone is going to write an O Reilly book please write a book saying there is no one right way to become a good dev and especially not a good senior dev. If you think not coding at all is the hallmark of every good senior dev, then I think we've gone too far into a dark path. And it's almost self fufilling because these shitty devs have created an environment where I literally can't code cause my schedule is filled from 10 am to 3 pm with meeting X, review meeting Y, product review meeting, meeting about why we can't put this header in this API call, why this design doesn't follow X pattern, How do we scale up to 3k rps while we only are expecting 50 rps, choosing the right cloud infra when there is no reason not to reuse what we've used the last year and a half.",
            "Big tech was prestige back when Google had, \"don't be evil\" as a moto. It's been shit ever since.",
            "As a CS outsider (Industrial Engineering) I always thought it was wierd how much y'all focus on big tech like you do. There's so much opportunity out there in a variety of industries where you can work on so much cool stuffm Working in jewelry and firearms manufacturing I've gotten to work on plenty of cool stuff without having to suffer through a big tech interview \n\nBig tech got y'all whipped into grinding leetcode in your free time like fuck if I'm gonna practice designing tooling or something in my free time",
            "Faang was the best gig for contractors. All the money, none of the suffering. Especially if they were in a hurry to form a team and get started asap, they basicaly wrote blank checks just to get people.",
            "Focus on who pays the most. Prestige can be leveraged but go for the money.\n\nAlso the diversified tech companies (msft, amazon, Apple) are doing smaller layoffs which is normal for most companies.\n\nYou are mistaken if you think layoffs only happen in tech. Part of the reason tech layoffs are getting so much attention is because a lot of them have been immune to layoffs due to hyper growth. \n\nThis is coming from someone who worked in non tech and now works in faang.",
            "People will be going to the top universities, study science and work their ass off just to become an employee. Do you maybe see an issue here?! Big tech job is a glorified factory job.",
            "Being in FAANG is the same way I view Ivys. Some of the smartest people in the world probably work there, but it’s so inflated by people either engineering their entire lives just to get there or people with connections that don’t reflect their skills that it doesn’t matter. I’d be much more impressed by an entrepreneur who sold for 100k than someone who works for a FAANG company role playing as a software engineer while attending culture meetings for half of the day making 100k.",
            "I mean, personall, I never wanted to work at a big name tech company. I want to work someplace local that has opportunities to increase my skills.",
            "TC or gtfo",
            "Yeah there's plenty of other companies that actually treat their employees well and you don't have to worry about constantly being laid off.",
            "Literally how I feel rn",
            "This sub poisoned my mind. I went to my state school career fair and learned there were multiple companies in my area that would start around 6 figures, have 1/100th of the competition of FAANG and they don't even have coding assessments. None of them have even opened applications for the summer internships yet...relax everyone. Its going to be ok.",
            "Honestly I never understood why people would prefer to sell their souls to FAANG when they could get the same paychecks with less workload, and better recession resistance elsewhere.",
            "I tried not to make Big Tech my goal because I'm a nontraditional student. I wasn't sure if I was qualified enough to compete against all the students who came from the the big name comp science schools. So I lowered my expectations. I don't even have my bachelor's degree. I'm currently working on it. I have college credits from when I decided to pursue my RN.\nI've been looking into getting a government job as a SWE. \nBig Tech is so unstable right now. I just read where Twitter canceled 4400 contracts. When it's good, it's good when it's bad then it just dies",
            "Tech has been gimmicky for a long time. Some apps are so bloated it’s amazing they don’t burst.",
            "Yes the more they layoff people, the less people will want to work there. This will kill the companies prestige. Some people like working at prestigious companies, but really prestige matters for your resume",
            "So true! The recent news and grind for a small chance leads me to think that the grass is not always greener on the other side.",
            "It's been stable for the past 15 years",
            "I've worked for a small software partner for a decade. great work life balance and great money. they work you to death at FAANG. Every year someone around 27-28 comes over to our side and goes \"wow, this is so nice not working 60+ hour weeks and on weekends.\" i just smh.",
            "Lockheed, Northrup, Raytheon fucking jojo posing now",
            "No, stop.\nLet the sweats all focus for the “FAANG” jobs. Keep them in their oversaturated market.\n\nI want less competition in the less known companies.",
            "I’m sick and tired of people referring to “FAANG” all the time. The only reason those get grouped together is because it sounds like a word and now it’s just a word people can throw around",
            "it’s always been adult daycare.. I hope this downturn reminds of the importance of hard work and developing real skills",
            ">After all of the layoffs, does anyone else feel like working at a big tech company is just so unreliable and has lost its prestige?\n\nNo.\n\nLayoffs happen in cycles, and it is common to see them on Q4.\n\nOnce you work long enough in this crap, you learn to see the patterns and stop trying to read the tea leaves, and find deeper meaning in any of it.\n\nAlso, you don't work for **prestige**. You work for money and for enhancing your skills. Anyone who works in this for the prestige is doing it for the wrong (and unsustainable) reasons, and I would not take such a person seriously.\n\n&#x200B;\n\nPS. yes, I know, I'm being judgemental.",
            "Dude, Amazon came to campus my freshman year and talked about ppl staying late for dinner and playing ping pong. It is a daycare, that’s why I’m pursuing quant rn. Research in finance or even in academia is way more fulfilling than Big Tech.",
            "Always has been...",
            "sounds like ur coping",
            "I’m working at a mid size company. Super underrated; decent pay, decent bonus structure. Get to do tons of awesome projects with full ownership. Very little red tapes on what you can and cannot do, every engineer can make a huge impact to business.",
            "Everything has its pros and cons.  You could work at the government level or defense contractor and probably do very boring work, but make decent pay with great stability as long as you aren’t a complete goof.\n\nOr, you could work at “big” tech or some exciting private sector company on something more exciting, potentially make more money but face more volatility.  Trade offs.",
            "Brother it's not the prestige it's the compensation. A faang engineer is making double my salary prob and long term their stocks are going to outgrow my shitty stocks from my company.\n\nImagine working 6 months and earning what I make in a year or as you get more pretigous titles/positions you make in 3 months what someone makes in a year. You gain so much of your time back and accumulate so many more resources.",
            "yep.",
            "My company may not be super well-known, but at least I’m not getting shit-canned next week lol.",
            "Forget big tech, even small tech has done nothing but ghosted me whenever I've completed their OA.",
            "I have a serveral friends that have worked at Cisco.  They were so proud and bragged about it to all their friends.  Flashed their business cards and corporate credit card at every opportunity. And very quick to remind you that cisco is (allegedly) one of the best employers out there.\n\nRight up until Cisco's 3rd quarter when they do lay-off regardless if the company is doing well or in the tank.",
            "Working for defense was always seen as boring and something not exciting. While maybe true, can’t think of a more stable industry than defense, especially during these times of high tension and the war in Ukraine. Not to mention the military industrial complex the US has, defense will never go out of business or really suffer as much as big tech is suffering right now.",
            "So, Meta, Microsoft, Amazon... they all laid off people. Now what's next? Google? Funny thing is that other companies only want people who are laid off from these companies."
        ]
    }
]