[
    {
        "post_id": "ykdrgj",
        "author": "FabledFauxFox",
        "title": "Why do companies use RippleMatch? ITS SO BAD",
        "url": "https://www.reddit.com/r/csMajors/comments/ykdrgj/why_do_companies_use_ripplematch_its_so_bad/",
        "score": 413,
        "num_comments": 36,
        "created_utc": 1667415702.0,
        "selftext": "I swear, if I get another email from Brennan Delsing, I think I am going to lose it lol\r\n\r\nThe platform is complete garbage, and the matches are atrocious too, its like they use a random number generator to find matches. I don't know how they have the audacity to then SPAM the fuck out of people. Literally only made it for Robinhood and Roblox\r\n\r\nOh, and how can we forget about all of the fake companies they created on LinkedIn. Overall such a shitty company",
        "permalink": "/r/csMajors/comments/ykdrgj/why_do_companies_use_ripplematch_its_so_bad/",
        "comments": [
            "I knew it was fake. Daggon Brennan Delsing.",
            "Serious. Besides the spam, it's just like another unnecessary thing we need to do. I didn't realize until today that a few apps needed things to be done. I even clicked on the those stupid emails going CLICK THIS LINK TO FINISH APP, but it initially took me to a page that I was set. Check today and BAM, couple apps were not set and had to fill out more information. Why is all the required info not in the initial application? Why are there fucking side quests to complete the apps on this site?",
            "I tried old Lensa24 (2 years ago) and also applied to other companies directly and remember checking back after a year and they were all still “processing”. 3rd party application sites make me skip a company now not gonna lie",
            "I do get a lot of emails with companies I'm not interested in which is annoying, but I've also gotten matches from a lot of the ones I choose indicate interest with. \nThree out of four applications have been matches now that I'm looking at it, and one I'm at final rounds for. All companies are highly competitive.",
            "That bitch starts texting if u don't respond to the emails",
            "It’s legit though. I’ve gotten an offer from a company I matched with on the site",
            "I got my internship that turned to full time offer with them so I’m pretty grateful",
            "I actually found a few matches that turned out to be interviews and offers. Maybe you're just unlucky",
            "I actually found it really helpful last year. I received at least 15 interview matches of which I did about 10\\* but it's really weird overall, since hardly any matches this year.",
            "Idk why ripplematch gets such a bad rep... I got 6 offers through them last year.",
            "Are they legit? I thought it was a scam",
            "Agreed. Try otta. And on simplify to apply faster.",
            "Same shit as Untapped for me, I hate both sites",
            "Ripplematch is GOD. I got matched with Roblox and got my offer today.",
            "I got \"matched\" with General Motors. Messaged the recruiter with my resume and saying how excited I was. Literally got rejected an hour later and unmatched on Ripplematch. It's so garbage.",
            "Ripppe match is the worst. How do they even still exist ?",
            "I got interviews through them over a year ago. \n\nIt seems like one of those things that was good when it was new and no one knew about it.",
            "How about wayUp? Is it scam?",
            "RippleMatch gave me my internship with the company I now have a return offer to. not all that bad, it’s hit or miss (just like applying to jobs in the SWE world are)",
            "Most companies just have more budgeted marketing to hide the ubiquitous truth that nearly all are.",
            "It looks legit. But such a shitty app.",
            "Fucking truuee man I applied for iternship on those companies and they tell you to register an send an application through ripplematch like wtf....and then ghost the fuck out of people... this also happend with my friends as well....now whenever I see a person with similar profile I report the profile and block it"
        ]
    },
    {
        "post_id": "xjnvv6",
        "author": "karma_234",
        "title": "I’ve never felt so defeated in life",
        "url": "https://www.reddit.com/r/csMajors/comments/xjnvv6/ive_never_felt_so_defeated_in_life/",
        "score": 415,
        "num_comments": 128,
        "created_utc": 1663715862.0,
        "selftext": "Didn’t get the Google return offer. Literarily every single person I know got one and I don’t even have the chance to reinterview. \nI’m sad asf right now and don’t know where to go from here. I feel like I wasted my time and their time.\n\nEDIT: Just got a 240k offer, So FUCK it, I feel much better now.",
        "permalink": "/r/csMajors/comments/xjnvv6/ive_never_felt_so_defeated_in_life/",
        "comments": [
            "99% of people here don’t have Google on their resume, you’re still way ahead of the line. Getting into Google is not the end game, and you’re just starting out your career. You have more than 20 years down the line for you to reapply to Google and get in. Just move on and consider this as a good experience",
            "Think of it as a matter of perspective, you have Google on your resume, thousands of your peers don’t. If you put in the work for NG recruiting, you should be fine. It’ll be extra work, but that’s just how it be sometimes.",
            "You could try applying to other big techs with your Google internship experience. And then you could try reinterviewing next year for full time. You could try asking for feedback as to how you could have done better and the reasons why they didn't give you a return and take those lessons to heart. It's a terrible situation, but I think that's how you can make the best of it. Good luck!",
            "[deleted]",
            "Dude its fine, keep your heads up and apply with full power. YOU HAVE GOOGLE ON YOUR RESUME! And its not going anywhere. So go apply to those faang bitches and get a handful of offers lined up and negotiate a hell of a good salary",
            "OP you're entitled to your feelings of disappointment and hurt. Take a day or two off to recoup and rest, and then start grinding. You have Google on your resume. You're obviously very intelligent and hardworking to even get a Google internship. Chin up and use those feelings of anger to GRIND.",
            "Everyone is right to say move on but honestly, that fucking sucks ass and must hurt like hell. It will probably hurt a little less tmr, and less the day after.\n\nHere's the thing though, with Google on your resume you will get tons of interviews at companies on par with Google in WLB, Culture and comp.",
            "My brother-in-law did both internships at G. Didn't get a return offer. Failed NG. Got an offer at a startup and work there for a year and then interview again at G and get an offer. \n\nIf that's your dream then keep focus and you will be there.",
            "Some of these comments are extremely ego-centric. It sucks to fall short of a highly valued goal, and OP is totally valid to feel sad and defeated despite the fact that they might have a better resume than you.\n\nKeep your head up OP, you will get a chance to interview with them again and in the meantime, your resume will land you a great job for your first year out",
            "Good luck for next time, probably someplace better waiting for you",
            "Relax, i got to the end and didnt get the match. Ur gonna be fine.",
            "I feel the same but with FB. And probably the comments that are saying you have google now on your resume etc etc is not what you wanna hear. It’s not what I wanted to hear either in those situations. A lot of us have worked hard to get to where we are, and that no return offer is like the end result or the validation we wanted for our grind, yet it just simply isn’t there.\n\nTake a few days off, but I would suggest to get back onto the job search ASAP. The job market this year is extremely bad for new grad. And just a heads up, this feeling of stress, disappointment and feeling down will come back during this hiring season, probably hit you even harder than now. I personally felt like every LC I grinded lately and every stressful interview prep situation reminded me of my no return offer, and I simply can’t ignore it. But what helps is to realize those feelings can’t change anythingZ Just be prepared. Just know that you can’t change your past, so you must focus on what’s ahead instead. Good luck pal!",
            "Just go get a job and make money lol who gives a fuck about Google. This sub forgets that the point of a job is to make money",
            "Always find a way to take positive from anything - you went through a life-changing experience at G, built great skills, and developed a resume that won't leave you. Things like this will work themselves out for the better, that's destiny. But you gotta keep positive and channel these feelings into preparing for the next, better opportunity. Hard work always wins. Manifest it.",
            "My friend did not get a return offer either. He went to top 1 undergrad in his home country and US top 1 school's grad program. He literally wrote like 20k lines of code or sth during his internship with Google but got rejected (without reinterview). I think mainly because his co-host was intentionally being mean to him or sth.\n\nLuck really plays a much bigger role than you think in stuff like return offers!",
            "You got a Google internship experience. You can get anywhere you want and it will make you stand out.",
            "No real way to sugarcoat it, that sucks. I went through a similar thing last year. Best of luck bouncing back. \n\nOut of curiosity, did the decision catch you by surprise? Or did your mentor hint that your feedback wasn’t going to be very positive?",
            "😭😭 its truly like that my friend, a million people kill just to b hired one time. Head up bro",
            "You shot for the moon but you’ll land among the stars. Rejection is going to take some time to accept but don’t sweat it. You’ll get there!",
            "After 5-6 years you will have a good laugh for thinking like this and feeling this bad. This is coming for a programmer with 20 years experience. This is not a set back AT ALL. You have not lost ANYTHING. Find a good company, keep the learning on. That’s all that matters.",
            "dw bud I got an offer handed to me, signed it, and then had it reneged almost a year later. so here I am restudying and re-interviewing. shit happens, but we gotta be resilient :)",
            "Geez. Have some perspective on where you are despite that. Thousands of people wish they even had the chance- myself included. Better to have loved and lost than to have never loved at all.\nI’m sure you’re still a standout, you’ll be at AirTable or JaneStreet in no time.",
            "Lol bro you got a bag from Google and you got Google on your resume. You’re in an extremely good position. Make a plan of what you want by what age. Google shouldn’t be the end goal, it should only be a stepping stone towards it. You can do so much more with your life than being a software engineer at Google.",
            "MF do you know how good Google looks on a resume? This was not for nothing",
            "Same with me and uber",
            "You are not your job. Don't beat yourself over it.",
            "Feel sorry for you but may I ask this swe intern conversion or FTE conversion? I am waiting worriedly too",
            "Keep your head up! You made it in the door. The only thing you can do now is learn from this experience and keep working hard.",
            "Keep your chin up, man. Know that a vast majority of people never even get the chance to talk to Google let alone work for them.",
            "What was that call like?",
            "Lmao at least ur not getting ghosted by a low tier company 💀",
            "Do you mind saying when you ended your internship, when you got the news, and your pa? I'm waiting for hc but it's been basically radio silence...",
            "You have Google on your resume. Interview away and likely an equally good (or at least well-paying) if not better opportunity awaits. It’s people like me who are absolutely fucked because we only have some non-tech Company as working experience",
            "I wish I had your problems bro! Its a matter of perspective I suppose",
            "people obsess over faang way too much, can’t be a healthy mindset",
            "I have 15 years of experience and just now failed a cloud architect role at my dream company AWS. Don't be disheartened. Gear up, move on, work harder and smarter",
            "First of all, let me applaud you for getting a Google internship in the first place. Many people dream of reaching that and never will. \n\nHowever...\n\n\"Never felt so defeated in life.\" If this is true, you need to pattern that sh\\*t up. If not getting a return offer is the worst you've experienced, get ready, cuz life can be much, MUCH worse. There are people who had their entire livelihoods and businesses taken away from them in a matter of seconds due to nothing in their control. Somehow they get up and start again. So if you feel \"defeated in life\" from not getting a return offer, you need to fix that. Have some perspective. Your internship is not only someone else's dream, but probably your dream at one point. Don't spoil your situation by sulking over some stupid sh\\*t like not getting a return offer.\n\nThat being said, if \"never felt so defeated in life\" is just an exaggeration, then I take what I said back. Anyways you have Google on your resume, milk that. Good luck.",
            "Hey sometimes things do go low! But rooting for you. Just a side note Bloomberg is hiring a lot of people who have FAANG on their resume, atleast sureshot an interview . Hope this helps a little",
            "[removed]",
            "Bruh, I would trade with your situation in a heartbeat.",
            "Dont be a cry bitch, apply for another company, its just a corporation. Go for money and work, not brand name.",
            "Man ... you crying for Google? Come on man...\n\nGet into Blockchain!! Build solid projects... that's where it's really at. Forget all those companies... if anything l, they'll probably be kissing you later.",
            "Have the 2023 Google internship apps been opened yet?",
            "I mean, return offers are not mandatory in the end you never know if you will get it",
            "Don’t worry, you’ll most def get a better offer somewhere else with Google on resume. Try to think of it as a blessing in disguise. It’ll only motivate you to do more. Good luck🙏🙏",
            "Hey, OP! You are honestly so strong and so talented. Don't beat yourself up over it, even though it can be a bit tough. Sending lots of positive energy your way!!! :)",
            "Sorry to hear that…How did the midpoint eval or final eval meeting go? It’s tough and unfair if those meetings went well and you did not get a return offer.",
            "I didn't get a return offer either and it was not Google. Shit happens. As other have stated, you have Google on your resume, which is perfect.",
            "All good dude at least you tried. I don't even bother trying to apply to a place like Google",
            "Damn I want to get wasted",
            "You gained experience, no wasted time.  If you made mistakes, learn from them.",
            "Did you finish your project?",
            "It happens dawg you’ll find another place for sure.",
            "If you can land a Google internship, you can certainly land some other good interviews and jobs\n\nGoogle’s an overrated retirement home these days anyhow",
            "This is like going on a date with Scarlett Johansson and feeling crushed when you asked for a second she told you she wasn't feeling it on the first.  The worst thing you can do is take it as a negative reflection on yourself.\n\nYou have an internship from Google on your resume.  Most people don't, new grads or otherwise.",
            "you got google on your resume bro. you gonna get a ton of companies asking for interviews utilize that and try to get one that pays better",
            "Dude are you still in the middle of the internship?\n\nApply at all the other FANGS and just say you want to see what else is out there and you will have an offer letter twice as nice!!! \n\nWhen google finds out they will send their own letter. \n\nStop being sad start making opportunity.",
            "The more I come here after graduation, the more I feel satisfied I didn’t dig sooo deep into this FAANG MANGA ethos . I can hardly believe any of these post are real anymore 😂",
            "I feel sorry for you but, don’t be a pussy. \nYou have a shelter on your head, food, google on your resume.\nGo out, go to the museum, go out with your friends, apply to other companies ( there are indeed more than 4 companies on this planet ).\nYou have great skills for sure if you’ve been offered a google internship, everything is going to be alright.",
            "Great job buddy, dont feel bad there are many who didnt even passed beyond ATS. ( Like me 🙂).",
            "Bro, it’s fucking Google, one of the companies that runs the world. You’re going to be fine. Thousands of other good jobs out there.",
            "Google doesn't even pay the top dollar, there are other giants paying a lot more now. Tons of options bro.",
            "I've been in the industry for 25 years and told the Google recruiter that there's a higher probability of me leaving my bones on Mars than working there.\n\nGet over it and move on. There's far more rewarding opportunities out there.",
            "Meh. Plenty of people I know that worked for Google stay there for a couple of years. You probably saved yourself stress and crap WLB. You can still put Google on your resume (one of the best things you can have on a CV) and look for a company that suits you in other things than name.\n\nI hate corpspeak but this is an opportunity, not a failure.\n\nIf you really want to go back, you can go back in a few years with more experience. I believe Google values a lot people with years of experience and you could have an easier time.",
            "You got Google on your resume, you are already ahead of the game. Don't be sad because you never know sometimes return offers aren't extended for reasons beyond your control. As long as you gave the internship your all, you should be just fine. Keep your head up and move on.",
            "Nobody will know that Google rejected you for a return offer unless you tell them. Shape the narrative.",
            "These recruiters literally pick randomly",
            "first of all, you can always try again in the future. second, there are other companies that you would probably be just as happy at that would also look good on your resume.",
            "I don't get why you're complaining now. Should've thought about that when you were interning and work your ass off so you could've gotten it. At this point it's useless to complain. Just learn your lesson and do better next time and not take things for granted.",
            "Bro, chill out. Google on your resume is already a massive accomplishment.",
            "Working for the FAANG is not all it’s cracked up to be and not working for one isn’t the end of the world. You can always reapply in a year or two, keep practicing",
            "same. I had two internship including a FAANG, but I just got resume reject without even an OA by MSFT(dream company for me). Have no idea why I got wrong😭😭  feel exactly the same as you bro",
            "Hey! I also interned at Google over the summer and found out last week that I didn’t get a return offer. I was bummed at first, but now that I have google on my resume it’ll help me get a lot more interviews for other places, and so will you. \n\nJust focus on applying to places and practicing for interviews and you’ll definitely get a really good offer for next summer. There are so many other great companies and you might even like the culture and type of work they have better. \n\nWe can help each other out with applying and interviewing this season and make sure we both do well!",
            "240k ? as in your salary?"
        ]
    },
    {
        "post_id": "193bhyl",
        "author": "Living-Somewhere-397",
        "title": "Nearly 40% of employers avoid hiring recent grads - a survey report",
        "url": "https://www.reddit.com/r/csMajors/comments/193bhyl/nearly_40_of_employers_avoid_hiring_recent_grads/",
        "score": 415,
        "num_comments": 129,
        "created_utc": 1704902127.0,
        "selftext": "An article in Intelligent claim that majority of employers have a negative opinion of gen. Z and are going out of their way not to hire recent grads in favor of experienced folks: [https://www.intelligent.com/nearly-4-in-10-employers-avoid-hiring-recent-college-grads-in-favor-of-older-workers/](https://www.intelligent.com/nearly-4-in-10-employers-avoid-hiring-recent-college-grads-in-favor-of-older-workers/)\n\nMaybe this is another reason (in addition to being a horrible tech employment market in general) that many of us are struggling to get a new grad job?",
        "permalink": "/r/csMajors/comments/193bhyl/nearly_40_of_employers_avoid_hiring_recent_grads/",
        "comments": [
            "they think experienced folks grow on trees or something?",
            "Nah, experienced hires are hired due to experience, but cost more and are worth more, other reasons to not hiring new grads are more important than gen z stigma.",
            "> 19% Brought a parent to their interview\n\nOk I get social anxiety but how tf do you get to this point of social ineptitude. Like this is something I do in my nightmares lmfao",
            "I’m about to finish PhD by mid this year. starting to feel the pressure and fear is taking over day by day. Everyday, when I wake up, I feel stressed about my future. I don’t know what will happen.",
            "Sample size is 800 people but I'd be curious about which industries were represented.that might tell us something about the quality of candidates they're getting. I could be wrong, but it reads like the older, stodgier, non-tech industries such as manufacturing where GenZ values and expectations would be more of a cultural mismatch. Of course bringing your parents to an interview is a major 🚩 and funny af - other than that, these managers sound like shortsighted boomers on a power trip in industries that probably don't draw a lot of high quality GenZ applicants to start with.",
            "Yes, companies are not hiring new grads. This is because:\n\n1. For first 6 months, new grads are utterly useless and do nothing but ask questions and figure out how to do most the most basic stuff. This is not necessarily a bad thing, its expected, but they are deadweight and a detriment to other experienced developers who need to spend time helping them.\n\n2. New grads do not become worth their salary until ~2 years experience\n\n3. Many, many new grads leave before they reach that 2 year mark and become worth their price with the company having paid two years salary and lots of time from other developers to essentially train someone with no pay off.\n\nIts very obvious why new grads arent being hired. The market is tight, and new grads are a risky investment, not a tool. People tend to reduce risk in unstable markets. It has nothing to do with Gen Z or anything else. Once the market is more stable with high growth, the jobs will return as more companies would be willing to invest in new grads.",
            "No? Since there are still exp engineers around so we are really at the back of the queue",
            "[deleted]",
            "It makes sense from a heuristic perspective, even to many of us who are in that age range are offended by it (for valid reasons as well). \n\nI think that the big issues is that it comes down to social and behavioral differences. For many of us, we only ever known how to communicate in a more informal sense, have been able to connect to everybody over the world, and have access to everything on our fingertips to see that there are certain roles that aren’t worth having or doing for the sake of it. I think that in events of a downturn, it’s more like a survival of the fittest race and the person who is not able to get through that professional breakthrough, they’re going to struggle. \n\nAnd then you got people questioning as to why the fuck would they even consider it versus people who are doing it because they have no choices. It’s a very sparse process and I think that this division is only going to get much worse.",
            "Anyone who frequents this sub would get the same impression of new grads.\n\n1. Reneging is totally acceptable under all circumstances\n2. Every company is out to screw their employees\n3. Chase money and MAANG over everything else",
            "There's stigma around Gen Z folks.",
            "Wow that actually sounds pretty hopeful that 60% of the companies are willing to take the chance with new grads.",
            "Honestly, I don't believe this crap. I don't work at FAANG or in straight up tech. We hired 4 gen Z last year that survived layoffs. And we're getting a new gen Z grad this May. All the gen Z interns I've worked with have been hard working and fun to mentor.",
            "Been out 5 years still can’t get a fucking job. Applied well over 200 times with cover letters. God forbid I had to work as a janitor in the dorms in college and couldn’t do an internship.",
            "So 60% do hire new grads.",
            "Ya this has nothing to do with Gen Z except coincidence. Employers run a business and every new grad hire is a risky hire. When there’s experienced people on the market, why risk it during this economy?\n\nWhen economy improves. More companies will take risks. \n\nI’d be asking more about the education one got. Maybe a 4 year isn’t as valuable as one thinks if employers would choose someone with 1 YOE no degree over someone with a degree and 0 YOE when shit it’s the fan lol",
            "If I start my own business and put that on my resume as experience, that'll make me look better, right? Lol",
            "Covid completely skewed the power between tech employees and employers and gen z took it and ran. “Mental health days” lol",
            "Skill issue my 200tc offers speak otherwise",
            "H1b visa keeps growing. I'm told it's because there are all 2x better than people here and nothing to do with the fact that their visa is tied to their employer.",
            "Smh they cant afford the avocado toast",
            "Depends who applies, if a mid level employee applies to a junior position. He/she will get it.",
            "As someone considered either millennial or gen z (pending the opinion between 1994 - 1999) and having worked in industry for a few years, I think it's mostly that companies are still recovering from their mass hiring and current layoffs. So they only want to hire experienced people. \n\nI've worked as an engineer and later a data analyst, while it's true there is some stigma for gen z that is a smaller concern.  It's definitely the lack of experience. Millennials have a bad stigma to boomers still too.",
            "In general, whenever there's a tighter economy or cost-cutting across the board, employers first trim down on the new grads and inexperienced people. Labor has way less negotiating leverage in general, so even experienced people are sometimes laden with paycuts.",
            "Just switch major at this point... Seriously what's the point?",
            "If you're struggling, remember that this environment, and the good one that preceeded it, were created by interest rates. \n\nIt all starts with the FED and the treasury, which is of course rarely talked about in the media.",
            "Y’all were once an inexperienced engineers too. How do you suppose we are going to get any type of experience if we are not given a chance? I worked my ass to get a diploma from college and degree in CS from a reputable university and now we gotta deal with this is. Yes I did an internship and yes they didn’t give me return offer cuz of financial reasoning.",
            "This is an effect of COVID. Before work from home, companies were forced to hire juniors and interns and train them up. Otherwise they'd go broke from hiring all seniors locally. But with remote work, it's a much larger hiring pool, and there's less local pressure driving the cost of seniors up. So many companies are just hiring reasonably priced seniors to work remotely. And they're leaving juniors and interns out. This will bounce back eventually, but we're still really figuring things out in this remote work world.",
            "If only I wasn't born in the 2000s"
        ]
    },
    {
        "post_id": "si4saj",
        "author": "None",
        "title": "I FINALLY GOT MY FIRST INTERVIEW",
        "url": "https://www.reddit.com/r/csMajors/comments/si4saj/i_finally_got_my_first_interview/",
        "score": 417,
        "num_comments": 59,
        "created_utc": 1643747520.0,
        "selftext": "IT'S ON THURSDAY WISH ME LUCK",
        "permalink": "/r/csMajors/comments/si4saj/i_finally_got_my_first_interview/",
        "comments": [
            "Good luck",
            "Best of luck!!!",
            "Best of luck to you 🙏🙏",
            "Good luck! Know your projects inside out!",
            "Time to secure that 🥖",
            "YOU GOT ONE SHOT",
            "yay good luck youll kill it!",
            "# break a leg",
            "Good luck!",
            "GOOD LUCK FAM",
            "You got this!",
            "Good luck!",
            "good luck",
            "Congratulations buddy❤️, Is it hard to get an interview here in the USA?",
            "Good luck!!",
            "YAYY",
            "Godspeed Mr. Taco!",
            "Good luck!",
            "Good luck !!!",
            "good luck! you're gonna do great!!",
            "To many more. Best of luck!",
            "All the very best! You got this.",
            "All the best!",
            "Good luck 👍🏻",
            "Good luck!",
            "Go get it!!!!\nRemember to get 8 hours of sleep the night before, and don't treat it too \"seriously\"",
            "yeet skert fam!",
            "im your interviewer 🙂",
            "GL 👍",
            "Good luck! Kill it!",
            "best of luck!",
            "let's go",
            "You’ve got this!",
            "You got this buddy!",
            "Good luck!",
            "Also got my first interview on next Thursday. Its screening interview though I think! Good luck us",
            "All the best! Do try to give a mock interview before once. It helps.",
            "Good luck!",
            "GOOD LUCK YOU GOT THIS!",
            "CONGRATULATIONS, ALL THE BEST!!",
            "Allllll the best <3",
            "Good luck man!",
            "First interview Thursday here as well! Best of luck to ya!",
            "Best of luck to you!!  You got this!!",
            "All the best mate! Hopefully you get the job",
            "YOU GOT THIS!!"
        ]
    },
    {
        "post_id": "qxs50b",
        "author": "None",
        "title": "Technical interviewers shouldn't be given the solutions to the problems they ask us to solve.",
        "url": "https://www.reddit.com/r/csMajors/comments/qxs50b/technical_interviewers_shouldnt_be_given_the/",
        "score": 412,
        "num_comments": 38,
        "created_utc": 1637363817.0,
        "selftext": "If one of your staff engineers can't come up with a flawless dynamic programming solution to the problem in twenty minutes then you shouldn't expect your intern/new-grad candidate to either.\n\nThese interviews should be more about gauging how a candidate approaches and collaborates on a problem rather than gauging how well they were able to memorize the 500 most common interview questions.\n\nTo be clear, I like LeetCode, but I think it is becoming more about rote memorization than actual problem solving ability.",
        "permalink": "/r/csMajors/comments/qxs50b/technical_interviewers_shouldnt_be_given_the/",
        "comments": [
            "Actually this would be kind of interesting. If neither the candidate nor the interviewer has seen the problem before it would simulate the whole \"what is it like to actually solve a problem with this person\" better.",
            "I think SWE interviews should be about technology not competitive programming. But again, judging based on technology takes time, like you will have to do a 4-10hour long assignment for each one of 200 places you applied, but again even this can be standardized (like do it once and share your score with all the companies).\n\nNeed to rethink SWE hiring, but corporate is DOING FINE even with the current type of hiring, so I think it will never change.",
            "“so am i on the right track?”\n“i have no fucking clue”",
            "[deleted]",
            "In my experience, these interviews really never were about solving the problem in the optimal big O. People make their own lives worse by believing this is the case and they become so stuck on memorizing or focusing on the low-level details that they forget the point of the interview: does this person think like an engineer and would I want to work with him? Of course, always depends on who you land as your interviewer, but I did quite a number of FAANG interviews and the offers started coming in only after I understood this clearly. On a side note, I do believe that almost any interviewer has the capabilities to solve the issue at hand. I don't really know where this notion of him having the solutions came from. I mean, of course he knows, he asked the same question like a billion times (today!).",
            "I'm a software engineer at a FAANG and I've been avoiding interviewing people because I don't really think it's fair that I probably wouldn't be able to pass the interviews I would have to give, lol.",
            "If the staff engineer wasn’t promoted their way up and was brought in from another company, they likely had a much harder LeetCode-style interview. I’m really tired of people complaining about LC-style interviews. It’s an extremely standardized process to the point where anyone who invests the time and effort can prepare. Imagine if every company had vastly different interview protocols with rigorous debugging, system design questions, day-in-life-style, etc. Recruiting season would be hell because preparation would be a matter of shooting in the dark. Please just resume your Lc grind and do better for the next interview.",
            "As ideal as that sounds, interviewers have real work to be doing, and it isn't practical to devote the extra few hours it takes to solve the problems before every interview.",
            ">If one of your staff engineers can't come up with a flawless dynamic programming solution to the problem in twenty minutes than you shouldn't expect your intern/new-grad candidate to either.\n\nThe key difference between the staff engineer and the intern candidate or prospective employee is, the latter is assumed to have used their time judiciously to prepare specifically for these problems.\n\nWheras a staff engineer already have their hand full with work and it is unreasonable expect them to retain all their leet coding skills without given the preparation time.\n\nWhat you are proposing is like saying a course instructor must know all the contents they will teach students and test them on by heart themselves and not have access to instructor manuals, course materials, and other teaching aides.\n\nIf can see why in the scenario of a course instructor we cut them slack so you would for staff engineers who interview candidates.",
            "The hardest interviewers I know find their problems easy",
            "Yeah, leetcode difficulty doesn't scale at all with yoe. You get the same questions as an intern and as a senior. Essentially they use system design to see level your seniority.",
            "[deleted]",
            "+++++",
            "As an intervirwer, I decide the question. I try to solve it myself to see if I can come up with atleast a viable solution in 30mins. If I can, only then I will ask the question. I expect the candidate to talk through what they are thinking when they try to solve the problem. Just jumping into the solution and providing an optimal solution kinda raises a red flag if the candidate can't explain why the solution is the way it is.",
            "TRUST ME, you want them to have the answer. Most places, your interviewer is also a problem solving partner to some extent. If they don’t know the solution, they could accidentally guide you in entirely the wrong direction, and then you’re screwed through no fault of your own.",
            "Fully agreed. When they have a solution, it becomes more of a test of accuracy and they may be unconsciously biased against you even if your solution is right but a different approach. Not knowing makes them focus more on gauging how well you work with a team and your process of coming up with a solution.",
            "Well, I think they have been through thay process before. They’re where they are now because they could solve “ those questions “ in their time. So yeah, they deserve to have the solutions now."
        ]
    },
    {
        "post_id": "qfr7gq",
        "author": "jstaminax",
        "title": "🚩🚩🚩🚩🚩🚩🚩What Red Flags do you notice when you look at Software Engineering Job/Internship Descriptions? 🚩 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
        "url": "https://www.reddit.com/r/csMajors/comments/qfr7gq/what_red_flags_do_you_notice_when_you_look_at/",
        "score": 417,
        "num_comments": 120,
        "created_utc": 1635198234.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/qfr7gq/what_red_flags_do_you_notice_when_you_look_at/",
        "comments": [
            "We are a family",
            "\"work hard, play hard\"",
            "We love the fast-paced environment and night owl engineers🚩🚩🚩",
            "[deleted]",
            "“Unpaid” haha",
            "This position is equity based. Work to make a difference in the world by making <app that already exists but theres some random twist to it>",
            "“Needs to be a self starter” (we have know idea what we’re even doing and hope you will)",
            "They say they want a \"rockstar\" developer",
            "Also asking for a specific amount of experience for specific frameworks like,\n10+ years Hadoop \n10+ years fast api\n3+ years kafka\n\nOr just sounding really demanding in the description",
            "“We have long days and short days” means that you’ll work 8 hours at the minimum",
            "\"Must have no issues with mild to severe stabbing\"   \n\"Strong proficiency in killing competition\"    \n\"Proficient in ancient latin\"   \n\"Killer attitude required\"",
            "- No mention of pay or benefits\n- No mention of culture on their site. Do y’all volunteer? Company hackathons? Dress code? Team outings?\n- “Fast paced environment” as u/nanaoz said\n- Goes out of their way to mention hiring specifically from prestigious schools, no mention of acceptance of bootcampers or other non-traditional pathways (mentioning the schools isn’t bad on its own, obviously, and I myself am a traditional CS grad. Lots of nice people come from those schools, but some insane people too)",
            "PHP",
            "Ohh boy do I have 2 big red flags for you.\n\nUNPAID INTERNSHIPS\n\nFor some back story. I was desperate for an un-paid internship because my regular job wasn't working out with trying to become a Software Engineer there.  I interviewed and agreed to start and asked to speak with another Intern before officially giving a start date. He said he learned a lot and it was great. I spoke with the CEO of the consulting firm I was going to Intern for and learned that there was only 3 PAID developers and 12 INTERNS. They were completing Contract work and using the unpaid interns to profit. I still went through with it and told my CEO I was leaving, and apparently I worked my way into being \"un-replaceable \"  position so they offered me a full-time Software Engineering position and less operations work + manage.\n\nThe other red flag giving your Software Dev Intern INTERVIEWEE Production Access WITHOUT SUPERVISION.\n\nYes, this happened. I had to sign an NDA to get the keys and SQL access. I had full production access as an intern interviewee with 0 supervision. For confirmation I even searched my email and it showed up in their users table. I still wanted to join even after that. Until it got to a point where the CEO would call me @ 8 at night begging me to join.\n\nThese were my ONLY 2 interview experiences when it came to internships. Seems like I was handed a bad deck.\n\nLong story short - Don't under value yourself. You deserve to get paid for your work.",
            "Mother of all : Unlimited PTOs ..  \n\n\nffs",
            "“NO REMOTE OPTION” = major clearance thing or boomer ceo",
            "“As long as you get your S*** done”\n\nYeah that’s what literally written in the official job description",
            "If the company says they are hiring a “coder”, “code ninja”, or some other strange name",
            "“You are employed at our will, and will be given freedom after 6 years of servitude upon satisfactory performance.”",
            "I have an emoji in my LinkedIn name, when someone messages with said emoji I know immediately it was just spam",
            "frankly I'm oblivious to all these criticisms. It's 12-16 weeks, I'll suffer through Amazon's most Karen manager if it means I can put Amazon on my resume",
            "- Using workday, or worse, some badly designed proprietary platform for job applications.\n- Making you do pymetrics, or some other silly game that is not coding/communication related.\n\nPerhaps these aren't red flags per se, but they do signal that the company hasn't put too much thought into its hiring process.",
            "Must have previous internship experience",
            "\"rockstar developer\"",
            "Entry level job with a requirement of 5 years of experience",
            "It’s the stuff they don’t mention that’s the red flags. Such as On Call.",
            "“Severely understaffed, need on-call support”",
            "CEO of the small company that I did my first internship at, during an orientation said, \"guys we work very hard but we f-ing party harder\".",
            "Legacy responsibilities, big no no",
            "\"rockstar\", \"ninja\", \"code monkey\"\n\nIn fact, whenever I check my linkedin, this is the most common type of message I get (that I also end up ignoring):\n\n\"They want people who love to code, like being challenged, hate to climb corporate ladders, and don't mind the added bonus of having hard work rewarded through recongiition and extremely competitive compensation.\"\n\n\r  \nTranslation: They want code monkeys who are okay with working long hours, probably on weekends too, with no career growth prospects and no further compensation growth than the already generous package we give, which probably honestly is not going to be enough when you consider the overtime hours. Please sign your soul here.",
            "“Free internship”. Aka work for free",
            "\"Enjoy great work life balance with a pool table and state of the art coffee machine in the office.\"\n\nThe thing being, if you are going for work life balance you'll have to do more than a pool table and coffee machine. Such kind of statements where they drop in a line about ideas they don't care about but justify using less than adequate measures.\n\nAnother one: \"Our employee's health and well being is a primary focus, which is why we provide 10 sick leaves and smoothies twice a year.\"\n\nMaybe I exaggerated this one too much lol, but you got the point.",
            "Bad glassdoor reviews. From experience: it's not just a minority of upset people.",
            "You’re resilient and don’t give up in the face of challenges ➡️ We’ll screw you up with loads of work and hold you responsible when you haven’t been able to finish all of it",
            "(This is regarding unpaid internships in Indian context)\n\nBenefits :\n\n1. You will receive an internship certificate from the company.\n2. You can mention this project on your resume.\n3. Opportunity to learn.",
            "Entry level position - 5 years minimum experience needed 🚩🚩🚩",
            "JavaScript",
            "Beer in the office on tap. There are likely days you’ll need it",
            "« You will do coding, testing, support, deployment, tooling, mentoring, requirement analysis, planning, cost management, project management, hiring, contractor management,… »",
            "* *looks at comments *\n\n* *look though all prospective internships' job description *\n\n* *begin sweating nervously *\n\nYeah I caught a few that says fast paced environment, among other things that people mentioned. Yikes.\n\nThanks guys!",
            "It’s a SWE job",
            "[deleted]",
            "“Hustle”",
            "Wanna learn GoLang?",
            "Great question!",
            "\nI had two internships one was paid the other one was unpaid. Unpaid internship was the most useless thing I ever did. I got an offer from the paid internship that I did and o learned the most there.",
            "When they quite identify themselves with the sentence \"hard work beats talent when talent doesn't work hard\".",
            "We work hard and play hard",
            "Anything less than 200K TC"
        ]
    },
    {
        "post_id": "ibv6n2",
        "author": "givewafflespls",
        "title": "Just chill it'll be alright",
        "url": "https://www.reddit.com/r/csMajors/comments/ibv6n2/just_chill_itll_be_alright/",
        "score": 418,
        "num_comments": 34,
        "created_utc": 1597728966.0,
        "selftext": "I have been seeing a lot of posts about people stressed out about every little thing whether it be covid-19 or not understanding coding immediately. With everything there is a learning curve and a process. Just give yourself time to learn.  Jeez man it's like people are just putting so much pressure on themselves to be perfect all the time it's not worth it! Make mistakes and learn from them! Do projects that you find interesting and like don't put so much emphasis on leetcode. It's like every post I see is just lc and internships and I get it but just like chill and enjoy the path you have chosen! Companies don't want just another robot that can do lc and burnout in 6 months. Be your own person! Sorry for the rant I'm a lil drunk I just am tired of people being stressed about things beyond their control!",
        "permalink": "/r/csMajors/comments/ibv6n2/just_chill_itll_be_alright/",
        "comments": [
            "The advice we need but do not deserve.",
            "Thank you! People on this subreddit always seem to be on their nerves and stressed/panick",
            "Yeah my best advice would be unfollowing subs like these and not comparing yourself to others so much. They can be visited for information like once a month to find good resources, but following them is exhausting and can paint the field in a negative light.",
            "yeah you are right. Gotta be a little care-free. either things will work or they won't but ig i'll do something of my own at the end of the day.",
            "This is great advice but doesn’t really help me because I’m stressing about how I haven’t heard anything about one of my classes from anyone. The teacher, the dean, the associate chair...no one has told me anything about it\n\nWhy the fuck am I paying money for a class that evidently doesn’t exist?",
            "This sub is like a microcosm of students that circle jerk each other into depression. The original intention was to keep all the student questions from overfilling [r/CsCareerQuestions](https://www.reddit.com/r/cscareerquestions/) but when the majority of people on this sub are students but ask questions not designed to be answered by other students but are anyways people end up freaking out they don't have their first internship end of freshman year.",
            "Just recently came to this realization a bit ago. When in doubt be like Flynn and relax with some Bio-digital jazz man",
            "My thing is this. \n\nIf people stress out this much over job searching, how are they gonna handle when work gets stressful or if a layoff happens? \n\nI’m of the camp that you gotta “train how you fight”. So if you keep yourself in a constant state of worry..... things won’t be much better when you land the job. And that kinda goes for anything in life too.",
            "I just joined this subreddit and was starting to wonder whether or not CS majors actually enjoy anything that they do.\n\nBut, hey, I'm old and just getting started, so there's very little chance of me ever getting any of those top tech company jobs everyone here seems to be worried about getting.",
            "this is a blessed post",
            "Thank you for this. I’m someone who stresses about everything and I was feeling overwhelmed. Thank you thank you thank you!",
            "Honestly man, I needed to hear this on the down low. Been thinking I’m behind the curve going into my first year as a technical transfer student since I’m a “junior” and been raking myself over the coals for it."
        ]
    },
    {
        "post_id": "hm0ixj",
        "author": "None",
        "title": "RateMyDorm.com - student made website for dorm reviews",
        "url": "https://www.reddit.com/r/csMajors/comments/hm0ixj/ratemydormcom_student_made_website_for_dorm/",
        "score": 414,
        "num_comments": 37,
        "created_utc": 1594007792.0,
        "selftext": "Hey guys, I launched a website back in April called [RateMyDorm.com](https://RateMyDorm.com). It's like ratemyprofessors but tailored to US dorms. Hoping this could be a helpful tool for undergrads as they choose their dorms this fall and onwards. If you guys could help contribute, check out the site and leave a review for your dorms! (i'm a BU '19 graduate)",
        "permalink": "/r/csMajors/comments/hm0ixj/ratemydormcom_student_made_website_for_dorm/",
        "comments": [
            "This is really cool! Congrats on the launch",
            "THIS IS SO COOL! Make sure to post it on subreddits like r/college if you haven’t already because this deserves more attention",
            "[deleted]",
            "Is this open source?  I'd love to contribute and I have time as  my internship got cancelled this summer.",
            "Looks good! How long did this take you to build? Any plans of posting the source code on GitHub?",
            "Baylor? That’s sick! I’m in Austin. 🙂 How did you manage to get those first 1k reviews?",
            "Bro this is the hidden gem most people out there have been looking for.",
            "It would be nice if it clarified what some of the amenities like \"in house dining\" or \"private bathrooms\" mean on like a mouse over or some other mechanism on mobile.",
            "It would be nice if it clarified what some of the amenities like \"in house dining\" or \"private bathroom\" on a mouseover or some other way on mobile.",
            "It looks great!!",
            "This is an amazing idea; congrats on the launch!",
            "you my friend, are a fckn legend",
            "Looks dope. Just shared it with my uni.",
            "This is cool man! Not really related but it'd be cool to see this with other stuff like military barracks or gov housing.\n\nWhen I was in the Army I stayed in some on post housing that was like a 4 star hotel with keycard locks and half decent kitchens. A year later they move us into 70s built barracks with no kitchen, horrible black mold, small rooms. I would have loved to leave a strongly worded review on some of those nearly condemned buildings I was forced to say in with no say on where I live for a few years",
            "Virginia Tech student here, your website is already being talked about! Congrats! This was a really good idea",
            "This a great idea amazing work",
            "this is so cool!!",
            "Weird time to launch it.\nGreat app",
            "What tech stack did u use?",
            "Is this just for dorms or apartments near campus too?",
            "Could you add a way to share pictures? I remeber searching for hours for a pic of the inside of my dorm and finding nothing substantial. I just added my review. The site looks great!"
        ]
    },
    {
        "post_id": "o0jbwc",
        "author": "blu3berry_pancake",
        "title": "Let’s stop talking about parody posts",
        "url": "https://www.reddit.com/r/csMajors/comments/o0jbwc/lets_stop_talking_about_parody_posts/",
        "score": 415,
        "num_comments": 30,
        "created_utc": 1623777042.0,
        "selftext": "It’s no longer relevant and really unnecessary. It creates a sort of “class boundary” between those who posted parody and those who didn’t post parody.\n\nIt also just doesn’t make sense. Is posting parody really in the same caliber non-parody posts? I wouldn’t say so. Additionally lots of people here would be satisfied with just a regular post. If you, like me, are specializing in unfunny posts, then your dream job is likely being a karen or a killjoy or again, being a whiny 12 year old on twitter (vroom vroom).\n\nPart of the beauty of computer science is that it’s applicable to just about anything else, what’s with all the focus on parody posts?\n\nOne more thing: if you’re good enough to successfully parody post, I would argue that you should stop procrastinating and get back to doing leetcode.",
        "permalink": "/r/csMajors/comments/o0jbwc/lets_stop_talking_about_parody_posts/",
        "comments": [
            "Does anyone else on this sub not have a parody post yet? I've been trying to write one for 6 months but have been rejected by all the top N subreddits, and starting to worry about my chances",
            "This sub is reaching full meta",
            "What leetcode questions to study for parody posts?",
            "You forgot the (vroom, vroom)",
            "Crossposting to r/cscareerjerk. Please join us over there. We need you.",
            "[removed]",
            "this sub is reaching extreme meta levels lmaooo",
            "It’s crazy abusing a joke that was never funny in the first place makes it even funnier😭😭😭😑",
            "[deleted]",
            "Is this supposed to be a joke? It's more of a comment really.",
            "Step right"
        ]
    },
    {
        "post_id": "10jio2g",
        "author": "Tteokbokki1112",
        "title": "Undergrads, please work on your communication skills.",
        "url": "https://www.reddit.com/r/csMajors/comments/10jio2g/undergrads_please_work_on_your_communication/",
        "score": 416,
        "num_comments": 45,
        "created_utc": 1674496378.0,
        "selftext": "I don't know if this topic has been brought up many times, but I am very frustrated when seeing stories about how it affects the work and morale as a whole. Your teammate nags a bit too much? Don't block him on Facebook and refuses to talk during meetings. At least try to bring it up and try to resolve things reasonably. Don't know how to implement this particular feature? Please inform someone that gave you the task you need some more guidance. It's not easy, but taking the first step will help you really really much",
        "permalink": "/r/csMajors/comments/10jio2g/undergrads_please_work_on_your_communication/",
        "comments": [
            "This applies to post grads too tbh. Tons of people get masters without somehow learning to speak to humans",
            "Anyone know a good place to learn and improve on communication skills? mine are straight dogshit",
            " Funny thing is my professional communication skills are on point. But when it comes to personal communication I fall apart thus my lack of friends especially of the opposite gender which is nada 😭",
            "I had a lot of communication problems during my internship, but by the end of it I improved a lot",
            "I'm a CS major not a Communications major",
            "should never have added any colleagues or teammates on facebook anyway. not even those in a random course in college",
            "Your point is an important one. If I may add, try to use specific language instead of \"thing\". Everything has a name, use it.",
            "With 100% confidence and sincerity, software engineering is 90% working with people and at most 7% actual software. You can be an okay engineer and an ass but great engineers elevate everything they touch.",
            "Talking openly and honestly with a team member is one of the best ways to solve a problem. Instead of making it a personal assault, it's critical to take a non-confrontational stance and concentrate on the specific behavior that is giving rise to the problem.",
            "My communication skills are probably the reason I’m held so highly at my job. I never claimed to be the world’s best developer, but my ability to code fairly well and clearly communicate with everyone in the company makes me very valuable. It’s hugely important.",
            "i mean only communication i need at work is regarding the job. in and out thats it.",
            "Yes",
            "[deleted]"
        ]
    }
]