[
    {
        "post_id": "rlou6k",
        "author": "Forrox",
        "title": "My mother is NOT happy with the internship I got and will NOT stop pestering me with \"tips\" she thinks will help me get into Google or Apple",
        "url": "https://www.reddit.com/r/csMajors/comments/rlou6k/my_mother_is_not_happy_with_the_internship_i_got/",
        "score": 411,
        "num_comments": 140,
        "created_utc": 1640122608.0,
        "selftext": "Context: I recently finally got an internship at BofA. Both of my parents are Software Engineers, neither of 'em work at like these well known tech companies, and every day when I'm home is just endless, endless lecturing about how disappointed they are that I didn't get a job at Apple or Google or some other company. I'm not an amazing student but I managed to get some interviews at some respectable companies, Intel, SAS, Pendo, Cisco, etc. I recently got an offer then signed to BofA after like, 4 months of sending out applications every day, interviewing, doing coding practice, AND going to school fulltime. Don't get me wrong, I'm happy with how my career is coming together especially since I did an internship with Infosys earlier this year 🤮 and was glad to just get ANYTHING, let alone a 130% increase in pay in a year, and the potential for a return offer at a company I would WANT to work for.\n\nAfter my initial praise, my mom went back to being just as annoying as she was before. You know when you're telling people about how annoying the job search is, how you send out hundreds of applications, or you get a notification for a position on LinkedIn and in like 6 hours there's like 200 applicants? And then they reply with something like \"oh, have you tried applying to <insert like the most selective consumer-facing company you can think of>\" believing they've offered genuinely useful advice? Or better yet \"have you tried connecting with recruiters on LinkedIn?\" That's what the ENTIRE last 4 months consisted of. Sometimes it'll be more or less hostile like \"what is it that the best students have that you don't? Why can't you get a job at these big companies?\" or \"Did you \\*really\\* apply to Facebook? show me the email confirmation.\" It is driving me insane how they'll go on rants for several hours about how when I was young they thought I'd end up being super wealthy and successful only to \"disappoint\" them with where I am now. If I told them \"if I worked at either of the companies you work at you wouldn't be happy\" which is true mind you, they'd throw a fit and consider it the height of disrespect/insolence. They constantly tell me they thought I was special and can't see why top companies don't want me, completely oblivious to the bias they're exhibiting toward their \\*son\\*. They got into the profession back when there wasn't really as much competition, and while they're paid decently theyI really am not loving the holidays right now and I'm just trying to be happy that I got something nice for summer while getting over the fact that nobody wanted me for spring :/ I'm happy with how I'm maturing into my career, and how I'm developing personally. I don't care if my parents don't see that or that they're kept up at night worrying that their son won't be a millionaire in his twenties, but it's annoying that I'm still dependent on them and while on break I'm beholden to this every day. I just wish they knew that with how irresponsibly they use their power in our relationship they are making it so that one day when I am wealthier I will not want to include them in my life at all.",
        "permalink": "/r/csMajors/comments/rlou6k/my_mother_is_not_happy_with_the_internship_i_got/",
        "comments": [
            "Tell to suck on BofA your nuts",
            "Tell her that you are happy and don’t want to talk about work with her anymore.",
            "[deleted]",
            "I can't even tell anymore what is satire and what is real on this sub",
            "Damn I just hope u understand that BofA is a fantastic company and u should be proud of yourself",
            "Yikes. What tech to they work with and what are you interested in?",
            "Screw your parents and you do you. You’re an adult and part of that is making boundaries and ensuring people respect that or you cut them out. You say you’re dependent but you have options. Work for god sakes and stand on your own two feet.",
            "Just find a job you’re comfortable with and stop talking to them about it. If you’re financially supporting yourself and living on your own, you can in a polite way tell them your employment is none of their GD business.",
            "I was at a start up that was fairly small, but doing well. We interviewed a guy and gave him an offer, he was about in tears when he said he wanted to join but his mother is making him go to Google instead. A few months later we got acquired and it was very beneficial for all of us. One guy said that when he told his mom that we were getting acquired she responded with something like “it’s really fun that you are playing around with tech, but when are you going to go back to school to become a doctor?”\n\nI think your mother has a lot in common with both of those that I mentioned",
            "Tell them you quit your job and became a barista. They will beg you to go back to bofa.",
            "U asian?\n\nAlso some of here had 0 internships, be proud",
            "I remember your post when you got your offer from BofA. Head high, you know that success will be at your own hands, not even your parents can take that away from you. Best of luck to you.",
            "Advice from a college dropout whose only internship was an IT role at a “prestigious” sporting venue that involved 5% writing code (network software update automation at that) that got unrealistically lucky and now works at FAANG:\n\n1. Zoom out. You are a good enough SWE to get a BOFA internship, you will have a good stable successful career if you stay on track. Your parents recognize the fact of maximizing the time you have now, and are trying to push you regardless of your current joy. I don’t know them personally, but that means this will likely die out when they see you enjoying your internship and telling them all of the awesome work you do. If not, you will definitely be able to get a job good enough to afford moving out of your home, and then you won’t have to hear it as much ;)\n\n2. Your path to working for those companies is much more clear after having an internship like this. This gives you experience and projects to speak on and allows you to focus more on what you may want to do going forward. This will help you pick a specific role to pursue if FAANG is your end target. Your parents would recognize this if they truly knew what it can require to get here.\n\n3. Again, just remember your parents are coming from a place of love and if anything they are just mad at themselves for not better preparing you for what they wanted for you. They feel like they didn’t do a good enough job before so they are doing the rush procrastination special to try and get you to where they want you to be. That’s a special love, but it is annoying and some parents can take it way too far. If FAANG isn’t your target you should explain to them that you appreciate and value their advice but you have specific reasons why BOFA is where you want to go. If FAANG is it, then explain it’s the stepping stone you need at the moment.\n\nFAANG advice: Hitting up recruiters can be nice but it’s hard to determine what teams a recruiter is hiring for, at least in my experience. This for me has led to plenty of manager 1:1s but tougher interviews than I was ready for. Find a role you think is a good fit that you think you’ll be passionate about, figure out who the hiring manager is (make a fake LinkedIn account to stalk, Google is your other friend), add them on LinkedIn and ask for a coffee chat to discuss the open role on their team.",
            "I understand it’s frustrating. Parents always want the best things for us. But they always don’t know the best way to express that. I think you should be open to them. Tell them how you feel, what’s your plan, how you are happy about yourself, how it’s negatively affecting your confidence etc. I think they will understand. But don’t think of abandoning them when you can. Still they are the person who cares the most for you. Congrats on your internship. You have a bright future ahead.",
            "I have similar parents like this. It’s important to keep in mind that they do have your best interests in mind but it’s important for you to know that you have done more than enough already and BofA is more than prestigious enough. At the end of the day, you are working those hours not them. You are the one who put in the work to get hired, not them. We are proud that you have made it to a great internship , fellow CS major.",
            "I don't know what they're talking about boa is probably the hardest bank to get in with in CLT",
            "130% pay increase?!",
            "therapy lol",
            "[deleted]",
            "Get out of home ASAP. This is toxic.",
            "Dude, we’re in the middle of a pandemic. Many people are lucky to get an internship at all, much less at a great company like BofA. \n\nDon’t let their unrealistic expectations get you in a bad mood or ruin your confidence. You’re doing better than a lot of your peers just by being in CS, and from the sounds of it you’re doing better than a lot of your CS peers as well. Pat yourself on the back.",
            "College kid here (Asian female). I also got an internship at bofa for next year. I’m not happy with it. So I’m tryna go for different big tech companies offers",
            "I can tell you go to NCSU by the companies you listed 😂",
            "Sorry to hear about this, comparison definitely makes it hard to be happy.  BoA is an awesome company and I'm sure you beat out hundreds of others to get the role :) And if TC/prestige matters more to you later on, applying for new grad is definitely easier than for internships in my experience.",
            "Bruh your parents can fuck off. BofA is a great place to intern at, congrats :)",
            "Your parents want to live vicariously through you.",
            "I'd be proud if I had an internship at BofA, it's a named company.",
            "I 200% feel you, have faced similar pressure. My dad (not an sde, works as a manager in traditional company) has so little confidence in me, that he always starts with: what if you get nothing, do you have a lab at univ you can do research during summer or we need some IT intern at my company.\n\nDuring Covid, I was at home for some period. My parents used to assign me chores during my office hours. I was like I am blocked, they would frown and say playing with your laptop all day is no work.\n\n I am ready to bet money that you are from an Asian family, if not specifically Indian.",
            "Ask them to get a job there and then refer you. \n\nSimple.\n\nObviously they won’t. Then ask them why? And throw the same shit advice on their face.",
            "Sounds exhausting! Grats on the offer I'm very happy for you",
            "your mom is fucking stupid",
            "I don’t talk to my parents about my jobs because of this kind of thing as well. But one thing to note is that jobs are declining at the moment, meaning interns who would have become juniors may stay as interns for longer periods, and the same thing all the way up. Many companies aren’t promoting as much and aren’t hiring as much. In a different version of 2020/2021 you may have rolled from your previous internship into something “more prestigious”, but with less spaces available, you may have good enough, but there was no opportunity available.",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "XPost in r/Asianparentstories",
            "Man I feel u I had a very similar experience this past yr. My parents have a huge disconnect on how internships work and constantly compare me to other kids. They're like o wow my buddy ching Chong got into google y didn't u get into Google? Ur both in cs.\n\nI cut them off after I moved out. Uve got to be able to set boundaries with certain things. It's very difficult when ur still in school and in ur parents eyes they have more power over u. \n\nThat shit is stressful and infuriating af.",
            "BofA deez nuts",
            "They want the best for you. Stop complaining and mature a bit. Being a millionaire in your 20s isn't far-fetched at all",
            "South Asian parents I’m guessing? You need to just own your career and brush off their insecurities. This is classic Asian insecurity and the need of your parents to be able to brag to friends. It’s super annoying and will likely not go away. I’m sure they also hit you with the “parents know best” like often? Well often they don’t.",
            "See the light at the end of the tunnel and know they want the best for you. Think of the comments as a temporary obstacle and push through. You are smart and amazing and you will be successful",
            "BofA is a dream company for most majors, and it pays well, just ignore them. You’re doing great.",
            "What do they think of Amazon prestige",
            "Yeah, it’s time to separate your self from your parents you won’t depend on them very soon.\n\nyou need to tell them what you said “just because it’s not  google does not mean they don’t pay well,. If you want me in your life after I finish college then you need to treat me like an equal.”",
            "Or they might be just jealous the fact that you'll be ahead in your career with less years of experience than your parents.",
            "Ask them to show you the way. With that much experience It should be easier for them to get in.",
            "r/TrueOffMyChest",
            "What’s BofA?",
            "Similar boat except not as extreme. First of all, BofA is great so idk why your parents are dissapointed. Second, this is just an internship, and even if it was a full time you can always change companies.\n\nOn another note, I know this is the last thing you want to hear, but in my experience having connections is the most important, almost all of my internships and fulltime offers can be attributed to referrals/having the right friends. It is anecdotal but many would probably agree. Anyways, I feel you on moving out and living my own life. Good luck and no sweat, cuz we got a long ways to go still.",
            "Holy crap — BofA! Congratulations! That’s awesome. You are right to be stoked. People who got into tech 20+ years ago have no literal idea what it is like these days. I told my boss (she retired extremely early on her 1990s Intel stock and now I am her kid’s private tutor) about how new CS grads are applying for like 250 jobs before they get an offer and she scoffed. There was nothing I could say or show her that would convince her that it is hard to get a job these days. These older folks really just don’t get it and there’s nothing you can say to help them understand otherwise. Just be proud of yourself and don’t forget to celebrate!",
            "Getting an internship or a job, especially in Faang, consists also of lots of luck. Your mother should know better and factor that in. Also, she should be happy that you're so determined. Congrats on your internship!",
            "Bro you will already be in the top 15% of income bracket once you graduate. Ask your parents to look down once in a while, a wave a of gratitude will wash over them. What do people want to do with so much money",
            "Whatever you said in this post, you need to tell them",
            "Bofa deez nuts",
            "I don’t know what the solution is to deal with that but I know it’s demoralizing as shit so I just wanna say everyone here is proud and you’ve done really well",
            "Yikes this is crazy. This really sounds like what Asian parents would do.\n\nBest case for OP is to lie to them that he got a new role at Google. Hopefully they will shut up for good.",
            "/r/RaisedByNarcissists",
            "You should give them a whiteboard test then when they fail the most basic problem tell them to stfu",
            "BofA pay well. Not FAANG well, but \"I'm always slightly surprised to be earning this much\" well. Also, I would expect you to be getting Amazon recruiters hassling you after a couple of years, so if you actually want to go that route you are headed in the right direction.",
            "If you feel you have put forward your best effort, don't let anyone else's expectations kill your vibe. Even if they are your parents. BofA isn't bad at all. I wish you the best moving on. Keep grinding towards YOUR goal because that is the true endgame.",
            "Tell them to apply with you, or tell them the stress they put you through just lowers your efficiency thus preventing you from getting hired on those companies, they are the reason you're not in Google. \n\nI know it doesn't make sense, but at this point you just need to de-activate them.",
            "But did you really apply for google or apple? Or did you not bother?",
            "Is there any way you could convince them with facts?  \nNot a lot of students get an internship, it seems like you're already doing better than most students. Maybe you could show them some facts about BofA like revenue?",
            "Just ask her why she isn't working there.",
            "Hey kid,\n\nEnjoy your success and dont look for gratification from someone else. It will never be enough.\n\nRegards,\nA sad overachiever asian adult!",
            "I’m focusing on your parents’ parenting for a moment. By the way they’re treating you, it sounds like they’re trying to live through you because they’re wanting for you what they’ve wanted for themselves— or they want to wave around that you work for one of those big companies out there. That sounds quite narcissistic to me — just the way you’ve described their behavior (I don’t know much about the situation but I’m seeing this as face value since I’m just reading what you’ve wrote). It’s your life, it’s your career, and even if you don’t get into a big company *now*, you certainly can later. They didn’t make a ton of money when they first started, right? So why should they expect that from you? Climbing up the ladder is normal - you need to gain more experience to earn that expensive pay raise in most cases. \n\nRight now, it’s the pandemic. Yes it’s competitive right now, and it’s harder to find a job at the moment, that’s for sure! \n\nGetting an internship isn’t easy, I’ve been there. I had to settle for something somewhat close to my profession since I could barely find anything with my skill set (I’m a web designer/ developer). I graduated almost two years ago and I’ve had several jobs since then and I think I’ve finally found the right fit. \n\nI know you can get through this, and I wish your parents would let you be. You’re going to do great, just keep working, and you are your own person. Wish you the best",
            "r/raisedbynarcissists",
            "With all due respect ur parents are bitch asses, bofA is a great place to start out. They should stop bullying you.",
            "It’s tough. Parents want the best for their kids, so, as annoying as they are, at least you know they’re generally coming from a good place.  And their advice is a mixed bag. Sometimes they see things we don’t and we should take their advice to heart. Other times they are completely out of touch and we should just politely nod and tell them we’ll look into it. It takes wisdom to know the difference and maturity to not be a snarky smart Ass when they tell us something we don’t like.       \n\n\nI’m curious. What are some of the specific things they are telling you to do differently?",
            "Bro is this a shitpost I can’t even tell anymore",
            "I'm very sorry you have to deal with this.  You are worthy, and the sooner you can understand that their views and opinions have no bearing on your actual ability to feed yourself and your future, the better.\n\nLook into how narcissistic parents work, and how it affects adult children of narcissistic parents.  Some old people complain that their children never see them anymore, but they could never tell you why (the missing missing reasons - there's an article on this) and everyone incorrectly assumes it's the children's fault.  Just remember, half of all parents are below average.\n\nYou are the only one who has to live with your opinions and decisions.",
            "Tell her to go kick rocks"
        ]
    },
    {
        "post_id": "1awy0mc",
        "author": "I_AM_ACE1502",
        "title": "Does CS stand for “can’t shower”?",
        "url": "https://www.reddit.com/r/csMajors/comments/1awy0mc/does_cs_stand_for_cant_shower/",
        "score": 413,
        "num_comments": 59,
        "created_utc": 1708578002.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1awy0mc/does_cs_stand_for_cant_shower/",
        "comments": [
            "“Cum Smell”\n\nI think I’ve told this story before on this subreddit but in college I met this dude at orientation who seemed pretty nice. A little goofy, but he had a good sense of humor and we hung out a few times. Didn’t get any weirdo vibes from him at all, and figured we could become good friends. But then just because of so much goin on at orientation and him ending up in a different dorm, i only ever saw him in passing.  \n\nWhen I walked into my first CS class a couple quarters later, I saw him sitting there and I was stoked. So I sit down next to him and tell him how glad I am to see him there. For the first full week, we sat together and pretty much established that we were now homies in this class. Second week starts, I walk in and sit down, he walks in and sits next to me and suddenly it REEKS of vinegar. Like straight cum rag. I ended up holding my breathe half the class and figured maybe he just rubbed one out real quick before class and didn’t have time to shower and it was like 100 degrees out (this was in SoCal) so he just had a little bit of cheese curdling or something so I figured it was a one off and that was probably aware of it and hella self conscious. But nope. This went on 3 or 4 more days in a row where the dude literally just smelled like a cum rag.  \n\nI couldn’t take it anymore and one day just sat down at the front of the class. When he walked in, he saw me and asked why I was at the front, and I told him it was because I felt like I wasn’t paying attention from where we were sitting so I wanted to be closer.  \n\nNext quarter, I meet up with another friend to get lunch and he goes, “dude you won’t believe this. This kid in my cs class I just got out of straight up smelled like jizz.” And what do you know, he was in a class with my cum rag buddy.",
            "can sex (with your mom)",
            "Cant Say",
            "Corporate Supremacy",
            "Can’t socialize",
            "Counter strike",
            "Cum sock!!!",
            "Pretty sure that is counter strike there buddy.",
            "I always thought can't socialize",
            "Probably for you",
            "Computer stress",
            "Crocodile Sunduster",
            "Confusing Shyt",
            "Customer Service",
            "Currently Struggling",
            "That’s the double major",
            "STUPID FUCKING SMELLY NERDS",
            "“Can’t shit”",
            "Yes",
            "Can you Silence your opinion",
            "can't swim",
            "Yeah that's why I applied for a CS major. I want to learn how to not shower even better",
            "For some people (most) in this major yea",
            "Celibate subreddit",
            "Ngl i rarely shower. But i also don’t have BO.",
            "😂😂😂😂😂😂😂😂😂😂😂",
            "Idk what y’all are on about, I take a shower everyday"
        ]
    },
    {
        "post_id": "10hyxgp",
        "author": "BenJRizzim",
        "title": "Why Are Internships Insanely Competitive?",
        "url": "https://www.reddit.com/r/csMajors/comments/10hyxgp/why_are_internships_insanely_competitive/",
        "score": 411,
        "num_comments": 100,
        "created_utc": 1674328255.0,
        "selftext": "Just read from an [article](https://www.nytimes.com/2022/12/06/technology/computer-students-tech-jobs-layoffs.html) how Roblox only offers 300 spots but gets \\~50,000 applications for their SWE Internship...\n\nThat's literally a 0.6% acceptance rate or 1 offer out of every 167 applicant. Holy shit...",
        "permalink": "/r/csMajors/comments/10hyxgp/why_are_internships_insanely_competitive/",
        "comments": [
            "I talked to a recruiter from Reddit inc yesterday. She informed me they received 15k application and are busy now when i asked when i will get an update. I was so surprised by the number of application and asked here how many spots they have. 25!  Yeah , 15k application for 25 position. Wtf!",
            "[deleted]",
            "Day in life as software engineer",
            "Because everyone wants experience, or a big name on their resume. Opens a lot more doors than people without.",
            "Way too many people joining CS.",
            "These numbers used to scare me till I realised a lot of people applying are unqualified. \n\nReally and truly your odds are much, much higher (than 1/167) if you actually meet the job spec & you’re a citizen (people outside America are also applying lol)",
            "Top companies are hard to get into.  More news at 10",
            "So is it real that \"average cs students dont even try to get an internship\"? I saw this comment in this sub several times, while in reality every single cs student i know in my uni is actively looking for internship from junior year.",
            "I blame tiktok",
            "It’s easier to apply not that they’re all online. Programmers dug their own grave in this respect.",
            "I don't think Roblox even offers 300, maybe like <200 is what I've heard\n\nI didn't know they got so many applications though, that number seems unreal",
            "Note that even though its \"300\" spots, they would give out more offers than just 300 spots. Not everyone who gets the offer accepts.\n\nIts also a simple application that takes a few seconds. Its not like college applications that would take you days if not weeks/months to crank out the application + the application fee.",
            "Because it’s easy to apply? Half of them are probably unqualified",
            "You chose Roblox as an example? Look around locally. Try companies that don't get the attention of every zoomer under the sun.",
            "Do you want all 300 positions or just 1 of them? Forget thinking about how many people applied for these jobs.  \nI've personally seen my friends apply for positions they are not even closely qualified for. eg: A guy from my uni. completed his masters, did 1 no-name internship and applied for Staff Engineer level position at AirBnB, stating on his resume \"I have 6 years of experience as a software engineer\"; when in reality its 0.  \nRoblex pays in the top percentile, is a great tech company, I call these companies as \\`resume sugar\\`.  \nMake sure your resume is good enough for \n\n1) Automated Parser (filters 90%+ applications)  \n2) Non-tech person : Someone from HR should understand what you did in your projects and/or previous work places. They filter out almost all of the remaining applications and have less than 10 sec to decide your fate.\n\n3) Your potential interviewer, who's gonna be an actual SWE. Be ready to explain the projects on your resume on good tech depth.\n\n4) Manager round (show your 'impact', personality, grit, team value)",
            ">That's literally a 0.6% acceptance rate or 1 offer out of every 167 applicants.\n\nSo, you're saying there's a chance?",
            "that is kinda misleading considering that a lot of the people applying are going to be ineligible (non-juniors if the role is only going to hire juniors, international students if the company won't sponsor, although roblox usually does) or not even remotely qualified for the role, let alone having a well-written resume that would signal that. I would wager that maybe a third (and that's being generous) of the people applying for the more competitive internships are both eligible and remotely qualified.",
            "It really just means people are more aggressive in applying. I simply threw 200 applications back then when looking for internship. If there is exactly 1 spot for each person and everyone threw 200 applications, the acceptance rate is 0.5%, but everyone can have a intern spot. Acceptance rate sounds bad but only means people are throwing A LOT OF applications. It’s different from college acceptance since you don’t throw that much applications for college and each one actually matters.",
            "It’s competitive, but if you think about it, a lot of those applicants aren’t actually serious about Roblox. There are people who didn’t spend more than a second thought thinking about it. So if you put some time/effort into it, you’re already ahead of most of them",
            "Isn’t this exactly like colleges? What’s the percentage of people who get into Princeton compared to those that apply?",
            "These are at “fun” companies, so there is more competition. Apply to internships at boring companies like banks or something. Less competition.",
            "[deleted]",
            "Roblox, FAANG and other big companies will get applicants from nearly everyone in the world. Everyone's heard of them, they are very popular, and the internships probably pay more than many full time devs make. If you are applying to an internship for a company that isn't as well known, then while it will still be competitive, it won't be as competitive. \n\nRoblox could be considered \"Game Development\", and there are relatively few game studios offering jobs/internships compared to the other industries such as insurance/e-commerce etc. Even back when I was in school in 2011, the game design and development program was quite popular.",
            "[deleted]",
            "Well lay offs are one. They’re still hiring, others are on freeze, the scarcity probably gives incentive to applicants to go for it. Sth like that",
            "[deleted]",
            "It's not 'internships', it's 'internships at big tech'.\n\nThere's thousands of other companies who are looking to hire interns that are not big tech with a better acceptance rate.",
            "C'mon, man. It's simple supply and demand.",
            "Sad life",
            "Yo just gotta internship with Google bc this Virtual Internships program I joined, rlly helpful. I suggest using them. Link below https://www.virtualinternships.com/partner/fuzemee/?utm_campaign=fuzemee&utm_medium=referral&utm_source=affiliate"
        ]
    },
    {
        "post_id": "thbv5n",
        "author": "hayleybts",
        "title": "I'm quitting..",
        "url": "https://www.reddit.com/r/csMajors/comments/thbv5n/im_quitting/",
        "score": 413,
        "num_comments": 100,
        "created_utc": 1647628439.0,
        "selftext": "I don't know how you all do it, this really isn't for me.. I can't code to save my life. I tried python for 6 months and skills are still very bad. I don't know how you all get internships/work seriously. Give yourselves more credit.",
        "permalink": "/r/csMajors/comments/thbv5n/im_quitting/",
        "comments": [
            "I'm sorry to hear that, but at least you gave it a shot. Most people never even try these sorts of things, so kudos to you for giving it a try.\n\nGood luck to you, no matter what you choose to do",
            "[deleted]",
            "It’s okay, sometimes in life things are just not meant to be",
            "How have you been practicing python for 6months when you just installed python a little over a month ago? Online courses like codecademy? \n\nEven if you have been using python for 6 months, thats nowhere near how long it takes to become proficient in a language. The early stages are always the hardest but as you become competent with the fundamentals, more advanced concepts start to come easier. \n\nCan i ask what your goal is for learning python?",
            "I was awful for the first year of coding (16 years old). Now I'm a software intern at a big company. Stick with it. I still cant code to save my life, but somehow I survive (and got a bonus?)",
            "You start with the fundamentals then work up. If you are just 'trying to learn python' you are not really learning computer science.   Learning the core concepts and the applying them to program is key. The language is just the tool.   \n\n\nLogic and mathematics are the foundation you should build.",
            "It depends but I think Java is a lot more gentler than Python at introducing people to programming. To me Java’s way of organizing its programs into objects and their respective characteristics and actions was very intuitive when I first began",
            "I toook me 2 years to write basic code",
            "I started coding at 13; by 15 in my freshman year of high school, I was in a Science and Engineering class in my school and in that one semester my friend started programming and was better than me by the end of it. My CS knowledge has been and still is a SLOW crawl, but I enjoy it, so I keep learning. It sounds like you may not enjoy it, which is fine, but don't let the slow movement get you down. I've been coding for almost 9 years now, and I'm sure there are people here who are better than me after a year or probably even less.",
            "It took me nearly two years to be able to code well and I went from barely passing or failing classes to them all being easy, if still time consuming. I'm in FAANG now. Stick with it this isn't something that everyone picks up quickly.",
            "Imagine trying to learn to play guitar, or a new language and after 6 months quitting because you think your skills are bad. I mean maybe you would - but it’s not nearly enough time to know if you can do it or not. \n\nGive yourself some credit - you’re learning something heinously complex. That takes time.",
            "As a fellow electrical / electronics engineering grad, I can tell you that Python might be your issue. Hear me out.\n\nAs an electrical / electronics engineer we are taught about the deep deep crevasses of a computer (down to semiconductor physics / transistors and logic design). For me, that meant I had a very good understanding of computer memory, having programmed in Assembly and C. It also meant that I need to know the inner workings of something to really understand it. That's just how we are trained. You can apply a voltage to the terminals of a transistor, but what happens in that transistor? That's the level of detail we're used to.\n\nSo when I went to a dynamically typed interpreted language like Python, I just couldn't understand it because it was so far abstracted from the machine / metal. I was used to having to allocate and deallocate memory in C, having to be strict about what types I was using, among other things. Most people laugh, but Python and JavaScript are by far the two hardest languages I've learned because they are so far abstracted from the embedded systems level. Even if working with memory in C is super annoying, you know exactly what the computer is doing at any given moment.\n\nI found that Java was a much better language for me personally than Python. Although I didn't have to allocate and deallocate memory anymore (Java has garbage collection), I still had a statically typed language with strict types. I really enjoy writing and learning things in Java now, as opposed to Python because I can better understand what's happening beyond the code. \n\nThere's always the argument that Java is verbose and required a lot of code, but I honestly prefer it that way because everytime I type out a key word my brain registers exactly what's happening. \n\nFor example:\n\nSystem.out.println() \n\nMakes more sense to me from an object oriented approach than\n\nprint() \n\nIn Python.\n\nWhen we call print(), what is actually happening in the background? No idea. But when we use dot notation with System.out.println(), we can clearly see that a method is being called using dot notation.\n\nMaybe try switching to another technology before giving up. Once you learn the fundementals well, picking up other technology is easy.",
            "Don't worry about not being good at coding. Just think in a goal oriented manner. Your goal is to get a great internship. Just do what you need to do to get it.",
            "if you are new to programming, it’s too early to give up. DM me, I’m happy to talk to you about my experience getting started and to discuss with you.",
            "Yeah man I'm in my 4th year cs major and really wishing I could turn back time",
            "I have 2 semesters left of my software engineering degree. I struggle with the fact that I'm not good at coding as well. I always have to ask other students for help and it makes me feel like a failure because I can't do it on my own. It kills my confidence but I have to do what I have to do to pass the class. What makes me feel better is knowing that there are so many different routes you can take like UI/UX design, computer networking, database administrator, etc.",
            "I just bombed my first internship interview. It was not a tech interview but asked a bunch of questions about sql which I had no idea about. Cs is hard man",
            "Hey what degree are you thinking of going for now? \n\nAlso props to you for understanding yourself",
            "i definitely feel where you’re coming from. im only in my intro to programming class and it’s hard seeing my self get past this class and onto harder cs classes. i’m gonna keep trying tho :/\n\nat least you figured it wasn’t for you before getting to deep into it! props to you for doing what’s best for you.",
            "I’m awful at coding. I was in medicine before this as a PA student. I can tell you this much — if you can get through the degree it can open up doors for you that wouldn’t be accessible otherwise. I’m doing a PM internship this summer and I won’t be coding at all, yet I wouldn’t have gotten it without the computer science degree.",
            "if its not your thing, then so be it. at least it won't be in the back of your mind that maybe you should have tried it. i'm glad you're gauging ur own interests well and not simply forcing yourself to continue and lying to yourself that you're enjoying it... far too many people in this field do that to themselves.",
            "It's a constant learning process.  Even after learning multiple languages I still google how simple things work in certain languages because I tend to forget specific syntax.  But I honestly have learn so much in the past year and as a junior student I know I need to keep grinding.  I don't overthink about the competition for internships or that some people in my classes are younger then me with coding experience from H.S. I realized so many people struggle.  I watched a YT video about giving stanford students $100 if they can solve coding questions and that made me feel like I doing good for someone who transferred from a CC to a university. p.s. stanford students in that video couldn't solve simple tree questions or had bad optimal solutions for array questions. So keep grinding and learning and find the fun in it.",
            "Imo 6 months is a decent time to quit. Better than waiting years to quit -- trust me, I nearly finished my junior year in college before deciding to change my major. Wish I would've switched sooner, but no sense dwelling on it. If you've given something decent time and effort, and it just isn't clicking or you just don't like it, no sense in continuing.",
            "It’s nice that people are encouraging OP to continue but it’s also okay to realize something isn’t for you and move on. CS and programming are not for everyone and it’s honestly not going to click for some people. That’s okay! Better to realize it now then land a job you wind up hating.",
            "Did you take a course or something? Im getting the idea that youre trying to teach yourself. Because i started off reading and watching random tutorial videos on my own and things dont click. But when I started taking classes everything started making sense. Classes teach you in an organized way, whereas teaching yourself is more disorganized and messy",
            "I am pleasantly surprised by this very supportive sub! I thought there might be more ego stroking in the comments, like \"I learned basic programming and got a 6 figure job in 6 months of applying\" or something like those YouTuber videos",
            "bro we took years to call out self programmers. If you love it keep trying please",
            "I can feel you frustration , but  after a period of time you will go back and try again.   \nI lost count how many times I quit only to return and try again.   \nFunny thing is that even after you learn , this feeling never goes away you just get better at pushing through it . \n\nSend me a dm  and i can give you a list of courses that helped me learn python.",
            "You are wrong . You just tried for 6 month. It took me years to become remotely decent. Take other 6 to 18 month and than see the results. In tech 6 months are nothing . You have to rethink the way you think. Good results come in time. Nobody became good in 6 month except for the genius people. For the rest of us it took a long time. The only friend of us is time and consistency. You don’t become a good programmer by programming 6 month for 2 hours a day. You become a good programmer for building every day bit by bit for years . Give yourself some credit and go back to study and don’t think about the others and how bad you are. Focus just on work and build up on that and the results will come.\n\nJust remember, for a baby to fully walk it takes up to 18 month and it is just a basic thing for us Humans. Studying something complex that it is not natural for our brain like programming math and science in general it will take time until our brain will start mapping the things in the right way. \n\nGo for it and push yourself for other 2 3 years man don’t give up in life because it is hard. \n\nTake my example: At 15yo I moved to another country without speaking the language no friends no nothing. The only think I knew to say was Hi in the language of that country. And I had to start high school after 1 month of my arrival in that country. Well how did you think I felt ? I did not understand a think for 2 3 month in that country, people were laughing at me and everything. I felt the need to die in the first year but than I discovered the motivational speakers that saved my life and I understand that in order to get better I have to put my head down and work. By the time I finished the high school ( which I finished in time ) I was the second best out of my promotion on the entire IT department of that high school. Nobody was laughing anymore. Everyone was desperate to ask me for help so they could pass their exams . See In life it is like in a jungle. You have to fight for survival. Now this is your moment to fight. So FIGHT and DONT compare yourself with the others, everyone is different . It is like comparing different engines of different cars. Yes every engine does the same thing but in different ways. \n\nGood luck.",
            "It's all about the time you put into it.",
            "Ok",
            "Best of luck on your next journey!",
            "Everything is a shitpost these days",
            "Good on you to realize that sooner than after wasting time getting a degree for something you don't enjoy.\n\nThere are other jobs you can get in Tech that pay just as well (if you want to stay in it) or other fields that are great too long-term. Go you!",
            "It's not for everyone. But you should also know that CS is not just about coding, leetcode and SWE stuff like most people in this sub made it to be. However, getting a well-paying job without going the SWE route might require higher degree or longer time",
            "It's ok, it's not for everyone.  You'll find your path",
            "[Heart! Stay determined...](https://m.youtube.com/watch?v=6S21ZSsC21U)",
            "well played, gg",
            "Stick with it until you get better. Trust me",
            "Honestly, I don't feel myself becoming a SWE or programmer. I feel more comfortable or even better at SQL and database/analyst positions. Seeing coding projects, I'm not at that level despite taking CS classes for almost 3-4 years part time.\n\nI guess I see learning CS is a method of learning logic, but I've learned so much of it throughout my years and I wouldn't take it back. Financially, I hope to get into something more comfortable financially and worthy.",
            "I failed my first semester Intro To Programming(Java) course. Currently retaking it. Maybe give yourself more time?",
            "Your learning process is flawed. If you have started hating coding then quit. But if you are just tired of failing then I would suggest getting a personal tutor who can teach you the fundamentals. Try to find a learning environment where you are learning the most.",
            "I used to feel the same way.\n\nHere’s what really helped it “click” for me. I started learning Java, but it may be better to use C# these days. Start with the basics: syntax, variables, etc. Then learn what classes and methods are. Then look up what object oriented programming means, and learn the concepts behind it. Eventually it will all start to click. You’ll begin to understand what it all means. I didn’t end up using Java much professionally, mostly C#, but the skills all transferred over.",
            "I wouldn't give up, there are lots of things you think you won't be able to do but you gotta keep at it.  I don't do programming myself but I'd like to learn.  I tried caulking the bottom of a toilet today and it was a fucking disaster and my colleague made it look easy.  I'm gonna work on it even though I'm not good at this kind of work.  I'd love to have a job in coding though.",
            "What exactly did you do for 6 months?  If you consider yourself bad, there's not much you could have actually done during that time and therefore time in this case is not a big factor in whether you can do it or not.  Seems more like you just didn't have the right guidance from the start.  \n\nI could  be wrong though.",
            "Listen brother, if you like to code and actually enjoy it, I'll go against everyone else and say don't put yourself under pressure to achiever goals and instead make stuff you like and have the \"you may be smarter than me, but you will never out work me\" mindset.\nThings take time and most importantly not those dedicated or motivated make it, but the ones who enjoy it.\n\nNo amount of dedication or motivation lasts 30 years, but enjoying something can.\n\nThe prerequisite is that you enjoy to program.",
            "I became a CS major because I was inspired from learning python. To each their own.",
            "Don’t worry I’m shit at Python too",
            "I learned i was good at programming back in High School. Got scholarship in University for Computer Science, but like you - i couldnt stand it. I cant imagine coding for 8hrs a day 5 days a week. \n\nThat’s until i learned how to do online programming work (around my 2nd or 3rd term). Changed things for me 😁 The prospect of earning dollars while staying in my 3rd world country was mind blowing to me 😁\n\nI now have 16yrs of industry experience and im still loving it. Money’s pretty good too 😂",
            "Literally in the same position. It turns out that I have a knack for UI and UX design and will be pursuing that after college. I also discovered that I have ADHD also made lots of things clear as to why I struggle so much. Unfortunately, I am really stubborn and I refuse to give up (it's also too late for me to switch majors) so I'm currently seeking treatment for ADHD and have found someone who is willing to tutor/mentor me now and after graduation. Hopefully once I get properly treated for ADHD things will be easier for me.",
            "Not gonna tell you to change your mind because it's your decision, but everyone learns at a different pace and the growth is not always linear. You might get stuck at something for months while your peers advance, then all of a sudden you get to the necessary understanding you were lacking and zoom past them. If you don't really care about it then you definitely shouldn't suffer through it, no point to that since it doesn't make you happy. But it's important that if you actually do want to do this, you don't talk yourself out of it. Our brain has enough neuroplasticity that it can change how it thinks about things with time and practice. Maybe you're just burned out right now, so take a break for a few weeks or a month, and then try again once rested. You got this!",
            "It’s ok man, plenty of career path to choose , plenty of ways to make money, find your calling elsewhere, life’s hard, don’t spend all day and night program and doing Leetcode, get out there and enjoy yourself",
            "Uhhh maybe try college instead of trying to self teach? Self teaching yourself rarely works, and even if they get lucky and get a job, they are usually massively behind and only know web dev without really knowing the intricacies of computer science",
            "I feel you I had to drop my intro to java course made it 8 weeks but functions parameters killed me in a project we were supposed to do."
        ]
    },
    {
        "post_id": "l2xidp",
        "author": "Chaoscontrol9999",
        "title": "Computer science is pure torture",
        "url": "https://www.reddit.com/r/csMajors/comments/l2xidp/computer_science_is_pure_torture/",
        "score": 418,
        "num_comments": 123,
        "created_utc": 1611350922.0,
        "selftext": "Computer science is pure torture\n\nDon’t think I’ll survive the 4 years...the workload is just insane compared to other courses (based on what my friends do), and I feel like I’m behind every single day and my coding abilities is horrific. \n\n\nI’m a first year",
        "permalink": "/r/csMajors/comments/l2xidp/computer_science_is_pure_torture/",
        "comments": [
            "When I was in college it felt like my work load was so much more compared to others. I went to school in Southern California, and there would be people out tanning on the lawn during finals week. I was so jealous.\n\nNow, I make pretty good money and travel frequently (well... not during COVID). My friends who were fairly relaxed during college are straight up struggling right now (we are 8 years out of graduation).\n\nWhen they get laid off or they quit their job, they are unemployed for 3-6 months. When I change jobs, I can start with no downtime (if I choose). There are a lot more examples like this, but you get the idea.\n\nYou are making significant sacrifices right now and you will have 10x benefits in the future.",
            "I didn’t know this until I graduated but CS is listed in the top 8 hardest degrees to do. The others included Physics, Chemistry and Math and an engineering degree I think.\n\nIt’s fucking hard.\n\nI originally got a film degree and then decided to go back for CS and had plenty of existential crises.\n\nBut if you like solving problems it’s a cool area of studies. And growth in the industry means big demand for your skill set. The psychology degree is fun, sure... but they can’t do much related to that field without graduate school. And even then it’s crazy competitive and doesn’t pay as much on the whole.",
            "I was an economics major 4 years ago and thought it was hard as fuck and dropped out of college. Now here I am in junior level computer engineering classes and absolutely loving it and it seems way easier to me.\n\nI don’t want to label you without knowing you but to be honest it sounds like it’s a matter of interest not intellect in your case just as it was with mine.",
            "This isn’t gonna sound reassuring but it’s gonna get so much harder. \n\nmaybe drop a class or two. or evaluate if its a poor fit for you. or if its you think its worth the struggle",
            "My honest feedback is treat is like a full time job. I'm going back and getting a cs degree at the age of 28 after being in the workforce for 10 years. Studying 40-50 hours a week now and making good money after graduation is way better than getting an easy degree and struggling financially later. \n\nEither way it's gonna be hard. Face it head on and bite the bullet now if you can. I got an easy degree after high school and it was a total waste although I graduated with a near perfect gpa. \n\nHowever, you will need to be in a good place mentally to make this work. If your not, I'd put personal growth at the top of your list of priorities.",
            "I am a CS major, had a below average GPA and struggled in many courses, now I have ~7 years of work experience, made a lot of money along the way. One thing I would advise is that it is not important that you like each and every course, but there will be something you’ll be good at. I sucked at algorithms, math and logic courses, but I fell in love with Operating Systems and Architecture, and ended up becoming a platform/systems engineer. If I had quit in year 1 (trust me I thought about it), I would have never discovered it. This major is the best bet to make you financially independent in a few years in the current market, put the work in and see if there is some aspect of CS you enjoy, you’ll be able to find a role that matches your skillset.",
            "CSE major here, honestly I fucking hate school. I have since I was 5, I've changed my major before and hated really just about every second of every class my whole life, including general education courses. I've got about a year and a half left. Just stick with it. A lot of people are going to say things like \"well maybe it's just not for you\" or \"try to make the best of it\" but in reality, school just kind of sucks a lot of the time. It's not fun stressing about grades or tests or staying up until 3am to finish a piece of code or a paper. Just suffer through it for now, and keep your eye on the piece of paper with an inflated worth and the paychecks coming when you finish. You don't have to love school. You don't have to love work (who does? It's work). You will probably regret not finishing though.",
            "I remember I felt just like you during my first year: I wasn't really sure of the choice I made (CS was a \"last minute\" idea, it came out of nothing). The beginning was very difficult, I had never done anything CS related, wasn't able to write code, couldn't see the point in studying CS. I decided I didn't want to give up: I learnt to appreciate what I was studying, I found out a field I was interested in and I was finally able to get a BSc with a very high score.\nMy honest suggestion is to hold on until the end of the academic year, try to really find out if this difficult moment is just a bad first impression. It is never too late to choose another path anyway. If you ever happen to need support, just reach out in DM.\n\nEdit: Spelling",
            "One thing that helps: Don’t overload yourself. I once took computational theory and calculus 2 concurrently plus a bunch of generals, and that was a really bad time. It’s not always avoidable, but try and spread out your hard courses and do NOT rush through the major. Personally, I didn’t graduate in 4 years and never planned on it as it would have required some insane semesters. I would recommend this path if you are feeling overwhelmed. It worked for me, though there were still rough times and it’s not always the best route financially. \n\nAnd yes, you have more work than other majors. But do you really want to be in the position of a sociology or recreation management major upon graduation? What we are doing is (IMHO) so much cooler. \n\nIt’s worth it. Trust me. You can do so much with this degree. And it gets more fun the higher up you get.\n\nDon’t be afraid to drop a course either. Or even withdraw. I had to withdraw from control theory this semester because I wasn’t prepared for the insane proofs that class required. I had no idea what was going on lol. It’s ok, you can take a hard class again in the future when you’re feeling a little bit less overwhelmed and a little more prepared.",
            "Sounds like you’d have a much better experience in a different major",
            "Is comp sci hard? Yes its harder than most majors. \nIs it worth it if you enjoy it? 100%\n\nLet me tell you something, don’t stress about your grades. Thats the beauty of the program. Whereas for a lot of other majors, you need to memorize a lot of stuff, for computer science, you barely need any memorization. You just need to sit down and grasp your concepts firmly. All you need is a strong foundation and then it gets easier to build on top of it. Don’t think of your assignments as assignments. Take them as challenges. Play them like a game. Get done whatever you can. When you get stuck, the community on SO and various other forums is super helpful (tho “sometimes” a bit rude). If you try everything and still dont get a thing done, dont just leave it. Go talk to other people in your course, talk to the prof. Seek help. Find out what you were doing wrong. Ask to look at a solution or be walked through one. No one out there will care how good your grades were the one exception being grad school. All employers will care about is how well can you make something and how much experience do you have making stuff work. \n\nCoding abilities are just that: abilities. They get better the more you train and eventually you just start thinking a certain way. Again, ensure a strong foundation. \n\nAll that being said, what others have said definitely holds up. If you do not like solving problems. If you dont like sitting for hours just to hunt that one little nasty bug in your program then you should reevaluate your decision to do computer science. I’m someone who is going through a lot of shit in my life to the point where I find it difficult to even do the bare minimum a person my age should be doing but the one thing that keeps me going is when I’m working on a fun project. I spend hours of my day being productive and it doesn’t feel like work and at the end of the day i’m glad I was able to do something with my day to add value to it and helps me take my mind off from all the depressive shit life has thrown at me.",
            "Oh I 100% agree. When I started college in 2018 I originally wanted to do CS. Every school I applied to, I wanted to do CS. But I chickened out and spent two years being in a different major every semester, never trying CS. Then this school year, I finally decided to give it a go because my previous plans completely changed. I couldn’t have picked a worse time to start in CS since everything is online. My mental health has been horrible being so isolated and dealing with difficult classes. I don’t have any friends and things have been rough living with my parents. This semester is 100x worse than last semester. I have no motivation and I’m already struggling with my two CS classes. We are only two weeks in and I have no clue how I’m going to pass this semester. It’s so hard to get the energy to really be productive when I just feel down. I can’t drop out and I can’t change majors anymore because I am already delaying my graduation by a year. Basically, something has to change or I won’t be able to handle this semester. But I do enjoy CS when I’m not extremely stressed, so there is a little bit of hope. So there is hope for you too!",
            "I had a very difficult time my first year. College is a hard transition for sure. But now I’m in my third year and I am much more used to the workload. It won’t get easier but I recommend sticking with it if CS is really something you’re interested in. It’ll be very rewarding despite the rigor.",
            "Oof yeah that was me before I switched. I was a data analytics major and there was an overload of software classes vs stats classes which made no sense. So I switched to something which I liked the classes more but still used coding. Think about maybe if you want to apply your coding skills to some other field. Like for me statistics and economics is more mathy, but still uses coding (data science is what I’m interested in). For example, my friend was a comp sci major, hated it, and switched to biology and is now doing computational biology. If comp sci isnt ur thing maybe It’s because of the nature of the degree itself, it’s an “engineering” degree essentially so the software engineering part is what u may not like, not coding itself. Try and apply your coding skills to another field.",
            "If you're struggling this hard your first year I would seriously switch. The first year is pretty bare minimum.",
            "this major is hard af not gna lie. but if it makes you happy, keep pushing! you’ll learn how to balance school, work and personal life! don’t let the workload discourage you because at the end of the day, you enjoy coding! \n\nif you don’t like this major then definitely switch to something you like. i know a lot of people who did CS for the money, but they ended up switching majors later on.",
            "[deleted]",
            "What are you talking about? Compared to other courses like mechanical  or electrical engineering, CS is a cakewalk.",
            "[removed]",
            "Meh. There are worse. Engineering is rough. Chemistry. My first degree was bio and it was harder to go to labs then to sit in your room and do the work.",
            "Bro just keep grinding as a first year myself you gotta grind what what you want my mother always says nothing good ever comes easy",
            "Here's a question... are you sure you like / want to pursue CS? CS is difficult, but imo it's only hell or \"pure torture\" if you don't really care for it. As hard as it got in college with classes having me on the verge of tears I still loved what I studied at the end of the day, if you don't have the same you should reevaluate. It's not bad to do the major if you don't like it, I get it we all gotta make $$ somehow, but if you really feel this way it's gonna be a trade-off for you that you have to acknowledge. I think CS is one of the most brutal subjects if your hearts not in it because not everyone is built to sit in front of a screen for hours debugging.",
            "> I'm a first year.... \n\n\nOooooh baby. It gets worse. XD\n\nRight now you have two options (since you haven't invested too much yet and you're not as deep in the rabbit hole as the rest of us). \n\n1. You can quit and take up something that you actually enjoy. But this will require quite some sacrifices. \n\n2. You can bite the pillow and grind on with the rest of us. \n\nNot all of us like cs, and we'd definitely be lying if we said we aren't here for the massive paycheck at the end of this tunnel. \n\nBut we aren't here without sacrifices. I hate cs. It makes me rage that my friends in Econ do jack shit yet have stellar GPAs. I hate that I essentially sacrificed my social life in university because I was too scared to cheat on assignments and exams. I hate that I have to give up my sleep schedule for these insane classes\n\n\nFuck CS. I'm literally here for the money.",
            "There is a reason you can make 200k out of college with a cs degree",
            "Reading some of the comments here, people are heralding that CS is better than every non-STEM major and you will never not be on unemployment while a liberal arts major will keep you unemployed. Maybe it's cause those people are immature or aren't taking college seriously and should consider taking a break or going back when they feel ready to go back.\n\nI graduated with a Bachelors in the liberal arts and had a decent run in education, but I'm back in school and I'm now taking my current education in CS in a more mature manner than I used to in my previous education.\n\n I used to have lots of trouble having 2-3 classes and programming classes in the beginning, to where I just dropped out near the end due to being frustrated at the lack of support, having mediocre teachers, and I was falling behind. So basically I was sort in your shoes too, but now I feel a bit more confident in my programming skills, as long as I have Google and an understanding of a language.\n\nSo if you feel like you really can't do it, find another major you can see yourself doing and what you can apply it with in terms of a career or a job. Maybe go a community college instead to put off the pressure going to what I assume is a 4-year uni.",
            "Lol u surely haven't seen the course sequences for the engineering programs. They are much much harder than cs mainly cuz cs students get so many electives. Im in last year of SEG and by now im adjusted to the course load but other eng programs like CEG and ELG are even harder in my opinion with not much reward considering most of them end up doing cs or seg related jobs.",
            "what's wrong with some of you people, i'm so glad to be able to code. can you imagine doing anything else for homework? like punching in little logic puzzles for a grade and later for money is a dream come true. if you don't like it maybe do something else. you could be writing essay after essay for homework instead and i don't know about some of y'all but that sounds way less appealing.",
            "If you don’t find the challenge fun consider a new career path. The jobs arnt any easier. I got no training or anything on my first job just thrown in as a developer had to study the system and the API used, read documentation and practice certain technologies in order to keep up. I have spent weeks working 60+ hour weeks when needed. \nHave you spent 60+ hours a week EVER studying/at classes/ building side projects and working internships combined? \nI have. \nMost people in my graduating class did. \n\nThink long and hard if you really want this I saw far too many friends go through 2 + years of CS just to realize they hate doing it or failing out and wrecking their GPA. \nI’m not trying to discourage you I am trying to be real with you about the kind of person you may need to get disciplined and make yourself in to. \n\nGo compare yourself to Physics students or Electrical engineer students they will have similar work loads in a good school. And ones that go to school that don’t push their engineering students hard have terrible job outlooks.",
            "Hate to break it to you, but CS is easy compared to a LOT of majors out there. Not necessarily easier in terms of skill and studying required, but let me offer you some perspective:  \n  \nWhen I first went to college, I was a tuba performance major. Every semester, I had to get written permission from the university to take more than 20 credit hours. Included in those 20-23 hours were about 5 ensembles that met 3 days a week, at one credit hour per ensemble. I'm not even kidding when I say that between gen ed/major reqs and ensembles, I was regularly at 10 \"classes\" or more every single semester. Now as a CS major, I have 4 classes with two labs, and an almost infinite amount of free time compared to my first time through school.  \n  \nThat said, if you genuinely are having a terrible time and hate what you're doing, it isn't going to get much better from here. Maybe consider taking a few different gen eds that sound interesting to you next semester and see if something lights a fire you didn't know about before.",
            "Change your major dude. If you’re dying this hard in intro freshman classes it might not be the right fit. Choose a career that pays well AND that you enjoy my dude. Even if it pays a little less than CS.",
            "Sorry to be a party pooper. You probably don’t have the IQ to be doing computer science :/",
            "first time ?",
            "It's hard but worth it. I got dual degrees in EE and CS. Was 💯 worth it and I still had plenty of fun in college.",
            "Where do you go to school",
            "I think the biggest problem for me is the gen eds. The classes are generally easier, and are a good GPA boost...but they are time consuming and pile up if you lack some time management skills. Sometimes I think a 4 year long bootcamp would be more stress free and useful for the field...but then again the things you learn in the gen eds are somewhat necessary for soft skills. That being said I don't know why CS is in the engineering department of my college. I get that \"Software Engineering\" blah blah but none of the Engineering courses are every targeted toward computer science and is seemingly extra bullshit to deal with.",
            "I am applying this spring.... I am fucking scared lmao. I got good grades + extracurriculars but have no idea how to code",
            "I'd evaluate if it's really right for you, and that doesn't mean not doing CS as a career. I'm a CS minor and super chill humanities major, meaning I get to take whatever CS classes I think would be beneficial for a SWE career. No math or anything either. It makes things a little bit harder to compete with CS majors, but I'm having a much more chill college experience and basically the same career result. Prob not if you wanna work at FAANG but just something to consider!",
            "Unsure if i would agree with most people in here, but i’m a CSE major and i love my classes, to the point where i’m graduating this semester and i feel like i wasn’t able to take enough of the classes that i wanted to. Yea the money is great and the career prospects are better but at the end of the day coding is fun and solving problems is great :D love passing test cases. \n\ndidn’t know i would major in CS til sophomore year came into college as a pre med major. just love the stuff man, i’d think a lot about deciding what you plan on spending the majority of your time doing",
            "The transition from high school is a pretty big jump, especially if you go to a top uni. It gets better, sometimes they try to weed out some people the first year. I'm a second year, and I remember I felt so overwhelmed the first sem. Work on your time management skills, make a schedule and stick with it, try to focus when you're working, and don't check on other stuff during \"work\" hours. Also, you're young, work hard now so you can have a good future, this doesn't just apply to CS. Time passes whether you're working or, so why not work? Build a foundation now and you can relax when you're older.",
            "You could always transfer to an easier CS school.  I had a friend get into the top 5 CS school and later switch his major to Philosophy.  I don't know if it's because it was because the curriculum was too hard for him or if he found out CS wasn't for him, though.  If you're at a really good school and are struggling, look into transferring to a more laid-back commuter school.  The education you'll receive will undoubtedly be inferior, but I always like to say \"you get what you put into it.\"  That is, no matter where you go to school, no matter how shit the CS program is, so long as you put in time outside of class to learn, you'll do fine like everyone else.\n\nI go to an unranked commuter school with a \"meh\" CS program, so I am quite biased.",
            "It’s a steep climb, but a climb well worth your while",
            "What courses are required for first years at your school? My uni does something where first years take two three week courses, one before each semester and then we only have 4 courses to deal with during the regular semester for first year. I’m coming up on my third week of a linear algebra course and it is intense because of the time constraint but otherwise I would have been taking linear, calc 2 and algorithms all at once next semester so I’m glad I’m in this one for the 3-week. Anyways, just curious what other schools require for first years.",
            "Switch majors! Don’t feel like you have to force yourself to do something you don’t like. The workload for cs is a lot and cs majors accept that going in, but it’s not bad when you’re working on something you love. You should pursue something that doesn’t feel like work when you’re doing it. Best of luck!",
            "looking forward to getting fucked in the ass in college, yay!",
            "First year classes are for sure the easiest. If you manage your time tho it's not that bad. Just try to work on your assignments everyday and start them early. If you do this you should be able to have a good school life balance.",
            "I guess you could call me a second year even though this is my second bachelor's degree. It will take me three total years to complete this degree. I'm just now at the point where I can understand most C++ code to the point where I know what's going on line for line, however I still cannot code from scratch myself. I always need to look back at previous projects of follow some sort of skeleton code to have anything remotely close to what the assignment is aiming for. Just stick with it. It doesn't happen overnight, or even in a single semester or year.\n\n&#x200B;\n\nFor what it's worth, I take 2-3 classes of straight CS per semester. If I was taking 4-5 classes per semester it'd be impossible.",
            "Welcome to the hell brother. 😜",
            "It’s hard. No denying that fact. But, give yourself a moment to think about what CS and tech means to you. Why are you doing it? Security in job? Love for tech? Interest in SWE? Money? \n\nSome reasons are worth the struggle, many are not. Think about what you really want to do in life. CS has been the most difficult journey for me but the most rewarding. I wouldn’t trade it for any other major. But I also want to go into the field because I find it intriguing and interesting. Also job security/impact are great bonuses. \n\nJust spend time reflecting what you want and if CS can help you get there. It’s a wild ride but you’ll become so much better at the end of it!\n\n(PS: failed a ton of tests, projects, home works and quizzes along the way. You’ll take your hits but rolling with the punches and learning to get better will help you in the long run!).",
            "I was in another engineering and it is pure torture too! The workload is crazy and we have night labs for 3 semesters, where the labs started at 8pm and end at 3am.. once I finished at 6 am! And going to a 7am class after that. It was a once-twice a week lab and I felt you! I really wanted to convert major and envied other majors. But hang on OP! you can do it!",
            "Does anyone have $$ so I can try college, what's so hard about software engineering??",
            "BUCKLE UP BUTTERCUP!! \n\nNo for real I felt the same way. Just try to take some deep breaths and break down each problem a bit more and don't look at it so broadly like that.",
            "It took me exam resits to catch on that if I was going to pass my degree I'd need to literally shut myself away and study like fuck for the rest of my course and I'm *still* trying to get my social life back together 3 years on. If you're still keen to push through just focus on all the money you'll be making and how employable you'll be at the end of it all. Good luck.",
            "I am one semester away from graduating with a bscs degree.  Your future in cs will pay off in spades if you work hard for it.  I know that sounds so cliche but its true.",
            "Hey do not worry! It gets better with time. You will have your eureka moment and things will start to make sense just stay consistent. Coming from somebody who is nearly completed with masters in CS",
            "Not to assume anything but don't feel bad about getting extra help on the side. I had a...idk complex about getting tutoring for a long time, thinking oh I'm smart I can just figure everything out. Errr, wrong. The smartest people know when to ask for help.",
            "> the workload is just insane \n\nWell, what are the workloads that are insane here?",
            ".5 years to go but that wasn't enough torture for me so I've applied for a masters now",
            "Dude if you need to go part time. It is okay to do that. Your path doesn’t have to look like others. That’s what I did and I am totally fine. I have internship prospects. Nobody asks me about why I am part time.",
            "Do you have prior programming experience? If not CS is super rough the first 2 years. After you get your feet wet into programming algorithms. It’s get much easier. I felt like during my college time the first 2 years are a way of filtering out people not willing to put the effort. It’s going to be difficult and you will get paid a ton in the long run. The pressure and difficulty of college will prepare you pretty well for the field. There is a light at the end of the tunnel it does get easier and better. You’ll hit that euphoric moment when you see your ideas translate to running code.",
            "If you're anything like me, things will get harder and then get easier. I went to a \"Top 20\" CS program, and the first two years felt like they were trying to get people to drop CS... because they were. Classes were going from 50 to 150 students per semester over the course of a year. From what I've heard, this is a common trend as CS is slowly becoming the new \"Finance\" (i.e. you get the major then make a lot of money). Professors and TAs will be overwhelmed and pressured by administration to lower class sizes. \n\nOnce I hit junior year, the classes got much harder and often more intensive, but I felt like I wasn't floundering on my own. Professors, TAs, and other students were now all on the same page, as opposed to being at odds",
            "Your first year should be a breeze. It's the absolute bare minimum, I would consider switching if you're seriously struggling",
            "I'm currently a junior studying CS and I can say with certainty that it gets easier from here on out. Intro classes are the worst-- they're literally meant to weed people out from continuing with CS as their major. Ridiculous workloads, horrible curves, incomprehensible professors.  As an incoming freshman in CS I did not know how to code at all, and by the end of the first semester, my self-esteem was in shambles.\n\nOnce I got past most of my intro classes, everything was different. Assignments became more reasonable. Getting As became a lot easier and required a lot less work. Professors taught courses in which they specialized and actually were passionate about their topics. While I still can't say CS is remotely easy, things get a lot better, and at the end of the day, the piece of paper you receive after graduating will be worth the struggle.",
            "Try MIS. You can still become a software engineer and still have knowledge of business something computer science lacks",
            "I am a first year too and the workload IS a lot, but coding, programming and creating software is something that I want to be good at, and I am willing to pick this as my \"struggle\". Motivation is temporary. Rely on getting your work done through self-discipline. Maybe CS isn't what you'd like to do and that is okay! But nothing in life comes easy and no matter what major you pick they all have their struggles."
        ]
    },
    {
        "post_id": "18me7q7",
        "author": "lesbianknittingqueen",
        "title": "We did it girls 💅",
        "url": "https://www.reddit.com/r/csMajors/comments/18me7q7/we_did_it_girls/",
        "score": 411,
        "num_comments": 80,
        "created_utc": 1703024335.0,
        "selftext": "I finally landed the internship! After months and months of interviewing and leetcode, I've just accepted my offer from Amazon even though I go to a random liberal arts college and had no referrals.   \n\n\nThat being said, if anyone has any recs of what I can do to best prepare for my internship at Amazon (good tools/frameworks to know) let me know!",
        "permalink": "/r/csMajors/comments/18me7q7/we_did_it_girls/",
        "comments": [
            "Slay 💅",
            "Purrrr",
            "slayy #hotgirlscode",
            "Yasss girl 🫦💋",
            "congrats! interviewing and landing an internship is tough esp in this market\n\nas far as prep, honestly nobody can say what you will be working on. you probably won't get team matched until a couple of weeks before your start date. my advice is relax and enjoy your holidays. work on side projects or research you find interesting just to keep your technical skills sharp",
            "hot girls code. I got amazon too in Seattle!! Feel free to dm",
            "Girl bossed",
            "Advice is to skip wasteful on boarding things and hit the ground running towards your project. Your return offer is measured by completion, quality, and leadership metrics. Google the last one. Ask and communicate evaluation metrics for internship and mention your goal of retuen offer in your 1st 1 on 1 with your manager. Do more than your project goals (you'll see what I mean).",
            "How?! With no cs school I'm really curious! Not out of hate out of pure jealousy",
            "Congrats!",
            "Gratz!",
            "Live laugh leetcode",
            "Congratulations on joining amazon 🎉🎉🎉 To prepare, you can’t do much. Everything depends on the team and project you are giving; however, Amazon will teach you everything you need in your first month. So just keep calm, select your start date, Find housing(seriously speaking, start early 😐) and celebrate with friends, in summer you roll out!!! Congratulations again🎉🎉",
            "Congrats! There’s no real point in trying to prepare since teams vary wildly and most of Amazon’s development tools/process is in-house stuff that you can’t use until you get there",
            "Yess Congratulations!!",
            "Nice, I got an offer from AWS in sales in DC, where u gonna be?",
            "Congrats!",
            "Great job! 🎉❤️💄💋🍾",
            "Okurrr",
            "That's what's up! Well done 🙌",
            "Slayy💃♥️",
            "Crazy",
            "Diva UP",
            "Use Cursor ide, it’s really awesome and it’ll help you a lot",
            "proud of you girlie x",
            "OMG love this for you 🥺💋",
            "Period!!!!",
            "PERIODDD SIS",
            "Periodddd , congrats!!!",
            "Congratulations!!!! What is the internship for? I interned this summer as an Enterprise Account Engineer.",
            "Congrats!",
            "SLAYED",
            "HOT GURL",
            "PURRR SLAYYYYY",
            "Yes GURLLL",
            "CONGRATS! I’m so proud of you beyond belief 🩷",
            "as u should bestie",
            "Period Queen💅🏼",
            "Queen shit",
            "Congratulations thats awesome. Are you a sophomore or a junior",
            "I thought amazon wasnt even interviewing",
            "i don't know if the post was only for girls but.... \n\nCongrats!!!",
            "Enhorabuena",
            "congrats! what is the role?",
            "Omg girlie can I dm you",
            "Go girl!  Congrats!",
            "Go girl!",
            "Slayy girl. Yeah could you pleaserecommend me any tool/frameworks? I have learn everything by myself. My uni aint teaching me anything",
            "yess let’s go😻",
            "Yasss girlll! Congrats!",
            "Congrats queen !!!",
            "Affirmative action to it's finest.",
            "Whatever I failed my Amazon interview",
            "Amazon CS internship after arts college? sorry, girl, you were hired for diversity",
            "I was there last summer and loved it",
            "Yes queen.",
            "SLAYY! Congrats!!",
            "Fkin congrats!!!",
            "yasssss!!!! congrats",
            "Congratulations!!! Lets goooo\n(I just bombed my Amz UK interview but whatever)",
            "Congrats",
            "W",
            "Link ur resume/where you applied at",
            "I’d love to see your resume if possible!",
            "Queen!! Refer me lol"
        ]
    },
    {
        "post_id": "z9flt8",
        "author": "Pigglewiggy",
        "title": "My parents are disappointed the only intern offer I got was an offer at Chevron",
        "url": "https://www.reddit.com/r/csMajors/comments/z9flt8/my_parents_are_disappointed_the_only_intern_offer/",
        "score": 408,
        "num_comments": 147,
        "created_utc": 1669872680.0,
        "selftext": "They said it is not prestigious like FAANG. Yeah it’s not so what?  At least I got an offer! This is my last summer to intern before I graduate and my first tech related role.  They somehow make me feel like a failure.  Granted I didn’t send out hundreds of applications, I only sent out 10. It’s been a rough year mentally and wasn’t in the right headspace.   I feel lucky actually.\n\nAnyway just wanted to vent.",
        "permalink": "/r/csMajors/comments/z9flt8/my_parents_are_disappointed_the_only_intern_offer/",
        "comments": [
            "If my kid doesn't get a FAANG internship offer straight outta the fucking womb, it's off to the gulags with him.",
            "I interned at Chevron last summer; the culture is chill, I worked like 10 hrs/week, my fellow interns were great, and I had a shit ton of fun.\n\nCongrats!",
            "[deleted]",
            "wait until your parents find out you make your own decisions",
            "10 applications & 1 offer? 🐐",
            "Hey OP! I am still sooooo proud of you! Congratulations on this HUGE achievement. You so deserve this and are going to crush it in this exciting opportunity. I'm rooting for you. Sending lots of positive energy your way. :)",
            "Asian parents?",
            "I work at Chevron and I love it!  It's also safer than big tech right now from layoffs.",
            "Remember you’re in charge off your life & your journey! You ultimately control the tempo of your life. Expectations other than your own for your career are not important. Do what makes you happy & celebrate every win. Even if the win is small!! Lastly as someone who’s interned at Amazon, Microsoft, Meta, PwC, and worked part time on the corporate side for Apple I can tell you life is much more than prestige. Go after those companies for the right reasons only or it will harm you",
            "Geologist who work at oil companies, can clean up toxic waste sites and prevent contamination. Just because it's oil doesn't mean they're trash\n\nYou could work for a banking industry that supports white collar greed that destroys the earth and societies. Would they be pleased your hands look cleaner?",
            "Bro you're an adult... fuck what your parents think. If you get an internship at Chevron, good for you man! Then being disappointed is the result of them comparing you to other people and that is fucked up. Never compare yourself, push for what YOU want and be happy. Cheers.",
            "Yea congrats, i would consider u lucky given u only had to send out 10 applications... ive seen some people send out hundreds and even THOUSANDS of applications  with no offers so by this metric u did well. Good work son :)",
            "I only got a swe internship my last summer too but it was cancelled when I was about to start so i graduated in may with no internships.  Something is better than nothing and also internship matters a lot less than a full time offer anyway. I passed the final Amazon round (on waitlist though unfortunately) even with no internship, so you’re big chilling. Be proud of yourself! Your parents probably don’t understand how stressful and complex our interviews can be. Congrats!",
            "Your parents look at you as an investment and they get frustrated when it doesnt pay off like they wanted. Thankfully my parents are supportive but their parents were like that. They told me that in those situations the best thing you can do is get away and as far as you can. Build your life and keep them far, because they wont be truly supportive unless you are are successful in their eyes. They might be family to you but they clearly dont see you as family.",
            "fuck their opinion do whatever you want",
            "Nothing to be disappointed about there. Tell your parents to fuck off",
            "Congrats on the offer! That probably took a shit ton of hard work, especially in the current job market!",
            "prestige doesn't make people happy.  You can please your parents all you want, and that won't make your life happy either.  Give yourself some time to learn what you want your life to be like.",
            "An internship is only an internship. It's there so you get early exposure to the industry. Period. It ain't mean nothing beyond that or say things about you or your skills. \n\nIf it helps you feel better, I interned at my own school (lol) doing menial database maintenance stuff that went nowhere (I also skipped days or fell asleep). All in all it was boring as hell. After graduation I went to work for FAANG and now my TC is \\~$500K. \n\nAll that is to say that internships don't dictate anything in your life. It's a beginning only. Good beginnings or bad beginnings don't mean anything relative to outcomes.",
            "Your parents can chill the hell out.\n\nMy first internship was making a WordPress site for an erectile dysfunction clinic. Count your blessings.",
            "Tell them that only 1% of CS undergraduate students globally get internships; the rest do coursework and drink beer.",
            "African parents I believe",
            "Congrats on the offer! While your parents' may *seem* disappointed, just remember that at the end of the day all they want is to see you have a successful future (at least I hope so). Keep doing you and I wish you all the best🙏",
            "Congratulations on your offer.",
            "Wow, your parents are pushy. My parents still have very little idea what I do.",
            "First job is the hardest. More true in this brutal environment with heavy tech lay off. IMHO, your parents are a little out of touch.",
            "I interned in the houston office. That office def better (biased) but either way working there is nice and chill. Highly recommended. 5-10 hour work weeks was normal. Pay is great for Texas. Don’t worry about them, depending on where I go after graduation Chevron might’ve provided me a better quality of life",
            "Why is FAANG more prestigious? Using your CS skills to develop useless tools for shitty social media companies? \nRather use it for something that actually contributes to society",
            "FAANG is overrated and outdated. Chevron is a great gig congrats",
            "You should celebrate it. I didn't even have any internships and now 10 years out of school I make $800k",
            "Lucky ass",
            "You’re an adult. Their disappointment is their problem not yours.\n\nCongrats on the offer!",
            "Congrats! I'm super proud of you.",
            "I’m sorry that your parents are putting that much pressure on you, especially when it’s just an internship. You’re not a failure. Most students don’t even land internships in the first place , let alone ones at decent companies.",
            "Parents fucking suck. Get in where you can in this economy. It doesn’t have to be permanent. Or if you like it, stay. Fuck your parents. I would never do this to my daughter. \nI understand where you’re coming from, I also didn’t send out a bunch of apps but I got an offer from a company I interned with that I like. A win is a win",
            "if you start in FAANG you have less salary mobility. tech roles rewards people for switching roles more often than it does staying in roles. There are large edge cases but i think the generalization is fair.",
            "Are they Asian Parents? If they are, I would hardly be surprised they said that.\n\nEdit: someone already commented this lmao. My parents were happy that I at least got an internship because I was very close to not having one at all",
            "Congrats on the offer! Getting anything is impressive in these tough times.",
            "Remind them of all the layoffs at the FAANG",
            "Wait until your parents find out getting any internship this year is harder than years past",
            "Congratulations!! You did amazing don’t let a single person diminish that.",
            "Sound like immigrant parents. Sorry to hear this, but don't let them get you down. The market hasn't been nice. Early in the year and last year, I was turning down offers left and right, and now I only have two while getting mass rejections even after doing well in my interviews. If Chevron fits your goals stick with them and if not continue the grind but don't let anyone bring you down about this.",
            "jesus christ. im glad you aren’t taking it to heart",
            "Why do people feel like they need to apologize for their successes? You got an internship, full stop! Congratulations!",
            "Perhaps they have not seen how tech and energy have each respectively fared this year",
            "Damn my parents do not even know what Computer Science is",
            "Congratulations on the offer! You don’t need a MAGNA internship anyways. \n\nIt’s better to have a reverse punchline ready and blame your parents for the disappointment. I know this is slightly toxic but you don’t have to suffer alone.",
            "Tell them you would have gotten a FAANG offer if they were better parents.",
            "Congratulations on the offer.  It is experience and FAANG companies have been shedding workers of late.  Parents don’t always know best.",
            "Congrats on your offer OP, we're proud of you.",
            "Dont learn this too late like me... \n\nDon't do things for others unless it's your lover or kids. Do these things for yourself. That's fantastic news and you should be proud of yourself",
            "It’s better than no internship",
            "Congrats! Getting an offer by only sending out 10 applications is really impressive! I hope you enjoy your time at Chevron",
            "That's great, so what if Chevron is not \"prestigious\". It's your first job, you need experience, maybe they will hire you. Right now all the FAANG companies including Microsoft are laying people off. \n\nYou might be able, to have a stable job for a few years, then you can choose where to go.",
            "Focus on learning. If there are opportunities for you to grow at Chevron, then grow. I worked at Google for 8 months, loved the soup (NY Office) but wasn't thrilled or anything by the work. The prestige of FAANG is something that helps FAANG, you're here to help you.",
            "Chevron appears to do a lot of work in high performance computing and seems really interesting.",
            "Hey bro, any offer is a good offer right now in this market. Chevron is not a bad move, any internship is a plus on a resume. Also, getting an offer after applying to only ten companies is not a small feat either- most people have a lower success rate. Congratulations!\n\nThis said, i caution you against saying that you’re in a bad headspace prevents you from sending more apps. you are capable of so much! once you believe it, you achieve more. life is hard sometimes, seriously, but it doesn’t change what has to be done. as soon as you realize this it will change your life like it did mine\n\nit’s not too late to send out apps. if you know where to look, you could easily crank out 3/day in an hour. \n\nlet me emphasize- this is an important investment. i have friends smarter than me + with better grades who didn’t do the work. now i’m spending my summer making 80/hr as a junior in college while they flip burgers at mcdonald’s. \n\nwork ethic and perseverance goes a long way- you are capable! you just have to believe it.\n\ngood luck, and congratulations on your offer 🙏",
            "If it makes you feel better, I got rejected by Chevron.",
            "I'm proud of you OP. Internships are a great way to kickstart your learning in the workspace and meet people who will teach you real-world skills. It's a chance to develop something you will really need in your career -  the ability to learn quickly,  have a flexible mind and work well with people.\n\nI also grew up with really pressuring family, and what they think on this issue isn't really helpful for you, or relevant to the real world. Seriously, how would you get FAANG offers this year when FAANG companies are all laying off workers? I'm sure your parents mean well, but ignore them on this and be proud of yourself.\n\nThis is a tough time for young people looking for jobs in general, plus the rough year you've been having, good on you for overcoming that and finding an internship! Appreciate yourself and use the opportunity to its fullest.\n\nAlso, if it helps at all, from my experience, parents will come around. Maybe they just don't view you as a full adult yet and don't fully trust your decisions (my parents legit did not until I was like 30 and with a long-term partner). But, you don't need to prove anything to them. Ultimately you are responsible for your life. Try not to let it get you down. At the end of the day your parents care about you and when they see you succeed, they will be happy.",
            "How did you apply to the internship? Did they have someone on campus at an event/career fair or did you apply online? If I decide to go back to school it would be convenient to work there.\n\nMy dad worked there for 30 years. Maybe the IT side is different but he left because of the corporate politics BS. MBAs don't know how to run a business like business-minded technical experts.",
            "Maybe they didn't hear about 10,000+ that have more experience than you and already worked there who are also now in the labor market.\n\nLet them be disappointed, not your problem. In today's climate you are making progress.",
            "OP set boundaries with your parents NOW! It gets way harder once your wife is involved.",
            "An alternate take:\n\nIf they are disappointed, it's because they believe you can get something better than what you got. \n\nI wish my parents had set higher expectations for me. It would have helped me set higher expectations for myself. Having someone to push you and call you out when they think you can do better is a blessing.",
            "Did your parents intern at FAANG? No? How disappointing. You should shame them.",
            "You did 10 applications and you chose chevron as 1 of them???",
            "This has got to be a troll.",
            "I agree with your parents you should have done better.",
            "My parents were disappointed I only got Amazon",
            "[deleted]",
            "[deleted]",
            "My son is almost 1. He isn’t a senior dev yet. Obviously that’s crushing to me. But he isn’t even a junior yet. So that’s devastating. But not even a FAANGMANGMA internship? I don’t know how to keep looking at him and thinking “that’s my son.”",
            "Arent you an adult? Why do you care what your parents think of your career? Do you ask them about your haircut? Your cooking? You sound overly dependent.",
            "Lmao my parents were just impressed I was even admitted into a college\n\nAlso fuck internships, I don't like to work for money let alone work for free",
            "Renegade your parents",
            "Ask them to solve trapped rain water and if they dont tell em im dissappointed in you",
            "Just reject the parents, easy peezy.",
            "where do your parents currently work\n\nwhat was their first job\n\nwhat was their gpa",
            "NTA divorce parents",
            "Smh bro your fault for just being an L son get better coding skills nerd",
            "Sounds like your parents want to brag. A good job is a good job period.",
            "Dam your parents kinda… suck. Getting an internship alone is already a blessing given this environment. I remember when I was younger my parents would celebrate me getting a summer job at a fast food restaurant.",
            "FAANG over rated.  They may have a hard year or two ahead of them.  Enjoy your internship.",
            "You don’t need anyones approval other than your own. Good job securing an internship in this market. I’m proud of you!",
            "Well i would call myself lucky if i got to intern at IT  sector in this company.",
            "I got no offers with a 3.91 Graduate GPA and 3.88 undergrad (5yr program). Chevron is good. Ask them if they’ve read the news lately…"
        ]
    },
    {
        "post_id": "z3n9p1",
        "author": "None",
        "title": "Even with two prior internships, the job market right now for new grads is cruel",
        "url": "https://www.reddit.com/r/csMajors/comments/z3n9p1/even_with_two_prior_internships_the_job_market/",
        "score": 407,
        "num_comments": 53,
        "created_utc": 1669304877.0,
        "selftext": "I have two internships, one at a local cloud IT company, and the other at Amazon, and when I first started applying for new grad roles, I was like \"yeah I have a pretty strong resume, I should come out great\" so I was initially sad about not getting a return offer, but tried to keep my head up thinking that I could do better.\n\nOnly to see that with more applicants than ever, fewer companies hiring than ever, and less headcount than ever, my response rate now is worse than it was when I was applying for Summer 2022 internships.\n\nRant over, thank you for coming to my TED talk.\n\nEdit: I'm hoping for the best for everyone. I hope all of us in the struggle can make it to the other side and find a job.",
        "permalink": "/r/csMajors/comments/z3n9p1/even_with_two_prior_internships_the_job_market/",
        "comments": [
            "Lol i have no internships and supposed to graduate this summer, im finished",
            "[deleted]",
            "Also, remember you’re applying at a time that companies famously don’t hire Jr level ( October to December). Wait till January to try again . But if you’re still in school, I suggest you use a tool like Fiverr or Pangea.app to get yourself a job and make it full-time after you graduate.\n\nI know it sucks, but a lot of my mentees are still getting plenty of offers if they’re willing to work during the school year",
            "There's going to be more posts like this. People need to understand: \n\n1. Currently it's holiday season recruiting has mostly wrapped \n2. Even when we go into 2023 there's a strong chance the job market will still be relatively slow, hiring freezes will take place and people will be laid off. I work in IT and have several years of experience and I'm struggling to get interviews setup. This is not an outlier, it's currently the norm and will be for a while. \n3. Finally let's say you do land a position you have a high chance of being laid off. Maybe not as applicable to fresh grads but definitely applicable to people trying to switch jobs.\n\nYou can keep applying but focus on taking this time to up skill yourself and build your network. Once you see that more jobs are getting added in the tech sector and hiring freezes have stopped, then you can give your full focus to job hunting.",
            "If you need work sooner rather than later, don't forget about the small-mid sized companies that would be thrilled to have you.",
            "enter rainstorm concerned scarce shaggy touch weather paint cagey smell\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "The best advice I can give isn't a magic bullet and probably not what you want to hear but I think this may be a critical moment you're all facing. I'm dating myself but I recall graduating from CS in to the aftermath of the 2000 tech bust. It wasn't a fun time to say the least. Your feeling hopeless gives me chills to remember those days and I'm seeing a lot of similarity to now. A few years prior had been glory days and as wide-eyed students we heard tales from those who got out before heading to silicon valley, big money, parties with open bar, ice sculptures, etc. By 2002 hanging on to those expectations had become delusional and dangerous. Those mates were all coming home and taking the few entry level jobs that were supposed to be ours.\r  \n\r  \nIt was very hard. Several classmates never got into the industry as a result. Others are still underemployed having done nothing but short & lame contracts ever since. Tech has more upside than I can list but this isn't the time anyway. Know the BIG downsides: it's cyclical with busts that are NASTY and losing career momentum in our industry can be devastating.\r  \n\r  \nkeep applying and interviewing\r  \n\r  \nkeep developing: writing code, github, certs, anything you can do/afford at whatever pace you can manage\r  \n\r  \nBe willing to relocate. They guys I know who got it the worst; never broke in, all also suffered from this one. Refusing to leave a shit small town and go to the city where there were some scraps to pick up. I don't mean in the sense of relocating for a specific offer which you don't have. I mean do it proactively NOW. Go to a big city, get a basement with 5 room mates, a job serving tables and pound pavement.\r  \n\r  \nnetwork. keep in touch with your classmates. know where people are going and what they're doing. this was how i got a job as an underpaid web developer\r  \n\r  \nlower your standards: take and hang-on to ANY gig remotely relevant to computing no matter how crappy the pay is. You can always keep looking and it's way easier to get a job when you already have one. You can advance quickly in tech and as the sun rises it'll come roaring back.. but you need to stay alive until then! You must keep a foothold or you'll end up like my old buddies. In this industry once you're out for even a couple years, you're basically starting over. That's when 99.9% just give up--I probably would too! My point is those in this situation actually gave up much earlier when they didn't do the things above.\r  \n\r  \nNot to scare you but you should understand the gravity of the situation if these layoffs continue for a while.. nevermind accelerate which they seem to have done just in the past few weeks (layoffs.fyi) Noobs will bear the most pain--it's just the way she goes. You need to persevere and keep your career intact. Remember the tech wreck wasn't a crash it was a punishing bear market that ground us down for several YEARS. This could easily only be the beginning. Again, lots of similarities then and now. I've got 20 years and I'm concerned. The good days are clearly over and it's time to get serious and hunker down. Been there before and there will be casualties!! Good luck!",
            "I graduated a coding bootcamp in Jan and landed my first SWE role probably a month before the layoffs started happening. It was for a small startup that was self funded and doing well per our CEO, who bragged about how good of a spot we were in and not to worry. Figured I was safe and was counting my blessings. Then i got laid off last month along with basically our whole engineering team, and with only 6 months of xp, I’m pretty fucked. I feel your pain, we’re doomed for a bit but it only takes one 🫡",
            "There's a pattern of tech layoffs that's been occurring about every ten years (or less) since the early 90s, when there were enough tech workers that the layoffs became more apparent to everyone. As the decades rolled by and technology advanced more quickly, more and more tech jobs were added to the economy. However, since these are still specialized jobs that require skills not everyone has (or enough people have!), salaries rise over time, and companies lay off workers in the hopes that they can later hire desperate people back at lower salaries. And, it has always worked. \n\nSo, new grads, be warned: in about a year or so, there will suddenly be a lot of tech jobs back on the hiring boards. However, they will pay significantly less than what they have over the last few years. Companies will lowball you and overwork you because they expect you to be desperate. If enough of use refuse to take this kind of crap, they won't be able to keep doing it.",
            "I need to land a job after graduation because I'm on student visa so I feel extra fucked, I don't know what to do",
            "This makes me so scared. I just started my master’s and can’t seem to get many callbacks for internships. Got two but didn’t go well and I don’t have any hopes either. I wonder what will happen to me if I graduate without an internship",
            "I just quit my job as an ME to switch to software and have an offer after 2 weeks. It’s in defense though but seems like an interesting team. They wanted MATLAB experience which is probably what helped me.",
            "Similar experience here. Had 5 internships(18 month total), and the most recent one is Google. Dunno if I’ll get return as I just finished Google. But man, the market is really bad rn.",
            "By less jobs than ever, u mean as many jobs there were ~1.5 years ago",
            "I got an internship for this summer at a decent company for summer 23 as a sophmore using ripplematch.  \nhttps://ripplematch.com/index?r=8kD4fh  \nu can try that link but it was pretty easy to apply for jobs.",
            "i’ve had 5 previous internships and am graduating this year, this has been the hardest season for me to find a job",
            "same boat as me 2 swe internships 0 swe interviews"
        ]
    },
    {
        "post_id": "tbd9f0",
        "author": "rainSbowMa",
        "title": "“That’s your Asian answer?”",
        "url": "https://www.reddit.com/r/csMajors/comments/tbd9f0/thats_your_asian_answer/",
        "score": 414,
        "num_comments": 93,
        "created_utc": 1646958042.0,
        "selftext": "Im currently interning at a startup remotely for a while now, and my manager asked me what my career goals were and why I was motivated to work here. My answer—It’s a bit shortened. \n\n“After I graduate college, I’d like to work as a Associate PM at a large tech company in order to help create the vision of a product that meets both business requirements and technical feasibility. After 4-5 years of working, I’d like to attend business school to be a better PM. After graduate continue as a PM. Few years later, I’d like to join a startup and become CEO.”\n\n“That’s your Asian answer?” *snorts \n\nKinda not sure how to thinking about this… thoughts?\n\nUS, Asian female, and this manager is Indian but really Americanized (with an Asian wife I might add)\n\nEdit: yes, I understand that Indians are Asian, but my manager has never referred to himself as Asian. He states that “I’m Indian and my wife is Asian”. That is why I referred to him as specifically Indian and not asian.",
        "permalink": "/r/csMajors/comments/tbd9f0/thats_your_asian_answer/",
        "comments": [
            "What does that even mean?",
            "On the internet, It's quite normal, Asians are seen as people with high academic goals, hard-working etc... Maybe he was trying to make a light joke since he is an Asian too? I understand the tone of the sentence is not in a funny way.",
            "You should've have called them out wtf",
            "\"Do you want to hear my Indian answer?\"",
            "Indians are Asian... assuming good intentions, or was probably a joke that fell flat (racially insensitive, but probably an attempt at humor). Bad intentions... he meant to be racially insensitive. Best bet would probably be calling it out next time if you want to, or changing the topic.",
            "If you don’t feel comfortable about the joke, tell them, if you think it’s funny, you can laugh. Don’t let other people tell you how you should feel",
            "Indian is asian too. It was definitely weird regardless, so you should’ve said something if it made you feel weird",
            "he was making a joke, if you don't find it funny you can let him know but its up to you",
            "Was your manager also asian? (It's racist either way, I'm just curious)",
            "Just sounds like he was joking lol.\nI wouldn't think too badly of it, seems like no ill intentions. But if you are not comfortable with it, let it be known to him.",
            "indians are asian.",
            "Honestly it's probably a stupid joke in today's social climate, but honestly I felt that he meant it in a \"good\" way, like a positive stereotype that Asians are very smart people and usually are successful so your answer was an \"Asian answer\". If you were uncomfortable with it though, you should let it be known if that's what you really want to do imo",
            "India is in Asia..",
            "I don’t think there were any malicious intentions here. Firstly, if you are insinuating racism, it’s not in my opinion. As the general stereotype of Asians, Indian students are also brought about strictly and have ambitious goals set from the beginning. I think that’s what he was referring to. The general “Asian” stereotype (which includes Indians). \n\nHe possibly just thought that you have your life path figured out and goals set clearly. He might have also thought that it’s too ambitious, hence the use of the “Asian answer” stereotype, referring to how we have always been told to pursue bigger thing, have goals and work hard.",
            "I’m Asian. My my mother was a classic tiger mom. \n\nThere were expectations, much of it resulting from culture. \n\nIn East Asia, greatly influenced by Confucian ideals. In China, class mobility was open for people capable of passing the Imperial Exams, much honor for the family. I remembered the primers schoolchildren learned Chinese characters from with stories about exactly that, how a young, promising lad would study hard. His parents sacrificed much so that he could have tutoring and focused on studying. And when he finally passed, his whole family were another social class alltogether. \n\nI don’t know if India had something similar, but people there all want to pass the entrance exams to ITT so they can get prestigious jobs. \n\nBut you are working for a startup. It’s risky. Some have the potential to make it big, and some do not. Some, for better or worse, make huge social impact. \n\nEvery single one of those big tech companies started as a scrappy startup. \n\nYour manager is not being discriminatory. He asking you in a way to see if you can see from beyond conditioned expectations. He’s asking, if that is something _you_ really want, or it is something your culture and heritage wants you to do. There is also the implied question, do you see the startup as a stepping stone to a stable big tech career, or do you have an appetite for risk? What about being a founder? Don_you_ have a vision? And it’s fine if you don’t! Just make sure you examine your motivations and reasoning for your career.",
            "It's a joke, not funny, but still ain't that personal. Your message is leaving out social queues that that were probably missed. I'm sure he wanted you to loosen up instead of giving a textbook answer.",
            "imo it's just a joke, but if you don't like those kind of jokes make sure to show him (not in a direct way) that you're not laughing at it",
            "Ok I feel like this is something you can make a case out of. Either with HR or with his higher up. I’d imagine no company wants to deal with “racist manager” in the press",
            "Report it. This does not seem like a reasonable person if they automatically resort to racist micro aggressions. It’s one thing to accidentally say something - in that case, just mention that you didn’t like what he said/explain to him why that’s a micro aggression. But *snorts got me. Report to HR without hesitation",
            "Wow what a dick",
            "send an email to their hr about this. Just say that you have experienced unprofessional racial comments from this interviewer if you want to persue.",
            "That’s quite racist, but just another example of internal soft racism in workplaces. Black, Hispanic employees experience this as well. Just because he is Asian himself doesn’t mean it’s any less racist…",
            "So Asian means driven, career-oriented, and ambitious, yiss, lets gooo!\n\n- fellow Asian",
            "Very weird",
            "Most likely a joke because of the Asian stereotype. He knows that Indians are Asians all south Asians do but in the US when they say Asian they normally refer to east Asian",
            "Quite racist on the managers behalf. I eould like to point out that you should try to avoid telling everyone your goals and expecially in such length to begin with. Keep your answer short and simple and one that plays in favour with management.",
            "People are saying racist, but infact he is just mad,\n\nSome asian woman slapped his career  earlier causing him to be so mad that even after getting married to an asian woman he is still so mad and he is bullying an intern.\n\nDon't even do anything, your existence is doing enough damage to him.",
            "Racist. In the west, indians are viewed as Asian, but not within India or Asia more widely. It's like how Americans consider British people European, though few in great Britain or on the continent would feel the same.",
            "He felt entitled to make this joke because his wife is asian and his wife would probably laugh at it. I don't think it had any malicious intent",
            "Racist",
            "[deleted]",
            "Indians are Asian. If he references his wife as “Asian” it’s not because he doesn’t consider himself Asian, but because America has a very warped view of Asian races and equate “Asian” to “East Asian”. \n\nWhat that means is when he asks “Is that your Asian answer?”, it comes from a place of internal community. In his mind he doesn’t see a distinction, so he feels it’s appropriate. I agree that it’s a little inappropriate, but I’d say the friction of addressing it is not worth what is probably just a misunderstanding. I feel he was just making a comment on how Asians (like himself) have high expectations for themselves given the values held by our communities. \n\nIf a white person said that you’d have an argument. I’d say going forward if he does it again def make a comment, but it really isn’t worth addressing it right now. You risk alienating someone who would otherwise be an advocate for you in the workplace.",
            "[deleted]",
            "It was clearly a joke that he thought you both could laugh about considering the stereotypes regarding your shared cultural backgrounds (asian).\n\nHe probably hears the exact same response from every intern he’s had and hell he probably had the same answer back when he was in an intern. The joke that so clearly went over your head was that your response was so stereotypically basic and he wants you to feel comfortable enough to give your genuine response.",
            "[deleted]",
            "Told yall",
            "is he close to you? how was the tone like when he said it?",
            "My people letting us down on all fronts. First Shake, now this guy. Sorry OP 😭",
            "The thing is that I think op is Eastern Asian and we usually don't see southern Asian the same as us. Asian is actually not a race it's just a geographic idea.",
            "That was a little aggressive of him. That being said I can see where he's coming from (not race related). We all have lives, we have goals and destinations. Our jobs in many cases are just a means to an end (although a purposeful job is good for life). \n\nI guess what I'm trying to say is that passage you posted is likely not something you would say in a normal conversation. It's artificial, carefully crafted to appeal (lick up) to a corporation. \n\nWhen I applied for my current job, I talked about making products that impact and change millions of users' lives, and that I was very cosmopolitan and wanted to work abroad. What they don't know is that I want to work my way to a green card, marry someone, live financially free off of my stock portfolio, possibly enlist in the military, and then work only because I want to. If I said those things in my interview I certainly wouldn't have gotten the job.",
            "I feel like that is a slightly passive aggressive way of saying that your goals might be set lower than the stereotypical “Asian parents expect perfection and insanely high goals”. That or it could be that he is projecting what his wife’s reaction might be.\n\nEither way, completely inappropriate and I would talk to him about it and that if made you uncomfortable and that it could come across as racist to many people. I would avoid flat out saying that you felt it was racist as that could open you to other negative things.",
            "What the fuck is that even, lmao. What a phallus...",
            "Hard to complain when you are an intern and he is a manager. But I’d say that’s racist. What they call a “microaggression” - not bad enough to risk an HR complaint, but definitely the sort of thing that makes it unpleasant to work at a place.",
            "That's just racist",
            "lmao that was a terrible joke ngl.",
            "Why are y’all all so butt hurt? It’s a joke. Lighten up."
        ]
    },
    {
        "post_id": "l26doc",
        "author": "bitter__almonds",
        "title": "My Amazon interviewer just live-time ghosted me during the final round interview",
        "url": "https://www.reddit.com/r/csMajors/comments/l26doc/my_amazon_interviewer_just_livetime_ghosted_me/",
        "score": 413,
        "num_comments": 54,
        "created_utc": 1611259211.0,
        "selftext": "After completing the first 3 parts of the SDE Amazon Internship interviews, I was offered a final round interview. After scheduling a time and receiving confirmation, I then joined my Chime conference, 5 minutes before it was set to begin. Here I am, 50 minutes later, having remained on the call waiting for my interviewer to join and having messaged the interviewer through Chime. I have received no response from this person. I've been ghosted by companies plenty, but this is a little absurd.\n\nNote: I sent an email to Amazon, (I was told to message this particular email address if I had technical problems with the video conference), asking to reschedule my interview after 30 minutes with no interviewer present, and attached screenshots indicating my interviewer's absence.\n\nDo you think I still have a shot at this position? Odds seem slim.",
        "permalink": "/r/csMajors/comments/l26doc/my_amazon_interviewer_just_livetime_ghosted_me/",
        "comments": [
            "[deleted]",
            "You didn't get \"ghosted\", someone forgot to attend a meeting on their schedule. These people have plenty of things going on in a day, one of them is interviewing you. Its the opposite for you, this is probably your whole day, what you care most about. So obviously your going to stress, and yes its unprofessional of them to mess this up (if it was simpy someone forgetting about an event on their calendar), but mistakes happen.",
            "That's not ghosting.",
            "Same thing happened to me. Interview ghosted me for the final round. Recruiter then rescheduled. Interviewer AGAIN ghosted me. Recruiter rescheduled. On the third attempt, my interviewer finally showed up and I was able to complete the interview. I recieved an offer 3 days later.",
            "They tell you to email them if you’re interviewer is more than 10 min late.\n\nHappened to me and I got rescheduled. Everything worked out fine",
            "I had an Amazon interviewer just not show up to a scheduled web-call. Fun times.",
            "This happened to me last year with Amazon too and we just rescheduled. Don’t worry, your interviewer just made a human accident.",
            "Chill the heck out, jesus. Your interviewer forgot to show up and that's it; it's not your fault and nor is it the end of the world. Just get them to reschedule.",
            "[deleted]",
            "lol, you made it sound like he joined the meeting and then ghosted you. \n\nits ok, you'll be fine lmao.",
            "This happened to me with D.E Shaw twice. \n\nThey ghosted me once right after Christmas. I was okay with this one because hey it's Christmas.\n\nThey rescheduled me to the second week of January when they ghosted me again. I called the recruiter and told them this was extremely unprofessional. One of the engineers called me up and apologized and asked if they reschedule it which I refused.",
            "my interviewer was late and ended my interview early :/ not impressed with Amazon's interviews this time round",
            "I got ghosted for a virtual interview with another company. I emailed the recruiter and they told me that it was technical difficulties and they would look into it. I then proceeded to get ghosted by the recruiter too..I even reached out again a week or so later asking for any updates but I got no reply. I hope you have a better experience considering Amazon is considerably larger than Macy’s",
            "Lol same thing happened to me and got rescheduled for the next week, don't worry they'll reschedule.",
            "Take this as a learning experience. If this was you ghosting them you wont be getting another interview. But since its them, they will apologize and ask to reschedule. Apology or not, this looks bad on them and goes to show how they may treat you on the job. I could be wrong but not a good sign. This shows how in the end it is just a job. So while they may ask to reschedule, if you choose to quit abruptly with no two weeks notice, it is not unprofessional of you. If you were getting fired or ghosted they dont give you a notice or an apology. \n\nIf you like Amazon then move forward and hopefully you get the job, but be aware of this. Cheers.",
            "Happened to me at my google interview, interviewer had technical issues, got rescheduled and now I’m chilling with my offer",
            "When did you finish all 3 OAs?",
            "I faced a similar situation with another company. Turns out the interviewer was held up with something important and the interview just slipped out of his mind.\n\n&#x200B;\n\nI dropped an email to the recruiter as well, n they had another interview with the same person scheduled 3 days later.",
            "I'm pretty sure they'll reschedule it for you. Someone probably got busy and/or forgot. Good luck!",
            "You'll be fine. This exact same thing happened to me where my interviewer did not show up so I had to reschedule. I ended up getting the offer. This is just a logistical hiccup on their end.",
            "Well I had exact same experience with TikTok for SWE position. The interviewer did not join for the final round and later recruiter sent me a reject. Highly unprofessional.",
            "Same thing happened to me a bit. I was supposed to have a phone interview with a Verizon guy. Showed up 35 minutes late and didn’t even seem to care.",
            "They'll reschedule it's not problem, same thing happened with one of my friends before.",
            "Yes you will get a reschedule!",
            "I had a similar situation last year, they sent me two different links by accident and I attended the other one than my interviewer did. Turned out fine, got an offer.",
            "Well, the same thing happened to me last year. Joined the interview, interviewer didn't hop on -> contacted the recruiter who apologized, promised to reschedule. A couple of hours go by, she reached back, said that they had found a candidate for this position, didn't apologize this time lol.\n\nNever applying there again",
            "My amazon interviewer also didn't show up and I emailed them but I have not received a reply yet. How long did it take them to reschedule you?",
            "The same thing just happened to me this morning! Absolutely absurd, and disrespectful. I emailed the recruiter, and I am ab to email the email given as well too"
        ]
    }
]