[
    {
        "post_id": "115r29g",
        "author": "Ecstatic_Ad_3400",
        "title": "Internship Rescinded: Feels like shit",
        "url": "https://www.reddit.com/r/csMajors/comments/115r29g/internship_rescinded_feels_like_shit/",
        "score": 410,
        "num_comments": 61,
        "created_utc": 1676753976.0,
        "selftext": "Hey all,\n\nBasically, I am looking for some support from y'all. My internship at N\\*\\*dst\\*om was rescinded. It hurt me real bad that I am not doing really well. I mean since I had an internship, I had stopped doing leetcode, and I was focusing on improving my other skills and this came as a bad surprise. The Job market isn't the same that it used to be. In the fall semester, I used to get OAs like anything, but now, I am not getting anything. Is it a regular thing that this happens in the spring? Or is there hope left for me? I know that I should keep applying, but I am not sure if there is the usual thing in the spring semester. What are some of the tips that some experienced csMajors folks would recommend me to do, so that I can get more callbacks? For now, I am applying to companies blindly, how should I change my strategy?\n\nEdit: Thanks a lot for your support, folks. Lots of love!\n\n&#x200B;\n\nThanks, and have a nice day!",
        "permalink": "/r/csMajors/comments/115r29g/internship_rescinded_feels_like_shit/",
        "comments": [
            "Was is out of the blue or for any specific reason?",
            "Nordstrom is a shit company. They rescinded all internship offers for 2020 summer too. The worst part is they then cancelled the rescission later and then rescinded again",
            "Post on linkedin, use your network",
            "Sorry to hear that! I only got one offer, and the job doesn't start until May, so I am a little concerned myself. But I hope you bounce back and get more offers. Some places are experiencing layoffs and budget/job cuts, but not all of them. Especially mid to smaller size companies. Best of luck",
            "I am sorry for what happened to you. Please apply to all internships that you can find. Don't worry about getting into FAANG/HFT now - just apply everywhere.\n\nHiring is usually reduced during the spring, but this does not mean you can't get an offer. For example, I got an offer from AT&T last year after applying in January, so it's possible.\n\nIn addition to sending in applications, please take some time to get support from friends and family. They will make this process so much easier. Best wishes!",
            "Happened to me right when Covid hit in 2020. Crushed me but made me hungrier. \n\nEnded up working full time at the company that rescinded the internship a year later. Keep in touch with your company contact and keep grinding",
            "Hey there,\n\nNot sure if sports is your thing, but I (and most others) typically start hiring for summer / full-season interns at this time of year.\n\nTeamworkonline is the primary hub for our industry. Can’t say the pay is the same (interns tend to make the same regardless of position) but it can certainly be a lot more fun that many other industries and you’ll still learn a lot.",
            "Who emailed you? I was going to start at Nordstrom and my friend sent me this.",
            "Haven’t even gotten an internship yet and I’m a senior. Hopefully I get one. This job market is the worst it has been for interns",
            "**NORDSTROM.** Lol I said the name someone please arrest me  because I'm a naughty naughty boy haha! /s",
            "If there are any hackathons at your school or elsewhere hosted by actual companies, that can be a great in with recruiters. I was able to secure my internship last summer from my school’s hackathon",
            "That sucks bro. Don't take this personally. Its not you its the economy and you know it. Keep trying. Thats the best you can do. Good luck!",
            "I'm sorry to hear that bro. I got offers from 2 big defense companies, and it's for this very reason that I haven't reneged one of my offers yet... If you got an offer there, you're plenty capable of getting an offer somewhere else.",
            "There should be a CS Students LinkedIn Group. And when ppl like OP lose internship, we mass like it and spread it. We gotta support one another, this sub has some of the craziest grinders, would be an insane group lmao",
            "It is quite normal to see the market have less demand for interns in the Spring. Best time to apply is late Summer through Fall.\n\nEdit: Sorry. I’m not trying to discourage anyone. This is from my personal experience.",
            "Recession looming companies are cutting costs. You probably were an easy cut. Nothing personal most likely and if you got accepted for an internship you are probably doing well knowledge wise. My advice to you is to keep applying and dont let this affect how you view yourself as a developer. This wasn’t your fault, it’s the fault of our corporate system. Best thing to do in-between applying would be to just continue practicing, work yourself back into some leetcode.(maybe). Focus on your school work if you are still attending and let it go.",
            "Last year I got two offers in spring semester and I applied in February. I applied in February and got accepted in April and it was a super good experience. Stay positive!",
            "I work for a big corporate type, and participate in intern interviewing on occasion. A lot of them (like us) start their intern interviewing in the fall. You’ll occasionally see spots open in the spring when companies offer to someone who ended up with multiple offers and chose somewhere else, but most are in the final stages of hiring during the spring, making ready for May/early June start dates. \n\nMy best advice is to find a more local or regional company. The ones where I’m at are just starting the process for this summer. While you may luck into an open spot with a larger company, I wouldn’t hold my breath.",
            "I would definitely keep applying, and make sure your resume is update to date! For many it seems that receiving internship offers is really just a numbers game anymore. I’m sorry to hear they rescinded, that was dirty. I feel as if peak application and offer season is coming to an end, but there’s still options! Feel free to message me if you have any resume or application questions, as I’m in recruitment and talent acquisition.",
            "I'm sorry OP. They just rescinded my internship too, I was devastated when I got the news. It sucks that they wasted our time like that. I don't know about you, but I got an LC hard on my interview and I was so proud that I was able to succeed and get the offer. I was so happy to take time off LC and focus on school, but now I regret not doing interview prep over the last three months. \n\nDefinitely reach out to your school network if you have one. My classmates have been supportive and it helps to talk about it with people who understand the amount of work we have to put in to get these offers. They may also have opportunities to share. Take care of yourself and good luck!",
            "This happened to me as well. The project was shutdown and my recruiter called me yesterday saying they do not need me anymore. I even turned down another offer for it and now I end up with nothing. Feeling crushed now..",
            "You just have to get overcome it. Life will ALWAYS throw curve balls at you like this. How you handle them is what defines you.",
            "Best advice is to keep in touch with your recruiter / contacts at the company so you can maintain a good relationship and keep the door open for any opportunities in the future. \n\nNordstrom really is a great company to work for, but unfortunately with where the economy is right now they’ve decided to cut internship and unnecessary spending to hopefully save full-time employees from further layoffs. \n\nI know that the decision sucks nonetheless, but it more than likely is not a reflection of your talent or qualifications.",
            "[removed]",
            "Instead of blindly applying, modify resume according to job description",
            "I am nervous since we have to wait until April and I have 0 momentum to keep applying on top of the +300 applications I did last year",
            "Guess what they rescinded my offer today as well. I got the offer letter, filled it and after 5 days, in Workday it says, your Application is no longer under consideration."
        ]
    },
    {
        "post_id": "xhvj9g",
        "author": "stripe_throwaway2912",
        "title": "Why are we not talking about Stripe rescinding return offers?",
        "url": "https://www.reddit.com/r/csMajors/comments/xhvj9g/why_are_we_not_talking_about_stripe_rescinding/",
        "score": 411,
        "num_comments": 39,
        "created_utc": 1663543881.0,
        "selftext": "I was a Stripe winter intern who initially received an offer, which was later rescinded in July. Last week all interns received a follow-up from their recruiters and many winter interns who originally had offers were told that they were now on a new grad \"waitlist\" (essentially rescinded). I heard that overall, less than half of the intern class (including summer interns) received a full-time offer.\n\nFor context, we were told whether we got return offers at the end of our internships in April. This came in the form of a letter of intent, which we could activate any time before October, and the moment we activate it, we had 2 weeks to decide whether to accept the offer letter. Most of us had summer internships lined up, so we waited to open the letter until after our summer internships to decide. In July, I was reached out to by my recruiter telling me that my offer letter would not be valid (rescinded) and they would be doing \"recalibration\" to see which winter interns would get a new offer with new offer terms (including adjusted compensation). We were also told that we would be recalibrated against the summer interns, inherently giving them an advantage, as they knew new grad headcount was lowered and could spend more time working on their project to receive a higher intern rating. Other recruiters didn’t even tell their interns that rescinding was a possibility, they were just told that offers could not be opened until the fall. It was only confirmed last week that many interns would be on the new grad waitlist.\n\nThe recruiters were also very untransparent throughout this whole process, not giving any (or conflicting) information regarding the return offers, even when multiple interns had other offers and was waiting to hear back on Stripe. When Facebook, Coinbase rescinded their new grad offers, they got a lot of flak for it, however I have not seen any posts talking about Stripe rescinding their offers. As unfortunate as Facebook barely giving out new grad intern return offers is, they were at least up front about it earlier this summer --- allowing interns time to re-recruit. It feels like we were blindsided by Stripe. Many interns I knew personally were not planning on re-recruiting as their recruiters made it seem like we would only get our offers \"adjusted\" (lower comp) rather than rescinded. Part of that was our fault for being naïve for trusting them, and I understand that it’s a tough situation for everyone in tech right now, but the whole process just felt very untransparent.\n\nTLDR: Stripe just rescinded many of their winter intern offers and gave very few summer interns offers.",
        "permalink": "/r/csMajors/comments/xhvj9g/why_are_we_not_talking_about_stripe_rescinding/",
        "comments": [
            "I feel like this is a size issue overall. (absolutely **doesnt** excuse what stripe did)\n\nMeta + Coinbase were known for their hiring sprees the past year and then when the offers and/or layoff issues came out there were just more people available to talk about hence more posts about it.",
            "Hi, I interned in FB in Winter and Stripe in Summer, and I totally understand how you feel.\n\nWinter FB interns were told at the end of our internship that we had offers, but they needed 2 weeks to finalize the official compensation numbers.\n\n\n2 weeks later, we were told that they would give us an update at the end of summer.\n\nFrom that point (early May?) to now, I didn’t hear back at all, and I know only 1 person who got their offer honoured.\n\nI think for all companies that had financial issues, Winter interns this year just got screwed more than Summer interns.\n\nImo the way Stripe handled summer return offers was far more transparent than how Meta handled winter return offers. My FB recruiter never officially told me anything about the GE only return situation.",
            "I feel for you, and I’m really surprised why this hasn’t blown up on blind and LinkedIn.\n\nAlso, Facebook didn’t rescind any new grad offers.",
            "The recruiter last year (for a Summer 2022 internship) told me they have a “95% return offer rate”.  So looks like that was 🧢",
            "and here I was waiting for Stripe NG apps to open",
            "On a separate note, do you have an estimate of what the Stripe return offer rate was? For summer/winter or overall",
            "Name and shame on LinkedIn.",
            "That’s why I decided to work for the government, pay is good, great benefits and most importantly job security.  Other companies would fuck your over the moment they get a chance.",
            "what is there to talk about               \n\nthings change               \n\nthe economy is crap right now",
            "skill issue tbh"
        ]
    },
    {
        "post_id": "mwjwbq",
        "author": "IccyCold",
        "title": "I ACTUALLY PASSED PHYSICS 2",
        "url": "https://www.reddit.com/r/csMajors/comments/mwjwbq/i_actually_passed_physics_2/",
        "score": 414,
        "num_comments": 41,
        "created_utc": 1619140790.0,
        "selftext": "I'm so happy & idk who to tell. This class has been an absolute plague on me, and by the grace of the curve gods, I somehow passed.\n\nI might actually get to be a Software Engineer.",
        "permalink": "/r/csMajors/comments/mwjwbq/i_actually_passed_physics_2/",
        "comments": [
            "Congrats! Physics 1 & 2 absolutely wrecked me. I remember thinking those were the hardest courses I took in undergrad.",
            "Hopefully you'll keep up-to-date with your physics 2 content. There hasn't been a day in my software engineering career that I haven't used a concept from that class.",
            "Congrats! \n\nNow u need to do something nice to treat yourself, it’s a rule :)",
            "Looking at this post, I'm kind of relieved I'm not the only CS major who struggles so much with this class. I dropped it the first time but I'm gonna get back into it once I finish calc 3.",
            "Congrats, I took PHYS 2 last summer online and it was super easy. If I was to take that class on a regular semester I would have struggled a lot. Now I am taking theory of computation class and this class is a pain in the a\\*\\*.",
            "Congrats! Make sure to treat yourself and yell \"Eureka\".",
            "Cheers dude! Physics 1 & 2 for engineers was absolutely brutal.",
            "Good work!",
            "I’m taking Physics 2 in the fall, I’m already getting chills about this class.",
            "Why did you have to take physics?",
            "physics 3 pls help gaussian law",
            "EPIC WIN NICE JOB!!!!",
            "Hell yes. Almost had to change my major because of how badly I was struggling in those physics classes. Give yourself a pat on the back",
            "i relate to this in a spiritual level. congrats and don’t lol back, the world is yours now my friend",
            "Bless, I was in a very similar boat when I took it.  Going into the final I had a low C-, and I got the lowest possible grade on the exam to still pass the course that I could get.  Happiest 55% of my life.",
            "Currently taking it right now and it is really a pain. Can’t wait to be done with this class in three weeks.",
            "Failed physics 2 in my undergrads :/ still completed the degree",
            "The college I went to luckily didn’t require physics and I’m so happy about it. It just required a natural science with a lab do I went with a chemistry course.",
            "Congratulations!",
            "Congratulations bro! Thanks for posting this! it is great inspiration for me to study today. I'm taking  physics 2 and barely passing with a C",
            "Im so happy for you!! I have yet to take mine this upcoming fall 😭",
            "You guys have to take physics for your CS programs? I'm glad I don't 😌",
            "Baffles me to this day while physics is required"
        ]
    },
    {
        "post_id": "kmc1c1",
        "author": "None",
        "title": "all the posts complaining about diversity are so sus",
        "url": "https://www.reddit.com/r/csMajors/comments/kmc1c1/all_the_posts_complaining_about_diversity_are_so/",
        "score": 412,
        "num_comments": 126,
        "created_utc": 1609238292.0,
        "selftext": "like that facebook one was so weird. who looks at linkedin intern humble brags and goes \"wait a minute... there's a bit too many minorities for my liking.\" like bruh. it's never the idea that urm are being exposed to tech earlier/coming across opportunities through the like million different outreach programs that they would otherwise not applied to and/or know existed, it's always just \"they're all diversity hires\". good god there are a myriad of explanations but ig the one that requires the least mental acuity is the diversity hire rhetoric lmfao",
        "permalink": "/r/csMajors/comments/kmc1c1/all_the_posts_complaining_about_diversity_are_so/",
        "comments": [
            "This is the same sub that posts “anyone else have no friends?” And “how can I get a girlfriend?”\n\nTbh those weird posts are sadly expected",
            "As a female who prepped really hard for interviews last year (400+ LC and going through CTCI), worked hard to have a 3.9 GPA from a top engineering school, and have a bunch of personal projects, it's so disheartening to read about people complaining that I get offers on account of my gender. I love CS and I'm good at it, but it makes me feel as though the people around me are always questioning my skills just because I'm a woman. If I didn't tell people my stats, some of them would automatically assume that I'm just a diversity hire. From experience, it sucks having to go into a job/project needing to prove that I am actually qualified before I can be treated with the respect that I see ORMs get right out the gate.\n\nAlso anecdotal, but I got an LC hard on my Amazon interview (didn't pass, unfort), and FB would have never hit me up last year if I didn't email my recruiter again. And this year I only got \\~8 OA from 150+ applications even with FB on my resume.",
            "Those posts make me so miserable. I’m a black woman at a Big N and it’s just a painful reminder that a lot of people in this industry don’t think I rightfully earned my spot. Ouch.",
            "Facebook is 1.7% black and 4.3% Hispanic and 24.1% women for technical roles \n\nThose people earned their spots. It’s pretty nasty that some people think minorities somehow didn’t earn their spot. \n\nIf you didn’t get the job, there’s either better candidates or you didn’t meet the standard. Period.",
            "Imagine feeling attacked by a diverse workforce LOL  \n\nThe more diverse a company gets, the more unique experiences they bring to the table, which can result in better designed products and a more welcoming workplace. Those things benefit everyone, from the users to the employees themselves. \n\nWe should be striving to seek out more of those people with a unique background and experiences & making sure that company products and workplaces are more welcoming for everyone, not just white cis men (and Indian men, who I find complain about this a lot).  \n\nAnd for people who keep saying that maybe they hired solely for diversity, the hiring processes at most of these companies will do their jobs of cutting anyone who isn't at their hiring bar, and at the end of it, anyone who got an offer was given it for having most or all of the company's requirements to start with. Even minorities get cut for not being able to pass technical interviews, and a lot of them do.  \n\nI find a lot of people who preach about how \"diversity hires are undeserving\" couldn't even get through those interviews in the first place, so many of them don't even have room to talk imo...maybe take some pointers from people who did pass the interviews without caring about if they're a minority or not.",
            "I feel like most of those are cop outs. Like I know some terrible programmers that I graduated with who are cis white straight  men with no prior experience and got jobs. Getting the job you want is hard for sure. A lot of grinding has to go in to getting jobs. But the fact of the matter is there are jobs out there for our degree. Like a lot of them. I put in a lot of applications to get the job I have, but I got one and I'm proud. And I got it because of my experience, my personal skills, and my tech skills. \n\n The real conversation needs to be how hard it is for diverse candidates to fit in after they get to the job. Diverse hiring is important. I'm the only woman and only visibly queer person in my team and it shows. Right now we're contracting out with Microsoft and every time the Microsoft people address my team they start with \"good day gentlemen\". I know it's not a big deal and it's something easy for me to brush off, but diverse employees deal with little things like this 24/7 and don't often have anyone in the office to relate to them.",
            "Take my upvote man, I hate those kind of posts too. From my experience, this community is mature when it comes to these kinds of posts. Other places, linked in and even codeforces, these complains about diversity hires get like thousands of upvotes, anybody who protests is downvoted out of existance.",
            "The sad reality is there’s a lot of CS/engineer majors, and honestly just a decent chunk of white people that are casually racist and/or sexist.\n\nI argued with an old “friend” about why diversity hires and diversity scholarships even exist. He couldn’t wrap his head around it and he said that “life is just 10x easier as a minority”.\n\nTake a wild guess what background he has.",
            "[deleted]",
            "As a black British guy at uni, posts like that make me a lil bit weary to go to a work environment. I so hard for my grades and the idea of people seeing me and thinking “must be a diversity hire” makes me angry.\n\nTech is unwelcoming as fuck",
            "For real. The first thing I thought when I saw that post was “oh no, god forbid more WOMEN get selected than men”. I’m a woman in CS and it’s very sad to see that when something like this happens, it’s chalked up to “diversity hiring” or some phenomenon that should not ever occur.",
            "Some companies do have diversity hiring, and they don't hide that. Twitter has the internships programs exclusively for Female, African-American, Hispanics and American Indians only. When I, an Asian, applied to one of them by accident, a recruiter contacted me in 2-3 days. Once I told her that I picked wrong, I got ghosted. Harvard had a case when they got caught discriminating against Asians, to prevent more Asians from taking the admission spots. They call it affirmative action.\n\n&#x200B;\n\nDoes it mean that every diversity hire is based solely on gender & race? No.\n\n&#x200B;\n\nDoes it mean that these minority groups have more chances of getting an internship at a top company? Yes.\n\nEdit: I also applied to a regular internship program at Twitter at the same time. I didn’t even get contacted.",
            "Some people-\"It is so disheartening to see people think that I got the spot because of my gender/race\"\nAlso Same people-\"We should support affirmative action to place minorities in these roles because we need diversity\"\nOf course some people are gonna think that gender/race played a role when you advocate for affirmative action. Cut the bullshit. If you dont want people to think that your race/gender played a role, then dont fucking support affirmative action.",
            "They're a bunch of losers who need to blame someone else for being inadequate",
            "Just because it's easier for URM to get interviews doesn't mean they didn't earn their spots. The interviews are literally just as hard. While my URM friends get better response rates than me, I know fs they deserve every offer they have.",
            "as long as companies have diversity hires there will be diversity hire accusations",
            "Wow didn’t know these kinds of talks happened that often. Oh well lol",
            "You have no idea what sus means do you",
            "Race/gender doesn't guarantee you a job in tech, but at the same time, diversity hiring is definitely going on and most tech companies do it to get brownie points from the public. Some companies even explicitly state that they prefer female/black latino candidates on the application website.",
            "You ever just think that maybe those companies don’t care to hire solely skilled people on their team....cause if they were to do that, then the whole company may just as well be... a new country? Lol\n\nAlso it’s becoming hard to tell if someone’s just a diversity hire or not. Even interviews are skewed with LC easy, medium and hard—a skilled applicant has lesser chances of doing poorly but they might come off as cocky. Stuff like this gets factored in as well unfortunately",
            "let’s just call it like it is, racist",
            "[deleted]",
            "I 100% agree but at the same time I do understand where some of those people are coming from. There are some people who are pretty under-qualified for certain positions who get offers simply because of how companies are looking for more diversity, which isn’t exactly fair either. Again, this is not an excuse to put those people down (I’m a female in CS and def have gotten those typa comments before lol), but its definitely happened where applicants are judged at a lower standard because of their race/gender cuz the company needs to look good",
            "[deleted]",
            "[deleted]",
            "[removed]",
            "[deleted]",
            "Alright. Let me start out by saying this opinion will probably get thrashed and I'm fine with that. You are totally welcome to disagree with anything I say here. I will also mention I am a white guy, so keep that in mind as obviously it will affect my views.       \n\n[Here are facebook's diversity stats](https://diversity.fb.com/read-report/). If you scroll down a bit, you can see the US (and US only) race statistics of the company. Notice how every single racial demographic is rising in representation except for white people. The USA is 60% white, yet white SWE's only make up 37% of US technical roles at FB. Whites are over represented in leadership by 3% and underrepresented in every single other category of the company. I acknowledge that other minorities are also not represented at appropriate levels and will be the first to argue for more representation for them. But isn't the point of diversity programs to balance things out, not to over or under represent any one demographic?          \n\nOne other issue I had major problems with was first and second year programs this year. As a sophomore, I could not find a single one which wasn't targeted at minorities. Before you tell me they say everyone is welcome to apply, two of my mentors are extremely high level technical leads at Google and FB. After talking to recruiting, both told me not to bother applying to FBU and STEP and said I didn't stand a chance. And you know what? They were right. I was interviewed at more BigN companies for normal SWE internships than I was second year programs. Now, let me make something extremely clear: **I am all for outreach programs and representation in tech.** However, I can't help but get a bit angry when companies lump those programs together with their first/second year programs instead of leaving them separate. Now, before some wise-ass tries to imply I wasn't qualified for these positions, I will go ahead and say you may be right. But, I doubt it, as I cleared the interviews and signed a \"normal\" SWE internship at a BigN with a hiring bar that is just as high as Google's and FB's, if not higher. I am not saying I am entitled to an interview at any of these second year programs, just saying I do think I was qualified. Regardless, the main reason I bring this up is because I have many friends in CS at my school, but not a single white guy I know was interviewed for STEP, Explore, FBU, UberSTAR, TwitterU, etc. I know many URM's who were (and most were more than qualified!), but I still think it is a shame (and extremely ironic) that my white friends (esp the more qualified ones) were filtered out because they weren't diverse enough...         \n\nEdit: fixed grammar mistakes and removed a cringe section that in retrospect could have easily been interpreted as humble bragging lol",
            "I work in IT. Not officially and not on paper, but there are a lot of single IT guys in their late 30s who will grill the living crap out of an Asian/Indian dude but suddenly kick the brakes when a cute girl comes in to interview. Not against it, just see a lot of naivete on this thread"
        ]
    },
    {
        "post_id": "foj6ht",
        "author": "crispynewspaper",
        "title": "I'm collecting all the COVID-19 internship & job links into this google doc.",
        "url": "https://www.reddit.com/r/csMajors/comments/foj6ht/im_collecting_all_the_covid19_internship_job/",
        "score": 410,
        "num_comments": 10,
        "created_utc": 1585106244.0,
        "selftext": "This is the same document that I posted a while ago, but I updated it with COVID-19 job-related links at the top. Given what's happening right now I think it's helpful to combine everything into one central location.\n\n[cs jobs link](https://docs.google.com/document/d/1VL3GqkwWWjXuK6MHGxGq81sOf0GJRr8Gxn5dlcHBXVk/edit?usp=sharing)",
        "permalink": "/r/csMajors/comments/foj6ht/im_collecting_all_the_covid19_internship_job/",
        "comments": [
            "This is so much more than job listings lol. Its beautiful.",
            "You’re the goat 🤟🏻",
            "You out did yourself\n\nAwesome",
            "You have no idea how helpful this is. Thanks a lot for giving ppl like us hope and spreading knowledge and info.",
            "If only I could afford to give u an award u deserve it",
            "I'm crying, this is a goldmine. This is soo valuable. Thank you!",
            "this is really amazing, thank you so much!!",
            "God will send your soul straight to heaven",
            "Dude, you are just amazing! Bless you!",
            "Here's another good resource for tracking your applications [MassApply.com](https://MassApply.com)"
        ]
    },
    {
        "post_id": "17oh07q",
        "author": "Cautious-Bet-9707",
        "title": "2024 Summer Internship Hunt (no interview)",
        "url": "https://i.redd.it/wntbjc0uekyb1.jpg",
        "score": 410,
        "num_comments": 20,
        "created_utc": 1699205662.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17oh07q/2024_summer_internship_hunt_no_interview/",
        "comments": [
            "Bro applied to McDonalds",
            "Never said it was in SWE.",
            "It’s funny when you know it’s referencing all the other posts 😂",
            "Bro drive truck for Amazon delivery",
            "Me : 100 applications later\n\n![gif](giphy|goQ4bc8X0Lh6w)",
            "Can you ask your dad to hire me too. Thx",
            "I hate you, congrats though",
            "Did You came from 2021?",
            "If not a joke, which company?",
            "I like simple squares.",
            "Is there a tool that can apply to multiple applications in one go? , I have heard of simplify tool",
            "I remember getting a few “offers” for unpaid internships without applying or interviewing.",
            "[deleted]"
        ]
    },
    {
        "post_id": "s69dep",
        "author": "eMeSsBee",
        "title": "Cheating on Interviews?",
        "url": "https://www.reddit.com/r/csMajors/comments/s69dep/cheating_on_interviews/",
        "score": 405,
        "num_comments": 156,
        "created_utc": 1642440292.0,
        "selftext": "One of my friends recently got an offer and he told me he cheated on the technical interview. He said he went on his phone and looked up the question.\n\nI’m curious how many people are cheating on their final rounds especially if it’s on the phone and you don’t need to show your face.\n\nI know it’s pretty common on OAs but less so on proctored CodeSignals.\n\nEdit: Lot of people are saying interviews are broken which I agree with. But saying googling is a skill doesn’t really justify doing it in an interview.",
        "permalink": "/r/csMajors/comments/s69dep/cheating_on_interviews/",
        "comments": [
            "[deleted]",
            "This is the Chunin Exam bro",
            "Let me tell you a story I witnessed first hand.\n\nMy friend was interviewing for an IT role. The camera was off. The interviewer asked him a coding problem. He held is phone underneath the table and googled the solution. He typed it and called the interviewer to check. It was the right solution. Then the interviewer asked him another question, my friend cheated again. This happened for a whole hour. \n\nAt the end the interviewer asks my friend if he has any questions of his own that he'd like answered. He said how did I do?\n\n\"Make sure the next time you use your own head.\" \n\nAll of us flatmates went crazy lmao. That was very cool.\n\nMoral of the story, when you cheat you're always on the mercy of the interviewer. The next interviewer may not be so careless and at that point only the knowledgeable person will succeed. Or else you can live everyday of your life fearing you might get fired if they find out how incompetent you are lol.\n\n Btw this guy landed a job by cheating before this interview and got thrown out after a month. He now tells companies that he \"interned\" at that company lmao.",
            "I understand the game is broken and the stakes are high- but  if I was the coworker this would not make me feel any better",
            "[removed]",
            "How the hell do you guys cheat on a video interview when you're supposed to be communicating the entire time? Wouldn't it be incredibly obvious?\n\nOA's yeah, sure. But actual interviews?",
            "This comment section wth",
            "It's rigged don't think too much. Amazon is hiring new grad SDEs with some OA which of course most of them cheated who got optimal solutions are now in Amazon without actually doing anything. The game is rigged if you don't adapt it's bad for you. I was the one who never cheated in these but soon I realized even the people who never knew coding joined like this and then eventually survived there and enjoyed or will enjoy a hefty pay without any guilt. Whereas I am still looking for jobs.   \n\n\nPeace don't think too much and do what you can for yourself even if it is to cheat.",
            "If you were asked that technical question while on the job, would u sit there and figure it out or spend 10 seconds looking up the optimal solution? Interviewing is shit and your friend shouldn’t feel guilty for it",
            "Don’t hate the players. Hate the game.",
            "lol whoever isn’t cheating is either smart af or a complete idiot",
            "I don't see any problem with that. The fact that he was even able to cheat shows how flawed the interview process is. I don't see any difference between looking up an answer and memorizing an answer which is what the modern coding interview has turned into.",
            "The ends justify the means",
            "You guys get interviews on phones? Most of mine are on zoom video",
            "I don't blame him.",
            "Eh, learning to quickly find solutions to problems using any/all resources while you're working is honestly really important.",
            "I haven’t had to cheat on an interview, but I get why a lot of people do it. When you’re actually working you have the internet at your fingertips to help you… so I don’t see anything wrong with it.",
            "I generally tell them that I don’t remember off the top of my head but I would go to X website and use the search function to look up “xyz”. \n\nIt shows honesty and the fact that I know how to do research rather than asking others constantly.",
            "Oh I see hundreds, if  not thousands of Indian folks on Facebook asking for 'interview support'\n\nThey want someone they can chat with to give answers (during their interview)",
            "Agree 100% the game is flawed but at the end of the day I treat studying LC as a grind which could apply to any other endeavors in life. \n\nI just think cheating will lead down somewhat of a slippery slope where you will start taking short cuts on a lot of other things(some of which you shouldn’t take). I’ve seen this in tons of friends who cheat where they tend to take “short cuts” on a lot of other things(which sometimes backfires).\n\nI think as long as you are careful with how and when you apply it it’s okay(obviously this is very subjective)",
            "how would you even do that without getting caught?",
            "Everyone I know including me does this. I know how to solve these problems but sometimes the most optimal solution is impossible to know without looking it up.",
            "It's not easy to cheat",
            "Most if not all my final rounds have required me to have my camera on. It becomes really hard when you have a camera on especially when its obvious you are reading off something. This is also particularly the reason the top tier companies ask questions that are harder and harder now. It becomes painfully obvious when you are just trying to copy a solution you looked up vs actually walking through it and writing it from scratch.",
            "I have never had an interview where I didnt have to show my face. Also, it doesnt justify to cheat no matter how flawed the interview system is lol.",
            "hmm...if this is how they interview, time to get a silent keyboard I guess",
            "Never cheated, never will.",
            "How exactly do you cheat on an OA anyway? Do you just look up the answers on a second computer? Won't it appear obvious if you just start randomly typing out the correct solution.",
            "I’ve heard some cases where people have done It, but interviews without video on ? That’s Sus",
            "So he just coded every answer on the PC while looking up answers in his phone. Is this gonna bite back later or are technical interviews actually unnecessarily difficult?",
            "If someone could help me think through a variation of this situation I would appreciate it.  \n\n\nA relative told me a company he was applying to accused him of cheating in his OAs. He told me he definitely didn't. We moved past it, and ended up discussing the problems and his solutions. He shared his submissions with me.  \n\n\nI looked up the problems by their title given to him, and ... sure enough, there are his submissions on geeks for geeks (which happened to be the first result on google).  \n\n\nI confronted him about it, gave him the opportunity to come clean about it in a no-judgment environment. He still denied it.  \n\n\nIt bugs me that he cheated, but I can't get past the lying & denying it to me. I guess it's not a huge deal though.",
            "Never cheated, but I never had to.\n\nTbh, my take is that sure, I could cheat on an interview, but could I cheat at my job? I don't want to feel like I'm on a verge of getting fired all the time. Of course interview questions do not exactly represent the nature of job, but If I felt the question was way of of my league, I wouldn't try to cheat really, instead just try to think of something out loud to at least show the recruiter my thought process.",
            "High risk High reward. This is real life.",
            "I work in IT/Security and not CS, but I believe that requiring anyone to try and remember a specific algorithm to complete some asinine task is utterly stupid. I would rather have someone like your friend that took a few minutes that could effortlessly, and quickly find the answer online. Being forced to remember everything just leads to burnout, and honestly, everyone is going to need to google something to complete a task. Like, if googling an answer is such a bad thing, then why was Stack Overflow created?",
            "Thanks for the idea 😈😈",
            "just learn how to code LMAO",
            "Everyone cheats.",
            "Treat your classes like you treat your relationships. When things get hard, start cheating",
            "I feel like this is why interviewers want to ask 3 leetcode hards for a $60k position these days.",
            "LMAO. Taking an interview right now and caught the candidate cheating. She had multiple screens open. How did I know? I saw the reflection in her eyeballs.\nWhen I confronted her, she denied using multiple screens. Then she shut down one of those screens and opened her mobile phone",
            "it's common but easy to spot as well, interviewers were complaining about how many people were cheating.",
            "How do you guys cheat with ur cameras on?"
        ]
    },
    {
        "post_id": "jgt7ce",
        "author": "OkayKatniss413",
        "title": "I Got 7 Internship Offers: A (long) summary of my 2021 summer internship search",
        "url": "https://www.reddit.com/r/csMajors/comments/jgt7ce/i_got_7_internship_offers_a_long_summary_of_my/",
        "score": 411,
        "num_comments": 154,
        "created_utc": 1603478922.0,
        "selftext": "UPDATE: make that ~~8 offers oof~~ 9 offers, big oof\n\nSo now that I've finally wrapped up this internship search from hell, I thought I'd just yeet my experiences out there in case it helps someone else.\n\n**About Me**\n\n* Junior at non-target state school in the Northeast (can probably tell which one from my Reddit history)\n* Double majoring in Computer Science & Business Analytics\n* 3.2 GPA (it sucks, I know)\n* Had one internship this past summer (see my flair), a part-time job with my school's IT department, and 2 leadership positions (VP, director) of the 2 largest CS student organizations at my school\n* Two projects on my resume, a Twilio text bot and a very basic Android app that just spit out data from an API\n* US Citizen\n\nI applied between **early August-early October** and did a bulk of my interviews in September (I actually had 10 interviews in 1 week during September. Do not recommend). I also attended the Grace Hopper Conference & had recruiters reaching out to me because of that\n\n[Here's a Sankey diagram of my search.](https://imgur.com/a/EtbF8Av) Somehow a few applications were not accounted for, according to the spreadsheet formulas I wrote I submitted 129 applications but somehow after multiple thorough counts only 121 were accounted for. I did lose track towards the end but I can assure you that the 2nd round + numbers are accurate at least. On this chart \"OA\" includes both OAs & first round recruiter screens, \"2nd round+\" includes technical screens and final rounds. I did end up canceling interviews & ignoring OAs after getting a couple of offers so that's reflected in my Sankey too.\n\n**All of the positions were SWE internships except for one or two PM ones.**\n\n**Companies I made it to the 2nd/final round with, in no particular order:**\n\n* **AT&T, Vanguard, Toyota Connected, Cigna**\n   * I canceled all these final rounds! Vanguard was a referral, Cigna was through GHC\n   * Toyota final was sent to most people (Hirevue)\n* **Dropbox**\n   * Applied online, got all test cases on OA\n   * My very first technical of the season. Failed it hard.\n   * *Result: rejected after technical phone screen*\n* **Google**\n   * Applied with a referral, went directly to interviews (most likely because I'd taken a Snapshot in December 2019)\n   * God I wish I hadn't messed this one up :c\n   * *Result: rejected after back-to-back interview round*\n* **iCims**\n   * Applied online, iCims does their recruiter screen first and OA as the second round\n   * For some reason the OA was a lot harder than last year & I got a 60% on it\n   * *Result: rejected after OA even though last year I made it to the final round*\n* **Facebook**\n   * Applied with a referral & my resume was presumably given to my school's recruiter, who reached out to me\n   * Thought I did alright on the technical but I guess my explanations weren't good enough\n   * *Result: rejected after phone screen*\n* **Salesforce**\n   * Got reached out to via GHC\n   * Did their final round over a month ago, and reached out every week since asking for an update -- when I said I had upcoming offer deadlines they opened the email and did not reply...\n   * *Result: ghosted after final & I look forward to telling them I took another offer because they left me hanging for over a month when they initially promised a week*\n* **Oracle**\n   * Recruiter reached out to me on LinkedIn\n   * Got through initial technical & final rounds\n   * One of the teams I interviewed already rejected me & the other is still thinking about it\n   * *Result:* *~~half-rejected after final~~* ***offer from the other team I interviewed with***\n* **Lockheed Martin**\n   * Reached out to via GHC\n   * They actually interviewed me for full-time because the position they wanted me for required a security clearance that'd take a year to obtain\n   * Was told during the final interview that my GPA would be a disadvantage during the decision process\n   * *Result: rejected after final (this is the 1 rejection after final on the Sankey lol)*\n* **Goldman Sachs**\n   * Applied via referral but talked to a recruiter at GHC who took a look at my HireVue (I got all test cases on the OA & did the HireVue) and invited me to a Superday\n   * I was entirely out of practice because this was the last interview I did, I couldn't implement merge sort LMAOOO\n   * *Result:* *~~have not heard back, oh well~~* ***offer*** *(TBD team in NYC)*\n* **Wells Fargo**\n   * Applied regularly, interviewed through GHC\n   * Interview was objectively good but I did not click with the interviewers imo\n   * ***Result: offer*** *(treasury technologies team in Charlotte, NC)*\n* **JPMorgan Chase**\n   * Applied regularly, got all test cases on the CodeVue, freaked out because I never got a Code for Good invite\n   * They invited me to a traditional final round instead. Vibed during the behavioral, thought my technical was a bit sloppy\n   * ***Result: offer*** *(TBD team in NYC)*\n* **Bank of America**\n   * Applied regularly and did the Hirevue, a month later got reached out to via GHC -- told them I already applied, they looked over my app & decided to interview me anyway\n   * Interviewed at GHC. 30 minutes, no coding questions, very much a vibe check vs an actual interview imo\n   * ***Result: offer*** *(TBD team in NYC)*\n* **Red Hat**\n   * Reached out to via GHC for an Integration Engineering Intern position -- basically doing infra work, lots of Docker/Kubernetes stuff in partnership with a telecom company working on 5g infrastructure\n   * Interviewed at GHC, didn't connect with the interviewer that much tbh\n   * ***Result: offer*** *(forgot the team name in Westford, MA)*\n* **Capital One**\n   * Applied online, their first round is the final round. Mine was originally scheduled for mid-September and I had to push it back twice because of scheduling conflicts lol\n   * Case interview was fun! Technical was alright, behavioral I was chilling\n   * ***Result: offer*** *(TBD team in McLean, VA)*\n* **Liberty Mutual**\n   * Got reached out to via GHC, their interview process was the most chill\n   * During my final one of the interviewers accidentally muted himself until the very end but the experience was still great!\n   * ***Result: offer*** *(TBD team in Seacoast, NH)*\n* **Morgan Stanley**\n   * Applied online, about a month after I did the Hirevue my recruiter reached out to me saying she also saw me in the GHC database & that my final interview would be happening there\n   * Had a good time during the final, did a coding question & a non-coding logic question & some behaviorals\n   * ***Result: offer*** *(TBD team in NYC)*\n\n&#x200B;\n\nUltimately, location mattered to me a lot -- even if we're remote next summer, when considering full-time I want to be in either NYC or the Bay Area. All the NYC offers I got paid pretty much the same thing (including overtime) which I thought was pretty neat, but ultimately after talking to many former interns at all these places, **I decided to go with JPMorgan Chase.**\n\nSince I interned at a financial company this past summer, I was somewhat looking forward to trying out a tech company, but I really did enjoy the more well-rounded experience I got during the internship -- I got to learn more about finance & management too besides coding, and since my long-term career goal is management and not really SWE, I knew that having a ton of banks to pick from wasn't really a downside. I had a very long discussion about the mentorship and professional development opportunities at JPMC with my behavioral recruiter, and they pretty much outdid my last internship in that aspect which I initially thought was impossible, lol.\n\nI feel like this post is long enough so I'll answer questions in the comments & I can give tips in the comments too I guess. Thanks for reading all the way down here if you made it!\n\nEDIT: added that my school is not a target & that I am a US citizen\n\nEDIT 2: totally forgot that Goldman Sachs was via referral oop\n\nEDIT 3: I got another OA that I'm not gonna do, so mentally add one to the \"I didn't do OA\" count on the Sankey rip",
        "permalink": "/r/csMajors/comments/jgt7ce/i_got_7_internship_offers_a_long_summary_of_my/",
        "comments": [
            "congrats! my dad works at JPMorgan and has talked about how tech focused the bank has become, with a huge emphasis on AI. Hope you enjoy New York!",
            "In before people post saying it's because of your gender.\n\nCongrats, OP, that's awesome!",
            "This just makes my depressed ass more depressed😭😭",
            "Man where are people getting all these referrals? It feels like I'm the only one who doesn't know people in the industry sometimes.",
            "[deleted]",
            "Only 19/121 interviews? Kms",
            "[deleted]",
            "You must be great at vibe checks.",
            "Hey congrats but Honestly, what the fuck. I applied to all of these places and got ghosted by most of them not even an OA. I even had Amazon on my resume. I guess Amazon isn’t good enough to get past the resume screening.",
            "The financial companies seemed to really be into you, perhaps because of your business major. Conversely, perhaps that's why some of the more pure tech companies were turned off, either way, congratulations. Chase is a great company for what you seem to be interested in.",
            "[deleted]",
            "This thread caught my eye..  \nstarted reading.. thought to myself, “hmm this sounds like...”\nLooked at the username...\nRUTGERS!!\n\nCongrats!",
            "What’s up with Salesforce this year? Are they backed up or something? Haven’t heard back for a while after OA.\n\nAlso congrats! I’m attending SHPE so I’m looking forward to trying not to fail the technical interviews.",
            "For Google, you got the interview immediately? I also took the snapshot in December 2019 but haven't gotten anything back this time (a recruiter told me I'm under review still, though). Could I PM you?",
            "Me, reading the post: This reminds me of someone\n\nMe, reading the username: !!!\n\nSeriously though, you rock! Congrats and see you @ JPMC :)",
            "Rutgers is a non target school? Since when?",
            "Congrats I remember you from the megathread! You were always supportive, you deserve it!",
            "congrats!! I also accepted an offer from jpmc in nyc so maybe i’ll see you there :)",
            "congrats!\n\nhello from discord. i'm from rutgers previously, too.",
            "I got an offer from JPMorgan and Capital One as well. I picked Capital One in the end!",
            "Was there also pymetrics on JPMC?",
            "What is tc?",
            "This is awesome! Congratulations on going through so many interviews, and ultimately, getting an offer. A lot of college students struggle to even get interviews. Anyway, I know you are probably aware of this already, but here is a pretty good [article](https://www.coursehero.com/college-life/internship-tips/) on how to make the most of your internship.",
            "RU rah rah!",
            "This sub had me thinking no one was getting internships this year. Seems like every post here is someone talking about sending out 600 applications and getting no responses.\n\nCongrats OP",
            "Congrats!\nDo you have any tips connecting with an interviewer? What topics have been coming up / giving you success?",
            "Hi, if you don’t mind me asking, how long did it take to hear back from Google?",
            "Which interview did you feel was the easiest?",
            "Congratz! Do you happen to know whether these companies hire international interns residing at different countries now that many of them allow working from home?",
            "If you don’t mind me asking, how long did it take for you to hear back from Goldman Sachs after the super day?",
            "How much did JPMorgan pay you and was there a relocation stipend offered?",
            "Congratulations on your offers! I'm still looking for an internship myself. I'm confused because the vast majority of the companies you interviewed at/got offers at didn't even send me a first round coding challenge, even though I:\n\n\\-Have a 3.8 GPA\n\n\\-Go to a target school\n\n\\-Already have two coding internships under my belt\n\n\\-Have numerous \"beefy\" projects on my resume\n\n\\-Am a US citizen.\n\nCould anyone tell me why I haven't been getting anywhere with applications? Am at my wit's end here. The only thing is that I'm a male.",
            "When did you hear from vanguard. I applied ages ago did the OA (super easy) and haven't heard anything : (",
            "If you don't mind me asking, what was the salary offer for liberty, wells fargo, and BoA?",
            "[deleted]",
            "Wtf is HireVue? Is this why I can’t get an interview?\n\nAlso, what is GHC? I just skimmed your long post, sorry. NM, Grace hopper conference.",
            "[deleted]",
            "[deleted]",
            "Congratulations on the offer! I'd show my brother so he can focus lol",
            "Holy shit what a list, major congrats!",
            "What’s GHC?",
            "How soon did C1 reach out after power day? I had mine a couple days ago and not sure if they send rejection letters",
            "How do you answer a behavioral question if it’s a situation you have never faced before ?",
            "just applied to c1, do you think it's too late in the recruiting cycle to hear back?",
            "Was the internship for Bank of America the Global Technology Summer Analyst one?",
            "Wow! Congrats!",
            "Congrats again! your 2021 summer intern is after your second academic year?",
            "Ever hear back from Goldman?",
            "congrats!!! if you don't mind, could you tell me about your superday experience at Goldman? I have one coming up and want to know what the technical questions are like! how many did you get and subjects/difficulty? also did you have to test the code yourself or how did the process work virtually?",
            "How was your technical interview with Liberty Mutual?",
            " hi, can u share what the format of the 1st dropbox interview was? Was it a 1 hr coding interview?",
            "Remind me! 3 months",
            "what is GHC?"
        ]
    },
    {
        "post_id": "1bxfhgg",
        "author": "Im_ThePope",
        "title": "Ranting about life as a CS Major",
        "url": "https://www.reddit.com/r/csMajors/comments/1bxfhgg/ranting_about_life_as_a_cs_major/",
        "score": 409,
        "num_comments": 106,
        "created_utc": 1712420442.0,
        "selftext": "I just feel so defeated, man.\n\nAt 18 years old, I went to community college and worked full-time, thinking I wanted to become a Nurse. I made it into nursing school but ended up failing in 2020. Honestly, I hated going to nursing school, and I didn't know what to do with my life.\n\nA couple years later, I got accepted to a CSU for Computer Science, and I instantly fell in love with it. I went from barely passing classes in community college and nursing school to getting the top grades in all my CS classes. I worked so hard, both in class and on the side, learning extra. I thought I was doing everything right.\n\nNow, I'm 38 days away from graduating with a 3.91 GPA and multiple projects I'm proud of. But despite all this effort, I've sent out nearly 400 job applications with absolutely no luck.\n\nI feel so defeated. I feel like a failure. I feel like I'm letting down my mom, grandma, and girlfriend with all the help and support they have provided for me. I also feel like I am letting myself down. I am 27 years old and it feels like I have nothing going for me. I thought I was bettering myself with something I love to do, but instead, my self-esteem drops lower with each rejection email I read.\n\nI don't know what to do. I feel so down. I really want to do this, but I need to get my life started. It feels like I'm wasting time. I feel so scared about my future. I know there are probably others on here going through the same thing. I'm going to keep applying to jobs every day, but it almost feels hopeless at this point.",
        "permalink": "/r/csMajors/comments/1bxfhgg/ranting_about_life_as_a_cs_major/",
        "comments": [
            "You probably hear this a lot but networking is huge in college. Many people see tons of success attending hackathons",
            "do you have internships",
            "The first but is my backstory for context, if you don't wanna read that skip to \"------------------------------------------------------------------------------\"\n\nI am 29 years old, have a Bachelor's and Masters in ECE.  I want on one internship at an oil company which is completely useless to me now.  I worked as as Electrical/Hardware Engineer at a startup last year for 9 months then was laid off due to funding issues. \n\nAfter I finished my masters it took me 2 years to get that job.  For the first year I got maybe 4 interviews, 2 I got through networking, but I didn't have any relevant experience so I didn't get past the first round.  Also, during that time (for reasons I won't go into) my confidence was at an all time due to dealing with depression for the last few years which resulted in me nearly failing out of grad school, and I was having a bit of an identity crisis at the time so I was going after every kind of tech job; electrical, embedded, software, ML, Data Science etc.\n\nAfter the first year I did some soul searching for a week, realized I wanted something a job that involved circuit design, interfacing with sensors and actuators, and microcontroller programming.  Basically a Hardware/Embedded/Electrical stack.\n\n\nI'm sure you already know this, but employers these days want assurance that you can hit the ground running when you get hired.  So I decided to work on projects that would showcase the necessary skillset.\n\nI first built an Arduino based Robot car that could be controlled over Bluetooth with a phone app.  It involved object oriented programming, microcontroller programming, interfacing with sensors, implementing a control system etc.. Aside from Digital communication protocols, I wrote all the code from scratch, didn't use any libraries.  Thing is the project as a whole is something that any hobbyist can do (with extensive use of libraries) so when I put it on my resume it didn't really help.  So I had to make sure my next project was something that required something with an engineering degree to complete.  Mind you, I was really low on money at the time so I felt like I was in a do or die situation.  At this point I was about a year and 2 months out of grad school\n\nThe next project was basically an analog spectrometer.  I design all of the circuitry using a tool called LTspice, the design the printed Circuit Board in Kicad.  I wasn't even halfway done when I added the project to my resume, a this point 1 year and 4 months out of grad school.  But less then I week after I did I got my first interview in like 6 months made it to the final round, a 1-on-1 with the CEO. Didnt get the job but it was a major boost my confidence.  I was now averaging an interview with a new company once every 2-3 weeks, getting to at least to 2nd round each time.  Finally got employed about 6 months later.\n\n------------------------------------------------------------------------------\n\nAfter I got laid off from my job I thought I would get new one in under 2 months because the main issue most interviewers had with me was my lack of relevant job experience.  For this one company in the valley I made it to the 5th round, where I had to give a half hour presentation on a project I worked on to a label of 7 people followed by three 1-hour interviews with 2 people each, just to be told a week later they are going with someone who had 3 years of experience... This was marketed as an entry level job 🤬🤬.  If we were in a \"normal\" job market this would be true, but we are in a horrible one right now.  People would often say to me \"don't worry about whether or not you meet all the requirements, just apply.\". Maybe that was a time when they was true, it isn't anymore.  From my own personal analysis, I won't even get a phone screen unless I meet at least 75% of the basic requirements and half of the preferred ones. I've been out of a job for a little over six months.  For the first 4 I was averaging 1 interview a month and I never made it past the phone screening.  Believe me when I say the bar is SSSOOOO much higher now that it was before the first quarter of 2023.  Also recruiters were telling me, and in my own experience this is true, me that \"big companies want someone with at least 6 years of experience, they are willing to go down to 3, but you don't even have 3 so it doesn't matter, you're best bet is getting a job at a startup that needs to hire quickly\".\n\nI've some very key changes to my resume, made my portfolio easier to read, am very selective about which jobs I apply to know, am taking a course to bridge my knowledge gaps, and am working on a project that will prove I know how to use certain technologies as skills.  I am having much better luck now. Still don't have a job but for the first time I am optimistic.\n\n\nHere's my advice to you:\n1) Choose one type of Software Development to focus on (front end, back end, web, Date analysist, cloud, embedded etc.) focus only learning skills relavent to you chosen stream and build projects that show you have aptitude in that area.  When you eventually do get interviews each one will help you prepare for the next one\n\n2) Accept the fact that it is going to take a while probably at least 4 months.  Believe me I understand how demoralizing being unemployed for a long period of time can be; you feel like a failures loved ones look at you differently, everyone wants to give you advice but most of the time it is at best not helpful or self-sabotaging.  My mom's friend who (claims) she used to work at HR said I should put \"Hard worker\" and \"Detail oriented\" on my resume 😂.  Thing is you need to thoroughly think through every decision you make so that you don't miss important details, and you need to have deep knowledge of everything you claim to know when you go into interviews because the interviewers nowadays will check you on pretty much everything.  If you let the pressure get to you and act without doing your due diligence you're just gonna waste your own time, energy etc.\n\nThe job market is absolutely horrible right now and has been for the past year.  But things are getting a bit better.  There are things you can do to make yourself a more attractive candidate than just tailoring your resume.  Once you suceeed in getting a job, you will realize that you can handle pretty much anything life throws at you.",
            "good luck. im sorry to hear. just wanted to say you arent alone in this.",
            "At least u have a girlfriend bro",
            "Get your resume reviewed. Checkout the CS Career Hub discord. If you haven't gotten a single interview with 400+ applications it usually is the resume at fault.",
            "6 YOE in tech.  \n  \n1. The economy sucks for new hires so you're going to be in a tough situation. It doesn't mean you're less competent, but it does mean you need to have perspective on your prospects. It's like buying bulk masks after Covid.   \n2. You have to consider alternative avenues like entreprenuership and be willing to at least fail at those.   \n3. Projects are cool, but what you really want is work that can have other people vouching for you that increases networking. Interships are also shrinking because of the market, but you can do things like Code for America in the meantime.",
            "When You are at rock bottom. There is no more bottom. Only way to go up.",
            "You’re not a fail sure you accomplished something a lot of ppl are struggling with. Getting a degree especially in CS, I been coming across a lot of posts like this. People struggling to land a job but a lot are saying internships are key…\n\nAlso, make a LinkedIn, Network, I’m looking into getting a CIS degree I’m 25 M. No college though yet but anyways keep going!",
            "Keep applying, don't lose the hope man that's all we've got",
            "Nursing is probably one of the “safest” jobs ever for the future. Might be smart to get it as a backup.",
            "I gave someone a resume in person, chatted a bit, and then got a call back the next day. Get Face to Face.",
            "Do some freelancing on Upwork? Im barely passing my CS courses so thats pretty much the only option for me. Do that for a bit and maybe you might catch the eyes of a good company eventually",
            "Well I have graduated for 4 months, and spamed like 500 applications, still no dice for me too.\n\nYep, also felt defeated.",
            "Good luck my friend. It’s nice to know we’re not alone.",
            "You can always go into government and get experience. They pay decent too depending on the agency and you’ll be guaranteed an interview most of the time if you meet min requirements",
            "Unfortunately so much is about who you know and random luck since so many are in your position right now. My nephew who graduated last year had the same issue. Sent out couple hundred resume and no luck. His dad happened to talk to a friend who's friend was in IT. Got him an interview right away and got a job.  I'm also a dev and same thing 3 years ago. Laid off and had use connections to get an interview and got a job.  Try to use any connections you have. Also might want to get your resume reviewed to make sure you're not getting filtered out. Might be missing some key words.  You'll find something, it's a pretty solid degree.  Keep applying.",
            "I can help you as a referral for my same type of job (I am at currently at 150k TC after 2 years) \n\nDm if interested.",
            "You're judging yourself based on external validation. You could go into IT, cybersecurity, or data science. You could also land non technical finance or business management positions to get your foot in the door at a company ",
            "This is typical in today’s jobs market. It has nothing to do with you. The average number of applications you need seems to be around 500, which also means anywhere between 250-750 for graduates. Keep trying; you’re not even at the average yet.",
            "You’ve done a lot of hard work. Getting your CS degree isn’t easy. You haven’t let yourself down. You’ve positioned yourself to enjoy a great living doing something fun. Right now, there are definitely obstacles in your way. The market isn’t great, we’ve had a number of layoffs in big tech, and companies are scaling back hiring. Don’t let any of that stop you. \n\nOne thing you could consider is looking into a paid internship. You’re just out of school, so starting with an internship doesn’t look weird, it’s easier to land than a full time role, and it’s a great back door into a company if you can prove yourself. So, I recommend looking for internships, in addition to what you’re looking for now. \n\nIn between applications and interviews (they will come), get solid with data structures, algorithms, and design. Stay sharp. While it’s a sad truth, and rarely aligns with anything you do at work, LeetCode is a great way to increase your chances of securing the job if you secure the interview. \n\nDon’t give up. You have one of the best degrees out there, and a very bright future. You simply hit your first bump in the road at the very start. The stars haven’t aligned…make them.",
            "Nursing would have been the better career tbh. In the end an aspiring SWE has to memorize leetcode hards and system design questions which ends up being just as intense as bio if not more. Do you like math? A lot of people who hate bio like math. Maybe you could try taking actuarial exams.",
            "People will down vote me for keeping it real but I'm sorry you can't only send 400 apps and expect to get a job in this economy.\n\n400 would have worked 1, 2 years ago. Unfortunately not today. \n\nYou need to keep applying",
            "Do you have any other skills? You could get a temporary job while continuing to apply.",
            "Depending on what you want to do you can always branch out into broader IT fields. I just finished my major in CS and in college found a network engineering internship which I knew nothing about at first but I really enjoyed and decided to pursue that as a career over strictly software engineering. Now starting as an entry level network engineer at a different company making salary on par with entry level software engineers with a lot less competition in my opinion. A CS degree can definitely land you an entry level job in networking, databases, cyber etc. Not sure if you were already looking into these areas but a lot of CS majors are way too fixated on being a software engineer.",
            "Yep riding the boat with what others are saying. Networking. Hackathons could be huge but also using resources like LinkedIn and connecting your portfolio and setting yourself to open to work. Applications through online are terrible as they go through an ATS so you have to play the game of getting through the ATS and even then it might not matter, they could just toss the application anyways. There are also a lot of \"ghost positions\" which is essentially companies making it look like they're trying to hire but can't fill roles.\n\nTry to get on with internships etc I also highly recommend doing a lot of LeetCode if you haven't already so you can also be prepared for the game that is interviewing.\n\nEverything you've done hasn't been a waste I assure you. The whole job process is just a big game you have to figure out and CS is far from the only field affected by this",
            "welcome to the competition",
            "So...in 2019 at 37 years old with a degree in liberal arts i took a coding bootcamp for woman and got a developer job, then a software engineer position. You may have to wait for the market to rebound but it's not hopeless. Keep doing things that you are passionate about and wait out this market.",
            "Adding a +1 to networking!! If you’re having this much trouble focus on networking and personal projects (or hackathons)  \nGo to meetups and build personal projects rather than just applying. Meet professionals in your area and just talk to them as people and talk about the trouble you’re having and your personal projects. With a gpa like that I’m sure you can get a referral or at minimum have someone help you with your resume or search strategy pretty easily.",
            "Don’t give up man. Just graduating during a tough time.\n\nUse the time to make some interesting side projects and build out a portfolio while you apply and work on your interviewing skills.\n\nFirst, you will probably eventually find a gig. If not, don’t be afraid to humble yourself and take a position “below” what you think you should do. Experience is key, so anything is better than nothing. Of course try and get something related to what you want to do, if possible.\n\nBut above all else, keep grinding and build yourself and one day you will get a real opportunity",
            "Are you willing to relocate to East Tennessee? If so, try [jobs.ornl.gov](https://jobs.ornl.gov). We’re always hiring CS people.",
            "Can I dm you?",
            "Go into contracting they are temp jobs, but you network with sooo many people and they will get you in the door... don't feel discouraged... there is SOOOOO much you can do with a computer science degree.... it would be awesome if after Graduation you had a gig lined up... but it's almost never like that... and when you are a contractor, you can see what you like... do you like programming, do you prefer to be in governance... do you want to do audits you get to do a little of everything and recruiters find you the jobs!",
            "7 yoe here, I think I have some good advice for you specific to your region \n\nIf you’re desperate, post a public resume on dice. It’ll get you cold calls real mediocre undesirable contract work (6 month contracts) but it’s a paying job and your foot in the door. A lot are contract to hire too. Because the roles are undesirable they have trouble filling them and may take a new grad.\n\nCan you relocate? Companies like Meta are desperate to relocate you to work in office in the Bay Area or New York. Submit enough applications for “remote” jobs (they don’t exist) and you might get a recruiter reaching out asking you to relocate.\n\nFinally, CSU as in Colorado State? Have you tried looking into in office work in Wyoming perhaps? It’s so sparse there they have trouble finding people who want to live and work in the state. You could even commute to Laramie or Cheyenne in a hybrid capacity and not have to actually live in the state \n\nIf you are in NoCo, hmu on DMs, I live in the area and can maybe we can network a little",
            "a whole lotta yapping",
            "Took me 6 months after college to land a job. (Back in 2017) I also starting applying after graduation. Would suggest applying for roles that require a security clearance. Make sure to apply for jobs on indeed, LinkedIn, and Dice. Also make sure your GitHub has working projects on it, mention these projects on your resume. Lastly go to as many career fairs as possible. Don’t give up you can do it !",
            "You have one of the most employable degrees, an almost perfect gpa and good projects. You're going to be more than fine, just keep sending the applications, network and you'll 100% get a great job",
            "Just go into teaching/tutoring/mentoring",
            "No degree, no professional contacts prior to this year and managed to get a dev role in 2023. Learning how to code for a business is easy but learning soft skills is a lot harder. Networking is really the key to landing your first role especially during a time like this. Keep your head up high and you can do it",
            "As in life, it’s the timing",
            "My god you're clearly not even built for the excruciating process to land a top job if you're crying about 400 applications. 200 apps and nothing worked and your decision was to send another 200?! Obviously something isn't working out so do something different.\n\nEdit: Not do something different as career but process of job hunting. You think people become CEO's by sending applications? People network and get references. Join summits, go to career fairs, join talent networks. In that there are at-least 20 guaranteed interviews.\n\nEdit2: Most people in CS fail to realize that just because they are smart or high GPA means job/internship. Half the time the people taking your jobs are morons or on your same level but just better social skills. I dont mean behavioral interview social skills but in general. The average CS student is a fucking nerd with social anxiety and doesnt go and talk. Thats why this shit sub is filled with nerds crying about \"500\" applications. Go meet people, email, talk to your CS body at school and there is atleast hundreds of people with return offers who can be of reference or connect you to their recruiter",
            "This maybe be sound hard, but I have seen a lot of this kind of post from time now: \"I was doing X thing suddenly I discover I love Computer Science but now I can't get a Job\".\n\nDon't get me wrong but maybe, what you love is not what you have to do for living and instead you can do it as a simple hobby and who knows, some day you could end working as a SWE.\n\nSometimes keep grinding is not the answer.",
            "It's normal right now because tech jobs are hard to score especially entry-level ones. Try to increase your application to the 1000 range, that's the new norm. You should be proud of yourself. I wish I could do CS but doesn't have the coding aptitude. At the end of the day, you know you will land one eventually, it's just time and patience.",
            "[deleted]"
        ]
    },
    {
        "post_id": "16nm11m",
        "author": "ph4tphuk",
        "title": "\"You can't just summarize the average CS major experience with one picture!\" Me:",
        "url": "https://i.redd.it/5qnvw2jj2fpb1.png",
        "score": 403,
        "num_comments": 27,
        "created_utc": 1695218394.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/16nm11m/you_cant_just_summarize_the_average_cs_major/",
        "comments": [
            "And it'll be taken by someone with 3 years experience who leaves after 8 months when the market improves. The CEO will make a LinkedIn post about how hard it is to retain talent. Literally nothing will be accomplished or learned.",
            "That’s if you’re lucky.  Most of the time your scrolling through jobs requiring 5 years of experience.",
            "surprised it didn't go to 3k",
            "Some guy in the news once said \"hundreds of job applicants for data analyst but I can't get anyone to drive a garbage truck around Houston, paying 90k too!\"\n\nWhich also rings false to anyone who's watched John Oliver's segment on it. All industries have an abusive entry-level. (I bet this Houston 90k driving job wants 5yoe).\n\nWe should just celebrate the return of revature job ads on the job boards whereas before, there were none.",
            "That’s actually on the low end. I pretty regularly see some that hit 3000 applicants in less than 8 hours.",
            "800 of them are garbage applicants, plus this is most likely a remote job. stop looking for remote fresh out of sc hool. most people with experience get them and there is thousands of applicants, go into an office for a year, on-site jobs have way less applicants.",
            "I realize how lucky I got with getting an offer seeing how bad the market is",
            "Don't forget: \"entry level role: minimum 2 years of professional experience required\"",
            "800 of which are absolute rubbish",
            "How bad is it in the US",
            "Rotational programs seem less competitive",
            "How do you even know if it’s a real job? Do employers really use EasyApply to look for candidates?"
        ]
    }
]