[
    {
        "post_id": "16i5s8k",
        "author": "cjbaker678",
        "title": "We're screwed",
        "url": "https://i.redd.it/qevu5z31p4ob1.jpg",
        "score": 406,
        "num_comments": 42,
        "created_utc": 1694656902.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/16i5s8k/were_screwed/",
        "comments": [
            "They mistakenly published their Chinese wages.",
            "TikTok is looking to hire slaves before getting banned by Congress.",
            "didn’t know mr krabs worked for tiktok",
            "A rip off is an understatement",
            "Maybe $60 an hour lmaoo",
            "yeah you're right i probably couldn't survive a year on just sixty bucks",
            "It looks like this is a summer only internship (with the word intern being cut off) for a phd student and that is the salary for the summer term.",
            ">TikTok   \n\nlol",
            "Sound reasonable, they are as commercially viable as twitter was before Elon musk. They loose quite a lot of money if I recall correctly. But maybe you can get paid in rice and chicken tenders 😂😂🤤. \n\nOn the second thought I would love to work for rice and chicken 🍗",
            "It’s an internship, I would rather it be easier to get an internship and get low pay rather than accept 100k as an intern but basically have the knowledge of a senior. Like an intern is supposed to know basic college level stuff that’s it that’s the whole point of an internship to learn.",
            "to be fair it’s an grad internship not an actual full time role, so paying around $30 an hour if you annualize it",
            "I'd still apply. Lol. 😭",
            "This is an intern posting for PHD candidates…",
            "Few moments of silence for my bros who applied!",
            "The job comes with a free pizza party."
        ]
    },
    {
        "post_id": "z9u6rl",
        "author": "melodramaticfools",
        "title": "Some companies are actually evil lmfao",
        "url": "https://www.reddit.com/r/csMajors/comments/z9u6rl/some_companies_are_actually_evil_lmfao/",
        "score": 406,
        "num_comments": 50,
        "created_utc": 1669916718.0,
        "selftext": "just saw this post on blind:\n\n[https://www.teamblind.com/post/Amazon-rescinding-contract-on-the-relocation-day-TcpAHdXD](https://www.teamblind.com/post/Amazon-rescinding-contract-on-the-relocation-day-TcpAHdXD)\n\nthis lady was asked to relocate from CA to seattle for a job, and then the company pulled the offer AFTER she gave up her lease on her current place and all her stuff was already put in the truck by the movers. Just a good reminder that there's no point in being loyal to a corporation because they just see you as a number on a spreadsheet, and they won't think twice before throwing you under the bus...",
        "permalink": "/r/csMajors/comments/z9u6rl/some_companies_are_actually_evil_lmfao/",
        "comments": [
            "There’s lay you off first day at work like Meta, and there’s this stone cold behavior.",
            "Change some to all. Companies being moral is not the norm.",
            "All employers exist to take more than they give",
            "That's why I always emphasize the \"accept and renege\" strategy which many people in this sub disagree with. There are no ethics or morals in business, there's only compliance (including the 12-week severance package because it's required by the law if employees have worked for more than 3 months at a company). There're millions of big companies out there and reneging one won't shift your career off by a beat.",
            "She might have standing for civil damages here.  Nothing guarenteed of course, but I have found the best odds at suing a large company and getting a settlement is that if you do it in the smallest town/juristiction possible, it increases the cost to them and decreases the cost to you.\n\n(Speaking as someone who did it successfully)",
            "Isn’t this just a badly timed layoff? It’s terrible but it’s not like they’re doing anything crazy",
            "Why’s that funny? It’s horrible",
            "do we know how many people were affected?",
            "r/antiwork\nCompanies will always try to exploit you, especially as a graduate make sure you know your rights",
            "Yes, this sucks, AND if you think this is unusual, or unique to Amazon ... stick around the private sector for a while and it will seem less unusual.\n\nI do 100% agree with you that loyalty to any employer is misplaced. Try to be loyal to the individual people, though.",
            "Heard about a dude who was setting up his laptop at meta on his first day and was locked out cuz he was laid off",
            "You guys in put these obviously shitty companies like meta and Netflix run by the worst people on this pedestal  and then you’re supposed to hear this",
            "beyond fucked."
        ]
    },
    {
        "post_id": "x3df91",
        "author": "hereiambois",
        "title": "Just got a rejection from Walmart for a 2021 internship that I applied for in 2020.",
        "url": "https://www.reddit.com/r/csMajors/comments/x3df91/just_got_a_rejection_from_walmart_for_a_2021/",
        "score": 411,
        "num_comments": 6,
        "created_utc": 1662053293.0,
        "selftext": "Applied in August 2020, 2 years and 1 month ago. Thanks Walmart, for your timely response, I had been waiting for an update for 2 years 😂",
        "permalink": "/r/csMajors/comments/x3df91/just_got_a_rejection_from_walmart_for_a_2021/",
        "comments": [
            "Got the same email lol. They were probably clearing out the job positions in their internal system.",
            "same but for a cashier job application",
            "I got the same email at 1:30am lol",
            "Same but I applied for the lettuce tomato onion guy at the Subway inside the Walmart",
            "I'm sorry for your loss."
        ]
    },
    {
        "post_id": "sm4sgo",
        "author": "fett2170",
        "title": "$30/hour, zero technical questions, huge company, took me, a first-year CS student.",
        "url": "https://www.reddit.com/r/csMajors/comments/sm4sgo/30hour_zero_technical_questions_huge_company_took/",
        "score": 404,
        "num_comments": 57,
        "created_utc": 1644174750.0,
        "selftext": "So, I’ll preface this by saying I am a few years older than most freshmen here. I came in with zero programming experience but with a solid amount of work experience in an unrelated field. \n\nI lurk this sub all the time and see people talking about getting rejected by every internship they apply for. With that in mind, I had no expectations while I applied and thought of it more as a learning experience.\n\nI ended up only applying to one internship; to one of the big 4 accounting firms for a technology intern. And a month later, I got a call and we scheduled times for an interview. Eventually, I got it and as long as I don’t screw up big this summer, I will be able to secure a SWE internship the next summer.\n\nI think it’s important for people to apply to companies outside of FAANG and other big tech companies. \n\nDon’t sell yourself short if you are older and don’t know shit about OOP, A&DS, etc. Moreover, don’t underestimate yourself if you aren’t coming from MIT, UCB, GA Tech, or the big names.\n\n\nKeep moving forward… until you destroy your enemies.",
        "permalink": "/r/csMajors/comments/sm4sgo/30hour_zero_technical_questions_huge_company_took/",
        "comments": [
            "Wait, so it’s not an actual swe internship, but pays you $30 an hour still? Also is it remote?",
            "The company I interned at this last summer and fall was $30/hr and was SWE. it was at a defense contractor in noVA. I was asked in my interview one technical question about the difference between TCP/UDP. I Had 0 idea and I honestly told them that. It was so much fun and had a ton of learning opportunities",
            "Congrats! The virtue of the story is to apply to as many companies as you can, while keeping an eye on your resume.",
            "Which company is it?",
            "That last line...",
            "This is.... Freedom?",
            "Tatakae fett2170",
            "Congrats!! How’d the process go? What about your resumé?",
            "Congratulations. \n\nAs another non-traditional student (post-bacc in my mid 30s), it’s easy to forget how much value and marketability we have simply due to our age and life experience. A tiny bit of soft skills go a long way, and add to that the fact that people respect the gumption it takes to go back to school later in life. This sub focuses on the technical aspect of interviewing and my experience is that it does matter, but communication skills and maturity and ambition are just as important. I got a couple new grad offers without any technical portion and I was told they simply liked my attitude. \n\nAnyway keep it up. You’ll do great.",
            "Was it the Product and Technology go to market intern position?",
            "Tatake TATAKE",
            "[deleted]",
            "Tatakae",
            "Congrats man , Reading stuff like this gives me hope",
            "Tatakae Tatakae",
            "Congrats OP there aren't many out there with a 100% success rate like yourself",
            "What was the actual name/role of the internship position?",
            "What, how? Lol",
            "Congrats OP! It's all about applying to 100-200 internships and hoping one hits. If you're applying to fewer than 100 internships and you don't go to an Ivy, you're doing it wrong. I had to apply to 100-200 internships to just get one offer.",
            "Congrats!! How did your resume looked like?",
            "What is your age? If you dont mind me asking.",
            "Did they make you take an SHL test?",
            "First of all,congrats!\n\nWould be great if you can disclose which field you’re in before and how many years of prior experience? \n\nI’m currently in similar situation, just not sure how to apply my previous experience into my internship. I’m CS student btw, previously personal assistant/ HR/ admin.",
            "Did you apply directly or with a referral?",
            "Several year accounting working experience here and just started cs school. Got 0 phone call from big 4."
        ]
    },
    {
        "post_id": "q8qbqg",
        "author": "OkayKatniss413",
        "title": "I Got 7 New Grad Offers: The Sequel (and tips that worked for me!)",
        "url": "https://www.reddit.com/r/csMajors/comments/q8qbqg/i_got_7_new_grad_offers_the_sequel_and_tips_that/",
        "score": 408,
        "num_comments": 114,
        "created_utc": 1634310282.0,
        "selftext": "Hello again r/csMajors! Some of you may remember me from my [incorrectly titled post last year](https://www.reddit.com/r/csMajors/comments/jgt7ce/i_got_7_internship_offers_a_long_summary_of_my/) where I received \"7\" (eventually 9) internship offers. After that whirlwind of a recruiting season, I was expecting to have a more laid-back time this year, especially with a return offer from my internship under my belt.\n\nI submitted 41 applications (most of them as a joke) vs my 120+ from last year, sat back, and was immediately overwhelmed by the number of responses I got, so I decided to make another Reddit post.\n\n**About Me:**\n\n* Senior @ large state school (can tell which one by my post history, again)\n* Double majoring in CS & Business Analytics\n* 3.3 GPA (higher than last year thanks to open notes exams...)\n* Two internships, a part time tech support job, 2 leadership positions (VP of one club, director of another) at school, 2 projects\n* US Citizen\n\nI tried to do a Sankey, but that quickly got confusing because this time around, a few of my interview processes were through the CodePath career fair & my prior recruiting contacts (I attended Grace Hopper but it only barely helped this time around, mostly because I was being selective with the number of interviews I was doing). So here's some quick facts instead.\n\n**Quick Stats From This Year:**\n\n* **Applications Submitted: 41**\n* **Offers Received: 7 (JPMorgan return offer, IBM, VMWare, Asana, Capital One, Deutsche Bank, NBCUniversal)**\n* **# of Resume Rejects: only one** (thanks Duolingo)\n* **# of Total Rejections: 15** (mostly after OAs & interviews)\n* **Interviews Done: 20** (including first rounds & finals)\n\n**Notable Moments:**\n\n* **Rejected from Hubspot after final** because it was my first ever System Design interview and I hadn't studied, oops...\n* **Rejected from Microsoft after final** because one of my interviewers insisted my answer was wrong... when it was right... and the code ran with the correct output... whatever. No hard feelings!\n* **Visa did 4 technical interviews, and then asked for a FIFTH one** so I finally turned them down.\n* **Rejected from Facebook after first phone** because it was my first interview of the season and I hadn't interviewed anywhere in a year.\n* **During my VMWare final interviews, one round was entirely systems/OS/networking questions. I'd never taken a systems class in my entire college career.** Even though I answered \"I don't know\" to every question, and had to explain why I didn't take Systems/OS to the interviewer, I still got the offer somehow?\n* **Got sent the Google snapshot. I didn't do it. Recruiter reached out to me asking me to do it. I ghosted the recruiter.** I was absolutely exhausted after interviewing so much & Google's process is known to take FOREVER. Freshman me would probably slap current me if she knew though.\n* **Asana's final round was the longest I'd ever done, at 5 hours & 15 minutes, and because of time zones it ended at 9 PM my time** but it was also the most enjoyable interview process I've ever done, even when it was so long & ended relatively late.\n\nIf anyone's interested I can add a list of every single company I interviewed with this fall in an edit, but since I only applied to 40 places the list would be kind of short. I also don't want to ramble on like I did in my post last year!\n\n**Tips for recruiting?**\n\n* For full time (or even 2nd/3rd internships), **\"warm\" email any recruiters you talked to in the past.** Especially if you got far in their process last time, they'll probably be willing to take a chance on you again (make sure to re-introduce yourself if it's been a while). With Facebook I failed the first phone for their internship last year, but I emailed my recruiter this year and his response was \"I was meaning to reach out to you again, just apply and I'll send you the first phone scheduling right after\" so you literally never know.\n* **Programs like CodePath and Facebook's ABCS really helped me.** Why? Because I study better with concrete goals/homework and other people, in a class-like setting. Facebook's ABCS is very well suited for sophomores & juniors seeking internships. CodePath's advanced technical interview prep class is suited towards full time since they cover a bit of system design. CodePath is especially great because their homework is directly assigned from Leetcode, and if you don't do it you get kicked from the program. Finish it all, and you get access to their invite-only career fair with 50+ companies. Pretty good incentive to Leetcode if you ask me.\n* **Get your application in front of human eyes as quickly as possible.** Even if its not your actual application, visit the company at a career fair or something, and if you get the chance to talk with a recruiter, tell them you applied and are interested in their opportunities -- they're more likely to go and check at your application after. This is how I got \"un-ghosted\" -- talking to recruiters at GHC and the CodePath career fair.\n* **SOFT SKILLS ARE IMPORTANT.** If you know how to solve a problem but can't explain your reasoning clearly to the interviewer, they WILL be confused. I think that's what cost me the Microsoft interview this year -- see above, I probably didn't explain my correct solution well enough. On the other hand, though, I can't count how many times I was absolutely clueless during an interview, but my communication & honesty saved me -- see VMWare above.\n* **If you're job searching for the first time, get your resume reviewed & PUT IT THROUGH A PARSER.** Human feedback is definitely the first step, but after you quantify your descriptions and find a good layout, put your resume through a site like [jobscan.co](https://jobscan.co), VMock (offered by some schools' career centers), or even the few student-made parsers I've seen on this subreddit to see if it accurately determines your major/experience etc from your resume.\n* **Studying for System Design? Use the** [System Design Primer](https://github.com/donnemartin/system-design-primer)**.** I didn't pay for Grokking, the primer had everything I needed to pass Asana's system design portion. If only I'd studied it for Hubspot...\n* **Remember, you only need one offer.** It was definitely discouraging to me as an underclassman when I saw people picking between every FAANG and Citadel, but remember if you're starting out, all you need is that first company to give you a chance. Having choices is great (and sometimes scary) but even a single offer & nothing else can open a LOT of doors moving forward, so once you get that first offer letter, pat yourself on the back! You made it through a bunch of filtering to get there, and now the only direction you can go is even higher :)\n\nIf you've made it this far, you may be wondering **which offer I accepted** \\-- I'm not gonna take up any more space on this post, so **check out my flair on this subreddit for your answer ;)**\n\nBesides that, if anyone has questions about anything related to internship or full time recruiting/handling offers/my experiences/etc, **feel free to ask in the comments and I'll be answering as many as I can!** Since I've gotten 17 offers total in my time at college, I've pretty much done it all at this point so I want to give back and help all of you out too :D thanks for reading!\n\n\\--\n\nBrief Edit: After signing my offer this morning I accidentally walked straight into a trash can on the way to class; the comments about trash cans are all my friends hahah\n\nEdit 2: I've been told that the CEO & founder of CodePath reposted this Reddit post on his LinkedIn, which is so unexpected but also very cool. If you're coming from there, hello!",
        "permalink": "/r/csMajors/comments/q8qbqg/i_got_7_new_grad_offers_the_sequel_and_tips_that/",
        "comments": [
            "[deleted]",
            "Congratulations 🐐",
            "You missed the part where you walked into a trash can",
            "Congrats!",
            "[deleted]",
            "Hey I also go to said large state school. Ive seen your username before Bc you’re pretty active on the school subreddit. Anyways congrats!",
            "[deleted]",
            "How'd that trash can taste",
            "First of all, congratulations, well done! Take a moment to pat yourself on the back because everybody knows none of this is easy work.\n\nI wanted to ask a couple Q's tho. I'm currently applying for my 2nd internship, but so far it's not going anywhere. I've gotten a few OAs, did pretty alright, but haven't heard back.  It's been a couple weeks since my last OA, so could this just be the application process taking its sweet time, or can I just assume that it's a no?\n\nAlso, what would you say helped you stand out? I'm heavily involved in clubs, research, projects (also a PM for my uni's coding club), but it feels like I just can't compete with these people sometimes. \n\nDon't feel pressured to respond, I'm sure you must be busy, but thanks again anyway for you story! Fills me with hope lol!",
            "Is there anyway for us to deal with the Microsoft situation where you are right but the interviewer is being an asshole",
            "TC?",
            "Congratulations! Sounds like you worked really hard and got a super cool set of offers from it!\n\n&#x200B;\n\nBut yeah, as another new grad who had pretty good luck this recruiting cycle, all this advice is spot on, I definitely agree. For example, a recruiter I had previously worked with switched to a series C unicorn, and it just took an email for her to respond within the day and send over a coding challenge. For systems design, the primer is suuuch a good resource, especially if you can fill in the gaps with general knowledge + distributed systems + database classes. Thanks so much for writing this up, I hope it helps a lot of people!",
            "Congrats! Could you please share your resume or the template that you used?",
            "> During my VMWare final interviews, one round was entirely systems/OS/networking questions. I'd never taken a systems class in my entire college career. Even though I answered \"I don't know\" to every question, and had to explain why I didn't take Systems/OS to the interviewer, I still got the offer somehow?\n\nI've heard this from multiple different people now. I wonder why they even bother asking those questions lol",
            "I was just curious if you don't mind sharing, what did the timeline look like for IBM?  I aced the OA but have been waiting for a while for them to get back to me.",
            "Did you do this... during your senior year?? Or did you take time off to go full-time on interviewing?",
            "I also interned at Amex! And I also closed the google OA after seeing the questions. I knew I wouldn’t be able to do their next round and that it takes forever. Thanks for the post and congrats on the offers - helping me power through the full time search!",
            "Did companies or interviewers judge/Reject you because you were a BA in CS grad?",
            "Do you by any chance have a list of the leetcode problems that were assigned from codepath? I couldn't get into this fall session :(",
            "Congrats and thanks so much for sharing! I'm currently a junior and I'm incredibly stressed over the process as I really want to find the \"perfect\" internship that I can potentially get a return offer for to save myself the \"trouble\" of doing new grad offers for. Makes me more keen on taking something that interests me this year instead of the \"ideal\" internship. Congrats again!",
            "Ru gang \n\n#RuRahRah\n\nCongrats tho",
            "Remind me! 2 months",
            "How many companies had a System Design Interview portion? Is it common? Is studying System Design mandatory for new grad SWE roles?",
            ">During my VMWare final interviews, one round was entirely systems/OS/networking questions. I'd never taken a systems class in my entire college career. Even though I answered \"I don't know\" to every question, and had to explain why I didn't take Systems/OS to the interviewer, I still got the offer somehow?\n\nBecause from your CV and if they google you, it's very likely they can see you have the skills to quickly learn.\n\nAnd having someone who is honest on a team is an extreme plus. Think about how resources can be saved if that person gives accurate information regarding what he feels comfortable with or not. Having someone who says \"I can do it all\", waste time trying to do something they knew they couldn't do and then having to call in someone else to help them is waaay worse than just saying \"I need help with this/training for this\" from the get go.",
            "can you edit the op with TC for all offers?",
            "this sub is a bit egocentric. comments are just a selfjerk jfc lol",
            "This is some bullshit. I’ve done so much leetcode to the point where I feel like I’m that GUY, grad with 2 internships but still can’t bag shit like this. Im happy tho.",
            "Curious - do you think your resume reject rate was low because you are from an under-represented group?",
            "What’s this trash can everyone’s referring to? Lol",
            "Congrats! This is super impressive",
            "[deleted]",
            "\"My INTERVIEWERS insisted that my solution was wrong.. When it was right..the code run WITH CORRECT OUTPUT\" lol maybe the interviewers think that ur code sucks and inefficient, just because it runs doesn't mean it's correct. You really think HIGHLY of yourself no? U have 0 professional experience and u thought ur better than the interviewers? Wtf",
            "Is systems design standard for new grad interviews? I have some coming up but didn't realize that was expected.",
            "where will Asana be based?",
            "Congrats on the offers! I have my final interview for Asana coming up. I sent you a private message about the process if you don’t mind answering",
            "I want to reach out to my school alumni to ask for referrals, but I’m not sure if I should apply first then ask for a referral or not apply before receiving a referral since some places send you a specific app link.",
            "First of all, congratulations! Could you tell me a little bit more about Facebook's ABCS program? I can't seem to find an application page or portal; does it open at a certain time of year? Thanks!",
            "Could you talk about how to be best prepared for MSFT given your experience? And while I have you, what type questions were asked? LC mids, system design, behavioral?",
            "How did you evaluate the companies and choose which offer to go with? I am in the mid-west where companies are all paying similar from the start. With everything looking the same its hard to make a decision.",
            "Congrats on your success! Would you mind sharing what your Asana onsite was like? what difficulty should I expect? I'm pretty interested in Asana as well. Thanks!!!",
            "Thanks for the post. I hope more people could see this (hope i saw it earlier)",
            "damn ty some tips here are very useful"
        ]
    },
    {
        "post_id": "hwf0ps",
        "author": "DrJoshBastean",
        "title": "Free Full-Stack (HTML/CSS/JS, Node/Express/MongoDB) Web Dev Course",
        "url": "https://www.reddit.com/r/csMajors/comments/hwf0ps/free_fullstack_htmlcssjs_nodeexpressmongodb_web/",
        "score": 409,
        "num_comments": 45,
        "created_utc": 1595508398.0,
        "selftext": "Hello everyone,\n\nI’m Dr. Josh Bastean, and I teach web development and education courses at Coker University. With all the recent insanity, all our courses have moved online. I am in the process of recording the entire content of my Modern Web Development course, and decided to go ahead and post the videos on YouTube, hoping to help more people learn the joys of web development.\n\nI posted about this a few months ago and had lots of great feedback, so I wanted to reach out again to hopefully help anyone who hasn't already seen it.\n\n[Click here](https://docs.google.com/document/d/1fOmsPg4YcdQLREdVWi1Fb04esgmMzarL2Dcux6v27n8/edit) for a brief overview (aka \"syllabus\").\n\n[Click here](https://www.youtube.com/playlist?list=PLQSmIhc0GVPPhpBAC3y6xChtOz3RJ8abN) for a link to the YouTube playlist.\n\nI have already uploaded about 2/3 of the total course videos, and will continue to upload new ones as I complete them. As of right now, I’ve covered all of the front-end and started on back-end with Node.js, Express, EJS, and APIs. I'm currently working on the videos that start the final project (which we build over the last several weeks of the course): a \"Yelp Clone\" website focused on the topic of your choice. I'm doing Comic Books, but pick something you enjoy. We'll be adding MongoDB, Passport, EJS-Flash, pushing our code to Github, and deploying to Heroku.\n\nI hope this helps a few people learn to love programming as much as I do. I started by watching these types of videos, and I wanted to pay it forward to the next generation.\n\n[Here's the original post](https://www.reddit.com/r/csMajors/comments/fxxvyl/free_fullstack_htmlcssjs_nodeexpressmongodb_web/) for anyone interested.",
        "permalink": "/r/csMajors/comments/hwf0ps/free_fullstack_htmlcssjs_nodeexpressmongodb_web/",
        "comments": [
            ">I’m Dr. Josh Bastean\n\nUsername checks out",
            "Thank you for sharing. This is the first time I found out about this.",
            "You're a hero.",
            "This is absolutely great, thank you for your effort!",
            "If we start the course at a later date, can we still do the final project?",
            "Will you cover a front end framework like vue/react/angular?",
            "If you have time, could you also include where to go after finishing this course? I.e. more advanced tutorials, other frameworks, good youtubers/websites etc. only if you have time though!",
            "Thank you so much for the resources. I am learning Web development already and this will be an added value.",
            "Definitely going to check this out, cheers mate.",
            "thank you joshua started running through the course around the backend men stack love your level of detail and macro level teaching style. Super appreciative this deserves alot more attention",
            "Thanks you! I will definitely look in to this.",
            "Based",
            "Thank you! I'm just doing a MERN project, will take a look at the course!",
            "Thank you kind sir!",
            "This is amazing! Thank you for doing this!",
            "I glanced over the the syllabus and the playlist, looks very well organized and easy to find topics. I'm excited to start this weekend.\n\nThank you!",
            "I clicked on the playlist to save it, turns I already have it from your last post, but I've procrastinated on using it at all >.<",
            "Thank you! This is awesome.",
            "This is the most amazing thing I've ever seen. The whole course is so well structured. Each and every video has a cool background music which makes the learning more fun. The way you simplify things is just amazing. I've been meaning to learn Web dev for a long time but I can't start till Feb of next year. But this is for sure that I'm going to use this course to learn Web dev. Also, I've downloaded the whole course from youtube so that I can get a reminder next year. Thank you so much sir \n\nP.S. I really liked the National Science festival video at the beginning. This made me realise that we shouldn't take internet for granted.\nAlso, I hope that you release your upcoming videos soon.",
            "just started, and i already like your teaching style better than other web dev courses out there. i'm hopeful and grateful!",
            "Will these videos help a beginner?",
            "Will these videos be up forever?",
            "!RemindMe 2 days",
            "Guys, a LOT of this content is copied from the Web Developer Bootcamp by Colt Steele on Udemy, which I’m currently taking.",
            "I'm trying to talk about the final project in the Projects section of my resume as something that I will be working on during the time of application to internships. Due to my lack of exposure to full-stack/web dev in the past, I'm really unsure of how to talk about the project, what to call it, what bullet points to put. Could you offer an example/some advice of how you would list it on a resume? I'm choosing to do the topic of hiking trails. Thank you!"
        ]
    },
    {
        "post_id": "1ap6kwv",
        "author": "Fanuxiko",
        "title": "Applied for an Internship in Germany, they asked my transcript. Cries with 2.5 GPA 🥲",
        "url": "https://i.redd.it/utaxc1xq37ic1.jpeg",
        "score": 406,
        "num_comments": 71,
        "created_utc": 1707761506.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1ap6kwv/applied_for_an_internship_in_germany_they_asked/",
        "comments": [
            "Remember that in Germany, lower is better.\n\n(a 1.0 is the best score there, and a 6 I think is the worst)",
            "I’ve gotten an internship with a bad GPA even after they asked me for my transcript. Hope isn’t lost",
            "Same thing happened to me in Switzerland. They were \"very interested in my profile\" and rejected me before any interview despite having a 3.7 GPA.",
            "Im sad that gpa defines our future 🥲",
            "2.5? My brother, what are you doing?",
            "Might not matter, just submit it.",
            "Welcome to the rest of the world where C gets you a degree but not a job",
            "Where you can find internship in Germany ?",
            "What is the name of the company you applied for?",
            "yav anasini sikeyim benim de ortalamam 1.6/4.0, ortalama soran oluursa adamlar beni elemiyor ben kendimi eliyorum, ortalama sormayan olursa mulakata girebiliyoruz en azindan",
            "photoshop",
            "How the hell did you manage to have a 2.5 gpa? Have you done your exams in your sleep?",
            "[deleted]",
            "ima be honest i have a similar gpa and am planning to apply to an internship soon. Do you think that i will be able to get one? Let me know if your gpa matter op."
        ]
    },
    {
        "post_id": "17x82cz",
        "author": "jayjay2433",
        "title": "Cold messaging might be a cheat code",
        "url": "https://www.reddit.com/r/csMajors/comments/17x82cz/cold_messaging_might_be_a_cheat_code/",
        "score": 406,
        "num_comments": 79,
        "created_utc": 1700199345.0,
        "selftext": "Applied to Microsoft last year and got ghosted. Applied this September and didn’t hear anything. Got inspired by my friends to cold message on LinkedIn. Messaged about 10 recruiters a copy and pasted message. Got invited to an interview the next day. Similar story with meta only I didn’t apply that long ago and the turnaround was quicker. The recruiter I messaged actually responded in less than an hour, and I got an email for a screening the same day. This all took place in about a 2 hour timeframe. My resume is ok but not special, interned at a consulting company last summer and I go to a T20-ish school.",
        "permalink": "/r/csMajors/comments/17x82cz/cold_messaging_might_be_a_cheat_code/",
        "comments": [
            "Honestly though I’ve tried this but uh, think you had your luck w recruiters!!",
            "patched by now i’ve sent hella recruiter messages all ghosted prolly too many ppl reaching out",
            "I tried to do that and they just ignored my messages on linkedin lol",
            "Luck favours the brave. They call it job hunting for a reason!\nLove this. Thanks for sharing. Did you get an offer from anywhere yet? Good job hunting!",
            "Do u try to chat with them a bit first or just staight up ask for next steps? Do u send ur resume within the first message?",
            "is it too late to do this for microsoft rn?",
            "How did you search for these recruiters? literally \"Microsoft SWE Intern Recruiter\" and pick the top ones or?",
            "don't they charge money nowadays to add custom message on LinkedIn?",
            "could u pls tell me what internship role this is? and when did u apply?",
            "I think it's a good time for this. Companies are hiring but they've fired all their recruiters.",
            "Can you share the message you sent? Just wanna get an idea",
            "I think this works depending on the culture of companies.",
            "What's the message u sent?",
            "Wait u got an OA for meta 2024 SWE internship?",
            "Do you mind if I DM you?",
            "could you share a template of what you sent them? I feel like my cold messaging methods aren't good enough...",
            "How to find recruiters",
            "New grad?",
            "You were probably good looking. Never worked for me.",
            "I have some lucks with this approach too, but it’s not something sustainable.",
            "Yo can I pm?",
            "Hey by anychance can I see your resume and know more details about how you cold messaged them? Thank you",
            "Wats the message u sent",
            "How do you find the recruiters?",
            "I got an interview (which I failed) by looking up a recruiter of that company on LinkedIn and sending an email to firstname.lastname@companyname.com",
            "[deleted]",
            "Would appreciate if you share the cold message",
            "Are you a US citizen ?",
            "Are you masters or international?"
        ]
    },
    {
        "post_id": "wu2roz",
        "author": "Shot-Confusion1165",
        "title": "Workday is the literal worst",
        "url": "https://www.reddit.com/r/csMajors/comments/wu2roz/workday_is_the_literal_worst/",
        "score": 404,
        "num_comments": 67,
        "created_utc": 1661096962.0,
        "selftext": "Whenever I see a job app through workday I almost wanna not apply.",
        "permalink": "/r/csMajors/comments/wu2roz/workday_is_the_literal_worst/",
        "comments": [
            "I have like thirty different organization accounts. Wish I could have a main one and use it to apply to any company that uses it",
            "Facts",
            "Facts that’s how I filter my decisions on whether  to apply or not",
            "I don't get it. Workday is so shit, even for internal employee use, and yet it's the most common platform I see. Is it because it's dirt cheap or something?",
            "the workday interns reading this: 🥸🥸🥸🥸",
            "Worst is Taleo. Never got an interview for any company I applied to that used them. Mostly old companies like Cisco, Oracle, and Bank of the West.",
            "That’s the point. It sucks so less people apply, less spam to sift through. Big brain strats",
            "simplify. jobs makes it easy",
            "[deleted]",
            "For real, there have been jobs that I didn't apply for because I couldn't deal with another workday application. The devs who built it should be banned from working in the entire industry.",
            "You must have been reading my mind. I was on LinkedIn just now and guess what pops what: workday. Another one is guesthouse. This is crazy. It's so time consuming.",
            "I use workday everyday for invoicing, it’s just copy and paste for me. So easy. Just the reporting part is a problem for me.",
            "My work uses it, can confirm its garbage.",
            "I'll switch industries before I touch that garbage",
            "No literally when the page takes me to workday im like yeah im not making my 70th account",
            "Have you tried [Simplify](https://chrome.google.com/webstore/detail/simplify-%E2%80%93-autofill-your/pbanhockgagggenencehbnadejlgchfc)? Doesn't solve the account creation but autofills most of the questions.",
            "is it that bad?  I only look at it when I need to get a pay stub, and it seems to work OK for that.",
            "As a workday dev, fuck workday. I can’t wait to get a job writing real code 😭",
            "what’s so bad about it? it’s been pretty straightforward in my experience",
            "What do you mean with workday? What is it?",
            "I second it, its the worst",
            "Workday sucks!",
            "Fr like let me apply w out creating account lol",
            "I like it, but have never used it to apply for jobs.  At my company, I use it to track vacation days, check out the org chart, on-line training, performance reviews and time reporting (I work on multiple projects and have charge time to each one individually).\n\nNever had an issue.",
            "Workday is also the general HR site for the company I'll be at after graduating........",
            "Greenhouse.io FTW",
            "It's my first time using it and last week it was \"in progress \" ... I tried emailing the HR and manager who interviewed me for feedback and NOTHING... that's nearly 2 weeks ago. Went to check this morning and it says \"declined\" .... why can't people just communicate and tell me where I went wrong."
        ]
    },
    {
        "post_id": "17o3mb5",
        "author": "pioverpie",
        "title": "My internship hunt as a second year in Australia",
        "url": "https://i.redd.it/9nzkzmynagyb1.png",
        "score": 405,
        "num_comments": 90,
        "created_utc": 1699155977.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17o3mb5/my_internship_hunt_as_a_second_year_in_australia/",
        "comments": [
            "A 50% interview rate is unheard of, good work dude! 👍",
            "Rather be without an internship than Australian, but congrats",
            "Congratulations!\nWhich Programme/Tool did you use to make the Diagramme?",
            "This is crazzyyyy!!!!!\n\nI've applied to countless roles and I haven't even had the chance to interview. lol\n\n&#x200B;\n\nCongrats mahn!!!!",
            "'Grats on your success mate! Im also an Aussie, looking to soon break into a cs related internship. How much experience did you have before getting the role? Any notable projects?",
            "Hey man, im a second year cs student as well. You mind telling me what you did to get the internship, perhaps your project or leetcode?",
            "me about to enter my 3rd year in Feb 2024 with no internships 🤲",
            "I feel like my post of my small internship post went viral so now everyone is coming out with theirs. Seems to be more common than everyone thinks.",
            "Moving to Australia now, gg",
            "Hi, are you a international student or domestic student? And do you think that it is possible for a international student to get a internship in Australia?",
            "I guess it’s one of the consulting practices. Either way, you did well congrats",
            "Were any of the applications for remote roles?",
            "[deleted]",
            "Hey man, im rlly interested to know more about the applications you made and resources you use. My close relative has been trying to find something as an inter grad there but no luck so far. Huge congrats btw!",
            "What university courses are you studying?",
            "Wtf",
            "Always been interested in Australia, what does the pay out there look like for SWE internships and post grad jobs",
            "Can I see your resume?",
            "Love to see your resume if possible 👉🏽👈🏽"
        ]
    }
]