[
    {
        "post_id": "w5j9lw",
        "author": "PixelSteel",
        "title": "Internships that offer less than $15/hr should not require OAs",
        "url": "https://www.reddit.com/r/csMajors/comments/w5j9lw/internships_that_offer_less_than_15hr_should_not/",
        "score": 408,
        "num_comments": 61,
        "created_utc": 1658518524.0,
        "selftext": "I've had one internship so far in my past 3 years as a CS major student. It was $15/hr with no online assessment. The internship was entirely in C#/.NET. I keep on seeing these internship applications in Indeed and Glassdoor that offer *$10/hr* and require you to do a 30 minute-long online assessment, a cover letter, and previous internship experience. This is mostly a shitpost since I'm talking about just my experience, but I feel like internships that offer less than $15/hr should not require an OA.",
        "permalink": "/r/csMajors/comments/w5j9lw/internships_that_offer_less_than_15hr_should_not/",
        "comments": [
            "Yeah lol, I had an internship that paid $11/hour and the interview (there was just one single interview) was literally just Fizzbuzz and a couple of basic Java questions. The guy interviewing me seemed to know that beggars can't be choosers. After I answered everything correctly, he gave me a tour of the office and all but offered me the job on the spot. It was actually a really positive internship experience. Everyone was really nice and they were genuinely invested in my learning and growing. You'd expect a place that underpays employees to be extremely toxic, but they were just severely underfunded and couldn't afford more. \n\nI think you can differentiate between toxic and non-toxic places like this. If they pay shitty but are self-aware about it, you're likely to have a better experience. The person you report to as an intern is unlikely to have anything to do with salaries, anyway.",
            "I get paid $26/hr and I didn't have to do an OA.",
            "lol i applied to some company to intern *for free* and no joke they sent me like a massive application and 5 coding projects or something",
            "I get paid 30/hr and the interview was literally:\n“Do you know SQL and Python?”\n“Yes”\n“Great when can you start?”",
            "This shouldn’t be a shitpost lol",
            "You guys are getting paid?",
            "I see your $15/hour and I'll raise you another fifteen.",
            "Yeah currently doing internship at fortune100 top5 insurance company at 24/hr no oa mostly using .net c# sql",
            "$36 an hour and housing/living stipend with no OA for me currently",
            "Internship that pays less than $15 should not be an internship",
            "$48 plus relocation pkg and was asked something easier than two sum one lol",
            "Yeah that is absurd, lucky I think those are exceptions and definitely not the rule.",
            "My $30/hr internship didn't have an OA but had 3 technical rounds tho",
            "[deleted]",
            "36/hr and remote with no oa lol",
            "[deleted]",
            "luckily i haven't had to do any OA or technicals yet haha. somehow landed 34/h! \n\ni would feel scammed to have to do takehomes or OA for 11/h .  maybe not so much scammed but like, the nerve of these companies! if you wanna be picky, pay us more xD",
            "My best no OA internship offer was from a finance firm. Got paid around 32 CAD per hour.",
            "Yeah thats ridiculous if they do, at that point its minimum wage",
            "Paid intership? Is this the future? How many years was I asleep?",
            "A living wage is $23 an hour at minimum. Otherwise I agree.\n\nIn other threads women are sharing they are cancelling their plans to have families because if you get sick or injured they are withholding medical treatments. So now it's too expensive to live safely. They ought to consider that civil impact.",
            "[deleted]",
            "Who tf is paying less than $15/hr",
            "I had 2 entry interviews, the second one was a task that took me about 5 hours to complete. They pay me 7.5€/hour, but said I will get a raise after 3 months."
        ]
    },
    {
        "post_id": "1az1pjq",
        "author": "Jokerlikestojoke",
        "title": "Thoughts on this guys opinion?",
        "url": "https://i.redd.it/kwr0fe5uukkc1.jpeg",
        "score": 405,
        "num_comments": 139,
        "created_utc": 1708799700.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1az1pjq/thoughts_on_this_guys_opinion/",
        "comments": [
            "Lol vast majority of CS majors are not cut out for sales",
            "Main difference is when you’re working on commission, you could make anywhere from minimum wage to hundreds of thousands of dollars. You’ve gotta be a certain kind of person to make “a killing” in sales, and it’s partially the kind of person who’s willing to always be working and ready to be drained/stressed. As a decent engineer, you can get to a similar figure (~300k+) given some extra time, but you get a consistent salary every single month, can completely switch off outside your work hours and probably enjoy some really cool benefits or lucrative stock options.",
            "This guy better be careful. In a few years everyone will start asking leetsales questions.",
            "Most salesman aren't making 500k a year, and most engineers aren't making 500k a year. Reddit is a place of extreme survivorship bias and you will read far more success stories than failures.",
            "He's obviously a smart and successful guy, but plenty of 30 year old software engineers make 250-500k+(and a higher proportion than salesmen)\n\nThe average CS major doesn't have the social skills to be super successful at sales anyway.",
            "Lol the average cs major would fail horribly at being a salesperson",
            "Do you guys believe that all jobs related to a CS degree are getting harder to get into as new grads/college students or just SWE, front and backend jobs?",
            "You need to have a certain level of greasiness in your soul to work sales. Maybe you’re not an outright liar, but more than willing to bend the truth and over hype and under deliver and walk away. You don’t get job satisfaction other than the money you earn from sales. You are also shown the door very quickly if you don’t exceed expectations.",
            "If it sounds too good to be true, it often is.",
            "Going cs is not the only way to make money. In fact it seems now that the economy is so oversaturated w swe engineers that studying cs might not even be beneficial anymore",
            "So…what I’m hearing here is that his company rips people off and pays him the boocoo bucks to do it?",
            "Sure if you’re the world’s greatest bullshit artist you can make great dough as a sales guy. If you’re super hot you can do the same as a saleswoman. \n\nIf you’re smelly Brett or incel Arpu though you aren’t going to make $500k in sales.",
            "My thoughts ?\nShould I send a dm to ask if he's hiring? 🤔",
            "He’s correct because he says with the right everything",
            "Never understood how/why some sales positions make so much, but they must be moving units/product to do so.",
            "Average CS major has no charisma",
            "Not a CSMajor I don't know why this sub comes up so often but I did do sales for 4 months. It's very true you can succeed off nothing, guys came in with science backgrounds, engineering, etc. I came out of highschool and some guy was from a warehouse, he was one of the top performers selling well over 6 figures a year. But he didn't make 6 figures, it is very difficult. I got really invested in learning off the top sellers and when I found out they were just socially engineering people into buying what they don't need, I lost a lot of fire I had from YouTube videos being like, \"find win/win solutions, sell the solutions to people's problems\". If you can turn off your conscious, be charming and call people 10hrs a day you'll make money. And most people you call, don't want to hear from you. Even if you can actually help them, they'll still cuss you out. I didn't like it as a career. Maybe if I sold a better product I'd change my mind on it.",
            "After 6 years in my CS career, I was making $350k. In part, I'm this successful because of strong professional people skills.\n\nIn the second year of my (former) girlfriend's tech sales job, she made over $400k.\n\nI can absolutely confirm she could have learned to code much easier than I could have gone into sales - the kind of people good at this kind of work are _very_ not cut out for sales.",
            "if you’re a top salesman, you’ll make the most in the company. Thats just the reality because that’s the risk/reward. Most people don’t succeed at that level because it truly does take the most out of someone to excel, and a bunch of timing and luck.",
            "As a business owner who used to work with sales and marketing. My dad has often said that people in sales can never manage money. I wonder how much of the 500k that guy is actually saving lol.",
            "In Kenya and 19 which sales team should I get into...anyone have a clue on what the next bubble might be?",
            "You can’t teach soft skills/charisma. You either have it or you don’t.",
            "For every salesman making a killing there's probably several hundred making poverty wages",
            "I did a CCNA then switched to sales.\n\nI'm now 10 years deep. The problem is that whilst you are yes, in control of your own earning power, sales people are the first to be hired and first to be fired, and ageism is rife if you don't enter, or don't want to enter, management.",
            "I got into CS because I like to build cool stuff, not pester people all day to buy a product.",
            "[deleted]",
            "yeah i was it helpdesk for a small company and sat next to sales\n\nthey regularly talked about signing contracts they get commission on for like thousands of dollars each and the in office sales manager made hundreds of thousands of dollars a year and it was only a few years of it being her first job out of college\n\nand all they did was research their contacts and call them all day to make their pitch. sometimes not even having to come into the office or having a partial day unless there was a meeting\n\nmeanwhile i made a measly 40k… per year… 40hrs a week in office…",
            "You need to looksmaxx for sales.   \n\n\ncsmajors are more like looksminn",
            "that sales and programming is literal opposites. to switch to sales if you are a programmer will totally fail",
            "We're just believing random reddit accounts now?",
            "[deleted]",
            "offer frightening outgoing bow connect ad hoc cows thumb follow soup\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "My personality does not fit with sales so I don’t care how early and how much salesmen can make.",
            "I would never go into sales cause it seems too unstable. Like if I wanted to risk it all on a career I’d do something I actually like like art or music.",
            "Very true , sales always make the most profit if u are able to sell the thing",
            "can't imagine a more boring career",
            "Sales is a risky, hit or miss career. I haven’t heard many success stories. The comments here are right, most people are not cut out of for it.",
            ">I sell hurricane windows and will make >$500k this year\n\n[This guy](https://www.youtube.com/shorts/eKfvqgjZ7II)",
            "It is true that you can make a killing in sales, when combined with cs in tech salesyou can also have a level of product knowledge that will give you a good edge if you’re persistent. That being said there’s a reason the barrier to entry is so low, it’s a meat grinder. It can be learned but the road is fraught with rejection and many cannot handle that and they self eliminate.",
            "He's not wrong. But his success is not that easy accomplished and sales is cutthroat. It probably took him time to get a rolodex or he got hooks from others sales people who were established. People you pitch will not only judge, critic, and have something to say about whatever it is your selling, they'll do all the same to you. You have to have thick skin to do it and be ready to fail thousands of times over. Oh wait ? I do that now with trying to get my code to compile ? I get errors thousands of times, maybe I am cut out for sales ?",
            "Sales requires being able to fluently talk to people with effortless ease until they fall in love with ~~you~~ *your product* that you're selling, such that they *must* have it.\n\nIf we could do this, would we be in CS??",
            "Well I guess this is why insurance is unaffordable in FL. These hogs are greedy.",
            "If you're making career choices bases on some random dude's opinion, you're fucked anyway. Look up the mediqn average pay, working conditions and upward mobility for a given profession in your general area and make your decision based on that.",
            "He’s not wrong, sales will get you the most money a lot of the time but it requires strong communication skills, confidence, and the ability to build rapport with clients. Sadly most CS majors that I have met during University and while networking have piss poor soft skills…",
            "Not to knock on salespeople, but at least engineers and scientists are bettering the world through research and innovation",
            "He is right. Sales is one of the \"easiest\" ways to make money. But no all persons are good salesman",
            "Tried selling ADT D2D for 2 weeks, quickly discovered that constant rejection wasn’t good for my mental health",
            "Also if you’re someone really into technology, enough to go through a CS, why would this type of person ever WANT to do sales lol.  It’s like opposite personality.",
            "Sales is a separate skill and I rather blow my brains out than do sales."
        ]
    },
    {
        "post_id": "19ac3k3",
        "author": "Forward_Opinion6038",
        "title": "It’s 2024 stop applying to unpaid internships",
        "url": "https://www.reddit.com/gallery/19ac3k3",
        "score": 405,
        "num_comments": 56,
        "created_utc": 1705643790.0,
        "selftext": "You guys are not this desperate have some self respect \n\n\n2 years of experience 💀",
        "permalink": "/r/csMajors/comments/19ac3k3/its_2024_stop_applying_to_unpaid_internships/",
        "comments": [
            "Unpaid in San Jose🙏🙏",
            "lol, just apply then ghost. They seem to think all their applicants are worthless anyway if they don't pay them.",
            "I think you have to be stupid to apply to an unpaid internship but at the same time this is probably the year that I’m not suprised people are this desperate",
            "66 applicants 💀",
            "It's even more crazy that it's unpaid and requiring 1 year of related work experience. Surely that's not a hard requirement I imagine.",
            "Turing is a scam company either ways.",
            "Join the company then ‘rm -rf /‘ by accident",
            ">You guys are not this desperate\n\nInternational students who've applied to 1000s of jobs with no responses: 👁️👄👁️",
            "1. Create a startup\n2. Hire interns and let them pay for the internship \n3. Profit",
            "And I somehow even get rejected from that",
            "[deleted]",
            "Imagine taking up an unpaid internship in a place like San Jose.",
            "\"unpaid internships\" is just a fancy word for slavery",
            "Sadly a lot of people will be rejected for this opportunity.",
            "I would literally pay for an internship at this point. Whatever faang pays per hour, I would pay them just to have an opportunity",
            "The problem with unpaid/underpaid internships is their inherently classist nature. The problem with paid internships is a lot of interns are a net negative for the immediate line manager taking them on, but a critical component of a talent pipeline - not all leaders are smart enough to understand interns as investments in the future.",
            "This has to be a sign of trash tier companies innit?!?\n\nLike we can't even afford a salary. Why aren't they afraid it'll hurt their reputation?",
            "People applying are people who want a gateway to the US.",
            "We are this desperate man 😭",
            "[deleted]",
            ".............Is this even legal?",
            "The fact that they’re asking for a year of experience for a fucking unpaid internship is crazy.\n\nI MIGHT understand why you’d want to take an unpaid internship if you have absolutely no experience since that’s kinda the point of an unpaid internship. But if you’re asking for experience in an internship which is meant to give you experience with a field you have no experience in then there’s no point to taking the damn internship.",
            "Nah man. Fuck those 66 applicants. I hope they get unpaid internships so they can leave the paid ones for us. People that encourage this behavior should deserve it.",
            "You wouldn't get the lengths I'd go to get an internship at this rate of rejections I get.\n\nI'd pay money to get an internship.\n\nI'd sign a three year slavery contract to get one, it's not even about some bigass company, just the mediocre shit",
            "A lot of judgement here regarding unpaid internships. \n\nApplicants with internship experience will get more interviews than applicants without, on average. \n\nSo, if you have a paid internship, great! If you have nothing, in this current hiring environment, I think it would be disadvantageous to rule unpaid internships out.",
            "Supply and demand my friend. It is what it is",
            "Achsually, in order for these internships to be legal and not modern slavery, they need to contain a strong learning component. The company needs to prove to department of labor that you're learning from it and it's an educational thing otherwise it's illegal employment.",
            "I apply to them because I need an internship. If I get ANY other offer I plan on ghosting them. But if I don't I have something. \n\nAnd unless it's remote I ain't taking unpaid anywhere outside of my town.",
            "I thought this was illegal in CA now",
            "Who tf cares about a few thousand dollars. Experience is way more important."
        ]
    },
    {
        "post_id": "vukz28",
        "author": "None",
        "title": "y'all need to make your resume ATS-friendly",
        "url": "https://www.reddit.com/r/csMajors/comments/vukz28/yall_need_to_make_your_resume_atsfriendly/",
        "score": 402,
        "num_comments": 35,
        "created_utc": 1657314726.0,
        "selftext": "I see many \"I'm from a T20 school, have a 4.0 GPA, was one of the first guys Elon consulted about his space fantasies and did community service with Jesus to help thirty thousand peasants in Namibia how am I not getting a single interview?\" posts and then their resume is either just generic words like \"Built a chatbot that can chat\" on a Word document, or a straight up color wheel. \n\nKeep your formatting minimal, but consistent and purposeful. In most big companies no human is looking at them to appreciate your artistic sensibilities, until they pass through the software filter. Add more action verbs because the software picks up on them. Run it through an ATS website and get more personalized feedback. For each job listing, add specific tools and technologies the job listing is looking for. Don't put in more web dev skills than ML ones for an ML position.",
        "permalink": "/r/csMajors/comments/vukz28/yall_need_to_make_your_resume_atsfriendly/",
        "comments": [
            "Any suggestions for such websites? I've sent mine through a few but most of their responses are just full of bs.   \n\n\nOne even said my resume had the word 'software' only twice in my resume, and that a generic SWE description has 5, and put -8 or smth for that",
            "Yeah it’s fr ats. I didn’t even get OAs for my non ats resume. But as soon as I did, I got a bunch",
            "Use Jake's resume or awesome cv LaTeX templates, you guys can find these for free on overleaf. Literally the only templates you need.",
            "You guys can checkout resumeworded.com it's really good for resume review.",
            "I don’t think it’s about being ATS-friendly, but about being recruited-friendly. “Built a chatbot that can chat” wouldn’t get past a recruiter either.",
            "Chilllllllll let them find out on their own",
            "What’s a good score do you guys think? Mine was 77 before but I barely receive any interviews",
            "[deleted]",
            "Why you gotta be racist? You’ve never been to Namibia and def don’t know anything about it",
            "Interesting",
            "Use Markup Language like LaTeX"
        ]
    },
    {
        "post_id": "s8mhie",
        "author": "Am3ricanTrooper",
        "title": "No Internships Yet",
        "url": "https://www.reddit.com/r/csMajors/comments/s8mhie/no_internships_yet/",
        "score": 406,
        "num_comments": 69,
        "created_utc": 1642695209.0,
        "selftext": "There was a post 16hrs ago about how folks on here only post about getting into Amazon this, got an offer from Google that. \n\nSo here I am to be the anomaly, and flex, that I have had no success obtaining an internship...yet. \n\nFor everyone in the same boat as me, keep grinding or whatever it is kids say these days. Maybe start your own company? Either way keep hitting those reps and applying to places.",
        "permalink": "/r/csMajors/comments/s8mhie/no_internships_yet/",
        "comments": [
            "[deleted]",
            "Came here to say, no full time job offer yet!",
            "I graduated in December 2019. I only had one internship the summer after junior year and it paid me $11/hour, and I got the offer letter in late April. And then my first job out of college \"only\" paid me $70k.\n\nTBH I was satisfied with both of those things (it did suck only making $11/hour but experience is experience), but subreddits like this one definitely made me feel bad about it. Now that I'm two years post grad, I can say that the first job is absolutely the hardest, you become more employable with each year of experience, and you really are gonna be okay. The last time I job searched, I only put out about 5 resumes and managed to land an offer that paid really well (compared to what I was making before) and that I was really excited about. \n\nBack when I was an undergrad, I could barely even get my resume looked at by no-name companies. Now I have Google and Amazon recruiters constantly in my LinkedIn messages, begging me to apply for open roles.",
            "Someone should make a startup and just hire all the people on here looking for jobs",
            "I mean I get it. I literally just saw a cs freshman ask for a resume review with 3 or 4 internships alrady. Soon you're gonna need an internship before you finish middle school",
            "The Top 20% of the sub make the posts about faang internships while the rest of us bottom 80% squad chill in the comment section and wonder why it’s not going well for us.",
            "No internship yet for me either. Might do a masters if I don't have anything after i finish my undergrad.",
            "Imagine not having multiple offers from FAANG companies which you need to decide between. Clearly you're not cut out to be in cs.  /s",
            "150 applications and only 2 interviews and roughly 15 online assessments",
            "What city are you in and what year of school?",
            "  I recently got a job offer for the spring last week starting on January 31st but I didn't post about it since it wasn't FANG. I also got a summer internship offer aswell. Don't be discouraged keep on pushing",
            "I think the competition keeps on growing every year, especially the year after covid due to deferred admissions.\n\nI too haven’t got one yet, but think grinding is the only option left, just not losing hope until really actually over.",
            "I had none and got a full time offer from a reputed US-based data analytics company. My seniors are working at Amazon and Goldman Sachs and none of them had an internship at FAANG(or any notable internships for that matter). So I guess it all boils down to your skillset( Atleast in India )",
            "Never had an internship until AFTER graduation. \n\nStop looking in just California / on the coast for jobs. There are jobs for you ALL OVER THE PLACE. \n\nSTL, KC, Chicago, Indianapolis, Etc. There are jobs don’t let your pride/ego stop you from looking in uncommon places",
            "What a freaking goat. Tryna be like you 💯",
            "me either I am in the same boat",
            "Hire me pls",
            "I feel you. I’m in do-at-your-own pace program, projected graduation July 2023 if I do the minimum amount, but probably sooner. I’ll likely graduate without an internship because I just finished my DS&A 1 class and now I’m pregnant, due to give birth right as internships start this year. Unless I slow down and graduate later and manage to get an internship summer of next year (or happen to find somewhere this fall) I’m graduation with zero internships.",
            "Message me if you need some advice. I've been in that boat before. I'll review your resume",
            "I also bombed my interview today haha\n\nSo hard to land an internship...",
            "What stops you from posting the same stories?",
            "98 applications here, finally got an offer from M&T Bank for this summer",
            "98 applications here, finally got an offer from M&T Bank for this summer. Just keep trying",
            "Keep hope man! There is an offer for everybody here",
            "How important is an internship?  I am taking classes 2 a semester and just started this month.  This reddit is the only place I have heard of this."
        ]
    },
    {
        "post_id": "psteig",
        "author": "Nyoomx3",
        "title": "You're failing coding interviews because you can't communicate",
        "url": "https://www.reddit.com/r/csMajors/comments/psteig/youre_failing_coding_interviews_because_you_cant/",
        "score": 406,
        "num_comments": 66,
        "created_utc": 1632262110.0,
        "selftext": "STOP LEETCODING. It's not the reason you're failing your interviews. \nI'm a former Amazon SDE intern, FB UX consultant, and 2x Google SWE intern. If you still won't take my advice, you're just on here to complain.\n\nSo many CS majors don't have communication skills to explain their thinking while they code. You have to realize what your interviewer is thinking and adjust your communication appropriately.\n\nIllustrate your approach. Don't just solve the question:\n- ask clarification first to show you're thinking about edge cases\n- say what the brute force solution is to show you thought about other approaches and not just coding the first solution that comes to mind\n- explain what the optimal solution is before you start coding so it's easier for the interviewer to follow along.\n\nIf you can't solve it optimally, say that you KNOW it's not optimal and say what your guess is for an optimal solution approach.\n\nI've passed interviews without coding the optimal solution (LC hard, Google). I've failed interviews even thought my code was flawless (LC medium, Duolingo).\n\n\n\nFor the record, it's not \"luck\" I got into Google, Amazon, and FB. It's hard work, practice, and more side projects with different groups of friends than I can count. Make some friends instead of sitting at home all day.\n\nIn response to the post about school name recognition, I go to the University of Maryland. Smart, hard workers everywhere get into FAANG. The ones that don't work hard at ivies don't get in to FAANG. The dropout rate at ivy leagues is around the same as state schools because not-hard workers are everywhere, just like how smart hard workers are everywhere. Don't discount yourself :)\n\n\nEDIT:\nSome of y'all still aren't getting it. I'm not saying there isn't any luck involved, but \"getting unlucky\" is a rare occasion. After a long aggregate list of interviews, \"unlucky\" is not as commons as you might think. Here is where I've had technical interviews with:\nGoogle, FB, Amazon, Microsoft, Snapchat, Adobe, Salesforce, Morgan Stanley, Duolingo, IBM, Capital One, Target, Nordstrom Rack, Fannie Mae, Discover Credit, Leidos, NSA, + a number of startups",
        "permalink": "/r/csMajors/comments/psteig/youre_failing_coding_interviews_because_you_cant/",
        "comments": [
            "I despise Leetcode questions immensely, but you need to  pass a fucking OA for every fucking company nowadays, so you need to know how to solve those stupid questions to get a damn interview in the first place.",
            "Most people don't get interviews to begin with.",
            "I think the answer is not to stop leetcoding but rather practice vocalizing while leetcoding. Think out loud as if you were actually in an interview. Make sure to consider edge cases and clearly state any assumptions you’re making.",
            "My man I don't even clear the OAs. I definitely need to not stop leetcode, thanks for the advice.",
            "this is good advice. but i would add on that you need the leetcode/ds+algo side with communication on top. an extremely poor solution can't be covered up by good communication. a slightly less optimal one can be",
            "Leet coding definitely doesn’t apply the same kind of pressure as a timed interview where you need to make sure the interviewer needs to understand what you are doing. I will also ask questions in the middle to just see if that candidate can think on the spot. This subreddit should really offer up a way to match up people for live mock interviewers so people looking to practice can get real interviewers.",
            "Holy fuck this guy almost worked at all of FAANG omgomg am I talking to Aristotle himself? Plz share more of your wisdom",
            "Well Goodluck in OA",
            "You can still do leetcode, just actually vocalize what you’re doing as if you’re doing an interview when you do it",
            "Cool. I don't want to be a sociopath or adapt to your refusal to hire neurodivergent people. The more I research, the more it seems like working for big tech is extremely discriminative in all senses. Why can't you adapt your communication skills as well? I guess I still don't get it.",
            "Y’all need /r/antiwork",
            "[deleted]",
            "its both things. whenever I’ve failed an interview its been because i didn’t know how to do a question. on the other hand I know people who knew and didn’t conmunicate. you need to balance",
            "Oh, hi fellow UMD CS major",
            "I have my final technical interview tomorrow with Capital One and this post helped. I’d say communication while coding is a strong point of mine, so even if I don’t get the optimal solution or any solution at all at least I’ll be good in communication and personality.\n\nThank you bro for your encouraging words",
            "A great way to complement your Leetcode abilities is to practice writing! It’s hard, and not something many CS student have to deal with (or want to), but it absolutely helps your communication/soft skills. As you grow in your engineering career, you’ll realize that there’s a lot more to leadership/product/business roles than just the technical aspects. So go out there and be the writing monster; find every opportunity to write!",
            "Yo I go to UMD too, will work full time at Snap and currently interning at Facebook, is it fine if I DM you?",
            "Lol @ communication. Not saying it doesn’t matter but most of the time people get rejected due to not coming up with a ninja solution to a coding problem. And as the other person said it’s mostly luck anyways. No point having good communication if your interviewer is a dick and doesn’t want you to pass",
            "bruh, if you think LC is not important, you have been getting too lucky in your interviews. You still need to decently perform on the coding part. Not all interviewers will care if you can communicate properly if you cant do shit on the coding part. They are not hiring you for your communication, they want you to code too. If you have passed with brute force on all your rounds consider yourself lucky on those days. You haven't seen what others face then and are concluding based on your interviews. Anyways you do what you think is correct and I wish you all the best. The only way you can pass interviews today, is if you can code the solutions optimally and have a good background. With those 2 in mind, your communication would already be decent enough to move forward in the interviews. Stop having the mindset of only talking and talking will get you through every time.",
            "At least in my case, I’ve done toastmasters for 3 years now and I’ve always got got feedback about my communication skills both at internships and at mock and actual interviews. However I always fuck up one round in an onsite because the interviewer evidently hates me for whatever reason, and that’s why I never get an offer. I don’t mean to sound rude but there are tons of people in this industry who can’t communicate simple ideas to an audience. There’s just so much behind a hire decision that disproves your definitive statement. Again, just my opinion..",
            "It's almost like a lot of ppl drop out of college bc they can't afford it and not because they're dumb hmm",
            "I found this [coding interview cheatsheet](https://www.techinterviewhandbook.org/coding-interview-cheatsheet/) useful to accompany my leetcode practice and train me to verbalize a lot more. It covers what you should during coding interviews including when you should be communicating. \n\nThere's also another article on the site which covers rubrics and clearly indicates communication as one of the key criteria, so that can be useful for anyone needing it to take a look too.",
            "I just failed an interview because my code had a small and easily fixable logic issue. Communication was great. You have to be able to shit out production code with 0 mistakes while talking to someone else."
        ]
    },
    {
        "post_id": "oxxum4",
        "author": "fubo12",
        "title": "How are high school kids becoming competitive coders?",
        "url": "https://www.reddit.com/r/csMajors/comments/oxxum4/how_are_high_school_kids_becoming_competitive/",
        "score": 408,
        "num_comments": 106,
        "created_utc": 1628098505.0,
        "selftext": "In competitive coding, their easy questions are harder than leetcode hard 💀💀.\n\nWhen did they even learn ds/algo and then master those questions??? It takes college kids few years to take those classes and do hundreds of leetcode until they can do leetcode hard.\n\nDid they start in like elementary school ?💀 I have so many questions I don’t want to know the answer to.",
        "permalink": "/r/csMajors/comments/oxxum4/how_are_high_school_kids_becoming_competitive/",
        "comments": [
            "If you're the type of kid to have done math circles or math competitions, it's not a stretch that you'd also do programming competitions. Also we arbitrarily restrict certain topics as \"college level\". When you think about it, there's nothing stopping a high schooler from learning data structures and algorithms, or abstract algebra, or Haskell.",
            "Children are the best humans at learning crazy shit. What we teach kids in school is pretty useless. They have the ability at a young age to learn insane shit really easily, unlike once our brains have matured into adulthood. I casually learned a third language in high school, but I couldn’t do that again now.",
            "I did competitive programming in high school after picking up programming in middle school. There are a lot of smaller competitions that middle/high schoolers can do to get engaged in programming. I started programming in middle school (officially) while creating a cool game for a state/national competition called TSA.\n\nI started with fundamentals and worked my way up during middle school, and got good enough in hs. It does take awhile, and cp in hs is kinda toxic, but cs fundamentals like OOP and data structures aren't insanely difficult to master, even for college students who had no prior experience. After that, it's just practice and understanding of algorithms. Understanding what cases and data structures are applicable.\n\nDo you need to track indices? Hashmaps or pointers are efficient (albeit pointers are better in most cp cases). Need to solve a graph/tree/LL problem? You should be able to at least be able to traverse them, then write cases for them.\n\nJust as it takes college students years to master, it took me almost 5 years to be even competent enough to compete in things like Hack the Interview, and even longer for IOI. It's just practice and time, it doesn't matter when you get started, as long as you get started. Fuck people who are elitist about starting early and put people down for not doing so. It takes time and practice regardless.",
            "yeah actually a lot of the competitive programmers I know have been coding since they were 5! Literally I had a 10 year explain an advanced leet code hard to me like it was nothing… s/o the Asian parents honestly they set their kids up for success. (And a lot to the times I see it wasn’t super forced on them they just had resources and became interested from there) . My friend is 19 now but she started coding and hacking when she was 7.makes me sad sometimes I wish my parents were able to teach me all of this stuff when I was a kid, but eh childhood was fun too. And contrary to popular belief, these kids DID have a life as a kid, they just found perfect balance for everything ( a lot not all)",
            "Do high schools offer actual CS courses nowadays? My hs didnt have any cs courses but other schools did have intro to programming in Java. But from what I’m reading in the comments it seems like high schools are actually teaching DS&A now?",
            "probably the same way that young kids become chess grandmasters, no?",
            "This is just from my anecdotal experience but the kids I know that were competitive programmers didn't start at 5 but in high school. I'll just give some data points below\n\nFirst one took OOP + dsa in freshman year and self studied to usaco gold over 2 years till junior year. Not sure where his leetcode progress is since I haven't asked.\n\nSecond one took OOP + dsa sophomore year and self studied again to usaco gold till junior year and quit. He has around 200 lc solved and can knock out mediums out of the park and can do lc hards assuming the problem doesn't require some niche algo.\n\nThird one (me) took OOP junior year and self studied dsa junior year(took the actual class right now this summer when I graduated) so I couldn't do usaco + didn't want to do competitive programming so decided to build stuff in full stack JS. Currently I'm at ~100 grokking + leetcode questions (I couldn't do 2 sum before I started) and I don't shit myself now when doing a medium.\n\nEdit: The 2 guys above me have a lot more of a life than me right now as I'm currently a gremlin living inside my room.",
            "It's no different than competitive math/physics and to a lesser extent chemistry/biology. Most college students would not be able to solve problems which middle and highschoolers solve for those competitions either. I don't know why you think leetcode/competitive programming is somehow unique in its difficulty.",
            "Just wanted to offer my perspective as a competitive coder here. I first started participating in usaco contests my freshman year of high school and took the equivalent of dsa my sophomore year of high school, although solving practice usaco problems my freshman year essentially made me self-learn a ton of dsa concepts (binary search, bfs/dfs, hashmaps/treemaps, big-O, etc.) After that, all I really did was practice competitive programming problems and participate in contests on Codeforces to improve my general problem-solving skills.",
            "it usually starts with being good at competition math (AMC, AIME, etc). It gives a leg up in problem solving abilities and the math in general (mainly number theory and combinatorics)",
            "[deleted]",
            "I did competitive programming in HS and was fairly successful at it (e.g. top 10 in some national competitions). Generally the questions they asked were LC easy level questions and code quality was emphasized (unlike in competitive programming in college where the only thing that matters is speed of algorithm). I had taken coding classes with DS&A in 10th and 11th grade, and did some stuff outside of school, but not a whole lot. The questions just generally aren’t very difficult though in HS. Some competitions have hard questions, but that is the exception. Some students spend hours learning this stuff, but that is the exception - even with competitive HS coders",
            "They usually come from tech family backgrounds and have been bred to tame the Silicon Valley. There was a whole thing about kids coming from these backgrounds committing suicide because they’re overly pressured to excel academically in STEM. I know a few people like that from my time in university.",
            "I startes coding in elementary school, and had a web design company when I was in high school.\n\nI'm not a good coder, though.",
            "It’s parents just telling their kids about opportunities you were interested in but didn’t know existed.",
            "Dude I do competitive math and the things people struggled with in discrete math in college, I did those with ease in elementary school. Nothing is impossible when they are like the top 0.1%.",
            "i know one thing, this shit aint for me",
            "Kids pick up programming hella early these days. Sometimes I wished I did too, but fuck it I’m on my own path now.",
            "Learning comp sci is more accessible than ever. I started coding “later” than a lot of the prodigies, when I was around 12-13. I only discovered competitive coding late freshman year. For what it’s worth, I’m a rising high school senior and USACO gold now, so clearly me starting later wasn’t too big of an impediment.",
            "[removed]",
            "Feel bad for the kids who grew up doing this. Being a child, and in college, is the time to live life. Not code.",
            "I was actually dumb at that time and thus wasnt able to understand a whole lot of Things, even though i started coding in school",
            "It’s because they are high IQ. You need processing speed and fluid intelligence to be good at programming. They also start programming years earlier like around 4-7 years old",
            "Yes, in elementary school, in some schools they do code.org. Haha!",
            "Thats why i put 8 hour to studying everyday and its paying off. Just to be better everyday.",
            "Proof that high school could be college. Our true learning prime is much younger than most think.",
            "Man, I feel like the only person who had parents who *didnt* want their kid doing anything with computers because “all that’s going to be outsourced to India and you’re an idiot if you pursue it.”",
            "Grinding from birth these days",
            "I started doing competitive programming when I was 14, right after I learned basics of C++. Yes, it did take a lot of time (like few hours every day) to become really good at it, and eventually I won 1st place in my country and participated on the international olympiads.  \nIt was hard in the beginning especially because I didn't have anyone to help me with it, so I downloaded Competitive Programming 3 book (my number 1 resource) and Competitive Programmer's Handbook and it guided me really well. Later I started solving problems on HackerRank, Codeforces, Codechef, SPOJ etc. and that helped me to break through.",
            "All it really takes is time though? I started learning AP CS and going through USACO training pages summer of hs freshman year. Solved more than 100 problems and made it to the last chapter of training pages. Made it to gold division (highest at the time, before they introduced plat) junior year. But yeah you definitely have enough time in HS, even with balancing other activities... Just do you have the motivation?",
            "Grind LeetCode",
            "Well. I actually had a professor in college who had two kids. A 3 year old and 8 year old.\n\n Since I worked with her for lab. I would see her make her 8 year old do like high school physics problems and like basic programming concepts. It was so insane. Like the 8 year old was learning about python and stuff and learning about gravity, normal force, etc. Her husband I think worked in the Aerospace industry too.\n\nThe kid was learning about stuff I did in college/high school. While, I was probably watching cartoons and playing video games lol"
        ]
    },
    {
        "post_id": "mfme14",
        "author": "Chaoscontrol9999",
        "title": "Why do people think if you do CS you should know everything about technology",
        "url": "https://www.reddit.com/r/csMajors/comments/mfme14/why_do_people_think_if_you_do_cs_you_should_know/",
        "score": 407,
        "num_comments": 51,
        "created_utc": 1617013210.0,
        "selftext": "So we couldn’t get the TV to work yesterday and my friends turned to me saying I do computer science and don’t even know how to get the TV working\n\nIdk my parents do this too. Whenever their laptop or phone doesn’t work they say “YOU DO CS WHY CANT YOU DO IT”\n\nLike jeez I’m only a first year, chill out",
        "permalink": "/r/csMajors/comments/mfme14/why_do_people_think_if_you_do_cs_you_should_know/",
        "comments": [
            "I mean this is a common complaint that CS majors have but we probably spend far more time with computers than them so we probably know a bit more of troubleshooting than they do.",
            "I don’t know how to fix your printer. I don’t even know how to replace cartridge in a printer.",
            "Hahahahaha yeah that shit is funny. I'll help someone or fix their stuff if I feel like it but if it's anything to do with networking no chance.",
            "To be fair, we're better at searching Google than them, but apparently they can't discriminate between Google searcher and omniscient computer god",
            "People have no idea what CS is. They think it's fixing computers or the \"study of computers/technology\". It's similar to how people think if you major in psychology you can read minds or if you major in biology you can cure cancer. They think if you major in it, you're a master at it... even if the major has nothing to do with what they expect. In short: ignorance.",
            "[removed]",
            "The real problem is when you do actually know both. I worked in IT for 6 years (2 years in hs, 4 years in college part-time) before/during my CS degree, so I know a fair bit of the troubleshooting and general support side of things. It's awful, I have family calling me for the weirdest stuff. I hate every moment of it.",
            "Idk. My roommates were making fun of me the other day because i sucked with PowerPoint",
            "To add what other people on here have already said, I don’t think the layperson has any idea just how abstracted what we do is. It’s so far removed from hardware at this point, unless you are writing like low level embedded systems, you almost don’t need to know anything about how the hardware works, to the point where it’s essentially just applied mathematics. It’s off the hook if you think about it, and it makes sense why most people wouldn’t guess this.",
            "I had a professor once say during class: \"I can program embedded systems, not fix your computer.\" Now become my catch phrase.\n\n&#x200B;\n\nHell I still get this question: \"Oh computer science? Soooo whAt d0 yU pLaN on dOiNg wItH tHat?\" - bitch software development and make money, wtf do you think?\n\n&#x200B;\n\nPeople are so far detached from what CS and programming is really about.",
            "because almost everything is computerized and programmable. so CS can control everything...",
            "I feel where you're coming from. I remember being younger and thinking that engineers were \"people who were good with their hands\". I guess that's a similar argument. At this point, I'm not gonna blame people for assuming that CS majors are knowledgeable about technology. I mean, technology *is* kinda our thing.",
            "Because people who don't know this stuff ... don't know this stuff.",
            "Because most people know almost nothing about technology.\n\nI imagine it is similar for doctors.  Take your general practitioner.  They are probably asked every question you can think of.  They may have no specialization in the area, but they are *expected* to have some sort of knowledge.  \n\n&#x200B;\n\nSame with us: \"Why do I get these phishing emails?\"  I don't know doesn't really cut it for an answer.",
            "The same thing happens when someone asks me a mental math question then solves it first and says \"wow how do you pass all those math classes?\". Like sorry, you're faster at 5th-grade division I'm taking discrete math lol.",
            "This is how stupidly we evolve, that's the only reason...",
            "I love when my parents do it cause I’m just like “you really think that you guys are paying thousands of dollars in tuition so that I can learn how to troubleshoot your iPad?”",
            "Honestly the number of times I fix the home printer, is enough to make em feel like I’m a tech god.",
            "The same reason people want math majors to calculate the tip.",
            "During my first semester, my dad asked me what was the point of doing CS if I couldn’t find an email he permanently deleted.",
            "Because people outside of the industry don’t really know the extent of what cs people do. \n\nI experience this as an accountant whereas people believe that since I do accounting work, I’m supposed to know everything about every accounting subsection like tax while not all accounts do tax.",
            "Also why would I know how to troubleshoot YOUR tv? Like you think we take troubleshooting your tv classes? You think i have an internship with LG troubleshooting tvs?",
            "You have two options - Ignore those people or correct this assumption.",
            "This is really such a non-issue and highlights how socially inept most CS majors are.",
            "Good CS workers are good problem solvers and generally technically knowledgeable. At least it was the case in my generation. BS CS in 1989 and career in dev since that time. We had to build our own computers and solve lots of hardware issues on our own. We learned Fortran, Pascal (Modula 2), assembler / machine code (in multiple CPUs), etc. As I have grown in the industry and learned about every syntax in every language, I am surprised that many CS graduates do not go through the process of learning about the underpinnings of the systems they code on beyond theory. I am not saying that they make for bad employees, but there is an advantage to being a good software dev guy that understands memory management before there was garbage collection at a very detailed level. These guys figure out how to fix anything, they just hide in the shadows because they do not want to be bothered, have already made their money through two major tech explosions and would just rather pay someone else to solve problems now.",
            "Yeah it's annoying because people expect you to know a lot about technology, and you do know about, you can fix their printer because you're interested and take the time and think and search about how to do it. But when you do it it's expected, they dismiss your efforts 'cause you're in CS so it's natural. That's what annoys me the most about this stereotype.  \n  \nIn my mind, it's very similar to the asian stereotype where, if an asian kid is good in school, it's natural, their effort aren't rewarded in any way. However if the kid is at the same level as their peer, they're considered \"bad\" when they're really just normal",
            "I think every major has their version of their problem. Food science major are expected to be able to make people diet plans. Kids in law school are expected to help out with traffic tickets. People in engineering are expected to be able to fix things around the house. I think people havn't really digested how theoritical most degrees are. So, it's u study something related to this task that seems related so u should have these skills...",
            "Thank you for posting this. This made me glad that it’s a common concern. 😅I’m about to start my CS journey for a career change and would want to specialize on software and game development someday and this has been one of my worries as I had never been actually good at ‘computers’. Although, I started taking classes and really enjoyed my coding bootcamp. So I guess people just don’t really understand that CS is a general term for a very broad field. Similar in a way that you can’t expect me, a healthcare worker, whose knowledge and experience focused on adult medical to be a master of pediatrics too. I mean you’ll be familiar and may understand CS things easier and better than a non-CS person. Doesn’t mean you should be expected to have mastered or know enough of a field that broad...",
            "\"Computer Science is no more about computers than astronomy is about telescopes\"",
            "I mean jokes on them when you graduate with a six figure first job without ever having to know how to fix a tv lol"
        ]
    },
    {
        "post_id": "l4r4xa",
        "author": "kindlystfuu",
        "title": "My brain turned to mush",
        "url": "https://www.reddit.com/r/csMajors/comments/l4r4xa/my_brain_turned_to_mush/",
        "score": 404,
        "num_comments": 47,
        "created_utc": 1611591550.0,
        "selftext": "Took the Twitter hacker-rank, stared at it for 10 minutes, gave up and left the page, came back 5 min later, stared some more, wrote some dumb code for two questions and left the other two blank. \n\nIf you have felt burnt out from CS recently, you are not alone. These applications are killing me.",
        "permalink": "/r/csMajors/comments/l4r4xa/my_brain_turned_to_mush/",
        "comments": [
            "I didn't even get a chance to try :(  Never got OA.",
            "Twitters OA back when I took it a year ago was one of the hardest I'd ever encountered (I never went for any of them investment firms but I've heard those are on another level). \n\n&#x200B;\n\nPeople often don't realize that Twitter doesn't have a whole lot of other products other than their main platform, and maybe if you count their video streaming and ads platform. But they all tie into the main Twitter platform, so their overall eng. teams are much smaller than a Facebook or Amazon or Google who dabble in everything from VR, to Hypercomputing, to Clouds, to Google docs, to everything. \n\n&#x200B;\n\nBecause of this Twitter needs to weed much more people out and can be even pickier with their applicants. \n\n&#x200B;\n\nI graduated in May and can tell you that you will be okay, and its not the end of the world when you get RKO'd on an OA, or even in a final round, you'll encounter it a billion times. \n\n&#x200B;\n\nKeep your head up and don't let it get to you because there's 324092309454598043 other jobs out there. \n\n&#x200B;\n\nThis sub makes me sad most of the time tbh.",
            "If you're doing all nighters then stop, not sleeping lowers your iq",
            "I also felt bad for bombing Twitter OA and reading people post about how easy it was on this subreddit. Really made me feel shitty lol",
            "It is totally normal to feel that way. I believe productivity is more important than quantity, so take a break and come back stronger",
            "Aw I can totally relate, I've probably passed like 2 OAs my whole college career lmao! I actually didn't do the OA at all and still moved onto the interview stage. So it seems like they don't really care about the results?",
            "To those feeling bad about not passing the OA, I passed all the test cases for all four of them, still had 18 minutes left before I submitted AND didn't hear back from them. So, yeah. Honestly, I am not even mad at this point, I have done 134359 hacerranks and most of the time they don't revert.",
            "I literally did the same thing yesterday you’re not alone :( I passed exactly 2 test cases out of the whole exam! Thanks for the courage it takes to share a hard time",
            "I did it too, I'm pretty sure the last question was bugged lmao. I tried working out one of the test cases by hand and I'm 100% that I got the correct answer, but it wasn't what the test case said was correct.",
            "I also took this and honestly it was ridiculous. 4 questions of hard/complex problems to solve in 60 minutes. I also left 2 blank and could barely finish the other two. You are not alone so don't beat yourself up. I've also read somewhere on reddit that some of the hiring managers don't even care about these OA scores and that most of them choose from referrals. Which honestly just makes you wonder even more about the recruiting practices.",
            "Just took mine. Took me 5 minutes to even grasp what two of the questions were even asking for. Got 1 correct, wrote some shitty one down for another, and called it quits.",
            "Are there companies that don’t coding interviews instead take home projects? I’m exhausted from leet code I can’t do it anymore",
            "Unpopular opinion : twitter is not a company you'd want to work for. So is Amazon , google and FB. \n\nLong ass hours, shitty projects ( cuz you're a random new hire w.o actual skills , so they will probably put you on a team to work a button or something.) \n\nThe salary is nice but how many companies out there do you know offer parallel compensation?  Tons. \nSo don't sweat it honestly.",
            "I feel that so much man. I did this will 2-3 OA’s this season. :/",
            "Ah, well, fuck. I was just about to take this",
            "Lol there's just too many people going for those jobs.",
            "Had a very similar experience with Lyft's test"
        ]
    },
    {
        "post_id": "wbetnf",
        "author": "jptboy",
        "title": "Don't freak out about not getting f(m)aangmula, citadel, Jane street etc... internships/new grad",
        "url": "https://www.reddit.com/r/csMajors/comments/wbetnf/dont_freak_out_about_not_getting_fmaangmula/",
        "score": 401,
        "num_comments": 55,
        "created_utc": 1659126358.0,
        "selftext": "I have already graduated I did one internship in Microsoft SWE intern and another internship at a no name company and currently I work at tier 2 cloud company making 134k TC remote mcol 1 yoe and was making 160k in bay area but I moved. I remember when I failed the msft explore interview and the Amazon  SDE intern interview I was depressed as a sophomore. I managed to pass the Microsoft interview the next year. I also have always failed the Amazon final interview lol. \n\nIt's not the end of the world if you can't land one of these top internships or new grad positions. \n\nMultiple people have personally told me that this subreddit/cscq/blind is damaging their mental health seeing people achieve what they cant but desperately want.\n\nNews flash, even if you do no projects and just barely graduate you will find a job even if it's a crappy one. I know a guy who can barely code who got a job out of college for 80k. He can't even do a leetcode easy.\n\nOnce you get 2 to 3 years of experience at any company you can apply for SDE 2 roles at FAANG which there are way more of than intern or sde 1. I know a guy who finished his degree at 28 years old at a crappy college worked at a no-name crappy company for 2 years and now is a L3 at Google. \n\nYou can interview for SDE 2 and they might downlevel to sde 1 but you will still make it into FAANG. College isn't your only chance to do it. Some kids in college have told me they have depression seeing their friends get these internships. Never become depressed about this. \n\nYou are probably not even 21 yet and you have 30 to 40 years ahead of you to work and make money. If you can't get into FAANG at 20 you'll have hundreds of opportunities to get in at 22,23,24... Etc\n\nThe fact that you're doing computer science and going to college puts you at a better spot than 95% of people. My dad has 30 years of experience as an accountant yet my friend who barely knows how to code (he can't do leetcode easy) has the same salary as him at his first job. \n\nAnyways enjoy your college. Socialize with people and take care of your health. You're going to be grinding for another 20-30 years anyways.\n\nAlso somebody achieving one of these internships doesn't make them better than you by the way. Plenty of assholes in this industry who were not good at anything in their life except for coding/vidya that have a huge ego.",
        "permalink": "/r/csMajors/comments/wbetnf/dont_freak_out_about_not_getting_fmaangmula/",
        "comments": [
            "[deleted]",
            "Hardcore cope. If you don’t get a 200k+ job at 22 yo as a new grad you’re objectively a failure and your family should disown you",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "This sub really has people thinking if they don't get a 250k FAANG job right out of undergrad they are failures😂",
            ">My dad has 30 years of experience as an accountant yet my friend who barely knows how to code (he can't do leetcode easy) has the same salary as him at his first job.\n\nLol I've definitely heard stories about how snubbed people felt when they decided to pursue accounting as a career and then they realize the ROI on the work they put in was dogshit compared to CS.\n\nI dunno what your dad's career was like but typically a college accounting grad gets their first position at a public accounting firm where they're doing work for other companies. You'll get worked to the bone for 60+ hour weeks depending on your clients and the office and you're also expected to get the CPA which opens you up for further promotion.\n\nAll of that is for starting around $60,000 entry level.\n\nObviously though this is balanced out by the fact that accounting and business coursework is way less rigorous in general. The interviews for roles are literally just 2-3 behaviorals (unless something's changed that I don't know about). The career itself is very stable, pretty hard to be out of work if you didn't burn every bridge and did spend time building up your knowledge base.",
            "Bro, all I wanna say is in this economy, I wouldn’t wanna be someone without an internship/job offer",
            "You can do so much with a CS degree, it’s ridiculous people here get so caught up in wanting a job in FAANG. People gotta relax",
            "Cope",
            "[deleted]",
            "This is my new wallpaper",
            "What is f(m)aangmula?",
            "I'm only looking for a job that pays more than my student loans",
            "Why is this tagged as a shitpost",
            "Ok I won't",
            "Depressing over seeing others is never the way... I learned this now.... In this field luck matters so much, you're bound to get your share of luck",
            "lol I want my next project to be a version of /r/csMajors that exclusively has positive posts like this.",
            "Stop peddling this BS. You’re basically a failure if you only get into FAANG. It’s Jane Street or bust these days.\n\n/s",
            "yeah it’s never the end of the world in tech because of all the opportunities",
            "Vidya? Do you mean the Hindi word?",
            "Is there a reason you didn't return to microsoft for full time?",
            "I didn’t get any internships, barely passed college, and didn’t even really learn anything.\n\nEven I still got a job not too long after graduating.\n\nPoint being, CS is too widespread an applicable degree to be doomed just because you didn’t excel in college.",
            "[deleted]"
        ]
    }
]