[
    {
        "post_id": "1b4jphq",
        "author": "This-Willingness-762",
        "title": "HR being concerningly specific",
        "url": "https://i.redd.it/cg8e79752vlc1.png",
        "score": 402,
        "num_comments": 36,
        "created_utc": 1709369003.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1b4jphq/hr_being_concerningly_specific/",
        "comments": [
            "![gif](giphy|8FVyIT1oiuin9igyeO|downsized)\n\nbefore you know it the engineer goes on strike",
            "I mean, that sounds like an IT technician role, probably in a server room if not some other clean room environment.",
            "What's more concerning is why has HR made what looks like an office manager role into \"Engineer\" and requiring a computer science degree??",
            "sign me up",
            "That’s not “concerningly specific”, that’s a very normal request for this position. Microchip semi (this listing) has a fab in AZ.",
            "Well to be fair cs is full of femboys and furries so…",
            "The “bunny suit attire” got me💀",
            "Bunny suit is a non-technical term for protective gear one would wear in a clean room. Typically associated with semiconductor Fabs and Labs.",
            "Bunny suit attire wtf",
            "I can’t imagine why a SWE would need to be in a clean room for many hours at a time.",
            "Why is a cleanroom suit called a bunny suit?\nThe protective clothing worn by an individual in a clean room that keeps human bacteria from infecting the chip-making process. The outfit was coined a bunny suit because it makes people look like oversized rabbits.",
            "Are they running a tech company or a fucking Easter egg hunt? How exactly does wearing a full bunny suit contribute to software infrastructure expertise?",
            "SEMATARY REFERENCE?????????",
            "When they tell you to tailor your resume to the job description",
            "Do they also require you to go invisible?",
            "lol I don’t see why a SWE would be in a clean room, gowned up in a bunny suit for long periods of time. Our engineers very occasionally walk into the clean room(but they do need to gown up when entering).",
            "And they told me I didn't need to do well in gym class if I wanted to be an engineer.... joke's on them",
            "Might have been intended to be “business suit”",
            "Microsoft Word Engineering is hard",
            "![gif](giphy|3o6UBlJeuXB9DpnoNa)\n\nNo problem 😌"
        ]
    },
    {
        "post_id": "17b75xv",
        "author": "loporlp",
        "title": "I did it! First Internship at a fortune 500 company",
        "url": "https://i.redd.it/t6o7ed1ab2vb1.png",
        "score": 402,
        "num_comments": 60,
        "created_utc": 1697678998.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/17b75xv/i_did_it_first_internship_at_a_fortune_500_company/",
        "comments": [
            "Me with 200 apps and nothing 💀💀💀( But I'm a sophomore)",
            "https://preview.redd.it/6qvpgbaoe3vb1.png?width=2072&format=pjpg&auto=webp&s=b36b6a7067a08f4ed24a3d85b663e88566968af0\n\nThis is the Resume that got me there",
            "This is the type of graph this subreddit needs! Bravo sir on the offer.",
            "Which uni?",
            "Which fortune 500 company is this?",
            "How are these graphs made",
            "How do you make these graphics?",
            "Yoooo congrats!",
            "What graph/chart program is this?\n\nAlso congrats and f u XD",
            "what were the first and second round interviews like? Were they remote?",
            "Cool! \nBut how could you have a gpa before finishing the degree?",
            "jm smuckers? I also got an offer from them",
            "Which company?"
        ]
    },
    {
        "post_id": "16t1h3g",
        "author": "Mammoth_Telephone_55",
        "title": "New grads of 2022 and 2023, how bad has the job search been for you?",
        "url": "https://www.reddit.com/r/csMajors/comments/16t1h3g/new_grads_of_2022_and_2023_how_bad_has_the_job/",
        "score": 405,
        "num_comments": 266,
        "created_utc": 1695765549.0,
        "selftext": "I work in big tech as a senior engineer, and I'm genuinely curious as to how bad it is out there for new grads now. I haven't conducted any interviews since last year because our company has dramatically reduced hiring. \n\nIf you are a new grad who went to a T20 cs school, how bad has it been for you? Were you able to get decent offers? ",
        "permalink": "/r/csMajors/comments/16t1h3g/new_grads_of_2022_and_2023_how_bad_has_the_job/",
        "comments": [
            "Graduating May 2024, have a full stack SWE internship(June until December), have 4 huge varied projects, and have a 3.8 GPA, using Jake's Resume and the Google XYZ format.\n\nI'm basically not getting anything new grad wise...\n\nIt's terrible right now.\n\nWishing I just went to a bootcamp in 2020, got a job in SWE while FAANG was basically anyone instead of going to college.",
            "Very very bad. Still nothing after 4.5 months after graduation.",
            "[deleted]",
            "Pretty awfully. Barely getting responses as-is and multiple rejections per day (even on weekends) has become commonplace. I've had a much bigger network than my previous years and have been using that, but most of their places either aren't hiring or I'm getting rejected/ghosted. Even after perfect OAs done in less than half the allotted time.\n\nIt's almost always at the resume screen, but I'm unsure what's going on. I've gotten my resume reviewed by 7 people (3 engineers, 2 managers, and 2 resume-reviewers from my campus) already, but even after all the changes I barely make it past the screen.",
            "Graduating Dec 2023. 1 meh internship, 1 good one. Interviewing with 5 companies and waiting on a return offer. \n\nI think applying to jobs outside the west coast has made it much easier for me.",
            "[deleted]",
            "Graduated December 2022. It’s been rough to the say least. With how tech is currently, it will be a while before the market gets better…that’s if they do.\n\nRight now I’m pivoting towards TE and/or something in EE like failure analysis, with plans to enroll in a bootcamp in the medium-term\n\nEDIT: Just realized OP was targeting answers from those attending T20 schools…oops. My point about the job market still stands",
            "T30 school, 3 SWE internships (FAANG, Big Tech, F500) + research with publications, many fullstack projects/extracurricular experience too.\n\n50 applications -> 1 interview\n\nHonestly expected I would get a lot more interviews this season, but the market is so tight that I believe recruiters are clamping down on filtering way more by school tier, internship prestige, etc. this year and going to a T30 I’m sad to say I believe has hurt my chances negatively.",
            "I graduated this year and had a return offer from a place I interned last year. Public school, 3.2 gpa, $100k in MCOL. The return offer was my fallback though, I did apply to a couple hundred new grad positions but I had like half the response rate of when I was searching for an internship.",
            "2023 Grad. I have been job searching since March. I have had 2 interviews (one with a small road construction company that has been automating much of their business with MS’s technologies, one with a major US Defense contractor). Both interviews I thought went well, but was turned down from one and ghosted by the other.\n\nI went to a state school (not remotely T20), 2.9 GPA, no internships, 1 major project and a second one I don’t feel comfortable putting on my resume yet). I’m contemplating going back for a masters in a more niche subfield or EE, or going into nursing.",
            "I'm a recent masters graduate from Europe who moved to Canada on 2 year visa. I was applying to US remote and Canada jobs. In 5 weeks of constant applications, some with referrals I got zero response. I went home in early September for my graduation ceremony and thought I'd apply for jobs here to interview while I'm back. I've had 3 interviews and multiple other recruiting calls so I think I'm going to put off moving another year. In Europe I've only been applying to jobs in Dublin, London, Vienna and Spain. Only Spain has given me no interest. Compared to Canada there is just a huge difference in the number of applicants in Europe",
            "Goes to UCSD, three technical internship at mid-tier companies / research centers. Co-authoered a sys/net related paper. 3.8+ GPA. I like to think my profile is okay at least, but it's been a ghost fest.\n\nOnly got interview from SpaceX and DataBricks. It's confusing as hell because I thought these two are supposed to be ready hard to get. Maybe they are the only two that are really hiring right now lmfao.\n\nWill be unemployed in a few months at this rate. And look at all those dudes who did three months of boot camp and got into google two years ago. what a joke.",
            "I'm just speechless of how bad it is...",
            "Got a swe job. But fully expect many to attrit out of the industry in the next few years. . Those who can’t get swe jobs 1 yr after grad are going to be in bad shape. As the industry grows in the years beyond though, those who are in now will be in good position for big salaries as the attrition now will create a shortage of mid/sr devs later on.",
            "Graduated from Ohio State in May (so like T50-ish I guess, might be higher in CS rankings, idk), had a job from June until this month when I was laid off after the company I joined was acquired. I've only been applying to places for the past week or so, no responses yet other than a couple rejections, but its only been like 20 applications so far. Problem is I moved to Chicago literally a week before being laid off and for simplicity's sake I'd like to stay here so I'm trying to mainly apply to jobs here. I had a call with a recruiter today from a company I got in contact with through the CEO of the company I was at that was acquired since he is an alumni of the same scholarship program I was a part of and the CEO of this other company is a friend of his. Call went well but they don't technically have any openings right now for junior level devs, but they are going to go around to hiring managers and see if anyone would be interested in taking on a junior dev, so we will see if anything comes from that.\n\nFwiw, I had no internships and my only two projects on my resume are two school projects, one of which was my capstone.",
            "Graduated in June 2023, T60 school,2 swe internships and was able to land 2 FT job offers for swe roles",
            "💀💀💀💀",
            "Graduated June 2023 with a 3.8gpa and wasn’t able to look for a job because I got in an accident and had to cram the end of my semester. Went to Olin College of Engineering, tied #2 US News Engineering Programs (no doctorate) and tied #10 Computer. It’s a small and new school so we don’t appear in a lot of rankings despite comparable institutions being there. It’s also a very small school so my degree is Engineering with a concentration in Computing because we aren’t big enough to warrant an accredited CS program (we have 3 majors), which is essentially CS by courseload. 1 decent internship, I was told no return offer because of a hiring pause, and 2 research positions.\n\nApplied for 150 jobs singe June (I know I could be applying to more, I’ve been taking care of my health and trying to relax a bit for once at the same time), customizing resume and cover letter for each job, I’ve had 1 IRL first interview, about 10 automated first evaluations, and nothing else. Response rate is about 20% including rejections, and about 2% non-rejection responses. Also have been working with school’s career center to make sure my application materials are good (not for every application but spot checks). \n\nI agree with what another commenter said, most of the new grad things require graduating Fa23 or Sp24. I’ve been writing to anyone I can when applying for these jobs explaining that I was unable to apply previously due to an accident and so far have had no success. \n\nI’m not sure if I’m doing something wrong or if it’s the market, but it’s been rough. I’ll readily admit that it’s been harder because of recovering from that accident but maybe a badly timed curveball from life shouldn’t be sinking my prospects.",
            "Graduated May 2023, got pretty lucky tbh and am working at a pretty good company right now. Sent out tons of resumes, but the problem is that most of them ghosted me. Then a recruiter saw my profile and actually invited me to interview for them which was a stroke of good luck. The interview wasn't even all that technical.",
            "May 2023 grad. I went to a no name school in NY, 2.85 GPA, no internships, ≈350 applications, 12 first rounds interviews, 3 final round interviews, and 2 offers. It was particularly difficult because I don’t live near a metro, so I had to apply mostly to remote roles.",
            "I graduated in 2021 had a job for a year got laid off. Been radio silent from 2023 beginning to now.. only recently am I getting interviews..",
            "I go to Berkeley, have internships at Tesla, KPMG, and healthcare. Also have tech research experience at Genentech and Carnegie Mellon. Applying to over 170 data science/pm internship roles. Only six interviews, none are BigN.",
            "It’s been good so far.\n\nI graduate may 2024 with no internships. At a top 10 public school with 3.9 gpa. Currently finishing up process with companies like Bloomberg, stripe, Draftkings, and am starting interviewing with Netflix soon.",
            "It's fine, my expectations are probably just a bit high. Didn't get a return from my last internship, which sucks. Have one from the internship before that. Otherwise it's hard. Big Tech isn't really hiring and Jane Street just rejected me after the first round lol.",
            "Graduated May 2023. Got an internship this summer (post graduation) and essentially sucked my manager off to convince him to hire me on full-time after the summer. \n\nBeside that I had around 150 applications with 3 behavioral interviews.",
            "500+ applications, only 1 response at an unpaid startup",
            "Graduated in June 2023 with a masters degree completed 2 internships(summer and fall), more than 500 applications less than 10 call backs. Also being an international student makes this even worse.",
            "It’s so bad right now, I had to accept the shi*** coding job. I know I should be grateful, but the level of time and effort they demand is insane. But at least it’s paying my bills.",
            "Since you also asked about us 2022 NG elders: it was really easy for me. I was handed multiple very high offers in October 2021 after a ton of LC practice. It’s crazy to think that things would have been very different if I was just one year younger. I’m still at my first job, coming up on 1.5 YOE. I would offer referrals, but my company literally isn’t hiring any new grads. I feel so bad for 23s and 24s.\n\nOn the other hand, I’m really, really scared of getting fired all the time, since no one is hiring SWEs with less than 2 YOE.",
            "[deleted]",
            "I graduated May 2023 and I do not have a job. All the new availabilities I see are for 2024 new grads now and require that they graduate in December or next spring. I have no idea what the hell I'm supposed to do now.",
            "I graduated May 2023 and was lucky enough to land 2 offers this fall. Both are with the government and I have military service/clearance already which is why that’s the case. I have a CS degree and Sec+ as well. \n\nLook into defense contracting or even federal positions. Also apply out of state if you have nothing holding you back. 100% worth it.",
            "I didn’t go to a T20 cs school but I’m a 2023 new grad with 1 research undergrad and my internship last year and gave me a full time return offer this year. I started my new grad role in June.",
            "The situation is the worst. Having graduated 3 months ago, still I am unemployed. I daily apply to multiple companies but all I get is rejection mails. Workday portal!!! Alas!!! that site is completely doomed. I don't know why the companies even hire from that portal. Talking about resume, have included each and everything that I good resume should have. Maybe it's just luck at this point of time.....",
            "3 years of work experience as SWE in India, good resume, few projects to display, applied to 1000+ applications for Internship and couple hundreds for mid-senior (2+) and new grad and still no calls. \nI want to give up and accept myself as a loser",
            "I graduated may 2022, but haven't been able to find anything. Due to outside circumstances I'm limited to my geographic area or remote though, so I haven't been able to fire off 10 quintillion applications across the country. But idk what a T20 school is and probably didn't go to one",
            "Horrible. I have another bachelor's degree aside from my 4.0 GPA CS degree. An internship at a studio, several personal and freelance projects, unpaid work at a studio, and a Cyber security certification. 1100+ applications rn since August 2022 and nothing.",
            "I went to T10 CS school, an Amzn internship. Countless of rejections after graduation…",
            "I graduated in 2022 and got a job at a faang. But I had interned there in 2021 and got my return offer when they were still hiring a lot. \n\nDuring the pandemic I considered taking a gap year in college but ended up deciding not to do so. I am so happy I didn't do it, because I'd probably be in a very different spot rn if I had done so.",
            "Got the job offer, during finals week. Got extremely lucky.",
            "I went to a state school, graduated with honors and got a job after two months of applying. I am a career switcher and got an offer for $65K in MCOL with a hybrid schedule.\n\nEdit: No internships because I came from a different field. Graduated in 2023",
            "Seems I may have to go to grad school just to even be considered in this market",
            "Graduated 2023 from t10. Had a few offers last year. Ended up taking one for 200k",
            "2022 grad here, it wasn't bad for the Q1 - Q2 of 2022. Once the layoffs and hiring freezes hit in Q3 2022, offers were getting rescinded left and right and the number of postings went down dramatically. I had multiple interviews and offers with big tech and banks without much effort into my applications. I've been applying over 10x as much as in 2022 and have been only getting OAs and recruiters reaching out for senior-level positions :/. I've been applying to most random companies like fast food companies, the healthcare sector, YC companies, etc.",
            "Went to a big T20 and I don’t know anyone who got a non return offer job",
            "I graduated May’23 from NYU. It is pretty bad and getting response/interview calls are very hard",
            "I never found anything and my savings dried up 5 months after graduation. Ultimately I had to take a job not in my field CNC machining. So I think I'm going back to uni for Mechanical Engineering. Job prospects look more promising than SWE.",
            "Graduating in December with Masters from a T5 public school. I have 4+yrs of work experience and 6 months of internship experience. Waking up to rejection mails🥲. Desperately applying to even new grad roles. Hope it gets better soon.\n#swe #cs",
            "This is confusing to me, I thought CS is selective and difficult, that's why people bust their ass to do a job a lot of people need.",
            "Wow looks pretty bad. Anyone have a good experience they wanna share? been scrolling for a while and only see bad experience",
            "Graduated in June with a 3.7 GPA in CS and have a year of internship experience as a SWE. Only 5 companies have been looking for graduates in that time, 3 have rejected me, had 1 interview 2 weeks ago but still yet to hear anything back and the other hasn’t got back to me at all. Thought more companies would’ve been looking for graduates by now. I’m short, it’s been hell",
            "Graduating Dec 2023. Couple of automated hackerranks now and then. No communication after that. Currently in an internship until december. Not sure if they will offer me fulltime, because the company is not in software domain and not certain about the headcount. What should I do?",
            "graduated in may 2023. went to a t3. applied to ~30 places in fall 2022, got 4 interviews. ended up with 2 offers, in addition to a return offer from fb. turned down the fb return offer.\n\ni had 2 faang internships.",
            "I've been hunting for almost a year and a half and nothing.",
            "No jobs at all",
            "BRUTAL",
            "This is a very scary situation, is it due to the recession? Can anyone predict when it’ll get better?",
            "graduated 2022. was able to land 5 offers",
            " Not necessarily a CS major; but a bootcamp graduate. I did a cybersecurity bootcamp, took the sec+ & net+, and have work experience as a TA, and have sent out over 1300+ applications with no luck.\n\nI am currently doing a SWE bootcamp right now, but I’m skeptical that any of my efforts are going to be worth it considering the horror stories I’ve seen on both here and LinkedIn",
            "Quit my high paying job in india and came for MS in USA . Everyone has STOPPED hiring .Nobody is ready to call this a tech recession . There are just Dummy openings and nothing other than ghosting! BTW I have 6 years of experience and still companies are not hiring as I am in international student. If you are a citizen /GC then you might get something but for people like us NOTHING. Very demotivating,demoralizing",
            "more doomer porn incoming…",
            "Pretty good, return offer + other + usually a recruiter or 2 reaching out per week",
            "CS adjacent international student from Ivy League school graduated in  Dec 2022. Sent out 843 applications in, only 11 phone screens, 6 interviews, 5 offers. \n\nIt was hard. Most applications were like dead silence. Didn’t keep track of how many OAs I did, but I got perfect or nearly perfect score on most of them. The whole job hunt feels like a CodeSignal OA, I was doing everything I could and passing all test cases with 20 minutes left on the clock, and I still can’t get perfect score. I was banging my head on the wall and didn’t know what should I improve on.",
            "Barely any bites, have a cloud computing internship, a portfolio website posted, and minors in data science and web applications.",
            "Graduated in April 2023 from a state school ranked about 150 and got two full time offers in HCOL just barely 6 figures. 3.8 GPA, 1 internship, 4 coops, logistics lead for school’s hackathon, other eboard positions, some small projects.",
            "Wowee, some of you are impressive. 1 internship, 2 research internships, 1 full time qa position pre-CS, bunch of TA contracts in school and now. 2 bachelors. If only I didn't chicken out of CS in 2016 lmao. Oh well. At least, I feel all your pain.",
            "Summer 2022 graduate. I graduated from a top five university in simulation software. I have applied close to 200 roles and received three interviews.\n\nI had an interview with a FANG company lined up in the fall of last year; however, due to the tech recession, hiring freezes, etc, they cancelled my interview.\n\nThings are opening up right now which is great. I am optimistic that I'll land somewhere soon. I already have a couple of interviews lined up, so we shall see how they go 👍\n\nAnother good thing to note is that I'm competing with people that already have industry experience. That's due to all the recent tech layoffs, so the market is geared more towards them at the moment. I can't tell you how many times recruiters message me back telling me that they are looking for \"senior-level\" people. \n\nThis tech market has definitely been humbling. Yet, I wouldn't mind working on side projects in the meantime to build more on my portfolio of projects; however, capitalism exists and that's something I can't afford to do. People have bills man. To exist in this world, you gotta work. That's capitalism 101. Nothing's free. I don't have time to build a robust piece of software and have it in the app store, pay all my bills, and conduct my job search. That's why I invested time to attend a university to get my bachelor's of science!\n\nShit... I got student loans that I have to pay for that are coming up and some of these companies are still asking for five - six multiple round interviews. Don't get me wrong, I know what I signed up for, yet there's a radical idea in the back of my mind that is stating that things would be a lot more straightforward if capitalism didn't come knocking on the door once a month. This is the world we live in and until a major change is made, it is what it is. Nobody cares, work harder.",
            "[deleted]",
            "Took me 2 months to find a job. Our team is full now and we’re not hiring any longer",
            "When I went to university they had a course that had 800 students studying for a job that only had 4 positions in the whole country, obviously most of those students never worked in this industry but one girl whose father who ran the organization. You learn to make coffee, but you either serve it or learn how to make the cup.",
            "What about rotational programs?",
            "Market is tanked ..",
            "Could be better but always optimistic.. If you don’t get a return offer from your internship you’ll struggle horribly. Currently interviewing for internships so not completely bad.",
            "Graudated DEC22 with a BS in CS. 3.7 gpa overall. Not from a T20, but we have a lot of companies inputting what our curriculum should revolve around. (intel, aws  techtronics and others). Feels like a competent CS Prog. \n\nI had 2 internships, multiple extracurricular activities (student orgs), I was a CS tutor/tutor coordinator within the engineering college, I did 5 years in the mil, and sent around 90ish applications. Response rate was around 11%ish. Pretty low. I still have applications in review status from OCT22. That is still currently true.\n\nStarted job search at the beginning of SEPT22, and I didn't get a full-time position until JUN23. I'm glad the search is over tbh. It felt more like luck was the thing that helped me because the full-time position wasn't offered at first. I had to do contract work at the same org before getting offered a ft position - they hired 2 for the same position but gave the full-time to the other \"qualified\" person. The other person couldn't hack it and ended up resigning (resulting in me getting his jira ticket). Later, it was explained that on paper, he had more FTE and that it was a formula that led to him being hired. Obviously, per my current mgr, I had more intangibles on paper and presented a more curious perspective along with being a potential leader (self-sufficient). He [mgr] had reservations about the ft hiree, but a few on the hiring committee sought the other person more so.\n\nI'm trying not to bash the other person they hired initially or be passive-aggressive. I actually tried to help them out and help them push through. He actually did not like the position to begin with. These are words from the other person who was hired for the full-time position.\n\nReason I explained that was because I feel like resume workshops matter must less because someone could easily spin up a functional resume (without concrete dates) and yet, they could not effectively git rebase and merge their feat branch. Networking can help, too. I got referrals from friends, but for instance, I didn't want to go through what felt like a 2 month process with several interviews to only be disappointed... Epic Systems\n\n\nHopefully, this time, like in the dotcom bubble, hiring woes will reside, and hiring folks actually take the time to vet more candidates vs. sitting on resumes. Idk the remedy, tbh, other than purely persisting for what you want and having a flow income to weather this economy.",
            "Graduated Dec 22, I had nearly 1000 applications and 10-20 interviews, and only got one offer from a nameless hardware company.  I am from a T50 cs school (T30, maybe T20 all major comprehensive) master program. I am international and need sponsorship. My past internship includes Microsoft and other famous startups. I have competitive programming experience and rank in the top 3 in our region ICPC. My foreign undergraduate school is a typical \"other university\", and it sucks💀. \n\nAt least, I have good wlb now.",
            "German here.\nI'd graduated 2022 in computer engineering and focused my skills in FPGA dev and vhdl, a little c and CPP for embedded systems.\n\nSend 2 applications during my thesis, got interviews with both companies and took the first offer I got not going through further interviewing with the other company. Sallery was 48k plus bonuses so around 54k. Typical salary for Juniors in Germany. Ended up leaving that company 1 month ago though.\n\nWhile working at the first company I sent out 3 applications to other companies refocusing on FPGA development. Got interviewed by 2 of those companies and offered a job by one of them. My application email literally read: \n\"Dear company XYZ,\nI've seen your job offer on Google and am very interested in the free hot and cold drinks you offer. The rest sounds amazing as well...\"\nBesides me thinking it was actually a glowy brain application it was also the laziest one I have written so far. New salary increased to 54k plus bonuses and a raise to 60k plus bonuses as soon as my onboarding is completed.\n\nFrom this experience I'd assume that either our market here is the opposite from yours in America and we are way more in desperate need for qualified computer engineers or there's something wrong with the applications ppl send who also post here that they can't get a job.\n\nTo answer your question: it's been a cake walk for me.",
            "How is it possible that it is so hard to find IT job but at the same time they pay so well?\n\nBy the way number of graduates in IT grows each year, during pandemic a lot of people switched to IT from other fields which also made an issue after boom ended. I thing CS is not worth studying anymore.",
            "My friend graduated in 2022 with a homeland security degrree and now does swe at a health insurance company. He’s self taught",
            "I graduated this May. I had two offers way before graduation (both offered in 2022). One was from a summer internship the other was applying directly for a new grad role. I had 4 internships before hand and some research gigs through the school on my resume. I don’t follow any popular format my resume is actually written in Markdown. Didn’t go to a T20 school. \n\nI didn’t do a lot of applications either, got a few rejections and outside of the two offers I considered I got two low-end offers when applying during Senior year.",
            "I got Webflow coming out of college. It's really hard right now but sometimes you can get lucky",
            "I got lucky as shit, imo, and got an on-site position as an automation programmer for a local Ag company in my tiny town. In a LCOL~ish area, 73k. Not great not terrible, but considering some bits of my background (low GPA, long time in school, little professional experience), I think I'm doing okay to start.",
            "If anyone here wants a resume review hit me up on discord (args#5585 or just args now I guess?). I've got like a decade into the scene and regularly interview at my own company. Could help point out mistakes or areas to expand in your resume.",
            "Accepted my return offer from summer 2022, graduated may 2023, and now working full time, honestly not bad but I decided to graduate early instead of pursue an additional year in an accelerated masters program.",
            "I started applying in march, got the offer by the end of June, I got a position at a grad scheme (2 year scheme with rotation between different departments withing the company, after that you get to pick the one you liked the most and stay as a full time employee) at a pretty large company. Schemes like that are pretty popular in the UK, companies invest in you and train you on the specific stack they’re using making it a comfortable place for you to stay long term.",
            "I actually just got a gig in the defense sector as a SWE\n\nHowever let it be known I’m prior service so that helps TREMENDOUSLY.",
            "Sent out at least almost a hundred resumes since the start of September, and only able to get 2 interviews. One of which I was taken seriously, the other was looking for a Junior role with senior qualifications",
            "2022 grad had a job out of college basically just given to me as an entry-level salesforce dev. I didn't know what it was but they were going to pay me a ton and I needed any experience for my resume. Did nothing for a year there literally nothing and then I was let go. Looking back I wish I had taken a different path to get a different experience for less pay but I was too stupid out of college and they actually were just giving me a job that paid insane for my location with almost no interview.",
            "I was a 2023 graduate with a 4.0 and I got a job through the company I interned at. We are now on a hiring freeze but we can still hire interns. I love my job and the people I work with, I think I'm pretty lucky because I didn't have to deal with the hiring market afer graduation.",
            "Not T20 cs school, but I graduated in 2022. Only thing I had was a good GPA, no internships or personal projects so I put school projects on my resume. With all the doom and gloom on reddit I thought the search was going to take months, but I had 3 offers in 2 weeks with a another 1 or 2 interviews lined up. Though to be fair two of the offers were from defense companies and I was applying all across the country, I didn't mind relocation.",
            "3.3 GPA, Undergraduate Research, FAANG Internship. \n\nI just accepted a full time software engineering offer at a FAANG company but besides that I’ve been getting ghosted or denied by most places",
            "Graduated spring of 2023 in Info Systems and Business Analytics. It’s January 2024, and I haven’t even had an interview. I’ve been working a blue collar job since May"
        ]
    },
    {
        "post_id": "s6kmzi",
        "author": "Forrox",
        "title": "Please send good vibes my way.",
        "url": "https://www.reddit.com/r/csMajors/comments/s6kmzi/please_send_good_vibes_my_way/",
        "score": 401,
        "num_comments": 28,
        "created_utc": 1642468668.0,
        "selftext": "I interviewed at IBM a week ago, and I'll know by one week from today if I got the job. Honestly, I hope I just hear that I got it tomorrow. Upvotes charge, comments cast.",
        "permalink": "/r/csMajors/comments/s6kmzi/please_send_good_vibes_my_way/",
        "comments": [
            "you got it!",
            "Sending all the positive vibes! Is this for new grad?",
            "Hope you get good news soon! Also remember that whatever happens, in a few years, you’re probably gonna be making more money than the average office worker.",
            "No matter what, you’ve won. You gave it your all (I’m guessing) and now it’s out of your control. If you get it, huge congrats! If you don’t, huge congrats! You got great experience in an interview process and you can take that knowledge with you wherever you go. Hardest thing is persevering through all the garbage. Keep your head up no matter what and strive for excellence (being good at cs) over success (landing a job); success will come running after you!",
            "Take my energy!",
            "Good luck! I'm interviewing for their devops co-op tomorrow.",
            "Are you a sophomore?",
            "Good luck OP!😁",
            "Sending all the best vibes to you",
            "alexa play good vibrations",
            "LFG! You got this",
            "good luck my dude!",
            "Best of luck to you, don't fret over it I am sure you got it!",
            "Good luck!",
            "good vibessssss",
            "Best of luck!",
            "Good luck!",
            "for an internship? i applied for an internship with a reference lmao so im hoping for something",
            "You got this in the bag 🙏🔥🤗",
            "Best of luck!!!",
            "good luck :)",
            "Hi, I just took the interview and am not sure where I stand. Did you receive an offer. If so, how quickly after the interview did you receive your offer, and at the end of your interview, did the interviewers make it seem like you were going to get an offer, or were they being a little vague about it, basically was it kind of hard to tell wether you got the offer or did you think it was made clear?  Hope my question makes sense."
        ]
    },
    {
        "post_id": "jw6gqe",
        "author": "Noxium51",
        "title": "Doing my part to keep the job market valuable",
        "url": "https://www.reddit.com/r/csMajors/comments/jw6gqe/doing_my_part_to_keep_the_job_market_valuable/",
        "score": 399,
        "num_comments": 36,
        "created_utc": 1605663439.0,
        "selftext": "Just accepted a 98.3k/yr position LET’S GOOOO",
        "permalink": "/r/csMajors/comments/jw6gqe/doing_my_part_to_keep_the_job_market_valuable/",
        "comments": [
            "BREAD ACQUIRED",
            "Nah it’s easier to complain about people stealing our jobs \n\nJk fuck those losers\n\nCongrats homie",
            "the time has come, my child. the pockets shall remain full forever.",
            "CONGRATS SECURE THE BAG",
            "damn congrats to you! take a break you deserve it",
            "How many years experience do you have? Which industry?",
            "Fucking badass lets goooo! And in this climate as well!",
            "W",
            "Bag secured. ☘️💸💸",
            "bag szn",
            "HUGE W",
            "Is this post grad salary?",
            "Here's a question, did you negotiate salary? seems like a good opportunity to start directly at 100k",
            "well done",
            "Congratulations man!!",
            "Mhm! Congrats!",
            "YEAH BUDDY",
            "Nice 👍",
            "LETS FUCKING GOOOOOOOOOOOOOOOO",
            "What kind of role is this?",
            "Congrats fam!",
            "Are you a senior dev?",
            "What company?"
        ]
    },
    {
        "post_id": "16f9qy6",
        "author": "snekboi50000",
        "title": "Is it okay to not grind as hard as everyone else?",
        "url": "https://www.reddit.com/r/csMajors/comments/16f9qy6/is_it_okay_to_not_grind_as_hard_as_everyone_else/",
        "score": 396,
        "num_comments": 133,
        "created_utc": 1694375418.0,
        "selftext": "It seems like everyone around me is doing leetcode and personal projects 24/7 but honestly I just want to do well in classes, spend time with my family, and do other fun but unrelated volunteering and part-time jobs. I don't even care about FAANG, I just wanna be able to get a stable job in the future",
        "permalink": "/r/csMajors/comments/16f9qy6/is_it_okay_to_not_grind_as_hard_as_everyone_else/",
        "comments": [
            "I’m in the same boat. I just want a stable job and to live calm and happy. I’m not trying to do “Leetcode goblin 6 days a week grindset 22 hours a day screentime”",
            "Given that you're not looking for FAANG-tier then yeah you're good, I'd say try to maximize your chances by going to career fairs or conferences, you have way more chances with that than spam applying",
            "Nowadays, even getting an average SWE job requires you to do personal projects and/or Leetcode outside of your CS classes. Just having a CS degree alone isn't enough unless you get really lucky. This profession is very competitive, especially for internships and new grad roles where a bunch of people are trying to get their first software engineering job.",
            "You need to grind even if you just want to be average at an average job. And i’m not talking just for FAANG. The days were all you needed was CS degree are over.\n\nThere’s just too much competition. I don’t see why a company would hire someone with the bare minimum over 100 other kids with the bare minimum + projects + internships. \n\nIf you don’t want grind LC, that’s fine. But grind networking instead. Or grind projects instead.",
            "Same as you, man. I just want a stable job and spend time with friends and family playing sports, but everyone around me in CS seems like you gotta spend all your free time coding annd studying or your degree is useless.",
            "I had 2 internships in college. I didn't return to either. That said, my GPA was solid but not incredible (3.57 - I kept it off my resume). My personal projects were pretty shit, just stuff I did for class final projects lol. I was ~ fine ~ at LeetCode, but certainly didn't grind it often...maybe like, 3 hours a week during the job app cycle. \n\nI still got an offer last month. Took a few months of applying, but got there. Some people will tell you that you're fucked if you don't build a profitable side project and solve LC hards in 10 minutes. Some people will tell you you'll be fine and not to worry. Truth is somewhere in the middle - it's both market dependent and literally just whether that one offer works out. \n\n\nThat said, 2 important things imo:\n\n1) Not everyone is leetcoding 24/7, this subreddit is a very skewed sample. Further, I highly doubt everyone's stats are as impressive as they say in every single post, it's like asking guys what their dick size is and expecting accurate data to be self-reported lol. \n\n2) Like everyone will tell you repeatedly, networking is huge, and you never know where you'll find it. Go work part time jobs, join clubs, volunteer, fuck around with friends and meet new people, you never know who will have a friend of a friend in the right company. Also, going to some tech events (in moderation) is a relatively low time commitment activity that can have MASSIVE payoff in terms for networking.",
            "Most overlook skill by cs nerds is soft skill, improve your networking and leadership skill. Especially in singapore, where we lack leaders, company would want you over someone who does tons of internship and LT",
            "Yah there's no need to grind super hard. An occasional leet code problem once in a while wont hurt ofc. But personal projects are a must! It shows your passion in the field. I got an internship offer because one of my very basic personal projects (took less than 10 hours to make) was interesting to my mentor. He saw my passion in building stuff because of my projects. He eventually gave me a job offer after the internship ended and he said there would be no coding assessment and all that complicated interview stuff since it was a small startup and I could start training almost immediately. I was never told what my total comp would be though. I refused it for now because I want to finish my CS degree, and he said I'm always welcome to contact him after my graduation. Not sure if this applies to everyone though. I may just be extremely lucky.",
            "ur fine dude, people don’t smell the roses in their pursuit of the gold at the end of the rainbow. for most people in that pursuit they never find the end of their rainbow it just keeps getting bigger.",
            "Dude I feel the exact same way😭. I do work on my personal projects, but I’m definitely not programming all the time or anything. I think we’ll be fine.",
            "I feel you I just want a job that will pay the bills",
            "There's no need to grind anything, but you need to find a way to set yourself apart from all the other recent graduates vying for the same jobs and you need to realize, course work for your degree is probably, at best going to teach to 50% of the skills you need to be successful in your career.",
            "Some people are sacrificing their youth to later tell that they are doing great.\n\nNo. If You had to sacrifice your young adulthood to learn something you are not even passionate about then your life suck.",
            "I have a buddy with a subpar resume, a few projects, and an internship at a startup (unpaid). He graduated this year and got a job at random tech company making 60k a year. It’s not FAANG money, but at least he got a job honestly.",
            "I’m in the same boat. I don’t wanna go to FAANG right away and earn like 200k. Like 70-90k is fine for now. I can get to 200k steadily in like 10 years or so.",
            "Certainly. For all of the hate government/contracting gets here I think it’s overall a stable job and decent income (doesn’t require being a leetcode goblin).",
            "It’s absolutely okay! You don’t have to be coding 24/7 and it’s normal to have a personal life outside of your classes. You’ll be just fine! 😉",
            "Same here, I just love to do coding and problem solving. And I want to have fun and have a stable life. I care about pay but its not my priority.",
            "For whatever it's worth I never grinded either and after 3.5 years in my career I landed a FAANG contract.",
            "Same, at this point not even trying to get a SWE specific job, just want to learn about all the related fields that tech has to offer and explore, and see if that would suit me better. I realized from my previous internship that I actually don't like software engineering all that much...i just keep convincing myself that i do",
            "90% of cs graduates probably don’t grind.\nBut the idea of I just want to be able to get a stable job isn’t easy, these days.",
            "You can grind on anyone.",
            "Think of it statistically, what kind of person is likely to write in a hyper-specific CS career subreddit?",
            "OP, everyone here telling you to grind hard because you cannot get a job without it is full of shit and likely has little to no experience. This sub is extremely toxic.\n\nIf you're willing to work for a small/medium-sized company in an \"average\" city, there is *tons* of work to be found. The majority of people in this sub are drunk on FAANG Kool-Aid, and even those that aren't are despondent because the hiring market is rough right now. \n\nIf you're not graduating in the next 6 months, you have time. Enjoy life. Get experience by volunteering, joining clubs, demonstrating leadership, etc. You won't regret it in 20 years. Life is too short to grind yourself into dust. \n\nAnecdotal evidence: two separate and unrelated companies with < 100 employees that my father was consulting with has been looking for more than a year for several SWEs and DBAs to help them expand their IT infrastructure. They're paying $100k min. The downside is being on-call during weather events, and having to commute 60 minutes outside the city (they're both involved in electricity infrastructure) when going to the office. They are struggling because it's not in a city that everyone immediately wants to move to (Phoenix).\n\nMore anecdotal evidence: A company that a friend works for has been hiring like crazy, even fresh graduates. \"Downside\" is that it's in defense and requires clearance. Pay is 80-100k with signing bonuses ranging from 5-10k, including relocation. They are struggling to find people partly due to people not wanting to work in the sector.\n\nPeople need to stop looking at the obvious companies for work. There is enormous demand for SWEs and DBAs and MLEs, but you have to be okay with starting smaller. If you're good at these companies you will have outsize achievements and reach higher ranks more quickly.",
            "You’re chilling. There’s tons of relatively unknown companies that are far less competitive and that pay comfortable salaries for entry-level engineers, and will be paying six-figures once you get promoted a few times.",
            "you don't need to \"grind\" for FAANG - source 3x faangmula intern. a lot of people are focusing on the wrong stuff here: working longer is not necessary harder or smarter.",
            "We're really talking about an incredibly small subset of companies (not even all of the FAANG in FAANG) which provide leetcode style coding challenges that require additional study in order to filter through a high volume of applicants, where the truly elite require a much higher level of skill than what you'd achieve through leetcode (think olympiad level mathematics and programming). The vast majority of jobs require the ability to code well, communication for non technical people, and general emotional stability. This is different from and not attainable through solving contrived algorithm problems under a time constraint.",
            "To be honest, the concept of 'stability' is a myth, CS is a career which can be very rewarding but it comes with the downside of not having any stability, the best way to attain that is to be really good at what you do, investing some time of your day towards that should be enough, you do not need to be working 24/7 towards side projects or leetcode.",
            "Companies are slowing down on and if not stop using Leetcode.  I cannot wait until companies realize that Leetcode tech questions is a bad idea to test someone ability to solve complex technical problems.",
            "Yea, you’ll just likely make less money, but who gafs",
            "No",
            "You are free to do whatever you want and suffer the consequences",
            "No! It is not okay! Bad! Bad!",
            "Sure, but I won't hire you. And I'm not at FAANG.\n\nI don't give a fuck about leetcode, but if you're just fucking around all the time, you're not a culture fit. And college is the easiest it will ever be, ever again. You not putting in **four or five hours a day doing something useful** is a huge red flag.\n\nEven at 18 credits a semester, you got quite a bit of work left before you fill a 40 hour week.\n\nAnd maybe you're not ready to take on a 40 hour a week job yet, but until you show that you are, you won't get offered one. See, being a grown-up is both hard and awesome. Yeah, we show up at 9. Every day. Five days. Week after week. Sometimes you get to leave at 4. Sometimes you stay till 7. But you get paid for it, enough you can seriously consider retiring at 35. If you're not ready for that, someone else is.",
            "faang > stable job",
            "If you take classes where you work hard and get a B+ (provided a full time course load or part time and working), then you'll always have enough knowledge to succeed but challenging yourself to learn as much as possible. This will be enough for you to get through interviews, especially as you'll take challenging later courses that will solidify knowledge you gained in previous courses as they will rely on it.\n\nYou can get a FAANG job with that if you want, or do other stuff. Get what you can for yourself and remember that college is the one place where people try to get the least for their money and you can instead get the most for your money (within your personal constraints of spending time with your family, etc).\n\nBest of luck.",
            "Start network maxing",
            "Of course!  Just don't expect to be able to compete with them for the best jobs.  If you are okay with that, do your own thing.",
            "Just build a Reddit bot that works with some APIs. Then be like “hey guys, wanna know the !priceof bitcoin ? I’m trying to show off my bot so please say yes”",
            "You dont have to, but grinding hard earlier in your career pays off. I didnt grind and I regretted it. For example, in lower tier programming jobs, you tend to do a lot of rote work, learn bad habits, dont push yourself, dont get much valuable feedback, dont have great rolemodels, use old technologies, etc. I had to really change my personality and sort of resent myself to push myself to be a really hard worker to climb back on top, but now I’m like 5-10 years behind the people who worked hard in school / first few years.\n\nI know Im probably one of the less common opinions here, but earning 300k is a lot different than earning 100k, especially over a period of say 20 years. Its the difference between retiring at 45 or retiring at 65.",
            "Sure, but you gotta realize the reason they're grinding is to find a good high paying job. \n\n \n\n>do other fun but unrelated volunteering and part-time jobs. I don't even care about FAANG, I just wanna be able to get a stable job in the future\n\nThis is fine, basically the path I did. My job ain't high paying but its decent and remote. \n\nI am currently taking udemy courses(company pays for them) to expand my skillset to work on personal projects to find a better job in the future.",
            "Leetcode grind is for people who wants to all go into f500 or faang as a SWE. A CS degree can do a lot and if you don't care about being a swe and rather do other tech jobs then leetcode is not needed",
            "Personal project isn’t grinding. It’s called having a hobby.",
            "I was working full time in another field and going back to school part time for CSC for a career change. I had absolutely no time for extra projects outside of my coursework. I was able to get two offers within a few months (granted, this was last year when the job market was a little better). \n\nI think you should do as much as you reasonably can, but additional projects aren’t the end-all be-all.",
            "i dont think of personal projects as grinding, unless that is your mentality. Right now i enjoy the project im working on, and dont consider it grinding, though someone else might consider it grinding.",
            "You don’t need to spend that much time… just do NeetCode 150 and you can have fun, party, spend time with family, live life, AND make FAANG or higher.",
            " Some conflicting comments here",
            "Try to have impactful open source contributions. There are literally many oss waiting for thousands of issues to be solved. Grinding leetcode is all okay but I think trying for oss contrib is a better way to learn more stuff - with real applications of the algos that are used in the leetcodes.\nLike, for example, if you try for a js library or a niche framework you'll learn bout coding styles for that framework or why that design decision was made - what caused this going this way thinking what and what are the tradeoffs.\nI think, in the long run, these will make you a better developer with having enough exposure in the community.",
            "Yes but this is not the time.\n\n Getting that first job can be brutal and once you get it you have to prove you can do the job , by being a productive team member for 3 to 5 years.\n\nOnce you do that you can take it easier, you will end up sacrificing the career ladder but a sde salary is good enough for a confortable life anyway.",
            "It’s a trade off",
            "You're fine.  Just be good at what you do and the rest will fall in place.\n\n~Ph.D., 7 YOE, Senior",
            "Yes bro don’t be a sweaty codemonkey like the rest of them. Enjoy life brudda",
            "I hâte leetcode and can’t stand doing anything on it, will figure out another way to get employment 😭",
            "Yeah bro just relax\nI didn't do a single internship and still got to a faang"
        ]
    },
    {
        "post_id": "y54ray",
        "author": "Egofull",
        "title": "Needed to get this off my chest.",
        "url": "https://www.reddit.com/r/csMajors/comments/y54ray/needed_to_get_this_off_my_chest/",
        "score": 400,
        "num_comments": 47,
        "created_utc": 1665885489.0,
        "selftext": "I GOT AMAZON INTERN OFFER FUCK YEA. It was my first interview ever, and because I was super nervous I thought I fumbled it. But I just got the offer letter. I feel so relieved, I feel like I’ve secured my future till at least graduation (Class of ‘25). I know it’s not the best internship in the world but this sets me on the right track for the top places next application cycle. I’m planning on surprising and friends and family later.",
        "permalink": "/r/csMajors/comments/y54ray/needed_to_get_this_off_my_chest/",
        "comments": [
            "[deleted]",
            "It is definitely one of the best internships in the world.",
            "Congrats OP, this is awesome because is your first interview ever.",
            "Congrats dude. I respect the humbleness but you're going to learn a bunch and get paid doing so. So be proud, especially with it being your first interview!",
            "Congrats lad.\nWith nothing in my hand ,I still feel good for you .The young lad made it .",
            "Imagine they ask you \"which warehouse?\"\nJk, congrats ;)",
            "Congrats! It’s always nice to know you won’t be searching for a job when you graduate, especially in this job climate. I hope you end up in the company you most want to work for, but I’m glad you have options if you don’t",
            "[deleted]",
            "[deleted]",
            "Dude let's fucking go!!!!",
            "That's awesome man congrats!",
            "congrats! they sent you an offer on a saturday?",
            "Congrats !!",
            "Congratulations!",
            "Accurate user id",
            "Good shit! My internship there helped me a lot.",
            "congrats and fuck you",
            "Congrats!!! You deserve it <3",
            "Congratulations!!  It is a great opportunity. Do your best.",
            "Off my chest == brag about working for Amazon while looking for compliments\n\nWell you got it lol, congrats!",
            "Yuuge moment. Gratz!",
            "DUDE SAME CO 26 here",
            "Any advice?",
            "[deleted]",
            "Hell yeah congrats!!",
            "Kudos to you op",
            "Congrats OP, that is great news. I hope you enjoy it :)",
            "I had nearly the exact same experience! Congrats!",
            "GOOOOD SHIIIT MAAAAN. Also I just realized ur in my year lol, I just started learnin full stack the sept that just passed, and I'm struggling hard tryna juggle leetcode and learning MERN. How'd u go about ur thing?",
            "Congrats!! It being your first time interviewing",
            "Been seeing lots of first timers getting amazon offers nowadays.  Congrats!",
            "W",
            "How is the interview process like for Amazon? I have an interview coming up next week.",
            "I’m still fighting the endless applying to applications. Good shit tho :)",
            "Don't sell yourself short. It's definitly one of the best internships out there and one that you should feel proud of"
        ]
    },
    {
        "post_id": "ou34rg",
        "author": "None",
        "title": "I got the offer for the Amazon SDE summer internship!! + timeline and interview info",
        "url": "https://www.reddit.com/r/csMajors/comments/ou34rg/i_got_the_offer_for_the_amazon_sde_summer/",
        "score": 401,
        "num_comments": 177,
        "created_utc": 1627582975.0,
        "selftext": "I got my offer this morning and I'm so excited :)) I'm so thankful and I feel like it's too good to be true. I keep thinking that this is a big joke or something because why would any company, much less Amazon, want to hire me? I posted a few days ago saying I got my final interview and I can't believe I have the job offer now!\n\nHere is my timeline as accurate as I could for pacific time:\n\nMonday, July 12th 3:48 PM - submitted app\n\nWednesday, July 14th 4:00 PM - got OA invite\n\nFriday, July 16th 3:02 PM - finished OA3\n\nTuesday, July 20th 2:48 PM - final interview scheduling invite\n\nThursday, July 22nd 9:38 PM - final interview time confirmation\n\nMonday, July 26th 3:00 PM - final interview\n\nWednesday, July 28th 3:39 PM - portal update to new location\n\nThursday, July 29th 10:14 AM - offer!\n\nThe final interview was supposed to be 45 minutes but mine finished in 30. I had two behavioral questions and one coding. The coding one was a leetcode medium dynamic programming, and I'd never tried to solve it before but it was straightforward. I also didn't do the final interview coding perfect on the first try, my interviewer gave me some criticism which I used to improve my answer. I had 5/7 on OA1 and 1.5/2 on OA2 (half testcases passed for the last question).\n\nThe position said Seattle, I requested Bay Area, and I ended up getting DC Metro Area. I had no referral / recruiter, I just cold applied.\n\nAlso for anyone who's interned at Amazon, do I need to do anything to get a background check or is that process automatic?",
        "permalink": "/r/csMajors/comments/ou34rg/i_got_the_offer_for_the_amazon_sde_summer/",
        "comments": [
            "Wow that seems super quick. So it's just OA then a interview -> job offer?\n\nI applied to a position in Canada and I'm waiting for that :)\n\ncongrats!",
            "congrats! but also wtf I'm only halfway thru my current internship at amazon lmao",
            "Congrats!! \n\nI got exactly the same scores for OA 1 and OA 2 on the same timeline, but I’m still waiting for either an interview invite or rejection :,)",
            "[deleted]",
            "Congrats from current Amazon Intern. But wow they start applications so early this year or was my year weird? I applied around December, received OAs and interviews through January to February and got offer around March for the summer internship.\n\nAnd to your last question, you don't need to do anything for background check. Once you accept the offer more emails from student programs will be sent out to you regarding your on boarding process. The background is towards the end, you fill out a form and some third party does the check. Mine passed in an hour lol. Don't feel rushed tho, you got accepted so early the onboarding emails may not come in yet. Some only come in within the last 1 to 2 months of your internship start date.",
            "congrats! I finished OA3 this monday and haven't heard back yet. Soo nervous",
            "Congrats! This gives me hope that I will possibly get an interview. I got 16/16 and 11/16 on my OA (i had the new format, took it yesterday)",
            "[deleted]",
            "Congrats! I got my offer last week and am super excited!",
            "Congrats. Sounds like the smoothest possible interview process and great location.",
            "Can you share an anon resume?",
            "Huge congrats! What year in school are you?",
            "[deleted]",
            "[deleted]",
            "Is it true that if i apply and get rejected, i can reapply after 6 months?",
            "Damn, if I was given a DP problem for my final interview I woulda failed it straight up lol",
            "Just received my email outlining the next steps for the OA. Is there no debugging portion prior to the coding portion? I attended a career fair over the summer and I remember that being the first step of the process.\n\nAlso congratulations!",
            "Congrats! I also got the SDE Intern offer for next summer in Seattle :) My experience was similar to yours! Also I got more information roughly a month after I accepted my offer, and it includes all the onboarding info--things like start date/background check info, etc, so don't worry too much about it now :)",
            "[deleted]",
            "Congrats! Readying up for my final interview next week, but honestly so nervous for the coding question!",
            "Wow, congratulations! Did you apple online?",
            "HUGE CONGRATULATIONS! That was fast. I just finished my OA3 yesterday, so finger cross on whether they are going to invite me or not for interview.",
            "Congratulations!!!",
            "Congrats!!",
            "This post really helps me. Thank you!",
            "Congrats on the offer! Is there a deadline to accept it?",
            "How does the position location selection work, if you don’t mind me asking? Did you rate a few locations or end up getting DC Metro Area pretty randomly?\n\nCongratulations on the offer :)",
            "What does OA stand for?",
            "I just started internship searching, did I start too late?",
            "[removed]",
            "Bro congrats!! You mind helping me with some tips?",
            "Congrats homie!",
            "Can someone please explain to me on what a OA means",
            "Nice job man you got an offer and crashed their stock price",
            "Would you mind posting your resume once ? I’m a rising sophomore and really wanted to see how to get past the reaume screening",
            "Congrats!!! I’m gonna start there next week. When are you going to join? I’d love to meet. Have a great time there and enjoy the moola",
            "Congrats!! 🥳 I am so happy for you! You’re gonna do great! I am in the process of applying right now. Wish me luck! ☘️😊🥲",
            "Congratulations! All the best",
            "Congrats! Ignore the people commenting about “ugh another Amazon post” these really help out students and it inspires people as well!",
            "I applied from Amazon student portal for the same Seattle position like 3 weeks ago but no reply yet :(\n\nEdit: congratulations OP :)",
            "Can you clarify what an OA looks like? I also just submitted my application!",
            "Congratutions!",
            "Jesus Christ now everyone that receive an offer has to make a post?",
            "[deleted]",
            "Well...Good Luck",
            "If you will be relocating how are you going to be doing your schoolwork? Everything online? If classes were in person how would this work?",
            "Was the intern for amazon aws sde 2022?",
            "Did you applied in amazon university jobs portal?",
            "Was it for Amazon or AWS",
            "Hey does your job id start with 155 or 161? Many of my friends and I applied to the 161 one and have been waiting for the interview survey for more than half a month. Heard that the 155 one moves much faster",
            "[removed]",
            "Does everyone who applies to Amazon get an OA or do you get OA after an application screening?"
        ]
    },
    {
        "post_id": "kf9b6a",
        "author": "neonbluerain",
        "title": "It's 3:44 AM here and I just got the L from Amazon",
        "url": "https://www.reddit.com/r/csMajors/comments/kf9b6a/its_344_am_here_and_i_just_got_the_l_from_amazon/",
        "score": 402,
        "num_comments": 25,
        "created_utc": 1608248743.0,
        "selftext": "just saying rejections hurt extra hard when they come in at 3 am. back home after finals and this is the first thing I am hit with. this shit breaks you I swear.",
        "permalink": "/r/csMajors/comments/kf9b6a/its_344_am_here_and_i_just_got_the_l_from_amazon/",
        "comments": [
            "All it takes is one acceptance. \n\nSame time last year I was prepping and giving interviews even when I travelled home (another country) for holidays, because I was rejected many times and wanted to grab on to every opportunity I had. This year I'm going home taking leave of absence from my company and spend time with my family :) \n\nDefinitely, things will turn around for you! All the best.",
            "You will lose most of your battles in the job grind friendo, but as long as you persist and learn from your mistakes and stuff, eventually you will win the war. \n\nSorry about the L. It hurts, but just know that most of us, even the really successful among us, have gotten a lot of L's at different points in the journey. You'll be alright.",
            "[deleted]",
            "same thing happened to me a month back and I was devastated bc I though it went well, but it was a good experience moving forward in the intern process! it can only go uphill from here and I’m rooting for you :) take ur experience from the interview and make sure you refine your approach to future interviews!",
            "Lol. I bombed the OA a few years ago. Even knowing it’s coming it still hurt.",
            "Bruh your applying to AMAZON chill. AMAZON. FUCKING AMAZON. LITERALLY A FUCKING TOP TIER COMPANY. BRO SO MANY OTHER PEOPLE GOT REJECTED YOUR FINE.",
            "Hang in there.  I got rejected to Google my first time as well, and nailed it later on.\n\nWork on yourself, figure out what you could do better next time, and push through the disappointment.",
            "I never even got the OA. On top of that Okta cancelled my final. 300 L's later I finally got an offer from a localish unicorn. This shit is the worst I completely relate, but I like to think the grind will all be worth it in the end",
            "[removed]",
            "Just remember this. Take it in. Its these L's that make the W, just. so. rewarding. So prideful. So victorious.",
            "Woke up this morning to get a rejection (failure number 60/100) from a company whose role really appealed to me. And a few hours later I have my real analysis final exam (by the time you read this message I may have finished that already).",
            "Head up king. Don’t let it get you down. Keep applying don’t stop!",
            "gets better dude i promise\n\nalso just commenting cuz i was scrolling and saw this while taking a break from studying for finals, it’s exactly 3:44am rn and kinda spooked me lol",
            "If it makes you feel any better, I got hit with an L from Point72 at 7:08 pm, an L from Paypal at 3:08 am and then another L from Workday at 3:42 am.  I thought I nailed Paypal and Workday (got destroyed by Point72 lmao).  Just did a super easy hackerrank for IBM this morning, so hopefully that proves fruitful.  Gotta keep grinding.",
            "Yooooo we freaks out here bro. We love the abuse😳😡. Also, gg bro, next time we gettin it💪🤓",
            "Dude the interviewing process is so cruel. It’s all about luck (if your not John von Neumann)",
            "Amazon interviews are awful, don't feel bad.  It sounds like an exciting job, but it's usually talked about as one of the most toxic places to work.  I've interviewed with them 3 times, and each time was absolutely horrible.  The engineers doing the interviews have such an arrogance about them and ask honestly bad questions.  The leetcode questions have nothing to do with actual ability.  Count yourself lucky you're not getting into a hell hole like Amazon.",
            "[deleted]"
        ]
    },
    {
        "post_id": "16n4vul",
        "author": "kidpunkYG",
        "title": "Java is just a beautiful Language",
        "url": "https://www.reddit.com/r/csMajors/comments/16n4vul/java_is_just_a_beautiful_language/",
        "score": 398,
        "num_comments": 139,
        "created_utc": 1695163851.0,
        "selftext": "Here I am, working at a FAANG, and having to read all this code from python and Go, and it’s barely legible. It requires so much digging into layers and layers just to understand what something is. \n\nI go for a second and look at Java code implementing the same thing, and it’s just instantly so easy to follow. You get to know immediately what every variable is, what every function returns and takes in, what every data structure holds. Just amazing. \n\nIronically the #1 biggest complaint is that it’s too verbose. Ultimately, the more verbosity the better. Code in large systems is meant to be read more often than it is written. It takes an extra couple of seconds to hit tab and allow IDE auto-completion to complete the verbosity you were typing, but it sakes hours and hours and hours of dev time when other SWEs come back to read and attempt to understand your code.",
        "permalink": "/r/csMajors/comments/16n4vul/java_is_just_a_beautiful_language/",
        "comments": [
            "It the opposite for me. Going into java and having to dig through 5 levels of inheritance and 5 design pattern for a thing that could have just been a function in go or python is not fun at all. Java devs love to abstract even if abstraction is not necessary.  But python without types indeed sucks for bigger projects",
            "I just like Java cuz it’s the first thing I learned lmao",
            "Careful, the people who have only taken intro to programming with Python won't like this. \n\nJava is really verbose, yes, but if anything, it makes the code self explanatory, in my opinion at least. \n\nBesides, most people that teach java are stuck on java 8 and teach really outdated stuff. My prof deadass thinks java 11 is the \"latest and best\" version. Our OOP class doesn't even use records or sealed classes. \n\nI love Go though lol. It's simple and doesn't have weird shit like list comprehension. Also kinda verbose but not as much as java. \nI would definitely choose Go over java simply because go binaries don't need a virtual machine. \nGo's memory footprint is really small compared to Java. \nThe short initialization is also handy. \n\nSorry I'm just rambling. I'm pretending as if I'm typing something important just so someone doesn't talk to me. \n\nThe reason why python and JavaScript are really popular is the reason why I hate them. I had to use JavaScript for a job though lol. Worst period of life. \n\nI like when everything is tight and \"strong\". I shouldn't be able to compare a string to an integer. \n\nOkay they're leaving byeee lol",
            "No offense to Java but your Company's Go and Python devs must be drinking on the job if their code is less readable",
            "The only people who like Python for full application development are those who have never had to actually go debug a complex system implemented in a dynamically typed interpreted language. Because that process sucks, every time.\n\nPeople complain about compilers or errors in C/C++ or Java or that they're verbose, but the fact of the matter is I can almost always isolate and fix a bug in a few minutes in those languages versus the potential few hours of hunting down undefined behavior introduced by dynamic typing.\n\nLet's not even get into mess that are generic containers in Python either :(",
            "C/C++ better",
            "I too like to read 7 layers of inheritance just to still have no idea what an object does",
            "We love Java in this household.",
            "Java feels like an archaic version of C#.",
            "Agree. Going from a C# to a python codebase makes me want to cry",
            "java is for the strong",
            "Java is the best love using it for my job",
            "I'm more comfortable in Java but I still think I can get more comfortable with python fast if I try to do more work in it.\n\nI do love Java more though.",
            "Go is verbose and statically typed too",
            ">Ultimately, the more verbosity the better. Code in large systems is meant to be read more often than it is written.\n\nYeah, and reading something that is short and to the point is a lot faster and easier than trying to understand a huge mess of various OOP patterns spread out over multiple files. For the extreme version of this, see https://github.com/EnterpriseQualityCoding/FizzBuzzEnterpriseEdition , which of course takes it to an extreme, but a lot of Java code kind of feels like that.",
            "I mean good python developers should still be using type hints and good design",
            "That is because you are mostly working with people who are good engineers. If you’re worked in a codebase where people think DRY means you need a for loop factory, you will understand why people hate java.",
            "Until you read some JavaScript",
            "This is an oracle psyop",
            "Fr. I think object-oriented programming cracked the code for me when it comes to programming. I like java",
            "Readability always trumps writability. Always.\n\nJava’s balance between expressiveness, performance, stability and easiness to implement is second to none.\n\nType safety, Memory model, performance and etc and etc. You name it. \nThe language has solid and clear conventions, patterns, no “undefined behavior”, remote debugging, and unparalleled toolset.\n\nPerformance wise, it could be mere 20-30% slower than C/C++. (Trust me I work in low latency environment). Python is 30-40x slower. However it’s unfair comparison, since Python is a different category language.\nSo when you don’t need double digit micros, Java is a go to.\n\nPython is older than Java. And it was almost nonexistent in general purpose adoption for decades. Until academia picked it up (due to its easiness and syntax sugar), and build up ungodly amount of math and research libraries.\n\nEverything has its use. I’d use Python for small research projects. But anything backend, general purpose - Java 99% of time.",
            "It's even better to write code in a concise language and then put a lot of comments explaining high level logic in the code (what the next 10-20 lines of code are doing as a whole).\n\nThe issue is that I have pretty much never seen any project have this level of documentation. I don't know whether this is due to negligence or the preverse incentive that writing hard-to-understand code makes the company more reliant on you to maintain the codebase.\n\nOn the topic of Java, I really like the language and with some recent additions like virtual threads I am seriously wondering what even is the point of languages like Go. And I also program in Kotlin which kind of kills the appeal of Python with how fast and easy the syntax is.",
            "Skill issue",
            "Java is unironically a good language. Unfortunately, it has mental illnesses like OOP and design patterns.",
            "LOL                \nthis is sarcasm, right ?",
            "You're expressing your opinion as fact",
            "The points you bring up suggests that Go is better than Java. Also, you starting your post with \"working at a FAANG\" suggests small pp energy and gives a newbie vibe off. Most FAANG engineers know we are just cogs in the greater machine, easily replaceable and mostly insignificant, and frankly, the term has been used as clickbait for fools who don't know better.",
            "Java is better. Python is for math, oop is the best way to program",
            "Java is just worse C# and you won't change my mind on that. Having said that, I'd take crappier C# (java) over python any day. I still don't respect python over significant whitespace, dumbest fucking idea ever.",
            " I can't begin to understand how you say more verbosity is better. I hope you work for Oracle. Java is bloated, verbose, and slow. It's based on the philosophy that Object Oriented Programming is the correct approach for any programming problem which is obviously ridiculous. C++ has every possible thing you'd want from the object oriented side of Java + Speed + the option to do procedural programming which is probably the best approach for most problems anyway. And, for those of you who are going to complain about pointers and segfaults, cpp reference is free and available online read it carefully. If you need pointers to understand pointers, just sign up for a class and learn. And for those of you who say, \"i sHoUldNt hAvE tO wOrRy aBoUT tHat\", I will have you know at the end of the day, under the hood that's whats going on. Most complaints about C++ come down to one thing: SKILL ISSUE. Get better and learn the only high level programming language that trusts the programmer with full access to their resources.",
            "OOP is a disaster and in most cases the antithesis of productivity.",
            "Java is just glorified language by the nerd community who don’t want anyone else to come to IT",
            "I like swift. \n\nVerbose, Static Typed, Modern, less boilerplate.",
            "Java becomes bad when you try to incorporate OOP and its design patterns in every code . But it becomes beautiful and concise when you use it accordingly plus you mix it with functional programming . Its verbose yet pretty straight forward . On the other hand , eveytime I see a python codebase, it seems like it has a higher cognitive load to understand what just happened.",
            "Just wait until you encounter Guice",
            "i thought i was the only one who thought this lol ppl thought i was crazy\ni still prefer python, but i still like that java is verbose it does make things easier to understand at first rather then digging thru multiple python levels. it all depends really but i get what you mean",
            "No that'd be JABL",
            "I can understand criticism of Python. Having to drill through code for type information is a pain. But, it does have type hints now, so the issue is drastically reduced imo. Are you guys using typehints?\n\nI'm not sure what you're taking about with golang. It's statically typed and succinct. Unless you're complaining about inferred typing?  You can just hover over the var for the type info.",
            "Type hinting, docstrings, and good naming habits resolves a lot of those issues in Python.",
            "Ngl, I opened this post half expecting shitpost. Yeah, I kinda agree. Dynamically typed languages are easier to work with, but it is definitely harder to read. All the reason why Typescript is so popular",
            "I love writing in Python, but prefer reading Java.\n\nFor personal projects, I would always choose Python, but for large project I totally agree, Java is so much easier to understand and do things the right way.",
            "My company has 9 products fully coded in java and those works like charm even those are easy to maintain 🙂",
            "Hate reading AI Python code",
            "At a FAANG using Python for a legacy project as well and can confirm that it absolutely sucks trying to debug. PyCharm’s debugger helps a ton but it’s still a difficult process",
            "Java just has a lot of established conventions that are well known throughout, so it helps with readability and recognition.",
            "easier to read more tedious to write",
            "Fr",
            "I 100% agree",
            "Bahahahahahaha.\n\nMother fucker wait until your smooth brain learns Haskell, Ocaml or F# or a LISP.  Then come and talk about beauty in a language.",
            "`SimpleBeanFactoryAwareAspectInstanceFactory` entered the chat.",
            "Java is my go to",
            "You’d probably love working with typescript.",
            "“python is bad because my coworkers write bad python code”"
        ]
    }
]