[
    {
        "post_id": "zv6aic",
        "author": "spritejuice",
        "title": "I need the next mark Zuckerberg to make me a Billionaire",
        "url": "https://www.reddit.com/r/csMajors/comments/zv6aic/i_need_the_next_mark_zuckerberg_to_make_me_a/",
        "score": 399,
        "num_comments": 53,
        "created_utc": 1672001179.0,
        "selftext": "Dear cs students of Reddit, If you're thinking of dropping out of college to start a startup, DM me. \nI am interested in 60% equity, 100k per year salary, 20k housing stipend and work from home. \nI know we can do it together  ᕙ(*•̀ᗜ•́*)ᕗ",
        "permalink": "/r/csMajors/comments/zv6aic/i_need_the_next_mark_zuckerberg_to_make_me_a/",
        "comments": [
            "Hey, thanks for asking. \n\nFor your job interview, I will need you to make a functional teleporter. My company’s goal is to get acquired by Amazon, who could use our teleporter to replace their existing transportation system. The pitch will be “One Second Delivery”.\n\nI will need this by tomorrow. Depending on the capacity of the teleporter, I will consider whether or not to bring you onto the team.\n\nUpdate: \n\nOP, we just received your teleporter. Although we were impressed by its throughput of 10,000 packages per hour, we have decided not to move forward with your candidacy. \n\nAs discussed in the 69 page contract you’ve signed, we hold all rights to the teleporter you’ve sent. Should future employment opportunities present themselves, we will reach out to you again.",
            "Do you also provide free CBT?",
            "You make a tough bargain.  How about, 80% equity and 350k/year salary with a guarantee 6% raise year over year?",
            "Sorry I only accept exposure as payment",
            "Wait, you want 60% and the salary? And we do the coding?",
            "I’ll make you a billionaire if you can make a Time Machine and give me all rights and patents to it",
            "How about no salary or equity but you get paid in experience 🤗",
            "considering the guy who painted zucc's office walls for equity, the chance of this scenario happening is greater than 0%",
            "This sounds great. You are hired. \n\nOnly condition is that you do all the work, and your pay never exceeds the company profits.",
            "The logic in these sentences do suggest you dropped out of cs",
            "Hey, glad I'm really.\nI'll do the same for 59%, $99.999K, and a campervan!",
            "I'll do it for $1.89, an expired Starbucks gift card, and a Hershey bar from 1963.",
            "Stop and think about the design of your company and the design of the product, you are running a business after all, this is your responsibility ultimately! Do all this before hiring anybody because it costs $$ and you can lose big time if you’re not careful! If this fails, it’s on you! Consider the risk! And once you’ve done that and thought about the likelihood of survival for your ambitions to build in the market to compete, and you have investors backing you, then hire people!",
            "Sure, I’ll pay you 100k and 60% of that will be equity."
        ]
    },
    {
        "post_id": "uwvksl",
        "author": "entercenterstage",
        "title": "Can we please stop",
        "url": "https://www.reddit.com/r/csMajors/comments/uwvksl/can_we_please_stop/",
        "score": 399,
        "num_comments": 48,
        "created_utc": 1653411764.0,
        "selftext": "If I see one more goddamn \n\n“How do I meet _____ as a cs major” I’m gonna stab my knee.",
        "permalink": "/r/csMajors/comments/uwvksl/can_we_please_stop/",
        "comments": [
            "Alright, when we first start getting meme posts a few years back I thought they were neat, just an occasional laugh was fine. If it's too much I'll start taking them down when I see them.\n\nThis is the problem with a sub getting popular. Anything funny that's done well will immediately get overdone. Maybe we should have a rule that allows new and innovative shitposting, but bans obvious knockoff shitposts.\n\nEdit: I also want to take this time time to say, to all those people who tell mods, \"you don't need to mod posts or comments for content, just let the upvote and downvote system do its job.\" You are fucking stupid. This is what happens if you just leave things to upvotes and downvotes. People can't fucking help themselves. It's like letting a toddler decide how much candy is okay.",
            "In typical CS major fashion, people don't have the social skills to understand when a joke has lost its steam. What a surprise... lol",
            "Honestly, we're really beating off the dead horse at this point",
            "This is what happens when the only social interaction you get is through reddif",
            "This sub used to have really useful information, which I used to get internships and eventually a full time job. Now it’s all shitposts and useless memes. I think it’s great, because now I don’t have to worry about the younger generation taking my job.",
            "DONT YOU PUT THAT EVIL ON ME RICKY BOBBY!!",
            "Write a bot to filter them out easy as that",
            "No, Leetcode\nAmazon",
            "[deleted]",
            "Grind Leetcode and you can stop",
            "Grind leetCode AMAzon nN",
            "How to meet a CS Major while studying CS?\n\nWe have two or three CS Majors in total I see, in my course. Meanwhile my zoology student friends have been petting Cs Majors they find in their course. My lessons are already online so i dont get to meet much CS Majors. Im still in uni. Any advice?",
            "Hello OP, How do I meet you as a cs major?",
            "How to meet someone who doesn’t shit post while studying CS?\n\nWe have two or three non shit posting CS Majors in total I see, in my course. Meanwhile my zoology student friends have been petting non shit posting CS Majors they find in their course. My lessons are already online so i dont get to meet such CS Majors. Im still in uni. Any advice?",
            "Find a good wheelchair first. You will see them again definitely.",
            "But I really want to know how to meet JAY-Z as a CS major!"
        ]
    },
    {
        "post_id": "tjdgia",
        "author": "Adventurous_Pie_1181",
        "title": "I studied for a Calculus 1 exam all week, stayed up until 5am this morning. I still did horrible.",
        "url": "https://www.reddit.com/r/csMajors/comments/tjdgia/i_studied_for_a_calculus_1_exam_all_week_stayed/",
        "score": 398,
        "num_comments": 163,
        "created_utc": 1647873997.0,
        "selftext": "I probably studied over 50 hours for this derivative exam, I dont know my grade yet but I know I did horrible because the answers just didn’t feel right. I don’t know if I can keep doing this, this exam really humbled me especially after getting an A on the first exam.\n\nUPDATE: ended up with a 55 on the exam, bummer, I already felt my grade to be around there. Good news is the class average was a 56, lowest grade was a 24 and the highest a 79. Definitely learned my lesson on this one, i will be studying more throughout the unit rather than trying to study everything the last week.",
        "permalink": "/r/csMajors/comments/tjdgia/i_studied_for_a_calculus_1_exam_all_week_stayed/",
        "comments": [
            "Perhaps I am in the minority, but I feel that one mistake was staying up until 5AM. Never underestimate the power of a good night's rest the day before the exam.",
            "check out professor leonard on youtube and do tons of practice problems. Breezed through Calc 1,2,3 doing this. Don’t memorize, understand steps and the process",
            "Sadly studying a little everyday and sleeping at a normal time is more efficient. Cramming resulted in either low grades or a good grade where I would forget the content instantly. Course good study habits are hard to come by so good luck. School is also about teaching yourself to be a better person.",
            "In my experience it’s nearly impossible to ace a math exam by cramming stuff..",
            "I think every one of us here has had that one test we absolutely bombed. For me, it was a precalc midterm (Yeah, I started behind the ball on math) that I got a 54% on. Completely bombed it. I distinctly remember one question I got wrong because I hastily had 7 + 4 = 13 in part of my calculation. \n\nPoint is, we've all been there. It's not the end of the world. If you did in fact do bad on it, try and get some time with the tutor or professor to go over it. Derivatives are pretty important so you want to make sure you understand them. If I'm struggling to understand a concept, it helps to have it explained various ways. One is sure to click with me.",
            "They used cal to kill your dreams. Unironically, college calc was the hardest class of my cs degree. I even took cal 3 later in my degree and it was easier than cal 1-2. \n\nI'm sure every school is different, but at my school, you could find the old midterms/finals online and I basically practiced those so I would know what to expect for my final.",
            "Just my cup of tea, preparing for calculus tests, I try so solve a test, go over the correct answers, see where I got wrong, and repeat with another tests.\nPractice is king",
            "Every calc exam i ever took went that exact same way.  Had to take the slow year long version of calc 1, and had to retake calc 3.  Gots Cs in all of them, still graduated and got a job.\n\n  You'll be absolutely fine until the minute you stop trying",
            "I think the problem is that you studied for a week, this would work great for a lot of subjects, and may get you a 100% in them, but Calculus needs time in order for your brain to really absorb it.",
            "it's completely normal to have a class you tried really hard at but still couldn't get a good grade in. so long as you got what you need to progress your studies, don't be too hard on yourself.\n\nit's also always bad news to exhaust yourself before an exam. honestly if you don't know something at 11pm the night before, you're not going to know it at 5am. you're more likely to have the alertness you need to cobble odd marks from here and there throughout a paper if you get a decent rest before the exam.\n\nyour next classes will be better, don't fret too much. you clearly have the work ethic needed to do well. :)",
            "Sleep is very important for knowledge retention. Everyone has atleast once made the mistake of not sleeping the night before exam, be it due to the coursework that still needs to be learned or due to lack of confidence. I was a major insomniac in the exam week and used to study as late as I can to get an extra edge. But I noticed, even though I knew more concepts, what was lacking was ability to connect the dots. That assimilation only happens when you sleep.\n\nIf you have more questions on why sleep is important for normal brain function and focus, I would suggest reading  \"Why We Sleep, Book by Matthew Walker\"",
            "[deleted]",
            "Skill Issue.   \n\n\n\n/J \n\ni fucked calc 1 too, its just repeated practice imo",
            "If you studied 50 hours but ignored homework, didn’t pay attention in class and did not practice derivatives then you are studying Math wrong way. \n\nYou need constant practice during the semester in order to Ace the exam, not 3 days prior to exam. \n\nAlso, you should have a good night sleep the night before the exam. \n\nI am saying this from experience. I dropped out because I thought I was dumb and couldn’t understand shit. Failed almost in every class. Took a long break and restarted college again. Got A on Cal I & Calc II, and was offered a job as Teaching Assistant from the Professors. This, because I changed the study style. Practice every day, and Google is your best friend if you don’t understand something from the class.",
            "\\- stays up until 5am\n\n\\- fails because sleepy af\n\n&#x200B;\n\nTry to find the mistake bud",
            "bro don't go into an exam with no sleep. I winged lots of important exams with barely to no review and still passed because I slept well.",
            "Alot of people do poorly or completely fail calc the first time. I barely passed.\n\nAre you going to office hours?",
            "Just make sure you’re doing a ton of practice problems! Making sure you can do the homework problems perfectly is always a good metric for how prepared you are.\n\nAlso, strongly disagree with other comments on the post. If you don’t know the material (as in maybe you weren’t going to class, or you didn’t do a homework assignment), staying up late is INFINITELY better than going to bed on time and just not learning the content.\n\nHowever, if you were studying all week, I feel like you mostly knew all the material somewhat and were just reviewing, so in that case, going to bed earlier is definitely better! For me, I try no later than like 3, but whatever works for you.\n\nBad exams happen. Just don’t let it discourage you and keep up the hard work so you’re ready for the next one!",
            "I structure my studying so it's all done two days before the exam. Then the day before I workout like crazy (better sleep that night + tired body redirects extra energy to mind) and just skim/review the day before/day of.",
            "Sleep at least 2 hours before exam, it’ll make a huge difference.",
            "You're not studying right probably.  Maybe go to a tutor and see if they can help you.  However, considering you say you got an A on the first exam, you may have not done as bad as you think.  Also, as others have said, sleep is more important than you think.  Just because you're young and your body can easily stay up to 5 am, doesn't mean your brain likes it at all.",
            "First: 1 week to prepare for an exam at the university is equal to nothing if you are not the top of the top. \n\nNext time study at least 3 weeks before the exam so you can build the knowledge not just memorize it and get stressed about it. GL next time",
            "Always get sleep bro. Wake early and study rather than staying up till 5. Past 1 am you won’t retain anything",
            "I can tell you that no sleeping your 8h will affect you in the long run",
            "I had a similar problem. Studied for about 3 weeks for my maths exam, did well in my studies. Then come to exam and I only get 50% (it was multiple choice with 0 marks for working out). Then the year after it was a proper exam, open book and marks for working and studied for ages and still only got like 60% but now I don't have to do maths anymore.",
            "Fellow CS major who struggled with calc here. I was able to get through Calc I okay, but failed Calc II and waited a few years to re-take it. Here’s what worked for me on the second go around:\n\n-\tFirst and foremost, I found a new professor. I had the same professor for Calc I & II and I didn’t love her the first time, and really didn’t like her the second time, but she was the only prof that worked with my schedule. If you don’t LOVE your prof and you end up retaking this class, consider looking for another one. On that same note, my college offered both regular Calc classes and “engineering” Calc classes which were basically the same, but only 4 credit hours instead of 5, and somewhat applied concepts more to physics/engineering which I personally found very helpful. A good prof can make all the difference in any class, but I’ve found it to be absolutely essential for math classes.\n-\tJust like CS, don’t try to memorize formulas and answers, focus on the algorithms and if you’re confused on a certain type of problem, try to zoom out a bit and see if you can figure out how to actually build up to the algorithm and/or formula that you need. There have been formulas that for the life of me didn’t make sense, but I would go to office hours or a tutor and have them explain how this formula actually came to be and then it would all click. Sometimes understanding the foundation of something like that can be way more helpful than just memorizing a formula and trying to blindly plug it in. \n-\tFrom my last point, utilize office hours and any tutoring services you have at your disposal. I worked full-time (40 hours a week) and did 14 credit hours a semester, and I still made time for both these things. What I would do is right after Calc class (or your soonest break after it) go sit inside/right outside your prof’s office and start working on your homework. This way it’s fresh in your mind from class, and as soon as you get stuck on something, they’re right there to help you out. IME office hours are rarely utilized by other students, and most profs are very willing to help you out once they see that you’re really trying. Tutoring can be the same way, and for me having both was really helpful in different ways. Calc comes easy to some while others such as you and I really have to work hard at it, and in either case, many of those people end up tutoring the subject and can help you do things the ways that worked for them. Study groups can be helpful here too, but sometimes that’s the blind leading blind - either way it’s another thing to at least try. Regardless of whatever tools you have available to you at your school, USE them!\n-\tAnother tool I used religiously and really loved  was the Khan academy videos. That dude can explain just about anything and have it make sense. I can’t tell you how many hours of those videos I watched, again while I was doing my homework and applying it to the problems I was actually working on. For me, blindly trying to come up with a solution on my own that I didn’t actually understand got me nowhere. \n-\tAs others have said GET SOME SLEEP! Don’t ever stay up late studying the night before an exam. Say no to going out with friends or playing video games that night and study during that time and go to bed at a reasonable if not early hour. It makes a massive difference in your brain’s ability to focus and recall the stuff you’ve been working on and it’s not optional. Don’t pull an all nighter, don’t get a few hours of sleep, don’t supplement your lack of sleep with adderall and/or caffeine - just get 7.5 hours of sleep as consistently as possible and especially before exams. \n-\tI found that I performed the best on exams when I was in a good headspace. I started a routine before any big exam where I would get up a little early, go get some of my favorite food/drink, listen to my favorite music, and very lightly study for about 30min - an hour before my exam. It doesn’t have to my some drawn out thing, and often for me it was just spending a couple extra bucks on lunch, or grabbing a donut and some Starbucks, but taking that time to just get in the right headspace always left me feeling energized and really mentally prepared for an exam. It sounds kind of dumb, but it really helped me out. \n-\tSlightly unethical, but you’re a CS major and you won’t ever need this shit so I say go for it, but cheat when it makes sense to. Now don’t be a dumbass and copy answers from other people, do some nonsense coughing with your friend, or try to print tiny text on your water bottle and read it. For those formulas that you do need to memorize, just type them into your calculator’s programs menu or download a tool from the internet. Obviously this doesn’t work if you have one of those shitty prof’s who make you clear out your programs before exams, but in my mind, there are times where some “cheating” can make sense and some prof’s even get that in the way of open book tests, allowing you a note card, giving you the formulas, whatever. It might even be worth bringing this up with your prof if it’s something you struggle with and just be like “hey, I’m having a hard time memorizing these complex formulas and I’m trying to focus more on how to use them and solve problems than just memorize this stuff. Would you allow us to use some tool during the test to reference these formulas so that we can focus on the important stuff?”\n-\tLastly, know you can do it. I didn’t try hard enough in Calc I and that probably set me up for failure in Calc II, but I also just didn’t believe in myself. I told myself I sucked at Calc, that this shit didn’t matter, it wasn’t relevant for me degree, and studied hard, but I wasn’t genuinely trying to learn anything. I re-took Calc II as a junior and had grown some by then and set my sights on an A. I told myself this was it, I’ve already wasted money on one F, and that if I could figure out how to code some of the shit I had by that point, I could figure out how to do some math. You’re smart and you can do it. \n-\tBonus tip: learn physics. If you do retake this class or a future Calc class, try to do it alongside a physics class. And if not, try to learn a little now on your own or from a tutor. Knowing *why* calculus exists and how things like derivatives are actually used in the real world can be super helpful for understanding calc.",
            "Man just sleep. I am a math major (ik wrong subreddit) but never stay up too long. Get at least 5 hours at worst",
            "Ey bro don’t worry about calc. It’s ok if ur bad at it just do a lot of practice problems. That’s the only way to get better. I barely got a B in calc 1, failed and retook calc 2, but then I decided to grind out problems and finished the calc series just fine. Organic chemistry tutor carried me.",
            "Fuck calculus, we shouldn’t even have to take it for cs",
            "I really recommend you practice some of the exercise everyday. Have a good sleep before the exam.",
            "Hey I am sorry man calc1 is tough especially the first half. I got lucky and had an engineer for a tutor who just said fuck that shit when I needed help with the algebra solving for h. \n\nShe told me the following magic trick with a chart. If lim goes to infinity make h really big(99999999); \nIf lim goes to zero make h really small(0.000001)\n\nThen solve for it on the calculator if h is in the numerator it’s infinity if h is in denominator it’s 0. \n\nThere was more but I forget. \n\nHowever!!! The second half of calc 1 is much easier!!!! I swear you will never use the stupid h shit in calc 2 either. You can do it man!!!",
            "I'm preparing a new Calculus 1 playlist , with deep explanations , proofs and visualizations with goal to create deep understanding of the subject.\n\nHope it will help you to prepare for the next exam.\n\nPlaylist:  [https://www.youtube.com/watch?v=wyh1T1r-\\_L4&list=PLfbradAXv9x5az4F6TML1Foe7oGOP7bQv&ab\\_channel=Math%2CPhysics%2CEngineering](https://www.youtube.com/watch?v=wyh1T1r-_L4&list=PLfbradAXv9x5az4F6TML1Foe7oGOP7bQv&ab_channel=Math%2CPhysics%2CEngineering)\n\n&#x200B;\n\nhere is a sample video that explains the notion of sequence convergence:\n\n[https://www.youtube.com/watch?v=viVg2kd-hKo&list=PLfbradAXv9x5az4F6TML1Foe7oGOP7bQv&index=9&ab\\_channel=Math%2CPhysics%2CEngineering](https://www.youtube.com/watch?v=viVg2kd-hKo&list=PLfbradAXv9x5az4F6TML1Foe7oGOP7bQv&index=9&ab_channel=Math%2CPhysics%2CEngineering)\n\nplease tell me what you think.",
            "Calculus 1 is tricky. You go in thinking it’s going to be supper difficult. You take the first exam on limits and be like “this is not so bad”. That builds your confidence up and then you get hit with derivatives and be like “brah”",
            "I got my ass handed to me non stop by math while completing my CS degree. Failed many courses many times, went on academic probation, had to write letters to faculty to plead to remain in the program, strategically drop courses early so they wouldn't be on my record. It was fucking brutal.\n\nBut I aced my CS courses, and really enjoyed them. Because the majority of my senior classes were CS, and not math, I managed to graduate with great distinction.",
            "Withdrew from calc the first time, failed the second time, passed the third time with a B. Never give up. Try studying with a group of people.",
            "I failed calc the first time and i got a B+ when I retook it. \n\nI tried to always be ahead of the class or right on time in terms of knowing the material. I always aimed to be preparing and studying two weeks before any test. \n\nPrinting out cheat sheets and creating you own helps immensely. Whenever you solve a pretty difficult problem make sure you save it for later and redo it. One of the most important things is getting really good at the easy stuff and not hyperfocusing on hard problems. This can take so much time away from studying and ultimately not matter on the test in some cases. \n\nGo to the tutor as well. Collect all the problems that you dont understand and ask for help.",
            "Group study can be very effective for the next exam, and I have personally found khan academy works well for me\n\nhttps://www.khanacademy.org/math/calculus-1",
            "Lol okay. Wait till series and sequences in Calc two, along much more.",
            "I know I will get downvoted, but frankly speaking if you're struggling this much in calc 1 (50 hours for a single exam is INSANE), maybe you should reconsider a cs major - because classes get much harder than calc 1, or seriously re-think everything with regards to how you're studying and consider if you have peformance anxiety that's impacting your academics.\n\n\nI'm saying this as someone who powered through a few cs classes that I didnt enjoy one bit, and now I'm close to graduating and despise my major.",
            "calc 1 is cringe dw about it",
            "Calc is really easy so maybe study more?",
            "Get a pdf copy of Stewart Calculus.\n\nGo to section you are working on\n\n\nWork through EVERY problem in each chapter. There are atleast 50-75 problems per chapter\n\n\nThis is how I got A+ in calc 1/2. Calc 3 is different so you may not be able to use Stewart for every chapter, but most.\n\nAlso never give up sleep for studying. You are running on expired time- yeah you studied all night but how much of it stuck?",
            "probably the stayed up until 5am didn't help either.",
            "1)  get a tutor or see if your school offers any sort of academic help. You don't have to do it alone.\n\n2)  staying up late is actually one of the worst things you could do when cramming (Yes even though you studied for 50 hours it's still cramming if you're doing as much as you are that late at night).  You're much better off going to sleep at a normal time and eating a normal breakfast rather than studying if you want to do better.",
            "What's worked for me has been two things:\n\n1. Lots of practice problems. This helps me find out if I'm ready for the test, and what I still need to work on.\n2. Whenever I get stuck or confused or overwhelmed, I backtrack to the place where I last understood everything clearly, and slowly work my way forward from there. This can get tedious, but it works.",
            "just pass",
            "Professor Leonard is God.",
            "honestly 1 week isn’t enough. There are people who ace the test even by studying 1 night before, but those are anomalies. Also they have their concepts really clear, have been doing math, algebra, calculus since long..and during the test week they’re just “revising” or “brushing up”. 8 hours sleep is necessary to think clear especially for calculus exam. Maybe try better next time.",
            "Damn this is my biggest worry right now. I start school this fall and I've never been good at algebra. I actually rejected going back strictly due to math in general.",
            "Yup been there, done that. Studying last minute for calculus tests = fail. \n\nAs other people have said... Practice few hours every day one week before the exam. It's the only way.",
            "Why do you think the answers weren't right?\nOne way to know if you really know something is if you can explain it. Can you walk through the exercises that you did? \n\nAlso, as a friendly reminder, a grade does not define how much you know about something. I always try to remind myself that a test is a lottery day: some days you were asked specifically for what you did study, other days you were asked specifically for what you did not study. \n\nDon't give up! And remember: understanding math is not the same as following steps as a robot.",
            "https://youtube.com/c/TheOrganicChemistryTutor \n\n\nhttps://www.learnamic.com/resource-providers/patrickjmt\n\n\nhttps://www.khanacademy.org/login\n\n\nThese are all free sources I used that helped me a lot.",
            "Do you understand *what* you're trying to achieve? That's a big step, and frankly a much bigger one than *how* or *why* in calc I.   \n\n\nWhat exactly is a derivative? What does it represent? What in the world is d/dx? If you can answer those questions, then learning procedurally how to do them is pretty easy: is the term raised to a power? Power rule. Is it a quotient? Quotient rule. Is it a product? Product rule. Is it a composition of functions? Chain rule. Is your teacher asking you to do it according to the definition of the derivative? lim \\[h->0\\] (f(x+h) - f(x))/h",
            "If you ever feel bad about struggling with calculus: don't.  That shit is hard.  It's hard to learn.  It's hard to understand.  It's hard to do.  But it is only for a little while and then you're unlikely to ever need or use it again.  Persevere and be relentless.  You can get through it if you're determined.",
            "bruh don't worry is studied for weeks for my DS exam and did shit, studied for 3 hours for my Algo exam got a 99%. College is all ups and downs, it's not high-school",
            "SLEEP! I only slept for 5 hours on the day of google interview. Cant f*king code at all the next day",
            "I've gone all the way through Calc III and my recommendation for Calc I is to create some Flashcards on the common derivates and every so often just do a tiny review of them. (I would while eating or when I died in CSGO and was spectating). Nothing large or intense, just a small and quick test of which derivatives I knew and which I didn't. \n\nIf you can calculate derivatives you can calculate integrals (for Calc I). Memorizing both derivatives and integrals is double the work so knowing just the derivatives and then working backwards helps save on time.\n\nMy Calc I class had a \"Calculus Bible\" or whatever we called it with just a list of the common derivatives and integrals. I just attended class and studied those derivatives and felt little pressure from Calc I. \n\nSide note: this blew my mind when taking the class so I just like to mention it. Integration is the inverse of differentiation. Just like how division is the inverse of multiplication. It's literally its opposite/counterpart. Integration is a strong tool when applying it to daily life but when doing calculations, I always found it helpful to just think of it as the opposite of differentiation.",
            "I am pretty good at math ( not bragging). I started being lazy in college and would always do my assignments on the last days. However , no matter the reason, I always made sure to not go trough an exam having not slept!! To me, the dead line for preparation  was always a day before the test. After that, no more staying up late; what happens, happens !!",
            "How much was it worth?",
            "How are you studying? I found my studying to work the best when I worked problem after problem after problem.  Use review questions the teachers give you, rework problems you do during lectures, rework problems you do for homework, do review questions at the end of the relevant chapters, make sure to fundamentally understand and memorize any important rules or properties.\n\nMake sure to memorize the things you need to memorize (like unit circle stuff, common derivatives you’re expected to know (sin, cos, tan, etc.), and do lots and lots and lots of practice problems.  \n\nI have notebooks full of practice problems that were just prep for tests.  \n\nIf you do this, I can’t imagine you’ll do worse than a B or C, and you’ll most likely get an A (especially if your instructor pulls questions from the book and/or lectures—they may not be exactly the same, but they’ll follow the same patterns, most likely). There were only a few times I didn’t get outright 100s or very high A’s on tests in my state school (that had very low ~60-65% class averages). \n\nThat said, there were sometimes curveball questions that threw me for loops. Those questions either relied on some extra knowledge I didn’t quite pick up on or know explicitly about some mathematical transmutation or they required a little more creativity than I had to give at that particular moment. \n\n**TLDR:** Much of Calculus can be satisfied with rote memorization. Practice problems from any source you can get, over and over, and make sure you understand why solutions require a particular step while you’re doing it.",
            "**Longterm Short Studying (meaning 1 hour for 2-3 weeks) IS WAY BETTER THAN**\n\n*what you did: Long term Studying for the Shortterm.*",
            "I barely made it through calc 1 & 2 . And now I’m struggling in linear algebra lol",
            "Stop cramming 50 hours before exams. That might’ve worked in high school but it won’t work in college… it takes time to learn this stuff, actually do the homework and don’t use a derivative calculator. How did you get past all of the assignments but fail the exam? It should be similar questions, that’s how calculus is",
            "Welcome to college buddy",
            "\nhours spent studying ≠ good grades\n\nyou gotta really grok the content, and know it inside out. Start with the hardest problems and work backwards to the easy ones -- at the point where you can look at any problem and know exactly how to solve it, then you can pass your exam with flying colors",
            "this happens a lot in uni, school in general is heart breaking like that. just try to study a little bit weekly and not cram too hard",
            "Calc 1 was easier than calc 2. But the calc 1 final was the hardest test I've ever taken, hands down. That includes data structures and algorithms, which was the hardest class I've ever taken.",
            "I was really good at calculus. Unfortunately I have yet to do a single derivative on the job. I got A’s in Calc 1, 2, and multi + DiffEQ… I would probably be doing better had I gotten B’s and don’t more coding practice.",
            "I’m sorry if it didn’t click this time. I don’t know if this will help but there were classes that I didn’t get the first time and later became really good at. The 5 am thing was probably not good. You need rest.",
            "Bro, don’t stay out late nights just before the exam. It feels like you’ll study more but in fact your brain needs some time to sleep and refresh which it ain’t getting. And yeah, do little studies everyday or once every two days rather than doing all at once.",
            "I feel you. I'm in my first sem of Masters, gave 2 exams in Feb  and had 3 lined up for March. I failed both the Feb exams despite working my ass off....so now I retook one of them along with the other 3, and will retake the 2nd one on 28th...I hope I'll pass in both...we just need to keep going!!",
            "Math was that one thing that didn’t make sense until it did for me. I had to watch multiple different YouTubers on the same subject until they explained it in a way that clicked. Keep studying, get a good nights sleep, and stay late with your professor if you can.",
            "A lot of professors will design exams where the average or median performance is roughly 50%. I have stopped caring about these exams and have done much better. I don't even study for them after the professor confirms this is normal for their sections.\nDo the assignments, show up to lecture, read the first 4 chapters of your books, and at least flip through the rest of covered chapters as needed. If you do poorly, communicate with the professor about how to get back on track (tell them you are reviewing work, notes, and lecture materials, ask for resources/advice). I've managed to maintain a decent gpa with this method. You'll do fine and most everyone else is in the same boat.",
            "I did my practice exam 60 times. Was getting all 85-95s took the exam today. 76 lol. I wish I knew what the class average is but it's online."
        ]
    },
    {
        "post_id": "k9ec8o",
        "author": "macodygtm",
        "title": "This is an emotional moment for me. Thank you so much to this sub.",
        "url": "https://www.reddit.com/r/csMajors/comments/k9ec8o/this_is_an_emotional_moment_for_me_thank_you_so/",
        "score": 400,
        "num_comments": 58,
        "created_utc": 1607465563.0,
        "selftext": "Changed my major to CS because of job prospect after graduation (International Student). Moved my graduation from May 2020 to Dec 2020 because I thought I will not be able to get a job during a pandemic.\n\n&#x200B;\n\nSchool ranking: 170 – 200 ranks in National Liberal Arts College US News\n\nAmazon: Rejection\n\nMicrosoft: Got an Email saying I moved to the next round. 30 mins later recruiter said she sent it by mistake. \n\nBloomberg: Rejection after the final round.\n\nFacebook: Didn’t pass the initial screening.\n\nApple: Didn’t pass initial resume screening.\n\nAnd 150 more companies. \n\nJust got a call from my recruiter at Google with Job offer.",
        "permalink": "/r/csMajors/comments/k9ec8o/this_is_an_emotional_moment_for_me_thank_you_so/",
        "comments": [
            "Holy jeebus man, that Microsoft story is just awful. Congratz on landing somewhere.",
            "How? Google's new grad applications for 2021 hires haven't opened yet.",
            "[deleted]",
            "Congrats man!",
            "YAY so very happy for you!! This is amazing :)",
            "Congrats! I love hearing success stories, especially during the pandemic.",
            "Wow congrats! 🎊",
            "Congrats bud! Proud of you 😎",
            "Congrats! When did you applied for this position and when did you got the offer?",
            "Congratulations! That’s a bad recruiter lmao",
            "Congratulations on your offer my friend. Hard work pays off.",
            "Congrats dude 🥳🥳",
            "Congrats bro!",
            "Congrats bro 🎉🎉",
            "Congratulations!",
            "Congratulations brother!"
        ]
    },
    {
        "post_id": "ipr44h",
        "author": "don_the_spubber",
        "title": "Don't buy into the rat race!",
        "url": "https://www.reddit.com/r/csMajors/comments/ipr44h/dont_buy_into_the_rat_race/",
        "score": 402,
        "num_comments": 51,
        "created_utc": 1599691850.0,
        "selftext": "**TL;DR: Burning out before your career even starts isn't worth it. The pot of gold you're picturing at <Your favorite FAANG> won't last forever, so don't break yourself getting there or feel worthless if you don't reach it!**\n\nI'm pretty new to this sub, so this may have been talked about before, but after reading people's posts on here I felt compelled to write about this topic. Whether you're still in the midst of college or if you're like me and working on finding a full-time job, the CS rat race isn't everything it's hyped up to be. It can be really easy to think from reading this sub that there are 0 jobs available and that if you're not leetcoding 24/7 to land a job at a FAANG you're gonna be homeless. This is NOT TRUE! If you're studying computer science, you have a foundation for one of the most important skills for the rest of history: working with computers. There *is* life outside the FAANGs, and there are many many many ways to have meaningful work outside of the Big Tech companies. In fact, I'd posit that it's *easier* to make bigger impacts at different companies, because you won't just be another cog in the machine. There's nothing wrong with wanting a FAANG job! But don't set all your hopes on it and then get burned when it doesn't pan out. You're a really smart individual who has a lot to contribute and who will be able to find a place where you belong and can make a difference.\n\nAnother thing to remember: *we're all at the literal start of our careers.* Please don't overburden yourself with expectations that are way past where you are in life. It's true that you have to start thinking about career stuff pretty early in college, but don't burn yourself out before you even begin the real thing! You have a ton of time to build a solid career. Don't feel like your first job is going to define who you are as a technologist and especially not as a person. Y'all are awesome and you got this!!\n\n&#x200B;\n\n**Edit:** I'm really glad my thoughts have gotten a lot of conversations started! A quick point about ambition/hard work: I am in no way saying that you shouldn't work hard! It is nigh impossible to achieve any kind of success in life without hard work. I wrote this post as a graduating senior at a top-tier CS school who has seen lots of friends and classmates burn out on the job hunt grind. I'm a firm believer that you should try to be excellent at everything you do, and that hard work is one of the only ways to be excellent. My issue/point is that we should be wary of what our definition of \"personal success\" is. If success for you is defined in very very narrow terms, you might be setting yourself up for disappointment down the road. In my experience, having a definition of personal success in life that isn't completely tied to things like where I work has helped me maintain a decent level of joy, particularly in the area of computing. By all means work hard (and in prepping for interviews, practice makes perfect!), but I advise y'all to not tie whether or not you feel like a successful person to a dream job or internship. Hopefully that clarifies where I'm coming from!",
        "permalink": "/r/csMajors/comments/ipr44h/dont_buy_into_the_rat_race/",
        "comments": [
            "This sub and the career questions one really freak me out. I got into this major because of a love of programming and because it's genuinely a career I was excited about. But all of the LeetCode grinding, the constant competition and standards are really intimidating...",
            "I get this perspective but I do want to say that if you put in the work, then the rat race really can be everything it’s hyped up to be. I did a ton of leetcode my senior year and I’m now able to live in a nice apartment in a high CoL city, and I’ll also be able to pay off my $40k in student loans within a year. I definitely wouldn’t have been able to get here without studying really hard, but my point is that hard work will get you really far and there’s nothing wrong with aiming high!",
            "I think the CS job hunt is really different from any other industry and it's important to keep that in perspective. In no other industry are you asked to prove yourself again and again, as many times over, as in CS. If you're a lawyer you pass the bar once. If you're a doctor, no one's going to ask you to perform surgery on a whiteboard as part of the 5th round whatever interview. \n\nPeople always equate CS with quick money but the truth is the heavy emphasis on getting a junior year internship in order to get a job, combined with the ridiculous expectation from companies for students to have the LC proficiency of a competitive coder (never mind the fact that most college kids take data structures like sophomore year) means that being a cs major is just an eternal grind. Don't even get me started on companies that have gpa requirements and impossible hackerranks. Sorry company XYZ, I didn't have time to apply myself in my mandatory arts appreciation class cause I was too busy grinding LC cause that's what you also want you pretentious fuck.",
            " As a successful FAANG employee ( who never finished his CS degree ), I can say that you need to be competent & easy to work with.\n\n I joined FAANG later in my career after several startups that let me try things that I may not have been qualified for at the beginning.  People knew my skills and got me interviews at FAANG companies, and now I've bounced between a few of them.\n\n You don't need the best or fastest coder.  We need  competent folks that can work as part of a team.",
            "[deleted]",
            "I think I needed this today.",
            "lol grinding leetcode can be huge waste of time if you don't end up at the big tech companies. Most small tech companies care more about projects you worked on than leetcode",
            "Respectfully, I think the 'rat race' aspects of this subreddit are what draw people to it over somewhere like /r/cscareerquestions where posts like these have become very popular. \n\nTo be perfectly honest, the general pattern I've noticed on reddit is that there appear to be a core group of pretty technically talented young people (I'm graduated so I'm hardly describing myself this way). These people can and should shoot for top jobs and want an online community of people similarly shooting for those jobs. \n\nThose communities can be really exhausting and toxic, but they also contains lots of helpful information and honestly can be pretty motivating. It's similar to what occurs on sites like CollegeConfidential for highschoolers searching for college.\n\n&#x200B;\n\n**tldr/conclusion:** What I've noticed happen is that as these subreddits become bigger, they start including people who are less skilled at the type of tasks that you need to be a SWE but are very interested in the amount of money that FAANG pays. Subreddits like these can be very discouraging to those people, because they are a bit of a reality check. \n\nThose people often become resentful, and start upvoting posts like these saying that the subreddit is toxic, everyone else is wrong, it's not actually that hard to get a job, etc. \n\nI don't really know the solution, but it started getting really bad on /r/cscareerquestions so I moved here. This post seems like just the start of that trend here all over again.",
            "Thank you for this post...",
            "[deleted]",
            "Needed to hear this today. Thanks.\n\nI'm sure I'll get downvoted to hell and back for this, but I've always found the tide of \"HOW I WENT FROM NOTHING TO ELON MUSK IN 6 MONTHS WITH JAVASCRIPT AND PYTHON BACKEND\" posts to be absolutely draining. Every single second I spend not working on my portfolio is starting to feel like a waste of time and it's ruining my ability to enjoy everyday life to the point where even the people around me have noticed.\n\nI have a lot of self-esteem issues when it comes to my coding abilities, so it doesn't help that the one time I steeled myself and posted to r/cscareerquestions, I received a single phenomenally unhelpful response that didn't even answer my question.\n\nI genuinely enjoy working on projects and especially in teams, but the online culture around CS is exhausting.",
            "Relavant talk: https://youtu.be/3Fx5Q8xGU8k",
            "Bro, I just want to live in a good country and have a home to live.",
            "Yeah, I’m working for a state government, and I could see myself working there for 10 years, no joke. I’ll still make more money than 80% of college grads. No, I can’t buy a house very 2 years or a sports car every 6 months with my tech stocks, but I get the peace of mind and balance away from tech all the time.",
            "I work at a FAANG company as a SWE, never did leetcode at all. I’m not saying it isn’t useful, definitely practice a little to get your problem solving chops up (problem solving is the foundation upon which everything else is built for cs), but there are so many other skills and other factors that really matter that I think a lot of students overlook. One of these is communication - being able to talk about what you are doing and explain technical concepts simply and concisely is a big deal both in practice and in the interview. My advice is to try to TA CS courses at your school to build out this skill! I find that all the skills you learn from teaching others (including developing a further mastery of whatever you are teaching) translate super well to full time work and coding interviews. Also, make sure your code is clean and easy to read in addition to “getting the right answer”. Naming your variables in a way that makes sense semantically and breaking out helper methods/building out classes etc. to make your code easy to validate and understand is also important. This will help with validation which is another thing we look for in interviews. Lastly, being a competent and easy person to work with, someone who is kind and passionate/excited about the work and genuinely friendly and fun to be around/has high EQ is so important. We are hiring our peers and whether or not you would want to work with someone is often how we phrase interview feedback on top of everything else. Listen to your interviewer and genuinely interact with them! In general, try to be a friendly and helpful person and live your life. Make friends with your fellow CS peers instead of seeing them as competition.",
            "Good, less competition for the highest paying jobs.",
            "[deleted]",
            "[removed]"
        ]
    },
    {
        "post_id": "inujlk",
        "author": "PreferencePast",
        "title": "everyone in here worried jobs... i'm just trying to make friends :(",
        "url": "https://www.reddit.com/r/csMajors/comments/inujlk/everyone_in_here_worried_jobs_im_just_trying_to/",
        "score": 398,
        "num_comments": 40,
        "created_utc": 1599428277.0,
        "selftext": "CS was already a pretty lonely degree, with COVID i'm going nuts\n\nAnd before anyone mentions the usual reddit-prescription of exercise, sleep, hobbies, etc. yeah I'm already doing those and have been for years. I work out routinely and have my own personal passions. There's just no replacement for social connection. \n\nI'm thankful as FUCK to be graduating this year, and hopefully we'll have a vaccine soon.\n\nanyway, carry on and best wishes everyone",
        "permalink": "/r/csMajors/comments/inujlk/everyone_in_here_worried_jobs_im_just_trying_to/",
        "comments": [
            "I’m in the same boat with you man, I miss going to play soccer and going to the gym with my friends. Then at school going to the library and studying all day with my classmates, I graduate this December and it sucks that I’ll never experience that school life again... :(",
            "CS (and related) are the largest majors at my school but also somehow the loneliest. Made some friends one semester but then y’all take different classes the next semester? poof gone. Joined an outside activity? Good luck keeping it up during midterm season. Also the stress of everything makes it hard to vibe at social events, idk maybe it’s just me. Given how hard it was during normal school, now it’s near impossible.",
            "i'm a freshman bro it's hard out here",
            "[deleted]",
            "At my uni CS students are simply snobs competing with each other:/",
            "Dude I spent most of my life until I was 26 working in luxury hotels as a bartender, and then made the switch and started studying CS in college. Holy shit is it hard to make friends! Some stereotypes are based on fact, it seems, and it's tough to make friends with CS students the same way you do with Hospitality peeps. But I'm not giving up!",
            "I'm a little late to the party but i wanted to share my experiences with meeting people coming from a music major to a CS major. \n\nMusic you had so much damn interactivity. Yes its a highly competitive field with really cut throat aspects especially when it comes to getting a chair in an ensemble, but realistically whenever you do get a position you are forced into a group where you're supposed to collaborate with each other. Help each other out, listen and give constructive criticism, and at the end create something beautiful as a group. \n\nCS doesn't have that aspect, at least not to the degree of music. Yes you have group projects, but usually it's just \"hey you do x and I'll do y\" which usually makes it so you only meet once or twice a week with small texts in between. Even when you do get into a good group there's always (well at least for me) that lingering feeling that you're the bottom of the barrel. That and everyone is too busy building up their personal portfolio that they dont really have time to fully commit to anything group related. Happened to me and my buddies this summer, where i spent the majority of the day in a discord group call telling them that I'm down to chat and work on stuff whereas they rather spent the time focusing on their own aspect. \n\nIdk man. Most of my friends are not from the CS major. It's rough out there.",
            "I feel this",
            "I’m socially awkward. For a while I used to hate being lonely, but now I’m ok with it. I find that thinking about friends only makes me feel much more resentment, so I try not to think about it and focus on other stuff",
            "I was thinking about this. First year I made an effort, by second year every Friday/Saturday night was spent on the internet. It's funny since my social life seemed so bright when I got to college through the first couple weeks.\n\nI was planning on switching things up for Junior year, but it looks like I'll be at home throughout.",
            "I feel your pain, I started my CS degree when I was 25. I didnt really socialize with anyone due to the age gap",
            "I know how you feel. I’m graduating in May and I’ve hardly made a single friend. Very lonely.",
            "lets be friends then",
            "I am also going through the same..I want to start doing exercises everyday but just couldn't start...Also  it's my final year so I am too much stressed about placements..I literally do not think about anything else ..I have become isolated and I just regret my life",
            "Reddit prescription - 😁😄😃. Nice name.",
            "To be honest here, i miss those days. Even though i am doing really well. More then i did in pre-COVID era, but having actual classes is something in itself.",
            "Glad to know that I’m not the only one.",
            "You think it’ll be easier to make friends after you graduate?! Amateurs!",
            "Same. I exercise frequently, get good sleep, and I am introverted but I STILL miss social interactions. Good luck!",
            "[deleted]"
        ]
    },
    {
        "post_id": "v6aymn",
        "author": "ItsTheWeeBabySeamus",
        "title": "What I wish I knew when I started my career as a software engineer",
        "url": "https://www.reddit.com/r/csMajors/comments/v6aymn/what_i_wish_i_knew_when_i_started_my_career_as_a/",
        "score": 401,
        "num_comments": 26,
        "created_utc": 1654542292.0,
        "selftext": "When I got my first job as a software engineer, which I am still grateful to this day that they decided to take a chance on me, I made many mistakes. Most of which were avoidable. After my first job, I was at facebook for 4 years and now I help people study for programming interviews.  I have compiled everything that I have experienced and learned into a post for anyone who is starting out their career or may have experienced the same fuck ups.\n\n**Read the stack traces**\n\nI cannot tell you the number of times I would ask stupid questions because I couldn’t figure out what was wrong with my code. I would get stuck and I’d ask the senior engineer on my team for help. He would usually roll over to my desk, look at the stack trace, and read me the answer right off of it…it was just embarrassing.\n\nIt was so hard for me to read that block of red text. It felt so intimidating and I just never wanted to do it. BUT as it turns out, reading the stack trace almost always gave me info on what is wrong with my code. If would have just taken the time to read it, I would have saved myself and my team soo much frustration.\n\n**Identify where you are uncomfortable and lean into it**\n\nIt took me two months to open a JSON file. I didn’t know anything about them and every time they came up at work I would avoid being involved in the conversation. There was some mental block that came up every time I heard someone say “check the JSON” file. It wasn’t until I ran into it one day and actually opened it that I realized how fucking simple they were. I still can’t believe it took me that long to even learn what they were.\n\nThe real lesson here is that avoiding a topic because it makes me uncomfortable hindered my growth as a software engineer. As they say at Replit: “seek pain”.\n\n**Think about the system**\n\nAs a junior engineer, I only really thought about the specific files that I was working on. The system was all broken up into pieces in my mind and I never took the time to understand how everything came together. This mindset was fine, but what really allowed me to level up was thinking about the entire system as a whole.  I would write better code and avoiding bugs. Not to mention I became a better communicator with my team.\n\n**Avoid Unnecessary refactors**\n\nIt was easy to write off my mistakes and inefficiencies by saying things like “this codebase is a mess”. There was a natural urge to refactor code that I didn’t write. One time, my team spent months working on a complete API rewrite to “clean the codebase”. When we finished, although the code was “cleaner”, nothing measurable had really changed. Management was confused as to why the entire team just spent months rewriting everything to have 0 measurable impacts on the business. I try now to always have a measurable metric that I plan to improve with every major refactor.\n\n**Do not Undervalue communication**\n\nWhen I was studying for programming interviews, I learned how important it was to be able to talk about my code. I contribute me getting offers at Facebook & Google to my ability to talk through the work that I just did. It was helpful also as I grew to be able to communicate my ideas. As a junior engineer I was just writing code I was assigned. But, as I worked my way up to a senior engineer, I was designing systems and delegating tasks which is where it was important for me to have strong communication skills.\n\nOverall, just think a little bit deeper about what you are doing when you start your career. Everything you are doing is apart of a bigger picture. Don’t be afraid to ask questions (as long as you are positive the answer isn’t in the stack traces). And be confident.",
        "permalink": "/r/csMajors/comments/v6aymn/what_i_wish_i_knew_when_i_started_my_career_as_a/",
        "comments": [
            "Great advice. I would add \"ask to see the system\" to \"Think about the system.\" I have seen so many developers who have no idea how the system works because no one has ever showed it to them. That could mean asking for a plant tour to see the code at work or sitting down with a user (not another developer!) to see how they actually drive the product to do something useful. This dramatically increases job satisfaction and makes you feel like part of something bigger than yourself.",
            "It is with great pleasure that I announce… you == 🐐",
            "Thanks for taking the time to share your experience!",
            "Along with reading stack traces, learn to use the debugger for your system. In many cases putting a well-placed breakpoint, looking at the data, and then working back up the call stack will give you the information you need.",
            "Cool post",
            "Thanks for the insight!",
            "I'm going to be a new grad at meta starting July...do you have any advice that's specific to your time working in Meta? I want to get promoted to E4 quickly, and the people I've spoken to said that I should always ask my manager for a roadmap to promotion during BootCamp, but this seems like such an awkward conversation to have lol",
            "This is all great advice, but you have me scratching my head on the stack trace mention. \n\nAre there really people out there who are coders, in jobs, *at Facebook*, who never learned or completely ignored stack trace exceptions/errors? \n\n*How the heck do you code like that?* Do you just never make a mistake—never forget a semicolon, or proper white space, or colon, or accidentally capitalize a variable name, pass the incorrect type, pointer instead of value or vice versa, etc., etc.?\n\nI don’t mean to sound critical, but this is one of the most basic things you should learn and know how to do, probably before you ever learn anything at all super in depth (like DS&A). \n\nAm I misunderstanding something here? I feel like you just told me you didn’t find out you could breathe through your mouth until you were an adult or something.",
            "What I learned: Degree is largerly useless and if your not a poc or h1b visa worker = good luck",
            "JSON tip:  use \"horrible json\" library or similar alternatives when something what looks like JSON doesn't want to get parced.",
            "Great stuff! Thank you! Saving this.",
            "Thanks for sharing. I like the way you laid out the advice. Any other advice on how you got a job in Big Tech?",
            "Does prestige of your university matter in CS field for your first job?",
            "Absolutely goated advice",
            "Dude didn't know how to read stack and got a job at Facebook, damn the standards r low af"
        ]
    },
    {
        "post_id": "u85vae",
        "author": "-boofit-",
        "title": "Is it mandatory for people in this field to be complete assholes?",
        "url": "https://www.reddit.com/r/csMajors/comments/u85vae/is_it_mandatory_for_people_in_this_field_to_be/",
        "score": 403,
        "num_comments": 96,
        "created_utc": 1650486992.0,
        "selftext": "Everywhere I look in our field all I see are assholes. Myself, my classmates, my professors, recruiters, stackoverflow etc. \n\nWhy is that? It doesn’t take a fucking genius to create a loop that prints “Hello world I’m a jaded cunt” but we all like to sit on this pedestal like we are the shit. Some things are definitely hard but people are literally able to get jobs in our field making good money without ever stepping foot inside a classroom. No doctor or lawyer could ever do that. \n\nIm tired of having the one fucking thing I enjoy ruined by a dickhead TA or a recently divorced stackoverflow moderator with a superiority complex.",
        "permalink": "/r/csMajors/comments/u85vae/is_it_mandatory_for_people_in_this_field_to_be/",
        "comments": [
            "At least it’s not as bad as finance guys",
            "I think its a lot easier to feel like you’re succeeding in life when you bash other people and their efforts to make yourself feel superior. That doesn’t make it right though \n\nIMO the people who are truly successful and know it aren’t scared of helping those who arent quite there yet.",
            "Based on your comment history, you are probably the reason for all your issues. You are a genuine asshole in every other comment.",
            ">Everywhere I look in our field all I see are assholes.  \n>  \n>\nThere is a wise saying which goes:\"if everywhere you look, you see assholes, then actually in reality ***you*** are the asshole\"\n\nIt is like the punk kid asking \"why do I ***always*** get into a fight every time I go out??\"\n\nErrr... I never get into a fight, you're the common denominator of your experiences thus perhaps you're the ***cause*** of your fights??",
            "Most CS majors lack the very basics of conversation skills and their whole life revolves around CS. Cut them some slack",
            "Being a dickhead only gets folks so far. Most of both mangers/tech leads/ principal levels I have delt with have exercised empathy, patience, and a wanting to teach/guide. We out here.",
            "Lol suck it up this is real life dumbass. \n\n\n\n\n\n\n\n/s",
            "Coming from healthcare, I'd rather work with CS guys than nurses or stressed out doctors",
            "Not only is it not a requirement, being an asshole is generally an impediment to advancing your career past a certain point.",
            "For women and LGBTQ in tech, the incels and arrogant snowflakes really are quite the plague.",
            "Who would have thought that people building systems unconstrained by rules would have a god complex? /s",
            "it's interesting how you can call yourself an asshole without being ashamed of it.",
            "Is this a new copypasta I smell?",
            "You either die as a hero, or live long enough to be one yourself",
            "Millionaires by age of 23, what were you expecting in this club?",
            "Every cs TA I’ve so far is complete dick",
            "I agree. A lot of people are extremely rude for no reason. It makes me worry about how people will be when I start working as a software engineer. It's weird how everyone thinks they are better than others. I don't like that.",
            "I guess it’s because everyone with some soft skills end up at managerial positions, because otherwise those assholes would not be able to communicate between each other at all.",
            "Not everyone!\nThere are a lot of kind peoples! :).\nIt's all depends on life view.\n\nFrequently, the most asshole once I have met are either (Not everyone!! It's generalized):\n\n\n1. Stuck up with one language for X years and judged other languages based on reputation and not project base. (Used to be because of influence)\n\n2. (Not everyone) came from rich background that both parents work at lot of years in Hight tech.\n\n3. Think just because they succeeded balancing life and school (some with degree some normal school)\n\nJust ignore those people, It doesn't matter anyway",
            "half of cs majors (the ones who make the posts in question and the ones you interact with) are just plain weird and seem like they don’t talk to real people. I’ve met some great people the past few years and made good friends, but then you’ll run into someone (or god forbid you have a good sense of smell in the CS career fair) that makes you rethink the people in the major",
            "I think a lot of it relates to society's view of software engineering and computer skills in general. In every other movie, interview, etc., (i.e. Social Network, Mr. Robot), programmers are shown as being anti-social buzzword-happy geniuses. And so, many self-appointed techies mimic this style, trying to impress other people with their supposed fluency in these areas. It's basically gatekeeping. \n\nNot all computer scientists are this pretentious, but it's a big enough issue for it to be noticeable.",
            "If everywhere u look you see assholes, YOU might be the asshole",
            "Either you’re an asshole or you have imposter syndrome.",
            "Is it mandatory for people on this sub to *not* know what a Shitpost is?",
            "No, but I choose to be.",
            "If you meet a couple of ass holes every now and then, those people are probably ass holes. If everyone you meet is an ass hole, then you’re probably the ass hole.",
            "That’s so weird because honestly the software engineers I know personally or have met have all been super nice.\n\nEdit Wait is this supposed to be sarcastic?",
            "Basically yes.",
            "I find cs majors to be the least toxic people out of any group I've seen tbh.",
            "You must be fun at parties.",
            "The people who aren't assholes are run off by the assholes. Also the reason there are few women",
            "Never pay attention to elitists in fields like this. Pretty much almost always have nothing else going on in their lives.",
            "Hey man, I'm sorry you have to this perception, but I look around constantly *blown away* by my peer group, whether it's my friends, classmates or professors in CS. They've all been accommodating, informative, and more or less without exception a pleasure to work with. Even my interactions with people online have been incredibly beneficial. I'm certain they're out there, and there may be a lot of them, but in my experience, it's all the engineers and people in tech that are usually NOT the assholes. If all you do is look around and see that everyone else is the problem, it's not them that have the problem, it's *you*.",
            "Yes",
            "Wow this is crazy, how are women treated in this industry?",
            "> a recently divorced stackoverflow moderator with a superiority complex\n\nLOL"
        ]
    },
    {
        "post_id": "obtnu1",
        "author": "HelloIamTedward",
        "title": "doing horribly at my internship :(",
        "url": "https://www.reddit.com/r/csMajors/comments/obtnu1/doing_horribly_at_my_internship/",
        "score": 395,
        "num_comments": 71,
        "created_utc": 1625168986.0,
        "selftext": "I worked super hard and grinded leetcode for months, and finally got an internship after like 200 rejections. I was incredibly happy, but now that I’m actually working I’m really struggling. I’ve had 2 deadlines and missed both of them. I’m currently 3 days past a deadline, even though I’ve pulled like 2 all nighter this week to work. The other couple interns are way smarter than me, and I’m feeling really discouraged. I’m really lucky that I got an internship, and my boss and the other interns are really nice, but I’m just feeling so discouraged.\n\nUpdate: ended up learning a lot and getting a return offer, I think this is just how everyone’s first swe internship feels like",
        "permalink": "/r/csMajors/comments/obtnu1/doing_horribly_at_my_internship/",
        "comments": [
            "Do you have access to a mentor and manager? Can you indentify what you think the problem is?\n\nIf you’re unfamiliar with the technology, sit down and study from the basics instead of brute forcing.\n\nIf you’re lost in the codebase, request a tour of it from your mentor or manager.\n\nAlso express this concerns with your manager during the time for feedback. They want to see you success and should be able to provide help!",
            "Curious but what are you working on that you find difficult?",
            "you could just assume you're not getting a return offer and chill. Let's actually be realistic, you've missed 2 deadlines, you're about to miss another, and you're killing yourself over it by pulling all nighters\n\nI'm just sayin, you could take it easy and work the 8 hours that you're supposed to and see this internship as an opportunity to get an even better job later on. Now there's less stress.",
            "[deleted]",
            "Don't worry about it, I'm doing horribly at my job.",
            "Brah it's a job, don't work outside of your designated hours.\n\nAsk for assistance.",
            "I feel that so much…\n\nThe worst part is that everyone is just like “yeah, it’s ok” and super nice about but in reality, I know I’m not getting a return offer 😭",
            "Every gig is a learning experience that prepares you for the next one.",
            "The problem is not you. It's your supervisor. Internships are to learn and explore. If you have a deadline, your supervisor is doing it very wrong.\nI myself am a team lead and I have had many interns. This is not how it should be done.",
            "Let’s be real this is the result of doing nothing but lc. U win some and lose some, learn from this and do some side projects and just re apply next year",
            "Hey internships are designed for you and for you to learn. Ask for help my dude. They will help you. And certainly they don't want u up all night working. This experience is for you. Just ask!",
            "may just be my situation but I interned at and now work at a mid-sized tech company. my mentors told me after I was rehired that they almost always throw us in the deep end and don't really expect us to finish our project. what they are really more interested in is how you think, if you are willing to put in the work to figure out a solution, that you aren't afraid to ask for help when you're stuck, that you work well with the team, etc. I don't know if other people have had this same experience, but really I think the most beneficial thing for you to do is to step back, realize that you are an intern and take everything from here on out as a learning experience. I don't think most companies hire interns to work on real end products (I think one of my coworkers rewrote my project after I finished lol). they are looking for potential and willingness to grow and adapt",
            "As long as you come in with a “here to learn” mindset you should have nothing to worry about. They don’t expect interns to do shiz most of the time so it’s actually impressive if you can get something done! Ask good questions communicate often and you will leave your mark with the team :) I’ve had some stories roll over to the next sprint as well but I don’t feel as bad knowing as long as I get a little done each day I’m doing my part",
            "I'm a senoir engineer in a FAANG company. Same thing happened to be in my co op. Don't take this experience as universal for our field and keep pushing on.",
            "I would think any legit shop would not be dumping anything load bearing on an intern.  Maybe that's a sign in and of itself.",
            "you should have someone that can guide you or work with other interns if that's an option",
            "Record your code meetings with mentor and take notes. I often watch replays in case I missed something. Get good at googling too",
            "[deleted]",
            "Calm down, take a step back, and start planning. I bet you don't create your own lists. Take a pen and paper, and divide your problems into smaller parts. You are currently trying to swallow the whole fish at once.\nYou have a problem (well, more problems) and you need to resolve it. If you focus on one problem at time, instead of \"trying to handle all at once\", you will be more productive, less stressed and you will also have the great feelings of satisfaction, when you'll see items from your list gone. Also, when you are doing API for some web app, (i suppose that's what interns do nowadays), there is literally the universe of materials out there. You need to start asking questions,  correct questions to be precise. That will also enhance the ability, to better define your problems. Use your time efficiently and track your progress. This is probably your first \"real job\" and you need to get comfortable with that as well. \nI don't know if you are smart enough or not...just stop comparing yourself with anyone but you. \nYou can do it!\nTake care.",
            "Stay calm man, you totally got this!\n\nTry to talk to your mentors/managers about this matter. Ask them for more advice/guidance. Please keep in mind that your success is their success too. \n\nAlso, I have always believed that the core value of internship is learning. No matter which pace you are consuming all the concepts, you are still broadening your knowledge.",
            "If you’re working that hard and often without results you really aren’t asking for enough help. You’re there to work and Learn. Start asking for help and find a mentor.",
            "Your task is not simple. I suggest looking for a mentor or partner. This way when you need help, you get help. Don't do it alone, and don't struggle alone. That is not how software engineering works.",
            "i get this too",
            "I think this is a situation where you need to know when to ask for help from people who DO know the language. I’m employed at my first Dev job using a language that I knew nothing about before my first day. I’ve learned a lot to the point where my boss trusts me with just about anything because I’m okay asking for help and pair programming with others. Took a while to get used to criticism but its all in the sake of getting better. Reach out to me if you like",
            "I am sorry about that.."
        ]
    },
    {
        "post_id": "14wyx2e",
        "author": "Say-ja",
        "title": "wait until some peeps find out there’s other companies aside from faang",
        "url": "https://www.reddit.com/r/csMajors/comments/14wyx2e/wait_until_some_peeps_find_out_theres_other/",
        "score": 395,
        "num_comments": 87,
        "created_utc": 1689099271.0,
        "selftext": "i’ve been scrolling through this subreddit and some of you guys are way too hard on yourselves. Apparently some big tech company internships opened and you’re all freaking out already. take a deep breath, relax, and just do the best you can. they’re not that important as there’s plently mid-level or even not well-known companies that pay well. very little people actually start at the top and get internships and offers from faang companies, they just don’t talk much about it here. seriously, we all start from somewhere and truthfully….that’s usually at the bottom. build yourself up for you, the big money will follow.",
        "permalink": "/r/csMajors/comments/14wyx2e/wait_until_some_peeps_find_out_theres_other/",
        "comments": [
            "There are??? No thanks, I'm gonna keep applying to only $50/hour internships and then complain I'm jobless",
            "WHAT?! I was told if I solve leetcode problems I’m guaranteed an offer..",
            "Exactly there's also HFT",
            "Half of the stories on this sub are made up, and the other 40% are filled with crazy stories or delusional posts. The rest are legit.",
            "[deleted]",
            "As an international student, is a bit harder to find smaller companies, as they in some cases have to either wait longer or help with visa sponsorship, when those FAANG companies have teams to help you with that.\n\nAlso, unrelated but I hate the word FAANG. I propose calling it MAGMA (Microsoft, Apple, Google, Meta, Amazon)",
            "What are some other companies that pay well but aren't as competitive as FAANG?",
            "I always understood FAANG as a reference to any big well known tech company which has FAANG or FAANG equivalent salaries. As long as I’m rolling in dough I couldn’t care less whether it’s one of those five.",
            "Unfortunately I apply to everything, smaller business, faang, gov, banks, it’s always going to be rejections",
            "I really can’t care less about FAANG. Some people here are delusional.",
            "Honestly people should look at government. Certain agencies are just as hard to get into but look a lot better on your resume than faang. Having that plus a security clearance means you get contracting roles or government-serving faang roles for way much more than you would’ve had if you just started out at a faang company",
            "Very excited to be hired, blow a ton of money on a huge house, work 60 hrs per week, get PIP in 6 months, and unemployed for another year\n\nThe American dream, baby!",
            "wait you're telling me that there are more than 10 companies that hire developers and pay well? /s",
            "Honestly if your whole plan was come to the US and get a job at FAANG to get sponsorship maybe you should have thought a little harder about whether that was likely to work.",
            "This. If you make great stuff, people will recognize your value one way or another. I tried too hard to impress recruiters at one point I forgot what I wanted to be best at. (Certainly not the best Leetcode solver, nor the best employer, though some can pursue it.)",
            "Find me one that’ll pay me $250k+ a year with 3 years Jr experience and let’s me live in the Bay Area and you’ve got a deal",
            "Even spicier take: tech bros who parrot the “other companies than FAANG” line don’t have to consider visa sponsorship when applying for jobs",
            "i mean if you go to a decent school, are a junior, are a r/csmajors user (has no outside life) then you probably already have a decent offer. \n\nI got an offer from walmart so now all I'm applying to FAANG. Why would I even bother with anything else, I have nothing else to do in life.",
            "Wait.... The earth is flat? I thought I could only see faang from where I am!",
            "I'd rather they didn't",
            ">People want to make more money??? Rather than less money???? How could this be?!?!?!?!?\n\n\\- OP, lmfao",
            "NOPE. Unless google is prepared to pay me big I’m not interested in a small company - I know my worth",
            "Why people don't get why people are obsessed with faang, they simply pay more lol,and on top of that they are the ones that usually develop the last tech,so more money + more exciting workplace,at the cost of having a bad work-life balance,but guess what,many people here don't have a life so who cares. I cringe a little for they getting so nervous and worshiping these companies but okay I get it. I also would want to enter faang,shoot for the stars ,if I don't reach it then I still will be on the air.",
            "It must be nice accepting that you're mediocre. Takes a lot of stress off your shoulders.",
            "Tc?"
        ]
    }
]