[
    {
        "post_id": "txayj4",
        "author": "Dimax88",
        "title": "To Anonymize my name because it sounds Russian?",
        "url": "https://www.reddit.com/r/csMajors/comments/txayj4/to_anonymize_my_name_because_it_sounds_russian/",
        "score": 397,
        "num_comments": 93,
        "created_utc": 1649209748.0,
        "selftext": "[https://imgur.com/a/tbDz8Mv](https://imgur.com/a/tbDz8Mv)\n\nGot a rejection from a company with this.\n\nAm I overreacting or does this seem just Wrong? Just feels totally unasked for. Having to hide my name because people might think I'm Russian? (and I'm actually Ukrainian)\n\nI guess I dodged a bullet there, but damn it made me self-conscious about my name now :(\n\n&#x200B;\n\nEDIT: I am in Canada applying to a job in Canada",
        "permalink": "/r/csMajors/comments/txayj4/to_anonymize_my_name_because_it_sounds_russian/",
        "comments": [
            "The best part is not over lol. This is how they ended the email:  https://imgur.com/a/0sGEaRO",
            "You could probably sue the tits off this company if it was in America",
            "can i ask the company name? Screw them that's so unprofessional",
            "Lol. If you were in the USA I'd say consult a lawyer because that is fucked. I don't know anything about Canada though. Name and shame, homie. Screw them",
            "Wow, Canada hitting new lows.",
            "If this is based in America you’ve got grounds for a lawsuit. They’re not worth working for anyway",
            "Recently a professor called me out in front of a group of students because of the pronunciation of my name and that she recognizes Russian names. I’m not Russian but other Eastern European nationality 💀.  I hope companies don’t start outcasting us without even disclosing the reason….",
            "I think you could actually report them to the Human Rights Commission in Canada. This is flat out self admitted race based discrimination.",
            "This is basically the equivalent of rejecting someone with a Chinese name, not realizing they are actually from Taiwan lol",
            "most of us Asians use American names on our resumes. It makes a difference. A BIG difference.",
            "This is why you apply for US jobs, less likely to run into petty stuff like this.\n\nSpeaking as a Canadian myself the special brand of weaselly tactics I see in our country just sickens me. People outside Canada still have that “nice Canadian” stereotype in their head. It’s absolutely not true, I just see more veiled passive-aggressive stuff like this email.\n\nThis hiring person thinks he’s sticking it to Putin by denigrating the average hard-working person who happens to have a Slavic name.\n\nAnd don’t forget the LCBO banning vodka (because all vodka has to come from Russia right?)\n\nAnd then there’s that snarky edit of the Russian ambassador’s memo in the UN from the Canadian delegation.\n\nIt’s disgraceful, makes Canada comes across as that loud mouth skinny kid in high school who runs with the cool kid (USA) and does all the shit talking and insults for him.\n\n@OP please do not waste your time with companies like this when there are better companies who pay more, hire equitably, and conduct themselves at a higher standard",
            "What in the world??? This is outrageous!!!",
            "Keep the name but make your Ukrainian background more prominent on your CV. That should give you points in your favor at the moment.",
            "That's not even a Russian name lol, Dmitry or something like that is Russian\n\nI would say your name is like Bulgarian or something if I didn't know your origin",
            "Sounds like a lawsuit to me.",
            "Yes, anonymize it. I’ve seen plenty of people celebrating companies that fire all their Russian employees.",
            "Make the company name public",
            "feels very discriminatory and like you sue in the us lmao",
            "While it sucks I hate to say it they sadly are not wrong about the name thing. Far to many places most likely are filtering out you just because you sound Russian but never telling you. I also know their are plenty of places that DGAF what your name is where you are from. Where I work we just hired to people who grew up in  Russia and have very Russian names. \n\nThe same thing tends to apply for people with Indian sounding names. Reasoning being is they are those names and assume H1B and don’t want to deal with it. \n\nRight or wrong it happens and some times the best move is do some BS like that. I don’t like it but I know it happens. It is knowing about it. Sadly it tends to be people in HR and recruiting doing it. The people like me who interview you we don’t care. \n\nWe might refer to you internally as the Russian when we are talking about multiple candidates if someone can not remember the name but that only if you where the only Russian. \n\nAt one place we had 4 new hires fairly American names but people crossed who they were so they got described as the Tall one, the Asian, the girl and the other one. All for where great people and amazing devs and I loved working with them for several years.",
            "Holy shit that’s hell of a dick move",
            "Ayo sue and get that fuckin bread.",
            "that is a horrible thing to say, your name is beautiful plz be proud of it and don’t anonymize",
            "That's such bullshit. You shouldn't be self-conscious about your name. You're Ukrainian yes, but all that matters is that you're authorized to work in Canada. It doesn't matter if you were born in Canada or if you're a naturalized citizen or permanent resident. \n\nTheir ignorance is only reflective of them, and fortunately you found out for $0 that they're idiots who make judgements about people based on their names. You've got this Dmytro! Slava Ukraini!",
            "Wow that's racist. I'd recommend not giving a shit because a company that would do that would be a company you would not want to work for. You dodged a bullet.\n\nSee if there's any kind of anti-discrimination authority in your country you could report them to.",
            "This is absolutely disgusting and disappointing. I’m so sorry you have to face this. I know in my family the use of an “English” name is encouraged if that’s something you feel comfortable with? Something similar to your own but still recognized as English. It’s so sick that this continues to happen and it’s skyrocketed with the war.",
            "How does someone anonymize their name?",
            "Wow I’m sorry you were treated that way OP. That comment is out of line and extremely unprofessional. You definitely dodged a bullet from that shithole",
            "lel, imagine the poor people whose last name is Putin for real\n\nalso, I didn't understand the Eastern Europe part, why are some Canadians phobic towards them? most Eastern Europeans migrating to Canada are white, young, healthy, educated, if they are religious, they are certainly not religious extremists. Canada does heavy filtration to foreigners who want to move there",
            "Maybe include your place of birth?? (assuming a town in Ukraine)  \n\n\nYou'd still be experiencing biases... but hopefully now a net positive bias?",
            "Aside from all the lawsuit bs, going by a westernized nickname could reduce any stigmas or snap judgements.",
            "Fake news",
            "Thats so dumb. They are banning Ukranians to \"help\" Ukraine lmao",
            "I hate fking brainlets like this company participating in useless retarded witch hunts."
        ]
    },
    {
        "post_id": "16tcd1s",
        "author": "hd016",
        "title": "This subreddit just banned talking about a conference for women in tech, attended by mostly female computer science majors😐",
        "url": "https://www.reddit.com/r/csMajors/comments/16tcd1s/this_subreddit_just_banned_talking_about_a/",
        "score": 396,
        "num_comments": 321,
        "created_utc": 1695793911.0,
        "selftext": "Wonder if the mods are men. Thanks for the support🫶🏻",
        "permalink": "/r/csMajors/comments/16tcd1s/this_subreddit_just_banned_talking_about_a/",
        "comments": [
            "Correct; we just got like 10 posts about the same topic. There are a couple of posts that have been left open (including one of yours) - that's where discussion should go. I didn't want this to degenerate into the diversity fighting that consumed this subreddit before Rule 14 was created.\n\nAlso: as a few people pointed out, the discussion didn't seem to be productive either.",
            "This subreddit should just be called \nr/ISuckAndCantFindAJob",
            "Not sure why but honestly knowing this subreddit it’s probably for the best. Everytime I get a notification from\nthe sub it’s some bs or stupid talking point nowadays.",
            "Judging by your post history it's for the best",
            "this whole forum is so toxic. every other post is just complaining abt the job market (we know. its shit) but 10 posts about a con are banned? like what",
            "That post history is yikes.",
            "The abundance of men in this thread who don’t get why GHC exists in the first place sums up r/csMajors in a nutshell ☠️",
            "Good. Maybe now you can step back instead of spam posting your bigotry",
            "“Wonder if the mods are men.” You seem very reasonable!",
            "[deleted]",
            "[deleted]",
            "In my University they started doing conferences for women only regarding industrial engineering branches and also unique oportunities for them, just because they are women. They also mailed everyone in the entire tech school and most guys were very pissed because some of the events were very good and we werent allowed to go(dont mail them at least to us lmao). They stopped with this crap in three weeks because there were only 8-12 women attending this events and many men complained about the segregation and lack of oportunities for everyone.",
            "Grow up",
            "The market is absolute shit, people are getting more and more desperate, and this is the result.",
            "Thanks for letting me know to leave",
            "[deleted]",
            "Yep, my post just got auto removed as well",
            "I'm all for advocating women in tech, but like why the hate on men. Without my BF's support who is categorized in \"men\", I would have never gotten into tech in the first place. They are just trying to make a living like most people in the conference. This job market is bad so naturally you'll see all kinds of people showing up like men.. and maybe turtles.. But its like 50 women to 1 men ratio in the conference and you'll hear more women getting opportunities in this conferences than men. Don't forget to be inclusive to LGBTQ community too. Not all \"men\" are \"men\". So don't hate on men, They have it hard too. Just cause they are currently dominating the industry, doesn't mean they have it easy. They deserve to be loved as much as you.",
            " 😃🍿",
            "Wow, If any academic in the social sciences or ethics side of CS needed raw data, this would be the post. I'd say I'm astounded by the arrogance, but isn't that the whole point of CS Majors? They only want to work in an area they can totally control. All that other useless stuff like representation should only count when it can be rendered as an algorithm used to sell stuff to people. Pathetic. You're all in for a wild ride when you get to industry and realize that the woke stuff you hated on is going to make or break your career. Enjoy!",
            "Context?",
            "How much you wanna bet OP was super toxic in a previous relationship with a man and got broken up with and now just hates all men.",
            "I'm a man and this is fucked up. It's a conference for women and nb people who already struggle in the STEM industry. Especially in a professional work setting, would you really want to introduce yourself as someone who would take an opportunity from someone disenfranchised?",
            "bruh why are all dei posts banned that sounds dumb",
            "The men butt hurt over your post history😂 weak",
            "I'll be attending the GHC next year just to piss OP off. Stay mad.",
            "Looks like you're the one that has a problem with men (judging by your post history). Maybe try tolerating men? After all you're in a field dominated by them.",
            "Thank you mods, the right decision was taken.",
            "all the bitter replies from dudes abt your post history are cracking me up. you're doing nothing wrong, stay strong sister",
            "Cry me a river",
            "inclusion via segregation HYPE",
            "I will make sure to attend next year.",
            "We need more women in stem. Aforementioned women in stem : OP. Please look at her account history for a good laugh. GHC is a good thing, however expecting men to not show up if they are invited is crazy.",
            "Mans is fighting for his LIFE in the comments",
            "I think women should be allowed in regular tech conferences and not have to go to women conferences. This isn't basketball.",
            "Unpopular opinion: they didn’t ban it cuz it’s an event for women, they banned it cuz all the unnecessary posts were getting out of hand, just like many other posts 🤷🏾‍♀️",
            "OP needs help. See post history",
            "If you cant compete with men on an even even playing field, you simply dont deserve a job. Women get responses 40% more often and make 15% more than men in tech. Nothing to whine about.",
            "Awwww someone’s mad that other humans are also benefiting from a conference",
            "Because affirmative action for women in IT is institutionalized sexism you mean?\n\nGood. Keep banning.",
            "I’m sorry but the moment you allow trans etc to attend you have to allow nb identifying individuals to attend, you’re not a bigot right? Those “men” might just be nb.",
            "this is one thing i'll never understand about the whole \"female inequality\" bs that's still propagated in society today and the blatant hate towards men for no reason. I have a coworker who also believes in this self debilitating belief that women in engineering fields have an inherent disadvantage and I literally just tell her to stfu because it isn't even remotely true. if anything, women have the most support to join these fields and there are so many support groups just because you're a female. it's funny cause they believe men are sexists when it's them bringing up sexism in the first place. f\\*ck off with that mentality it's annoying. i'm all for women do anything and they definitely can, but to believe that men are gate keeping is such bs.",
            "dIScUSsiOnS wErENt ProDuCTiVe, wE dOnT hAVe eNoUgH pOsTs aBoUT hOW fKd tHe mARkEt iS. If you are reading this and youre a mod, you suck. You think some fake internet points and authority make you shit? You suck and you dont matter. Just remember that.",
            "I'm gonna be honest it sounds like you are sexist. Why are men not allowed to go to this conference gender is protected so the conference isn't allowed to discriminate against them.",
            "Is this all you post and argue about? I think you need to take a break from reddit...",
            "What if the men who attended all identify as women? Please be more open-minded OP.",
            "Imagine men helped women get into the industry just for women to come back and only help other women instead of helping everyone. Lol think about that before your complain about men trying hard to compete with you at every turn.",
            "Maybe if you spent as much time learning programming and interview prepping as you do being a misandrist on Reddit, you wouldn’t be so desperate for a job or internship. I hope you get better soon, get the help you need, see a therapist this kind of behavior isn’t normal or healthy.",
            "Are you sure there male identifying or are you just assuming? Non-Binary people exist lol. \n\nAlso your post is super condescending and your past posts seem like you have a chip on your shoulder about men in general. \n\nHope you feel better after the post",
            "When you have AA by your side and still need a whole conference for jobs 💀 keep crying extremist.",
            "Waaaaah",
            "this is the most toxic subreddit I’ve ever seen…"
        ]
    },
    {
        "post_id": "1177agq",
        "author": "johnnytest__7",
        "title": "Don't bother applying if you've not had a positive attitude for 3 years.",
        "url": "https://www.reddit.com/r/csMajors/comments/1177agq/dont_bother_applying_if_youve_not_had_a_positive/",
        "score": 397,
        "num_comments": 44,
        "created_utc": 1676901397.0,
        "selftext": "Job requirements have gone to another level: https://imgur.com/a/9uZkO4Z\n\nIf anybody has experience of being positive for at least 3 years, here's the job posting: https://www.linkedin.com/jobs/view/3491173093",
        "permalink": "/r/csMajors/comments/1177agq/dont_bother_applying_if_youve_not_had_a_positive/",
        "comments": [
            "3 years experience for a junior developer role lol",
            "[deleted]",
            "Dude, lie",
            "Fake the attitude 🌚",
            "Tf does that even mean?",
            "I was positive for three years.  \nIn fact I even TESTED positive.  \nBut then I decided failing drug screens was counterproductive.",
            "A positive attitude for the past 3 years. \n\nYou mean the past 3 years that included a global pandemic with a death toll in the millions and massive disruption to our livelihoods? Or the rapid rise in housing and living costs? Or the Russian invasion of Ukraine and the threat of WWIII?\n\nThose past 3 years?",
            "Damn it, is there a class in cs i can take that teaches fundamentals of positive attitude?",
            "I don’t want to work anywhere that thinks a person can “learn” JSON",
            "Red flags for companies and roles like this. I would never apply again to these companies.",
            "I am a fresher. Can I learn positive attitude on the job?",
            "3 years? WHAT DA HELLLL..",
            "It's not Sunday.",
            "LOL",
            "wow, this sounds more like a Software development course😅.",
            "Picture it, Sicily, 1912…",
            "3 yoe, where would you stay in term of position? Still entry or senior??",
            "After a couple decades of programming, not only have I lost my positive can-do attitude, I've become a downright cynic and misanthrope."
        ]
    },
    {
        "post_id": "su5j7i",
        "author": "hinowbye02",
        "title": "Then why’d you reject me ;-;",
        "url": "https://www.reddit.com/r/csMajors/comments/su5j7i/then_whyd_you_reject_me/",
        "score": 392,
        "num_comments": 68,
        "created_utc": 1645043283.0,
        "selftext": "“…I’m JAMES*, and I wanted to let you know about this new, great paying Software Engineering Internship with JP Morgan Chase. Their hiring team came across your profile on WayUp and personally asked me to see if you'd apply…”\n\nSTOP TELLING ME LIES JESS I ALREADY GOT REJECTED WEEKS AGO\n\nsmh my head, *men…\n\nedited for unintentional sexism",
        "permalink": "/r/csMajors/comments/su5j7i/then_whyd_you_reject_me/",
        "comments": [
            "Do the coding interview again...free practice!",
            "Deloitte rejected me for being an international student and then sent me another invite to apply to their internship on Handshake, I was upset for an entire day",
            "WayUp really feels like a farce sometimes.",
            "The second most romantic thing after Morty and Jessica.",
            "Morgan stanley rejected me for a non engineering role bc im non engineer major then told me to apply for engineering major. Make it make sense",
            "[deleted]",
            "> smh, women…\n\nCmon now, was that really necessary",
            "Happened to me all the time!",
            "Okay. Frustrating, but maybe not target your anger toward women. There are women in this group, you know?",
            "[deleted]",
            "WayUp is crap. Deactivated after a week.",
            "JP Morgan just needs your attention just like an attention seeking ex.",
            "[removed]"
        ]
    },
    {
        "post_id": "irrnsy",
        "author": "Select_Initiative_16",
        "title": "Anyone else feel like they're behind and never going to make it?",
        "url": "https://www.reddit.com/r/csMajors/comments/irrnsy/anyone_else_feel_like_theyre_behind_and_never/",
        "score": 401,
        "num_comments": 46,
        "created_utc": 1599971003.0,
        "selftext": "This 2021 recruiting cycle has been rough. I'm barely getting any responses even though I'm a junior (and this is also my last chance to get a good internship) and I've only got OAs from the companies that send them out to everyone (Akuna Capital, Robinhood, etc) and every now and then I make it one or two rounds in but I always get rejected. Meanwhile my two closest friends have worked at Facebook, Amazon, Citadel and they pretty much never fail technical interviews. I'm out here having done almost 300 questions and still feeling like I can't do a medium in less than 30 minutes. \n\nI have so much self doubt and I feel like I'm never going to be able to get into one of these top companies. Leetcode just doesn't click for me. If the question is a straightforward bfs/dfs/binary search then I can do it no problem but the problems which require original thinking like \"Largest Rectangle in Histogram\" are impossible for me. I remember spending literally 2 whole days on that question because I was stubborn and didn't want to look at the answer and I still didn't get it and eventually gave up. Just thinking about leetcode and how much I have to practise is giving me anxiety. These problems are hard enough but during an interview it's even harder, I'm sure everyone has felt that. Everyone around me is doing so well and I have a sinking feeling that I'm never going to make it.",
        "permalink": "/r/csMajors/comments/irrnsy/anyone_else_feel_like_theyre_behind_and_never/",
        "comments": [
            "My biggest fear is that I won't be able to use my CS degree.",
            "I understand it is difficult to see your friends succeed  while you face rejection after rejection, but you should remember that people are different. You should focus on improving yourself as much as you can. Keep working on those problems, work on side projects, try to take advice from your friends.",
            "i’m in the same position dude haha. 300 questions though damn. Is it possible you’re just memorizing leetcode solutions instead of getting better at pattern recognition ? maybe try grokking or epi and solve questions by topic on there",
            "It seems like you have a super smart  network around you. That'll help you in the longterm. Then again im in the same situation as you and I still need to start doing some leetcoding 😭",
            "You need a better Leetcoding strategy. Perhaps don't get stuck on problems too long and look at the solution instead.",
            "It’s going to be tough to get hired unless you have experience as we all know or can demonstrate some exceptional talent either 3.5+ gpa or solid algo knowledge. \n\nThe best you can do is have a plan as to what kind of dev you want to be and sharpen those skill very well, then go to indeed and look for the jobs that match your skill set.\n\nSmall and medium size companies only look for devs that can bring working knowledge, the large ones will give you a shot but you’ll ha e to clear 3-4 interviews and it sucks if you meet the skill level but there’s only a certain number of positions being hired and someone with 3yrs exp gets picked instead since they’re more qualified.\n\nYou’ll just have to keep applying.",
            "Exact same case. On top of it, i am an international student.",
            "[deleted]",
            "Yes, I feel the same way.\n\nBut I doubt that I'll be able to make it into **any** company, let alone top ones.\n\nPay me a lower salary. I don't care.\n\nIt's incredible how many companies are using leetcode interviews these days. It really makes it hard to have hope for the future. In any case, we have no choice but to try our best. You are not alone.",
            "Leetcode isn’t important - you don’t need to get into those particular companies. I’d even say most people who don’t, achieve much more with their lives & skill. Also, engineering isn’t about speed - rather about having the guts & brain to go build it, in an unconventional way. You’ll make it, but... fake it till you make it, and you should be good! \n\nFeel free to DM if you have any particular questions or want to discuss, as I’ll be running a “lead to juniors” open door policy soon for any career or dev advise weekly.",
            "Yeah. Every year it feels like the goal post keeps getting shifted. The problem is big companies will give you a shot but you’ll be put through the ringer. But the small companies will barely look at you unless you have enough relevant experience (often from an internship or real job). I mean new grad and entry level for them is having legit industry experience. And unless you had like an amazing internship where you worked with some of these technologies you’re out of luck. And then they’ll still pick someone with a year or two more experience. \n\nI’ve had the same experience. I’ve applied to over 70 places now and only two small companies interview me. Meanwhile top companies have contacted me. I’m just not in a place where I feel confident in my skill to nail a top company interview. And we shouldn’t all be expected to in order to get gainful employment. I shouldn’t also have to move to the Midwest or a random ass state to get gainful employment either, especially just to work for some small ass company. I’m not moving to a completely new state with no friends or family for 50k when people without a CS degree make the same and can be by their friends and family. The value is not there.\n\nYou’re still early. I think you need to change your approach with Leetcode. For me, I read the problem, and if see if my brain can understand and process it. So if it’s like a search problem or a string or something I’m like does this make sense? If I have a grid of letters can it make this target word? Do you see the target word in the grid? If I don’t understand it I reread it until I can make sense of it. Then I come up with a steps. Like if I recognize the pattern, how did I recognize it? Yes, I see the target word in the grid but how did we get here? And it becomes a step by step process because I break it down. Like I looked at the first letter, saw it in the grid, looked at the second letter saw it in the grid, etc. And my brain was like oh there’s the target word. Ok now program that. Then use the algos you know to complete the solution, because the underlying method to get the answer will be one of those. Definitely if improve your pattern recognition everything then becomes about syntax and optimization after.",
            "My two cents.   \nLeetcode is good as long as you don't memorize the solutions dude. Look at a couple different approaches to a problem and understand why people did what they did. Why did they choose one approach over the other? Try establishing similarities, find patterns. You got this!  \n\n\nI am in the same boat as you and I read somewhere that \"all the grind we put in now will be worth it\" and I am sure once you get a job, you'd say the same. Just keep going. Do not let rejections bring you down. Doesn't matter if you get a 1000 rejections, all you need is 1 offer. You know what I mean, right? Hang in there. Keep going!  Good luck! :)",
            "I feel this 100%",
            "I’ve been graduated, never had any interns get back to me, and actually up to date 0 companies got back to me. Mcdonalds is in my future lol",
            "Yeah doing almost 300 leetcode and rarely being able to do a medium in under 30 indicates a study problem",
            "dude, what are you talking about? The recruitment cycle is just beginning, right? Am I missing something? I’ve applied to like 5 companies so far",
            "All my friends are landing jobs... I graduate in December and have nothing lines up.. it's scary.",
            "[deleted]",
            "Not sure why everyone is trying to go to FANG but me and my friends are in the same boat!",
            "Started to prepare late, botched the robinhood code assessment and Samsara because im too unprepared, doubting myself, but plowing through. \n\nI’m sitting here reading Cracking Coding Interview and doing more leetcode. My resume is good enough to get some responses so i gotta keep chugging along. \n\nI want to get an internship this year. I just got to continue to piece it together.",
            "I don't think akuna sends out to everyone for every role.",
            "[deleted]"
        ]
    },
    {
        "post_id": "1brd5sr",
        "author": "lebronddit",
        "title": "Almost gave up on internship search but lucked out in the end",
        "url": "https://i.redd.it/93w69dqyofrc1.jpeg",
        "score": 397,
        "num_comments": 34,
        "created_utc": 1711788127.0,
        "selftext": "Nepo❤️",
        "permalink": "/r/csMajors/comments/1brd5sr/almost_gave_up_on_internship_search_but_lucked/",
        "comments": [
            "Gave up after 14 applications. Life must be tough for you bruh.",
            "Congratss 🎉 \nCan you tell us about your experience and the process of the interview?",
            "this is the way",
            "Oh I did that last summer. Got an “internship” at a small company my aunt worked at. (They were looking for one and she got me in the door)",
            "a lesson in networking!",
            "You almost gave up after…. 14 applications? \nIt’s great that your personal network landed you something but tbh I am wondering if maybe you could use a lesson in tenacity if you were really going to give up after only 14 applications and then ended up being handed an opportunity due to a friend’s dad. Congratulations and I truly mean no disrespect here, but just be aware to maybe check the role privilege could have perhaps played in this situation.  Most people have to put in substantially more applications than that in order to land internships. \n\nAlso a sankey chart really isn’t appropriate here since the volume of apps has zero to do with the role you ultimately landed. You are basically gloating and not providing meaningful quantified data.",
            "14 😂 that takes 1 hour",
            "Dad’s friend?",
            "Good bait",
            "Congratulations. I am still hoping I get one",
            "Gave up after 14??",
            "Sigh.. bro",
            "14 applications 😂",
            "There’s people with actual experience that can’t find job, and we’ve got high school kid over here just waltzing into an internship"
        ]
    },
    {
        "post_id": "1attzix",
        "author": "checkematemate",
        "title": "Accepted! - New grad 90k",
        "url": "https://www.reddit.com/r/csMajors/comments/1attzix/accepted_new_grad_90k/",
        "score": 397,
        "num_comments": 70,
        "created_utc": 1708262562.0,
        "selftext": "Accepted! The fact that after a gazillion applications and no responses, I’ll be going to grad school, which is probably gonna cost $90k that I don’t have. \n\nMBA or MSCS?",
        "permalink": "/r/csMajors/comments/1attzix/accepted_new_grad_90k/",
        "comments": [
            "That’s not 90k. That’s -90k. That’s your new salary.",
            "congratulations bud! I'm taking your success as an inspiration for the future\n\nedit: nvm",
            "You will need work experience before MBA.",
            "mba is for changing the field entirely",
            "TC -90k*",
            "Exciting future ahead! I'd say stick to MsCS if you still want a career in tech. The CS people I know do an MBA only after they know for sure theyre heading into a managerial / executive role, or going the startup route",
            "You could see about working for the school. Many universities will offer tuition benefits to employees",
            "Anyone in MMA? Masters of Business analytics?\n\nIt's like a cross between MBA and MSC",
            "Look into OMSCS. More like 5k",
            "Not sure what your career goal is. The Department of Defense is offering a scholarship that pays a stipend, your school fee, and a guaranteed job after graduation. It’s called the DoD SMART Scholarship",
            "MBA bc then you can just go be a consultant and leverage fact that you know cs and be like \"The data model shows that you should kill the bottom 50 engineers to reduce operating costs\"",
            "You might be better off freelancing while working a retail job.\n\nThere’s no guarantee of a job after a masters but there is a guarantee of more student loan payments.",
            "Please, do not spend 90k on grad school.  I promise the ROI on that is going to be horrendous.  Grad school will not help with real world development skills if you plan to be a regular web dev or something equivalent.",
            "Go to OMSCS georgia tech, whole program will cost $6800.",
            "Do omscs for 9k.",
            "mane this is the funniest shit ever",
            ">MBA or MSCS?\n\nDefinitely an MBA because it will introduce you to a huge number of brand new concepts that you have never been exposed to before but have tremendous value in a technical career. IMO this is more useful and valuable than an MSCS, if you already have a CS degree. I have an MBA and have taken several MSCS courses as well and will generally only recommend an MSCS or MSIS degree to someone who does **not** already have a BS-CS, because it's less technical than a CS degree, more about \"technical leadership\", and not particularly applicable to most developers who aren't project managers or directors of some type.\n\nBut an MBA will tech you skills that you can use immediately in your career on day 1. I have gotten a *lot* more value out of my MBA studies than any masters level technical classes I've ever had, tbh. Learning how all the parts--both inside and outside--of a business works is extremely helpful.",
            "New grad nurse makes 100k with overtime 130k and easier to find jobs lol",
            "LUCKY!",
            "I got excited for you. I mean genuinely thinking it was an offer. However, grad school is a great investment. \nI dropped my MBA because I was more interested in Cybersecurity. I was advised to do a broad undergrad, CS, then specialize in my Masters. Congrats!",
            "I thought you got a job for 90k🤣"
        ]
    },
    {
        "post_id": "11bqhux",
        "author": "zabwt",
        "title": "Things you need to hear as a CS Major",
        "url": "https://www.reddit.com/r/csMajors/comments/11bqhux/things_you_need_to_hear_as_a_cs_major/",
        "score": 395,
        "num_comments": 73,
        "created_utc": 1677346179.0,
        "selftext": "-most cs students graduate without an internship on their belt; internships do boost, but that’s what they are, boosts\n\n-chances are that if you’re in this sub, you’re somewhat above average in your cs major, not as an ego boost; but don’t compare yourself to people with Jane Street/ FAANG internships, it’s good to be around this sun as motivation and seeing how processes work, but you shouldn’t feel bad because you don’t have Google knocking on your door with an offer \n\n-for some reason, a lot of students don’t even have the confidence to apply, you can’t let yourself be the barrier to your goal, even if you think you’re not ready enough, you should still do it. this applies to not only internships, but joining clubs/academic honor societies, etc \n\n-summer internships are not over. They may be scarce, but they’re still there due to offers being regened/declined for other better offers. I talked to someone about this, and they mentioned how it was like “picking up another student’s leftovers”, 100%. In November 2022, I got a rejection email from X company, saying I didn’t “meet their minimum requirements”. Just yesterday they sent an email, saying I “meet their minimum requirements”, and whatnot. My summer internship that I secured I got from applying on February and following up on a career fair. The internship scene is more competitive right when doors open, but as recruiters scramble to find replacements for those who changed their mind, that replacement could be you \n\nthat’s all keep ya head up don’t end urself cause no google or Wells Fargo or whatev have a good spring break do ur leetcode",
        "permalink": "/r/csMajors/comments/11bqhux/things_you_need_to_hear_as_a_cs_major/",
        "comments": [
            ">-most cs students graduate without an internship on their belt; internships do boost, but that’s what they are, boosts\n\nThis is true, but it shouldn't be used as an excuse to not try and land an internship. \n\nI graduated last summer and I feel like the single most valuable thing about getting a degree was the internship opportunities it opened up and qualified me for. It's not the end of the world if you can't land an internship, but it should be a top priority. I was able to have multiple job offers even before I graduated because of my internship.",
            "First point definetly can't be true in Canada. Here every university and college is trying to get there students internships, and usually more than 1 during a 4 year degree.\n\nEdit: In fact universities here have no problem turning a 4 year degree into a 5 year one if it means you get multiple internships",
            "Also not having an internship is also not an excuse to not be doing anything. Do hackathons and projects, sure at the end of the day their not the best experience but you have to make yourself stand out someway",
            "So will a single shit internship from a no name company make a significant difference in finding a job once I graduate?",
            "Thank you for this. Am a freshman and scared af tbh",
            "This sub is just an anxiety echo chamber for most.  They will look back one day and realize none of this stuff matters the way they think it does.  GPAs, school name, etc.\n\nIve never even thought of a hiring cycle for example tbh, ill just apply when im ready.  But so many \"omg I missed the hiring cycle am i f'ed etc posts.  I found several people irl hired into tech jobs with no degree.  Good wages too and remote.  Now they are getting certs or degrees but they got the jobs without them.\n\nWhat separates them from these people?  They can talk to other human beings basically and arent crippled with anxiety.\n\nIm not trying to make fun of you guys I really feel for you.  School also does this to you guys, puts you on strict semester limits and has unforgiving GPAs.  Whereas Im over here taking entirely self paced courses, I need more time to study?  Ok.  I can schedule a test/final anytime I want.  I want to accelerate, slow down, I dont have to ask anyone or suffer any real repercussions.  It costs me under 10k in total.  \n\n&#x200B;\n\nThe entire university system is toxic imo.",
            "Yes it’s true . One of my friends randomly got a phone call from a recruiter in December for an internship starting in January. Picking up another students left overs is real.",
            "I went to career fair and I saw so many students with the worst resumes I've ever seen in my life. Some of them had just their name (not even centered) and bullet points with their classes and everything in a different color. If you want to find an internship, please please please work on your resume. It can go a long way to just have a formatted resume.",
            "100%, and some MS programs actually require an internship for graduating, but with the first one I wanted to alleviate the whole “internship or bust” mentality that’s been leaving a lot of people feeling like shit, because of one missing internship year in a 4+ year span",
            ">you’re somewhat above average in your cs major\n\n I dont think someone would need to post here if that was the case tbh. This sub generates the feeling that getting a decent job as a CS graduate is not easy, while it most certainly is. \n\n If you have above average tech skills as you say, no behavioral problems and dont have to worry about getting visa, you shouldnt have an issue at all to find a job in this field.",
            "Another point:\n\n-Software development isn't the only thing you can do with your degree.  \n\nIt's a hot thing, and it pays well, but there are plenty of opportunities out there for Network Administrators, Database Administrators, Systems Analysts, Project/Program Managers, Product Managers, Business Analysts, Technical Consultants, Data Scientists etc... That are all very appropriate careers for CS majors.  You don't have to be a software developer just because you have this degree.",
            "Why are you giving me excuses to not work hard. That's my job. Your job is to push me.\n\nActually no. I like these posts. Please continue to lower the competition. God bless fr",
            "If you go to a half decent university, the majority of students will have at least one internship by the time they graduate. Stop trying to cope with your mediocrity.",
            "Remember guys: don’t ever, EVER kill yourself. Not even once.",
            "Tbh I kinda want summer internships to be done with already just so I can stop worrying about it",
            "I didn’t even think about internships when I was a sophomore in CC and wish I actually did one. Would of helped me out a lot.",
            "In Germany having 3-4 internships + part time during the semester is normal, but also very easy to get.",
            ">\\-most cs students graduate without an internship on their belt; internships do boost, but that’s what they are, boosts\n\ndamn didnt know that 😳"
        ]
    },
    {
        "post_id": "pr0cly",
        "author": "StopBankTransfer",
        "title": "You're probably Leetcoding too much.",
        "url": "https://www.reddit.com/r/csMajors/comments/pr0cly/youre_probably_leetcoding_too_much/",
        "score": 392,
        "num_comments": 50,
        "created_utc": 1632021698.0,
        "selftext": "While doing a challenge of the day is fun, it's not an effective way to leetcode. Companies rarely tend to deviate from their top 15-20 questions on Leetcode, and for a great deal of these companies these questions either directly overlap or have overlapping patterns. Find the harder problems, seriously attempt them, and take detailed notes on what characteristics led to that pattern. For example largest palindrome substring is a 2D DP because palindromes are recursive problem from a given start to end index. Two variables can be represented as as a 2d Array.\n\nStop killing yourself trying to match other people doing 100-200 problems of prep. Do the top 50 by frequency really well.",
        "permalink": "/r/csMajors/comments/pr0cly/youre_probably_leetcoding_too_much/",
        "comments": [
            "this is an issue with most of my classmates throughout high school and college. They study by brute force rather than going for quality studying",
            "This is just an ad for premium /s",
            "Done exactly 69 leetcode and never plan on doing more cuz funny number, and im working at companies a lot of cs majors dream of interning at lmao. The literal way i got hired was through the series “leetcode problems that got me hired” on youtube.",
            "I think you still need to be able to apply common patterns to *new*, unseen problems. That’s where deviating away from the common, ‘most freq’ problems has its benefits.",
            "Agreed. I did the mistake of going for quantity over quality, and now I’ve forgotten the solutions to most of the questions I’ve done. \n\nDo you have a list of your top most frequently asked questions that you see most often in onsite interviews?",
            "Maybe for internships but I can safely say with 10-ish final/onsite new grad interviews, I have never gotten an LC question on the companies tagged list, and around half of them I've actually never seen before. Yeah the patterns are the same and studying those is by far the most important, but they can be pretty damn complex when mixing in other concepts too.",
            "Doing 200 Leetcode is 2-3 a day for 3-4 months. I think thats a great way to give time for spaced repetition of old problems while also looking at new ones. 200-300 done well with quality understanding isn’t crazy. More than that is diminishing returns imo",
            "True. Landed at FAANG w/o touching leetcode once.",
            "idk bruh i did 300 questions (210 med-hard) now most interviews seem pretty easy to me but some are still hard. But this was over 2 years",
            "Strongly agree with your point, but it seems very odd to classify LPS as a 2D DP problem when there's so many more Memory/Time efficient approaches like: Hashing + Binary Search, Manacher, Suffix array, Palindromic Tree, etc. etc.",
            "Some people just do it for fun. Not just for being hired",
            "[deleted]",
            "I generally agree, but there are still so many problems on Leetcode that rely on an observation specific to the problem to get the optimal solution. Understanding DSA knowledge is the easy part. The challenge with LC problems is having the intuition to understand what concept to implement and how it can be used to effectively solve a given problem.",
            "That’s why I’m taking a break!! I want my mind cleared of the all solutions I’ve memorized. \n\nI’m letting the knowledge I’ve gained over the past few months actually sit and then I’ll re attempt them in the future, probably after this semester since I’ll be done with my first algorithms course",
            "Friend of mine did like 2 ever and has an amazing new grad offer.",
            "I would somewhat disagree. I definitely agree that the most important thing is to identify broad patterns and develop a toolkit for approaching different problems, but the more practice you do, the better you will internalize those patterns and more effectively use them.\n\nFor reference, I have never been asked questions I saw tagged as high frequency for a company on leetcode. If you start prep in July, 2 problems a day will get you to around 120 by September. That isn’t that much work compared to the practice you gain.",
            "I disagree, because many of the problems have similar themes and doing the challenge of the day ones is a good way (for me) to refresh the ideas (that I do know) and learn for the ones I don't. \n\nAlso practice definitely helps. Even though I may not remember the exact pattern later, I can get to it faster than if I didn't do the practice.",
            "I’ve done 800+ but just because it’s fun and I enjoy it 😁",
            "Totally agree, when doing mi interview I did at most like 15 problems. I focused more on the quality of the problem rather than the quantity. It turned out to be the roght call.",
            "You learn most of the concepts with first 80-100 problems. After that it's just about increasing speed.",
            "Yeah if you just become a decent programmer, remember your data structures and hone problem solving skills, you'll be fine. People make it seem like you need to devote hours and hours to Leetcode, but that's BS.",
            "Yeah, I did the blind 75 three times over before moving to new questions. And even then I go back to the core questions to make sure I remember how to go about solving them. For the harder ones I come back to, I even forget the solution and I have to solve it again. Slowly but surely :’)"
        ]
    },
    {
        "post_id": "170unn1",
        "author": "PeterPanderful",
        "title": "Duolingo farce",
        "url": "https://www.reddit.com/r/csMajors/comments/170unn1/duolingo_farce/",
        "score": 395,
        "num_comments": 29,
        "created_utc": 1696542985.0,
        "selftext": "Kinda petty, but I find it so funny that a company that preaches so much about “equality, diversity, access” chose 150 random kids, all from Ivy plus schools, skipped them directly to the final round and then filled up their entire intern class with them, forgoing their regular process for everyone else.\n\nShould serve as an indication to every cs major: these companies don’t care about you, or their supposed “goals”. They only care about making money, and that’s it. Don’t kill yourself over them.",
        "permalink": "/r/csMajors/comments/170unn1/duolingo_farce/",
        "comments": [
            "how do you know that?",
            "[deleted]",
            "i go to NYU and i went to the least prestigious school out of everyone at batch day last year",
            "The funny thing about it is Duolingo is pretty inefficient for language learning, and they could easily do better. But at least they get their “top talent”.",
            "Louis Von Ahn portrays himself as some sort of Guatemalan wonderkid that was self-made into success. Reality is that he was as rich af , so of course Duolingo is elitist lol",
            "yea it’s annoying bruh every Ivy kid I know got final rounded -_- meanwhile I get ghosted :)",
            "Not surprising, \"Sorry kid, we don't hire prole scum.\"",
            "I applied to duolingo when i was in first year, I applied in 2nd year, I even attended one of their events.  This year I applied again and even by being part of an organization they parner I don't even got an OA. I literally had and internship at Microsoft and a strong resume, but they still rejected me. The only thing is that my school is unknown in a remote island. So seeing this is interesting.",
            "That’s not true. I went through 3 rounds: OA, technical live, final round live (technical + behavioral) to get the offer.",
            "Well damn",
            "based and eliteschoolpilled",
            "Was Georgia Tech in the list? Trying to abuse this exploit until it gets patched.",
            "Why is it that every time someone doesn't get hired, they come up with some story about how the company is doing shady practices, and that's why they didn't get the offer. You just weren't good enough, bro.",
            "++",
            "Always renege if you have to, unless the consequences with your school *really* aren't worth it.\nEdit: my flair says freshman, am a junior tho"
        ]
    }
]