[
    {
        "post_id": "16t60bs",
        "author": "Dane314pizza",
        "title": "If the CS job market is so tough for new grads, why do wages remain high?",
        "url": "https://www.reddit.com/r/csMajors/comments/16t60bs/if_the_cs_job_market_is_so_tough_for_new_grads/",
        "score": 394,
        "num_comments": 122,
        "created_utc": 1695776296.0,
        "selftext": "If Meta wants to hire new grads, why not find someone who is willing to work for $100K/year instead of paying $200K+/year? If there are so many overqualified CS majors that can't find a job, won't wages decrease for these jobs?",
        "permalink": "/r/csMajors/comments/16t60bs/if_the_cs_job_market_is_so_tough_for_new_grads/",
        "comments": [
            "- revenue per employee ratio is still insanely high in tech\n- they still want the cream of the crop, most CS new grads cannot code very well. other tech companies still paying well would take those new grads. \n- an extra 100k per new grad is nothing to a large tech company, and they still only have capacity for a limited number of new grads who require extra training and smaller projects",
            "What makes you think there are a lot of quality cs majors",
            "The average CS major is not quality. YouTube and TikTok has caused a lot of people to enter CS who previously would not have done it. Some of them are extremely smart, most of them are just chasing a gold rush that has already departed, and are both garbage at CS and not passionate about it.",
            "Because they\n\n1. Still want to attract top-tier candidates (and all companies conspiring to lower wages in unison is illegal + something they've already been slapped for)\n2. Don't want shitty morale, which leads to shitty work",
            "They cant put the wages too low. Most of us are practical and we would get a job as plumbers , truck drivers, etc... If they depress the wages too much.",
            "[deleted]",
            "One thing that I think is happening right now is the market is in a state of whiplash as it transitions from a period of rapid growth to a more stable era. During the 2022 boom companies lost a lot of talent and were forced to settle for lesser candidates for both internships and experienced positions as hiring became competitive. Now hiring has slowed down, but companies are still full of the bad hires they took on during the boom years and their entry level hiring pipelines are full of interns which they over hired in the 2021-2022 era. Meanwhile companies laying off junior devs or canceling intern offers are leaving candidates stranded as the companies still hiring at the entry level will prefer to hire their own interns rather than recruit new people. Further, layoffs seem to disproportionately effect the more competitive companies, are often not merit based, and affect entire teams or cohorts of interns, leaving many qualified candidates stranded. Non-FAANG companies with mediocre hires and interns picked up in the 2021-2022 era could probably lay off the bottom performing 50% and rehire to better candidates, and this would likely level the playing field at the entry level, but this is just not how the system works. Eventually the job market will likely level itself out as internship programs become more selective and hiring standards adjusts to the current market but until then it sucks for everyone graduating from good schools that are caught in this state of transition.",
            "Because it’s bullshit , \n\nYou hear some ridiculous stuff here that doesn’t make sense that sounds like this  \n\n“ I’m a Stanford grad with a 4/4 gpa + startup founder have sent 40,000 applications haven’t heard anything back” CS Is oversaturated “ \n\n\nLike bro I know you’re lying , you know you’re lying stop your bs.",
            "Most applicants are not qualified.",
            "There’s three bell curves. They only care about folks in the third one.",
            "Because they know if they are underpaid they will look elsewhere for jobs as soon as they can. The market is bad but not nearly as bad as Reddit says it is there are still opportunities to jump ship with some experience to be fair. They are also smart and know that this won’t last forever so they will avoid losing a bunch of people at once",
            "I highly doubt it's about qualification as others have said. Companies were happy to hire more and less qualified candidates when tech was booming and interest rates were low. Here are my guesses:\n\n1. [Wages are sticky](https://www.investopedia.com/terms/s/sticky-wage-theory.asp#:~:text=Key%20Takeaways,via%20layoffs%2C%20if%20profitability%20falls). They don't fluctuate with market conditions as quickly as commodified goods. Over time maybe it will decrease but maybe tech will boom again and wages will go up instead.\n2. Companies don't want drastically unequal pay from new hires and old hires. New hires will complain and old hires will leave if their pay is cut. I'm no lawyer but it might also open them up for law suits if someone comes up with a discrimination case. It's more important to them that old hires don't leave.\n3.  Big companies just don't have new grad positions that they want to fill. Whether or not they lower wages the number of positions aren't changing. They'd need to make a decision to grow teams. It seems like they're just back filling previously open positions right now.",
            "They would rather have 1 quality engineer for 200k rather than 2 mediocre engineers for 100k each",
            "Something people missed is that code base doesn't scale linearly with the number of workers.\n\nIt isn't the pyramid where more labours means more stones moved. In a coding project the more ppl are brought on the worse the marginal gains. In fact the marginal return for a code base is so horrid that you'd oftentimes want fewer programmers on it rather than more.\n\nSo what do big companies want? They want a small elite team of coders, and not an army of cheap labours that'll invariably make things far worse.\n\nIt's really a nature of programming itself, being so precise and brittle and highly idiosyncratic. These properties make it exceedingly difficult for a random joe to contribute in a meaningful way.",
            "The pay has dropped significantly for many roles I’ve seen on an avg of $50k. Idk about entry level but breaching $200k is harder outside of Silicon Valley than it used to be.",
            "Supplies and demands. The supplies of mediocre swes rose up, but the number of top candidates are basically unchanged. Meta wants to attract top talents, so they keep their offers the same (not to mention other factors such as unchanged costs of living/taxes, competitive offers, pay equality, etc.)",
            "Instead of paying 22 year olds $200k, they’re paying people with 5 years of experience that were just laid off $200k. They’re so ahead they’re laughing all the way to the bank.",
            "Why would you hire a shit engineer for 100k and get X production, when you can get a 5x engineer for just 200k? Salaries have a bit of diminishing returns unless you're staff+ at the largest faangs but your production should grow more exponentially if you actually hire correctly.",
            "Because they want the best and are willing to pay for it.\n\nYou know that idea of the 10x programmer? There's some truth to that.  My company recently started looking at some metrics to evaluate the productivity of data scientists and developers on our team and the difference in productivity between a mediocre data scientist or developer and a highly skilled one it's pretty shocking.  We've seen differences of 2x all the way up to 6x between average programmers and more skilled programmers.  \n\nThis isn't even counting the underperformers because when you start factoring in the mistakes they make they become a collective drain on the team. For instance, we had one underperformer on our team that not only was he not even a 1x performer his mistakes wound up lowering the productivity of our skilled developers.\n\nSo why would Facebook save $100,000 by hiring a developer who might wind up being a fourth as productive or even less?  I hear that companies like Hudson River trading are offering new grand salaries of $340,000 for algorithm developers. I'm sure they could get a bunch of eager folks if they only offered $80,000, but those people probably wouldn't be anywhere near as productive as the superstars they hire now.",
            "TBH, I'd say out of my graduating class only maybe the top half could actually do the job. Most of the \"overqualified\" graduates are severely lacking in soft skills/practicality.",
            "Wages are sticky, in general. But also, new grads are finding jobs, eventually. And devs with any amount of experience I mean, sheesh.",
            "Cause at the kind of revenue they make, they want the best possible candidate no matter the cost.",
            "The CS market isn't just FAANG. Wages have taken a downturn",
            "This is called “real wage rigidity.” Yellen worked on it. It’s a phenomenon that occurs in other industries as well.",
            ">so many overqualified CS majors\n\nWhat do you mean overqualified? They’re mostly just qualified and unqualified. Very few are overqualified right out of college, but especially not for a company like Meta, which is like, known to be far above average. Which also means it doesn’t make sense as your baseline for salaries that are so high… because it’s not average. \n\nWages probably won’t decrease. Attracting top talent is a different game than just getting the bare minimum. When you see 200 applications, know that most of those people are completely unqualified and unable to perform the most basic tasks at that job. Many don’t even have a degree.",
            "lol people here have no idea what they are talking about. Wages have gone down significantly compared to 2021 2022. It’s way harder to negotiate offers. There aren’t any more money 400k sde 2 offers from amazon and meta anymore",
            " \n\nHigh CS wages persist due to persistent demand for skilled talent, tech's rapid evolution, competition among employers, and the economic importance of the sector, despite market challenges for new grads.",
            "No one wants to hire new grads. Too risky",
            "You way over estimate how useful a new grad is.",
            "Wages are already going down even nominally.",
            "Intern wrangler here: you guys suck at enterprise concepts, OOP, architecture and design patterns. More importantly, most of you haven’t read Code Complete. Now fuck off.",
            "Because a lot of 200k+ a year people are worth 10 100k a year people.",
            "One can make the argument that hiring any junior / new grad is likely to be a net negative to their team/company, so hiring twice as many would be twice as many net negatives. And then one could continue with the argument that the more you lower the salary, the more likely you are to get one of those net negatives.\n\nThere's also a bit of a circlejerk with \"top tech companies\" that pay \"top of market.\" They like to think they're special, and lowering salaries at their company would make them less special.",
            "People in EU will gladly work as contractors for 1/4 that LOL  \n(Especially as Juniors)",
            "Why do you think the CS job market is so tough for new grads? Everyone I know that has graduated has a job.",
            "Wages are generally sticky. People don’t take wage reduction well, and finding cheaper people to replace currently well paid ones are too time consuming that it generally isn’t worth it.\n\nIt’s been observed that even during unemployment rises, wages remain the same",
            "Quality of products doesn't improve by hiring more people",
            "Just because there are a lot of CS grads doesn't mean they (we) are good.",
            "Lots of these postings need someone, and need them now. They don't like building someone up for years or even months at a time.\n\nHaving said that, there are some people who, through networking or being lucky af manage to break in.\n\nSome idiot I went to college with, 2.0 GPA, barely graduated with a middle \"leap year\" networking with some other military brats. He got a civilian job building software for drones, and he makes $120k a year starting.",
            "i think your prediction will manifest as new companies/startups spin up with similar quality and cheaper labor, forcing fang incumbents to look beyond the same 4 target schools.",
            "Statistics bias, salary data does not consider the amount of effort to get in and required experience level compared to 2020-2021. \n\nI think data for software engineers has some kind of survival bias. This is especially true for entry levels. A software engineer's salary is calculated only for those who are actually employed. So if companies reduce the size of their software engineers' hiring while increasing their pay, the value of their software engineers' salary data will increase without reflecting what really happened. For example, if there is an entry-level hiring freeze, new software engineers' salaries are likely lower than mid/senior-level salaries, so the hiring freeze will reduce new developer salary data, which is part of lowering the average salary. In addition, many companies are originally mid-level, but often offer offers at a slightly higher salary level than entry title and entry when hiring. In this case, the actual wage has actually decreased, but statistics will show that the salary has gone up because it will be considered an entry-level job anyway.\n\nFreezing new developer hiring could inflate developer pay data more than it actually is in a few years. This is also slightly similar to survival bias. If new developer hiring is frozen, only the best and best candidates can get jobs. Since only those people were hired, the salary information is gathered from the top applicants in 1 to 4 years, so those developers are likely to move to the top companies with higher salaries, and the general level of developers would not have been hired at the time. Because hiring is frozen, most of the data on pay comes from top developers. Therefore, it will be difficult to reflect the actual salary or employment situation because it is mainly for the top candidates.",
            "power law distribution of employee value. there may be an abundance of total graduates, but the top 1-5% are still a scarce resource."
        ]
    },
    {
        "post_id": "16mvhv4",
        "author": "Calm_Ticket",
        "title": "Are graduates with no internship experience pretty much screwed nowadays?",
        "url": "https://www.reddit.com/r/csMajors/comments/16mvhv4/are_graduates_with_no_internship_experience/",
        "score": 399,
        "num_comments": 206,
        "created_utc": 1695140719.0,
        "selftext": "I've been applying to so many jobs and it's been email after email of \"After further review and careful consideration of your qualifications, we have determined that other candidates’ qualifications more closely match our requirements\" a month+ after I apply. It feels like without any experience, my resume doesn't matter at all in the eyes of a hiring manager. I'm really not sure how much longer I can take of this catch 22 of needing experience to get a job but nobody wants to give any chances at gaining experience. I've gotten so desperate to the point where I've lowered my standards all the way to be willing to take 40k a year.",
        "permalink": "/r/csMajors/comments/16mvhv4/are_graduates_with_no_internship_experience/",
        "comments": [
            "For me, as someone with no internship experience but 2+ years as a teaching assistant, it’s been so rough. The only positions I’ve been able to routinely get are teaching positions at my university, and even those are hard to come by.\n\nI rarely get OA’s and that’s even with an undergraduate degree in CS from a T5, continuing onto an MS CS at the same university. I’d like to think it’s a lot of companies waiting until it’s more clear on how the economy is and their capacities to hire, but with these “entry level” roles requiring 3+ years of experience, it seems hopeless. I’ve started to just look for unpaid internships as something is better than nothing to get my foot in the door.\n\nBut I feel you 100% and I’m hoping you catch a break soon! You got this :)",
            "Totally screwed, I rushed my graduation and now I’m stuck applying and applying while working retail. Completely being ghosted from entry level positions and internships. Oh well I’ve been offered various teaching assistant jobs lol seems like there’s a pattern here.",
            "What makes u think that graduates with internships are not screwed!",
            "Who would have thought the \"Do you want fries with that?\" algorithm is the most powerful algorithm cs students can learn.",
            "One way I could think of is you will have to find other ways other than spam applying. Going to conferences can help a lot",
            "Yes. Unless you can go back in time and do internships, you’ll need to prove yourself elsewhere then. Try adding projects to your resume.",
            "Everyone is it seems. I'm just focusing on my saas startup instead. Can't find a job? May as well create one at this point lol, at least that's what I'm trying to do. Even if it fails, the software may look very attractive on the resume.",
            "I have a small company continuing internship(did FT Summer, and am doing part time right now), and It's terrible, I have no idea how people without any internships are even going to get a job.",
            "Pretty much yeah. Unless you have an amazing projects collection.",
            "After reading these comments I have come to the conclusion that CS is over (at least for new grads) and as a junior w/o internships I should jump ship if I want to find meaningful employment\n\nThat being said, what’s the new money move major? Premed and law seem cool although that’s a lot of student debt lol",
            "Yeah, it’s rough out here, I’m willing to take a 50k job at this point",
            "I'm in the same boat as well. Although I did some free lance work in web development (through reaching out to family friends with businesses) and I've been auto rejected by companies that are only local. I'll update this post if anyone's curious if I ended up successfully securing a job lol.",
            "There's always Healthcare",
            "My buddy graduated with no internships this April.  He applied to one place, got 2 interviews and an offer.  It’s a PHP IT job and it’s 45k/y.   It’s possible if you lower your standards for sure",
            "Fake it till you make it…",
            "2 Rainforest internships + T20 CS school and been resume rejected/ghosted by nearly every company on the new grad GitHub, it’s brutal rn",
            "Unless you need a visa undergrads with no internships get contract jobs to hire or jobs at companies small enough they're not known for tech, but big enough they need an in-house tech team.",
            "Picked up a local developer job where I graduated for 65k/year. No internships and kind of lack luster on the projects. Hoping to find a new position soon. It's definitely possible but I might be a rare case. I agree with the other people in this thread. You really have to make some connections and dig deep.",
            "how many jobs have you applied to?",
            "I just landed a job as a systems engineer. Gonna be writing code to make industrial machines work properly for clients. No internships, one officer position, a decent capstone, and a helpdesk job through school.",
            "Lie on your resume\n\nDesperate times call for desperate measures /j",
            "Yes",
            "Maybe look into consulting companies if you’re not having any luck with normal jobs. That’s what I did last year when I graduated with my AA in CS. I took it because I knew I wasn’t in a good position to compete with BS grads and the lay-off’s were starting. I’m completing my BS while I work for the consulting company, I also have no internships so I’d be screwed if I lost this job.\n\nStarting pay is shit but at least it’s a start.",
            "Coming from a graduate that scored a job in 2022 with no internship under my belt, yea you guys are fucked more than I was. If you don’t have work experience prior to your first full time job search that shit is gonna be more long and emotionally draining. \n\nBut I will say it’s just harder for y’all given the current circumstances but not impossible and likely to take longer than it did over the Covid bill market. Best of luck all!",
            "I took a 60k job in finance. I’m hoping to just move to a different role at this company since it’s big enough. I’ll go back get an MBA and try to make a good wage. Fuck trying to keep doing OAs just to get no call backs. \n\nHere in Utah they just opened new grad roles at adobe and LinkedIn shows hundreds applying and has changed each time they open it. Someone I know told me it’s just a few roles. Your also competing with masters degree students. I",
            "Best advice I can give is join a tech company but do be in some small menial role like data entry or some low paying role first(possibly minimum wage).\n\nAfter a year you can apply and transfer to the tech department within that company. Companies usually fill and transfer internally first before they hire outside.\n\nOf course my advice only apply to those who are willing to wait 1 year. During those one year, keep your skill sharp, do side projects, and of course keep applying elsewhere.",
            "What kind of jobs are you applying for? Are you applying with intention or just shotgunning? It took me 2 months of applying to land a junior dev job as a guy who dropped out in his senior year and had no internships. Started out at 65k and now I’m at 85k in a very LCOL area. Got hired a year ago.\n\nI never shotgunned my resume. I applied to 10 different companies that I wrote cover letters for all. I got 4 interviews and 2 job offers and I picked the company I liked more.\n\nFor reference, 80k in my area equates to about 130k in Austin, TX.",
            "It’s all about the network. I am a bootcamp graduate and just got a $80k job. I found the job a week before graduating. This is my second week of work. Add people from your school on Linkedin that graduated recently and that are working. Write them to inquire about their job search process. You’ll be surprised by their strategies. Plus you’ll end up with an extra connection for a future job. Find events, hackathon, etc. Ask your friends.  Do real projects. Find a non profit and offer your services.",
            "I have 2 internships and I'm in the same exact boat, I think it's like this for everyone except people who have FAANG on their resume :/",
            "[deleted]",
            "same boat.",
            "I would say applicants without experience are disadvantaged. I would also say internships are not he only way to get experience. Do Upwork, do freelancer.com, directly sell a modest app to your family member. Volunteer to build a real life app for a non-profit, or ask for minimal wage. Contribute to open source projects, with very good, supportive communities, resources and processes. Attend lots of software meetups.\n\nMy wife once landed a junior software job without having spent one hour programming. It paid her more than my first junior job post training and education. Because the hiring manager appreciated the non-code qualities she would bring to the team, liked her, and believed she could learn on the job. She got Microsoft certifications, was appreciated by her team, could have built a career, but found she didn't enjoy it and left.\n\n No one in their 20s is \"screwed\" because of any decision. The message is that there is a conveyor belt you jump on or miss. The reality is that there is a goal, there are obstacles, and there are a hundred routes available to you. \n\nSo if you get a paid internship, yay for you. If not, get experience any of a dozen other ways. And meet the software community, attend events, give a lightning talk. Make friends. No one expects a junior to KNOW. Even if you think you do after a degree. They want someone they would enjoy hanging out with, who they are convinced has aptitude and work ethic, and who they think they can get productive over a few months and competent over a year or two, who isn't too expensive.\n\nThe internship is only one, moderate, indicator of these things. Also, don't just look for jobs and internships in big name companies. Approach small startups, non-profits, agencies. Don't believe the all or nothing narrative here. You have lots of options. You just need creativity, determination, courage, grit, grit, grit: and action.",
            "You need to start reaching out to other positions in tech not just SWE.",
            "Go to LinkedIn - connect with employees of companies that have vacancies - ask for a referral - done",
            "Depends on what school you went to. If it's T20, you should be fine.",
            "If you believe in yourself and keep pushing through there will be light at the end of the tunnel. Mashallah brother",
            "You think 40k is lowering? :)",
            "I currently work as an app developer at my current school. Almost two years experience. But i have a shitty GPA(3.3)💀. I am hoping the experience will help me once I start applying for full time job. Planning to graduate May 2024.",
            "I have a $15/hr job, is that something?",
            "I didn’t have any experience or internships, but still got a SWE position right before graduating this last May.",
            "CS degrees can also pivot towards IT or data analytics. (And there is way more available positions for those as they need them even at regular companies)\n\nI somehow did both. Got in with an entry level IT type support role, then showed how well i can do data analysis and now being given the opportunity to do that at same company. Trying to take the long way around into data science since job market went sour right when i graduated. And i jad no internships",
            "\"I believe that my experience learning different coding languages and debugging skills will also make me a fast learner when it comes to making McChickens and Big Macs, while my ability to keep cool under pressure will translate to me being able to put down a basket of fries and at the same time tell my coworkers to grab more McNugget bags from the back while we are getting a lot of orders during lunch rush.\""
        ]
    },
    {
        "post_id": "13ccydp",
        "author": "Blender_Nocturne",
        "title": "Don’t give up hope!",
        "url": "https://www.reddit.com/r/csMajors/comments/13ccydp/dont_give_up_hope/",
        "score": 397,
        "num_comments": 28,
        "created_utc": 1683599893.0,
        "selftext": "Just wanted to put this energy out into the universe.\n\nToday I got my first SWD offer, and I’ll be taking it. 80k plus 2k sign on bonus and insane benefits. \n\nI started university at age 25, and graduated with my BS at 29, three months before I turned 30. My GPA was ~2.4, and I have no internships or any industry experience whatsoever. I do have some restaurant and retail experience though. I graduated in December and after hundreds of applications, got this offer. \n\nMy point of posting this is, do not give up hope. No matter how hard the job search gets. I thought for someone like me, it’d take a year to find something. But I took advice on my resume, and worked on keeping up with LC, and it actually payed off. I’m still in shock. \n\nKEEP YOUR HEAD UP!",
        "permalink": "/r/csMajors/comments/13ccydp/dont_give_up_hope/",
        "comments": [
            "Congrats! This gives me hope! What school did you graduate from? If you don’t mind me asking.",
            "As someone who started my first semester in my 20's this gives me hope",
            "Thank you, this is inspiring. I went back to school at 25 and graduated at 31 this past weekend taking semesters off in between and having to start my degree from scratch after transferring. Im getting low and down about it, but I'm trying to keep pushing through. I just graduated from UT Austin with my BS and applied to UT's MSCS program for the fall just incase.",
            "I’m 22 and I have 2 years left, I have a little internship experience but I really just got lucky to get it, I’m pretty stressed about actually finding a job when I graduate, how do you even find hundreds of places to apply to?",
            "This gives me hope! I’m starting over my career at 28, starting my CS degree in the fall. I’m excited!",
            "For sure! Never give up!\n\nAnd really happy for you! Congratulations!",
            "Thanks! I’m in the similar boat! And helped motivate me!",
            "Bravo 👏",
            "Congratulations on the offer!!!!!",
            "80k is a fantastic start! Good luck to you in your career and congrats on the career change",
            "hell yeah !!!!!!!!! so only LC helped? 🥵 what projects did you showcase to get interview bro!?",
            "[removed]",
            "Thank you!! I also graduated in December, but still looking for a job.",
            "Well?? Share the advice you were given!",
            "Did you have to move, or did you get a local/remote job?",
            "Congratulations! It's inspiring.",
            "Can I ask where in the US the job is located?",
            "🎉👏🎉👏🎉👏🎉👏🎉",
            "Congrats! I feel like GPA doesn’t mean shit. I’ve always felt too savvy for the system and despite being “gifted” I never felt inclined in school. I am back in college in the CUNY system and have a 2.7 GPA but it’s a long story. My work ethic isn’t determined by my GPA, rather my work ethic comes from sacrifice and willingness to help the company I work for. I currently work in a bank making 25 an hour which is nothing, I will prevail in getting my degree cause nothing will stop me from getting it.",
            "I’m going through the exact same journey rn 24 just starting",
            "Thanks needed this",
            "Where is your job located? Is it in HCOL or MCOL city? What benefits do they offer that makes you think it's amazing?",
            "Also started at 25 and will be graduating at 29. Thank you for this!"
        ]
    },
    {
        "post_id": "ei009f",
        "author": "steviewondress",
        "title": "Amazon (SDE intern) vs Chipotle (crew member)",
        "url": "https://www.reddit.com/r/csMajors/comments/ei009f/amazon_sde_intern_vs_chipotle_crew_member/",
        "score": 392,
        "num_comments": 42,
        "created_utc": 1577779488.0,
        "selftext": "Which should I pick? Amazon pays significantly higher but I’ll have Amazon on my resume which may hurt for full time recruiting (I heard it’s frowned upon by recruiters). At Chipotle my peers will probably be smarter and I get free meals and guac. Plus I can stay at my apartment on campus because Chipotle is very close by. Which would you guys take?",
        "permalink": "/r/csMajors/comments/ei009f/amazon_sde_intern_vs_chipotle_crew_member/",
        "comments": [
            "Pick the guac or get the glock",
            "Always choose free guac, no exceptions",
            "Chipotle, easy.",
            "I’ve worked at chipotle for 2 years so here’s my two cents: the free food/discounted food(it’s only free when you get it during your shift, else it’s discounted) is good and all but depending on your fellow crew and management it can be hell. The company stopped caring about its workers after the e.coli fiasco and more on customer retention/service. Working the line isn’t bad but if you are BOH (prep/grill) prepare to fucking WORK depending how busy your store gets. Hardly anyone will spare time to help you since they have their own tasks to do. I would say go the Amazon route since it will look better on your resume than a fast food place. I don’t know about your peers at your location but at mine I wouldn’t say they were smart, just mediocre (my store had high turnover so my GM just scraped the bottom of the barrel hiring literally anyone that can speak English).",
            "wtf i tried a satire post just like this and people took me seriously.  admittedly it was a bit less obvious, but the failure to recognize satire from sincerity rly speaks to the toxicity of things",
            "Just think about what would help your career more. If you get free guacamole, you can put it on your resume",
            "What is there to think about? free food is love, so Chipotle",
            "Does anyone know why Amazon SDE interns are frowned upon?",
            "Albertsons",
            "Explosive diarrhea vs a giant migraine. Pick your poison.",
            "Amazon definitely",
            "That moment you realize that Chipotle employees are somehow more intelligent than Amazon’s SDE Employees... And then there’s me, a CS Major, making two AI figure out pong.."
        ]
    },
    {
        "post_id": "yo79rl",
        "author": "LosslessQ",
        "title": "What companies give out free food?",
        "url": "https://www.reddit.com/r/csMajors/comments/yo79rl/what_companies_give_out_free_food/",
        "score": 393,
        "num_comments": 149,
        "created_utc": 1667779891.0,
        "selftext": "Looking to apply only to companies that feed their employees for free here's what I got so far:\n\n* Google\n* Asana\n* Robinhood\n* LinkedIn\n* Facebook\n* Bloomberg\n* Uber\n\nAm I missing any other companies?",
        "permalink": "/r/csMajors/comments/yo79rl/what_companies_give_out_free_food/",
        "comments": [
            "What companies give out offers?",
            "Mcdonalds",
            "Most high-paying Bay Area tech companies do, to the point where companies that don’t (e.g., Apple, Amazon) are outliers",
            "[deleted]",
            "Chik-fil-a has free chicken sandwiches...Not sure why that's important to you but there ya go",
            "Palantir",
            "Might not have free food as a benefit but the larger rainforest offices have so much leftover catered food, lunch/learns, and business lunches it feels like it most weeks.",
            "Stripe",
            "Roblox",
            "The homeless shelter down the street",
            "I want FOOD. All I want is FOOD.\n\nI don’t get the way you guys think. I want FOOD. 3 meals a day right out of college. 2000 calories a day entry level. I’m in this for FOOD. I don’t care about whether I’m “adequately compensated” I want FOOD. Whatever gets me the most FOOD. What do I need on my resume to get the most FOOD. What technology gets me FED THE BEST. All I care about in this major is FOOD. That’s why I’m in college, I don’t wanna laugh and play with y’all. I don’t wanna be buddy buddy with y’all. I’m here for FOOD.",
            "Twitter, Meta, Snap, Pinterest",
            "Netflix -- The food is actually pretty banger too.",
            "As an aside do people working at companies providing free food actually gain weight or do they have plenty of self control and discipline?",
            "Not sure if this a troll but…\n\nLet’s say you save $30 a day in meals. $30 * 5 (days per week) * 50 (weeks per year) = $7,500. In a world of $300k+ TC, $7.5k benefit is negligible.\n\nElse, I’m sure Wendy’s also hands out free meals in the back.",
            "[deleted]",
            "Apple. Jk u have to pay for food",
            "Amazon has bananas, Microsoft has free food at their svc location, Roblox has free food that’s actually good",
            "Saving this for future ref",
            "Optiver",
            "https://www.levels.fyi/benefits/Free-Lunch/",
            "Samsara has nice catered lunch!",
            "Plaid!",
            "Atlassian",
            "Twitch",
            "Attentive. Full remote and you can expense $15 per day in food.",
            "Subway gave me a free sub each shift.",
            "Bloomberg stopped last week, sorry mate.",
            "Flatiron for a smaller company",
            "Roblox",
            "Indeed",
            "Wendy’s , Burger King , white castle",
            "Cruise",
            "Almost all of big tech offers this - Nvidia, meta, etc adding to the list. Startups offer them too, a few",
            "Check out Google on levels fyi and check benefits section then check free food companies from there",
            "Instabase",
            "Riot I think?",
            "Why does that matter lol",
            "It’s Meta, not Facebook. It has been over a year dude…",
            "Scale AI, Clockwise",
            "Many startups in nyc feed their employees with around 18 dollars of seamless credit. Some places cater from a rotation of restaurants. Not sure if those do it for you. I personally enjoy ordering whatever I crave. \n\nThe ones you’re naming has their own kitchens.",
            "Unity",
            "Roblox",
            "DRW",
            "Indeed",
            "Red Bull",
            "Publix and Netflix",
            "Jane Street",
            "Amazon provides free bananas. Etsy has boiled egg Thursdays.",
            "Free food normally means sh*tty food. E.g. if you are in Germany don't accept free food from germans, you'll regret it.",
            "Indeed",
            "JUSPAY",
            "Twitter💀",
            "A lot. It doesn’t have to be a big, international, billion dollar company. Smaller companies do this too.",
            "The food at Google is honestly amazing.",
            "Datadog",
            "American Express.",
            "Mercedes Benz Research and Development India",
            "Netflix. Free catered breakfast and lunch in every building and infinite snacks.",
            "I think Reddit? Saw someone on Tik Tok who got free food there.",
            "Yext -> free lunches",
            "Asana is free food",
            "is there a list for companies that offer housing?",
            "Flexport",
            "This person is asking the real questions",
            "Aerospike gets catering",
            "All of them more or less",
            "I think Bloomberg got rid of their free food. It was apparently just a COVID perk. I could be wrong tho!",
            "I created an account specifically to tell you:\n\nfor the love of Christ, do not base your decision on where you're going to work based on whether they supply you with a meal or not. Base it on total compensation. TOTAL COMPENSATION.  Your pay, your health insurance plan, time off, mileage, meal stipend, 401k/retirement, sick leave accrual and usage, etc.\n\nSure, you might get a free $1.00 bagel every day, but is that really worth it if you're making $20k less or don't have 100% covered health insurance?",
            "Meta and Atlassian and Dropbox"
        ]
    },
    {
        "post_id": "rulsz1",
        "author": "throwaway81450496",
        "title": "Quant - Some clarifications and advice",
        "url": "https://www.reddit.com/r/csMajors/comments/rulsz1/quant_some_clarifications_and_advice/",
        "score": 395,
        "num_comments": 123,
        "created_utc": 1641163923.0,
        "selftext": "Alright alright, I’ve got a bad reputation here, but too many people have been DMing me so I wanted to clear some things up.\n\n1. EDIT: Don’t trust popular guides or people trying to sell you stuff\n\n2. The best way to learn math and probability is to start with the fundamentals. I recommend Aclumus by AOPS. Create an account, set difficulty to super hard, grind until step 3.\n\n3. Take the putnam, at this point if you find the putnam unbearable quant may not be for you. All of my co-workers love contemplating problems like these on our free time and genuinely find problems like these interesting. If you find math unbearable you’ll find quant unbearable (disclaimer: I worked at HRT so culture might be different)\n\n4. LC is actually not that great for learning. I recommend going through the entirety of train.usaco.org (again fundamentals). The trick with this website is that it doesn’t let you progress until you solve the next problem, meaning you should be spending days or weeks on some of the harder problems. This will siginificantly improve problem solving ability and when you solve a problem it’ll give you a big dopamine kick. Grind until step 5.\n\n5. Start doing past competitions on usaco.org. I personally got to platinum but being able to solve gold problems is enough for all FAANG and Quant interviews (and yes this is for high schoolers lol). If you find these problems fun try ICPC too\n\n6. Do you go to a no-name school? I did too. UIUC for Math. To get interviews simply get something on your resume that’s world class. Some possibilities: Putnam score, ICPC medal, good first-author publications, FAANG internship. (I went the publications route)\n\n7. Finally follow all your usual interview advice, smell good, eat a mint, don’t sexually harrass your interviewer etc.\n\n8. Profit, literally. New grad TC is anywhere from 300 (Akuna, DRW, WQ, Optiver, IMC, Jump) up to 600 (JS, 2S, Shaw, HRT, Radix, Head)\n\n9. Don’t do cocain off a stripper’s ass. Great in the movies but not great irl.\n\nOh one more thing, if you’re practicing quant interview problems off some book or guide you’re doing it wrong. Fundamentals fundamentals fundamentals. Learn transferable skills. If you want interview specific practice just apply to some tier 3 firms. There are so many quant funds its crazy. Also check this link but might be outdated. [[Quant internships]](https://github.com/quantprep/quantinternships2022)\n\nEdit: Lots of debate between FAANG and Quant. Let me say this, all roads lead to ~~Rome~~ money. The point of this post is to emphasize that you need to work on FUNDAMENTALS. Don’t do specific interview prep or try to find out interview processes. If you do these things and find out you hate quant, FAANG is trivial with this skillset I promise. “Don’t build a house on sand” - paraphrased from some bible story",
        "permalink": "/r/csMajors/comments/rulsz1/quant_some_clarifications_and_advice/",
        "comments": [
            "so basically just train high school CS and math Olympiad. LMAO college students smurifng in high school contests like usaco,amc,aime 😩",
            "UIUC for Math is literally a top 25 program and tons of companies will keep a door open just coz of it's CS reputation as well (just felt a lil hurt you would short-shrift UIUC like that hehe but congrats on your success man)",
            "How good at Putnam do I have to be to know I'm smart enough to make it? Is this some t500 or bust shit, or is being able to do 1-2 problems good enough?",
            "UIUC is ranked 5th for cs lmao, its not a no-name school. fellow UIUC undergrad myself",
            "“Don’t sexually harass your interviewer” HUH?? Is this something that actually happens?",
            "Is it possible to go from FAANG to Quant after working a few years at FAANG? Or do they just hire from their internship/new grad pool",
            "Not interested due to last point. \n\nSeriously, what do you do with all that money at 22 other than saving?",
            "Thanks for the advice, is there really a huge difference in tc with quant vs faang tech? This is always enticing, but I think I'm just not interested in mathematics that much and tech seems like an easier path to follow",
            "U got lowballed by HRT bro",
            "UIUC for math is not exactly a no name school though.\n\nLots of quant firm employees come from UIUC",
            "Think another thing is that not everyone is cut out for it.  FAANG is way more attainable just due to number of seats.",
            "This is for quant trading right? Would be interested to see a quant dev version of this as I don’t think the same emphasis on maths applies",
            ">... Don't sexually harass your interviewer.\n\n[Important advice, some people struggle with that.](https://www.reddit.com/r/ApplyingToCollege/comments/eqriom/i_tried_to_kiss_my_interviewer_are_my_chances/)",
            ">smell good, eat a mint, don’t sexually harrass your interviewer \n\nOne of these things is not like the other",
            "Agree with this advice. However, most people here would rather not try than fail at something and pretend to be happy with 60k salaries because \"\"\"\"money isn't everything\"\"\"\". This sub is not deserving of this advice, too many copers.\n\nAlso UIUC isn't a no-name school lol",
            "What is the percentage split of quants of undergrads/masters/phds from what you know?",
            "Don’t delete this post ever. Please i beg you and thank you for writing this :)",
            "What distinguish good quants from bad quants? \n\nSide questions: what kind of publications did you have? Did you do quant internships or straight into quant full time?\n\nThanks for the post!",
            "You've mentioned you went the publications route; could you give an idea of what tier/number of publications we're talking about?",
            "Last point is insane. Quant is harder than Faang. Frankly if you prep like this Faang will be so easy. Shoot further than where you want to hit",
            "I heard transitioning to quant from swe once you land an swe offer at a trading firm is also an option. Is this possible?",
            ">You pretty much won’t get anywhere extraordinary if you only do things that are ordinary \n\nIf all you aspire in life is to write code that help  people with a lot of money make more money with their money than that just makes you ordinary by definition.",
            "I mean… can’t I just get a masters and also get in, instead of rushing for post grad",
            "I’ll judge #9 for myself thank you very much!",
            "Moo!\n\nFormer usaco admirer!",
            "This information is so helpful, I might just downvote it in an effort to gatekeep. Thank you so much dude",
            "kinda cringe you think working at hft is doing something extraordinary, no?",
            "Quant is not SWE. Lol.\n\nThere is a difference in working for a bank and working for a tech company.",
            "For clarification, are you referring to SWE roles, or actual “quant”/QR roles?",
            "Following",
            "[deleted]",
            "lol in what world does faang internship count as world class",
            "How much CS / math did you know in high school? Did you come into college as a beginner or did you already know a lot?",
            "Hey, great post. Just curious, would you know what’s the route for someone who is not a new grad? What if I have 2 YOE, how would I make the switch?",
            "So is this more for like SWE roles at a quant, or something else?",
            "Thanks bro.",
            "Hey this is so helpful. thanks so much :)",
            "I get exactly why you edited (1.) \"out\" because it's almost self fulfilling but I still believe it deserves reading in its own right. I have never put (1.) better into words even though it's something I've believed for a long time.\n\nIt went something like\n\n>1.) If you want to be extraordinary, don't follow ordinary advice. You have to stand out.\n\nAnd it applies to more than you think. If 10 people are in a room and one of them is wearing red and the rest are wearing blue, if I told you one of them is gonna be rich, which do you think it is?\n\nWith 0 context, 0 evidence, 0 reasoning you can pretty much bank it's the one wearing red because supposing it's the blues, each individual blue has a 1/9 chance of getting picked while if it's the red it's definitely that guy.\n\nThat above sentence can't be proven right and you can think of examples where it's not, however it still feels so right.",
            " is rule 9 advice from your personal experience?",
            "How long did this take you to learn?",
            "!RemindMe 1month",
            "👍",
            "How do I know which step I am on?",
            "Do you have any examples of 3rd tier firms for QR?"
        ]
    },
    {
        "post_id": "q7k0fr",
        "author": "i_dislike_camel_case",
        "title": "This subs obsession with jobs, internships and Big Tech",
        "url": "https://www.reddit.com/r/csMajors/comments/q7k0fr/this_subs_obsession_with_jobs_internships_and_big/",
        "score": 394,
        "num_comments": 122,
        "created_utc": 1634157158.0,
        "selftext": "Hey everyone. I've noticed that a post on this subreddit has about a 0.95 probability of either being about jobs or internships, most noticeably at Big Tech companies such as FAANG.\n\nThere's a complete lack of passion and genuine conversation about computer science. This is in stark contrast to how I and many of my peers experience the field and academic life. For example, Big Tech companies are very much frowned upon and often referred to as \"selling your soul\", even by some of our professors. \n\nI'd like to start a conversation about how you experience your time at university/college. Do you love CS as well? Are you just in it for the money? Somewhere in between? I won't judge. After all, you won't fool me into believing that ***all*** engineers, doctors, and lawyers are strictly following their passion and not whatever makes their bank accounts grow the fastest. \n\nI for example would love an academic career even if it means never setting foot in a corporation such as Amazon (which to be honest I see as a bonus) if that means I get to do what I love: CS. So what about you?\n\nAnyway, cheers and good luck!",
        "permalink": "/r/csMajors/comments/q7k0fr/this_subs_obsession_with_jobs_internships_and_big/",
        "comments": [
            "Programming gives me the chance to exercise my brain. Idk how to explain it, but when I try to program or solve coding challenges, it tickles my brain and gives me that sense of happiness and gives me the sense of accomplishment.",
            "I take issue with the \"selling your soul.\" I have always been interested in CS because I want to build cool tech. Some of the coolest tech is at the big tech companies. Including Amazon. Amazon builds a ton of cool shit. That's undeniable. I have worked at insurance companies and finance. Boring. Not to say that those are bad jobs. Just not right for me.\n\nI've tried research. Don't like it. Won't catch me doing a PhD.\n\nFinally, it's not bad to want money either. Personally, making more money than my parents do means that I can help put my sister through medical school. We just shouldn't put others down for not making as much or choosing not to make as much (choosing Tesla over FB for the passion, or a similar situation). Everyone has different wants/needs. Why do we need to gatekeep?",
            "I think some mod input on this is warranted.\n\nThat this sub is mostly just about getting that $$$ is pretty obvious. It's understandable -- money is pretty important, and useful -- and I don't want to suppress the discussions around job-getting that people are clearly interested in.\n\nThat said, it does crowd out other aspects of being a CS major, so I'm considering a spin-off sub, one that's basically \"for CS majors except you can't make threads focusing directly on interviews/internships/new grad offers/etc.\"\n\nMy main concern in creating a spin-off is that there already are other CS subs that are more academically oriented, and we even have links to them in our sidebar. It's possible we could be creating needless duplication, so I'm not certain yet the best way to approach this.",
            "It was the most interesting major that had the best roi in terms of getting a stable well off job. I’m willing to sell my soul from 9-6 so long as I’m free from 6-12. My real dream would be to travel from city to city like a nomad. Literally explore and see the world and different cultures for myself, but u need some money for that.",
            "TC or GTFO",
            "Bro when u see 6 six figs after undergrad then I’m happy. You can even make senior in 5 years if your smart which is big money and good hours. \nTLDR; money and hours are good",
            "I am in purely for the money because I have family to feed.",
            "I feel like most people dont love CS and instead love Software Engineering.\n\nMost people don't care about all the theory that is involved in Computer Science and instead are interesting in building cool stuff with tech.\n\nThere aren't too many software engineering degrees out there and you still most of  the knowledge that comes with a CS degree to be a decent SWE, thus everyone goes into CS.\n\nThe coolest stuff to build is often found at the huge tech companies, so why not leetcode grind for the chance to make large sums and hopefully work on cool stuff. Or at the very least gain experience working at scale to then go make your own thing?",
            "I love Math and the theoretical side of CS. I hate Software engineer but do it anyway bc of the money.",
            "I enjoy computer science a lot, and wouldn’t trade it for any other major\n\nCS also happens to make bank, especially at big tech companies where TC past $200k is not unheard of.\n\nSo I have the extraordinary rare opportunity of pursuing something that I both enjoy, excel at, and makes tons of money. Why wouldn’t I capitalize on that?",
            "I''m sorry I can't relate to this. I grew up poor, and I love CS, but I also love the opportunities it brings. I struggled to get to this point in my life. I'm not at a FAANG but I'd jump at the opportunity to \"sell my soul\" as you put it. I have family to take care of I can't purely pursue something because of \"passion\". Would i appreciate CS if it didn't lead to the opportunities? Sure. Would I major in it? Probably not.",
            "Somewhere in between (I’m guessing this is where the large majority of people are).\n\nI do enjoy CS in itself as an academic subject. But I 100% do not plan on going into an academic career at all— writing research grants/papers/academic administrative stuff is just not for me and I don’t particularly enjoy teaching. I say this as someone with research/TA experience and a parent who is a tenured CS professor.\n\nI also like math and physics and music approximately just as much as CS. But I also have life goals other than just pursuing my academic interests (such as, financial stability, work-life balance) that make a bachelor’s degree in CS a much better choice",
            "it's great that you are passionate about CS, but reading this post gave me an air of smugness that i found appalling. just like anything in life, someone's decision to work for big tech companies or to be in CS for financial aspects of it has many layers to it. Yes, it can be purely from mindless selfish greed, as you, your friends, and your professors suggest, even to the point of using the phrase \"selling your soul.\" But for many, their main goal can be to rise in socioeconomic ladder not just for themselves, but to bring wealth to his/her poor family, to provide for their children, to give back to parents, etc. one's job not being aligned with one's passion is nothing to scoff at. in short, \"whatever makes their bank accounts grow the fastest\" also can mean whatever gives them the best chance to support their children, parents, and community financially.",
            "Research comes with a lot of bull shit as well. I prefer building actual products that can help people, not reading and writing papers, dealing with university politics (which is way worse than anything I've seen in the corporate world), having to babysit undergrads and praying I get funding",
            "I fall somewhere between loving CS and loving the safety. Its like driving. CS and cars both give you sense of power. You'd be lying if you said you loved driving in every city and every street. I don't love every aspect of CS. Some domains get me excited while others bore me immensely.\n\nBig tech is interesting to me because they get more funding than academia to explore the next cool big thing. They are definitely more saddled by bureaucracy and move slower, but at the end of they day they have better resources and can impact a greater number of users.\n\nI've been fortunate to work for multiple FAANGs. The jobs I loved were wonderful, but others did feel like selling my soul. If you sell your soul you should do it for at least 6 figures 💁‍♀️ (jkjk).",
            "[deleted]",
            "lmao this is so pick me",
            "Dude shut up, I see more posts on here complaining about people talking about faang than I see people talking about faang",
            "some of us are too poor that. be happy that your parents are rich enough that you can pursue your interests without worrying abt finances or eating every night",
            "To me, CS is something I enjoy, but it isn't the thing I enjoy the most. For example, I'd much rather travel, or play video games, or eat good food for a living.\n\nBut it's a balance of something I enjoy, and something that gives me a good chance of being financially stable in life.\n\nAlso, I don't understand why your professors (or anyone for that matter) would frown upon working at a big tech company. I could understand some ethical concerns, but on balance we all commit some sort of ethical violations daily. It seems obnoxious to frown upon someone's chosen career path because it is no longer as pure as you would like it to be. What do you gain by putting others down beside some twisted ego boost? Is it fair to categorize academia as ivory tower and largely useless to real life?",
            "$$$$",
            "What if I love having a lot of money?",
            "I joined the sub very recently because I stumbled upon r/EngineeringMajors and wondered if there was something that is the same but for CS. I’ve been pretty disappointed because all I ever see is Interview/Internship questions and discussion.\n\nBut to answer your question:\nI’m in my first year as a CS major at the age of 24. I really enjoy programming and have interest in eventually working on Audio DSP applications, specifically for music. I had some slight knowledge of programming in C++ already so I know most of the stuff we will be going over in my intro programming course. My school teaches Java so I’ve just been doing all my assignments in both Java and C++ since most (commercial) audio processing is done with C++. I’m not at a top school or anything, just a small school in the southern Louisiana, but their program seems to be pretty good considering their size.",
            "[deleted]",
            "Loved building and tearing down computers, doing networking, and cyber security (this was all in hs so comp sci seemed like the right move). Absolutely hate the math and the theoretical, currently I do a lot of front end and a little bit of back end stuff which is a lot of fun. Money is nice but I don’t need $200k starting or $100k",
            "I am in computer science for the money.\n\nI do enjoy it. I like solving logical puzzles and learning new skills. But I'm not passionate about it. If I could completely form the career that I want, I would be an opinion columnist. However, those jobs don't pay, so ah well.",
            "I write a lot about career advice, give a lot of career advice, and do play the application game pretty well. But I also really like programming! It's annoying sometimes when I tell people that I study CS and they clearly assume I'm doing it for the money or cause of my parents. I'm not! I find it genuinely a lot of fun. And really, career stuff is **so** much easier when you like programming. I got really into compilers and started working on them as side projects. Because of that, I developed a set of unique skills which made me a really solid job candidate for compilers roles. I started applying to compilers jobs and boom, suddenly my questions are about compilers, which I know something about, and suddenly I'm getting offers. \n\nAlso classes are way way easier when you like programming. If you like programming, you'll do it a bunch. Program every day for a couple years and your classes will be a breeze. It's like playing basketball everyday and then going into a class with kids who only practice during gym classes. You're gonna dunk on them lol.\n\nHowever it is a little inevitable that this subreddit is gonna be career oriented because A. career stuff is lowest common denominator, you can know nothing about CS and still have an opinion about careers, and B. all the relevant CS stuff just gets posted and discussed on /r/programming or Hacker News. I'd love some cleanup or explicit no-career discussion posts but the reality is that /r/csMajors is probably gonna stay career stuff.",
            "From wat u said most ppl here talk about extremely high paying jobs. Do u think everyone here does that without any passion for cs? \n\nThis sub is great for career advice because at ur local college/uni the number of ppl who are extremely successful at getting internships is small. Here there are so many and I look here for advice cuz it's better. \n\nPpl don't ask cs advice cuz unless u r in hs, it'd be way better to go to office hours or a God cs student. There's way better resources for help on cs in school than here. Opposite is true for cs career advice.",
            "Without love for CS it will be difficult to get CS related Job.  \nMy opinion is - Having a job will make you independent and it will provide time/money to enjoy your hobbies after work-hours.\n\nMake a list of favorite Hobbies -- Which ever is your 2nd or 3rd hobby create career in that and Keep enjoying your 1st hobby in free time.",
            "I love computer science and the money is definitely a bonus. I've always loved computers and been interested in them. I understand the main type of posts though. Computer science is a competitive field and if you're in this subreddit, that's a big indicator that you spend time trying to stand out in an ever-increasing job market.",
            "I would love to and it's still my dream. At least being a professor in community college, but the pay and hours are terrible unless you get fully funded. Even then, you give up years of your life. If you want to start a family, then what about owning a home or insurance.",
            "You’ll start to realize that about 80% of this discipline is in it for the money.\n\nBut your passion and drive will shine through in my experience.\n\nIt just may take a while. Don’t worry about everyone else",
            "Everyone needs money.",
            "Hey everyone. I'm the guy a couple months back that said \"let's stop talking about FAANG\" and all of you shit on me and made parody posts.\n\nJust want you all to know that \n\nA) many of you said I was being a crybaby because I \"couldn't land a FAANG internship\" I'm currently in the interview process for Google and Amazon (applied out of spite)\n\nB) this guy is saying the same thing but is not being down voted into oblivion\n\nC) I hate how reddit can sometimes incentivize a lack of compassion",
            "I like building stuff and if I can make stuff many people use at a big corporation that's awesome. Not too much into writing papers or making proofs unless I have to, but doing random math visualizations or statistics is fun.",
            "Question is, can you get an internship with a below 3.0 gpa? This is a genuine question. I’m not trying to be a troll. I’m a sophomore going on jr but due to me doing absolutely terrible so far, hopefully I can manage a c. If not I’ll be put on AP.",
            "Check out r/compsci",
            "I started learning CS pre-college. The 1 year of university felt like a pretty colossal waste of money and time. I do love the field though. I think I knew I wanted to work in it when I was in the 2nd grade, dunno about when others discovered it but thinking of how early my passion for it flourished I do wonder : )",
            "[deleted]",
            "Yeah, I’m in it for the money. However, I’ve found myself liking game programming a lot. I play video games, and have for a while (most of my life lol), and I’ve found an appreciation for learning all about them. This has integrated itself into my coursework, and I do more programming than usual just because I like game programming. I like video gamesss",
            "Yeah I am a bit disappointed by the lack of “I failed operating systems class” or “does anyone else have to take a senior capstone project” and school related stuff like that. A sub for just that may be pretty helpful!",
            "Aren't you \"selling your soul\" when you do a phd. But yeah, i understand it, at least when you're doing PhD it's meaningful work. Software engineer can get really boring at sometimes. I was at Amazon and I absolutely hated it bc design is boring af, fullstack is boring, and I don't want to learn a bunch of un-cool things. There's no deep theoretical work.",
            "I went into compsci with 0 passion and purely for the reputation of its good pay. I then realized that i like programming when i took a Java class, but not so interested in other topics of it that it stressed me out. I like to debug but im not sure what i can do with this interest cause a good program should not need any debugging at all. \n\nI've changed my major now because i have another stuff i like more but still helping my friends debug their assignments and it's like a stress reliever sometimes. Im not passionate about it and using money as drive didn't work for me",
            "r/computerscience is the sub for you, this is a place for people who major cs to discuss what is important to them.  If that happens to be getting into big tech companies, then so be it",
            "I've never understood how to tell if you're passionate about something, some say that if you enjoy what you do you'll do it for the rest of your life, I enjoyed programming, I even did two interns and put in 14 hours a day for two months but after that I just am not interested in doing it that much as before, is it because it's not my passion or something else? If it wasn't my passion then how was I able to put in 12-14 hours for 7 days a week for two months... In my opinion, there is no such thing as passion",
            "i think most people are in CS for the money. Personally, i would be lying if i said money didnt influence my decision, but i have an interest in basically every field of science, so I decided to pick the most lucrative job out of my interests. If chemistry, astronomy, biology, aerospace engineering, physics, or any of my other interests paid better, I would be happy to switch to that one.",
            "this \"money shaming\" needs to stop seriously.   nothing wrong with going after top dollar.\n\nif you think going for money is selling out, fine, go work minimum wage, but dont look down on rest of us for trying to better our lifes.\n\nguys out there, and get those 200k+, 300k+ jobs.   dont feel bad about it, be proud!!!",
            "In it for the money. That said, you would never catch me even thinking of applying to FAANG",
            "I love computer science and I love the vast field of applications that exists and various fields that I can choose to work in. From working in health care to working in cybersecurity. My problem is that so many things interest me in this space that it’s overwhelming. In at the end of my first year now. Calculus has been by far the greatest challenge but the thought of quitting is never an option. I wish I interacted in this group more, I really have no friends who are CS Majors and it really feels like I’m in this solo sometimes.",
            "Lol",
            "I'm not in school anymore but still wanted to give my input. Growing up i didn't have the best childhood. I started coding a bit while working with gamemaker and fell in love. I love how logical coding was; it was the only part of my life that made sense. I initally majored in comp sci partially because of that and partially for the money to please my father. He left my life and shortly after I found a niche in the field that I fell in love with: web accessibility.\n\nThroughout college I had multiple people tell me I was stupid for specializing and that web dev was a bad idea because it doesn't pay as much. I had a lot of people talk down to me because they don't see it as a necessary part of the field. I love it because i get to see the impact of my code immediately. I get to know I'm making an actual difference in the world, even if no one outside the company will know that I was the one who did all that work.\n\nNow I still work in it, work with big clients, and have full respect and autonomy from my coworkers and executives regarding my role, while some of my peers from college who talked down to me are either struggling to find jobs, live up to their own expectations, or working jobs they hate.",
            "I didn't pursue this path solely for the money but I definitely wouldn't have done it if it didn't pay as much as it does. With that said, I don't think there's anything wrong with pursuing CS for money as long as you work hard and do well",
            "I love CS but I also love money?",
            "I hate all my CS classes, i dont sleep all i do is code",
            "Ngl… makes me kind of happy to read how many of us are working so hard and going for the higher paying jobs because we came from less wealthy families and want to now support them. Likely many of us have parents who immigrated or for whatever reason didn’t have the same opportunities we now have, so we want to show them it was worth it. Also, CS is fun. If you don’t have the passion, you’d go nowhere with it. Just my opinion.",
            "You can work in FAANG but still really love CS. I work in FAANG, and on the side I've been teaching myself systems, doing side projects, and playing with hacking challenges.\n\nI didn't come from a CS background so at the time I started my job I just knew basic programming and algos/data structures, but I personally found it unsatisfying to not really understand what the computer was doing under the hood."
        ]
    },
    {
        "post_id": "aoj8go",
        "author": "Hallucinates_Bacon",
        "title": "Is it normal to be alive?",
        "url": "https://www.reddit.com/r/csMajors/comments/aoj8go/is_it_normal_to_be_alive/",
        "score": 398,
        "num_comments": 17,
        "created_utc": 1549649147.0,
        "selftext": "I just drank some water and breathed some air and was wondering if this is normal to anyone else? I know I should be grinding leetcode, but sometimes I can’t help myself and I just take a huge gasp of air and enjoy it? How can I get a job at a Big N company if I take time to be alive instead of worrying about incessantly grinding pseudo important brain teasers that companies outsource their recruiting process to? \n\nAlso I’m 75 and just completed a 6 month YouTube boot camp program, and feel I’m ready to rewrite the internet. Let me know if you have any advice for me. Thanks!",
        "permalink": "/r/csMajors/comments/aoj8go/is_it_normal_to_be_alive/",
        "comments": [
            "[deleted]",
            "Hey I’m a google recruiter you seem like a good fit for the company plz dm me fam",
            "Quality shitpost",
            "Is there a CS circle jerk sub because that would be fuckin tight ",
            "I heard post-mortems get higher total comp but idk if that’s just inflated figures or not. I interned at Airbnb last summer and we had some cadavers from Berkeley and they seemed cool guys to work with. PM me and i can try and hook you up with their contacts, they’d know better than me. ",
            "I bet you also like to blink, slacker ",
            "Breathing? Water? Haven't seen those in days, only seen thing I have seen is the math behind MLP...",
            "> Google offers benefits to the spouse of any employee who dies. Google makes sure to help out the families of deceased employees. If employees die, not only does their stock immediately vest, but their husband or wife will get half of the employee's salary for 10 years, plus $1,000 per month for any children.\n\nI mean there are pretty compelling benefits.",
            "M E T A",
            "Perhaps"
        ]
    },
    {
        "post_id": "qvf710",
        "author": "TechnicalEstate8733",
        "title": "I GOT AN OFFER",
        "url": "https://www.reddit.com/r/csMajors/comments/qvf710/i_got_an_offer/",
        "score": 392,
        "num_comments": 49,
        "created_utc": 1637089147.0,
        "selftext": "Without any internships, only a handful of projects, and shitty LC skills, I thought I would be destined to be stuck in recruiting hell but...\n\nI JUST GOT AN OFFER FOR A TECHNOLOGY DEVELOPMENT PROGRAM!",
        "permalink": "/r/csMajors/comments/qvf710/i_got_an_offer/",
        "comments": [
            "YAY you did it!!!",
            "[deleted]",
            "There’s hope for us yet!",
            "[deleted]",
            "Is application still open? I went website but couldnt find apply button",
            "What’s the TC for TDP’s?",
            "FREE PIZZA?????!!!",
            "Congratulations!!!!!!!!!!!!",
            "Accenture?",
            "[deleted]",
            "congrats",
            "Congrats!",
            "CONGRATS! You deserve this and so much more. i hope you look forward to everything that’s to come! Thank you for posting this and normalizing having adequate qualifications and earning opportunities w them. Sometimes it feels like unless u eat, sleep, and drink in code, u might as well not be in this field.",
            "How was the interview process?",
            "What is your new total compensation?",
            "congrats!!",
            "That's awesome! Congrats!",
            "Please tell me you don't have a cs degree? :)",
            "Congrats!!",
            "Hey,  I got an offer at the same place! See you at Buffalo (maybe)  lmao",
            "[removed]"
        ]
    },
    {
        "post_id": "od5gff",
        "author": "youarethemuse",
        "title": "people really be overworking and underreporting hours because they work slowly",
        "url": "https://www.reddit.com/r/csMajors/comments/od5gff/people_really_be_overworking_and_underreporting/",
        "score": 394,
        "num_comments": 35,
        "created_utc": 1625343239.0,
        "selftext": "it’s me, i’m people\n\nidk i just tend to work much slower it seems so it’s taking me a lot more time to get my tasks done",
        "permalink": "/r/csMajors/comments/od5gff/people_really_be_overworking_and_underreporting/",
        "comments": [
            "Or they are victims of imposter syndrome.\n\nI'm people",
            "[deleted]",
            "or people be overworking and underreporting hours cuz they *think* they're underworking",
            "1. set unrealistic expectations\n2. convince workers that the unrealistic expectations are realistic and fair\n3. watch workers try to live up to the unrealistic expectations by working longer hours than they report\n4. when someone protests and claims expectations are unfair and unrealistic, point at others (who are doing the same hour underreporting shtick), and ask, \"they can do it, why can't you?\"\n5. ???\n6. PROFIT!",
            "Me af. I usually work until 10pm, but give the impression that I logged off at 5/6pm",
            "Nah, I just clock hours",
            "I pretty much do the opposite. I'm super productive from 8-12, spend the rest of my day doing LC and report 8 hours",
            "I think most people can only be if deep thought for about 30-45 minutes at a time. Try to balance you work with this in mind. Solve a problem, then check emails, solve a problem then light documenting etc...",
            "I remember stressing out over trying to fill in time sheets ever week about what I was doing when I first started and the only guidance was \"just write down what you're doing\" and then when I did that I got a look of pure horror from the manager that only a fraction of my time was billable. So I spent the first 3 months or so figuring out how to make tasks that really shouldn't have been billable billable. Working like that sucked. I constantly felt bad, like I was cheating people.",
            "Software engineering isn't that hard.  People who seem to work slowly generally just have focus issues.  People who seem to work fast generally don't have focus issues and are experienced in the stack they are working with or have better fundamentals.",
            "I’m people on occasion."
        ]
    }
]