[
    {
        "post_id": "ps0zod",
        "author": "stoopid_csMajor",
        "title": "How to Deal with Amazon Offer",
        "url": "https://www.reddit.com/r/csMajors/comments/ps0zod/how_to_deal_with_amazon_offer/",
        "score": 393,
        "num_comments": 68,
        "created_utc": 1632163353.0,
        "selftext": "I recently achieved the prestigious status of having an Amazon Offer. Initially I was so ecstatic, but now I'm having some difficulties. I feel like I emanate this field of energy and superiority everywhere I go, knowing that I have Amazon and I'm better than everyone around me, and idk how to deal with it.",
        "permalink": "/r/csMajors/comments/ps0zod/how_to_deal_with_amazon_offer/",
        "comments": [
            "amazon? why even post about such a low tier company, if you arent making 400k at jane street its a wonder how you even made it this far",
            "Same here bro, i declined amazon offer and went for full time cashier at mc donald. Life couldnt be better. Good luck to you.",
            "Decline for the clout.",
            "Offer at Amazon? What a peasant!",
            "When I got an offer from Amazon I walked down the street and everyone was kneeling for me. I had no control of it. I even tried to make myself look ugly but everyone treated me like god. I don’t know how especially because I didn’t tell anyone at all about my offer. I lost all my friends because they would all kneel to me and bow and wouldn’t have a regular conversation everything was “yes sir”. Don’t ever apply to Amazon it’s a horrible experience when you get an offer.",
            "Get an offer from a similarly ranked company like Bob’s Burgers and have them fight over you.\n\nSeriously though, just go compete in something where you actually have to make something like a beginner hackathon in your city or coding competition like Google Kickstart.  Should be a properly demoralizing experience kicking you off your high horse if you aren’t *the shit* quite yet.",
            "I love this sub so much, lmaoooooo",
            "You can definitely make the bar at Albertsons",
            "Why is this sub obsessed w amazon",
            "Realize this post is a cry for help. It’ll all be ok",
            "Don’t worry! Amazon managers will surely curb your hubris! :p :p",
            "Amazon",
            "I got an offer from Deez. Get on my level",
            "Prestigious and Amazon. Choose one",
            "A good friend of mine went in with a plan, he loves New England and wanted to move somewhere on the coast north of Boston.\n\nHis plan, rock out 2 years of high stress with any FAANG on his resume and then move to a smaller tech market to be a big fish in a small pond.  Worked out well for him.",
            "Calm down, it’s Amazon",
            "Ah, yes. Another Jeff Bezos worker ant. \n\nMay your success contribute to his next mission in space. \n\nWhile you chugg on only small percentage of his bread crums. \n\nI work for Facebook as a SWE, that's why I sound bitter compare to these Amazon ants.",
            "Amazon is trash because you will often never actually receive their full stock plan because you will be fired before then. Their wlb and turnover rate is abysmal. They dont hire only prestigious candidates",
            "This belongs on Blind and not Reddit!!!!",
            "It's just an offer, that doesn't mean anything.",
            "You don’t have to deal with it, because you’re absolutely correct. You are better than those people, and they should know that",
            "Hahah ☘️🎉😊🍀",
            "This is so funny!! Thank you for making me laugh today! 😀",
            "Amazon",
            "Pfft you only got an Amazon offer? Don't talk to me till your get one from Limewire"
        ]
    },
    {
        "post_id": "1auuaft",
        "author": "litlepeanut",
        "title": "Are we sure CS is screwed?",
        "url": "https://www.reddit.com/r/csMajors/comments/1auuaft/are_we_sure_cs_is_screwed/",
        "score": 388,
        "num_comments": 399,
        "created_utc": 1708366678.0,
        "selftext": "I’ve been in this sub for a while, and man it makes me sad. I’m a college student who feels like she found her passion with computer science but now I feel like I have to shift gears and find something else because supposedly my computer science knowledge will be pointless soon. \n\nHow do we know computer scientists won’t have a new role once AI becomes more powerful? There was so much paranoia with the internet transition but many people’s positions were adjusted rather than fully destroyed. I’m curious what your viewpoints are.\n\nAnd is the job market all that scary? I know it’s a touchy subject, I see lots of people having a hard time in this sub- but if I accept that getting a job will take me a while in CS is that fine?\n\nI guess  just want to know if I should really reroute my whole life or if I can tough it out and accept that life will suck for a little but I can still do what I love. \n\nAnd also is there something adjacent to CS that I could pursue that would be more secure?",
        "permalink": "/r/csMajors/comments/1auuaft/are_we_sure_cs_is_screwed/",
        "comments": [
            "If AI replaces software engineers it’s also replaced every other good job so there’s nothing you can do. I wouldn’t worry about it tbh.",
            "[Mandatory reading for everyone who thinks AI will automate CS](https://arxiv.org/pdf/2303.10130.pdf)\n\nTldr; Professions requiring science and critical thinking are less likely to be affected by LLMs, but if all you do is yeet code without a thought then LLMs are at risk of automating you. Also, other professions are even more likely to get fucked by LLMs than CS",
            "This sub 2 years ago used to be filled with \"I cant find a 200k job\", leetcoding every day, how CS is useless and u just need bootcamps... So yes compared to that, the market is really bad.",
            "Step outside. Breathe in the fresh air. Then, be strategic – there are a million jobs, but none are guaranteed. Surprise, surprise, this applies to every industry, not just CS. Apply smartly – use a company website, get a referral, resort to Blind if necessary. Understand where things might be going wrong – is it the resume? The phone screen? The onsite? Stop blaming the market and do what needs to be done.",
            "this sub is all doom posting. if you really are passionate and/or good at what you do, you will find a job.",
            "The internet will always be dramatic. To make y’all feel better I have a BS MechE, minor CS and accepted an offer last month for a SWE position for 165TC in MCOL city. If I can do it y’all can too.",
            "It’s not just CS it’s all sorts of jobs that are bad.\n\nIt’s a combination of corporate greed, a bad economy, over hiring, companies trying to increase stock. An increase in bootcamps grads, and an increase in graduates. \n\nI myself was influenced by TikTok and all the money that is in CS. So imagine how many other people were as well. \n\nI now realize in my junior year of college that CS is not the only good job. Nurses in Cali make great money, finance people (especially fintech), accounting, hr management, radiology, controls engineers, pretty much every type of engineering and the list goes on… it’s not the end of the world just be persistent and don’t be afraid to take the road less traveled and understand that it’s not you it’s just a really tough job market. \n\nBtw any and all fields that pay good are super competitive to get into. It’s either competitive to get into the college program or it’s competitive to land the jobs.",
            "Job markets can go up and down but speaking in terms of right now, the CS job market is saturated. It’s hard to find a job that’s entry level for new graduates without experience or a masters degree. But everyone experiences varies. I am only speaking from my perspective.",
            "[deleted]",
            "Idk when this whole idea started that LLMs are going to just replace programmers. As someone who actually works with these, I am telling you companies still don't trust them. You still need a \"operator\" of sorts. Copilots and soras only help as tools the same way ur linter helps. You still need to tweak whatever it spits out. We are reaching a new paradigm of databases and query languages for sure though. We still wouldn't use LLMs and be like write me the zstd protocol dtos for this new Linux kernel. You still have to write it and understand the mechanism. It will just help you along the way. I think even a decade from now, there would still be a need for actual engineering creativity.",
            "I wouldn't worry too much about that. If AI ever does get to the point where it can fully replace programmers, it likely means most other jobs have already been taken over too. When massive unemployment on that scale occurs, governments will inevitably work to intervene.\n\nPlus, for those without coding skills, even giving them GPT-4 and GitHub Copilot isn't enough. How will they debug code provided by AI? Ensure it's secure without vulnerabilities? That's where human programmers will still play a important role. AI will make mistakes and have blind spots, you need domain expertise to judge if its answers can be trusted.\n\nInstead of stressing over hypotheticals, I'd focus your energy on practical things within your control, like grinding LeetCode problems. That directly increases your job prospects now versus worrying about uncertainties far in the future.",
            "CS is not screwed. AI tools will not replace the need for knowledgeable and talented developers. CS has been \"screwed\" several times before, and while the industry is not looking great right now, it will start growing again in a few years.  \n\n\n In the meantime, find what work you can and keep up with your skills. If you're really passionate, why not be one of those people using AI tools to make the next big thing instead of waiting for someone else to hire you to do it for them.",
            "Yes. It's doomed leave while you can. Sinking ship of a major.",
            "Personally, I would suggest finding something else unless you are really good at it and can seriously impress with your resume. I’m just an average grad from an average school with an average internship and average projects. I can’t find ANYTHING after over 800 applications",
            "No it’s not screwed lmao, it’s still one of the best college majors. This sub and reddit is not the reality and is all doom and gloom. Like you think being a CS major is as bad as being a psychology or an arts major lmao?",
            "I mean worse case scenario you can pivot to business, management, or other sort of jobs with a CS degree",
            "[deleted]",
            "It isn't, this sub is low key a pile of shit. By the time we are replaced literally everyone will be. Companies are still looking for people, look outside of the big companies and look to smaller offices not in massive places. I can say in Maine basically all of our tech companies have come out of their hiring freezes and are looking for people.",
            "As someone who works for Apple the answer is No!!! Just keep your skills up to date.",
            "It’s over",
            "Also in the same situation and curious about this. The Bureau of Labor Statistics stated \"Overall employment of *software developers*, quality assurance analysts, and testers is projected to *grow* 25 percent from 2022 to 2032\" but it really doesn't feel like it with AI advancing every day, like Sora from Open AI which will probably heavily replace animation artists, cgi people and etc. But then why would the government say that?",
            "Not sure about anything as it relates to CS, but I think I sooth your mind..  \n\n\nI graduated a STEM program at a prestigious institution in my area. I graduated with straight A's. I can't get the job I want, I didn't end up making the money I thought I was going to.   \n\n\nBut I am also happy. There is more to life then your career.   \n\n\nIt doesn't matter what happens to CS because of AI. Your job right now at school is to make sure you know how to learn, and learn fast. You will get out of university with the skills to fly planes and build spaceships or mathematically describe the nature of reality on a quantum level. You will learn how to learn anything, as long as it is something you want to do... Figure out how to enjoy learning... when you get out of school you can keep learning and growing. Riding the wave of life rather then hoping you can stay in one place and hope to not get obliterated when it hits you. \n\n&#x200B;\n\nBelieve in yourself and everything will be fine, but worry like you are now and delay your peace.",
            "[deleted]",
            "Every other career related subreddits say the same thing. Don’t pay attention on what’s posted on internet",
            "Always do what you love. Your passion will help you rise to the top. Passion is what made the difference for me and what hiring managers look for.",
            "You'll be fine.    \n\n\nPeople still go into undergraduate majors like music, psychology, art history, graphics arts and these folks eventually find jobs.  \n\n\nThe market will evolve even with AI.",
            "It won't replace all programmers.   If I were a front end engineer then I would be worried, though.   \n\nThe issue isn't that AI can do everything a front end engineer can do... the rub is that AI can enable a single front end engineer to manage the tasks it currently takes 2 or 3 junior engineers to do.     That increased efficiency alone will reduce the demand for that particular skill set...which will push the front end types into other roles which increases competition.\n\n&#x200B;\n\nThe one silver lining with AI is that I haven't heard of many outfits trying to outright sell the capability in a one-and-done transaction.    Smart companies will license access to the technology for stable income.   My guess is that it will follow the specialized software model (think Wonderware, or Solidworks).   Eventually it will get expensive enough to reach an equilibrium with having staff on hand.    \n\n&#x200B;\n\nThere are AI proof jobs out there inside and outside of pure coding jobs.  I can't imagine most shops would trust AI with mission critical devops and there are industries other than SWE or web that make use of programmers.",
            "I think it's actually the opposite in some ways, the more AI/automation there is the more you need CS/engineering people that understand them and know how to apply them and tune them.\n\nMaybe it will become smart enough eventually, but my experience of it so far (using copilot and such) is that it's a really useful tool that helps me as a programmer.",
            "CS is so much more than programming. If you are passionate about it you will find something. Go into AI or machine learning or building automotive computers or whatever else you want. Any industry you can think of is using computers. There's a whole world out there beyond just coding",
            "SWE is probably one of the last white collar jobs to get replaced, although the current job market is not that great which I don't believe has anything to do with AI and everything to do with cost cutting and COVID over hiring.\n\nSome of the best engineers I've worked with and look up to have a passion in CS similar to you. I think you shouldn't let the current job market scare you if you have a passion. Job market changes all the time.",
            "Don't be scared! The only thing that matters is your CGPA, keep up with it. The job market will always welcome you if you have skills and a good CGPA.\nThe worst that could happen is you might not get a job at your particular industry and might have to wait and keep sending resumes until you land at one, but you will always get a job in another field as bachelors degree is the basic requirement. \n\nTips: \n1. Start networking with people who work in the same industry that you'd like to get into.\n2. Become a master of one and jack of all that could get you land a job you'd like.",
            "people who told you a cs degree will be useless are people who know nothing about cs.  \nlearning how computers work and knowing how to write code will NEVER be obsolete. If you are smart enough, u can extrapolate those concepts to understand new technologies. Yes, we are living a revolution with AI. Yes, jobs are changing. Yes, is it scary. Knowing how machines work is not useless, its the whole point.  \nGet your CS degree and dont listen to pseudo nerds who call themselves visionaries.",
            "Your CS degree is a signal that you are inteligent and can learn complex things. That will always be in demand.",
            "CS is not only software engineering. CS is not only coding. CS is not only AI.\n\nAI is an incredibly useful booster tool, however it is still quite unreliable if you want to develop something very complex, in a fully automated and unsupervised way. There is promising progress with models like AlphaDev, where the AI \"invents\" new sorting algorithms faster than any human algorithm, by gamifying the process of adding specific assembly instructions to compose the sorting program. However, a human being would never \"invent\" something this way, by trying millions of combinations with a tutor telling them how good each of their trials are. It is very ineffective and it's definitely not \"smart\". A game changing paradigm shift in how we train AI models hasn't happened yet, and the possibility of hitting a technical hard wall (like physical limitations for processors or networking systems), is still quite high. So, unless a sudden groundbreaking milestone in either computing/networking/model training is achieved, I don't think \"AGI/ASI will come in 10 years\" comments have much foundation. I'm not saying it won't happen, I'm just saying that it won't happen for the reasons AGI/ASI-hypers believe it is going to happen right now, it'll just be a coincidence. SORA/ChatGPT are not the ancestors of AGI/ASI, AGI/ASI will probably be a completely different digital species.\n\nWhat I am trying to say is that saying \"CS is ruined/screwed/done\" is exaggeration, at least for now. You'll have no trouble finding a job if you build up the skill set that differentiates you from other candidates. Sure, it is harder to find a CS-related job compared to 2010, because it is so much more competitive. You simply have to be better at what you are doing.  \n\n\nTL;DR: Until machines can think, good CS grads will be fine.",
            "This sub is a lot of doom and gloom. Network, build a portfolio and get out of your head. The people who struggle to find a job: it’s for a reason. Ai still has a long way to go, you have to build automated systems and the checks for them, many companies (beside Google, Netflix, big tech) are far behind in automation- aka they are hiring people for that.  Companies don’t trust LLM s and even if they did - they still need someone for maintenance /upkeep\n\ncontrol what you can and stop doomsdaying a career you have not even started. \n\nIf you need someone to talk you thru it- talk to a banker/finance grad during 08",
            "As far as the Job Market Goes -- in a CS Career - IMO - there are many UPS and Downs and FOMO and Lots of Hiring followed by Lots of Layoffs, all the economic bubbles are felt, you need to switch jobs often to keep your skills current, keep up with the technology, it's really easy to get super tired working at the same place for a long time, tech companies, even though kind of cool-er and new-ish, are still very old behemoths in the way they operate, so moving teams and shit like this is a lot of bureaucracy, politics is still prominent, working with others can be a pain, you will be in front of your screen all the damn time, you will spend a lot of time preparing for interviews and interviewing,\n\nIt's like driving a BMW - a lot of maintenance, a lot of time at the dealership...\n\nGood Luck\n\nI only did it cause I was an immigrant at the time, if I grew up in US, I would probably be on Sales or Art or Law or Real Estate or some shit like that. In US, you can actually make a living by following your passion, if it is pottery or painting or whatever it is, you can make it if you are just a bit good at Selling.   \n\n\nIt's a huge market place and we only have one life, it's best to spend it while having fun and doing something you love....",
            "[deleted]",
            "Switch majors, CS is a sinking ship.",
            "Good software engineering students that practice a lot of relevant skills and can get interviews can still get jobs. I believe being a woman makes it easier to get interviews at some companies for diversity purposes. If you go to a decent school and take advantage of it’s opportunities Im sure you will be fine",
            "[deleted]",
            "[deleted]",
            "I have a job, graduating in June, ur just fine",
            "I love doomer posts like this, it scares off newbies who are into this just for the money leaving all of the job for the people who are actually passionate",
            "If it’s something you enjoy, stick with it. The people who are screwed are the ones without that sort of passion looking for a quick buck. There’s plenty of room for people who are skilled and interested.",
            "If you have a passion for CS, then you already doing better than most graduates who got the degree for the money. I specialized in IT because I had an interest, but it never became a passion of mine and I envy those who find programming fun. Continue to utilize this passion to further your career. Build up your GitHub, land an interview before graduating. You'll make it!",
            "People who think this is the end of CS are the same people who would have said \"Visual Basic is the end of CS, no-one will need to learn assembly ever again.\"",
            "Computer scientists are quite literally the ones who invented AI. AI is trained using datasets made by software engineers and computer scientists. You will NEVER be out of a job as a software engineer",
            "lol SE’ing will be the last profession to be replaced with Ai",
            "I think saying \"AI will replace programmers\" is like saying \"calculators/autoCAD replaced engineers\", it's just another tool and its still pretty bad for highly technical workloads. I do think the  era of low hanging fruit of CS jobs is over now (i.e. FAANG hire just because you have a degree), you need to be really really good at what you do to compete, but I believe there are still a good number of high quality jobs in the market -- you just have to stand out.",
            "My friends with English Literature degrees are currently making more than everyone I know who graduated with a CS degree",
            "As someone who is a college student and hasn't yet entered the market. What I'm telling myself to not worry is that people possibly get laid off because they don't bring enough leverage to be non disposable. So get good at a unique skill and build unique projects and I'm sure the market isn't as screwed. Good luck",
            "I am in your shoes, I even change from medicine to pursue CS. I will stay in this industry for 4 years and if I still don't get a job after that, I will move to other career.",
            "“The future is not that of developers, it is of maintainers, for the best developer is one that builds firmware that can write itself, we are near touching that horizon” - Anonymous",
            "not yet, who knows in the future. Literally no one knows what will happen. What we do know: tech isn’t as hot, new CS grads flood in at an increasing rate annually, and job postings are down, and AI is trying to replace our jobs. \n\nBut the real answer is literally no one knows",
            "who is \"we\"",
            "I'm thinking of yoloing everything and making a small indie game dev team. If it doesn't work out hopefully there's UBI by then, if not, please pretend I'm a seagull and throw me some leftovers when you pass by me in your Ferraris.",
            "yes",
            "CS Major is NOT screwed.\n\nOnly people get screwed by themselves",
            "This is mostly CS majors who haven't had their first real job yet, me included, while anyone saying things are going to get better in x years is speaking out of their ass so are those who say it's over. No one knows what the future holds and most of us are not the people to be making any predictions.",
            "Don’t worry about the market lol. It takes time to get the first job. Just study hard and someone will hire you anyway.",
            "Yes",
            "Show me one AI solution that can debug production code !",
            "If you study for the knowledge and skills don't even care about the doom and gloom, computers will still be the same even with AIs dominating certain areas. Even qcomputers that are a whole different paradigm are \"the same\" but ridiculously faster.\n\nUnless we get to a point where AI models can auto-repair  their own hardware and fix their own errors IT workers are needed.\n\nIf you're in it for  a \"super giga ultra mega salary\" welp, no one will have those besides a nano few in any sector that if shareholders find a possible substitute for a fraction of their salary they will immediately \"lay off\" those with good salaries. \n\nThe more we stay in this economic system the poorer and more overworked we will be. Which is pointless, cutting costs and wages while charging more or the same for ever growing profit when no-one will be able to pay for the services/products, cause no-one has a fuckin job or their salaries got cut so there would be more profit for the shareholders. Misery feedback loop achieved.",
            "it's finished bro. go to med school",
            "Absolutely not. I WISH AI could do my job. \n\nI just spent half a week debugging an almost-impossible race condition in a really complex distributed system at work. Really wish AI did that for me.",
            "Currently working in a SWD role as a student and after attending my first meeting I knew instantly that there is too many quirky issues that AI would not solve at this point.",
            "As the wild guy in Braveheart said:  \n\"The lord tells me he can get me out of this mess, but he's pretty sure you're fucked.\"",
            "Sigh, you'll be fine. AI won't replace any of the stem degrees.\nSWE is not the only path.\nYou think AI is just some magical tool? Well that's data science, you can go that way, there's tons of jobs in that alley.\nJust study be good at what you do and you'll do fine.\nFAANG is not the only companies out there, there are literally hundreds of companies, just search and open your eyes",
            "Forewarning I'm a CS student as well with the same worries and this is what I've come up with...\n\n\"she found her passion with computer science\"\n\nContinue on then! CS is so much more than being a SWE and programming day in and day out. If you're worried about jobs then consider the fact a CS degree gets past filters for many other jobs in tech. You will have to complete certificates and maybe start near the bottom but you have Network admin, System admin, and etc. At worst you may have to start at help desk/tech support but most pay \"okay\".\n\nIf you're more worried about starting pay and your career, you could look into any other engineering role such as EE. EE is vast and has some pretty amazing topics to explore. I'm heavily considering EE myself but I'm not sure I could handle the extra math load so I'm still thinking about it.",
            "In 2023, Computer Science ranked as the second most favorable major for securing employment, with Nursing being the top choice. However, it's important to make your decision based on your interests and goals, rather than the opinions of this community, which includes a mix of trolls, jesters, and a few high achievers.",
            "It’s going to be fine. Complete your CS degree. Unless you’re going to a top 10 college, don’t put everything on some big tech job as your first one out of college. There are plenty of CS roles in manufacturing, finance, retail that pay much more than the average household income. With a couple years of experience and a degree, then aim for whatever you want. A lot of this sub’s pain is self-inflicted; a narrow scope of what CS degree holders can do coupled with the expectation of a FAANG offer right out of school.",
            "**tl;dr - I suspect the pairing of CS + <some other field> will be valuable for at least the next 15 years, but who knows?**\n\n\nWe know AI will augment+empower software engineer in the short term and eventually replace most/all software engineers in the long term. However, there's a lot of work that needs to happen both in computer science and in the physical world, and we need people for it.\n\n\nWe don't just want smart chatbots or bots that can write code. We want AI *everywhere* doing *everything* we want it to. We want a world where everyone can eat healthy, adequately exercise, participate in communities, etc.\n\n\nWe need autonomous farms, we need smart resilient supply chains, we need AI that does chores for parents so that parents can spend more time with their kids, we need 24/7 physical therapists, we need automated truck drivers or better means of transporting goods, we need prejudice-free justice systems, etc. - truly many many things that need to be automated. And it won't be easy (e.g. just look at how much time + $ has been spent building robots to \"just\" lay bricks, and they're *still* seldom used).\n\n\nWe also need a tremendous amount of cheap, sustainable energy and skilled folks with the right resources to make it all happen. There is a tremendous amount of work necessary to make it all happen. \n\n\nComing back to your question: if you're concerned about AI affecting your job security then think about what you want your role to be in the coming revolution. Is it \"solving\" policy, is it \"solving\" supply chain, is it \"solving\" farms, is it \"solving\" energy, etc. For this reason, I believe a pairing of CS + [medicine/energy/agriculture/hardware/mechanical/etc.] will be valuable.\n\n\nDisclaimer: I don't have a pairing in CS + <some other field>. I'm a CS graduate. I personally think human centered software engineering is here to stay for at least another 10 years. I wouldn't consider myself an individual qualified to discuss this topic. I also think most people here in r/csmajors aren't qualified by virtue of being in the subreddit :P but my thoughts differ from what's been shared in this thread so the above are my thoughts and you should take it with a bucket of salt.",
            "No don’t forego your passion or change your life based on posts from Reddit. \n\nThere’s a lot of doomerism here, and sure the market isn’t its best, but a ton of work to get done in the real world.",
            "The field is absolutely not screwed. Don't listen to most people on this sub. If you truly like the field and are pretty good at it you will do great.\n\nWhat did change was the long-lasting imbalance when the very well-paying field was relatively easy to get into was..fixed. And not it's going to be little more like doctors or lawyers perhaps. People with only bootcamp under their belt won't be able to easily land high paying jobs.",
            "Stop reading this sub.  This sub has absolutely no relation to reality.  Computer Scientists are not going to be replaced by AI.  This has been repeated so many time by people who know what they are talking about.",
            "Honestly, this idea that CS people will be obsolete is a little ridiculous. AI/ML is already embedded as CS electives for a lot of bachelors programs. If AI/ML replaces programming, the people with CS degrees will just re-skill in AI/ML. For self-taught people, bootcampers and math haters, they are done for. Now, if a net 0 jobs are created because of AI, then that’s a different story for society altogether. ",
            "CS spans more than software",
            "If you are looking with a job perspective, software engineers and doctors are the ones which have always some opportunities. \n\nWill AI reduce the workforce. Yes! In future. Just like how cloud platforms reduced the workforce in server management and development from a decade ago. But if you look at the people who were working on them, are they jobless now? They gradually up skilled and now in CS only but in different technologies. If you look at anyone with 10+ years of experience, none of them are working in the same technology they started with. \n\nDon’t judge the job opportunies by today’s market conditions.!",
            "You’re only screwed if you’re an international/foreign student trying to land a US-based job.\n\nFor the rest of us American CS students, it will be difficult. But doable as long as you put in the time and effort.\n\nThere are many different career paths you could take with a CS degree, people think that it’s limited to SWE lol",
            "If AI replaces programmers who will code the AI? AI isn't gonna be that smart anytime soon. People fear AI replacing our jobs and ending humanity more than climate change lol",
            "Pay isn’t the same.  The real struggle seems to be at the new guys asking for 100k+ on entry level.",
            "I am In The Same Boat With You.",
            "Dont have scarcity mindset, develop abundance mindset, there’s enough for everyone",
            "AI isn't going to do jack shit to replace CS or software engineering.\n\n\"AI\" by which we presume you mean LLMs, is a tool a good SWE can use.  It's not going to replace anybody.\n\nDon't \"reroute your life\", learn more things to make yourself more employable.",
            "To be truth , ai not yet capable to think like human.  The current ai we test mostly keep forgeting the pattern . They can find 2 or 5 text message then forget. \n\nYes we can create  a lot of thing using AI , but the tech no yet there yet..",
            "Job market is crazy. No one is hiring Entry level, since there is lot experienced talent out there.\nFor example my team had 10 interns for 10 engineers in 2021. 3 intern in 2022 and 3 in 2023. \nSo it’s just matter of job market getting better at entry level.",
            "The job market saturation is much more of a threat to job prospects than AI is",
            "AI can't even do my coding HW for me so I'm gonna say we aren't screwed",
            "No one can answer this for you. You can lookup the numbers and make a decision. Yes, the job market is rough. It's also rough in a lot of other fields. Yes, AI will displace some jobs and likely more than it creates. Will you be fine? Will I be fine? I have no fucking clue.",
            "Yes.",
            "It’s kind of like if you were a writer when the typewriter was invented some people might think writers are over because now everyone can do it. All those years practicing proper penmanship gone to waste. But in practice, the act of writing is not the valuable part of what a writer does. Software engineers are not just programmers, which is a job that basically no longer exists anyway. Maybe your product manager can say “Hey ChatGPT, make me an app that does XYZ” and actually get one, but it’s not going to be good. And without the right skills they won’t even know how to explain what’s wrong. Anyway long story short don’t worry about it.",
            "Your position on AI isn’t warranted. Give it a couple years, the AI winter will be back. Gen AI is only going to aid your ability to code. You be expected to take on more work and deliver more. It’s a tool, not a replacement. Sure, some entry level jobs will be replaced but nothing more.",
            "AI isn’t magic. Someone still needs to build, maintain, optimize, and improve the algorithms/models.",
            "To be honest having AI replaces us is the last of my worries. If AI manages to replace us then that means it will literally replace most (if not all) of the professions out there, translators, photographers, video editors, designers, authors, architectures, traditional jobs of course, and the list goes on and on, even the medical field would certainly get affected by it, so as I said if it is fucked for us, it would be fucked for all of the other professions.",
            "It's just drama, don't worry about it. You're not getting replaced. The job market is not scary. ",
            "This is equivalent to saying that every profession just googles stuff, so if I can google stuff, I can do any profession.  That's not the case because you have to be able to know what to google, how to interpret the results and apply them.  The same thing is true for AI/LLM.  It might make engineers more efficient, so maybe less jobs, but we're not anywhere close to replacing software engineers.",
            "I’m not worried at all tbh, if you actually do some coding you realize that ai is a great tool that makes the job easier but it can’t just code everything by itself or come up with creative ideas. I think the bubble burst tho, which means you gotta be a better student, do lots of co-op and side projects. You gotta network to get a junior position. All this negative press will result in less competition and in a few years tech will boom again",
            "Calm down and keep working on task at hand and complete your education as best as you can with out worries.\n\nWorld is not ending! CS is alive and well irrespective of what you hear in this form or in news.\n\nThese days most people have 3 or 4 different careers in their long life span. so if you decide to change, it's normal.",
            "The LLM’s are just a probability machine. It has to be accurate to mean something, for images your eyes blend together imperfections. For audio, it’s much more difficult because you notice artefacts easier but they can still get away with it.\n\nWith code it needs to be exact, 100% correct in intention. There isn’t a good enough or likely. The technology to be that good isn’t there yet. Relax",
            "CS will bounce back after couple years.. the recent grads would have a tough time now..",
            "this sub is the blind leading the blind. if you enjoy CS as a passion and your work / resume reflect that you’ll do well. if you major in it because you think it’s an easy way to get rich you’re gonna have a bad time and would never get far even in a booming tech economy. ",
            "It’s not at all screwed it’s just going to be a lot more competitive. When I went to school even D students got good jobs coming out. Now you’ll need to have good grades, internships, workshops etc. to stand out. \n\nI think the next decade are going to be really hard for those underperforming students that just don’t like it as much. Eventually people will get the message and stop trying to get into tech if they don’t have a passion for it.",
            "Not necessarily screwed, but field is very very oversaturated for new grads so there really isn't any point in doing it currently.",
            "CS isn't just software engineering.\nIssue is everyone pushes you towards it.\nStill other avenues with CS degree.",
            "We all don’t know….",
            "Asking a sub full of people with sunk costs and investment into a field isn’t going to get unbiased answers"
        ]
    },
    {
        "post_id": "1846ijx",
        "author": "AppropriateCharity47",
        "title": "Hiring is mostly done for this year so don’t panic.",
        "url": "https://www.reddit.com/r/csMajors/comments/1846ijx/hiring_is_mostly_done_for_this_year_so_dont_panic/",
        "score": 393,
        "num_comments": 42,
        "created_utc": 1700988546.0,
        "selftext": "Most companies don’t hire in Dec. They will pick up early Jan. So if you have been applying and not getting responses, don’t panic. Seems like laid off mid-level devs that are competing for entry level are mostly filled, so real Entry applicants are getting some call backs now.  We just have to wait until these laid off guys are cleared.",
        "permalink": "/r/csMajors/comments/1846ijx/hiring_is_mostly_done_for_this_year_so_dont_panic/",
        "comments": [
            "This guy is obviously right about hiring picking up in the new year. Everyone is taking it easy through December. Not to mention budgeting.",
            "[deleted]",
            "Hoping that this isn't copium",
            "Laid off but with 1.5 years of experience, I haven’t had an interview or a call back yet",
            "Don’t have any interviews yet. I am fucked up",
            "There are some companies that do financials mid year and no end of year so they are still going to be hiring (e.g. Apple). Don’t let up on applying—just expect the hiring process to take a bit longer since there are tons of breaks",
            "Do mid level devs actually get those entry positions? I’ve accidentally applied to something much lower and was always upscaled to an appropriate role",
            "As a new Dec grad, not even sure what to do. I don’t have the financial freedom to be patient, even considering just working law enforcement or 2 jobs. I feel like this is terrible timing for lots of people. And those experienced with comfortable positions in companies try to guilt trip new grads for not being experienced enough to find a position.",
            "Question: should you still send apps around this time and just not expect a response, or should one wait for the January openings to start applying?\nSincerly, a clueless undergrad",
            "how about internships?",
            "Not true at all, FAANG only",
            "since companies do not hire in december, should I quickly apply to the meta internship since the job posting will close soon?",
            "The flipside is if they do post a position in December and are interviewing that does mean they are serious about filling it.   \n\n\nThe bad news is there were a lot of tech layoffs in smaller companies in the last 48hours",
            "I needed this",
            "True for internships?"
        ]
    },
    {
        "post_id": "16xyesa",
        "author": "bill_jz",
        "title": "I've hit 100 internship app rejections",
        "url": "https://www.reddit.com/r/csMajors/comments/16xyesa/ive_hit_100_internship_app_rejections/",
        "score": 392,
        "num_comments": 65,
        "created_utc": 1696257549.0,
        "selftext": "Let's gooooooo\nWe goin jobless 😎",
        "permalink": "/r/csMajors/comments/16xyesa/ive_hit_100_internship_app_rejections/",
        "comments": [
            "High five buddy, same",
            "Honestly that’s impressive. Impressive that you’re getting rejected and not flat out ghosted since I thought most companies prefer to ghost. How many did you apply to so far?",
            "I hire for our internships. Last year, we received around 150 applications for 5 internship positions, \n\nI interviewed 27% of applicants (40).\n3.3% of applicants were hired.\n\nWhen filtering applications, you need to be reasonably harsh, I have my regular assignments alongside hiring, so I only want to take 15 minutes to chat to the stand-out candidates. \n\nEveryone mentions their college grades and gives some info about a college project. This makes it pretty useless aside from being a general gauge. The majority of people talk about interesting projects and have decent grades. Without talking to each of the maybe 100+ candidates who have an interesting \"college\" section, I can't use this because I have no idea who worked on what, and what your knowledge of the project really is. \n\nMaybe 45% of candidates include their GitHub. (Probably a generous percentage) \n\nThe vast majority of these only have college assignments. Quite frequently, group projects are on their repo in one commit, which is useless because I've no idea who worked on what.\n\nMaybe 5% have professional quality side projects. \n\nLast year, no candidate had contributed to an open source project - big plus because it shows you can follow a release process and get some code deployed\n\n\nIn my opinion, having open source contributions or having a high-quality project available on your GitHub (that isn't very old or else is being actively worked on) are two things that will pretty much guarantee an interview.\n\nI advise making your Github the focus of your application.  Make sure it's included at the top of your resume, in your cover letter, and ideally have a section of your resume where you talk about your interesting \"professional\" standard projects and include the links to the repo. Code quality really matters for the projects you show off because it will be devs that are looking at it.",
            "Gotta pump those numbers up, those are rookie numbers",
            "This week will only have highs cuz I already hit my lowest point last week 😎 feeling blessed",
            "500+ 💪",
            "I know students from my college applying over 250 places before getting an internship. You should be fine",
            "***Well f, I'm an accounting graduate with 1.5 years of experience in public accounting. I was looking to transition to information systems/data analytics in about a few years. Looks like my future is bleak haha***",
            "100..rookie numbers..u need to be hitting those 200+ per day ..wish u the best",
            "haha link your resume and maybe we can help (redact your private info before linking it)",
            "My personal experience. If you are desperate enough (don't show it in the interview though) you will get something faster. Of course set a reasonable requirement like enough pay to cover living expenses etc.",
            "Boot campers stole the first 100 better luck 2025.",
            "Rookie numbers",
            "We can all just hire each other as interns. If someone gets me a coffee, I’ll go get them a coffee.",
            "Same",
            "You need to take a break.",
            "Tells how supportive your college is and how much they are helping you in your internship hunt",
            "keep it pushin theres a job out there for u",
            "lets shoot for 200",
            "Congratulations let’s reach for 1000!",
            "Same here",
            "All it takes is one keep grinding",
            "400 apps 3 interviews",
            "Lets go bro lets it together to 1000 😂",
            "I know a person that just finished a boot camp and already in an internship job right now",
            "Keep going. I got my offer right before summer started last year",
            "[deleted]",
            "u still filled out 1 applications which is pretty impressive",
            "Get another hundred and you’ll unlock your first one, best of luck! ;)",
            "![gif](giphy|YmQLj2KxaNz58g7Ofg)",
            "Pump those numbers up! You can do it!",
            "Noob numbers.. I’ve had over 400 at least and I’m experienced",
            "DONT GET COMPLACENT LETS HIT 200 REJECTIONS LETS GOOOOOOOO\n\nbtw getting 200 companies to respond is impressive actually. i just got a rejection from deloitte for summer 2023 yesterday. in october 2023. like yeah i i got the message guys.",
            "slay 😍",
            "you can go for the Bill Gate path to become a billionnaire"
        ]
    },
    {
        "post_id": "nd2p02",
        "author": "strawberryhichew",
        "title": "I made it and so can you!",
        "url": "https://www.reddit.com/r/csMajors/comments/nd2p02/i_made_it_and_so_can_you/",
        "score": 388,
        "num_comments": 34,
        "created_utc": 1621096131.0,
        "selftext": "Okay to start everything out, I was almost going to change my major my sophomore year. I failed a class and had a 3.1 GPA because I was struggling to learn from shitty tenured professors. I worked hard to get my grades better to get an internship but I just couldn’t find anywhere who would just give me a chance. Then COVID hit so there goes my chances during my junior year to get one fading away. Luckily, during this time I actually did my best in school. Teachers were still shitty but I realized I strived better in a self paced environment, I got to work ahead in all 5 of my classes all while working a full time job during COVID.  Looking back at it, I’m not sure how I worked from 4am-3pm then managed to do home workout routines then study and do homework for classes. After covid settled down, I began to apply aggressively to FAANG and smaller companies around my area. I learned my weaknesses and worked them out…\n\nFast forward now to my senior year, I just accepted a co-op with a well known company and now have a 3.6 GPA. I am now about to graduate next semester. I made this story short but I’ve gone through so much to be here right now. I fucking made it. After all my hard work and dedication to school and work to pay for school, I did it and I know you can too!",
        "permalink": "/r/csMajors/comments/nd2p02/i_made_it_and_so_can_you/",
        "comments": [
            "Congratulations on the achievement!",
            "Congrats!  Did you have any projects on your resume when applying?  I haven't found much time to work on any, and its starting to make me nervous in terms of internship opportunities.",
            "Congrats mate! My situation is almost similar as yours, just hoping I'm gonna get this through :D",
            "I’m in the same position as you. Worked take-out when rona started, and after hours went till ~3am, not to forget my uni didn’t give a shit about our mental health and grade forgiveness. CS gpa is also very borderline. Hopefully I can pull it off just like you did soldier!",
            "Congratulations! That's a great achievement. However, and I'm coming from a good place when I say this, I would suggest that you not repeat the notes about having shitty teachers to other people and especially not in future interviews. Even if the teachers actually were bad, it comes across as you blaming others for your shortcomings. Not saying that that's what it is, but that's how it can sound. Focus on what you did to succeed, not how other people held you back. Again, congratulations! Sounds like you're doing very well for yourself.",
            "Congrats. You use C++ for competitive programming?",
            "This is the way! Right on, I needed to read this dude. Many thanks and way to be yo!",
            "Congrats!!! I have a similar story except mine was way worse grades wise! I even got kicked out, petitioned back. Graduated with CS and got a Masters in CS with perfect grades which I worked hard for. If you don't give up you can do anything I swear! At the end of the day the passion will drive you if you want it.",
            "Congratulations OP! I'm going through a similar phase right now. And this helped me a lot."
        ]
    },
    {
        "post_id": "1abzw3f",
        "author": "SnooRecipes1809",
        "title": "LinkedIn Park",
        "url": "https://www.reddit.com/r/csMajors/comments/1abzw3f/linkedin_park/",
        "score": 393,
        "num_comments": 12,
        "created_utc": 1706321920.0,
        "selftext": "APPLIED SO HARD\n\nAND GOT SO FAR…\n\nBUT IN THE END,\n\nI WASN’T EVEN HIRED",
        "permalink": "/r/csMajors/comments/1abzw3f/linkedin_park/",
        "comments": [
            "one thing\n\nI don't know why\n\nit doesn't even matter how many places I apply\n\nkeep that in mind\n\nthey designed it this way to fail me so hard\n\ndespite the way they were rejecting me\n\nacting like I wasn't scholarly\n\nremembering all the times they tested me\n\nI am surprised I got so far\n\ninterviews aren't the way they were before\n\nI don't even recognize the problems anymore\n\nnot that I didn't practice enough back then\n\nbut only rejection comes back to me\n\nin the end ......",
            "![gif](giphy|XeSUAqI8uGTxL145ut)",
            "Worse is when they reach out to YOU and then ghost you.",
            "🗣️🗣️",
            "White boy spittin",
            "I'VE PUT MY TURST\n\nIN THE APPLICATION SYSTEM",
            "Applied so much\n\nDid not get far\n\nIn the end\n\nIt didn’t even matter",
            "![gif](giphy|ISOckXUybVfQ4)",
            "Loved it. Give them guys awards",
            "One thing",
            "IVE GIVEN UUUUUUUUUUUUUUUUUUUUUUPPPPPP\n\nIM SICK OF APPLYING"
        ]
    },
    {
        "post_id": "10zt0rv",
        "author": "xHawkx77",
        "title": "What are telltale signs someone’s NOT gonna make it through a cs curriculum?",
        "url": "https://www.reddit.com/r/csMajors/comments/10zt0rv/what_are_telltale_signs_someones_not_gonna_make/",
        "score": 385,
        "num_comments": 171,
        "created_utc": 1676136817.0,
        "selftext": "Looking for what not to do as a cs freshman",
        "permalink": "/r/csMajors/comments/10zt0rv/what_are_telltale_signs_someones_not_gonna_make/",
        "comments": [
            "Lack of willingness to work hard on the things they struggle with in terms of class work.",
            "I work as a CS tutor for freshmen & sophomores. From what I've seen I'd say the most visible sign is just giving up on an assignment after they run into 1-2 initial bugs, and expect someone else (such as the tutor) to do it for them and/or cheating online. Do not expect to be spoonfed, and be comfortable with working hard if you want to make it through a CS curriculum! \n\nI had a guy come to me for CS III (a programming class but with mid-level data structures like linked lists) asking me how to read text from a file (which is CS II stuff btw). When I asked him to write a loop until a given condition he was deadass BLANK. This guy did not know the syntax for a for-loop. He couldn't declare arrays without being told character for character what to write. It's embarassing and a waste of $$ if you aren't putting in the effort to learn in your classes and it *will* catch up to you. Time management is also important, don't leave all your HW for the last day, ever.",
            "Skipping class and not completing assignments/exams. Just like any other college curriculum.",
            "Can't google things.",
            "Been a TA for two quarters straight and I’ve seen a fair share of students go from coding noobs to coding geeks. And the only thing helping a cs major is CONSISTENCY. Start your assignment early. You’re gonna get a million errors and you need all the time to learn to debug and solve them. Students always underestimate the time it takes to complete an assignment and the next thing you know, you’re stuck with a bunch of run time errors which you’re too panicky to solve last minute.\nBut those students who actually push themselves to sit with their code ans debug it, make it out strong!!!",
            "Putting off assignments till the last day then showing up to office hours with nothing done",
            "When they’re in a third year class and don’t know how to indent code properly",
            "Lack of tenacity and resourcefulness. \n\nWanting to be led through things rather than wanting to figure it out on their own. \n\nAlso, not asking for help after working hard on a single hurdle that just will not yield. \n\nNot being able to compose a good question, to bring others up to speed so they can help.",
            "CS requires you to be able to self-learn a lot more than other majors. The upside is that there is more documentation on CS than in any other field. \n\nSome people really hate focusing on a computer screen too. Plenty of math-smart people can't figure out CS because they prefer working on something physical instead of a computer.",
            "When they play tetris the entire class every class and wonder why they can't figure out the homework in the intro level course",
            "I once had a girl mention how much she hates Computer Science. I have not seen her since that day. Then again I dropped out and got a job.\n\nA huge thing that led to me dropping out, poor mental health. This kills all majors I'm pretty sure.",
            "OP- I’m a CS major that didn’t take any CS courses in high school aside from web development (HTML and CSS only). I’ll say this: don’t become competitive with your peers, don’t compare yourself to others. \nIn my intro course I learned quickly that some of my classmates had the upper hand due to prior experience, but I just focused on my own grind. I also learned it’s okay to ask questions and for clarification. I’m paying tuition so helllll yeah I’m going to ask why it’s I++ and not ++I for this code.",
            "Lack of curiosity.",
            "If they give up too early/quick",
            "Not enjoying the intrinsic reward of hard work and frustration, followed by exhilaration when you get it to work!",
            "Fear and hiding. I work in the cs help centre and I see a lot of students really struggling, but instead of working through the problems to learn, they lean on each other (friends who are also struggling) and copy code, sometimes don’t complete assignments ect. To succeed in cs you will encounter extremely hard concepts and you need to dive in fully. E.g. You won’t learn linked lists in c++ without drawing a lot of pictures and trying really hard to wrap your brain around it. When students expect me to spell it out for them, or they abruptly leave the help centre after I give them “step 1: learn about x” suggestion, I always get a sinking feeling. Cs classes are not topics you can skate by in without understanding (or by cheating) and hope to start fresh next semester. You will fall more and more behind if you don’t go through the pain of that early learning. Some people are unable to do this hard work, for many reasons. I think fear and shame with struggling is a big part of it. If they start to fall behind, they will try to hide it and only make it worse.",
            "though no one wants to hear it, they aren’t good at math",
            "not asking for help after you TRIED to solve. you just need to learn to not give up too quickly. and don’t compare yourself to others, some have an advantage as they have parents who are in this field while others like me no one is in it so it’s all new. i’m no where as good as them but i’m getting better everyday with practice. remember everyone has a different path in life so why compare yourself to others ?",
            "It’s kind of cheating the question, but someone that isn’t turning in assignments or doesn’t even have a vague idea of what’s going on is someone thats probably not gonna make it. Being confused, feeling dumb, and overwhelmed are all reasonable and fairly expected. But not having even a vague idea of what’s going on in class, like not knowing the current week’s lectures are  about object oriented programming, is probably a sign that you’ll end up failing if you continue with that pattern. People always say start early start often, but there are still people that start late and put in the same amount of hours or more to get the job done. They can still make it. Not putting in the hours, whether it’s a few a day or all at once, is a pretty good indicator.",
            "You can just kinda tell who's there to party, fuck around, and who isn't. Do you want things specific to CS? I once met a chick who thought she'd be good at computer science because she knew how to create PowerPoint slides. She dropped out of Software Engineering (not exactly Computer Science but legit like three classes were different throughout the entire curriculum) within eight weeks.",
            "Honestly you’re doomed if you can’t motivate yourself to do anything. \n\nGood CS students will be critical thinkers, problem solvers, etc. they’ll figure out ways to do things & will be stressed but find…enjoyment (?) in doing it. There’s a specific way of thinking and problem solving that come with consistency/practice/work put into things like assignments and projects.\n\nMy prof always told us there were 3 kinds of problem solvers in the world and gave examples using a broken door.\n\n- one group will just quickly fix the issue at hand.\n- another will learn how to fix the issue at the root to stop it from happening again.\n- the third will find someone else to do the work for them.\n\nGood CS students are the first group, but great CS students are the second group.",
            "When they can't solve a problem if the answer isn't in the first page of their google search. Google harder or try stuff!",
            "They freak out when they don’t understand something or their code doesn’t work. As a CS TA, I saw plenty of people who needed a lot of hand holding successfully make it through their classes. You don’t need to be any sort of prodigy to make it through a CS bachelors, at least not at my college. The people who gave up on pursuing CS were the people who couldn’t be patient when solving a problem. Instead of seeking help or taking time to troubleshoot or think through the assignment, they would just panic. As a SWE, it is normal to have to learn new things that may be difficult to understand at first. I think the ability to patiently troubleshoot an issue and ask for help when needed is one of the most important skills to be successful in our field.",
            "Honestly it may sound contrarian to the other answers here but coming in with the I already know everything why do I need to go to class, then the first midterm hits",
            "Probably unpopular: not passing calculus",
            "I graduated last year, and from my experience, the types of people who didn't make it have these things in common:\n\n* Procrastination - There were a lot of students who waited till the last minute to work on projects and assignments and they either weren't able to complete them on time or their work is subpar. Don't be that guy, work on your projects as soon as you get them.\n* Cheating - I don't think there's anything inherently wrong with using services like Quizlet, Chegg, Stackoverflow. However, you should always use these resources with the intent to learn from them. You should use them to understand problems. Don't just copy and paste solutions. You're paying for your classes, so you should take advantage of them and truly absorb the fundamentals.\n* No interest - You absolutely NEED to be at least moderately interested in programming and CS to get through the curriculum. If you're not then you're going to find this experience insufferable and you probably won't do well. There are a lot of people who go into this major solely because of the money, and these people get weeded out pretty quick.\n\nIf you avoid these three things, then you'll probably pass. However, if you want to do well then you need to go further than this then you have to proactive. You should ask questions whenever you don't understand something, you should feel comfortable collaborating with others, you should be able to do research on your own, you should do projects in your spare time, you should try to get full marks in all your classes and all your assignments. If you're on top of things then you'll have nothing to worry about, it'll be a fun experience for you.",
            "Cheating and constantly begging your classmates to do your work for you/show you their code. Saw more than a few people exactly like this drop out because they never learned to code.\n\nHard to fake knowing what you're doing on an exam where they want you to physically write out your Java implementations.",
            "I'm going to avoid the double negatives and just encourage you to:\n\nSpend lots of time writing, reading, debugging, and stepping through code.  Breathe it.  Use that process to internalize the concepts you are learning through the lectures and books.",
            "Not trying and struggling with the homework\n\nStruggle == good\n\nAsking for help == good\n\nAsking for free code without understanding == bad",
            "lots of times they still make it:\n\nhttps://www.reddit.com/r/cscareerquestions/comments/10z627k/i_think_my_coworker_doesnt_know_what_hes_doing/",
            "Learn to Google. When you get into the real world, you’re gonna have to know how to troubleshoot for yourself. Spending days trying to fix a simple problem is hell, but you’ll come out better for it on the other side.",
            "Cheating themselves by copying chegg code or straight ChatGPTing early assignments and not putting in any effort to understand what they copied (I TA intro to CS so I see this a lot)",
            "Isn’t passionate or curious. Unless someone is very very very smart, they’re going to be unable to get through the major at a good institution due to it getting quite challenging/involved imo.\nSame goes for jobs & interviews, a significant amount of grind required.",
            "The inability to think both functionally AND abstractly.",
            "One classmate in an upper-division Software Engineering course on software testing didn't even know how to check which operating system he was using. Blew my mind that they could somehow manage to get the prerequisites to take the upper-division course in a computer science discipline without even being aware of what OS they were using. They were using Windows 11.",
            "Biggest advice? Don’t work fulltime",
            "Someone who \"wants to make games\". Had a bunch of these gamer bros sign up expecting SFM or roblox. Day 1 was OOD with Java. They were gone by xmas.",
            "Well a CS degree is just a degree that says you’re really good at math. It’s not going to do jack shit to prepare you for a career as a software engineer (if that’s your goal like most people). You have to learn programming, current tech, and the business side of things on your own time. So if you 1.) can’t put in the time to actually learn the math or 2.) can’t figure out how to cheat properly, on top of taking the time to actually learn software engineering outside of school, you’re probably not going to do well.",
            "only doing it for the money and not because you like CS. everyone i know who has dropped out picked the major because of money; everyone i know who loves to code is thriving",
            "They hand in programs that do not compile.",
            "Do you guys have any suggestions for someone who works full time and had to switch out of the cs major bc classes are all during the day ?",
            "Procrastinating homework and especially projects.",
            "Only relying on professors to teach you everything",
            "Donest take any initiative, always asking for assignments, no group project contributions.",
            "In my Uni, mostly after an introductory programming/coding class or Calc I, most of the people who struggle/fail those classes are in a different major next semester.\n\nAlso if they copy and paste the solution for every assignment almost from the start of the course. Not like, googleing syntax or a simple chunk of code, the whole ass thing.",
            "It's hard to tell. I guess when someone loses confidence. I have seen my friends who fell back in CGPA but eventually picked up practical CS knowledge in final years. They never could compensate for their CGPA but ended up in good CS jobs. I would suggest focus on learning applied knowledge. That way you will enjoy what you are doing. :)",
            "Whatever happens go to class do the assignments and keep banging that keyboard.",
            "They always ask to copy off you. Like damn bruh at least try on your own before asking for my code",
            "If you’re able to complete the assignments on your own, you’ll be fine. Discussing with others and having to struggle with the material is fine. That’s expected. But if you’re constantly needing to copy homework or cheat your way through the curriculum, and are either unwilling or unable to solve things on your own, you’re probably in the wrong area.\n\nThis doesn’t mean that it will necessarily be easy. Again, struggle is common and important.",
            "tbh from what i've seen anyone can pass through cs curriculums (unless they have big focus on mathematics)..anyone who actually tries can pass. in my division the people who failed were the people who didn't give any shits about anything in the courses.",
            "Honestly, the best advice I can give is stuff everyone knows, but it actually and truly makes a difference, at least for me it does. Go to every lecture you can and sit in the front of the room on Day 1. \n\nMy ADHD ass can have a hard time with this, but I just have to remind myself that it's okay to not be fully engaged in lecture. If it's a bad ADHD day then it's better for me to go and take in 5% of what's said than nothing at all, and that's totally okay. Just being present is a good first step.",
            "They always need a partner",
            "Hi",
            "The ones that don't ask questions in class or with their peers tend to not make it all the way through.",
            "They wait till the night before the exam to study and pull all nighters then.",
            "1) not passing the compilers class. 2) almost passing classes the first 2 semesters.",
            "If you don’t actually enjoy solving CS problems for the sake of it. People who do CS just for the money are a problem.",
            "Posting this question on reddit. Do yourself a favor and switch now to something you'll enjoy. IT isn't for you.",
            "Never ever skip classes, then it will be fine.",
            "Girls, Clubs, Drinking, Not putting in the hours\n\nJust being a lazy ass or a scrub.",
            "Me: Way, way back in the 80's when I went to school, I had to help several of my classmates log in to their user accounts. \n\nNarrator: The didn't make it.",
            "Lot of Fs and INC on your grades.",
            "A big one is passion. If people have a passion for CS they will work on learning more than just what’s taught in class.",
            "For me, I think they just give up easily. If there’s a bug or a problem they don’t understand, they don’t try to recreate it or ask questions which they pay tuition for, they go and ask their friends which is fine but then they also don’t try to understand it. I can barely remember my Comp Sci 1 or 2 class but I do remember when I spent hours on a tough lab trying to understand it.",
            "Big Oh notation just never clicking for them.",
            "If they spend more time on StackOverflow than in their IDE...and still can't get it to work.\n\nYou might be able to copy & paste your way through a cs curriculum, but you won't survive as a developer unless you can troubleshoot someone else's code and learn on your own.",
            "I am a tutor for CS1(Python), CS2 (intro to OOP), data structures, database design (SQL), and OOD. My students who struggle the most consistently have to be reminded that they have a book as if I just learned this stuff without documentation. If it is ten weeks into the semester and you have not opened your book, you're probably going to fail. A curiosity to go deeper into the content is integral, but that requires passion. I cannot teach passion.",
            "Being a procrastinator. Shit happens. Get in front of it.",
            "This thread scares me beyond measure, I get frustrated really quickly when my code doesn't work and it takes me a long time to understand explanations and I go to every office hour.",
            "Can’t do anything on their own, must be hand held through everything."
        ]
    },
    {
        "post_id": "1aebclr",
        "author": "MyMassiveDong",
        "title": "spamming applications online isn't the move",
        "url": "https://i.redd.it/2adv9blg5hfc1.png",
        "score": 388,
        "num_comments": 22,
        "created_utc": 1706575663.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/1aebclr/spamming_applications_online_isnt_the_move/",
        "comments": [
            "Let's see your resume",
            "Gotta network with recruiters",
            "It worked for me! Networking got me nowhere",
            "obvs 1 million is an exaggeration. the point is that n\\*tworking is useful",
            "A single behavioral interview? What third rate company is that?",
            "Did you just start looking or?",
            "You shall stop spreading negativity...\nGo and upskill first",
            "Ain’t no way",
            "u serious?"
        ]
    },
    {
        "post_id": "o8iarj",
        "author": "luluretard",
        "title": "When you figure out a bug in your dreams you’re actually being helped by an alien civilization that wants to help humans evolve as a society and innovate",
        "url": "https://www.reddit.com/r/csMajors/comments/o8iarj/when_you_figure_out_a_bug_in_your_dreams_youre/",
        "score": 388,
        "num_comments": 16,
        "created_utc": 1624738857.0,
        "selftext": "You can’t prove me wrong",
        "permalink": "/r/csMajors/comments/o8iarj/when_you_figure_out_a_bug_in_your_dreams_youre/",
        "comments": [
            "This is why tech companies shouldn't drug test",
            "Omg, this remember to me the time I was on ZEN mode for 1 month and I had a bug on Innet Address with IPs on an Android app development which was really hard to implement and to debug so this problem took me all week, nobody from reddit, stackoverflow or even professors couldn't solve it or even understand the problem. \n\nDrunk, tired, hopeless, tried to debug by hand on a black board all blocks of code in the middle of the night like a mentally ill guy. Tried to create classes in a class, Asyncses, threads all in one and it ran with 0 errors. The mystery of solving that problem at 1AM is still unsolved.",
            "Sometimes I code in my dreams and wake up with a solution",
            "Somehow I doubt anything I program will actually contribute to the technological development of the entire human race, but I like the optimism",
            "I bought an app that records my sleep talk and the first thing I said was \"It's HTML\" Which made my GF very unhappy since she was not the thing I dream about.",
            "Once I had a CS and French exam on the same day and I dreamt that I had to write code in French. Anyone else had similar dreams?",
            "No because why did I dream a LeetCode problem",
            "I knew it!",
            "This is literally the plot of the movie Arrival..."
        ]
    },
    {
        "post_id": "ln6hv0",
        "author": "kindlystfuu",
        "title": "Let’s stop talking about internships for a sec so I can tell you this story",
        "url": "https://www.reddit.com/r/csMajors/comments/ln6hv0/lets_stop_talking_about_internships_for_a_sec_so/",
        "score": 388,
        "num_comments": 31,
        "created_utc": 1613708327.0,
        "selftext": "So just as some context I’m on a sports team at a college. There aren’t many athletes that are computer science majors at my school so when you find someone, it’s nice to have them around. That’s what I thought.\n\nSo when I was a freshman, there was this other guy freshman who was studying computer science and I figured we could be friends. We had shared friends and we were on the same team so I sat next to him in class. This kid would not even acknowledge I was there. On my birthday, he didn’t wish me a happy birthday, say hi, or even look at me. BUT the day before a long ass project was due, he’d be like “hey what’s up?!” and then text me later that night for the entire project. I would just pretend like I didn’t start it and stuff. He then went on to tell everyone on our team that he hated me and I was an asshole with no context. I was also called antisocial by other members on the team because I studied a lot. Horrible start to college. Honestly, I was miserable.\n\nI am now a junior. I have not talked to this kid since that class but my friends told me that he got such bad grades and failed so many classes that his parents made him quit the team and drop out of cs and now he’s a communications major or something.\n\nI’m just saying that when people call you nerdy, antisocial, or whatever, just remember your hard work does matter and you’ll be the successful one in the end! Especially in college it can be really easy to do whatever to fit in but just stay true to yourself and keep working hard. I believe in you.",
        "permalink": "/r/csMajors/comments/ln6hv0/lets_stop_talking_about_internships_for_a_sec_so/",
        "comments": [
            "He sounds very juvenile. I never understood why these types of people even go to college. If you don’t care about school, why even try? Just stay home and stop wasting the gov’s money to pay for your ass to attend. Luckily I haven’t encountered anyone like this. But meh, don’t worry about it too much, these types usually end up dropping out at a certain point.",
            "I hear you, that guy was an asshole. But i do think some cs people tend to not polish their social skills to decent levels. I've met my fair share of weirdos or people with attitude problems in the comp sci classrooms. \n\nMy friends have more experience with these folks. They always tell me that the hyper socially awkward ones usually have bad grades too, so studying hard != socially awkward. In fact the guy in your story sounds like he had shite social skills and bad grades so the boys were right again i s'pose...\n\nBut my point is don't let studying hard or grinding be an acceptable reason to not polish social skills. They're important and you can have it all baby.\n\nSincerely, jeff Bezos",
            "This reads like a Dhar Mann sketch",
            "I would have just copy and pasted some random  github solutions and sent them to him so he could get caught for cheating. What a dick head.",
            "I know so many people like this who went to my Uni lol. I take solace knowing it will bite the majority of them in the ass Amazon",
            "Yeah that guy sucks, guess everyone’s different cause being on a collegiate team actually helps me manage my time better and make me worked harder academically, similar to you I’m sure",
            "Well there are people like this everywhere. I am from Greece and I am a postgraduate student in a theoretical computer science master programme. I was full of hope for my master! Finally I was going to meet people who care about science and want to learn new things! Well, I meat this kind of people, but I meat another kind as well. There are groups of people trading projects and assignment sollutions, asking you of solutions for excersises with no same at all! Why did they even signed for a master's programme?\n\nHere in Greece there is also a great moral issue as well. You must sympathize to people not going well to their studies and help them, but no one cares for the guy or gal who studies hard and archives his or hers goals! On the contrary, if you getting well, you masr be modest about it!\n\nI say fuck those people! Hard work is a good think, and those who work hard will find a way in the end! Fuck that guy you mention as well, no one should feel sorry for douchebags!",
            "there were so many assholes that acted superior to me and also leeched off my work in a way that they didn't have to do anything, I can't remember them all!!!!",
            "Little 18 year old me always felt like something was wrong with me in situations like this.\n22 year old me knows that the way that I act is different than the way they act. If I act in a way that is genuine to myself and genuinely respects others, then it must be an issue with the other person. Disliking someone for their poor character takes a lot more energy than feeling empathy for them because they are stuck with a such a poor character that is formed by [not my business]. \n\nYa get out of this world exactly what ya put into it 🤷‍♂️",
            "[deleted]",
            "Amazon",
            "This reminds me of a guy I deal with in my cs classes. Except my guy is smart but super arrogant and wants to correct everything you say. Even if it’s means changing his mind. So he can attack your view. He’s smart but I will feel bad fit anyone who tries to work with him.",
            "Thanks for the validation 🙏🏾",
            "ok buddy"
        ]
    }
]