[
    {
        "post_id": "ifxepi",
        "author": "TigerLilly00",
        "title": "Reminder that FAANG is not the be-all-end-all of CS",
        "url": "https://www.reddit.com/r/csMajors/comments/ifxepi/reminder_that_faang_is_not_the_beallendall_of_cs/",
        "score": 384,
        "num_comments": 57,
        "created_utc": 1598301805.0,
        "selftext": "I love that there are communities such as these to help CS students in their school and their careers. Lots of invaluable advice and insight can be taken from places such as these.\n\nIt's an unfortunate reality that there will be toxicity in basically any community you go to. In CS, that toxicity often tends to take the form of extreme pride and arrogance. The idea that you're a failure if you don't get that internship/job at one of the most prestigious companies, that you're doing something wrong if you're not leetcoding 23/7, and conceited and egotistical people making you feel inferior to them bc they've had an internship at a Big N.\n\nI don't know who needs to hear this, but absolutely none of this speaks for your worth. I know the race can get to people's heads and it's very very easy to feel like you're not good enough if you're not achieving ridiculous goals. This impacts people's sense of self worth, confidence, and gives them impostor syndrome.\n\nI know several people who work both at big tech companies and not. After you break it into industry, it stops becoming such a huge deal. I know people who make less money at smaller companies, who get messages from recruiters at Google, Facebook, Netflix, w/e, but wouldn't leave for the world, because they're happier there. At the end of the day, being a software engineer will still mean you're one one of the most well-valued professionals in the world. You'll be well off, whether you get a FAANG-type job or not.\n\nWorking in this industry isn't just about prestige. It's finding a place where you can have a good work-life balance, a place where you can enjoy financial stability, and most importantly, a place you actually look forward to going to every morning.\n\nIf you don't get the job you want right out of college, it's not the end of the world. You work in industry for a few years, better yourself, keep learning, and never stop trying. It'll happen for you sooner or later.\n\nAnd please, lift each other up, help each other in this quest, don't tear each other down. You don't know the person on the other side of the screen, you don't know what damage you might be causing them when you tear them down to make yourself feel better.\n\n[https://www.tiffanymatthe.com/not-extraordinary](https://www.tiffanymatthe.com/not-extraordinary)\n\nPlease don't be rude in the comments. I'm bringing this up because it needs to be said once in a while, and especially now with recruiting season upon us.\n\nBest of luck to everyone this recruiting season! Keep your ideals high, your hopes higher, and never let small failures stop you from continuing to strive to be the best YOU you can be.",
        "permalink": "/r/csMajors/comments/ifxepi/reminder_that_faang_is_not_the_beallendall_of_cs/",
        "comments": [
            "You know, when I started my career, my goal was always to make it into a FAANG company. And after 5 years and finally achieving that dream, I realized it's just another company and just another milestone. Work is still work, and no matter where you work you'll find people that are awesome to work with and people you could care less to see. At the end of the day, it doesn't matter what company you work for. So long as you enjoy what you're doing, you're perfectly fine where you are. Also, don't feel that you need to be in FAANG to be a great software engineer. I've worked with loads of people who aren't in FAANG but could probably code circles around me. Just focus on yourself, and everything else will follow.",
            "I agree with every word. Great post!",
            "🙌🏻 strong agree! I’ve heard a few years out of college and you’ll hate the recruiter spam.",
            "This is very true. Prestige wears off incredibly quickly. I had what should've been a great internship in NYC and hated every minute of it. \n\nThough I just ended a 4 year relationship because I accepted a FAANG job in one part of the country and my girlfriend will be working in another. It was an incredibly hard decision and I still don't know if it was the right thing to do. The first few years after college are very significant as you begin to mold your career. But I don't know if I'll look back in several years and regret parting with one of the only people in this world who truly cares about me. ;(",
            "I'd be honest here, to me it's just a rat race. I also don't understand how people are desperate to be working in companies like facebook/netflix. I understand the good pay and all but social media and entertainment? like seriously, think about getting 4 year CS degree having done computational analysis and math only to allow people to react to posts with colorful emojis , letting people watch movies. Just an example here, the core of these companies are still kinda useless to me.\n\nIt is just sad that people dream about working in FAANG, basically sign up into this rat race will lick arse to get a job in one these companies and then feel accomplished. Like boom #success lmao. It's just hilarious to watch people fiddle around FAANG discussions.\n\nEDIT:\n\nBefore people misread me.\n\nFacebook is definitely beneficial on several instances, like for businesses, connecting people and what not. Netflix definitely has a complex system with challenges (optimization, scale, efficiency, speed, fun stuff imo) as an user mentioned. Both are great companies to work for nonetheless. However, this is not what this discussion is about.\n\n\\- Few things I want to highlight:\n\n* They're all great companies and that's it. Period.\n* trying to over-engineer oneself only to get a FAANG job, not worth it in my opinion. Just unnecessary stress in this already stressful century. There's so much more to life and CS goes a long way.\n* The mentality that if you do action A then action B will happen, leads to a toxic environment (as OP mentioned). Everyone's unique, so *can* be the approach.\n* Softeng practices can be good and standard wherever.\n\nRecently there's been countless posts about leetcode/facebook/faang leading to linkedin discussions in this sub-reddit. To a lot this can seem overwhelming/tiring so to reiterate what OP said FAANG is not the be-all-end-all of CS. Also CS/tech/seng is not what this life is all about. To people who are over-stressed just calm down. This all is ***just my opinion.***",
            "As a 31 year old CS student, 60 doesn't look as far away to me as it does for some of you early 20-somethings. Trust me when you are in your late sixties, looking back on your life, you won't give one solitary shit about having made it to FAANG. \n\nYou'll be thinking about whether you spent enough time with your kids, and what you can do to bring light to your grandkid's lives next weekend.  Maybe take them to the museum, or sit with them and help them code their first game.",
            "As someone who has absolutely 0 interest in FAANGs,  I'm tired of everyone talking about them. I have family members that worked in some of them and left because the working environement was just unhealthy, downright toxic at time. They are not a paradise. I think we need to prioritize people's happiness.",
            "Yes I’m glad to see someone say this! I got an offer at a non-tech company for much more than I would have at a FAANG company, with a laidback working culture. The idea that everyone needs to work at FAANG is like high schoolers thinking everyone needs to date a cheerleader lol. Everyone has different priorities and there’s different ways to get there!",
            "And CS is not the be-all end-all of life.",
            "Yeah, Unicorns and Quant firms are higher tier /s",
            "Love this",
            "[deleted]",
            "All of the people going after the OP are the ignorant elitist fucks that he is originally talking about. You’re all trying to fuckin crucify the guy cause he’s telling everyone that they will be fine if they aren’t a slave to FAANG. Gtfo. Go away. This should be a place for new students to grow. We don’t need you.",
            "This sure lifted up my spirits",
            "[deleted]",
            "This is the best post i have seen today!!",
            "[deleted]",
            "FAANG probably has a better work-life balance than the sweatshop I work at.",
            "[deleted]",
            "A post like this is made every other day, what exactly is the point?",
            "this is america trying to be europe"
        ]
    },
    {
        "post_id": "176eq5e",
        "author": "Bodanski",
        "title": "Unpopular opinion: School prestige matters more than any other factor",
        "url": "https://www.reddit.com/r/csMajors/comments/176eq5e/unpopular_opinion_school_prestige_matters_more/",
        "score": 387,
        "num_comments": 281,
        "created_utc": 1697137565.0,
        "selftext": "This isn’t meant to be a dooming post, but I’m hoping it’s informative for people who are trying to break into the industry and not understanding why they keep getting rejected. Too often I see people say “just do more projects/internships” when for lots of people that already have this, more of the same won’t help at all.\n\nI’ve seen countless students with 0 projects or internships get personally recruited by top companies simply because they go to a top 10 CS school in the US. I’ve also seen countless students with incredible projects and multiple FAANG internships struggle to get interviews because they go to less prestigious schools.\n\nIt’s gone so far that on lots of job applications, there is a university dropdown selection where you can either select “Harvard”, “MIT”, “Stanford”, 5 or 6 other universities, and then “Other”. Companies literally screen out students who don’t go to top universities. \n\nI understand why companies do this; those schools attract top talent, and it’s an easy way for them to hire strong students/graduates without having to review tens of thousands of resumes.\n\nAgain, I’m not writing this post to complain; I’m writing this because I see so many people posting here wondering why they’re not getting jobs when they have past projects and internships.\n\nThere is a huge economic barrier for people who can’t afford to go to top schools, which makes it difficult for getting jobs at the entry level. As much as it sucks, if you’re struggling to get a job at one of your dream companies, you might need to first get a full time role at a smaller or mid-sized company, and then once you’re 2-3 years in, companies won’t care about school name and you’ll have a better shot at scoring an interview.\n\nAlso, consider getting your Master’s. People on this sub preach that a Master’s won’t help you, but if you get it at a top 10-20 CS university (which many companies are willing to help cover), you will be amazed at how many doors it opens.\n\nTL;DR - If you find yourself struggling to get internships/new grad jobs, even with experience and projects, just know that school name plays a bigger aspect than most people realize, and you might have to work for a few years or get your Master’s before you have a shot at your dream job.\n\n*Edit: Before commenting “wRoNg I gOt A jOb WiThOuT a ToP ScHoOL nAmE”, please read the second word in the title “opinion”. This isn’t a definitive fact that applies to everyone. It’s just my opinion, from what I’ve personally witnessed from various students.*",
        "permalink": "/r/csMajors/comments/176eq5e/unpopular_opinion_school_prestige_matters_more/",
        "comments": [
            "I think it might matter for folks who are from top 20-50 schools. After 50, I think it’s pretty much the same how much weight the school brand carries.",
            "As someone who transferred from a liberal arts college to an Ivy, I can confirm that I have gotten more interviews as a result",
            "Picture this: some poor, underpaid HR admin is tasked with sorting through the hundreds of job applications for an open position to pass along the “top 20” applicants to the hiring manager. This person can’t tell a meh project from something amazing, but does recognize top tier universities because they wish that they had attended one (tongue is in cheek here). They recognize the school and use that as a sorting factor because they really don’t have much else to go on.",
            "I'll see your unpopular opinion and raise you one.\n\nEveryone over here talking about Ivy league schools, which is great and all, but...\n\nIn the US: *your school's sports teams, especially their NCAA football team, factors HEAVILY into this.*\n\nI constantly joke with people that every time my little off-league college plays against and beats an NCAA team in football, my degree is suddenly worth more. I'm not really joking lol. \n\nA lot of managers are sports fans, and having heard of your college simply makes it more valuable to them. If they know your school at all, even if it's because of their football team, you've got a leg in.",
            "Yeah everyone already knows this lol this is why admissions into top CS schools are so difficult",
            "was at stanford career fair earlier today and watched people literally beg to get jobs from mid companies like walmart/micron lmao i dont think it makes as much of a difference as you think. some ex meta/google interns are only getting $80k offers from random ass companies in this market\n\n&#x200B;\n\n&#x200B;\n\nand meanwhile i cant even get a call back :( 100+ apps reject/ghost all",
            "As soon as I put GTech on my resume back when I started their online Master’s program I received linkedin messages even from Google recruiters 🤷\n\nEdit: had a Bachelor’s from top 75 state school prior",
            "It is my lived reality as an engineering manager who has recruited dozens of engineers at Silicon Valley companies that I did not pay much attention to what schools people went to.  My focus was on what you did.  What have you accomplished? Are you passionate about the work?  I do know that there are other managers that pay attention to your school.  I offer this as evidence to the contrary of your opinion.",
            "Idk, I go to a T15 and have struggled a lot to get interviews. I think quality of internships matters most (i.e. having FAANG on your resume) and I've seen a ton of people who go to lower-ranked schools get FAANG internships.",
            "i got reached out to and am interviewing with Jane street—currently go to SJSU. I’m getting around the same number of callbacks as my friend who goes to Berk and also interned at Tesla w me. We’re both juniors.",
            "Internships are #1 factor by far\n\nBut #2 is definitely school prestige",
            "I agree with most, if not everything on this post. I currently work in a pretty large company, but not tech focused. After a year I'll start my masters, probably and Georgia Tech or UIUC and after that hope to get a job at a top tech company.\n\nSome notes\n\nFor internships I think it depends on your bubble. Everyone here wants to get a tech job at FAANG. There are plenty of relatively small (market cap wise) midwestern companies that just show up at the local university and hire accordingly.\n\nObviously if you are from MIT this helps and if you are trying to get a FAANG internship or any internship in the first 70 companies on this list (roughly) [https://www.levels.fyi/internships/](https://www.levels.fyi/internships/)  then name is honestly going to matter more than anything else.\n\nI think subs like this and and a very interesting Tiktok/Youtube subculture have created this hilarious illusion that everyone is going to get a job at FAANG upon graduation. Most people simply aren't good enough to work at these companies in their life, much less right upon graduation.\n\nI think everyone could if they tried, but if you are still using the same sort of approach that got you into the middling university, then I don't know why you think you will get into a really great company for your job and internship.\n\n**TIPS ON GETTING TOP INTERNSHIPS IF YOU ARE NOT AT TOP UNI**\n\n\\- First one is funny, but figure out a way to visit a top uni. If you go to UMass Boston, legit just take the ten minute drive to Boston and MIT and enter the buildings, figure out a way to join their clubs , attend their events, LOL. I did that at UofT when attending a nearby university.\n\n\\- Figure out a way to network. This can be hackathons, this can be doing research at a good university, this can be working on open source projects, etc. The goal is not necessarily to get anything out of this immediately, but you just need to put yourself out there because the more people you meet, the more opportunities present themselves and the more things you learn.\n\n\\- Apply and put effort into your website, portfolios, etc. If you are from a lesser known university then unfortunately I already have a bias towards thinking you don't really apply yourself (this is from a person that didn't attend a very good university for undergrad). Your projects, website, etc. need to be on point.\n\n\\- If you are struggling to get a paid internship, then do some research at your university. If your GPA is good this should be paid by some sort of grant. If your GPA is bad then you literally failed at the only job you had up until that point LOL, and for that your punishment is working for free. This is where I got my start and it really helped to get me that first internship. Try to do this as early as possible and a 4 month research project with a professor is enough.\n\n**Last note**\n\nMarket is tough right now, if you do thing correctly you will still face a lot of issues, but you'll get somewhere. Most of the resumes that I have a misfortune of seeing are still very bad. However, when I do have two or three good candidates, but only one spot then it does become a game of luck. Stay strong, do your best, remember to calm down and you'll be ok.",
            "Really?  Are you a hiring manager?  A recruiter?  How long have you been working in the industry?\n\nI'm not here to deny that certain employers tend to recruit at certain schools.  Most certainly geographically.  And your first job may be easiest to get through your placement office and on campus recruiters that show up.\n\nBut my spouse and I graduated in CS many, many moons ago and have a kid that graduated in CS recently and I have seen plenty that doesn't align with this black and white view of tech and new grad hiring.  I worked for an employer that stopped hiring from an elite school after a few poor experiences with new grads and had a higher bar for them to jump if the most interesting thing on their resume was the name of their school.",
            "I disagree with this, I have worked for plenty of companies and a couple faangs and wasn't once asked what school. I think people want to look for reasons out of their control as to why they aren't getting hired or interviewed when in reality it is you. How much experience do you have in the industry to make this assumption? I am curious.",
            "Not needing a sponsorship trumps school any day of the week",
            "I go to a top 1 CS school and I still barely get OAs.",
            "School Prestige can help ≠ matters more than other factors.\nReplies are getting confused what's even being discussed lol",
            "This is probably true for entry level, but in the long term your school doesn't matter. That being said, in the current market somebody graduating from a mediocre school (me) might never get a SWE job",
            "[deleted]",
            "I would say that tier wise, CMU, Berkeley, MIT, and Stanford are in a class of their own. The rest of the top 10 (in no order: GT, UIUC, UWASH, UTA, UCSD, UMICH) would be tier 2 and then realistically everything else is almost treated the same in terms of recruiting. Keep in mind this does not include smaller schools such as cal tech Harvey mudd etc. additionally I would argue that going to a less prestigious school, if located in a tech hub, (think like cal poly slo) CAN allow for greater recruiting outcomes than great schools that have sub-par locations, such as SUNY Stony Brook.",
            "Those schools attract top donors**",
            "Gotta disagree because I go to a shitty public university and know a lot of people who’ve worked for all the hyped companies. Maybe it helps but it’s not that important to recruiters. Code is code it doesn’t matter where you learn to write it.",
            "It might not be as much about the prestige of the name on your degree as the networking opportunities available while you are at those institutions.  Both indicate you should try to attend those schools, but the reasons are a little different.",
            "Matters for your first job, once you get experience, no one actually cares",
            "Y’all are smoking some serious copium. You can’t just realize 99% of it comes down to luck. Let say you have 5000 applicants and are only looking for 25 interns, there’s probably at least 1000 well qualified people in that applicant pool yet only 25 get hired. Give it time my friends, do your best and it’ll turn out alright in the end.",
            "You're better off building a network than shackling yourself in debt for a name brand school which uses the same textbooks as your community college. I'm not saying you're wrong - but that's not the only thing you have to consider.",
            "So no one's going to mention OP's post history suggest he is still attending or is a new grad.  And surprise, surprise, he's attending UBC. Are the \"countless students\" you're referring to part of your social group? Or are you a recruiter?\n\nI really am trying not to be rude but reading through I really question the validity of what you're talking about. \nSorry but you're speaking with confidence in this post and others like you're a leading voice in the industry. At the end of the day it comes down to pure chance for the hiring manager and the position they're speaking to fill. Prestige school might get you the interview, but if you fail in other fundamental area's you're not getting hired.\n\nIf you're getting out of high-school and you want to improve your chances because you have a particular company you dream to work for, sure go ahead and go through whatever the cost in order to get what you want. These school's you're all paying 10x the price for is about the experience anyway and that potential extra + on your resume anyway. I literally made money off scholarships to go to a no name college and get my bachelors and have worked at a major corp. Why in god's name would I pay $60,000 a term when I completed my degree in half the time and the result was the same?\n\nBecause I researched the company I wanted to be apart of and stood out in different ways, I applied myself.\n\nFor the MAJORITY of people they need to focus on fundamentals and really just having passion for what they're doing. \"Do more projects/Internships\" is because the MAJORITY just zombie-walk through college and don't apply themselves in any way, and wonder why they can't work as a top engineer making $250,000 for Google. THAT'S why it's said.\n\nEven if I am incorrect about all of that, to suggest everyone should take out giant predatory loans and do whatever it takes to attend these prestigious schools for what amounts to a piece of paper is just wrong. Plenty of these companies, even FAANG, have opportunities even if you have NO degree. Does that lower your chances of landing your dream job compared to a Harvard graduate? Probably, but none of us know an individuals particular circumstances. Or what the hiring manager/company is looking for. \n\nMaybe you're a top of your class UBC graduate with no passion or skills just trying to make alot of money with no real interest in CS or maybe you have no degree but have demonstrated your abilities through your own personal projects that grabs a hiring manager's attention.\n\nIf i'm ever part of a team that's just hiring people I depend on because \"they graduated at harvard lol\" then I'm finding a new job.\n\nTL;DR\nDepends on the an individual and the hiring manager. Ask yourself what you REALLY want and how to get it. OP is just projecting to justify the cost of his own degree.",
            "As an industry professional, prestige absolutely does matter",
            "i’ve been on r/applyingtocollege for a while and i’ve only ever seen ppl say prestige doesn’t matter for CS so seeing this is interesting",
            "I work at a fortune 500 tech company and have screened hundreds of resumes + done tens of interviews as a hiring manager or on the panel. First of all school name doesn't matter at all for experienced positions, outside of possibly being a conversation topic for the interview. Basically has the same amount of relevance as an interesting interest or hobby that I'm curious about and might bring up in the interview.\n\nFor internships / new grads it's still not really the name of the school that matters, more so a function of whether my company actually recruits at your school or has a significant alumni base. Put it this way if you go to university of Waterloo (most interns my team has ever hired came from their coop program) or a bay area school we recruit at (I actually don't know which ones specifically but Berkeley is a solid bet) your chances of getting an internship are an order of magnitude higher than eg. MIT or Harvard just because we don't fly people from California to Boston to recruit at all.  (We actually do spend a lot of money to fly people to Waterloo and do interviews bc we've had great success with Waterloo interns in the past + the market is super competitive with other companies). But even then, If you have a referral and good resume that can outweigh pretty much anything else and get your resume onto the top of the list anyway.",
            "[deleted]",
            "Many years later I totally agree. I didn’t learn anything in class anyway.",
            "I think saying it’s the most important factor is stretching it but there’s no denying there are certain opportunities given to those that go to certain schools.",
            "[removed]",
            "Top schools are only unaffordable if you have upper-middle/lower-upper class parents who either (a) are shit with money, or (b) only recently started making a lot. \n\nUnder ~150k you don't pay tuition and under ~65k you pay nothing at all",
            "No it’s more of a supply and demand issue causing recruiters to add these filters to have a manageable selection pool.\n\nThis isn’t a reflection on a student from a lower ranked university being worse than a student from a higher ranking university. \n\nIt’s just a simple/lazy way to filter candidates.\n\nPS: there are some startups/companies, which only recruit from top universities. But those are usually specific to universities with top research talent in a particular niche field or proximity to that university.",
            "Disagree, \n\nConnections matter more than anything else\n\nSchool prestige is for sure second though",
            "What about ASU?",
            "[deleted]",
            "i go to a city college where i pay 3k in tuition and have 2 internships dont lose hope",
            "i get 0 interviews bro",
            "Thankfully this isn't an issue for me because I don't apply to big companies.",
            "[deleted]",
            "What would be some good target schools for CS? I’m a high school senior and I’m considering majoring in CS but might not considering all the shit going on. \n\nMy question is, would less selective state schools such as UMD, UW Madison, and UMN be good schools for job opportunities/location?",
            "Wow, what a revelation. Going to a prestigious school will land you more interviews, job offers and opportunities? Who would have thought.",
            "does northwestern count",
            "Eh I’ve now been at the other side of the table with hiring and prestige does not matter as much as you think. Rankings themselves don’t matter that much like a 3 to a 22 ranked school doesn’t do too much for a hiring manager. A student with internships will also often be more desirable than one without at a more prestigious school. And most importantly it really only matters for that first job. It can be a helpful tool but it’s absolutely not the biggest factor. Only really at like ultra elite prestigious roles but for faang not really that massive",
            "It only matters if you have no network and are spamming apps to postings that already have 1k applicants",
            "But what does this mean for people who live in the big state of florida? Are they all fucked? The school we have in the entire state with highest ranking is UF and it only ranks 46th i think lmao. What do floridians do if you are correct??? Join a cult and commit uwucide??",
            "Small correction - companies will only cover your masters if you work for them while getting it. That’s really frickin hard. Doable, but a tough couple of years. And most don’t cover all, just a portion.",
            "I know too many Duke CS students who can't get a job to agree. Duke is ranked 20th. Maybe they get an interview (a lot of them didn't even get that). But mediocre programmers are going to struggle regardless of what school they attended.",
            "“But if you get at a top 10-20 CS university (which many companies are willing to help cover)” is this true? They cover your expenses or",
            "I’ve gotten four interviews as a sophomore from a school that’s not prestigious at all. Three of them are F500 companies. I’ve got prior internship experience- startup, ta, etc. I’ve only applied to around 60 places. Work experience > prestige.",
            "> School prestige matters more than any other factor\n\nExperience. \n\n> please read the second word in the title “opinion”.\n\nI read it. You are upset that your opinion is stupid and you can't take criticism. This brings up another factor more important than school prestige\n\nAttitude.",
            "Ultimately what matters is getting the work done.  Software is as much an art as an engineering discipline.  Fancy schools can help with gatekeeping, but that fades as years of experience accumulate.",
            "Do you list your school 20+ years out of college?",
            "We look at course grades, regardless of school.\n\nWe are not CS but engineering.",
            "My school is usually ranked around the low end of the Ivy League.\n\nIn my field, software engineering, it doesn't matter one bit. You can have BS from Buttfuck Nowhere College. It doesn't matter.",
            "anyone in the UK knows how much power Anglia Ruskin holds 😅? Currently doing my L5 diploma should I dip out of the school after? Where should I go to if so?",
            "I went to FERIT and I barely got a Bachelor Degree. Had I gone to FER or MATHOS, I would probably not have graduated. College is not for everyone, much less a prestigous college.",
            "I think you are putting way too much emphasis on the school name. I graduated from a state school and have coworkers from MIT, and I don’t think I’m an anomaly. And I’m talking about entry to mid level engineers. I don’t work at FAANG so I can’t speak to that, and on that point I think your advice towards the end is good. Doomers in this subreddit need to not worry about getting into FAANG right out of school and accept working their way up in the industry and job hopping before getting their dream job.",
            "What has helped me the most is actually my internships. This year I got multiple offers and moved into interview round with well known companies. Something I had NEVER imagined last year",
            "This is the exact definition of judging a book by its cover. I'm pretty sure only a small percentage of hiring is done this way. That way of filtering is how you end up losing potential talents. Internships where you are new and learning, they might be looking for people from better schools, but for regular hire, they would rather go for experience. If you have experience before and were great then you might get a return offer, and that is based off your experience, not your school. \n\nI always say, knowledge is free, what you are paying for is the certification. There's nothing stopping you from going to these top schools and sitting in on those lectures, you can learn the same things for free, its just that you won't be taking the exams.",
            "Not exactly true. Companies will definitely not hire someone just off prestige, they need to have the grades/internships/experience to prove they are good candidates. I’ve met some folks who had great portfolios and got in through knowing someone who could vouch for their abilities from schools that are not top CS schools.",
            "Faang loves to employ bootcamp students lol. \n\nAnyways, theres lots of recruiters who avoid top schools because they think its too overqualified or something",
            "This may cause me to drop out. I love to code and learn (regardless if I am in school or not). I go to a community college, and I want nothing more than to be part of a team and BUILD. I see my friends at university who have fun and have friends who are their peers (community college can be solitary) who just focus on their school work at University. They don't automatically get disqualified for internships like I do.\n\n&#x200B;\n\nI love to code and I have since I was 15 or 16 years old. I am an average person. It hurts to see others who don't even care about programming like I do to succeed in ways I don't think I can. If this causes me to drop out, it is purely because the fact that making it on my own would probably bring me more joy in life than a degree. Sitting in the shadow of the fortunate students at Universities is depressing.",
            "It might be true that the top 10 colleges or so get more new grad callbacks in interviews in a down market. You still have a chance to fail the interview.\n\nIs this advantage worth 100-200k? Not unless your parents are rich imo.\n\nTo me it seems like a better deal to go to a no name school with low tuition or full scholarship. You still get a chance to enter top companies as a NG (it's not uncommon). If you don't get it you can go to a mid tier company or startup and apply again to top companies every 6 months. If you have the skills and location I'm pretty sure you'll get a FAANG or FAANG adjacent role without the debt. There's going to be some luck no matter what.",
            "It helps to get you in the door, but no one’s gonna care what college you went to after 10 years of industry work lets be real",
            "It matters, but imo it matters less than it does in a lot of other fields.\n\nI went to a school ranked \\~200, and I know people from our CS department who work at FAANGs.  It's not a huge percentage, maybe \\~10%, but it was there.\n\nIt was MUCH more common for folks to end up at smaller regional tech companies, tech consultancies, or non tech F500s (which still generally all offer at least high 5 figure starting pay and usually in lower cost of living areas than FAANGs, not a bad deal imo), but the top firms still showed up on campus and recruited.  The opportunity was there.\n\nOn the other hand, I know NO ONE from my school who works for Goldman Sachs or Mckinsey or any of those kind of high flying business roles.  There are absolutely industries where you are completely shut out if you don't come from a \"target\" school.  CS is NOT one of them.",
            "I have 4 prior internship experiences in SE and Data Science, 3.91/4 GPA for my B.S. in CS and 4/4 GPA for my M.S. in AI (completing both degrees in 4 years), my university is ranked top 80 in the US. So far I've applied for 200 full-time positions and not a single interview, besides phone calls just to tell me they don't hire international students. The name of your university matters more than people might think. Graduating this December so hopefully things get better for me...",
            "IQ matters way more",
            "Adding a data point:  MIT upperclassmen and got ghosted by FAANG two years straight (no oa, no interview) except for Amazon, but I am able to get oa and interviews from very good unicorns/quant companies. Failed all the interviews at quant companies (for SWE) but have a \\~80% passing rate of interviews in tech industry",
            "Graduated from a bottom 5 school and I'm doing fine. School prestige definitely helps but the most important factor is not being a retard. All of my non-retard classmates are doing fine even the ones that are reallllly damn close to the line. On the other hand, all of my retard class mates gave up on the industry. This holds true universally. The proof is left as an exercise to the reader.",
            "Those schools have the best need-based financial aid programs in the country. Don't know if any hs students read this sub, but please don't let thinking you can't afford it prevent you from going. If you think you can't afford it, you'll probably get a full ride.",
            "I know this is old, but you can take a look at the university breakdown on LinkedIn - from what I have seen, I would actually say I've noticed a lot of companies that have a significant portion of SDE employees from non-target schools."
        ]
    },
    {
        "post_id": "15l888x",
        "author": "Purple_Guarantee2906",
        "title": "STOP only doing web app projects",
        "url": "https://www.reddit.com/r/csMajors/comments/15l888x/stop_only_doing_web_app_projects/",
        "score": 385,
        "num_comments": 129,
        "created_utc": 1691471196.0,
        "selftext": "I see ppl on this sub 90% of the time only talk about projects around creating a website. That’s fine but then don’t be confused when a SWE role that has nothing to do web dev ghosts you. Or even why you’re not getting interviews because you’re resume shows only interest and experience in web development which imo is over saturated.\n\nReimplement an interesting/somewhat complex algorithm, do a ROS project for you robotics ppl, implement a reinforcement learning algorithm if you’re interested in data science/machine learning. Not only will it show your true interests but also distinguishes your projects from thousands of duplicates.\n\nTL; DR: If you want a higher chance of getting an internship stop only doing web app projects. Reimplement an algorithm, do a ROS project, machine learning, ANYTHING but web app imho.",
        "permalink": "/r/csMajors/comments/15l888x/stop_only_doing_web_app_projects/",
        "comments": [
            "More simply, build the things you want to work on.",
            "You can both make a unique project and make a web app for it (I mean u can literally embed a unity game in the browser). \n\nDuring an interview for the first internship I landed, one of the engineers demod a project I had on my resume (a bunch of models i trained), which was only possible because I made a web app for it",
            "maybe reword this: don't force yourself to do web dev projects if you aren't into them. if you are, then go right ahead.",
            "[deleted]",
            "I’m myself trying to create a trifecta of projects for my resume. Currently I have an embedded RC car thingy, next will be a web app, and the last one will prob be some sort of ML (I’m hopefully going to take a ML class before I graduate so might just use a class project :p).\n\nBut yeah having a resume full of just websites sounds pretty boring unless you’re into the web dev space, then it’s totally understandable",
            "lmao another cs student lecturing other cs students, you guys have all the advice but none of the experience",
            "Terrible advice. If you find an open api and build out an entire react app that interacts with it, you have a great project on your resume",
            "If I see more algorithm-esque projects on an entry level resume, I'll assume it's likely another school project. It's going to look like another project that many other students have probably done as well, a project which doesn't take a student out of his/her comfort zone to actually learn other important aspects of development. \n\nA project like that does not show that you know how to work with frameworks. It does not show that you know how to deal with dependencies. It hardly shows anything at all. It's like taking a leetcode problem and claiming that as a personal project. It would not stand out at all (to me).\n\nWeb apps show that you have likely dealt with APIs at some level. Building APIs is a generally relevant skill that many students may not have had enough experience with.\n\nWeb apps can also involve many parts. They do not need to stop at the front end and can include middleware and DB components. A fully functioning web app (one which actually utilizes data stored in a DB) suggests that you have a breadth of knowledge that spans the full stack. It shows that you can actually hook up components together yourself rather than rely on some skeleton project base that your processor provided to the class.\n\nAnd as others have said, a web app provides an actual thing to look at and demo. It's tangible. It shows that you actually have something to show for your efforts rather than some text which could easily have been made up.\n\nThe problem with web apps is that so many students list cookie cutter projects that are obviously school projects. For those projects, it's hard to tell how much of the project was you following step-by-step class instructions or whether most of it was built by another class group member. But if you build a unique web app that you are personally interested and invested in, that effort will likely show through to interviewers\n\nSo the problem is not that students are only doing web apps. It's that they've only done hand-held projects with limited scope or limited personal input.",
            "If you’re applying for software engineering role, wouldn’t learning frameworks and making a full-stack web app be the most relevant experience?",
            "A counter argument to this:\n\nDo those interesting things and then hook up a web ui. No recruiter is going to read through your implementation of an algorithm. No one’s going to download your code and run it. \nAt the very least have a nice looking write up of what you’ve made on a git platform (accessible though the web 😉)",
            "The internet is built on web apps and so are 90% of cs jobs. Some people have this misconception that web apps are just JS frameworks guess what if you are using Java(significant portion of enterprise cs jobs) especially with Spring Boot you are working on a web app. This post is really naive. \n\nOn the other hand do I think most people are working on just frontend heavy react projects? Yes. I think people should be working on more projects that use Cloud Services. Also making APIs is another part of web app developments that you dont see as many projects for even though its in high demand for jobs.",
            "Look at the requirements of any internship. All of them have some sort of web frameworks and web dev experience",
            "web dev projects are the easy to start out using just some html and css, also i’d say there are way more project tutorials online(youtube) that students follow compared to # of other CS type projects. lastly, having a nice UI on a project is nice to have for show. I have a theory that a master CSS dev will be a way more attractive candidate than one that is knowledgeable about optimization, speed, etc. in the eyes of a Hiring manager or recruiter.",
            "basically, op thinks web dev is boring and data science is cool, which is not wrong imo",
            "People most are still students and they haven’t taken machine learning courses and who is in robotics",
            "How is implementing some algo enough to count as a \"project\" in this market?",
            "There is a big difference between building a simple web app for a small business and building an internal or external enterprise web application that actually solves real problems... And this is really the only way to go when you want to build a distributed system that can be used in a corporation across multiple offices in multiple continents... So I disagree. A web app can be anything, more than anything its just a way to distribute software over multiple regions. I pretty much only work on mobile and web applications but these are huge systems with complex architectures and are critical to business operations.",
            "People focus so much in learning just React but when you tell them otherwise, they get upset. The only people that use React or web dev at my workplace is the UI team. The rest of the company(6-7~ teams), use Java, C++, etc. and a lot of other things that don’t involve web dev.",
            "Any project recommendations if I want to work on data engineering/science?",
            "Its hard to know what kind of project would appeal to interviewers frankly. I think just being able to show passion for the craft, being able to speak about your passion projects and your understanding of technology and so on.\n\nI’ve hired interns in the past that just show they are eager to learn and will work hard to become a well rounded engineer. Havent really even asked about projects unless they bring it up.",
            "nah last couple of orgs I was at that had interns, we really don't give a shit if you're into ML or robotics or whatever unless its related to the role. You love writing complex algorithms but don't know react or how to install a dependency, nah we don't need that you can go find a quant internship that pays better anyways.   \n\n\nDon't listen to this garbage advice, if you're interested in web go do web, interested in infra? Go setup some basic level infra, there's some great terraform and AWS project/courses, interested in embedded? Go work on robotics or something.",
            "As far as getting interviews, nobody cares about your side projects anyways… \n\ndo what you want to get better at or enjoy. there’s a lot to learn doing web dev.",
            "Hard disagree. Some companies will take interest in non-web app projects but they are rare and far inbetween. Most companies will scoff at anything thats not a web app. And no dont do something you are interested in, do something that can provide objective value.",
            "Yeah, I really don’t get why everyone is obsessed with web dev, its not that impressive if you only know how to do that",
            "I have been thinking the same for past couple of weeks. I wanted to make a project with Java did a google search and all that poped was just some kind of web based project. Now looking back to some web apps that I made in Java's and other frameworks what I realised is that they are all fundamentally same for the most part. It bothers me that I can't think of anything besides a webbased project",
            "Translation: \"Getting a CS degree to make shit websites suck so I'm going to compensate by making semi-complex things so I don't feel like I wasted my time in college\". There, fixed. By the way, the average CS major at my school is afraid of math. They're not going anywhere near machine learning.",
            "Web dev == Framework Engineering != Software Engineering",
            "Projects only matter when you don’t already have internship experience. I still have my project made i. 2022 in my resume.",
            "How about mobile project?",
            "Better yet, don’t rely solely on projects.  Get an internship or find some freelance work.",
            "They just want to see what you can do. I don't think it's bad to host direct project on web based technologies. Reduces boiler plate for some allow you to focus on what your actually trying to make instead of trying to make sure its compatible on platforms or someone has to download some special program to se it work. Everyone uses the internet hence its easier to demo. Good thought process and well written code can go a long way. And all of this can even be done in vanilla js, html, css.",
            "Embedded systems is the lowest paying SWE and the hardest to learn though. Web App is more accessible but you should find a niche to make yourself stand out.",
            "Bad advice, do any project that you are interested in. It’s best to chose what you want, and make it really good. The point is to learn something that interests you. A project won’t get you a new grad or internship",
            "I agree to not working solely on webapps like your typical to-do list or bank apps, but in the spirit of \"show dont tell\", web apps and the like are crucial in demonstrating all the examples you mentioned. \n\nSay I re-implemented monte-carlo tree search, how is anyone going to know I did it correctly unless I can incorporate it into a product that shows its efficiency?\n\nSo as a corollary I would say work on interesting problems that are at the edge of your ability, but make sure to package them well so that you can show them off. Incorporate your ROS project into a cool YT video, publish the RL algorithm in a journal, write-up that kaggle project, and make a web app for your ML model",
            "Disagree. A lot of things happened in the backend underneath the website: database, algorithms, machine learning,… The website is like a pretty gift wrap to attract recruiters to peek at our product",
            "What? Are you saying you DONT want every app on your desktop to be electron?",
            ">Reimplement an interesting/somewhat complex algorithm, do a ROS project for you robotics ppl, implement a reinforcement learning algorithm if you’re interested in data science/machine learning. Not only will it show your true interests but also distinguishes your projects from thousands of duplicates. \n\nI've gone down the product route anyway, so it won't matter much for me\n\nBut I think this will distinguish you in all the wrong ways. Those are exactly the things I did during my master thesis etc. But I don't see much demand for those kind of skills in most companies. Those are the things you use libraries for, rarely if ever a reason to do such things from scratch.\n\n(Unless you are aiming at becoming a unicorn who does these things for FAANG and rakes in the millions, but that's an all or nothing bet then)",
            "This is bad advice, just make something you like and that's all. Most programming that actually makes money is web-based.",
            "what types of personal ML projects do you recommend? Wouldn’t they just entail finding some dataset + calling different scikit and pandas functions?",
            "agreed, webdev is brainrot and I happily did a project that interested me more, and recruiters definitely talk more about it to me",
            "[deleted]",
            "Decent point. Bootcamp grads are all web dev so you're not making yourself any diff",
            "If you want a higher chance to get internships, start a startup that sell things people want and exit.",
            "any good robot os project ideas?",
            "Who’s the joker who made this post?",
            "And an example of such algorithm…?",
            "I dread webapps.... such a boring field.",
            "Yes and no. I love backend and so I decided to learn how to make full stack apps. My front end is not as good but I wanted to learn enough to be able to communicate my app with backend. \n\nThe point is to work on something you actually like as a personal project. Instead of following tutorials or doing the same apps as everyone else, use your knowledge to create your own stuff. I don’t need to reimplement a complex algorithm or something for robotics. Meh\n\nYes, they are interesting but I don’t do stuff only because I want it to shine on my resume. I will work on something I truly enjoy and make THAT shine on my resume.",
            "I mentioned having created my own VPN server in one of the interviews, got a fairly positive feedback. (It was a platform engineering role)",
            "Web is a great front end for just about any software system. I think it's important to not forget about the software system that it is a front end user interface for. The data models, the storage, the innovation, the APIs, etc, are all examples of parts of a software system that are equally important to the front end and deserve as much attention and innovation. What I'm saying is, it's not working on the front end that is the problem, it's working exclusively on the front end, and believing that the front end is all that is important, that is the problem. And this line of thinking isn't just pervasive in job seekers. I've seen it many times at work, too. People put the front end in a privileged position ahead of everything else. In my mind software needs to work well before it needs to look good and before it needs to be easy to use. There are plenty of examples out there of software that proves my point. Reddit is a good example.",
            "OR, stop doing projects if your goal is to get a job, especially entry level ones. \n\nClone repos from the internet and put them in your own repo. Look over each for a few hours in case any interviewer decides to look in depth over a project on your resume (99% dont). Spend the time wisely doing leetcode and system design, which are asked in most swe interviews.\n\nMost of the recruiters and hiring managers filter based on past experience, school pedigree, gpa and achievement. Nobody cares about a project unless it generated monet. But if it did, well, you eouldn’t have applied for the job.",
            "Hi, I am 34 and decided to go back to school for a cs bachelors. I just had my first 4 classes, c, c++ intro courses and some math and computer logic. When will I be able to build some of those projects you mentioned like ROS or complex algos? After data structures?\n\nI see everyone say “just make a project” like I have the skills necessary to. I don’t. I just like to code and computers and did really well on basic coding so I decided to pursue a degree in it. I already have a bachelors which is in music so irrelevant. But like I feel like I will never have a good enough project at this point.",
            "I’m an incoming freshman for a cs degree. I really don’t like design and creating websites, I’m more interested in algorithms and spend most my coding time on leetcode or codeforces. Do really need to have something about websites in my resume?"
        ]
    },
    {
        "post_id": "qc98rp",
        "author": "None",
        "title": "bombing a final round is the most disillusioning feeling ever",
        "url": "https://www.reddit.com/r/csMajors/comments/qc98rp/bombing_a_final_round_is_the_most_disillusioning/",
        "score": 389,
        "num_comments": 38,
        "created_utc": 1634759238.0,
        "selftext": "me and the interviewer just spent like 15 minutes debugging code that should work and it was a bracket issue 🙃🙃🙃🙃🙃🙃🙃\n\nThis process is so fucking long winded that if you get to the end and still fuck up it just makes you feel like shit. god. fuck this.",
        "permalink": "/r/csMajors/comments/qc98rp/bombing_a_final_round_is_the_most_disillusioning/",
        "comments": [
            "[deleted]",
            "[deleted]",
            "Wait what. Your RECRUITER was debugging your code?",
            "Stupid hire view. Phone screen. Coding challenge. 1 on 1 technical interview—> rejection. Feelsfuckingbadman",
            "Dude. If they sat there and didn’t point out you had a simple bracket issue, you likely dodged a bullet. I’ve been at this over 20 years now and I don’t use a single coding interview. I just sit down and have a conversation discussing software and software practices with the candidate. That tells me all I need to know about a candidates passion and experience in software development.",
            "No, the worst is being an alcoholic, and getting through all the interviews up to the final round, and then going on a bender and being drunk during the make-or-break Zoom calls that could have landed you that job.",
            "Unlucky dude. But I wouldn't say you bombed it. Even the interviewer said he wouldn't have catched it if it wasn't for you pointing it out.",
            "C'mon! Right now I am in middle of my on-site interview break and I feel bad that I am going to bomb it :( I shouldn’t have opened reddit smh  🤦‍♂️",
            "Had a 7 week long interview process at a company, got to the final round and kinda bombed a technical by not understanding the question correctly (Interviewer wasn’t that helpful either).  Got rejected.\n\nNow interviewing at M, a much better company. Keep going, hang in there. A lot of luck goes into interviewing, it’s all a numbers game. Don’t get attached to companies. Recognize your mistakes and move on to the next.",
            "Aaw jeez I feel you dude"
        ]
    },
    {
        "post_id": "nvbibk",
        "author": "SpedFish",
        "title": "2022 NEW GRAD GITHUB (forked pittcsc)",
        "url": "https://www.reddit.com/r/csMajors/comments/nvbibk/2022_new_grad_github_forked_pittcsc/",
        "score": 383,
        "num_comments": 28,
        "created_utc": 1623178697.0,
        "selftext": "Saw in [this](https://www.reddit.com/r/csMajors/comments/nurw38/fulltime_positions_starting_summer_2022_thread/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) thread that there is no more pittcsc new grad github repo. Decided to fork it and will maintain it myself along with some other students at my university:\n\n[github.com/coderQuad/New-Grad-Positions-2022](https://github.com/coderQuad/New-Grad-Positions-2022)",
        "permalink": "/r/csMajors/comments/nvbibk/2022_new_grad_github_forked_pittcsc/",
        "comments": [
            "wtf does it actually start this early",
            "Not all heroes wear capes",
            "Is there really an advantage to applying now?  My internship project from this summer is far from resume-ready, still practicing for interviews, etc.  Wasn't planning to start applying until like august",
            "There goes my mental health again",
            "This is unreal",
            "Thanks a lot man. This means a lot to all of us here",
            "THANK YOU!!",
            "Thanks!! Let’s grind boys 💪",
            "This will be so helpful. Thank you",
            "been waiting for this. thanks",
            "[deleted]",
            "And it begins",
            "Is there one for data science?",
            "thanks bruv",
            "Thank you for posting this!",
            "God bless you",
            "Can someone explain to me how github is free? I dont get how they make money. I also didn't want to make a new thread about this.",
            "Is there something similar for internships?",
            "What if you graduate in December of 2022? ._.",
            "Remind me! 2 months"
        ]
    },
    {
        "post_id": "mqesu5",
        "author": "v94j30jv9",
        "title": "I succeeded.",
        "url": "https://www.reddit.com/r/csMajors/comments/mqesu5/i_succeeded/",
        "score": 384,
        "num_comments": 66,
        "created_utc": 1618358387.0,
        "selftext": "Well after 200+ applications, 2 interviews, I actually managed to clutch out an offer. [For those who didn't see my last post](https://old.reddit.com/r/csMajors/comments/l1halt/i_failed/) (on a different throwaway)\n\nNo, it's not Amazon before anybody asks. But, I think it is actually better. I don't really care about the name so much and the pay is insane, over $50 an hour. \n\nI got extremely lucky. I am not going to end this post on a \"just keep trying\". Hearing that only hurts if you actually do fail. What I will say is that shit sucks right now. No person should have to submit over 50 applications to get a job. Especially the people on here who are all so diligent and accomplished. Good luck readers. Remember that many, and I mean many, people are failing to find internships.",
        "permalink": "/r/csMajors/comments/mqesu5/i_succeeded/",
        "comments": [
            "Congratulations !!",
            "Web dev or software dev is competitive AS FK. Way too oversaturated.",
            ">\tNo person should have to submit over 50 applications to get a job.\n\n50 applications shouldn’t be that hard to fill out though. Maybe like 2 hrs at most?",
            "[deleted]",
            "Good job man! Love seeing stuff like this",
            "That’s an insane work dude. Congrats!",
            "congrats dude, I also got a late offer. Super worth all the grind and courses I had to drop",
            "[deleted]",
            "Nice job! However, if you submit the same resume and use a bot, 50 is not that much haha!   \nAlso, it is kind of crazy that you found 200+ applications... Also once you have an internship experience you will be much easy to find next one!",
            "Congratulations 👏",
            "[deleted]",
            "Man this sub fucking blows. I know you are trying to put a positive spin on it/ send a positive message here, \n\nBut what does including your crazy salary hqve to do with sending the message? It seems like your just humble bragging.",
            "What kind of internship pays over 50 dollars an hour?? Mind telling the industry or the company?",
            "**🚀🚀🚀🚀🚀**",
            "Well done homie",
            "Congratulations, can you share you domain, and your projects.",
            "Real quick can you give me some pointers, I am, one year away from going to uni and I want to know what sort of things you did to get the internship opportunities. The process, what you learned and how, the job does not matter, its the journey that I want to hear.",
            "Congrats! The same thing happened to me. Got rejected from Amazon, but got a much better offer from a more competitive company that pays > $50 an hour.",
            "Can you dm your resume please\nIm applying but i feel like my resume is basic and dont know how to keep a good resume ive done projects and have only one intern experience",
            "Congrats!",
            "Congrats!! Cheers to your accomplishment!!"
        ]
    },
    {
        "post_id": "k0yvb9",
        "author": "ThatLj",
        "title": "Y’all fuck with Kruskal’s algorithm or nah",
        "url": "https://www.reddit.com/r/csMajors/comments/k0yvb9/yall_fuck_with_kruskals_algorithm_or_nah/",
        "score": 390,
        "num_comments": 50,
        "created_utc": 1606332132.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/k0yvb9/yall_fuck_with_kruskals_algorithm_or_nah/",
        "comments": [
            " Kruskal’s and prim’s, makes trees of graphs\n\nMinimum spanning, finds it fast\n\nDjikstra’s searches for the shortest path\n\nLike me it's greedy, a sociopath",
            "Kruskal is dope, but Prim fucks harder for sure.",
            "This hits close to home... had a Kruskal and Prim project due 2 days ago where we had to implement a priority queue without using STL in C++ and I couldn't figure out how to do the PQ implementation so I turned it in half finished :/\n\nAnyone here know C++ and willing to show me how to implement a priority queue and use it with Prim's algo?",
            "i dream of manacher's",
            "If the algorithm ain’t greedy, I don’t want it",
            "It's faster to import a priority queue than code up union find imo\n\nPrims > kruskals",
            "union find is my favorite algorithm so Kruskal's definitely has my vote.",
            "The Virgin Prim vs. The CHAD KRUSKAL",
            "\"Handshake: Hi It's Christina with Tiktok, we'd like to...\"\n\noh no u don't",
            "I'm a Prim's man myself ngl",
            "Prim >>>",
            "Prims all the way",
            "Yo, Boruvka’s",
            "Just used kruskal’s algo in a final lol",
            "Kruskal gang rise up!",
            "I'm still not convinced that Kruskal just works everytime. At least with Prims you already start out with a connected component, and just grow it",
            "nah man all my homies hate kruskal's.\n\nthis comment was brought to you by prim's gang",
            "I fuck with calling to APIs that do that shit for me. (Not that any API I’ve ever used is implementing Kruskal’s...)",
            "you all fuck yourself or nah you fucking hoes or nah? dumb fucking fuckers",
            "Kruskal a homie fr",
            "I just heard of Kruskal's algorithm , Whats the purpose of learning this algo ?",
            "I don’t even know why I sub here.",
            "yes I like him",
            "Inverse Ackerman goes brrrr",
            "just did a prim's and kruskal's project last night so this is nice timing. prim's takes the top spot tho imo",
            "No I don't. \nBut Prim can like, get it"
        ]
    },
    {
        "post_id": "1866jy8",
        "author": "Rooshirum",
        "title": "Rejected from 2 dream opportunities because of hacker rank",
        "url": "https://www.reddit.com/r/csMajors/comments/1866jy8/rejected_from_2_dream_opportunities_because_of/",
        "score": 389,
        "num_comments": 86,
        "created_utc": 1701205193.0,
        "selftext": "Just blowing off some steam as I gotta talk about how much I hate hacker rank tests. For some background, I am in my senior year in university for CS with a minor in business, I took 2 years off school to work at a startup company making mobile apps as a full stack engineer. I am deeply passionate about gaming and game development, and I am looking to become a game developer, and eventually make my own game studio.\n\n1. Riot software engineering internship\n\nSpent so much time tailoring every aspect of my application and resume to get this internship, contacted 20 previous interns at Riot, a senior engineer at Riot, 2 engineers at Epic Games, and had them all review my resume/application, then applied immediately after applications opened. I even made a 3D video game where you play as one of the characters in league of legends and walk around exploring my portfolio projects in game.\n\nThis did get me past the application stage and as someone who was ignorant to leetcode tests I thought that just getting an email back was going to be the hardest step; I thought the coding test was going to be the easy part because I'm confident in my skills as a developer. I got the hacker rank test, it was 5 difficult questions that built off of each other with a 2 hour time limit, I was a fool to not practice more before hand, but, I still completed 4 questions with all passing tests, and did not start the 5th. I literally spent like 25 minutes rereading the 5th question because it was so difficult to understand, I swear they did this on purpose, I couldn't even understand what they actually wanted so I couldn't spend time thinking of a solution. Regardless, I thought 4/5 was pretty good, but apparently I wasn't even worth getting an interview, I just received an impersonal \"better luck next year\" no-reply email from hacker rank, which I cannot even do as a senior. Feels bad.\n\n2. 2K games engineering graduate program\n\nDamn this program looked awesome, one of my favorite game publishers, a 21 month program (full time work, paid!) where the first 3 months are hands on training in game development in unreal engine, then they place you in one of 2K's studios, rotating you in a different studio every 6 months so you get a feel of what you like to do, then they (hopefully) hire you permanently afterwards. What an amazing opportunity. The job emphasized the necessity to be proficient in C++, from my background I did not do much C++, so I spent many hours grinding and learning everything I could know about it. I got past the application stage, got my hacker rank test, it was 1 hour time limit, 7 multiple choice questions about C++, then 2 leetcode questions. I am confident I got all 7 multiple choice correct, but the struggle came from the first leetcode question. I spent 30 minutes, half of the entire duration of the test, just re-reading the god damn question, the examples that were provided contradicted themselves, it was extremely long, and all in all made no damn sense. If I was given this as a requirement in a real job, I would throw it back and ask the person to rewrite the whole thing. Once I finally understood what the output was supposed to be, I coded up a naive solution in the last 10 minutes and passed half the tests, the other half were testing for efficiency, which my algorithm wasn't. I literally feel like there was no amount of preparation I could have possibly done to have passed that test, I feel totally cheated. I sent a heartfelt email to the recruiter asking for the chance to continue to the take home test, and was ghosted. I'm pissed, and depressed.\n\n&#x200B;\n\n&#x200B;\n\nI know that I shouldn't be worried about 'dream' opportunities and should focus on getting anything, and that is exactly why I haven't stopped applying to places. I've applied to about 60 places so far, which may be rookie numbers to some of you, but I take time to tailor each application to each job. It's just a huge bummer to miss out on these opportunities that are perfect for me, and that I know I will do an amazing job at. Part of why it bothers me so much is it seems like it's so much harder to get into game development. I can hardly find any game development companies that hire early career game developers, it's always like senior 6+ year unreal engine developers, and then they just hire all their new associates from internships and graduate programs, then your opportunity is lost.\n\n&#x200B;\n\n**TLDR;** Spent a lot of time tailoring applications and networking for 2 dream game development internship/graduate jobs just to fail to horribly worded HackerRank leetcode questions despite knowing I will be capable of doing the job well.",
        "permalink": "/r/csMajors/comments/1866jy8/rejected_from_2_dream_opportunities_because_of/",
        "comments": [
            "I’ve done the riot games hackerrank in the past, and it’s honestly objectively leetcode easies, maybe on the harder end of easies. I think you’re extremely talented, but you’re preparing for everything but the leetcode/algorithms that you need to pass not only OAs but technical interviews as well.",
            "I passed all test cases on all 5 problems for Riot OA this year and never heard back. It happens bro there is no guarantee even if you are prepared.",
            "People who make their own projects always gets respect, bro just need sometime on leetcode.\n\nI don’t think Riot will hire much NG, it’s not your fault. Game company don’t hire as much programmers as Internet. Riot is finding an improvement point, but where? LOL had already passed its peak. MMO is something uncertain. Valorant maybe.With the economic depression, they will slow the step to creat new products. Even for Valorant, I think they’ll prefer senior engineers to make profits as soon as possible, not like NG need time to train.",
            "I have 3 years of experience and I’m exceptionally bad at LC and hacker rank and have never passed a strictly LC-style interview. I wouldn’t recommend this in the long-term bc it’s limited me in my earning potential + size of companies I can work for. That being said here’s how I’ve found job opportunities while sucking at LC: 1) contracting for people in online groups/social media who are willing to pay to do some project (and then do it well and they often want you full-time or for more contracting) and 2) reaching out to key members of startups (CEO or CTO) and impressing them with a summary of myself and a portfolio that shows I can get work done. Some other ideas would be reaching out to agencies/local dev shops with your portfolio and doing some contracting for them. Good luck!",
            "> play as one of the characters in league of legends and walk around exploring my portfolio projects in game\n\nIt's sad to see that even in game dev creativity counts nothing. Even if it makes sense to check whether candidates can develop, this narrow-minded focus on LeetCode as the No. 1 metric is an aberration in our industry.",
            "Sounds like it might be a skill issue. Perhaps practicing more leetcode questions might improve your ability to understand instructions?",
            "DUDE NO ACTUAL WAY, I literally applied to the 2 same roles and the same things happened to me, I'm not kidding. Send over a dm if you wanna talk about it, I absolutely feel you.",
            "Always assume rejection. I was selected to intern at Riot for their Game Design Internship for Valorant. Then... they had layoffs of 200 employees and my mentor was one of them so they had to cancel my position. It sucks. But keep your head up high and grind, if you can convince top firms you're this good, you'll be fine.",
            "Take some responsibility honestly. The title “rejected because of hacker rank” is deflecting, you failed the interview process because you were underprepared. Keep grinding but try not to get too frustrated or blameful of these failure, ownership in software engineering is a strong skill to have. This hiring market is tough, you need to do everything possible to succeed, no point in complaining.",
            "Cheat on every single OA ever\n\nThen do the actual interview yourself\n\nSimple",
            "I hate hacker rank too. The questions are worded so poorly. Leetcode is clearer in their descriptions",
            "I know this is a vent post, but if you're contacting 30 people for help on a job app, you're missing the point. \n\nGet a mentor. Have them go over hackerrank and leetcode. Most likely your issue with understanding the question has to do with not pressing the unit tests. As an interviewer, this is a very common mistake people make when they haven't practiced on the platform enough.",
            "Honestly if you are passionate about games enough to go that extra mile on the personal project, you can land those jobs down the line in your career. You don't have to start there. \n\nI respect your strong will and alacrity to do that much to get what you want and I'm pretty sure it will get recognized down the line. Keep up the great work man.",
            "It really is a stupid trend but sadly it is one we must play by. These tests are not to prove you're more talented or whatever, they're just to prove you've crunched hundreds of these challenges. Like when you studied math in high school, they didn't care if you understood, they just wanted you to solve so many problems you basically know it by hand and just hope you get a very similar problem.",
            "It takes practice to do leetcode problems, even the easy ones.\n\nPretty much every semester the first programming contest at our university goes pretty much the same. 6 easy questions where people who have practiced race to finish all of them under 20 minutes, while the other students are struggling to get 1-2 in the 2 hours timeframe.",
            "Here's the thing, this may be your dream job, but it's  also probably a dream job for a lot of other people, and just a job for everybody else. I'm sure you'd be a decent developer for them but so will the other people who got 100% on the questions. There's so many trash developers out there who are lying on their resumes, and there's no real way to make sure that they know how to code without testing them. Basically if you want to work for one of those major companies you need to practice",
            "Bro sorry but tailoring an application isn't gonna get you anywhere further than getting an OA, but I guess you had to learn your lesson the hard way.\n\nRiot Games is probably attracting more potential early career candidates than regular FAANG offerings, we're talking about a game company whose products people of our generations have been literally addicted to for more than a decade now, why do you think they give you a 2 hours OA when a FAANG coding interview is like 45min at best? Because they get a shitton of applicants, and it doesn't matter if you connected with them beforehand, there's gonna be some hundreds of kids somewhere passing the OA with 100%+ no matter how good of a programmer you think you are.\n\nEven if you passed the OA, you put all your eggs in one basket, it's much better to play a number's game and send out a good resume to 200 companies, than spend the same amount fo time to send a perfect resume to 2 companies. Your effort should be spent on interview and OA prep, not resume prep.",
            "[deleted]",
            "To be honest. Hacker rank in most cases is the phone screen or comes before the phone screen. It’s just to see if you are able to solve problems. This is basically a pre interview step, I think the title is a bit misleading.\n\nThere are lots of people who are “anti leetcode” and will just apply to jobs that don’t do leetcode or take home. But the issue is, when you get an amazing opportunity that tests based on leetcode. You just screwed yourself over big time.\n\nTake this as a lesson. Practice leetcode once a day",
            "You can blame the tests but remember that these positions aren't getting unfilled. There are people who did everything you did + prepare for leetcode and hackerrank.",
            "Don’t be too salty about the type of questions asked simply because they are not evaluating you against an absolute metric but relatively to others who also took the test.\nSo if you found the questions confusing, chances are others did too, but they just managed to figure it out.\nSo simply just do better next time!",
            "long time hobbyist game developer working as sde here, lots of respect for the personal projects. similar to what everyone else said, you’ll probably want to brush up on reading convoluted LC questions and solving them with focus on time complexities. \n\nwhen i first started applying to positions, i thought that my base knowledge from indie dev (a* path, flood fill, backtracking, etc) would be enough to pass most OAs but boy did I get fucked up. had to take a couple of months to practice neetcode 75/150 before i started getting followups on OAs\n\nthe reality is that most if not all developer jobs at any big company will require passing a LC screen before you get a chance to talk to a person at all. if anything, you can practice LC with game dev applications in mind to motivate you and help stick the concept (ie/ rabbit hare algo for loop checking and breaking out, backtracking for enemy AI decision making, DP for finding optimal move, etc)\n\ngood luck",
            "This is the problem with the way high schools and colleges grade. Eventually people are going to be asked to prepare and perform at a high level, and it’s a real kick in the pants.",
            ">  If I was given this as a requirement in a real job, I would throw it back and ask the person to rewrite the whole thing.\n\nLmao. Imagine working as a brand new jr dev and you just throw your work back because you don't understand it. Good dodge there recruiters. Hackerrank doing it's job.\n\n> Once I finally understood what the output was supposed to be, I coded up a naive solution in the last 10 minutes and passed half the tests, the other half were testing for efficiency, which my algorithm wasn't.\n\nSo... all the info was provided in the problem for you. You understood the problem and were able to code a working solution? I don't understand what the issue is here. Other than this 1000% being a skill issue where you were slower than other candidates that passed the test.\n\n> despite knowing I will be capable of doing the job well.\n\nSure. You and 10000 other candidates. No one cares that you \"know\" you can do the job well. How do they KNOW that you can? You have to show them in some way.\n\nHaving a portfolio or other job experience gives them evidence that you can do well. Failing LC easies gives them evidence you cannot. Why take a risk on you when there are 100s they have both?",
            "Not sure if your ability to deflect responsibility or the fact that you can't do 5 objectively LC easies is more impressive.",
            "[deleted]",
            "Don’t work anywhere that makes you do leet code or similar.",
            "That project is wild and if that’s what interviews are looking like now, I’m just dropping out haha",
            "I'm sorry. I'm sure if you apply yourself to your weaknesses with the same commitment as you did your evident strengths you're going to have a fine career and if you're really determined and intentional about getting into game development you can make that happen, even if it's not by the road you initially imagined. \n\nRegardless, the relative worst has happened now in this scenario - you failed - and it wasn't altogether that bad. You can learn from it, move on, and the next chance you get you'll be ready. \n\nYou'll never really know what went wrongly exactly, but maybe take some notes on your approach alongside the actual implementation and think critically about where you might improve in terms of communication and your strategy etc. \n\nEither way, commiserations and onward and upward.",
            "I hate hackerrank it's like reading a story.",
            "Try again next year",
            "Yea know exactly what you're feeling, unfortunately that's the barrier to entry for most established companies that do software for anything, I struggled years in getting into the mindset that leetcode matters, because that's not how the job is but nothing that we can do for now but grind",
            "Passed all test cases for ibm OA but I think it's not submitting, link takes me back to the start OA page. I hate Hackerrank.",
            "Why do you assume it was your code test results?",
            "this is just a setback. keep at it, you got this!!",
            "well. shit. now im even more worried"
        ]
    },
    {
        "post_id": "14mzmu4",
        "author": "NeilD_18",
        "title": "Do you guys actually work for 8 hours straight during your internship",
        "url": "https://www.reddit.com/r/csMajors/comments/14mzmu4/do_you_guys_actually_work_for_8_hours_straight/",
        "score": 385,
        "num_comments": 179,
        "created_utc": 1688129671.0,
        "selftext": "Hey, so I’m a remote Data Engineer Intern this summer and was wondering if anyone else actually works for the entire 8 hours. I feel like I’m swarmed with work lol.",
        "permalink": "/r/csMajors/comments/14mzmu4/do_you_guys_actually_work_for_8_hours_straight/",
        "comments": [
            "Do 3 hours of productive work and make it sound like it took 8",
            "[deleted]",
            "Defense software intern here. I spend 2 of my 8 paid hours each day waiting in lines for security. Probably 4 hours talking to coworkers and 2 hours actually writing/reading/fixing/thinking about code. Tax dollars hard at work!",
            "I only really work productively for like 5 hours, maybe more after lunch but I don’t get much stuff done in the evening",
            "I've literally been sleeping  in during my internship, they haven't given us a project yet even though it is the end of week 4 but oh well. \n\nyeah I barely work lol it's mostly free money",
            "Jokes on you, i do 10.",
            "Genuinely depends on the day. Some days I go past that, some days I’m twiddling my thumbs because I’m waiting on someone for something or I’m mentally drained anyways. If you’re genuinely swamped, ideally you can bring it up with your manager, interns really shouldn’t have work that has a priority or tons of pressure. Obviously ymmv, some companies do pressure interns for results, but ¯\\_(ツ)_/¯",
            "I hop on after hours and pretend I don't to make other interns look bad",
            "I wouldn’t say 8 hours straight, but I do generally work most of it. My team goes out for lunch so I’m obviously not working during that time, and there’s occasional meetings, but asides from that I’m either writing code, reading documentation, coordinating with team members, diagramming and thinking about what to do, etc.\n\nEdit: spelling",
            "Hell no lol",
            "I remember arriving @ 9:30, having a 2 hour lunch and  taking a 30 minute walk at around 3pm, timesheeting for 9-5 then fucking off at 4pm lmfao\n\nWas a consulting intern but had enough skill to do my work fairly quickly, was also in a slow period so a decent amount of fucking about. Still got a return offer 🤑😛",
            "i shitpost on teams for 7 hours and do actual work for like... 1 hour a day if im lucky. it sucks.",
            "Nope. General IT intern, 8 hour shift. I pretty much do like 2 or less hours of actual work. Other than that, either in a meeting (less than an hour average a day). Then on my phone or learning something I’m interested in that I can do on the work computer. (Something that’s tangentially related to what I’m doing at work).",
            "Full-time data scientist here. I average around 4 hours a day",
            "Depends on the company and the manager I would say. Pastly, I have worked with a company who had a lot work while on the other hand I worked a very little for other company.",
            "i work maybe 2 hours a day on average, sometimes it’s the full 8. some days it’s less than 2. i’m also doing project management work",
            "My internship has us do 4hrs, 1hr lunch (unpaid), then another 4hrs. Really only productive for half that time.",
            "I come in on my days off and do free work lol",
            "https://preview.redd.it/fzyg3seob69b1.jpeg?width=602&format=pjpg&auto=webp&s=6817b1f606bc2b63e03b20edc864f3cd5c33f13e",
            "Working 8hrs straight everyday will kill ur mind. Please don’t do this",
            "No one in any job except like cashiering can work straight like that without Adderal and even then tolerance would eventually stop that. \nTry to get 4 really good hours of good quality work the other 4 spend time learning somthing or doing somthing super easy take a break eat lunch",
            "Are you guys trolling I probably do like 20 hours of real work per week the rest I spend doing leetcode or something else lol",
            "I had 1 hour lunch.",
            "Homie the only ppl that work a full 8 hours a day are either in the medical field or just really bad at their jobs",
            "Some days no, but some days I am absolutely grinding for even up to 12 hours. I'm a bit obsessive and I sometimes can't find it in myself to stop, even if it hurts the rest of my life 😓.",
            "i work for 2-3 and then do random bs",
            "I got a pretty heavy task for an intern so yes I do have to work 8 hours to meet the deadline (already behind it, they may have expected too much from me 🤐)",
            "Define “work”? Meetings count as work, emails count as work, being available counts as work, when you boil that away for actual tasking, maybe 1-2 hours a day, 3-4 tops.",
            "We have an intern who works on a large testing project a good solid 8 hours/day. He's doing a great job. In fact he's knocking out our test lists a lot faster than we had anticipated.",
            "It’s normal for you to not work for 8hrs straight, you’ll probably average 4-6 hours. If you feel yourself getting bored then find something constructive to do like learning more about the tools you’re using or concepts you are implementing.",
            "No lol, I did like 2 days of work this week. Although I have been using my other time productively (imo)",
            "I can't say I'm super productive for the entire 8, but I am working more or less the whole time. I also tend to put in a little bit off the clock since they won't let us go over 40.",
            "Yes",
            "Yes and no. Its some years ago though",
            "No lol",
            "Nah I did like 4 tops. Wlb is key",
            "last week, i worked a total combined of  less than 15 hours",
            "When I first started, I was probably working close to 8 hours. Now since I'm closer to the end of my internship, I manage to do most of my work fairly quickly, so I'm definitely cruising by now.",
            "I work maybe 3-5 usually never 8 and I say that bc I’m like watching shows/movies or something else",
            "Mine is in person so its mostly like 6 hours of actual work rest is hanging out with other interns, lunch, breaks, and writing this comment",
            "I do as much work as I have the bandwidth to do. During my working hours I do have the goal to be productive as possible. But I also take frequent breaks when needed so I don't overload myself. I probably get between 4 and 6 hours of productive work done in a day.",
            "Depending on where you work, your hours could be flexible. I’m doing a remote internship while taking summer classes (yes, it’s a lot of work and I don’t recommend it unless it’s absolutely necessary) and they allow me to split my hours to attend class in the middle of the day. I work 4 hours in the morning, go to class and have an hour lunch break, then do the remaining 4 hours afterwards. It gives me a good break in between while still doing 8 hours. It’s an option if you feel like 8 hours all at once is much, which it can feel like it if you haven’t worked full time before, but after a while you’ll get used to it. They just want to give you the full experience.\n\nAlso, if your company has intern events (mine has plenty) attend those! You still get paid for being there and sometimes they could be fun (e.g. mixers, networking events, etc.).",
            "2 hours take it or leave it",
            "No. I doubt any intern does. I have had two previous experiences and I put in like 3hrs of productive work per day.",
            "Bro, I literally work 10 hrs a day.",
            "No. It is impossible to be both productive and healthy doing 8 hours of programming per day for extended periods. Interrupt yourself with other non-computer related things every 2 hours or so.",
            "I’m also a data engineer intern and only work around 3-4 hours. It honestly depends on how far I’m on the project.",
            "How did you land the job OP ?",
            "Have a really good 1 hour lunch, have many snack breaks. They are paying you. Enjoy it.",
            "I try to be as productive as possible. Maybe that ends up being 6h-6h30 out of my daily 7h shift.",
            "I did but my internship was super short (2 weeks).",
            "I work 8 hours gay",
            "I don’t work 8 hours straight in my FTE",
            "No",
            "Sometimes grinding all 8, but sometimes literally 1 hour of work for 8 hours lol",
            "I try to be as productive as possible. I think of this as a learning opportunity.",
            "I work about 1 hour a day of the 8. Have yet to be assigned a single project (witn help). \n\nI kinda have one things going on but haven’t gotten stuff I need to do it… half way through the internship and here we are",
            "More",
            "8-12, my internship is very competitive",
            "lol. lmao",
            "Not exactly 8 hours but when I was interning I did put in a solid 6 hours of actual work every day",
            "You'll find that during internship, junior and some of your mid years you will be very busy. This is a combination of lack of skills and experience as well as all the shitty, time consuming but boring work being lumped on you combined with seniors or managers constantly checking up on you to make sure the work looks good, you're learning and that you're actually working. I'm a senior dev with 16 years exp and I'd say for the last 12 years I've generally been left to my own devices because employers trust me to get on with the job. Either through optimization or nature of the work coupled with my skills or experience there hasn't been much work throughout that period that I couldn't do in an hour or less per day... the hard part was more making it look like I was busy which working remote has curbed for me. For about 6 years I ran my own business while being full time employed that I managed to do at my FT job because I had so much free time.",
            "I just do basic IT work full time, and I maybe have 2-3 hours of actual work a day the rest is me “reading” some tech book",
            "Try to get 6 hours of good work in, you’ll stand out",
            "machine learning engineer intern here. Literally do like 30 mins a day. Been there a month, haven't even wrote a single line of code, the only tasks they found for me is labelling data. Idk what im even there for at this point.",
            "As a professional programmer, I have convinced myself of the concept of \"negative productivity\": when I'm spending one hour writing code (read: bugs) that will take me multiple hours to find and remove.\n\nAs such, I stop coding if my brain isn't up to the task. I plan out peripheral tasks to reduce the risk of bugs, and give myself a break (sometimes an hour or two long) before picking bite-sizes chunks to take on.\n\n8 hours for me includes 2-3 hours of mental recharge. Some people make 8 hours of productivity. I achieve maximal productivity working 4-5 hours a day.",
            "Not too often. If I'm debugging I might put more hours in, otherwise I parse my hours up do a couple hours, break for a few, etc...",
            "I mean I think I do but do you count xcode taking 10 minutes to build my company’s and me twiddling my thumbs as work",
            "well, I worked at a faang, 10 hours were average, last year work in a nice company, 6-7 hours were the norm",
            "I haven't worked in 2 days. I'll make it up on the weekend :((((",
            "*no* never in any of my internships",
            "Lol no",
            "Yes",
            "I worked for 7hours straight and 1 hour gay because I wanted to stay as a senior dev",
            "No. And the general consensus here makes evident the fact that the 8 hour work day is obsolete. It was fine for factory workers working 12 hour days in the late 19th century. Now it's 2023. Income disparity has increased. The workforce is more productive but only the rich see significant gains. End the 40 hour work week or pay us more.",
            "Actually more like 10-12",
            "yes you should. As an intern, you should learn much as you can. Do not take the opportunity for granted.",
            "When I had my internship I did as I was at a small firm. But if you're in a big firm you only end up doing 2 to 4 hours of real work a day.",
            "Depends on the definition of work. Like literally coding for 8 hours daily? I’m skeptical of anyone who says they do. Also short breaks are normal and expected in any workplace. But most people try to be productive in some capacity for as much of those 8 hours as possible. Take advantage of the opportunity to learn as much as possible!",
            "I'll be honest the main motivator for me doing a degree was purely just a bit of paper to open doors. I've been a dev for 4 years now and a lot of places won't even give you the time of day unless you have a degree. Appreciate this is probably an awful reason to start pursuing a Cs degree but that's why I did it.",
            "Hell nah lol",
            "I have a stopwatch going when I’m focused, and turn it off for lunch and when I get distracted. I’ve been able to focus for about 6 hours a day during my internship. 100% efficiency isn’t realistic… but I can get closer if I have a hard problem that I’m engaged with. Not sure if I could keep it up with a full time job for a long time though",
            "Hell nah"
        ]
    },
    {
        "post_id": "q2r3tz",
        "author": "CurrentStrain",
        "title": "Finally got a SWE offer.",
        "url": "https://www.reddit.com/r/csMajors/comments/q2r3tz/finally_got_a_swe_offer/",
        "score": 386,
        "num_comments": 48,
        "created_utc": 1633547014.0,
        "selftext": "Not a big name company but excited for finally getting something.\n\nEDIT: Thank you for the support, Appreciate it.",
        "permalink": "/r/csMajors/comments/q2r3tz/finally_got_a_swe_offer/",
        "comments": [
            "Congratulations!! :))",
            "🥳🥳🥳🥳",
            "Did you have any internship experience prior to applying?\n\nI'm coming up on graduation and have been so overwhelmed by studies I haven't taken on any internships. Wondering if I'll be able to pick something up at a small time firm in my hometown in its stead.",
            "Congratulations!!! You and me both are celebrating like kings and queens!!",
            "Happy for you!! Good luck",
            "Congrats",
            "Congrats!! I’m happy for you! 🎉 Any advice for us looking for our first SWE internship?",
            "congratulations!!!",
            "W",
            "Let’s goooo! Hope you enjoy it!",
            "[deleted]",
            "Me too! \n\nHave a final round with another company next week too.",
            "Congratulations OP! One of many!",
            "Congratulations!",
            "Congrats! And don't listen to anyone who may tell you that you need a \"big name\" company straight out. Whatever company you got just absorb as much as you can and that will allow you to gain the confidence to take on bigger companies if you choose to in the future.",
            "Can you share what the application timeline looked like for that position?",
            "What's the point of just getting \"something\"?",
            "TC? Lol"
        ]
    }
]