[
    {
        "post_id": "yvgor9",
        "author": "Domesticated_Turtle",
        "title": "Guide: How to actually get good at leetcode",
        "url": "https://www.reddit.com/r/csMajors/comments/yvgor9/guide_how_to_actually_get_good_at_leetcode/",
        "score": 385,
        "num_comments": 84,
        "created_utc": 1668469714.0,
        "selftext": "So I've seen a lot of posts recently asking how to get good at leetcode. I see countless posts from beginners who don't know how to start and panic at not being able to solve easies despite taking a ds&a course. I see posts from those who have done 200+ questions but still can't reliably solve mediums on their own. As someone who recently went through the journey of going from zero DS&A knowledge to interview-ready in 4 months. I figured I'd write a step-by-step guide of what I did to help everyone out. This post is not intended to be a philosophical discussion on whether leetcode is appropriate for interviews, this will be an actionable guide with concrete steps that you can follow.\n\n**Who am I and why you should listen to me:**\n\nI have to preface this guide with my background so you can trust that I know what I'm talking about. I'm a recent mechanical engineering graduate from a Canadian university who self-studied computer science and web development and landed a software engineer role. Part of this self-study process involved learning DS&A and leetcode which took 4 months by studying 3-4 hours a day, 6 days a week. At the start of my journey, I couldn't even solve easies. After these 4 months, I'm now able to consistently (90% of problems) solve mediums in ~20 minutes and hards in ~35 minutes on my own. I also usually solve OAs (tiktok, SIG, IMC, blackrock, pure storage, c3 ai, cisco, tower research) with 100% test cases, and scored 822 on my one codesignal gca attempt (not the best, ran out of time debugging q3 lol). I've done 6 leetcode questions during onsite interviews and have optimally solved all of them. I'm not trying to flex, just trying to show that what I'm saying is credible.\n\n**My overall strategy:**\n\nAs a preface, the goal of this guide is to deeply understand the techniques needed to solve LC problems at an abstract level and implement your abstract solution quickly. My approach is based off how technical material is taught in university courses. What they do is teach a strategy/technique at an abstract level, walk through solving guided example problems using that strategy, have students practice through assignments and practice finals, then apply what you've learned on the actual exams. My overall approach to learning is breadth -> depth -> breadth. First learning what you’ll be learning (breadth), learning those specific topics with a full and deep understanding (depth), then tying the specific topics back into the big picture and how they relate to each other (breadth). I also write summary notes after I read through a topic, I find this lets me take all the information and form a generalized abstraction of the topic along with critical specifics, and if I’m able to write a page of well-structured notes using my own understanding of what I just learned then that means I understand the topic deeply. I also re-read these notes at the end of each of the 4 steps for spaced-repetition effects or when I need to jog my memory since re-reading my own written notes takes me back to the mental state I was in when I first wrote them.\n\n**Step 1: Learn Python (or Java or C++):**\n\nThe first step is to get familiar with your programming language of choice. I chose Python and recommend you do the same if you have time, but if you’re in a rush then just use whatever you’re familiar with as long as it’s acceptable in coding interviews (Python, Java, C++). Python is the least verbose language and most similar to plain pseudo code, and in a timed test every minute counts. It lets you spend less time on implementation and more time on figuring out the abstract algorithm which is where the bottleneck is for coding interviews. You need to be familiar with a language before you can learn DS&A so you can concurrently learn the language implementations of data structures and algorithms. To learn Python I just went through the W3 Schools’ guide on syntax and overall language specs (dynamic typing, garbage collection, etc.). The official docs are good as well but they have a lot of stuff that you don’t need for coding interviews. I also took notes on the syntax (6 pages). This step took me 10 hours split across 3 days.\n\n**Step 2: Learn DS&A:**\n\nWith DS&A you need to learn how each data structure and algorithm works deeply at an abstract level. For me this meant visualizing a gif of the algorithm in my head, learning the time space complexities of operations the DS/A supports and why they are what they are, learning how the DS/A handles edge cases, and writing an implementation in Python. The resource I used was the interactive ebook PythonDS3 by Runestone Academy. It’s full of word explanations, diagrams, and live code in an editor that you can play around with. It first explains each DS/A at an abstract level, then shows you the Python implementation. I would go through a page/sub-section, think about the concepts deeply and piece everything together in my head, then write a page of notes on that topic. As a preface, I used Tech Interview Handbook’s study plan to figure out which topics are important and I need to take notes on, and which are not which I would only read. I also used Tech Interview Handbook’s topic-by-topic cheatsheet to confirm time and space complexities and how the DS/A is used in problems. This step took me 6 weeks, and I tried to finish 1 subsection per day. Each subsection only takes 30 minutes to read, but I would reread, think deeply about what I read, google stuff I didn’t understand, sometimes watch a youtube video if I still didn’t understand it fully, and write my summary notes which all took about 3 hours per subsection.\n\n**Step 3: Learn Leetcode techniques/strategies (patterns):**\n\nSo here is the most important step that I see a lot of people get wrong. People tend to jump straight into practicing leetcode problems and end up having to do 300+ problems to get interview-ready. The issue with this is that LC problems are designed with particular established strategy in mind, and if you’re trying to learn the strategy from particular problems then that’s very inefficient. This would be like in calculus, trying to learn the chain rule, fundamental theorem, monotonic convergence by jumping into doing calculus practice finals, or in linear algebra, trying to learn matrix operations, finding eigenvalues, or SVD decomposition by jumping into doing linear algebra finals. You can clearly see how inefficient this approach is. Furthermore, many of these strategies came from breakthrough papers in computer science that took PhDs to come up with and have many pages of rigorous proof. Trying to come up with these strategies from scratch or induction from LC problems would require you to be a genius. Now you see why so many people get stuck at this step, they’re doing it completely wrong. The resource I used for this is Grokking the Coding Interview and Grokking Dynamic Programming by Design Gurus and Educative.io (no affiliations). These courses are paid but the information is truly worth the money, as it’s by far the best resource I’ve found for this step and the time and energy you’ll save compared to using other resources is well-worth it. If you really can’t afford it then I’ve heard good things about Leetcode Explore cards. There’s also a Hackernoon article on coding interview patterns that summarizes the patterns taught in Grokking, but they’re pretty succinct and don’t offer the depth of information that I think you need. You could pair that with the CSES Competitive Programmer's Handbook to pick out and learn the specific strategies covered by Grokking. I basically used this the same way as with DS&A. For each pattern, I read the primer, read the solutions to the first few problems, tried to solve a few of the later problems in my head abstractly (5-10 minutes of thinking) using the strategy taught in the first few problems, then read the remaining problems (each pattern has 5-14 example problems). Once I finished a pattern, I would piece together the information into an abstract strategy, the situations in which that strategy can be used, what makes the strategy more/less efficient compared to other options, common characteristics in problems where I should consider this strategy, along with its edge cases and time/space complexity, and write down my page of notes. This is probably the most difficult step of the whole plan as you’ll be flexing your brain for abstract thinking and logical reasoning. It'll likely be very difficult to think that hard but you’ll develop a very strong foundation for solving LC problems later so it’s well-worth the mental pain. I would try to aim for fully learning 1 strategy per day which took anywhere from 3-5 hours and there’s around 24 strategies total (Grokking the Coding Interview + Grokking Dynamic Programming). For dynamic programming, there’s a section in Grokking the Coding Interview but I found it confusing and it only contains 1 DP strategy, so I recommend skipping that one and once you’re done GTCI start Grokking Dynamic Programming which explains that strategy better and also has 5 more strategies.\n\n**Step 4: Practice**\n\nAt this step, you should know your Python syntax, understand DS&A, understand the ins and outs of each strategy and should be able to come up with the solution in your head to most LC easy’s in 5 minutes and mediums in 10 minutes. The point of this stage is to actually practice the full problem from prompt to code and practice talking out loud (or whisper if you need to be quiet) like you would in an interview. The resource I recommend is Grind 75 grouped by weeks with 70-100 questions total. Go through each question and try to solve it on leetcode. Don’t look at the solution until you’re stuck for 30 minutes, meaning you haven’t made any progress in your logic for 30 minutes, making logical reasoning steps in your head doesn’t count as being stuck. To actually solve a problem, read the prompt, visuals, examples, and input ranges. Start with a brute force and solve how you would do it intuitively, typically this means start on element 0 and perform steps until you reach a solution. Then make logical deductions based on what you’ve been given in the prompt and how your brute force looks (careful, the brute force might be a red herring to the actual optimized solution). Use your logical deductions and match onto a few potential strategies that you think have a high chance of working and investigate how each of those strategies could be used to solve the problem. Sometimes you'll need to combine strategies in series or parallel. If you can’t identify any, just try each of the 24 strategies one by one in your head, even if this fails it’s all good practice for your logical reasoning skills. You can think of the problem solving process as a graph traversal, where you have your starting state as one node and your goal state as another node. You can add strategies as edges onto your starting node to transform the starting state into a new state. Check if the new state is your goal, if not then add another strategy either onto your new state or your original state and repeat until you reach the goal. Once you have the optimal solution in your head, write down your algorithm in comments above the function in 2-4 lines along with the time and space complexity. Writing the algorithm down takes me a minute, but it saves me 5-10 minutes during my implementation as it lets me focus purely on implementing my algorithm into code by referring to the text when I get confused without having to think “what was my algorithm doing at this step again?”. Initially, you’ll probably be slow at implementing the algorithm in code and run into a bunch of Python syntax errors. I’ve spent hours debugging my code in single questions at the start, it’s normal and just use this to learn the quirks of Python. After implementing, I check over my code once for silly mistakes and then run through it with one of the example test cases line-by-line, keeping all the variables in my head (use comments if needed). Then I submit and fix my code if the submission failed. Once the submission passes I go look at the solution (either official or in the comments), try to find “easy-to-understand” and ignore the one liners. If I still don’t understand the algorithm I’ll watch the Neetcode video for it then try to implement it. After around 20 easy’s I started solving them (getting the first optimized code solution which may have syntax bugs) in 15 minutes. After the first 20 mediums I started solving them in 30 minutes. Hards are usually a combination of strategies and some (mostly greedy algorithms) you just need to memorize but there aren't too many and so I can usually solve them in 40 minutes right from my first hard unless I just don’t know the trick. I did 2-4 problems a day (2-5 hours daily) until I hit 50 problems and that was when I felt confident I could solve 80% of the problems on my own in a reasonable time and the remaining problems if I was given a hint or two which is more than interview-ready.\n\n**Bonus step: Maintain your skills:**\n\nGiven how common switching jobs is in SWE due to either increasing TC or layoffs/pip/firing, and how interviews in SWE are bottlenecked by LC problems, it makes sense to try to retain your knowledge such that you only need a week or two to prep the next time you interview. I’m planning on doing 1-2 LC problems per week on Sundays which I feel like after all this prep to build a strong foundation and deeply understand the material should be enough to retain my knowledge. My solving speed will probably drop, but I estimate next time I prep I’ll only need to review my notes and do 30 LC questions to get me interview-ready. This will probably only take 2 weeks time instead of months. 1-2 questions per week will only take 1-2 hours per week which is nothing for the reward you get by staying near interview-ready. I’ll have to try it out to see if this is enough, but it seems like it should be.\n\nAnd that's the end. If you made it this far, try implementing these steps and let me know how it goes. I hope you find similar success that I have found following these steps. If this guide has helped you in your journey and you want to support me, I'm always taking referrals (DM me). Happy learning!",
        "permalink": "/r/csMajors/comments/yvgor9/guide_how_to_actually_get_good_at_leetcode/",
        "comments": [
            "Step 1: show up everyday.\nStep 2: show up everyday no matter what.\nStep 3: stfu and show up everyday.\n\nOne day: leetChamp.",
            "Or, just do competitive programming",
            "this:\n> Trying to come up with these strategies from scratch or induction from LC problems would require you to be a genius.",
            "Link to above-mentioned Grind 75 - www.grind75.com",
            "I think it’s worth noting that people learn differently. I did in fact simply do like 50 questions from a variety of topics. I didn’t know about patters. You seem to be more academic about it, which is fine, but I don’t really think it’s a better or worse than just whatever you feel works best.\n\nThat said I think this is an excellent post and I’d be happy to help out although I’m not sure we’re hiring rn.",
            "Would you recommend cracking the coding interview at all?",
            "This is a very underrated post. This should be pinned. It is not only a strategy but an inspiration and gives a reader hope.\n\nAs a SWE with 6 years of experience, everyone can learn from this post.\n\nOP, it might be nice to get a schedule summary of how long you took at what steps without having to read through \n\nThanks again",
            "How’s the grokking thr coding interview course",
            "How long have you been programming for? \n\nI'm already decent at LeetCode, but I'm curious. I notice a lot of traditional engineers with little programming experience transition into software engineering with ease (assumably, having a strong logic background helps.) As someone who was majoring in chemical engineering, I can say that chemical engineering content was more rigorous than LeetCode.",
            "WOWOWOWOW!!! Thank you so much for this super-detailed guide. It's so helpful. As someone who is completely new to CS, I've been struggling with DS&A and wrapping my head around leetcode questions. I will def be trying this method out! :)",
            "Summary: just practice problems",
            "I appreciate the write up. Will definitely check these techniques out. Cheers!",
            "Can you please list down those 24 strategies?",
            "Step 1. be talented otherwise its over",
            "I have been here",
            "lot of text but basically just do your time to do the crime ?",
            "[deleted]",
            "Following",
            "..",
            "[deleted]",
            "Wow, thanks so much for laying all this out. I consider myself lucky being able to read about your journey and what it took to get you there. I’m on a very similar path, and look forward to implementing these steps. Thanks again!!",
            "Thanks for sharing this. I think an unmentioned side effect of a strategy like this is developing some seriously effective learning habits. Which it sounds like you got from school. Anyway, right up my alley - saving this post. Thanks again.",
            "Commenting as a bookmark",
            "Thx for this mannn",
            "If one doesn’t have any formal background in DS&A, would anyone recommend starting with a formal course before doing LC? For example the Princeton university Algos 1 & 2 courses on coursera?",
            "I'm surprised people forget about Cracking the Coding Interview. It's one of the original books that helped popularize the leetcode interview, and it's written in a really easy to understand way. The book refreshes all of the basics of DSA and algorithmic techniques needed.",
            "appreciate this perspective and am pretty convinced to switch from neetcode 150 to grokking. However, i've read that grokking is super similar to neetcode 150. could you explain the key differences between the two? i was hoping grokking contained more theory, like you had mentioned",
            ".",
            "Thanks for the great advice. As someone who hasn't done a serious DS&A course and went straight to Neetcode videos and patterns, I do feel like my problem-solving skills could be way better if I studied DS&A more. What other methods of learning does everybody implement?",
            "great post",
            "If you need motivation and live discussion, join [LeetCode The Hard Way](https://discord.com/invite/Nqm4jJcyBf)",
            "free leetcode ?",
            "..",
            "I have a question for you about the guide. I'm doing step 2 right now, and for the runestone textbook did you throroughly review and implement all the examples where the textbook talks about where the algorithm could be useful? For example, I'm in the stack section and there is a part talking about Converting Infix Expressions to Postfix Expressions which doesn't seem all that useful and is taking me lots of time to try and learn to implement it myself. Thanks for the help.",
            "Great man, great.",
            "Can I send a message regarding realistic cs career adv? recent college dropout",
            "appreciate this. will come back to this in a year and see if i've got any offers by then !!",
            "patterns like two pointers are fine, but it's completely useless unless you know how to implement the code to solve a particular problem, which means going through python tutor with a debugger and understanding solutions line by line and observing the variables and inputs. you may know that the trapping rain water question is a two pointer, but unless you understand the trick and exactly what the question is asking you to do and the syntax to implement it, knowing a pattern is not going to cut it by itself."
        ]
    },
    {
        "post_id": "qou0wf",
        "author": "fryingpannnnn",
        "title": "I got Facebook, Amazon & Coinbase intern offers! Here's my process and salary details",
        "url": "https://www.reddit.com/r/csMajors/comments/qou0wf/i_got_facebook_amazon_coinbase_intern_offers/",
        "score": 385,
        "num_comments": 60,
        "created_utc": 1636308163.0,
        "selftext": "**Facebook:**\n\n\\- 2 Interviews, 2 coding questions each.\n\n\\- 8423$ USD/month (NYC)\n\n\\- Free corporate housing\n\n\\- Other benefits such as relocation travel expense\n\n**Amazon:**\n\n\\- 2 online assessments + 1 live coding interview\n\n\\- 7508$ CAD/month (Vancouver, CAN)\n\n\\-  1875$ CAD/month relocation\n\n**Coinbase:**\n\n\\- 1 online assessment + 1 final front-end live coding interview\n\n\\- 50$ CAD/hr (remote, would be 50$/hr if you're in US)\n\n\\- Other benefits such as paying internet and small WFH lumpsum\n\n&#x200B;\n\nFor those of you that are curious, I detail my process more in this video: [https://youtu.be/JLEVJ1BLqKk](https://youtu.be/JLEVJ1BLqKk)\n\nHope y'all got the offers you wanted! I literally failed my exams for these lol.",
        "permalink": "/r/csMajors/comments/qou0wf/i_got_facebook_amazon_coinbase_intern_offers/",
        "comments": [
            "you're carrying the sub",
            "[deleted]",
            "Congrats man! Btw, is coinbase for next summer bc i can’t find their intern app?",
            "Congrats!",
            "Congrats! Would you be willing to share your resume?",
            "CONGRATS from Montreal!\n- student from the other university",
            "Nice to see another Canadian winning! Congrats!",
            "Congrats Pan! I just watched your video before opening reddit this is such a weird coincidence lol",
            "So are you doing coinbase and meta since coinbase is winter?",
            "[deleted]",
            "[deleted]",
            "Congrats brotha, could I ask how hard ur fb problems were and if u remember what they were?",
            "Congrats! I just did my first OA on Friday for Amazon (2022 New Grad in Canada). I don't mean to brag but it was so easy that I am nervous I did something wrong lol. How difficult were your Amazon OA leetcode questions? For me, first one was probably an easy, while the second one is probably an easy-ish medium. I finished them both with 45+ minutes to spare. I finished them both so quickly that I was scared that they would think I cheated, so I added a ton of comments in my code lol. Did I just get extremely lucky? I did not study for my midterms so that I could grind 50 leetcodes in 5 days, but now that I know the OA was gonna be so easy I kinda made the wrong decision...\n\nBut if everyone's OA is as easy as mine, then they're gonna still need to weed a ton of people out and the real filter is still ahead of me. Fuck",
            "Congrats!",
            "How many of the fb recent problems did you end up doing? You said you did 2 per day right. Did you do like 40?",
            "I love your channel! I'm on the internship hunt currently, this inspired me a fuck ton.",
            "congrats ! I would go with NYC",
            "Ur badass! I like ur channel",
            "congrats!",
            "Frying pan sign my man titties",
            "lol I just watched your video! I’m going to Facebook too but I’m at the Menlo Park location :(",
            "Teach me how you prepped for Facebook frying man?",
            "Congrats!! 🥳 I am so happy for you!! 😊",
            "Honestly... I'm so proud of you. Seeing this post first then when I opened reddit just made my day. It must have taken a lot of power and work to pull this. Good job fryingpan!!!!",
            "What did you do to prep for Amazon?",
            "Congrats. Can you elaborate a bit about your front end live coding for coinbase? Is it react? And what type of questions are typically asked? You dont have to be super specific if you don't want to, I am just a bit curious.",
            "how difficult were the questions on the fb interview btw? I have mine on Wednesday",
            "[deleted]",
            "Congrats! For Facebook did u also have a phone interview as well or only two video on-site?",
            "cyu in NYC lmao",
            "What did your resume look like?",
            "Hi pan. Do you know if Facebook is sponsoring J-1 visa for next summer swe intern in HS?",
            "I have an interview with Coinbase in an hour and a half for a front end internship.",
            "I want to hear more about the Coinbase process and how was it for in terms of difficulty compared to the others"
        ]
    },
    {
        "post_id": "qkl7d4",
        "author": "Plane-Tip-1267",
        "title": "When did the cs grind get so crazy competitive?",
        "url": "https://www.reddit.com/r/csMajors/comments/qkl7d4/when_did_the_cs_grind_get_so_crazy_competitive/",
        "score": 386,
        "num_comments": 101,
        "created_utc": 1635793711.0,
        "selftext": "Do you think that covid significantly increased the number of people that want to go into cs? Just 2 yrs ago when I was applying I don’t remember people doing things like lying about their grad date, creating fake startups to intern at, obsessing over getting internships freshman year, and so on all in order to “get ahead”. Maybe these things were going on all along but now they feel like common tactics/notions",
        "permalink": "/r/csMajors/comments/qkl7d4/when_did_the_cs_grind_get_so_crazy_competitive/",
        "comments": [
            "The number of CS Majors and popularity of SWE as a profession was growing significantly well before COVID.  So you have a vast army of overachievers choosing SWE instead of Finance/i-banking or premed.  So yeah, things have definitely gotten harder across the board and even for good non-tech companies as well.   For example, I heard from a senior eng interviewer that C1 five years ago was asking LC easy for New Grad and now I’m seeing on here that some C1 intern candidates are getting LC Hards?  Like wtf.",
            "are people unironically doing the fake startups thing lmao",
            "I have a lot of non-cs friends and they are asking me how to \"break into tech?\" so there is a lot of hype in software right now and tbh there has been a ton of hype since at least 2015. \n\nThe fact that [landing the first job as a junior sucks right now](https://www.notonlycode.org/nobody-hires-juniors/) but being a senior is heaven means there's a lot of \"fake it till you make it\" energy out there.",
            "Where are you reading this stuff?  You should be wary of your social media circles and their influence on your perspective.",
            "When there is a 0.1% of companies paying 200k to new grads.",
            "Don’t forget the practice of submitting fake resume/identities to try out hackerrank multiple times before actually doing it (:",
            "[deleted]",
            "How can lying about your grad date possibly work? In a background check, that seems easily verifiable",
            "It didn't, it's just the internet doing what it does best and magnifying a loud minority of people. In this case, all the nerds at top schools are playing games trying to get hired by big tech when in reality the prospects of the software industry are very good in pretty much any city or company. Seriously, if you \"grind\" leetcode all day just to get a chance at a big tech company, be careful what you wish for because it is not the promised land.\n\nThen of course we have more and more people getting into the field because they heard it was a gold rush. If you're doing CS just for the money that is risky. Meanwhile, regular companies fight over \"senior\" devs on LinkedIn. So I'd say it's both a new glut of devs while companies refuse to settle for the average dev. Anyway, as long as you don't browse CS subreddits and communities I believe your life will be much better because you won't be worried about keeping up with the Johnsons at Facebook (or Google, or MS, or whatever). It's just not worth the stress and most big tech companies are toxic anyway.",
            "It is a very small subset",
            "I've never touched leetcode. I have applied for three jobs in my life, and got into two of them (both as a software engineer).\n\nBeing good at coding problems does not make you a good software engineer. Teamwork, organisation, knowing your tooling, and knowing how to keep a maintainable code base are also very important.\n\nMost people here seem to forget this and it is a small group of people that seem to obsess over this kind of stuff, or want to work in very specific places, who give this view to everyone else.\n\nJust know your stuff, be confident in making good decisions (not cocky), and show you have an ability to adapt and learn, and what will be will be. Every interview I did I went in with that mindset. It is about the job wanting what I can provide them, as much as it is what they can provide me. \n\nFor the rest of it, just ignore scaremongering from competitive behaviour. Just be the the best you can be and you will be fine.\n\nLet's face this. Anyone who disagrees with this either works in a niche role, one of the \"big tech\" companies that is competitive, or just doesn't know what the majority of businesses are looking for in developers.\n\nTL;DR don't let what others say spread FUD and make you nervous. Just concentrate on being a good well-rounded candidate and what will be will be. If anything, concentrating on stuff like Leetcode only just does you less favours if you don't show you have other skills that you can utilize your knowledge with.",
            "People are doing this? I’ve never heard of any of that except maybe obsessing over freshman internships",
            "My current internship had to do a background check and confirmed that my previous job I Acrually worked at Bestbuy 😂\n\nHope those using fake experience get caught bro",
            "since 2017 or so...\n\nIt's even more insane now.",
            "Everyone and their grandmother is a computer science undergraduate these days.\n\nIt's overpopulated and the grind will get worse for the most part",
            "It’s competitive? I’ve never felt much competition in the field. It feels like if anything it’s a fairly collaborative field",
            "I know a group of people in highschool who made a fake startup to get into elite colleges...so I'm not really surprised. It's sad.\n\nGuess the rat race never stops.",
            "👽",
            "4 years ago when everyone was saying to go into tech for the money. Now everyone and their sister has had time to get into school and start job hunting and the market is flooded.",
            "Fake startup?? 🦧🦧🤣🤣🤣🤣🤣\nGod these kids must be so desperate.",
            "[deleted]",
            "This is actually true, I am an architectural engineer and I keep getting calls from recruiters on LinkedIn coz there are not enough people to do the work 😅\n\nSuper easy work tbh, my current gig with a F500 has   great perks, wlb,  and I get paid a ton. \n\nI mean, tech is where it’s at- no doubt about that, but all the overachievers kinda not giving the other Career tracks the time of their day has led to a pretty nice buyers market for everybody else who is is not a SWE.\n\nMy friends who are like fresh out of grad courses in CS are really having to break their backs to get a leg in, while ppl in my line of work have no trouble getting the offers.",
            "That fake startup sounds like the shell company scheme.",
            "This is the first I’ve heard of any of those things, wth?",
            "The term 'getting ahead' is quite ironic in that context because they are stunting their growth if anything.\n\nNonetheless anything is competitive life is competitive, we realize that now because we growing up.",
            "covid? you think covid is the reason? \n\nI called this years ago. \n\nwe live in a world of kids who refuse to leave their computers. \n\n\nthe entire \"internet\" culture works in computer science in one area or another. \n\nthe discord communities, the gaming communities, furries (lmao not even joking, most furries work in computer science) \n\nif you're in an online community involving sitting at your desk all day: you'll probably choose CS major. \n\n\nI for one, really dislike the trends lately, how sensitive game devs have gotten, how wimpy everyone is now. \n\n\nI quit computer science in favor of fitness training, \n\n\nyou'll be hiring me to solve your back problems from sitting at your computer all day."
        ]
    },
    {
        "post_id": "pzixgx",
        "author": "oompahoompa1939",
        "title": "I JUST GOT INTO FBU",
        "url": "https://www.reddit.com/r/csMajors/comments/pzixgx/i_just_got_into_fbu/",
        "score": 385,
        "num_comments": 150,
        "created_utc": 1633128203.0,
        "selftext": "I know it's a fresh/soph program but I'm just so excited !!\n\nEdit: for those interested in seeing resume it's nothing impressive but it got the job done and thank you all for the kind words :)\nhttp://imgur.com/gallery/qyCvrAz",
        "permalink": "/r/csMajors/comments/pzixgx/i_just_got_into_fbu/",
        "comments": [
            "I remember your post last year about being new to CS and wondering where to start. Major congratulations!!",
            "Congrats!!",
            "Congratulations! What was ur CodeSignal score and how long did it take for them to get back to you?",
            "Football University congrats!!",
            "Bright career ahead!",
            "Mind if I ask what projects you have on your resume? Also congrats that’s really really awesome",
            "AAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHH",
            "Damn  congrats, I just did my final interview for fbu yesterday. Wish me luck and could I pm u?",
            "Congratulations! I've got my final interview next week. Any tips?",
            "Congrats! DM me if you've got questions - was a SWE there back in the day, and also mentored some SWE interns!",
            "Damn congrats",
            "Congrats! What was the timeline of when you applied, got the OA, and got the interview?",
            "Congrats man!! You deserve it. I’ve applied myself and am waiting to here what they have to say :)",
            "What is FBU?",
            "Congratulations!!",
            "CONGRAATS, I had my behavioral interview on Wednesday, hope to hear back soon. When did you have yours?",
            "Congratz man!",
            "Congrats!! 🎉🥳 How was the code path interview prep? Do you recommend it?",
            "How many interviews did you have?",
            "Congrats! I hope I’ll be able to get in too during my sophomore year 😎",
            "Congrats!",
            "Are you a freshman or a sophomore",
            "that’s amazing congratulations!!!!",
            "i never got my online assessment, what should i do?",
            "Awesome!! Congratulations! how was the behavioral part?",
            "Congrats!!! Quick question for your projects when did you complete them? Months or a year before applying or were they more recent?",
            "[deleted]",
            "Ayyy congrats! Please how did long did your final interview last?",
            "Wow congratulations! Btw, are you a US student or international?",
            "Congrats! Hope that I can get into this program next year (even though I have applied FU this year as a freshman, I don’t think I will be accepted)",
            "[deleted]",
            "[deleted]",
            "BROOOOO CONGRATTSSSS!!!!!",
            "Amazing stuff brother. Proud of you",
            "Hey can you send me your profile / resume. Congrats.",
            "I didn’t even get a code signal lol, congrats!",
            "[deleted]",
            "Nice job!!!!!!",
            "Happy for you! GL at Facebook:)",
            "[deleted]",
            "Congrats! 👍",
            "Congratulations!!! Ugh I hope I hear back AHHHH",
            "Everyone on this: do we have any idea how long after the code signal do they reject you or move on (or is it just a ghosting situation)? OR is it variable",
            "Happy for u :)",
            "Congrats, and welcome!",
            "buen trabajo, y tenga alegria cuando trabajas con Facebook",
            "This is a joke right lmao",
            "Damn, congrats man! Really happy for you! I'm still waiting on the response with 1156 since 23rd lol",
            "Which university do you go to? Are you a minority?",
            "Freshman or sophomore?",
            "Did the codepath course help you a lot? I'm taking it right know and its a bit slow (Im in week 3).  Any tips to get the most out of the course.",
            "Does FBU hire students at community college?",
            "Did your recruiter call you or email you first?",
            "are u a fresh or soph?",
            "i just got the work auth form. after u got that did u reach out to ur recruiter to schedule an interview? im a bit confused",
            "If you don’t mind me asking, what is your demographic?"
        ]
    },
    {
        "post_id": "kjkd71",
        "author": "MelodicExchange",
        "title": "i am the imposter",
        "url": "https://www.reddit.com/r/csMajors/comments/kjkd71/i_am_the_imposter/",
        "score": 390,
        "num_comments": 61,
        "created_utc": 1608835106.0,
        "selftext": "EDIT: thanks so much for all the support and advice! i had no idea my situation was so common, i forget that people really only share successes and not their shortcomings. i had some fruit and drank some water and read all the nice comments and i feel a lot better, again thanks so much for the support!\n\ni just graduated from a big 10 school like a week and a half ago with no job offer and no internship experience. i've been applying to like 5 jobs a day and a recruiter reached out to me on linkedin for a contract for a big shipping company that seemed like a sure thing until i took the hackerrank which i bombed spectacularly.\n\ni'm 26, it took me 8 years to get through undergrad. i failed out of mechanical engineering and the university twice because of struggles with bipolar disorder, BPD, ADHD, and addiction. because of that my overall gpa is poo and i didn't make a ton of friends or connections in CS and my last chance to do so got rona'd. my cs education has been so spotty and spread out over the years that i just feel like i don't know how to program.\n\nmy last semester i stayed clean the whole time and ended up getting a 3.5 gpa in like the hardest classes i've ever taken, but that gave me zero time to grind leetcode or read the crack book. i look at all these 20yr olds that have internships at FAANG companies and feel like i can't compete at all.\n\ntl;dr the imposter syndrome is kicking my ass and i'm starting to worry it's not imposter syndrome and i just suck. i cried after that hackerrank. sorry for rambling, looking for advice or encouragement",
        "permalink": "/r/csMajors/comments/kjkd71/i_am_the_imposter/",
        "comments": [
            "[](/awkwardhug) Comparing yourself to younger folks is the easiest path to feeling like shit. You (and I, and many others) will *never* be like that one 12 year old who went to Georgia Tech.    \n    \nBut look at yourself compared to before. You went from failing out of college to graduating with a degree in your hand. Take a step back and give yourself some credit for that.    \n    \nGetting a CS job seems to be mostly down to learning Data Structures and Algorithms, at least for entry level jobs and internships. You can learn it - it might just take more time for you than it does for others.    \n    \nKeep moving forward.",
            "I'll be 24 by the time I graduate next year. It will have taken me 7 years to get my degree. I changed colleges and majors more often than some people change their underwear. My GPA is phenomenally bad (like 2.5ish?). I didn't work a day in my life until 3 months ago. \n\nDespite all of this I just got a new grad offer from Microsoft. If a loser like me can do it, you can too. Don't be so hard on yourself. Sure, we won't be those 4x internship at FAANG 20 year olds but that doesn't mean we're not worthy of a job. You got this. :)",
            "Hang in there bud, I’m with ya.",
            "Been sober for 4 years. I had to go part time to balance sobriety and school and work and relationships. I am 27. No path is the same and comparing yourself with people who never have gone through what you have isn’t fair to you.",
            "Hi there!  I just wanted to let you know that you’re not alone.  I too just finished my undergrad in CS at 26, having spent the past eight years learning to manage my mental illness while trying to get my degree.  My transcripts are a MESS.  But we didn’t give up!  I have bad days too, but I think our perseverance will get us to where we want to be.  :)",
            "I graduated at 27, and took a year to find any employment whatsoever, and when I did my mentor was 23 and taught me bad practices, and I haven't been able to find good employment in the 8 years since. But it pays the bills and I'm doing alright. You will be too, soon enough.",
            "Takes a lot to post this. I applaud you for that, stay positive and keep grinding. Ride your own wave, don’t compare yourself to others. You fucking got this dude!",
            "I just graduated too like you. I’m 29, my only “experience” is a Java summer camp instructor. Took me 11 years of school but now I’m here. Keep your head up. We’ll get there.",
            "Dude, I’m in almost the exact same boat as you! \n\nGot my shit together too late and been scrambling to prove my worth to companies. The thing is, you and I are worthy, we’ve gone through our trials by fire and the fact we recognize our failures means we know what we need to do to succeed. All we have to do now, is work work work to overcome the lead we lost. You’ve got a lot of hard work in front of you, but knowing the game plan and being willing to finish that game plan is 90% of the battle. \n\nMaking 100k salary at the age of 21 vs making 100k salary at the age of 26 is almost laughably small in the grand scheme of things. You’re still in the game, you got this.\n\nAnd hey, if you and I are both imposters, what are the chances that you and I are unique in this world? Or maybe we realize that the world has more “imposters”than we may think.\n\nThe only true imposters have left the industry before they’ve even had a taste of it. These are the people who “couldn’t hack it”. If you’re surviving in the industry, I doubt you can truly be an imposter.",
            "Hey man, hang in there. \nYou got this, don't compare yourself to others. They haven't lived what you have, you can do this, i promise you!",
            "I'm in a very very similar situation to you. It's oddly comforting to know that I'm not the only one. I hope it gives you some relief knowing how many others feel the same way.",
            "I think its easy to feel this way when so many youngsters who are succeeding are gloating in this sub.",
            "do the blind 75. there are enough resources online for you to come out more capable than your average CS grad. You're chillin', just grind!!!1",
            "Compare your progress against yourself. You’ve clearly come a long way and should be proud of yourself rather than comparing to those people.",
            "Hey man I know I’m pretty late to this party but I know how u feel. I’ve done my share of drugs and partying and have been to 6 colleges to where I was just part time and school wasn’t a focus it was just to be in school I guess. I wasted so much time and money but corona gave me the opportunity to finish school full time I went from a 2.56( it was probably even lower than this but yeah ) to 3.06 I had all a- and a’s last semester and straight a’s this semester. I still have 7 units left but I’ll be 29 in March. At the end of the day don’t regret your past cause you’ve probably learned a ton from it but now focus on your future. I too feel the imposter syndrome but I’ve taken my stride to cut out gaming partying all that and replace it with practicing coding. I feel like I’m ready at this point and if you put in those little things for comfort you’ll be ready. Best of luck fam you’re gonna make it 🤙🏼🤙🏼",
            "I’m really proud of what you’ve been able to accomplish! It wasn’t an easy road for you but you stuck with it, and didn’t give up till you were done. Be proud of that. And just like you finished school, I’m sure you’re going to put in the effort and find a job as well. Can’t wait to see your post when you do get it :)",
            "you aren't alone friend.  I grad in 2021 in cs and I feel like Impostor Syndrome has a strong grip on my soul",
            "I was in the same situation with applying for internship last min with Goldman's Sachs in November. I applied with my CV and filled all my details but didn't complete the hackerrank challenge because I sucked. \n\n I think the imposter syndrome goes away with competence which I didn't have. I learned programing just to complete my assignments and didn't see the big picture outside university which Im realising on my last year. \n\nI think next year is going to suck for both of us but hopefully the years after will start sucks less and less  as we start being more competent in our work. Wish you a Merry Christmas and Happy New Year.",
            "You're no sus. Youre the real deal.",
            "CS isnt the only path to success, try exploring some other options if you are so inclined",
            "[removed]"
        ]
    },
    {
        "post_id": "ixwzx3",
        "author": "Kkmfy",
        "title": "How do cs majors handle classes, internships, and projects on the side???",
        "url": "https://www.reddit.com/r/csMajors/comments/ixwzx3/how_do_cs_majors_handle_classes_internships_and/",
        "score": 382,
        "num_comments": 129,
        "created_utc": 1600810942.0,
        "selftext": "This is gonna be kind of a rant because I don't understand how people do it. I'm currently a junior and I feel like everything is kicking my ass right now.\n\n* We have to attend our difficult CS classes, get good grades to main our GPA\n* Do extracurriculars (if you're doing them) to show leadership and involvement,\n* Apply to internships, practice for coding interviews and then actually attend the interview-\n* Know what we want to do in the field (front-end, backend, web dev, app dev)\n* edit: also part time jobs\n\nhow do people live knowing that they have to do all of this during a peak recruitment season?? someone tell me your magic secret to living a balanced life as a cs major pls.\n\nedit: damn- it seems split where some have it together and the other is just no-sleep and Adderall\n\nedit2: Thank you for the responses. A lot of amazing answers in the comments!! please give everyone a good read if you're visiting this post for the first/repeated time!",
        "permalink": "/r/csMajors/comments/ixwzx3/how_do_cs_majors_handle_classes_internships_and/",
        "comments": [
            "I don't. I'm gonna have a mental breakdown lmao",
            "No social life lol",
            "Utilize your spring, summer, and winter breaks.",
            "I haven't taken a DS+A course yet, so I have to grind tf outta leetcode to pass interviews, my grades are honestly going to 0 rn lol, but at least I'm getting offers I guess",
            "The trick is to live and hangout with people who also do the same. That way it doesn’t seem like a chore since you can do all that while hanging out with your friends. If all your friends are studying Gender Studies, then it will sure sack when you constantly have to miss plans with them and it will make you feel like you have no life.",
            "I divide my obligations into daily goals and aim to reach those goals everyday. Time management is going to be key.",
            "You can't do that and live a balanced life, you either worship programming and live for the code or live a normal life and end up at a normal company(which's totally fine and I think the best choice)",
            "this spoke volumes to me. i feel that everyday. not to mention that what we learn from school often times isn’t enough for an internship, so like you said, we have to code on the side. But code what? Side projects. and for me specifically sometimes i don’t know what to build. sometimes i try to build something but i have a lot of trouble and end up failing at it. i think to myself i’m an incompetent programmer. everyone around me seems to be excelling. so, if anyone is reading this and has advice for me. please lmk. sometimes i feel lost and overwhelmed too i’m glad i wasn’t the only one feeling this way",
            "Before I say anything I just want to note that **everyone can handle different things** and I think as long as you're trying your best while also pushing yourself to improve then you're doing a good job.\n\nFor me (I'm a junior as well but I'm currently on a gap year to work), I feel like I can balance my life relatively well (AT MOST TIMES- there are times where I do give myself too much). During the school year I was able to TA, work part time doing CS stuff, train for sports, and study for my classes (I used to do research too but then I realized it was too much work, it was unpaid since it was for class credit, and I felt like my PI basically just viewed me as free labor). I don't have a perfect system for all the things that I do, but I do feel like each semester I can handle them better and better and have lots of time left to still relax using time management and laser focus (I disabled notifications on my phone except calls and text so I see nothing from Discord, Messenger, Reddit, etc... so I can focus on the work that I'm doing).  Part of it for me was a lot of trial and error to figure out what works for me, and I can recognize if something isn't working fast enough and I try to change it as soon as possible.\n\nTo get good grades, I take really good notes and study everyday. If I don't get a topic, I study a bit after class to make sure I do get it. I do not hold it off until closer to the exam. That way, when the exam comes around all I need to do is go over my quizlet/study guides.\n\nI DO NOT grind Leetcode to practice for coding interviews (though I will look at some problems from time to time if someone tells me about an interesting one- I'd say I've done \\~20 leetcode problems in the entirety of college).  I've been able to still get internships without grinding Leetcode, but just because I did not grind Leetcode doesn't mean I wasn't preparing in other ways. I feel like being a TA really helped with my problem solving and explanation skills and working a part-time CS internship helped me become a better programmer. Grinding Leetcode could work, but I highly suggest looking into alternatives that are a better use of your time and could make you a stronger problem solver\n\nApplying to internships and interviewing was something that I'm definitely still figuring out to balance but I have a much better hold of than before. During my sophomore year last year, I pushed myself too much and took every opportunity that I could find and ended up doing 11 interviews in the span of 2 days during a conference which I completely passed out from afterwards in the hallway of the conference building (leaning against a wall). This year though I have a much better handle of my time and scheduling interviews by spacing them out enough. I scheduled high priority interviews first so once I got the job from one of them I cancelled the rest of my interviews to not stress myself out (for some people, scheduling high priority interviews last works better for them because they want to use other interviews as practice/have more time to practice. Everyone has their own thing that works for them).\n\nAs for knowing what I want to do in CS, I'm still exploring :) and I think that's totally fine. In fact, I think I'll still be exploring even after I graduate.\n\nSorry for the really really long write up! I don't think you should copy what works well for me since something else could work well for you instead, though I do hope it gives some guidance. If you have any questions feel free to ask!",
            "You just need to have a personality that likes the work and the challenge. Like others have said finding friends or people you like to work with will really help you out",
            "1) set your expectations insanely high. \n2) let the anxiety of falling behind keep you grinding all day every day every week. \n3) fall short of expectations, spiral into depression, promise to do better next time. \n4) go to step 1)",
            "[removed]",
            "I feel ya. 21 credits, a lab research position, research fellowship, and aerospace research position. I've got hockey to keep me sane.",
            "I think other people mentioned this but for me, it’s having friends who are also in CS. I’ll go over to their place, we’ll get work done, talk about where we are at with internship applications, and then take a break to have dinner or something. It keeps you focused but you’re with your friends so it’s also fun and you don’t feel like a total hermit.",
            "Uh you forgot to add work part-time in there. Oh wait you slackin'?",
            "Preparation.\n\nNormally I do side projects during the breaks and then I take classes that relate to my projects, so when I take BackEnd engineering class it becomes quite easy after already having deployed some full stack projects. Also, I do most of my interview prep during the breaks and during the semester I’m just doing reviews to stay sharp.",
            "you have to figure out what sections of your life. are more worth it to you.i’ve consistently had internships or research 20-40 hr/week, work on side projects, and run a student organization. \n\nfor me personally, this is what works for me, your priorities might be different. I sleep 6 hours instead 8. I aim for B+’s in classes instead of A’s at an already demanding school (from experience, i’ve learned that GPA matters a lot less than actual experience in our field, unless you’re going to grad school). I stopped playing video games and being on social media so that I still have time physically socialize.",
            "1. I did not handle it\n2. I cried \n3. I didn’t get the best grades\n4. I failed most internship interviews \n5. I didn’t sleep much \n6. I didn’t have the best social life",
            "I double u/BigMoneyYolo that time management is key. But also you will need to pick and choose your battles when things get overwhelming a.k.a learning when to make certain sacrifices as you go, and prioritize what's most important.",
            "Everybody's different, but here's what worked for me:\n\nFirst, take a deep breath and remember that unless you're not going to be satisfied with anything but a FAANG/unicorn job, you don't need to be hyperfocused on making yourself as hireable as possible all the time.  That's not to say you shouldn't still try for those jobs, but there are plenty of places you can get a respectable, well-paying job if you haven't been leetcode grinding.  And remember that even though it certainly doesn't feel like it, there's a lot of time left to find opportunities before you graduate. \n\nFigure out what your priorities are and manage your time accordingly.  For me that was (in general) school > work > having a social life > a research project I was working on > a club I was active in > interview prep.  I felt comfortable not spending as much effort on interview prep because I was lucky enough to have a part time job that I felt fairly confident would give me an offer when I graduated and I had already decided that even though I was going to apply for FAANG, I was OK with not ending up there.  I really recommend making sure you do what you can to carve out at least some time each week to spend with friends and decompress, because it will make you a lot more productive the rest of the time.",
            "I’m very much in the same boat, especially this semester. I’m trying to finish my BS and masters in 4 years, so I’ve continuously been taking more courses to finish earlier too.\n\n- I front loaded a lot of my harder courses earlier on in my degree. DS&A classes were done sophomore year, stuff like stats and numerical methods I finished off freshman year, this year I’m finishing my BS requirements with just electives, so I can kinda pick the difficulty of my semester\n- My only extracurricular involvement this year is TAing an algorithms class for around 10 hours a week. In past years and semesters I tried research, I was in a club or two. My social involvement is mostly meeting other people in the same boat as me and collectively bitching about life \n- Applying for internships is honestly like another class. I take one day a week and spend all my time applying to as many places I can find, doing CTCI problems, etc. This summer, I was interning at a large post-IPO startup (~1500 employees), spent my evenings after dinner doing hackerrank and leetcode problems to the best of my ability. My interviewing skills aren’t amazing but they also aren’t horrible, I can solve most problems an interviewer puts in front of me given the time, and I can explain what I’m doing when I’m doing it, the question is will the stress get to me\n- No clue what I actually want to do, I’ll probably end up applying for and getting a backend role because that’s what I have experience in\n- I don’t really have projects beyond what I did at internships or clubs, and that has been mostly fine (I have like 1-2 projects listed on my resume that are pretty small, maybe 1-2 weeks of work total)\n\nMost of all, it’s time management. If you’re trying to do all of this in the recruiting semester you’ll get burned out, but if you plan around it (work on projects over winter and spring break, the summer, do leetcode over breaks, prep for classes over breaks) it makes life easier. \n\n\nI have ~5 technical rounds in the upcoming week and a half, I get 8 hours of sleep a night religiously, and work enough to pay my own rent (albeit in a relatively cheap university town). It’s possible to do well even though the recruiting process is difficult, just gotta plan around it I guess",
            "Not great. I'm doing 18 credit hours, working 2 part time jobs on campus as a TA and research assistant and I'm the president of a club. Time management is extremely important but I don't think my current schedule is sustainable. Even though I'm getting a lot of experience and it's good resume, it's not good for my mental health. At some point being proactive and a diligent student turns into you stretching yourself too thin, which is what I've done. And I urge you to please take it easy unless you are prepared to go through the meat grinder of academia and life.",
            "It's a big lesson but time management. \n\nIf you have a chapter due by the end of the week, break it down into 7 sections with notes. \n\nIf you have a coding project for a class that's due in a week or two, work on it a little each day. \n\nAnd most importantly, don't overwhelm yourself. There will be days you need to push a bit more and you'll be tired at the end, but take some time for yourself too. Know your limits, push past them a little if you can, and then take a break. \n\nLao Tzu: \"Fill your bowl to the brim\nand it will spill.\nKeep sharpening your knife\nand it will blunt.\nChase after money and security\nand your heart will never unclench.\nCare about people's approval\nand you will be their prisoner. **Do your work, then step back.\nThe only path to serenity.** ”\n\n It's tough man, but take evaluation, push your limits (but not to exhaustion).",
            "I never did purely personal projects, which helped. Instead I did a little extra work on and refined class projects, ensuring I could talk intelligently and in depth about them in an interview. I also wasn't afraid to list and use the projects I did during my internship, where I was lucky enough to get \"real\" work instead of the typical (stupid) intern busywork.\n\n\nAlso, once I got an internship for the summer after junior year, that WAS my part time job, and it got extended pretty much indefinitely, which also helped. The internship really solidified my sense of what I want to ultimately do in CS (oddly enough, I want to be a product manager eventually, not a coder!).\n\n\nAnd even with all that, extracurriculars were a no-go for me, since it was either that stuff or spend time with my wife. ¯\\\\\\_(ツ)_\\/¯",
            "i dont. thought i could. can't.",
            "Try red bull instead of sleeping",
            "I didnt. Studies were hard enough to keep me busy and I did not want to overload myself",
            "I'm working two jobs and doing my degree and I'm barely holding it together. Idk how people are doing other things too",
            "I wana know too, do they even sleep?",
            "I personally don't. I try to, but realistically I just did one at a time (focused on all class, then all internships, then if I was unemployed and not doing internships, id be working on side projects/leetcode).",
            "Definitely makes you wonder what or who is this is all for",
            "Strategic neglect.",
            "With the first two they can kind of fuel each other. There are meet up groups that can help to interact with others and help you ask questions to people of different skill levels.\n\nFor me I was married with a kid when I started learning CS, that being said I only got an AS and got lucky with an internship while working full time. \n\nIt’s a grueling process and you really need to figure out time management. \n\nOne thing I didn’t do well was find time for myself to “make myself whole again”. I paid for that for nearly a year and half with a mild generalized anxiety disorder.\n\nMy suggestion is that if you’re young, hell even if you’re older don’t try to cram everything in, prioritize what you can and do the rest later. This in and of itself is great practice for the real world when you do get a job. \n\nAn additional note is that I would suggest learning how to articulate your problem solving process, this can really help to make or break your interviewing process as well.",
            "i don't. have been handling the college/grades part decently. but in terms of career/internships, have been really slacking off. imma just hope for the best in terms of job prospects.",
            "Managing and maintaining productivity is key. Read \"Getting this Done,\" highly recommend.",
            "I am handling classes now. If I get a internship at FAANG I can accept a C on a class.",
            "It might be better to explain your thoughts on these points and what you've been currently doing so far. What do you think is currently not working for you and why? You already recognize that everyone has their own tactics that work for them but might not work for you. It sounds like you're feeling overwhelmed and hoping to find this magic secret which the thought itself can be very damaging to your approach to making it in this industry.\n\nWith that being said, here are my takes:\n\npoint 1: Ideally class should be review so having to attend class can be optional. I wouldn't focus on good grades solely just make sure you have time for things outside class (extracirriculars/internships/projects/whatever) like others have said get a timer and just run it and when its done mark it down and move on. Work with people who want to get their shit done they may not be your best friends but working with others can be very influential with regards to your own development.\n\npoint 2: I wouldn't focus on this too much, if it fits your schedule then do it otherwise this could be time spent on relaxing/hobbies\n\npoint 3: If you've been networking then this doesn't seem much of a drag. If you do know you're applying to a company that does coding interviews you better be practicing. \n\npoint 4: Since you're in undergrad what I've noticed is that most if not all job positions aren't that specific to your day to day activities, whats more important imo is that you focus on expanding on our skill set and not on fufilling the hard requirements. You can't really know this without actually being in the company but its something that was pretty shocking to me.\n\npoint 5: I mean this isn't that hard to discuss other than if you're budgeting is in the red then if anything you can learn how to budget and ensuring you have some rough number of your disposable income. Gives you lots of freedom to spend on whatever the hell you want.",
            "What I do is leave school work for weekdays and personal work for weekends.",
            "If you are sleeping, you are already falling behind",
            "All that + part time jobs are super challenging, especially if you’re working 2 pt jobs....",
            "Currently working and going to school full time and I'm asking myself the same thing.... Idk how sustainable this is",
            "I'm currently taking 17 credit hour, doing a part-time internship (\\~25 hours), am an officer for 2 clubs, and currently interviewing for next summer. The only reason I can keep this up is because everything's online so its extremely easy to switch from class to work to clubs. I've also become a lot less social, which is bad but more time to *grind*.\n\nMy \"secret magic\" is getting used to 6 hours of sleep, choosing profs that are easy, using Google Calendar for everything, and managing my time down to 15 min blocks. I also drink a lot of coffee lol. Its worked well for me, *not to flex* but I have 2 F500 offers for next summer as a sophomore. \n\nFor clubs and work (or any other obligation where you have to work with other people) communication is also key. The earlier you can communicate potential time conflicts the better. \n\nNegatives about my \"lifestyle\": I don't exercise as much as I would like but I've been working on it. Also, whenever I don't write down something I need to do or schedule out time on my calendar, it doesn't get done.",
            "I put literally everything on my calendar and try my best to stick to it, including blocked out times for studying and Leetcode. Currently taking 18 credits of all major classes (double major), on exec board of 2 orgs, have a part-time job, and also have 6 interviews by next Friday",
            "In undergrad, preface I was a physics major taking CS classes. I mostly worked on side projects before junior year. Had a bit more time to go to hackathons and try out different fields (mobile, web, etc). I didn't really do side projects after that. If a lecture wasn't mandatory, I stopped going after a while without fail before the halfway point, felt it was a better use of my time to figure things out by myself than half ass going to lecture not really gaining much from it. Junior/senior year I had return offers for internship/fulltime so I only really did leetcode august/september (helped with getting different internship junior year), september was a brutal month with classes and leetcode but it's the only one I was really powering through. Right now working full time and grad school part time, in all of this exercising and sleeping good most of the time has helped, as I was relatively healthy by the end of undergrad in terms of what I could do.",
            "Senior here about to graduate. I feel this everyday as well. My philosophy is to grind out what I have to ASAP (school assignments, making a resume, linkedin) then work things that are most impactful for my resume and getting a job (making myself a website in React, building projects with relevant tech). It’s tough and a lot of work and time. At the end of the day, work on impactful things. Look at public job postings and see what tech companies use and make a project you can enjoy building with it. Time flies when you’re in the thick of it, but damn have I learned a lot and still feel behind. I try to truly identify what is and isn’t worth my time based on what I think an employer would want to see.\n\nI still don’t quite know what direction I want to go in, but I’ve tried many different things (mobile apps, full stack, embedded). You should try to dip your toes in many different areas and see how you feel",
            "I am in second year. This year I am working on 1/2 side projects and doing 1/2 LC every week and working on making a good enough resume.  I plan to start to looking for internships from junior/third year.. Thats my plan. I can't handle all of this stuff at the same time..",
            "It is overwhelming when you take everything into account but it makes it easier when you have connections.\n\nI joined a professional organization, SHPE, during my first year. I didn't know what SWE fields I was interested in so I took online courses in android, iOS, and web development through CodePath. I connected with other CS students, alumni, and tech companies through SHPE and connected with Lyft in the spring of freshman year. During the summer after my freshman year, I worked on a personal website with HTML, CSS, and vanilla JS, nothing crazy. Used that and LC to get an offer from Lyft. I don't consider myself the best coder, I struggled at Lyft, but I have the connections and the ability to forge new connections that have helped me get to where I am. I ran for a board position for the club I was in and am now in my second term connecting with companies that want to partner with my club expanding my network into industries outside of tech.\n\nThe way I see it, you can get the experience necessary for internships through LC and your classes but having the right connections make things so much easier. Once you make the right connections, opportunities will come to you.",
            "RemindMe! 10 hour",
            "I'm a junior CS major at Georgia Tech taking 5 classes, carrying a 3.70 GPA, have multiple personal projects (apps), interned at a FAANG company last summer (virtually), workout consistently, and have a girlfriend and a social life. I think how I do it sometimes too, and my friends ask me it all the time. Am I smart? Far from it. Some of the kids that go here are insane - like Elon Musk Albert Einstein level intelligence. But do I work hard? Hell yeah.\n\nNo day is the exact same for me it's not like I can walk you through my day but what I can give you is advice. Advice I wish I had in high school and when I entered college.\n\nThe thing is, you will always find time for stuff you care about. Sometimes I can't get myself to Leetcode because I feel too busy, then when I get an interview I'm able to get in a couple of hours of leetcode a week, why now? because i care about it more now\n\ni stopped wasting time on netflix, watching tv, scrolling through tiktok and instagram (recently deleted all social media) and realized that if i can plan out my time and how i spent it rather than wasting hours going through the void of the internet ill be able to be more productive and see my friends, which is my time off, a lot more\n\ni map out every hour of my day when i wakeup. i know when i wanna leetcode, when i want to be at the gym by, when my gf is coming over and how much i need to get done in that period of time. that way im not aimlessly working but instead have a goal and time boundaries of when i need to get my shit done by.\n\ndo i always get it done? absolutely fucking not. but i have a personal philosophy: shoot for the stars and land on the moon. by setting up these deadlines for myself, even if i dont meet them i come farther than if i hadn't set anything up at all.\n\nthe main reason i feel like im able to balance it all is my ability to cut the bs out of my life. no more spending saturdays sitting on the couch watching netflix - hell, thats the time you could be putting into your studies and your future. instead of doing that. carve out a time chunk that you wanna allocate to yourself as your time off (we all need it) and make the most of it, but dont spent the entire fucking weekend doing nothing just because its the weekend.\n\nbefore covid i would end up studying all day on Friday and Saturday. but the second it was 10pm i would put on a nice outfit, take a couple shots, sniff a couple coffee tables, and drop 50$ at the bars - why? - cause i fucking needed it. but i didnt spent the entire goddamn day doing nothing just waiting until it was time to go out.\n\ntheres a lot of downtime in life. take advantage of it and youll be able to make space for more things, rather than just sitting there bored - hell - i havent been bored in years.\n\nand get your sleep. i literally cannot function without 7-8 hours so unless i got a fat exam in the morning you best believe i get my sleep\n\n&#x200B;\n\nAfter reading this you may be like \"wow, I wish I was this guy,\" and trust me, I say the same thing to almost everyone else I meet at this uber competitive school. Kids here are on crack I tell you. fucking crack",
            "Don't feel like you have to do it all. Take fewer CS classes if you can. Don't worry about getting amazing grades. Give yourself breaks.\n\nAlso, I don't prep for interviews and I do fine. Some people feel the need to prep and that's fine, but if it's burning you out, don't do it.\n\nI routinely take time off. I could have returned to my big N internship for this summer but I decided to just have a free summer. I know that I'm lucky to be able to do this, but if you can, I would.\n\nDon't compare yourself to others. There's always someone better.\n\nRemember, you can't put a price on mental health. If having decent mental health means that you take another year, or make less money, well so be it.",
            "Passed/ fail all my classes, focuse on cs job 20+ hours week, and leetcode schedule mon-thurs 2 hours a day. On top of all the other shit in life. Yeah it sucks I gave up on grades and focused on skills and work experience. I think it's my best move and will help me when graduate.",
            "* I wouldn't say CS is difficult (switched from Computer Engineering which was much harder so my perspective is biased), it might be time consuming, but the material generally speaking isn't like a high level Physics class or high level Math class, much of the math you see in algorithms is summations and such, certainly not easy but not difficult either.\n* Extracurriculars are pretty overrated ngl\n* Good point, I used the summer to prepare, 2-3 hours a day after my internship, which is paying dividens\n* Just explore",
            "Adderall.",
            "Adderall and Melatonin.\n\n&#x200B;\n\nThird drug is leetcode i guess"
        ]
    },
    {
        "post_id": "195m28s",
        "author": "Ready_Spread_3667",
        "title": "CS bros on suicide watch",
        "url": "https://www.reddit.com/r/csMajors/comments/195m28s/cs_bros_on_suicide_watch/",
        "score": 388,
        "num_comments": 119,
        "created_utc": 1705145540.0,
        "selftext": "I'm in 12th grade and planning on pursuing a higher education in the United states but fucking hell. I have never seen a group of people whose determination and perseverance is matched only by their state of chronic depression.",
        "permalink": "/r/csMajors/comments/195m28s/cs_bros_on_suicide_watch/",
        "comments": [
            "I got two offered rescinded.",
            "Damn. That last sentence really hit me.",
            "I'm on the same boat but CS helps with my depression. I feel good when I build something and no other industry allows you to do so without leaving your bed.\n\n^^^PS: ^^^don't ^^^report ^^^this ^^^for ^^^suicide ^^^prevention ^^^it's ^^^annoying.",
            "Hi. I just wanted to say I have never been more happy than since I entered my Computer Science Bachelor. I believe its mostly people who waste maybe too much time on social media crying about computer science because they didn't actually read what it contains and is about before starting the degree. I can highly recommend the degree, but know the degree is hard, and you have to find motivation constantly, but I really could not be happier than where I am right now",
            "Don’t take the opinions of people who’re chronically online all that serious.",
            "The people on here do not match up with reality at all, lol. Everyone I know at my university who actively tried to get internships got them. You do have to apply to a lot of places but if you do that eventually you will get into at least one place. Then it's not too hard to get return offers there and an eventual job.",
            "just get off social media. It’s really different when you’re actually studying about it in college",
            "If I had any advice for my younger self, it would be this: dont pursue CS.",
            "You wouldn't be depressed if all you cared about is money without a passion for problem solving. Most fail to realize that CS has many theoretical advancements and there are jobs in academia to develop those new technologies.",
            "They’d be happy as pigs in shit if the job market was normal, but now they all think the world is ending because they’re not getting their dream jobs right out of college. You know, *like everybody else*. Everybody else gets out of college, they go back to working in retail, and then they eventually get a job in their field of study. But these guys are like, “I will not toil like a peasant! Look! Behold my hands! Made for typing, not for work! Why, I could sprain my pinky finger, and then how would I press the semicolon, I ask of you?”\n\nThey all picked a shitty time to graduate, because they walked into a down market. There’s some years where everybody walks into a down market. Look at the Class of 2019: Everybody *except* the CompSci grads got screwed, and now it’s the reverse of that. It’s just the world resetting itself to normal. The writing has been on the wall for two years, and it’s kind of their own fault for not paying attention to it. The business students knew. The engineering students probably knew. So, the question is, did the CompSci students not know, or did they know and just not care? Did they think the world was just going to coddle them because programming computers is arcanery that cannot be done by mere mortals? For once, they get the same college experience as everyone else, and that is to say they are going to struggle after graduation.",
            "I don't have any passion in anything, so computer science seemed to be the default choice when taking in factors like job prospects and aptitude. Now that the job market doesn't seem great, I'm hovering between \"should I wait this out for 3 more years and hopefully it will be better\" or switching to a different major. Only problem is I don't know what else to major in.",
            "Job market isn’t actually as tough as it’s made to sound here. I get the feeling a lot of people in this sub are college students complaining because they got rejected for internships from FAANG companies. Have good interview skills and you’ll be able to find jobs no problem. Showing up to an interview in a greasy hoodie saying 3 word sentences and then sorting an array for an interviewer isn’t going to impress them (I remember kids in my graduating class doing just that and complaining that they got rejected).",
            "A year feels like a lifetime when you're only 18. Most people are just describing/venting their situations as they happen. Two years ago people were fighting over if *only 100k* was a good offer or not. You haven't even started college, what is happening now probably won't be happening in 4+ years and if it is it's because there are a lot worse things happening overall. Exceptional people still don't have trouble finding jobs, the best thing you can do for yourself is to make sure you are exceptional as much as possible by attending a top school, building projects in your free time, landing internships, become as prepared as you mentally can handle.\n\nWhat you probably do not realize is everyone's situation is different and their frustrations while depressing to hear about constantly are valid. When most people's parents/grandparents could just work one job and provide for there family or graduate college and be more/less guaranteed a job, it's incredibly frustrating to put in the work and be asked to do even more just to have a *chance* to work. A chance to work for something that can turn around and just give you the boot at any minute because green line isn't going up fast enough for some rich fuck. \n\nThis is the real depressing reality for many of us moving forward. It takes vastly more effort to just be able to exist regardless of career field.",
            ">I’m in 12th grade\n\nThe fact that you guys are taking anything in this post seriously is proof this sub is fucked. Next week someone will say “I’m a newborn baby and I think this field is over saturated” and people will treat it as evidence.",
            "It's okay the economy will be fine in 5 years when you graduate just go for it",
            "A lot of people in this sub are morons that have very little critical thinking skills do not reas too much into what it is said here",
            "I was on suicide watch before I was in CS, does that make me special? \n\n(I was in premed at school, hated it and burned out and was hospitalized, switched to CS, now have a stable and okay-paying job)",
            "If your primary concern is pursuing higher education out of sheer passion and insight then do so. \n\nIf the last sentence was meant as an address on the state of employment in the IT/Tech, your own genuine curiosity and desire to learn will lead you down a relatively successfully path such that you’ve accomplished what you wanted — not what someone else wants or fulfilling their goals/dreams.",
            "The problem is a graduation in cs and a bootcamp program are treated equivalent.\n\nEdit: The point was a CS graduation holds no value when compared to a mechanical or civil",
            "this new generation of gen z and late millennials are plagued with a host of mental health issues.",
            "Don’t study cs",
            "Don't be a fool, get a pool",
            "People just get on Reddit etc and bitch and moan about nonsense. I got an internship and a job no problem. You will be ok.",
            "As someone who made one of those posts (literally yesterday so you might have seen it), I think its one of those things where its a mix between over-achievers and strugglers making an echo chamber of everything being all doom and gloom. \n\nI myself fell for the same thing and frankly I’m gonna leave the subreddit and just focus on my own stuff because this is actually a toxic subreddit",
            "![gif](giphy|zmsDqpDLu1hPG)",
            "Tech hiring is slowly down drastically, and there have been a lot of firings. My school usually did Google Internship events but they've all been canceled due to them not hiring many people anymore.",
            "This is why this field its the most medicated there is"
        ]
    },
    {
        "post_id": "u297ca",
        "author": "blackpanther28",
        "title": "That feeling when u pass ur intro to programming course",
        "url": "/r/antiwork/comments/u21nio/fuck_doordash_fuck_ubereats_im_launching_my_own/",
        "score": 388,
        "num_comments": 43,
        "created_utc": 1649796874.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/u297ca/that_feeling_when_u_pass_ur_intro_to_programming/",
        "comments": [
            "This will never get built. I’m willing to bet 1000$ to anyone or their favorite charity.\n\nThe amount of these kinds of posts I’ve seen in my career is tremendous, the amount actually built is 0.\n\nPeople are clueless",
            "Me after my first “Hello World”",
            "Lmao I’d love to see how this works out. People who think Uber eats, dd, etc should be free are delusional. \n\nPeople really expect to use others services for free? You gotta pay the engineers and the shit load of infrastructure that supports all the users, their orders, etc somehow.\n\nSame thing with people complaining about ads on YouTube. They need to monetize a free product somehow",
            "This geeks 😂",
            "why is that sub still up lmao",
            "Would be a cool project, but probably won't be a business or used service.",
            "The funniest part of this guys comment history imo is that he's against tipping because he doesnt want to \"help the capitalist overlords\" like what even is your ideology. Now he's trying to start a non-profit delivery service to help the drivers???",
            "Also the feeling after you fail your first business course",
            "Pretty sure they are just karma farming.",
            "antiwork bro goes to antiwork sub to ask people to do all the work for free lmfao like that will end well",
            "We should get him to write a Systems Design textbook for us too 😂",
            "Me looking at my notes with all my mobile app ideas but I’m only a sophomore with no experience: 🫤",
            "I'm familiar with OP of linked post. he's an active member of both r/applyingtocollege and antiwork and has consistently got some of the worst takes I've ever seen online - from calling out college rejectees for being unqualified to virtue signaling on the regular, he's got it all. I appreciate the sentiment and while it's possible I've misjudged him, there's defo nothing to see here.",
            "r/antiwork is the biggest circlejerk i've ever seen",
            "easier said than done",
            ">We're committed to making all the code open source and as a non-profit\n\nLook, I get it. These services are predatory. However, there's a difference between blind ignorance and healthy confidence. You can't compete against these whales without having some way of monetizing the platform. They pay their senior software engineers a comfortable six-figure salary to do the work they do. They have the network infrastructure necessary to support large-scale operations. And the whales are most definitely *not* running their tech stack on Go, Kubernetes, and Python.",
            "Lmao this sub can be savage sometimes",
            "I think OP has the right motivation. I think these businesses would be better structured as co-operatives where the shopper, driver, et cetera is an owner in the co-op rather than a private contractor.\n\nEdit: some of y’all don’t realize that there are other structures than corporations. Also engineers would be paid owners of said co-op.",
            "This sounds more delusional than Theranos my god"
        ]
    },
    {
        "post_id": "oir0z6",
        "author": "None",
        "title": "How do you guys stop comparing yourselves to others?",
        "url": "https://www.reddit.com/r/csMajors/comments/oir0z6/how_do_you_guys_stop_comparing_yourselves_to/",
        "score": 382,
        "num_comments": 67,
        "created_utc": 1626095734.0,
        "selftext": "I simply cannot browse LinkedIn without feeling like shit. I'm really not a comparison type of person in my daily life, like I don't compare my outfits to strangers' or friends', or compare houses/cars or anything like that. It's just school. I just feel like I would be at SO MUCH peace if LinkedIn was never made :( Why do I even care if Brian had 3 internships by Junior year OMG. Any advice to make the situation better? Does this go away with age and as you grow up?",
        "permalink": "/r/csMajors/comments/oir0z6/how_do_you_guys_stop_comparing_yourselves_to/",
        "comments": [
            "I had the same issue sophomore/junior year lol. Just try to get off LinkedIn and focus on your hobbies or making yourself better. And it goes away for sure, the closer you are to graduating or the more YOE you have the more recruiters will bother you to interview. That was when I stopped giving a f\\*\\*\\* about how anyone else was doing.",
            "I used to feel the same way like I'm falling behind in life compared to my friends. I used to feel like life is some sort of race that I have to win. But like, win against what exactly? \nGenerally in races, everyone would be given a fair chance but not all of us were given a fair chance in life. So why consider life as a race and make ourselves miserable? (I hope I made sense with that analogy)\n\nI guess, keep doing whatever you have to do. Keep learning new things. Be open to opportunities. \nTry to focus on your hobbies, interests etc, hang out with friends. Life is hard as is, don't make it even harder comparing yourself to others. All the best",
            "You just stop giving a fuck, like how does Brian working at the faang unicorn startup impact you? It doesn’t. I think it’s just mindset and it may or may not go away with age or perhaps it just morphs overtime. Perhaps by the time your 30 it goes from how does Brian have 3 internships to how does Brian have 7 Lamborghini’s and a private jet.\n\nEdit: who is this Brian guy?? He really got it going on",
            "> does this go away with age and as you grow up \n\nI think it goes away once you’re used to LinkedIn and the constant “look at my success” feed. I’m just kind of like “oh cool good for them, now I’m more motivated to keep working” and move on. \n\nIt also helps if you have a way more successful older sibling. You can practice by ignoring your parents when they compare lol",
            "Some people don’t do shit at internships and embellish the hell out of their experience. Not some people, all people.",
            "\"Clearly, I reject the view that there is one way that is right for everyone and for every problem.\" - Bjarne Stroustrup",
            "First off, LinkedIn like any social network maximizes engagement by manipulating your emotions, in this case jealousy. Unless you have a job to do stay off that site. \n\nSecond, everyone college age in CS has similar goals: score well, get good internships, get good junior dev job after graduation. It’s easy to feel inadequate at that stage. \n\nAdd a few years on and your goals diverge. People want different things over time. Some want a high income to sustain a comfortable lifestyle or to have children. Some want to work as few hours as possible doing code grunt work to be rich in time. \n\nI personally know an ex-FAANG couple who were largely able to ride out the pandemic unemployed living off of their accumulated stocks, which sounds like the dream right?  Well they’re totally fucking miserable and depressed all the time.\n\nBut you won’t see that on their LinkedIn.",
            "Remember on social media people only show their best side, and you may be comparing your lows to their highs (everyone has ups and downs). \n\nAlso, it is mostly outside of your control if you can get an offer or not - do you really want to attach your self worth and happiness to something that’s outside of your control?",
            "Is Brian at jane street or citadel tho",
            "I’ve been doing development for quite a while and have found that the little pangs of jealousy or unfair comparisons don’t really go but I have learned what feeds them and not to engage with those things.\n\nAlso LinkedIn is just a feed of highly superficial nonsense, moreso than regular social networks because part of business culture “professionalism” is presenting an utterly superficial self. Safely ignore tf out of that feed and do your own excellent thing.",
            "Linkedin is fake bro, 95% of people lie and say conformist bullshit.. \n\nYou are not in a race, set your own goals and work towards achieving them. When your eyes are set on your goals and hobbies you'll hardly have any time or reason to worry and compare :)",
            "Can we have Psychology students/professionals on this sub too?\n\nJust to ..you know.. answer such queries and give us a breather?\n\nThat'd be really helpful.",
            "[Compare yourself to who you were yesterday, not to who someone else is today ](https://youtu.be/FuQP6l_nfBw)",
            "Don't use LinkedIn :)",
            "Linkedin is mostly filled with fake shit. 90% of the stories they tell are fake. Most people don't do shig there.",
            "Stop giving a fuck basically.\n\nI make enough money to be happy.",
            "I always tell people, “The only person you should be comparing yourself to is the you from yesterday.”\n\nYou also don’t see people posting “I just got rejected!” as often as the one’s that got accepted.",
            "Sorry I don't have advice lol but just glad to see I'm not alone. Here I am seeing posts like (\"omg I got into verizon/apple/aMaZoN/fAaNg) on my feed and I'm doing work at a startup. Now granted I'm an incoming sophomore so I might have some time, but WOW this makes me feel like I'm doing nothing w/my time. Thinking about excelling at my internship + leetcode + side projects + prepping for this absolute beast of a discrete math class at university is scary but people seem to do this AND more AND have a good summer :(",
            "Honestly it just puts me at awe how people can be so accomplished. Yeah, there is a sense of comparison but it can also be a way of motivating/pushing yourself ?",
            "just realize you're the best and everyone else is comparing themselves to you",
            "LinkedIn posts are corny lol move in silence like a real g",
            "1. Stop reading LinkedIn (at least for a few days)\n2. Write down 3 goals that don't have anything to do with other people. They don't have to be career goals. Even hobbies or volunteering or life goals (like graduate college) count.\n3. Think about what you're going to do to achieve those goals and start working towards them.",
            "first of all, stop following \"influencers\", they're just toxic ego maniacs on any platform. They're selling an \"image\". Stop reading LinkedIn altogether, or go see /r/linkedinlunatics \n\nsecond of all, compare yourself to who were yesterday not who someone else is today.",
            "The answer is clear - just stop browsing LinkedIn. People don't post their failures. You're doing yourself a grave disservice by spending so much time there.",
            "You SHOULD compare yourself to others. Competition is a major way to be driven to be better. You also need to know what your competition looks like it. \n\nJust don't get SAD over it.",
            "Yes, this strikes me mostly as a character issue.  You are either going to have to:\n\n1) Get better at selling your accomplishments/get better accomplishments.\n\nor\n\n2) Develop the strength of character to realize you have a place in the world, and it is at a lesser station in life than those others and adjust accordingly.\n\nI know it's tough if you've been praised your entire life and are just realizing that you might be unremarkably average.  If you've never developed the spark of ambition to outcompete your contemporaries, it can be hard to win a race from behind.\n\nIn the end, success is being able to do what you want when you want.  These can happen in two directions though: upwardly, you can put in the effort to acquire more resources (wealth and power), or, downwardly, you can put in the effort to adjust your character to want less, more appropriate to your means.  Neither are easy, but you'll want to choose your path earlier than later.",
            "This why I never update my LinkedIn status nibbaz stay hating they can't handle a young nibba like me trying to get out the hood. I can't have that negative energy in  my  life.",
            "I guarantee you 100% that there will always be somebody bigger faster stronger smarter skinnier it’s just a difference than you.\n\nI’m tall like really tall like 6 foot five tall and even for me there’s people taller than me.\n\nHow are you possibly expecting you to be better than everybody that’s your ego you need to let go of the idea that you have to be better than everybody that everything.\n\nInstead I recommend you be best of one thing or two things and get really good at those two things\n\nThen make friends with the people who are really really good at other stuff and you could refer work or loop them in as an expert",
            "Think about how you and this person have completely different genetics and ways in which you have grown up. You don’t compare yourself the The Rock and be like “why am I not that dark and jacked?” Cause you are different people with completely different life experiences.  Same Same.",
            "You’re unique for a reason. I’m a huge comparison person towards everything EXCEPT my job. You learn at your own pace and you bring qualities that others don’t have. That’s WHY people employ you. I had no internships and I don’t use LinkedIn but I ended up getting my first tech job last year, and am about to take a leadership position because my boss is so happy with my progress. Not my competitors.",
            "Just don't use LinkedIn and dont ask ppl what they do/what they've accomplished. It's that simple. Only know what uve done, and what u have to do to get where u wanna go!",
            "Honestly, I've gotten to the point in my life where I don't have time to worry about others, nor do I want to exert the energy to do so. Just focus on yourself otherwise you'll constantly be in a losing battle.",
            "I feel everyone else made an excellent point but I would also like to add to it. Keep in mind that posts you see on LinkedIn are highly biased statistically because profiles which are not the kind with 3 gang internships or whatever will be less highlighted",
            "Because the basic idea of comparing is sort of a scam. I don't believe you would feel horrible if you compared yourself to Jeff Bezos(Ugh he's so much more successful). So why do you feel bad when you compare to Brian? Because you thought you started at the same point in life as Brian but you didn't. Family, status, personal abilities, luck, thousands of little influences affects everyone of our actions, you can't simply compare that and say which one's better. Be the best you can be, that's all.",
            "I can definitely relate! Patience can make a big difference. Though there will always be someone \"ahead\" of you, in a few years you'll have awesome internships and experience as well! So you won't feel like you're missing out as much.",
            "I just stopped looking at LinkedIn. I feel much better now",
            "The more experience you have, the less you'll use LinkedIn, because at that point, you'll be focusing on your own career path and be networking with a certain group of people. And plus, sending an resume directly to the recruiter still beats LinkedIn.",
            "Have faith in yourself",
            "I realize everybody operates differently and programs differently and while you want to be like someone else there’s always someone out there that wants to be you.",
            "I don't think I've ever really figured out how to. I just get forced to become used to it due to prolonged exposure to ridiculously spectacular people.\n\nAs time goes by, I make peace with forever feeling inadequate and foolish. I feel terrible about my abilities and intelligence all the time, but I manage to keep sane by looking back and seeing how far I've gone, from time to time. At least this perpetual feeling of inadequacy pushes me forward.",
            "Some people are cool and you might like to meet them, work with them, even learn from them, etc. Other people don't really matter-you don't really need to know about their lives as it doesn't affect you",
            "It is important to remember that comparison is the thief of joy. There will always be someone more 'successful' than you. Yes, 'successful', because it is not the same for everyone. What you think is the definition of success is not the same for another person, what you think is great can be awful for the other. That is why you should focus on yourself and measure your successes with only yourself. I highly advise you the reflect on why you do the things you do, why you are pursuing your career right now. Is it for you or for others?"
        ]
    },
    {
        "post_id": "181j17r",
        "author": "BlazeTube",
        "title": "My 2024 summer internship hunt",
        "url": "https://i.redd.it/rb1vbyozmy1c1.jpg",
        "score": 385,
        "num_comments": 23,
        "created_utc": 1700685446.0,
        "selftext": "",
        "permalink": "/r/csMajors/comments/181j17r/my_2024_summer_internship_hunt/",
        "comments": [
            "21 applications  -> 1 offer is not bad at all",
            "congratulations!!",
            "[deleted]",
            "What kinda experience did you have? 20ish apps is super low.",
            "W",
            "Idk if this guy memeing brah",
            "clinical",
            "W",
            "Insanely good",
            "Are these all close and in person jobs or remote?",
            "Tell us more that seems like it was pretty good",
            "congratulations!!",
            "Which company and r u on F1 Visa ?",
            "Interesting!"
        ]
    }
]