[
    {
        "post_id": "1c3mryq",
        "author": "TheImprezaGod",
        "title": "My bf murdered my entire family, i’m thinking of ending it.  Should I?",
        "url": "https://www.reddit.com/r/AmIOverreacting/comments/1c3mryq/my_bf_murdered_my_entire_family_im_thinking_of/",
        "score": 41669,
        "num_comments": 3885,
        "created_utc": 1713075707.0,
        "selftext": "My (26f) boyfriend (m30) brutally murdered my whole family last week. The cops said it was one of the most horrific scenes they had ever seen. Honestly i can’t even look at him rn and i’m really considering breaking things off with him but i’m still torn. One on hand i’m now the only surviving member of my family, but on the other we had a really good thing going prior to all this. it’s quite the dilemma. ",
        "permalink": "/r/AmIOverreacting/comments/1c3mryq/my_bf_murdered_my_entire_family_im_thinking_of/",
        "comments": [
            "If you do break up with him, can you please pass on my details? He sounds like a catch.",
            "lol on point!\n\n90% of the posts are like this",
            "Don’t judge him by his one bad action; forgive him for all the things he’s done right.\n\nEdit: 😃",
            "Whatever you do, don’t make a rash decision. I suggest talking to him about it and see if he is at least remorseful for his actions. \n\nAs long as you can get his assurances that he won’t do the same thing to you, then I think you should stick with it. A good man is hard to find.\n\nAnd lots of prisons allow conjugal visits, so you could still maintain some semblance of a relationship and maybe even have kids in the future!  \n\nThis is, assuming that he is in police custody. If he isn’t, the two of you may consider leaving the area and finding someplace without a reciprocal extradition treaty. \n\nGood luck!!",
            "Maybe get couple therapy talk about it see what went wrong hear his side of the story maybe it was a accident 🤔",
            "Have a baby, that will fix the relationship.",
            "Cops? You didn't help him cover it up?! YTA.",
            "YTA. A completely normal hobby for men to have at their age is a breaking point? He should leave you.",
            "Is he good to you otherwise?",
            "Give him a second chance",
            "Your still alive OP.. your bf is a failure",
            "He didn't kill you though, shows he really loves you. Plus you're really going to be under pressure to procreate now that your whole family is dead and you're not getting any younger.",
            "Did he murder them for realsies or was it an accident?  I know this has happened to me a few times. Accident every time.  Oopsies.\n\nHave you discussed it with him?  Maybe try group therapy, hire a medium so your family can weigh in.",
            "Did you explain to him WHY mass murder is wrong,some men just don't understand! Men think differently to women, he shouldn't have to read your mind and know killing your whole family would annoy you.  Also he probably has ADHD so give the guy the break. \n\nOh and murder is his love language",
            "I feel bad for this guy. He is obviously hurting inside and his girlfriend doesn't know if she wants to stay committed.  That's millennials for ya. ",
            "Are you wearing his underwear by chance?",
            "You can fix him.",
            "murder his family instead /j",
            "Everyone on Reddit is so quick to yell “divorce!” You owe it to your BF to give him the chance to decline to try couples counseling first.",
            "By \"thinking of ending it\" do you mean murdering him too? I'd say you could be made for each other, like Mickey and Mallory Knox. Don't break it up: You'll live a crappy life, but in the movies, it'll look like you had a blast...",
            "Everyone Sucks Here . \n\nShould he have massacred your entire family by hand , letting you know that he really really meant it? No. But your family also sucks….sorry sucked for being alive near him. You don’t know what past traumas he has that could be triggered by living beings",
            "If you hated your family and wanted them dead he basically did you a favor",
            "LOL so he secured your inheritance and left you alive. Match made in heaven",
            "He sounds like a pretty nice guy! Sure he had his reasons! Don’t end it and stay with him is my vote!",
            "You should give him another chance",
            "The hardest part is knowing that if you break it off with him, he'll probably make you return that large sweatshirt of his that you like wearing at night.  \n\nRelationships are hard...",
            "You can be his prison pen pal!",
            "I think you should provide him with an alibi, clearly he cares a lot about you since he so kindly spared your life. \n\nShow some gratitude for once in your miserable life why don’t you.",
            "lol",
            "Sweetie, that's a major red flag! Sure, you could forgive him and move on, but I will tell you this: If he is capable to do this, what else is going on in his wicked mind? One day you will wake up and he pours the milk before the cereals.\n\nPack your stuff and leave!",
            "You need to see a relationship counselor immediately. \n\nIf he won't agree to that, then you should suggest seeing a relationship counselor consideration therapist who can help him see that the road to fixing this relationship will require counseling. \n\nThat can be a tricky conversation and it will help to do it in a videoconference with a consideration therapy coach, whose purpose is to help guide the discussion in a way that helps your bf see how beneficial a relationship counselor consideration therapist can be. \n\nSome people don't react well to having a third party VC'd into what would normally be a private conversation, so if you go this route you'll want to book time with a psychologist that specializes in conversation-related trauma, who can help you and your bf process what he is going through as a couple, having had that VC sprung on him. Nearly every couple I know that uses couple's conversation-related trauma psychologist tells me that it is absolutely indispensable for each of you to also have your own separate sessions as individuals as well. (You will not be able to use your couple's psychologist for this due to professional ethics, so you should each seek your own doctor.)\n\nIn particular, pay attention to whether your bf exhibits any traits of having been triggered. If so, you'll need an expert in dealing with triggers. A quick Google search reveals that you will need to hire an armorer to come to your house and secure and clean all of the firearms, giving special attention to the triggers.\n\nMany people, particularly many men, will not want to see their own individual psychologist in addition to the couple's psychologist, and the remedy for this is for you to inflict blunt force to your bf's head with a frying pan.\n\nAt this point you will be managing quite a large staff, and you'll find that an investment advisor and a good accountant will be invaluable. You'll want to start thinking about the career path you are providing to, for example, your armorer. Are you providing your armorer with sufficient mentorship opportunities that will allow them to grow and eventually be promoted? Consider hiring an armorer's assistant, and find an intern to apprentice under them as well.\n\nI think you'll find that whatever happens between you and your bf, running a business will keep you pretty occupied and you'll definitely need your bf to either pitch in and build your conglomerate of personal mental health and armory services, or spin off his own enterprise and go his separate way.\n\nGood luck and don't worry about your family, they mostly tend to get in the way of high powered CEOs. You'll be glad they're dead.",
            "If you keep living in the past, you'll never have a future. Lock him down with a baby and then quit your job and become entirely dependent on him. You can change him.",
            "I think you're overreacting because you make the wild claim they \"brutally\" murdered your family... But how do you know it wasn't self-defense on your boyfriend's part after breaking into their home and being told he had to leave? Shaking my smh my head, this is definitely a case where you need to apologize.",
            "Everybody has murdered their partner's entire family at least once, trust me. It's not that big of a deal! He was likely just having a bad day",
            "I think this story is fake. OP isn't answering any questions. Or they've been brutally murdered. \n\nIf it is real, maybe think what YOU may have done to cause him to react that way. Do some soul searching, and sit down and have a conversation with him. How long have ya'll been together?",
            "mmmmm multiple life insurance policies, or alternatively, eye for an eye, murder all his family, then assert dominance by murdering his friends, ex classmates and teachers from school, work colleagues, anyone theyve ever met, then anyone theyve rver met, basically full thanos send this motha f.cka",
            "How much does he make per year?  Please dont leave out the most important details",
            "Ok but this is an important piece of the equation.  How tall is he?",
            "Buy him a new set of kitchen knives and tell him you are sorry you fu*ked up.",
            "Have his baby and eat it",
            "If you have some kids with your boyfriend he might be less inclined to kill them because they are in his family, not just yours.  You can't bring the dead back to life so just bury them and repopulate.",
            "I mean he hasn’t cheated on you. Your family was probably kind of annoying. Maybe just get some couples counseling.",
            "Consider this: did you do anything to provoke him? Are you bringing enough to the relationship? Have you done anything, he’d need to knock you over the head with a giant, desperate plea for your attention?\n\nAlso, it’s possible he doesn’t want anyone to have you under any extreme circumstances. He loves you so much he’d be willing to do anything for you. To have someone love you so much they’d be willing to go to such lengths is incredibly rare and should be cherished.",
            "Sounds like an emotional, but sweet guy. This must be difficult on him also. You need to support him in these hard times.",
            "Sounds like a lovely guy!",
            "I feel like we need more info. Is the dog ok?",
            "Everybody makes mistakes. You shouldn’t judge someone off of one bad moment. You should apologize to him.",
            "YTA his axe his rules",
            "Make sure to meet up with him to talk about this in a nice secluded place. Take a short vacation to some cabin in the woods maybe. Or possibly your grandpas old barn with all those sharp implements hanging from the ceiling, making those lovely moving shadows on the ground. Or possibly a lovely outlook of a sunset, over some 300ft cliff edge would keep the conversation on track. Ya know, just good conversation spots. \n\nBest of Luck OP, hard decisions ahead 🤞",
            "He must really love you if he took the time and energy to kill your entirely family. My ex only killed my dog with his lazy ass.",
            "Are there any red flags or is it all upside?",
            "NTA but there is good potential, might consider couples therapy. But also being more open to how he feel may help",
            "You forgot “but I love my boyfriend from the bottom of my heart”",
            "Still better than the 90% of these where the husband is banging a co worker/prostitute/stripper/your bestfriend/family dog.",
            "Remember girl, he chose you over everyone else! Be happy.",
            "My boyfriend keeps putting his dick in a corn nuts bag. Is this a red flag? I really love him.",
            "People can change. Have his babies",
            "You should marry him. The sooner the better. Then on your wedding night you can kill him, commit suicide and join your family for a reception in the hereafter.",
            "llmao",
            "I hear long distance prison relationships are a kink.",
            "There are an alarming amount of comments saying *this post is fake*.  Reddit detectives doing their best.",
            "I mean, he’s really all you have at this point so you might as well try to make it work 🤷‍♀️",
            "I mean he didn't cheat on you... That's thw only real reason to end it",
            "Keep practicing.",
            "Maybe he was just having a bad day? Don’t let one bad day end such a wooonderful relationship!",
            "This angel of a person deserves a second chance. You have a good thing going on anyway. Why ruin it?",
            "Therapy therapy therapy",
            "Haha bro most of the post are women who don't have standards or fake.",
            "Do not let him go!! Have lots of babies. He sounds like the catch of a lifetime. Lucky lady",
            "Give counseling a shot first.",
            "Do you think the police will let you go through his phone after them? Cause we should do that first",
            "He is not the asshole",
            "I think you should go to couples therapy",
            "I don't know, I mean, how close were you to your family?",
            "Just tell him you can murder his whole family then you guys are even.",
            "Everybody has a bad day",
            "I know this is deliberately extreme to show the general tone of redit, but it's alarmingly accurate. Redit posts aren't even attempting to be realistic anymore - they're nothing more than a pit of fake stories intended to incite rage and hatred against one community or group of people.",
            "Nah. If it's the only time he's messed up, you have to give him at least 900 more chances. He'll change. They have therapy in prison. Hang in there.",
            "Honestly I don’t approve of his behavior but I’m willing to go to couples counseling if he is",
            "The username alone explains so much here.",
            "Omg, I am so sick of post like this. Like 90% of the problems on this sub cod be solved it people would just TALK TO EACH OTHER.\n\nMy God OP, just ask him? Don't over think it just say babe, do you still love me, are you planning to murder me. If you were would it be soon or not for a while?",
            "Listen, you aren't going to get the answers you need on Reddit. Get yourselves both into therapy together and start communicating. It sounds like you have little to no understanding of his perspective in all this so perhaps take a step back and see if there isn't something you can both learn from the experience. You may come out of it a better person. Why not take every opportunity to grow?\n\nBest of luck, thoughts and prayers. You'll get through this as a team!",
            "Are you being judgemental about his body count? That’s so immature",
            "Yup, pretty great summary of the brain power of a bird that some of these posters have. That or they're 13 years old or even just posting absolute lies. Typical garbage people really.",
            "OP your bf is a classic narcissist",
            "If the genders were reversed...",
            "Bravo.  This one wins.",
            "How did you even find out? Did you snoop through his phone? Because that's an unacceptable breach of trust so you're just as bad as him really",
            "He is obviously cheating on you",
            "Have you considered how HE feels about all this? Stop being so selfish.",
            "This is very true. It goes the other way too. “Husband picked up the wrong brand of cereal from the store”…..Reddit- ”divorce him, change the locks, never let him see the kids again, build a moat, put automatic laser blasters outside your door and make sure you cast a few spells on him for good measure”",
            "What religion is he? \n\n/s",
            "Ugh…what dumb decisions did you make 13 days ago at 2:18 pm? Because that’s exactly what put your families fate in motion…sooo basically YOU killed your family.. you know he loves you, he’s just sensitive. Hopefully you won’t make him murder the family pets too. It’s really pretty simple—just try not to bother him while he’s cheating with your best friend and he may feel sorry enough for you to let you take care of him emotionally, physically and financially..atleast until he finds the right dirt whore to replace you…",
            "This post comes off as judgmental and muderist.",
            "free my bro, he’s just a little grumpy sometimes",
            "Is this a joke post?",
            "Girl...\n\nhim not killing you means he really cares about you 😍 You should put a ring on it right now before he finds someone better 💍💍",
            "You can fix him",
            "I would say at least talk to him about it and make sure he’s sorry…",
            "This will never work. You two are in different places in life. Although you don’t say what you are. Are you a murderer too? We need more details.",
            "Honestly what your family thinks doesnt matter, how does he make YOU feel? I would consider going no/low contact with your family as well",
            "Hey, at least he isn’t cheating on you!",
            "My wife killed my dog, drowned my infant son, and shot my father. Now she's mad that I'm upset.  AITAH?",
            "Yup join your family",
            "I mean he didn't sexually abuse them or anything. I think both need therapy",
            "She forgot to mention he is 6ft 2in tall, 190lbs, ABS of steel, owns own company,  makes 5 million dollars a year and owns his own island.",
            "This also needs to have a \"I cried\" or a \"I had a full on panic attack\". Also therapy needs to be mentioned.",
            "Nah, uncomfortable age gap is way too small. Make him 43 and we'll talk.",
            "He obviously did it as a show of love for you. I say work it out.",
            "Top tier satire … this makes me wish we could still give gold",
            "He’s nice and very loving. A perfect boyfriend. This minor incident is making me have second thoughts.",
            "I was murdered last week by my boyfriend. I’m kinda upset. Should I end it?",
            "It's not like you can bring your family back by breaking up with him. Sometimes people make mistakes, you just have to decide if this is something you can move past. I personally wouldn't stand for this level of disrespect and alienation but that me, you decide for you.",
            "Maybe just talk to him about how you feel",
            "YTA. How could you even think about breaking it off after something like this? Kids these days I swear smh.",
            "You also have to consider that if you break up with him, you’ll truly be alone. Like, alone alone. Maybe consider therapy instead??",
            "Give him another chance. He was probably just hungry",
            "NTA frankly what are second chances for, uh?",
            "Have you tried therapy?  Try talking to him.  Maybe if you established some “boundaries”",
            "Did it ever cross your mind that maybe they all killed themselves?....you are clearly overreacting",
            "Girl, you should have seen this coming from miles away LEAVE HIM NOW. I was in that same situation when I was younger and I had to just go no contact and move to a parallel dimension but he still found me and killed me. Though I still miss him this too will pass",
            "Great time for a vacay maybe, destress",
            "You should be honest with yourself.  Is there anything that you did to make him do all this?  You owe it to your family to work things out with your bf.",
            "Have you two considered couples therapy?",
            "Sounds like OP isn't considering the needs of their partner. Have you tried talking to them??",
            "Don't give up on him, girl! Twue wuv can overcome everything!!",
            "The officer said \"It was like 'The Aristocrats' joke but with murder. Never seen anything like it. The Picasso Guernica homage using the victims entrails was both horrifying and intriguing. Am I right for breaking up with him?\"",
            "Shut up troll",
            "Honestly, this seems kind of minor, compared to some of these other topics. \n\nReally just sounds like your BF is under a lot of stress and having family issues with your family.\n\nSeems he's really made a major effort to fix those problems, so I don't see why the two of you can't work it out, eventually bonding over this little hiccup, and moving on to great things.",
            "Give him another chance. You can always get another family but not another bf",
            "Give him another chance. Maybe couples therapy?",
            "Bruh  y’all with these ridiculously fake ass stories is getting beyond annoying atp . A MFR supposedly “ murders” your entire family and you gotta ask if you think you should end it ??? Go to hell",
            "Updateme 🍿🍿🍿",
            "Um…what?",
            "Communication is key! Talk to him and see if he still loves you or wants to wear your skin as a meat suit. I'm rooting for you two!🥰🥰",
            "Sorry yeah YTA",
            "Yta I get a bit of narcissism from you after reading this. Like do you even take into account other people’s feelings? Ask him why he did it and work through it",
            "YTA",
            "Depends. How is he in the sack?",
            "I hate how everyone immediately jumps to breaking up on here.",
            "Typical Reddit. If gender roles were reversed think about how many people would be telling you “oh just take her back, you probably deserved it for forgetting to take out the trash on Thursday”.\n\n(Excellent post lol)",
            "The word murder is kinda harsh. He killed your family. You don’t know what his intentions were and you’re just jumping to conclusions and assuming it was premeditated. \n\nI agree with other comments that you guys should get couples therapy, sounds like you need to work on communication.",
            "OP, before you make a serious, life changing decision like this, I think you should both try couples therapy. If you honestly haven't tried to work through these things together yet, is parting ways truly fair? I think you would want the same from your partner. Though, with all of that being said, you really need to do what's best for you. Good luck, and best wishes and prayers to you.",
            "Glad to see priorities are intact",
            "You guys need a couple therapy, but it should be able to be worked out",
            "Maybe family counseling. Oh, wait, no family. ",
            "Did he have a good reason? I feel like we're missing context here..",
            "Omg, in same boat here. As a trans male/female/male/female I found it so hard to have a spouse/boyfriend/girlfriend/wife/husband/living love person, that I am compatible with. One day, he/she/him/her/they/them/zurb up and just murdered my family/relatives who happened to be humans/persons of related issues/genetic connection people. Not sure what I should do yet?!",
            "Other than the fact that he beheaded me mom and butt fucked my dad to death, our relationship is perfect.",
            "YTA if you abandon him when he is facing murder charges. He needs your support now more than ever.",
            "This is probably the best post I’ve read from this sub. Even though it’s total bullshit (intentionally) somehow it’s less of a waste of time than the majority of the posts I happen to see on here because Reddit thinks I want to read this sub…",
            "Nta, bipolar usually happens around that age. He is probably having a manic episode and needs you to support him.",
            "If he says sorry,  you should forgive him.\n\nHe's learnt his lesson and won't murder your family again.",
            "People will leave relationships over any little things these days smh",
            "The only thing missing is that he’s not 20 years older than you and you didn’t describe him as the “perfect boyfriend” except for this one thing.",
            "Hear him out, have you been listening to his words and observing if he's stressed?you will be overreacting if you don't hear him out first. Families come and go but boyfriends are eternal.",
            "You wouldn't find anyone else who killed your family, he is the one.",
            "The fact some people can’t see this is a joke is concerning.",
            "So many comments jumping straight to dumping him. We don’t know what kind of relationship they have.",
            "Give him another chance. Clearly, your family had it coming.",
            "\ngive him 3 more chances",
            "Lmao",
            "he murdered your entire family and you're still thinking? I like you girl!",
            "YTA being the only survivor its your fault you coulda saved your family",
            "You may be able to work things out.",
            "Communication is key here",
            "Everyone makes mistakes",
            "No. Get married, then promptly divorce him. This is in keeping with reddit tradition",
            "“Other than this one situation, hes been a great bf!”",
            "Nah, don't worry about it. \n\nNobody's perfect.",
            "That’s a tough one tbh",
            "I thought this was a serious post and you were contemplating suicide. Consider me successfully baited.",
            "He is a keeper!",
            "wife this man immediately",
            "Dunno guys, there could be more than red flags, like red carpet, red walls, red drapes, red couches, re....",
            "I mean if the love is there, it’s not worth destroying it over one mistake.",
            "I think you should sit down and have a conversation with him. You might want different things in life.",
            "Naw, give him a second chance. What have you got to lose?",
            "He poisoned the water supply?! Well dang, we all do stupid things when we're in love",
            "Girlie this is your opportunity for the greatest revenge arc ever. If you're gonna end it, end it in style.",
            "Man……i haven’t seen Reddit be Reddit for a hot minute.  This is high quality.",
            "Personally I think you should try to work it out. I mean he seems like he has few character flaws, but hey who doesn't?",
            "Have you tried asking why he wanted to murder them in the first place? I would at least take that into consideration before breaking things off 🧘❤️",
            "What even is this?",
            "Loyalty is dead frfr YTA",
            "You should stay with him and one day he can make it happen so you can join your family.",
            "Meh. It’s not a deal breaker for me 🙂",
            "Don’t forget you have been financially supporting him the past few years too while he’s been in school.",
            "Did he slaughter your whole family in a _mean_ way? Or was it, you know, just one of those murdery things that happens? Did he intend it as a personal affront?",
            "So you're saying he's a go-getter and he finishes his projects? Sounds like a keeper",
            "I would dump him. He murdered your whole family, **but not you** and that's insulting. He couldn't finish the job. Date a man who knows how to finish what he started.",
            "Did he apologize and say it wouldn’t happen again?",
            "You can fix him.",
            "People make mistakes.   I assume this is the first family of yours he murdered ?",
            "Nah, gotta support his mental well being after such a traumatic event. Imagine the images in his head? Take care of pookie, he will need you a lot right now.",
            "Bahahaha, wtf is this comment thread. Too funny",
            "YTO (You’re the Overreactor) it’s not like he deleted your save on Pokemon Red where you had a shiny Mewtwo.",
            "Typical. Dude's just out doing his own thing, enjoying life. And his woman has to find a way to be upset about it. SMH",
            "U can change him",
            "imagine writing this and not meaning it to be satire and then reading the replies **😭**",
            "If this is real, you're an idiot.  \nIf this is fake, you're an idiot.",
            "\"I don't know maybe he can change....I mean he did only shoot my mom twice which shows restraint, I'm so confused...",
            "I mean your family probably sucked and he did you a huge favor.  Hope he proposes soon!",
            "OMG. It sounds like he REALLY loves you. Why are you so afraid of love?",
            "I think that you guys should seek counseling.  I'm pretty sure that him murdering your entire family was a one time thing.  I think that with some help, he'll never do it again.",
            "come on over to r/amitheangel cus we could use your skills at fake posts! ",
            "I can change him",
            "Drop that zero\n\n*snaps fingers*\n\nand get yourself a hero, girlfriend!",
            "Look on the bright side, He can't do it again."
        ]
    },
    {
        "post_id": "1c7wizg",
        "author": "None",
        "title": "My husband won't let me take more than two showers a week. I told him I need him to stop or I'm moving out for a while. ",
        "url": "https://www.reddit.com/r/AmIOverreacting/comments/1c7wizg/my_husband_wont_let_me_take_more_than_two_showers/",
        "score": 23175,
        "num_comments": 13744,
        "created_utc": 1713532237.0,
        "selftext": "This is the weirdest thing my husband has ever done. He really is a sweet and loving husband and I love him more than anything. Divorce is not an option just to put that out there before the comments come in. \n\nMy husband has always been a little out there. He is a computer programmer and super smart, but also believes all sorts of things. Both real and conspiracy. Lately he has been very worried about the environment and global warming. \n\nAbout two months ago he got real worried about water. Yes, water. He is concerned about the quality of water. He put in a new filter system in our house which I actually love because it tastes so much better. \n\nBut he is also concerned about how much water we use. Not because of money, but the environment. He created a new rule that we can only take 2 showers a week. Now I'm someone that likes to shower everyday before bed. I just don't like feeling dirty in bed. \n\nThis has created the most conflict in our marriage in 20 years. He is obsessed with the amount of water we use. At first I just ignored his rule, but he would shut off the hot water while I was in the shower. \n\nI started trying to use the shower at the gym, but it's too much work to go every night with having kids. I honestly thought he would get over this within a month. But he is stuck on this still to this day. \n\nLast night I really wanted a shower, but had \"hit my quota\" as he says. I said I'm showering and that he better not do anything. But about two minutes in, the hot water turned off. \n\nI grabbed my towel and went down and started yelling. Telling him this is the dumbest thing he has ever done. I also told him I'm moving to my parents if he doesn't stop this. \n\nGuys, I love this man. He is everything to me, but I can't take this anymore. Am I going to far in threatening to move out? ",
        "permalink": "/r/AmIOverreacting/comments/1c7wizg/my_husband_wont_let_me_take_more_than_two_showers/",
        "comments": [
            "How about the kids? Can they shower daily??",
            "It is really concerning that he is paranoid and controlling about water all of a sudden. Has there been any major changes in his life or anything?",
            "Mental health compulsive issue.",
            "This is insanely controlling and I hate when people do things like this. The amount of water used in a household is incomparable to the amount used by corporations that are actually damaging the environment.",
            "Username checks out.",
            "There’s 300 million Americans. One family suffering to save water won’t make a difference. \n\nYour husband needs to seek therapy about this issue. Take a shower every day.",
            "Waste water is sent to a treatment plant and then re-used. You aren’t wasting anything",
            "You have a choice.  You either continue to live this way with the understanding that it is water today... and could be food tomorrow.\n\nOr, you could get real with him and tell him his ideas are silly and you refuse to subscribe to any more bullshit.  He sounds like a smart guy, but also a bit full of shit.  I mean computers use more energy than anything.... maybe he should find a new line of work that doesn't hurt the environment so much...\n\nSee how silly it sounds?",
            "You say he's a computer programmer and is really smart, so ask him if he realizes that water amounts are a zero-sum game when you shower?  As in, you're not actually DESTROYING the water - you're washing yourself and then the dirty water will now go through a filtration system at your city and back to where it started, with no loss!  I mean, there will be some evaporation, but that's just putting the water back into nature where it'll end up raining back into the original water source anyway.  Skipping showers preserves no water.",
            "Here's your solution: every time you take a dump, leave it in the bowl and keep the door ajar..  let him discover it each time.. Tell him if you'll continue this as long as he limits you to 2 showers..",
            "He won't let you? \"Thanks for your opinion hon, but I'm taking a shower.\" \n\n\"Also, darling, you've hit your quota of telling me what to do.\" \n\n\"Turn off the hot water again and there will be consequences.\"\n\nNow, if he's really concerned with water, put a big bucket in the shower and collect the runoff when you are warming up your shower. You can water the plants with it. \n\nYou are an equal adult partner in your marriage. I'd suggest him getting some therapy about his increasingly disturbing behavior. Sounds like his anxiety is getting the best of him.",
            "It sounds like he needs therapy or medication.   \n\nOr just tell him he can't control you and take showers when you want and he can leave if he doesn't like it.",
            "Oh dear, you are not overreacting. OP, this man is not doing well. Anxiety disorders and even OCD can appear as conspiratorial thinking and the need to be in absolute control over things. He needs to see a psychologist about this, and he needs to accept that his behavior is not rational, helpful, or healthy. \n\nIf he can be reasoned with, sit him down and discuss WHY the water thing is such a big issue to him, and do research ahead of time to look up more reasonable measures you can take as a household that you ALL agree on, like showering every other day or freezing clothes to get more wears out of them before you need to do laundry.\n\nBut honestly, the fact that he is prone to conspiratorial thinking is worrying. If this is how far he will go in service of this current fixation, then he could do it for a much more dangerous conspiracy theory down the line. If he’s not listening to reason and adamant about being correct and being in control, then counseling is the only thing that can actually solve this problem. Everything else is just a bandaid.\n\nHonestly if you are forced to go without showering in your own home to the point he will turn off the hot water on you, then by all means stay with your parents for a few days, if only just to reset your mental state and have some peace. That’ll help you no matter what you choose to do to address this moving forward.\n\nEDIT: I meant FABREEZE clothes not FREEZING clothes\n\n(Though you can put your jeans in the freezer instead of washing them every time, so that might also work)",
            "Move out. If his marriage is more important than his fucking water he'll realise he's being an ah and work on repairing the damage he's done. If not, you have the knowledge that you don't mean an awful lot to the man you married and should probably stay gone 🤷‍♀️",
            "You say divorce is not an option, but this man is deliberately disrespecting you. Controlling how much you shower, turning off the hot water when you’ve reached some quota he has set, without even a discussion with you. Not even willing to hear what you are saying. \n\nTo me, that would be a huge deal breaker for me. \n\nIf you have to threaten to move out, because he won’t even bother to listen to you tells you how little he is concerned with your wants/needs.",
            "Unhinged- I’m gonna use extra water to counteract his ridiculous request of you. I’ll stop once he lets you bathe properly. \n\nLETS ALL DO IT",
            "No spouse should force another spouse to do anything period",
            "I am so confused. Your husband is showing irrational, controlling behavior. But you are an adult. You can take more than 2 showers. He does NOT control you. The only issue here is YOU allowing him to be this deranged. Don’t do anything petty to “show him a lesson”, be an adult and ask your adult partner to respect you. If he can’t, it doesn’t matter that he’s “sweet and loving” he’s also asking you to live in a way contrary to what you need for your health and well-being. You do not deserve to be treated that way. So take your daily showers and if your husband can’t take it, HE can leave.",
            "Looking at water usage: showering is only a small part of it. If he’s concerned about water (which is in itself a good thing), he may want to stop eating meat (assuming that he does).",
            "I’ve never heard of anyone else having this issue, but my mom is actually like this. For her, I think it’s related to undiagnosed mental health issues.  My best guess is obsessive compulsive disorder. She cries if I would take a long shower and she would also turn off the hot water. I am wondering if something else is going on with your husband.",
            "If he’s not stopping your neighbors from showering, what’s the point of stopping you? If 2 people die today, that’s 4 more showers you can take a week!",
            "I like cold showers. Jokes on him. \n\nFor real though, tell him you are an adult and own the home as well and will shower as much as you please... and he can shower as much or as little as he pleases. If he doesn't like it, then he can move out.",
            "Your husband’s obsession (you mention he “gets obsessed with things” a lot) is probably related to his mental health. Still you do not need to put up with this. Move in with your parents. Can you take your sons with you? This is absurd behavior and gross. The whole shutting off the hot water while you’re showering thing is controlling and abusive (yes I know everyone on Reddit calls everything abuse but that to me is abusive). \n\nI would 100% move out. Tell him he needs to get his shit together if that means therapy or meds or just calming the fuck down.",
            "Showering twice a week is poor hygiene.   Showers when you want and tell him to get a grip on himself.  Also water filtering systems are great for drinking water.   Mr programmer doesn’t need to treat the water for the whole house.   You can get a kit and test the tap water for all kinds of stuff.  That could be fun for the compulsive one.",
            "This guy sounds like high anxiety or OCD. He should see a medical professional",
            "[deleted]",
            "NTA if he is so concerned about water usage there is a pump that filters out the kitchen and bath water to turn into potable water, it costs a lot of money but everyone needs to be clean on a regular basis, tell him to use a bicycle to get to work.",
            "He’s not stable…mentally. That’s not something someone who’s thinking rationally would do.",
            "Tell your husband he is actually dumb. It doesn’t matter if you two only take two showers a week if no one else is on the program. It’s not like all humans are given a lifetime supply of water and how they use it is their business. If the world’s water runs out, it runs out. You guys aren’t going to have more left because you took less showers. It’s not going to run out in any noticeably slower way because two of you took lesser showers lmao. \n\nAnd what do you mean, “won’t let you”? Are you a child? Just take as many showers as you want. What is he gonna do about it? You’re an adult. If he doesn’t like it, he can leave. Tell him to shut up and take his stinky butt to therapy.",
            "Why are you still subjecting yourself and your children to a nutjob?  Tell him he goes for in-patent treatment or you are filing for divorce.",
            "Does he eat meat? I aint here to preach vegan or whatever, but meat agriculture is one of the biggest uses of water. How about paper, is he saving ever scrap to reuse?  If he wants to save water and the environment, cutting out support of industrial uses is a bigger change than showering less.",
            "Allowed to pay for gym membership but not water in your own home?",
            "**DUMP HIM.**",
            "He would kill me. I take baths daily. Just for fun.",
            "DIVORCE!!!!",
            "This is ridiculous. You should 100% move out for a bit to try and knock some sense into him.\n\nBut my petty ass would probably stay and instead go OUT OF MY WAY to make myself as disgusting as possible lol. Go to the gym every day and then come home and not shower, go outside to do yard work and not clean up afterwards, etc. Just make myself as sweaty and gross as possible and then when husband said something I'd be like \"oh sorry I already hit my quota for the week so I can't clean up\". I bet living with a partner who is completely unhygenic will change his mind real quick when he realizes how gross it actually is",
            "are you fine with the kids showering only twice a week? are the kids upset? I would just overrule him on this one or you could take \"navy showers\".. like just turn water on to get wet and then turn it off while you lather up/soap. Then turn it on again just to rinse off. You could also suggest getting a rain collection system from the roof.",
            "as an environmental scientist, you do not need to worry about a water shortage unless you live in the American southwest or South Africa. good on him for getting a water filter though, tap water has influxes of being nasty",
            "We live in a snow globe. The water on planet Earth isn't going anywhere. Tell him to start fucking build his own water tower to collect rain or something. Cuz yeah, that's pretty fucking crazy.",
            "Move out!! But leave some febreeze when you do to help control the funk waves floating off of him. ",
            "Divorce is always an option. This behavior is unacceptable.",
            "Not overreacting. Does he have a psychiatric history? This sounds like a manic episode from someone with bipolar, ADHD, or OCD.",
            "For anyone curious, here’s a little info on OP. She’s a serial story teller on Reddit\n\nhttps://www.reddit.com/r/AmIOverreacting/s/CfKdgJGwGk",
            "He needs to go to counseling before he becomes a crazy unibomber!",
            "Wait till he finds out that the water usage of an individual household is nothing compared to that of manufacturing and agriculture. If every household stopped using water, we would still have water shortage issues.",
            "FFS, so many red flags here. Ultimatum: I wash my a$$, or I am out of here...",
            "Sigh, ok....are we being punk'd?\n\nI'm relatively new to this sub, but jesus, all of these \"posts\" sounds so damn fake. \n\nWhere are all of the fucking normal people with normal ass problems? \n\nIs this something kind of John Quinones and \"what would you do\" bullshit type of study?",
            "Too controlling, this is something that should be discussed between you two, not one forcing their will on the other. There are otherways to save water/the enviroment that dont take things away from other people.",
            "Your husband sounds like a moron. ",
            "More rage bate new account, fun times Reddit has become.",
            "Tell him his rule isn't gonna suddenly save the planet. Its like recycling, sure you can do it but for every bottle you recycle there's thousands of people just tossing there's in a trash can",
            "Man I'm so spiteful here's what I'd do - It'll suck for a bit but I'd let myself become \"gross\" for a bit so he learns a lesson. Stop shaving completely and become a fuzzy furball. Start doing your workouts at home. Get nice and sweaty in front of him. Bonus points if you \"forget\" deoderant. Then stick to your no-shower rule. Then maybe try to initiate some romance later. If he wants you all to live in an unhygienic life, make him embrace it lol.",
            "You are being abused. This is not a lover's quarrel and this is not about his personality. He's not the king of the house. You have some decisions to make.",
            "As someone with OCD, this sounds like OCD. I don't want to armchair diagnose anyone, so definitely take him to the doctor, but I think it would benefit you to look at this through a different lens. How severe are these \"concerns\" of his? Has he ever tried to rope you into them before, even if it was something you didn't mind doing? How long has this been going on, has it been a lifetime thing or have you noticed it starting recently? \n\nRecent, drastic personality changes can be mental health related but, not to alarm you, they can also point to physical brain issues like a tumor or aneurysm. It's good to keep this in mind because psychiatrists are often the first person people go to and easily overlook physical problems all the time. \n\nAssuming this is in line with what you'd expect from him, he will need to see a psych professional, and with a combination of medication and therapy, he can come to understand that showering more than 2x per week will not cause the world to end. OCD is characterized by excessive, unrealistic, and catastrophic thoughts about what will happen if you don't do a certain thing a certain way. If he does have OCD, he may genuinely think that if you shower more than 2x per week you will personally accelerate climate change to a significant degree. These thoughts aren't fun, they cause huge daily stress and in my case can take up HOURS of mental energy daily thinking about them and worrying about them nonstop. Consider getting him some help.",
            "You aren’t overreacting and your feelings are valid. I don’t think he’s coming from a bad place, but marriages are full of compromises. This is a compromise he needs to make. Showering twice a week is gross, to be honest",
            "The park that stands out is he created a new rule.\n\nNo reasonable person would think they have the right to create an institute new rules for an equal partner",
            "I already would have moved out. The volume of water on earth never changes, it just alters form and location. Tell your husband to get his head out of his ass",
            "He can't just make up ridiculous rules and force you to follow them. This is beyond not normal behaviour. I can understand rules about making a mess. But I you exercise and sweat you need a shower. He needs to realise this is not normal or OK. It's controlling behaviour.",
            "The main problem I see here is that your husband unilaterally made this decision for the whole household and you just let him. He is not in charge of you. He is not the boss of you. You are partners. If he can't understand that and start adapting his behavior around that essential fact, then yes you should absolutely move out until he gets it.",
            "All jokes aside, kind of sounds like he needs therapy, and indulging in these rules has given him the idea that it’s ok to give you a quota. His choices are not your choices,  and even if thats frustrating to you, he will have to move out- not you, if he is so worried about the environment. This is coming from a Birkenstock wearing, mason jar-toting, buy-local human: I am not intending to be horrible about him or his personal beliefs, but he absolutely should not be putting them on you, or further, teach your children that paranoia is the way to go.",
            "If my husband did this, I would ignore his lunacy and leave every night to shower and sleep at a friend's or family member's home until he came around. If he refused to come around id divorce him. He has ZERO right to tell you how many showers you are \"allowed\" to take. \n\nIf there are children involved, he can deal with them.",
            "Just turn off the main circuit breaker when he is on the computer.",
            "He sounds like he might be mentally ill.",
            "He needs a mental health evaluation asap. This is incredibly abnormal behavior and reminds me very much of my own more extreme OCD behaviors before I got therapy and meds.",
            "This is obsessive thinking and requires therapy. Don't ask Reddit, get him in therapy. Stop trying to reason with him, it's not a reasonable perspective because it's a psychological condition.",
            "Generally speaking, paranoia never lessens.",
            "Sounds like your husband needs help. Not going to shit on the guy because if could be so many things. \n\nOP, this is not normal behavior. Please, do not let this person control a simple right like showering. Normalizing this opens the door for other insanity that will surely come in the future. Today it is showering, next week it could be something even crazier. \n\nThat said, Divorce should always be an option. Not suggesting a divorce here, but don't ever deny yourself the possibility of separating from someone who might destroy your life.",
            "The amount of water that your household consumes is a literal drop of water in the ocean, compared to what large corporations are doing.  He should expend his concern towards those companies instead of attacking his family. If you could afford it - move out. Your house- your water bill - your shower time- your rules. If you move to your parents I would suggest packing your items in storage short term so you let him know you mean business.",
            "Not letting you or a 14 year old boy shower regularly is abusive. Like cps could get involved abusive if the school figures this out. You are not over reacting.",
            "These are the kind of nut cases that are creating AI’s",
            "So this is fake? \n\nhttps://www.reddit.com/r/AmIOverreacting/s/DZAwhB3dt5"
        ]
    },
    {
        "post_id": "1c5p2kb",
        "author": "None",
        "title": "My husband told me why he cheated on me",
        "url": "https://www.reddit.com/r/AmIOverreacting/comments/1c5p2kb/my_husband_told_me_why_he_cheated_on_me/",
        "score": 22249,
        "num_comments": 9830,
        "created_utc": 1713296031.0,
        "selftext": "It just came to my attention that my husband has been cheating on me on and off for 2 years. He started cheating on me while I was pregnant because I didn’t feel like having sex due to pregnancy symptoms. He cheated on me with two different women. The first girl was a stranger he just met when he was out one night. But there’s this one girl in particular that he keeps having sex with. They’ve been friends with benefits for almost a year now. I asked my husband WHY. WHY WOULD HE DO THIS TO ME. We have a family together, we built a life together, and he threw away 8 years for a girl that hasn’t even graduated college yet? \n\nHe said to me, “she’s beautiful. She’s quiet, she’s simple, she’s not annoying. She doesn’t nag me. She doesn’t argue, she’s not combative. She’s not fat and she’s not lazy. She’s fun, she’s spontaneous. I forget about my troubles when I’m around her. She makes my life easier oppose to complicating it like you. She’s just everything that you’re not anymore but you use to be. She’s a younger version of you. She reminded me of you 15 years ago” \n\nI’m honestly still processing. It doesn’t feel like it’s real, I keep thinking I’m going to wake up from this nightmare. I feel so bad about myself. Everything he said to me actually made me feel worse than when I found out about his affair",
        "permalink": "/r/AmIOverreacting/comments/1c5p2kb/my_husband_told_me_why_he_cheated_on_me/",
        "comments": [
            "I am in a similar position.   My heart breaks for you.  I read this and realize we both deserve so much more.  You aren't breaking up your family by leaving. He did when he cheated.",
            "Your husband is awful. Cheating is bad enough, but cheating on your pregnant wife? Carrying your child? Insanity. I am so sorry. What a piece of shit.",
            "Sweetie, just leave him, please. That man is cold and nothing good will come of it if you stay.",
            "Yeah I was all those things until I married you and had to get our life together. I guarantee if you leave and he marries her she will become all those same things!",
            "Asshole.",
            "Correction: your husband gave you *an excuse* for cheating on you.\n\n\nThe *reason* he cheated on you is *because he fucking WANTED to.*",
            "Definitely speak with an attorney. Then, go cold. It takes so much strength, but you can do it. Everything through lawyers, and everything you can get. Calm and calculated.",
            "Leave his ass and take his child support for the next 18 years.",
            "Yeah… every women is fun till she has children, the majority of the work and a shitty husband.\n\nWhy can’t you be fun again?\n\nBecause of my shitty husband.",
            "Get a lawyer. Document everything and take everything you possibly can from him. The thing about cheating is it’s not the emotional bit….. he doesn’t give a fuck about risking your health. What if he caught something and passed it onto you. I am so so sorry but you will get through this. Make a plan and take everything",
            "Like damn. How would the AP not be offended?\n\n“She does what I say and doesn’t speak” isn’t a compliment. That’s not a roll of be happy to fill either. He wants a *sex doll* I wouldn’t feel bad any more about him cheating. It just shows He’s a loser who cannot build meaningful relationships with real people",
            "Why are you asking If you’re overreacting?  your partner is cheating on you - he shares his body and the most intimate of moments with another woman.  How are you  not furious?   She is that way because she doesn’t have to live with an asshole like him and take care of him, his house and his kids.  Financially, they’re not in twined so he doesn’t fight with her about money.  How stupid is this man?",
            "She’s a fantasy, you’re reality, and he’s an immature prick.\n\nDivorce him.  If he had accepted responsibility then still probably divorce, but there a sliver of hope. Not one in a hundred, more like one in a million.  Still a chance.  \n\nBut no.  He put you down while putting her on a pedestal.  Then told you to change for his benefit.  Yeah, no.",
            "Your husband is disgusting. Leave him. He doesn’t love you, he doesn’t respect you. Get tested for STD. I hope you are in a fault divorce state! Get a good lawyer.",
            "There is no version of his story that can be construed as acceptable.  His reasons are beyond asinine and selfish... You are 100% justified in feeling betrayed and leaving him.\n\nI urge you to find the strength to do exactly that.. leave him.  I don't normally urge this to people I haven't met or only know part of the story, but assuming you are being truthful in what you wrote.. he's a cancer.. leave as soon as you are able.",
            "Get out now, divorce him....and. get EVERYTHING.  I bet he cares about his bank account.  You have HIS children to support.",
            "Him: 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩\n\nLeave his loser ass. He isn’t worth anything.",
            "As a child of divorce, please don’t stay for the kid. Sure it sucked at first cause I didn’t really understand what was happening. But I got to see my mom become a happy, thriving, confident woman who eventually found a man that treated her right. If she had stayed with my dad then I would have grown up thinking a controlling and emotionally abusive relationship was right and that submitting to a man and putting his needs always above my own was how you’re supposed to do it.",
            "So he’s just avoiding being an adult & the responsibility that comes with it ….. wowzer!      \nSend him on his way, get support & custody",
            "This was literally a comedy sketch about a wife catching her husband cheating on her with herself. He built a time machine and went back in time to date his wife before. I feel like the verbiage of what he answered is exactly the same as that comedy sketch",
            "So basically, life got more responsibility filled, and he gets to pretend to not be a married father when he's with her. Of course she doesn't nag him, they only meet up to bang, she doesn't have to deal with him not changing any diapers or refusing to contribute to household chores. Nagging isn't even real most of the time. It's just a request for help in a timely manner. Yes, nagging does happen, but most of the time people just want help and it's not real nagging. It's not you, it's him. ",
            "Oh honey this isn't your fault. She seems perfect because it's fun and casual right now. A man once left for a girl he cheated on me with gave me almost the same excuses too. Guess what? He got into a relationship with her and moved in with her and he regretted leaving me haha. She wasn't so perfect once she wasn't a side chick. \n\nYou deserve so much better. I know it hurts and it sucks so bad. I spent years wondering why her and all that. You'll get through it. You didn't say how old you are but I'm probably older, if you need someone to talk to I'm here.",
            "If I’m being real with you, play his game, start saving up money to move out, buy gift cards when you go shopping or get cash back. \nHe cheated because he is a pig not because of anything you did or didn’t do. He loved you enough to give you his child so clearly you aren’t fat, combative, or lazy. He truly doesn’t see your worth. As much as it hurts your heart to experience something like this you have to think to yourself, “what kind of example am I setting by showing my child it’s okay to stay with someone if they cheat on me.”\nHe will never change and knowing that you don’t/or won’t leave strokes his ego. Surprise that motha-fúcka by renting a U-Haul when he’s at working and cleaning your place OUT.",
            "r/abusiverelationships \n\nI'm so sorry he's made you feel bad about yourself and responsible for HIS moral shortcomings, for being so horrible of a partner that instead of being there for you though your pregnancy, which is half of his doing, he decided to be so selfish as to abandon you and then blame you for it. Just because he couldn't jerk off or go without sex and work on being a better person, maybe get a hobby? He's not fit for a relationship and you deserve so much better. \n\nOf course he vibes with someone half his age - that's where his emotional maturity is at. \n\nI hope you get yourself STD tested too.",
            "Ooo, STDs. What an a-hole",
            "Do let her have him and deal with all of life’s common occurrences. They only enjoy each others company because they meet every once in a while, the affair is an escape. Let her have him and watch it all blow up, of course she’s gonna be fun she doesn’t have to put up with him in everyday to day life. Smh and for him to put that all on you, he’s pathetic af. What has he done to keep it fun? I’m sure you’re not even “nagging” he just doesn’t wanna hear what you have to say.",
            "He is blaming you for his behavior. He is immature and doesn't deserve you .",
            "Take it from a man,  no matter what he says - Dude has no honor and will do it again. Find your center and steel your resolve then walk away and don’t look back.",
            "Get a big fat divorce attorney and get a huge divorce.",
            "Say bye!",
            "I'm so sorry you are dealing with this. I had a friend who dealt with a very similar situation.\n\nThe sidepiece demands no responsibility. No mortgage, no picking up the kids from daycare, no cleaning of a house, etc. It's his escape from responsibility.\n\nHe just wants to have fun and is sick of the responsibilities of adult life, and the responsibilities that come with having a long-term partner and family.\n\nIn my friend's case, I don't think it had anything to do with her, other than having the expectation that her husband participates in the responsibilities of family and home life.\n\nIt's very possible you are with a man-child who has decided it's easier not having responsibilities, and getting his emotional needs met with someone who requires very little of him is an escape.\n\nYou need counseling, as does your marriage. If he commits to re-engaging in the marriage, the first thing to go is his girlfriend. If he can't do those things, I think you have your answer. This isn't about you, it's about HIM and his aversion to being responsible and held accountable. Life with his sidepiece requires neither responsibility nor accountability.\n\nI would also take a very tight accounting of where all of the family money is, and how it's been spent. Do this discretely. You will likely find lies elsewhere too. I would also reach out to a divorce attorney to figure out how to protect yourself. There are steps you need to take to ensure that if the marriage does end in divorce, that he hasn't stolen all of the money, and that you can get fair support for the children.",
            "Sounds like that asshole needs to be single.",
            "OH NO the girl who he hasn’t betrayed and treated like shit is fun to him.. HOW SHOCKING! \n\nTime to divorce. You deserve better. You gave so much to this pathetic excuse of a human. Time to put yourself first.",
            "what a gigantic fucking baby your husband is. seriously, what a loser. he betrayed the woman he made vows to & destroyed his child's family unit because he wasn't having FUN anymore?! pathetic. you're going to be so much happier without him. he isn't worthy of your love or anyone else's. \njust wait till this moron realizes that it doesn't matter who you're with, life simply cannot be \"fun\" all the time. he is in for a very rude awakening.",
            "You're married to an AH that does not know what responsibility, loyalty, family, and love is. Just a horny  selfish bastard is all he is",
            "soooo you dumped him, right?",
            "I know a way for you to loose weight, be more carefree and find happiness. All these things will happen once you’re rid of him. If they stay together, he will suck the life out of her too.",
            "That college girl won’t be so carefree when she is taking care of his crying baby while he’s out looking for someone who is happy and not naggy.",
            "Wow, imagine that - a woman you just have sex with expects less from you than a woman who carried your child. What a SHOCK. What a CRIME. Who will think of this POOR MAN. \n\nThrow that hot steaming piece of garbage all the way away. \n\nAnyone who externalizes their misbehavior like this is irredeemable.",
            "Dude I hope this is fake. You can’t possibly have this low of self esteem. If you do, honey, please, please please take a long look in the mirror. And repeatedly tell your reflection *i deserve better*\n\nHe had plenty of options to address his problems with your marriage before sticking his dick in some young girl.",
            "WOW. My husband fell MORE in love with me as a mom. Just the other day on vacation watching me be a good mom got him to a point he had to wait to leave the pool due to an... uncomfortable situation. Haha. He just loves watching me be at my best. I definitely got a good one reading stories like this make me sick. It's a shame not all men fall deeper in love with the mothers of their kids. Always looking for the younger models instead of growing with the person you fell in love with.",
            "It sounds like he made a compelling argument. It’s a universal truth that wives become insufferable the moment you marry them.",
            "So you're not fun and spontaneous anymore because you actually take your responsibilities seriously.  You're a nag because you have to tell him what to do to contribute to the family.  You're fat because you had children, HIS children, which fundamentally changes your body and also likely because you are too busy to do the things that make weight loss possible (if that's even what you want).  The dude is telling on himself when he thinks he's criticizing you.  He's a shitty partner and I bet your life would be easier without him.  Might even bring back that carefree you he's whining about losing.",
            "Wow. First off I’m so sorry. That’s horrible. You’re not overreacting, he needs to be divorced and made to pay child support asap.",
            "Dump him. If she's the perfect woman, let him go be with her while you find someone who genuinely loves you. I'm willing to bet he'll want you back, but do not let him. He made his choice now he gets to live with the consequences.",
            "Maybe instead of taking the time and effort to cheat (because it does take that) on you he should put time and effort into dating you, letting you have some me-time, sharing the mental load of a household and parenting…. Maybe, just maybe then you would “nag” (hate that word) less, be more fun, have space to be more carefree, I could go on. \nThis man is a child and does not deserve you! I am so sorry. I hope you find healing far, far away from him!",
            "Huh.  Who would've thought, back when we were making a life-long promise before God and society until death do us part, that we might ever change in appearance or behavior?",
            "What I hear is \"I wasn't capable of growing alongside you as we built an increasingly rich and complex life - I can only handle the kindergarten version of relationships.\" Get your financial ducks in a row and leave the shallow bastard.",
            "Man's is having a Mr peanut butter arc Jesus christ",
            "You can never reason with a man stuck in his past",
            "I don’t know you, but I can tell you this whole-heartedly with one hundred percent certainty. He is not worthy of you. It’s unlikely that he ever was. You’re the prize in your relationship. You deserve better. You’re worthy of more. It hurts right now, but this is a good thing. You finally know how useless, weak, & pathetic he is.",
            "He likes that she's too young to have experienced life. Leave him. Take him for all the child support and everything since he cheated.",
            "Because he's a narcissistic self-serving jerk, ditch him.",
            "Please leave & never look back.  Yeah you were young skinny & carefree b4 you became an adult, wife and mom.  The same will happen to sidechick.  If he wants to be the old creepy sugar daddy for college girls he can go live that pathetic life.  None of them will love him they'll just use him.  Hold your head high and know you're worth more.",
            "Parenting is hard. You have to grow and change and you gain a lot more responsibilities. He didn't want to do that. And he sounds worthless as a parent and husband. Don't sweat his opinions if you can. He's an immature dweeb. Hope ditching him isn't too bad.",
            "Hahahaha it’s easy to be all those things when she hasn’t had to pick up his dirty clothes off the floor, hasn’t had to carry and birth his baby, hasn’t had to carry the entire mental load, hasn’t had to do the majority of the childcare, doesn’t have to worry about the bills, hasn’t had to tolerate a cheating narcissist for YEARS. Let him go baby, she’ll be you in a few years, then he’ll trade her in, too. He only cares about himself. One day you will see this as the blessing it is.",
            "I love how he describes all the ways this girl isn’t you and we all of us here know the only reason he can say that is because she isn’t married to him!! Also he’s describing a doormat. So gross.\n\nDon’t internalize his excuses for cheating. He is the biggest defect in the relationship. This is a cheater looking to justify his terrible behavior.",
            "that person….sounds like a cruel child. Man child. If he claims to have cared about you, he would not have been so callous and irresponsible",
            "He did this because he’s selfish, leave him. You can repair your life. There’s plenty of single men out there who are looking to get married and be the counterpart you deserve. I’m sure you will have trust issues, as you should. However in time you will heal from this. Life is about lessons and growth and some of the lessons are painful. Remember it’s not how hard you get hit, it’s if you can get back up and keep going.",
            "Underreacting",
            "Are you overacting? Seriously? Did you read what you wrote?",
            "Yall are adults and he wants you to keep acting like a young college freshman yuk",
            "Tell your husband you’ll work it out. Go out and meet a rich guy to solve all your problems. I’m sure your husband will be shocked at your newfound happiness! Ok jk… the mature thing is to leave him",
            "Your husband is a jerk.  No other way to put it. \n\nThis girl is still in college and has no real life experiences.  He claims she’s fun and spontaneous, well that’s because she has no responsibilities to take care of.  She’s this shiny new toy for him.  Just a warm body for him to sleep with and a pretty face and nothing else to bring to the table.  \n\nMake sure you get tested for STDs and tell him to foot the bill for it too, because you didn’t tell him to have sex with random women.\n\nThen I would ignore him, work on myself and when I get back to improved version of the person he claims I used to be, I’ll kick him in the ass and move on with my life. \n\nYes, you’d gain weight.  You gave birth to a child.  At least you can lose the weight, what can he improve about himself that still wouldn’t make him an ass for stepping out on his family?  Nothing!\n\nDivorce!  Plain and simple!  His mistress that practically still has breast milk around her mouth can keep him.",
            "She has no accountability or expectation of him.  Your husband is exactly the kind of dude who wants women barefoot, pregnant and in the kitchen.",
            "What an absolute asshole. How could he say this to you, the mother of his children!? Unbelievable, what a total POS",
            "No! Fuck that guy. He’s a total selfish asshole. Leave him and take everything you can. Why would you put up with such a prick for even one more day? If this were your sister or a good friend you know what you would say. Treat yourself better, you deserve better.",
            "Actually he will wake up from his dream. Life is fun when you are the girlfriend and you don't live together and the dates are 'spontaneous'  but that's not real life.   This story reminds me of a card I saw with a insanely hot girl on the front and when you opened it it says just know that someone someplace is putting up with her shit right now",
            "Get the f__k out fast do it now what a piece of trash take him to the bank! I’m soo soo sorry I deserve much much better",
            "You’re married to a toddler. I hope you leave him and become happy again",
            "First, I’m so sorry that this happened to you and your family.   \n\nI’m\nA married man (38 years), with two children and I want to be clear.   \n\nGET OUT NOW!\n\nAffairs don’t just happen.  They are anticipated and planned.\n\nRegardless of the circumstances, your marriage is over.  I’m sorry.",
            "In other words, he's too lazy and immature to put any work into a real relationship.  He just wants a feel good girl to stoke his ego.",
            "Well I guess your getting a divorce then",
            "And all of a sudden his fuck up is your fault. Get a good lawyer, and clean out his bank account, take half his pay, his pension, house, what ever you can.\nThen sit back and watch the dick thinking dummy dump his whore because it's her fault...",
            "Ew. Leave. You aren't like thay because you have kids, a life, a job...you have stress that's partially on him too. Gross. He just victim blamed. It's on him for cheating. Not you.",
            "OMG, what a piece of shit. Leave.",
            "I once had a man who did this. Said something similar too we weren’t married but long term relationship and it came out of nowhere. Welp guess what? I let them have each other. Took less than a year until he realized what he thought was greener grass was actually weeds with bugs and dog poo in it. See once they are all they have to “go home” to they really get to see the person good AND bad. Right now it’s fun because there aren’t expectations. But oh how them tables turn. But… by then u will be long gone living your best life. chile let ms perfect have him. Get your alimony and or child support and love on you. Popcorn ready because baby when the karma comes u will have a front row seat. 😉",
            "Sounds like my ex with the entire mind fuck. Seriously? He is projecting his own issues so he goes to run and hide to someone else. Big baby.",
            "What an idiot! As soon as his side piece gets knocked up and she decides that she wants to be wife #2, the same thing will happen to him all over again. Cut your losses now! You can do so much better than this loser! You and your child deserve so much more than this.",
            "Sounds like he's a shallow asshole. He isn't capable of loving anyone properly. She is in it for the fun, but she'll never consider him for a full-time companion because she knows he's a cheater. You're better off without him",
            "Just leave him. You are not overreacting. If he couldn't keep it in his pants for 12 months for the mother of his child. Fucc him ✌🏾\n\nEdit: past=pants smh damn swipe texting",
            "This man has children with you?  After seeing what my wife went through I couldn’t imagine betraying her.  If I felt I would I’d have to talk to her or I wouldn’t be able to sleep.  Life is life.  This dude sucks and bad",
            "He is stunted and will be there forever. He is trying to undermine your self-confidence, that is all. His game is power. Leave and save your sanity and your kid's mental health. At some point the young ladies will laugh when he hits on them. Really, really sorry.",
            "Time to leave. This man doesn’t love or respect you.",
            "Everything he said about you are things he’s made up in his mind to justify the cheating to himself. You don’t complicate his life. When they get further involved with each other and real world problems arise like they do in every relationship, she’s going to nag him and “complicate” his life. \nIf you’re having to “nag” him about things no matter what it is- cooking, cleaning, helping with the kids, bills, etc, then those are things he’s going to eventually run into with the other woman as well when the facade he’s put on with her falls. Then he’ll be looking for the next girl and leave her as well. The things about you may be true, but not in the way he’s making it out to be. \nYou guys may argue but it’s over things you’ve repeatedly asked for like cleaning/helping with the kids/NOT CHEATING. But to him these are reasons to justify his cheating when cheating is NEVER okay. Even if you were the worst partner on earth, cheating would still not be the answer. Leaving would be. If he was so unhappy he could’ve left instead of keeping you around while he betrayed you in the worst way possible. \nIt’s foul and disgusting behavior. I am truly sorry he said those things to you, I’m sorry he tried to make you feel terrible about yourself so you’d believe him & think him cheating was justified (it’s not), and I’m sorry you were betrayed. It’s even more disgusting that he did it while you were pregnant. He’s out there giving his side pieces the things you’re at home having to beg for and that’s NOT okay. I really do hope you have the courage to leave. \nI know that isn’t always possible right away due to not having family/friends to rely on, or not having the financial ability to leave. But I hope there’s an opportunity for you to leave/make him leave and I hope you take it! Your worth isn’t defined by what a cheater thinks of you. Feel the feelings, pick yourself up, and start new for those sweet babies and yourself!❣️",
            "And if he gets with her, he will make her become you now. Rinse and repeat until the looks or money run out",
            "Dude just basically admitted that he ruined you over the past 15 years. He's going to be in for a shock when the next girlie turns out the same way.",
            "He sounds like a gigantic loser, and an immature dickbag. \n\nLet’s see how attractive he is to young girls when he’s spending half his salary on alimony & child support.",
            "He doesn't want a wife or a family. He wants a doll-child. He is trash, and trash can't handle a whole human WOMAN. Do not let his single brain cell cause you to doubt your value.",
            "Find a qualified trauma therapist; you are married to a person with narcissistic personality disorder.",
            "He did you a favor.  Don't waste another second of your life on him.  He'll come crawling back once this 'fun' girl isn't fun anymore, and you are with someone who treats you right.  Run.",
            "Little did he know, that will continue to happen once he settles down. Honeymoon phase is real and if you don't truly love your partner, you're gonna be like that guy lol",
            "Crazy thing is, he thinks these are good responses. He's done. It's time to get a lawyer and divorce him \nI'm very sorry you're through this.",
            "Of course he will try to blame you and will never blame himself. Of course he will try to do it in such a way that you are doubting yourself so much, that you'll stop blaming him. He wants you to shut up. Or actually, he wants to shut up any conscience that you or he or anyone brings to the table. Who else is an easier scapegoat than the woman that is in a precarious position, without independent finances and without time for herself because she needs to take care of kids.\n\nYou need a plan.",
            "What a Richard!! She won’t want anything to do with him full time-what a douche!  When a man lets his weiner do the thinking he obviously has more than one hole in the back.  Good riddance.  All my best to you sweetie-you absolutely deserve better 💜",
            "He wants a bang maid. You deserve so much better",
            "Honestly don’t get this women, or men for that matter, when we were married I ask my wife what would she do I I cheated on her, said very nicely the first time would be the last time, see you in Divorce court no exception.",
            "Well yes , she can be all of those things and full of life because she doesn’t have to put up with your husband and birth his child.",
            "Narcissism at its finest. Look into this personality disorder. He blamed you for his cheating, devalued you, then made you second guess yourself by saying “she reminded me of you”. He is never going to change. He does care that he’s hurting you. Be an example to your children, and show them how you set boundaries with people who hurt you.",
            "He really thinks she is making his life easier, hmm? Is this dude in for a rude awakening or what? Hon, please divorce him, get a good lawyer, take the house, half the assets and 20pc of his paycheck for child support. I am sure she will make his life so much “easier” when he’s in a rental furnished studio looking in the mirror at a middle aged washed up guy with a ton of baggage.",
            "Cripes, what a butthole.",
            "I mean just get me on the jury honey, not guilty",
            "So, he hates adulting and blames YOU?\n\nDo NOT feel bad about yourself.  Dump that ungrateful man-boy and make a life for yourself and your child.  That guy is a dead end.  Sorry, not sorry.",
            "Your husband is a child who deserves to be alone. Leave him and never look back.",
            "All these men and their midlife crises. What a pathetic cliche. No shit you’re not as carefree as you were 15yo years ago. You grew up! Something he can’t stand to do apparently. Hes a selfish, Peter Pan asshole. You deserve better. So do your kids.",
            "Not overreacting.  And you can do the same.  Tit for tat.",
            "Yeah.  It’s time to go.  Sorry 😞",
            "He cheated, because he’s the kind of person who cheats. He tore you apart over it, because he’s abusive and because he wanted to force responsibility on you. He’s making you the disgusting one, when it’s really him, you know?\n\nHe’s gonna do everything in his power to make you hate yourself and eat up responsibility while he does whatever he pleases. Every minute you’re with him is a minute of your life wasted.",
            "He is a giant sac of shit . There was probably red flags that you did not pick up on . I am sorry to hear this happened to you . I know it’s easier said than done but time to leave him.",
            "Not overreacting. I’m so sorry this happened to you.",
            "Wow, I'm so sorry. That is so cold-hearted. \n\nMy wife and I have had troubles with lack of sex for a number of reasons, but never, ever would I cheat on her... ever. It is so very cruel.",
            "Just my opinion. Nobody should be treated this way. It will continue for as long as yall are together. Start making plans.",
            "Let him go before you have a complete mental breakdown.\nHe does not care for you now and in the future.  Tough to leave ,sure but  a stress free life is much better. People do care .",
            "I don’t know where you live, but if it’s legal to record conversations without the other person’s consent, you need to.   Start recording and then basically get him to admit all the times he’s cheated and for how long.  Your divorce will go much quicker with that ammunition.   And you’ll probably get sole custody of your child.",
            "I hope he lives the last twenty of his years alone and miserable",
            "You are under reacting",
            "You don’t have to be perfect to be loved, still hard to actually believe but real ones make you know why that’s a saying",
            "He’s probably a narcissist, even if he’s not he sounds horrible.  There’s nothing to consider, he doesn’t love you and probably doesn’t love himself (and he shouldn’t).  Get out and get far away from him - regardless of the past and regardless of your connections.",
            "I know this isn’t much consolation now, but I hope this will make you feel better to know that he will most likely regret it.  \n\nApparently it’s a common phenomenon. These married men tend to seek out a young attractive affair partner who has the small percentage of things that are missing from the wife, the spontaneity, etc.  \n\nAfter the marriage ends, they try to live with the new affair partner for a few months, and after awhile the magic wears off.  \n\nThey realize that, although the new  person has the small percentage of stuff, the fun things, they don’t have the big things. The important things.  \n\nThey end up desperately missing their wives and children and the stability of family life, often finding that the young woman is dull or ends up annoying after all. They have nothing in common. The new woman is immature etc.  I think the excitement of the new woman being young or the excitement of the affair tends to mask the reality that they are ill suited.\n\nNot saying this happens every time, but it’s quite a common phenomenon.  \nGet your divorce and enjoy your freedom! ",
            "Sorry for saying this… but your better off with out him, he wants to throw away 80% at home for a 20% piece of ass, he’s sounds like a joke, I mean he’s willing to throw his entire family/life/home away for something/someone that is most likely using him for some sort of gains.. like I said what a joke.",
            "Oh just wait until you divorce him, OP, the new wife matures and starts nagging HIM about the house, kids, finances etc. He's not living in reality or in an equal partnership with someone that will make every day, normal demands on him or his time.  Please, love yourself enough to walk away from this waste of a man because he's sure AF wasting your time.",
            "And that girl he’s having an affair with will TURN OLD too! And he will do the same to her! LEAVE HIM and take good care of yourself and baby! God bless you and baby!",
            "Grandmother here. Please be careful as he doesn't appear to want to be a husband or father. It will be up to you to be strong and set the new terms for a decision he made. You deserve more than the nothing he is giving you.",
            "he sums up what a lot of men endure daily.  happy for him",
            "He’s a POS and doesn’t deserve you.\n\nHe has basically revealed he wants a submissive plaything with no real responsibility towards.\n\nOf course she’s “fun” cuz you smash and dash.\n\nHe sucks. Rob him blind and then throw him in the trash. You deserve justice for what he did to you.",
            "My wife gained weight from her pregnancy and she’s combative with me often. We used to party it up together and had a way more active sex life than we do now since we’ve had our daughter (makes it a bit more difficult now). But I love her even more today than I did back then. I would never want to risk losing my person by trying to relive some “glory years”. I think his entire statement is absurd.\n\nI’m sorry for what you’re dealing with. What he said is extremely rude and abrasive and is his way of trying to pin the blame on you somehow for something that is 110% NOT YOUR FAULT. You deserve better than that and you’ll find better out there. Be strong, the next few months will suck but you’ll get through it.",
            "He cheated on your because he's a self centered self absorbed adolescent who lacks self control, self awareness and worse. Lacks love. \n\nHe doesn't love you. \n\nYou not having sex with him is a load of BULLSHIT.",
            "The cheating would no longer matter because after my husband talked to me like that, I'd be in jail for cutting off his dick while he slept.",
            "The real question is what the hell is the other woman getting out of this?",
            "Take him for everything he’s got… then see how long the girlfriends stick around.",
            "He will keep dumping them for new, barely-legal replacements. It's not you, he just can't actually connect with someone and only sees them as something that brings him pleasure.",
            "Press # to bail. Not a good way to live your one precious life.",
            "Ugh dude are we all destined for this? \n\nMen turn us into a different person and then just eventually decide they hate the new person",
            "He did you a favor. If he really loved you he would have communicated how he was feeling to you so as a couple you too could work on things to fix it rather then just piss it away. His feelings matters as much as yours but he’s a lazy coward who lies and does not give a shit about how you feel so screw him. You won’t be pregnant forever, you will have this baby and become a better you and he will be missing out likely ending up alone forever. He’s a loser and your a woman who can literally produce other human beings. He has no super powers and will end up a nobody like he always was in the first place. Do you girl!",
            "Oof he has some maturing to do. He just wants someone who is submissive. That's a really bad trait to have. \n\nDon't blame yourself for him cheating. He just wants to feel in control of things and doesn't want to be considerate of others",
            "“You became so annoying by growing up and becoming an adult!! Why can’t you just stay forever 21???”\n\nYour partner sounds awful. The type that dreams about the stepdaughter shit online and makes your kids friends uncomfy. Or the type that turns 50 and blows your retirement on a car. \n\nI’m so sorry",
            "[deleted]",
            "What a fucking cunt!!! Wow. The audacity. \n\nYou need to leave this fool. He’s going to get slapped with reality and it ain’t going to be pretty. Take him for everything you can!",
            "I'm so sorry that you're going through this. Your husband is a massive asshole. He told you all that to make you feel like shit. He cheated because he wanted to and because he thinks his needs are more important than yours, if you and your family were even truly important to him in the first place. He wants to look good in front of others, which is probably why he stayed married to you and didn't tell you about the cheating for a long time. If you choose to work on your marriage and try to reconcile with him, you're going to have to live with the possibility that he will do it again. Cheaters don't care about anybody but themselves. They'll never be satisfied, because deep inside they're hollow and lack sense of self.\n\nThe only thing you can do for yourself now is to focus on you, your kid, and getting a good divorce lawyer.",
            "my ex also cheated several times and remarried  after me that lasted not even a year when she found out how lazy he actually was , best thing that happened to me was leaving that loser , now he is miserable and still calls me for advice and tells me how sorry he is for treating me like shit , I’m doing wonderful and moved on and I actually feel sorry for him now , he gained weight drinks all day and is miserable . lol",
            "Wow. He hit you with how he was feeling and and the situation he’s at in life. Family and commitment is not his thing so it’s time to move on ",
            "Divorce his ass. Take him to the cleaners.",
            "You are likely dealing with a narcissist. It’s a WHOOOOLE can of insane worms. Start researching what narcissists are like so you are prepared, as he will likely gaslight you constantly as you prepare to leave him. Truly - arming yourself with knowledge of what a narcissist is and how to deal with them will put you way ahead of the game he is playing with you. Best of luck.",
            "How a man treats you while your carrying his child has gotta speak louder volume.. i think it should hold more significance & in this case, he treated you wrong.. real wrong. Leave him",
            "That man does not sound like someone I would want my daughter to be with. Women go through all kinds of things in a pregnancy and they need support and understanding. Not whatever this is. Just do you love, noone should love you more than you should love yourself, noone should respect you more than you should respect yourself. Don't let some inconsiderate a hole ruin all the life you have ahead of you. I know it can be difficult but it is harder to be with someone who does not value you as you should value yourself.",
            "Yeah you can’t come back from that.  Leave him.  Someday you’ll find love",
            "Don’t ever feel bad girl. He’s trying to insult your current self but eventually everyone ages and changes. Change is inevitable and he clearly is insecure in that aspect. If you ever get the chance, leave him and don’t entertain this mess",
            "Dude is for the curb.  He's going to say & do the same shit to either of these women when you boot him out, and he has to live with one of them.  Find yourself a man, and send this boy home to his momma.  He's too weak for a family.",
            "OP, your husband’s words would have sliced like a dagger through the heart. I’m so sorry he made you endure his self absorbed cruelty. The only positive thing there is no mistaking what he is made of now. When people tell you who they are, believe them. Get a great divorce lawyer and stay strong.",
            "Tell him that the “you” from 15 years ago wouldn’t be caught dead with a smelly old fart loser who lost all his money in the divorce he’s about to have.",
            "What a cold bastard. Leave his ass and take the kids with you.",
            "Another man baby.",
            "I literally hate his guts enough for all of us.",
            "Your husband is a petulant child",
            "I was taught to not let anyone tell you they don’t want you twice. You need to run as fast as you can in the opposite direction, you definitely don’t want this guy in the long run. Go find someone out there that is actually worthy. Sounds like you dodged a bullet here",
            "… Damn. It’s all fun and games until that child becomes a grown woman and has grown woman goals and then she will outgrow his old nasty ass. I’m sorry sweet heart 🫶🏼",
            "Cheaters are going to cheat. That's their nature, then they're going to blame you as that's their nature too. I say let him have this young hoe and go figure out a life for yourself without him. You'll thank yourself for doing that later on. Hugs.",
            "Your husband is a cunt. He pissed away any redeeming qualities when he cheated on you multiple times with multiple affair partners. He doesn't want to be a husband or father. He wants to be a teenager again.",
            "Don't let door hit him in the ass when you boot him out of it. ",
            "Finding out WHY doesn't change the fact that he did it.   \n1. Kick him out.  \n2. Get into therapy.   \n3. Hire an attorney.  \n4. File for child / spousal support ASAP.  \n5. Enjoy your peace.",
            "Don't take it to heart. It's not like narcissists are going to say, \"I was horny, I like young women, and college age is the youngest I can go that's still legal.\" Instead, he gave you a laundry list, making her out to be perfect. (spoiler alert: she's not)",
            "Awesome. Let him have her and watch her turn into another you (which he doesn't deserve, and you're perfect just the way you are).",
            "Dump his butt. If you own the house, make him move out. You and the kids stay in the house. Open up a separate checking account first only in your name. Make sure if you work, your pay check is going into the new account. See a lawyer that does trial divorce law. Then get him for child support.",
            "he didn't cheat because of what you are or are not, he cheated because his ego is frail and needs to be validated by someone else. you are not responsible for someone else's actions",
            "Leave you deserve so much better than that. He doesn't realize it but you grew and he didn't. He stayed the same person while you grew because you had to. People change as they get older. Instead of looking elsewhere he should have changed with you and worked on what you both could do to bring the spark he missed. He doesn't realize that when you get married and have a family it complicates everything. My husband got with me because I was easygoing and everything I'm not now. But he changed with me the person he was when we met is not the same person I married; but still welcome all the same. If he's too immature to see that then he's not worth being with in the first place.",
            "Yeah ok. I know it a lot. You are a mom. But seriously you don’t want your kid to grow up seeing this marriage. Let him hide his head in whoever’s butt. Please I have been there , you are free now !",
            "Woah I’m a dude and I don’t want to get into other peoples business but it sounds like he’s not happy with you and that you’re better off without him. It’s still cheating but one thing would be to tell you that he just wanted to have sec and didn’t care who it was but to go into detail like that.. that sounds like he just shouldn’t be in a relationship or that he at least doesn’t know what he’s loosing.",
            "I’m sorry . I just had my baby girl too . She is 5 months old . My soon to be ex husband did the same thing to me . Good thing I have a place of my own now . And my friends are helping me out and my family .  My ex is now going to pay child support. Get that money and LEAVE! And focus on your precious baby . Congratulations mama much love 🩷.",
            "He cheated because of his deficiencies, not yours.",
            "Projection is real!! Misery loves company. He can’t accept he is wrong",
            "Men drag you down and then blame you for it. I’m sure you’re a beautiful person and an excellent mother and he’s an ungrateful piece of shit who expected a mommy wife and to be the center of your attention at all times.",
            "It's not you. Your husband is a selfish, childish asshole.",
            "You don’t deserve this at all. He’s using you and the life he built with you as a reason for lying and cheating. He’s intentionally trying to gaslight you so he doesn’t have to deal with his choices. He’s manipulating you. Find a good counselor and leave him knowing that long term you will be better off.\n\nIt sucks right now, your trust and self worth are in the toilet, but he’s actively tearing you down when he’s the jerk. He’s not worth your time. As you heal you will see this. 🩵 Hang in there!!!",
            "I hate to say this... And it might be a lost cause... But this man has some maturing to do... \n\nLeave him. And in ten years and a few kids later that quiet, simple, beautiful college girl will be you. And that's if he's lucky.\n\nIt's working now because I would assume he was still keeping up with you, etc. for appearance sake. Once that's gone he can devote all of his time to her, which will likely drive her off.",
            "He’ll ruin her. He is the issue. Focus on your child and let him go. Don’t waste one more moment speaking to him.",
            "Wow…It’s been a while since I’ve had this deep of a disgust for someone… your husband is horrific and you need to divorce him and milk him for everything he’s worth.\n\nI’m sorry that you’re going through this. You are worth so much more. And your husband is giving you excuses for his childish behavior. He’s just a giant AH.",
            "How could you continue to stay with someone who disrespected you and your children like that, and then he tries to blame you for his actions 🤡 I would be divorcing this man with a quickness",
            "Oh my god… first of all, I’m so so sorry OP. I really am. As someone who has been cheated on (when I was 7 mo pp) I understand how devastating and earth shattering it is.\n\nSomeone that tells you what he told you is 1. An evil POS. 2. Delusional, because he doesn’t understand that this new fun woman will stop being as special as he sees her now 🤡. \n\nPlease get yourself in therapy like YESTERDAY. Don’t make the same mistake that I did and dwell on what he said without someone’s guidance. Please, it will consume you and make you a shell of yourself. Second mistake I made: being so desperate to not lose my family that I gave him a second chance… only to have it eat me alive for months and for him to say “I don’t know if this is what I want” after all those months of dealing with the shitshow of feelings I had. now we’re back to square one separated. It would’ve been so much easier on my mental, emotional, and even physical health if I had just let him f off the first time.\n\nSending you discernment and strength.",
            "Sense of worth is important. Do not buy someone else's claim of your worth. Your worth is as rich as you believe it is. Head up to a better future.",
            "Holy crap your husband is a douche. I’m gobsmacked at the gall",
            "He told you his truth and his feelings. You may not agree and everything he said  may not be true about you. But the words came out of his mouth and unfortunately if you decide to stay those words and his actions will always be in the back of your mind. My advice would be to leave now and choose yourself. Love yourself. Don’t let his truth be your truth. \n\nTo answer the question of why he did it (cheat)- He is selfish and He lacks control. That part could prob be forgiven But \n\nWhy he told you those mean things-  You don’t hurt people you truly love with words like that. The cheating hurt but those words cut deep.  Leave and don’t look back.  Love ya self. ",
            "He has the maturity of an 8 year old. What a whiny, miserable asshole. I feel bad for you. Good luck. Find somebody who appreciates you. You deserve it.",
            "He has an idealized perception of her. He would have the exact same problems with anyone, it’s NOT you. You are not the problem!!! He clearly doesn’t want a mature, committed relationship. He wants the exciting beginning of a casual relationship with no expectations or responsibilities. She’s fun and exciting because they don’t live in reality. He’s a piece of shit and a decent man wouldn’t go out while his wife is at home and pregnant WITH HIS CHILD!!!!!!! I hope you have the ability and family support to leave this fuck face. I guarantee he’ll come crawling back when he realizes what he lost and I hope you laugh in his face.",
            "Cause he's trash. The man I loved and moved into his home 2 yrs ago told me he wanted me to move out, 2 days after my birthday. While I cried nonstop and was devasted to the point I was physically ill daily he be-bopped around carefree as if he didn't have a card in the world. Hung out with his buddy and left me sitting at home lost and confused. \n\nI bought a house 6 weeks ago.  And what I thought was an end to my world as it crashed down around me was actually the beginning of the most peaceful experience.  I don't live daily with anxiety anymore. I'm enjoying making my house a home and while I miss sleeping beside him nightly. I don't miss the stress of living with someone at all.  I can love him but now I love myself and my life.  \n\nIt's hard to accept change but it will honestly be okay in time. Hang in there. Letting go is tough but it will get better I promise. ❤️",
            "Just wait until he tries to marry that one and cheats on her for the exact same things once he drains the life from her too. Shit pile of a man- you and your children are better off without him. I hope you have a safety net to fall into after divorcing him :\\[",
            "It’s easy to have light hearted fun when you’re not doing real life with someone.",
            "I’m so sorry that your husband is such a giant asshole. You don’t deserve that emotional abuse and you’ll be better off without him. You’re stronger than you know, you can do it on your own two feet. Fuck that guy, you don’t need that toxic bullshit.",
            "This kind of stuff drives me nuts.\n\nMen who don't realize that people age.  Nobody stays who they were - especially ourselves.  It's totally unfair to try and hold a partner to these kinds of expectations.  We all get old.  We all end up ugly.  You need to prepare yourself for that because it lies in store for all of us.  Some of us earlier than others.  In sickness and in health.",
            "As Steve Miller said, Take the money and run!",
            "Leave him, take everything",
            "Repeat after me- “this is a him problem, not a me problem.” Please get yourself in therapy because he clearly has unrealistic expectations of a partner. I am so sorry you weren’t treated with compassion while you were pregnant. I’m so sorry you experienced/are experiencing being taken for granted on all levels. This is a him problem. Period.",
            "LEAVE HIM WHILE HE’S NOT THERE. Leave only divorce papers, this is not a man that you want your children to emulate or fall for.",
            "Not overreacting. U are perfect! He’s daft. He’s thinking the grass is greener on the other side but it’s worse on the other side because better the devil you kno than the one you don’t. But regardless, woman, u are perfect after kids. Don’t let anyone tell u otherwise!",
            "You definitely should leave him. He sounds like a gross manchild. And he didn't even have the shame to hold back that little temper tantrum. 😒",
            "Wow. That's horrible to say to someone and I'm sorry you had to deal with all of this",
            "I am so sorry. You don't deserve any of this nonsense and the fact that he's blaming you for HIS behavior is just... it's disgusting. Please leave him. It's hard, but you can do it. [chumplady.com](http://chumplady.com)",
            "Cue the cool girl monologue from Gone Girl"
        ]
    },
    {
        "post_id": "1cb719x",
        "author": "None",
        "title": "My daughter is having an affair with the married neighbor. I told her she needs to move out of my house ",
        "url": "https://www.reddit.com/r/AmIOverreacting/comments/1cb719x/my_daughter_is_having_an_affair_with_the_married/",
        "score": 18094,
        "num_comments": 6718,
        "created_utc": 1713884990.0,
        "selftext": "Last week I caught my daughter(21) leaving our neighbors house early in the morning. I was getting a drink around 3 in the morning and watched her leave their house and she snuck across the yard and went through our basement door. \n\nOur neighbor is married and probably 30. I assume his wife was gone for the night as her car wasn't there. \n\nThe next morning I went down to my daughters room and confronted her. At first she denied it, but she eventually said that she has been sleeping with him for a couple months. I lost it at that point and yelled at her. Telling her he is married and she is helping to ruin a marriage. \n\nI told her that she needs to tell the wife or she needs to move out. She is clearly upset and things I'm overreacting. My wife is also thinking I'm going to far.\n\nI get that the neighbor is the main issue, but I'm really disappointed in my daughter. She knows his wife and has even babysat for them. Is telling her to confess or move out too far? \n\nEdit: Wow, thank you all for responding. I'm sorry I couldn't respond to more of you. \nSome context I failed to put in here. \nMy wife is very upset. She isn't siding the affair. In fact, she was cheated on by an ex. She understands this better than I do. I think that is a big part of why I'm so angry. \nMy wife is also a better person than I am. She is the only reason I'm the man I am today. I have too much respect to let people, even anonymously, insinuate that she is a problem here. I should have done a better job in explaining her side. Any comments saying anything bad about my wife will be met with a big \"fuck you.\" \n\nWriting all this out and reading comments has been incredibly helpful. I haven't changed my mind, but it's made me think about the situation more. Especially looking at the future and my relationship with my daughter. \n\nI just shot a text to my daughter and apologized for my anger and asked her to go get a drink with me tonight and talk. I told her I'm sorry I didn't ask her how she is feeling. \n\nI need to get my composure back before my next work call here in a few minutes, but will continue to read and reply to comments as I have time today.  \n\nEdit #2: Just going to put thoughts here instead of commenting. Wow so many comments! While yes, I may be seeming to backtrack a bit with reaching out to my daughter, I don't see how that is bad. She is my daughter and I love her so much. \n\nFor those who think she would stop talking to us if we kicked her out - I raised her to be independent and accept consequences for her actions. It's hard to explain our relationship, but I know she wouldn't stop talking to us if we did force her to move. She also would figure it out as she is a smart woman. She would love out of our house, not our life. I'm always her Dad. \n\nOn that note, this is the Dad writing, not the mom as some of you have thought.\n\nAlso, not worried about violence from the neighbor's wife. Unfortunately she is a very sweet woman. Which makes everything worse. But I wouldn't put my daughter in danger. I confirmed my daughter hasn't told the husband we know. I will be watching his behavior as I'm not sure how he will react. \n\nLast thing as I find it funny. I was drinking water not alcohol when I saw her. I woke up and went to the kitchen and saw her from the window. But I appreciate the links to AA. \n\nI really should have made my original post longer. Sorry for all the edits. I'll update after I talk with my daughter. \n\nUpdate: Sorry I didn't update this last night. Forgot there were basketball games on and fell asleep watching. \nI went out for drinks with my daughter. It was awkward at first. We just talked about work and her schooling for a while. It felt nice to just talk about normal things for a bit. \nAt some point she just asked me if I was proud of her. I almost broke down when she asked that. I said yes I am proud of her. Though I'm not proud of the mistake that you made. I talked a bit about why what she did made me so upset, but that nothing she could ever do would make me love her less. \n\nShe told me more about how she got involved with the neighbor. I won't share too much. It's nothing terrible like many of you are assuming. They knew each other as they had her babysit their baby over the last year. One night she was out with friends and ran into the husband at the bar. That's when things progressed and the affair started. During this same time she was going through a breakup that was rough. I knew she was going through that, but didn't realize how bad it was. \n\nI told her that she is an adult and responsible for her own actions. That I don't want her in my house doing things like this. \n\nWe talked about telling the wife. My daughter is scared to tell her. She isn't sure how the husband will react once the affair is out. I'm going to go with her tomorrow while the husband is at work and tell her together. \n\nMy daughter also wants to move out. She said it's something she had been thinking about before. And now she said it would be awkward with this being in the open. She started to cry about how she didn't realize the damage she was doing. Knowing that she is the other woman and helped to break or at least hurt this marriage. I talked about her mom and her past and what that was done to her. \n\nThat's about it. We cried together. Had tough discussions. Tomorrow we will let the wife know and I'll help my daughter move to my sister's place for a while. I told her things will probably get worse before they get better.  ",
        "permalink": "/r/AmIOverreacting/comments/1cb719x/my_daughter_is_having_an_affair_with_the_married/",
        "comments": [
            "Holding her accountable for her actions while she's still living under your roof is 100% acceptable!! She's old enough to know each action has a reaction, good or bad.",
            "You're doing the right thing.",
            "No, I think this is reasonable. You're still giving her the option to come clean and continue living in the house.",
            "How long have you been neighbors? How early was she baby-sitting for them? Do you know the full history here?",
            "You aren't wrong. Stand by your words. That's gross and unacceptable.",
            "As a mom of a 19 year old daughter, I don't think you're overreacting. I would feel the same.",
            "I’d believe this if he wasn’t commenting on r/Sluttyconfessions to women who want to cheat on their husbands and to dm him if they “want to chat”. Think he has a cheating kink and faking it or a terrible father.",
            "Maybe the married cheating guy should be confronted by the father for sleeping with his children’s babysitter / his daughter.",
            "NTA- I expect that response from your daughter but from your wife?..👀👀👀👀",
            "It's the right thing to do. ",
            "I would be going to see the neighbor to have a talk about them fucking my daughter. I just wanna talk to him, I just wanna talk to him. This is weird disgusting and lecherous behavior on all fronts and should be blown the fuck up.",
            "I would be more pissed the neighbor is fucking my daughter. Than my daughter banging the neighbor. He knows what he's doing. Have you ever dated a 21 year old? Most are basically kids than can drink legally now. Yeah the should know better, but most don't.",
            "Got a question, OP. You mention your daughter has babysat for your neighbour? At what age did your daughter start this? I'm curious in case Neighbour has been grooming her since she started babysitting for him.",
            "If your wife thinks you're going too far, ask her how she would feel if she's on the receiving end of the affair",
            "[deleted]",
            "Please update how did the wife take the news about your daughter banging her husband?",
            "Cheating is the worst non-violent thing a person can do. That's all there is to it. You did not overreact. All she has to do is take responsibility, and if she can't do that for the most despicable thing a person can do... then, well, she's got a hell of a lot of finding out to do.\n\nEDIT: Some of these replies are whittling away at the last vestiges of trust I had in humanity. For fuck's sake, folks.\n\nEDIT2: I've seen mention that I must be young to have this viewpoint. I find that interesting, because it's the opposite. I'm pushing 40 and my age is why I feel this way. I've lost everything before, but still had the power of my partnership to rely on. That sucked, but I still had what was important. If I found out my partnership was a lie, though, that would cause me to lose part of myself that money would never cover. My age is what makes me value my partnership over money, and I say that as a broke ass. I guess we're all different. Still though, some of these comments are extremely revealing about what some of you are dealing with. Maybe introspect before you interject?",
            "If your neighbor is around 30 and your daughter is 21, that's an uncomfortable age difference. I would definitely stick to your guns about telling the neighbor wife about the affair and ending it. I strongly suggest getting your daughter to talk to someone (professional) about the relationship, and why she went for someone unavailable, much older, and that causes problems from her living situation.\n\nIt's not illegal for them to have had a relationship, but it is extremely worrying. Especially since you said she has provided childcare for the neighbor children.\n\nUltimately, I think making her confess is ethical, but forcing her to leave is a bad idea.",
            "Does your wife support her on this?  That would be my first question to my wife.  If she did, then I would ask, so you agree with cheating?",
            "Daughters are going to make incredibly stupid mistakes. It's our job as fathers to help them learn how to not make those mistakes and how to take responsibilty for them when they do make them. \n\n**This is not worth losing your relationship with your daughter over**. A lot of the advice you are getting on this thread is bad and I think you'll regret following it in the future. \n\nShe made a mistake. She needs to know it was wrong and also understand why it was wrong, then she needs to take responsibility for it. \n\nThe fact that your neighbour is shady and is ruining his marriage is a problem that ends at your fence line. Forcing your daugher to tell the wife is, frankly, exposing your entire family to chaos and strife that I think would be sensible to just avoid. \n\nYour daughter should end the relationship and you should confidently talk to that man yourself and tell him you expect no contact, but you really should just leave it at that. \n\nYou don't control your neighbour, you aren't responsible for his moral compass, you ARE responsible for your daugher's moral compass, you should NOT want to get involved in your neighbours marriage any further. \n\nRight and Righteous are different things and in parenting especially.\n\nI hope this alternative viewpoint is something you'll consider.",
            "If she was their babysitter, it’s possible the neighbor had been grooming her for some time. He’s a creep and a bad husband. You daughter might need some counseling to understand what’s really going on and how she deserves so much more.",
            "If you kick her out and the wife leaves the husband, your daughter could just end up moving there. I absolutely don't think it's going too far but it could also backfire. \n\nI would tell the husband that he has until the end of the week to tell his wife or you're going to. While I think it's a consequence for your daughter, I think it's the husband's job to tell the wife. And for the wife, it's probably better coming from the husband rather than the young girl next door who babysat your kids.",
            "She’s 21 but has no idea the pain she is causing to that family(wife). They have kids and this is going to destroy them when the parents get a divorce. He just wanted to see if he still has it by fucking a 21 yr old kid. Stupid piece of shit! She needs to STOP IMMEDIATELY!!!!  She needs to NEVER babysit or interact with him ASAP!!. If she can’t or he won’t then and only then tell the wife!! He would be outta control at that point and needs to remember HIS CHILDREN !!!",
            "I don’t like the “young and dumb” argument being made here. She’s 21 years old. By 21 you have fully developed a sense of morality and right and wrong. She began an affair with a man she knew was married as she babysat for him and his wife. Yes that man cheated on his wife, but we should not be babying a 21 year old. “Oh i was young and stupid then” is not an excuse to do terrible things. She ruined a family, a neighborhood, a marriage. She’s not 16 year who snuck out of the house. She’s a 21. The age gap is alarming too.",
            "Her only acceptable response should be to accept guilt and cut off that relationship right there as well as getting away from this man. \n\nIt's the right thing to do as a father. Otherwise your daughter will again fall victim to irresponsible affairs seeking men who will ruin her life because no matter what they tell her, she is nothing but a hooker they don't have to pay to them.",
            "You're not (entirely) wrong. There's another aspect to this that I think you're glossing over though. I assume the neighbor has known her for some amount of time. She babysat for them and is considerably younger than him. The neighbor has groomed your daughter. Even if she was technically of age when the relationship started, it was always incredibly inappropriate from his perspective due to the power dynamic created by her working for them.\n\nYour daughter definitely needs to break it off, but you need to confront the neighbor as well. Particularly if he has known your daughter for more than a couple of years.",
            "Not overreacting. I think she (and probably you) should sit down with the wife and tell her what's up. She should know and your daughter will (hopefully) learn a lesson. I'm not sure kicking her out will teach her a lesson tbh. She could easily just move out and continue the behavior.",
            "Dude  sleeping with the babysitter like he role-playing in a porno😂😂😂",
            "I would tell his wife.",
            "Your wife thinks you’re overreacting…?",
            "She doesn't' need to tell her, that's his problem but I think it fair she get out.",
            "Fuck both parties their both responsible, I hate this story of Medusa putting all the blame on her , yea it's shitty but fuck that partner she's doing it with",
            "The neighbors can help pay for her apartment.",
            "Dude got some hella karma for this. Gg",
            "You are a decent father. Keep it up. We need some standard in this world.",
            "Dangg, please update how it went telling the wife.  I really think you handled things great upon reading updates and such.",
            "Great job dad, good luck to your family!",
            "He’s handling this so well.",
            "Accountability it’s the hardest thing for a young adult to realize but the sooner the better. Good job dad 👍🏽",
            "Thank you for doing the right thing. Your daughter can be glad it’s only a private shaming rather than more public. I discovered that my husband had exchanged numbers with a young 20s woman from our banking institution and had been exchanging flirty texts and she expressed interest in spending time together and complimented on his looks. My husband came clean and we are working on things, after I notified the bank manager about the unprofessional conduct she no longer works there.",
            "We’re invested now - we need an update on how the confrontation went! Did it happen? What’s the latest?\n\nHope everyone is doing OK, all things considered 😔",
            "Your not overreacting; you're making your daughter accountable for her actions. There are consequences and your daughter should feel those consequences. I understand your wife doesn't want to kick your daughter out and you don't necessarily need to go through with kicking your daughter out but your daughter does need to understand, if this behavior continues, being kicked out becomes a REAL consequence. I would give the daughter a chance to stop this behavior, first.",
            "you’re not in the wrong no, your house, your rules. You’d be doing everyone a favor, the mom for letting her know about her cheating husband, the kids, and will be teaching her a huuuuge lesson. Mom is trying to cover up for daughter which is good, but you’re doing more harm than good by not doing anything.",
            "You aren’t overreacting at all. It’s time she moves out.",
            "Reddit has a perpetual and absurd fear and hatred of women cheating that almost rivals its fear and hatred of bullying, so obviously you're going to get the \"never talk to your daughter again\" advice thrown at you a few times.\n\nYour daughter is 21 having consensual sex. She didn't take any vows, she's allowed to sleep with whoever she wants. Your wife probably correctly understands that if you kick her out, you'll be *permanently* sabatoging your relationship with your daughter over moral scolding she doesnt even necessarily agree with you on. \n\nJust wondering, do you immediately terminate your relationship with every family member the moment they do something you think is morally questionable? Or do you just seriously think leveraging your daughters security in your home to make her quit fucking someone is going to work out well for anyone in the long term?\n\nReddit just doesn't give a fuck about any of that because caring about whether or not your daughter ever speaks to you again is way less enjoyable than witch hunting a 21 year old having sex with someone who is married. As if their own family histories aren't littered with similar stories they intelligently never had the gall to implode their families over. Feel free to let these freakazoids live vicariously through you, though, you'll farm the upvotes, at least.\n\n-1 daughter though lol",
            "If your wife thinks you’re going too far ask her if some 21 year old neighbors kid is okay for you to bang? Her reaction should be enough to convince her you’re right.",
            "You’re not overreacting. Your daughter is gross.",
            "Your kid is an adult and will do what they will. Are you willing to damage your relationship with them over this? \n\nI think a better way to handle it is to tell her how disappointed you are in her decisions and give her a week to tell his wife about it. If she don’t/won’t, you will.",
            "She was their babysitter? Perhaps this has been going on longer than you realize? Maybe he’s groomed her? She’s your daughter and deserves a bit more loyalty from her father, maybe the kind of parent you are is why she’s seeking out a father figure elsewhere?",
            "Bruh, the wife 🚩🚩🚩",
            "Stand by your words. You're doing the right thing. I'm honestly shocked that your wife isn't as upset.",
            "The fact they're downplaying the affair says a lot about them. You're not in the wrong. While your neighbor is fully aware of how wrong it is, your daughter is playing a part in it. And seems perfectly okay with it from the sounds of it. I'd be pissed and disappointed if I knew a had a daughter who was fine with that behavior with a married man.",
            "This man has been banging your daughter since she started baby sitting for them. Just saying. You don't just start sleeping with the neighbor. Things don't get flirty on the street they get flirty in the house.",
            "Nope. I think you’re right on point. Now. I dont necessarily think you should actually go through with it but make her think that you will. And what’s up with your wife, that’s supposed to be your road dog, ride or die. She should have your back on this",
            "She’s 21, she can survive on her own and she certainly knows better. Esp since she knows the wife and has spoken to her, that’s an extra level of.. yuck. I wouldn’t want someone living in my house that was capable of smiling in someone’s face while fucking their spouse. She needs to grow up and most people her age that I’ve ever known are already on their way out at that age so.. bye",
            "Oh man:  The Babysitter Trope.   Life just repeats and repeats.  \"has even babysat for them\".  Ouch (it does need to stop).",
            "You're not overreacting. This is good parenting. She needs to learn she made an adult mistake and that she needs to fix it like an adult or face consequences.",
            "Nah, you made the right choice. I would've done the same. Not dissing you or your parenting skills. I just disdain cheaters,  but i just wanna say your daughter is a scumbag for doing that and so is the husband for playing along.",
            "Not overreacting. You don’t have a say in what your neighbour does but you do have a say with your daughter.",
            "Right or wrong... Your house, your rules. No fucking the neighbors.",
            "You can't condone it... Her behavior is potentiality hurting other people. You have no choice",
            "Go tell his wife. ",
            "It's not her responsibility to tell the wife",
            "For me it's kind of a red flag that your wife thinks you're overreacting.",
            "NTA and it's a messed up situation, although I would personally not kick my daughter out. \n\n\nCheating is reprehensible and I wouldn't be happy if one of my daughters were in that situation. I'd talk to them and help them understand the gravity of it. But she's an adult and has free will. Ultimately, the blame is mostly on the cheating neighbor. He is the one breaking his vows.\n\n\nI don't think you have a duty to get involved in your neighbor's marriage. Consequences will undoubtedly happen to one or both of your daughter and the neighbor, but they don't need to come from you.",
            "Not bad dada, but drink in 3 AM?",
            "I’m not sure you really want her to come clean as that’s going to be super awkward with the neighbors.  But it does need to stop.",
            "Wait is she married? Who is she cheating on?",
            "She will just continue her affair with the neighbor to spite you if you make her move out.",
            "Obviously, she’s living under your roof so your decision to make, but honestly most of the consequences should fall on the neighbor. Do you know the real status of the neighbor’s marriage? Maybe they have an open marriage or maybe they are separated, etc. It may appear that your daughter is “home wrecking” but maybe the home was already wrecked? I think those details should be considered before rushing to any conclusions.",
            "In Brazil they say “pular a cerca”, which means “jumps the fence” to go be unfaithful with the neighbor. \n\nNot only is it unethical, but it’s just dangerous. \n\nDoes she not watch crime shows? How many times have you seen or heard of someone getting un-alived when a jealous partner finds out about an affair? Cheating is a dangerous game.",
            "I don't think it's a jerk move, but it's definitely going to impact your relationship with your daughter it sounds like even your wife. Which, I have questions about their point of view. \n\nI most certainly would touch base with the wife, if your child hasn't within 7 days or less. I might not tell her who her husband is cheating with because that might lead to some sort of violence against your family, but I would certainly at least give her the heads up that you saw a woman entering her house after she had left and staying the night.",
            "Sounds like your daughter needs to learn that actions have consequences. Be aware, this can permanently alter your relationship with your daughter and can potentially affect your own marriage.",
            "Not overreacting. I like the approach.",
            "Sounds like your wife already knew",
            "NTA.\n\nNow confront the neighbor for fucking your daughter.   The wife needs to know.  Shit is about to get very very ugly but you are doing the right thing.\n\nIf they get divorced, I'd be concerned about your daughter dating the man.  He will sweet talker her when his wife leaves him.  \n\nTerrible situation.  Fuck cheaters and shitty partners overall... Stuff like this absolutely ruins lives.",
            "You’re doing the right thing here. What they’re both doing is so so wrong.",
            "Agreed; you’re doing the right thing.",
            "She should be gone regardless. \n\nPlay stupid games win stupid prizes, she can go tell wife then find a new place to live sounds right to me.",
            "No, not overreacting.  What is your wife's reasoning for thinking you're going too far?  The kicking out part?",
            "I would consider why your wife thinks you’re going too far.",
            "Tell her to confess to the wife, I highly doubt the cheating husband will do it.",
            "NTA Kick your daughter out you gotta teach her that it’s a 🥶  🌎",
            "That’s just being a good parent. It’s just tough love. If you weren’t upset with it and didn’t say anything, you wouldn’t be doing a good job parenting. What she is doing is entirely wrong so no you are not overreacting, there has to be some sort of consequence",
            "My daughter is 24. She doesn't live at home but if she did and this was a scenario. I would be handling it the same way.",
            "There is no version of reality where this turns out good for anyone. OP’s giving daughter the chance to make the right choice or move out. This would be a tough situation to be in as a parent. I don’t envy you OP.",
            "That neighbor husband is a scumbag.",
            "Your daughter is everything every wife fears. Honestly you should be ashamed of her. Your wife is an asshole too. I’d be wondering about her now.",
            "You’re not going too far. Stand on your principles. She’s an adult and if she wants to make poor choices like this it doesn’t have to be under your roof. Imagine the shit storm that could ensue, with your family’s involvement.",
            "The only thing I wish had happened was that you discussed the possibility of kicking her out with your wife BEFORE giving the daughter the ultimatum.\n\nI agree with your decision, and it is absolutely fair. The daughter made a horrible decision, and accountability must be exacted.\n\nYour wife should have supported your decision. Her reluctance is giving red flags to be honest. She’s essentially encouraging this behavior, so y’all need to have a heart to heart.",
            "You’re a good person. Keep it up. Your wife not wanting her to tell would upset me personally.",
            "Actions have consequences time for ur 21 year old to find that out first hand",
            "Not overreacting",
            "You’re not overreacting. At least you’re giving your daughter the option to come clean or move out. Why does your wife think you’re overreacting?",
            "You’re doing the right thing, you don’t want to claim a daughter that is clueless in the head and doesn’t have self respect. Id have her tell the wife today",
            "She's gotta go.",
            "You are defo not over reacting. Someone has to do the right thing. Your wife is terrible also.",
            "Gotta take your side here, shitty situation but it sounds like from a parental perspective you’re doing the best you can.",
            "Gotta ask your wife if she really thinks this is acceptable. Really. No but really. Whyyyyy would the daughter think that’s a-ok? And can even look you or your wife in the eye after that? \n\nAnd when Neighbor Wife finds out… yeah OP, you’re in for it, just eternally blew up that neighborly peace (and friendship, maybe).",
            "Your wife seems to be ok with cheating. That's a major red flag",
            "Your wife is suspicious also if she thinks what your daughter is doing is ok ",
            "you are good person and of high moral character. do not change that and children do not always adhere to same value systems as their parent so you can only do what you can do. it was the right thing to do and no need to question your own conscience",
            "What does your wife think is a reasonable thing to do here?",
            "No, I don’t think it’s too far however I wouldn’t kick my child out but rather try to teach them the ramifications that will take place if she continues this. She’s 21 & old enough to know better but also young enough to still need your guidance. \nI think you should tell her to end it and if you catch her again then there will be consequences (you tell the wife). Also I’d be having a chat with the husband and tell him to stay away from my kid or I’ll be telling his wife.",
            "Nah. Kick her out.",
            "I would want her out for the simple facts she's a grown-up and causing shit with my neighbors. If him or his wife or both are psychopaths she's putting you and your home at risk...",
            "If she chooses to move out, ask the neighbor in front of his wife why he is fucking your daughter when the wife is away. Also, you might want to look at your own marriage. How is your wife ok with her daughter being a home wrecker. That would create so many questions for me.",
            "You are being totally reasonable.",
            "NTA and you are doing the correct thing. \n\nShe is an adult and needs to face the consequences of her actions. If she does not tell the wife herself then I would kick her out of my house and tell the neighbors wife myself. You cannot turn a blind eye to your daughter sleeping with a married man.",
            "The neighbor is an ahole for cheating.  Your daughter is an ahole for sleeping with a married man.  These two facts are connected but neither dissolves responsibility for the other.  \n\nYou're not overreacting for insisting she end it.  If she doesn't end it, then she should deal with the consequences of her life decisions.  She's 21. Not a doe eyed innocent being manipulated or coerced.",
            "What if she does decide to come clean?-- what happens to the affair guy?-- its gonna destroy his marriage,  likely..(and he deserves it..but...do they have kids?) \nOooh man...\n\n...but lets say your daughter...or the guy..comes out and informs the wife.. are you still going to let her live there? This is not going to end well either way--  she needs to get out and do her dirty work from somewhere else. If she DOES move out, and doesn't reveal the affair, do you plan to out them anyway?\n\n... I'm thinking of the fact that you have to live beside these people. I'm looking at down the road from now..the possible fallout..there may be a ton of misdirected rage or retaliation afterward, and ppl who are enraged, especially neighbors...can be capable of terrible things to make your life miserable...maybe this won't be the case..I hope not...but even if your daughter moves out, it's forever gonna be awkward as hell to live beside this guy...unless his wife throws him out of the house and lives in it herself...so yeah, this could end in many different ways. Wow..I am not envious of your position, this is quite a bombshell.",
            "Kick her out and tell the neighbors wife. I'd do both in the same day and not even think about it.",
            "She helped a man commit adultery, if shes this much of an adult she should be able to fend for herself",
            "Stay strong and stick to your guns. She needs to learn a powerful lesson here and see the consequences of her actions firsthand. Good luck",
            "NOT OVER REACTING",
            "Actions have consequences. It’s our job as their parents to make sure they understand that very important life lesson and better late than never. I’d also be alarmed by your wife’s response as she’s enabling the behavior, which puts her own in suspect.",
            "I don’t think it’s going to far. If that is how she is acting at 21 with no guilty conscience I’d get on her case even more",
            "You're 100% correct. But honestly, why isn't your wife taking your side also? To me, that is also super suspicious and would make me question my wife's own morals. I couldn't have my wife enabling such behavior. And if your daughter babysat for this man, what's to say he wasn't grooming her (if she was babysitting as a minor). Alot of questions with this one.",
            "NTA. Ask your wife if she would be supportive of you sleeping with 21yo girl living next door. You also could just tell the man's wife about him banging your daughter when she is away. Either way, something needs to change before your daughter is knocked up and screaming in the middle of the night at the baby-daddy next door!",
            "No you're not overreacting, but I'm concerned your wife thinks you are.\n\nTell the neighbours wife, she deserves to know her husband and a person she trusted in her home are POS's.",
            "Also your trying to prevent a lot of crap / mess from entering YOUR home. Your daughter doesn't have the right to bring crap into YOUR home.\n\n\nbecause we are all adults and we know shit will always come out in the wash. It's just a matter of time before your dealing with a angry wife knocking on your door.",
            "If she’s old enough to break a marriage then she can be on her own. Pack her bags and escort her to the door.",
            "your house your rules",
            ">I told her that she needs to tell the wife ***or*** she needs to move out. She is clearly upset and things I'm overreacting. My wife is also thinking I'm going to far.\n\nThat \"or\" needs to be an \"and.\" You don't shit where you eat, and her messing around with a neighbor is the kind of thing that is likely to result in retaliation or other disturbances in your home. This is an unacceptable state of affairs.",
            "I would lose my shit. You’re under reacting.",
            "Yeah you’re doing the right thing, hold her accountable for that.",
            "Stand your ground homie.",
            "NTA... you're doing the right thing.",
            "Nope. I would tell your wife that siding with the daughter is supporting cheating… and if she’s that kind of person, I might just have to reevaluate the relationship, and then I would tell her she needs to be incredibly careful on how she looks at this situation.\n\nI would tell your daughter pack your shit. I would also tell her she needs to work on herself if she thinks what she’s doing is appropriate. I would also tell her one way or another he’s going to find himself telling his wife what happened",
            "NO - You have no control over the neighbor who will ignore you.  You do have control over the daughter - who is a backstabber and an liar.",
            "Not only are you right but you should also confront your neighbor and scare the shit out of him",
            "Moves next door 🤦🏽",
            "She deserves the punishment. But I’d personally tell the wife and let her stay.  The cost of living is fkd ATM",
            "Not unreasonable at all.  Also, I’d be having choice words with the neighbor dude as well for sleeping with my kid that babysat for them.",
            "The fact your daughter babysat gives me a waving red flag. Did she babysit as a minor? Is Is at all possible the neighbor just maybe did something to her when she was younger...",
            "No she's playing adult games. Treat her like an adult",
            "Oh F no. I’d give her a week to come clean or you go to the husband and tell him you know and hint without right out saying the other neighbors do to. This guy is a predator. Tell him to stop messing around with your daughter or there will be hell to pay.",
            "The funny thing is your wife thinks the neighbor is the main one to blame. The affair is at the fault of both parties, in this case, the neighbor and your daughter (50/50). He is married and got into an affair with your daughter, and your daughter also consents and is willing to \"destroy\" a family and is also blamed and shamed for it. \n\nSoft parenting and no social shaming are the roots of the collapse of Western Society. ",
            "Sorry that it's your daughter but trash needs to go outside period.",
            "You are absolutely correct. You are actually helping your daughter by not enabling her behavior. You can't stop her but you can be firm in your integrity. She is hurting herself by depriving herself of finding an honest boyfriend. Developing her character and having respect and honoring other people's marriages. She's hurting  the wife whom she even knows. This hits home because many years ago when I was 15 the man I babysat for seduced me. I was his mistress for two years. It devastated my life filled me with guilt and I wish my father had found me out and acted as you are. Please hold your ground. You are doing something good for everyone involved. I sincerely hope your daughter gets out of this kind of terrible situation. She is lucky to have you.",
            "Nope, actions have consequences, what they're both doing is sick, especially since she babysits her kids, makes me wonder what shit she's telling the kids. If she doesn't fess up soon then please tell the wife, she deserves to know. \n\nAlso you may want to look into your wife and see why she's ok with your daughter being a desperate homewrecker. Tell the wife op.",
            "How does she feel that she broke the home of the kid she watches?",
            "I'd storm the neighbors house and tell him to come clean to his wife.  This is his freaking mess.  Your daughter needs help if she thinks that this kind of behavior is OK.  WTF is wrong with women who know the guy is married, proceed to get involved with him?",
            "\"I told her that she needs to tell the wife or she needs to move out.\" Make sure that the wife knows regardless. If her husband is cheating on her, there is no way to know if he's only been sleeping with your daughter; both your daughter and the wife need to get checked for STIs.",
            "\"I told her I'm sorry I didn't ask her how she is feeling.\"\n\nShe's not a victim here man. You don't have anything to be sorry about. She has consequences to face.",
            "Not over reacting. You are trying to raise a good human being.\n\nTo daughter: \n- affair is over or she moves out\n- she’s never to young to learn that sleeping with a married man (or anyone for that matter) has consequences. If you are old enough to have sex, you’re old enough to deal with your parents’s disapproval and the consequences of that disapproval \n- I wouldn’t make her tell the wife. This is between the husband and wife\n- assuming husband never tells or wife is okay with it, no more babysitting for them. \n\nTo your wife if she thinks you’re being too harsh:\n- “are you okay with me having an affair with hypothetical neighbor?”\n- “would you be mad at the AP or only me?” Of course she’s not okay with the AP and would want the girl hanged. Or slut shamed\n- “who would you rather hear it from- me or AP?” I think most women would say the spouse. Which is why (see above) I think you’re overreacting in making your daughter do it \n- “what consequences would you want the AP to face?” My guess it way worse than parents telling her to move out if she doesn’t stop",
            "She was obviously \"babysitting\" for a reason... I think you should beat up the neighbour 😁 & let your daughter off the hook.. That's just my honest opinion though. Besides, if you kick her out, the neighbour might break up with his wife and let your daughter move in with him",
            "Your daughter is a dirty homewrecker. If anything you’re too soft on her. Should’ve went to the wife and brought her to your daughter saying she wanted to tell her something and make her confess then and there.",
            "Nah somehow you raised a pos though as a parent its my worst fear.",
            "I think you should tell the wife and your daughter should still move out.",
            "Wow, how does your daughter feel about helping a man ruin a child's life and destroy a woman that trusted her with her child! \n\nNot overreacting. That kid she babysat is going to lose its home when the wife finds out, and they are innocent. Seems fair your daughter should face similar consequences when she contributed.",
            "Simply tell the wife.",
            "It’s a red flag that your wife thinks you’re going too far. How would she feel if you were fucking a neighbors daughter in your marital bed. People that come over often and or babysit your kids. Granted, it’s possible he’s slowly groomed her and I would suggest getting your daughter therapy but she’s old enough to know better and do better now. I wouldn’t cave on this. It’s disrespectful, gross and cruel.",
            "Not overreacting. Your wife’s under reaction is something to note. Id be questioning that seriously. \n\nThat said, your daughter is an idiot. Talk to her and make sure she wasn’t being raped as a child, by this piece of shit. \n\nReal potential for grooming here. \n\nIf she started this as an adult, then shame on you and your wife for raising that thing. If this started when she was a kid…well i hope you get a good lawyer for when you kill the guy. Retired Marine. DM if you need to know the best way to make a man cry.",
            "Definitely not ok, but your daughter is still young and developing mentally/emotionally, you don’t know whether she’s been abused or mistreated in this situation.\n\nThis is more on your neighbor for cheating. You should first make sure your daughter is okay, and try to understand the situation.",
            "I’d tell her to confess AND move out.",
            "I think she needs to end it or move to avoid potential violence if discovered. \n\nLiving that close means the spouse can be breaking down the door while still angry. Safer for everyone if she’s farther away.",
            "Good decision dad. Daughter or not, that’s disgusting behavior by both of them and at least one of them needs to be held accountable.",
            "You’re doing the right thing.",
            "I do not think you are overreacting. If it were me, I’d go to neighbor’s home & ask to have a quick chat with BOTH of them…. Wife & husband. I’d tell them what I know & what the daughter told me. I am not a believer in keeping those type of “secrets”. I would absolutely hold not only daughter’s feet to the fire, but the husband’s. \nHolding those type of secrets is very dangerous….. it causes immense turmoil. It’s never worth it.",
            "Your daughter wants to do what she wants without consequences and your wife agrees. I’d be as if not more concerned about your wife’s position.",
            "you are an amazing father",
            "I would take a hard look at the context your daughter grew up in to figure out how she learned that this was an acceptable behavior. \n\nDid she ever face real consequences for her choices and actions as a child or as an adolescent? Did she learn this specific behavior by example?\n\n...just saying, someone doesn't just randomly engage in that behavior without some prior context. 🤷‍♀️",
            "I don't think you're overreacting and gave her a fair option to hold her accountable.",
            "Your house, your rules. You might estrange your daughter, but if your rules are more important, and as a father, you find it necessary to be involved in your daughter's personal sex life, and if you find it necessary to be involved in your neighbor's personal sex life, and if you don't approve of their personal adult business, you'll kick your daughter to the curb, then it's your right. \n\nYou may have a daughter who will be absent from your life, but you'll have your principals, and rules are more important than family.",
            "Are you concerned your daughter may be met with physical retaliation?",
            "It seems fair. Does she have the means to move out? If she did, she could do that and continue the affair. So nothing solved there and that’s on you. \n\nIf she tells the wife and continues to live at home, there’s going to be a shitstorm in the neighborhood. \n\nYou could go over to the neighbor, tell him I know what you’re doing and if you don’t stop I’ll tell your wife. \n\nI’m not saying you’re overreacting, but Reddit is so full of self-righteousness of course everyone is going to tell you you’re doing the right thing, when they’ve never been in your shoes. It’s the last place I’d take advice for something like this.",
            "And then offer the husband 50% on the value of their house when they are selling the house for the divorce.  You planned a 21 year long game.  Congrats to your foresight.",
            "How old is your daughter ? Why isn't she living on her own currently ?",
            "You are a good mom",
            "Everyone keeps saying the daughter should face \"consequences\" like she committed a fucking crime. She's young, she made a mistake. At the end of the day it's just sex. Why should she have to tell the wife or move? You could easily just say shut it down or move. Its the husband's job to come clean, not hers. And really OP, its none of your business who your kid has sex with, no matter if she lives with you or not. Again, she didn't commit a criminal act, or hurt anyone.",
            "Yes, overreacting and risking your girl’s trust in you to love her through the good bad and ugly. \n\nFocus on supporting your daughter here. Less judgement, more support. No I wouldn’t kick her out but I would write a note to the neighbor and tell him you’re aware of the affair. That should scare everyone enough to help shut it down. \nNot sure I would tell his wife. Depends on more context. \nGet daughter some therapy.",
            "I agree with your reaction whole heartedly, but not the hard ultimatum.  \n\nMaybe Id say it has to end, no further contact and leave it at that?  I would also have firm words with my neighbor. \n\nConfronting the neighbors wife directly and coming completely clean, though morally correct,  could lead to violence, and or desperate/irrational actions from any parties involved.  \n\nIf your daughter does leave, she may make a series of worse decisions, and you may find yourself with less influence to guide her on the right path.   I’ve seen things like this unfold personally many times.\n\nI think she won’t correct her path if she doesn’t see the space to come out the other side and recover from her mistakes, even as serious as they were.   Hope everything turns out as good as it can for your family.",
            "I'd tell her to cut it off or she needs to move out. Telling the wife is too far. The husband, when he finds out YOU forced her to out him, might come after you and make you/your wife's lives miserable for years to come, especially if he gets divorced. Serious shit like violence, suicide, could come from pushing things too far.",
            "I think threatening to kick her out is a bit much but your solid on telling her to take responsibility for her actions. The choice should have been “you tell her or I will”",
            "You and your daughter both need therapy.",
            "Kicking out your daughter is not going to help anyone in the long run. It's not weird to freak out at this. But I would advice you to let your emotions settle for a bit before pushing up such an ultimatum. \n\nAnd really, I'd confront the guy first. He is the one letting YOUR daughter come over. He decided it was okay to cheat on his wife with his neighbor's daughter. I'd tell him what you know and tell him you don't want him near your daughter again. I'd tell the wife too. \n\nKicking your daughter out is not going to have the effect you think it will have. Young people make mistakes. Talk things over with your wife (not when emotions are high), and tell your daughter why it is wrong what she's doing and what the consequences of that are (even if your think this should be obvious, people doing stupid things for what they think is love, or even just sex, is very common). You telling the guy to stay away from your daughter and informing the wife will be enough of a punishment. And if you really want to exact some other form of punishment just ground her or something. But kicking her out is really something I would advice against. Let her stay and help her grow and become a better person.",
            "She could be killed while attempting to confess to his wife!!! I would not suggest that! I recommend that you as a family, along with your daughter, have this neighbor husband come over to the house. At that point, you conduct a private intervention in which you are defending your child against a manipulative cheater. You announce that the affair will cease immediately or the wife will be made aware of the situation. In any case, your daughter will either leave the affair that very moment or she will be made to move out- at which time the neighbor wife will then be informed that her husband has broken two families by wanting his cake and eating it too. \n\nThat’s what you do.",
            "But shes not cheating on anybody? Ur not okay with ur daughter having consensual relationships? Thats your neighbors business if u ask me. Its not overreacting to be mad at her but she didnt do ANYTHING under ‘your roof’ so unless u start making curfew rules or something and say shes breaking /those/ thats kinda. Idk. Not how i would do it if im thinking literally",
            "You are just mad that a guy you know is railing your daughter across the street from you. You're probably thinking about all the times he has smiled at you knowing that he is getting nasty with her. \n\nChill out, it's not your daughters job to care about someone else's marrige. Everyone involved here is an adult and it really has nothing to do with you. You have no idea the state of their marrige, for all you know the wife knows about it.",
            "How is the neighbor the “main issue”? They both fucking lol.\n\nI was gonna make a comment on how this reflect on how you raised your kids, but I’m guessing your wife is the shit parent here. Also, hella odd your wife is cool with your daughter banging a married dude that lives a couple of houses away. Would make me question her morals.",
            "Going too far? Hell no! Your daughter is shitting where you eat! Where your whole family does! I wouldn’t demand she tell the wife, that’s between he and his wife but I’d have her break it off with the neighbor in front of you and then I’d have a few choice words for him. You’ve got him by the balls, what’s he gonna do, what’s he gonna say? Nothing!",
            "I hate to break it to you, but women haven't been property for a very long time. ",
            "what she's doing is morally wrong....but not your place to control or punish. You're either equal adult humans now or not & everyone's talk of \"holding her accountable\" makes me cringe. We already have way too much in this society of people trying to assert moral control over others....you should be honest about how you feel about the situation but I think it's terribly wrong to kick her out of her living situation over it.",
            "The consequences usually has to match the action. I agree with the confrontation but without the anger. Yes she's legally an adult but she's still got a lot of learning and growing to do. I would say to ask yourself,  do u want to be a part of that, or do u want to let her go so she can do her own thing on her own terms? It's good to let her know she needs to accept responsibility for her actions, but yelling and threats of kicking out won't work, period. I'm glad to hear u apologized for reacting with your feelings, and I hope you see that no matter how old our kids are, they will still look to us for guidance.",
            "You are going too far. Imagine caring more for the neighbor's domestic issues than your own daughter.",
            "If you're big enough to interfere or ruin a marriage, Then you're big enough to step foot into the real world and pay your way.",
            "She needs to tell his wife or move out.  Um… what?  Those two things aren’t even in the same sphere.",
            "Op, does your daughter have low self esteem？Who taught her morals as she was growing up？Were you involved in raising her or did you leave it up to your wife or did neither one of you raise her？Is she an only child? Has she been spoiled？Has she always had narcissistic tendencies, lack of emapthy？Do these traits run on either side of yours or your wife's family？ I'd dig into WHY your daughter acted this way and act accordingly.  If she's been groomed since she was a minor, I'd go to the police. If it truly is she was just dumb and the neighbor took advantage, I'd separate the 2 by having your daughter move out. If your wife can't see the damage your daughter has caused, I'd question whether that attitude caused your daughter to behave this way. Giving your wife a pass bc she was cheated on before is not good logic. My gf's who had been cheated on in their relations think it's revenge when they wreck other people's relationships. Hey, it happened to them, so why shouldn't it happen to other women. Don't put your wife on a pedestal. That doesn't help the situation.  Also, where were YOU the last 21 years that this is a surprise？Could you have talked to your daughter more about morals and empathy？ Or has your daughter shown narcissistic behavior all along？\n\n\nEdit: Only bc I worked with the mentally challenged in my social work do I bring this up- we are all assuming normal intelligence here. If you are in denial about your child's mental capacity, now is the time to get real with yourself. \n\n\nSomething's gone wrong. You should try to understand how this came to be by going back at the very least 10 years. Therapy usually starts from the time the child remembers and that's usually where social workers start.\n\n\nGood luck, OP. you can do this.",
            "You're putting your daughter in danger. You have no idea what is going on in that marriage or how violently wife will react if she finds out. Are you willing to allow your daughter to be killed?",
            "What if the neighbors are cool with it?  Luke the wife is taking her turns as well?  What would OP do?  Kick her out and watch her move in next door?",
            "OP I can't believe you just came on the internet and aired you own DAUGHTER'S laundry out like this. What kind of a man goes out and puts his own children in the crosshairs of a bunch of rabid dogs on this website? Read through this, half these people here want your daughter essentially stoned for this act and you're right there behind them. You're acting like a very weak man right now. You've lost the respect of your wife, you're about to destroy your relationship with your daughter forever, and you came and told the whole world about it because you were to weak to handle it. She fucked up, so did he, but you are 100% making everything worse because up until this moment you thought life was black and white rather than the reality of unlimited greys in the middle.",
            "Ur not wrong but I feel like asking her to move out or tell her is extreme. It's really none of your business. U can tell ur daughter to knock it off and tell the neighbor the same, but to insert yourself and get the wife involved isn't ur place.  Do u really wanna kick ur daughter out so that she can avoid telling the wife? If u kick her out, ur essentially giving her permission to keep banging the neighbor. U can get her to stop banging the neighbor and not kick her out? Also, in ur ultimatium, you'll let her stay if she tells the wife? What kind of logic is that. That's gonna make things really awkward in your neighborhood. Idk why ur so hell bent on the wife finding out. U want your daughter to stop banging the neighbor right ? Just tell her and him to knock it off or you'll tell the wife, it's that simple. U give them a chance to stop and if they don't, then they can suffer the consequences. No need to complicate things with ur daughter by kicking her out",
            "lol mind ya business",
            "Yes you’re overreacting. Why should your unmarried daughter lose her housing and the man face no consequences? You should have gone over, confronted the husband, and either told his wife or given him an ultimatum to do so. \n\nPunishing young unmarried women for an older man’s infidelity is bullshit. 2004 is calling, it wants its misogyny back. \n\nIf I was the wife and my husband tried to kick my  21 year old daughter out of our house and onto the streets without my approval and without her being a danger to us, I’d either divorce and go for the house or stay married but pay for her rent with our joint savings until the time I would have made her get her own place.",
            "Getting these night time drinks should prolly stop… trouble always seems to follow you when you do.",
            "tell her to leave and you know she will still be going to visit this guy. It will still be partially your problem going on next-door completely out of your control. But find a way to address it without her leaving, by communicating together, as long as she doesn't leave your home you have some control to influence the situation",
            "You are overreacting, and you're a judgemental prick.\n\n21 year olds do stupid things, get off your high horse.",
            "You should really shake things up and sleep with the neighbor and his wife.",
            "im glad in your edit that first and foremost the neighbors marriage is not your main concern and your daughter should be:\n\nYou need to talk to her,  she probably knows what shes doing is wrong, you do not tell her what to do, you have to get her to realize at bare minimum she needs to be no contact with the neighbor, having her tell the spouse should not be her or your responsibility. the main goal is to get your daughter to realize this on her own, and get her to possibly send a text the neighbor give him the ultimatum the he tells her or she tells her.  he should have known this was a possibility down the road anyhow.",
            "I hope for you and your daughters sake that this is a relatively new neighbor and not one that's been there since she was a kid",
            "She's an adult. It's not your place to correct her behavior anymore.\n\nI understand why you wouldn't want to harbor this knowledge and become complicit in this cheating by not saying anything. If this is the case, then you be the one to tell your neighbor's wife, if your daughter doesn't.\n\nI don't see how you came to kicking-your-daughter-out-of-the-house as an appropriate response. Is the idea that you're disgusted by your daughter and don't want to see her any more? Then why give her a chance to stay. Are you worried her presence will invite retaliatory attacks?\n\nDoes your daughter have the means to move out?\n\nAre you not going to tell the neighbor if your daughter does move out?\n\nWhat happens when the neighbors wife finds out, then your daughter actually moves in with him?\n\nThere are a lot of people saying stuff like \"actions have consequences\", sure, but those consequences need to make sense. The same phrase could be used by someone slapping around their wife for burning dinner. It's a gross, hollow statement used to bypass actual thought and justify whatever it is a person wants to do.",
            "I don't think you're wrong to confront your daughter, but I'm going to go against the grain and say that kicking your daughter out sends the wrong message that you will only support her when she does what YOU want, which is kind of lame controlling behavior now that she's an adult. \n\nA better way to set that boundary would have been to make it clear that you don't feel comfortable with the secret you now know and if she's not going to tell the wife, you will. That at least makes it clear that you're still here for her, but it's also not fair to expect you to keep that secret from your neighbor.",
            "Be careful. Years of damaged relationship can result of going too hard. Listen to her. Was she in a tough spot mentally, was she manipulated?\n\nListen and ask her how she would react?",
            "How long has your daughter known this neighbor and been babysitting? I would be more worried that this behavior has been going on longer than shes been an adult or anything along that nature. I would definitely do your best to expose the situation to the wife, but I would not hold onto kicking out the daughter. That sort of decision is irreversible. She's making a mistake and you should help correct and guide her away from the decision making that led to it, but if you kick her out you may not see her again. You should still pressure her to confess to the wife, ESPECIALLY (i cannot stress this enough) if your daughter was introduced to this man like 5 years ago. I just don't think an ultimatum is the way to go about this. It sounds like your Wife feels the same, listen to her.",
            "How in hell did OP went from doing te right thing to being so lukewarm with his daughter being an affair partner. I hope he's not prone to buy any bullshit.",
            "They grow up so quick",
            "You're not being unreasonable at all. Your daughter is doing wrong, you're not overreacting. Honestly I'd probably make her get out regardless. She can take that hoe energy elsewhere.",
            "You're holding your ADULT daughter accountable for her poor choices. If she wants to make adult decisions like contributing to destroying a family, the consequences should match the crime. As an adult myself, when any of us make poor choices, we deal with the consequences that's part of adulting.  I'm sure your wife is looking at this from a mother's perspective, but she's doing her daughter and society a solid disservice. Your neighbor is scum and your daughter is well on her way to being viewed like that as well. What if his wife finds out and blasts her all over the internet? That could affect many areas of her life. This isn't going to end well it never does.",
            "To start, you're in no way an asshole, it's your house and your rules. However, you might want to look at a few of the things you've said.\n  \n>Telling her he is married and she is helping to ruin a marriage.  \n  \nHis marriage would be ruined regardless. He's willing to cheat and if it wasn't your daughter, it'd be someone else.  \n  \n>I told her that she needs to tell the wife or she needs to move out.  \n  \nShe needs to end the marriage when the husband won't? Why is that her responsibility? If the wife overreacts and assaults your daughter, what will you do? You're telling her to escalate against both of your neighbors, either of which who may become violent and hurt her, or to lose where she lives. She's already put herself in danger by taking the actions she's taken, do you really think she should make it worse? What do you really want? Would it be fine if she continued sleeping with him if she told the wife? Or do you want her to stop?",
            "Lost my best friend this week because of cheating. I can't associate with someone who openly cheats on their spouse knowing it could destroy the family. I want no part of that in my life.",
            "Yeah I'd confront him!  I'd bet money he started grooming her at a young age. He's the biggest problem.",
            "Why even give her the option. Tell the wife. Whatever consequences happen will have to be dealt with. Just a part of life. Your daughter’s opinion on this doesn’t matter anymore. If she resents you let her move out. Simple",
            "Didn't realize you were male until you said, \"my wife.\" Didn't read more. Don't need to. \n\nYour neighbor slept with your daughter. Scorch Earth on the neighbor. And protect your daughter for f sake man. Kicking her out isn't the answer.\n\nCheck up on your wife too btw. You have more issues.",
            "Speaking to the neighbor, man to man, is laying down suppressive fire. It tells that guy that he has had his last moment of peace if he should ever covet hie neighbor's....ANYTHING. Don't  you agree?",
            "Umm you should probably be more mad at your neighbor for grooming your daughter for years. \"Has even babysat for them\"\n\nI doubt they've been sleeping together for just a couple months.",
            "The issue lies with your neighbor, not your daughter. The fact that she babysat for them suggests that the neighbor may have been grooming her. If he respected boundaries, this situation wouldn't have arisen. While the full story is unclear, it's important to ask your daughter about her interactions when she babysat. As a father, you should confront the neighbor for his behavior. Although your daughter admitted fault, there could be manipulation involved. Once you gather more information from your daughter, it's crucial to address the neighbor directly and assertively.",
            "Maybe you should tell the man next door that you know what's going on, between your daughter and him.  TELL HIM TO TELL HIS WIFE!  Not your daughter. What if the wife becomes violent towards your daughter and then you,  your wife,  your home? People can be so dangerous when finding out this horrible news.  I would not put my child or anyone in my home in danger.  Tell your daughter to stop the affair,  but the husband needs to come clean with HIS wife",
            ">She is the only reason I'm the man I am today. I have too much respect to let people, even anonymously, insinuate that she is a problem here. I should have done a better job in explaining her side. Any comments saying anything bad about my wife will be met with a big \"fuck you.\"\n\nBravo. \n\nYou’re probably over reacting. But I would confront the neighbor in private and tell him to stay away from your daughter or you’ll be talking to his wife. Bluff and say you have proof. Tell him he so much as texts her, you’ll be speaking to his soon to be ex wife. \n\nFuck that guy.",
            "Kind of. She and he are wrong and they both know it. She gets more leeway bc she’s your daughter and bc she’s barely adult presently. \n\nHave a conversation with your wife. The two of you can come to a reasonable response. Then go to your daughter together. Even at this point there’s still room for compromise. \n\nPretty sure her moving out for a 21 yr old bad choice is overkill and not healthy for your family, but someone is probably going to end up moving. This will probably end up reflecting on the whole family no matter the resolve. Daughter should be made to understand this. \n\nNeighbor dude needs to carry the weight of the blame here. See how daughter wants to approach this, but bottom line is - neighbor wife will be told that it has happened. You can ask her for anonymity for your daughter (considering her age and the entire family approaching this to her (wife’s) benefit) but I wouldn’t count on it.  Hurt people do insensitive things.",
            "You need to deal with the neighbor",
            "You take her to the couple.\nThen have the husband admit to what has been going on \n\nIf he lies, you can take it all out on him.\n\n\nThen your daughter needs consequences for her poor choice.",
            "Your daughter needs to stop doing this for sure. But I am not sure about having your daughter telling his wife. The neighbor should come clean to tell his wife because he is at fault. Letting your daughter telling the wife might have different effect, like your daughter is bragging or something. \n\nI would step forward to tell confront with the cheating neighbor that he is disloyal and that he should stop seeing your daughter.",
            "Trailer park?",
            "Personally,  I wouldn't make your daughter tell the wife. That's the husband's job. Your ultimatum should be to have her end the affair or move out. That's just my opinion.. best of luck with the situation!!",
            "Daughter: “Cheating is fine” \n\nWife: “Cheating is fine” \n\n Reddit: “What’s wrong with men?”",
            "good parent",
            "You're daughter is a homewrecking whore.",
            "im more of a \"confess AND move out\" here\n\nalso just really concerning, i assume they've known eachother since before she was even 18, and the age gap even now is moderately disturbing.",
            "Ask your wife to put herself in the wives shoes and then ask herself again if she thinks your over reacting.",
            "Your wife says you are going too far???? Your wife maybe is sleeping with the married neighbor too",
            "“I get that the neighbor is the main issue…”.  Nope. 50/50 split here. Your daughter wasn’t lied to - she knew he was married.",
            "She's participating in breaking up a marriage and family, I don't think you over reacted in the moment. I would tell her you raised her better than this or thought you did. I feel really bad for your neighbors wife...",
            "If she was their babysitter, they didn’t start banging recently. Probably started as soon as she became legal",
            "You're an amazing father.",
            "Good on you for recognizing that this probably isn't a black and white issue, and that you shouldn't be treating your adult daughter like a child.\n\nIt takes a lot to be able to recognize stuff like that, especially in an anonymous setting.",
            "Leave it to Reddit to throw family out the window and demonize anyone who even mentions cheating. Burn the daughter alive... just think of that poor neighbors wife... the burned ashes of that shiksa harlot shall only be the start of penance",
            "Holding her accountable is one thing. I applaud this in principle. \n\nTelling her to confess to the neighbor’s wife is another thing entirely. That is stepping beyond the boundary of what you, yourself, are allowed to do.\nYour daughter is an adult, the neighbor is an adult, that decision is theirs to make, and if you don’t like it, tough. It’s outside your sphere. \n\nTelling her to end the affair immediately, is within your sphere. Your house, your rules, you control who lives there and what they do. Either end it or move out, (or both?) yes, you can say this. \n\nYou can tell the neighbor’s wife. Yourself. And you can own the consequences of doing that. It’s a completely separate act from the affair itself. You want it, you own it. \n\nBut you can’t force others to say it. If you want to “force her to confess” you’ll have to own your role in that decision, ie you can speak only for yourself.",
            "When did your daughter babysit for them? If she's 21 and he's 30 than there's a chance he was grooming her and seducing her for longer than you realize. At the very least he's probably been making moves on her for much longer than you realize. The whole reason age gaps are gross is because of the ability an older person with more money and experience has to easily manipulate a younger person. I dont think you should blame your daughter for being taken advantage of. Even if it's fair to be disappointed in her to an extent too.",
            "The situation is fucked up. But I would never kicking my daughter out of the house. Nor would I involve the other wife. There would defiantly be a very long talk and lots of probing for information with my daughter, to see if the neighbor started her when she was under age or other shenanigans. but your daughter wont open up to you if you blow up on her or kick her out. I would gather as much info as i could then and only then talk to the neighbor. As far as infidelity is concerned I wouldn't involve myself with the other wife until i had a lot more info. I would leverage all the info I have in order to make the neighbor reveal his infidelity to his wife in a more paced manner. But more then anything, your daughter could be a victim in all this and you blowing up will only make her clam up. And when it turns out she is not a victim, a lot of stern talking to will be had BUT i would never kick her to the curb, wtf man that's your kid.",
            "Yes, you are overreacting. While yes, of course, she should tell the wife and hold herself accountable, you didn't even give her a chance to explain or get the full story of the situation. The man is 10 years older than her and could have manipulated her. But you just went 0-60 and started shouting in rage, threatening to kick out your daughter. Slow down. This is your daughter. Not a stranger. Not your wife's ex.\n\nYou won't say but if she has been babysitting for the man since she was a minor, then this is a grooming situation and she will likely need therapy and some support. And you need to do something about your anger issues. Even if she was completely in the wrong, you need to calm down first before reacting. You can teach her that she is wrong without losing your shit and screaming at her.",
            "to many things left unexplained, so your big FU's to everyone complaining about your wife? smh\n\nnow you know, there is no walking it back so when the SHTF and neighbors confront you, your wife, your daughter...one of you will be caught in the bigger complicit lie\n\nGood luck",
            "Honestly I’d go over to the neighbour and tell him if he tries anything again with your daughter that you will be telling his wife the truth. \n\nI think your daughter definitely should be coming clean and telling the wife as she should have absolutely known this was very wrong for her to do what she did. \n\nIf you don’t put a stop to it now, she will just continue this kind of behaviour.",
            "OP, please generate a picture of a man with ice cream for hands.",
            "What's your goal here, OP? Trying to control the actions of another adult is problematic enough, but in this case you're also likely to destroy your relationship with your daughter. If she moves, you ought to expect her to go no contact. If she's been groomed or coerced, then you will never know. If that's not what you want, then you should reconsider your approach.",
            "I would more more angry at the neighbor. Dude probably knew your daughter since she was a kid. He deserves  an ass kicking.",
            "My dad got the babysitter knocked up, when I was 9 years old. She wound up marrying him and they had a terrible, difficult life with several children who will struggle for the rest of their lives. \n\nSomething to contemplate.",
            "Sir, my heart goes out to you. What an unbearable situation to be in.\n\nFirst, your initial reaction was normal and acceptable. I would have done exactly the same thing. Everything you deserve would play out the same in my home, from the yelling to the wife reaction, all of it.\n\nSecond, your initial post was fine. My assumption was that at 2 AM, you went for a drink of water. That's normal. Anyone assuming it was alcohol needs to look at their own situation for assuming that.\n\nAnd what's with trashing your wife? Mine is anti-confrontational and would say the behavior is horrible, but you can't kick her out. That's also a normal reaction. \n\nI am also the type to calm down and reach out as you did. It's not backtracking. It's maturity. Kudos.\n\nNow, as someone with 2 adult children from my first marriage who do not speak to me (due to ex-wife vitriol, redditors), be prepared that she may not speak to you for a while if you kick her out. But it's part of the lesson being learned for her. She has to go through the emotional process and realize on her own what she's done is wrong.\n\nAs for what the neighbors husband and what he might do, since confrontation and beating his ass would land you in jail, I wouldn't suggest that. I would suggest filing a non-emergency report with the police that you have a concern about possible repercussions. Explain the situation and tell them you just want to be on record. \n\nMy experience with a man who would cheat on his wife like that is that he won't confront you. He's a coward. He might damage a vehicle or other property in a misguided attempt at revenge for you ending his playtime.\n\nAgain, my heart goes out to you. God be with you.",
            "Yikes; she babysat for them? You are doing the right thing of calling her out for her poor & cruel choices.",
            "Your daughter is TRIPPING . It’s alright to be disappointed. She wild",
            "Give her the boot",
            "She’s an adult. She’s accountable. OP you’re in the right.",
            "This thread is so crazy. Adultery is bad but it's not murder. she's 21, her brain isn't even fully developed yet. The married man 10 years her senior is in the wrong. If you don't want your adult child living at home just say that but being so moralistic about this issue is just silly.",
            "You have every right to express how you feel.  You do not have the right to tell your adult daughter what to do. You have the right to ask the man next door if something can be inferred from her sneaking out at 3am from his house.  You have the right ask the wife next door if she knows of any reason why your daughter would be in the house at that hour.  You can insist that your daughter leave, but she has rights as a tenant, too. You have every right to feel disappointed in your daughter's actions. Your wife has the right to express her opinion about how she feels about making drastic changes in her relationship with her daughter and does not have to agree with you on what those actions should be.",
            "Jesus christ mind your own fucking business, thats a 21yo women not a baby. Reddits too full of self hating people who are insecure and are afraid to be cheated on for you to get a straight answer.\n\nYou’re not gonna teach a 21yr old anything, your time for mentoring has past.",
            "You really wanna fuck up your relationship with your child because you have to meddle in someone else's affair? Think about that.",
            "You're definitely overreacting. You're going to ruin your relationship with your daughter. It's really none of your business who she sleeps with.",
            "Leave her alone  she’ll learn the hard way  she is ur daughter  support her anyway",
            "This is unhinged, OP and top commentors need to go to therapy and smoke some refer.",
            "I never understood why kicking someone out is even an option",
            "# Kicking your daughter out of your home because of who she is having sex with?\n\nIs this the 1700”s?\n\nIt’s 2024!  Kicking your child out of the house is an over reaction\n\nWho she sleeps with is none of your business\n\nShe will reap plenty of consequences without needing to ruin the child /parent relationship",
            "lmfao they sent you aa links for that one sentence. the Internet is wild.",
            "She isn’t the one ruining a marriage as she isn’t the one married 🤦‍♀️",
            "I had a toxic overbearing father that let his \"morals\" dictate our relationship, too. The best thing I did was move away.",
            "You want your daughter to be homeless because you don’t approve of her sex life? Yeah, you’re a piece of shit.",
            "21 is SO young. I didn't know jack shit till I was in my 30's. IMO she's still a kid. \n\nPeople make mistakes, helping your child learn from mistakes imo doesn't include putting her in a worse situation. I don't get how parents can just write off their children. If you kid blows up a building or murders someone I get it. She had a fling, was it right? Of course not. Does it make her not your child anymore? No. Hormones go WILD at that age, people get horny and have a harder time understanding the long term consequences. \n\nI don't see a 21 year old SINGLE person having sex with a married person as bad as OP is making it out to be. Again, its very wrong and not ok. However her obligation to someone isn't there the married person should be the one saying no without question. \n\nYou have to look at it from your childs shoes. I would NEVER kick my daughter out for doing that. Would I chew her ass out you bet your fucking ass I would. My child is my everything though, I remember being young and making my mistakes. I wish I had someone there to guide me, not kick me out. \n\nPeople, make, mistakes. Some more than others but we are ALL human and fall victim to stupidity sometimes. \n\nI don't know about you, but when I watched my daughter come into this world I made a promise to love, protect and guide my daughter through life. I won't break that promise no matter what she's my joy.",
            "Stay out of it.",
            "Ok dude, just *REMEMBER*, at first she denied it!  That tells the most about your daughter.  She'll always be your little girl, but don't ignore the woman she's become.",
            "You shouldn't be backing down. Hold her accountable. She tells him or she leaves, what she did was disgusting.",
            "My parents wouldn’t have given me the option. They would’ve marched me up to the wife, made me tell her and apologize. And then they would’ve kicked my ass out so fast. You’re doing the right thing. Personally it would make me see my child in a whole new light and I would question if I really even knew them. It’s not like she’s 16. She’s 21. Well more than old enough to know better. She’s helping ruin another woman’s life and doesn’t deserve sympathy or patience.",
            "So your creepy neighbor fucks your daughter who used to baby sit for him and your response is to throw your daughter out? \n\nGood luck with that one pal.",
            "Your daughter is not having an affair, your neighbor is.\n\nYour daughter is not ruining a marriage, your neighbor is.\n\nYou are upset for the wrong reasons.",
            "Wow AI is really having fun with these cheating stories lately. If this is real though she's still your daughter. Are you saying you have more loyalty to someone else's spouse than your own daughter? She needs to be held accountable for her poor choices but kicking her out is too much. She didn't murder anyone. \n\nAlso you're asking Reddit, a world where cheating is the worst thing a human being is capable of committing so...",
            "Why is every parent's solution to kick out their son/daughter? What she's doing is awful, and you should talk to her about it and express your disappointment, but you sound unhinged. Why the yelling? Do you yell at your wife too? You're acting like your daughter did something to you personally. Also, does it not bother you that your daughter is significantly younger and has known him for years?",
            "Your daughter a ho ho",
            "She a slut",
            "Since this has been up for 8 hours. I’m just gonna say. Bless your heart pops. Much power to you and how you navigate this",
            "I'd go over and tell the wife myself \n\nTell her you caught your daughter leaving the house and you confronted her about it.\n\nThe wife will believe you.\n\nPeople's reaction to cheating are very telling",
            "Youre the owner of the house you make the rules",
            "Women think that they can just do what they want because they have a coochie they think they can run the world with inbetween the legs. I got news for them too. Kick both of them the fuck out! I know I would. It’s scandalous and outright just disgusting. 0 fucking loyalty whatsoever.",
            "I'm a father and a man who's been cheated on in the past.... hell tf no am i taking care of someone who helped ruin a relationship. The husband is a pussy ass bitch for not doing what he needed to do and leave if he were that miserable. Your daughter is very wrong for getting involved in that and i absolutely would kick my 21 year old out for that.\n\nIt's not like she's 15 and doesn't really know better etc. She's an adult actively involved in something that will scar that woman for life and ruin her view of the whole world. She will never be the same person after this and i can't support that.\n\nAlso props to you for not beating the shit out of the neighbor yet.... idk that i would've resisted that.",
            "You’re a good dad and husband.",
            "Holding her accountable is the best thing, but what’s more important is that someone, anyone tell that wife next door what has been happening. I would suggest you do it, and do it in front of her husband. Be pissed that a pervert married neighbor took advantage of your daughter. He may not have, but that idea gives you the right to walk over there and raise hell.",
            "It’s understandable to be disappointed in your daughter, but the neighbor should really bear the brunt of your ire. You can do WAY more damage by acting like you know nothing, then when you see the neighbor outside with his wife, nonchalantly start up a conversation.\n\nAfter he’s been sweating for a bit and starts to think you might not know what’s going on between him and your daughter, turn to him and say, “So did you start fucking my daughter when she was babysitting or did you wait until recently when your wife was out of town?”\n\nThen step back and watch the fireworks.",
            "If she used to babysit for him I think this is probably an instance of sexual abuse by your neighbor. If she is only 21 this can’t have happened out of nowhere. It sounds like the neighbor is a sexual predator.",
            "I don’t think it’s her business to tell the wife. That’s the husband’s job. \n\nBut you can hold her accountable for her actions under your roof. Either he needs to tell the wife or your daughter needs to move out or end the affair.",
            "I would have a conversation with the husband too. Like hey man I know about you banging my daughter. Ask him to let you smash or you’ll tell his wife.",
            "Kick her ass out , and whip the neighbors ass. Completely unexceptionable",
            "Look at it this way. She as a babysitter is his employee. You are the father of a 21 year old (and science tells us prefrontal cortexes are not finished developing until 25). Bad at decision making, easily manipulated, a young girl in an old man’s world, etc. I wonder when your daughter first made contact with these neighbors, when she started working for them. It is possible with his influence as an older man and as an employer he may have groomed her. Don’t be angry with her, grooming is real and very scary and turns the victim’s world and moral compass upside down. I understand wanting her to have compassion and consideration for the wife… but your daughter did NOT ruin a marriage. The only person who can ruin the marriage is the MARRIED person. Do not put this on her. You as the adult father should step in for your family.",
            "You’re a good dad",
            "You stay up drinking afer 3am, spy on your adult daughter and then have the gall to criticize others? \n\nInstead of being puritanical why not confront him yourself?",
            "I am sorry to ask but… do you by any chance, suffer from hormonal imbalance?",
            "It's sad your daughter wouldn't stop talking to you if you booted her.  If my parents stuck their nose in my business then threatened me we would not be talking for a while. You don't turn on your child because she doesn't do what you want. She is an adult and can make her own choices.  You should let her be an adult instead of controlling her with threats.",
            "Have fun with whatever is left of your shitty life. No Contact will hit you hard.",
            "Two consenting adults. This is none of your business. Stop involving yourself in other peoples' lives.",
            "I would never pick anyone over my own child.  And I would leave my husband if he did.",
            "OP as a 23 year old girl , I am very concerned. I hope you read this comment. You want to take action against your daughter which imo is fair but what about the neighbour? Your daughter's frontal cortex hasn't even fully developed and she hasn't even fully matured. People might call her an adult but she is learning her way in life. It has nothing to do with her being a bad person or having no virtues etc. I think you need to take action against your neighbour. Why would he partake in such a relationship? What has he told her to fool her? If she was babysitting , was it when she was a teenager?? There are so many red flags about the neighbour. No girl wants to be a sidepiece unless something has gone terribly wrong. This could be many things. Obv i don't know her childhood life etc and how her parents treat her but based on the limited info I have , the neighbour seems alarming to me. Instead of kicking out your daughter which will potentially ruin her life more as she has to live alone in this economy, without her parents love near here and still doesn't have a full-time job, and hasn't finished her degree, have a conversation with her. See what has happened and explain to her why this action is bad. Reserve these consequences for the piece of the shit neighbour who can't keep his dick in his pants and cheats on his wife and goes after a young girl who hasn't fully matured. OP even if you mention this to the neighbours wife, she will get disgusted at her own husband . Your daughter is still learning and growing. Please don't make the mistake of teaching her a lesson in the extreme way that might potentially cost her life .",
            "Is she smart enough to be on birth control?",
            "Almost half of the people who are on Reddit (ie. the commenters on your post) are in their 20s OP, so just keep that in mind when you consider the advice… ",
            "Maybe your neighbor is irresistible. I am sorry sir.",
            "All for the tuff love and standing your ground, but to go off and straight up throw her out in my books is not cool. Not only is she going through it with the neighbor drama but now she is literally being tossed to the side and beyond judged by the people who she is suppose to find solitude with. \n\nI know many people who have been tossed out of their what they thought was home and it ruins them and creates an emotional tear with them. \n\nFrom one parent to the next you do you but word of advice think past the situation and look at other options before making a judgmental decision like that.",
            "why are most of yall ignoring the **kicking his 21 yr old daughter out** part, and only discussing/justifying that she come clean. Maybe, just maybe, the kicking out shouldn’t be in the equation. And at best should be a you’re gonna tell them, or i will. Like what the actual fuck. You raise kids to teach them lessons or to ostracize them because they aren’t mini yous",
            "You’re daughter a hoe and sounds like you’re wife’s one as well since she didn’t get upset"
        ]
    },
    {
        "post_id": "1ccs0ky",
        "author": "Individual_Tailor767",
        "title": "AIO my girlfriend won't stop swapping out my real groceries with small versions of the items",
        "url": "https://www.reddit.com/r/AmIOverreacting/comments/1ccs0ky/aio_my_girlfriend_wont_stop_swapping_out_my_real/",
        "score": 17313,
        "num_comments": 5752,
        "created_utc": 1714051864.0,
        "selftext": "It's basically what the title says - but the weird part is she won't ever admit that it's her? She just sort of looks at me and pretends to be confused when I confront her?\n\nBasically, every few weeks I come home and some of my groceries are missing and replaced my miniature plastic versions of themselves. Come home from work and looking forwards to a coca cola?\n\nOh great, my coca cola is gone and there's a miniature plastic version. Break something small and need to tape it back together? Oh good, miniature duct-tape. Make eggs and want some tabasco? Oh great, miniature tabasco. You get the point - kind of funny, but pretty annoying too.\n\nSo far all fair play, clearly my girlfriend thinks its some sort of funny prank or practical joke, but the thing thats weirding me out is that she never acknowledges that its her? Even when I start to get genuinely upset, or frustrated she insists that it’s \"so strange\" that \"random objects are shrinking in our home\"?\n\nThis all culminated to last night... Last night I came home and I had been craving something sweet all day. So l started baking blueberry muffins - my genuine favorite treat for myself. I get everything together, preheat the oven, and I'm about to start making the batter when I open the cabinet and oh look - the flour is gone and replaced with a miniature bag of flour.\n\n\"Ha ha, so funny\", I immediately call her and ask her where she put it but she keeps playing dumb??? I start making a slightly bigger deal about it I'm like \"look, I went to the store to get fresh blueberries, l've been looking forwards to this, can you please tell me where the flour is?\". She won't drop the act? Like what the hell???\n\nBefore we ended the call she slyly dropped \"as if you need more muffins\" and hung up??? Like what the hell.\n\nI haven't called her back yet - so we haven't talked in over a day. I'm pretty mad at her over this - I went way out of my way to do something special for myself and she wouldnt drop the act when I made it clear I was genuinely upset.\n\nReddit, I know this sounds insane, but I'm genuinely considering breaking up over this. She clearly doesn't take my needs seriously. Do you guys think I’m overreacting.\n\nTL;DR; : Items from around my house such as sugar, a bottle of coca cola, etc \"randomly\" shrink into miniature plastic toy versions of themselves. My girlfriend won't f***ing stop and I'm losing it - she ruined my muffins to stick with this stupid joke.\n\nUPDATE: turns out it was my brother paying a prank on me he saw in TikTok. My girlfriend apologized for her snide comment about the muffins but suggested I’ve been gaining a lot of weight lately and was annoyed that I’ve been pointing the finger at her.",
        "permalink": "/r/AmIOverreacting/comments/1ccs0ky/aio_my_girlfriend_wont_stop_swapping_out_my_real/",
        "comments": [
            "I’ve seen this prank on tiktok and it’s very annoying usually they end up giving the real food back though.",
            "When my kids are trying to play the repeating game or some other game where the objective is to piss me off, I say “I’m not having fun. Find another way to play.” I say that once before I physically leave the room. Highly recommend.",
            "Watch OP go to break up with her and it's a Barbie there.",
            "You aren't considering breaking up with her because she's replacing your stuff with mini versions. You're considering breaking up with her because when you tell her that her actions have upset you, she thinks it's funny, she digs her heels in in the moment, and then deliberately does it again. And when she does it, it's something that takes deliberation - so it's not like a momentary slip up that requires actively practicing to not do anymore. \n\n\nIf you haven't expressly spelled it out for her and she's only *seen* you get upset, I'd give her one more chance, but be really, really clear that you don't want her to do this. But if you've already had a conversation where you said \"it genuinely bothers me when you do this. I'm not having fun. Please stop\" - then yeah, you should probably break up with her because she doesn't respect your feelings",
            "The only way that's funny is if you get the actual item after being surprised. Otherwise, that's just obnoxious. And the muffin comment seems extra disrespectful.",
            "Ultimatum time.  Some jokes are funny once, some a few times, but everything gets annoying eventually.  Tell her to knock it off or give your key back, her choice.",
            "My first thought is she’s secretly filming all this for a TikTok or YouTube page she has that you don’t know about. “Watch me prank my boyfriend” “omg our stuff is shrinking!!” But then you said she sassed you before hanging up the phone? Idk what that’s about. Either way, you’re not overreacting. A practical joke is funny a few times, but if it’s not your personality, like me, then it gets old REAL fast. I’d go with the hidden camera idea first, so that way if you decide to break up you got the receipts👍",
            "Damn that sounds annoying. It’s funny the first few times, but the playing dumb part would irritate the hell out of me. Like another poster said, set up a camera, confirm it was her, lay out how you’re feeling, if she doesn’t respect that, dump her.",
            "Plot twist, his girlfriend is actually carbon monoxide.\n\nAlso, you aren’t overreacting. She’s way out of line.",
            "1. Type out \"I'm breaking up with you.\" \n2. Take a screenshot of it.\n3. Edit the picture to make the text super tiny. \n4. Send her the picture .",
            " ....what ....is happening?\n\nAre you dating...some kind of .... mischievous fairy? Woodland sprite? This is weird.",
            "Fight fire with fire. Disappear her makeup and replace it with little kids fake makeup toys from the Dollar Store. Buy a set of Barbie shoes to replace her everyday shoes. Get a toddler phone and hide her cell phone.",
            "Get your key back.  No need to break up, just take the position that you don't care for the pranks, it's not funny anymore, and you don't trust her, so hand it over.\n\nShe will undoubtedly toss a fit.  And if you do manage to get your key back, change the locks anyway as she most likely has made a copy.\n\nPersonally, I'd move on and look for something better.  This person has some issues that you don't need.",
            "I think you've made a very powerful enemy. Have you had any conflicts with wizards or strange peddler women?",
            "Sounds maddening,  not funny after the first time",
            "I would break up with her. Effectively she's stealing your food items, replacing them with landfill and then gaslighting you about it.\n\nShe's enjoying messing with you and stealing with you.\n\nShe doesn't respect your property, your time, or the work you put in to afford your groceries and how you feed yourself.\n\nNope. You can hand her the plastic crap back and tell her to engineer a partner out of it.",
            "The joke has run it's course.  She is in hte wrong.",
            "This is the most unhinged story I've read so far today.",
            "this is one of those seinfeld things that I'd totally dump a girl over. The first time it seems funny, after that it seems extremely annoying and gives me the big ick that I'm going to be with someone who has an annoying personality ",
            "I would completely ghost this weirdo (the gf, not OP)",
            "Dude, she is full on gas lighting you. It's not \"weird that things are shrinking\". It's weird that she's playing a prank so hard that she won't admit she's taking things and replacing them with miniatures. I'm all for a harmless prank, but not admitting to it is a red flag bro. It means she has no problem lying straight to your face. I wouldn't stay with someone like that .",
            "Hide literally all of her stuff. Rent a storage unit and put everything in there. When she comes home play dumb. \"Huh, I guess it all shrunk so small it disappeared?\", \"I guess it wasn't you, sorry about that\", \"How strange\". She'll probably own up to it at that point, maybe even recognize how annoying/frustrating it is if she had the emotional bandwidth. More likely she'll double down, say you overreacted and you guys will break up.(This is a joke, don't actually do this if you value the relationship)",
            "That is... bizarre and strangely specific.  \n\nYou're sure it's her and not one of your friends? Can you hide a camera in your kitchen to be sure before you nuke your relationship?\n\nIf you are 100% sure it's her, I would tell her, if this is you playing a prank, I'm done. Next time my food \"mysteriously shrinks,\" I'm breaking up with you immediately. You are wasting my time and my money and it's not funny.",
            "Keep the muffins. Dump the girl.",
            "Is she secretly fat shaming you? The muffin comment and mini versions of stuff makes me think she’s “cutting portion sizes” by doing this. She’s gaslighting you by making you go a little crazy, and acting like you’re the mental case when it’s clear she’s doing this. Did her mom do some sort of weight shame to her, or an ex? \n\nIf she doesn’t come clean when you do a final confrontation, I’d break up with her. She’s obviously doing some sort of toxic game and it’s to your mental detriment",
            "Maybe buy some cheap doll clothes and do the same thing to her favorite outfits.",
            "Is your girlfriend 5? I think once you tell her you are actually angry about it and she keeps doing it, it stops being a prank and starts being abuse. Consider replacing her keys to your apartment with miniature plastic keys, and never let her in again. Also leave this song on her voicemail (Radiohead-fake plastic trees) [https://www.youtube.com/watch?v=n5h0qHwNrHk](https://www.youtube.com/watch?v=n5h0qHwNrHk)",
            "Can you post a picture of these tiny items?",
            "I mean if she’s not listening to you when you complain about it, I suppose I’d be funny about my response. Pack a bag to stay at a friend’s house overnight and leave a Ken doll dressed like yourself sitting on the bed. \n\nWhen she blows up your phone, send a picture of a Barbie and tell her you’re on a date.",
            "Put miniatures of her items, panties, tampons, pads, get smaller sizes of her clothes. See if she likes it reversed.\n\nEspecially get smaller size if her fav shoes",
            "Shrink her clothes and see how she reacts.",
            "You’re not overreacting. Overall it’s not a tremendously huge issue of itself, but she clearly enjoys head games. People like that usually don’t much grow out of it until/unless they get burned pretty hard by their actions.\n\nThe only way to teach these people a lesson is to turn the tables in such a fantastic way that they’re left feeling embarrassed and ashamed. It’s unfortunate but you can’t go prank for prank. You have to respond twice as hard every time. She replaces your blueberries with small ones? You replace her phone,  her purse, her laptop, her school books, and her car with small ones and then never tell her where they’re at and play dumb. She’ll lose her shit super hard and super fast. Still hold your ground and admit nothing. Even if she breaks up with you, deny it deny it deny it.",
            "So she’s replacing your sugary foods with plastic miniatures. This is actually super controlling. Please break up now.",
            "Maybe talk to her about it, seriously, when you aren’t initially angry over it. Say it was funny the first time, but not anymore, and it’s genuinely starting to bother you and she needs to stop or you *will* break up. That’s the only way, unfortunately.  If she still plays dumb, she’s shown no respect for you, and a breakup is due. If she gets mad at you for ruining her joke, she’s still obviously shown a clear lack of respect for your feelings, and a break up is still due. \n\nEdit for clarity. ",
            "That's funny, for about 4 or 5 times over a week, after that,  learn your audience.   How annoying.  \nGive her something she's been dying for, but tiny. \nHave an adult conversation, hey that was amusing, haha, but stop.",
            "Psychopathic behavior.",
            "she is a wack job.",
            "We'll if you don't want to break up yet, take your key back. Don't let her in the house unless you are present.",
            "I agree with the breaking of the up, you don’t mess with someone’s muffins kid, ever.",
            "Honestly? I think it's enough to dump her over the swipe at his weight. The gaslighting is strong in that one.",
            "This sounds incredibly annoying.  I'd have a serious conversation about it.",
            "The joke itself is hilarious but not giving you the real item after, and making that comment…. Not so hilarious :(",
            "No, you're not overreacting. What she's doing is psychotic and bizarre.",
            "NTA. I find stuff like this funny.  I worked in a restaurant and the high school kids left tiny ducks everywhere.  Found those stupid things for weeks.  I also left random post it notes for my bf about things I love about him. Like open the tall cabinet, there's a note that I love how he pretends to be annoyed about reaching things for me.  \n\nBut to hide the real items/ not return them/ act like she has no clue AND make a snarky comment about you treating yourself with some muffins is bullshit.  \n\nA joke is only a joke if all parties find it funny, otherwise it's just a mean prank.",
            "Lots of speculation about her motivation but I don't care about the why. As I've seen other people say on Reddit you don't have to stay with anyone, you don't need a reason to end a dating relationship. I would ask you if this kind of behavior is something you would want in someone who you'd want in your life for the long run? It seems indicative of something else underlying that's just weird and unreliable. In a tough spot, I wouldn't want this person by my side.",
            "I’ve always thought there is something weird about people who play pranks like this. What enjoyment does a person get if it’s clearly not funny to the other person? Op your girlfriend is weird. Tell her to stop replacing your stuff and if she can’t respect such a simple boundary get rid of her.",
            "Start replacing her skincare products with minis. It’ll solve itself.",
            "Start by taking away her key. No access and possessions don’t shrink then you can dump her.\n\nDefinitely give her a Ken doll that’s absolutely hilarious..",
            "I broke up with my boyfriend of 7 years over “pizza”. All day long I was looking forward to going home and having leftover pizza. Worked 9 hours and was so excited to get home to eat it. Got home and my bf was there with his brother. They were hanging out in the kitchen and I pulled out the pizza box and put it on the counter. There were two pieces left and left the room for a minute to use the bathroom. As I was walking back in I heard my bf tell his brother he could eat the pizza. When his brother said “she’s obviously eating it, why don’t you ask her if it’s okay first?” He said “it’s fine. She’ll get over it.” I left as soon as I could. Packed a bag. At that exact moment I knew deep down that all the other issues we had that I thought were fixable, weren’t. It wasn’t about the pizza. It was the plain disrespect he showed me everyday. It just took the pizza for me to realize it.",
            "Your update leaves me more confused. How did your brother have access to your home? Why didn't gf also get annoyed after a while of this happening? It reads more like the two where in cahoots until you got upset at her for the muffins, then bro took the fall so gf can stay (which leaves even MORE questions)",
            "Start replacing her clothes with smaller sizes. Who needs muffins now?",
            "Why is she allowed in your place unless you’re there keeping an eye on her?",
            "This sounds more like a narcissist being condescending than a true joke. She may be calling it a joke but I am not picking up on that, this is like… her passive aggressive way of telling you to diet maybe? There’s something off here, for sure.",
            ">Reddit, I know this sounds insane, but I'm genuinely considering breaking up over this. She clearly doesn't take my needs seriously. \n\nYou're not wrong. Break up. Maybe she'll learn to respect her next boyfriend.",
            "Yeah dude, she kinda hates you and probably wants you to initiate the break up. Also thinks you’re fat.",
            "I'm guessing she's getting Mini Brands and then replacing whatever she gets. It is controlling and weird and I wouldn't care about her exact motivations.",
            "Petty response: \n\nStart \"miniaturizing\" her stuff. Start with her key to your apartment.\n\nMature response: \n\n\"This behavior isn't cute or funny. Miniaturizing my stuff inconveniences me and upsets me. The fact you continue to insist it isn't your doing is an insult to my intelligence and limits my ability to trust you. If you want to continue our relationship you will stop and return all the stuff you've taken or hidden.\"",
            "When everything is small your weener looks big",
            "Welcome to another round of “is it fake or is it carbon monoxide poisoning”",
            "[deleted]",
            "I think this is the same person who wrote the fake post about how her husband wouldn't let her shower. It's too bizarre to believe.",
            "I want a pic of these miniature items, or it never happened.",
            "POV the OP doesn’t have a gf, he actually has schizophrenia.",
            "Honey I shrunk the everything",
            "It's not a prank if both sides don't laugh about it. At that point it's just bullying and/or being an asshole. More people need to understand this.",
            "Your brother is an idiot, lol.\n\n  \nEdited to add, so are you for blaming your girlfriend. That poor woman has been dragged all over the comments and she didn't even do it. Your brother is a massive plonker.",
            "Wow so all those people who said just break up with her and don't set up a camera were dead wrong.",
            "Since it's your brother that's been doing the stupid immature pranks getting your locks for your house so he can't get in anymore"
        ]
    }
]