[
    {
        "post_id": "k1ccvc",
        "author": "WantsDonuts",
        "title": "Why are there no late night social coffee shops?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/k1ccvc/why_are_there_no_late_night_social_coffee_shops/",
        "score": 26664,
        "num_comments": 2192,
        "created_utc": 1606383472.0,
        "selftext": "A coffee shop with the same social atmosphere as a bar, talking to people maybe a pool table. Without the loud music, way too drunk people, and the uncomfortably close quarters. I feel like all the coffee shops open late at night are just for people to study or do non-social things like read. I want socializing but not bar-socializing. \n(post-covid of course.)",
        "permalink": "/r/NoStupidQuestions/comments/k1ccvc/why_are_there_no_late_night_social_coffee_shops/",
        "comments": [
            "I worked at a cafe that tried this. The answer is that nobody really comes in at night, and the people who do don't tend to buy much. You end up with lots of problems with homeless people trying to sleep at the tables too.",
            "Depending upon location there either aren’t enough customers to make it financially viable or it’s a safety issue with sketchy people coming in all night. \n\nI used to live in a city with 24 hour coffee shops. Drunk people showed up when the bars closed so you still had to deal with them. Homeless people camped there all night. I met many mentally ill people there who were off their meds.",
            "There are in some countries.  France has them.  Taiwan has them.  Culture in the UK is to have pubs, the US has bars.",
            "Alcohol is a high margin product.",
            "It is not viable. Places have tried it. Even a city size of Montreal it does not work.  There is not enough clients to make it work.  You get an odd person here and there and expect it to be and not understand why they are not keeping a shop open for one person for hours on end after buying one thing. You need to make money off something to keep it going or just have deep pockets and be happy to lose money for no reason. Plus I never seen a coffee shop a some social place like a bar. As you pointed out. \n\nTruthfully is coffee shops get people who are looking to keep to do their own individual thing. Some gather but a lot want to study and read.  Coffee is not something you binge drink on like booze. That prevents the other social aspect of it.  what business owner wants a full shop of customers with a minimal purchase and tying up space for hours. Coffee shops need a fast turn over to make a profit.",
            "I find hotel bars to be the best, go to a five star place",
            "Most people sleep at night, including employees. Paying employees more to have less customers is not a good business model.",
            "[deleted]",
            "Because coffee isn't a late night drink",
            "They’re called Denny’s.",
            "I think likely economical viablility is the problem. For me, this would have been amazing. In the UK, we have a good middle ground of small pubs, where the volume levels are often tolerable enough for an autistic person like me, with good friends. We will take a chessboard, I will get a cup of tea or coffee, and we will just socialise.\n\nI do hope some of those small pubs survive after COVID is over. A coffee shop like that would have been awesome. Not sure if it is a quirk of my ME, but I am often more active and able to move around more at night or in the evening.",
            "These late night cafes you describer are a dime a dozen here in South Korea. It helps that Korean work culture is such that most folks only have real personal/social time in the evening after dinner and a lot of places are open past midnight (except lately thanks to covid)",
            "[deleted]",
            "In North Carolina we call them Waffle Houses",
            "There are, I own one. We still serve alcohol but we’re open late and serve coffee late and our atmosphere is relaxed with brighter lighting than a bar and lower music volume. We’re a board game cafe so you can play games as well if you want! \n\nCurrently working on opening a second spot like this too just less focused on gaming because places like this are in demand (well before and after covid of course).",
            "How do you make money?   Go to a bar have two or three drinks and you can spend $25, $30 (yes less in some areas more in others)    You can't keep a place open if someone comes in buys a $3,00 bottomless cup of coffee and sits there for 3 hours, even if they also have a $3.00 scone.",
            "[removed]",
            "Weirdos really pops out at night.",
            "There was a shop in Pittsburgh, Pennsylvania thats was exactly what you described. It was called the beehive.  Lots of really artistic, creative people. It was open for 28 years, but unfortunately closed in 2018 when the building it was in closed.  I dont know if someone purchased the business and reopened or not.",
            "The main reason bars are successful (late at night) is that people can drink alot.\n\nMost people buy a single coffee and hang out for awhile, maybe 2. People routinely buy 4-8 drinks in a bar at a higher price point.\n\nIn reality if you want somewhere you can hang out for multiple hours, they need a way to monetize you.\n\nEdit: And though I'm sure redditors will come out of the woodwork to tell me im wrong and that they dont fit this mold, typically late night spots like this would be for people who don't have a lot of disposable income. Theres a reason why everytime you go to a spot like this (in thinking of the 24/7 diner) its either young people or homeless. All of the business professionals and families are home in bed. Essentially you have created a business that creates small amounts of revenue, while simultaneously keeping your richest customers out of your store.",
            "There was a place like this in my city. It mostly served coffee but you could get other non alcoholic drinks there. I’d occasionally go just to play pool or meet with friends and chat while having a coffee or ice cream.",
            "I live in a US city that **DOES** have a couple shops like this. Covid curfews have pretty much destroyed the businesses, but before that, they were very viable. Every single one of them were co-ops though, owned and operated by the staff. It also wasn't cheap, crappy coffee. They have baristas that are more inline with mixologist, so you're paying $20-75/ drink making turnover not nearly as critical. And it wasn't just caffeine exclusively: rare ports, whiskey, scotch, etc.\n\nThis business model (... did) does work, at least as much as the average 1-6% GPM that normal restaurants see.",
            "There are some great ones in New York!",
            "In Coventry, England we have an increasingly large population of Students of Islamic faith. They don't drink, so Starbucks has basically been converted into a hang-out spot and the opening times have changed to reflect that. They stay open until 11 some nights, use the outside area longer and there are masses of Student-aged people, talking loudly in foreign languages, making jokes and laughing in a way that rings throughout Godiva Square. \n\nThey're more raucous than the bar-goers and so, so loud.",
            "Grand rapids Michigan has one. Its called the Bitter End. Small and kinda quaint, its actually open 24/7. It works mostly because its right near our downtown campus of an offsite college, and partially in the developmental area of town (probably ideal for second and third shifters, I bet)",
            "There was a coffee shop in my city that would stay open until 10 or 11pm depending on the night. They did pretty well, but part of that was because they held events (slam poetry, standup comedy) some nights, and were a meeting place for stuff like knitting clubs. And they also had a wide range of teas and hot chocolates, so people didn't necessarily have to drink coffee in the evening.\n\nUnfortunately they ended up closing down a few months into the pandemic. They were around for years before that, though.",
            "This is the culture of my city.\n\nBefore covid, most coffee shops/bars/pubs and even some restaurants/fast food places were open until 1am. It was completely natural to go out with friends at 8-9pm and sit at a place till either 11pm if you needed to catch the last busses for the day or all the way till closing times at 1am if you lived relatively close by or went on to catch a cab home.\nThere were also clubs that would work till 4,5 or even 7am, but those were the classic loud music and tons of people clubs.\n\nUntil recently, all places here had to be shut down by 9pm and now it's by 6pm. A barman in a bar which me and my friends used to go to since it was never crowded and has good beer told us that they will be closing now since no one even comes before 5pm.\n\nIt's the culture here and it's been smothered greatly by covid",
            "There are and I'm sure there would be more right now if it weren't for COVID. There was one in downtown Scottsdale \"Jamaican Blue\" that stayed open real late and did quite well for years.",
            "We have them on every corner in my part of the world. Eastern Europe.\n\nClosed indefinitely though, due to Covid-19.",
            "i bet with the rise of legal weed you will see this more. i don't drink but weed and caffeine works.",
            "We have a small chain in Atlanta that is quite popular-- Cafe Intermezzo. They also have a small dinner menu and large dessert selection, and coffee with liquor. I don't know why there aren't more of these, all the comments say it's not a viable business option but Café Intermezzo has been around for years and is still doing delivery during covid.",
            "Because your elected government decided to give bailouts to corporations instead of small Businesses, fuck taxes",
            "Can bars just turn the music down? Why am I not allowed to talk? Or, can they have a quiet section?",
            "Maybe just a different note, but why are there few to no casual and calmer bars? Why do they all have to blast music and 7 different channels of sports/other loud content? I would love a bar that had some casual coffeehouse or bookstore vibes",
            "Good question. You should open one!",
            "I live in Ho Chi Minh city and this is very much a thing",
            "Where I used to live in Seattle, there was an internet Cafe that was open until 2am. It was really great because I couldn't afford internet as a broke college student, but I could get a chai and be there as long as I wanted. There were outlets everywhere and comfy couches. You could also rent a computer to use. There wasn't a whole lot of socializing because people were working, but there were occasionally study groups that socialized. Seattle is a Mashup of many colleges just a bus ride away, so occasionally there would be a \"which one\" or \"what course\" conversation or a \"that smells good, what are you drinking?\" But again, most people had their headphones in and ignored everyone else.",
            "In the olden days, 24 hour coffee shops were the gathering points for revolutionaries. All that caffeine and young bloods led to the production of some radical ideas. Great stuff. Doubtful a similar movement would form nowadays judging by the examples listed here.",
            "I have a feeling that soon there will be. However, they are all going to serve weed as well... I'd rather be in a room full of pot smoke than a room full of drunk people though.",
            "You shouldn't drink coffee at night. Unless you work at night, which most people don't",
            "Because we night folk are chronically underserved by business. \n\nThe scene is all about house parties and camp fires for us. Corporations don't care about people having a good time, they just want to sell trash to a constantly moving line of zombies that don't stick around too long. \n\nGet in on the house party scene but maybe wait til after the pandemic. Lot of incredible times there and in the party bonfire spots.",
            "there a lot in South Korea, off the top of my head i know a chain called Angel-In-Us has 24 hr locations, i think Cafe Pascucci also has some",
            "flagstaff had one when i was a kid",
            "There's a coffee shop by me that's like that. I don't think they're open real late though except certain occasions. It's not really my scene but I do go in there occasionally in the morning just to get coffee. They have a bunch of books but also have board games and stuff as well and it seems like it's more of a place to socialize than read. They were having open mic nights but just for like acoustic or folksy music but obviously not doing that now.",
            "When I was in high school and college we would all go to a place called The Cup a few towns over in Long Island. Perfect place to hang out without alcohol",
            "All-night diners or doughnut shops are going to be your best bet. Whether your area has any all-night places is another question.",
            "There's one near me called Lait Cafe and it's literally what you're describing. A night cafe that also serves some Japanese sweets. Opens from 7pm to 4am",
            "I live in Italy and we often go to pubs/restaurants (obviously not the high class ones), we order something, bring our own board game and we stay there till 1AM/2AM. Is this what you meant?",
            "There was one near where I grew up in Central Jersey. Closed 10ish years ago.",
            "It almost sound like the coffee shops in Amsterdam.",
            "Korean coffee shops do this all the time. I have like 50 of them near where I live (metro ATL, GA). Check them out, and order bing su and dalgona coffee.",
            "The city I went to school in had one of these. Was open until 4 or 5 am. Popular study spot and was full every time I went. It's a cool shop.",
            "There is no margins on coffee, plus you don't drink 10 coffees a night, as some people would do beers, wine or drinks.",
            "I felt this after playing the game Coffee Talk. Literally just a cosy place to hang out would be amazing",
            "There are quite a bit of them here in Vietnam.",
            "This is what kava bars are like in my city, they’re pretty big here. They’re usually open til 2-4 AM and it’s very chill, people are usually playing board games or having Smash tournaments. A lot of white people with dreads though so it’s not really my scene.",
            "We have 24 hour coffee shops here in Austin. As a law student, they’re my absolute fave",
            "Another option - why not go to a hotel bar, assuming your town is big enough to have one? They are usually pretty quiet, nearly always serve coffee, and always have a selection of people who are passing though and only too happy to have a bit of conversation to pass the evening. The booze is usually expensive so it puts people off getting bladdered, and of course they keep out the more unsavoury elements of the local populace.",
            "Would you pay a cover charge just to hangout?  2 drink minimum?",
            "They call that a hookah bar lol",
            "Because most people don't drink coffee at night and it wouldn't be financially viable.\n\nSource: basic economics",
            "There actually is a place like that in Cleveland and its pretty popular.",
            "I used to work at a donut bakery that sold gourmet coffee. The owner had this great idea of opening til 10pm on Fridays and we told him it’s not a great idea because there’s a security issue and it probably won’t be profitable because it’s not a busy area at night but he didn’t listen. We’d have drunk people coming in but not buying anything, or they’d ask to use the bathroom. Or they come in and try to bargain with us about prices. I had a guy came in and just sat at one of our tables and stared at us standing behind the counters so that was creepy. Eventually he left but man that was unnerving. No one came in to buy coffee and eventually the owner decided to just close the store at our usual time. It was costing him about $60/hr to keep the store staffed eith 2/3 people so the extra 4 hours we were open it was costing him $240 and we definitely weren’t making that much money.",
            "Because sex",
            "There's a 24/7 laundry mat/coffee shop near me. They have pool tables and a full coffee shop and a nice, chill atmosphere, so you can do your laundry and just hang out. It's nice.",
            "There were lots of these in the 90s and 00s. We replaced them with reddit.",
            "Bob's Big Boy in my small Midwestern college town used to be open all night; still might be. It's not a coffee shop, *per se*, but as an undergrad sometimes guys would go there for coffee & fries just to shoot the shit somewhere other than in our puke green dorm rooms.",
            "I used to work at a coffee shop in like 2012 that was 24/7 in the 70s and 80s but the city threatened to shut them down because of the amount of illegal activities that would go on in the large 'sitting room' we could not see from the room the counter was in. Another location was still 24/7 and the staff at that store was fucking miserable. They regularly had to call the cops on the customers for everything from \n\n- openly dealing drugs\n\n- showing up drunk and fighting/fucking inside or on the property \n\n- being a base for people to buy \"dates\" \n\nEtc.",
            "America is very seriously lacking in cafe culture. It’s a big reason I love Spain so much.",
            "In the area I live in there is this place that calls themselves a self sustaining commune. But they also have a restaurant where they all work and it’s basically all hippies working in a 2 story treehouse looking building that had weird hours but was basically open 24/7. It was real good food and they also sold home made cookies and stuff they would grow from their farm. People would come here at all hours to drink tea and eat food.",
            "I actually ran a coffee shop with my class during my undergrad and this was a common idea that students were looking for but much like the first comment - it’s hard to make money staying open for those later hours. We tried it for nearly an entire semester and for those who did come they enjoyed they’re stay and we made them feel like at home but selling a few coffees does not even out for even the manual labor costs. My school was located in the brightest neighborhood either so there were some problems of homeless stumbling in but it’s hard because once you let one stay they tell their friends. Make workers feel unsafe and actually had to call the police once... so the idea is there but needed a better location (closer to campus) and someone be able to generate enough money to make it a go-to study spot for students",
            "Covid",
            "Just go to Denny's",
            "The Village in New York in the 60’s.",
            "Come to Brisbane Australia we have at least 2 very popular 24/7 coffee shops, the one outside of the city is mainly for the street car scene but most people are nice and it has a cool set up, the city one you are more likely to see some drunks but it’s pretty rare and the coffee is better as well",
            "We call it AA here",
            "This is what boba tea shops are for!",
            "check out the Phoenix coffee shop in tulsa, my cousin took me there when i was in town for st paddys day one year, and it was a very good vibe, layed back acoustic guitar set too by my cousins girlfriends uncle. dunno if the vibe was like that 24/7, but i would assume so. 10/10 would recommend.\n\nEDIT: i just looked them up, and i guess they are permanently closed. god damn, another one gone due to the pandemic. great memory i have associated with that place. i always hoped they were doing well, i guess corona can end any place even if they have the best vibe. it sucks because they were really pumping in the business when i was there 5 years ago. #fuckcovid19 #supportlocalbusinesses #shoplocal",
            "It’s called a library on your yacht 🛥",
            "It depends on your location really, where I live you hardly can find a 24 hours coffee shop, and when I did (in fact this week) it was mostly people reading or studying with the 2-5ish AM hours being close to a ghost shop because well obviously, everyone is asleep, the friends gathering or all nighter studying isn’t so frequent that you’d see people do it everyday",
            "[deleted]",
            "Diners and donut shops sometimes provide that kinda late night vibe",
            "It’s a combination of operating costs and the fact that drunk people are gonna show up no matter what, methinks",
            "Man just go to sleep",
            "Salaries for working late doesn’t cover customers coming in only to buy 1 cup of tea as opposed to 8 drinks.",
            "depends where you live... people killed all the small town ones by going to Starbucks and dunkin or whatever every day and only a few remain in cities about, but the age of alcohol is winding down with tobacco and beer companies investing in thc and cbd stuff now. things come and go, but coffee is gonna keep being here for a while."
        ]
    },
    {
        "post_id": "cxurmr",
        "author": "Leckzsluthor",
        "title": "Do sighted people really look at the toilet paper after they wipe?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/cxurmr/do_sighted_people_really_look_at_the_toilet_paper/",
        "score": 26659,
        "num_comments": 3644,
        "created_utc": 1567249741.0,
        "selftext": "Hear me out. I'm a blind girl, and I get a bunch of weird questions from people. One I got recently was \"how do you know you're clean when wiping without looking?\" That took me off guard, do sighted people actually look?! Ew! Please tell me because it's been bugging me all day!\n\n edit: I am able to use technology, including reddit, using voiceover and other accessibility settings on apple devices. I have an AMA for any blind related questions!",
        "permalink": "/r/NoStupidQuestions/comments/cxurmr/do_sighted_people_really_look_at_the_toilet_paper/",
        "comments": [
            "Female here: I also look when wiping the front after a pee, to check for spotting or starting my period.  What do you do for that?",
            "Yes I look, I'm paranoid about anything being left over.",
            "I just assumed blind people checked by taste, like the rest of us.",
            "Yeah, to see if there's any poopy still there.\n\nAre you listening to my comment in text to speech?  If so, booger butt poop fart 69",
            "Hold on to your hat/ beer for this one. \n\nSighted people, myself included, check their tissue for different mucus colors after blowing their noses.",
            "My wife does, but I don't because I use a bidet and KNOW I'm immaculately clean.  I feel like I'm becoming an evangelical bidet user but it really is better, brothers and sisters.",
            "Having an inflammatory bowel disease that tend to make things sticky and messy more often than not, I have no choices but to check to make sure nothing's left when I'm not at home. When I'm at home, I end with a wet wipe, and as such, am sure that I'm clean.",
            "Yes, and as a girl, I also do this to see if I've started my period. My period isn't super regular right now because of the birth control I'm on so if I have any symptoms that I've started it I check the toilet paper to be sure.",
            "yes, but mostly to check if (gross) it's a normal colour. i have bad digestion so it's important to make sure it's not like green or something lol.",
            "r/quityourbullshit\n\nNice try, but we all know girls don't poop.",
            "I don't look. Personally, I can feel when my box hole is dry.",
            "Real-life photons are emitted from the poop and literally enter directly into our eyeballs. The daily horror is terrifying.",
            "See the problem is sometimes you have the poop marker effect. And I don't think people that don't check realize it and end up smelling like ass all day. The poop marker is when your butt may be \"dry\" but you keep wiping and wiping and the T P just keeps producing poop. Eventually you get it all but still, those that don't check, with the exception of the blind, are monsters. I personally T P, wet wipe my rusty sheriff badge with a couple of wet wipes, then dry with T P and I'm a brand new man.",
            "[deleted]",
            "I think we should be proud that a blind person has the technology to not only hear the comments but also respond! I've always wondered if I should happen to lose my sight, what it would mean, it's good to see (no pun intended) that we could still be a part of online discussion.",
            "Gross as it is, you can tell a good bit about your health, or at least spot some glaring problems, including some very urgent ones, if you know what to look for.",
            "Yeah. I look. How else would I know there's no more poop on my butt? Wiping can range from 1-10 wipes. Lol. How do you know you're done wiping if it varies?",
            "Yes. That is how sighted people know their butthole is clean. How do you know? And how are you posting here?",
            "Yep.  Lots of comedians (Carlin comes first to mind) have pointed out this little human oddity, but it actually has a pretty reasonable explanation.  While, yes, the primary reason is to check for cleanliness, essentially what this really applies to is checking out anything that comes out of your body (Carlin also joked about people being fascinated with examining picked off scabs and what comes out of our noses), and it's an evolutionary instinct to give you a basic idea of whether or not you might be sick.  Not to be too gross, but yeah, you can kind of tell a little bit about how your insides are doing by the sight and smell of your bodily outputs (pee really yellow/orange and aromatic?  You need to drink some fluid!).  You know how you can tell that you're \"definitely\" sick when you cough, and it just, you know, tastes sick?  Well, for sighted people, we can also get some information from what it looks like.  There's a certain greenish/yellow color to coughed up phlegm and snot that's commonly associated with, \"Oh yeah, I'm sick.\"  \n\nAnd way back in the day when we were all just little tribes of apes hopping down from the trees, with no doctors and whatnot, you could also tell to avoid someone making those kinds of outputs, lest they get you sick.\n\nEdit:  It's like, you may have never momentarily freaked out when looking at your poop after eating a whole bunch of Red Vines (or anything with a bunch of red food dye), but I guarantee every single sighted person here has.",
            "Of course, how else would we know if there's much poop on the last wipe?  If there is, we wipe extra.",
            "[removed]",
            "There’s a bunch of children in here apparently. I can’t fathom how some people are so grossed out by their own normal bodily functions they actively avoid looking at them. \n\nFor people who can see they should absolutely look to not only ensure good hygiene, but also to monitor for apparent illnesses.",
            "This has nothing to do with anything, but I figured I'd bring it up while I have the opportunity. I once saw a question asking how blind gay people realize that they're gay. I understood it to simply be asking about specifics to get a better idea of the experience of being blind, but the question was FULL of sighted people suggesting this sighted person denies that blind people have the capacity to be gay. Very few blind people commented, but those who did were interesting reads and and didn't see a problem with the question at all. Just thought that was funny.",
            "Stupid question here. How do you browse Reddit if you're blind ?",
            "Wash your butt with water and soap after you wipe.\n\nWiping alone does not remove all of the poo.\n\nTo test this theory, wipe your hand on poo, then clean your hand with toilet paper without washing your hand. Your hand still smells like poo. Just like your butt.\n\nSo always wash after you poo. Toilet paper alone is never clean enough.",
            "I see the poop by sonar.",
            "Civilized people use bidets.",
            "I look. I wipe until one comes up clean.",
            "well thats weird i just watched a miniladd video earlier today about him making a joke about how do blind people know when theyve finished whiping or not? Not in a meanspirited way just asking.\n\n\n\nBut well... i do at the verry least. I look to know if i'm fully cleaned or not. \n\nand people are ignorant as fuck... theres been blind accessibility for technology for yearsl. Hell ive seen brail keybords online. just simply type in keybords for the blind and thousands of images will pop up... it aint that hard. And i've seen an individual who has shaky hands (ant remember the name of the condition) having to use a bigger keybord so it causes less mistakes... shit happens and if theres a dissability, theres probably some kind of support when it comes to technology for it. Hell theres even comic sans keybords for people with dyslexia as comic sans is one of the easiest fonts for a dyslexic person to read. especially if the keybord is yellow and the text on it is dark.",
            "The answer is yes, and I understand you think of it as gross, but if you could you probably will do too, is just a reflex, basic survival instict, from our most undeveloped parts of the brain we are set to watch our excretions to look for something that's not al right at all, such as blood, or anything that could mean being sick, so is just a normal and natural thing to do like a lot of other odd stuff humans do that make us remember we are just animals with very developed brains.",
            "Hey if you didn't know, sighted people almost ALWAYS check because part of it is instinctive. By looking at our stool, we can see how are health is doing and it can show signs of what's going on in the body. You seem like a really nice person, I wish you the best in life",
            "The reveal comes when OP posts a pic of their room and we can see all the stained underwear covering the furniture",
            "People who don’t check are usually the ones who smell like ass because they have nasties left over.",
            "Unrelated to the post, but why are so many comments in this thread posting twice?",
            "I read this while taking a shit",
            "YEP. I gotta make sure I got all of it so my underwear isn't ruined!!",
            "I'm sighted, and I'm apparently in the minority because I do NOT look. I've never had a need to. I can always feel when I'm clean, and I never have skid marks or anything like that either. It's always super weird to me that people have to look, and can't just feel that they're clean?",
            "[deleted]",
            "Molly???  (Just based on how you answered a few responses below)",
            "The number of times I've thought I was done wiping, but taken an extra wipe only to learn that I wasn't clean yet is alarming. \n\nSince you aren't able to check, have you ever gotten an intensely itchy butthole? Ever had butt crack burn a little? Could be you've just had one of those neverending wipe types of poops and don't get clean enough!",
            "How do I know it's clean if I don't look? Everybody poops, sure it's gross but I'd rather look at toilet paper than be itchy and stink all day",
            "We ( South Asian ) use our finger. Roughness is the parameter. If it's smooth keep rubbing.",
            "Sometimes it feels like ur done and then you look at the paper and realize you were horribly wrong...\n\nSo that's probably happened to you at least once",
            "Im typing here simply because now i know its going to be read outloud by a computer and find that very intriguing. You are breath taking. Have a great day.",
            "Yes. I work in nursing and have had the unfortunate opportunity to witness this far too many times. Also most of you are horrible at wiping your butt. Y'all use too much toilet paper and I swear to God some of you just mash it around like you're trying to kill a spider or something.",
            "Definitely look because until the toilet paper looks clean, you know that you’re not finished wiping. I’m not sure how else you could really tell because it’s not always consistent that you get the same results with the same amount of wipes.",
            "I haven’t read all the way down the thread so not sure if someone else had mentioned it but aside from looking as I wipe I also look at it when I’m done.  The color of stools is important.  Different consistencies and colors will tell you different things about how your gut is working.\n\nAlso, peeing after eating beets makes your pee red so that’s always scary the first time. It’s also scary if you forget you ate it and you wonder if there is Blood in your urine.",
            "I don’t stop wiping until I’ve ejaculated.",
            "I think it’s really about perspective. I love that is grosses you out, because that makes it so much better since you never have to deal with it. But for some strange reason stuff that comes from your body as a sighted person is kind of fascinating. Buggers, ear wax, and yes even shit. It’s kind of gross but there is no way I’m not checking it out as it leaves the system.",
            "Yes? Well, at at least I used to, to make sure that... I got everything I suppose. Don't want to leave anything and regret it I guess lol. But then I got a bidet toilet, and that really just simplified everything and make everything a lot less gross.\n\nI don't know your predicament as a blind person, but as a sighted one it made my life a whole of  a lot easier. Recommend switching 100%!"
        ]
    },
    {
        "post_id": "f9pe8w",
        "author": "None",
        "title": "Why are people talking about Michael Bloomberg like he's a legitimate candidate? He has 0 delegates and continues to have scandal after scandal. Is it just making news? Or is there something I'm missing in the way the primary works?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/f9pe8w/why_are_people_talking_about_michael_bloomberg/",
        "score": 26629,
        "num_comments": 2149,
        "created_utc": 1582700543.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/f9pe8w/why_are_people_talking_about_michael_bloomberg/",
        "comments": [
            "After seeing how unprepared he was for the last debate and how utterly unconvincing he is as a candidate, I think it's fair to say that the only reason anyone takes him seriously is because he has enough money to buy ads that make him look legit.",
            "The media wants to make sure he doesn’t give up until they’ve bilked him for every advertising dollar they can get.",
            "Actually Bloomberg can and has been literally buying Congress and Senate members, he can buy the DNC, News Networks.\n\nHe spend $7m/day on advertising........\nHe pays about 2000 campaign staff (Low ranking) about $2500/month\n\nHe is worth  $57B \nSo far he spent $700m like he is spending monopoly money",
            "He's polling at something like 15%. He's hovering around 3rd/4th in popularity in the race and I think one poll put him in second.\n\nMuch as I hate it, he's bought his way into being a legitimate contender.",
            "Remember 4 years ago when people were saying trump wasn't a legitimate candidate",
            "Bloomberg has 0 delegates because he was a late addition to the primaries, and missed the deadline to be on the ballots for the first few states. But he's REALLY rich, ABSURDLY rich, and is spending millions of dollars on advertising, and traditionally that's the path to victory.\n\n&#x200B;\n\nEDIT: Ack, made a big typo. Thanks /u/292to137",
            "He has 0 delegates because he chose not to be on the early ballots.   The first 3 primaries/caucuses only determine about 2.3% of the delegates for the DNC.    He won't be on SC ballots, either. \nHe's already a household name, and still has over 95% of the delegates left to vote.",
            "I don't think he has a shot, but people generally hate the idea that someone could win their way to candidacy thru money. He showed rise in some polling which could've become a bigger snowball. There was a lot of eyes on him in that last debate where he could've turned the tide if he had great showing. He failed to turn those minds afaik, but those millions spent on ads did get him there, gave him that shot.",
            "Because he makes Donald Trump money look like chump change. But I think it's funny how he can show up to the party with a bunch of money and still get laughed out the door",
            "He just buys himself attention, nobody actually takes him seriously.  That could be dangerous however because nobody took Donald trump seriously either.",
            "News isn't about importance but about interest. No one seems to be talking about the schools that got bombed in Syria on the weekend, either.",
            "💲💲💲<--- that's why",
            "Money talks & bullshit walks.",
            "remember a couple of years ago when that weird failed hotel guy turned reality TV star had scandal after scandal and ran for president? That was weird, too.",
            "The norms have changed after Domald Trump\n\nScandal after scandal  could make him qualify for White House",
            "He might not win but he will sure influence the election. He makes Trump look good even for those who hate him. If it's Bloomberg vs trump many people who don't like trump will still prefer him over Bloomberg. If you think about it all the bad things they say about Trump, Bloomberg has them in worse way. He is exactly the opposite of what Anti-trump person likes. For a person who doesn't like Trump, Bloomberg seems worse.",
            "[deleted]",
            "While I agree, it's not fair to say \"he has 0 delegates\" as an arguement against him. He wasn't on the ballot for every state so far, and of the states they are an insanely small percentage of total delegates. He's going to do better than he should on Super Tuesday thanks to money.",
            "Like everyone else is saying he's been throwing money at this until he's legitimate. Also he's banking that older people and moderate conservatives who don't like trump anymore will vote for him. He's going hard after that ex-trumper vote. It is so sad.",
            "His polling is shockingly high.",
            "Idk if you noticed but the ones with scandals tend to get elected.....",
            "Bloomberg is only there as an anti-thesis to Sanders so there's a contested convention and the party can choose a moderate candidate instead.",
            "He has enough money to anything",
            "So was Trump, and look how that turned out.",
            "TO DISTRACT YOU FROM THE BERN.",
            "It is bullshit that he is in the race and that a quality dude like Yang isn't",
            "He can buy delegates at the convention.  With an obscenely large bribe and a promised position in the cabinet he can buy the pledged delegates from every candidate but Tom Steyers and Bernie Sanders.  Hillary bought the DNC in 2016 for about $20 million. He can buy the entire DNC many times over.",
            "He can't possible win the general election because the entire left wing of the democratic party will not vote.  A primary vote for Bloomberg is a vote for Trump",
            "Even no stupid questions has turned into a circlejerk?",
            "It's reality tv",
            "I like him...think he can beat Trump.",
            "I realize that reddit is very heavily on the bernie train but there are still a ton of people out there who do not want bernie as the democratic candidate. Im not talking about wealthy people that want to see the world burn either. Biden was considered a strong candidate to win the nomination but after some of the nonsense with trump and bidens son, he started to lose support and bernie started to gain in the polls. The general sentiment is that, if bernie is elected we will see another four years of trump. When biden started to dip in the polls, bloomberg jumped in the race to see if he could make up for a potential biden crash. Bloomberg is not on the ballot for any of the states who have voted so far, and he isnt for south carolina either so he would not yet have picked up any votes. The idea is that we can see whether biden is able to beat bernie on his own and so far he has not been able to. If biden doesnt win south carolina, there are questions about whether he should continue to split the vote or if support should swing to somebody else like bloomberg. There are some serious concerns about bloomberg, yes, but hes also done some really great things as well. The media tends to be really black and white with these things because clickbait pays gets people reading headlines and the media is run by companies just like anybody else. News has been really divisive later and frankly its frustrating me to no end. It doesnt help that russia is stoking divisiveness with troll farms trying to get people on both the left and right pissed off about different items. You cant look at somebody like bloomberg and say that hes all bad and not acknowledge that hes done some reallt great things whether it is on gun control, health or education.  frankly, this is what bernie was saying when he was trying to say that some countries like cuba had done some good things despite absolutely atrocious behavior. We grew up with stories of villians and heros so sometimes we view the real world through that lens, but the world is not that black and white.",
            "Billionaire is automatically a hero of the people.",
            "Wouldn't it be amazing if his only point in this whole election was to show how much money plays a factor in our election process?",
            "$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$",
            "Money and annoying YouTube ads",
            "Um yeah you’re missing who the current president is. If he could get in literally nothing is a surprise",
            "Because he's super rich. End of explanation.\n\nYou don't need to be good, smart, humble, experienced, or sharp to get whatever you want in America, if you're rich enough.",
            "His polling shows how many sheep there really are in the country. It's ridiculous that anyone at all would vote for him just because they saw his name in a couple ads",
            "I'm pretty sure that's the whole point. Cause a fuss and divide up the democrats",
            "He’s spending money for “tax write offs” not that he’s paying taxes anyway.",
            "He was never in it to win. He’s in it to try and make sure Bernie doesn’t get the nomination.",
            "The people wanted Bernie in 2016 and the powers that be didn’t allow it. The powers that be figured Warren would be the shoehorn this year the way Clinton was. I hope that this comment ages like milk, but the democratic powers that be won’t allow Sanders to win the nomination.",
            "It's called manufactured consent. The corporations control the media narrative and get to pick what we talk about.",
            "It worked for Trump",
            "mr krabs meme money",
            "He doesn’t need to care about scandal after scandal. He can afford to look bad in the debates. Mike Bloomberg is a legitimate candidate cause he could fucking spend 8 billion dollars on the election (less than he makes a year) and not even have a dent in his fortune. 30,000 of his ads play **per second**. I hate to say this but when it comes down to it, a ton of people can easily be influenced by advertising. It’s completely plausible that he can win the primary.",
            "Because the DNC and lying main stream media want him so they're propping him up!",
            "He thinks he can buy the presidency and the dnc will gladly take his money.",
            "The short answer is he's so rich he literally pays people to like him. I know this sounds simple but really it's the truth trust me\n\nAlso, to get serious for a minute, lots of voters who don't pay attention to politics constantly like some of us freaks (lol) probably don't think much of Bloomberg so when Democratic leaning voters see his nice basic Youtube ads they probably think he's a pretty swell deal because they make him look normal and these people aren't paying close enough attention.",
            "He spent millions and started registering in the polls, qualifying for the last two debates. That’s it.",
            "He has unlimited money to grease the wheels. He can donate untold sums to organizations and PACs to come out in support of him. This bought and paid for support then dupes other people into thinking that he is a quality candidate. Any time a public official comes out in support of Bloomberg ask yourself if that person would take money to make an Endorsement.",
            "He is just one of many roads to Hillary Clinton being on the ticket for 2020. That's all it is. No more no less. All candidates except for Bernie are a stooge for hilldog cankles",
            "I’m guessing he thinks he can buy an election. Just let him throw more money away and take the pressure away from more reputable candidates. I’m glad he has been Warren’s target instead of Sanders. I think it’s obvious that the DNC have been and continue to be a shady organization but the VOTERS see it.",
            "Not to mention his annoying as fuck adds on EVERY YouTube video",
            "He has 0 delegates because he isn’t officially in the primary until 3/3. We will see where he stands after Super Tuesday.",
            "The people talking about Bloomberg like he's a legitimate candidate have all been paid off by him. It's just that simple. No actual, organic voter supports Bloomberg, and especially no pundits or journalists. We're literally seeing someone buy the presidency, and it's a joke that Bloomberg hasn't been locked up for it.",
            "He has legitimately unlimited money. As in the half-BILLION he’s spending will be regained within the next 6 months. And he could stand to make 3-4-UNLIMITED billion more dollars if he manages to steal enough thunder from Bernie to prevent him from being elected. He could seriously make 5 or more billion dollars simply by keeping him out of the spotlight long enough for trump to stay president. I mean he’s the most HATED candidate of all time. And he’s openly hating on trump? It’s reverse psychology at its finest, friend.",
            "He's trying to Trump his way into the Presidency...",
            "He's proof that the DNC allows bribing and that they aren't above rigging the election. Which people are mad about last time with bernie and hillary. He's also an easy target for the mainstream, bash the other side candidates like elizabeth warren.",
            "Purchased plutocratic oligarchy propaganda advertising.",
            "Money that's why he's still in. He's outspending everyone on ads and it shows online, on the TV news & radio ..  all it takes is money to keep you going in the race. Apparently he's been cosy-ing the super delegates as well..\n\n\nSo actually if a Democratic candidate doesn't win outright (has to hit a number in delegates) in the first round of elections than the super delegates get to recast their vote..so in a second vote the delegates may change from whatever their initial vote was (which was initially based on the local elections). So in other words even in the Democratic party we aren't technically democratically electing our candidate. Even if Bernie has majority he may lose to someone like Bloomberg bc of the potential for a \"second round\" of voting. They actually recently asked that question on the debates too.. no one wants to change these rules except Bernie bc this super delegates second round rule only hurts Bernie.",
            "He’s paying to be in your face.",
            "Because the YouTube ads make him look good"
        ]
    },
    {
        "post_id": "kpa1bf",
        "author": "None",
        "title": "Did you guys sing songs about killing Barney in school, too? Is this phenomena passed down knowledge or spawns naturally in kids?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/kpa1bf/did_you_guys_sing_songs_about_killing_barney_in/",
        "score": 26607,
        "num_comments": 3675,
        "created_utc": 1609635447.0,
        "selftext": "I hate you, you hate me, let's get together and kill Barney ♪\n\n Recently I found out that pretty much every kid had a version of this song in their school—from the US, to the UK, to the Caribbean. Is this remix passed down or do kids think of it themselves every generation? I'm genuinely curious.",
        "permalink": "/r/NoStupidQuestions/comments/kpa1bf/did_you_guys_sing_songs_about_killing_barney_in/",
        "comments": [
            "Grew up in the Philippines. Our version was:\n\nI love you, you love me\n\nLet's get together and kill Barney\n\nWith a shotgun, bang bang\n\nBarney on the floor\n\nNo more purple dinosaur",
            "I remember Joy to the ~~Word~~ World, Barney is Dead.",
            "So this is genuinely a fascinating subject because the thing is that kids have, essentially, their own culture, and it is passed down from kid to kid, and we largely forget all about it as adults. What usually happens is that an older child (sibling, cousin, schoolmate, whatever) teaches something to a younger one, and then the younger one passes it on to their friends, and some of them eventually pass it down. It's true for songs like the one you mentioned in the OP, it's true for urban legends (especially around schools!), it's true for certain games (especially rhyming/clapping/skipping rope games), and it's true for certain symbols or drawings (the \"Superman S\" is the first to come to mind). Adults don't teach these things to kids; kids teach them to other kids, and eventually they grow up and forget but the culture lives on in the next group of kids and the next and so on. I learned about it when I was studying psychology in college and it nearly convinced me to change my major to anthropology just so that I could study this instead!\n\nEDIT: To answer a few questions I'm seeing repeated...\n\n* Yes, I know it's not a \"Superman S\", but that is one of the names for it, and we do know where it came from! There's a [Wikipedia page](https://en.wikipedia.org/wiki/Cool_S) all about it. Go nuts. A bunch of people are also linking [this video](https://youtu.be/RQdxHi4_Pvc) on the Universal S from YouTube channel LEMMiNO. If you're about to link it too, please have mercy on my notifications.\n* No, I don't know what exactly this field of study is called. I learned it as \"memetic cultural transmission in childhood\" or \"playground culture\". I also don't have a reading list.\n* Yes, shows like Recess and Codename: Kids Next Door do have a grain of truth in them!\n* Yes, kids are bloodthirsty, feral little bastards, lmao. So are adults, we just hide it better.\n\nThanks for the awards, and if you're going to spend real money I implore you to please donate to a local charity that helps kids be kids instead. They need the support, especially in a time when childhood looks totally different from anything we've ever seen.",
            "Mate, we sung a Killing Barney song in Australia in the mid-90s..... and I don't even think Barney was shown on TV here!",
            "Ours was, \"I love you, you love me, let's get together and kill Barney with a 2x4, beat him to the floor, no more taking dinosaur!\" Or some variation along those lines.",
            "This is similar to the \"Jingle bells, Batman smells . . .\" song that every kid in america knows but it's only taught by slightly older kids.",
            "Yes! Kinda... in Mexico we sang (in spanish) about Barney being a dinosaur that lives at a cantina. Smokes Marijuana and injects heroin. Barney comes and smokes a joint  when he feels he needs it. Also he will help you blow shit up with dynamite. \nAah what a great trip down memory lane. Thank you :)",
            "[deleted]",
            "Tic tac toe, three in a row  \nBarney got shot by a GI Joe  \nMommy called the doctor and the doctor said,  \n“Whoop, Barney’s dead.”\n\nAlso, tangentially, I remember:  \nMy eyes have seen the glory of the burning of the school  \nWe’ve trampled all the teachers and we’ve broken every rule\n\nI’m sure there were at least a couple more lines, but I don’t remember how they went. Something about homework, I think.",
            "I'm 28 and was homeschooled until 6th grade. My aunt and uncle (12 and 14 years older than me) taught me that song and several other \"rite of passage\" elementary school things (other songs, the spiky s thing, cootie catchers etc). My 8yo kid is learning this stuff in school now, in a totally different part of the same state.\n\nI think there's actually been a couple of studies done on this idea, of children (specifically elementary-age kids) all over the world having this...generational knowledge of nursery rhymes and behaviors. Part of it is that kids have much larger social webs than we think about, and partly it's because each generation thinks they've reinvented the wheel. They learn things from older siblings/cousins/other kids they see in random places and bring the knowledge back to school, and everyone gloms onto it and parents/grandparents/caretakers are just like 🙄 \"yall really think you're clever, huh\"",
            "Mine was: “i love you, you love me, let’s hang Barney by a tree — With a bullet in his head and a knife in his back, Aren’t you glad that Barney’s dead”\nEdit: thanks for the award! I never thought that this many people had similar versions!",
            "[deleted]",
            "🎵ABCDEFG Barney is my enemy, stick a pistol up his nose, pull the trigger there he goes. ABCDEFG Barney is my enemy🎵",
            "Toronto, Canada here. We had one similar to that, going along the lines of \"I hate you, you hate me, let's team up and kill barney. With a knife and a bat and a 2 by 4, no more purple dinosaur\". We had a lot of those playground rhymes that were terrifyingly violent, along with rumours that there was a secret episode that Barney said the word 'Fuck' on live TV. I think I spreads like wildfire when kids visit or move somewhere else, hence the slight change in words. \n\nIf anyone is interested in this phenomenon of kids always somehow knowing one of those weird rhymes, I'd suggest [Tom Scott's video](https://www.youtube.com/watch?v=V5u9JSnAAU4) about the nursery rhyme \"jingle bells, batman smells\" and how different it is in different countries and regions.",
            "Yup. Buffalo NY and my elementary school did it. Knew other kids who had there own in other districts near me too. Now clue why and youtube wasn't even around so it wasn't from there",
            "I dont remember the songs, but a couple guys in my junior high had a notebook that was around a hundred pages of hand drawn comics, in which Barney met an untimely death on every page.",
            "I had that but we also sang a different version of all star by smash mouth too: “some body once told me, the world was macaroni, so I took a bite out of a tree. It tasted kinda funny so I spit it at a bunny and now it wants to kill me.” I also remember a vague memory of singing about killing Justin Bieber or some shit? children are wack",
            "This as well as the “cool S”",
            "UK ours was a little different and about drugs.\n\n\"I love drugs, drugs love me. Crack cocaine and extacy. Take some once you get up out of bed, just forget when your nose bled\"\n\nNo idea where it came from tho",
            "In Singapore it's -\n\nI hate you\nYou hate me\nLet's go out and kill Barney*\n\nWith a gunshot, bang bang\nBarney's on the floor\nNo more purple dinosaur\n\n*This part may not be accurate",
            "I hate you, you hate me, let's team up and kill barney, with a baseball bat and a 2x4, no more purple dinosaur. The funniest part is my schooling was all in French but we still knew that song in English.",
            "It's actually a weird kid culture phenomenon that had been studied. It's like the jingle bells Batman smells song, or the floor is lava, it's those games and songs that kids share through school and extra curricular activities, and through family and then back to school and so on. They're like germs, kids spread them all over the planet.",
            "yeah what was up with kids and their taste for killing barney",
            "On top of Old Smoky\n\nAll covered in blood\n\nI shot poor old Barney\n\nWith a 12 gauge slug\n\nI went to his funeral\n\nAnd pissed on his grave\n\nSome people threw flowers\n\nI threw a grenade\n\n20 years later\n\nHe rose from the dead\n\nI got a bazooka\n\nAnd shot off his head",
            "I hate you, you hate me, let’s tie Barney to a tree we’ll get a big gun and shoot him in the head.....whoopsie Daisy Barney’s dead\n\nWas a daycare director in the 90’s in Texas kids sang on bus 😜",
            "OP,\n\nFirst yes, joy to the world.\n\nSecond, I think you'll enjoy this video about a similar phenomenon. It's about jingle bells, batman smells...\n\nhttps://youtu.be/V5u9JSnAAU4",
            "Holy shit this post is amazing. Who knew there were so many variations of the killing Barney song? Here's the one we sang in elementary school.\n\n>I hate you, you hate me\n\n>Let's tie Barney to a tree\n\n>With a great big gun and a bullet to the head\n\n>Won't you say that Barney's dead!\n\n\nChrist we were fucked up little kids.",
            "Our one was “I love you, you love me, Barney gave me hiv, It started with a hug and ended on the floor, I got raped by a dinosaur” We got in trouble for singing it",
            "What I remember is this version:  \n  \n🎶I love you, you love me, homosexuality, people think we're just friends, but we're really lesbians🎶",
            "I'd heard of that song but we mostly ignored Barney. To us he was beneath contempt.",
            "In Argentina, my friends and I sang the intro as\n\n>Barney es un dinosaurio que vive bajo un puente\n>Siempre toma drogas y se coge al presidente\n\nWhich translates to\n\n>Barney is a dinosaur who lives below a bridge\n>He always does drugs and fucks the president\n\nSometimes dora the explorer was involved in the drug market too. I think kids just like to use swear words they just learned in the context of cartoons (which they are familiar with and everyone in school knows).",
            "I seriously don't get how things like this were widespread without the internet",
            "Yes! Grew up in NYC, no idea where it came from",
            "It's a type of folklore.  Though it disturbs some - its been common.  I am sure many will remember these:\n\n I hate you\n\nyou hate me\n\nLet's get together and kill barney!\n\nWith a baseball bat...\n\nAnd a 4x4\n\nNo more purple dinosaur \n\n&#x200B;\n\nI hate you! \n\nYou hate me! \n\nBarney and Drew P. gave me HIV. \n\nStarted with a kiss but they wanted more\n\nI got humped by a purple dinosaur.\n\n&#x200B;\n\nI pledge allegiance to the flag,\n\nMichael Jackson is a f\\*\\*.\n\nPepsi Cola burnt him up,\n\nnow he’s drinking 7-UP.\n\n&#x200B;\n\n“joy to the world – the teachers dead\n\nWe barbequed her head.  Where is her body?\n\nWe flushed it down the potty!\n\nAnd round and round it goes\n\nAnd round and round it goes”",
            "ABCDEFG, Barney is my enemy, stick a rifle up his nose, pull the trigger there he goes, twinkle twinkle little star, that’s why Barney’s rated R",
            "I hate you, you hate me, let's go out and kill Barney\n\nWith a shotgun bang bang Barney's on the floor, no more purple dinosaur \n\n\nLearned that from my mom.",
            "It’s passed down by children - they essentially have a separate culture!\n\nWe sang;\n\n“I hate you, you hate me, Barney have me HIV, with his big purple dick, so I shot him in the head, now that fucking Barney’s dead”",
            "I personally never heard of any song killing Barney until recently when I saw another post on Reddit about it.",
            "🎵 I love you, you love me, let’s get together and kill Barney, with a great big hug and a two-by-four.... 🎶🎶No more purple dino-saur🎶🎶",
            "“I hate you, you hate me, let’s get together and kill Barney. Stick a knife up his ass put a gun to his head. Pull the trigger then he’s dead.” This shit was dark af",
            "I love you, you love me lets get together and kill barney, with a great big shotgun bullet to his head sorry kids but barneys dead. - Pennsylvania 2009",
            "I hate you you hate me\n\nLets team up and kill barney\n\nWith a two by four and a baseball bat\n\nSorry kids but barneys dead\n\n\\- A canadian",
            "It’s just like historians getting stumped by all the civilisations who’ve never met,having the same styles and architecture(except the answer for that is because they all the ancients \nCame to the same conclusion that building a circle wheel makes it roll and building up to a single point like a pyramid is the most stable kind of building) children’s nursery rhymes and kids making the same verse is a crazy one though,iv seen posts on DEA subreddit where I thought I was the only one who did stuff but turns out lots of People have the same habits lol",
            "I was just thinking about this the other day!\n\nAnother version we had: \n\nOn top of Old Smokey,\nAll covered in blood,\nI killed my poor Barney,\nWith a 2x4 stud\n\nI went to his funeral\nI stood by his grave\nPeople threw flowers\nI threw a grenade.\n\n\nInteresting phenomenon, a very blatant rejection of \"baby stuff,\" because no one wanted to be a baby who liked baby things like Barney. Casual familiarity with current language was how we indicated that we were big kids now",
            "in my area it was \"i love you, you love me, let's get together and rape Barney!\" which in hindsight might be just a little more fucked up than kill but eh",
            "It's kind of like the weird super man S everyone used to draw but no one knows where it comes from.\n\nWe were all tiny psychopaths who hated Barney apparently.",
            "I'm convinced this was beamed into all of our heads in some sort of global MK Ultra type experiment.  \n\n\nEDIT: \"I hate you, you hate me, we're a fucked up family. With a knife in his back and a bullet in his head, aren't you glad that Barney's dead?\"",
            "We had one to the tune of that, but it was about the teletubbies. \n  \nI hate po, po hates me,   \nTwinky winky shot dipsy,   \nWith a great big bang and a bullet in his head,  \nDon't tell La La dipsy's dead,   \nLa La cried, then he died,  \nPo committed suicide,  \nTinky Winky did the same,  \nTeletubbies are insane",
            "Our school made a variation of the beginning and the ending song: \n\nbeginning: \"Barney was a dinosaur that sat on a heater, pressed the button by accident and burned his own weiner\"\n\nEnding: \"I hate you, you hate me, let's get together and kill Barney, with the US army and nothing more, no more purple dinosaur\".",
            "Yes, and everyone seems to have a different one. My school had one that started with:\n\n*Joy to the world\nBarney is dead\nWe shot him in the head!*\n\nUnfortunately I don't remember the rest of the lyrics but maybe someone does if their school had the same one by chance.",
            "YES WE FUCKING DID!!!!  🤣🤣🤣 I was a 90s kid and barney hatred spread far and broad, it was even on the covers of our drugstore magazines.",
            "My school's version was\n\nI hate you, You hate me, Let's all go and kill Barney, With a one shot, two shot, three shot, four, No more purple dinosaur.",
            "Here in germany i must say no. I did not in fact sing of killing barney",
            "Yep! I live in England and ours was “I hate you, you hate me, let’s get together and kill Barney, with a baseball bat and a bullet in his head, oh my God now Barney’s dead!”\n\nI have no idea who started it or how it got to us. I assume it comes from the same dimension as “Jingle Bells, Batman Smells” and The Cool S.",
            "As a person, who's first language is not English, can say that this is my first time hearing of such rhymes and I am really glad I had not before.",
            "I remember that one, haven't really thought about since first grade but we definitely sang it.",
            "We had that, the timeless Batman smells ,and \n\nMy little pony\nSkinny and boney \nPony jumped on a wire \nAnd caught in fire \nHooray!",
            "How does something like this start, reading all the comments its not only nation wide its also world wide",
            "Lived and went to school in Saudi Arabia, can confirm, sang the same song as well.",
            "Yep. Honestly it has to be passed on. No way everyones coming up with that on their own",
            "What’s crazier is this spread across the world without social media or even internet",
            "Its also a barney song but its the other one:\n\nBarney is a dinosaur with no imagination, one day he ate char kway teao and died of suffocation.\n\nIn the nineteenth centurry he rose up from the dead, then he took a machine guncand blased off his head",
            "USA here, our variation was “I love you, you love me, let’s get together and kill Barney, with a big fat knife and blood on the floor, no more purple dinosaur,” Glad to hear I’m not the only one who heard this shit",
            "Yeah I remember those. The big one at my elementary school was:\n\n🎵\"Row row row your boat gently down the stream, push Barney overboard, listen to him scream.\"🎵\n\nAnother one was 🎵\"I hate you, you hate me, let's get together and kill Barney, with a great big knife and blood on the floor, no more purple dinosaur.\"🎵",
            "I remember this!  We always sang about killing him with a 2×4. \n\n My boyfriend grew up in Brazil and had no clue about any of these killing Barney songs",
            "Can confirm passed down somehow. My son got in trouble for singing it on the bus. We discussed with him not singing that sort of song anymore but not before we got him to sing the whole thing for us while we put on a stern face.",
            "Canada here,\nI love you, you love me we are a happy family\nLet's take a baseball bat, hit him in the head\nSorry kids, but Barneys deaaad",
            "Did you also hear rumors about Marilyn Manson having his ribs removed so he could give himself a blowjob?",
            "Not sure if this has been commented already, but I recall a book being published where the author researched all the kid rhyme/parody variations (of Barney and others) and how the travelled between communities... I can’t remember the name and couldn’t find it in a couple google searches... but I know it exists.",
            "I had all of Barney’s video cassettes as a kid. I’ve never heard a song like that. [Barney is an OG](https://m.youtube.com/watch?v=S6bl8dqUHa4)",
            "Has someone found the origin of it in this thread?",
            "I hate you,\nYou hate me,\nLet's kill Barney instantly.\nWith the shot gun bang,\nBarney hits the floor,\nNo more big fat Dinosaur.\n\nI grew up in Australia and this is the one I learnt as a kid.",
            "yeah it is natural to turn a stupid song about love into hate and killing... isn't that what 10yo boys are all about? (the original song sung by barney is of course, \"I love you, you love me, we're a happy family\")",
            "Ours was, \"I love you, you love me, let's get together and kill Barney. With a shotgun, bang bang, Barney on the floor! No more purple dinosaur!\"",
            "Not exactly killing Barney, but a parody of \"I Love You\" in Mexico when I was in middle school:\n\n\"Te quiero yo/ a ti matar/ con una pistola 3000/ con un fuerte balazo te mando al hospital/ y luego al funeral\"\n\n\"I like you/ to kill you/ with a 3000 gun/ with a strong bang (bang) I send to the hospital/ then to the funeral\"",
            "I hate you \nYou hate me\nLet's get together and kill barney  \nWith a big shotgun and shove it up his ass \nNow we're happy bc barney is dead :)",
            "Row, row, row your boat gently down the stream,\nThrow Barbey overboard\nAnd listen to him scream. \n\nI honestly can't remember the next part but I think there was also a few versions too so it's probably varied.",
            "In Pakistan ours was: I hate you, you hate me, let’s go kill b-ar-ney, with a punch and a kick and a bullet to the head, sorry children Barney’s dead.",
            "I hate you, you hate me, let's get together and kill barney with a baseball bat and a BB gun, let's get together and have some fun. Courtesy of my elementary school.",
            "Here in Scotland we had one not so much about killing him, but about him dying:\n\n“Barney was a dinosaur with a big imagination, he stuck a finger up his ass and died of constipation” to the tune of “Barney is a dinosaur”",
            "A B C D E F G \nBarney is my enemy\nShoot him with a .44\nNo more stupid dinosaur\nA B C D E F G\nBarney is now history",
            "Down at fraggle rock, grab a fraggle by its cock,\n\nTwirl it in the air, pull out all its pubic hair,\n\nChuck it on the grass, put a chainsaw up its ass,\n\nTurn the power on, now the fraggles gone.\n\n- U.K. school kids, early 90’s.",
            "The one I remember from NE Scotland was\n\nI hate you, you hate me\n\nBarney gave me HIV\n\nSo I pulled out a shotgun and shot him in the head\n\nNow that pink bastard is dead.\n\n\nIt's interesting to see all the different versions.",
            "My school’s variation was “I hate you, you hate me, let’s get together and kill Barney / With a baseball bat and a 2x4, no more purple dinosaur!”",
            "Subversion is fun to children. Not necessarily the violence as much as discovering the power to control a message. \n\nJingle bells\nBatman smells... Etc"
        ]
    },
    {
        "post_id": "k6tm1m",
        "author": "OrNa721",
        "title": "How the hell am I supposed to know what I want to do with my life at 16 years of age?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/k6tm1m/how_the_hell_am_i_supposed_to_know_what_i_want_to/",
        "score": 26513,
        "num_comments": 2832,
        "created_utc": 1607116091.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/k6tm1m/how_the_hell_am_i_supposed_to_know_what_i_want_to/",
        "comments": [
            "Wear sunscreen",
            "Literally in the same situation as you mate, I find it hard to find motivation to work hard in school when I have no idead what I am working towards.",
            "You don't need to!! You just need to start making plans for the next few years, not the rest of your life",
            "[deleted]",
            "You're not supposed to.  Nobody should be expecting that of you.",
            "I was very lost at that age, I was so frustrated that I didn't have a clear direction or path. My advice is don't spend thousands on higher education unless you're sure that's what you want to do. The only class I was ever good at was Biology, so I went that way. I ended up dropping out of college because I don't like working in labs with no windows. It took me roughly 15 years, and many many jobs later, that I just don't really like being around people that much. With this in mind and my love for Biology, I put myself through online courses for Medical Transcription - I now type up doctors reports in the comfort of my own home, something I could never could have guessed I would be doing at age 16. I don't get paid too terribly much, but it really works for me and I feel more fulfilled than ever. \n\nI have never regretted dropping out, I've saved so much money and I paved my own path (though I don't think my folks will ever forgive me). I'm obviously not recommending being this impulsive, but I followed my heart each step of the way, and I'm ever so thankful I did. \n\nYou do you. \n\nAlso Alan Watts videos on Youtube greatly helped calm my 'wtf-am-I-doing' feelings.",
            "I *had* a very solid idea of what I wanted to do at 16.\n\nI wanted to 'Do' Art.\nThen I went to Art College. Only applied for 1 (Due to Money reasons)\nGot in.\nThen I contemplated what it meant to have an Art job. Ran some numbers.\nI wanted to be an Concept Artist (Freshman year)\nThought maybe I'd all back on Graphic design (Softmore year)\nThought I wanted to become a painter (Junior Year)\nThen I decided I wanted to be a comic artist (Senior year)\n\nI did well in school, I had plenty of encouragement and mentors. Struggled to find work, hated the freelance lifestyle.\n\nJoined an Agency, did graphic design. Did well enough to make 95k/yr, on a path to more. Still hated it.\n\nMeanwhile, I taught myself programming, found myself some tech work, then Found myself at a company where I'm a lead programmer (29 years old, now)\n\nLove the work, still do Art as a hobby.\n\nEven folks who 'know' what they want to do, don't *know* what they'll end up doing.\n\nYou just gotta be safe, be smart, and make good decisions : 3 (Its what my Government teacher in Highschool used to say to us every Friday before we left for the day)",
            "[deleted]",
            "I’m 40 and am still trying to figure out what I want to be when I grow up.",
            "Honestly here's the advice I wish someone gave me. \n\nExplore YOU!!\n\n I didn't realise until I was almost 30 just how many job possibilities there are. \n\nIt's easy to hear \"you can do/be whatever you want\" and not realise how literal that can be. \n\nI was in my mid twenties before I really found the hobbies I love and the lifestyle that makes me happy.\n\n If I could have based a path on these things when I was 16 the world would've been a whole different ball game.",
            "This is why I hate society's pressure to go right to college after high school. Ppl start college and drop out or keep switching classes and build up a ton of debt that makes them feel like even more of a failure. \n\nThere's no shame in not knowing what you want to do yet. There's no shame in not going to college. I know plenty of people who make way more $ who never went to college, than those who did go.\n\nYour life is your own. Please don't let others pressure you into doing what they think you should do. It's WAY too much stress at a young age.",
            "Those who \"know\" what they want to do with their lives will probably prove themselves wrong anyways. I would say focus on your studies but not to the exclusion of your social life and health. Try to get enough sleep and don't let yourself become isolated -- in other words, lead a balanced life. If there's an academic topic that interests you, you can still dig into it with the knowledge that it won't necessarily be your lifetime career.",
            "I hate that schools make you feel like that.\nI think the best approach is to study stuff you like and/or apply for jobs you are interested in\n\nLike my school was telling us that studying a langauge is a good way of getting into uni when we were 14 and not even thinking about uni.\nSo many kids did it just incase because they were scared that not going to uni meant not having a future but not going to uni is not the end of the world.\n\nDon't do anything you don't actually want to do.\nLike don't pick a subject you don't like over one you do like just because you think the one you don't like makes you more employable.\n\n and don't just study something because you just met the requirements for it. A lot of institutions (at least where I live) host some really poor degrees with qualifications with low entry requirements.\n\nIf you dont meet the grades to get into the good degrees you're litterally better off finding a different route into the industry than wasting your time on a bad qualification.\n\nTons of people actually discover what they want to do when they're middle age so you really don't need to worry too much if you don't have a plan at 16.",
            "__tl;dr: this is the time to start planning. Good question.__\n\n\nRumor has it, that most people change their major/career 3 or more times before they find their *true calling* but, don't lean towards this though, just do what u want and earn good money to do what you like to do on the side. Who ever is asking this of you, is probably just trying to motivate you into thinking about your future and, obviously, has done a good job. Don't stress about it fr. Just think about how to tell this person a 'goal' you have in mind to let them know you're trying. Even if you don't fully believe it yet, time is the most notable factor of all and you will eventually know, and understand, what you \"must\" do. Good luck out there, hope this helps!",
            "Be patient. You’re 16 and have plenty of time.",
            "You don’t. Spoiler alert but adults have no idea what the fuck they’re doing. That was one of my first lessons of young adulthood. Everyone is lost and that means you have the agency to do **whatever the fuck to want** with your life!",
            "You dont. And if you do, most people find out 16 yo's are dumb.",
            "At 16 the goal is to try multiple experiences and see what you like. Volunteer at a pet shelter to work with pets, volunteer to help coach a kids sport league and get a feel for leading people and dealing with conflict, etc. \n\nDon't like volunteering? -> try to build your own computer, or like me at 12 take apart your current computer and try to figure out how it goes back together. Youtube how to code Python and see if you enjoy coding,  etc.\n\nYou might also spend $14 bucks on Amazon and order the MBTI personality test to get a baseline for what you're strengths and weaknesses are. I don't recommend the online tests as they aren't very accurate and are designed to get mouse clicks, not produce accurate results. Based on your MBTI you can look at common jobs your MBTI type finds success in. \n\nOther thoughts, maybe join some clubs in high school. I was on debate team and scholar bowl. I hated one and loved the other. Might give you some insights. It's all about experiencing what you can to get a feel for what you enjoy and find passion in. Your passions won't always line up with the job market, so consider starting your \"ever changing\" life goals. Do you want financial success or be a starved artist who enjoys what they do? This can also give you insights on what you should pursue. \n\nBest of Luck.",
            "Ever since middle school I KNEW I was going to go to college (At the time I wanted to major in psychology but that’s irrelevant to this story). The majority of my friends graduated high school and started working in downtown in the fashion district, but I didn’t stress out about what to do with my life since I still had several years to go until graduating college.\n\nWhile at college, you’ll have to take general education classes that are required for any major. There are specific sets of classes you have to take for specific majors, but you don’t even have to worry about that during your first two years. Lots of people start with an interest in sociology or psychology and then pivot their majors because they found something that interested them during their first two years.\n\nYou can also change majors at anytime! There are older people that attend these classes after deciding they wanted a career change. Don’t worry if you don’t know what you want to do now. Just focus on school and going into college. \n\n*I ended up changing my major from psychology into business marketing at CSUN and am currently the Senior Director of Content Marketing at a fairly large agency. If you’re interested in marketing, I’d be more than happy to chat with you about it on a video conference call!",
            "Fucked up, isn't it? And if you make the wrong decision, you're out thousands upon thousands of dollars.\n\nLet me help.\n\nFirst, figure out what sort of work makes you happy. There's this guy, Pink, that's figured out what makes people motivated at work. And it's three categories: autonomy, mastery, and purpose. Figure out which of those categories speak to you most. Once you figure out which speaks most to you, think about the things you have a natural inclination towards. What subjects do you most enjoy? What classes come easiest?\n\nOf course, the real world doesn't work like school work. So when you widdle it down, imagine yourself in that work scenario. Imagine the day to day. Can you see yourself behind a desk? What about your co-workers? What about staticism versus dynamicism?\n\nFind your internal motivators. Find your natural strengths. Find your day to day needs.\n\nIt's still a difficult process. And even then you have to execute. And it still might turn out bad. That's life.\n\nBut those clues should help you along.\n\nEdit: i hate all the answers that are like \"it doesn't matter,\" \"you can't,\" etc. In a way, they're right. You need life experience. You need job experience. But it *does* matter. That's why we have all these people in unfulfilling job roles asking for loan forgiveness.\n\nI realized I couldn't be a programmer when I was in my programming structures class and noticed I seriously disliked all the people I was surrounded by. Those were my future coworkers. People I would be spending the rest of my life around 40 hours a week. I realized I couldn't be a zoologist when I thought about the job prospects and the likelihood of being a poop-scooper a fair portion of the time.\n\nYou have to be able to imagine the reality of your choice. Don't buy into the fantasies.\n\nNow, there is something to say about letting life take you in its flow. You realize what makes you happy in actuality, not just theory. You make moves out of necessity and find the right mix of what you need versus what you want.\n\nBut as far as personal direction goes, follow my advice above. Figure out what's most important to you: making a difference, having control, or being the best. Then figure out what field you want to apply that to. Then finally imagine your life in that role. If something doesn't feel right, back track. Always give yourself a way back. Don't over commit.\n\nYou're young. You have time. You have options. Don't remove yourself from those privileges.",
            "You aren't. Just keep learning and trying your best with the things you find fascinating. If nothing is yet, find other things. Never stop learning and trying new shit. I didn't know what I wanted out of life till I was in my thirties, and even then that changed again when I had children.\n\nLearn, grow, make the world a better place. Be a better person. That is your goal. Knowing how to get there is part of the journey.",
            "[deleted]",
            "Hey man I’m 16 too and I feel you. Rn I’m just going for Max camos on Cold War, plan on playing Miles Morales soon since I got it on launch and haven’t played since, started exercising again so I want to make progress with that, and to just have a laugh with my friends. I got no idea how life will turn out but I got that stuff to think about now.",
            "Most people have no clue at 16, and most that thought they knew have changed their mind, majors, and careers multiple times before they're 30. Very very few people know what they want to do with their life and follow through on it from such a young age. It can certainly seem overwhelming but you'll figure it out, and eventually you'll realize even adults don't know, that's just part of life.",
            "Don’t sweat it bud, your brain doesn’t even stop developing until like twenty five, so you’ll likely change your outlook on life and any firm decisions several times til then.  That’s why experiencing multiple different things during this time is great",
            "Almost nobody ever really does. The idea behind the question is to create some momentum. Think about all the things you might want to do, start figuring out where the paths to those things overlay, and start taking those first steps. It's ok to not have a fully formed plan, as long as you don't let that lack of a plan keep you from moving forward.\n\nThink of life like a theme park with hundreds of rides. You're not going to get to ride all the rides, but you've got time to ride a whole bunch of them and even if you don't know what you want to ride first or most, you can generally start heading in the direction of a cluster of rides that look enticing. You might ride some stinkers at first, or you might stumble across a ride you didn't know existed. The only thing you definitely don't want to do is sit at the entrance, the one place with no rides, hoping the perfect ride is going to appear in front of you. You gotta wander a bit.",
            "At age 18, I already know exactly how I *want* my life to go. Things change and you change as well so what *will* happen in my life is probably going to be completely different than what I want to happen.\n\nMy advice to you is, over the next few years, plan your next 20 years and adjust accordingly as those 20 years come. You probably won’t be where you planned but you’ll be a hell of a lot closer than if you stumble blind for that time",
            "It's normal, Kiddo.   \nNone of us really know what we want to do with our lives.   \nEver.   \nI'm 51 and still have no idea.   \nYa just kinda pick something, do it, and maybe later you decide on something better, maybe later you don't ...   \n... and then one day you wake up old and die and none of it mattered.",
            "You don’t, although probably best to try and get a scholarship for college to avoid student debt",
            "You're not, and it's quite likely a mistake to think of life in those terms anyway. \n\nI haven't aligned my life around any one specific \"career path\" for quite some time, and it was only after I let that go of the idea that I must be on a \"path\" or \"plan\" that more genuine goals and desires started to fill up my life. \n\nI recommend listening to Alan Watts lectures, as some else on this thread mentioned. Practicing mindfulness meditation is also wonderful for quelling those anxious thoughts. Ironically, it's the anxious thoughts of \"what *should* I be doing???\" that lead you nowhere.\n\nAs for the mechanics of your actual life...\n\nJust try to make good decisions every day. \n\nBe kind to people.\n\n(But don't let people take advantage of you.)\n\nPursue things you are genuinely interested in.\n\nCultivate good relationships that bring you joy.\n\nIf you need money, find a job you don't hate and try to be present.\n\nAnyway, most 16 year olds need way more life experience to settle on what they would actually like to be doing. \n\nRelax. For now, you've got this. :)",
            "I'm 26 and I have no idea what I'm doing either. Don't put that expectation on yourself, and don't let others put it on you. Any friends you have who think they have their life figured out are wrong. I took classes in High School that I had no interest in because I wanted people to think I was smart. I have a degree for something I have no interest in pursuing. However, I'm happy and secure now and that's all that matters. As long as you learn from the choices you make, you'll be ok.",
            "It isn’t about knowing what you necessarily want to do with your life, it is about finding out what you are passionate about and throwing yourself into it which may lead you to what you want to do with your life.\n\nI will use my kids as an example.  Neither really had a ‘drive’ to do anything. My daughter was a middling violinist and my son liked history but that was it.  So I suggested putting my daughter into violin private lessons for her and found a really good teacher who plays with the local symphony, and my son decided to try debate and theatre.\n\nNow a year later my daughter has taken up guitar as well as violin, practices about 2-3 hours a day on each and is in AP music theory.  She also was made the concert master for the senior level high school symphony, the local youth symphony and beat out the upperclassmen for the senior jazz ensemble as the rhythm guitarist, as a sophomore, and just finished her auditions about two weeks ago for all state.  She is also pushing for conservatory now after college.\n\nMy son fell in love with debate and theatre. Went to Nationals for novice in his first year and took 4th, and is participating in the local city theatre troupe and his high school productions (they are doing radio plays due to covid).  Now he has decided he is going to use those skills to help him when he goes for poli-sci and history in college in 4 years.\n\nThis isn’t all to say how awesome they were and I have wonderful kids, it is more as an example to show what high school is supposed to be about.  Figure out what you like and throw yourself into it.  Honestly colleges are more about that than awesome grades and test scores.  Grades and test scores just show if you can do the work, jumping into your passions demonstrates your willingness to do the work on your own rather than just going with the flow.",
            "Almost 30 here (feels weird even saying it). Best advice I wish I would have followed: get a hobby for sport, one for money, one for creativity (one could also say personal brand). \n\nBe passionate about them. And then be disciplined. \n\nFollow your passions, train them. Life wont hand you any answers but time will tell and you ll be ready for opportunities.",
            "You dont have to, but you should really try to do well in school, and definetely find things that you like now.  \nIm almost 17, and I have been struggling witht his for around 3 years, rushing to start a business and make money out of fear of not being successful or not having enough time later, but I realised that I do, and for now I just need to find one thing I love, so I tried many things, I still am, but I feel like im getting closer, I tried many things and I liked most of them, eventually I had to decide which I liked more, and now I think I know what I want to do, but it all starts with findig things you love doing now, and not thinking wether you will still love them in the future.",
            "[removed]",
            "You're totally not supposed to! I wanted to be a pilot at sixteen and now I'm a psych/criminology major. You've got time and to quote a John Melloncamp song, \"hold on to 16 as long as you can\"",
            "Yeah, it's fucking absurd.  Before you're allowed to legally drink, you need to start planning your entire life!  Who the fuck thought that was a good idea!?  There are so many jobs, opportunities, skills, etc you don't even know exist!  How can you possibly make an informed decision when you're that young?  You can't.\n\nThere are options though.  Maybe you can take a year off school, spend your first year of college taking a whole variety of classes to find what you like, look into trades because college is stupidly expensive, etc.\n\nIf it helps, I know a lot of happy and gainfully employed people who dropped out, or are doing a job that isn't related to their major.",
            "Life is just a series of 2 year plans\n\n\n\n...and dogs",
            "Just figure out the next year and a rough idea for the next 5. Then take it from there.",
            "Dude I just turned 26 and I still have no fucking idea",
            "I will tell you what I tell my four kids, ages 13 - 25.\n\nI don't expect you to know what you want to do for the rest of your life. However, that should mean that you don't know all the things you don't want to do, either.\n\nWhen any of my kids would say something like, I don't wanna be a physicist I don't need this math or I don't need to study this hard I don't wanna be a doctor, I would remind them that they are only teenager and don't know what they want to be yet.\n\nThe point being is don't let your decisions today limit what you could be tomorrow (edit: you might not want to be a physicist but discover you might like engineering). Goofing off and flunking or getting arrested will limit future prospects. Invest in yourself by doing what you can now to be able to be whatever you might want later.",
            "Well, you have had 16 years to think about it.",
            "i think 25 is when i felt like i really knew what's going on in the world",
            "You don't need to plan your whole life. Just think about what interest you and what you would want to do. Some people have it planned at 12 others at 18. Just think about the coming years not your life time",
            "You don't have to know what you want to do but my biggest advice is to not shut any doors. Take physics, take Chem, any elective that slightly interests you because you don't have to know what you want but start to figure out what you don't.\n\nI would have never imagined at 16 that at age 30 I'd be legally responsible for the lives of 180 people when I fix airplanes\n\nFor contrast my girlfriend is 30 and has no idea what she wants to do",
            "I feel that way at 36. No one at any age can plan out their life. The best battle plans are only good until the first sword is drawn.",
            "I tell my kids;\n\n- Has to pay well\n\n- Has to be protected by an industry body \n\n- You can travel with the profession\n\n- Its a profession you can age in.\n\nAfter these hurdles are covered,  then what seems more enjoyable.\n\nBut really, many people change careers through their life. You make the best decision you can today, and you'll fix it if you need or want to.",
            "Nah dude, just figure out the stuff you like now. Most people don't stick with the same career anyways.",
            "You are not expected to know.  Try different things, fail and learn from the experience.\n\nThe best advice I ever got was more choices are always better than fewer.",
            "Don't let yourself be made to feel rushed. Take your time to choose a path. People around you are being goaded this or that way. You will compare yourself to them based on having the same age. Pushing yourself to make decisions is what gets you into all kinds of messes.",
            "Life is like a [plinko game](https://youtu.be/naUppHrHJpI?t=262).\n\nIn the beginning, when we're young, we all have some level of control over our destiny. We can choose where to start, and as we go, we can make little lateral moves. Huge moves can happen over time.\n\nBut as time passes, and we move farther down the plinko board, those big changes become harder and harder until they eventually become impossible, and we're effectively stuck with the choices we've made.\n\nIt doesn't matter that you don't know what to do with your life right now, because it's unlikely that anything you plan now will actually be where you land. Life is more than the decisions we make, and there's many variables beyond our control.\n\nThe point is that you don't stand still. Keep moving down the board. If you don't know what you might want to do, start by looking at post secondary courses or trades that might interest you, and START them. Once you're there, that's where 'life' happens. You'll figure out if it's for you or not, you might meet someone that hooks you up with a summer job that turns out to be perfect for you, you might decide you don't like studying and prefer learning with your hands, etc.\n\nKeep moving. Don't stand still. Steer your destiny. Because the regret from making a mistake is nothing compared to the regret of doing nothing.",
            "I asked that question at 16\nNow I’m 20\nAnd when I’m 24 and I probably still won’t have an answer for that question. \n\nBasically what I’m getting at is, I think you won’t know what you want to do until you do. You just gotta keep going through all the options till you find it.",
            "For someone at your age, it’s not so much about choosing which door to open as much as it is which doors to close. You can start deciding which career paths you aren’t suited for, and as much as you need to, stop investing in those. There are probably a lot of jobs and careers you will be happy doing. Discovering what you aren’t going to be happy with and competent in is highly useful.",
            "Pick something that gives you decent time off and pays you enough to actually enjoy that time off.",
            "I'm gonna be 24 in 3 months and still asking this lol",
            "The only way you'll know what you want to do with your life is to do something. If you like it, then good, if not, then switch. Don't feel obligated to do everything everyone wants you to do. I didn't go to college until I was 24, and now I'm out and 28. There were so many people that went to college because they felt pressured to do so. Many of these people failed or switched majors numerous times. Doing this is a waste of money and time. Sometimes the journey is more important than the destination, and this is so true for life. Enjoy the now without forgetting the future.",
            "You don't have to commit to anything right now. Ask yourself things like, \"do i enjoy working on a team? Am I into the arts? Do I like to build things?\" There are so many fucking jobs bout there, there's no possible way you could know what you'll end up doing. But use your interests to at least weed out the stuff that really sounds shitty. Remember, not everyone gets their dream job, but, if you put in some effort, you can have a nice life. Don't stress about it now. The fact that you're asking yourself this question shows you'll take initiative to find out that hard to answer question.",
            "You don’t need to have a plan. If you have a plan, OK. But don’t get locked in, because you can expect your priorities to change (multiple times). \n\nMy plans became more stable only in the 30s. With 16 you should be content with having a plan for the rest of the day. The “great” plan at that point should be to keep yourself as many options open as possible.",
            "I feel like I'm the only 16 (and a half) year old who actually knows what I wanna do, I'm gonna be a game designer...one day, for anyone who cares.",
            "Your not. In fact, no one really does and if anyone tries to imply your supposed to have it all figured out they probably have some things to figure out themselves.",
            "One piece of advise I could give myself looking back a decade, start with what you DON’T want to do and go from there.",
            "You aren't. The people who push you to decide that are only trying to shove you into something they want.\n\nMy advice to you? Make something up to shut people up and have them stop bothering you. If college is in your future, there is a high chance that you will end up graduating with a  degree in a completely different area than you started.",
            "Hey man, \n\nI'm 31 and I'm still asking myself what I wanna be when I grow up.  After some weird job shifts, I landed at a corporate office with a good paying job that doesn't require a college degree but im still in college figuring it out.  I've changed my major probably 6 times now and I'm still unsure on what I want out of the future.  Unless you're pretty positive right out of the gate, I don't think you'll know what you want.\n\n\n  My recommendation is to get your associates degree and something in college will spark your interest. Go from there. If it doesn't, get a bachelor's and hopefully something will spark your interest by then.  If it doesn't, at least you'll have a bachelors and most jobs will hire you.  A lot of companies use automated systems to check resumes and if they don't find key words like bachelor's degree, they'll toss your resume in the trash.   You'll at least get your foot in the door and you can make a decent career choice in your early 20's.",
            "One of the things I strongly remember hearing from an older (60ish) role model of mine:\n\nMe: “How did you decide what you wanted to be when you grow up?”\n\nHim: “What do you mean?”\n\nMe: “Like how did you decide what you wanted to do for a job or where you wanted to live?”\n\nHim: “I’m still not sure I have, maybe ask me in 10 years”\n\nHe is very successful and gets to go on lots of trips for leisure. He didn’t inherit anything and has worked some really cool jobs. The main thing is he has enjoyed doing everything and never decided what he was “going to do when he grew up” he just did what felt right at the time. \n\nBest advice I can give is to find what makes you happy now and work towards it. It doesn’t necessarily have to be a job or anything large like that, just something you can do where you feel fulfilled. Follow that feeling and doors will open for you. It’s scary and still scares me everyday but you can’t possibly know where you’ll be in the years to come so may as well make the trip there enjoyable, can’t hurt right. \n\nIf you wanna talk more about approaching adulthood and “The next big step” or really just anything I’d love to chat with you so feel free to PM me.",
            "Don't do cocaine.",
            "Don’t think you have to know what you’re going to do for life at 16. You don’t have to. Grow, try things, succeed at some, fail at others and learn. It’s cheesy but don’t let the fear of failing keep you from trying. Use this time to find out what you like and don’t like.\n\nGiven your age, I assume you’re stressing about college and picking majors.  I’d recommend experimenting until you find a technical/specialized field you enjoy and excel at. Don’t under-estimate the doors such expertise can open.  A general path makes you one of a huge crowd. Solid knowledge and passion in a valuable technical field can give you a leg up in more career paths than you might think.",
            "You are not, people rarely know what they are supposed to do in life, even adults. So just explore things you find interesting and explore yourself.",
            "I’m 35, i still don’t.",
            "[deleted]",
            "You don't.  \n\nStart with a direction that seems good and head that way -- doesn't mean you'll end up there.  Make mid-course corrections as you go.  You'll learn more about yourself and more about the world as you go.  I decided I wanted to be a physicist when I was in high school.  I went to school, got my degree, even got a job as a physicist.  Turns out, I'm a crappy physicist.  A year or so into sucking at my job, I was given an assignment that I thought I could solve with a computer program.  Bam -- mid course correction -- I'm a computer programmer.  Forty years, later, I'm a retired software architect.\n\nDon't close any doors / hedge your bets.  Maybe you want to be a photographer.  Cool, head that way.  Given the chances of making a living at it, though, maybe get a backup degree -- something that you can stand that can make some money.  Maybe the backup degree is good for funding your life while you get your photography career setup.  Maybe you never use it.  Still, it's good to have choices.\n\nListen to advice.  People that have walked similar roads may know about pitfalls or may have some hints about how to navigate your way.  Seek peoples advice and listen to it.  Incorporate the relevant things they say into your own journey.\n\nBe prepared to make mistakes.  We all do.  It's okay.  It's really about the journey, not the destination.  Some of the best things that happen won't have been in your plan.  \n\nTake advantage of opportunities as they arrive.  They'll take you in weird and wonderful directions.  I've really enjoyed my life but there's no way that I could tell someone how to duplicate that path.  So many little things have happened, so many lucky situations, that I couldn't figure out how to actually steer my ship to get where I am today.\n\nKeep your head about you, do what seems best at the time, adjust to changes as they happen, and you'll be fine.  It really is about the journey.  Enjoy your trip.",
            "As someone freshly on the side of this notion, here is my two cents:\n\n1. Start saving 10% of all income into a Roth IRA or the like. This will give you financial freedom later in life.\n \n2. Life is a journey, not a destination.  Pick a path that interests you and following till you hearts content, then pick another.  \n \n3. Going off the prior notion, ask yourself \"what do I want from life\" not \"what should I do.\"  If you can answer that question then you can work on building a plan to achieve it.  Then pick another goal later",
            "There's a book my father in law had me read at some point, I believe it was called What Color is Your Parachute or something like that and it was about how to answer basically this question as to what type of career would make you the most happy. He is a psychologist and had made his career teaching and selling resources to teachers and schools to help underachieving kids do better in school. The book was very interesting and helpful for me but everyone is different. GL OP!",
            "I mean I'm 23 and I still don't know what I want to do with my life mate so don't feel like you need to have everything figured out but take it from me lean into your interests figure out what things you really like to do what subjects you like to take what things you enjoy doing and lean into them and learn more about them if you can and maybe figure out if there's a possible career in it. I didn't really lean into the things I liked in high school or college and now I'm kinda paying the price. You don't have to have it all figured out but start figuring out the small little things you like to figure out",
            "Honestly, I’d say a lot of people never fully know what they want to do throughout their life, and with so many choices that’s completely fine. \n\nHowever having been in your shoes not “too” many years ago, I’d say the best thing to do is have fun, make memories with your friends and cherish the times when you have little to no responsibilities. That shit changes fast.\n\nStudy hard, play harder. Find something that you enjoy doing and aim for that to be your career. You’ll be 500% happier with a career focusing on something that you are interested in.\n\nMost importantly, when you have a vague idea, make a solid plan and stick with it . At your age I had a lot of college tutors attempt to persuade me in to particular career paths & universities because it fitted the college’s agenda. Don’t let people discourage you from your goals. \n\nTo summarise, don’t stress. You have a long time ahead of you and plenty of time to discover what you do and don’t like in life.",
            "Just focus on cultivating your passions and hobbies for now. Continue building knowledge in school and out. You don’t have to have it all figured out. Small goals and accomplishments can add up over the years.",
            "It doesn't matter what you want anyway. All jobs will be automated soon and then we'll die from climate change.",
            "I turned 35 this week. I'll let you know when I figure it out.",
            "I know I will get the downvotes but here is the truth:\n\nPeople figure out what to do with their life at different ages. The earlier the better. The successful people at 23-25 are usually the ones who figured it out at 16 or earlier.\n\nHow? Well, they are not stupid and useless. They knew what they liked and pursued it. They did not let anyone tell them their dreams are stupid and/or impossible. And surprise, surprise they succeed.  Personally, I always say, \"Lucky me! I did not know it was impossible, so I did it.\".\n\nIf you do not have at least 3-4 things you want to do as a grown up by the time you are 16, well... you might be on the special side of the spectrum. No worries, McDonalds will always hire you. Or at least Amazon. Then after couple of years slaving there, you will start reinventing yourself. Yes, you will be close to 30 and have tens of years of catching up to do, but who is counting, really. Nobody cares at this point. Only you and your family.\n\nHowever, if you have at least 3-4 things that you want to be as an adult, then it is not, \"How to know\", but \"How to choose\". And that is a different topic. Just stop blaming \"the world\" that it is making you choose. Shift your perspective from, \"I am too young to know\", to \"I might be late! Better start now! Back in the day people at 16 used to start families. I still have nothing to my name.\" and then figure out how to become someone.",
            "I think this is the common myth for growing up. You’re not immediately going to know what you want to do immediately after you turn 18.",
            "You never will. The path does not exist. We are all just lost and flow with the stream as best we can ... most of us even spend a good chunk of our lives paddling against the stream, with great suffering to follow.\n\nThe sooner you realize there is no \"right\" or best choice to make, the sooner you can free yourself from the pressure to do what is right.",
            "Idk if you'd read this or not, or if you'd consider it worthy. But not every 16 yr old asks such question, so I felt obligated to answer it.\n\nThing is, you never know what, how and where you're going to land, so even though you like (say) writing apps for your phone, and you have decided you're going to be a coder and make big apps/games, don't ignore that small habit of you catching flies, or drawing, or fishing, or stargazing, or playing chess, or making model towns with legos, doesn't matter how stupid it is, or you think it is, just keep it going.\n\nWhat I want to say is that, even though people say we should put all the focus on what we love, that's (imo) mostly a highly glorified statement. I say, you do what you love, but keep all the options ready. Who knows by the time you're 20, you might completely despise computers for some weird reason, and if you've given up on your rest of the habits/hobbies at 16, now at 20 you've nothing to show for. \n\nSee the world doesn't play by our rules, we make some plan, and by the time it's about to execute, the world turns up side down.\n\nTest it yourself, make a few plans for the weekend, and see how many of them goes exactly as you planned.\n\nThe plans we make for a weekend gets ruined, so how/why do we expect a plan we make for 5/7 yrs from now to go as planned.\n\nDo what you like, ofcourse. Focus all you want. But be smart, always keep your hobbies alive, atleast until you make one of them your primary source of income. Don't listen to those dumbass people saying \"money can't buy you happiness\" and shit. I say fuck em. First you make money and get rich then decide for yourself.\n\nYou've always heard a lot of winner's perspective by now I guess. I've given you a losers perspective. Things I should have done, things I should have avoided. Wish I could say these things to 16 yr old me! \n\nYou're young, have plenty of time, use it wisely. As they say Don't put all eggs in the same busket.\n\nGood luck!",
            "Fuck you\n\n-Society",
            "You’re not. Calm down and just enjoy being a kid.",
            "I wish someone would’ve told me all you have to do is the next thing right in front of you. If you’re assigned ten math problems just do 10 problems. You don’t have to figure it all out. No one ever has. At the end of everything if you’ve taken care of responsibilities you lose nothing other than sacrificed time and effort, but could potentially gain a lot",
            "Don't need to. Just try lots of things to see if you might like it. Don't let fear prevent you because it becomes harder later on with time and money both going some where else.",
            "Don't try to find the perfect thing right away. Just keep trading up until you don't want to anymore. You'll be fine in the meantime.",
            "pick a career in whatever comes easy to you. NOT WHAT YOU LIKE TO DO. then max out schooling in that. now you have money and don't have to work hard. nobody likes their job, buck up and live for your hobbies which take money.",
            "You’re not. Just try everything u think u might like",
            "Not many decisions you make at 16 will determine your whole life in this day and age. Just don't drop out of school and/or become a criminal. Make plans for tomorrow, have a general idea about what you'd like to do for the following years, and should anything change don't worry; no plans were ruined.",
            "Chris Hadfield offers great life advice for this exact problem.\n\nhttps://www.youtube.com/watch?v=ZGD81Ngk2QU\n\nWhen he was young he wanted to be an astronaut, but he was Canadian and there was no way for it to happen. So he focused on learning things that would\n\n1. Help him achieve his dream if it became possible\n2. Work to make his life good if his dream didn't happen\n\nSo he focused on science and math. He kept fit. He said yes to education/job opportunities that were not \"being an astronaut\" if he thought they would give him relevant experience and learning. Eventually he became an astronaut, but if it never happened he was still on a great track to have a happy/productive/stable life.",
            "Whatever you do, DON’T TAKE BIG STUDENT LOANS!",
            "You don't. You work hard in school, graduate, and then get whatever job you can when you graduate. Work at that for however long it takes you to decide what you really want to do, and then use that first job as a resume booster when you set out to getnthe career you really want.",
            "I graduated high school last year and I ended up dropping out of community college a month into the first semester because I realized I had no idea what I was doing and didn’t know what I actually wanted to do. I’m working retail now which is ok I guess, but it’s filling my pockets with money until I figure out what I wanna do. There’s no shame in taking time off after you graduate. Make some money, take care of yourself, take some time for your hobbies or find new ones if you’d like. This is what I wish people told me instead of being pressured into picking something and finding everything out for myself the hard way.",
            "*tosses glitter\n\n\nYou dont!",
            "I turned 16 the day you posted this! I’d also like to know... it’s really stressful not knowing because it seems like there’s such a rush to be productive all the time and always work toward an end goal.",
            "Choose a major which pays decently and you can tolerate it. For example, computer science. After 4 years of college you can find a decent paying job (60,000-70,000$ a year after college minimum). Work there, save money, get an MBA or something. Yes it might be not the most desirable profession for you, but it pays well and that’s what matters.",
            "Some people know.  Some do not.  This is your time to explore."
        ]
    },
    {
        "post_id": "upgi9o",
        "author": "AdventurousDistance1",
        "title": "At what point did Elon Musk switch from being a hero idealized by reddit to a super villain billionaire hated by all?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/upgi9o/at_what_point_did_elon_musk_switch_from_being_a/",
        "score": 26308,
        "num_comments": 5894,
        "created_utc": 1652532312.0,
        "selftext": "I remember a point where reddit was obsessed with how brilliant Elon Musk was and everything he did. Now he seems to be the villain that no one likes. what happened? Was the turning point in 2018, after the rescue of the soccer team suck in the cave in Thailand, where he got mad for not using his robot?",
        "permalink": "/r/NoStupidQuestions/comments/upgi9o/at_what_point_did_elon_musk_switch_from_being_a/",
        "comments": [
            "The pedophile submarine incident comes to mind as one such point.",
            "At first everybody thought that he was like one of us trying to make things better for the world.\n\n\nEventually you realize that out of nothing he is massively Rich gets all the money from the government ,gets all the tax reduction from the government.\n\nSo in the end it's either he's just another millionaire made by someone that doesn't even talk tech on any of his posts or comments or interviews,  but is the leader of all the new technologies.\n\n\nSounds about right",
            "I think opinion has always been split. Depending on where you look, you'll find hero worship and intense hostility.",
            "The \"peado guy\" tweet did it for me",
            "He didn’t just get mad about the diver team not wanting to use his robot sub—he called the lead caver (who eventually orchestrated the rescue of all the kids) a pedophile out of nowhere. That was many people’s first sign (including myself) of the raging narcissist and asshole hiding behind Elon’s cultivated PR.\n\nI was one of the ones who idolized him, what’s not to like: billionaire, sleeps with supermodels, seemingly out to make the world a better place with electric cars, solar energy and colonizing Mars. He always seemed like the smartest guy in the room, the real life Iron Man. He made the plans for EVs open source (rather than keep as private patents) ostensibly to allow the tech to proliferate faster, just seemed an all-around Great Man.\n\nAfter the seeming aberration of the twitter snit in 2018…it was like the Elon facade broke and more and more kept coming to light (a lot of it from Elon himself) that made it seem Elon was not actually a good guy, just a guy with good PR who appeals to a certain segment of people regardless. His anti-union practices at Tesla while claiming he’s for the workers made him a hypocrite (as did claiming to be all about “free speech” but making Tesla workers sign NDAs so they can’t criticize Tesla). Threatening a coup in Bolivia (“We will coup anyone we want. Deal with it.” -Elon Musk) so he could mine lithium there. His petty attacks on people for even small criticisms, standing with Amber Heard in the Depp trial, his weird semi-support for Trump, joining Trump’s economic council and saying he would reinstate Trump to Twitter. Putting microchips in monkey’s brains that killed dozens of them…it started to become clear Musk was less Iron Man and more “Bond Supervillian”.\n\nFor me the breaking point was the pandemic. Musk loudly spreading misinformation (like graphs on how Covid would just disappear in a few months that turned out to be extremely wrong, or that masks don’t work—my wife is a respiratory therapist and masks work just fine) and raging against reasonable measures taken to stem the virus he just lost me. He has revealed himself as someone that thinks they are an expert in things they are not, first revealed in his petty lashing out that the Thai rescue team didn’t see his dumb idea as brilliant, and continuing to when the epidemiologists who do this virus stuff for a living didn’t want to listen to his idiot ideas about the pandemic.\n\nNow seeing him with clearer eyes, he seems exactly like what he is: a guy born on 3rd base from his parents emerald mines, who thinks he hit a triple with his self-made man nonsense, thinks he’s always the smartest when there are very clear examples that he’s not, and generally just the modern definition of a narcissist.\n\nEdit: I incorrectly referred to Thai Cave Rescuer Vernon Unsworth as “decorated Navy Seal”, confusing him with the Seals who were involved with the rescue. Thanks to many who pointed out the inaccuracy.",
            "When people started paying attention to what he did rather than what he said.",
            "I was always skeptical, because I don’t trust people who accumulate wealth the way he has.  But when I found out about his support for the coup in Bolivia so he could get his hands on their lithium deposits for cheap- that was when I knew he wasn’t a good person.  I don’t know why it’s taken this long for everyone else.  Well, most everyone.  One of my coworkers still worships the ground he walks on because he’s a champion of freedom of speech.  Yeah I’m sure having one super rich guy in control of one of the largest social media platforms in the world and deciding what it’s ok to say will be ~great~ for freedom of speech.\n\nEDIT: Several people have pointed out that the 2019 political crisis in Bolivia was not a coup.  The direct quote from Musk in question, however, does call it as such.",
            "When he started manipulating stocks via twitter is personally when I soured on him",
            "Around the time he tried to make a submarine to save kids as a PR stunt, then accused the man who did save them of being a pedophile. Once that happened people started talking about the fact that his wealth comes from his father's stolen emerald mine in South Africa, which enabled him to scam millions with PayPal before buying Tesla and demanding to be named founder of the company. \n\nAfter all that unraveled, people realized he either directly paid or flexed enough billionaire muscle to get The Simpsons to produce an entire episode praising him as the man who'll save the future. Don't forget the hair plugs, that picture started circulating again. He's just a really phony guy who's only personality trait is having money and wanting to be seen as Tony Stark. Oh wait, didn't he pay for a cameo in Iron Man 2 as a contemporary of Tony Stark's?\n\nThis is ignoring his gradual shift to right wing politics simply because it nets him immediate praise from a vocal group rather than take the chance at appealing to progressives, who are more critical of what you say. His attitude started to match that of a 15 year old boy who sees himself as Rick from Rick and Morty, that sort of mindset in a public figure who's total value exceeds most nations is incredibly dangerous. Musk has more money than all of North Korea, and he has his own space program. In his ideal libertarian world nothing would stop him from developing his own nuclear arsenal.\n\nPeople who continue to like him do so either from ignorance of what he really is or because they believe others like him, so he must be valuable. The crypto community only ever liked him because he was a billionaire who could tweet \"doge\" and their funny money suddenly has real world value. Then it became obvious he was manipulating the markets, because crypto is unregulated and therefore completely fair game.\n\nNobody becomes a billionaire off hard work, it takes a significant amount of exploitation of others to accumulate that sort of wealth.",
            "IMO he comes across pretty immature and a try hard and he’s gotten even more attention that last few years. So he has reached more people which means more people annoyed by him. And then you have the people that hate any billionaire.",
            "Even before his weird tantrum over the Thailand situation, reports starting coming out about his anti-union, anti-workers rights attitudes and policies. That, I think, led to a deeper look beyond the “cool” tech stuff he does at who he is as a person. A guy who generally just attaches himself to existing ideas (PayPal, Tesla) and then takes credit for them. A guy whose initial wealth came from his family’s atrocity-filled mining operations. A guy who cares nothing for his employees. A guy who talks a big talk but fails to deliver more often than not.",
            "EDIT: I misquoted a podcast on Musk I heard and that is my bad.\n\nWhat actually happened is Elon left SA to avoid conscription and benefitted from more lax US immigration policy at the time, he then went on to vote for much MUCH more restrictive immigration policy on the EIC, specifically immigration from countries involved in domestic strife or conflict. What I was remembering was that Musk helped place restrictions on the same immigration avenues that he used to get out of SA, not financial programs. This issue is more of a philosophical hypocrisy than an on-paper one and more of an opinionated (in my case) condemnation.\n I'll leave the original comment up for transparency but THE BELOW INFORMATION IS NOT COMPLETELY ACCURATE. \n\n\nA lot of great responses here but one I'm not seeing is Elon enjoyed quite a few benefits when he immigrated to the US from South Africa. I don't know the name of the program but something like grants or financial assistance for immigrants. \n\nAnd then, some years later, while serving on Trump's economic advisory council, he voted to dismantle those same programs either to tow trump's line or for his own reasons. \n\nEither way walking through an open door only to slam it shut behind you is a pretty shit-bad move imo.",
            "For me, it's how he shows his true colors and prioritizes profits over everything. For example, he talks about how Americans are lazy and \"avoid work at all costs\" while Chinese \"burn not only the midnight oil, but the 3 A.M. oil\". Like fuck you, man. I'm not sorry that I respect myself enough to not work my entire life away. Elon is fine with people literally sleeping in the Tesla factory. That's not a workforce homie, that's a fucking prison. He treats his income like it's irrelevant, asking Twitter if he should help solve world hunger or not, which to struggling me, is a slap in the face.\n\n&#x200B;\n\nTL;DR: I feel he's showing his true colors. He is not/was never about helping the world, and kind of got rich while doing it, everything he has done and every business he has started is all about furthering his already ridiculous net worth. When he talks about getting off fossil fuels, it's not because he cares about Climate Change and saving the planet and thereby humanity, no it's because that'll increase Tesla stock. Just my opinion, obviously.\n\n&#x200B;\n\nedit: To further add to this, the recent Twitter deal is another fantastic example. He talks about how it's the 'Modern Public Square', and therefore deserving discussing any and all idea's and how Twitter shouldn't be for profit. Very noble of him. Exceeeppppttt, when getting the funding he needed to try and purchase Twitter, he outlined how he could increase it's profits, and Tesla employee's apparently have NDA's outlining that they're not allowed to discuss the company or disparage them in any way. So it looks like he cares about free speech only when it doesn't affect his bottom line or his companies that he's CEO of. Not very free all of a sudden. And now that Twitter stock has fallen, he **APPEARS** (I want to stress that bc it's very subjective and just my take) that he's looking to back out of the deal.\n\n&#x200B;\n\nedit part 2: Electric Boogaloo: Cool! My very first Reddit award is actually about something I'm passionate about. Weird to think I dislike someone I don't personally know so animatedly. Thanks Reddit!",
            "I would say it really started in earnest when that dude rescued those trapped children before Tesla could deploy its underwater robots, so Musk called him a pedophile for 'stealing' the glory.",
            "[deleted]",
            "I think we just learned more about Musk and his hypocrisy. Like he said he was interested in electric cars for environmental reasons. But then it turned out that he uses his private jet to fly himself from north LA to south LA to avoid traffic. And that’s just… yeah, not so environmental. So I think people just became wise to his bullshit.",
            "I had no idea who he was until he threw that little hissy fit about the cave incident and I've disliked him ever since",
            "It happens with sociopaths over time. At first they seem charming, over time their true nature shows through.\n\nlol Elon’s a punch line, don’t take it too seriously.",
            "I would say that sentiment became more prominent when Tesla's stock went straight through the roof. He went from \"hahaha eccentric rich guy\" to being the richest man on the planet by net worth. I'm sure you can see how some people feel about the extremely wealthy.",
            "He pays people to market his persona, and that works OK for a bit when people haven't been paying attention. But when your persona is actually just a self-important ego monster, the people who start paying attention notice. Then the marketing doesn't work so well because people have taken time to form an opinion.",
            "So Musk essentially is the product of his South African roots, the pseudo-libertarianism of the early tech industry, and the cult of celebrity we have in the US and the west. \n\nI have worked with and known South Africans for years. I am also from Alabama which has a lot in common with South Africa. There is in both societies a literal bunker mentality that views the “other” as a constant threat. It has lessened in Alabama since segregation in the 1960s, but it still informs much of the culture. It is a “round up the wagons and arm yourself” kind of approach to life. It also has an element of “fuck all y’all” no shame allowed mentality. \n\nAlso, the earliest hacker and programmers were almost universally into the libertarian philosophy that merit made them who they are, ignoring that the Internet was a government sponsored invention and that you had to be fairly privileged to have access to a computer in the 1980s and early 1990s. I know this because I am a programmer of 25 years. He probably views his success as something he earned without anyone else’s help or input. I think his focus on Mars habitation has a bit of the libertarian utopia dream the “Bioshock” game. That mentality (in my observation) tends to promote a bit of an assholery that can’t be hidden for long. \n\nFinally, both Musk and Trump love seeing their name in the news and having followers, etc. They will literally say or do anything to keep themselves in the public discussion. It is a sad type of addiction. \n\nThat being said, I agree with him that we need to develop towards space industries and we need electric vehicles. A lot of what he (and others) are doing to stoke their own egos will eventually help humanity as a whole. If we don’t get off this planet for resources and to develop technology that lets us live with barebones resources that get reused, humanity will disappear. \n\nIf we get there due to a billionaire compensating for something, I am ok with that.",
            "Look, you can think that Musk and Bezos are geniuses. But they also feel that it is their right to do what they want on the backs of workers and it is acceptable for me to hate them for it.\n\nBoth were able to create something that changed the world.   Made them the richest people in the world. I have to admire that.   I can also hate them because they believe they are so important that workers should have been making Teslas during a pandemic, with little to no protections for their workers, and if they were worried about their health they can just find another job (lose everything as most people working there are living paycheck to paycheck.)\n\nOr it is rumored but is certainly an example that Bezos was upset that he couldn't put cameras in delivery trucks to make sure they were working as hard as possible.   Talk to an Amazon delivery driver, they already feel incredible pressure to do what they are expected to do.  But let's push them harder for $18 an hour.   Workers on the warehouse floor are pushed so hard they just won't be able to do that work when they are in their 50s.   Then what?",
            "He's excruciatingly inarticulate, knows 2 jokes (both of which are numbers) takes credit for other people's inventions, he's bad at meming, has horrible ideas (have you seen what his [hyperloop](https://youtu.be/QZaRfNjTPx8) has become?) he's hostile to workers and their rights, he gets billions in government subsidies while opposing the stimulus package to help regular folk, he's rolled out a beta testing programs on actual roads with living humans causing accidents, he seems to actively enjoy authoritarianism and oppose democracy, eg the \"We will coup who we want\" tweet in response the U.S. government organising a coup against Evo Morales in Bolivia so he could obtain lithium, his disregard for worker's health during Covid, calling a guy who was trying to rescue kids in a cave a \"pedo\" when he said Elon's submarine thing was useless, his absurd ideas about colonising Mars, his shit personality as showcased on the cringe Saturday Night Live episode, his ties to Ghislaine Maxwell, his resistance to dealing with racism in his factories, telling his first wife Justine, “I am the alpha in this relationship.” as they had their first dance, promising to donate $6b to end world hunger and never doing it,\n\nAnd his stupid ugly pudgy fucking face.",
            "He was always like that, it just took a while for the rest of the world to catch up to his actual persona. I remember seeing his interview in the 2000s, he proudly announced he fired his wife, and wondered who the hell he thought of himself. This was right after he sold his x.com and he was  showing off his new Mclaren",
            "That tool wishes he were a supervillain.",
            "When he joined Trump's \"Economic Advisory Council\" public opinion started to turn against him",
            "I feel the view on him has always been split. People still love him now - but a lot people will always dislike the ultra rich",
            "All that’s changed is he’s gained more media presence over the past few years, thus making more people aware of him and making the negative opinions appear louder.",
            "[deleted]",
            "For the longest time, i thought he was genuinely just a smart guy who got lucky. Then I did some research and I grew to hate him.",
            "I think the biggest reason why I hate him is because he's a faux intellectual. He only sounds smart when he's talking about things that you aren't familiar with. After I heard about his Hyperloop idea, I immediately knew he was another rich prick who just wants to create more revenue in any way possible.\n\nEdit: and this isn't to say he's an imbecile, but rather that science is not his motivation, profit is.",
            "Yeah, for me anyway it was the paying $52k to try and smear the diver who rescued the Thai kids as a child rapist because of his hurt feelings:\n\nhttps://amp.theguardian.com/technology/2019/oct/08/elon-musk-diver-vernon-unsworth-pedo-idiot",
            "He didnt, this is only true for reddit. In reality most people have different opinions or are indifferent.",
            "I used to like him because, on the surface, he was championing businesses I approved of, like electric cars and solar energy.\n\nBut you don't have to dig far too see what a garbage person he is, and my opinion of him has flipped.",
            "The turning point (at least for me) was once he got into and started supporting crypto. \n\nI’m not a fan of crypto myself, but when one person’s tweets can decide if someone makes or looses millions I’m not gonna like them very much, especially when they use that power to mess with people.",
            "When working conditions became intolerable at his plant and he did nothing.  Once he turned his back on his workers and the people it was a WWE heel turn.\nNow he is a villain.",
            "That's the cool thing, he's always been a villain, it just takes time to educate the simps who are fooled.\n\nAs of late he's made a lot of very arrogant moves. Blatant market manipulation as well as claiming to be \"a centrist\" and then gurgling the balls of the right by posting nonstop propaganda against the left.\n\nElon has never been a good person. The people that worked with him on PayPal HATED. HATED. Him. Instead of helping people he makes underground tunnels and flamethrowers. And he idolizes the hustle culture, fawning over people \"that work 16 hours a day.\" Shocking that a billionaire wants to brainwash people into working longer than they're paid for, right?",
            "I sort of always distrusted him, he acted like this up by the bootstraps kind of guy when in reality his family bankrolled him with their personal wealth derived from some sketchy South African sources. Then there was that Peter Thiel connection. I knew people who worked directly for him and he was that Steve Jobs \"I'm rich so I must be brilliant \" kind of boss. But the final nail was when he started trolling Bernie Sanders and Elizabeth Warren just because they mentioned they thought it might be a good idea for him to pay taxes.",
            "Once he became enough of a celebrity that his army of astroturfers couldn't control the discourse anymore.",
            "Once the mouth breathers learned he's a union buster, from a family that is rich from a mine guilty of human rights violations, who stole money from people (paypal), who didn't found tesla just bought it.",
            "There was a switch? He is a dumbfuck rich kid that got a platform and fucks people over. He was never a hero and hopefully he'll die soon as the villain he is.",
            "He was never my hero! Fuck that asshole!",
            "When he started being an asshole",
            "Remember when those kids got stuck in the cave flood and Elon made it all about himself as a PR stunt? That was the moment.",
            "I don’t hate him. He’s awesome!!",
            "For me it was the Thailand calling the real hero a pedophile thing. That seems like enough",
            "[deleted]",
            "An idiot without any power is funny. An idiot trying to use money to reshape society is a menace.",
            "He’s always been a villain. He’s just traditionally had better press.",
            "I've always hated him. I don't know how this helps",
            "People grow and opinions change over time. At some point you grow out of the blind hero-worship phase and start to seriously question things. That’s where things start to get complicated.",
            "He didn't. The bubble you're in shifted.",
            "IMHO I believe he earned the weight behind his words, but then he started misusing it and it feels like he’s becoming very… “I’m always right just because I’m Elon musk” type of person, which you know when you have science backing you up and it’s mostly objective stuff he is usually right. But lately he’s been getting a lot into subjectives and he claims his opinion is right because he’s Elon musk… that doestn work with subjective topics",
            "For me, it was the pedo tweet. That was the start of it. That was not the behavior of a wise man. It was the behavior of a child.\n\nIt's all gone downhill since then. The taking Tesla private tweet, his inability to own up to his mistakes, his blatant disregard for the working class... I lost all respect for the man. I'm astounded that so many people still believe in him.\n\nHe's going to make a big mistake eventually. Maybe people will learn, maybe not. We'll see.",
            "It's not about Elon at all. It's about the liberal agenda that is celebrated here on Reddit. The minute he or anyone else does anything that's not part of that agenda. That person will be villainized. Especially here on Reddit. It's pretty much a law.",
            "What the thread taught me is that people just hate because they want to hate. Nothing is crazy enough to warrant hate he gets.",
            "I never thought he was a hero or a villain, just some rich autistic dude who uses Twitter too much"
        ]
    },
    {
        "post_id": "ju7j2c",
        "author": "ebolalol",
        "title": "Is it just me or does fast food seem more expensive nowadays?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ju7j2c/is_it_just_me_or_does_fast_food_seem_more/",
        "score": 26166,
        "num_comments": 3539,
        "created_utc": 1605381667.0,
        "selftext": "I feel like I used to spend $5 on McDonald’s or Burger King or Wendy’s and be ok. The other day I spent like $15 just for myself on a meal I’d normally get that I dont feel was this expensive. Then I spent like $30 at Burger King for me and my SO. \n\nI know with inflation prices go up... but it was just a sticker shock. I just thought fast food was supposed to be cheap.\n\nEdit: For those who keep commenting that it's inflation, my original post mentions that I know what inflation is. It just feels ridiculously expensive for what it supposed to be a quick cheap junk meal. Especially  when a sit down restaurant is about the same price.\n\nEdit2: for all y’all commenting about the dollar menu — where the hell do you live that still HAS a dollar menu?!!!",
        "permalink": "/r/NoStupidQuestions/comments/ju7j2c/is_it_just_me_or_does_fast_food_seem_more/",
        "comments": [
            "It’s equivalent or cheaper in my area to get take out from a diner or something similar. Especially since portions in fast food places have become smaller",
            "When my Denny's check is only a few dollars more than my McDonald's check something's wrong",
            "Seriously. I went to McDonald's for breakfast for the first time in a while a couple weeks ago. I couldn't believe that a hashbrown was something like $2.39. I thought they were like $1.",
            "Eating out is so damned expensive that I rarely do it anymore",
            "Yes, prices have definitely gone up. I remember cheeseburgers being $.59",
            "Honestly everything seems expensive nowadays to me.",
            "It's gotten more expensive. I always use the app when ordering from places like McDonald's, Chick-fil-A or Wendy's now. You can usually get at least one free item.\n\nMcDonald's has free fry Fridays, and I'll regularly get a drink, a cheeseburger and a free order of fries for under $3.",
            "Early 90's my dad would take us to McDonald's; family of 5 would get regular meals off their menu.  I remember my Dad complaining bill being 18 dollars and change.. It cost my family of 5:  $50-58 for a regular meal each w/o dessert. \n\n\nSpeaking of McDonald in the 90's I tried to explain to my kids McDonald's use to have a pancake buffet, you could eat as much pancakes as you wanted for like $3\n\n\nIt costs us $ 20-27 to make the same meal  ourselves",
            "Holy shit. This. Every plate at every restaurant is $15 bucks now.",
            "A combo at mcd is basically 8/9$. I can get real food at chipotle (sans drink) for the same price so why wouldn’t I? Fats food has gotten bullshittingly expensive",
            "A few years back a family member was in the hospital and we didn’t really have the time or money to cook ourselves, and I remember Taco Bell being way cheaper than it is now, I would always get a couple of burritos and a soda for like $5, now my same ordere costs me 11",
            "Does anyone else remember the $.59 - $.79 - $.99 Taco Bell jingle? There were like 25 things to pick from on that list, the most being $1.07 with tax.",
            "Yeah, if you order a combo off of the menu, you will get wrecked. BUT, if you download that fast food chain's app (almost all of them have one nowadays), and stick to their deals and value menus, you can really cheap food. Burger King is actually one of the cheapest options due to this imo.\n\nEdit: A lot of people pointing out that the companies are selling my data. Personally, I don't care, but fair warning to all that do.",
            "Absolutely. As an example, it was only a few years ago (less than 10) that you could order hash browns on their breakfast menu and get 2 for $.99. \nNow, they’re $.99 each.",
            "> I know with inflation prices go up... \n\nYeah prices go up, but our salaries haven't.",
            "I remember when a large Big n Tasty from McDonalds was 2.99\n\nThem were the days. :(",
            "The burgers have gotten smaller too",
            "It absolutely is. You used to be able to get a mcchicken or burger for a buck. Now that would be nearly $3.",
            "In my country paying 5euros is the bare minimun for a meal, specially for fast food. I usually spend that up to 7euros, and i get a bunch of items. The other day i ordered a veggie menu and a milkshake and was so dumbfound when it got to almost 10euros, which with that i could also eat a nice meal in a restaurant, and i was getting a 4 tiny items. On pizza hut they also got their prices higher what you usually would pay 7euros tops for 3 tiny slices, drink and desert, now you pay that for a smaller menu, not worth it.\nLike i said, the menus are already small, even the burgers are small, and they are starting to cost the same as if you would go to the restaurant, sure its fast food but...you though it would meant cheaper.",
            "Prices have shot up since the recession, I've noticed. After that, a fast food meal was always $8 everywhere you went (here in CA). Then suddenly 2 years ago, that same meal was $10-12.\n\nYou are right, OP. Throughout the 90's, a fast food meal was $5.",
            "Yes. The problem is that we don't get paid more to match these inflated prices.",
            "A decade or so ago, I know for a fact a McDonalds double cheeseburger was $1.00. A few years later, it went up to $1.25. Nowadays, its $1.50. So yeah, prices have definitely gone up.\n\nAnd it *is* still cheap, relatively speaking. It depends on what you get. My go-to meal is a Double cheeseburger with extra cheese, a small fry, and a large coke. They have a 2 for $3 thing that makes the burger and fries $3 total even though the fries are normally something over $2. They have a thing where any size soda is only $1. The extra cheese is an extra 50 cents, but even after tax its still under $5 for a burger, fries, and large drink. If Im  *really* hungry, an additional burger is only $1.50 more plus 50 cents for extra cheesse, so thats still less than $7 for a pretty big meal.\n\nOn the other hand, if you order the chicken nuggets or any of the specialty burgers, those are more expensive for the same amount of food. So yeah, depends what you order.\n\n\nEDIT: Because I keep getting comments telling me that I got the price of a Double Cheeseburger wrong, or that the price I listed is for the McDouble, not the Double Cheeseburger, I will politely remind everyone that prices can vary based on location. If you say that a Double Cheeseburger costs $x where you are or that $1.50 in your area only gets a McDouble, I believe you. But that doesnt mean that I was wrong about what burgers cost where ***I*** am. Please try to remember that your personal experience is not the *only* experience, and just because you have experienced X, does not mean that someone else is wrong when they say they have experienced Y.",
            "It's great, now it's cheaper to eat at home then at fast food. Better excuse to eat better",
            "Econ nerd here! It’s not inflation. America is actually experiencing deflation rn. \nThe fed is making that money machine go BURRRRRR\nSeriously though, it definitely not inflation. What you are experiencing is corporate greed.",
            "I feel like it's kind of specific to fast food. At this point you can eat at a nice cafe for about the same price as a fast food drive-through.",
            "Carl's Jr./Hardee's used to have the $6 Burger maybe 10 years ago. It was a ~$3 burger that was supposed to be like the $6 burger you got at a sit down restaurant  (it wasn't). They have a bunch of burgers now that are ~$6.\n\nIronically, since casual restaurants are so challenged these days, they often have burger features that are about the same price as fast food.",
            "Two people can get dine & get full at Taco Bell for less than $7.",
            "[removed]",
            "[deleted]",
            "Inflation, prices go up, wages dont (in the US atleast)",
            "Agreed from the UK.\nI can get a takeout restraint meal for £15, but a McDonald's will set me back £12 for anywhere near the same amount of food.\n\nSame for independent takeaways as well. Looking at £10 for a pizza and chips, pizza in a restaurant is £12. Only one that never seems to increase is Fish ans Chips!",
            "I remember when Taco Bell had the 7 layer burrito for $1.49 now it’s $3.49\n\nMcchicken used to be $1 now it’s $2.19\n\nThe only thing I noticed is they kept drinks cheap Taco Bell during happy hour and Mcdonalds all day\n\nDownload the app, they give free stuff and rewards plus the coupons help a lot. \n\nBurger King has good deals usually 2 chicken sandwiches 2 small fries for $4.99 or the same thing with whopper jrs and 2 small drinks.",
            "In-n-Out is still really cheap. I get 2 double doubles and fries for $10, a regular hamburger is just shy over $2, and the quality is still really good",
            "That's why subway $5 footlongs was making them go broke. Everybody I know went there to avoid going broke at five guys.",
            "100% it is going up faster than inflation. \n\nIt went from ‘a lesser, but still cheap and quick alternative’ to ‘lol everyone is addicted to this garbage, we can charge whatever we want’.",
            "The rate that wages go up tends not to match inflation.",
            "The McDonalds hashbrowns have gone from like $0.99 to literally between $2-$3 now :( it costs me like $6ish for two hashbrowns like bro wtf so sad",
            "I've watched prices raise at my McDonald's, multiple times a year, while I only have gotten a 10 cent raise every three years.",
            "You are totally right. I spent $15 for a value meal at McDonalds last week. Shrinkflation. Our economy is a joke. Making $100,000 per year today is like making $35,000 per year 20 or 30 years ago. Buying power has decreased substantially and portion sizes have decreased at the same time. Our money is devalued and commodities are more expensive now. We're in a prolonged downturn that slowly creeps up on us.",
            "Part of the issue is that inflation doesn’t fail to happen however wages fail to increase as consistently. So although I’m sure most of you earn more now than you did when “fast food was cheap”, the fact that it seems over inflated means wages haven’t been inflated proportionally (probably). But the again what do I know :p",
            "Until I tried fast food, I thought it was very cheap, slightly unhealthy and not very tasty. Now I realized that it's not cheap at all, very unhealthy, but damn tasty.",
            "This is a product of what I like to call the profit imperative, evry single corporation on earth *must* make compounding profits year on year, so if maccas made a hundred dollars in profit this year they're expected to make at least a hundred and one dollars next year then one hundred and two etc etc.\n\nWhere this falls down though is exponential growth can not be sustained (basic thermodynamics) so they have to cut corners with ingrediants or serving size or price (but never board salaries mind.) This is why everything produced by a corporation now days is so incredibly terrible, it costs the earth but no longer contains barely any nutritional value or will break in short order etc.",
            "There's a bit of truth to what you're saying, because fast food has changed somewhat. If you look at the size of the menu at most fast food places, it's insanely huge compared to the original McDonalds menu, for example. That means more stuff to keep in stock in general, more complex logistics, etc. Originally, McDonalds kept their menu super, super slim because it was a cost-cutting measure. Now the strategy is, attract more customers to make more money instead of keep cost to the absolute lowest possible level. There's also more of a push for higher quality in fast food, for example the push to fresh beef from Wendy's and McDonalds. There are some costs associated with that.\n\nBut beyond that, there's the fact that for a lot of jobs, wages aren't keeping up with inflation. So you might work a job where the buying power of your wages has been eroded over the years.\n\nSo it's probably not actually any one thing, but the combination of a number of factors.",
            "I really don’t understand how most fast food restaurants even stay in business. I like to cook at home, and I realize part of fast food is the convenience, but the food ain’t even good y’all. And then you’re gonna overpay for it too? Like, support your local business if you’re going to get carry out. Shit you could even do better at a Chipotle. But like, $10 at BK or McD’s or Taco Bell is going to get you a greasy sack of shit that barely qualifies as food. And it ain’t even good! I just don’t understand it.",
            "Yep, what used to be on the dollar menu is now 1.29 where I am",
            "Yeah it's absolutely ridiculous, people in food deserts have to spend the same amount of money on bad food with no nutrition as other people in better areas would spend on a delicious and healthy local meal",
            "Burger King (in Canada anyway) used to have a Whopper combo for $5 or 2 Whoppers for $5 on Wednesdays. Now it's a Whopper Combo for $9 or 2 Whoppers for $12",
            "I recommend using apps for deals. Especially Burger King pretty much always has some good deals. Wendy’s will usually have one good deal that renews every week, right now it’s a free classic chicken sandwich with any purchase.",
            "Download the apps on your phone.  McDonald’s, Burger King, Wendy’s etc.   The key is setting up mobile pay, some require it to get the deal.  They are discounting to get you to buy into the new technology they’ve invested in. It may not always be combo meals, but you can definitely get food on the cheap.  Burger King especially has the best deals, I’ve been getting the double whopper for 3 bucks for like a year.  McDonald’s has large fries for a buck once a day, etc",
            "It would be cheap if income raised as prices did over time.",
            "Taco Bell’s dollar menu is decent but they are took a lot of items away",
            "I was only okay with McDonald's when it was dirt cheap. Now that it's significantly more expensive, I haven't been there in over five years because there are better quality options for their new price point. I used to get double cheeseburgers for $1.00 and they were gross but addicting.",
            "Fast food is not supposed to be cheap. It's supposed to be *profitable*. And sure, inflation is a thing, but places will up their prices so they can make more money. Don't gaslight yourself, prices are going up. Used to be there were plenty of good choices on the dollar menu. Now they're \"Value menus\" with higher prices.\n\nSo yes, prices are more expensive. You're right on the money.",
            "Once the dollar menu from these places were taken away, that’s when you knew it was all over. Now at McDonalds it’s “buy one get one for a dollar” but a mcchicken is like $3.",
            "YES. My husband and I got taco bell and it was like $25 I was like \"damn, I could get a legit mexican restaurant's meal for cheaper than that.\"",
            "It is, it's a sign of the worsening economy.",
            "It’s not just the inflation. You are correct, OP, it SHOULD be a cheap and quick meal. The quality of the food agrees with that statement. The issue here is that with inflation, wages have stayed just the fucking same, as always. So yeah, now it’s expensive as fuck and the sticker price is higher.",
            "Wage stagnation + inflation x Time = even the cheap shit isn't affordable anymore.",
            "It's inflation, but you are still getting paid the same. The concept of equity is so foreign to the rich that we might as well classify them as a separate species before hunting them into extinction.",
            "I’m old(er) but I remember my hs job at McDonald’s - a Big Mac meal used to be 3.30$. Now it’s easily in the 7$ range. Part of it is inflation, and part of it is what the market will bear. Chipotle, noodles, panda, and Panera normalized the idea of a “fast casual” meal that you paid more for, and Americans were happy to pay it (I mean, I know I was. Huge difference in quality for not much more money.) Fast food chains have “rebranded” (or are trying to) so they also can be in this higher price bracket. But the 7$ chipotle burrito makes me feel full, whereas the McDonald’s meal makes me nauseous.",
            "Over the past decade, I noticed in Florida every time anyone in office breathed the words \"mininum wage increase\" fast food prices went up about 30 to 40 cents on the average price of a value meal.\n\nIt seems like fast food restaurants want everyone to believe that their cost of labor has skyrocketed, when they would have easily been offset by a very marginal increase of a few cents.\n\nYes, inflation has contributed but I also see it as them trying to squeeze their customers for every dime they are worth.\n\nWell jokes on them. Almost everyone I know has started ordering pickup from restaurants because the prices are about the same and the quality is higher.\n\nIf I'm going to pay 40 for four people to eat out, it's not going to be for a tasteless quarter pounder.\n\nThey have ramped their prices up so high that if they try to match the new increases that will take place through 2026 then it's just going to drive them out of business.\n\nI have no doubt that they'll try, but who is going to pay 60 for 4 \"value\" meals?\n\nEdit: a word",
            "Not only are fast food places super expensive, have you seen the prices for Food Truck meals nowadays?? They are SUPER ridiculous. When I was younger, food trucks served quick meals that were supposed to be “small”, cheap, and maybe not exactly made in the *cleanest* of conditions... \n\nBut nowadays, Food trucks have become “fancy” by serving entire meals and marking up their prices by a lot. For example; the last time I got a burrito from a food truck cost me $14... for one single regular burrito!! $14!!!!! That shit used to cost me like $6-8 MAX. Now it’s double and they give you a drink for like $3 extra. Fucking rip off. And the taste isn’t as good as regular restaurants either. \n\nI just feel like the food truck thing used to be something that wasn’t seen in a positive light while growing up. Now, it’s considered a great option for quick “gourmet” meals that you can get quickly during lunch.",
            "More expensive, lower quality. Kinda sucks. I'd pay the current higher prices if things tasted like they did pre-2005.",
            "for me it's not the price, it's the size.\ni used to satisfy my hunger with a bigmac or whopper menu, now i could eat 2 because it feels like they are minatures. \n\ni get all the healthy eating bullshit, but that is not why i go to fast food places, if i wanted healthy i would cook myself. I'm going there because it's convenient and used to do the job.\n\napart from kfc this place is just to expensive to even consider where i live",
            "I keep thinking fast food is cheap. Except last week I needed hot sauce ASAP, so I hit up Amazon Fresh for same day delivery. \n\nThe hot sauce was $1.50 but I needed $35 for free shipping. I figured, fuck it, let’s get some turkey... ended up ordering $33.50 worth of ground turkey, turkey hotdog and turkey bacon.\n\nLong pointless story short, when it arrived I realized I had enough food for more than a week, and it was cheaper than fast food.",
            "Yes and No.\n\n&#x200B;\n\nThe world is experiencing a huge devaluation of money at the moment, for SO many reasons.\n\n&#x200B;\n\nIronically, most of the raw ingredients that it requires has gotten much cheaper, and the machines much more efficient.\n\n&#x200B;\n\nThe costliest thing is the fast food restaurant itself. Owners of a shop pay a pretty big percentage of TURN OVER (not profit, very important) to the Franchiser for among other things branding, marketing, menu design, etc. Then they are forced to buy new decor regularly (A solo shop isn't going to cunt out $10k on a new awning ever year, where franchises are forced into similar situations often or else). \n\nWages have gone up lately, with the entire Cost To Company being increased drastically. Insurance has gone up during this time. Foot traffic is way down. \n\n&#x200B;\n\nAnd, most importantly, and you really really really should remember this.... There stock prices do no fall. The profit does not fall. The amount that goes to the big ups is never allowed to go down, or they shut down the location and put in a different owner. So franchise owners are fucked, and in turn fuck their customers because they CAN, because the world (1st world, for the most part) has Incorporated fast food into their daily routines, and will buy it irregardless of price, even if it only became popular due to speed and price.",
            "Can we talk about Taco Bell? I mean any combo u get is almost 10$. You want a chulupa? 4$ small, no meat. Quesadilla? 4$ small, no meat and half of it just bread with no chicken or cheese. If you order what you really want to fill you up, you spend 15 to 20$ easy.",
            "I used to work at a subway. Don’t eat there. It’s gross."
        ]
    },
    {
        "post_id": "en7d5a",
        "author": "Chicken_Sizzler",
        "title": "Do you think children would be less scared of dentists if every kids show wouldn’t have the obligatory ”I’m afraid of the dentist” episode?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/en7d5a/do_you_think_children_would_be_less_scared_of/",
        "score": 26151,
        "num_comments": 1080,
        "created_utc": 1578749065.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/en7d5a/do_you_think_children_would_be_less_scared_of/",
        "comments": [
            "Kids would be less afraid of the dentist if parents took them to dedicated pediatric dentists early to avoid major problems.  Too often parent wait too long and then the first visit is fillings and painful cleanings.  Taking them often helps with the fear and makes the visits less painful.  Also, just a side note.  Not saying “god I hate the dentist” in front of your kids helps to.  When both parents regularly go and don’t show fear in going it helps the whole process.  I’d like to add that sometimes kids are just gonna be scared.  But these things help a lot.",
            "My childhood dentist would cover my mouth and nose w his hand and say\"I'll let you breath when you stop crying/screaming\".  Hubby had the same dentist, he didn't suffocate him but did pull the wrong teeth.",
            "I don't think so. Sitting in a chair without any control over what's being done to you by a guy with noisy and sharp, scary looking tools is pretty bad on it's own.",
            "I watched those episodes as a kid and I have never been afraid of the dentist. This is despite being an incredibly anxious kid (and adult) who was scared of lots of other things. Unfortunately I don’t think you can control or predict what will make kids scared that easily.",
            "Transmission of fear (I doubt that's the actual term) is a real thing, parents for example can give their fear to their children without the children ever being in that situation.",
            "In my experience it's a learned behavior, from interactions with the dentist. My youngest had to have thickened liquids for years when younger, which are known to pool and puddle on teeth and cause decay. You can't simply rinse the mouth and they cannot have thin liquids in their mouth because they aspirate them.\n\nHis slightly older big brother has had normal wear and tear on teeth.\n\nMy youngest hates the dentist, he's got six caps because of the decay from the thickeners. He won't even admit his teeth hurt ever for fear of having to go back to the dentist. \n\nSlightly older isn't afraid and always has good exams, did have one cavity that was taken care of without anesthetic as it was shallow. \n\nIf the dentist never hurts you its easy to laugh off those jokes on tv. If you've been hurt its easy to identify with them and feel validated.",
            "Those episodes are literally made to help kids get over said fear. That's *why* they exist.",
            "No, dentists are like the perfect storm of physical pain, emotional pain (guilt and shame), loud high pitched noises, intrusions on your personal space, and in some cases can be real expensive.",
            "Nope. I'm 16 and afraid of the dentist due to you being helpless while someone meddles in your mouth with sharp needles and tools while forcing teeth out",
            "What your asking about are the psychology concepts of modeling and priming.\n\nModeling is easy to understand, if one sees a person or character behave a certain way they are likely to repeat the behavior they've seen. \n\nPriming is learning to relate this to that. I'm primed to relate McDonalds, my fridge, and a noon call from my friend who always asks to go for lunch with eating. The show primes children that dentists are to be feared.\n\n\nTo be more effective the chrqcater should start with a positive experience,  they love going to the dentist. They are to be trusted. They encounter a character who knows nothing of a dentist, what do they do? Explain their work, again in a positive  tone and they have the conflict come from an outside source.\n\nThe Corns, Canes and Beet sugar company plans to sell sugar that looks like vegetables to addict kids to low nutrient foods! No! The dentist explains how sugar promoter the growth of bacteria who excrete waste into your mouth! Yuck! Together the heroes and dentist stop this plan.\n\n\nA much better way to teach kids about dentists, probably not a great episode.",
            "I was strapped to a wall, verbally and physically abused by a dentist as a child. I too this day won't let anyone near my mouth.",
            "In my experience, no. I had a lot of overcrowding as a kind and ended up having several teeth pulled over a few visits. My fear stemed from that repeated experience and had nothing to do with tv or other media. I would guess lots of other kids have physically painful (or at least physically uncomfortable) experiences which add to the general unease and lack of control mentioned in other comments.",
            "I don't think it's because of the episodes, I feared the dentist only in the waiting room when I heard the noises. But I think parents should paint a better picture about them and instead of making kids fear them they should explain that they are helping you and will make things better. That's what my parents did and it helped me.",
            "Yes. I'm not sure it would be a huge difference, but it would probably help. Similarly, I don't think so many people would be bad at math if it weren't so common in media to treat math class as hell.",
            "I'm terrified of any dental work. Periodt. \n\nI was fine when I was younger bc stickers and prizes. In high school, I went through two different surgeries to fix things in my mouth that I was awake for (obviously local anasthetic) and I spent 6 years in braces, expanders, and temporary bridges before implants. I have extremely sensitive teeth and I started grinding in my sleep in college so they always hurt and almost always bleed (despite brushing & flossing). The last couple of years I go every six months and have been using sensitive toothpaste and a night guard, but I still have to take an anti anxiety before going. And typically the stress of an appointment makes me exhausted the rest of the day.",
            "I don't think so! That type of episodes came into picture after having the incidents and cases of children being scared of them!  The real incidents influenced that type of episodes and not vice versa.",
            "Yes, and we wouldn’t keep having to have uncomfortable “is Santa real” conversations if every holiday program didn’t bring it up at least once.",
            "I used to work in pediatric dentistry and in my experience, the majority seems to come from parents transferring their own fear to their children. Those kids usually did fine once we removed the parent from sight and mind. \n\nThen there's the kids who have had a bad experience before (either medical or dental). There was a shitty clinic in our area that referred patients to us who they had already traumatized. We called those kids \"victims of [clinic name]\". They'll probably have dental phobias for life. So it comes from a variety of sources, but I would say that while TV likely plays a role, I'd estimate it's a fairly small one.",
            "My dentist was pulling a tooth and it slipped and he dropped it in my throat. I started gagging and coughed it back up and it hit him in the face. He then yelled at me for spitting a tooth at him :/\nI was like 8 or 9.",
            "I honestly don’t think television influence has anything to do with it. I think it has to do more with the fact that a dental exam to a child could perceivably come across as an alien abduction/experimentation type of experience.",
            "And if parents didn't extol all the horrors of dentistry for them to hear.  I'm a dental professional, and this is the #1 issue I see.\nYou be cool, your kids will be cool.",
            "Teach kids to care for their teeth, so going to the dentist is not associated with \"pain\". My kids never get scared going to the dentist, even after they got their teeth pulled out a few times.",
            "Cartoons never put fear of them. I dont mind going to the dentist now but I used to hate the feeling of the vibration on the drill on my teeth.",
            "I watched those things I was never scared of the dentist, I assumed they knew what they were doing",
            "My wife starter prepping our firstborn like a month before going to the dentist. \nJust by calmly explaining what was going to happen over and over. And we had a kids book about a dragon (swedish kids show on tv) going to the dentist as well. He was super cool and almost excited to go. I strongly believe it's all because she prepared him. Like if we whould have just told him now we are going to the dentist, or tomorrow we are going to the dentist without giving him alot of time to prepare he whould have been scared and not have a good experience. \nIn Sweden all kids go when they are 1 year old and then again when they are 3. The prepping started before the second time.",
            "This is why rugrats needs a comeback! It taught kids to not be afraid of this kind of stuff, also including getting shots. Definitely had some of the best morals in hindsight",
            "I personally think kids would be less scared of the dentist if they flossed regularly. Maybe a kids tv show could show that.",
            "I always looked forward to the dentist as a kid, my mum would always make it positive in some way. If the dentist said my teeth were healthy and I was taking good care of them she would take us to this little bakery and cafe next door and treat us to whatever we wanted. In the event of a filling or tooth removal I would be rewarded with a day off school where I was allowed to watch tv and play PlayStation.(I wasn't allowed to do this on a usual sick day).",
            "I wasn't until I had a shitty dentist who said to tell him if it hurt. I did and he ignored me. A very detailed memory, it was in a low income neighborhood I grew up in. After three attempts of getting his attention, when he turned for the next tool he needed I noped up and walked out. Following my mother took me to a specialist. (I smahsed my mouth into the side of a 4ft swimming pool when playing football in a backyard, destroying my top 4 center teeth and chipping the bottom 2.) She was so much different, using numbing creams prior to novocaine to ease the injection discomfort and explained each process before starting the procedures. Much different experience.\n\nEdit - I was age 11",
            "no...\n\ntheyd end up being even more scared as theyre not mentally prepared and it shocks them",
            "Seinfeld?",
            "I can't relate. My mom worked in a dentists office and I loved being there. I'd spend my summer making charts and when I was at the age of losing teeth I wanted the dentist to pull them instead of wiggling them out on my own. I voluntarily had at least 6 teeth pulled that I can recall.",
            "Im scared if the dentists bc i had very bad experiences as a child with a bad kid dentist. They were very mean, and also gave me my little sisters fillings(she had more cavities than me and they just thought since i was older, that it was mine) every dentist ive been after that has been hit or miss, but im scared every time",
            "All of these episodes are based around the dentist being nothing to be afraid of",
            "My dentist had an N64 in the lobby, so I always looked forward to the dentist",
            "I have had somewhere around 15-20 cavities in my life. I got head gear in 5th grade for an overbite. I got braces in 7th grade. I went to a periodontist twice to graft a receding gum line. I now wear a mouthguard every night for grinding my teeth.\n\nBy all accounts, I should be absolutely horrified of the dentist, and to my knowledge, I never was.",
            "I loved the dentist. She was a very nice woman and my parents always made it a point that it wasn't a big deal. They would then take me to get ice cream, so I always had a positive association to it. It's definitely part of how the parents handle it.\n\nEdit: My parents also took really good care of my teeth. So I never went in for more than a regular cleanup.",
            "I think SOME children would be less scared of dentists because many young children like to imitate things from those shows. Some, but not all, depending on the maturity of the child. However, I was just to the dentist and saw a boy who looked about six and was completely confident about going to the dentist.",
            "I think it's more the parents' attitude to it as well as the experience at the dentist's office.\n\nThe country I live in has a dental program for all kids with periodic appointments to introduce them to the process. The first visit they sit in the chair on a parent's lap and the dentist gets a quick history. If they are willing to open their mouth when asked they might check but only with a finger; no tools. The second visit is kind of the same, mainly to catch the kids that didn't want to open their mouths the first time and to check for tooth misalignment from pacifiers. My son has been to his third appointment now (he's four) and this was te first time there were any dental tools used.\n\nNeither of my kids are afraid of the dentist, and the lady who we've had is really good with kids and keeps them engaged and positive.\n\nPersonally, I had cool dentists up until I was an adult. Even when I chipped my front tooth when I was ten, my dentist was friendly and didn't talk over me to the other adults. My dad also didn't make a big scary deal of going to the dentist.\n\nI'm sure some kids will pick up on the 'dentists are scary' trope and get some apprehension about it, but like with much of what they take in independently this is then metered against comparative experience through their trusted role models.",
            "Dentistry has changed for the better. Equipment and methods have improved.  Also people are more educated about hygiene and routine care so dentistry can be more preventive in nature which is less invasive and easier.  Pediatricians and dentists recommend oral exams for toddlers now which makes going to the dentist just a routine part of healthcare instead of a painful toothache 1st experienced when a child is old enough to remember.",
            "... Am I the only one who had no problem with the dentist?",
            "Parents attitudes about it hugely effect kids attitudes. Additionally, making sure your kids know what to expect. \n\nMy children LOVE going to the dentist. They ask me to go constantly. It helps that it’s a fun pediatric dentist.",
            "I understand not wanting to have fillings, being scared of the needle in the mouth is pretty normal I think. But a regular check up? Yeah it's a bit awkward and uncomfortable but it's not painful. I'm not sure what there is to be scared of.",
            "I always enjoyed the dentist as a kid and even now-",
            "My mum is a dentist so I'm not afraid of them at all. In fact I can sometimes take a little nap while she's busy",
            "I don't think so. Those episodes sort of create an emotional relevance to kids. It allows them to not feel so alone when it comes to that fear, because their initial experiences with the dentist are essentially on their own, with no other kids around them to share the experience.",
            "I don't think so.\n\nI was never afraid of the dentist. My sister on the other hand was always crying in that chair. \n\nI honestly think it depends on the kid. I can't say that dentists are not scary to kids, there's so much foreign, scary looking stuff there. Thr noise is worse, even as an adult, I think the noises can make you super uncomfortable.",
            "I was never afraid of the dentist as a child. Though, if all my favorite childhood shows had a lead character that was afraid of the dentist, I probably would have developed a fear of dentists also. \n\nDon't introduce new fears to your kid, even if the message is to not be afraid of that thing.",
            "Probably not.It like being afraid of the dark, it just happens and you have no control of whats going and you're scared.",
            "No because lots of kids naturally think haircuts hurt and I think it is the same idea",
            "I‘m not actually afraid of the dentist since I‘ve never have a cavity. Though I dread the day I get one because everyone always talks about how painful it is. I just hope I‘m so old my teeth have fallen out by then and I can just go to dentures. I did have a baby tooth pulled though which wasn‘t too as it was all numb and my wisdom teeth which was a bit scarier and hurt longer but was also okay with painkillers. Worst part was my stitches breaking the second I got home and having to get them again on one side. I‘ve also had braces which was very painful but it wasn‘t a regular dentist so I don‘t associate it with them. Oh also had a super painful teeth cleaning and got scared of getting them but then had two great non painful ones at my new dentist so I‘m over it.",
            "Don't those episodes normally end with the lesson of \"see, there was actually nothing to be afraid of\"?",
            "Can we counter this by showing the kids their own parents getting the work done calmly and then do more “comfy” and less time restraints so if the kid feels like taking a walk ext. then it’s not so “I’m stuck and scared?”",
            "I’ve also wondered this about school. In general, I liked school. I enjoyed learning. But I felt self-conscious about liking it. Largely, I think, because of cartoons and kids shows.  Were there things I didn’t like about it? You bet. Especially as I got a bit older. And of course it also depended on the teacher.  But I also felt like kids weren’t supposed to like it. That through TV the it was drilled into us that the default mode was to hate school, and it had to prove itself to be good/enjoyable. That is much tougher than starting from a neutral/positive standpoint. \n\nI should also point out that I went to Catholic school up through fourth grade (9 years old). Not being a public school, I think our school day was a little shorter than public schools in the 90s. It’s also possible our recess was longer than public school, but that I don’t remember. I don’t remember how much homework we had, but I do think we had less “projects” than my 5th grade class in public school.  These things could of course contribute to my overall sense of school.",
            "Kids were afraid of dentists long before tv shows existed.",
            "Or does every kids show have the obligatory “Im afraid of the dentist episode” because children have always been scared of dentists? ...",
            "I'm sure the kids show came first and not the other way around.\n\nYa dingus.",
            "My kids weren't scared of ghosts or the dark until they saw kids shows telling them not to be afraid of ghosts or the dark. The shows suggested these things were objects of fear. Same with school, my son was looking forward to it until he saw a \"don't be afraid of bullies at school\" episode of a show that had a dragon as the bully so as far as he knew schools had dragons that occasionally breathed fire on you.",
            "i was never scared as a kid and my teeth were always horrible so /shrug",
            "Part of the problem is writers for kid shows are in a different union than the normal writers guild. They don’t get paid residuals and only get paid per script. Which is why most follow a formula.",
            "I'm an adult and I'm still afraid of the dentist!\n\nI just don't like people poking around in there.",
            "I was never afraid of dentists as a kid. I anticipated the tooth-drilling part with a certain anxiety, sure, but I never understood the fear.\n\nI'm much more afraid of going to the dentist now that I'm 25.",
            "Kids are naturally afraid. That's why there's so many shows.",
            "My kids loved Peppa Pig. Their dentist episode showed that the younger brother George was scared for his first time, but Peppa was a pro, so she went first to show it wasn’t scary. We’d seen that episode a million times, so by the time my oldest went for his first check up, he was excited. When my youngest went for his first time, he’d seen the Peppa Pig episode, and watched his brother be a champ. He was also excited.",
            "My 4 year old has been going since a year old.  The past couple of years they do a cursory teeth cleaning and he’s giggling the whole time because the instrument they use tickles him.  Everyone in the room is laughing.  It’s so cute.",
            "No pretty sure everyone is afraid of the dentist because of the pain.",
            "I dont know some kids are scared of haircut",
            "Dentist here. \nSome kids are just scared generally because they have no idea what is going on. But the majority of the scared kids I see have parents that keep saying “I hate the dentist too.” \n\nThanks for that by the way.",
            "My daughter loves the dentist (she’s 5). I’ve always framed the dentist as the “good guy” and the “sugar bugs” as the bad guys. The dentist is like any other “hero”— police, firefighter, doctor, etc— in her mind because he plays a role in keeping her healthy and strong by fighting the sugar bugs. We’ve been fortunate in that, so far, she has not had any cavities... so her opinion of the dentist might change if she had to get a needle or more painful work done. But for now she looks forward to her visits.",
            "I think kids would he less afraid of dentists if a lot of them weren't so intimidating. I mean at least tell us when the needle is going in so I can brace. Dont go around with a stern look on you're face, cause now I feel like you're gonna put my teeth on the black market.\n\nHey, wait, what are you doing with that drill, nah nah get away from me, and drilled teeth while they forget to add enough numbing agent. \n\nI dont know why I wasted my time typing this, I'm tired, yeet.",
            "I was once a kid, never had any problems with dentists.",
            "No. There are a lot of jerk dentists out there. Also I had a tooth pulled with no anesthetic when I was like 2.5 because I was in so much pain they opted to end it asap. As i got older they tended to ignore my complaints ie 'it's just pressure'. And other shit practices.",
            "I say the same thing about kids not eating their veggies. Literally every cartoon growing up had an i hate broccoli gag.",
            "I'd be less scared of going if dentist and everyone else involved would stop and listen to me. If I don't want a crown, I don't want a crown. You need to stop trying to make me feel guilty for not letting you do it. Also, if you dare hurt my mouth, when I know things can be done gently, you are just being a damn prick!",
            "Probably a bit, but the best way is to have a dentist who isn’t a total asshole. My dentist was always super sweet, and could tell when I was nervous, and was really considerate of how scared a kid must be. I also had multiple cosmetic procedures when I was pretty young (I chipped the hell out of a tooth) and it’s caused some lasting damage, and he continually does his best to make sure I’m comfortable. I had a root canal a month or so ago, and got to watch Netflix on my phone and hold a comfort item.",
            "Yes but also if parents made sure their kids brush their teeth properly at least twice a day, and then they wouldn’t have major problems",
            "I wasn't allowed to watch TV as a kid. I never was afraid of the dentists, and actually looked forward to it because they did a deep cleaning on my teeth.",
            "Kids would be less afraid if they knew how things were made and maintained--how their food gets to them, how tools help get shit done. It's just a job the dentist has to do and a possible side effect is pain.",
            "TBH it isn't kids who are generally so afraid of the dentist; it's adults who know the shit they're going to have to go through due to years of accumulated neglect. \n\nGranted there are plenty of kids with shit parents who let them eat garbage and not take care of themselves (I have a staggering amount of relatives in this category), and getting cavities filled can be a nightmare for kids, but it's generally less common with them. \n\nNo one's afraid of just getting a cleaning/exam. Some parts of it kinda suck but nothing legit scary. Dunno, maybe I had a good dentist growing up.",
            "Fine no more kids shows with scary dentistS. \n\n\nNow what about the rest of us?",
            "This depends on the dentist. I was't afraid of the dentist nor did I hate spinach (in Europa kids dont hate broccoli,  they hate spinach). Then again I went to a kids dentist and had a mom who could cook",
            "I never was. In fact I liked going.",
            "I was never afraid of dentists, they kept telling me I had awesome teeth, I think I vaguely remember a picture of my teeth making it into a local newspaper when I was 12 or something...but maybe I'm misremembering.",
            "I have no memory of my parents going to the dentist, and I can only remember being taken once as a child. (And that’s less of a memory and more of a logical conclusion that I must have gone - my tooth cap didn’t fit itself). I also know for a fact that I was not taken to the dentist between the ages of 8-16.   \n  \nThe upside is that I never learnt to fear the dentist, but the downside...",
            "No. Those \"afraid of the dentist\" episodes exist because the dentist is an inherently frightening experience, not the other way around. Same with every other \"afraid of the doctor\" episode. It is against our animal instinct to allow a stranger, near-stranger, non-friend, etc to probe our wounds or insert things in our orifices. This is why pedophiles often groom children before acting and why we we are taught not to let people touch us EXCEPT for doctors and dentists. Most animals try to bite when you shove your fingers in their mouth, and this is what children do instinctively unless they are conditioned not to. Self-defense is part of why animals have teeth.",
            "I wonder similar things about Math and other “hard” subjects.  Stop telling kids, “oh, that’s really hard.” before they even start.  You are priming them to be nervous and hate it.\n\nNow granted, sometimes the dentist has to do things that are uncomfortable and sometimes painful, but it’s a small price to pay for strong, healthy, great looking teeth.",
            "Here in Sweden, they have an amazing approach to kids and dentists. They don’t just force kids to do it like most other countries do. \nThey do it slowly and gradually. Like the first meeting, for example, is just to show the kid the dentist tools and answer questions. \nThen the next one is just to look inside his mouth etc etc. \nEverything is done in a very respectful manner to the fact that it’s a child and that it can leave a trauma if it’s a painful and unpleasant experience. \nWe can only hope that other countries will follow suit and adopt the same kind of standards.",
            "I think kids being afraid of the dentist is a stereotype that isn’t always true",
            "[deleted]",
            "I think bobs burgers handled it pretty well",
            "It would definitely help if the dentists were dressed like clowns. Kids love clowns.",
            "Are kids actually scared of the dentist?",
            "Kids are afraid because parents are afraid.",
            "social conditioning is a very strong force indeed. so yes.\n\nppl are conditioned from they are very small. some are more resistent but. think of how the nazi party, an extreme was able to socially condition an entire country. it is possible, given the right circumstances. \n\nmost ppl are not able to form their own thouts that is my opinion.",
            "I think that kids first experience with dentist is often for an emergency or extraction or something.  Going for checkups is so devastating expensive so it's hard to build that routine and relationship like with a pediatrician.  And I know of plenty of kids who don't even have a pediatrician .",
            "Maybe, but how could you not be scared when he gets out that one orange thing?",
            "No, people wouldn't be afraid of dentists if drilling in teeth didn't hurt",
            "I wasn't scared of the dentist when I was a kid it's just that every time I went it fucking sucked and he would hurt me your teeth are very painful part of your young body",
            "I can say for myself yes. I was afraid of the dentist because of how tv shows and hollywood portrayed dentists. I was terrified and my mom is my dentist",
            "Just make them watch the movie Teeth and tell them itll happen to you if you dont get your own teeth checked out",
            "I don't know, there are no \"I'm afraid of surgery\" or \"I am afraid of sewing\" episode, but I still got very scared on the   \nER surgery table",
            "I’m not sure that would help. My children don’t watch any tv at all and they were still afraid of a strange person poking around in their mouth.",
            "Even as an adult I'm not looking forward going to the dentist - what's pleasurable about keeping your mouth uncomfortably open while some guy use pointy tools in it",
            "As a kid I was never scared of the dentist I just didn’t trust them.",
            "Aren't those episodes about how its scary but the doctor is trying to help you and you'll be completely fine afterwards. I mean I haven't watched kid shows in a while but I always wanted the show version of the dentist.",
            "Bruh getting your teeth drill fucking sucks. It's not about the drilling. What really did it for me was the annoying whine the drill makes. Also, if you go to to low budget dentist, the terrible smell from burning teeth is horrid.",
            "Maybe if it wasn't so painful they wouldn't be scared. All the gas and gum injections never really helped with the pain, just made me high enough that I didn't care at all about the pain at the time.",
            "I personally have had only one caring, kind dentist in my life. When I was a kid my dentist was mean and shamey.",
            "My son has always loved going to the dentist and the doctor. Regardless of the cartoons.",
            "No. Because a drill and needles in the mouth are scary on their own.",
            "Can't answer that, but my dad tells me that when I was a young boy, I wasn't scared of falling into the toilet until a Mr. Rogers episode assured kids they wouldn't fall in. Then I was scared of it. lol",
            "I had to get some filiings in my front teeth last week. They put the novocaine in my upper lip where it meets the gum, basically my nostrils. Its was like fucking marathon man.",
            "I'm more scared of the dentist as an adult than I was as a kid due to several negative experiences. TV shows did nothing to me.",
            "Apparently there is something called white-coat fear, and this would raise blood pressure in patients but after 10-20 minutes would return to normal, so I think it is more the environment at fault than the dentist itself.",
            "Maybe. Pretty sure fairly oddparents made this a subconscious fear of mine.\n\nHave a appointment on Monday so this was a pretty weird coincidence",
            "Definitely",
            "No.  I didn't need television to make me afraid of the dentist.  My childhood dentist was so bad, it still makes me reluctant to go to any dentist even into adulthood.  As an adult, I've had decent dentists and experiences that weren't bad at all, but the jerk I had to go to all through my childhood left such an impression that I still go into high anxiety mode when I have to go to the dentist.",
            "I think this is an excellent question, I too have wondered this about a number of things.  I find most teens to be pleasant for example but teen shows always show surly and rude teens which makes me think it builds a sort of expectation for this behaviour.\n\nI am in my 40s but our family has had the same dentist since I was 5 years old.  He is VERY respected and a lovely man.  I had a troublesome tooth that needed pulling so he looked in my mouth to see which one it was, he touched a few of my teeth, \"is it this one or this one?\" he asked me.  When I said which one it was he said  \"Oh dear, it's very firm\" he said.  He lined up a number of tools on a tray, pincers, a large needle and other scary looking instruments then he said.  Right which should I use.  I was about 7 and very frightened. \"n-n-none of them\" I said on the verge of tears.  \"Okay then I won't\" he said and handed me my tooth which he had already pulled out while he was poking around in my mouth, he'd basically distracted me by asking me which one he did but he liked to play a little joke with the instruments.  He did the same to my sister a few years later but asked her how school was.\n\nI never knew people were afraid of the dentist until I saw it on TV so I think you have a really good point.",
            "If there was a show on \"why I should go to the dentist\" maybe they would be a little less afraid to go to the dentist",
            "Personally I never saw one of those episodes but I can tell you I still don’t like the dentist either way",
            "Absolutely not. I never watched any kids shows, grew up in a household without a television. Yet the dentist was and remains my biggest fear.",
            "i think this is true with the “where do babies come from?” question. my little sister and i were watching a kids tv show with that joke, and she asked my mother later that day.",
            "I used to babysit my cousins two boys a lot. They were never afraid of the dark until they watched a cartoon episode where the character got over it’s fear of the dark. The difference in them was night and day (haha). Made my life a lot more difficult.",
            "No",
            "I always thought this is the case with kids hating broccoli.",
            "I loved going to the dentist as a kid coz it meant I got out of school.",
            "Or the \"the library is for nerds\" episode?",
            "I'm an adult in my forties and I'm still afraid of the dentist, so much so that the last time I saw one I panicked and threw up on him. It had nothing to do with the fear of pain, but rather the way my (admittedly terrible) dentist treated me, like everything I did wrong or didn't do well enough or often enough was a shameful personal failing. Going to the dentist made me feel guilty and bad, and I would far rather be physically hurt than made to feel that way.\n\nOf course now, as an adult, I've gone so long without seeing a dentist that I'm terrified of the expense. I KNOW my teeth are in bad shape, but it's not like I can afford to have anything done about it, especially since my phobia means I'd probably need to be sedated in order for anything to even be done in the first place. So now I have two fears compounding each other: one, that I'll be made to feel EVEN WORSE for how long I've gone without, and two, that the expense would make treatment infeasible.\n\nSo in my case I think I would've been less scared of the dentist as a child if my dentist hadn't been a complete and utter asshole.",
            "As a grown adult, their is no show that could prep me to be strapped to a seat and be drilled in my mouth hole",
            "Nope. I’m an adult and I’m still scared of having to go to the dentist. It fucking blows",
            "No, when I was a young boy I was not scared to go to the dentist. That was until they took 7 teeth, because of my small jaw and the time it took for them to get out by themself. Since then I feel scared of the dentist.",
            "I think they'd be less afraid if they were just told what the dentists were doing straight up and didnt get sugarcoated answers.",
            "An adult is going to painfully scrape my teeth, chastise me for not takibg better care of my teeth. If you unlucky they have to FUCKING PUT A NEEDLE IN YOUR GUM. Then they drill inside your mouth. I think kids would be afraid of rhose things.",
            "This can be true of some things, but I think in this case it's all about when you show the kids the video.  A good example is my kids were never scared of the dark until after we read a book all about why you shouldn't be scared of the dark.",
            "Nope. I read something a long time ago that said it's the sound of the drill people fear.  I think Bose should figure out a way to cancel that sound.",
            "I was (and am) afraid of the dentist because of the associated pain. Motherfuckers don’t understand “I can still feel that” and proceed to torture you gulag style then charge you £50 for the pleasure.",
            "My daughter (4) never watched any dentists episodes and when we took her to the dentist she loved it. She then watched a dentist episode and was terrified the next time we took her.",
            "I'm an adult and still scared of the dentist so probably not.",
            "IRL dentist should offer children a mirror to look at his (ex-)teeth and see what the doctor does in their mouth. Child curiosity must be satisfied\n\nNot at dentist, but when surgeon did me ingrown nail resection and didn't let me see, i was disappointed",
            "Nope",
            "I didn't see any of those until I already knew the dentist to be a nice guy who cared about what was in my best interest.\n\nI never understood why people didn't like the dentist. You got to sit around and do nothing in a big, comfy chair while people brushed your teeth for you.\n\nSimilarly, we never read the \"Timmy hates his veggies\" kind of books. Mom made sure Dad ate his veggies with a smile, so learned that veggies were good. The idea that there were people who *didn't* like peas and broccoli was foreign to us.\n\nIf the kid already hates or fears something, I can see those books, shows and episodes being positive. If the kid doesn't, the best thing is to give them a positive experience.",
            "Maybe the first visit, sure. Not the second, though.",
            "No. I’m scared of the dentist and I don’t even know what you’re talking about.",
            "Idk about the dentist, but I didn't like brocolli at first for the same reason.  Powerpuff girls didn't like them, so neither did I.",
            "Honestly, yes. I didn't have cable growing up, so I didn't really watch much television as a child. I wasn't ever scared of the dentist, just annoyed I had to sit there while some dude shoved a finger in my mouth, so it was interesting when I saw a kid's show as a teen depicting this fear of dentists. To be fair, it could just be correlation rather than causation that led me not to fear dentists.",
            "Do that first so you can’t breathe wtf",
            "I think if anything those episodes would help.  At least the ones I watched would because it was always really scary at first but by the end, the character realizes it wasn't all that bad.  But that's just me.",
            "Don’t most of those shows have the moral that there actually isn’t anything to be afraid of?",
            "Fair point, but for me it was the fire hose flow of judgement from my ortho. it really got to me and I hated any dentist ever since. Plus I really hate the sound how the sound of the drill so easily flows through all of my skull.",
            "I think the problem is money.  Parents don't have the money for a check up every six months, so things literally become a problem.  Things fester and become painful, then the dentist enters.  The only association between themselves and the dentist is pain.  Now the dentist is hurtful, being hurt is scary.  Now the dentist is scary.  They problem perpetuates.",
            "Not really, I was excited to go, till I've felt that pain...God have mercy I'll never return in that place(no offense dentists, I respect you and your profession, it takes a lot of effort to go there)",
            "I'm 17 and I have never been scared of the dentist. i don't like my mouth being touched by tools for a long time, but the dentist won't harme me and it's all ok. I think once I fell asleep while the dentist was putting my braces lol",
            "I’ve never been afraid of the dentist, because I got a free toy at the end.",
            "I’ve never been scared of the dentist, but I do get extremely nervous/anxious when I go to my primary care doctor.",
            "I feel this way about how veggies and school were portrayed in my youth (90s) it seemed like it was always a trope or a constant that these things were bad according to the characters.",
            "Same reason I never had split pea soup until I was 30. it fucking rules I was pissed about all those years of not knowing how good it was because it gets dumped on all the time.",
            "What a show needs is a \"Yes! I'm going to the dentist!\" and overcoming some other plot along the way. Reinforce the good thoughts of the dentist and divert to other issues for the bad.",
            "No they wouldnt be scared of dentist if there wasnt so much sugar in EVERYTHING. End result being at the dentist with a power drill buzzing next to a nerve in your mouth. Pain = fear for little kids",
            "Daniel Tiger has a great episode about preparing for the dentist. :)",
            "Please subscribe me also subscribe you please subscribe my channel my channel name is S.A.S Boys... Saurabh",
            "The media has it ALL wrong. The dentist really isn't bad. It's the orthodontist that should be villainized. You ALWAYS leave the orthodontist knowing your teeth will be in excruciating pain for the next 2 days.",
            "No, because the dentist scene in Finding Nemo would still exist. Traumatizing.",
            "I feel this way about Spinach",
            "I was never scared as a kid, even through cavities. But now as an adult, my ginger genes broke free and I never freeze from novocaine. Having live nerves drilled into causes a fear.",
            "While it's an uncomfortable situation in general to have someone's hands in your mouth, yes I 100% believe we need to abandon the scary dentist trope. Your teeth are crazy important and anything that might make you think twice about getting dental check ups needs to be reconsidered.",
            "As a kid I only started to fear dentists after a dentist told me that kids are scared of dentists...",
            "Most kids are always going to be scared of anything new. Especially when it's a complete stranger blinding them with 10,000 Suns before sticking something pointy in their mouth. Being a dentist to children is always going to be a really hard profession.",
            "I was fine with the dentist until around aged 11 and had to have my canines pulled before braces were put on my teeth to straighten them, and the shots didn't work. Dentist didn't believe me that I could still feel everything until I screamed when he pulled the tooth out. That was 22 years ago, and after the braces were removed I can count on one hand how often I've been back, literally 3 times. I have an appointment at the end of the month as my wisdom tooth broken, and I am a mess of nerves and anxiety.\n\nI desperately make sure my kids don't develop the same terror as me, and that dentists will be a good experience. Their dad has to take them because I don't want them to see how scared I am, and it rub off on them. \n\n\nFuck bad dentists.",
            "The dentist doesn’t freak me out. Be nice to dentists, they have a high depression/suicide rate, because so many people resent them for performing their job.",
            "I think many would be less scared, especially because all of those episodes show machines outfitted with so much insane shit like saw blades. However it would not eliminate everyone, i was, and still is, terrified of getting injections. Needles have always terrified me and that's without any shows about being terrified of needles.",
            "Yes, also, parents tend to threaten children with going to the dentist if they don’t brush their teeth so they’re taught at an early age to fear us as something bad/scary.",
            "Weird. I’ve never been afraid of the dentist. Even as a kid.",
            "No. Kids are afraid of the dentist because they've _been_ to the dentist...",
            "That's my basic philosophy regarding tv for my 3 year old.  He doesn't get to watch episodes about being picky about food, for example.  When he starts showing that he's afraid of something or displaying a bad behavior, we can watch a tv episode about confronting it.  Until then, I don't want the idea in his head that it's even a possible way to behave.",
            "No. They didn't have such shows when I was a kid, and we were all still terrified of the dentist.",
            "Put a tv above the chair to distract the kid, worked for me but i have never seen any other office have tvs above the chairs",
            "[removed]",
            "They DRILL in your FACE",
            "I blame willy wonka. Christopher Lee put a fear of lollipops in me that has never gone away.",
            "Every kids show has an obligatory ”I’m afraid of the dentist” episode?",
            "Dentists would be less scary to kids if it wasn't just a series of quiet bad smelling rooms full of strange people and the noises of mouth death machines coming from down the hall",
            "No",
            "I cant relate. Never was afraid of the dentist or doctors in general. My father is a huge fuck up, but thats the only thing he did good; Made me go to doctors and understand their work. Knowledge took away the fear.   \n\n\nAnd mind you he was traumatised by his own father, who took a tooth with a tong when he was little. Worst teeth you can imagine, gets panic attacks when he tried to go to a dentist. Yet he made me and my siblings go.  \n\n\nSo to summarize; I think children would lose the fear of the dentist if they had good parents who sit by them, dont make a big deal out of it and casually explain what the doctor is good for and what he does. And that even before you need to go to the dentist. If you sit in the waiting room its mostly too late.",
            "I don't know, some creepy hunchback guy wielding a power drill next to what looks eerily like what a fucking TORTURE murderer would have sitting next to his strap loaded wooden chair, FUCK that!",
            "I think slightly... I had a teacher who said she was part of a study where half a class was told math is hard and the other wasn't given an opinion. After a while they tested their progress and the students who were told math is hard did worse on average. I think negative conditioning like that does have effects. With the dentist, however, some might be impartial but I bet a lot would still be scared. My guess is the ratio would be slightly altered without that type of media.",
            "I didn't ever watch them. I've never been afraid of a dental cleaning, I used to fall asleep when they'd pull the light down in my face because I'd close my eyes and the next thing I knew my mom was there to wake me up. Now I'm just afraid of the dentist bc I'm afraid it's going to be expensive",
            "Maybe those shows should have a \"yay we're going to the dentist\" episode",
            "I am 30 damn years old and sitting in a hard leather chair while a hairy guy pokes sharp power tools inches from my brain is still hella scary.",
            "Yes, this would help quite a bit. My wife's family never took her to the dentist once as a child, and now I can't get her to go to one (and her teeth are terrible and continually getting infected. I think something like this would help poorer children see that its not scary while they are still little.",
            "The Arthur episode helped me as a kid, but it's really up to the dentist / dental hygienist to make you unafraid.",
            "If I as a child was told just how expensive dental work is ($5k for one tooth implant!) and that I would have to pay the price since insurance never covers what needs to be done, yeah I would've taken much better care of my teeth. I guess the kid me would better understand it in terms of all my toys and allowance for a few years for one tooth!"
        ]
    },
    {
        "post_id": "mksg6v",
        "author": "Elementalmas",
        "title": "Can everyone else smell pregnancy or do I have the lamest super power ever?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/mksg6v/can_everyone_else_smell_pregnancy_or_do_i_have/",
        "score": 26144,
        "num_comments": 2905,
        "created_utc": 1617650150.0,
        "selftext": "To explain the backstory of this, I have to go back a bit.\nWhen I was a young boy, the first time I met a pregnant women was at the business place of my father. We had a little party that day, and I remember when she entered the room there was a very strong (and unpleasant) smell. Me being a kid and meeting a pregnant woman for the first time, I assumed either that's just the way they smelt, or it was a coincidence. \n    \nAs I grew up I met very few pregnant woman face to face, I had a very isolated childhood, but I did notice that smell only appeared when I was in a crowded place, and frequently I would be able to spot a pregnant woman somewhere in the crowd, or a woman with a baby. \n\nI always assumed that the reason nobody mentioned it was because it would be rude, but as I've gotten older I realize that I have never in my life heard anyone mention it. Not even an acknowledgment of the smell. This is strange to me considering it is a VERY strong smell. Virtually any room with a pregnant woman in it has smelt like that throughout, and considering its kind of a gross smell, I can't imagine EVERYONE staying silent about it.\n\nI brought it up to some friends recently, and they had no idea what I was talking about. This prompted me to Google it, I found nothing regarding this, many articles spoke of increased B.O but this smell is completely unique, not like B.O. \n\nI justified it as a coincidence until just a few days ago, I was in a Starbucks staring out the window, waiting for my drink. When I smelt the smell, I turned around and in the doorway was a pregnant woman. This confirmed it for me, I now have no uncertainty that all pregnant women smell like this. But NOBODY I've spoken to can relate.\n\nI come to you Reddit, please tell me that my super power isn't to smell when someone is pregnant. Everybody's just being polite right?",
        "permalink": "/r/NoStupidQuestions/comments/mksg6v/can_everyone_else_smell_pregnancy_or_do_i_have/",
        "comments": [
            "[deleted]",
            "I can smell mice in the wall so I don’t think you’re strange at all. We just need two more and we could be the new Fantastic Four\n\n\n\nEdit: We are now the Fantastic Six Hundred and Ninety Seven. Still accepting applications",
            "Sounds a little like the lady who can smell Parkinson’s.\n\nIf this is real, you should absolutely get involved in a proper study about it.",
            "Please do as someone suggested.  Go to a med school and get this tested to see if you actually CAN smell a pregnant woman.\n\nFirst of all that would be a new way to determine pregnancy (if a pheromone can be detected) .\n\nAND then please let us know with an update.",
            "Call an OB or go visit a local medical school and see if you can find anyone willing to actually test out these \"powers\" in a properly controlled study.  All you have right now is confirmation bias.",
            "A woman accidentally figured out she can smell Parkinson's disease. You might wanna try to reach out to researchers to find out. Her ability helped them find better ways of detecting the disease.",
            "I can smell hormones as well very prominently. My fiance's general smell gradually changes as she gets closer to her menstrual cycle and after she went off oral contraception and got an IUD her smell changed almost completely.\n\nEDIT: Apparently this is a far more common an ability than I thought! I wonder if it's an evolutionary trait left over from our ape-like ancestors.",
            "I've seen plenty of stories of people being able to sense certain things through smell. It's entirely possible. Like others have suggested, try finding an avenue to confirm, there may be some way to put it to use.\n\nPersonally, I can recognize poison ivy and poison oak by scent, even from a distance.\n\nEveryone I mention it to insists they don't have a scent, and that I must be lying.\n\nI've never ever had poison ivy/oak rashes though, so joke's on them.",
            "Not everyone can, but some people do. My father would get morning sickness every time my mom was pregnant, and my 6-year-old son all of a sudden started to tell me, \"Mom! you Stink!, even when I was coming fresh out of the shower, and that is how I found out I was pregnant with his little sister!",
            "OMG!!! I thought i was the only one.\n\nMany many years ago my older cousin revealed that she was pregnant and my grandpa said that he already knew. We ask how did he know and he said he could smell her. We laughed and shrugged it off as grandpa was funny from time to time but his face didnt look like he was joking. I laughed too because i thought it was about my cousin be nasty. I thought it was normal for pregnant women to have a scent.\n\nWhen my wife was pregnant, we hadn't told anyone and she wasn't showing yet. We stopped by my grandparents house and while sitting next to him my grandad was really keen with my wife and kept giving me a look. Again i didnt pay much attention until later that night it dawned on me. Grandad knew somehow.\n\nBut then i started thinking...Everyone close to me i have accurately predicted if they were pregnant or not even to the point of thinking they were pregnant but actually recently had a miscarriage.\n\nWell grandpa passed a few years ago and it seems like im the only one in the family who got this trait. I can smell a pregnant woman for sure.\n\nI tested it with a few friends and more family members over the years. I can't really really describe it but i know it when it hits me.\n\nThis is really awesome",
            "I know exactly what you’re talking about, though it’s not so strong for me as it seems to be for you. Seems to be unusual, but not unheard of.\n\nWhen I attended childbirth classes (room full of very pregnant women) it was almost overwhelming.\n\nI can also vouch that birth itself also has a really strong smell - different from pregnancy, but similar in some ways.",
            "You people smell hormones and I still can't smell shit after corona, 4 months later (mostly in the morning tho)",
            "I once watched an interview where a celebrity (Tyler the creator) claimed that pregnant women smelled funny but I can’t remember which one.\n\nI still remember it because its an odd statement to make.",
            "I've never heard of humans being able to do this before but it makes sense. Hormones affect body odour and stuff. I know that pregnant women can taste different (in the sex scenario way, not the cannibally kinda way) due to the changes their bodies are going through",
            "I had a girlfriend whoes husband was blind. He smelled she was pregnant before she even messed a period.",
            "\"It's that smell...that smelly smell...that smell that smells...smelly.\"\n\n- mr. krabs",
            "Don't sweat it. Everyone has a useless super power. Mine, I can hear the most random annoying sounds in your house that nobody else can. Welcome to the sub par superheroes club bud!",
            "I can see pregnancy, I don't know they look bigger than usual.",
            "I know, exactly what you're talking about, yeah. Pregnant women do smell different! Might be a case of having a really sensitive nose. Like when you walk outside and know it's gonna rain soon just based on the smell. Stuff like that.",
            "I can smell that too, but I wish you can tell me if you smell other things, I can smell a sinus infection and cavities, I even can tell if someone needs a poo/Fart funny enough, I can smell sick, its so bad I was able to smell a car air freshener that is on the parking lot from the second floor..and was right it was strawberry. \n I can almost always tell what my bf ate, even if he sneakily ate a cookie or white chocolate. \n\nGonna get tested over summer but so far its been confirmed by my psychologist, that what I have is called Hyper sensitivity. \nAlthough it affects my sensitivity mentally overall, so I am more emotional \nIt also affects all my senses. \n\nTextures whilst I eat or touch them.. \nSmells, emotions, peoples actions, sounds , light.. \nIm just always more aware of everything. \n\nI can even get annoyed not being able to cancel out the sound of the lightbulb being on. \nBf tells me when he focuses hard he hears it, but its like it isn't there.. \n\n\nIt causes me severe headaches, but I consider it a blessing and a curse. \n\n\n\nI always thought I was weird, I can tell what neighbours are cooking, smell burning before were actually close to the burning.. \n\n\nI feel like a little secret superhero with a useless power \n\nSo happy to hear someone else experiences something  a little similar\n\n\n\nHope my check in summer will help me🙏 apparently I might be able to treat it",
            "Describe the smell",
            "My fiancé thinks I’m crazy for being able to smell centipedes. This is next level right here.",
            "The reason this doesn’t make total sense is because lots of women are pregnant and not showing. So can you smell them in a crowd? A store? You will smell this all the time. Or do you only\nSmell visibly Pregnant women? I have tons of questions.",
            "It's definitely the first time I've heard about it. I've been around pregnant women before but have never noticed a different odour.",
            "What's your sense of smell like for other things? You could be a super taster or super smeller.  If so there's really good money in working as a perfumer. \n\n Alternatively if you want to get rid of this power you can take up smoking. You will smell awful",
            "Hmm, i had this thing when i was younger, i didn't know exactly where my friends lived because i kept forgetting, so i could by smell figure out which house were theirs. Wish i had some useless superpowers now. \n\nI kinda have that i can predict what someone is going to say in conversation and speeches and such. Think it's just good listening skills and prediction through logical progression tho. It's also a curse because i either have to interrupt people like a db because i know what they're going to say(i don't) or the fact i easily get bored in conversations etc.",
            "[deleted]",
            "My dog used to dig his nose in certain areas....especially at month end. Pro tip....he's not smelling your butt.",
            "I'm curious...what do they smell LIKE?",
            "Umm, my pee smells different after I have asparagus, just trying to join the party.",
            "Uhh....I have a similar power.  I just know when a woman is menstrating.  I'm 100% serious.\n\nI first noticed it in nursing school.  I was around all these women, some of whom I got kinda close to.  I became increasingly aware that some of them had something going on.  I couldn't explain it, and still cant.  I just somehow KNOW either of a woman is menstruating or if they're about to start within 5 days.  Mostly I have to have been around them for a few months or know them kinda well and I have to think about it to do it.  Like.....I have to sit there and \"listen\" to what I'm telling myself.  I dont know, that's the only way I can explain it.  And the thing is, I'm always right.  I did it to my girlfriend last week. I told her she would start in 3 days and that if we wanted to have sex, wed better start gettin it in now. (Yes.  I'm always this romantic) anyway, 3 days later she started.  \n\nMaybe it's some caveman thing.  Like, when we all lived together in large groups we had to know when women were fertile or something?  \n\nIts kind of a lame superpower, but at least I have one.  I guess. 🤷‍♂️",
            "My husband could tell I was pregnant the first time. I woke up one day oily and stinking like a 13 year old boy. He told me \"you're pregnant and we're having a boy\". Positive pregnancy test the next day, baby boy born 9ish months later. The smell went away a couple days after I gave birth.\n\n\nThe weird thing is it didn't happen with the second one. We were certain it was a girl, but nope.\n\n\nSo yeah, there's definitely a change in smell due to the hormones. You also sweat more.",
            "I mean, I have talked to people who say they can smell death (aka people who can tell when someone’s close to death, even if they’re perfectly healthy), so this isn’t unheard of.",
            "I can, too! \n\nI can also smell depression and anger.\n\nOh, and if an animal ever peed in a room, ever.\n\nI can't remember shit, but I'm a fucking hound dog. My husband says I have the worst superpower. His is the best, he can sleep anywhere he can rest is head and sleep through near anything.",
            "I can smell pregnancy too. Ive congratulated the wrong people at a party once.  She was pregnant, but her husband had just come home from a year overseas. I think the earliest I smelled it was three weeks into the pregnancy. \n\nIts easier to smell in other mammals, like horses and cattle.",
            "If what your smelling is the \"hCG hormone\" you could possibly smell testicular cancer as well. But yea I agree, you should be studied , for science.",
            "When I was pregnant, I thought I smelled... different, and a bit more (even only a couple months along). I chalked it up to it being hormones and my own sense of smell being more sensitive. I wouldn't have ever thought it strong enough an odor to cross a room.",
            "Na dude it's just you (and some dogs I believe). This is a sweet superpower though. \n\nOne of my friend's mothers reckons she can smell when other women are menstruating. I've asked her a lot about it because I assumed it was just that these people had poor menstrual hygiene, but she said it's different to that. She said it's like a smell from their hair and face and she can just tell. And my husband reckons he can tell when I'm most fertile (sorry guys I know that's gross), he doesn't call it a smell, just says he can tell (and this is backed by science that men can detect this)\n\nAll of this rambling to say its totally possible you can smell pregnancy hormones, but it is an ability unique to you",
            "My old boyfriend could tell right before I was about to get my period — very handy.",
            "I'm not an expert at all and I have NO knowledge outside of a science course in college but we didn't really focus on smell. I am THINKING OUT LOUD here, so I don't know the backing, and please feel free to tell me I'm stupid. Here's my thought process:\n\n As a woman's body changes during pregnancy, her hormonal levels are all over the place including Human Growth Hormone (HCG) Some mammals produce chemicals that let males know when they're in heat like elephants, dogs, cats, etc....some animal males can smell females so I am \\*guessing\\* you are smelling some type of hormonal change. The word i'm looking for isn't a pheromone, but something similar. \n\nI could be totally wrong. Maybe it's just the weirdest coincidence ever. But i have to believe it really is something going on inside the woman's body. It doesn't make sense otherwise.",
            "This is kind of similar- I had a pediatric doctor who could smell strep throat. I saw her a lot as a child because I had strep quite frequently, and she could always smell it on me. One time I came in and I didn’t have it, but she could smell it on my brother (who ended up having it even though his symptoms showed a few days later). It was a cool super power for her, especially because she was a doctor, so it actually came in use!",
            "So i just read this outloud to my girl and our son was in the same room... i finished reading and my son says \"maybe he just met a bunch of fat woman that really stink, did he ask them if they are pregnant?\" I decided it was a logical question... so did you?",
            "I mean, I think babies smell kind of gross and powdery, and can tell when a baby has been in an area. It's not baby powder smell though, I am adamant about that. The only way to describe it is powdery for some reason..",
            "Not pregnancy but I can smell when someone has diabetes and their sugar is high.",
            "I can smell when a woman would not be receptive to my advances. Since I have failed 100%, it's basically any smell.",
            "Beats killing all those rabbits",
            "Dude, I thought I was odd for thinking I could detect this.  For me it smells kind of like sour milk.  Not sure if this is coincidence or not, but it's happened to me a handful of times.",
            "There are many unique minor abilities that only certain humans have that have been documented, including those of smell. When a woman is pregnant her hormonal balances shift slightly, and a very small percentage of people have a rare olfactory ability to sense that. Similar to how some dogs are able to sense changes in a human biology, such as literally smelling cancer and certain diseases or pregnancy, or how some dogs are so sensitive to biological changes they are trained as Service Animals when they sense a seizure or some other medical condition. Many animals can sense an earthquake coming long before people.\n\nWith humans, there is a rare genetic quirk that allows a person to smell if another person was killed by cyanide. Very few people have it, but if a person is killed with cyanide, their breath smells of almonds, but only someone with this genetic quirk can smell it. I got this from the CSI episode The Book of Shadows, and upon checking, this is true. In fact, if you possess the rare genetic quirk and are trying to get a job in a crime lab or similar medical field, put it on your resume, you will definitely get hired.\n\nAnother interesting detail is if many women smell their male partner's sweaty laundry, most of the time that means it stinks. But if she smells it an feels arousal, that means she is ovulating.",
            "I don't think your alone. I remember reading an article a few years ago about a guy who smelled alzheimer's or something along those lines if I remember right. I believe he first learned of it when one of his parents was diagnosed with early onset.",
            "I can smell when people are sick, so id go get it tested.",
            "Women produce more body odor when they’re breastfeeding because that’s how the baby finds the nipple. Fun fact. So you may just have a good sense of smell.",
            "Reminds me of JD from Scrubs. \"I want to say it smells like non-Hodgkins lymphoma\"",
            "I can smell periods. Like copper coins in my mouth. Gross",
            "I have definitely been able to smell certain hormones on my current and past girlfriends, and it's common for dogs to be able to tell when one of their owners is pregnant\n\nHell, I had a engineer friend who could sometimes spot about-to-malfunction machinery due to his light synesthesia (if the vibrations/RPM were erratic)\n\nThis isn't outside the realm of possibility, like at all",
            "I’m actually so glad you posted this because I have something similar to that, also noticed it from a young age and just took it as a given, until I had physics class and realized that I shouldn’t be able to see what i see. I then just disregarded it and was too afraid to ever bring it up to someone.\n\nI can see heat / warmth radiation, basically what you see on those cameras? Like auras around objects with different color according to their temperature. I see that permanently and it’s hella annoying.",
            "My ex claimed he could smell pregnancy too. He would get grossed out by it so he couldn't even be near someone who was pregnant. One time we got it an elevator with a pregnant woman and he held his breathe until we left because he was so disgusted by this supposed smell. I never had kids with him (thank the gods) but he had gotten a woman pregnant before we started dating and apparently the smell isn't as rancid if it's someone he is romantically involved with? I always thought he was faking it but maybe not? Would be interesting to look in to."
        ]
    },
    {
        "post_id": "od087h",
        "author": "ShouldBeeStudying",
        "title": "How the fuck have we as a society allowed spam calls to render answering the phone obsolete",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/od087h/how_the_fuck_have_we_as_a_society_allowed_spam/",
        "score": 26112,
        "num_comments": 1236,
        "created_utc": 1625326228.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/od087h/how_the_fuck_have_we_as_a_society_allowed_spam/",
        "comments": [
            "The FCC passed some stuff that went into effect June 30, 2021. Phone companies have to stop spam calls or get fined. Anyone not registered on the network can’t access the network kind of thing. Some American company just got a mega fine for making 1 billion phone calls last year. Think about, there’s no reason to call every single US citizen 3 times in a year. They were up to no good. We lose billions to this none sense. DOWN WITH THE SPAMMERS!!!",
            "We had to scrap our landline because it was nothing but scam calls. Literally 4 or 5 a day. It's annoying at times only have a cell phone, needing a phone when they're being charged or whatever, but the scam calls were simply ridiculous. \n\nNow I get them on my cell. Less frequently, thankfully. Maybe it's just coincidence that those started when we got rid of the landline.",
            "I have been thinking this same thing the past few weeks. My phone should be a tool for organizing my life and getting more done. Instead it is a vehicle for spam. 90% of the calls I get are unwanted. Emails are all garbage too.\n\nI am, right now, getting spammed by an auto dialer for a scam call center in what sounds like India from the accents. My icloud was hacked apparently even though I use zero apple products lol. They are calling through a spoofed number out of Maryland. Blocked the number, but apparently blocking a spoofed number doesn't do anything. Get called every 10 minutes from a blocked number. Tried asking politely for them to take my number off their list...guy said no and hung up.\n\nThis is ridiculous. Do something FCC, etc.",
            "[removed]",
            "If you don't leave a voicemail message, was the thing you wanted to talk to me about really that important?",
            "I mean yes I don't even look at my phone when it rings my ringer is set to silent 100%... The select few important people in my life have a specific ring tone that will push through .  But my google pixel phone screens all my calls for me.. It also asks when a new number calls if it was spam, if I say yes it will never ring again, It will show me a missed call but it won't show any notification,.  It also has a collective data base for spam callers and if enough people reported it as spam it doesn't even come through, though I don't know if it's a android thing or exclusive to pixel phones. . That being said the collective approach I have had for the last 10 years outside of my wife... you better be sending me a text message for why you need to reach me and if it needs specific information I'll call you, or tell you when to call.. And I expect nothing different from others, Ill text you first.",
            "The spam calls are wild. At the end of May a spam caller used my actual phone number to pop up on other peoples phones while they were calling them. I got over 200 call backs that day asking what I wanted from people all around the United States. Honestly spam calling should be a much larger crime and more looked into than what it is.",
            "With the technology we have today I can’t believe we can’t get a better handle on these.  Someone in charge is getting a cut. There is no incentive to really stop them",
            "I’m pretty sure answering the phone was going to making answering the phone obsolete.\n\nIt’s not so much that “every call is a spam call” so much as it is “the only people who call are spammers”.\n\nEven work related things I’d rather text to maintain a paper trail.",
            "Come on everyone!\n\nSpam calls gave us an excuse to not answer the phone. Haha\n\nWe can pretend all day long… but we were looking for a reason not to pick up",
            "Some older family members I have are always asking me why my voicemail is full. I tried to explain that my soul can't handle one more cycle of deleting spam voicemails. They didn't get it even though everytime I visit they are complaining about the spam numbers calling during dinner.",
            "[removed]",
            "Forget spam* calls, lately I've been getting swarms of spam *texts*. Ban they calls, they'll find a workaround.\n\nEdit to correct spank for spam because my work is 80 degrees inside and I'm dying slowly.",
            "Most countries outside of America have put laws in place to stop spam calls.",
            "The FCC did not initially require phone companies to implement STIR/SHAKEN until Congress forced the FCC to do so. Ajit Pai is even more corrupt than Congress. That’s why.",
            "Spammers have bought the politicians to weaken the laws governing spam calls until they are utterly meaningless.\n\nPretty much the same as all of life - if the public's interests don't intersect with the interests of corporations trying to make endless money off you, you can eat shit. \n\nCorporations contribute millions to politicians, while you only count at most one day every two years with your pathetic puny uninformed single vote. \n\nHere's how many politicians care about what you want: none.",
            "John Oliver did a thing on it a while back. The guy in charge of stopping them was bought off by the companies making them and it took a while for him to get removed.",
            "The phone system was originally designed for reliability as the primary concern, and a lot of those early design decisions have just stuck around because nobody wanted it spend the time/energy/resources/money to rebuild it from the ground up. Even as the infrastructure transitioned to be based more on computerized systems and eventually focused mostly on mobile phones, the companies that build and maintain the infrastructure tend to do things in the cheapest way possible. So they maintained a lot of the legacy design ideas, even though they had problems. \n\nSo now one of the end results that we’re dealing with is that it’s been trivial for bad actors to abuse the system, spoof numbers, and flood our phones with spam calls. The phone companies don’t really care because the issue is universal, so it’s not driving their customers to rival providers. The only thing that will eventually force them to spend the money to fix it would be government regulation, but at least here in the US a huge portion of the population and politicians are reflexively against and sort of regulation, so things have to get really bad before we can expect the government to actually act.",
            "The two most difficult lessons that I have had to teach to my elderly family members over and over is that the people calling your house and the ones on TV news channels are not working in your best interests.  Having grown up in the 50s and 60s taught them otherwise.",
            "I literally don’t answer calls anymore unless 1 it has a caller ID, or 2 I’m expecting a call from a job, doctor, etc.",
            "I work in a call center for a legit company (furniture retail) where my sole job is scheduling deliveries. I call about 150 people a day but schedule maybe 20 deliveries. Because nobody answers the phone anymore!!!! It’s not uncommon to pull up an order to schedule that has 10 or so attempts to call and schedule. But nowadays people pretty much assume any unknown number is bogus, and rightfully so. I don’t answer my phone for unknown numbers either.",
            "I don't answer the phone because I don't want to talk to people.  Not because of spam calls.",
            "I get 3-5 spam calls A DAY and now doctors, schools and important calls never get answered by me because they're using area codes from my state now. I don't even know what to do about it.",
            "What about those spam texts?",
            "The same way we let advertising ruin the internet, gaming, and television.",
            "I do still answer my phone but only when I know the caller and thus can see who’s calling OR in rare cases will even answer an anonymous number if I’m expecting a call. Hospitals and the like often call with a blocked number and I can’t afford to miss those calls. Otherwise I’ll ignore it ringing.",
            "[deleted]",
            "Sheeesh now im not even getting calls, its spam texts. Almost every other day",
            "So true.\n\n\nI don't answer my phone unless I know who it is.\n\n\nEverything goes to voice mail.",
            "Money.",
            "As long as one person can make a profit at the expense of millions then this is the American way.",
            "How have we allowed spam/junk mail to virtually overburden the USPS beyond usefulness regularly?",
            "Whenever there is a public good that everyone enjoys there will always be people that will abuse it and ruin it for everyone",
            "I requested a quote for a service online and provided my cell phone number. This was a mistake. I started getting several text messages and calls from companies regarding this requested service and their quote they would do the service for. One company continued to text me, even after I initially declined interest via email, text and phone call. So, I called them one day, they proceeded to not listen to me and hang up on me, so I called them multiple times, demanding they listen to my suggestion for changing their texting methods (they clearly need to incorporate a STOP method on their texts), and gave them plenty of flack. When I was done that day, I stopped. I did not receive any more calls. If they are going to incessantly harass me, I will not sit around and let them continue to do so (within reason of my own time of course). It's not fair.",
            "There’s like 4 people in the world I’ll answer the phone to, fuck talking on the phone.",
            "It's seriously out of hand. For me it's not so bad, but my mother gets 10-15 SPAM calls on her landline and about another 10 on her cellphone every day. Not to mention many of the them now are made with ill intent to extort money by fraudulent lies.",
            "Capitalism.",
            "I usually get around 3-5 spam calls a day",
            "We have a market, not a society, determining policy",
            "Bro. How are atm prices higher than 10 years ago.  All this technology and it still cost 4 bucks to take out 20 bucks",
            "The problem is that it is cheap and easy to setup an automated system with a laptop and internet that does the scamming.  You don't even need to have a company to do it.  Your just seeing the double edge sword of technology.  It can improve our lives as well as destroy them.",
            "The US has laws (e.g. the Do Not Call list) but the problem is most spam calls nowadays originate from outside the US.",
            "The same way solicitors and door-to-door salesmen have rendered answering the door obsolete (and the rise of home cameras)",
            "I actually like it. I now have the perfect excuse, if questioned, why I didn’t answer the phone. Unless someone in my contacts is calling, every call just goes to voicemail. I’ll call them back on my own schedule if I want to talk to them.",
            "And now they are doing the same to text...I get 10 spam texts a day.  Super frustrating.",
            "Because governments don't enforce laws against it",
            "Happened before with landlines, it was only a matter of time.",
            "Dunno but it needs to change. Just went through to count em for this threads sake - I get no less than 7 spam calls each day beginning at 745am (ive slept with my phone on silent for ~4 years now). The most in 1 day in the last 2 weeks I counted was 11. \n\nI make 1 phone call every 2 or 3 days but get all these car warranty calls every day. Including the weekend.\n\nedit: Also I do block each and every single one of them every time. Its always new numbers with the same recording.",
            "I always google the number before answering. If they hang up in the meantime I just call them back. One time I was at the hospital, and I got a call from a Norwegian mobile number. Normally I would not answer, but I thought it might be one of the doctors trying to get hold of me. So I answered: \"Hello, I am calling from Microsoft support\" with a VERY strong Indian accent. If I wasn't so stressed out about the hospital visit I would have told him I only have Apple pc. But I just hung up..",
            "It is illegal in many places, but it is also not very easy to catch someone using VOIP.",
            "It sucks. But STIR/SHAKEN is starting its rollout, and there are things like nomorobo.",
            "I would be ok with the sources of those calls to be taken out by drone strike.",
            "So fucked up",
            "Money.",
            "The bigger question is do you know your car warrantee is expired?",
            "I mean, we haven't really. If you're in my contact list, I'll answer when you call. We've just normalized not answering unknown numbers which is the ideal outcome for me tbh. When we had a landline in the late 90s/early 2000's we still got spam calls, we just had to answer them and tell them to fuck off because we didn't have caller ID. Now it's just become so uncommon to receive important calls from unknown numbers that we don't bother anymore because almost nothing is done over the phone. It's pretty great tbh.",
            "This is one of the main reasons I silence unknown callers and only put their call through if they call twice. I get at least 1-2 a day. It’s ridiculous",
            "People have to die, or a powerful person has to benefit from change, before anything changes.",
            "As someone who hates answering the phone I now have an excuse.",
            "We created “voicemail”",
            "The same reason we let advertising render television and radio and snail mail obsolete.  The same reason we are letting it ruin text messages and websites and social media and video games.\n\nProfits!",
            "It’s irritating especially when they spoof my number to call everyone so for example my list for of my phone number is 4100 so they call 4101 to 4199. I usually get 3 or 4 angry calls back from people calling my number because they spoofed with it.",
            "I still answer my phone, but I work at a call center and call references for employment purposes and people won’t answer and will call back once they get the voicemail like “oh I thought this was spam” most of the time",
            "I always answer in the hope that it's the call saying I've won the competition I entered via text. It never is. But I have learnt from answering that I've commited tax fraud and had an accident in the last 3 years so I guess all is not lost.",
            "I live in a different state than when I bought my phone. Whenever spam calls I know it because it has my old area code that NO ONE has where I live now.",
            "Perfect excuse to not extend our auto warranties. Sweet, sweet anarchy",
            "I agree, pretty much every call goes straight to my voicemail since 99% of calls are spam.",
            "The same reason you still get spam email and junk mail: because the powers that be care a LOT more about big businesses than they do about you. \n\nA lot of big businesses rely on channels by which unsolicited marketing is delivered. Over the years, the USPS has become reliant on them. Other companies rely on obscuring call numbers and using cold calling. Many millions of dollars are made using outbound marketing. \n\nBasically, we've been sold out, time and time again. It won't stop unless we demand that it does.",
            "AT&T will block potential SPAM calls. Except, in my personal experience, it thinks the number of my local hospital is a SPAM number. When I was anxiously awaiting a call back from the on call delivery doctor, it kept blocking the number. I would suspect it's instances like this that keep phone companies from getting involved. (I desperately needed to receive that call, and it kept blocking it.)",
            "My phone is merely internet access when I'm not home \n\nWho am I kidding? Is my internet access at home too.",
            "Phone companies make money from spam calls too so they have no incentive to stop them.",
            "What is the point of these spam calls anyway? I’ve gotten hundreds of calls about unpaid student loans, I’ve never once taken out a student loan, what are they hoping to accomplish?",
            "Probably, because someone controlling the regulation (or lack thereof) was making money off of the situation, somehow.",
            "I was super busy at work yesterday, then my mobile rang, I answered it and a woman said ‘Hi, I’m from Marie Curie, I’m not looking for money today but…’. I know it’s shit but I immediately hung up, as I was about to go into a meeting, and how did she get my number and think it was ok to just call me at work? I donate to charity, I don’t need to be guilted into it on a cold call.",
            "\"what's up?\" what am I supposed to say to this?",
            "I think this is an American problem, same as health care. I haven't received any spam call since last year, and that's because it's illegal where I live. And I assure you I made phone calls everyday.",
            "Short answer?  Money. long answer? More money",
            "Good question. All I know is that without Google's call screening feature I'd probably be in an insane asylum by now. Those fuckers will not leave me alone!",
            "Are you in the US? My relatives who live in the US are always complaining about this but it's not a thing in other countries.  My relatives say they actually won't answer the phone if it's a number they don't already know.",
            "OMG right I tell you my temper spikes Everytime my phone rings",
            "ya if anyone not in my contacts calls me, they better leave a voice message. I'm not answering or calling back otherwise.",
            "Capitalism, my dude.",
            "Capitalism",
            "Instead of spam calls I now receive spam texts and some how get added to text groups with literally hundreds of people typing absolute gibberish.",
            "My phone is set to ignore all unknown callers.   If they need to talk to me they can leave a message saying who they are and why they are calling, if not I consider it spam.",
            "I would like someone to explain why they call so.much. half the time, they don't even say anything. Just hang up. What is the point?",
            "I was avoiding answering the phone well before all the spam calling. Always hated talking on the phone. Thank god for text messaging.",
            "I am a professional texhnical sales person. B2B. My entire career revolves around me making phone calls, and the recipient answering them.\n\nBut not anymore.\n\nThe telephone is dead. Well and truly dead.",
            "I want a phone that can be configured to ring on a white list only",
            "Organized crime is organized…also the telcos benefit so they have no incentive to stop it.",
            "You don’t have to answer every time the phone rings.\n\nTurn off your phone and voicemail for as many hours a day as suits you, your schedule and your responsibilities allow. \n\nOnly take calls and texts from people in your known numbers and manage voice messages maybe two times a day. Set your ringtone for known numbers, otherwise ignore the unwanted calls. Block if possible.\n\nMake a dedicated email for only work. Make a separate email for friends and family and another for buying things online. Don’t link them or you will be back where you began. \n\nUse a google phone number for buying things online if they require a phone number authentication.\n\nIf you are able to chase an unenforced spam policy you will be able to make these changes for yourself that will make your life more comfortable. \n\nIt sounds like a lot I know, but it significantly reduces the problem.",
            "Spam calls have gotten to the emergency line in our elevator at work. Last time I rode it a woman wanted to save me hundreds of dollars on my car insurance.",
            "This is literally not a problem anywhere outside of the US",
            "The Netherlands recently passed a law that states you cannot legally be called for commercial purposes unless you explicitly state you give people permission to do so.",
            "Same thing we’re letting happen to texts and emails.",
            "Probably doesn't answer your question but I'm really glad this happened, I speak for alot of people when I say answering phone calls is stressful as fuck for no reason",
            "I have a stand-out area code because I retained the number from my smallish home town when moving to a major city. To go by my [daily] incoming call list, you'd swear that I was the most popular girl in my hometown. Else, why should I have so many calls \"from\" my old area code?",
            "Unfortunately it’s big business; scammers cold call numbers and record which ones answer, they sell it on to other scammers.\nMy personal favourite is “would you like to hear about how you can buy Bitcoin for less than half its value?”\nI always answer with “what’s the weather like in New Delhi?”",
            "I love them. My personal record is 1hour 32minutes. \n\nThat guy (\"Justin\" from tech support) was pissed when it turned out I'm \"actually broke\", and just wanted to waste his time.\n\nGood times. Answer all your calls. It could be really fun.",
            "Unregulated Capitalism.",
            "Is there a sub to post Americans complaining about American problems, not realizing that it's only them? /r/ShitAmericansSay doesn't really fit...",
            "Europeans think we are fucking stupid for allowing them.",
            "I don't get it. The Bundesnetzagentur follows every single case of an unwanted span cash. It is not allowed to call a private person to sell something, if they aren't already your customer.\n\nI think I never got a spam call here in Germany",
            "But how else would I learn my cars warranty is going to expire?",
            "If its important enough they can leave a message",
            "Again, mistaking lack of regulation and laws as FREEEDOOOOOOM! It's the choice of americal voters they live in a world of perpetual gettingfuckedovery",
            "I was just talking about this with my mom. Before mobile phones were everywhere the landline got maybe a prank call or two, and a few sales calls. The phone only made it received calls. Now my mobile phone lights up constantly with annoyance calls, despite being able to do 50 times the functions of that plain old telephone service. It is such a shame.\n\nI report the spam and fraud I get to the FTC. https://www.consumer.ftc.gov/features/how-stop-unwanted-calls\n\nI registered for the do not call list\nhttps://www.donotcall.gov\n\nI set unknown calls and texts to silent\nhttps://support.apple.com/en-us/HT207099\n\nThis still isn’t enough to get my phone to the lower level of annoying calls that my old landline had.",
            "I didnt realize until now but spam calls and emails have been a contributing factor to my depression.",
            "The parents of a friend of mine live in Cincinnati. They told me they get NO spam calls at all. None. They use Cincinnati Bell which has a tool: When you call their number, the system answers with \"Please press 8 to continue\". It then waits a few seconds and disconnects if no 8 is pressed. I believe CB wrote it themselves (not sure). Are there drawbacks (I don't see any)?"
        ]
    }
]