[
    {
        "post_id": "elwglg",
        "author": "None",
        "title": "What's the name of my food",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/elwglg/whats_the_name_of_my_food/",
        "score": 52342,
        "num_comments": 1547,
        "created_utc": 1578507318.0,
        "selftext": "I want to eat them but forgot how they were called and can't ask anyone since I'm alone\n\n[imgur](https://i.imgur.com/J9G6ozm.png)",
        "permalink": "/r/NoStupidQuestions/comments/elwglg/whats_the_name_of_my_food/",
        "comments": [
            "I'm curious, how would you have described it to a waiter?",
            "Shrimp?",
            "[removed]",
            "r/tipofmytongue likes this stuff too",
            "[removed]",
            "[removed]",
            "Crawfish?",
            "[removed]",
            "[removed]",
            "I love shrimp! Enjoy your food :)",
            "Based off your drawing some sort of tsundere shrimp?",
            "[removed]",
            "[removed]",
            "Skrimp",
            "[removed]",
            "[removed]",
            "Could be prawns too",
            "Prawns, not shrimp",
            "Shrimp or Prawn",
            "Prawns? Shrimp?",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "Everyone is saying shrimp, but I vote crawfish.",
            "It's pronounced Sk-rim-p",
            "Legitimately the best drawing of a shrimp I've seen.",
            "Ocean-Dwelling Armored Critter",
            "Shrimp. Heaven. Now!",
            "Shrimp, more specifically prawns if they're bigger :)",
            "Craw fish?",
            "In the UK and Australia, it's a prawn, in most of the rest of the english speaking world it's a shrimp",
            "Crawfish?",
            "It's a prawn",
            "[removed]",
            "Duct tape this on the wall, and you, sir, have a piece of art!",
            "Could be langostino?",
            "Your drawing is good enough, just reverse image search it",
            "Sea shell thingo",
            "Crawdad?",
            "Do you often have issues finding the right word?\n\nIf so, you might want to look into anomic  [aphasia](https://www.webmd.com/brain/aphasia-causes-symptoms-types-treatments)",
            "[removed]",
            "[removed]",
            "flamingo",
            "Crawfish!",
            "[removed]",
            "[removed]",
            "I think it’s shrimp?",
            "Awww it’s a prawn!",
            "OP you could probably reverse image search your  drawing and get the answer",
            "Shrimp or crawfish",
            "Crawdad?",
            "Crawdads?",
            "Shrimp my dude, sometimes your brain just does you wrong like that.",
            "Prawns or shrimp if you’re in US",
            "[removed]",
            "Crawfish if you're in the south, crawdad if you're wrong haha",
            "Sadly for you I'm french, so \nThis is a pretty accurate drawing of a Crevette\n\nYou're welcome",
            "Shrimp/Prawn",
            "Interesting enough, at one time I lived in the basement for a while. Then I have to leave for a couple months so I left a pot of water on my desk for room humidity. Came back a couple month later, I found a shrimp like transparent creature dead in the water. I never did know what the fuck that thing is."
        ]
    },
    {
        "post_id": "aqwf3q",
        "author": "SubarashiiChinChin",
        "title": "Why do people wear shoes in the house?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/aqwf3q/why_do_people_wear_shoes_in_the_house/",
        "score": 51815,
        "num_comments": 4948,
        "created_utc": 1550236311.0,
        "selftext": "Most of my American friends and coworkers wear shoes in the house... It's so gross! \n\nI'm Japanese and I always cringe when I see this.\n\nEDIT:\n\nI have learned today that people don't like it when I ask why they do things. I have had multiple people message me telling me to fuck off and to leave their country alone.\n\nApologise if I worded it aggressively or something. I really was just genuinely curious. ",
        "permalink": "/r/NoStupidQuestions/comments/aqwf3q/why_do_people_wear_shoes_in_the_house/",
        "comments": [
            "I think that this is more common in places where they don't get much snow or rain, like California.  In Canada we always take off our shoes so as not to track dirt and mud around the house.  It's not a hard cultural rule like it is in Japan, but more of a practical necessity.  It's also common to have a different pair of shoes in the office, than the boots that you are wearing walking around outside.",
            "Not all Americans do this. I think it depends on the region. I'm American and I don't wear shoes in the house, and neither do the people I know. But it's not so much a strict rule like it is in Japan - if I was just quickly running inside to get something, I probably wouldn't remove my shoes.",
            "For my job, I visit 10-15 houses, 6 days a week. I carry a reusable pair of slip on booties because we aren't allowed to take our shoes off (they're safety equipment). When I get to a house I look for clues (glances at my shoes, a pile of shoes by the door) and just slip them on if I think they want me to. When is messy outside, I'll put them on at every house. I also keep an eye out for prayer rooms and cover my feet before entering those.",
            "Usually the only time I wear shoes inside is if I’m just coming home for a short bit and heading right back out.   Then it’s just easier to leave them on.   ",
            "Comfort. Laziness. Preference.\n\nDepends on the person.",
            "I don't know how to explain it, but I need them to feel like I'm \"ready\" to get shit done. I can laze around all day with no shoes, but if I'm going to be zipping around the house picking up and putting things away, I need to have shoes on. And a bra.",
            "I have more than a few pets and no matter how hard I try I can’t train our 3 dogs to use the doormat before coming back inside.\n\n\nThis is why we wear shoes in the house. My boyfriend and I both have a few pairs of house shoes, and have special shoes to go deal with the animal messes in the backyard and basement.\n\n\nPlus living in the northern part of the United States we get a lot of snow and slush this time of year and no matter how many times I swifter there is too much dirt to just wear socks. \n\n\nAlso living in a college dorm a long time ago and using those showers have conditioned me to never be barefoot, I even wear flip flops in the shower.",
            "I have flat feet, I need the arch support or my feet kill.",
            "[deleted]",
            "I’ve always had pets going in and out of the house. My shoes don’t bring in anything that their feet don’t. It’s just a little bit of dust and dirt, almost imperceptible if you sweep the floors regularly.",
            "My floor is cold \n\nEdit: I own socks... idk. I just keep my shoes in for the majority of the day because if I kind of go in and out of my house. ",
            "I'm Mexican and we do this because the floor is cold and there is a Mexican myth that if you walk without shoes you get a cold. (which can be true but the weather has to be cold too) And it is actually really disrespectful to take your shoes off in someone else home, because of the smell.\n\nAlthough, when I wake up I like to be without my shoes, but it has to be before I take a shower because my feet get dirty.",
            "I feel more productive and less lazy with shoes on.",
            "When you live on a farm or work an outside job taking on and off boots multiple times a day can be a hassle. Also if you have multiple pets who are tracking way more mud and dirt then your shoes ever could it seems like less of a big deal. Vacuum and mop regularly and it isn't gross.",
            "I am not American (British) but I do this. I just hate being barefooted. I don't mind wearing just socks though.",
            "I take them off if it's carpet but leave them on if it's hard floors. I hate getting my socks/feet dirty or wet",
            "I think it’s just one of those things that your culture dictates. I’m a shoes-in-the-house Australian who visited Japan recently. I found it very uncomfortable that in accommodation I was expected to wear slippers that were communal. The idea of putting on shoes that other people had worn really freaked me out. I also don’t like the idea of going barefoot in other people’s houses because my feet are the only feet that have touched the inside of my shoe, whereas other people’s bare feet have touched their floors. Either way is gross in its own right. We just need to accept that everyone is different ",
            "English here, I do it because I love in some kinda shitty rental accommodation which always has a cold floor, but I hoover twice a week and don't stand in big piles of dog shit so it's not an issue. Some people can be so uptight on here.",
            "We don’t sleep near the floor or sit on it ever, so the floor for us isn’t as much a part of our usable space. We do most of our living above the floor. We feel the same way you do when it comes to shoes on our couches or in our beds; that disgusts us probably to the level the floor does for you.",
            "A lot of people have mats to wipe your shoes off on before coming in. That gets most of the dirt that would make a big mess. I hear people mention the \"what if you step in poop\" thing, but if that happens you usually notice from the smell while you're still outside. If you accidentally make a noticeable mess, you clean it up. I wear my shoes inside sometimes, but I also vacuum weekly and mop often enough that it's not like I'm wallowing in filth. And if I have to run in and out multiple times (like when bringing in groceries) I'm not gonna be taking my shoes off and on every time I hit the doorway.\n\nThat said, I know multiple Americans who do want everyone to take their shoes off. Unless you're an ass, you'll comply but will probably think, \"Oh, they're really particular about cleanliness.\"",
            "I live in England and nobody I know insists that you take your shoes off when you come in. If I'm staying in for the rest of the day I will take them off, but if I'm doing things I'll keep them on. Unless you're covered in mud I don't really see the problem. That's what door mats are for.",
            "The second I get inside my shoes and socks are off and I change into relaxing clothes",
            "I have plantar fasciitis and can not walk more than a few feet without some type of hard soled shoe on. ",
            "Different cultures really. That's all",
            "I'm 50 and I've been raised in nice homes. It's just our culture. We weren't raised to remove our shoes / boots, but we do have mats to wipe our feet. People don't purposely track dirt into someone's home. \n\nAs another noted, we eat off higher tables than some and our beds and furniture are also high off the floor. \n\nWe also have large dogs that bring ground matter into the home. I would not trade the love of our family pets for a bit of dirt because we zsweep and vacuum regularly. \n\nI do think it's a good idea to remove shoes, and to each their own if that's important to you. We do if it's muddy or obviously dirtier than usual, but just general ground matter can be mostly \"stomped off\" at the door mat.\n\nThis discussion is no different than asking why all Americans don't use bidets, why do we \"smear the feces in...instead of washing it with a bidet.\" ",
            "i've never been to a private home,where people wore shoes indoors\n\ni live in Denmark\n\nbut i've visited a few private homes in foreign countries (germany, scotland, netherlands) and it was all without shoes too.",
            "I'm in the midwest and anyone I know takes off their shoes at the door.  Though, of course there are exceptions.  \n\n\nThat said, I would like to note of my friend's Japanese wife who would not let us go any further into their house without taking our shoes off....while we were carrying a couch. ",
            "I take off my shoes when I come home and then wear flip flops or slippers around the house. I hate the feel of being barefooted. ",
            "I swear Europeans dont wear shoes in the house too, I mean ive seen some british people do it but most people I know that arent british take off their shoes.",
            "Jokes on you, I have no shoes. ",
            "I only ever noticed it in American television. I've asked some Americans about it and it seems like it's normal in some regions. Honestly here in Canada we always always take our shoes off going into ours and other people's home.  In the winter it's a no brainer since they are all wet and slushy but even in the summer we do it as well. ",
            "Growing up on a dirt road in Alabama we always take our shoes off when we go inside or else it will track all kind of shit in.",
            "I'm American and always take my shoes off when entering a home.  It feels wrong to me to wear shoes on carpet.  Plus, we have a ton of stickers in the grass outside that we don't want to track in.\n\nIMO, the main problem with the way you asked the question was the \"It's so gross!\" and \"I always cringe.\"\n\nAn alternative would have been: \"Most of my American friends and coworkers wear shoes in the house.  I'm Japanese, and this makes me very uncomfortable to observe.  It would seem to me that [insert reasons why it seems like a bad idea to wear shoes in the house].\"\n\nThis would let you express your feelings on the matter without directly denigrating anybody else.",
            "Because some people just do.  They might have a different set or two of shoes specifically for their house, or maybe they don't mind cleaning floors more often.",
            "I have a pair of inside shoes. I have very high arches and shoes help them not hurt all the time. \n\nI come in take my outside shoes off and put my inside shoes ",
            "Am I the only person with outside shoes and inside shoes? My parents are the same. I have a pair of converse and a pair of adidas that never go outside.",
            "In Finland you will disgust everyone else in the house if you walk around with your shoes on. Also, I grew up in the Midwest USA and it was always expected to take off one's shoes inside.",
            "I'm American, from Georgia.\n\nThis is a fascinating conversation! Ok, in warmer weather I wear sandals most of the time and my shoes come off almost immediately when I come inside.\n\nIn colder weather though, I leave my shoes ON inside until I'm ready to sit down and relax. I have hardwood floors so they can be chilly, but honestly, until I'm ready to stop running around, I don't even think about removing my shoes.\n\nIf I'm home all day, I wouldn't bother putting shoes on at all though, just going barefoot or wearing socks.\n\nIf I go to someone else's home, I would not take my shoes OFF unless they mentioned it because that seems a little too informal and disrespectful. Maybe it's silly but I feel like showing my socks to people I hardly know is a bit too casual?\n\nI should add, I work in a professional environment. If I wear shoes somewhere that gets them dirty like hiking, strawberry picking etc, the shoes would come off as soon as I walked in the door so as not to spread dirt all over the house. I think that is common of most people who have shoes used in a more utilitarian way.\n\nI've never heard of a single person who wears shoes in bed and it's generally considered seriously rude to put shoed feet on couches or beds.",
            "i don't know, i'm american and i take off my shoes in the house",
            "Because of a crippling fear of stepping on multiple thumb tacs that stems from childhood...",
            "Personally I find it more comfortable and I dont want to keep taking them off and on again. If they're noticeably dirty or muddy I'll take them off and put them somewhere that they wont make too much of a mess like the garage.",
            "Angeleno. Earthquakes.",
            "[removed]",
            "Personally I wear shoes in the house because I have two dogs who drool.... often. \nWe always wipe it up when we find it and have one of those robot vacuums that goes room to room cleaning every day, but stepping in drool grosses me out so much I slso wear shoes just in case",
            "My teenage son wears shoes in the house because God help us all if he takes them off and doesn't go straight to the bathroom to wash his feet.\n\nFor this reason, I allow shoes in my house at all times, especially by him and his friends.",
            "In the UK where I’m from loads of people wear shoes inside too. Maybe the cold, I dunno. In the Middle East where we live now most people take them off. I prefer no shoes in the house because it keeps the carpets nicer but I never insist. My cats are loads more revolting than shoes!",
            "In Canada we use slippers . Always slippers. At least everyone I know does ",
            "Always worn shoes in the house.  Not sure what's cringeworthy about it, it's just shoes.  \n\nI hate sock feet.  If you're ever in a room with several people not wearing shoes, the room smells like feet.",
            "I don't know. I'm American and I can't fucking stand it, and every time I ask people to remove their shoes they look at me like I'm being overly anal. My mother would have slapped the shit out of me if I wore my shoes in the house growing up.",
            "I've read about 50 replies and nobody mentioned slippers. I'm so confused. Are we talking about shoes in general even if its slippers or are we talking about outside shoes?",
            "We take our shoes off inside in Canada. \n\n",
            "I’m American and I never EVER wear shoes in my house. I hate to think about all the things I could have potentially walked through outside. Not to mention public bathrooms... Makes me cringe to think about dragging that into my home. I do have super sturdy slippers that I wear inside though! Solves the not being barefoot and uncomfortable problem. To each their own though! I know equal amounts of people who do allow shoes and don’t. ",
            "[deleted]",
            "The only time I keep my shoes on are when I'm too lazy to take them off, or if I'm going somewhere else soon. Otherwise, they come off immediately.",
            "because the floor is lava",
            "I grew up in So Cal and went shoeless a lot, but have to train myself out of that habit. Your toes, your feet are precious. I've broken toes three different times because I was going around without shoes or with inadequate sandals.   Even moccasins would have protected my toes better.\n\nAlso, here in Montana your feet will get cold regardless of the heating.  \n\nWhat I don't get is why guests take their shoes off in our house when we're clearly wearing ours.",
            "I’m from the South-Eastern part of the US. We have red clay dirt so I always take my shoes off in the entry of my home and walk around barefoot. \n\nLike some of the comments have mentioned I think it’s regional. It’s always hot where I live. It gets as cold as high 20s (Fahrenheit) maybe a few days a year, but our winters are very much 50 degree weather. So my floors aren’t cold. \n\nAs a child I often played outside in bare feet because of the heat so honestly, I learned to hate shoes. I wear shoes as an adult of course, but I can’t wait to throw those bad boys off as soon as I walk through the door. It’s like freedom lol",
            "My dad tells me his feet get cold",
            "I wear slippers indoors. I have sweaty feet, so I'm bound to pick up dirt particles from the floor (dust, pet hairs etc). I can't stand my feet being dirty.",
            "So. First, at home I have slippers and I love my nice comfortable slippers. \n\nBut, I see a lot in here about \"clean carpets\" which makes me wonder if people realize that they're really not THAT clean. My socks get laundered after wearing them once and my feet are washed every time I shower. But, how often is a carpet laundered? I'm not just talking a vacuuming, I'm talking as fresh and clean as the socks I'm wearing. Weekly? I doubt it? Monthly? Probably not. Maybe yearly. Maybe.\n\nNow, people want me to remove my shoes so that my nice clean socks and feet inside them go walking on someone's carpet that hasn't been laundered since last year (if ever)? That doesn't seem to me to make sense. \n\nIf people provide a place to put my shoes and prefer I go without them, I will. It's their house and I'll do as they please. But man, don't make it out like it's gross or something. It's the opposite.",
            "...how has nobody in this thread heard of wearing slippers inside their home? It’s the perfect solution to keeping dirt from the street outside your home while also keeping your feet warm and clean. ",
            "Holy crap, what a weird thread to become an anti-american circle jerk. ",
            "People have really messaged you telling you that? Fuck them. Their opinion is about as useful as an asshole on an elbow. \n\nAs for why people wear shoes in the house, good question. I wear mine to the doormats. Now, I'm not perfect and there are times where I will leave them on if I'm making a quick run through the house but that doesn't happen often.",
            "Because hardwood floors are the coldest material in the universe.",
            "I'm from México, usually here our floor is cold and due the weather we cant have  wooden floor. ",
            "Maybe a bit late but I didn't see this answer yet.\n\nSomeone in my family went out with some super rich person. They didn't take their shoes off in the house because if you think you do, it means you have dirty shoes and you probably walked on not perfect ground. So basically, if you need to take the shoes off, you're working on the field or whatever and then you're poor.\nThat person explained it to me in a nicer way but that was the idea.",
            "American here. I live in a house with 4 roommates. Mostly, I'll leave my shoes on in the public spaces and take them off in my room because my roommates don't take their shoes off half the time they come in. I'm betting its part laziness and also the fact theres no designated area(s) in the house for removing shoes. It's just not part of American culture and therefore, never included in the houses we build.",
            "I have shoes that I only wear in my house.  The only place where Crocs are acceptable.\n\nI foster dogs - many of which come to my house not house trained - so it’s a huge gamble to go around bare foot. 😆",
            "Foot problems that require a specific footbed and 200 lb dogs that will cause extreme pain if they step on a bare foot.",
            "Because most likely I'm coming from outside and will soon venture back outside and am not concerning myself with maintaining a slightly more clean home by taking them off. Unless I step in dog shit, mud, or gum or something similar. I think, for the most part, the amount of dirt you usually pick up just walking around outside is pretty negligible and nothing to worry about. Plus, I have cleaning supplies when the goin gets rough. Other than that, I just take em off immediately once I'm there to stay. \n\n",
            "About 18 months I went to let the dogs out and I had no shoes on, as was my norm.  Occasionally they would step on my feet, and as they a large it would hurt for a minute but I would get over it.  On this morning, as I opened the door for them to come in, the dogs started to fight, both slammed into the door, and the door opened across my foot, ripping my big toe nail 95% off, requiring a minor procedure to remove it the rest of the way, and my nail is just now back to mostly normal.  Now I always wear shoes when I let them out.  ",
            "[deleted]",
            "In every American movies I see they keep their shoes on in house, even put their shoes on bed or on sofa.",
            "Please come to New York and tell this to every single person who has a downstairs neighbor. My upstairs neighbor clomps around all night in what sound like high heels. ",
            "Like actual shoes or do they have a pair of sandals or slippers that they only use when they're inside? I'm American and agree, wearing shoes inside (unless they're  house slippers or you're only going to be inside for a couple minutes at most) is gross.",
            "Nobody does that in Quebec, CA.",
            "My floorboards are rotting and i lost a month of mobility from an loose stabby. No more walking with no shoes\n",
            "In Norway, we'd never do this.",
            "I don't want my feet Exposed",
            "To prevent slipping on a wooden floor when wearing just socks. We wear slippers indoors, though, not outdoor shoes.",
            "My kitchen has wood floor and it’s nice when I’m cooking to have the additional cushion for my feet. It also reduces the chances of slipping when compared to socks. But I try not to wear them on the carpet.\n\nIt’s also important to note that I live in a pretty clean area in the US so I’m never tracking mud in the house. I’ll take off those shoes before coming in. ",
            "I understand what you mean but to me, most households I’ve been into (including/especially mine) have the rule of leaving shoes near the door. I think of the germs and random particles my shoes must carry around with them and the thought of that being dragged into my personal space is abhorrent. Granted, yes, I can and do clean my hardwoods but for me it all goes back to what I drag in my bed and I’ll be damned if I have any crumbs in my bed bc someone decided to walk the house in their winter boots....\n\nI also wear have house shoes that never leave the house to protect my feet extra",
            "I do and don’t wear my shoes inside. 80% of the time I’ll take my shoes off right when I get home. The other 20% is I wanna sit down and relax for a bit before taking my shoes off or I’m just comfortable in my shoes so I keep them on.",
            "I currently have neuropathy, so walking barefoot in the house is agonizing.  However, we wore shoes in the house all throughout growing up.  Most people in my area did.  I don't know why.  Taking them off is actually the weird thing to do where I'm from.",
            "i almost always have my shoes on in the house. fuck it. it’s not a big deal. If it’s someone else’s house who leaves the shoes at the door then best believe i’ll respect that. ",
            "Cause my feet are stinky",
            "Yeah it just makes my feet feel better to have cushion under the bone. Also it’s sandy where I live so the floor is impossible to keep clean. So shoes help keep your socks clean and comfy ",
            "My feet suck. Fat, hairy, Hobbit feet.\nBest to keep them covered.",
            "In Norway, wearing shoes in someones home is _insanely_ rude.\n\nAnd nasty.",
            "[deleted]",
            "Because I don't feel like regularly vacuuming/cleaning the floor, so even if I always take my shoes off, my feet/socks will get covered in dust, dirt, and dog hair.  It's easier to just always wear shoes/sandals in the house than it is to vacuum every week.",
            "From reading this thread, I get that I am the only American that wears their shoes in the house. \n\nI wear them because.....I always have?  It’s easier than putting them back on again?  Same reason I don’t wear sandals: if something goes down, I’m always ready to get the hell out of there. ",
            "Southern US here and I wear my shoes pretty much at all times unless I'm getting in the bed or just getting out of it. I'm more comfortable wearing my shoes than walking in socks or barefoot. If you clean the floors regularly, there's not much of a problem. Call it laziness or preference if you want, but I don't like having my shoes off honestly. And my feet are weird where if I don't wear shoes my feet will dry out and crack, few things hurt as bad as having a split on your heel and trying to walk. I don't want to have to put on my shoes and retie them again if I want to go outside. I have mats on both the outside and inside of my doors also.",
            "[removed]",
            "Hey OP, I didn't mind your question, but you might have chosen a milder way of putting it. How would you feel about: \n\n> Most of my Japanese friends and coworkers make extremely loud slurping noises when they eat noodles... It's so gross!\n\n> I'm American and I always cringe when I see this.",
            "I'm American and do not do this, I have a spot right by house entrance to have myself and guests place their shoes. If I go over someones house and they leave their shoes on I keep mine on as well. I don't want my socks to touch their floor lol. I agree with you, it is wicked gross.",
            "It's a PITA to remove shoes and I never got in the habit.  I wear slip-ons in the house because y plantar fasciitis is bad enough to need padding between my feet and the floor.  Really I should have house shoes and indoor shoes.",
            "Don't listen to the mean people. I think it's disgusting too. We need more people like you in our country ☺️",
            "I am American and often wear shoes in the house. It doesn’t feel dirtier than socks to be honest. I don’t usually walk on dirt or mud, I walk on sidewalks. Shoes have leftover dust on them, socks have sweat on them. These are about equal in cleanliness to me. I often take my shoes off in my own home, but that’s more about comfort than it is cleanliness. I generally wouldn’t take my shoes off in someone else’s house unless they want me to. \n\nThe one I really do dislike is when people take off their shoes and socks. Bare feet are sweaty and smell bad. I don’t want your bare feet on my stuff. We generally don’t put feet with shoes on couches or anywhere but the ground, but people without shoes sometimes do. I was at a hair cutters place one time and a boy took off his shoes and socks and it bothered me a lot. It seems gross to me. Dust is cleaner than sweaty bare feet to me. ",
            "Because some people are fuckin' barbarians.  ",
            "This is the fault of movies. No one takes off their shoes in movies.",
            "European here. We don't do that either. As far as I am aware. Only Americans are participating in this phenomenon ",
            "I’m sorry people are being rude to you. We are not all mean. ",
            "Personally since I have doormats and usually scrape my shoes before walking in, also my flor is made out of wood or ceramic so walking barefoot can be a bit discomfortable, that said those type of floors are easier to clean. only if I'm home all day I don't wear shoes obviously",
            "American here.  You’re right. It’s disgusting. Why would anyone want to walk in bathrooms and the street then bring that into your house? It’s nasty.  When I go to someone’s house, I always ask if they want me to remove them unless I see a pile of shoes then it’s automatic.  ",
            "Because I can’t stand my feet getting cold. They get cold even in summer months without shoes & socks. ",
            "House is cold, dog that sheds all over the floor, shoes are comfy, going in / out of the house frequently and don't want to constantly be taking shoes off to be putting them right back on. Just some of the reasons I keep my shoes on.",
            "Never used to in my parents house /my childhood home.\n\nBut i do in my own home because we have cats and i hate hair and mess and fluff and toys and poo and pee",
            "If your house is nasty, I'm keeping my shoes on(if they don't have mud, snow, or dirt on them). I've been in a few apartments/houses where their flooring/carpeting is clearly not taken care of at all, along with other aspects of cleaning. It's not hard to mop/dust/vacuum your floors, people.",
            "I'm American as fuck and I think wearing shoes inside is mad bizarre.\n\nOther people's houses though I'll generally leave them on unless it's a good friend/family and I know it's okay. Some people are weird about it, but most aren't.",
            "I don't like to wear shoes at all, during the summer I quite often go outside barefoot.  \n\n\nCheckmate '*shoes off for cleanliness'* people!",
            "Sometimes I do, sometimes I don’t. Generally it’s just more of a hassle to try to take my shoes off at the door when I’m doing things (bringing in groceries, switching bottles in the water machine, etc) that I have to go in and out of the house for, that I end up wearing them through it. Usually when I get home from work I’ll take them off and leave them off though. It just depends on the situation.",
            "I'm British and it's the done thing to take them off here. My mum sometimes walks around with boots on and it baffles me, how uncomfortable?! She just forgets though. ",
            "Our whole house is tile so I wear slippers. Wish we had carpet and I would walk around in socks! We live in south Texas. ",
            "My house? I just don't really care enough. I have two cats that drag litter everywhere so I vacuum every day. Carpet clean once a week. I don't do it at other peoples houses though.",
            "Because my feet go numb from poor circulation if I don't keep them warm enough. ",
            "During the summer months I usually keep my shoes on during the day. I like wearing them, no other reason. ",
            "I don't know, I think we just don't care? I understand that this is a really big deal for some cultures, but I never really thought of it.",
            "Some people care, some people don't. I'm from a family that doesn't. We don't because we're pretty messy and it's more off a hassle. I like to keep my shoes in my room because after wearing them all day, boots can smell a bit. I would rather that smell stay in my room, than bother everyone.\n\nMy neighbour, and some of my cousins take their shoes off at the door, so when I visit them I do that too. When they visit me, some of them do not. ",
            "I'm Aussie, we do this too, why do you find it gross? Most people I know wouldn't think twice about shoes in the house",
            "It's culture. I grew up in the country by farms and we never took our shoes off in the house. When I started to go to school and meet people closer tot he city a lot of people took their shoes off inside but in my neighborhood it was uncommon to see that. "
        ]
    },
    {
        "post_id": "ktytha",
        "author": "ShesGotSauce",
        "title": "If every single American teen suddenly \"pulled themselves up by their bootstraps\" and got a high school and college degree, wouldn't we still have poor people because we will always need blue collar workers like janitors, cashiers and high paying jobs are limited?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ktytha/if_every_single_american_teen_suddenly_pulled/",
        "score": 50491,
        "num_comments": 5646,
        "created_utc": 1610224445.0,
        "selftext": "My point is, do we overemphasize the ability of individuals to make it to the top if they just try hard enough, within our current system? Is the system rigged, in a sense, so that trying and dedication aren't actually enough?",
        "permalink": "/r/NoStupidQuestions/comments/ktytha/if_every_single_american_teen_suddenly_pulled/",
        "comments": [
            "South Korea has this problem. So much of the population is educated that they have trouble finding people to do menial labor.",
            "I’m a janitor and my starting wage was $22.50 an hour. I work my ass off but can listen to music and work mostly by myself. Not so bad",
            "Blue collar workers might not be rich but they shouldn’t be poor either.  \n\nUnderstand this:  if a big corporation like Walmart is paying cashiers so little that they qualify for government assistance like food stamps or free lunch for their kids or welfare, then the taxpayers are subsidizing Walmart.  \n\nYou might say that raising workers’ salaries will lead to higher prices, but we pay either way.",
            "[deleted]",
            "If everyone gets a degree then everyone will need a master's to differentiate themselves",
            "Poor people are a result of not being able to survive off of wages, their jobs simply don’t pay enough. Inflation for rent and utilities has shot through the roof and is rising at a faster pace than minimum wage meaning living off lower level jobs is no longer possible without any other assistance whether it’s from the government or other jobs. If profit margins were lowered and more money went to workers pay, we would have a lot less poor people, additionally the cost of living has to balance out with workers pay. Now I’m not saying everyone should be living in luxury, but everyone should at least be able to afford to support themselves and live decently regardless of the skill level of the job. America treats shelter, food, and clothes as a privilege of your income instead of a necessity to human life. That’s one thing I wish I could change about this country.",
            "Some people may just want to be a janitor.  Perhaps they like the idea of cleaning a school or whatever at night.  Throw some tunes on, not bothered by anyone - no stress.  If they make enough to get by and are happy within those means, and thats what's important to them, why bother going to school/making more money?",
            "[deleted]",
            "Among what everyone else is saying note that the saying \"pull yourself up by your bootstraps\" was originally meant to be a metaphor for how impossible it is to achieve the American dream, as it would be impossible to literally pull yourself up by your bootstraps.",
            "Think on this.\n\nUp until the election of Ronald Reagan, one minimum wage job would support one person in comfort, and two people with a big of squeezing.  'Middle class' was defined as one job supporting an entire family, with a few luxuries thrown in.  In those days $1 million was considered a huge fortune.\n\nAfter Bush Sr left office, 'middle class' was two incomes supporting a family and a minimum wage job meant you had to live with Mom.  But thanks to giant tax cuts, $1 million was what a rich guy would spned on a party.",
            "Okay so I’m going to piggyback a bit off of what u/WonderChopstix said. The issue here is first of all, there is WAY too much emphasis on the fact that people need a college degree. Trade schools are a wonderful thing - there are people who work long, arduous hours, come home smelling terrible, and are extremely happy.\n\nWith that said, going to college had a specific purpose years ago, which was in simple terms to become formally educated in order to be ‘qualified’ to be in a certain position (such as a teaching degree or an engineering degree). When the government took over student loans back in the 70s-80s, that was when college became less of a place for formal education and more of a business. Moreover, going to college does NOT in any capacity guarantee a “better” paying job. It may give you a few more opportunities, but if you get a degree that is only useful in a very niche area, you should expect to have a limited number of options. And, to the point of government takeover, you’ll still be in debt just from the way that the loans are designed as well as how much college tuition has gone up in the last 40 years.",
            "This depends on how you define poor. Yes there will always be people less well-off than others but no there do not have to be humans living in total poverty.\n\nThere is no reason to think that someone working any full-time job should be below the poverty line. The people at the top can always give a little more for the people at the bottom (I'm talking like instead of buying a 7th Yacht, donate that money to impoverished communities).",
            "> **wouldn't we still have poor people because we will always need blue collar workers like janitors, cashiers and high paying jobs are limited?** \n\nEventually, as automation & efficiency improve, we will find fewer and fewer available blue collar jobs. & this is the argument for UBI (Universal Basic Income)\n\nEvery human being has a right to \"exist\" (food, shelter, water, clothing, health care, basic utilities) & this is where UBI comes in, it covers the basics.\n\nSomeday, (if we aren't already there) taxing those in our society who have benefited the most from the riches of our country, will be able to pay for this UBI.\n\nSome people (probably a lot of people) will be lazy asses and will sit around and do nothing and waste their life. (who cares about them)\n\nSOME people, want \"more\" than the basic essentials, want a fancy car, or something, since people don't NEED to work blue collar jobs, they will receive higher pay.\n\nSome people (and this I think is the most exciting), will be aspiring people who will be free to pursue their interests which could lead to an explosion of invention/discovery. In the past, a lot of these people were stuck flipping hamburgers.\n\nThe rewards for society would be immense at the cost of the top 1% paying their fair share.",
            "Many think college equals well paying jobs. One of the big problems we have right now is that assumption resulting in many graduates working at Walmart with college debt. \nTrade schools are not well respected and they should be promoted more. Plenty of folks going this route have potential to make a decent salary.  HVAC.. diesel tech..etc... making 60 to 100k is possible (depending on where you are in US for reference). Even better if those folks don't have college debt to pay.",
            "Blue collar doesn't have to mean poor and white collar doesn't mean rich. I've been in IT for 17 years and during most of that time my average wage was $12/hr. I don't personally consider IT white collar but we should be beyond the point where service industry means shit pay. More to the point we need to stop the notion that jobs like CPA or CEO mean making 5-10x what literally everyone else makes.\n\nMost importantly we need to get past the notion that \"traditional\" college is the only or best way. Four year university degrees aren't the norm except the last 50 years, not even the entire time the United States has existed. Traditional education beyond primary school, meaning up to what we now call 6th grade, is actually apprenticeships and trade schools. There's not a damn thing wrong with going to trade schools, vocational education, apprenticeships and community college that focuses on useful education in infrastructure requirements for modern society to continue.",
            "Most posts in this threat are not answering your question. So I'll jump in. The answer is: Yes.\n\nEducation (or job training) is what neo-libs promise will improve our job prospects, but it's a scam. The real answer is some combo of higher minimum wages, unions, and ultimately worker control of firms.",
            "When people say that poor people should work harder and get better jobs, they're not saying that this would lead to no more poor people.  This perspective assumes that there will always be poor people, that poverty is not a problem to be solved at all.  Instead of solving the problem of poverty they are placing blame upon those who are poor.  In other words it's like saying \"Yeah they're poor, but it's their own fault so why should I care?\"",
            "Blue collar does not equal poor",
            "[deleted]",
            "Capitalism requires exploitation of the poor for the rich to thrive.\n\nBootstrap theory is based on the idea that as long as YOU can individually rise up out of the poor class, that's OK. It is complicit in the fact that capitalism requires poverty as long as the individual can theoretically pull themselves out of said poverty.\n\nIt's basically cruel propaganda to stop you from rising up against the injustices the system is designed to inflict.\n\nThis is also why the label socialism as a bad word and push back against social programs of all kinds. Social programs like social security, medicare, unemployment, SDI, UBI, are designed to reduce the suffering under capitalism. It is a correction to the default state of cruelty. Same goes for a rising minimum wage, unions, workers rights, etc. These are corrections to the miserable game of monopoly we're all taking part in.",
            "Yes. Capitalism is predatory. A janitor is entitled to a living wage but denied that dignity because of how the system was designed.",
            "Yes, we would still have poor people. This is because the system is broken and only favors a few. We are selfish creatures and our society/system reflects that. We need a new system, built by rare humans who are not selfish. \n\nSince I was a kid, I've wondered why we have to pay for things like food or water, which are essential to our survival. I live in Canada thankfully, so at least our healthcare is free. No one bats an eye about why healthcare is free (\"Of course it should be free!\"), but when I ask why other essential things for survival aren't free (very *basic* food, water, shelter and clothing) people say \"Well because those things cost money, we can't enslave people, and people would become lazy if all that stuff was free!\" Um... what? No. Healthcare costs billions of dollars, but we find a way to pay every doctor and nurse. I've always held the opinion that basic things for our survival should be free and easily accessible for all. Things like basic food, water, clothing and shelter to survive. And when I say basic I mean the basics to keep us relatively healthy, nothing fancy. Like \"basic food\" wouldn't include cakes or cookies, but things like potatoes, proteins, vegetables, fruits, etc. Stuff you need to live. Those things should be free. \n\nBut who will pay the workers you ask? Everyone will. We include all those \"free\" things into taxes, therefore *everyone* puts a little into the moneypot so that *everyone* gets what they need. This system actually exists right now, this isn't a new idea. Denmark and Finland have adopted this idea. They have free healthcare and free education (it is illegal for a school to charge tuition in Finland), and the government pays those who have lost (or even voluntarily *LEFT)* their jobs enough money per month to cover the basics for living. I watched a video about a Finnish young adult who didn't like her job, it wasn't bringing her happiness. So she quit and the government paid her $2000/month to take it easy and figure out what she wants to do first and I think she decided to become an artist (because \"starving artists\" isn't a thing there). This is common practice there. Citizens pay higher taxes, but because of that everyone takes care of each other. They don't mind paying more because they see it as an *investment* into an amazing future and way of life. Homelessness doesn't exist there either. On top of that, every profession is respected. People treat you the same if you're a doctor vs a garbage man, because they realize that every job is valuable and important. Large wage gaps don't exist. A doctor makes more than a garbage man, but not by a ridiculous amount. And the thing is, in places like Denmark and Finland, you don't even *need* a job that pays a lot. There's no need to make a lot of money, because everything you need to live a good life is already provided for you. Your job is just added income and something for you to enjoy doing.\n\nIn future societies, I believe this way of life will eventually be common practice. And they will look back at *our* time the same way *we* look back at the way of life back in the 1800s or 1900s, and feel bad about how difficult our lives must have been (and then be grateful they don't live in *our* time, where we had to actually *PAY* for things we needed to survive!! How barbaric!).",
            "And literally the whole generation would be starting their adult lives in massive debt.",
            "Yes. The problem isn’t with the people, it’s with the employers. The person flipping burgers at McDonalds deserves just as much happiness as a stock trader (I’d argue, more). Everyone should be able to live comfortably and not worry about where their next meal comes from if they work 40 hours a week, full stop. If you disagree, you are actively advocating that some people should suffer just “because it’s bad job,” as if that’s their fault.",
            "College debt makes poor. Health care debt makes poor. Loans makes poor there's no escaping",
            "Yes and no.\n\nYes, in the way that jobs like janitors, cashiers, and so forth are going to be necessary in at least some capacity for at least the foreseeable future.  No, in the way the phrase of \"pulling yourself up by your bootstraps\" is meant to be insulting and its meant to be disparaging, because its clearly something that *you* have done wrong.  It isn't that you're being underpaid as a cashier, you hear about people like Jeff Bezos who made Amazon all on his own in his mother's garage!\n\nExcept he was given $200,000 of seed money because both his parents were bankers and had a nice fat nest egg.  \n\nThe problem is not the people, it is the jobs.  They simply do not pay enough, [this is where a minimum wage job pays for housing and how many hours of work are needed.](https://www.mentalfloss.com/article/505093/make-minimum-wage-heres-how-many-hours-you-need-work-week-afford-one-bedroom-apartment)  That's also just cost of living, it doesn't take into account healthcare or emergency expenses.  This is done on purpose to facilitate something known as \"Wage theft.\"  The more you cut costs for \"unskilled work,\" which is an oxymoron, since all jobs will take at least some skill to do in some way.  An electrician is a skilled job, as is road paving, construction, and even yes, being a janitor.\n\nWe simply don't pay poor people enough despite having a gargantuan glut of wealth that just...doesn't move anywhere.  There's literally no other reason, except the people at the tippy top are so greedy that they refuse to pay their employees the worth of what they actually produce.",
            "Somebody found the problem with capitalism.",
            "A lot of those jobs would be replaced with automation",
            "[deleted]",
            "\"Blue collar\" doesn't always mean poor.",
            "There’s no reason a janitor or cashier can’t have a college degree - there are loftier reasons to be educated that have nothing to do with your career/job. People working with their hands deserve to have the chance to read literature, study history, experiment in a lab, etc if that’s what stimulates their mind. We have to get away from only defining education as a means to contribute to an economy.",
            "Yes.  \nThe game is completely unfair.  \nIf you want to make it more fair, then you're a Socialist.",
            "Served my country, got a degree, and still fucked and near homeless.",
            "Yes and No, depending on the demand of such jobs and how automation will happen. We are seeing for example \"Blue Collar\" trade jobs going into high demand thanks to a generation of people who believe college is where you make all the money so they push their kids into it. Without realizing that an electrician can make a steady $60-70k a year.   \n\n\nRight now we have a problem with too many educated people going for too few jobs. Which is creating the issue we have today. Many people not using their degree to their full potential.",
            "1. Individual advice does not make sound public policy. The strong individualism you see in America is simply delusional, [you didn't build that](https://en.wikipedia.org/wiki/You_didn%27t_build_that) is an obvious truth that most people don't like to hear. \n2. \"do we overemphasize the ability of individuals to make it to the top if they just try hard enough, within our current system?\"  It's not that people lack the ability, it's that people must be at the top therefore there must be people at the bottom, regardless of how hard they work. If everyone followed the \"work hard\" motif, we would be marginally more productive but the hierarchies would still be there. In most cases, if you get a job you aren't really adding to the economy since someone else (likely equally qualified; see next point) would have simply done it. \n3. \"Is the system rigged, in a sense, so that trying and dedication aren't actually enough?\". The system is rigged, largely a fault of human interaction. Everytime you apply to a job there are likely dozens of other equally or better qualified applicants, that's why it's important to have connections. You also have to deal with things like alphabetical ordering of applications, the bias of the reviewer and even timing. Logically none of these should be applicable, but they are the primary factors in hiring.",
            "Capitalism requires an under/slave wage class",
            "Yes, the system is rigged. Trickle-down economics doesn't work. Even the phrase \"pull yourself up by your bootstraps\" started out as a sarcastic phrase to point out an impossible task - it can't be done, which is what our economy (and the 1%) counts on."
        ]
    },
    {
        "post_id": "somozn",
        "author": "Tbonewiz",
        "title": "When leaving the house, does anyone tell their pets they will be home later?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/somozn/when_leaving_the_house_does_anyone_tell_their/",
        "score": 49944,
        "num_comments": 5650,
        "created_utc": 1644437482.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/somozn/when_leaving_the_house_does_anyone_tell_their/",
        "comments": [
            "Every single time.\n\nThey are pretty old, so over the years they seem to understand the difference in time between 'Store' and 'Work'.\n\nStore is reserved for anything under an hour.\n\nWork is when we will be gone for over an hour or more.\n\nWe just say 'We're going to the store, we'll be right back, and they go to these specific spots in the living room.'\n\nWhen we say, 'We're going to work, we'll see you soon.' They sit in other spots.",
            "Of course!  Otherwise, how will they know?",
            "Forehead kisses all around and \"please be good\" as I shut the door 😄",
            "I do lol. I tell em to \"Have a great day!\" too. :)",
            "Yes. I'm not a monster",
            "Always",
            "I give them the estimated time I'll be out for. Because if I don't, they'll constantly text/call asking when I'll be home.",
            "Of course. If I'll be gone for a while, I say \"I'll be home in a bit\" and if I won't be gone too long, i say \"I'll be home soon\" so he knows the difference.",
            "I do. And I also wave goodbye from the car.",
            "Yes. And I leave the radio on so he’s not bored",
            "Yes, and I turn on the t.v. for them, and tell them to be nice to each other while I'm gone.",
            "Every time.",
            "I ask mine to watch the house.",
            "Does anybody not? I talk to my cat all the time, when I am alone with him. I may well have been spotted standing at the open front door explaining that, despite the rain, it's really the best chance for him to get some fresh air and sing with his friends the birds (he's a bit odd), while I pop out to Aldi for some more nibbles, yes, the ones with the soft centres.",
            "Yes! I wave and say goodbye to my fish while reminding her I will see her later 💙",
            "\"We'll be back later guys!\"",
            "If I didn't , how would he know I'll be back in a bit ?",
            "I pick one of our dogs and tell them they're in charge until I get back. Sometimes I'll pick the cat just to mix things up. I never pick one of the goats. I'm not making that mistake again.",
            "Well ya, we're not savages",
            "I tell them “Don’t talk to strangers” and “Have a good day” and “Be a good boy” and of course “I love you”",
            "No. When I was researching how to ease  my dogs separation anxiety, one of the tips was do NOT make a big deal about leaving, or coming home. This will worsen the dogs anxiety. When I leave the house he gets his hedgehog stuffy and goes in his bed and we don’t make any other mention of leaving. It’s sad but his anxiety improved a lot since I stopped doing goodbye cuddles!",
            "\"OK, you be a good girl while I'm gone\"\n\nKnowing that she'll just sleep the whole time.",
            "[deleted]",
            "Every time, followed with \"behave yourselves\" to our three cats.",
            "I always tell my dogs to “hold down the fort while I’m gone”",
            "I say to mine. I'll be back in holds up fingers many hours and I don't want any kitty katty nonsense while I'm away.",
            "Of course! I always feel guilty cause I live alone with two cats. I have to say goodbye or ill feel sad all day, I love them🥺",
            "[deleted]",
            "Yes. Sometimes I tell them how long I'll be gone for 😂",
            "Yup",
            "Absolutely!! I always tell my two dogs that I don't want to leave them, I just have to go to work to provide a good life for them. I tell them me and their daddy will be back tonight so please be good! I also update them on where we are at in the week so they can countdown to the weekend with me. 😂 \n\nThey also get special \"bye bye treats\" when I leave so they are always licking their chops when I'm getting ready to leave. Beats the sad puppy dog eyes",
            "Every single time.  And I usually assign one of them to be in charge",
            "I tell my dog and reassure her that I WILL be back soon. My cat doesn't give a fuck.",
            "When my mom leaves on a trip she’ll always say, I’ll be gone THREE (or whatever it is) days, and then knock three times on the floor so they know. Lol",
            "Yes, I think it's a healthy behavior to be in as it assures your pet in a reassuring voice that you won't be gone long even if you'll be staying out all day",
            "Duh! I tell them how long I'll be gone, that there's food and water, to be good and that I love them.",
            "\"Guard and protect. Don't have any wild parties. Be home soon.\" Every time.",
            "Of course!",
            "[deleted]",
            "Not just later, I specify what time I will be home because I am convinced that little monster can tell time...",
            "I always tell them \"love you, have a good kitty cat day, I'll see you later!\" \n\nWouldn't want them to worry.",
            "We have street dogs in my locality, where our whole community gives them food and water, and one home also opens it door for them whenever these dogs don't want to be out. These dogs are friendly with us all, and so whenever i am on a walk after dinner, these dogs are out in the lane, and they too accompany me pacing up and down my lane. and when its time for me to head back, i feel like they might feel like i am going to soon, so, i softly whisper to them good night.",
            "My wife always greets the cats before acknowledging me when she walks in the door. (But I do always say goodbye to each of our three cats when I leave for work in the morning - AFTER kissing her goodbye.)",
            "I always tell my GSD that he's on fire watch!",
            "I always tell the dogs I'll be right back,  and I tell the cats no parties",
            "I ask them for \"huggies\" & they both run to me so I can pick them up , hug kiss & then I say \"ok I love you play nice ill be back soon\"! 😄🥰🐾",
            "Always",
            "alqays and we leave music on too.",
            "Yes lol. I pet my boy (kitty) and give him head scritches and tell him, \" I'll see you later \"",
            "My dog definitely knows the difference between I'll be right back (running to the store) and I'll be back later (going to work or will be gone for hours)",
            "Every time.\n\nWhen I had two dogs I'd put one in charge.\n\nSometimes we'd put on NPR in the background so we could talk news and politics with them. Other times classical music, or other playlists.\n\nThen when I come home I say \"I told you I'd be right back!\"",
            "Not only that, but \"Be right back\" or \"1 minute!\" and she knows I wont be gone more than a minute or two so just carries on doing her thing. \"Wont be long\" she knows it's 10-15 minutes so she pulls a face but is fine. \"Back later\" she's not pleased cos she knows I'm gonna be out for a while\n\nAnd yes, I have cameras throughout downstairs so I can see her reactions. Lovable nutcase",
            "You can't leave without saying goodbye, it's rude!",
            "Yeah or they’ll assume we’ve left them for adoption. \n\nSource? Gf is a veterinarian.",
            "How else would they know?",
            "I often say it to my house plants. Does that count? I also say good night every evening when their auto light turns off.",
            "Literally anytime I leave the house I make I point to say good bye, and I love you.",
            "Yes. And my dog knows the difference between Be right back, and Be back later.",
            "I do. I also tell them to be good. And if I have to leave for anything other than work I tell them I'll either be right back or that I won't be gone too long.",
            "Yup! I tell each I love them and I'll see them soon.",
            "I even do this when going to feed my brother's cats.",
            "Obviously. But only after I let him know that he is in charge until I get back.",
            "Of course, both my cats get goodbye and welcome home attention. snuggles for the girl and hugs for the boy(she doesn't like hugs, he loves them and purrs louder the harder you squeeze him lol)",
            "Every time!!! Sometimes I throw in a “don’t throw any parties while I’m gone” or “have great dreams buddy, I’ll be back soon”",
            "Of course, I do. The easiest way to determine if someone is a psychopath is to see if they don't reassure their pets that they'll be home soon.",
            "If you don’t they might get worried!",
            "Yes and I give her a pat on the head for being a good at waiting",
            "Every single time. My cat has abandonment issues too, so I always feel bad when I leave and give him extra cuddles before I go.\n\nBut I’ll say bye to my fish too and they couldn’t give less of a fuck. Just a force of habit, I guess.",
            "The last time I saw my childhood dog I put her in the yard to chill for a bit until my husband could come back to pick her up a few hours later after dropping me off at the airport. I was gone for a week, she was hit by a car and died that week. I didn’t tell her goodbye or that I love her. \nNow I tell my own pets I love them and I’ll see them in a bit every single time I leave the house, even if it’s just for an hour.",
            "Yes, and I make sure to let Chaplin know that he's in charge and that nobody is allowed over and there can't be any loud parties.",
            "Yes. I always pet my dogs. I tell them I'll be back in a few minutes. And as **soon** as I leave they start talking shit about me. You know it, I know it. They talk. They just don't want us knowing. \n\n😂",
            "Always. Scritchee and kisses.\n\nThen when I come home I make sure to sing my come home song:\n\nMommy comes back\n\nMommy always comes back\n\nMommy comes back\n\nTo you (kiss kiss)",
            "No. Because if I die I'm an asshole AND a liar.",
            "I use to say to Q, \"See you in a little bit!\" and she would tilt her head. Miss her.",
            "i do not... because it would tip him off to me leaving and result in a scene\n\n&#x200B;\n\nif i sneak off and he doesn't notice then he just gets to be super happy that i am back without being super sassy that i left",
            "Always!!",
            "Oh thank god I'm not the only one",
            "Yeppers. Tell them I love them and to be good, and I'll see them in a bit.",
            "Why wouldn't you?",
            "Of course !",
            "If I start leaving and forget, I go back into the house just to pat her and tell her I love her and to be a good girl and I'll see her later",
            "Yes of course, I remind him to look after the place, to be good and that I won't be too long.",
            "I say \"I'll be right back\" if it will be a half hour or less. I say \"I'll be back later\" if it will be longer. And then I tell lexi I love her, of course.",
            "We have two cats at the office that are \"pest control employees\".\n\nBefore I leave the office I tell them that I love them.",
            "I tell my cat “you’re in charge”",
            "Yep! My dumb lil cat has to know that I'll be back soon",
            "Yeah! I love my lil homie plus I read somewhere that it’s good to do that",
            "Totally, my dog gets super stressed when I leave and I always hold her face and tell her I love her and that I’ll be back soon.",
            "Of course. I also wait until my dog understands it.",
            "Of course. Were you raised in a barn?",
            "Yep and I’ll sometimes run back several times to kiss her goodbye, depending on how intensely she’s staring at me as I leave!\n\nAnd if there’s no one home, I’ll leave the radio/alexa on for her",
            "Honestly the hardest part of coming home to my dogs is not acting super excited when I walk in because I missed them, very closely followed by not taking waaay too long to say goodbye when I leave. I know it's for their own good but still!",
            "There are people that don't?",
            "Of course, I'm not a heartless monster.",
            "Yep.\n\n*\"Wait here, be right back\"* means I'm only going to be gone for a few minutes. \n\n*\"Stay here, play guard dog\"* means it's going to be a couple of hours.  Don't freak out when I'm not back immediately.",
            "Isn't that the considerate thing to do?",
            "I tell my cat gooodbye, have a good day, I love you, and then kisses to his head witha hug",
            "Yup, every time. My husband usually works much earlier than me so it's always me who is leaving our pup. Every day I say to him \"bye buddy, be a good boy, dad will be home soon, I love you\"",
            "Yep. Proper leaving procedure is as follows:\n\n1) Turn on the radio to chill tunes\n2) Kiss the top of puppy’s sweet little head\n3) “Bye, I love you! I’ll be back soon! You be a good boy— you always are! I love you!”\n\nIf you have to come back inside for any reason, begin again from Step Two.",
            "My mom died almost 4 years ago, there’s a picture of hers on the wall which can be seen from the door, every time I go out to work or wherever, I tell her when I’m coming back and say goodbye. If for whatever reason I forget to do that, I come back, open the door and say it. I’ve tried to stop doing it, but I can’t, always feel like I’m doing something wrong.",
            "Of course, every single time. Who doesn't talk to their family?",
            "Yes, after I tell him he is the bestest boy and that I love my fuzzy wuz.",
            "of course. A scratch behind the ears and an assuring \"back later\" has been a part of our daily routine since I brought him home. A dog's emotions aren't unlike a human's, in my experience. I'd hate to imagine how he'd feel if I failed to do it.",
            "Absolutely and I love you!",
            "Of course. Leaving without saying bye is just rude.",
            "I tell them in a cheery tone that I’m never coming back",
            "No. Talking to them caused their anxiety to get totally overblown. They seem to think i'm saying \"GOOD BYE FOR EVER I HATE YOU AND YOURE GOING TO STAAAAAARVE\"  \n\n\nSo, when i dont say anything, they seem to do much better. And then once I mostly ignored them until being home for about 5 minutes, they jumpy-bouncy/barky bullshit stopped too.   \n\n\nNow i've got dogs i dont hate. Which is nice.",
            "OP already knew the answer and just wanted to smile at the replies :)",
            "Yes, I especially tell them before I go to work that I need to make money to spoil them.",
            "EVERY TIME! ❤🐶",
            "Yes.",
            "Ummmm, yes. Obviously",
            "Yes",
            "Yes I do",
            "I do when I’m going somewhere out of the ordinary (outside of the usual routine) where I’ll be gone for a good while.",
            "100%",
            "Of course! How would they know otherwise?",
            "Every time",
            "\"I'll be back after work, be a good girl\"",
            "Yas, always!",
            "yes",
            "It’s instinct XD",
            "I always tell them when I'm leaving, what I'm doing, and when I'll be back.",
            "Every time. Even if she understood me, she still wouldn't care.",
            "Yes everyday … I’ll be back babies",
            "Every day",
            "And to be good....",
            "Yes there was also a study that dogs can learn i dont know anymore how many words exactly but i think it was way above 50 words around 70 or even 80 words or so.",
            "100%.  I’ve been working from home the majority of the time we’ve had our cat so I always tell him I love him and I’ll be back in a few hours.",
            "Yup. Occasionally I forget, and feel bad that I didn't tell my kitties when to expect me home. Especially if I have a 24hr shift.",
            "Yes! I taught my dog two different goodbyes.\n\n“Just a sec” for when I was going to the other room and coming right back.\n\n“See ya later” for when I’d be gone for a longer time.",
            "Always, plus I let them know we will have dinner when I get home.",
            "Always. \"Be right back! See you later! Be good, don't destroy anything that's not yours!\"",
            "Every time. And a “love you, bye!”",
            "I am deeply suspicious of people who don’t greet their dog when it walks into the room.",
            "Yes! I try to always tell him what time he can expect me to be back at home. I leave cartoon on my tv, a  kiss on his forehead and, a wave. 🐶",
            "Of course!  And usually I'll tell the dog that she's in charge...this really makes the cats mad!",
            "Every. Single. Time. He just nods his head and goes to look for the remote.",
            "\"I'll be back soon, little babes!  Get some good sleep and I'll snug you when I get back\"  - Me, every time I leave the house.",
            "I feed them before I leave, so I'll pet each one a little bit. On my way out the door I'll say, \"Love you ladies!\" But tooo loud because it's early",
            "\"I'll be back later. Be a good boy! You are in charge of the house now. I love you\" then I proceed to grab and kiss my dog, and he acts like he hates it but he loves it. I see that tail wagging and that happy relaxed face. He is a teenager now turning 3 in valentines day.",
            "Yes. And I always leave one of them in charge. Usually the crabby orange cat. I trust her over the dogs to mess up the house.",
            "The answer for every pet owner who's not a monster is obviously a resounding yes.\n\n[This somewhat on-topic video](https://youtu.be/9QsPWitQovM) shows a scientist who's done research that proved that some dogs can actually sense when their owners are returning.",
            "Mine goes like this:\nPat-pats, hugs, I’ll be back soon, and someone gets nominated to be in charge for the day.",
            "When I was growing up, we had a cat and two parakeets. We would leave the parakeets in charge and tell them they could boss the cat around.",
            "Every time",
            "Of course. I even have a webcam so I can “talk” to them when I’m away from home.",
            "I tell them I love them and that mommy will miss them and be back later",
            "I always say \"Bye, have a good nap\" to my dog. He's completely deaf so sometimes I can come back without waking him up. Eventually he wakes up and I'm right there!",
            "If I don't my cat always looks at me like she might cry when I leave.",
            "Every single time I leave the apartment. \nTrash run? “Be right back!” \nWorkday: “Be back tonight, be good!”\nCoffee break: “See you soon!”\n\nAll in the best upbeat voice and I always say I’ll miss them as they watch me leave. \nDoesn’t matter to me if they don’t understand, I understand.",
            "Oh yeah, I tell my little buddy that I'll be back as soon as I can, and ask him to take care of the fort for me. Every single time. Even if I'll only be gone less than an hour. I realize it's mostly for me. But I love the looks he gives me every time.",
            "I sorted these comments by controversial expecting to be upset, every one was a wholesome yes and it warms my heart \n\nI tell mine about 4 times that “don’t worry, I’ll be back soon!” Then give them a forehead or snout kiss",
            "\"Bye bye babies ill be home soon, miss you, have a nice day\"",
            "Yes. I sometimes leave David Teie cat music playing for them on a old phone.",
            "Yup. I even do that \"be right back\" gesture if I'm just stepping out the room to get something. I just don't like leaving my house without saying something like \"hey y'all, I'll be back later, try not to kill each other, love ya\". I like to return home later and greet them. Sometimes they greet me back.",
            "I tell my cat that she's in charge of security while I'm gone. I haven't been robbed yet, so I assume that she's ferocious to anyone who attempts.",
            "Always. And I love them. And to be good (but they’re always good).",
            "Every day. And I blow kisses."
        ]
    },
    {
        "post_id": "gjqcou",
        "author": "Cartoons4adults",
        "title": "Anybody else feel super cringey when taking selfies and therefore take none?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/gjqcou/anybody_else_feel_super_cringey_when_taking/",
        "score": 49079,
        "num_comments": 2061,
        "created_utc": 1589475844.0,
        "selftext": "I don't know what it is, but even when I have tried taking a selfie by myself, completely alone, I feel so cringe. I couldn't imagine taking a selfie with other people around. What kind of mindset are people putting themselves in when they take selfies?",
        "permalink": "/r/NoStupidQuestions/comments/gjqcou/anybody_else_feel_super_cringey_when_taking/",
        "comments": [
            "I feel too vain when I take selfies... then end up having like no pictures of myself for my mom",
            "Omg yes I'm the same",
            "I always try to hide that I'm doing it, if I do it at all haha",
            "I have 0 selfies.",
            "All the time, I never see my pics and think,  \"hey I look good in this one.\" So I assume other people see me the same way and I don't care to have other people see my flawed face",
            "[deleted]",
            "I used to feel that way but then I saw people doing \"duck lips\" and I tried and each time I ended up laughing  , that ended up turning out to produce pictures of me happy and smiling and I started to enjoy seeing those moments.",
            "I typically hate selfies but started taking them here and there since the stay at home thing started. I take them when I actually look like crap, I take them when I think I look like crap and I take them when I think I'm having a good day. \n\nI erase 99% of them almost immediately. Some that I've kept are Myspace angled with makeup and smooth hair, some are in harsh light, some are after sweaty yard work.\n\nI still don't love pictures of myself but it's already been cool to see the changes in my hair - so much more gray- the stress in my face fluctuating, etc. Most of what's happened this year does not feel real but I will have these pictures to remind me I was in it and it changed me faster than anything in my history ever has.",
            "Yes literally I cannot do it it makes me feel sick. And when I need a photo of myself there are none!",
            "Snapping friend\n\n*friend sends selfie*\n\nMe:\n*snaps picture of shoes for the 741st time I’m a row*",
            "Yep, I once took a selfie in a festival, what a cringey moment it was.",
            "I am generally opposed to taking selfies for similar reasons. I feel super awkward and self-absorbed. \n\nBut one time I was having a bad day and my boyfriend sent me on an adventure. He told me to take the train to the beach and stop everywhere I wanted and do what I wanted. The only catch was I had to take selfies at every place and send them to him. I now have an amazing collection of photos from a whole day. I can see my mood lifting as the day progresses and I get to remember almost everything about it.\n\nI still only take photos without myself in them, but if you give yourself a goal or a purpose with it, like documenting your day, it doesn't feel as weird.",
            "I think is related to insecurity. This happen to me too, I'm unable to take a selfie around people, I can do it when I'm all alone, but I always end up covering a part of my face.",
            "Honestly every time I try and take a selfie it reminds me of all of the \"snapchat girls\" from my days in school. (The ones with the duck lips or the stupid tongue sticking out) and it makes me cringe so hard I just stop immediately.",
            "People love to hate on others taking selfies, especially if they’re having fun. \n\nI used to be ashamed of taking selfies, even in my own home, but I asked myself: why am I so ashamed? There’s absolutely nothing wrong with taking a photo of your face to share. Sure, there’s times and places for everything (please don’t stop in the middle of a huge group on the sidewalk and take a selfie when it’s super inconvenient to other people).\n\nThe girls doing the duck lips or silly faces? Nothing wrong with them. Let them do their own thing, it doesn’t impact you.\n\nEdit: okay I hate to be that person but thank you so much kind anonymous redditor! you’ve gifted me my first ever gold! please continue to spread the love! 💖 it touches my heart dearly that you’ve considered this comment enough to be gold worthy!",
            "Saaaame. I realised if you looked at my Instagram account, you'd only know it was me because my dog makes random appearances. I just don't like taking \"selfies\" and when I'm out with friends I'm enjoying the experience and don't want to pester them to take photos",
            "Yes. Or asking my husband or mom to take a picture of me in a cute out? Pffffft. Nope. I try to do cute poses? Que just being so dang embarrassed!!",
            "Think about this. A lot of us live away from our families, and selfies is a way to keep far away family members up to date, ya know?\n\nAlso, memories. One day, we won't be around anymore. If you never have pictures of yourself, what are your children or remaining family members going to hang on their wall for rememberance? \n\nNot ever taking any pictures at all is, in and of itself, a somewhat selfish act. My wife never let's me take her picture, and it drives me crazy.\n\nNot all selfies are cringe, nor is the mere act of taking one. If your taking pictures of yourself 10 times a day, yeah, you're overdoing it. But here and there? Nah. There's good reason to take selfies.\n\nLet's not forget the historical selfies, which required people to stand still for hours while they were painted. What sounds more cringe and narcissistic? A quick snap of a picture, or investing hours in a portrait you will hang up in the public lobby of a huge mansion for servants to goggle as they slave away for you?",
            "honestly i think y’all care way too much about what other people think! who cares if they see you taking a selfie! you’ll most likely never see them again in your life! not to mention, in this day and age taking a selfie is so normal. i highly doubt anyone would think anything of it, especially at an event or whatnot.",
            "I've often wondered how other people manage to look natural in their selfies, or in any pictures? I cramp up in some sort of insane facial rictus in the presence of cameras. I speculate that it has something to do with face awareness. \n\nIt doesn't matter what kind of face I try to make for the camera, it always looks unnatural and forced, other people can pull off perfect imitations of expressions to suit the picture, I always look the same. :(",
            "I've never been in a place that interested me so much I wanted a picture of it, where I thought \"Hey, nobody will believe I'm here so I better insert my face into this picture.\"",
            "I wish I didn't feel that way about pictures in general. I have hardly any photos of my family because they all feel that way.",
            "I am working towards one of those “Selfie Everyday” videos and have been taking one a day since Christmas 2017. Still feel weird doing it and only do it alone or with good friends who know about it in the background.",
            "So here is what I do: I take selfies, and in my head they are ironic and I can post them with self-aware captions. Secretly I just like the way I look and want people to see for self esteem reasons",
            ">What kind of mindset are people putting themselves in when they take selfies?\n\nIf you cringe during a selfie, it's because you feel insecure. The key to feeling okay taking a selfie is to give zero fucks about what other people think. If you like your #ootd, take that selfie and give zero fucks. Post that shit and let the likes roll in.",
            "And then when you get on a daring app with like 2 selfies you happen to take at some point in your life you barely match with anyone because who matches with weirdos that have 2 okay pics and the rest are just memes.... *sigh*",
            "Oh yeah, hate it. \n\nBut keep taking them.  You'll get better, and you'll learn to like your face more.",
            "I don’t take selfies of just me. With my wife on vacation or a friend I haven’t seen in a while, sure thing. Just me? Hell no. Only exception is sometimes my wife asks for a picture immediately after I get a haircut. And sometimes I find a funny hat.",
            "Same. I almost never take selfies and whenever i see someone taking one in a public place i immediately feel embarrassed for them and turn away as fast as i can as if they were naked?",
            "I think I just look like shit Niall of them so why bother",
            "Im really insecure about the way I look. So I deny if that circumstance ever comes",
            "same. I dont mind selfies so much if Im out doing something I want to remember but 95% of the time it just makes me feel super awkward. Smiling or even looking interested at an inanimate object feels off to me. It makes online dating a bit much since people always start asking for more photos than what you have already posted. \nI think part of it is because I feel like the whole act is kind of self absorbed. Have you ever watched someone take and retake selfies? Theres some serious second hand cringe there.",
            "Yep. Or I look in the mirror and I'm like \"oo I look good today\" .. I turn on my camera and I look like a baboon.. what the.. 😂",
            "No because I’m not a people pleaser, who cares what other people think. I take them because I want to and that’s how you should live. If someone thinks it’s cringey? Fuck em. 😊🖕",
            "Absolutely not. I feel great taking selfies. There are actually some people that like how you look and want to see you.",
            "\"Am I obsessed with myself? God this makes me a narcissist.\" *turns camera around*",
            "A lot of people in here are saying they are embarrassed every time they do it. I felt the same when selfie was more of a buzz word, but there is no reason to feel bad for taking a picture. As long as you arnt being obnoxious or doing it at an inappropriate time - there is no need for feeling bad about taking a photo of yourself. You and the people around you might want some in the future.",
            "I’m 44 and have had a camera of some sort since I was 5 or 6.  I have probably taken 30 total, mostly in the last 12 years, and almost entirely with someone else.  \n\nI have a really nice one with my wife from 6 years ago that cropped well for the company directory, and one two winters ago with the family, and on winter ago with a bunch of friends for new year’s.\n\nHalf of the ones that are just me are a reply to someone else, and I’ll make a really messed up face.",
            "I have 1 or 2 to ask an opinion of a jacket I bought or something. That's it, hate em. I cringe super hard when I see folk take them too, dunno why",
            "That’s the way vanity is supposed to feel.",
            "Looking at myself in the mirror is bad enough",
            "i generally believe the best pictures taken from someone is when they don‘t even know they‘re being photographed, since they can‘t „fake“ something. \n\nwhen taking a selfie you always try to strike a pose or get something in frame or whatever. to me they don‘t feel genuine and do not portray the people in them properly.",
            "My parents(mid 60s) take selfies with no problem. Even in big family gatherings. I was once asked to take a selfie during a family event and I said \" I don't know how to take selfie\". I am in my 20s btw",
            "My motivator is \"well I've put all this makeup on, wouldn't want pure powdered money to go to waste\"",
            "My daughter takes selfies a lot, when she lived at home she took selfies with the dog, all the time, even now when anyone picks up a phone to look at it, the dog jumps up beside them for a picture :)",
            "I hate it. I am that one girl friend who cringes when going out when all my friends start taking group selfie after selfie. And I hate filters.  I think its because when I see them online it feels so self-interested. They constantly check their social media for likes after posting. I guess I feel like I don’t need that sort of outside validation to feel good about myself? Idk. (I am married and they are all single...does that have something to do with it??) \n\nBut yes. Cringy.",
            "I wasn’t totally into selfies before, but I recently met a bunch of my friends after like 6 years, and they had all looked so different, I had to “record” it. So I started taking selfies with everyone. The more I did it, the more it got normalized in my head to the point where’s it no big deal any more. The “mindset” I’m in when taking a selfie is “let’s take a picture with this very close friend of mine so I can remember what he looks like later”.  \n  \nI’m still not totally into solo selfies though, those I find kinda pointless, unless it’s to specifically highlight that I was present somewhere.",
            "I only take selfies at the end (or turn-around point) of long, grueling hikes. 10 miles in, 2500' elevation change, and a pretty mountain in the background. \nI put on a big, happy smile for the camera so I can have a pretty picture to remind my future self what I have done. Then I look at the picture I just took and I look like I got hit by a bus, dumped into a ravine, and gnawed on by giant mosquitoes. Still keep the picture, just never show anyone.",
            "Yes. I used to feel insecure about it all the time. Then my husband started working for the army and he is gone away a lot.  To keep our relationship healthy I started to take selfies all the time and send them to him. Selfies with my dogs walking, selfies at lunch, selfies while cooking, selfies while watching tv, selfies while hanging out with friends, even ..... work out selfies :-O.  \nI find if your with people you know if you just yell out \"selfie!\" everyone jumps in the photo with you as well and it makes it more fun. \n\nLike with anything the more you do it the less cringey and insecure you will feel.",
            "I feel cringey if I get caught taking a selfie in front of other people/strangers",
            "I hate taking selfies and having my photo taken. It's a battle of never knowing what to do with my smile/face/hands/whatever.",
            "I don't like it either. What makes is worse is the auto flip thing. So even when I take a bit to line it up so I don't look awkward, the picture flips and it ends up looking awkward anyway.",
            "I look sheepish and awkward in my once every year selfie. Once I tried in public because the place was so beautiful, but whenever someone walked by I would put the camera down lol.\nI think people who take a lot of selfies AND POST THEM, simply can't get enough of themselves and/ or are sociable people who thrive in other's validation. Women especially, seem to feel obligated to comment on each other's selfies in an exaggerated, insincere manner like \"queen\", \"gorgeous\" etc. It makes me think they would like that type of comment, but I, a woman, not only find my own selfies cringe, but most of my friends' too. \nTo put yourself in the mood to take selfies, choose a day you feel well, and be on your own. There are some listicles and you tube videos on how to pose to minimize cringiness and unfortunate features. I want to get over it, but I don't think I will. You're definitely not alone.",
            "Honestly the way I get around that is getting to take the photos with other people. Everyone likes to be photographed but yeah it feels cringe and vain to take a photo of yourself. If you’re looking for any advise as to how to get over this, I try to take a photo of myself whenever I feel really happy and try to immortalize that feeling. I suffer from depression, but having those small glimmers to remind yourself of the moment is so nice and the more you do it, the less cringe it is and the more self confidence you build up ❤️",
            "Not cringy. I just always felt like it became a thing to do because everyone else was seemingly doing it, even though it's not really that deep or meaningful. I never took a selfie of myself until I went to Helsinki, Finland in January of this year, and even when I did for the first time, I thought to myself that it wasn't for someone else's entertainment, but more to reflect on my own enjoyment of the moment and the emotions I expressed in my eyes and face. Does that make sense? Why take a selfie for someone else whom you assume actually cares about your photo? There's no real point to it.",
            "The more you do it the more relaxed you feel doing it. There are groups all over sm to practice sharing your uncomfortable selfies until you get more relaxed about it. If it's something you actually want to do. Otherwise silly selfies are great.",
            "Yes!!! This is 100% me. I didn’t know other people felt the same way. I think it’s related to insecurity; I'm unable to take a selfie around people and I can barely even do it when I'm all alone. Whenever I need a photo of myself there are none! It’s really frustrating!",
            "I have never taken a selfie in my life. Closest I’ve come is photos of a tattoo I have, and a partial reflection in something I was cooking. I’d feel awkward as shit to see my fat features on record. Had a photographer at my wedding and had about 10 pics taken posed. The rest had to be candid or I’d get a hardcore flop sweat.",
            "Yes. It's the reason I never made an online dating profile",
            "Ugh me too. I can’t even take selfies that included others. Therefore....only one photo of me and my boyfriend of three years.\n\nThe cringe outweighs the desire for memories.",
            "I used to and I still do, but after breaking up with my long term best friend/girlfriend I realized that I had no pictures of myself to put up for online dating and that one day, my kids, me and whoever would have no reference of me from that period. That’s when I decided to start taking pictures more often.",
            "I do too. I think part of it is that someone decided to call it a \"selfie\" which is the cringiest part to me.",
            "I think it’s a healthy instinct to feel funny indulging in narcissism to the degree that we all do these days.",
            "I don’t take pictures of myself because I hate how I look. I also don’t have social media except this so there is no reason to take any I guess. I force myself and pretend there is nothing wrong if my girlfriend asks for a photo.",
            "I hate seeing my reflection, hence I dont take selfies",
            "Eh, I'm just ugly.",
            "I have 0 selfies in my phone.\n\nOn the other hand, I take plenty of selfies in other people's phones when I manage to snatch them for a while. I like the thought of them browsing through their gallery none the wiser, when suddenly they encounter a plethora of images of my ugly mug.",
            "The ones who post them on social media are narcissisty",
            "I went to the coffee shop yesterday I live in the Netherlands so they don't sell coffee there. This Asian guy with a mask stood there taking mad selfies alone with random people then left.",
            "I hate taking selfies. The only time I do is for special occasions or if I’m on a vacation because I want to share the memory. \n\nI used to be mesmerized looking through my parents old polaroids, or seeing them on display in the house. But I just can’t imagine being proud of my kids looking through a photo album of me making the same faces over and over again.",
            "I have zero picture of myself on my phone.",
            "love yourself and others around you, taking pictures does everyone a favor of memory.",
            "I feel like it began for me around the time that the whole culture that spawned the word \"selfie\" really came into existence. Before that it was just taking a picture of yourself, after that it's got all sorts of weird connotations of vanity and self-aggrandizement that didn't really come into play before.",
            "YES. \n\nMy Instagram and social media have very few selfies and they’re only on there because I felt they were “artistic” (I don’t mean facetune).",
            "I just think vanity is stupid. Like yeah take care of yourself and be proud of the way you look, but selfies starts to cross the line into self obsession. You find people’s insta pages and its 2,000 fucking selfies, stop analyzing yourself and putting a weird bastardized version of your life on display, just live your life.",
            "I have never understood selfies - especially multiples that are then shared on social media.  “Look at me! Look at me!”  WTF.",
            "I worked for a company that required taking 2 selfies a day with a clocking-in/out app. I didn’t stay much longer after that was implemented.",
            "I just feel like who gives a crap",
            "I have 146 selfies on my phones camera roll rn, but i only just got this phone, im sure the all time count is much higher. I just genuinely like how i look, and nobody else has any pictures of me since i dont have friends so i might as well be the one to do it. I only post some to my onlyfans and the rest are just for me because i like to look back",
            "Yes, i cringe watching my photos too. I used to cringe looking at the mirror not because of me being ugly, id consider myself kinda average but i just don’t like taking pictures.",
            "Nahh, y’all are just awkward",
            "so adults don’t use snapchat",
            "I feel cringey when I look in the mirror.",
            "don’t be hard on yourself. being cringy is ok sometimes,,you’ll grow up and realize you never took pics of yourself :// at least that’s how i felt. \n\nwho cares if it’s cringy? who cares if you do a duck face? everyone is so hard on themselves and social media isn’t helping anyone..do what you want to do to feel pretty or handsome!\n\nedit: to all the comments in this thread..take selfies! ugly selfies! pretty selfies! weird ones! it’s okay to love what you look like! do it for memories! do it for when you grow old and go “tf was i on while taking this” ! \nif you don’t want to that’s okay too! just love what you look like!!!! regardless of what the social norms for selfies are",
            "You have serious insecurities if you really think this",
            "not enough people......\n\"we photograph what we love\" some people love themselves way too much.",
            "Do you want to take selfies? It's not something you have to do...",
            "You mean you're not self centered? That's a good thing.",
            "Yes. All the yes yes.",
            "My husband does.",
            "I just feel ugly lol",
            "Same",
            "I only take selfies with my mom cuz she loves them but I hate it",
            "I feel the same but even if I take a good one and want to post it on ig I get super self conscious and end up not posting it",
            "YES",
            "I have never taken one and don’t plan on it",
            "Same friend. I feel lame af. You just gotta do it.",
            "Same",
            "I refuse to take selfies. I even hate looking into my camera to check my hair.",
            "When i was younger i did it all the time.. now i just feel stupid doing it lol also i hate pictures of myself",
            "100%",
            "My phone thinks its owner is my sister because she was always taking selfies on my phone. So when the photo album face recognition does an automated sort, the photos tagged as \"you\" and \"you and ...\" are always my sister. I think I can count the number of selfies I've taken on  one hand. I just don't like it.",
            "No",
            "nah. I go full duck face and own it.",
            "I feel cringey, yes. but even when it is time for a \"usie\" or a \"weie\" with my wife half the time I drop the dang phone and the other half I cover half the camera with my thumb.",
            "I almost feel to old to do selfies",
            "I have only a few but it’s always so weird. I don’t get all the girls who have a selfie in the middle of the city or at the train station.",
            "I'm the same! For one of my online classes I had to make videos of myself and jeez, that was awful",
            "I hate most photos with me on them, but when I do want a picture - I just ask someone to take it. Making photos of myself while filling half of the frame with my face just feels wrong.",
            "100% same!",
            "in fact, I don't think I have a single photo of myself on my phone at the moment.",
            "I hate selfies. Also I look horrible in all pictures.",
            "I only take selfies for very specific purposes like showing off my most recent costuming face/teeth prosthesis lol",
            "I feel cringey when I am being made to take a picture period, because I hate the way my face looks when I have to force a smile",
            "Almost all my pictures are memes for this exact reason.",
            "Haha yeah I feel weird about it too. Honestly, it's not like I even post it anywhere either....unless it's a dating app? But either way, I feel embarrassed taking pictures of myself and would be mortified if someone walked in on me taking a selfie lmao",
            "I have 0 idea how people looks so good in selfies, I look like an unwashed towel...",
            "I have no pictures for my dating profile. I hate taking selfies and they probably suck.\n\nAnybody else think its weird that some people take pictures of themselves all day?",
            "I used to take selfies once in awhile and post on Instagram semi often. Now I don’t care.",
            "I also don't take selfies. Partly because I find it cringey and partly because I look like shit in them. Usually the pictures of me I like are the ones others take without me knowing it. Unfortunately that doesn't happen too often so I rarely have current photos.",
            "I used to feel that was. Actually, I still do but I force myself to take selfies. Because one day I looked back at my high school pictures, there were hardly any. I have a lot of memes saved from those days but barely any of me, my friends, when we hung out. \n\nSo if you want pictures in 10-20 years of you to see what you looked like, your style, what you did, you'll have to take selfies. That also include when you're with friends, someone needs to pull out their phone and take a quick selfie of everyone.",
            "Its cringey af, but then I get sad bc I have literally zero pics of myself and my significant other so when we have kids we can't show them when we first got together and stuff",
            "Ah, I see you are a man of culture as well.\n\nBtw, I don't have a single photo of mine in my phone.",
            "I refuse to take selfies at all. They always highlight my natural curves in such away that I look 50lbs heavier than I am. For some reason it's like the picture of me is like taking a full screen image and making it widescreen without any editing. And no I'm not super skinny but I do only carry extra weight in my belly and therefore slightly in my waist. After never weighing over 130lbs until I hit my 20s its absolutely devastating to feel like I'm becoming such an unhealthy weight for me. Solution: dont take selfies because they lower my self esteem.",
            "I used to be the same, until I started making vlogs on my old PSP to describe my days in a new country, found those relics and thought to myself that selfies and videos were something that I could use to compare myself overtime. I decided to take more and more selfies and videos and just upload them on ain't and TikTok, I mean no one really sees them, it's just more of my lil own time capsule, but that's how I got over the cringe. And there was this youtube phase in my school way back when everyone wanted to be YouTubers so got on the back of that and posted videos to be on the trend:P they all suck but helped me greatly get through the cringe I used to have of hearing myself and seeing me",
            "I can only take selfies when I'm with other people.  Like a pic of me and my spouse in front of something cool or a big family gathering and they want me to take a selfie with everyone.  But I would never take one alone.",
            "No, My wife bought a selfie light and I downloaded image editing software so I can get those likes.",
            "Yeah, except I do take some but delete them all afterward.",
            "Yup . Fuck my face doesn't look good in any pics. Even when I think I'm having a good day, trying to take a picture just proves me wrong .",
            "That plus I take horrible selfies",
            "That's right. For me it's I'm afraid of looking bad even though I'm the only one who will ever see it. Luckily, if I'm in a group, I just go along with it by not looking at the picture.\n\nConsequently, I make a big deal about how to make a good Instagram picture, and I plan days ahead to get like half an hour to only take the repeated picture I want. It's a pain I feel obligated to",
            "I remember when I was in 6th grade I took so many selfies and posted them all on Instagram, it wasn’t till recently I remembered the existence of that Instagram account which I forgot about it for a few years, I immediately logged into that account and deleted everything. Wtf is wrong with 11 year old me.",
            "That's the same for me, but I think people who often take selfies just have more social confidence, I consider myself farely confident, but not enough to publicly tale selfies",
            "When i was a teenager i always thought selfies were stupid and narcissistic, and i always felt cringey trying to take a picture of myself. Now I’m in my 20s and i wish i had more pictures of me and my friends from highschool, so it made me want to take pictures more. I also got better looking so im less self conscious now.\n\nPlus, it’s fun to think that one day historians are gonna be looking through all our pictures. All the dickwads that i used to quietly judge all day in highschool have thousands of pictures of themselves, so now it’s my duty to take better pictures than them and leave a cooler mark on the world",
            "I just cant do it. I've tried and it feels awful. It doesnt help that its called a \"selfie\" either. Everything about it feels wrong.",
            "Yes! And I think it's because taking selfies and the word selfie has been made fun of so much",
            "Yup, the only time I've ever taken a selfie is when I got hit in the face with a puck playing hockey. It was pretty gnarly. Otherwise, I don't think my face is interesting enough to be worth taking pictures of.",
            "when i take selfies alone i do it because i think i look good, that’s my mindset. i can’t take selfies with other people around, though. i feel like they’re judging me and i get too embarrassed. if there are other people around i’ll ask them to take a photo for me instead.\n\ni’ve never felt cringey taking a selfie by myself unless i’m doing a ‘cringey’ pose like sticking my tongue out or duck face, but those are just for fun. if i’m just smiling like it’s a regular photo i don’t see why it would be cringe, it’s just a headshot of me, taken by me. sometimes they look nice, and you have much more control of how you and the photo looks than if someone else was taking your photo for you.",
            "I become extremely self conscious when taking selfies. Have less than 5 in total.",
            "My phone doesn't contain any photos of me. I don't get people who do. It does make it hard for when you want the photo for your dating profile because you realise you don't actually have any.\n\nAll the photos of me are on Facebook from my uni days, and I look blackout drunk in all of them. Or I'm dressed as a zombie or something, can use any of them.",
            "I do it extremely rarely, usually only if I make a change in my appearance or meet a musician I like",
            "It makes Tinder impossible lol",
            "When I was a teenager it was seen as narcissistic and sad to take pictures of just yourself. I never saw a huge problem with doing it for special occasions like if you want to show yourself at a landmark or if you’ve accomplished something that you want to show off.",
            "I used to never take selfies for that exact reason until I met my vain af girlfriend who will literally pull me to any reflective surface to take a ton of pictures.\nIn the beginning I found it quite cringe but honestly,nobody gives a fuck.\nWe’ll be sitting in front of a mirror for 20 minutes taking the weirdest pictures and people just go about their day.\nIt’s not cringe if you don’t make it cringy.\nIf you’re confident in your actions people don’t care.\nJust pull out your phone,snap a quick picture and mind your own business and people will do the same",
            "Yeah I hate them.  It wasn't an issue until my almost 4 year old daughter wanted to start taking pictures all the time.  I usually lean out of the frame.  I just hate selfies so much",
            "I've been told my whole life that I'm a good looking man and no...not by my mom lol. And even though attractive women are attracted to me, I completely hate to look at myself. Forget selfies, I'm simply unable to take one, can't stand them and perhaps it's because I can't stand myself. I hate how I look, I hate how I feel, I hate what I've become. I simply hate everything about myself and the fact that I cannot accept who I am. Talk about positivity. This little rant helps me in finally admitting this to myself",
            "Yeah",
            "Same dude. I always look like crap and it feels so weird.",
            "I love you so much for posting this same all day",
            "You’re not a narcissist! Congrats! Selfies, as even noted in their name, are incredibly vain.",
            "Look at it more as a self portrait.",
            "Bro. Yes. I have like 4",
            "100%. And if I’m at a place with a beautiful backdrop people would probably rather just see that than my face anyway",
            "Only ones I've taken I use as profile pictures on facebook. I update it about twice per decade.",
            "I can probably count on one hand the number of selfies I voluntarily took. Usually I have to be coerced into participating. The peer pressure is real, yo.",
            "I’m not a fan of selfies, it’s definitely cringe and I hate my photo taken.",
            "I don't really take selfies, but I understand the cringe part of them. I only take selfies when I have fantastic makeup on, but I don't post them.",
            "I barely take photos. Only really if I'm sending them to someone straight away because it's funny.  \nMost of the photos in my photos folder are things like model numbers of appliances I was fixing, Wifi codes, specials boards from pubs and accidental screenshots of my home screen",
            "If I take a selfie it’s with my daughter in my lap. There isn’t a picture in existence that I have taken of myself alone.",
            "I have hundreds of selfies. I post none and show none. They are for me and my memories.\n\nDisclaimer: I don’t give a shit what people think of me.",
            "I only take selfies when I’m snuggling with one of my cats or when I’m having a good time with friends. That’s it.",
            "I take ironic selfies, which just means i take one with the stupidest face possible just in the hopes that someone thinks I’m an idiot enough to laugh, but real selfies? Too embarrassing man.",
            "Always ;-;",
            "Yep. But I like to think I'm freezing this moment of myself to look back on later.",
            "The only time I take selfies is when it's like a family selfie. I might be narcissistic, but I've always found selfies incredibly idiotic",
            "I've never taken a selfie of just myself because I find it to be insufferable when shared broadly. I have taken them with my wife and friends, though, and do not have the same feeling about that.",
            "I do usually take selfies when on snapchat to send to people but not just to save. I do have a couple here and there but I do cringe when I see them. Not becausr I dont like the way I look but just seeing myself is weird.",
            "Yes. I hate selfies and I never take them. The only time I do is when I’m somewhere worthwhile (Yellowstone, Grand Teton, stuff like that) because if looking through old family albums means anything, no one wants to look at the pictures with no people in it.",
            "YES I hate it",
            "Me all the time. I travel a lot and people never understand why I don’t have more photos of myself lmao",
            "I used to feel this way completely  but I started trying to take selfies to improve my body image and self-confidence and while I almost never post my selfies this has helped me love my self better personally.",
            "Yes I have zero photos of myself because I hate the feeling of taking selfies",
            "I don't take selfies but that's just because I'm ugly",
            "I've never taken a selfie. I'm a middle-aged dude though.",
            "I don't like my smile, so less cringe and more self-loathing.",
            "Yup. Facetime is an absolute nightmare for me, too. Which really sucks during the quarantine and my mom wanting to Facetime all the time to talk to her grandson.",
            "i’ve taken like 2 selfies in my life and i hate it...",
            "YUP.",
            "I don't like taking pictures or being in them.",
            "I have literally never related to a question on this subreddit more",
            "I rarely take pictures without a purpose. Pictures of the cat probably being the only exception. If I need help identifying and item, or to comunicate something to someone, or to help me remember details for work like sn or configuration of plumbing or electrical. If I'm at the zoo or hiking and see something cool I'll record it. Sometimes I'll send close friends pictures of me that are selfies as jokes or for specific reasons. I don't post a lot of personal stuff to social media.",
            "The only time I take them is when I go on holiday alone...just so I can prove I was there.\n\nStill hate taking them though.\n\nI always think the person holding the camera on group selfies looks like a tosser.",
            "Id much rather have someone take a picture of me, or at least prop it somewhere and use the timer.",
            "It's just one of those things you gotta get over. Do it a few times until you realize literally nobody gives a shit about you.\n\nWhat do you think when you see a girl taking a selfie in Starbucks? Literally nothing, maybe a small passing thought about how silly she looks and then you go about your day. That will be the extent of everyone else's thoughts too.\n\nIt's like doing ANYTHING in public: Wearing that silly outfit, singing on the sidewalk, practicing a dance move here and there. It might be a fleeting thought on someone's mind but they don't give a FUCK about you, man. Don't feel bad, you're the only person judging you.",
            "Every time I do try to take a selfie that's not a \"joke\" one, I feel fake and awful. \"Look at you, trying desperately to look sexy. It's embarrassing, stop trying. Oh my god, this is so cringy. You don't look like this. Stop trying so hard, this is a little pathetic. Jesus, you actually think this looks good? So much for casual. You're not even decent enough to be so vain, this is hard to watch. You think someone like you can do this? And here I thought you were above such things. It's like a toddler trying on lipstick, except you're just creeping me out as much as you make me laugh. Just put your phone down and try to forget it.\"\n\nBecause of that, I try really hard to go through with it when I want to take a selfie. My self esteem needs to be better, and I need to push through the barrier of bitter and jealous judgement that puts everything down in an attempt to pull itself up. It's not cringy, and if I follow through with logically knowing that, maybe one day I'll feel confident enough to feel it.\n\nThat's also why I stopped taking joke photos of myself with double chins and stuff. It's easy to do a \"haha I'm not serious I'm way above all this\", but it's a poor substitute for actual confidence and hiding under a mask of \"couldn't care less\" \"irony\" doesn't help when it's built on a lie. Even if my photos don't look good, they're a genuine attempt to, they're making myself vulnerable to legitimate criticism from myself and others and showing me trying, and that's worthy of praise, not scorn.\n\nYou're not alone.",
            "i never take selfies and I don't let other people take photos of me. If I was ever to become a missing person, they'd probably have to manipulate my high school photo to make it match my current age.",
            "I know what you mean, I do sometimes take them to check how my hair or outfit looks but never to post on social media. It’s not the taking of them but the posting of them. Someone I know posts loads and they are so touched up it looks like someone else, her followers are mainly friends irl so i find this kind of pointless - we know you don’t look like that!",
            "I guess I do this when traveling alone but I always make the same face and cut half my face out.",
            "Personally I don't like people in any of my pictures so I have no interest in taking selfies and will also wait for quite a while for people to clear out of my shot...just something about the human form seems to impede the image I'm trying to capture.",
            "The only time I'll ever take a selfie is if it's with other people (which is more like a groupie lol). It's the only way I can get photos of my friends and I, since I'm the designated photo taker most of the time 😅",
            "[deleted]",
            "I've never taken a selfie before and don't ever plan to. I'm obese and have no one to send pictures to anyway.",
            "Have some sort of prop.  Maybe its a drink or food item you just bought.  Maybe its a cool sign or art or something.  And then try to tak e a picture of you and said prop.  It always helps trick my mind because its less \"hey i'm taking a selfie\" and more \"hey i'm taking a picture of this cool thing with me in it\".  Also helps with the \"not photogenic\" feeling i'm seeing a lot of in the comments (which I also suffer from a lot) since the focus of the picture isn't just on you.",
            "I relate to this on a spiritual level.",
            "I studied abroad a few years ago and have basically no pictures of myself there because of this. I kind of regret not getting over it for a few seconds here and there.",
            "Yes.  I think it’s because while everyone else was growing up and living with phones, I never had anything like one.  When I finally got a phone I was in 8th grade, and the camera quality wasn’t high enough for me to really even take pictures.  I only got a good quality phone last year.  I now feel no need to take selfies.  The only reason that I can think up to take some is so that future me can look back on what I looked like.",
            "I’m just fat and don’t like to remind myself of that fact, so hard pass on selfies",
            "You are my kind!",
            "Yup. My friends have told me that it's all about finding the right angle. Well so far I haven't been able to find one that doesn't make me look like a hagraven or Admiral Ackbar's sister. There's no in between.",
            "The one and only time I took a selfie was when stuck in an elevator in Paris with eight other study abroad students"
        ]
    },
    {
        "post_id": "gi0ye8",
        "author": "luckytj521292",
        "title": "Am I the only one that thinks novels should have a page near the back that lists all the main characters and a brief synopsis so that i am not constantly flipping through pages to figure out who someone is?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/gi0ye8/am_i_the_only_one_that_thinks_novels_should_have/",
        "score": 49040,
        "num_comments": 2009,
        "created_utc": 1589246049.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/gi0ye8/am_i_the_only_one_that_thinks_novels_should_have/",
        "comments": [
            "You'll occasionally see some novels that do this, or something similar to it. I remember in my copy of *War and Peace* there was a chart that named all the major characters and their familial relation to one another.",
            "For this reason, I appreciate books that have maps.",
            "I remember the Warriors series had a big list at the beginning of each book of all the cats' names, their clan, their job, and a description. Great little books.",
            "The Wheel of Time series has a glossary at the end of every book. Characters, places, concepts, organizations, etc. They all get a blurb. Always loved that.",
            "Most novels don' have a complicated enough roster of characters to demand it. The books that tend to need these also tend to do this.",
            "I often source a reference guide. In particular 100 years of solitude by Gabriel Garcia Marquez and the possessed by dostoevsky come to mind. No shame in using resources. Hut make sure that the ambiguity isnt part of the novel or that you are leading into spoilers that would ruin immersion.",
            "I found it funny how a song of Ice and fire did this but it was such a long glossary of characters it was almost useless cause it was easier to look it up online then to look through 30 pages of character family trees to find the one dude you needed.",
            "I used to get a lot of old paperbacks from the 1950's.  Very often they had a cast of characters in front.",
            "I don't use it often, but Kindle books have this. Just click on the name and it'll describe the character and let's you skip to each page where that character is mentioned.",
            "This is a pretty neat feature in manga. At the start of every volume, they list all the important characters along with little bios reminding you who they are. Super helpful if it's been a while since you read the last volume. \n\nSomeone also pointed out Warriors! I can't say I remember referencing it very often, but there was a list of every cat in the beginning of book, grouped by which clan they were in. \n\nI think book series could definitely benefit from this.... there's been times where I've forgotten who minor characters are midway through a longer book, but I've kinda just powered through and hoped I'd get enough context clues to figure it out.",
            "Have you read \"One Hundred Years of Solitude\"? It even has a family tree.",
            "https://en.wikipedia.org/wiki/Dramatis_personae",
            "Can be a bit tricky without spoiling it. I've been using this concept for TV series that I find difficult to understand and go to their Wikia pages. Occasionally it has, however, spoilt it for me by telling me who has died already etc.",
            "A lot of Star Wars books I've read have this and I adore it lol",
            "99% of Fantasy titles already do this... What I want more novels to do is summerise the previous book in the series so you can jump right into the sequel, even if it's been a while.",
            "I told one of my favourite authors that he should consider putting an appendix or a chart about various characters so that readers can pick up easily after being away from book for some time. He replies that since he wrote every character, he doesn't need them. Duh.",
            "Some of the Russian classics do this. You get used to all the characters having 3 different names eventually, but it’s really helpful in the beginning. I’ve not found it necessary in other novels tbh.",
            "John Birmingham's novels have a dramatis personae list. But then again he always has a penchant for making his nonsense stories sound important and dramatic. So a dramatis personae looks good to him I think",
            "Ah you’re reading “The Count of Monte Cristo” I see.",
            "That would be great, except when there are lots and lots of characters.... and events... and languages. \nI'm looking at you The Silmarillion.",
            "Perhaps you could take notes.",
            "Most stories don't really need one as you'll end up knowing them anyway.If a writer does know that their book will be confusing like Lord of the Rings and Dune perhaps they'll make an effort to put in footnotes or introduce them properly",
            "Try reading a book on a kindle. When you highlight a name it pops up a synopsis of that character.",
            "How big a spoiler should the synopsis contain?",
            "Some do. Agatha Christie is a notable one who has a character list at the beginning of every book.",
            "/r/doesanybodyelse",
            "Warrior Cats has this. At least in the first books I read, I don’t know about the later ones.\n\nThey have the names, a short description of their appearance and their rank. There’s also usually a map that shows the different territories",
            "Been reading The Silmarillion, have you?",
            "My sister creates her own for every book she reads. It's not usually necessary for me, but I'll do it every once in a while.",
            "You could just read the book",
            "Isn't that just what reading the book is for?",
            "That might just be a part of the fun",
            "As a recovering English major, grab a lit crit guide. Even Cliff's Notes is great.",
            "It's not available on every book but Kindle has a feature where if you highlight a characters name it will pull info down from Shelfari and give you a brief synopsis of the character. Was recently reading The Stand, which is long and frequently had characters disappear for long stretched and had other one off characters that didn't appear for a while. In the early sections of the book It was hard to know which characters would be important so this feature made it easier to reference.",
            "Some novels really need this.\n\nRecently novel I read suddenly introduced like a dozen background characters with similar roles. It did not stop there. The author then proceeded to refer them by 1. Their first name. 2. Their last name. 3. Their goddamn title, and finally, 4. Their goddamn *\"slang\"* title.\n\nThe funny thing is, they actually did what you describe (list of characters section) and it was still nowhere near enough because it was just too much effort to constantly check each character. \n\nI decided to just not give a shit who each of them was.",
            "Yeah absolutely. I'm watching game of thrones for the first time and all I keep thinking is there's no way I could read these books. Anytime they mention someone, 50% of the time I'm like I have no idea who that is. And I'm watching the show. Putting faces to names. I couldn't imagine trying to remember them without faces.",
            "Warhammer 40k novels e.g. Horus Heresy often do this, lots of characters to keep track of.",
            "This is why I couldn't finish Crime and Punishment. Lots of names is one thing, but lots of foreign names is much more difficult. After taking notes on who the characters were on paper I finally decided that I wasn't enjoying it due to the work involved and gave up on it.",
            "I'm wondering what types of novels you typically read, because as noted, many sci-fi and fantasy novels already do this. In fact, this post caused me to think about it and realize I sort of internally already thought of it as a sci-fi/fantasy-only thing.",
            "Frankly if the book leaves you confused about who is who it's not written well.",
            "There aren't many books that have the amount of characters that would require this for most people.  \n\nA Song of Ice and Fire comes to mind as a series that could benefit from it.",
            "If you can't follow the characters in a book you're reading above your level most likely. However, you can easily google as cast list and have it on your phone.",
            "You’re the only one.",
            "Not really, you're supposed to pay attention.",
            "If you're confused by the books you're reading, they're either poorly-written or you need to work on your reading comprehension.",
            "That sounds childish as fuck.",
            "The Wheel of Time series has a pretty decent index in the back of each book.",
            "Stephen King did this for a few books. Under the Dome had a huge character list up front. It was a bit daunting actually",
            "Like the *dramatis personae* from Shakespeare plays. That’s honestly a great idea.",
            "Or a family tree",
            "I'm currently reading a book which describes all the characters right in the beginning. It's so easy to go to the first page and check out about any character when you're lost.",
            "The enhanced ebook of A Game of Thrones is formatted this way, I read read it on my 300 year old Kindle. \n\nThe majority of characters have a index record that gives a brief description of their significance. The name was hyperlinked so you could do a quick refresher and keep going with your reading. I want to say there were other features/extras but I can’t recall.\n\nIf there was any literary world that needed this, it was ASOIAF. Wish they had done the whole series in this format.",
            "But some novels don't even have that much character to remember in the first place.",
            "There used to be a thing like that at the start of some stories. It had some Latin name like 'Dramatis Personae'.",
            "Use a scrap of paper as a bookmark and write down each character with a brief description/bio on it as you encounter them. The act of writing it will help you stick it in your memory, as well as give you a comprehensive guide of characters in order of how they're introduced. Also, using sticky notes to highlight important passages, foreshadowing, etc., can give you further insight to the story.",
            "Wheel of Time has this!",
            "This could potentially spoil the story, especially if it's a mystery",
            "Check out the Worldwar books by Harry Turtledove. They have this exact thing at the front of the books.",
            "One of the reasons I love the kindle is because in most e-books you can highlight a character's name and find out who they are",
            "That is a VERY good idea.",
            "A teacher told me that everytime she finishes a book, she writes a summary on a piece of paper with other informations about the story and keep it inside the book. Maybe you should do it by yourself.\nI always told myself I would do it. I used to read a lot but once I finish the book, it is impossible for me to remember what I read.",
            "One problem I have with these lists is that they can spoil who a character really is when they have a dual identity. I'm pretty picky with spoilers though and even tend to avoid the blurb before reading so that everything is a surprise.\n\nI do find these lists useful however, especially books/series with a large roster such as Wheel of Time.\n\nI guess what I'm saying is I'm on the fence.",
            ".... If you read the book in order that shouldn't happen...",
            "I feel like I will be downvoted to hell for this on here but it is one thing I love about my e-reader. I can click on any name and have their summary up and the pages they have been on.",
            "The appendices at the end of the Lord of the rings and the silmarillion have a complete history of middle Earth and every major family line in it, as well as a description of every character and place",
            "You should pay attention when reading.",
            "I would love a \"previously in our story\" on sequel books that I have to wait months or years for. I'll quit a series before I have to start taking my own notes, that's just not relaxing to me.",
            "Usually drama pieces have those at the beginning of every act with a little description of the character, this would be really handy for every book. I once had a murder mystery book and it had a little animated photo with the character and its description, really cool",
            "Fantasy light novels (mainly isekai / another world) typically have character descriptions and maps at the beginning of each volume. Most official translations also include them.",
            "I don’t read much, but I wish my wife did this with her friends at work so I knew who she was talking about for the past nine weeks.",
            "I know a lot of your epic sci-fi/fantasy books have it (Think the Dune series by Frank Herbert and Wheel of Time by Robert Jordan)\n\nBut yes it would be nice for other books to have it as well, cause I have a tendency to set a book down for a week or 2 before I get back to it.",
            "I think Eragon does this iirc",
            "The Game of Thrones series has this",
            "Makes it easier for some novels, esp when reading Tolstoy, dostoevsky,  rand, hugo...",
            "My favorite book has like 20 characters and the whole story is narrated by one of these character, one at a time. You have a little sigil when the narrator switches, each character having his own sigil that is presented at the start of the book.\nI have already read it like 5 times and I still have to constantly flip back to the beginning to know who is actually narrating",
            "Hear me out. If you struggle with this generally, or if you've found a book that isn't doing you any favors, you could/should just take your own personal notes. If you are reading and find yourself asking who so and so is for more than like 5 seconds, just jot it down on some paper. You'll often find that just the act of writing the note was enough to make you remember it for next time, but if not, well you'll have your notes.\n\nNo need for the authors to write character lists and synopsis notes for their own books, unless of course they actually want to (looking directly at Tolkien...)",
            "Fantasy books often still do have a dramatis personae",
            "If a novel needs such a page to be well understood, it's either poorly written or you're a poor reader.",
            "Try an ebook reader, you just long tap a name and you get a popup with brief synopsis",
            "As a librarian, I wholeheartedly agree with this. It's a lot to keep track, especially with multiple series by the same author and everything is so similar to each other.",
            "Plays and some other notable books include a dramatis personae at the front so you know who the main players are.",
            "This is one of the reasons I've begun switching to ebooks. A lot of them have the ability to highlight names and it'll show you previous excerpts where they were mentioned.",
            "I have ADHD and I’m constantly confused while reading. All books should have that both physical and digital.",
            "Game of thrones appreciates you",
            "Some Shakespearian works have them.",
            "I read this as Walter from The Big Lebowski cocking a gun and shouting in a library in frustration",
            "What an amazing idea!",
            "Omg that would help me read a book so much better!",
            "No",
            "Just take notes you lazy shit",
            "What kind of novels are people reading that they have problems remembering all the characters? Didn't think this would have so many upvotes",
            "Yes, and a drawing, so I can associate the character with an image and stop getting them confused",
            "I sure could've used this the many times I read the Lord of the Rings books.  So many places/names/people to remember.  Some of them have two names.",
            "I remember Murder on the Orient Express had this",
            "It's called a Dramatis Personae",
            "I'm okay with novels, but I have this huge problem with movies. I could go the entire movie without knowing who anyone is, and i just never remember after",
            "Just read the book",
            "The Song of Ice and Fire (Game of Thrones) books have these, and by book 3 or 4 it's pretty meaty. It actually screwed me over once, I was on a 5 hour red eye flight and was nearing the end of one of those books, I figured by the time I finish the book, a few chapters left, I would be tired enough to sleep for the rest of the flight. Read 2 pages then the book was over, the remaining like 20 pages was just a character guide.",
            "That’s such a good idea, I’m gonna put it in mine",
            "Never thought about it, but damn, that’s a great idea. Could‘ve used that with those atom Clancy books I read.",
            "I honestly think it has a lot to do with the maturity of the writer.\n\nI suck at names in general IRL and otherwise. The writers that do it best for me don't even need names. Good character development should create the cast and your mind calls it what it wants. \n\nI hear you though. There are books with #Gigantic casts (Dostoyevsky holler).\n\nI recommend *The New York Trilogy* for an interesting post-modern work. Names and people may or may not even exist in the cast. I love it. Quick Pulp style reading.\n\nI like your character index idea tho. :) Cheers!",
            "Omg yes!!! This would be so helpful",
            "That’s one of the main reasons I can’t read fantasy novels. I can’t retain odd names/locations. For example “John went to NYC” I can remember that but “Glibutton shuttled via skydemo Zebby to the shire of Fuzdeaxob” hey I forget that in 2 seconds"
        ]
    },
    {
        "post_id": "urzpqr",
        "author": "Jeeperscrow123",
        "title": "Do any of you ever google a question and add “reddit” after the question because surprisingly reddit will get you straight to the answer rather than having to go through an annoying spammy website?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/urzpqr/do_any_of_you_ever_google_a_question_and_add/",
        "score": 48148,
        "num_comments": 2403,
        "created_utc": 1652831234.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/urzpqr/do_any_of_you_ever_google_a_question_and_add/",
        "comments": [
            "Reddit's search function is so crappy that this is literally the only way I search Reddit.\n\nBut yeah I do it for a lot of other stuff as well. For instance, today I searched for \"black vinegar\", and then immediately followed up with \"black vinegar Reddit\".",
            "Only always, I don't wanna read a 30 minute article to find my answer buried in a sentence 6 paragraphs in.",
            "I should start doing that because more often than not Google points me to Quora, and Quora users love to write a fucking book about everything and take forever to get to the point.\n\n“Why do people hate country music?”\n\n“Well you see back in the early Renaissance era if we look at the culture of Venice, Italy…”",
            "[deleted]",
            "Yes all the time. Like it seems helpful watching an argument on the issue so I can see all sides of what I'm googling instead of just the first 4 promoted websites",
            "Google has a functional searchbar and lousy content.\n\nReddit has useful content and a lousy searchbar.\n\nIt's a beautiful bit of cyber symbiosis.",
            "[deleted]",
            "Try adding \"site:reddit.com\" at the end. Works better.\n\nAlso if you wanna get rid of results from a specific website, add a hyphen before it: \"-site:forbes.com\"",
            "If not every time, for sure when Google doesn't get me the answer right way.",
            "Questions for video game stuff for sure",
            "All the time. Especially for my job in IT troubleshooting people’s issues. Every IT related article is just trying to sell you some software that claims to magically fix the problem.",
            "Yup. It's like getting someone to Google something for you. I could do the research on my own... but, nah.",
            "Some slimy corporations are starting to write the same articles you'd normally see on those spammy websites as a text post in their own Reddit profile. So even if you were to add \"site:reddit.com\", you might end up on some asshole's text post on their profile with a long ass essay that you'll need to read through.\n\nReddit introducing the ability to post on your own profile was a fucking mistake. It'll come bite us in the ass in a few years.",
            "When I Google a question, Reddit is in the top 5 results.",
            "Quite often. I wish more people would do this before posting questions on Reddit that have already been answered.",
            "[deleted]",
            "Always, more times than I'd like to admit.",
            "No. I only do that to find a post I didn’t save because searching through Reddit is about as effective as [enter your better joke here]",
            "All the time.",
            "Yes because I get many opinions rather than one rando who wrote a shit article littered with ads",
            "Best way to avoid Amazon affiliated product recommendation sites",
            "I do this because I want the advice of an actual human being and not some writer who doesn’t have the same problem I have, has generic solutions that aren’t even a solution to the problem, or goes on massively unrelated tangents. It is an infinitely better result to come from some random Joe who had a similar issue or the same issue years and years ago with 50+ comments of potential solutions by other real people than some corporate jargon",
            "yeah coz reddit is a big ol forum style webhost. Now that its in the mainstream, with msm and big sites supporting supporting traffic to reddit its easy. \n\nBefore reddit, you could still get forum posts, and question answering sites to hit front page results via google. Now that the work on corporate internet is well underway, small forum style sites that used to have all the answers, are now just basically yahoo, quora and reddit. Small forums no longer get priority on google specifically, because google is an ad company, their search is mainly ads.",
            "Google is so full of b.s. marketing blogs, when I want real product reviews and insights from loving nerds, yes, searching Google with \"reddit\" is the only way I can find helpful text information as a consumer! I highly recommend it.",
            "No.  \n\nReddit doesn't generally provide the right answer, only the popular one.\n\nGenerally speaking, if you browse a topic for which you are intimately familiar with, it's pretty apparent how bad the answers are... if they are that bad for topics you are an expert in, they are almost certainly just as bad in topics you are unfamiliar with, and looking for answers for.",
            "i do it a little too much, if i have a thought and wonder about it i quickly just google and add reddit at the end",
            "yes and usually i find the answer",
            "All the time",
            "The search bar in Reddit works like the video player in Reddit: it doesn’t.",
            "I do this, although it really annoys me how it tries to force you to use the app in order to read anything if you're not on PC",
            "All the fucking time bro. Literally everyday.",
            "I would use Quora or Reddit but Quora being the fucknuts that they are decided to remove the question texts from all their questions\n\nHave question\n\n* Search\n* See Question title from Quora on google\n* Click on question\n* Answers\n* But with no context to the question how can I compare\n\nWhich idiot at Quora thought it was a good idea to do that",
            "In a rush yes. But I'd rather do it the proper Google way. (site:www.reddit.com/r/subreddit) query text here\n\nAdding a subreddit is optional but if you remove it it will broaden the search to the whole site.",
            "All. The. Time. \nOr when I look up something on YouTube I go straight to the comments  \nEx: 5 things you should know about X\nVideo length: 30 min\nComments: save you some time. Here’s 1. 2. 3. 4. 5.",
            "I will now. Thats a great idea",
            "How do you think I got here?",
            "All the time. I put too much faith in you assholes",
            "Yes. Because the internet sucks now. Partially due to Google liking money. Partially due to society's own willingness towards censorship.",
            "No but I will now.",
            "Yep! Its funny how people on a particular sub reddit can offer more insight that someone who wrote an article about a topic they loosely understand on a surface level. A lot of those online articles read like school research papers, a lot of filler to get to the point. Its like those recipes where the detailed instructions are 5 paragraphs but the first 3/5 paragraphs are them mostly reflecting on how their nana taught them the recipe and they have fond memories of making whatever every summer, blah, blah, blah just get to the damn point!\n\nEDIT: Spelling and grammar",
            "I don't add reddit, more so have it before the question, I just use Google advanced search\n\n\"site:reddit.com {question}\"\n\nyou can use this for other sites as well",
            "Tip 'site:reddit.com' will enforce this.",
            "Yes! I do this almost every time I google something.\n\nI do add `site:reddit.com` instead, though, since that only shows you results from Reddit.",
            "I type \"site:www.reddit.com\" at the end of whatever im searching so it only shows me stuff from reddit, not some crappy articles someone wrote about a post they found on reddit. I basically use Google as my reddit search engine because the actual search feature on reddit sucks ass.",
            "I add site:reddit.com. But same deal.",
            "Try searching...\n\nSite: reddit.com search_term",
            "This is the best use of Reddit.",
            "i do",
            "And, let's not forget, we have to use Google because the reddit search function sucks ass",
            "Only if it's things on mundane topics",
            "Do this almost for TV shows and movie references, theories and questions. Sometimes for tech related queries.",
            "I use this Google method:\n\nReddit: Whatever you are searching for\n\nAnd doing that returns only posts within Reddit itself, it is like having a Reddit search that actually works.",
            "I do this aaaaaaaa lot!",
            "I ALWAYS do this lmao. Reddit provides very straightforward answers and usually provides people with practical knowledge and experience on the subject who can answer further questions. One of the main reasons I enjoy this site despite all of its problems",
            "Only for niche topics. It's also a commentary on how searching a thing in Google and adding reddit at the end is infinitely better than reddit search lol",
            "All the time haha",
            "Yeah, I prefer to hear what the average person has to say about certain topic, just cut the bullshit and the biases.",
            "I do it because the reddit search engine is crap and just gives random results even if i know the thread exists",
            "Google “site:reddit.com\" if you want that. \n\nIt trims the results for any domain you want like that.",
            "Depends on what I'm searching for. If it's something I'm looking for an opinion on or something niche like piracy, I'll add site:reddit.com at the end. It not, I tend to avoid Reddit.",
            "oh yes, for some things. the most recent is when trying to find out how to migrate whatsapp chat from iphone to android. general google result is so annoying, the web is full of advertisement-masked-as-articles from app makers.",
            "YES\n\nIt's a fucking common problem of the internet now. A site will have a title that suggest it has the answer you are lookimg for but it's buried in a massive article.",
            "Google isnt a way to find answers anymore, and really never has been.\n\nGoogle and other search engines are meerly portals to user / information acquisition locations. Building a vocabulary of good sites and techniques to best figure out what you're looking for is a skill.",
            "But never actually use the Reddit search function. Yes.",
            "Literally all the time. More often than not, in fact.",
            "I can recommend DDG if you're tierd of googles ads",
            "Yep. Y’all more helpful that those clickbait sites.",
            "This is 80 percent of my daily internet usage",
            "There isn't a question I ask where I DON'T type reddit at the end. I would much rather hear what real people say on a subject than a paid for article written by some schmuck for a company because they have to.",
            "I use reddit for product reviews, because people on Reddit usually just give feedback based on using the thing",
            "All the time. I'm sick of those click bait articles that rank at the top.",
            "Don’t say this out loud!!!!!!! The digital marketers (ahem, manipulators) are listening!!!!!!",
            "100% of the time now\n\nI used to try just googling it, now I’ve learned typing in “Reddit” after my search will save me from having to go back and type it all again once my original search comes back with dick all",
            "You.com has become my go to for this type of search",
            "Wow this guy fucking REDDITS!!!",
            "100 percent!",
            "all the time",
            "Yes but because search is such garbage on Reddit. But sometimes I want to know what Reddit has to say",
            "Mmmm, no. Im actually always asking why some of the most important and urgent of questions posted on reddit rarely get answered. Maybe its just my personal experience"
        ]
    },
    {
        "post_id": "vm3cjd",
        "author": "PuzzleBrain20",
        "title": "Why do my students call me a goat?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/vm3cjd/why_do_my_students_call_me_a_goat/",
        "score": 46697,
        "num_comments": 1898,
        "created_utc": 1656357175.0,
        "selftext": "I am a math teacher for 8th graders at the school I teach at.  \n\nThroughout this whole past school year there was this running joke where the students would call me the goat.  \n\nAnd I would respond back each time that they are the goats and they would all laugh.  \n\nIt was pretty funny to be honest, and I never gave it much thought. But I realized that I have been partaking in a joke that I never actually got.\n\nI had a good connection with them, and they are all really good kids, so I don't really think that they were making fun of me.\n\nCan someone (maybe an 8th grader) explain this joke to me?\n\nAnd how would you respond if someone calls you a goat?\n\nEDIT: omg I am IN TEARS!!! I can't believe they were complimenting me this whole time!!!! Thank you all for answering this question!!!!\n\nEDIT 2: THANK YOU ALL for you responses and the awards this post got!!  If those awards cost money, please can you donate that money instead to a charity that helps kids?  There are so many good ones, this one in particular is one I personally recommend: [Kids In Need Foundation](https://www.kinf.org/)\n\nEDIT 3: the photo that appears on this post is **NOT my photo**.  I think that the photo appears there due to the link I put in the 2nd edit.",
        "permalink": "/r/NoStupidQuestions/comments/vm3cjd/why_do_my_students_call_me_a_goat/",
        "comments": [
            "It means Greatest Of All Time",
            "GOAT stands for **G**reatest **O**f **A**ll **T**ime.\n\nIt’s a compliment. Sounds like you’re a great teacher and they enjoy your classes. Which is saying something since math is most people’s least favorite subject.",
            "Haha cute! As a teacher of high school freshmen if someone says something that I’ve never heard I always threaten to urban dictionary it in front of them and someone always tells me what it means and giggle fits ensue! It’s always a good time.",
            "It's so cute that you didn't realize they were calling you the Greatest of All Time the whole year, and you were calling them the same back. So wholesome.",
            "https://www.urbandictionary.com/define.php?term=goat\n\nUrban dictionary is a good site for looking up slang",
            "It's a compliment, not an insult lol.\n\nGOAT stands for \"greatest of all time\" like others have said.\n\nThey're basically saying you're the greatest teacher.",
            "You're the Michael Jordan of math teachers. It's a good thing.",
            "This is nice. when I was in middle school some kids called my band teacher chivo, which is goat in spanish. But it was more so because he never trimmed his nose hairs and had long hair. terrible children",
            "GOAT is a term coined by 80’s-90’s rapper LL Cool J, which is an acronym for Greatest Of All Time. It was popularized by his 8th studio album, titled G.O.A.T., and he credits Muhammad Ali for the origin, according to an interview in 2016 with Rolling Stone. It’s contemporary use is mostly in instances of a person being a holistically positive and empowering individual, and has become more and more popular in recent years.",
            "If you don't believe that it means The Greatest Of All time, just see what Urban Dictionary says",
            "So Meryl Streep went through the same thing as you, here's Jennifer Lawrence talking about it.  \n\nhttps://youtu.be/fDRX90-sAhE",
            "[removed]",
            "How did you go all year without asking or googling lol?  I google everything my students say that I don’t get to make sure they aren’t being super inappropriate haha",
            "Greatest Of All Time",
            "r/wholesome",
            "Gullible comment section. No 'old teacher' would post a question like this straight to Reddit instead of actually... googling it or asking someone.\n\nUnless.. OP is embellishing to whore karma. Shock. Their writing style even reads like a teenager.",
            "**Hoax alert! Please, hear me out before downvoting me, and if you still do, please at least offer a rebuttal**\n\nI don't doubt that you're a teacher, or your students said this to you, there's no reason to.\n\nBut there is almost no chance that this post is not \"karma whoring\".\n\nFirstly, your account is **five days old...** **Jackpot!**\n\nOf course it could be a throw away account, but if it were, you'd probably mention it. But also, you've made several posts completely unrelated to this topic before this one, so you didn't create it just to ask this question. It would be less suspicious if this were your first post, instead of the 7th or 8th.\n\nYour post is **precisely** the perfect blend of sweet naiveté mixed with being oblivious that you're a wonderful person that presses all of reddit's feely buttons. Just look at those awards! It's almost like it was intended to do exactly that...\n\nAlso, excellent reddit etiquette with the edits, **it's almost like you've been here much longer.**\n\nYou say they call you **\"a goat\"** in the title and then switch to **\"the goat\"** in the text, which are obviously not the same thing. Indefinite vs definite articles are not something people generally confuse. Being called a goat could have  multiple meanings, being called \"the goat\" has one, and is easily found with a quick search.\n\nThey've said it all year and you're just wondering now what it means? Also, all year, none of the 20-30 13 year olds slipped up and said what it meant? Was this orchestrated? Why didn't they tell you, anyway? Surely they'd want you to know.\n\n**Why didn't you ask anyone around you in the real world before asking reddit? Why didn't you google it?** Googling (or duckduckgo, etc) \"the goat meaning\" brings up \"greatest of all time\" as a search suggestion before you even hit enter. Urban dictionary exists, and this definition is in there.\n\n**Another of your (very few) posts even details advanced knowledge of search engine usage.**\n\n>\"I couldn't find any matches when reverse searching for mine either.  \n>  \n>There are advanced reverse image searching services out there (that you pay for) but I don't know if I want to use them.\"\n\nI highly doubt that your first instinct to find out what being called \"the goat\" means was to post on reddit. a site you've only been using for five days, when you knew a search engine would have answered your question (before you even hit enter), just without all of the attention, praise, awards and dopamine.\n\n**What if it meant something negative/mean/offensive (etc)? You really not going to check that before telling others that  a large number of people you work with has been calling you it for a year..? It might have meant deathly halitosis, or bad combover. Risky!**\n\nCome on Reddit. We've been here before!\n\nAgain, I am not saying OP is definitely not a teacher, or that their students definitely didn't call them \"the goat\", or that they didn't know what it meant at  the time and so had to look it up. These are all perfectly plausible.\n\n**What I am saying they almost certainly knew what it meant when they posted it to reddit, for the karma, awards and attention.**\n\nBefore anyone calls me envious, I'm writing this because I don't like stolen valour (or usurped awards) or \"karma whoring\", and I don't like emotional manipulation for personal gains.\n\nYou may now downvote me to oblivion, though I ask that if you  do, please also take a moment to debunk my points.\n\nI believe  in you, reddit!\n\nEdit: Five days old not two.\n\nEdit 2: Sorry I'm writing like a child, I'm at day 4 ish of a Covid infection and typing with a TV remote keyboard, looking through one eye due to the headache. Also... Positive karma!  Reddit, so pleased to know you can be reasoned with.\n\nEdit 3: **First, thanks for the gold! You truly are the goat.** I'm glad my nerdy ramblings are appreciated. This has got out of hand, have you seen twitter? I would not like to be in OP's position.. twitter is fickle.\n\nSecondly: **Come on, down voters, I challenged, even begged you to debunk my points, not just click and move on! This post has reached 25 about 5 times now, the positive score won't hide you! Won't even one of you speak?**",
            "This is the most blatantly fake post I've seen in a while.",
            "This is the most karma farming shit I've ever seen. It's the perfect storm. The ai algorithm that's crafting posts like this is nearing perfection lmao. \n\nYes, I'm calling BS. they never googled it, really? \n\nAdmitted the photo isn't there's at the bottom of the post. \n\n5 day old account. \n\nFirst post is about etherium liquidity??? You're telling me they're dabbling that hard in crypto but never encountered the word goat on the internet? Get outta here.",
            "How can so many people be so blind",
            "You’re a teacher and can’t use google, but can use reddit. So tired of the Internet.",
            "This has to be fake, a simple google search would have cleared that up. So wait a second, you want me to believe that although you can use the internet to go on Reddit, create an account and write this post out.....you can't google what GOAT means???? Downvote this crap.",
            "Could have just used Google with far less effort. I'm sure you already knew but wanted to humble brag. Enjoy your karma though.",
            "This seems fake AF..a puzzle brain would Google it and only come to reddit after failing to search. Also would probably include the possible answers they researched and eliminated",
            "Humble Brag?",
            "It stands for Greatest of All Time. It means they like you :)",
            "This whole thread is 100% bullshit. \n\nAnyone could have googled “what does goat mean”\n\nThe dude is claiming to be a TEACHER. \n\nAnyone who believes this is touched in the head.",
            "Yeah, this is some horse shit. Barf",
            "you're one of the good ones, OP. \nkeep doing what you doing ❤️",
            "This is like posting \"all my exes say that I was the best they ever had. What does that mean? How does one 'have' someone else? They loved making love with me, but I just don't get what this means. Is it bad?\"",
            "[removed]",
            "Fake story. Sad how many people are eating this shit up lol",
            "[removed]",
            "Lmao this is so fake",
            "Google is hard huh? Clear karma farming though.",
            "This is fake af, downvote. You can reddit but you dont know a term thats been around for a while, and didnt think to google? Gtfo",
            "[removed]",
            "Reddit will never stop falling for blatant BS and I love it",
            "didn't happen",
            "First thing that comes up in a Google search : Greatest of All Time.  Just a little suspicious of this post...",
            "[removed]",
            "this is literally the cutest thing ever :,) you seem like such a great teacher! your students are so lucky to have you!",
            "Not to be negative, but this is something that is easily googled..  feels like you were just seeking attention / validation that the kids think you are a good teacher",
            "I hate this sub",
            "You should ask your students to explain to you what a search engine is",
            "Ya. I think this post is BS. A simple Google search would have told you what goat meant.",
            "Karma karma farmin",
            "Hmm seems like a Google search would have revealed this...",
            "Bruh. Reddit is so weird. This is such a bullshit post. That picture is group of fucking 3rd graders",
            "OP can write all that and post a picture but fail to Google what \"goat\" stands for. LMAO karma whorrre",
            "Karma whoreeeeee boooo",
            "If you are really a math teacher you should know that you shouldn’t/probably can’t post a photo of your students online without parental consent. Jeesh.",
            "That is the thinnest disguised brag I have ever seen. You are a shallow and extremely sad individual. Please look to your parents and peers for praise.\n\n\nReddit, please don’t validate this pathetic cry for attention. If this person can use Reddit they can use Urban Dictionary. Use your head, it’s not complicated.",
            "Those aren’t 8th graders, those are 4th or 5th graders.",
            "nice b8",
            "r/thathappened",
            "Oof this is painfully fake",
            "This post is certifiably cringe",
            "This is the most blatant plea for attention / shilling I have ever seen on this God forsaken platform.",
            "It means gayest of all times",
            "Lol this post is sweet as candy man",
            "And you could not have reasonably come to the conclusion to simply google it?",
            "[deleted]",
            "This is some made up BS",
            "Yeah but do you have parental permission to use this pic?\n\nEven if it’s from a link you posted … those kids have parents",
            "So, not to rain on everyone's parade, but this teacher never thought to ask the students what that means, never gave it a Google search, never asked a fellow teacher or ANYONE at all for an entire year? Now we're a few weeks into the summer break and they post about it?  \n\nThis is Karma farming if I ever saw it. \n\nAnyway, congrats on being the GOAT. We need good teachers (I'm also a teacher), but this post is disingenuous at best.",
            "This is fake as fuck",
            "now that you got your answer, consider deleting this or at least remove the pic.",
            "I am calling BS on this story. You work with teens and you've never thought to ask one of them or look it up on the Internet? I am sure the story is true but the fact you didn't figure this out is a little >!sus!<",
            "Stfu whoever this person is positing is full of shit, look at the other posts and slang. It’s somebody looking for karma",
            "Bro just google it?",
            "This post just screams backdoor brag. Like a quick Google search could have done this, and  would have been a lot easier than typing out that essay you wrote asking about it.\n\n\nAlso how can you not know what the goat means? It has been around for a long time and is a very common phrase",
            "This is just cringe",
            "I dont know why and I hope im wrong but I smell Cap on this. If you really are who you say you are you will google cap like you should have googled goat..",
            "I truly don’t believe you couldn’t just look this up online. You would’ve found 10000 things that would’ve answered your question",
            "It’s just like this story from Jennifer Lawrence about Meryl Streep. She thought they were calling her an old goat.\n\nhttps://youtu.be/5eBNHJS72PQ",
            "Urban dictionary is something you might want to keep handy if this kind of situation pops up and you want to make sure it's all good or something else.",
            "Why didn't you just google it?",
            "Karma farming. Not his photo and you'd think if he were that curios a teacher would be savvy enough to GOOGLE IT?",
            "Come on bruh. You knew. Smh.\n\nAnyone using Reddit sure knows how to use Google to search for a slang word’s meaning. Or, ya know, ask one of your “students” or peers. Like every teacher does. \n\nThis is a gross humble brag and karma whoring at its peak.",
            "It means Grape of All Towns. Back in Biblical times, you could tell which settlement somebody came from by their favourite grape to eat. There was one legendary grape that was fabled to be enjoyed by all, nicknamed The Grape of All Towns. They're trying to say you get on well with people",
            "urbandictionary is your friend for all the slang",
            "This is the hardest fishing I’ve ever seen…",
            "So you’re internet savvy enough to invest in crypto, but not to do a Google search?",
            "This thread is what the world should be 🥹",
            "If you’ve got 8th graders calling you a GOAT then you’ve earned that title! I’m in secondary ese and this age can be challenging for both parties!",
            "Greatest Of All Time my dude. And you are.",
            "This is a fake post\n\n1. Could do quick google search\n2. Admitted that it’s not their photo\n\nTake this shit down and punish them",
            "These children are like 9 years old. They are not 9th graders. I’m calling bullshit on this entire post lmfaaooo",
            "r/thathappened\n\n“Omg!!! The children love me so much! And you Reddit, you adore me too!”\n\nWhat the fuck. \n\nI don’t know what’s more cringeworthy — you, or the sycophants who feel inclined to play along with your transparently bullshit story.",
            "You can always use Urban Dictionary \n\nOr just type \"What does Goat mean\" or whatever in your browser and answers will come up.",
            "There’s a 0% chance those children are in 8th grade. 8 years old, maybe. Not 8th lmao",
            "Have you never heard of Google before? How are you a teacher but not know how to search things on the internet? Obvious karma troll.",
            "It means Grody Old Ass Teacher",
            "Fake",
            "Wait…OP never once googled the term in all that time?\n\nI smell a karma grab…",
            "Could've just googled ya know?",
            "Yeaaaaaah, this is just lame karma farming from OP. You can make a reddit post but not google \"what does goat mean\".",
            "Very nice humble brag!",
            "I refuse to believe a teacher can use Reddit but can’t look up what goat means on google.",
            "This is definitely real and not fake. Op has absolutely no plans to sell this brand new account with the karma provided by this very real post.",
            "Not sure why everyone is buying OPs story.  This is clearly bullshit.  Look at the dudes post history, he posts on Etherium pages, he’s a crypto bro. Also has IG and blazes weed.  Come on",
            "Its because you smell bad.",
            "So, you went a whole school year hearing this and wondering what it meant without doing a simple Google search? I look stuff up all the time when I see or hear phrases I don’t know that are used by younger people. There’s a ton of acronyms I’ve learned just here in Reddit for the last 2 years.",
            "A simple Google search literally answers this",
            "100% fake",
            "Yea you didn't make this post pretending not to know what goat means. I know you didn't . Cause as a maths teacher I'm sure you'd type this incredibly long Reddit post instead of googling \"goat slang \" or something like that first .",
            "If only there was a place you could type your query in and it would give you the answer. We could call it Google",
            "Or... now just hear me out. they are 8th graders and it could say\n\n\n\n\nGay \nOld \nArithmetic \nTeacher",
            "Why in the world would you make an entire post to ask this simple question? Come on",
            "OP totally didn't google it the first day and is bullshitting the story for karma",
            "Did you really need to make a whole Reddit post to have this answered? Quick Google search and your good. I suspect u already had an idea of even knew what it meant but you are karma farming. Nice job.",
            "I smell bullshit, this could have been solved by a simple google search.",
            "Truly the GOAT of karma farming.",
            "This is obviously bullshit 😂 also, karma farming picture that was included - I'm sure the parents would be delighted their teachers posting pictures of their kids online",
            "Impressive, you fooled 30 thousand people into thinking this bullshit is real. Hats off to you",
            "I hope they don't have a double meaning because that would just be so wholesome",
            "it's a good thing, it stand for \"greatest of all time.\" usually they don't mean it literally, just as a compliment",
            "They could be talking about you \"giant, oval, aromatic, testicles.\"  Thats only a guess, though.",
            "This is so fake omg. You're telling me you know how to post on reddit but can't Google what does Goat mean?",
            "we entrust our children to these people.",
            "Might want to post this to r/TodayIWasNaive. ❤️🐐",
            "You eat practically anything, chew your food funny, and smell like garbage.",
            "It typically means the Greatest Of All Time. However, these being eighth graders and they could have changed that G with, well, almost anything.",
            "I think it means you have a large sack that swings around behind you as you walk",
            "My students on my school bus all loved me... And if they didn't love me they at least respected me",
            "It’s the constant snacking and occasional bleating. Quell that, and come down from the tree in the courtyard, and boom, you’re good",
            "The best teachers dont teach for money but for teaching",
            "For future stuff - sites like [Wiktionary](https://en.wiktionary.org/wiki/goated) are great for lingo from a generation you're not familiar with.  \n\"He/she's the goat\", \"He/she's goated\", \"Actual goat\", \"goat move\"..   \nGOAT stands for greatest of all time, as some others have said.   \nMuch like other slang terms, the origin of the word has lost some of it's meaning and it's become its own word in usage now. \n\n  \nIf they meant it unironically, they really loved having you as a teacher. They had a huge amount of respect for you, especially to refer to you in terms that are used by and for their generation.",
            "This post is so sweet. You are def the GOAT. Thanks for being a teacher.",
            "You have a really outstanding heart",
            "I teach middle school English and was flabbergasted (at first) that you didn’t know what ‘goat’ meant. It comes up in context every few weeks, especially when I discuss sports with my kiddos. However, I came to the realization that you teach math and I teach English. My good math teacher friend told me she was jealous because math teachers are always teaching, well, math, and as a teacher of English I get to chat up my students much more; also, it’s my job to know how to communicate at their level, and knowing stuff like ‘goat’ is part of the job!",
            "Greatest of all time.  Or you're a Capricorn, whose symbol is a goat.",
            "This is so awesome!! You ARE the GOAT! Rock on!",
            "If your whole class calls you the goat then you are goated asf man",
            "You sir, are the Mohammad Ali of Math Teachers!",
            "this should be posted in r/wholesome",
            "Fuck yea, teach. That’s glory! You’ve obviously earned it.",
            "Haha how organically naive and wholesome.",
            "I hope this is real",
            "It means they wish to milk you in the morning",
            "When I asked my kids what they did over the weekend, they told me \"blumpkin\". Sounds cute.",
            "For future references [knowyourmeme.com](https://knowyourmeme.com) and [urbandictionary.com](https://urbandictionary.com ) are your friends!",
            "I feel like this should be on yeah that happened but lazy",
            "Capital GOAT. Acronym: Greatest of all time. 👍🙂😊",
            "maybe they think you're Wayne Gretzky",
            "Jfc this is the most wholesome shit I've ever read on this site",
            "You the 🐐 no 🧢\n\nEdit: “no cap” means “no lie”",
            "If you are a GOAT math teacher. Then keep doing what it is your doing!",
            "This is the cutest post I’ve ever seen in this sub 🖤",
            "This made me so happy to read. :)",
            "Thank you for being an amazing teacher. Those kids love you and I'm willing to bet that you've given them an appreciation for math. My Algebra teacher in college was awesome too. She really loved math and was always excited when she taught. It really helped a lot!",
            "This is one of the most wholesome reddit post I've ever seen",
            "goated post",
            "OP is the true goat",
            "Besides greatest of all time, it can also refer to old goat.  Read the room.  Here is hoping you are beloved rather than another option.",
            "I think this is the sweetest thing I’ve found on reddit!",
            "This is mindblowingly wholesome. Teach on, GOAT!!",
            "You're a teacher?! SMH...",
            "How do we know op didn't google search first, then ask on reddit for karma? Like make a post and ask, or get an instant response. Or better yet get your instant response, see chance for clout, then make post. Seems kinda sus.",
            "I'm curious what Google said and why you didn't believe it? No way you didn't try to solve the problem.",
            "So you didn’t think to gooogle it one time…. The whole year…. Okay dude thank god u weren’t my teacher",
            "This has to be a fake post. Something is not adding up",
            "No offense, but don't assume that they mean it as a compliment.\n\nHaving been a teacher myself, have kids of my own, and understand people in general without blinding myself with rose colored glasses...\n\nThere's become a common habit of people using typically positive terms as insults.\n\nI.E. they say out load that \"you're the GOAT\", but they know they mean you suck and are getting a kick out of pulling the wool over staff/admin eyes through their deception.",
            "This is so fucking made up it hurts.",
            "You must have been the GREATEST OF ALLLLLLL TIME. They must've loved you, thanks for being a good teacher.",
            "1000% fake, nice touch adding the donation link so they don’t take down",
            "Why is this person acting like they don’t know what it means lmao. Could have found out in 2 seconds but instead wrote and essay for Reddit.",
            "Copypasta troll - here's word-for-word repost but COOL instead of goat https://www.reddit.com/r/NoStupidQuestions/comments/vmr4p3/why\\_do\\_my\\_students\\_keep\\_commenting\\_on\\_my\\_body/",
            "This is the wholesome content that I needed in my life today. You really are the GOAT, OP.",
            "God of all throats",
            "We used to call a teacher Goat. Maybe you sound like one or look like one?",
            "FML y'all",
            "This post is a psyop.",
            "[You are famous now](https://www.msn.com/en-in/news/other/math-teacher-confused-by-why-her-students-called-her-goat-finds-out-reason-during-heartwarming-moment/ar-AAZ1Jt8?cvid=b7f680b1ea874c50a7bd728ae2f9e37e&ocid=winp2sv1plustaskbarhover) \n\nfound about you in this news article",
            "There’s no way people believe this…",
            "Greatest of all time unless they all watch Survivor. There a goat is someone who is horrible at the game so you drag them to the end for an easy win. Bring a sacrificial goat.\n\nIn this case it is greatest of all time.",
            "It's a good thing, it basically means they like you, it's similar to \"you're the best\" I a way.",
            "Teacher of the year."
        ]
    },
    {
        "post_id": "exan65",
        "author": "Vadermaulkylo",
        "title": "Today, I told my mom that I have no internal monologue and she stared at me like I have three heads. Is having one common?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/exan65/today_i_told_my_mom_that_i_have_no_internal/",
        "score": 45282,
        "num_comments": 10577,
        "created_utc": 1580582878.0,
        "selftext": "I sincerely thought it was a fictional concept that “Dexter” made up. It shocks me beyond belief to know that people may have one. \n\nHow do you do it? I can’t imagine doing that.\n\n\nEdit: yes guys I get it, I’m an NPC.",
        "permalink": "/r/NoStupidQuestions/comments/exan65/today_i_told_my_mom_that_i_have_no_internal/",
        "comments": [
            "I'm so confused by this thread... my mind's racing.\n\nWhat is a \"thought\" without an inner voice?",
            "Wait, so do you never have an internal monologue? Like for example when you were writing this post were you not saying in your mind what you wanted to write and maybe mulling over it a bit in your head like “no, no, I should phrase it this way.” Etc.,?",
            "I would consider it a miracle if I ever had a single moment where just one thought was happening.  It’s like a beehive up in here.",
            "I don’t know. My head never shuts up.",
            "I can tell you right now I spend more time in my head than in any other place, conversations, etc. I live in my head. Me and my brain are best friends.",
            "Internal monologues are common. Basically, in the past few years, going \"wait, do other people actually think differently than I do?!\" Has become more common, with people who can and can't make visual pictures in their mind being another point of discussion.",
            "So if your boss asks you do something right at the point you were planning to leave work you don't think \"Oh fucking shit balls what a pain!\" in your head while saying \"No problem at all boss.\" out loud?",
            "[deleted]",
            "Do you ever get songs stuck in your head?",
            "So what do you think when you arent doing anything?",
            "Me neither. I also thought it was just a fictional concept used in movies. This thread made me realize it isn't.",
            "I definitely have an inner voice, usually just me chastising myself for being socially awkward.\n\nEdit: Thank you for the silver kind stranger, although I don't think I deserve it. <3",
            "$1M to anyone who can transfer one of the 100s of voices inside my head to this user's. Legit offer.",
            "Probably why I read a lot - it seems to be the only activity that shuts down my incessant internal monologue \n\nInteresting that you don’t have that, must be so peaceful \n\nAnd thanks to whomever posted the ADHD thread, that was very enlightening",
            "This whole thread is making me super confused.\n\nFirstly, about internal monologues, do people actually spell out sentences like \"no, I shouldn't do that\", for example, in their head? I do have sort of a voice in my head while typing or reading, but the only thing it does is narrate the words. I don't form my thoughts into actual sentences, because that just seems like a waste of time. The voice only happens as a translation from my abstract thoughts to language (or the other way around) when I need to. (This is also how I classify \"knowing\" a language. If I am unable to form the sentences directly into the language, and it is interrupted by a better known language, I am not yet sufficient in it.) However, I do sometimes get music stuck in my brain, so I have that imaginary audio.\n\n&#x200B;\n\nThere was a thread about the similar situation with mental images. I don't actually \"see\" anything when visualizing, however the thought is there. I don't describe the images in words either, it's just there, with no actual form, abstract. So, I feel like the question to those who claim to see images is: does closing your eyes actually help you picture something? For me it makes no difference whether or not they're open, as my \"mental image\" \"looks\" nothing like an actual image. It's just...super abstract. And, I don't consider myself to have any particular problems with creativity, since I enjoy drawing and painting quite a lot.",
            "It can be tough. I had a hard time sleeping when I was a teen because I couldn't get that internal monologue to stop. It didn't help that it bounced from topic to topic in mere seconds. I still have difficulties sometimes now even at 30, but it's definitely better now.",
            "I used to not have one. I had an extremely bad concussion when I was in high school. I had some medical problems and during the testing we found out that i had increased pressure in my brain from a buildup of CSF from said concussion. I had a spinal tap to remove some of the CSF and relieve the pressure and now I have an internal monologue. My brain is empty now (in a good way) and I can THINK. I love to just be in my head and think! I’ve never been able to do this before.",
            "Its ok op is just an NPC",
            "My head is constantly racing with information, but I almost never put this info into word formation. I'll have my moments of monologuing but it's always a conscious decision and sometimes it's internal but sometimes I'm speaking aloud to myself. \n\nIt's weird, upon first reading this comment I was like woah no monologue that's weird, but upon further thought, I realized that I myself have no monologue, rather I think in concepts and circumstance and I understand it but strangely never put it into words or self reflect like that. So yeah no internal monologue here.",
            ">Is having one common?\n\nYes, having a mother is common.",
            "[This thread on an external website](https://news.ycombinator.com/item?id=22193451) might be of interest to you.",
            "Surprised none of the comments seem to include this article that went viral a while back:\n\n\nhttps://www.psychologytoday.com/us/blog/pristine-inner-experience/201110/not-everyone-conducts-inner-speech",
            "It sounds weird to me as the voice in my head never shuts up, I sometimes even can’t sleep at night because I start thinking about something and it keeps me awake. Don’t you ever have this “train of thought “ as Agatha Christie calls it? Like you start thinking about one thing and switch to the other and come to another conclusion and so on and so forth?",
            "So what happening in your brain then? How do you think things through before acting on it or saying something?",
            "It is very common to have one but it is also common to not have one. It's a bit like with wiping your ass after pooping. There's people who do that standing up and people who do that sitting down, and the majority of people don't know about the existence of the group they aren't in and those who do know find the other group very weird.",
            "I’m like you, I don’t have a voice in my head either!  I tried once to go for a whole day and have an internal monologue, but it felt so unnatural for me.",
            "Does anyone know, how to distinguish between non-vocalized thoughts (plus awereness of feelings) and actualed worded monologues? \n\nPresumably everyone has thoughts. Seems like the line is blurred, most of the time. Or it's a spectrum.",
            "This has been circling so much lately. I dont think in sentences either. Just ideas and visuals.",
            "You know how you typed out how you felt in your post. It’s that but in you head. The voice in your head, you can’t recognize it. You can hear someone’s voice and make them say something different in your head but the voice you have when you just naturally think, it doesn’t sound like anybody\n\nAlso, how do you do math?",
            "Do you get songs stuck in your head? Because my mind is a fucking radio station. Also: do you imagine things in pictures, as in, if you read a book do you see pictures in your head or not?",
            "Wasn't a post like this on the front page this morning?",
            "Having an inner monologue is definitely the majority, and you are going to blow a lot of monds over the years. But you also aren't alone. One of my friends actually just did an informal facebook poll of this quwation the other day and got about 90% inner monologue responses.",
            "I'm the same way. I never have words in my thoughts, just pictures and feelings. I only recently realized that was weird when I asked my friend if she thought with words in her head and she said yes. I thought that shows like dexter were fake too lmao",
            "Can you explain how you think? Like, if someone asks you to think of a line of text, what do you do?\n\nIf your writing a post, do you just know what to type, do you make it up while your typing, or do you think of what you want to say and then start typing it.\n\nIf someone asks you to recall the lyrics of a song, what do you do? What do you think? If your asked to then tell the other person the lyrics, do you just  start talking without acctually thinking about the lyrics or do you just know the lyrics?\n\nI am genuinely interested as i have a internal monologue that is pretty damn hard to controll, really chaotic and fucking up my focus. Must be peacefull not to have an internal monologue.",
            "So when you read, do you just absorb the meaning of the words without a voice actually reading them out loud?",
            "Someone else who doesn't have one! I'm not alone!",
            "There was actually a really interesting episode of Hello Internet about something related, how we think of things, like if you think of an apple do you see an apple or do you have an abstract idea of an apple",
            "Isn‘t that just thinking...?",
            "I DEAL WITH THE SAME THING!\nI would read books as a kid and a sentence like 'Jimmy thought to himself \"this is a good cookie\"' would come up and I didn't realise that the author was saying that 'jimmy' literally thought that sentence. It's so weird! \nActually I would hate to have a \"voice\" in my head that spoke my thoughts anyway. The English language is so limiting, so using that as a tool to think would be boring for me.",
            "This topic has gotten surprisingly popular around reddit lately.\n\nI'm happy to find other people like me, who think almost purely in abstract ideas without words and only translate the ideas into words when they need to communicate.\n\nI'm not alone!",
            "I am able to turn mine on and off, not always on command",
            "I just posted an article about this an hour ago, and it flung my Facebook friend list into a meltdown. I personally don't hear my thoughts in an actual voice. I'm able to force myself to do this, but it's not how my thoughts occur naturally. I do, however, talk to myself ALL THE TIME, and my thoughts are non-verbal until I speak them. I guess I have an external monologue? But just as many of my commenters have an internal monologue, and a couple had the realization that they don't even though they thought they did.",
            "I feel like anytime I think anything and don't immediately blurt it out, that's an internal monologue. Just writing this post, I pause to think how to best express myself. That is internal monologue.",
            "My internal monologue is so strong that I do it out loud when I'm alone. Especially when I'm driving.",
            "As you were processing your mom’s reaction and formulating this question what were your thoughts about it like? Maybe it wasn’t a polished monologue with full sentences and paragraphs like in TV shows, but there was probably some sort of internal narrative leading up to this point. IMHO, even abstract processing of a narrative is a form of internal monologue.\n\nIf this doesn’t resonate, but you’d like to get more in touch with internal monologues you could try free writing.",
            "Hang on, if you have no inner monologue, how do you read stuff? When I read stuff, the words play in my head like a voice. Does that not happen with you?",
            "I think this may be similar to subvocalization when we read. We are taught how to read by saying the words in our minds. This is taught to us. If you want to learn how to speed read, it is recommended that we break subvocalization because registering every word by hearing it internally slows us down. Super interesting.",
            "Sounds like you’re conflating an internal monologue with an entire line of thought you’re always conscientious of.  No one is like that. But we all do have thoughts, and that’s what an internal monologue really is",
            "Some people experience the \"inner dialogue\" as words and others experience it with ideas and concepts (i.e. you feel it instead of hear it).",
            "I'm so glad that there are other people like this. My thoughts are almost completely visual. Like mini mind movies. I'm never present within my own mind if I try to imagine my thoughts it's a character from a mind movie reading the monologue. \n\nI say what I mean very quickly and often have to backtrack when it's not a good social move. It's like the thoughts skip the test in the head and go straight to the mouth.",
            "I don't have one, either.  It's perfectly normal, don't worry about it.  I have no trouble with languages.  I simply don't use words in my inner thoughts unless words are the appropriate medium. \n\nI didn't realize I was any different than anyone else in this matter until I started learning other languages.  My fellow students would regularly do simple word-transliterations without taking the new languages' grammar and patterns in to account, and I was confused as to why.  $newlang isn't coded English, after all, it is its own thing, and has its own way of expressing things.  That's when I learned that many (most?) people think of a sentence in English first, then try to translate it.  This makes no sense to me.  I see it as you have an idea, *then* you need to access your language centers to convert the ethereal idea into the word/grammar structure of your choice.\n\nWhen I've talked about this with the folks who think in words, they look at me like I've grown a second head.  Apparently this mode of thought is as much a mystery to them as theirs is to me.  I don't feel like I'm missing anything- a constant stream of words in my head sounds exhausting!  As it is, I feel like my head is busy enough, I'm just thinking in a non-verbal manner.  Images, feelings, sensations, certainties, vagaries, that kind of stuff.",
            "I don’t have a monologue that uses actual English. I do think seemingly nonstop, and it can get annoying, but my thoughts are just there... that’s the only way I can really describe it. My thoughts don’t have a linguistic form they just exist purely",
            "Wait what. I thought this was a tool used in films and TV shows. Do people actually hear a real voice?"
        ]
    },
    {
        "post_id": "s9rrmr",
        "author": "None",
        "title": "Does anybody else watch their pet while they're sleeping for a while, and just think about how grateful you are to have them?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/s9rrmr/does_anybody_else_watch_their_pet_while_theyre/",
        "score": 45171,
        "num_comments": 1643,
        "created_utc": 1642818337.0,
        "selftext": "they always look so peaceful and innocent, i just like looking at them\n\nhttps://imgur.com/a/FGXdS0Z",
        "permalink": "/r/NoStupidQuestions/comments/s9rrmr/does_anybody_else_watch_their_pet_while_theyre/",
        "comments": [
            "I love animals, all of them. But I always said I wasn’t really a cat guy. Then I had some health issues leading into the pandemic. My mom got me a cat to keep me company because I was stuck at home all the time. When we went to the shelter, he was just sitting still in his cage with his eyes closed, seemingly content. I saw him and asked the attendant if we could see him. She opened the cage and he came up to me and sniffed my hand and rubbed his face on my hand. I moved closer to the cage and he leaned up against my chest and purred while I pet him. So of course he was the one. \n\nTwo years later, he follows me around my apartment always sitting next to me. At night when I climb into bed he will be hanging out in the living room while I browse my phone. As soon as I put my phone down and turn off the light, I flip to my right side. Every night since I’ve had him, he runs and jumps into my bed and lays down next to my chest, head resting on my arm. He will lay there until I fall asleep. Every morning, when I wake up he will hear me toss in my bed and run and jump in my bed to greet me. In an otherwise dynamic world that is always changing, he’s been the one constant keeping me grounded.\n\nSo yeah, I do that too.\n\nEdit: [Cat Tax](https://imgur.com/a/pRX6asy)\n\nEdit: I didn’t think about cropping out my foot until it was too late 😬\n\nThank you for all the kind words and awards. I will make sure that Patches gets some extra special treats and pets today 😺",
            "I feel like my cat chose me to be her family, so absolutely yes.\n\n—-\n\nEdit: I paid the cat tax in a comment below, but I’ll repost here :-)\n\n[https://imgur.com/a/grSMncx](https://imgur.com/a/grSMncx)\n\n1st three are the day we found her. We were driving in the dark and hit what we thought was a possum. Got home and heard MEOWWWWWW coming from my front bumper. Turned out there was a whole entire cat wedged in between the plastic grill and the radiator. She used up one of her 9 lives that day for sure because she was scared but not hurt.\n\nShe was REALLY skinny and seemed grateful that we found her. We took her to the vet right away. She had a broken fang and fleas, but no microchip, and nobody had posted her in the local missing pet groups.\n\nWe paid for her shots and flea treatment, and brought her home. She gained about two pounds in ten days, and we got her chipped as soon as she had enough meat on her bones. She is super cuddly and affectionate, and I am her favorite person and it makes me so happy to have her.\n\nThe last pic is her presiding over our household and establishing her reign as Queen of the House.",
            "Hell yeah, makes the annoying parts of having a pet feel worth it every time.",
            "Absolutely. And it still amazes me that people believe that animals are not capable of love or showing emotion. The love of an animal is truly a remarkable feeling and I cherish the moments I have with my two cats",
            "I live alone and work at home, so sometimes i go days on end without human contact. If it wasnt for my dog i would be too lonely, so you bet i apreciate her existence",
            "Absolutely, but Does anyone else have the defect of character that makes you want to annoy them too",
            "Yes. Treasure every moment you can. \n\nWatched our family dog who’s been with us for 17 years (more than half my life) go to sleep for the final time just three days ago. He was a trooper even when doggy dementia hit hard.\n\nI’m so grateful to have had him in my life. Went through highschool, university, and he met my two children. The grief is almost unbearable but I’m hoping to process seeing him as if he was sleeping like usual and at peace.",
            "Absolutely! We had to put one of our pups down right before Christmas. We ended up getting [this puppy](https://imgur.com/a/2vecvyU) and the goober fell asleep at the vet today (routine visit) and I just watched her lay there with her ears twitching at every sound. As maddening as she can be, these moments always give me the warm fuzzies.",
            "Yes, especially after my cat was in our apartment the entire time that an upstairs neighbor's unit burned down a few months ago. She had hid under my bed, and my sister and I weren't home, so when the firefighters broke down our door to make sure no one was in the apartment while the building was on fire, they didn't find her. Not until after my sister and I got there just after they had finished putting the fire out. Fortunately, my cat was fine (the firefighters that escorted me into the building to look for my cat put her on oxygen right after we found her, and my sister and I took her immediately to a vet's office for a checkup after that) but I still look over at her when she's sleeping to watch her breathe because I'm so, so lucky she's alive.",
            "Yes for sure. This overwhelming feeling of love that I never thought I could feel for an animal. I never understood people who compared their pets to children before I experienced just looking at my lil’ puppy sleeping and feeling so emotional. \n\n(Don’t get me wrong, I know puppies aren’t children and they’re not the same lol)",
            "My dog is a rescue.  She's little.  Before I got her, she was hit by a car, dropped off at a vets by a stranger.  The vet fixed her leg, a shelter took her and spayed her.  A bunch of her teeth were rotting and had to be removed.  I was her second foster home and took her in just after her leg had healed, and just before her mouth had finished healing.  And I couldn't give her up. \n\nI look at her while she sleeps and I'm so grateful to have her, and it gives me such peace knowing that she's not living on the street and she's all fixed up.  I get so sad thinking about all the pain and discomfort she's had in her life, and it brings me such joy to see her at peace.\n\nSleeping pic after I got her\nhttps://imgur.com/a/4jiKijp \n\nMore recent pics\n\nhttps://imgur.com/a/9DfyGmZ \n\nhttps://imgur.com/a/x6ELw6t",
            "This post and the comments are making me tear up. I stare at my pets all the time when they’re sleeping and twitching having sweet dreams.",
            "Everyday. He's my fat chonky kitty. 14 years old next month and cheated death a couple times already, so just glad to have him while I do. He's the cat I got as a kitten with my SO in 2008, who died of cancer in 2015. Losing my first cat was hard but this cat's eventual passing will be devastating.",
            "Absolutely! There is nothing as peaceful looking as a sleeping kitty. It kind of makes all of my anxieties disappear. My favorite is when both of mine are in my lap sleeping, it's a puddle of love. 😍",
            "One of my favorite moments is when my cat is standing on my desk and she starts to doze off while standing up. It's hilarious",
            "The best thing about Reddit is that I never feel like a weirdo. Thanks!",
            "This post hit me like a brick. I did this every day for 4 years with my pet Agama, who passed away in her sleep yesterday. I was beyond devastated and cried so hard I passed out.",
            "I use to.\n\nMy dog died at 15 years of age about 5 years ago. Had to put my cat down a few years after that.  \n\nAs much as they were a pain in the ass at times, I'd love have one of those pain in the ass days again just so I could be with them again. My dog is still my phone background pic after all these years. \n\nSo my advice is Enjoy. Even in the tough times where they test your patience. You are blessed",
            "Everyday!",
            "r/DAE",
            "I do it with my wife. God, I love her!",
            "Yep. Just looked over at my buddy thinking that right before I saw this post.",
            "Often. He brings so much love, peace, joy, and comfort to my life. He’s just a dog … but I’m so happy we have him.",
            "[Yep!](https://i.imgur.com/2vn133o.jpg)",
            "I do it for her because I know she watches my back when I sleep. She keeps the monsters away at night lol",
            "I sometimes watch my cat while I'm working on the computer and think to myself, I'm grateful that she's sleeping.",
            "Yes. I had minor out patient surgery this morning and my feline nurses have been such a blessing.",
            "I don't have a pet :(",
            "Yes and my children.",
            "How does this cringe have 20,000 upvotes?",
            "But when I do this with my binoculars looking into the neighbors house I’m the weird one smh",
            "only from the moment they close their eyes to the moment they open them\n\nEVERY TIME",
            "I'm doing that literally right now.",
            "No.",
            "No",
            "No",
            "No",
            "I do. After checking to make sure he's still breathing!",
            "Pretty much, it's a beautiful distraction.",
            "Yeah and at the same time I usually hope that I'm giving them the best home they could have.  They're a pair of farm rescue sisters and they're just so adorable.",
            "I would if my snake would stop being burrowed all the dang time.\n\nBut when he is out I do watch him and talk to him and stuff.\n\nI really want an orange male cat though.",
            "Every single night and day. Idk how anyone with a pet doesn't look at them in wonder and awe. Their lifespan is mostly so much shorter than ours, why not appreciate and make their lives as comfortable as possible.",
            "I would always either end up in a staring content or end up crying because I started thinking about not having them around anymore",
            "My dog sometimes sleeps with her eyes open, so usually if I'm watching her sleep for a while, it's to make sure she's still breathing. Totally creeps me out to see her lying there completely still like that, even though I know she's most likely just sleeping.",
            "I absolutely do- and sometimes my insides go all happy crampy like on a rollercoaster because they're so cute... Is that love?",
            "All the freaking time.  Then I take pics and send them to friends.",
            "All the time. He's me best friend. They are here with us for such a short amount of time.  Feels unfair sometimes,  but it reminds me to love him as much as possible before he goes.",
            "Yes, I look at him and say to him “I wubs you puppy, I wubs you and wubs all of you.”   Then I tell him a little story about how amazing and adorable and handsome he is.  Everyday day.  He’s getting so old. I want him to know I will always love him, forever and ever.",
            "Yes. Also, if you think that feeling is love (which it totally is), report back once it happens with your own kid!!",
            "My dog is being put to sleep tomorrow as there's nothing else to do about his cancer. So yes I was very grateful for all 9 years he gave me.",
            "Yes. My little girl is the ball of fur that launches itself at me whenever I come through the door. Endless love, asking nothing in return but basic needs. \n\nI don’t think I would be in a good place without her, tbh",
            "Every day, multiple times per day.",
            "She sleeps on my lap in the chair, and alternates between big spoon, little spoon, and pressing against my chest in bed. In the morning I'll wake up and she'll be groggily standing by my head, and will want to get under the covers and lay her head on my chest before we get up. Sometimes I wake up and she's on the other side of the bed, under the covers, with her head on the pillow. I really lucked out with this one.",
            "When I was looking for a dog at the shelter five years ago I met my dog Rosie and she just bulldozed her way over to me when I wanted to meet her. When we I watch her sleep and look away for a second I’ll look back over and she’s still snoring but she opens her eyes to watch me too randomly. I think we’re both grateful. She’s a good girl.",
            "Yes, then I hold them and scratch their little heads because I can't help it.",
            "At least three times a day lol, my kittens are the best thing that’s happened to me",
            "My last night with my old golden i had her sleep on my arm as she rested petted her and cried.",
            "All the time!  And to check for her rising chest if she's breathing.  My pup is gonna be 19 years old this year!!  I've had her since I was in elementary school.",
            "hello, yes all the time. they've been my companions and my comfort and my joy for a decade. my sweet lil kitties.",
            "the feeling you're describing is love.",
            "Nope.",
            "No because I don’t have a pet. However, I do have many other things to be grateful for. Through that, I relate to you.",
            "No, I always think ‘I wanna be that guy!’",
            "Yes",
            "My father passed away two years ago. While cleaning I found his camera, on it was a short video of him showing his two sleeping kitties and talking about how happy & blessed seeing them so relaxed made him feel.",
            "Until they wake up and start bothering me while I work, then I think how peaceful it was before I got them.",
            "I like to bundle up my turtles in my shirt. They love the radiating heat and rhythmic rise and fall of my torso as I breath. I look down and see their little outstretched limbs doing what I like to call yoga. Knowing they feel safe and comfortable makes me eternally grateful :)\n\nNow that im gone, they have to sit ontop of the air vents so they stay toasty during the winter.\n\nhttps://imgur.com/a/canMudt",
            "All the time. It just makes me feel so full of love for my dog when she's laying there peacefully sleeping looking all cute and I'm so happy she's mine",
            "i look at my cat and think \"fat fuck lmao\"",
            "I have over 150 pictures of my dog on my phone. Half of them are of him sleeping.",
            "As someone who just had to put my pup down after 15 wonderful years...I used to do this all the time. \n\nAnd here come the tears...enjoy every day you get with them. To you they are a huge part of your life, but to them, you ARE their WHOLE life. Treat them as such.",
            "A few years ago I was diagnosed with several health conditions. Including PTSD and BPD. I was told I needed to get a service dog to help with recovery. I told them that a dog wouldn't work for me the barking would be bad for me. \n\nI was told that the next best thing would be a tabby cat. I'm never alone now. And when the world is to much for me to take she is there cuddling into me purring because she knows it soothes me. We cower from fireworks together.\n\nShe comes and cuddles me every night when I go to bed and doesn't get back up till I'm asleep. \n\nWhen I don't have the strength to live for myself I still have it to live for her. \n\nI have a computer chair next to mine with fuzzy blankets so she can sit next to me while I game. She must know I suffer from chronic pain because she avoids sitting on my lap. Despite her clearly being torn by wanting to. \n\nShe doesn't yell at me and will give gentle taps to get my attention. She will use her nose to point to the thing she wants. At the oven for treats and the cupboard for food. \n\nAll she asks in return is food, hugs and playtime. I am beyond lucky to have her.",
            "I just had a house fire and lost everything but the clothes on my back, and my cat. I honestly could not be any luckier.",
            "ALL. THE. TIME.",
            "Every day ♥️🐕♥️",
            "My dog used to sit beside the bed and watch me sleep. It was creepy as hell. Especially after the time he got out of the house and tore a goose apart before he came back to me.",
            "I had this moment with an ex girlfriend on a drive home from this varieth show event we went too. Just looked over and she looked so peaceful and beautiful. I realized i wouldnt want to be anywhere else doing anything else with anyone else and I just felt perfect inside for a minute and was so gratefuI. I call that serenity or love. Comes around once in awhile. Im glad you got to experience it.",
            "Is the pope catholic?",
            "Absolutely! My cats are my life. When they're asleep, they look even more precious. They are such treasures to me; and so sweet. I don't have kids, but I feel like I love my cats so much, as if I had birthed them myself.",
            "My whole life I have had pet cats. I'm 100% a cat person. Because of a few different reasons I had to give up my sweet boy when I went to college. Well after college I moved in with my current long time boyfriend and he lives in an apartment that is strictly no pets. After a while I learned that not having a cat in my life was legitimately contributing to my depression. I remember my boyfriend and I would often talk about our dream cat that we wanted if we ever moved. Fast forward like 3 years later, and we are driving on the busiest road in my city getting fast food at like 1 am. On the way back we started arguing about something stupid that I honestly don't remember but he just randomly pulls the car over and I'm mad af thinking he's trying to kick me out of the car or something and he says \"did you not see that kitten?\" I immediately went into mother mode and got out of the car and saw her. She immediately ran up the hill and I was like wait kitty and she turned around and looked and me and got close enough to were I could grab her. As soon as I had her in my arms I knew she was my dream kitty even though she looked real bad (had all kinds of fleas and was really malnourished). We immediately stopped at CVS and bought her as much cat supplies as we could. Took her home to our no pets apartment and nursed her back to health. She is literally everything we dreamed for in a cat. I really think we manifested our kitty lol. I've hid her in the apartment successfully for the last two years now.",
            "No you’re super weird for that",
            "I love my cat, but it's a cat, I had 4 before her, she's 14 years old, and as soon as she dies, we'll get another one. I had these kinds of thoughts for my children though.",
            "All the time ❤️",
            "I'm watching one of them right now.",
            "If you don't, I'm not sure you love your pet.",
            "Everyone but monsters. :)",
            "Yes I do ,and  I am lucky my to have my little dog. He's my buddy.",
            "My spouse says that when I'm drunk, I cry over how much I love my dogs. Definitely look at them in wonder of how much I love them (sober too).",
            "Does my wife count as a pet? Because if she does, then yes",
            "Yes. And I’m glad I did, because my cat suddenly died recently and I’m so glad I cherished those moments.",
            "[deleted]",
            "It's a dog, get a gf/bf or kids and grow up.",
            "Wait, do people not do this?",
            "I think more about how i wanna eat em",
            "How grateful the dog to have me",
            "I don't live with the pet I grew up with so my brain immediately went to my bf and I gave myself a bit of ick for a sec",
            "Every chance I get <3",
            "Listen, it may not be easy to hear this,  but you all need to procreate. This is the same shit you'd say about your kids, if you had them. Clearly, you don't have children, but you know who do? The dumbasses. The fuckups. The ones who really shouldn't have kids.\n\nPlease, screw to save your species. Thanks.",
            "No. This is what happens when a society focuses so much on \"individualism\" than human relations and neighbourhood contacts are considered aberrations rather than the norm. Also explains the U.S' (and the collective West's) pseudo-imperialiastic bloodlust.",
            "No, I fucking hate my pet. Any time it makes noise or comes near me it think of how much I hate it and how disgusting animals are. People aren't lucky to have pets, pets are lucky to have people. Pets provide nothing of value and are more of a burden than not.\n\nI don't abuse my pet, but I really wish I didn't have one. For some reason my girlfriend enjoys its company or some shit, so I put up with it because she is worth it.",
            "I absolutely hate that breed of dog you have. My neighbors have on of those horrible evil things, so damn annoying",
            "They don't even have to be sleeping for me to look at my pups and feel so blessed to have them in my life!",
            "Better than humans\n\nEdit: Come on now, you know I'm right.",
            "Kinda. I do think about them but more in terms of how they would taste, pounds of food they would yield in a smoker, how long they would last without more or in park. That kind of thing. How long it could doggy paddle also",
            "Only right before I eat one.",
            "Nope",
            "Yes!!",
            "Oh yeah, constantly.",
            "Yes, everyday",
            "yep! all the time!",
            "Everyday",
            "You have a beautiful furbaby! 😍",
            "I wonder what they dream about and when they have this great life how can they have bad dreams and who do I need to hurt for making them yelp in their sleep. \nMy puppy Is my favorite person",
            "Yep.",
            "Absolutely. Just look at my little buddy and smile",
            "Absolutely. My wife says I have more pictures of our dog than I have of her. Which is true, because when ever I try to take a picture of my wife, she puts her hands in front of her face and says “nooooo!” 😁😁",
            "Every single day, multiple times a day. It provides me with an indescribable amount of joy and serenity. Priceless really.",
            "All the time. One of my kitties is so particular about her sleeping spots that when she finally finds one we are both relieved, lol.",
            "Every bloody day.  I love these 2 little old shih tzus..  ruby and Gus..   so grateful",
            "Absolutely, all the time. My 'pup' is old now; he turned 11 this month. Now I find myself watching him as he sleeps and being both thankful for 11 years and terrified of losing him.",
            "Every. Day.",
            "I hear my dogs snore and I get all happy or see my cat all cuddled up in my lap or with one of the dogs and my heart swells. My pets make everything better and some of them didn't come from loving homes so I also just think how peaceful and happy they are sleeping, sprawled out on my couch or bed, all covered up with blankets. \n\nMy pets have made my life better and happier and I just hope I'm doing the same for them.",
            "Always. And I can't resist giving her a little scratch behind the ear....",
            "I watch my cats all the time.  The youngest is just so freakin' cute when he sleeps!  The positions, snoring and if he is near me then he has to touch me. Then I remember what an asshole he can be! Lol. But I still love him!",
            "I've had my cat for 15-16 years and I still get overwhelmed with how cute she is and how glad I am to have her sometimes",
            "Your pet sleeps?\n\n\\-mal owner here",
            "[yes. ](https://i.imgur.com/QXb1frC.jpg)",
            "all the time",
            "All the time!",
            "Absolutely!!! We love our cats. They aren't even super cute and energetic kittens anymore, but I could watch them for hours. And do sometimes. It's just so cool and amazing how 2 different species, humans and cats, somehow understand each other enough to live together...and love each other. Even if the cats would eat us if we died. LOL",
            "Absolutely. I’ve always slept with my dogs and the feeling of warmth and security is overwhelming. I like when they stretch out on their backs with legs straight in the air while I read for a bit. They feel safe, too. I used to spoon my little spaniel mix every night and fall asleep with him in my arms. I still miss him every day.",
            "All the time! And it makes me so happy to know that I was able to adopt my two little babies from the shelter and give them a nice, comfortable, happy life.",
            "Everyday.  I think when I’m looking it’s partly jealousy.   I’ll look at my dog and just think, “I want your life in this house.”",
            "Absolutely",
            "Yes! So glad I’m not alone!",
            "All the time.",
            "Yes.",
            "All the time",
            "My favorite dog just snuggled closer to me on the couch and I was so overwhelmed with love. I would go to war for this dog.",
            "Constantly! My babies mean everything to me! My doggo likes to whine a lot in his sleep. My favorite thing is when hes whining but also wagging his tail. I like to imagine hes dreaming of getting a bunch of his favorite treats."
        ]
    }
]