[
    {
        "post_id": "m6em3r",
        "author": "casual_microwave",
        "title": "Why don’t we have a nocturnal society where all the night owls pick up where the day shift left off?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/m6em3r/why_dont_we_have_a_nocturnal_society_where_all/",
        "score": 24577,
        "num_comments": 1398,
        "created_utc": 1615916239.0,
        "selftext": "We could have malls, restaurants and stuff open at like 2:00am\n\nedit: come on guys it’s not like I never leave the house past 6pm. I know some stores in some places are 24 hours and there’s plenty of night-only jobs, but it’s not like everyone can go to a sit down restaurant at 3:33am or go to the dentist at midnight. I’m saying it would be cool if the same jobs available during the day were available at night!",
        "permalink": "/r/NoStupidQuestions/comments/m6em3r/why_dont_we_have_a_nocturnal_society_where_all/",
        "comments": [
            "Las Vegas is pretty much a 24 hour city. You can buy breakfast with a pitcher any hour of the day.",
            "Depending on where you live, that already happens.",
            "tl;dr: There is a kind of nocturnal society that most people just aren't aware of.\n\nNight crew guy here. In a way there *is* a nocturnal society: Truck drivers, warehouse people, people overnight in grocery stores that keep the shelves stocked, cops, ambulance crews, doctors and nurses, people who do road construction, people that keep power plants running, linemen that keep the power going when lines get taken out, clerks at stores, security guards...I've got to be missing at least a million.\n\nSo, so much goes on at night that most people wouldn't think or be aware of. The world doesn't stop at night. IMHO most of the important things that keep society running are handled by people like me who are \"invisible\". And I don't mean invisible in a derogatory way. Its just that people don't realize that we're there. They shouldn't! If people really have an occasion to think about us it means that somebody messed up somewhere along the way.",
            "In most places outside of big cities, this would simply not be profitable and would likely end up making companies lose money due to overhead costs of paying employees during those hours.",
            "This is a concept that gets explored in [Rant](https://en.wikipedia.org/wiki/Rant_(novel)). What happens is that the night shift half of society starts becoming the underclass for a variety of reasons and it snowballs. Everything pretty much starts from the problem that most people would prefer not to be nocturnal.\n\nI’m not saying this is book is a study of what would necessarily happen but it’s an interesting take.",
            "[deleted]",
            "People keep talking about night shift stuff and the places they frequent,  but I don't think that's what you're asking at all. Eating at the gas station or Denny's for the fiftieth time in a row is nothing like having school, hobby stuff, shopping, parks, and other common life stuff throughout the whole night.\n\nThe reasons for not maintaining that are mostly pragmatic. Lighting has been costly throughout history whether it's firewood, candles, gas, or electricity. Human health doesn't work as well on a night schedule. Vitamin D from direct sun exposure. Circadian rhythm performed by the pineal gland using melatonin. That recently discovered thing where viewing large amounts of greenery helps depression.  There are many small health things that add up to suggest humans work best when exposed to daylight hours and sleeping in dark hours.\n\nDarkness is also potentially dangerous. Driving is a bit more dangerous. General awareness can be tougher. Small things like an increased risk of tripping can really add up if you apply it to the vast majority of the population. \n\nFamilies are also a consideration. Especially families with children. It can be very difficult to parent a kid with a sleep schedule that is wildly different from the kid's. But school is the center of childhood and having two school shifts would be very costly to the school district. Especially in places with smaller populations.",
            "When o worked on outsourcing,  we worked with a company that operated 8 hour shifts with each desk being shared by 3 people, as 1 person got out of thier seat, another person sat into it.\nIt ensured people never worked longer than paid and that production went 24 hrs.\nWas only 5 days a week so system maintenance happened at weekend. Worked great for us, but logistics for company to manage transport, food, etc meant only large companies could achieve it",
            "Everybody here missing the point big time, what you're asking, OP, is something like [B-society](https://www.b-society.org/chronobiology/).\n\nI've particularly given this topic quite a bit of thought because I'm a night owl and would love to not feel trapped at my own house when I feel most active. \n\nThe biggest trouble implementing something like that is how do you merge a society that sleeps at different times? Specially when it comes to noise in residential areas, imagine a B person wants to have a BBQ party at their house at their preferred time but the A people need to be at work in less than 4 hours and the music and loudness is really fucking up their sleep. And the other way around is also true, if an A person has a party at a normal time they'd be fucking up B people sleep.\n\nThis is just one example but what I'm trying to get at is that with people being active comes noise, from traffic to people simply talking and working, basically there would never be a specific time of the day where people can expect silence and peacefully sleep which would fuck up quality of life for everybody.\n\nPlus this would be a monumental change in society, and monumental changes like that don't simply happen.",
            "yeah, this already happens. Thank the staff that do the night shifts",
            "This would be awesome for Disney World, especially in the Florida summers. Yeah it will still be 90 but I won’t get skin cancer on Dumbo.",
            "Not enough people want it to make it profitable.",
            "I've often wondered this. As a nightowl I see things going in the opposite direction though. Every store I used to know that was open 24 hours last year is now open 12\\~ hours post pandemic.",
            "When I went to malaga we would get up at 3 pm, go to the beach until sunset, walk back to the city center to eat at around 11 or 12, and then go clubbing until sunrise. The only quiet time was around 6-8 am, when most people were either just waking up or just going to sleep. The only people on the street were sweepers, trash collectors etc.\n\nSo basically, it was a nocturnal society. The mix of old tourist following a normal schedule, young tourists following an inverted schedule, and citizens following all kinds of schedules, there always was someone on the streets. I saw literal toddlers at 1 am there.",
            "I've always said if I were a dentist I'd be open from like 11pm to 7am. Everyone's teeth problems usually happen when the dentists are closed. \n\nI'd love it. But even our 24 hour stores closed down due to covid",
            "[deleted]",
            "God, I'd love that. I'm tired during the day and wide awake at night, always has been that way.\n\nAlso I love how the comments here are acting like this is ridiculous because Vegas and 24 hour restaurants exist, as if they're not the vast minority",
            "No matter what the time is, there is a benefit to everyone working at the same time.  There is also benefit to staggering work hours.  Which one is bigger is dependent on the industry.  Many factories run 24/7, while office jobs tend to be pretty strictly \"business hours\".\n\nSocial activates obviously benefit from being at the same time.  Could you imagine just not practically being able to be friends with half the population because they're on the opposite schedule from you?",
            "I would LOVE that!!! I'd really enjoy being on the \"graveyard shift\" because night time is my favorite. But the fact that it can sometimes be really creepy and that almost everything is closed puts a damper on things. \n\nOP, would you be a daytime person or a nighttime person?",
            "I wish. They wonder why night owls get sick more often. Hmm. Probably because they're forced to live in and adjust to a morning person's world.",
            "Because non-nocturnal people are a bunch of fucking Judgey McJudgersons. I've got an appointment with a new doc tomorrow because I think I've identified the sleep disorder I've been dealing with for 15-20 years and am sick of hearing fucking medical professionals laugh and say \"and you've tried advil pm?\" So I'm going to get the god damn diagnosis and update my medical records with a big fat \"ffffuuuuuuuuuucccckkkkk yyyyyyyoooooooouuuuuuu!\" To all the medical professionals for not listening for over 15 years.",
            "I am always frustrated that smaller or even average sized cities basically shut down around 9pm, especially now with covid it's so much worse. I go through periods of a few months where I will stay up until 5 or 6 a.m. and sleep later. It's ridiculous not to be able to get dinner somewhere at 10pm unless it's taco bell. I can say this, in my small town in Ohio, there is always one 24-hour store. Circle K. And the only time they are not busy is somewhere between 2-4 a.m. Given that the one and only 24 hour shop in a town of 15,000 is always busy, I actually think there is a much larger population of people that are night owls than most realize. I'd be more than happy to go grab food or just go out after dark, but everything shuts down early so I don't have the option.",
            "You've heard of New York City, right?  \n\n\nSome malls are open well after midnight, especially with theaters and food courts.   Retail stores in malls are rarely open overnight since so few people shop then.  \nBut, there are plenty of all night restaurants, hair salons, gyms, bowling alleys, dry cleaners, grocery stores, theaters, and other places open 24 hours.",
            "Because the night shift is terrible.",
            "I recently told my son someone should open a shopping center in our area that's only open at night. Night shifters need to shop too!",
            "I feel like I would join this society of night people...",
            "[deleted]",
            "Other answers are leaving out 2 important factors: normalisation and an asymmetrical playing field.        \n\nNormalisation is strong in human society. I guess it conferred an evolutionary advantage to bands of hunter-gatherers if they all followed the same rules.  We've inherited that in the form of pushing people into standardised boxes (hetero like me, same religion as me, same politics as me, *it's 3 minutes after 9 why aren't you at your desk?*).\n\nThen there's the uneven playing field.  Woody Allen once said we have nothing to fear from aliens who are 1000's of years more advanced than us, because we wouldn't be interesting to them.  It's the aliens who are 20 minutes ahead of us we have to fear. They'll get the parking spots, the best seats at restaurants....     \n\nSo it goes with early risers. They arrive first and declare themselves more reliable.  They compare themselves to night owls at an hour which favours themselves and they don't just declare *themselves* more productive but they declare *that time of day* more productive.     \n\nAnd *that's* the thing which gets fed into the normalisation process.      \n\nMaybe one day placing value on the night owls will be the thing which gets normalised.",
            "Because it would be inefficient. The reason we settled on 9-5ish is not just due to daylight, but because it’s easier to conduct businesses with other businesses when you’re all operating at the same time\n\nI also doubt most night owls would be interested in working at night- they’d probably prefer the work day to start a few hours later",
            "Big cities its no problem, I live in a large town/small city in the midwest. The 24 hour places that are open around me are the grocery stores and a pharmacy and there is usually a handful of people in them after midnight. We had 2 twenty four hour restaurants and one cut their hours and started closing at 10 because they just didn't have the people worth it to stay open.\n\nI guess out of big cities it's just not profitable.",
            "A move to night living will accelerate dramatically when global warming really starts showing its teeth ... It's already happening in a few places, Kuwait is an example.",
            "I'm only a night owl because that's when I don't have responsibilities",
            "Most Nightowls enjoy the night cause life slows to a crawl, reducing noise and responsibility, bringing calm. In your exemple you'd just take the night away from those who love it and just turn it in to a darker day.",
            "I worked overnights for too long, the day shift has absolutely no consideration for people's sleep schedules. Mandatory meeting at 10 am? Could we have a mandatory meeting at 10 pm just once maybe even if it's when day people are normally asleep? No effing way.\n\nIf they had a mandatory meeting during the day I'd take the shift after off. When asked why I told my boss that it'd be the same as him getting up at 1 am for a meeting and being expected to show up for your shift at 6. Have the meeting at 6 pm? No way because the manager doesn't want to come in on his off time like he's requiring swing and graves to do.\n\nIf day people had more consideration for night people it would be more of a thing. Humans are naturally diurnal, night owls are a rare breed.",
            "[deleted]",
            "It's unrealistic in low population/demand areas.",
            "It happens to some extent and even when it doesnt, we are already quite a bit more nocturnal than previous centuries for obvious reasons. In teh summer where I live you can see parents buying icecream with their kids at 2-3am (well, pre covid).\n\nMost people are not night owls though, and even though I am one, I recognize that it might not be all that beneficial to the company due to that and is better to have employees working in the time is convenient for most (though theres many factories working 24/7) and that applies to schools too.\n\n&#x200B;\n\nThat said, the more society advances, say, generations born pre 1960-1970 retire,  virtual payment becomes the norm everywhere, remote work takes off, working (when possible) towards a goal and not to fill hours, shift shrinking in length, automatization, etc etc, then nocturnal life would probably get even bigger imho, because there would simply be more time and more reasons to be awake. Though this wont happen immediately, suddenly nor everywhere",
            "I wouldn't mind, I like night\n\nproblem is, if there were more people, night would loose all the nice quiet, also people living in night would have severe lack of vitamin D\n\nalso good luck sleeping when there is still tons of people outside doing noise",
            "We're moving in that direction, but as with everything, change is slow and people are very resistant to anything unfamiliar. \n\nFor example, many city dwellers are afraid they won't be able to get any sleep if everything is open 24/7. And while these fears may be justified, it's no excuse to not make this change. Rather, we should be watchful when designing our cities to protect people's ability to sleep peacefully.",
            "I totally get what you're saying. Fuck everyone who doesn't.",
            "As someone who has done shift work, this just makes sense. With my schedule some weeks, doing normal tasks between shifts was hard.\n\nIf I needed to see the bank, good fricken luck with their hours.\n\nMy wife had an ultrasound appointment for our 3rd baby at 10 AM.  I got off at 6 AM. I was barely conscious the whole appointment and don't remember much of it.",
            "Normalize this life",
            "I just miss being able to go to the grocery store after work.\n\nI work second shift so I get off work at 11 pm. \n\nNow like everything is closed by 10 or midnight",
            "I would vote for that!",
            "[deleted]",
            "If everything was open 24 hours, imagine all the jobs that would be created.",
            "That's when vampires come out",
            "I don't know and I seriously wonder why. It'll help me",
            "Ive been thinking the same thing, discrimination towards nightowls is just as stupid as any other type.",
            "Something something Industrial Revolution.",
            "I went to university in a city with a small \"normal\" population, two large universities and two colleges. The population of this city was *overwhelmingly* made up of students and fresh graduates. These are the exact kinds of people who are most likely to stay up late at night - not just because their schedules often allow it, but also because many of them need to cram for a test (or want to party). A situation like that is one in which you would have an extremely high percentage of the population up late, and thus is most likely of any place in the world to support 24-hour shops and things. But there were two malls smack between the universities, both within walking distance of both campuses, both with clubs and restaurants and pizza joints and the kinds of places that you'd think would be most eager to cater to the night-owl student population... and of the 40+ different retailers in those two malls, there were maybe 5 or 6 that stayed open to weird hours. Only one was legitimately 24 hour (a convenience store) - the others were just open until around 2 or 3am. And they were largely empty during the late night. There was a small rush at the restaurants (pizza place, gyro place, all-day breakfast diner, and a ramen bar) when a nearby bar closed, which is probably why they stayed open that late, but they all closed about an hour after that. That was it. Even in a university town, even in the most ideal context for trying to create the situation you're talking about... most places still closed, because not enough people were awake to justify keeping most of the shops open past 10, and most of the restaurants around midnight.\n\nAdd to that the fact that a lot of employers aren't going to want their employees working weird late hours anyway. Even if I *wanted* to work from 6pm to 2am, I wouldn't be able to. I work as a programmer, where being able to talk to my coworkers is important. My team has 5 people. They're not going to split us into two teams. They're *definitely* not going to split us into three teams (which would be necessary to cover the full 24 hour set). And sure, yeah, you might wanna know what this has to do with anything - I'm a programmer, so my office doesn't need to be open 24 hours, right? Only the shop down the street does in order to create the kind of world you're talking about. Except because I keep normal 9-5 hours because that's how my office operates, and because the vast majority of my neighbours do the same, for the same reasons, it doesn't matter if most of us are secretly night owls because we still have to keep normal hours regardless and will not shop at the store at 4am. So the store isn't gonna see any reason to pay to be open at 4am.\n\nYou need a city big enough to have enough night owls and night-shift workers to justify keeping a few places open. And in those cities (or in places where night shifts are unusually common), you get exactly that. But it's only ever a fairly limited number of stores that stay open to these weird hours - you'll never end up in a situation where every shop is open all the time. It's not economically feasible.",
            "We'd need double the number of teachers. My kids would all do better if school went from 8pm till 3am.",
            "I work in a hospital and there is definitely a nighttime culture there. People who work nights are really a breed apart from day shift folks. I worked nights earlier in my career and there are several things I liked about it - I could quietly get my work done and not feel rushed, because patients are mostly asleep and families/visitors are either at home for the night or asleep themselves.",
            "I’d love to be able to buy a book in my area past 8 pm.",
            "Humans are diurnal. There were very few 'night owls' before electric lights and especially home electronics. [1.5% to 2.5% of modern hunter gatherers have chronic insomnia compared with 10% to 30% of people in industrialized societies.](https://www.cell.com/current-biology/fulltext/S0960-9822\\(15\\)01157-4?_returnURL=https%3A%2F%2Flinkinghub.elsevier.com%2Fretrieve%2Fpii%2FS0960982215011574%3Fshowall%3Dtrue) When moved into a natural lighting environment most people quickly adapt to sleeping during the night, and waking near sunrise.",
            "As 'fun' as all that sounds, it has major downsides as well. I'm an evening person myself, too. I loooooce wandering around in a shopping mall in the middle of the night, go have a good meal at 4am and so on, but think of this;\n\n- our society is simply set up as 'active by day'. Many people don't feel safe in the dark, and therefore wouldn't get out by dark. I also feel like (for women) more harrassment takes place once people get drunk and can hide in the dark. These annoying people would also start harrassing staff in the stores and restaurants that are still open. As much as I love wandering around after my work shift around 11pm, I simply can't. More often than not I get yelled at, cat called, name it. And I live in a resort town. Used to live in Amsterdam where on some areas this would be 10x as bad.\n- higher electricity bills, more pollution etc. So environmental not the best thing to do.\n- not profitable for most places as simply most people are completely happy with their 9-5 life. We, night owls, are quite a weird breed on its own. Next to that; where to find the staff that actually want to work these shifts? You could say up the wage, but then you get back to profitability, is it actually worth it? Plus; people would take it just for the wage, is there any quality control left over those people who work sleepy because they're simply not made for it?\n\nLong story short; wouldnt be feasible because of safety, profitability and environmental footprint (and this one counts the least for businesses).",
            "I did night shifts at an underground parking lot for a year in the heart of downtown toronto\n\nI had very limited interaction with people but the ones I did interact with always made me uncomfortable.  I'll never do night shift again, so easy to lose track of the days",
            "I think this would suit the members of r/dspd very well. It’d certainly suit me well!",
            "In some muslim counties such as Emirates and Saudi Arabia the whole country turns nocturnal during Ramadan with some offices even switching to operating during night time. Malls & restaurants & lots of other places stay open till around 5 am!",
            "I would put money down to start a city like this",
            "I found a pub in my city where bartenders and staff from all other places gather after their shifts. It's kind of hidden in a dark alley, in a basement.\n\nThe place is usually empty until 2am or so, peak time is around 5am and they often stay open until 9 or 10 am.\n\nIt's ugly but huge and full of these old leather sofas, you know the incredibly cushy and comfortable ones from thrift stores, each one is a different design.",
            "Why are a lot of things only open from 9-5? Like the post office or the dentist or mechanic. I have to take PTO to do normal things.",
            "I was just talking with a friend today about this. It stinks having to adjust an already crazy sleep schedule due to work just to make doctor appointments/running errands possible. Just an exact flip of everything for us overnight folks seems like it would be possible 🤷‍♂️",
            "I would absolutely love this. I have no earthly idea why, but I gravitate to a night schedule. I’m in business so this doesn’t work but when we have holiday shutdowns and such, within two days my body wants to be up at 6 pm and go to bed around 10am. I love the advent of self service kiosks at the grocery because now they can be open 24 hours. I can chill, do house work, then go to the grocery at 3am in peace. It does suck that the other things in life do not work the same.",
            "This is a huge societal issue.\n\nI’ve been posting about it and discussing the matter with colleagues for years.  All the way back to college and prior.  We’re all in positions now to make a change like this happen if we were to give it a go in our city.\n\nThe number one hindrance is engagement from private businesses.\n\nTake a restaurant, for example.  Which unlucky guinea pig would volunteer to have their shop open between the midnight and 8am shift?  Until offices, schools, public transportation and other establishments start to change their hours and people begin to use those off-hour services, someone will need to take the hit of low traffic, and possibly dangerous hours of operation.",
            "Specifically to the dentist thing: I do know a dentist who does just that.  He's a night owl and performs at his best late in the evening/night.  The *earliest* appointments he gives out are around 8pm, and most of his major dental surgeries start between 11pm-midnight.  It also has the added benefit for his patients that when they get home, they can just take a painkiller and go straight to bed - he usually advises them to work on the day of the procedure, but take the following day or two off.",
            "I'd kill to have classes at 3am. It's when my cognitive functions peak",
            "Would love to see this tbh. Us night owls would have vitamin d deficiency or whatever you get from the sun, but you can take supplements for that. I’d love to have that lifestyle, but sadly my living accommodations don’t support that",
            "I think Japan does this with construction projects. Construction in Japan gets done insanely fast when workers come in and out 24 hours a day.",
            "I've been working 8:30 pm to 6:00 am for 30 years.  I also work alone during that time.  It was either do that or commit suicide from forced human interaction during the day.",
            "That'd be amazing",
            "Can confirm, what day shift doesn't do, night shift will. And vice versa.",
            "There's a great book by Chuck Pahlinuk called \"Rant\" that has a society that does just this. Believe it was a population solution of the future.",
            "I'm tempted to work remotely for eastern Europe or India now that everyone WFH to finally transcend the morning people's oppression on us night owls.",
            "Awesome question. That would be great",
            "I was wondering about places like that - if I needed to get an annual physical exam at the doctors... or to have the head-gasket repaired in my car, go buy a new vehicle, sign a mortgage at the bank, renew my driver’s license... is there anywhere I can do all of these things at say 3 or 4am?",
            "No one wants to do it and companies aren't willing to pay more for a higher incentive. Companies won't pay more because we're already in the habit of not going out at 2 or 3 for the groceries.\n\nOf course there are 24 hour places like petrol stations but that's because people can need petrol at any time and so companies will gladly keep it open to get more money.",
            "I'm just answering since I don't see any top results as answers (as to why there isn't, rather than the correction that there is)...\n\nYes, as many top posts say, there are places like NYC, or Las Vegas, that have many shops open late into the night or 24 hours a day.\n\nBut the reason why there isn't in at least 99% of other places (of the US) is that it doesn't make enough sense. Think of a shop, like a chain grocery store (ignoring Walmart): even if there may be plenty of people saying they'd like shopping at 3AM, that doesn't mean there's plenty of people willing to work those stores at that hour. Now think of a small local store/shop: if they keep tighter hours (like 11AM-5PM, instead of 7AM-9PM), that's because they are trying to balance the average amount of revenue they get hourly, with the expenses to keep it open those hours (like paying employee's), along with keeping it open when it's busiest. That's why a lot of stores aren't open from 5AM-11PM - disadvantageous expensenditures. If a stores open from say, 11AM-5PM, one reason could be because they're confident they will get few to no customers in others hours.",
            "I used to run a radio show in college from 3-6am, or 1-3am depending on the semester. I got quite a few calls and requests each show, about average if not slightly above average from the daytime sets. Night society is cool because people rely on each other more. I guess to combat feeling desolate. People really depended on just having my show around while they were doing whatever they did overnight, and that was a cool feeling.",
            "Dude, as a night shift person I've wondered this endlessly. There are enough things open late that I can do the majority of what needs to be done on my schedule but holy good god when the kids were young...school was the biggest wrench in that plan. And while there are some doctors/lawyers/banks (to do in person banking, yes, that's still required at times)/etc that have later hours, it's still a hassle most of the times to get the later appointments. Not to mention getting anything done that requires dealing with governmental agencies.   \n\nI've imagined a world where everything had an overnight option, complete with indoor facilities that had UV lighting for vitamin d.",
            "Circadian rhythm",
            "Like Night City? In Cyberpunk?",
            "Yeah... this is really thought provoking!",
            "Walmart stayed open for 24 hours during Christmas season about 15 years ago, in my city (Calgary). I'm a night owl, a leisurely shopper, and an introvert. It was so nice to go grocery shopping at 3am with the whole store practically empty. Must not have been good for them economically though, as that was the only year they did it.",
            "This is actually a good question",
            "I was utterly disappointed after spending a few years in NYC, the city that never sleeps, and finding out it pretty much sleeps for half of the night.",
            "In all honesty we should shift towards a more nocturnal lifestyle. One good point being..I’ve never heard of the moon causing skin cancer. You’ll have people say, “But wait...you need vitamin D from the sun”. Studies show you don’t need as much vitamin D as you’re led to believe. Hence the moon might just reflect enough sun rays to give you the perfect amount of vitamin D.",
            "night people are my people",
            "We do it’s called third shift.",
            "I'm a night-owl precisely because it's when the world goes to sleep. There are no demands, no guilt that I should be doing something, no phonecalls to expect, no errands to run. It's just... freedom to be. \n\nEven going out late at night is better because there are fewer cars on the road, fewer annoying people screaming for the manager, overall less obnoxiousness in general.",
            "I use to work graveyard at a gas station in a decent sized city. \n\nThe amount of customers that would come in during the wee hours of the night was almost non existent. My shift was essentially clean and stock all night long until the coffee rush around 5:30am. \n\nI can't imagine there's much demand for 24/7 everything in most places. Day hawks outnumber the night owls.",
            "This would be great for traffic and other “bottlenecking behavior” of us lemmings.  A major problem is that I remember reading about studies that promoted better health through being awake during daylight hours.  I am sorry I cannot reference this, but I myself am terribly impatient with stupid people and sweet elderly people that drive around without urgency during normal business hours and remember being totally bummed out about the same idea not possibly working out.",
            "YES THANK YOU",
            "If there's a big factory in town there's a bar jamming out at\n8am somewhere in the area. When you're third shift you just know the places to go. \n\nHa. One time I was working third shift and I was waiting in my bank's parking lot before they opened to cash my check. For some reason it freaked the employees out and they called the cops about it. I'm sitting there and two cruisers pull up and I was interrogated but ultimately let go. It was an awkward trip to the teller after that.",
            "I want a late night, bank, barber shop, and family physician (not just urgent care).",
            "Tbh I always wonder the same thing. I'm a night owl. No matter how hard I try I don't feel comfortable waking up at 6am and going to bed by 10pm. \n\nI would rather wake up around 4pm and go to bed around 8am. It's when I'm happiest and most active. But I can't live that life where I am. Everything closes around 6pm, some resterants are open to 9pm. After that everything closes except bars and pizza shops which close on weekdays 11pm and weekends 2am. \n\nEven Walmart is closed here by midnight. Public transport stops at 8 basically with 9 being the last run (as in they turn in at 9). Some gas stations and convince stores are open 24/7 here but they are the outlairs and not the norm.",
            "You should definitely read City of Endless Night. It's fiction but crazy interesting.\n\nNot to give the entire summary, but they don't follow daylight hours. Some citizens have 24 hour days, some have 16, etc. They work, sleep, and socialize in completely different shifts and schedules.",
            "As a bonified night owl, I say hell yeah to this idea",
            "It really depends on where you are. As population increases it will be more common to see things open non stop. 3 am dentists appointments are still a ways off though. As a night owl night shift worker, i would very much enjoy 24 hour malls.",
            "As a night shift nurse, I’m always sacrificing my sleep just to wake up early enough to make it to places before they close. This would be really nice",
            "Hospital worker here. BE CAREFUL WHAT YOU WISH FOR. Somebody has to work there and working 10:00pm-7:00am fucking sucks my ass.",
            "I'd fucking kill for this",
            "Because humans are not nocturnal",
            "I think about this sometimes. I work as a retail manager and my job closes at 6p, but so does everything else. I either need to spend my time on break trying to get certain things done or do stuff on my day off and to be honest, thats my clean my house and take long naps while cuddling with my puppy time so I'd rather not.",
            "Our world isn't based in reason, logic or efficacy.",
            "The is literally smart af. Think about how much fun that would be. I'm also picturing a movie/series in which a night person falls in love with a day person and then it just follows their adventures trying to adapt to one another",
            "Yes, this nocturnal society should extend to banks and government services like the DMV",
            "I just wish everything could be available in slightly later hours. I'm a complete night owl and if I have to get stuff done during the day I literally just can't ever go to bed the night before. I have to stay aware through 7 am onwards. It's so obnoxious how everything is open only 7 am-5 pm m-f. Seriously like the dmv, the bank, etc are all open while people are at work exclusively.",
            "Nyc checking in here. Pre-covid, that's a thing already. Has been for a while",
            "ITT: People willfully misinterpreting the question and talking about 24 hour stores.",
            "Both me and my spouse(separated) work overnight- I would love a night school for parents who do this because I really really really want to sleep more!!!!",
            "All of the Middle East turns into a nocturnal society during Ramadan..",
            "The nigh owls dont want to be out. They are night owls because they like the quiet and disconnect. You are literally asking for the opposite, just darker. Night owls arent just about less light",
            "I have insomnia, and a long time of working swing and night shifts.  I loved it when some groceries \nand fast food places began being open all night. I like grocery shopping without other people. What I \ndidn’t like was coming home at 3 am, too darn dark. But a great commute!  Although eating at Dennys \ngets old after awhile. Great thing was working 4/10 hour days, 3 off.  I worked Wed. through Sat. and it \nwas great, plenty of time to take care of all my errands. Worst thing was wearing earplugs, I slept through \n2 fire alarms. But the on-site manager had a key for my apartment, she was a friend. Both fire alarms \nwere just smoke, neighbor upstairs couldn’t cook, but she burned stuff well.",
            "The daytriarchy",
            "As an overnight owl i deeply resent that i cant get pizza or a burger for \"dinner\" after i get home from work at 7am.",
            "That sounds amazing. I would love that kind of society. \n\nThe Middle East has a late night culture around normal eating out & hanging out in coffee shops, shisha places etc. Interestingly the main Starbucks near us in U.K. (not in a busy big city) now stays open till midnight & it seems to be just for the Muslim population around here who want somewhere to hang out at night that doesn’t involve alcohol.",
            "[deleted]",
            "Vegas local. \n\nLet’s not do that. It’s not a healthy lifestyle. It’s not only the people that want to be awake that are awake but that ends up being the spot no one wants but people get trapped in. It also promotes a lot of psychological issues on a community scale and people burn out much faster.",
            "I've seen it only in Asian countries I've visited. When I was in Korea I had BBQ at 8pm then when the party ended and had the drunchies my mates and I went to the same BBQ for breakfast haha. Same can be said about Thailand especially in Bangkok.\n\nI find it super strange Australian shopping centres close at 6pm.",
            "I thought I would love working over night shift, but i always felt \"off\" like for hours I'd feel like I just woke up. I felt more tired than starting work at 7am.   I'm only a night person after being awake for at least 12 hours.",
            "For most things that have to turn a profit, the night is rarely ever profitable.\n\nWorkers still need to be paid, electricity is consumed and operation costs are ongoing even in the night. However, most of your customers are asleep. So you end up paying to operate during a time when nobody is coming in to buy anything.\n\nFor things that don't turn a profit, there is still a pseudo-profit being analyzed. You can look at it as a ratio of sorts, Dollars spent vs. Utility received. A 24/7 Library would have rather exorbitant costs, but offer very little real benefit when analyzed through that lens. If you are tasked with trying to spend Taxpayer dollars for maximum impact and utility, you still find operating things through the night isn't efficient. \n\nThis isn't a universal truth, though. In many denser urban and suburban areas, you will find some facilities are 24/7. This is usually because it has been found that there is at least a *marginal* benefit to doing so. At the very least, those in charge have found that the 24/7 schedule at least breaks even during night hours, and the added convenience can improve daytime business. One example of this is Walmart. If you know Walmart is *always* open, what might be your first choice in a pinch when you need something real quick? \n\nIn theory, I love the idea you bring up OP. I wish our society was like that. Sadly, practicality likes to rain on parades at times.",
            "Most jobs in the heavy duty equipment and tractor field have day and night shift.  Caterpillar, Kenworth, towing companies,  then there the poor unfortunate few like me who handle both times, just a call away.",
            "The worst thing about working nights is that it’s hard to find friends to do things with on your days off so that you stay on schedule. Other than that I freaking love it. I switched to nights because the heat here in WA last year was killing me.",
            "That's basically how most big cities work. In NYC prior to the pandemic you could find some neighborhoods crowded at 3 - 5 in the morning. And most neighborhoods have 24 delis and fast food",
            "The answer as to why it doesn't happen more often might be because humans are diurnal animals and our wellbeing/internal clock is somewhat tied to access to sunlight, and we're instinctually afraid of the dark because that's when predators are out and we're at a disadvantage because we can't see as well\n\nIt could also be that it's just more efficient to have the majority of people sleep at the same time... some businesses might be able to produce more if they shift workers (like factories) but industries that require group work to create new products (tech) can't just shift out their workforce that easily\n\nThat said, it'd be great for people who don't like how crowded society can be, and it'd have been nice to be able to stagger the usage of things like grocery stores more during Covid"
        ]
    },
    {
        "post_id": "xbgm5e",
        "author": "JustTechIt",
        "title": "Do people not rinse their Bananas?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/xbgm5e/do_people_not_rinse_their_bananas/",
        "score": 24566,
        "num_comments": 5725,
        "created_utc": 1662897266.0,
        "selftext": "Last night I went to grab a banana, I gave it a quick rinse in the sink, then proceeded to peel and eat it. My girlfriend nearly lost her mind laughing and making fun of me for rinsing a banana, saying if it has a peel it does not need to be rinsed and just generally making fun of me. I asked her why she rinsed potatoes right before she peels them too and she only said that it was not the same thing. \n\nAm I weird? Do people not rinse their Bananas? If not how do you decide which fruits and veggies need a quick rinse and which do not?",
        "permalink": "/r/NoStupidQuestions/comments/xbgm5e/do_people_not_rinse_their_bananas/",
        "comments": [
            "Well that's new. I don't rinse my bananas.  Potatoes are different because they're much dirtier and I still have to handle and touch the insides as I peel them.",
            "The reason you'd rinse a potato is because the dirt sticks to your hand, or it sticks to the peeler or it gets pushed around. You'd end up getting a bunch of dirt onto the peeled potato, which means you'll have to wash it off later.\n\nWhich is harder now, since the peeled potato is a bit sticky now.\n\n&#x200B;\n\nThis is from experience, btw.",
            "Bananas don’t need to be rinsed, they have a thick protective peel. Potatoes should be rinsed even if you do peel them as you’ll get dirt on your hands and then get that on the inside of the potato.",
            "I don’t rinse it unless I eat the peel",
            "Yes, you are weird. Would you rinse the wrapping on a Snickers?",
            ">>Am I weird?\n\nYes, you are.",
            "Pretty unusual, BUT I’ll rinse the bunch when I bring them home for fruit fly eggs.",
            "Yeah I’m with your gf on this one… do you also rinse an orange before peeling and eating it?",
            "You rinse a potato because when you cut, the blade of the knife transfers bacteria inside. A banana though? Wtf",
            "You dont eat the peel of a banana so I dont see a reason as to why you should wash it. Unlike the banana, potatoes not only have a soft skin but are grown underground. Potatoes need to be rinsed so when peeled, the dirt and other stuff doesnt come into contact with the flesh. Bananas come with a protective coating so you don’t need to do all of that.",
            "I'd laugh if my husband did that.",
            "I don’t wash them but I guess there’s is no harm in it. Same with oranges. If your handling the “dirty” peel and then handling the edible insides with your contaminated hands, you can make the case. \n\nI personally am way too lax about washing stuff.\nHow much good is a simple rinse doing anyway?",
            "I run bananas through the dishwasher just to be safe.",
            "Rinsing is not needed.\n\nPotatoes are rinsed because the peeler pushes what's on the skin into the potato's flesh.\n\nSame with avocado.\n\nNo knife was used in your banana, so washing your hands would be more beneficial.",
            "2 things here: \n\n1.) I worked at production facility for fruits/veggies for over a year. We supplied everyone (To include: Albertsons, Aldi, Trader Joe’s, Sprouts, Piggly Wiggly, Costco, Sam’s Club, BJs, Target, Walmart and Meijer. Just to name a few.) I currently work at a distribution center for everyone’s favorite “Wholesale Club”, in their refrigerated items area, aka fruits and veggies, for the last 4 years. I can tell you with absolute confidence, you should wash ALL STORE BOUGHT FRUITS AND VEGETABLES. Period. Especially bulk packed berries and cherry tomatoes. But tbh, it should just be everything. It is common place for the packaging to break open on these items and the contents roll all around. The workers generally are more worried about getting in trouble for “wasting” the product than sending out clean food. So instead they will sweep up and repackage the product haphazardly right there. Trust me, this is everywhere. It was at both facilities I worked at and have always been told by others that it’s common throughout the industry and even, internationally.\n\n2.) Sorry bud, but you’re still weird. Even after all I’ve seen, I still don’t rinse bananas 😂\n\nTLDR: Suppliers and distributors don’t give a shit about the condition of the product as long as it “makes it to the store.” Rinsing all store bought fruits and veggies is DEFINITELY the way to go.",
            "[deleted]",
            "Nomination for OP getting \"Rinses Bananas\" flair",
            "You are weird. Never seen anyone rinse a banana.",
            "It never occurred to me to rinse a banana, I agree with her. You rinse a potato so that your hands don't get all dirty when handling them while peeling them.\n\nIf you eat the peel like apples you rinse them. If you don't like oranges and bananas you don't. Cucumbers can go either way. You are allowed to rinse them and then eat them without peel anyways.",
            "[deleted]",
            "I've never in my life met anyone who rinse their bananas before eating,each to their own really, other than that I rinse kiwis, n apples before eating..",
            "Now I need to know if you also rinse your eggs 🍳",
            "You are weird in the sense that I haven't seen anyone do it. But now that I think about it, it makes sense to wash oranges at least. You can eat a banana without touching the part you eat with your hands. You can finish it while only touching the peels. But when an orange is dirty and you start peeling it, the dirt will get stuck to your fingers which you will use to grab the orange pieces that you are about to eat making them dirty.",
            "I always rinse my bananas and my oranges too…even if I am peeling them.  Same as I always rinse off the top of a can of soup or soda before I open it.  People always look at me like I’m nuts.",
            "I rinse bananas.\n\nSo I'm weird too.",
            "Do you rinse the wrapper before you have a snickers?",
            "[deleted]",
            "OP you have slightly more germ/dirt conscious eating habits than the average human. Most people don’t rinse what they don’t eat. I’ve never seen anyone rinse a banana before peeling it. \n\nI dated a girl that would would take an extra paper towel and use it to open the door of a public restroom on the way out, so she didn’t have to touch the door. I thought that was weird, but found out that other people do that too. \n\nAs far as are these behaviors weird or a problem or OCDish or whatever, it doesn’t sound like it’s bothering anyone. As long as it’s not alarming to anyone, yourself included, just eat how you wanna eat.",
            "I do, but most people I know don't.\n\nMy reasoning for doing it is that it can have all kinds of dirt from manipulation and residue of pesticides. I don't want to spread that everywhere even if I it doesn't come in contact with what I eat.\n\nRinsing potatoes is a bit different, because if you use a peeler, dirt on the surface on potato can come in contact with what's under the peel.",
            "I rinse them after buying them to get off all the fly eggs",
            "Nearly everyone peels them wrong if that helps",
            "What kind of psycho rinses a banana? Yeah you’re weird lol. I’d say potatoes are indeed different, moving it around to peel you’d spread dirt on the peeled parts of the potato if you don’t rinse it.",
            "I rinse them as soon as they come into the house, to remove fruit fly eggs. After that, no",
            "When I was pregnant I was told to wash everything due to possible listeria. I don't think what you're doing is overly weird, just overly cautious.",
            "Yeah I don't rinse them.\n\nIt's different with potatoes because they have actual dirt on the outside which gets on your hands and then on the peeled potato.",
            ">If not how do you decide which fruits and veggies need a quick rinse and which do not? \n\nIf I'm eating the outside, I rinse it. If I'm composting the outside, I dont bother.",
            "ITT: people who think a quick rinse of cold water kills bacteria..",
            "Chipotle has a policy (or did) where they wash the avacadoes before peeling them because when you cut into them they'll get some outside bacteria or chemicals or whatever the avacado touched inside.\n\nPotatoes have dirt, so again when you cut you want to wash.\n\nBananas however when you peel them, you don't need to cut into the skin, so it should be less of a chance to contaminate, however it's probably not wrong to wash the peel before you handle it since it's been touching grocery store counters.",
            "I dunno. Do you wash the packages of all your groceries?",
            "Who the fuck rinses bananas?",
            "What's weird is you peel it. Amateur",
            "You rinse your bananas????\n\nYou wash fruits and vegetables if you’re going to eat the outside, like a strawberry or tomato. But if there’s protection like the skin of a banana or an avocado, you don’t. You can wash if you’ll be cutting it and you’re worried bacteria will transfer to the inside. But that’s it.",
            "Peeling potatoes still leaves a good chance of debris recontacting the surface of the potato.\n\nI don't see a reason to rinse a banana.",
            "Do people wash their poultry, beef, etc.??",
            "No, its not weird. Its pointless, wasteful and overall dumb.\n\nYou are far too charitable for yourself when asking \"am I weird\", over all the years you never stopped to think \"why am I doing it\" ?\n\nHow to decide - do you eat the skin or is there something on the skin that you dont want for a legitimate reason. \n\nBananas dont meet this criteria unless you eat them with skin\n\nApples do if you eat with skin - there is natural wax on it. \n\nPotatoes are usually shipped to the shop with dirt on it. You dont want dirt on your knife when peeling. \n\nRinse and repeat (pun intended) every time you buy fruits or leave it to GF.",
            "There just isn't any reason to rinse a banana. You're peeling all of that away. Rinsing a potato makes sense, you'll probably miss or purposely leave some skin behind.",
            "You always wash fruit, even bananas. Consider the climate in which they are grown. Ive seen pics of large truckloads of bananas and they are sometimes covered in large hairy spiders. And spiders can carry germs. You are not being silly with this.\n\nEdit: And thats not even considering all the folks handling them at the grocery store before you even select and put in the bag. You peel the dirty banana with your hands and your hands potentially transfer the germs into your mouth. Anything that goes into your mouth should be clean😊",
            "Well you can laugh at your girlfriend now too. If my wife and I need to peel potatoes you do not need to rinse or wash them first because you are taking the peel and dirt off with the peeler... After the potatoes are peeled you then give them a quick rinse before slicing. Washing the potatoes before peeling them are just going to be a wet mess.\nThere is zero reason to rinse potatoes if you are peeling them after. Peel them then rinse any dirt that may be on them.\nAs for bananas, no you don't rinse bananas. They have a very very think peel and you just peel and eat them.\n\nBut now with my information feel free to laugh at your girlfriend for working extra on potatoes. A lot of people will wash,peel,and wash the potatoes again. It's just time consuming.",
            "I’ve never rinsed a banana. Apples, yeah. No shame from me. You do you.",
            "Unless you eat the peal it doesn't make a difference so no we don't wash them",
            "I worked in a grocery store. Rinse the bananas.\n\nOne time a kid puked through a shopping cart like it was a car wash and they just rinsed it off and put it back in rotation",
            "Nothing weird about this. I wash **ALL** produce after buying it. Everybody goes digging through fruits and vegetables poking and prodding at them all to find the \"best\" one. I don't trust them to not contaminate everything in the process. They could well be sick and just prior sneezed into their hand, or just be one of those monsters who never washes their hands at all.",
            "You're [*supposed*](https://foodandnutrition.org/blogs/stone-soup/should-you-be-washing-your-bananas/) to rinse fruits with inedible peels.  \nI would have thought because of chemicals.",
            "I rinse my bananas about half the time. To those people who say you don't need to rinse an avocado or an orange - when you cut the avocado open, whatever dust that settled on it while it was growing will go into the avocaado. When you peel an orange, you touch the inside of the orange after touching the peel. So yes, wash all your fruit.",
            "Oh for Pete’s sake, rinse your banana if you want to! Most of us don’t, but so what. You do what makes you comfortable and your gf should stop making fun of you!",
            "I don't care what you do with your bananas, but you damn sure better wash the outsides of your melons and such. Anything that you slice through needs to be cleaned. That's how there was a huge E coli outbreak years ago, from cantaloupe, because people were slicing the E coli on the outside right through it.\n\nAlso, water doesn't do anything but get rid of dust. I wash certain fruits with a mild, foaming dish soap. And here's why. People are always like, \"You wash your fucking fruit with fucking SOAP? How do you like your mouth full of apple and soap?\" And I'm like... First of all, have you ever heard of rinsing something afterward? And second, we wash our cutlery and dishes and bowls and cups with soap, and is that like taking a mouthful of soap? No, because you have...get this...rinsed it afterward. That said, there are also organic washes specifically meant for fruits and vegetables. I use those when I have them, and for the soap squeamish, they are a good alternative.\n\nAnything that has been handled by the unwashed masses gets washed with dish soap or produce spray by me. Lots of germs gone, no residue remaining. Yum. And that's fine, you can call me a germaphobe, I don't mind. My fruit doesn't have fecal matter and dick germs all over it.",
            "Going against the grain here, but I too wash my bananas because fruit flies often lay their eggs on bananas. Washing them immediately after bringing them home has helped keep those annoying pests from my home.",
            "Potatoes grow in dirt, and the skins don’t come off in one piece. You have to rinse the dirt off so you don’t get the dirt on your hands or the peeler, and spread it onto the peeled parts of the potato. Bananas grow on trees and are easy to peel and eat without touching the inside of the banana.",
            "I've been eating unwashed bananas all my life, to my knowledge none has ever made me sick. This is the first time I've ever heard of the idea, so: BWAHAHAHAHAHAHA! ;)",
            "Ugh, these comments.\n\nIf youd wash your hands before eating a sandwich, youd wash anything else you touch when eating, right?\n\nWhy would you be okay touching a dirty banana, orange, candy bar, etc. wrapper and then touching the part you're eating? It's like listening to people for the last 3 years convince themselves that because they wear gloves they can't contaminate things they touch, as if contaminate can't happen on the gloves themselves.\n\nHave you SEEN what's on your chip dip jars? I've never seen anyone wash them before eating from them. Disgusting.",
            "I do. I live in an Asian household and I've seen all my relatives do it.",
            "You do you.",
            "You're thinking the right way in terms of \"fruit needs cleaning\", OP, people are just making fun of which side of the solution you use.    \n  Store-shelf bananas are covered in a layer of preservative to lessen surface-level bruising and ethylene gas release. While non-toxic in the small amount present, it's not a *BAD* idea to rinse and wipe your bananas from the store, but easiest to rinse your hands after eating a banana instead.",
            "You should always wash your HANDS after touching or peeling a banana because there's always fungicides (like Imazalil) or insecticides (Bifenthrin) on them.",
            "I mean, it's unnecessary, but if it makes you feel good, who is anyone to judge.\n\nMe? I'd passivelly aggressive rinse EVERYTHING before peeling and eating it.",
            "So I had a discussion with mymwife as she's one that does this.  \n\nHer rationale: she's witnessed people pick their nose before rifling through the produce and she's sure that this is far from the worst that's happened to them.  \n\nShe then talked about if you dip a banana in mud, are you able to eat the whole banana without getting any mud on the inside?  Possibly, but you willing to take that risk? \n\nAs a guy who believe thats likely not going to cause any issues, I can't seem to argue against this...",
            "Stop calling op weird , he’s not weird. He’s straight up stupid.",
            "What's wrong with you lol you don't rinse a bag of crisps before eating them, you eat the part of the potato or at least get dirt on your hands while peeling them.",
            "I read the comments and now I’m sad. I rinse bananas, oranges, etc. If I’m away, I would be ok to eat a banana without rinsing, but not at home.  I just want to make sure that both my hand are clean if I decide fo break off a piece for example.   So as far as I understood you are weird, but at least you are not alone in this thing.",
            "This kid has GED written all over him",
            "Never heard of anyone ever washing a banana. Gotta agree with your girl, I’d probably laugh too lol",
            "I’ve never heard of rinsing bananas, and you should only rinse potatoes after you peel them.",
            "I'm pushing 5oy/o from Florida where bananas are common to grow. Never seen this nor heard of it.\n\nPotatoes have dirt on the since they grow underground. You'll smear the dirt around while peeling them if not washed first.",
            "Bananas 1 grow on trees 2 have thick skin. \nPotatoes 1 grow underground 2 have thin skin 3 the potato peeler would get dirt on it making the raw potato dirty",
            "I don’t. Then again I used to open bananas from the nub end, so I don’t think I can be trusted with bananas.",
            "its not wrong to rinse a banana or even an orange. just that it's deemed unnecessary.\n\nthe question that needs to be asked is why are you rinsing them? are you afraid of insecticides that may be on the skin?\n\nthe skin is meant to be peeled and discarded. there's a low chance of cross contamination. i would argue it makes more sense to wash an orange if insecticides were the cause of concern. \n\nbananas? not really.  but the way i see it is, it's akin to rinsing a snicker's plastic wrapping before tearing it up and chomping down. \n\ndo you rinse a snicker's plastic   wrapping?",
            "I thought that was a euphemism, and was gonna say yes you definitely should rinse your banana. But for an actual banana, this is the first time I’ve heard of anyone doing that. Not so much weird as unnecessary, but not, I think, worthy of mockery.",
            "I take it that the folks that are laughing have never had fruit fly problems",
            "The peel of a banana is 2 to 4 milimeters thick , while potato skin is only 0.2 to 0.4 mm thick.  If something managed to contaminate it past the peel then a quick rinse will do less than nothing at cleaning. \n\nDo you also wash your coconuts before eating them?"
        ]
    },
    {
        "post_id": "oxel2n",
        "author": "theflyingegyptian",
        "title": "Why do people make it feel weird to leave work as soon as your shift ends?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/oxel2n/why_do_people_make_it_feel_weird_to_leave_work_as/",
        "score": 24551,
        "num_comments": 2501,
        "created_utc": 1628029675.0,
        "selftext": "So I started a new job and today was the first day of my fourth week. This is my first job in an office setting. My hours are 8-5 with an hour for lunch. \nI usually arrive  5-10 minutes before 8 (except for one day when I missed my exit and was 15 minutes late), and only start working at 8:00 no matter how early I arrive. \n\nAlso as soon as the clock ticks 5 I'm out of there. On my way out I get some weird looks because almost everyone there is still working.\n\nNow I'm salaried and don't get paid overtime so why should I stick around? \n\nThat and I already spend almost an hour commuting each way so I want to get home ASAP to enjoy whatever time I have left before I have to sleep and repeat. \n\nIt's just the looks that I keep getting that make me feel like I'm doing something illegal. \n\nI'm in the US if that makes any difference.",
        "permalink": "/r/NoStupidQuestions/comments/oxel2n/why_do_people_make_it_feel_weird_to_leave_work_as/",
        "comments": [
            "I worked for a company that encouraged you to show up early and the president would walk the office around 5 to see who was staying late. So much turnover there it was crazy.",
            "If you stay late, the one day you leave on time everyone thinks you’re cutting out early. If you leave on time every day, the one day you leave late people are grateful. Only one of these makes actual sense. Took me three jobs to learn that, but on the fourth, I never stayed late. Established my boundaries on day one, and was never questioned about it. \n\nIt sucks that the assumed default is that work somehow bought your life. But they didn’t. Give them what they paid for. Kill it while you’re there. Then leave. You don’t owe them anything more than that.",
            "I worked for someone who pulled me aside one time and commented how I blaze out of work at 5pm everyday on the dot. I simply said if you want me to work later then set my hours later. They never said anything again.",
            "people worship burnout culture for no valid reason",
            "GTFO out as soon as your established work hours end. Starting to linger an extra 15 minutes becomes 1 hour, two hours, checking your email all vacation. Set the boundaries and habits of a healthy work life balance now. I too work with a lot of people that seem to enjoy working for free. Don't be like them.",
            "My boss once pulled me aside to lecture about how important \"Chair Time\" was, it was at that point that I installed Steam on my work computer.\n\nMy productivity has dropped steadily year over year, but my \"Chair time\" stays high and I keep getting raises from my \"On the job commitment\"\n\nIt's a myth that businesses are run efficiently.",
            "I just had this conversation this morning.  A coworker is put off that I bounce when our shift is over.  I'm off the clock.  It's nice to have coworkers that like each other and like to chitty chat at shift change, but.... I'd rather go hang out with my *actual* friends.  Or... I don't know?  Just not be lingering around work while I'm OFF THE CLOCK.",
            "Don't worry about it until unless your supervisor says something. Then if he does start making your escape plan asap",
            "The ONLY way imo that it is acceptable for people to be sticking around after their scheduled work hours is if there is a company culture of flexibility with work time. As an example, in previous jobs I’ve been in, it’s accepted that you’ll do your work and keep track of your own hours, and nobody will say anything if you’re being responsible, getting your work done, attend important meetings, etc. So, maybe you work late sometimes because there’s a lot to do, you’re in the flow of things, whatever, but maybe you also come in late sometimes. Maybe you work some 10 hours days for a week because shit’s crazy at work, but then you take a half day or day off because you’ve earned the extra time.",
            "They got into a habit of working after their shift ends to look good to your boss in the hopes of getting a promotion, and now they're afraid that your lack of playing along makes them look bad somehow.",
            "At a former work place we got new software thats supposed to make clocking in and out easier. The issue was you HAD to clock out at your computer. \n\nBefore the software on my way out I would leave my desk ~5 minutes before my shift end to get the mail and deliver it to another office. That took me about 5 minutes. I would clock out at my co-workers desk. \n\nHR demanded we clock out on our computer so I started taking 10 minutes to get the mail deliver it, walk back to my desk and then clock out. My boss began asking where I went at the end of the day. I explained. Their suggestion was to clock out at my end of day then deliver the mail. I noped that option real fast. 5 minutes a day, 5 days a week adds up.",
            "Lol I don’t have an employee that will work later than the time I pay them too and I’m obviously completely fine with that. Clock strikes four and they are all gone",
            "The glorification of overworking and underpaying has plagued the modern society for a while now.",
            "I've noticed that some employers pay salaries purely as a way to avoid paying overtime. Perhaps there's a little of that going on there?",
            "The 8 hour work day was designed so you can have 8 hours of work, 8 hours of your own time to do what you want, and 8 hours of sleep. Fuck anyone who wants to guilt that time away from you",
            "My boss was talking to me about how Germany views this subject. \nHe was telling me that the culture there is completely different. Working overtime or past your allotted hours is looked down upon. Almost in a sense of you being lazy and not finishing your work for the day in the time given. \nNow I don't know how accurate that is as Ive never been to Germany nor do I know anyone personally from there, but I cling onto it because I like the idea. \nWe follow that rule in our office and we all get to leave on time and enjoy our weekends/holidays. \nIn the US btw.",
            "Idk but fuck em.",
            "They are what we call \"jobworths\" but some of them fall into these categories \n\n1: The guys that are not good at their job so they put extra time in to make up for their ineptitude \n\n2: The manager lovers that would do anything to be on the supervisors \"good side\" so he can put in a good word \n\n3: Decent people that are a bit late with their work\n\n4: People that come late regularly so they try to make up for the time \n\n5: Finally the worst kind \"jobworths\" that take extra pleasure in trying to stay longer than everyone else to look \"dedicated\" and they will stab you in the back in a second by informing the manager you leave early just to get one up on you\n\nThere are many more but these are just examples.",
            "People be petty for the dumbest reasons",
            "Gosh I remember when I worked at a law firm and it was the same for me. At 5 on the dot I was out that bitch and after a while people got used to it. It’s their problem if they didn’t prioritize their work properly and work hard enough to be done by 5pm. And if you don’t get OT why would you stay? Lol screw em",
            "I've been a manager for 20 years.  When I see people working well after their end time, I begin to worry about how they are spending their time.  If their workload is balanced, then they should be finished at the end of the day.  Or if it's a job where there is an unlimited amount of work, then I *expect* them to leave on time.  Being a hero for the company isn't going to earn you any additional money, and the company won't care.  I'd rather you take care of yourself and maintain work/life balance.  We pay you for your day.  Work your day and leave.",
            "They do it in the UK as well if it helps. They are what in is known in the business as \"Wankers\".\n\nThey can also be identified by such helpful comments as:\n\n* \"Leaving early I see\"\n* \"Friday is it?\"\n* \"Long day eh?\"\n* \"Afternoon\" (when you arrive 30 seconds late)\n* \"Wow, you're doing overtime!\" (when leaving 30 seconds late)\n\n The polite response in Essex is, traditionally; \"F\\*&K OFF\"\n\n🙂",
            "Note that working overtime without being paid overtime devalues your salary more than it helps your career.",
            "Might sound playground-ish but they seem jealous.  Of course they all want to clock right out, but they're indoctrinated to stay... You're doing right.",
            "I get the same vibe but I just shrug it off. If there's an emergency or something important that we need to push for, I'll pitch in and when something is critical I have no problem working after hours (I work in medical device so sometimes I get after hours information that concerns patient safety). But on a regular workday I'm working my normal hours.",
            "I worked an office job for exactly one year, and I would get weird looks if I *wasn’t* getting my coat on 5 minutes before day’s end. I felt weird. I always worked til the right time, and not later (but also not earlier), before getting up and packing up and walking out.",
            "Who gives a fuck, leave whenever you want",
            "I work an engineering job , some lady got pissed at me for leaving on time everyday. She said she usually puts in 50+ hours a week for free because that’s just “what you do.” She claims she was trying to help me and make me better. That conversation still annoys me to this day.\n\nEdit: Just for fun, thought to point out that she quit just last week a day after posting this.",
            "Co-workers glorify overworking because they think it makes them more valuable.\n\nBosses glorify overworking because they think they’re getting a better deal.\n\nI once got pulled aside because though my hours were ostensibly 9-5, I ended up working a minimum of 2-4 hours unpaid overtime every single day in order to get everything done. Because of this I started arriving at work at 9:15. I was pulled aside by my boss for turning up late every day. The GM had inquired as to why I seemed to be taking advantage of the company by doing 1:15hr less work every week. I told my boss that I was doing 2-4hrs *every night* of unpaid overtime. My boss said ‘the GM leaves at 5, so he doesn’t see when you leave. As far as he knows, you’re leaving at 5:02.\n\nI made a commitment at that point to only ever work for bosses who care about output (I.e. that the work is done) over the specific hours you spend in the office. If I can do my work in 2 hours, why should I sit there on Facebook for the other 6, just to keep up appearances…? (I know, there’s meetings and on-call requirements etc. but the point still stands).",
            "In previous generations it was how you showed you were a go getter and deserving of raises and accolades. Some of those people passed that ideology on to their children but now it just let's the people in charge know they can pile more work on you. Blaze the fuck out when you hit your hours.",
            "I used to to take this for granted. Leave when it’s time to go, right? Then I worked an industrial construction job that frequently depended on over-night and holiday shut downs to  finish jobs that otherwise couldn’t be completed. \n\nI was in my early 20s, so definitely a little green. I’m with my crew and the boss wanders up to us and asks, “Do you guys want some overtime this weekend?” I respond, “nah, I’m good. Thanks though!”\n\nThe crew around me laughed at me, and the boss smiled and said, “I shouldn’t have asked that way. It’s not really an option.”\n\nI remember being kind of frustrated about it, but the check was huge, the work was essential, and I had been poor for a long time, so that money seemed to solve everything. But I burned out, of course. That lifestyle is unsustainable. \n\nBut staying any longer than 40 hours, and NOT getting paid for it? \n\nGTFO. \n\nI work from home now, so I’m on and off all day, as long as I deliver, it doesn’t matter. I can’t tell you how many times I sat in the office in the “before times”, when work was slow, just scrolling though Reddit until 5 rolled around. It’s fucking preposterous.",
            "Used to work in fast food and it was a job where you couldn't leave until you were done, sometimes meant me staying a few hours after my shift was over! Everybody just took it as the normal thing and I guess I got caught up in that mindset. It was my first paying job and I was too young to complain but I got out of there and got happier.\n\nNow I work in a hospital and it isn't common for me to have to stay late but if it does happen it's to wait for urgent results and never longer than 40 minutes (which I am paid overtime for!). Strange that a fast food place needed more work than a hospital but I guess that's down to budget or staffing I guess!",
            "I've noticed there's a very toxic work culture, at least in the USA and Mexico (places where I've worked). For some reason people tend to overstay at their workplaces, they're always trying to make it look like they're doing something (even though it's normally only when a supervisor is around) and they find it very easy to criticize if somebody is taking a break or enjoying something/having fun with peers. I'd say, do your job the best you can, but always prioritize your well-being and don't care about what your peers think or say (they're frustrated and will always find something to judge, no matter what you do). Try to enjoy what you do for a job but keep it only as a part of your life, and take time to build and enjoy all the others (your friends, family, hobbies, etc.)",
            "Is this a US thing? I have never seen this in the Netherlands. Please tell if I'm wrong.",
            "I really can't believe I lucked out with my new office job. EVERYBODY but the head boss leaves exactly at 8 hours.\n\nThe reasoning: the work will still be there tomorrow. Overtime isn't allowed often but when it is, it is genuinely voluntary. No side eyes or veiled threats. If you can, great. If not, don't worry about it.\n\nI couldn't see myself tolerating an environment that didn't operate this way.",
            "I used to be proud of working longer than others, working harder than others. As I got older and experienced many different jobs, I learned that you're just stupid for doing extra for free. Everyone else leaves on time and is less stressed. Nobody will give you a bonus or reward for working your ass off because you're replaceable. Although I've been promoted several times, I don't recommend the stress and inevitable burnout.",
            "My coworkers tried to shame me into staying saying stuff like \"haha it must be 5pm already cuz PinkHoneyFox is ready to step outside\", and I just replied yeah, it is see you tomorrow. Left the company in a month.",
            "Does everybody start at 8am?\n\nMany workplaces have core hours and flex hours so people can work 7-3 or 10-6 depending on what works best for them. \n\nYou shouldn't be getting weird looks so long as all your work is complete and there's not some urgent crisis that needs tending to.",
            "I’m a teacher and I started leaving at the end of my contract hours about two years ago. I also don’t take work home. We need to normalize leaving on time and starting on time too",
            "Focus on the looks you get from the people who can fire you. The rest is noise.",
            "Is the work done?  Are you ready for the next day?  Are you hitting or exceeding all your benchmarks?  Then fuck them, leave.  I promise you results are worth infinitely more than number of hours worked.  \n\nProof: I work for a Fortune 100, and I write critical code and test critical systems before and after go-live.  Over the years, I have written enough automation and triggering code that literally 90% or what I do is automatically done for me, and all I have to do is validate failures and update the automation between releases to account for changes in the production code.  Other people on the team bust their balls for 60+ hours a week.  I am up for management later this year, and they aren't.  Enough said.",
            "I feel like the only time you should have to stay after for work is if it’s your passion and you want to work hard to achieve a goal or something. Other wise this work worship culture bullshit ruins a lot of careers for a lot of people. Some bosses think that their employees should care about their business as much as they do.",
            "Got hired for a job 3-11. I clocked out at 11, everyone bitched and moaned that I left a half hour earlier than them, when I was hired they said 3-11 so I kept at that. Keep doing what you’re doing. You’re right.",
            "You're in the US, and that's the difference. You're expected to show slavish devotion to the company at all times.",
            "[deleted]",
            "I've been salaried for 30 years. I almost never work more than 40 hours. I've been content with that and not trying to \"move up\".",
            "My manager got mad at me and told me “you show up at the time you’re scheduled EVERY DAY. I expect you to be here 5 minutes early” and all I could think was ‘am I seriously getting in trouble for being at work on time?’",
            "Because they're scared\nDo your job, go the fuck home.\nDon't be a spineless jelly fish like your co-workers.",
            "Get out of there and live your life.",
            "I make it a point whenever I get a new job, new position, hell even in the military...changing shops or getting new responsibilities\n\nI make sure 100% to ask about the work schedule, multiple times for reiteration. \n\na lot of the guys in my unit work 8-4 or 9-5. my specific shop(im the only one in my unit) with other people works 6am-2pm. \n\nI make sure at my initial and midterm yearly reviews to ask my boss \"youre still cool with me working this schedule right\". \n\ncuz that guy comes in at like 9/10 and works till 7. \n\nso far it's been chill, as long as work gets done and results are put on paper. I had the same feeling as you, it feels weird sometimes leaving before others because they came in later and especially if you work somewhere that has \"busy hours\"\n\nfor me, and for our office, the busy hours are 10-2, so leaving RIGHT at 2pm is a lot like leaving the grocery store as a cashier right before the sunday rush.\n\nit feels wrong but....thats when i was scheduled to leave, good luck everyone else.",
            "People in the US are straight up brainwashed to think that work is the highest honor one can have in life. They make it a personal characteristic about how devoted they are to work. Start early, stay late, work through lunch(or not take it at all), come in on weekends. It's legitimately insane how much some people think work makes them a better person. I for one, hate work, always have and always will. I do it because I have to, because I need a paycheck so that I can semi-enjoy my time off and maybe have a comfortable future. Work sucks and people who like work suck even more.",
            "If you dont have anything else to do and you dont get payed extra, then fuck that, i wish i could do it, but i work in food and thats basically impossible out of rude ass costumer. Do your shit and clock as you are payed, fuck whoever gives you the dirty looks, the work is getting done.",
            "Why the fuck are they not leaving too lol?",
            "https://www.youtube.com/watch?v=9bvcyGyzj7Y\n\nThis vid sums it up perfectly. Turn on the subtitles!",
            "You need to establish clear boundaries especially at work. You are absolutely within your rights to leave on time. If other people find it weird, it’s on them. It’s not admirable to constantly stay late, in fact it’s slaving away with no extra pay",
            "My shop closes at 5 pm Monday through Thursday, and 4 pm Friday. The boss literally starts flipping breakers, turning off the lights and telling us to wrap it up about 5 minutes before the end of the day.",
            "Depends on the culture of your particular workplace. It could certainly be unhealthy expectation as the majority of responses here assume. It could also be that your workplace expects salaried workers to act like real salaried workers. Salaried is supposed to mean that you get paid for completing your work responsibilities, not for working a set number of hours. So, in theory, you go home when you’re done. That could be 5 min early, 5 min late, 30 min early, 2hr late, whatever. So if you always leave at exactly 5:00, it indicates that you are working to the clock rather than to the task, which is not what salaried work is supposed to be.",
            "You say you're salaried.  My parents in their careers were salaried, and in their jobs, that meant that they're paid to get the job done, regardless of how long it takes.  If they finished early, fine.  If they didn't finish in a normal 8 hour work day, they were expected to be there nights and weekends to get things done.\n\nA lot of times jobs put people on salary because they know the job is more than 40 hours a week and they don't want to pay overtime.  Perhaps your job is like that and all of your coworkers know that, so they think it's weird that you're leaving.  In some professions you'll be fired if you're not staying overtime when you need to.  I don't know what kind of job you signed up for, but are you in one of those professions?\n\nMost of the time, salaried means you don't have a \"shift\".  Are you used to shift work?  Salaried can mean you work when and how hard you need to, without regards to a set \"shift\".\n\nI'm not saying it's great.  I'm saying that's how it is.  How you handle is up to you.  Are you getting all your work done?",
            "You are applying an hourly schedule to a position that does not have hours.  It doesn't mean you have to sacrifice your life but it does mean you better be getting everything done.  You can be both a successful professional and a happy person.  Sometimes it will mean leaving early with no ramifications.  Other times it means staying late.  You admit it's your first job in an office setting.  I think you are viewing it based on hours worked rather than work product produced.",
            "I agree that people in the US work too much, and you should leave at 5 if you're done for the day, but being salaried often (usually?) means you don't have a set 'shift.'  So that you're working very rigid hours is kind of weird, especially the not starting until 8 on the dot even if you're there early. Obviously I don't know what your job is, so perhaps the coverage 8-12 & 1-5 is strictly required, but for the other people in your office it may not be, so they're working more flexibly or just need to get certain tasks done before they call it a day. Or they arrive later and thus work later - I'm not a morning person, so I tend to start my day at 9 unless I have an earlier meeting, so I tend to work until 6.\n\nAs long as you're accomplishing what you need to get done each day/week, that shouldn't be an issue, but it could still be out of step with your workplace culture which could hurt you long term (depending on your role, what yardstick is used for meeting vs exceeding expectations, and your goals).  \n\nIt would probably be a good thing to talk to your manager about or another coworker (perhaps someone who's more of a peer) though, just to make sure you're not majorly missing expectations. (And if those expectations are to stay late for no good reason, then you'll know that this isn't the best job for you long term and can start planning your escape)",
            "That's an American thing. Gotta be a slave to your company, never take a vacation and show up sick. Most are afraid if they don't do extra for free they may get fired.",
            "You will find that most people who are persistently work overtime have very poor time management skills that they won't admit to.  If you can't get your job done in the specified hours, then this is your problem you need to work on.\n\nIn past I have been asked why I never stay behind myself & my simple answer is \"what would you like me to do in that extra time - sit there & twiddle my thumbs?\".  If you are working efficiently, then you should have spare time during work hours.",
            "Some people think that their time is gonna be rewarded, maybe your coworkers have been there long enough to know that they will be, but if you’re salaried and you know that it isn’t rewarded, never ever work overtime.",
            ">\tI’m in the US if that makes any difference\n\nIt does.",
            "you sure its them giving you weird looks, or you just looking for weird looks",
            "If you leave right on the dot at a salary job people will judge you. Notice you’re the first one leaving.\n\nNow you can decide how you want to value or interpret that judgement. But you are correct, your coworkers are judging you.",
            "I guess it kinda depends on the workplace and the employees' culture.\n\nIn my previous place, the majority of the employees are young adults and female (not sure if this is relevant, but mentioning it just in case), and it was exactly like you described. In my current place, the gender split is more 50:50 and the majority are 30's-40's people with some middle-aged ones, and almost everyone that's not the cleaning staff actually clocks out 5-10 minutes before the bell rings, and the bosses are cool with it.",
            "What is your job?\n\nObviously if you're a surgeon it's frowned upon to just bounce in the middle of a surgical procedure",
            "If you get paid to work. Work. If you don't. Don't.\n\nIf you get paid to work and don't do anything at work... well good luck\n\nIf you dont get paid to work and still work... hope you have a good reason. Saying \"everyone else does it\" is NOT A REASON.",
            "So that your boss can properly engage in wage theft and make you work overtime for free",
            "Youve never worked a DOD job.   At 5:00:12 that place was a ghost town.  No body stays late there.",
            "I don’t understand why you have to wait until 8 to start. If you’re salaried and you show up early, why can’t you start early and then leave early if you finish your work for the day?",
            "At my old job people would stay 30 mins to an hour later… the job didn’t pay us past 3.\nI didn’t get it.",
            "My manager pulled me into his office about this once and after a bit of a conversation basically admitted that it’s more about perspective than performance so then I pretended to be more engaged at work and now he thinks I’m real good at my job when I’ve changed literally nothing. Business is dumb",
            "Ive seen really good people quit and be very blunt about workplace schedules.  Lead team would routinely schedule meetings that started 10 min before the end of the day and new managers would ask why or just leave cause they have kids and responsibilities.  Its so messed that they want you to put work before family.",
            "They shouldn't but they do. Some people are just clock watchers, if you end up with a manager that expects you to start working as soon as you're shift starts and stay a bit longer than your paid time then they don't care about your wellbeing and it's time to switch manager or job.",
            "Reddit is very anti-work so I'm going to throw a different opinion in the mix. \n\nIf I was working on an email and the clock struck 5, I'd probably spend an extra 5 minutes finishing that email if it means I don't have to deal with it tomorrow. I get the viewpoint of give an inch and they'll take a mile, but in context I think it makes sense to just stick around an extra 5 minutes if it's relevant.",
            "Nothing wrong with leaving on time to me, but if they did say something to you I would leave out the part that you have a long commute to consider, bc that's not there problem.",
            "Whether this is okay or not kind of depends on you and your boss.\n\nFirstly you are salaried so I'm guessing its not really how many hours you work that matters to your company but if your projects are completed or parameters are met within a deadline.  Salaried doesn't mean I work 40 hours a week and get $X.  It mean you can work 32 hours or 72 hours and still get $X.  Teachers are salaried and thus have to do stuff like grade papers after hours.  Or my brother in IT work is on call for network failures at hospitals.  Or if you managed a store you would be expected to show up if an employee called off on your day off.  \n\nSo at the end of the day it isn't your hours, it's the job expectations.  If you are leaving early and slowly falling behind you probably won't last long.  And if you are new and everyone else is staying over you need to ask yourself if you think you are just more efficient than everyone or if you are leaving part of your job undone.",
            "If you arrive 10 minutes early, why are you waiting until 8 on the dot to start working. That is weird behaviour. \nDo you also start your lunchbreak at the specific time and won't work until bang on 1 hour later?",
            ">I’m in the US if that makes any difference. \n\nIt does. We suck when it comes to this.",
            "This mentality is so prevalent in the car sales industry that you will literally get shit from management or coworkers for leaving on time when you don’t have a customer or an appointment for later in the day. Popular joke is to call you a “part timer” despite the 12-14 the work days, like Jesus, I am a dad of a small child and I’d like to see my family for more than 30 mins in the morning before work",
            "I had a boss that made you feel weird about leaving. I had a coworker that would just leave when his shift was over. She never even bothered making comments to him. He established a boundary and stuck to it.\n\nMy advise is if the employer isn't making clear statements that you should stay, then just leave if you want to.\n\nI would advise you to ignore any part of toxic office culture you don't like and focus on being productive."
        ]
    },
    {
        "post_id": "92ielw",
        "author": "Weedsmoker4hunnid20",
        "title": "Why on earth am i hearing clicking noises in my headphones????? This has never happened to me before. Is someone hacking into my laptop?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/92ielw/why_on_earth_am_i_hearing_clicking_noises_in_my/",
        "score": 24543,
        "num_comments": 681,
        "created_utc": 1532742142.0,
        "selftext": "I've tried deleting every tab and nothing has worked. It's like a click that has reverb, very odd sound. Now its making some kind of bass-y sound and now theres more clicking again. any help?\n\nEdit: Apparently it was because i had my music program open and my laptops mic was on and picked up every key i pressed and click and i had everything recording into my music program. So now i have 10 minutes of typing and clicking as an audio click with extra reverb\n\nThe clicking was me typing\n\nI'm dumb",
        "permalink": "/r/NoStupidQuestions/comments/92ielw/why_on_earth_am_i_hearing_clicking_noises_in_my/",
        "comments": [
            "Please for the love of god upload the audio. It would make this whole train wreck complete",
            "This might be the best post on the history on the sub. It perfectly captures the essence of the subreddit. Like, it perfectly rides the line between so ridiculous that it wouldn't be taken seriously in any other subreddit, but not outright stupid enough to just be brushed off, it wasn't a maliciously stupid or unabashedly/unapologetic-ally ignorant, just unaware. ",
            "Why would somebody hacking into your laptop cause strange clicking noises?",
            "[removed]",
            "[removed]",
            "make some sick beats out of that recording",
            "[removed]",
            "[removed]",
            "[deleted]",
            "[removed]",
            "In after edit but I was going to suggest it was a fan, when I have my desk fan on near my dac it sometimes clicks ",
            "could have been, your cellphone was too near your computer.\n",
            "Don't worry, dude, it happens to the best of us.\n\nFor more than a year I thought that reddit or RES had implemented an 'auto refresh' feature. Which was driving me crazy. Every time I went back at the reddit tab, the frontpage was slightly different. The order of the submissions shifted and links gone. Videos and gifs would stop playing in the preview as the frontpage auto refreshed every other minute. The worst part is that I wasn't finding anyone who had a similar problem on google, anywhere.  Today I decided to go deep to resolve this. Spent whole half an hour to get rid of this 'feature' which seemed that 1) didn't bother anyone but me, 2) I was the only one who got an auto refresh reddit.\n\nand then, after years, I remember that I installed a 'Reddit Auto Refresh' addon\n\nI was probably baked when I installed this. Probably to follow updates of a live event. Probably Charlottesville.\n\nBut now... I play videos on the preview and it doesn't stop anymore. Gifs load until the end and I can watch without fear of having it gone from the front page at any given moment. It is a relief, but also to fell stupid, and I am one of the best of us.  ",
            "[removed]",
            "For future reference: static can cause 'ticking' sounds.\n\nTo test if it static, move around.\n\nNow stand up, did the sound go away?",
            ">Weedsmoker4hunnid20\n\nUsername checks out. ",
            "In the future OP if you ever notice your computer (or any other electrical device such as your phone) doing something it shouldn't be, it's usually just easier to turn it off then back on again and see if that fixes the problem. I know this sounds like obvious advice, but it's amazing how many people forget to give this step a go before seeking out help for whatever issue they're experiencing. ",
            "Please. Please upload the track. We need it. ",
            "[removed]",
            "Aliens. It's aliens. ",
            "You're really testing the name of this sub.",
            "r/stupidquestions",
            "Tagged you as \"Accidentally Recorded Typing Clicks\" (unless anyone has a better tag?)",
            "Thought this belongs to r/security, but no.....\nIt belongs to r/watchpeopledieinside.....",
            "Username checks out",
            "Username checks out",
            "I swear, each time a post from here reaches the front page, it's always the worlds dumbest shit \n\nBut then again, I guess that's the point of the sub",
            "Now you have to sample the audio you recorded and use it in a beat",
            "Name says it all lol",
            "You are literally just stupid ",
            "r/thathappened",
            "Your the monster at the end of the book ",
            "You're not dumb, its just all that weed you've been smoking",
            "This sub is a god damn karma farm. Do you guys actually believe that this person thought that their typing was a glitch in the headphones? Lmao.",
            "Thaaaat's fucking hysterical. I was gonna say there could be something wrong with the audio jack or cable in your headphones, as this tends to cause a sort of clicking sound for me sometimes. But I like your explanation better. Bravo. This post will go down in history.",
            "This is the best ever. I’m glad you figured it out!! ",
            "Think for a second here. What do you have on your laptop that someone would actually want. No I'm not referring to the cache of family photos you have stored on there as a back up. I hear lots of people acting like they got hacked but you pretty much have nothing that someone putting in the time to hack things would want",
            "Username checks out",
            "Username checks out. ",
            "Yes.\nYou apparently. ",
            "Thank you, sincerely, for this OP.\n\nGod bless summer reddit.",
            "give us the audio. someone will remix it into something awesome, if you dont do it yourself.",
            "That's best sign that your are being hacked, the song of the hackers, to the average person it's just a clicking sound, but to the hackers it's their anthem. ",
            "username checks out",
            "Bro... chop it up, add a chorus, BOOM. Summer’s next hot album ",
            "What exactly is happening here? I’m not seeing any real answers. Please, very confused right now. ",
            "I love this subreddit",
            "!RemindMe 2 days",
            "Wish I knew what Mr 800 upvotes had to say",
            "This is awesome.   /u/broddelmeister",
            "I actually had a pair of headphones that would crackle a little bit, almost like someone crinkling a plastic wrapper, however only when working out. Eventually it started to literally shock me inside my ears. I'm guessing it had something to do with sweat but it was a very strange sensation. Shock therapy for my ear canals.",
            "Username checks out",
            "this equivalent to those animal vids getting angry and fight their mirror image..",
            "My friend was on house arrest and had clicking over her phone line because everything was recorded ",
            "Can... can we have the recording?",
            "Am I too late for this moment of reddit history?",
            "Save. ",
            "Lol. ",
            "Your user name explains everything haha ",
            "After reading this post twice, I've just realised he said clicking and not clucking! I thought he was getting chicken noises in his headphones.",
            "!RemindMe 2 days",
            "send me it ill turn it into a beat",
            "Yes.",
            "What is that mysterious click noise ",
            "Yes",
            "*I'm in*",
            "You might be dumb but you're not stupid. ",
            "I’m so honored to be seeing this godlike post. \n\nINCREDIBLE. ",
            "Wtf",
            "I did the same while eating. Sounds like ASRM",
            "RemindMe! 2 \"Check audio file\" ",
            "I need to to be your friend. Plz dm me your Xbox gamer tag ",
            "Oh wow it’s PS4 nvm :(",
            "Yes",
            "Is it possible there's a carbon monoxide problem?",
            "Big brother is watching",
            "Wouldn't be surprised if you used Ableton because this shit happens to me all the time. ",
            "RemindMe! 2 days",
            "It's like my history teacher always told me, there are no stupid questions... only stupid people",
            "!RemindMe 2 days",
            "UsErNaMe CHeCKs OUT",
            "!Remindme 2 days",
            "This is so hilariously human I love it ",
            "Dude, what kind of shit are you smoking, and can I have some?",
            "Are they sound cancelling, my Bose sound cancelling ones click continuously when the battery gets low.",
            "*THE CALL IS COMING FROM INSIDE THE HOUSE*",
            "The clicking is coming from...INSIDE THE HOUSE!",
            "[one click, or two?](https://youtu.be/gfpqSxEAJDA)",
            "I almost every time hear a static in my earphones while they are plugged in the laptop. But there is no static if it is plugged in my phone.",
            "Bait",
            "The golden part is the last sentence",
            "Might have a virus man. I used to have random mouse clicking go off and found out it was a virus. ",
            "As funny as this post may be, I'm pretty sure that hearing audible noises through your headphones is a legitimate phenomenon. Apparently speakers can also double as mics or something, so you'll somehow hear whatever your headphones are connected to in the long distance or something. Happened to me a couple times",
            "/r/thathappend ",
            "you're not dumb. :)",
            "Worst short term scenario: bug.\n\nWorst long term scenario: bug in design that means it's obsolete.",
            "Sometimes I question the name of this sub.",
            "are we witnessing Reddit history",
            " Wow",
            "When there was clicking in my headphones I took them off and found a bug inside. ",
            "Glad you worked it out by yourself and gave useful knowledge to others, seriously.",
            " ** **",
            "I usually try to be nice about this stuff but you're an idiot. ",
            "Yeah this happens in ableton live if you use the onboard sound card drivers and arm a track for recording.",
            "But think of the pranks on others yoy can now pull with thst recording?  \"You hear it too?  I think we're being hacked!\"\n\nYou Dumb? No, not really, legitimate-ish concern, with a simple reason you didn't think of, happens to everyone now and again.",
            "!remindme 2 days",
            "The clicking was you searching the clicking sound lol... *Clickception*\n\n\n\n*Takes another hit *",
            ">Is someone hacking into my laptop\n\nLol, I'm sorry, I know what sub this is but that had me laughing. ",
            "I had a similar thing, too, recently. I had my phone's Bluetooth on when I got in my car and kept hearing this loop of clicks and whirs coming from.my car's speakers. It was so structured that I didn't figure it was interference or something mechanical on my car. It really freaked me out and I had a wide range of theories from the mundane to the wild: \"is my car intercepting government radios\", \"is my car possessed\", \"am I losing my mind\".\n\nTurns out I left a looping video of a hard drive failure open in the background.",
            "The clicking record could make a good ASMR ",
            "Oh my this reminds of... /u/Mavee",
            "Ooh ooh I wanna be a part of Reddit history!",
            "!RemindMe 2 days",
            "🤣",
            "Lmao. What had you been smoking on man? I trying to taste that strain.",
            "Beautiful post, I enjoyed this way too much! ",
            "Probably the needle skipping",
            "No stupid questions and it turns out op is dumb. Perfect ",
            "You may be dumb, but your question is not stupid.",
            "this is one of the funniest things I've seen in a while",
            "Yeah dude. You are totally being hacked. You should totally write a letter to your congressman, dude.",
            "r/MechanicalKeyboards",
            "To make it better, the username fits.",
            "Username weedsmoker and he was doing this. Lmao!!",
            "r/bestof ",
            "How is the top comment not user name checks out????",
            "FYI- It happens in noise cancellation headphones if your battery is dying.",
            "anxiety levels rises",
            "To make you feel better OP, this isn't a completely ridiculous question!\n\nHackers are constantly looking for creative ways to bridge airgaps and audio is certainly a viable option\n\nThere's also an entire school of hacking called phreaking which largely relies on playing specific audio tones into a telephone network to invoke hidden functions.",
            "It’s the government!",
            "Username checks out",
            "Fucking Redditch is broke again. First the betelfish and now this. It's the starter solenoid fer crying out loud, you've got a weak battery.",
            "Question is; how did you wind it down to being hacked in the first place?",
            "r/somestupidquestionsIguess",
            "I live for this type of question",
            "How high are you?",
            "I guess you've solved it by now, but with my old headphones, they would make a static-y clicking noise whenever I used them while they were charging. Maybe this is something similar.",
            "[deleted]",
            "ever get that recording of it?",
            "Upload the audio please!",
            "A",
            "Yes, yes you are extremely dumb. "
        ]
    },
    {
        "post_id": "ggk37s",
        "author": "None",
        "title": "Why do we give serial killers cool nicknames that borderline glamourise them? Why can’t we just give them stupid names like “The Cowardly Dipshit” or something?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ggk37s/why_do_we_give_serial_killers_cool_nicknames_that/",
        "score": 24524,
        "num_comments": 858,
        "created_utc": 1589046807.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/ggk37s/why_do_we_give_serial_killers_cool_nicknames_that/",
        "comments": [
            "The news gives them the names. They're meant to catch attention, scare the public, and most importantly get readers/viewers. It's all about making money\n\nEdit: a bunch of people brought up the fact that it also helps law enforcement track down the culprit. There's a lot of validity in this and I saw I was getting a bunch of up votes so I don't want that point to get lost in the sea of comments\n\nStill, this concept of fear mongering for money still applies. See: \"murder\" hornets (aka Asian giant hornets) and COVID 19",
            "Mainly, news stations want to boost ratings, and giving the serial killer a scary name makes people more likely to tune in and get updates.",
            "So true! When my daughter was murdered the media tried to focus on her killer but i went and talked to the news stations in my area and asked them if they had to talk about it to make the story more focused on her and how she lived not the rest. Thankfully the majority listened but there was one who didn't and it still makes me so upset. Christmas eve this news stations aired ta story about everything with a big picture of him. Its hard grieving then being surprised by his face.\n\nThe more the public contacts news stations and expresses they don't want stories to be focused on or glamourizing killers the higher of a chance they will stop. We are their ratings we decide what they show by watching what they show or changing the channel.",
            "The media tends to do it with serial killers whose identities are as yet unknown. Saying BTK is easier and more effective than referring to him as “the horrendous, yet to be identified murderer of x people in Wichita area whose MO is to bind, torture and kill his victims” in every article or news report. Sometimes the names are made up by police and then the media gets wind of what is meant to be an internal nickname only and start using it all the time. But I get your point.\n\nEdit: typo",
            "Theres like a 0.5% chance someone owns up to a cool nickname like the \"Bay Harbour Butcher\"\n\nNo one's owning up to the \"Micro Penised Overcompensater\"",
            "Sometimes the serial killer names himself sometimes the cops do it when they're discussing the case.",
            "Besides sensationalism, often times the names are accurate depictions. The riverside killer was called so because of the location. The iceman was called so because he hid bodies in freezers. Zodia killer is called that because that's how he addresses himself. The list can go on.",
            "This is a good idea and I will start doing it. \n\nCharles Manson? More like SMARLES BAD SON\n\nJack Unterweger? More like JACK UNDIES BELCHER\n\nZodiac Killer? More like UGLY STUPID BUTTFACE WHOSE BUTT IS TOO TINY TO POOP",
            "Personally I’d rather not be murdered, but if I was I’d rather be killed by the “Red Handed Strangler” than being known as one of the victims of “The Cowardly Dipshit”",
            "I remember that they rebranded “The Golden State Killer” as such so they would get more media coverage, and therefore more funding, to be able to solve the case.",
            "[deleted]",
            "Not even just serial killers, the media has renamed the \"Asian Giant Hornet\" into \"Murder Hornets.\" So people will panic and view their articles more. Only one Murder Hornet has been found in Washington and it was dead. The news are making people go into mass panic only so they get more views on their articles and money. Media is simply a business, and the purpose of a business is to make money.",
            "\"The Green River Fuckup\"\n\n\"The Dayton Dumbass\"\n\n\"The Golden State Shithead\"",
            "Scranton Stranger sounds a lot nicer and is more to the point than “The Scranton Scumbag.” Who is he? A strangler. Where is he? In Scranton. Boom! Now all of the office is on alert",
            "Deep down all of us find it interesting and want them to have cool nicknames",
            "Somewhat similar... We had a mass shooting in NZ at a mosque and our prime minister made sure that no one knew his name and focused on his act of terrorism and the victims... I don’t even know his name to this day. That way his act wasn’t sensationalised and he didn’t gain the notoriety that he wanted it also helps with copy cats or other who wish to do similar events. \n\n\nhttps://www.google.com/amp/s/www.bbc.com/news/amp/world-asia-47620630",
            "Drum up money probably. I'm fond of calling them things like Serial #45 and Shooter #67. Take all the glitz out of it.",
            "There was Mr Stinky in Australia",
            "Not really related, but in Australia; when someone punches another person in the head with no warning, it was called a ’king hit’. However a few years back everyone just got together and renamed it a ‘cowards punch’. Because anyone who does that shit is a cowardly cunt and not a king.",
            "Because criminals are endlessly fascinating. It’s undeniable and unavoidable. Al Capone, Billy the Kid, Julian Assange, Pirates, gangster rappers, heist movies. Everyone loves stories about criminals. I watched play about the columbine shooting once.",
            "Aside from media sensation, the police will use nicknames because it identifies what that person's method of operation is.  For example, if the police called someone Cowardly Dipshit, that would describe every criminal in America.  However, if they call someone BTK (bind, torture, kill) then they have idea of what the person did and can tie multiple crimes together.  A name like the Green River Killer is way to track the geographical habits of the killer. The police use these operational names, but often the media gets wind of them and then glamorizes them.",
            "Examples?",
            "\"Yeah, my brother was killed by The Cowardly Dipshit. It was awful.\"",
            "More on the developing \"Tiny dick strangler\" cases at 9...",
            "I would love to hear a newsreader say that. \"The Cowardly Dipshit has struck again. Citizens are asked to keep a lookout for the Cowardly Dipshit and be sure you don't assume it's pretty much anyone you encounter because it will be the one who peeps into your windows, masturbates and then tries to fling their ejaculate at you, much like a monkey does at the zoo. Generally speaking, Police do not believe it will be the neighbour who puts their dog poo into your garbage bin under the cover of darkness. That person is ALSO a cowardly dipshit but not THE cowardly dipshit. Now onto the weather.\"",
            "Borderline grandiose nicknames for serial killers are more the fodder of fiction. \n\nIn real life names like “The Boston Strangler” are given because a person in Boston was strangling people. \n\nAnd the “Son of Sam” and “the zodiac Killer” contacted the press and announced themselves as that. \n\nI do agree that once a serial killer is caught they should get the shittiest version of a new media nickname. \n\nSo the “Golden State Killer” can now be known as “The Dickless Dipshit”.",
            "People blame the news stations, but the media doesn't choose what names stick in the public consciousness, and the fact is people find serial killers to be lurid and fascinating despite their horrors. \n\nIt's kind of like why not every war movie has to be some heavy handed finger wagging lecture and sometimes we can enjoy a hero blowing up a bunch of bad guys, even though the true consequences of war are innumerable personal tragedies. Humanity is imperfect, and just like we can't live in a world without deviant killers, we can't live in a world where every thought we have is pure and positive.",
            "I don't know why \"The Cowardly Dipshit\" is so fucking funny but it made my entire day",
            "Media sensationalism, a cool name sold papers and generated revenue",
            "Because \"serial killer kills another person\" isn't as sexy as \"the next victim succumbs to the beverly hills butcher!\". It sells more papers, gets more clicks and make people want to keep on top of his pattern so they're not next.",
            "What kind of bothers me is how we’re still talking about bundy and all those other sick fucks. Producing movies about them and shit. They wanted that. We shouldn’t forget the victims but the sick perpetrators",
            "What everyone else said but occasionally, a serial killer might give themselves a nickname (like BTK and Zodiac). It helps readers/viewers/listeners know who is being talked about on the news if you refer to them by the name they gave themselves, especially when they haven't been caught.\n\nPeople like to keep the name because it makes headlines 'sexier'",
            "He wasn’t a serial killer but in Toronto we recently had a criminal who earned the moniker “the peepee poopoo man”",
            "The only one I can think of with a dumb name is the 'weepy voiced killer'. He was a serial killer active At. Paul Minnesota around 1980. Killed three women with two more attempted. He got his name because he would call the police while crying to tell them that he'd just committed another crime",
            "Honestly I’d rather buy a newspaper that called the killer a cowardly dipshit than one that glamorizes them",
            "BTK ( Dennis Rader ) was such a looser and ego-manic he was disappointment that the media didn't give him a \"cool\" serial killer name.  So he wrote in and suggested \"BTK\".  So, they called him that.  I think that they should have named him the \"TL\" killer, for Total Looser.",
            "Some people online were trying to dub EAR/ONS as the \"Baby Dick Killer\" or something like that, because of his small penis.",
            "90% of the time it is the news doing it for more clicks or sales and therefore, revenue. Sometimes the police give it (unabomber) and some times it is the killer (BTK) but those are the exceptions. \n\nIt is never \"us\" as serial killers get their names once law enforcement can link killings together. That can only be done with insider info like details of MO, victimology, etc.",
            "That’s what Last Podcast On The Left does. Mocks them all mercilessly and it is so satisfying",
            "Neckbeard\n\nPimple Popper\n\nPit Stain\n\nPiddle Pants\n\nAss Canker\n\nShart Stain\n\nDiaper Ass\n\nPile of Suet With An Asshole For a Mouth\n\nThe possibilities are endless.",
            "Not answering your question but I’m pretty sure this became popular when, during the Jack the Ripper murders, someone sent a letter to the Scotland Yard claiming to be the murderer and the signed it “Jack the Ripper.”  Tons of fake letters were sent so it most likely didn’t even come from him.",
            "Because \"The cowardly dipshit\" would be too close to the political climate.",
            "This whole thread is highlighting a problem that doesn't really exist anymore. Yes, the media did this, but not recently. All of the examples, Zodiac, The Night Stalker, Jack the Ripper, are decades old. Trashy tabloid media in the 70s and 80s (or 1880s) did this and popularized these villains but I honestly can't think of a recent case with a notoriety boosting nickname.\n\nThere was a serial killer in Toronto that was arrested a few years ago. Bruce McArthur, but I had to look him up just now because his story wasn't sensationalized.\n\nRobert Pickton killed dozens of women in the Vancouver area earlier this century, no scary nickname that I know of. \n\nA lot of high profile killers in recent years are spree killers that seem more tied to where they attacked than a nickname. Virginia Tech. El Paso Wal Mart. Las Vegas Country Music Festival. \n\nI agree this did happen for years and was problematic but acting like it's an ongoing issue seems off base. I'm Canadian and see Canadian news a lot, hence my examples, so maybe this is happening and I don't see it but my experience is this being a problem of the past.",
            "It's the same with MURDER HORNETS, which haven't actually murdered anybody in the US. It's used by the news to scare people so they will read the story",
            "Because the Media is not on our side, they will do anything to make the situation worse to generate more viewership.",
            "the Bay Harbor Butcher",
            "\"It's the media\" is an umbrella term I wish people wouldn't default to for everything. Serial killers are named either by specifically \\*tabloid\\* media (meaning the shocking/sensational stories and twists up front, from unreliable sources, as opposed to your local news channel, who have to make a choice to go with that or another term) or an amalgam of the location and kind of killings, like how police or the FBI would describe them in the office. The names appear to originate from a handful of sources, not just \"the media\", which really could mean a large variety of things.  \nTo give them silly names would be to undermine the severity of the crimes, as tempting as it is to call an asshole an asshole. It also lets regular assholes off the hook a bit, which ain't so good, either. I get what you're saying, though.",
            "Seems like someone watched limitless, this is exactly what brian finch said.",
            "Wait we give serial killers nicknames?",
            "It is believed that a journalist came up with the name “ Jack the Ripper,” when penning a fake letter To London’s Central News Agency. That was in 1888.",
            "It's definitely mostly media, but maybe to some extent it's related to gallow's humor? It's easier to deal with if the person has a funny/cool/ridiculous name.",
            "The Ponytail Prowler?",
            "Catchy nicknames sell papers",
            "Because \"the cowardly dipshit\" doesnt sounds good for a newspaper or for a Hollywood movie.",
            "We'd run out of insulting names.",
            "Ted “the dickhead who murdered and raped women because he was a sick fuck” Bundy",
            "Yes! Take my poor people's gold. 🏅",
            "Gavin De Becker had a similar idea in his book \"The Gift of Fear\" but was talking about potential shooters being caught. It's always phrased as \"their lair\" and how \"well prepared\" they were which makes it seem cool. He would prefer the news cover it like they're losers and it was really easy for the cops to catch them, because the police are smarter than them. The whole book is great too.",
            "RIGHT? Honestly I feel like they give them those nicknames to make people scared. If we gave someone like BTK the nickname Butt Tootin’ KeefJeefer people wouldn’t be so scared and would actually fight him off while laughing.\n\n“Who do you think you are, big man? You think I’m scared of the Butt Tootin’ KeefJeefer?”",
            "Cause if it bleeds it leads",
            "The media gives them their nickname.  The media wants to get readers, either clicks or sold papers.  The media is not going to kneecap themselves by giving them a nickname that people don’t care about.",
            "Similar to the UK media dubbing ISIS terrorists 'the Beatles' and 'Jihadi John'. It sells. Sadly.",
            "Yes, please demean a serial killer on the loose because that will always end well.\n\nThere are plenty of quotes from victims and victim's family members, et cetera, after an attack calling the offender weak, cowardly, and so on and so forth.\n\nThe press are the ones who don these grim monikers unto these killers and I'm not saying it's morally right, because it's messed up, but would you take the threat more seriously by locking your doors and being more vigilant, e.g. Richard Ramirez \"The Night Stalker,\" if they were called the Moron Dipshit Coward Predator?",
            "Because the media doesnt care about the implications of glorifying these peices of trash, they just care about ratings and profits. There's a song by Disturbed called Legion of Monsters that covers this really well, I suggest giving it a listen.",
            "Albert “Needle Dick” Fish",
            "Vlad the Incontinent does sound less glamorous than Vlad the Impaler.",
            "I don’t think any serial killers have had any cool shit about them since the 90s",
            "I would agree a little more if people didn’t commonly know what these guys did. Like John Wayne Gacy for instance. Even though he was called the killer clown, people don’t forget he targeted and raped young boys. That stigma is always engrained with JWG, no matter how many times he’s branded as “the Killer Clown”.",
            "There’s an old Wonderella comic that covered this idea. \n\n[comic](https://imgur.com/gallery/5dSs8p4)",
            "I don't know the answer to this, but it reminds me of this V\n\nTo quote Alex Hirsch: \n\n>News outlets should have to refer to mass shooters simply as “Shooter #86, Shooter #87” etc. Never say their names, never show their faces, never promise future copycats a shred of glory, only present them as the grim growing statistic they are",
            "It’s the disgusting main stream media. Enemy of the people.",
            "I remember an old cold case where they tagged the perpetrator The Weepy Voice Killer because he would call police crying to report his crimes.\n\nI've always been partial to Bobby Dipshit the Stupid Murderer.",
            "It’s because lots of people are fascinated by them. If people didn’t find them so interesting they probably wouldn’t receive any sort of name at all. They would he treated like any other criminal.",
            "The media.",
            "Ever notice how we do the opposite with hurricanes though, and give it some overly innocuous name? Like \"Hurricane Sandy has reached Category 5 earlier today. It could level an entire city.\" There's still a bunch of people who are like, \"Meh, it's not that bad. I'll ride it out.\" \n\nI feel like they'd take it a lot more seriously if they heard, \"Hurricane Zodiac Killer has reached Category 5 and is coming to fuck you up! In other news, the killer known as Cowardly Dipshit claimed his 14th victim yesterday, leaving a bloody trail of horror across the country.\"",
            "Most of them named themselves. Son of Sam, BTK.",
            "Violence is a way to gain power over others, and in a culture that thrives on domination and venerates the powerful, violent people are easy to idolize and make money/social capital off of. In wider culture, you can look at our \"heroes\" in the military that literally murder and control others as a job. In popular culture, exactly as you've mentioned, serial killers become cult figures (just look at tiktok, there's legit dozens of accounts that post romantic/sympathetic content about serial killers).",
            "The Scranton Strangler",
            "I dunno about these other guys, but I'd love to see a news article titled: Cowardly Dipshit fails to kill cashier in armed gas station robbery!\n\nTake notes news stations.",
            "You may enjoy, The Last Podcast on the Left, they do exactly this. Serial killers deserve to be made fun of not glorified. We should point them out to be the terrible mouth breathing idiots they are.",
            "Chicago has “The Duck Walk Killer.”\n\nHe hasn’t been caught but I hope wherever he is, it chafes his balls that he is most famous for having a stupid walk.\n\n\nhttps://en.m.wikipedia.org/wiki/Duck_Walk_Killer",
            "I wish they would do a similar thing for school shooters and  terrorists. Let's talk about the victims, not the perpetrators. A lot of young people committing these crimes do it for notoriety, and blasting their names all over the place only gives them what they want and encourages others to do the same.\n\nSomehow I think they'll find it less appealing if the headlines were something like \"Pathetic bigot attacks church\". Or \"Bitter cockwomble shoots up school\". Or even just \"12 die in shooting by unnamed perpetrator\"\n\nAlso, it leads to innocent family members being harassed and threatened.",
            "If Criminal Minds has taught me anything, you're basically right. All nicknames do is encourage or piss them off.",
            "We don't anymore, your question is the reason.",
            "It's not \"we\", it's the media. And they don't care about lives lost but popularity.",
            "this same question was asked on limitless",
            "We did that in Australia. There were a spate of “one-punch” or “king hit” attacks and a few people even died. Basically knocking someone out when they weren’t looking. It was repopularised as a “coward punch”.",
            "The hash slinging slasher",
            "The Dastardly Dipshit",
            "Cool names sells paper",
            "Because we’re fascinated by them.",
            "Better yet, never name them, there should be no glory in killing",
            "\"\\[...\\]by the coward, John Wilkes Booth.\"\n\nThat's the proper way.",
            "We should not be naming them at all. Giving them names does what you say, glamorizing them. Instead they should be given numbers, showing other people who might want to copy their deeds that they're just pieces of shit and that the copiers won't get any recognition for committing disgusting crimes for attention.",
            "24hr news cycle",
            "Let's not forget the Oregon Sheriff that refused to release the mass shooters name. Stand tall.",
            "I regret that I have but one like to give",
            "The news can make a story out of\n\nBREAKING NEWS! Bob the bitch killed 15 people from behind with a sawed off shot gun, as the cops would wait to respond to cased by as much as an hour to protect their safety he was instead caught by armed citizens and then cried like a little girl - his last words are reported to be \"the world isn't fair, then said I would get a good job in school! why...WHY\".\n\nInstead it's \n\nBob the Butcher was finally apprehended today, he brutally killed 15 people with a 50mm chain gun that he bought from a local gun store, Police report he was a criminal mastermind and is just one more reason why we should ban guns.",
            "Laughed way too hard at this",
            "Because of a little thing called \"The Human Condition\"",
            "I'll pose a different answer: titles are an inherently human thing. \n\nAlexander the Great. Jesus of Nazareth. King Alfred the Great. Peter the Great. Jack the Ripper. The list goes on, we grant titles to significant influences on our culture and world.\n\nNowadays, though, information is disseminated through news media, rather than elders telling stories. The idea of a \"cool name\" stuck around.",
            "The media has no morals/ethics. Just whatever makes them the most money.",
            "I watched limitless once as well",
            "I agree absolutely. We glamorize the shittiest people in history. \n\nInstead of these “cool” nick names, we should name them like we designate stars. We could use letters and numbers to indicate the location they were most active, the year discovered. So SK-US-CA-2015-C would indicate serial Killer, in the US, california, discovered in 2015 and the third one (hence the C).  Mass killers could be MK instead of SK. \n\nGlorifying these criminals makes more people follow their footsteps. I think it’s MOST grievous with school shooters, because of the impressionable age group. \n\nI also tend to think we could cut down on this thing if we made it an active theory that school shooters are usually bots with sexual desire for their mothers and/ or fathers. Not that this has any truth to it, but what teenager would want to be known as a kid who wanted to bang his mom (or dad)?  Not sure it would deter, but I feel like it would.",
            "So my dad was on the case of the unabomber which btw is a badass name so he says a dude nicknamed him that cuz he bombed University's and airlined un for universities and a for airlines so that one was for simplicity same thing with the zodiac killer he killed people according to their zodiac sorry if i mispelled some stuff im on mobile but its not about money most of the time its about simplicity",
            "You should listen to the podcast Last Podcast on the Left. Their depictions of serial killers are based off of the dipshit notion",
            "It's the original click bait",
            "This should be in r/goodideas imo",
            "The Hash Slinging Slasher",
            "That title is fucking hilarious.",
            "Like why is there so fucking much Ted Bundy shit",
            "[removed]",
            "What's worse is when the news tries to make it seem like 'everyone in the situation deserves pity' and 'it's just sad for them all'. They might as well sell pictures of the fuckin limp dick lacerator with a baby he stole as Christmas cards.",
            "This is true. The serial killer BTK got inspired by all the media attention that was given to serial killers, and came up with his own nickname for them to use when they report his crimes.",
            "I agree, have always thought the same thing",
            "The US does have a weird obsession with serial killers. I read somewhere that there are more recorded serial killers in the US than the rest of the world combined.",
            "As with mass shootings or terrorist attacks, just call the murderer \"mass shooter no 643\" and suicide bomber no 456\" for example, don't make them infamous make them mean nothing",
            "To help get more people into the business",
            "Because news papers wouldn’t sell so well",
            "Because the news is at heart just an entertainment source. Catchy headlines bring in revenue.",
            "Because the media doesn’t give a shit about anything except making money and spreading fear/their agenda",
            "Its like calling Osama Bin Laden the wrecking ball bandit.",
            "Best post in this sub. 😂",
            "This. I always said that serial and mass killers should by law have their first names replaced  with “Dickless looser”. E.g  Dickless Looser Dahmer,  Dickless Looser Jones, Dickless Looser Bundy.",
            "Not a serial killer, but Walter White sounds like the most boring and generic name ever for an infamous drug kingpin\n\nEdit: I'm a dumbass, I thought you meant in movies and TV shows",
            "Don’t even refer to these people as “gunman”,,, that makes is seem hardcore and professional.\n\nCall them murderer, killer or coward.. those all get my vote.",
            "Not sure being a serial killer is cowardly per se. If we want to ask that question, I'd imagine they aren't. And also serial killing likely stems from trauma or a condition and demonizing people with disabilities doesn't help the overall cause.",
            "And the female serial killers get stupid names like \"Giggling Granny\". It's both interesting and sad how serial killers are revered.",
            "I think you will have to wait for a post-capitalist type world for that to become the norm. The eternal growth of the economy takes precedence over finite human lives.",
            "In Argentina we had a dude who murdered 4 children and attempted to kill another 7. His infamy got him the name of \"petiso orejudo\" meaning something like \"big-eared shorty\". It'd be really cool to make this a habit and see what creative insults come out of it.",
            "Because we glamourise serial killers",
            "As others have said the news rakes in those massive money money dolla bill.   \nBut isn´t we kind of always glamouring them? Or at least people are faschinated beyond belief on how they work. Think about all the murder podcasts and documentaries there are; you can´t get more gruesome mysteries then serial killers! They are the phantom that can´t be killed.\n\nWhen you´ve met one how ever that kind of looses it´s charm I can attest to... but before that I found it sick and cool haha!",
            "I just spammed up and down vote for about 10 mins watching it go from 4.9k to 5k back and forth",
            "news providers are more meant for entertainment and profit than actually disseminating useful info.",
            "What can we do to disincentivize (punish?) this behavior in news organizations?",
            "This would be nice",
            "They’re people too fighting fire with fire doesn’t work",
            " they are hot and also clever",
            "Catchy names sell papers.",
            "gives the journalists profit",
            "I feel like most of the time the names are just descriptive of their killing",
            "Gotta sell books and generate views.",
            "What would that accomplish? Teach children not to become serial killers?",
            "The London lob on has fucked again.",
            "They should get a random number and their real name erased from history",
            "Yellow Journalism. AKA the absolute biggest mistake to ever grace the peacetime world",
            "Did someone call me",
            "I've always thought the same thing. Why not emasculate killers? Obviously they are lacking in any constructive manner. Not manly. Cowardly. Useless.",
            "Most people aren’t 12 and grew past name calling.",
            "Fake news",
            "We mythologise monsters. They are archetypally evil, and so we raise them to that status in our minds. Giving someone any kind of nickname is like giving them a Title, so stupid names would never work for serial killers. The best thing to do is raise awareness of the victims, and deny notoriety to the killer. That's what we're already beginning to do with mass shooters. Does anyone even know the New Zealand Mosque shooter's name?",
            "Because news organizations are slime balls and only care about money. A lot of people are trying to get them to stop reporting the names of these killers (like Philip DeFranco) and hopefully the’ll eventually stop.",
            "Trading cards, tv shows, documentaries, merchandise. There is lot of money to be made. \n\nAlso millenial girls on dating sites like to list it as an interest, in an attempt to seem edgy.",
            "In Australia we had Mr Stinky as he had a strong body odour. He’s never been caught.",
            "[deleted]",
            "I'd rather be killer by midnight massacre than the cowardly dipshit",
            "If I wanna get killed I wanna get killed by someone with a dope name at least. You know how lame my obituary would be if it said “Tragically murdered by Crying Moron.”",
            "The media, most Often the names come from the media wanting to seel papers, jack the ripper is a prime example, the name \"Jack the ripper\" was taken from letters he apparently sent to the a papers and police but its possible were just made by the papers to sell more news,",
            "That actually what most of these mf search, attention because they never had it when they were young\nPOPOOPOPOPOPOPOPOPOPOPOPOPOOOPOOOOOOO",
            "It's all about getting attention",
            "I'm a cowardly dipshit but you don't see me going and killing anyone.",
            "Because that doesn't sell newspapers",
            "Who wants to get killed by “the cowardly dipshit”? No body.",
            "I love this question",
            "Actually the FBI came up with the nicknames. It’s what you do when you create a profile of somebody. The media just broadcasted them",
            "I feel the exact same way.\n \nLast year when a kid shot up my former high school I refused to even learn his name. I would just call him the Saugus High Cunt when I talked about him.\n \nDon't care about his name, his probably sad story of bullying or sad home life, none of that shit. Not giving his existence anymore than what I already know about him. \n \nI think we need to treat all school shooters like this. Fuck them, they're not gonna be infamous in my mind. They are nothing, shit excuses for humans.",
            "Because many people do. Ever heard of all the women who find those serial killers so attractive they write them letters and want to marry them if they ever get released?  \n\n\nMoreover, theres a weird fascination about criminals and crime, which is why there are popular series and movies about it, be it documentary style or just fictional.",
            "The only one I ever liked was in PA with that sniper scare they had.\n\nThey found the camp he had been hiding out in and it was full of diapers.\n\nSo he quickly became the \"diaper sniper\".",
            "I would think it would be for awareness. Give someone a more surreal name scares the would be heroes into not trying to stop them themselves. Also making the person famous makes them easier to spot.\n\nCalling someone « cowardly dipshit » would cause people to underestimate how dangerous the killler is.",
            "Cause fear drives ratings. See: the entire world right now\n\nWho is going to turn on the news to watch the latest story about \"The Cowardly Dipshit\"? No one. Who is going to turn on the news to watch the latest story about \"The Zodiac Killer, and YOU could be NEXT!\" A whole lot of people.\n\nMore eyes = more $$ they can charge for commercials",
            "Because names have a function beyond being propaganda that instructs us how to feel about things.",
            "In America we still haven't learned to not idolize the murderer.  But it isn't just murder, it's literally anything that will grab attention.  These titles were the prequels to click bait.  Trump is the sequel to paying way to much attention to the perpetrator.",
            "The Weepy Voiced Killer would like a word with you..",
            "Well there was a real serial killer that got called mr. Stinky. While being acurrate, that's the spirit we need for future naming.",
            "Just give them numbers and erase all history of them. Let them be forgot forever and only the victims names be remembered.",
            "Some give themselves names (like BTK). Others... it gets clicks and viewers but I also feel it’s an identifier? As though people can identify something to the bad stuff. It kind of appeases people to think of these things being done by a monster than a normal person so the monocers just help with that.",
            "People are desperate for dramatic and interesting things to happen.\n\nMaking someone an interesting villain makes people care who otherwise wouldn't.",
            "Cause the news media wants money money money.",
            "I don't know if it happened internationally or not but in Australia after a series of one punch kills they using the term \"king hit\" and started calling it a \"coward punch\".",
            "Because money",
            "In a way it’s more respectful to the victims than your suggestion, in reality it should just be their name, but if I had to choose between the cowardly dipshit and the zodiac killer I’d choose the cooler sounding name. Hey your son was killed by cowardly dipshit wasn’t he? See how that kind of comes of reall bad. Hey your son was killed by the zodiac. A little bit better. I also think part of it is the fascination of crimes.",
            "From a pragmatic standpoint, it’s a good idea for the public to have catchy, memorable names that link active serial killers to locations/motives/methods etc. But I see what you’re saying.",
            "You know his name is Dennis.",
            "From time to time i think about if buffalo bill would have believed that a football team would be named after him someday. Or a tv show about Manson.",
            "Related, but in the UK I think the tabloids stopped publishing photos of killers in the paper to reduce their notoriety.",
            "\"Edgelord\"\n\n\"The Boston shit gobbler.\"",
            "Because murder is fun",
            "The same reason the media is referring to the giant asian hornet as \"Murder Hornets\", because it sells copies and gets people's attention.",
            "I've been saying this for a couple years now. Just start labeling them \"coward 453\" and \"pussy 86\" or maybe a \"what a dumbass 12.\". I feel this would help with the glamorization of it and people would still want to read/watch about it.",
            "Deep inside, people admire killers. I always thought that shit. I mean, a lot of us hate them, but there are a group that admire the fact of commiting crimes and get out without consecuences.",
            "Tonight at 7, We tell you the gruesome details of the killing spree done by the Little Dick Strangler.",
            "nah that’s cool. School on the other?",
            "In our lifetime those who kill, the news world hands them stardom. And those are the ways on which I was raised.",
            "Cause they are hot badasses like jd🥵🤙from the heathers",
            "Sensationalism",
            "I had the same thought while listening to a podcast about the BTK killer. He asked for that nickname in his letters. I’m thinking “Don’t call him what he wants to be called! Call him “The Idiot Asshole” or something.”",
            "I thought this said The Cowboy Dipshit, which I found just hilarious.\n\nAlso, I have no proof or anything, but I might be worried that if we taunt the guy, he may escalate. This may lead to him messing up, but it could also cost people their lives.",
            "Media",
            "Because for-profit media.",
            "Do we really do that?\n\nMost of them are just descriptive I would think",
            "You mean like ol bumble butt ed kemper?",
            "The media controls our fear, you think papers will sell if \"Coward killer on the run\" rather than \"The Butcher still at large\"",
            "Cool names sell more clicks than lame ones, unfortunately",
            "I'll take 'muckraking journalists' for 1000, Alex.",
            "What was ted bundy’s nickname? I never heard him being referred to or associated with one, just his real name",
            "Why don't we stop talking about school shooters and stop giving them a stage? Because it sells. People are interested in tragedies, so by covering them the media can make money. Now a story about dozens of dead children may sell on it's own, but some random guy killing some random people over many years (most of the time that is), all because of the thrill or some other lower motiv, that needs to be spiced up a little. Boom, you crazy killer just became a very special crazy killer. Did you know he/she collected the toes of his/her victims? I mean, it doesn't make a difference, but there goes your Toenail Killer.",
            "You mean like Ted Cruz, which is almost as bad as as Jack the Ripper?",
            "Lol upvotes for The Cowardly Dipshit. I'd love to see that in a new article lol\n\nYeah, it's a serious problem that we need to fix. Once again, you can blame the media for wanting it to \"sound snappy\" and attract attention",
            "It's not just borderline, the news networks actively and intentionally glamourise them. It catches eyes, it gets views, it makes them money.",
            "Born just in time to browse dank memes",
            "Bc we are a sinful race who loves sin and do we glorify Cain",
            "Agreed, I'd be tickled pink if I was looking to create my public image as a murderer and all of a sudden people are calling me the night stalker",
            "You mean like, John Wayne \"The Killer Clown\" Gacy? \nOr, Jeffrey \"The Body Snatcher\" Dahmer?"
        ]
    },
    {
        "post_id": "a2rqpb",
        "author": "YBNMotherTeresa",
        "title": "If I go into a coma during a prison sentence and I wake up after the sentence ends, am I free or do I dtill have to do time?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/a2rqpb/if_i_go_into_a_coma_during_a_prison_sentence_and/",
        "score": 24452,
        "num_comments": 1300,
        "created_utc": 1543863680.0,
        "selftext": "Edit: I'm not going to prison guys I'm a good boy who was curious lol",
        "permalink": "/r/NoStupidQuestions/comments/a2rqpb/if_i_go_into_a_coma_during_a_prison_sentence_and/",
        "comments": [
            "You're free-- otherwise we'd also have to deduct time when people are asleep",
            "I'm no expert but I think you would have to be free to go. The sentencing usually says confined for 20 years. Or whatever. It doesn't say anyhing about your condition.\n\nI think as long as you're in the custody of law enforcement, it goes towards your sentence.",
            "The real question is what happens if someone is in for life and is declared dead before being resuscitated.",
            "This sounds like a wonderful plot for a TV show. A guy is  a bad teenager does something dumb with some kind of robbery and goes to prison for 20 years, goes into a coma, comes out as soon as his sentence is over and now has to go back out into the world without having actually served any time or becoming a different person",
            "One point of detention is so that you can't do \"damage\" in that time. Well, you can't if you're in a coma for those years. ",
            "It would actually be really funny if you got off early for good behaviour.",
            "Similarly, what if I am sentenced to death but while waiting my heart stops and after 2 minutes I get resuscitated, did that death count as my sentenced death, or will they expect me to die again? I only got one death sentence not two. ",
            "This was actually covered in the 1993  documentary, Demolition Man.  ",
            "I once knew a guy who was locked up on a 9 month sentence, a month in he had a stroke. They sent him to a nice hospital about 40 miles away, where he was admitted for 6 months. After the hospital released him, the sheriff took him back to jail for about another 6 weeks.\n\nSo a 36 week sentence where he only served about 10 weeks in the actual correctional facility.",
            "The reality is, as soon as the private prison corporation knows you need expensive medical care you will be a prime candidate for compassionate release. ",
            "Someone I know had a heart transplant and then ended up having to serve 6 years in prison. The prison didn’t give him the anti rejection meds that were needed for his heart transplant so he went into a coma for 5 months! When he woke up he sued the hospital and they let him go but he’s also on probation for another 5 years. And the fucked up thing is that he scammed people and made 30 million dollars then sued the hospital for 800k, and he only “served” 5 months.",
            "[removed]",
            "What if prison get so over crowded they start putting people in like stasis comas to conserve space \n\nIf they are in a coma they will only take up as much room as a bed, they dont need yard time , they dont need a whole cafeteria, and living  quarter's , it would make more jobs because someone must take care of the coma patients , but on the down sides it's going to be far more expensive but we could make the prisoners have to pay a fine of what it costs to have them in stasis,  and if they cant pay said fine they will work for the prison to pay it off like maintaining the facility,  cleaning , changing bed pans , preparing the food , general upkeep of the facility , \n",
            "[deleted]",
            "How awesome would it be to take some pills before turning yourself in and being knocked out for 80% of your sentence? \n\nBut wouldn’t the prison have to turn you over to a hospital?",
            "SLPT: If you go to prison, ask a jailmate to beat you into a coma so you don’t have to deal with being in prison for years",
            "I literally just had this dream the other night. Damn",
            "You are free. Who knows? We may be on the road to inducing comas in criminals to store them efficiently within over-populated prison systems. Can't say I'd be happy if this happened to a family member, but if they opt into it, that's their business. I know I'd rather be under than live that kind of life. ",
            "There is a star trek DS9 episode about a race that makes you live out your entire sentence in your head in seconds. \n\nLeft you scarred for life.",
            "There was a guy in the last few years who had been sentenced to 15 years of prison, and instead of going he just didn't. He continued to live his life, mindful that they could come for him any day. After 15 years, when it was time for him to be released, they realized that he wasn't in prison, and so they arrested him. A few months later a judge said that the time he spent out of prison counted, and he had to be released.\n\nI imagine a coma would go the same way, even though you're not \"in prison\" it still counts.",
            "Not a bad idea, maybe we should just put prisoners into a medically induced coma for their sentences. ",
            "There is a popular movie called Demolition Man that answers this exact question. ",
            "[deleted]",
            "Dtill gotta spellcheck",
            "The law says time served. Conscious or not you served your time. ",
            "You'd be free... but you'd be brain damaged.  \n\nThere's a guy, Terry, who was in a coma for 19 years.  He's super mentally handicapped now that he's awake.  \n\n50 First Dates was based on him...  how his memory works...  but reality isn't nearly as pretty and romantic.",
            "lol, this makes me think of every RPG where you fall asleep to regain health, and or pass time. lol \"hold x to skip jail time\"",
            "You also need to consider good behavior. You won't be shanking your fellow inmates. WTF Let's be honest this has already been made into a movie. Demolition Man 1993 with Sylvester Stallone and Wesley Snipes, a childhood favorite. \n\"He doesn't know how to use the 3 seashells!\" ",
            "You would be brain dead being in a coma that long ",
            "Goddammit what a great question",
            "Nice try Black mirror writers ",
            "You also have to understand that while in prison the health care is so poor that it would be highly unlikely that you would wake up at all.",
            "Waking up from a coma, feeling amazing, and then realizing you have a criminal record is painful enough",
            "You’re assuming the prison system cares that you’ve been rehabilitated. They just want a body there to cash in on. ",
            "Oh come on don't spoil my backup plan",
            "The real question it seems is, who pays for your medical services while suffering a comma while in prison? Compassionate release would be harder for a serial killer...",
            "I’m late but what happens in the US Court system if you commit a crime but during the crime you fall into a coma. Say it would be a ten year penalty and the coma is ten years, would the trial continue without you, would they just wave the time, or would they wait for you to come out of your coma then put you on trial",
            "I know there's an Isaac Asimov story where a guy time travels to a day after the end of the statute of limitations for murder. I can't remember the rest of the context, but it's a similar concept.",
            " Let's ask r/Skyrim",
            "No, time served is time served.     \nAnd when you wake up, Sandra Bullock might be your partner...   \nJust be sure to learn how use the 3 sea shells before you go into a coma, so you don't get laughed at when you wake up!",
            "\\>NoStupidQuestions\n\n\\>Posts the greatest question in reddit's history",
            "Reminds me of the story of the person on trial for murder who raised a defense that since the cells in the human body are constantly regenerating, the physical person who committed the murder months ago, was no longer the same physical person on trial. ",
            "This reminds me of being on the stack in altered carbon ",
            "I think it would depend on whether the prison had the facilities to be able to hold you or not well you were in the coma. I would think that if you had to be moved to a hospital while you were in a coma that would be considered a furlough from your sentence for medical reasons and you would have to come back and finish the rest of your sentence later.\n\nEdit: Source: Work at a jail that has medical furloughs frequently. More days are added on to the end of the sentence to compensate for time out of the facility.",
            "Isn't this a Stallone movie?!",
            "[deleted]",
            "If your recovery prognosis is grim, they’ll probably commute your sentence so your family or the state will have to care for you.  ",
            "I had a friend in the Army who got busted almost straight after joining... and spent three years in an Army prison. When he was released, he still had to serve the three years he signed on for. ",
            "Demolition Man?!",
            "John Spartan, Demolition Man ",
            "If you listen to the Hardcore History podcast called Prophets of Doom, Dan Carlin tells of a severe  punishment (including your skin being removed by hot pincers) doled out that lasted an hour. If the person passed out the time paused until they regained consciousness. It sounded gnarly.",
            "This reminds me of the movie Demolition Man. Convicts on ice.",
            "Awesome loophole, hey? ",
            "I feel as though this could go either way. When you were a kid and in time out, were you allowed to take a nap? Most likely no. Now obviously you get to sleep in prison and I’m sure a lot of people pass time that way but the idea is that you you’re in time out to think about what you did and to remove you from society and hope it helped. Half of which is achieved by being away from society.\n\nIf you’re on death row and you are to be executed tomorrow but the stress makes you have a heart attack, paramedics will come and save you and your health care is paid for till you’re healthy enough to be killed. Your tax dollars pay for this with medical care by the way. The idea is that we did not get our justice so we need to save you so WE can kill you. \n\nThat being said, I feel like you’d have to say, “you didn’t actually serve your time”. BUT one may say you suffered enough by being out of commission for the entirety of the sentence and that was punishment enough. \n\n",
            "Well... youre allowed to sleep. For practical reasons, being in a coma is no different then sleeping.. so, I imagine youd be free.",
            "Man Saint's Row 2 kicked ass",
            "Imagine falling into a coma BEFORE being sentenced. 10 year coma wake up to a new trial and 10 years jail time. ",
            "I use to wish I could blackout at my old job. Just get in the shower for work, black out, and I’m waking in the door coming home. ",
            "Prision healthcare prob wont keep you alive very long",
            "Doctor here. Comas don't really work like that. But yeah you'd be free and definitely brain damaged. ",
            "Prisons are not exactly known for their top notch healthcare. So the second you go into a coma in prison, consider yourself a goner. If you think the state (or feds, if that were the case) is going to spend the money it takes to keep you on all that life-maintaining equipment, well let me just clear that up right now. ",
            "You go into a coma in a prison most likely you are going to die.",
            "“Sleep Free, the most freeing sleep you’ll ever get that not even time itself can prevent how freeing it feels.”\n\nI see a market here for a coma spray that you can pay for after your sentence!",
            "TIL you can sleep through your entire sentence.",
            "You may be surprised by how little a coma will 'help' with your sentence though.\n\nA coma rarely lasts more than two to four weeks. Some patients may regain a degree of awareness after persistent vegetative state. Others may remain in that state for years or even decades. The most common cause of death for someone in a persistent vegetative state is infection, such as pneumonia.\n"
        ]
    },
    {
        "post_id": "gqr44y",
        "author": "OSMAFELA",
        "title": "Why can I watch a hole 1 hour YouTube vid in max resolution without it stopping at all, but on Reddit a 30 second vid with low quality takes five minutes to load?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/gqr44y/why_can_i_watch_a_hole_1_hour_youtube_vid_in_max/",
        "score": 24434,
        "num_comments": 709,
        "created_utc": 1590471385.0,
        "selftext": "I don't know anything about code or video compression, so it seems weird to me.  Shouldn't the YT vid be heavier and take longer to load?\nEdit: *whole *insert bit about English not first language here*",
        "permalink": "/r/NoStupidQuestions/comments/gqr44y/why_can_i_watch_a_hole_1_hour_youtube_vid_in_max/",
        "comments": [
            "It's not only about your internet connection and speed, but also the internet speed of the server you are downloading from. Reddit's servers are much worse compared to YouTube so it can take a lot longer to download a small amount of data from reddit than it would a larger video from YouTube.",
            "Reddit’s video player is just really shitty. It’s of no fault of your own",
            "[deleted]",
            "Ive had this question since forever. Recently upgraded to a 250mbps internet and no, reddit vids, still take forever to buffer or run in ultra low res",
            "Reddit has a trash video player. Youtube is primarily designed for videos so of course it works way better",
            "I ignore a lot of posts with videos for this reason.",
            "Because the reddit media servers are cancer af. This applies to all i.redd.it and v.redd.it posts. On some days you can watch the media just fine, then one minute later the servers bug out and you sit there trying to load a 5MB video with your 1GBit connection for an hour.\n\nI always tell users not to use the reddit built-in hosting and instead use gfycat or imgur but I doubt my comments have much impact if any at all.\n\nAs a bonus: v.redd.it saves your videos into separate files, the audio is one file and then the videos without the audio gets multiple files for different qualities. What this means is via reddit and without any 3rd party software you'll not be able to download any video including the sound from v.redd.it and because of this bots like /u/vredditdownloader exist.\n\nAs a second bonus: reddits media posting is so horribly flawed that users create multiple submit with the same exact image, that image then gets saved with a new filename every time ultimately creating multiple copies of just one image. For a *messageboard-socialmedia-mashup*-website this is horrible, even 4chan has a duplicate image detection and a pretty good one I might add.\n\nAs a third bonus: the reddit built-in media hosting is probably karmawhores most important feature because of no duplicate checks as I've mentioned before. So karmawhores post one video, a day later they post the same video under a new filename, a day later... you get the idea and if you check those posts carefully, most of the posters NEVER link to the original source but some reddit users, me included, then find out the actual source of a clip and post it in the comments. Quite often the OC is from a YT clip that you could just share with your friends with zero problems but when you want to share a v.redd.it post with your friends, reddit becomes so goddamn awful trying to force it's shitty app onto users and if you don't use the app when browsing with your phone, you'll never be able to see all the content (including comments) of the post.\n\nSidenote: I absolutely hate what reddit is being turned into. I first got here because it was lightweight and a good place to discuss but then it gained more popularity and this, like with any other thing that becomes popular, dragged in more karmawhores. reddit also started to be \"more appealing\" to the userbase by implementing a shitty new design and forces that design onto everyone who doesn't care enough to find a post where it shows you that can put \"old.\" as subdomain to not get the freaking new design. The new design is impractical and inefficient, it's like one day you're using MIRC to discuss things with people and suddenly on the next day you try to open up MIRC but Skype launches, like wtf. Oh and before I forget, can anyone give me a good reason why there is a fucking chat functionality? Thankfully I remove the chat via userscript but damn, this shouldn't be needed, you go online like every day and suddenly some random people are sending you chatmessages...",
            "whole",
            "Services like Youtube and Netflix have cache servers in pop sites throughout the world, this means they have the capacity to deliver both lower latency and handle higher load.\n\nELI5 Youtube has servers round the corner from where you are with currently popular content on it.",
            "Reddit video sucks ass. Can we stop using it already? Just take a minute and upload your video to imgur.",
            "Same here. 1 Gbit fiber, state of the art PC, 8K30, 4K60 no prob on youtube or elsewhere, fifty twitch streams at once......but that ONE video on reddit filmed with a potatoe in 36x24 pixel takes literally 5 seconds and 3 attempts to load EVERY SINGLE FUCKING TIME. \n\n/r/TIHI",
            "\n√ defaulting to lowres to save their bandwidth\n\n√ no ability to share the video directly\n\n√ constantly buffering\n\n√ OP usually not bothering to post the (hq) source\n\n√ OP usually cropping size or length\n\nYup, its shit alright. Havent seen a worse video player probably ever.",
            "[deleted]",
            "Well a lot depends on whether I am using WiFi or not. It seems like my com cast WiFi throttles certain traffic that my phone’s carrier doesn’t. \n\nThis is just my observation. If I see the loading circle, I go off WiFi, and there are no delays. \n\nThank ajit pai for all the throttling.",
            "Whole* smh",
            "Reddit users won't go anywhere. They accept shitty quality.",
            "Seems likes it's a hole in the system",
            "Not only that but the video constantly changes quality, it's annoying af.",
            "You're not alone. It's because Reddit's video player sucks.",
            "Hole",
            "Reddit has really bad servers. Its almost like the whole website is being run on a single raspberry pi.",
            "This is a very good question. I would add to it - why does reddit decide half way through any video to change the resolution to 30x20?",
            "Reddit is very badly optimized. Having this site open often brings my computer to its knees, and its a powerful computer. the app also destroys my phone battery.  \nafter a few minutes scrolling through the feed it turns into a slideshow.",
            "Software and systems engineer here.\n\nIt's a combination of things.\n\n- YouTube's video player is hand-coded and they have very competent engineers working on it. Reddit uses a much clumbsier video editor that doesn't handle videos very well at all.\n- YouTube has a large \"content distribution network\" (CDN) that copies videos to servers that are geographically closer to you. Contrary to what many believe, the internet is NOT fast (relatively speaking) and even though your connection speed might be fast, traveling far distances still adheres to the laws of physics. A server that is closer to you means a shorter distance a signal has to travel.\n- YouTube servers have very, very high throughput and better internet connections. This one is arguable since Reddit is very likely using similar or the same datacenters as Google (it's hard to tell without being an employee), but it's important to remember that the speed of data between you and another server on the internet is only as fast as the slowest \"hop\" between you (a hop is a single direct connection between two servers or routers for example)\n- YouTube has dynamic buffering, meaning based on your connection speed, YouTube can fetch larger or shorter portions of video based on memory usage and connection stability, as well as switch video quality on the fly (lower quality = less data to send = faster transmission of pieces of video).\n- YouTube can make better optimization tradeoffs due to the nature of videos. YouTube videos tend to be long - several minutes or more - whereas Reddit videos are much shorter (on average). When a YouTube video is uploaded, they process the video using expensive and lengthy compression passes that favor longer runs of video data before the video is ever made public for viewing. Such optimization passes don't work as well for short videos AND are computationally expensive - I would imagine Reddit has much less interest in spending the money than YouTube does since reddit is not (primarily) a video hosting site.\n\nUnless a Google or Reddit employee can say definitively, keep in mind most of the answers here will be speculative unless the clients are reverse engineered and profiled properly - something I'm sure not many people (if any) on this thread have done.",
            "Whole **",
            "Fuck Reddit that's why.",
            "Reddit servers have been shit for a while now unfortunately",
            "Stopped playing Reddit videos long time ago,\nEven gifs create problem sometimes",
            "Because reddit is trash",
            "Not only it loads slowly, sometimes it doesnt even load at all.\n\nMost of the time it loads perfectly clear then mid play it turned to 144p for some stupid reason.",
            "v.reddi.t wouldn't be so bad if you could **REFRESH THE VIDEOS!**.\nOn mobile if it doesn't load the first time, you're fucked. It will never reload and finish. Doesn't matter if you restart the app",
            "the servers. if you don't know what a server is, I think you should watch this [vid](https://www.youtube.com/watch?v=ByI1PHMcPJQ)",
            "If I see a reddit video I just scroll past. Life’s too short to deal with Reddit’s shittty videos",
            "Reddit Video is dogshit. For myself, I load quite fast considering. But the quality often likes to just drop down to pixel =Yes and I cant see shit. Using the quality does fuckin nothing. Pausing for it to catch up? Nope, dont like that either. Horrible video hosting on here, used to like it way better before this crap was implemented. \n\nAs a side note, dont post shitty gifs without sound when the original has great quality and good sound, I much rather watch that. And if people dont want sound, they dont have to turn it on. Options are always better man.",
            "The speed you’re able to download at is dependent on the quality and proximity of the servers. YouTube, owned by Google, has tons of servers all over the world strategically placed to optimize bandwidth served to users. These servers, called CDNs (content delivery networks), sole purpose is to serve content or videos in this case as fast as possible by being geographically close to the user. \n\nAnd Youtube’s entire business is in serving videos, and they’ve had years to optimize it. Reddit though, has a lot more going on than videos so might not be a top priority for them to optimize their download speeds.",
            "Here I thought it was alone m",
            "Because Reddit sucks and morons keep using the awful reddit video.",
            "When you watch videos on Reddit, they're streaming all the way from China.",
            "The answer here that people are missing is that YouTube ads are ran so much in one region, that they will typically be cached on some edge server in your area by a cloud delivery network. Since so many people in San Jose, CA (for example) have been targeted to get this ad. It’s cached (stored) on a server locally there. When you pull it up and you live in San Jose, the ad is stored very close by which makes it load nearly instantaneously. Individual Reddit posts wouldn’t pay to cache content on edge servers like ads would",
            "That's why boys. Hire good Developers to build your servers. That being said, hi please I need internship",
            "Well if you think about it a hole doesn't have much in it",
            "Youtube specializes in video streaming",
            "CDN",
            "Thank God I read this post, I used to think living in a developing country makes me unable to watch reddit's videos",
            "*whole\n\nI was confused for a few seconds by that.",
            "r/holevideos",
            "Youtube is a video hosting site, primarily.\n\nReddit isn't, so they don't really care that much about how well it works.",
            "OMG I THOUGHT IT WAS MY PHONE ND ONLY I WENT THROUGH THIS",
            "Tl;Dr Content distribution is an entire subfield of computer science. \n\nIt involves more then just fast, available servers to host the content, but also a fleet of networking hardware to route the content from the source to your browser. \n\nSophisticated systems will cache \"hot\" (popular) content on this networking hardware physically close to you, wherever you may be on the globe. This helps decrease the impact from delays introduced by speed of transmission which is capped by the speed of light. \n\nThis is usually the component that separates high quality websites like redit from world class content distributors like YouTube.",
            "Many times I have said fuck it and went to a different post or completely different website.",
            "I’ve completely stopped watching video posts. I just go straight to comments and imagine what the video was. If it’s really really intriguing then maybe I’ll open it on another website. It’s honestly unacceptable how trash reddit is.",
            "I think maybe youtube prioritizes the video over really everything else because, well, it's a video streaming service however Reddit worries about all of its posts equally and it's loading way more stuff than youtube.",
            "In eli5 terms. Internet is like water. A 1 hour hi def video needs a full gallon. A Reddit low quality might need a quarter cup. But how fast it fills depends on a lot of things. First is how high your water pressure is. That's your internet speed or how much water can come out of the tap at a time. Next is the source and probably where the difficulty here comes from. Think of YouTube and Reddit like wells. How much water they've got, how powerful their pumps are and how many people are trying to get water all at the same time affect how much water each individual gets. YouTube has really nice pumps and lots of water. Reddit not so much",
            "It all depends on the video player. I have average speed bandwidth (at least for my country) and I almost never experience any sort of buffering watching YouTube videos or Netflix shows they load frictionless. In the other hand when I try to watch anime on kissanime specifically the video takes some time to load depending on the video player.\n\nIt can also depend on the video formats. MP4 and WebM type of video formats load without a problem for me personally. MOV formats tend to buffer and distort more in my experience.",
            "All of these comments miss the crux of the issue - peering. \n\nhttps://en.m.wikipedia.org/wiki/Peering \n\nCompanies like YouTube, Netflix, and Twitch have peering agreements around the world so that copies of the videos are in your local ISP data center. This makes the bandwidth and latency much better from your location, allowing a smooth stream.",
            "Google's yearly revenue is that of a small country's. Google made $160 billion in 2019 alone. \n\nThe only info I could find on how much reddit makes is [this](https://www.emarketer.com/content/reddit-to-cross-100-million-in-ad-revenues-in-2019) article here. It's about $100 million.\n\nGoogle is able to pay for amazing servers to host YouTube's content on. Reddit can't afford the same",
            "Reddit servers = smol boi\n\nYouTube servers = big boi",
            "A quick explanation is that YouTube is mainly used for video, hence optimized videos and better/faster player - because their main content is video. Reddit on the other hand has mixed content, so they can't wage war on all fronts. \n\nAlso, about the servers - reddit is also a high traffic site, with a lot of bots and content being uploaded constantly. Altjough YouTube needs more server space (for storing HD/4k videos), I'd doubght it that reddit ones are slower. It's just going down to proper video optimization + propper video player.",
            "That's a solid question!",
            "The key is to scroll up and down again, so you basically  \"restart\" the video. Works for me every time.",
            "Probably from whatever was in the north woods",
            "reddit bad",
            "You jest, but their acceleration isn't that great.",
            "They can say what they want without judgement ?",
            "Can't I just live vicariously through you?",
            "YouTube has Google, while Reddit has to go through China's firewall first before content gets to you.",
            "I've got a workaround, but it's specific.\n\nFirefox with the Addons RES and Imagus. Disable the RES-internal instant viewer, configure Imagus for single click instead of long click in the options. Now just hover over a video and it should load a lot faster.\n\nThat won't work sometimes. I noticed it's not an issue with the servers, but with my Internet Provider. They're either using bad overloaded routes or straight up capping certain sites bandwidth. I usually also notice imgur being VERY slow to load at those times.\n\nI have a VPN provider. Connecting to VPN resolves that issues every time...",
            "I know all about that 20%.",
            "Why does a gif load and play but then freezes on the moment of truth. It always freeze exactly on the moment of impact. It makes me furious lol",
            "Cuz reddit is shit lmao",
            "CDNs (content delivery/distribution networks). They host copies of data so every request isn't hitting the same server for the same file.\n\nYouTube has more of these hosting or caching videos on multiple servers across the globe, reddit most like has some, but not as many.",
            "Once again.\n\nDon't use the official Reddit app. It's trash compared to what 3rd parties offer.",
            "Accurate down to the max",
            "If you were to serve up a video in its full resolution, it would take forever to load on any device. YouTube has spent years and plenty of money figuring out algorithms to make their videos look good without using much data.\n\nIf you have a video of a person panning across a landscape, for example, YouTube's compression can figure out that the landscape isn't changing, it's only moving from one side to another from the camera's perspective. Because of this, they can just send data telling their web player to move a big chunk of pixels left it right instead of sending you a whole new frame of video.\n\nIf you've ever seen a digital video where suddenly someone's face stays the same, but their head moves around, this is a similar effect, but gone wrong. ~~I'll try to find an example~~. Edit: for example, the content on [/r/datamoshing](https://reddit.com/r/datamoshing) is close to the effect I'm describing.\n\nIn brief: YouTube has layers of technology between their servers and their video player that have been tweaked and adjusted for years to get things looking good without using too much data.",
            "We can infer what it said before from context",
            "To be fair, if you're watching a hole, it would be mostly black and you wouldn't notice that much of a difference in resolution anyways.",
            "Having fast internet is dope, but you'll likely never get those speeds as the connection you make is just as dependant on the servers you are reaching as it is your connection.",
            "Yep, we'll be able to last much longer.",
            "every new file from a new server takes some time to set up the transfer.  the movie playing doesnt have to renegotiate that transfer whereas every 5 minute stupid video on reddit is a new connection so it feels like it's slow.",
            "I feel like this is a good /r/explainlikeimfive question",
            "Because Reddit is trash.",
            "Reddit videos suck at compression/decompression compared to youtube so it has to download a lot more data than youtube does. Plus reddit servers are garbage and can barely handle load at peak times",
            "There are these things on the internet called servers. Different machines serve different data to you. sort of like how everyone has their own computer or mobile device and they don't all have to share. Also, some are faster and better than others",
            "I imagine in much the same way the Reddit search function does.",
            "Most of the other comments are also completely correct, but to add onto them, GIFs take around 5x the data of a regular Mp4 video. Just download the same video, even if it's short the GIF will take around 100Mb while the Mp4 takes about 20-20Mb. So that might be your issue if it's one particular video.",
            "Why does reddit take up 200% more data than literally any other app I use? It’s also unbearably slow to load anything with just WiFi.",
            "Wait, your videos load?",
            "I have a 1 Gbps and reddit still takes ages.",
            "i dont know,sorry",
            "Why doesn't the explotion rotate as well?",
            "I still can’t sleep.",
            "Reddit sucks",
            "Follow-up question , anyone else has no problems ? Like I never had it go slow , I have a 50 mb connection in Argentina I don’t think that it’s that good lol",
            "Good quality. I thought you died.",
            "It's called billions of dollars",
            "idk go to youtube",
            "Tells you about the quality of it",
            "I also believe both YouTube and Netflix have special servers in most ISP network hubs. That way popular stuff gets cashed on a device a bit closer to you. Reddit has to come from their server farm every time.",
            "Who knew it was about the other takes then",
            "There are 1 hour videos about holes? sounds sexy got a link?",
            "That's so fucking true, I know I don't have the best down/upload speed but I can still watch youtube videos 720p,It is annoying tbh.",
            "YouTube servers are specially optimized just for videos but reddit servers are have pictures, text, subereddit and videos etc. So the data modeling is a big diffirence too",
            "youtube has local servers that serves up what is popular, reddit doesn't have that sort of advantage. If you're the first person in your region to access a particular video or  it's a niche series of videos that gets purged, you can expect buffering as it is served up.",
            "Normal people aren't supposed to be it's dick?",
            "It’s whole not hole. As in Whole Picture versus  Butt Hole. I came here just to say this.",
            "Yep, and the vid on the post).",
            "Why do peolpe on Reddit use shitty Reddit Video?",
            "70 minutes might be a problem for Blue...",
            "  Err, what kind of holes? 😏",
            "It is based off Google’s CDN (Content Delivery Network). They most likely have peering agreements with major ISPs so you don’t have to really leave your ISP’s network in order to access the video, this faster and higher quality videos. Plus load balancers and overall ya better seem tho and configuration than Reddit.",
            "i dont know if its only me but some videos on reddit, when i watch them on my phone just will not load unless i open the link in a browser.",
            "Reddit stinky",
            "I blocked v.redd.it and i.redd.it (I think that's what they are) in RES, and enable auto-loading never-ending reddit.  It makes reddit way nicer, as most of the top spammers also use these domains.\n\nAnother thought, if you scrape the front page of reddit for a week or so, and sort usernames by top karma, and block the top 100, it will improve reddit drastically.  Someone posted a list a while back, but the spammers fought back and got it called \"brigading\", for mentioning usernames, but you can replicate the list  with this method anytime you wish.  I had to manually block them, but getting through the first 20 or so was a HUGE difference!",
            "Nobody:\n\nMe: isn't that hypocritical? Reddit: REEEEEEEEEEEEEEEEEEE",
            "because on reddit it is a gif",
            "Is it always casual Friday in that office?",
            "Whole*",
            "It depends on the site. The other wide has to be able to deliver.",
            "*whole",
            "Not just you, Imgur is pretty terrible at loading anything GIF related when its linked to Reddit, I have no idea why I have to wait 3+ minutes for a 20 second GIF to load, I often just give up and scroll to the next post. Also Reddits own built in player is total cancer, For me it always starts the video out at the lowest resolution possible where the video is just a fuzzy blur, And then half way through the video the resolution auto jumps to HD quality. I have to restart the entire video and manually select 720p every damn time just to see what the video was about.",
            "I think Ann Widdecombe is a woman? 😂",
            "cuz reddit video is fucking trash",
            "Reddits CDN is horse shit.",
            "You know how I could ever respond",
            "Whole...i was searching for hole videos all night..",
            "R/unpopularopinion",
            "Also videos with no views on YT take a lot more time to load",
            "You tube and other video based platforms pour a ton of money/tech/programming etc. Into making videos load fast and high def, because it is their main product (and then they turn around and fill the loading time with adds, but that is an separate issue). Reddit is mostly text with a large helping of photos and .gifs plus some videos, so their money and attention has to be spread out more and can't be focussed on just making video fast.",
            "I'm glad someone asked because I've been thinking about this for a hot minute.",
            "Also has to do with how the content is delivered. Reddits videos don't have advanced buffering like yt does so the yt video will efficiently stream upcoming pieces of the video as it plays, and it actually stops itself from going too far ahead and loading the whole thing before it's needed. I think Reddit makes you stream the complete file before it starts playing hence the longer load.",
            "Not seen anyone write here about how ISPs and backbone providers also can “reserve” bandwidth for certain sites as well as have cached stores of it locally to act as a buffer  and provide a better service to the typical end user.\nUsers on YouTube, Netflix, Facebook etc\n\nunfortunately that means other smaller sites can’t compete as they can’t afford to get dedicated bandwidth or cached content hosted on ISPs.\n\nCached content reduces the load on the backend servers as they only need to refresh cached data stored on the ISP instead of X amount of clients\n\nISPs will periodically send requests/hashes to check content is still valid else will update itself \n\nThis is all transparent to the end user\n\nI’m no expert but I know this is done to some degree on all sorts of platforms even in companies utilising loadbalancing for internal web intranet.",
            "CDN",
            "Too many porn sites?",
            "Apart from YouTube having tons of servers across the world, they also have the flexibility of only loading small portions of the video at a time. If you see on the YouTube player, there are 2 bars: one that indicates how far into the video you are, and another to show how much you’ve buffered. \n\nWith this in mind, Reddit has a tendency of downloading the whole video before playing it out. I speculate this is the reason you have to wait so long for a reddit video to load.",
            "Because reddit sucks. You can trace the suckage all the way back to when the nofap subreddit was created.",
            "This is so true",
            "Single most painful part of using reddit.",
            "Reddit video drives me nuts!",
            "It's gfycat.  So bloated.  Takes forever.  Do not like.",
            "PH is faster than both of them in my experience.",
            "I watch \"hole\" videos but on a different website.",
            "YouTube is a platform designed for watching videos, so they have funneled money/power into that part of their platform. Reddit is not, so they spend minimal servers on video stuff",
            "YouTube caches the videos depending on which resolution the average users watch and also where(the region). There is a concept of hot, warm, cold and frozen resources also. If you pull older unpopular videos and benchmark the timings compared to newer ones, you'll see the difference not much but a couple of microseconds.",
            "Hole",
            "Reddit servers are shit. There's no beating around this bush. Shit takes a minute to load text, fucking, comments in 2020. On 2 bars of 4G, i can stream twitch, youtube, or netflix, but reddit still struggles with images, videos, and text (so you know, everything).",
            "Why do YouTube ads load right away, but the content takes forever?",
            "Because YouTube is optimized for that, whereas Reddit is developed towards quite a lot of media separate from videos.",
            "People keep saying this, but nothing this bad has ever happened to me on Reddit. Normally videos on reddit only take a few seconds to load for me, even high quality ones.",
            "Reddit sucks?",
            "Whole",
            "I'm going to go to togo",
            "Reddit’s servers suck ass that’s why",
            "I would love to see youtube statistics. how much bandwidth used per day/month. how many videos are uploaded every day. size,",
            "The app & your device are in conflict. I have tons problems with the app on my tablet but not my phone. Fixed the problem device by using the boost for Reddit app instead",
            "Think about it as the difference between looking for a Walmart and looking for TraderJoe's. How far will you have to go for either? Chances are Walmart(Alphabet/Google/Youtube) has a location nearer. If you order something, you won't have to wait as long for them to send a car to you.",
            "To be fair, if you are watching a hole video, there is probably not much happening with that hole, so it may just be a high res picture with a progress animation at the bottom.",
            "YouTube is highly available. They have redundant server instances in every availability zone coupled with cdns serving static assets per region. YouTube is optimized for one thing, video, whereas Reddit maybe optimized for posts.",
            "Because you payed YouTube $10 a month and reddit is free",
            "Reddit has shit media servers.  Even simple images often take so long to load on my phone that I'll just skip over i.reddit links to find the next imgur one.",
            "Whole",
            "My favorite is when you watch the 30 second video and you hit replay right away.\n        \n*Loading...*",
            "I have been wondering this exact thing for so long. Thank you for asking it. And thank you all for answering it.",
            "I thought you were watching a hole for an hour",
            "Here’s a Wikipedia article that will help. https://en.m.wikipedia.org/wiki/Content_delivery_network\n\nGoogle has massive global infrastructure so they can put content servers near population centers easily. Reddit has to rent service on other CDNs, so yeah they don’t have near as much reach. It’s not so much that reddit’s servers suck, it’s just that google has way more, they own them completely, and their cache servers are closer to you anyway.",
            "YouTube has more money for stronger servers then Reddit. It's not a problem on your end it's a problem with Reddit. Reddit has a shit video player",
            "cause reddit servers are potatoes...?..  and not even Idaho potatoes...",
            "If you're complaining about reddit,  then tou have obviously never streamed Netflix!",
            "The real question is why, when there are much better options, do people still upload images and videos to Reddit?",
            "Video is complicated, and companies will spend many sums of money in order to get their players polished.",
            "Servers that host reddit are probably not as.... robust? as the servers that google owned YouTube has",
            "Watch vids without holes",
            "There's your problem, \"a hole\". That's what you fall through. \"A whole\", is something different all together.",
            "\\- CDNs: already mentioned.\n\n\\- DASH: doesn't look like it's been mentioned. Dynamic Adaptive Streaming over HTTP. I believe Youtube uses this. In short, what gets sent will vary w/ your connection speed, and audio/video streams are sent independently. So, your video might not degrade, but maybe your audio does. Vice versa. You get pretty quick load times and consistent streaming because of it.",
            "Similar question. When I click on a video and rotate my phone so it goes full screen, it always pauses.... why does it do that?",
            "Get reddit premium",
            "I have the same question about Netflix.",
            "Reddit has garbage servers",
            "Because Reddit sucks.",
            "Reddit is shit. Fire the CEO.",
            "*whole",
            "Reddit's video distribution servers < Youtube's video distribution servers",
            "Whole, right ?\n\nI was so confused when i read the question. Had a very different meaning",
            "Reddit’s primary purpose isn’t amateur video sharing.",
            "Because you have bad internet. The videos work fine for me.",
            "why are you watching \"hole videos\" lol \n\n\n\n\n\n\n\n(/s)"
        ]
    },
    {
        "post_id": "a1r7x0",
        "author": "T-Spin_Triple",
        "title": "You know how \"Ching Chong Chang\" is used as racist onomatopoeia to generalise Asian languages - is there an equivalent onomatopoeia in Asian cultures for the English language?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/a1r7x0/you_know_how_ching_chong_chang_is_used_as_racist/",
        "score": 24331,
        "num_comments": 4904,
        "created_utc": 1543572789.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/a1r7x0/you_know_how_ching_chong_chang_is_used_as_racist/",
        "comments": [
            "In the mid-80s,  I (young US Air Force airman stationed in the UK) was on a train from Dover to London with several other GIs.    \n\n\nIt was a fairly empty car, the nearest passengers were three or four french teenagers a few seats in front of us. They would occasionally glance back at us and I know they heard our accents.  After a while, I heard them have what sounded like a negotiation and then a smiling young woman popped her head up over the back of her seat, looked us in the eye and said cheerily: \"shut up, fuck you\".  \n\n\nThe puzzled looks on our faces, and then her face, told us all that she had no idea what she had just said.  After about 10 minutes of one of my friend's high school french, we communicated to her what she had actually said.  Apparently, she had met a group of American teens at home in France not long before and that was their lesson for a universal English greeting.",
            "I asked this exact question to an Asian friend 15 years ago and she said, \"My relatives at home who don't speak English say 'ruh ruh ruh ruh' when mimicking Americans because it has a lot more R's.\"",
            "I teach at an elementary school in Seoul and some students will mockingly shout \"what's up maaan?\" constantly when they're acting up. In a real American accent. They don't understand that I'm Irish! ",
            "I’ve heard some Jamaicans use OKEY DOKEY in a faux-American mockish way, it’s quite amusing.",
            "I was kidding around doing a fake german accent and my german girlfriend got offended and asked me how I'd like it if she did a fake american accent. I said I wanted to hear it and her impression of an american was:\n\n\"Lets buy a cow!\"\n\nI thought it was pretty great and I always try to get her to do her american impression ",
            "In Korea they say ‘Shalla Shalla’ to generalise English.\n\nEdit: Thanks for the upvotes guys!",
            "Ages ago, I played a couple of rounds of Call of Duty 4 with a team of Welsh people. They just shouted, \"dude, where's my car?\" over and over again. Not exactly what op asked, but I thought that to be the strangest summation of Americans that I have personally experienced.\n\nEdit: Yes, I am well aware of the movie Dude, Where's My Car.",
            "I’m American and I once overheard a group of teens on the Tube say, “Let’s try to sound American. Oh my God! I can’t even. Fried chicken!” It was hilarious. ",
            "> \"I'll use my credit card\"\n\n> \"Do you have any non-dairy creamer\"",
            "Exclaiming \"yo yo yo!\" is quite common but it's more for mimicking “urban culture” in the West. It's probably not limited to Asian culture as well *shrug*",
            "Howdy Partner.",
            "In Chile when we mock English we kinda speak Spanish but ending all words in \"eishon\", which sounds like the end of \"nation\", \"relation\", etc. \n\nIt's similar to adding English words an \"o\" at the end for mock Spanish. ",
            "My cousins in India just use some strongly enunciated \"yeah\" and \"actually\" and \"oh my god\" to mock American English. If you want a more proper explanation, they make the vowels open, and the o's more rounded. Sounds like a mix of AAVE, Californian, and Canadian English.",
            "Big mac large fries",
            "[deleted]",
            "I've played a game in France called 'S and Ps'.\n\nFrom what I understand, the French think English is mostly 'ssp pss ssp' sounds. So the game is basically word association but you're not allowed any words that start with P or S.\n\nIf you make a mistake, you take a shot.",
            "Speaking not as an Asian but as a Brit, we tend to mock American accents almost entirely in Valley Girl\n\n&#x200B;\n\n\"Owuh moi gawwwd!\"\n\n&#x200B;\n\nThat sort of thing",
            "[If you want an example of what it can sound like, here’s an entire song with lyrics designed to sound like English but are actually gibberish.](http://youtu.be/-VsmF9m_Nt8)\n\nPretty damn catchy too. ",
            "No, but we call you guys red haired people or \"white ghosts\" which the word ghost means more like rascal. You're more likely to listen these words from older generations.",
            "Not what you're after, but here's what happens when a Japanese company had to make up a bunch of 'American' names for a game.\n\nhttps://i.redd.it/6bgjyibhtztz.jpg",
            "Aziz Ansari said his parents go \"washa washa washa\" to imitate Americans on Comedians in Cars Getting Coffee. ",
            "I was in waiting for a flight in Warsaw when we all found out our plane was being delayed for a couple hours. The man next to us loudly exclaimed “fuck my life!” In a heavy accent before continuing the rest of his rant in Polish. Still makes me laugh",
            "\"Oh hi Mark.\"",
            "Koreans say \"Yankee\" for americans",
            "[This girl](https://youtu.be/ybcvlxivscw) does a pretty phenomenal job of cycling through the sounds of several languages of the world. ",
            "SHALAL SHALLA THATS WHAT WE USE IN KOREA",
            "[deleted]",
            "Am asian and I don't think we have that (that I know of). We just speak in ~~real~~ **broken** English but quizzaciously. ¯\\\\\\_(ツ)_/¯\n\nI have a feeling being taught the international language at a young age prevents you from picking up gibberish English in the first place, explaining the lack of it. \n\nEdit : Broken English!! \"We can speech like almost English\"",
            "I asked my Indian friend to make fun of how  americans talk the way some americans make fun of Indian accents, and it was somewhere between a Disney cowboy and a surfer...I was crying ... it was hilarious. ",
            "\"shalla shalla\" by Koreans - Seo-Hyun89 & here-for-posts\n\n\"Ruh ruh ruh\" by unknown Asian - TheKoleslaw\n\n\"Jee gee gwa da\" by Chinese - woodyinchina\n\nIt sucks that all of the comments actually answering OP's question are at the bottom. All the answers up top are referring to Yankees or actually English phrases with actual English words. \n\nPeople are dumb. Thanks for everyone at the bottom for listening. Very interesting. I've always wondered the same thing!\n\nEDIT: spelling and formatting",
            "This is what English sounds like to Arabic (I'm guessing) speakers: \nhttps://www.youtube.com/watch?v=L3JYdfYxHR0",
            "Btw it's Ching Chang Chong, there's a whole scientific explanation behind it.",
            "Disclaimer: English is not my main language and this happened 2 years ago, I don't remember exactly what has been said\n\nI read a conversation between an american and a japanese in League of Legends EUW server (yeah that's strange)\n\n\nThe american said \"You suck, ching chong chang nagasaki\"\n\nAnd the japanese answered \"shut the fuck up school shooting mc donald's illiterate\"\n\nThe american replied something like \"Oh sorry, in which anti-rape train u have to enter, repressed dog?\"\n\nAnd so the japanese \"At least I can enter somewhere you fatty  bastard\"\n\nAnd they went on and on for about 20 minutes\n\nThat was like, the best game of my life\n\nEdit: the disclaimer",
            "\"Do you have any non dairy creamer?\"😂👌🏼",
            "Greek used to refer to our languages as \"bar bar bar\"",
            "My girlfriend is from Mexico, and her whole family does this equivalent in Spanish when they say things like \"hiya how are yas how are yas how are yas hiya hiya haya\" really fast mocking English speakers. During this relationship I've found that it's also very common for Mexicans to Simply refer to all Asian people as China's (pronounced chee-nuh), far more so than those of us from the United States.",
            "Funny thing... When I was in School we had an exchange student from Korea.  He and I got to be fairly decent friends.  One day I asked him:  \"You know when we make fun of Asians talking, we go 'Ching chang chong ping pong...' etc...  what do you guys do?\"\n\nHe said \"We say 'Shala Shala Shala'\"  I was like what???  lol....  I guess Americans make a lot of Sh sounds when we speak?",
            "Rocked up to Gilli T in Indonesia a few years back and one of the guys behind the bar couldn't stop repeating the same phrase from an old Heineken Ad; \"The Water in Majorca Don't Taste Like What It Oughta\" - its a classically well sounding British phrase but to hear it come from a local there, very funny. Not to mention he didnt  speak another word of english and likely didnt understand what nonsense it is anyways!",
            "My Dad told me once that people who speak other languages call English \" the hissing language\" because we use so many ssss sounds.  Even the letter C has the sss sound. Try listening to someone speak without comprehension... just listen to the sounds.  We are the hissing language ! ",
            "In Brazil at least it's common to add \"ation\" to portuguese words as a way to imitate English, similar to how some people add \"ito\" to words to imitate Spanish",
            "\"Iwannaspeaktodamanaga\" is the closest thing for USAians, no real omnonmnomtoeias though",
            "In Thai, we'll speak 'broken' thai for mocking westerner that speak thai not fluently. such as lack of tone marks, unnecessarily add R sound for every word, make every short sound long, and tell about 'for-tourist' foods like Som-tam, Tom-yum-goong. Even mock them about how they don't like smelly things, like Durian or fermented fish. We also called tourist (mostly westerners) Fa-rang. (Or Faarr-rraang for mockery reason)\n\n[We also have the song for this, named \"Welcome to Thailand\".](https://www.youtube.com/watch?v=qluM8qcuu54) ...Just tell about tourist (westerners ofc) only know Thailand for cheap prostitute, and upset about how they don't even know about the 'good' Thai culture.",
            "We usually mock Americans by saying \"Hey Joe!\" ",
            "Lived in Taiwan and learned Mandarin/taught English.\n\nAdults wouldn't usually do it but the kids (8-14 range) that only knew a few words if English but wanted to tease or pretend they did would just make gibberish sounds with phonemes not in Mandarin, like \"Blah mleh plo plo mleh\" or then say stuff like \"Cooooool\" and \"Ok????\" at the end. \n\nThe local insult for foreigner is big nose.",
            "I don't know, but anything outside greece sounds like \"barbarbar\" to me",
            "Not sure if there’s a specific onomatopoeia, but one of the funniest conversations of my life was when my friend from Japan described a fashion trend in Japan where girls basically try to be a basic white girl. And they’re convinced that they’re the shit. She described it perfectly, down to the Starbucks frappucinos, Ugg boots, huge sunglasses and blonde “messy beach” hair. \n\nThe part where I died laughing was when she told me most of them can’t speak English, but they looove Instagram so they’re very familiar with hashtag-ese. Basically imagine a Japanese girl who keeps saying “Oh-em-gee I can’t even!” “Like, yassss girl!” and “BFFs forever!” because that’s literally all the English she knows.\n\nI told her that in America, “basic white girls” actually get made fun of a lot because there’s a stereotype that they’re dumb. She said “Oh my God, really? That’s so funny! I can’t wait to go back home and tell them Americans would think they’re stupid.” We yell at each other in dumb Instagram hashtags to be silly now. It’s great. ",
            "Well, according to this [skit from a Russian show](https://youtu.be/-2LaVuvCj-I), English sounds as if a person is holding a hot potato in their mouth.",
            "I'm Korean-American, so I hear that \"ching chong\" stuff plenty of times, I usually retaliate by holding my eyes wide open with my two fingers and say with my best southern accent \"I'm American, I like eat cheeseburgers and watch football\". ",
            "\"Ompti dompti pompti ho.\"      \n    \n     \n\nThe average impersonation made by most English speakers when imitating any of the Scandinavian languages.",
            "In Mexico people use something like «washa washa». In fact, «washawashear» is a fake verb that people sometimes use to mock the act of  singing a song with English lyrics, without knowing any English. \n\nThe letter W is the least used in Spanish, and «sh» sounds are almost nonexistent in proper Spanish words (the harder «ch» sounds are used instead). So, washa washa represents the most distinctive English sounds.\n\nEdit- I remembered a Whose Line is it Anyway skit where they asked the English-speaking cast to improv a scene in Spanish, and they all started going «guara-guara-guara». I find it interesting how that's kind of similar to how Spanish speakers mimick English. You just trade the «sh» for soft R's and linger a bit in the final vowel of each word.",
            "Saudis say ar ar ar like a seal because that's how the English 'r' sounds compared to the Arabic r",
            "I had some international students in my study group while in college, and they were from China. Their go-to's were, \"Yeehaw!\", \"Howdy partner!\", \"Oh my god.\", and for some reason \"Mama mia!\". ",
            "\"Big Mac. Apple Pie\"....while holding eyes open wide with fingers.",
            "Rawhide Kobayashi https://i.imgur.com/Urmtgl9.png",
            "I gotta tell you folks. Ever since that business guy, you know the one, got put in charge. And what a task, let me tell you, they said he wasn't going to get in, but here he is. Ever since then I've just been doing his voice, whenever I want to mock America, which is a lot nowadays, believe me, you know, you guys know. This voice like you've never seen, I use it to be American, this to mock, this to mock, this to mock!",
            "Ooo fun history time. This is exactly how the word \"Barbarian\" came into use by the Romans. Essentially it means people who speak BarBar as in \"everyone who's doesn't speak Greek or Latin just wanders around 'bar bar BarBar bar'\"",
            "“Is this non-dairy creamer?” or “let me use my credit card”\n\n[Sauce](https://youtu.be/3IiQU1p4-9E)",
            "If you go to r/asklatinamerica I think someone asked something similar or you could ask again.",
            "I literally know a Chinese man named Ching Chong. Only vaguely relevant, but also mildly interesting, I think. ",
            "Not really an answer to the question, but a funny, related anecdote:\n\nIn Vietnam it was verrry common for people to ask where you're from and then respond with a super exaggerated \"ohhhh you American! \"*oh my gaaawwwwd*\". It was a hilarious trope that pointed out just how common a phrase that must be (or was in 2008,lol). It was like our \"g'day, mate\".\n \nIt was so common I learned how to say  \"oh my god\"(or some approximation) in Vietnamese which I would give the same inflection: \"oi choi oiiii\" and it would always get a good laugh. \n",
            "\"eh mah gawd\" is pretty popular where I'm from, meant in a nice way though, not derogatory.",
            "I was in Germany and one dude asked me \"what do you drive in?\" I responded with \"a car?\" And he proceeded to say \"you guys drive in carrrrrrrrs.\"",
            "In Scandinavia, kids would imitate my English by saying, \"Bibbity bobbity\".",
            "my cantonese speaking grandma says \"gooloo gooloo\" to immitate American English"
        ]
    },
    {
        "post_id": "rokl3n",
        "author": "Assorted_Education_",
        "title": "What strange events have gotten swept under the rug over the past year like they didn't even happen?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/rokl3n/what_strange_events_have_gotten_swept_under_the/",
        "score": 24334,
        "num_comments": 9346,
        "created_utc": 1640476840.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/rokl3n/what_strange_events_have_gotten_swept_under_the/",
        "comments": [
            "Wow everyone has good stuff so mine sounds lame now, but that strange rumbling in New Hampshire. It went on for several minutes. We all thought it was a plane, but the sound wasn’t moving. People all over the state reported it. Nothing on the Richter scale. Small story so it never got mentioned again. Just really strange",
            "Similar to the Panama Papers of 2016, we seem to have completely forgotten about the Pandora Papers, and that was only a few months ago.\n\nFrom the website:\n\"A 2.94 terabyte data trove exposes the offshore secrets of wealthy elites from more than200 countries and territories. These are people who use tax and secrecy havens to buy property and hide assets; many avoid taxes and worse. They include more than 330 politicians and 130 Forbes billionaires, as well as celebrities, fraudsters, drug dealers, royal family members and leaders of religious groups around the world.\"",
            "T.I. (rapper) and his wife have serially drugged and raped over 30 victims. According to 30+ allegations.\n\nIf you google T.I. it doesn't even come up unless you specifically search for it",
            "[removed]",
            "There’s been massive student-led protests in Thailand against the military junta throughout 2021 with the leaders being jailed yet barely a peep from western newspapers.",
            "Burmas military is murdering their own people and wrongfully arresting the entire previous government figures for no reason besides they want power. They’re sending the mentally ill and criminals into villages to burn them down and kill people. My inlaws have t heard from their family almost the entire year because the military will not turn on cell towers. Its insanity and no one is batting an eye at it",
            "Someone committed suicide on Tik Tok and live streamed it. The moderation team failed at their one job, to moderate. Users notified them and once aware, Tik Tok moderation team decided to prepare a PR statement instead of notifying authorities and the victim’s family. They then decided to not release it because the story never gained traction.\n\nOh also, murder hornets\n\nEDIT: spelling",
            "On November 2 the FEC decided that foreign individuals, corporations, and governments can fund ballot measures in the US because they're \"not technically elections\". This is a *staggeringly* big deal that was pretty much immediately swept under the rug.",
            "I know you've said 'over the past year', but I've been keeping tabs on specifically strange events and weird news in 2020-2021 and... I am not entirely sure whether I was noticing more because I was looking more, but it seems like there was a total onslaught of weirdness all over the freaking place. I'm not talking about the stuff most of us heard, even, like declassified UFO files or 'monoliths' in the deserts, there is a ton of lesser-known deep cuts which seem like something out of a comic book or a weird movie. More or less chronologically, with my favorites being in bold:\n\n* [March 2020](https://www.refinery29.com/en-gb/2020/03/9630131/coronavirus-museum-van-gogh-painting-theft) \\- It is discovered that a Vincent van Gogh painting was stolen from the Singer Laren Museum in the Netherlands, taking advantage of COVID-19 lockdowns.\n* [April 2020](https://www.vice.com/en/article/93945v/outlaw-free-weed-toilet-paper-quarantine-manchester) \\- Manchester-based musician OUTLAW handed over lockdown essentials for free: toilet paper, bottled water, sanitizer... *Weed*.\n* [April 2020](https://www.bbc.com/news/business-52490023) \\- When the lockdown started people were expecting and joking that there will be a boom of COVID-19 babies, but contradictory to that expectation people were having less sex, which means that we will likely have *direct* opposite.\n* [May 2020](https://edition.cnn.com/2020/05/04/europe/russia-medical-workers-windows-intl/index.html) \\- A series of unexplained suicides of medical workers in Russia, all of them suspiciously falling from heights.\n* [May 2020](https://www.dw.com/en/russia-ventilator-fire-in-st-petersburg-hospital-kills-covid-19-patients/a-53400972) \\- A string of fires and explosions in COVID wards in Russia due to defective ventilators catching fire and/or exploding. This had way less surrounding media circus than a young nurse dressed in a swimsuit under protective gear due to such wards being unbelievably hot and having no conditioner.\n* [May 2020](https://www.bbc.com/news/science-environment-52667502) \\- Amidst all the 'nature cleaned up' news there was also the fact that there was a surge in illegal killings of birds of prey.\n* [June 2020](https://www.forbes.com/sites/davidhambling/2020/06/05/darpa-wants-cyborg-implant-to-make-soldiers-tougher/) \\- Pentagon is officially looking into cybernetic implants for soldiers.\n* [June 2020](https://phys.org/news/2020-06-scientists-protein-cancer-regenerate-neurons.html) \\- Scientists engineered a protein that can potentially fight cancer and regenerate neurons.\n* [July 2020](https://jalopnik.com/post-office-trucks-are-bursting-into-flames-and-no-one-1844296376) \\- Jalopnik article notices there was a string of spontaneous combustions of post trucks throughout the 2010s.\n* [July 2020](https://www.inquisitr.com/6185161/earth-vibrations-coronavirus/) \\- Lockdowns made Earth vibrate less.\n* [August 2020](https://www.livescience.com/two-hurricanes-gulf-of-mexico.html) \\- First ever *double* hurricane hits Mexico gulf.\n* [**September 2020**](https://jalopnik.com/commercial-airline-pilots-report-seeing-some-dude-in-a-1844918633) **- There's someone in a jetpack flying as high as 3,000 feet near Los Angeles International Airport.** This one is just mind blowing, since sightings by pilots and bystanders alike suggest very powerful one-of-a-kind equipment. God knows what it uses to even propel itself that high (most jetpacks fly much lower and will run out of fuel in like minutes, at best). Moreover, this guy is either a crazy good or crazy pilot since he easily maneuvers near commercial airplanes like it's no big deal. FBI is looking for that guy but so far seems to be as puzzled as anyone. Edit: there is a whole rabbit hole on that one. Some people are convinced it was a specific type of Halloween decoration balloon, but I'm not one of them. Drones are another possibility, especially fitted with Styrofoam 'suit'. So far it's mostly wild mass guessing. Thanks to u/ekmaster23 and u/operatic_icestorm for providing a balloon version!\n* [September 2020](https://www.bbc.co.uk/news/av/science-environment-54029521) \\- There is a bacteria that is reported to survive three years outside of *space station*.\n* [**September 2020**](https://fortune.com/2020/09/18/ransomware-police-investigating-hospital-cyber-attack-death/) **- This one is huge: a hacker ransomware attack is recorded as the first one to ever cause death and is a suspected homicide.**\n* [September 2020](https://www.livescience.com/zombie-storms-climate-change.html) \\- 'Zombie Storms': they regain strength after initially petering out.\n* [September 2020](https://www.forbes.com/sites/michelerobson/2020/09/29/tourist-jailed-for-leaving-negative-hotel-review/?sh=4fdba67a8b9a) \\- Foreign tourist in Thailand is jailed for leaving a negative hotel review.\n* [October 2020](https://mymodernmet.com/king-tut-meteorite-dagger/) \\- It is discovered that King Tut's dagger was made from a meteorite. Edit: It was discovered like 5 years ago, but now they've determined specific type of meteorite. Thanks to u/Alexander_Schwann for correction!\n* [October 2020](https://www.forbes.com/sites/alexledsom/2020/10/14/emptier-roads-but-traffic-fatalities-soaring-why/) \\- Despite emptier roads traffic fatalities are going *up*.\n* [**October 2020**](https://www.nzherald.co.nz/world/escaped-cloned-female-mutant-crayfish-take-over-belgian-cemetery/YZDGK4GTJKKML7Y76OELOTHGPA/) **- 'Escaped cloned female mutant crayfish take over Belgian cemetery'.** Thanks to u/VibraphoneFuckup for correcting this one: it's not as exciting as the awesome headline proclaims, but a very special genetic mutant crayfish which does not occur naturally and is a strictly controlled domesticated animal was lost by someone and since it has an ability to multiply in epic proportions and be unaccountable (every specimen has the same genetic makeup, like in cloning) and became rampant on a cemetery.\n* [June 2021](https://www.cnet.com/news/animal-revived-after-being-frozen-for-24000-years-in-siberian-permafrost/) \\- Microscopic Arctic animal found in Siberian permafrost is revived despite being 24,000 years old.\n* [July 2021](https://www.newscientist.com/article/2283849-some-people-can-tell-if-you-have-an-infection-just-by-looking-at-you/) \\- Study semi-confirms we can probably subconsciously identify by face alone whether a person is infected with something.\n* [August 2021](https://www.reddit.com/r/serialkillers/comments/pcg7vm/there_may_be_a_new_active_serial_killer_in_texas/) \\- Possible serial killer in Mathis, Texas: two bodies discovered weeks apart with GPS coordinates provided to relatives via anonymous phone call. Might be related to human trafficking. Edit: This is most likely *not* a serial killer. Thanks u/luvdoodoohead for [expanding](https://www.google.com/amp/s/www.kiiitv.com/amp/article/news/local/body-discovered-near-mathis-through-gps-coordinates-given-to-family-in-new-york-sheriff-says/503-2a7e0aec-e6b7-4c82-9fb5-6ed4ee5f00b6) on that!\n\n**Honorable mention:** There is a surge in crossbow killings: at least one per year since 2019 plus attempts ([an example](https://edition.cnn.com/2020/11/02/europe/russia-sausage-king-killed-intl/index.html)). Also several new criminal types have formed centering around video game industry, namely people who climb unto *moving* trucks to stole game consoles.\n\nEdit: Greatest thanks for all the awards, guys!",
            "Congress being able to insider trade legally",
            "The two US Senators who traded on early and privileged knowledge of the coming pandemic with stock trades for themselves- one also tipped off a brother in law?",
            "Kelly Ann Conway published nude pictures of her underage daughter as a form of punishment. \n\nAKA distribution of child pornography",
            "Everyone in here talking about 2020, so I think we have forgotten about 2021",
            "The Amazon burning . It was going for a minute but i havent seen much on it in the last couple .months",
            "That time the ocean was on fire",
            "The car bomb that went off in downtown nashville on christmas day",
            "A guy found shrimp in his cereal, Quaker Oats claimed it was just sugar (it wasn't) and then the guy got cancelled for being a serial abuser.",
            "Anyone remember the rumors of Kim Jon Un being ill?",
            "Nobody seemed to remember Ukrainian passenger flight being shot down by Iranian government last year.",
            "How's Hong Kong Protest doing these days?",
            "The speaker of the house decided to justify insider trading.",
            "The loss of the Ivory-Billed Woodpecker \n\nhttps://www.npr.org/2021/09/29/1041393172/u-s-says-ivory-billed-woodpecker-and-more-than-20-other-species-have-gone-extinc\n\nand the likely extinction of many European bird species too, for that matter. \n\nhttps://www.theguardian.com/environment/2021/oct/14/one-in-five-of-europes-bird-species-slipping-towards-extinction-aoe\n\nEdit:  Thank you for the helpful award; I will be paying it forward in time.  (New Redditor)",
            "Why the hell was this removed?\n\nThe largest human trafficking bust in history that occurred in South Georgia and Middle Florida, and South Texas.\nLook up “Operation Blooming Onion”. \n\nThey smuggled in humans from Central America and forced them to work on farms in horrid conditions. Paying them “20¢ a bucket” and forcing them to dig with their hands and no tools.\nThis is slavery.\n\n“The conspirators required the workers to pay unlawful fees for transportation, food, and housing while illegally withholding their travel and identification documents, and subjected the workers “to perform physically demanding work for little or no pay, housing them in crowded, unsanitary, and degrading living conditions, and by threatening them with deportation and violence.”  \n\n“Operation Blooming Onion, a six-year investigation, determined that there were roughly 70,000 victims, with 100 of them being located in the southern region. \n\nInvestigators stated that there were several rapes and deaths among the visa recipients. \n\nThe exploitation of the workers included being required to dig onions with their bare hands, paid 20 cents for each bucket harvested, and threatened with guns and violence to keep them in line. “\n\nDon’t let this get removed. More people need to know about this.\n\nKeep reposting.\n\nhttps://www.justice.gov/usao-sdga/pr/human-smuggling-forced-labor-among-allegations-south-georgia-federal-indictment",
            "Stock market manipulation",
            "Any and everything that has happened got swept under the rug. I don't really think this year existed until its over. Never to be thought of again. New Years resolution.",
            "That lady that was found on rocks and had no memory but spoke English in Lithuania or wherever the heck that was.",
            "Plague of locusts spanning multiple countries and at least two continents? Has anybody mentioned that yet?\n\nEdit: the locusts were in Africa and southwest Asia. They started in Oman (I think) and then spread both west and east. Funny that everyone thinks I meant the United States.\n\nhttps://en.wikipedia.org/wiki/2019–2021\\_locust\\_infestation",
            "When did Texas freeze? Was that within the year??",
            "Remember how in Florida there was a story of the Florida State Police raiding a data scientist's house to take all of her covid case data? That seems to me like it should be brought up more\n\nEDIT: FSP, not FBI",
            "The Federal government seizing coronavirus tests, masks and other medical PPE from entire states at gunpoint during the pandemic. The situation got do bad that the governor of MD had to deploy armed members of the National Guard and State Troops to protect their shipments... from the government. Nobody remembers. \n\nhttps://www.cnn.com/2020/04/30/politics/larry-hogan-coronavirus-masks-national-guard/index.html",
            "That hit man dressed up like a Fedex driver that tried to kill a federal judge associated with the Epstein case. The ring leader of the MI governor kidnapping plot being mysteriously pardoned in 2019.",
            "[deleted]",
            "[deleted]",
            "Those Panama papers and the recent release of all those financial records, showing how the super-rich hide their money in foreign countries to avoid paying taxes. \n\nIncredible how quickly that one evaporated from the news - I wonder why",
            "Maybe not swept under the rug just not represented enough, but ghislaine maxwell trial.",
            "[deleted]",
            "Some dude plowing through a parade, after a few days I have barely heard anything about it.",
            "There is still no attempts to reinstate Net Neutrality.  I guess the rumors are true, it wasn't political\\\\D vs R...it was all about $$$ and we the little people are just screwed.  Since it's demise, I have been hit with a $30 rate hike, a data cap, random outages and obvious speed reductions for streaming services.  AND, I still have exactly ONE internet service provider in my area...ONE.  How is that \"competitive for consumers\"?",
            "The Facebook whistleblower incident. Facebook had internal research and documents showing how extremely harmful their apps are to teens mental health and yet Facebook still chooses profit. \n\nIf you want a scary sight go look at the rise of suicide and self harm rates since the rise of social media. But we’re all just sleepwalking and complacent bc the vast majority are users of said apps. \n\nHow can kids being so mentally harmed by the app that they self harm or commit suicide not be a wake up call to America? \n\nThere was *one* congress hearing and *nothing* came of it. Fuck Facebook, fuck the government for not doing anything.",
            "They forgot about the opiate epidemic, and of course we lost staggering amounts of people that were in successful treatment programs due to shut downs and quarentineing as well as those with mental health problems being secluded for so long. I personally lost about 5 people I knew...my sister was among those. COVID killed with more than it's germs.",
            "Robinhood shutting off the buy button to stop GameStop’s price from climbing.. so blatantly manipulative",
            "When at the beginning of Covid (March 15th 2020), the Federal Reserve dropped the requirements for banks to have cash reserves to 0%. Fucking ZERO!!! And almost NO ONE noticed! The money you keep in the bank...ANY bank, has already been lent out hundreds of times over (and that was when the requirements were around 4%). That loan they're giving out is backed by Nothing. Not just fiat cash being worthless, this is imaginary money. If 10% of customers (fake percentage...but you get the idea) of any branch came in at once to clear out their accounts. The bank wouldn't be able to fulfill the request. We are so fucked, unless WE change them. (How? I wish I was smarter...voting seems to not work. Getting people to care...even harder.) https://www.federalreserve.gov/monetarypolicy/reservereq.htm",
            "armie hammer.",
            "AT&T spending the last few years convincing 9-11 centers across the state of Tennessee (and probably many others) to drop their carrier diversity across the state if they took their solution. Then the bombing on Christmas Day happened at a AT&T telecom hub that knocked out 9-11 across the state because they had no backup carriers. \n\nAT&T was supposed to be grilled in a public hearing after the bombing for their significant vulnerabilities, but then the the corrupt state legislature canceled it and walked away from holding AT&T accountable.\n\nTHEN  AT&T was “awarded” the State Next-Gen 9-11 contract later in the year, after so many well-documented failings, with state decision makers retiring and walking into some pretty sweet gigs over at AT&T. \n\nThe amount of open corruption in the TN government when it comes to AT&T is breathtaking. I wonder how much the local FBI field offices make off of looking the other way?",
            "The removal of the tiananmen square monument in hong kong.",
            "Remember when Jamal khashoggi was lured to an embassy, cut into pieces and then disposed of?\n\nBut hey, that 6 billion usd arms deal to Saudi couldn't be compromised.",
            "The video of the Florida police officers shooting up that UPS truck in the middle of traffic and killing the UPS driver and an unrelated car driver, as well as the thieves involved. The video was absurd\n\nEdit: not the past year.",
            "Murder hornets. I feel like we didnt pay enough attention to the murder hornets",
            "The whole drama with the world war 3 crap. I remember it.",
            "what ever happened to the whole matt gaetz sex trafficking investigation?",
            "[deleted]",
            "The flight log to Epsteins pedo-island",
            "the biggest mass shooting in Canadian history took place.  I don't think most people even know one happened at all.\n\nEdit: nvm that was april 2020. He killed 22 people.",
            "The two largest states in the world by population and both nuclear powered got into a fist fight on the border and no one in the west spoke about it. They were not allowed to fight using guns, due to a treaty, so they killed each other with stones and sticks. 20 soldiers died (potentially way more) and could lead to the bloodiest war in history. \n\nThe india china border over the Himalayas is where is happened. Link below, pure madness. \n\nhttps://amp.theguardian.com/world/2021/feb/12/armies-of-china-and-india-pull-back-from-hand-to-hand-border-battle-zone",
            "Apparently there was some super intense virus in China in December 2019 that was going to sweep the world, but I honestly haven't heard anything about it since.",
            "This feels more like an r/AskReddit question tbh",
            "Chinese Tennis player disappearing.",
            "In Perris, California there was a case called The Turpin case which concerned the maltreatment of children and dependent adults by their parents David and Louise Turpin. Their parents would chain them to beds, never let them outside, shower them a few times a year, no cell phones/outside interaction, daily beatings etc… \n\nNow some of you may of heard of this case, one sister got out and dialed 911 and saved her siblings. Highly recommend the documentary called “Escape From a House of Horror”. Anyways, what is being swept under the rug is the fact that no one is helping these children now. The Social Services System isn’t giving a shit about them. Housing, food, education, it’s all currently being investigated now by outside investigators. I’m pretty sure I read that a couple of the smaller children reported they went into abusive foster care… imagine the mental torment AGAIN.\n\nMy heart hurts for these children.",
            "The Pandora papers came out showing the tax havens rich fucks are using and….. nothing came of it\n\nEdit: pandora papers, even more ironic",
            "The Uyghur ethic cleansing in China",
            "Military acknowledgement of UFO's \n\nNot a huge deal I guess that military experts can't debunk UFO videos caught with their own equipment.",
            "The bomber in Austin Texas. They shot him dead in his car, but no details seem to have been released since.\n\nCome on y'all!",
            "That’s easy. It would be the failure of the Oroville dam in California. Check it out if you don’t know about it. It took over a month of draining before they could start repairing the damage. Factoid, amateur gold miners did ok for themselves, panning the remains for bits and pieces. I think the State stopped them. Does anyone know for sure?",
            "That time a bunch of Reddit mods went rogue and decided to start banning anyone's account they didn't agree from their respective subreddits with and Reddit admins had to step in to push back on the effort.",
            "The Jeffrey Epstein case. Everybody just stopped talking about it.",
            "Haven't heard much about The Elizabeth Holmes trial.",
            "The fact that nobody really seems to care about the epstein/ maxwell trial at all. Like it's never mentioned anywhere and the trial went down pretty quietly AFAIK. \n\nPretty sketchy honestly. Just about any big scandalous news to do with world powers or leaders tends to have some crazy event happen very shortly after it comes to light, seemingly to distract *us from bigger things which never get mentioned again afterward.",
            "The common theme of many of these is that they are things that can't be used to push a narrative, they're just news.\n\nIn a slightly different vein: Lots of infrastructure failure disasters end up quickly forgotten even though they COULD and probably SHOULD be used to push for more infrastructure maintenance and funding, but they aren't exciting issues to fight about on the news.\n\nIn [June 2021](https://www.youtube.com/watch?v=pgz5Xq4GUio), an apartment building in Florida collapsed, killing 98\n\nIn [February 2017](https://www.youtube.com/watch?v=jxNM4DGBRMU), the largest dam in the country (Hoover Dam is #2) failed, releasing one of the largest reservoirs in the country and causing the evacuation of almost 200,000 people.\n\nIn August 2007, a major interstate bridge in downtown Minneapolis collapsed, killing 13.\n\nThese are just the first 3 that came to mind. (including links to a channel with REALLY good videos about events like this and also the often overlooked but very important aspects of infrastructure)",
            "The guy that ran over all those people in Waukesha. Usually something like that would be plastered all over the media for the next 6 months.",
            "the red cross found covid antibodies in blood samples all the way back from [2019](https://www.redcross.org/about-us/news-and-events/press-release/2020/study-suggests-possible-new-covid-19-timeline-in-the-us.html), possibly proving that covid was in the US much earlier than speculated",
            "USPS awarding a federal contract to build new electric post trucks to a company that only produces gas powered vehicles",
            "What ever happened to those monoliths that were found around the world?",
            "Millions of farmers in India protested every single day against new farm laws that would have put small farmers at the mercy of huge corporations. It was most likely the largest protest in human history and no one really talked about it. \n\nThe farmers protested everyday for over one whole year and only recently were the farm laws removed. The laws were most likely removed because the ruling party really needs seats in the places most of the farmers were from and there's a really big election coming up.",
            "The Amazon rainforest is still burning.",
            "Gamestop being naked short sold. Robinhood removing the buy button on gamestop in january.",
            "People were actually listening to sea shanties lol. Pretty sure everyone was just a bit crazy from lockdown",
            "Really I feel like since 2014 more and more things have been swept under the rug and mixed up in the media's bullshit for the sake of concealment.",
            "OJ got released early for good behavior.",
            "TIL I read stupid reddit shit instead of paying attention to current events. Thank you everyone who took the time to post this information.",
            "Pedophile Island.",
            "Republican congressman Matt Gaetz's involvement in a [sex-trafficking operation](https://www.theguardian.com/us-news/2021/aug/22/matt-gaetz-republican-sex-trafficking-investigation-marries-california). He got married instead.",
            "That guy that ran over an entire crowd of people in Waukesha",
            "Vegas shooting. Also there was a really strange case of a black cop who killed some people and ran away to a log cabin and they burned it down with him in it. Such a suspicious odd situation that was never discussed afterwards. Dorner think was his name.",
            "That canal thing where the entire economy was messed with because of a big ass boat or whatever you’d call it",
            "In an effort to stop tax evasion, the government supposedly wants to monitor bank accounts having transactions totaling an absurdly low amount, like $600, for the whole year. \n\nIt sounded insane to me, but it’s an actual thing. Shouldn’t we be focusing on the wealthy who are abusing tax loopholes and not the average struggling American?",
            "It seems like we’ve all but forgotten:\n\n- Oil prices falling to an all-time-low during lockdowns\n- Lockdowns also catalyzed a process of environmental reclamation, better atmospheric conditions, fauna populations, etc.\n- The fact that, many Western governments were of the official position that masks do more harm than good\n- Protests in Belarus over democratic process\n\n\n_(I’m conflating events that may encompass more than a year’s-worth of time here, depending on where you’re located)_",
            "I'm not sure if all these comments were \"swept under the rug\", but there was just sooooo many shitty things that the news cycles got shorter.",
            "Travis Scott’s murder concert",
            "McDonald's getting rid of all-day breakfast",
            "The graves in canada",
            "I only heard about the new space telescope a week or so ago.",
            "the forced hysterectomies happening in ice detainment...",
            "In the UK the current PM breaking electoral laws to refurbish his flat by using non declared funding from a wealthy donor. On top of him and his cabinet blatantly breaking covid restrictions. Ironically both times the piece of shit used his partners pregnancy to cover over scandals first announcing her pregnancy then the birth of his kid right off the back of him landing in the shit. Has he had to resign? Nope, a small slap on the wrist with a fine and liable to get elected again despite consistently proving his incompetency.",
            "Chile started the process of re-writing the constitution that was put in place during Pinochet’s dictatorships. Constitutional congress members were democratically elected from every region of the country, they must include native representation from each region, and be 50% women. This will make Chile’s new constitution the first in the world written by women. And to top it of, the first act off, the congress first decision was to elect Elisa Loncón, a native woman, as the congress’ president. This entire process has received very little media coverage in the US, even though it is a historic event that all democracies around the world should be watching, celebrating, and supporting.\n\nEdit: thanks for the award kind stranger. Let’s spread the word on the new Chilean constitution.",
            "Does anyone remember when we first went into lock down the planet started to heal? What ever happened with that information? Why has no one done anything with this?",
            "John McAfee's \"suicide\"",
            "Trudeau enforcing everyone to stay home and not leave the country for the new year and then leaves Canada to a Caribbean island to celebrate new years to come back and fire countless politicians who had left Canada for new years",
            "China's concentration camps",
            "I think more than a year ago, but that young guy who got tortured in North Korea for taking a poster off the wall. He comes back completely brain dead and instantly dies. Trump bashes NK denouncing them for torturing him. Then to make things even worse, trump out of no where flips and is like oh North Korea didn’t know and Kim jong is my new best friend. Just a huge F U to the dead kids parents.\n\nEdit: I recently saw this on my feed and this is what sparked my memory of this tragedy https://www.reddit.com/r/Documentaries/comments/retbfv/what_happened_to_otto_warmbier_in_north_korea/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "16 years of blatant corruption, destruction of Brazil's economy, and alliance with dictatorships, by a large group of ~~criminals~~ sorry - \"politicians\". One by one, laws have been changed, sentences have become \"void\", justice has been overturned, and the population being convinced that condemned criminals are poor, injusticed people.",
            "Arctic methane releases, study and documentation of rising methane releases from subsea frozen methane deposits called Klathrate. Search terms: methane klathrate, methane pingo\n\n\n[Recent news, Canada](https://www.highnorthnews.com/en/arctic-craters-caused-climate-change)\n\n[pingo](https://image1.slideserve.com/2134894/methane-pingo-l.jpg)\n\n[Recent news from Siberia](https://www.dailymail.co.uk/sciencetech/article-8687073/Massive-underground-methane-explosion-leaves-165-foot-deep-crater-Siberia.html)\n\n[Summary paper from 2015](https://ui.adsabs.harvard.edu/abs/2015AGUFM.C43A0789S/abstract)",
            "Those Chinese journalists who were reporting Corona in Wuhan and claiming it was either China’s fault or a lab leak, not reporting for a month after their report and ‘dying from Corona complications’ according to the Chinese officials.",
            "That Prince Andrew is a pedo and the Royal Family pressured Scotland Yard to drop it which they did exactly that.\n\nhttps://www.latimes.com/world-nation/story/2021-10-11/scotland-yard-drops-investigation-prince-andrew-virginia-giuffre",
            "Epstein got fucking executed in prison right before he spilled secrets on the sex trade... Who knows how high up he was going to expose? And here we are. Are we still investigating that?",
            "World elites fuckin children and their handler going to trial for it",
            "I'm a PA-C in Urgent Care in the USA. If you aren't in a job or population with concern for it, then you probably missed the arise of Super Gonorrhea as a significant portion of our gonorrhea cases in the US. Just as spreadable and now with more molecules!!! Leading to increased resistance to a plethora of antibiotics and requiring double to triple dosing of some of those we administer in clinic that now get adjunctive oral antibiotics.",
            "The Havana Syndrome. Attacks on multiple diplomats and people in the CIA at foreign embassies. They sustained mild concussions and some sustained permanent neurological disabilities causing some to retire early. It happened several times throughout the year. Each victim would hear a high pitched buzzing. They believe it could be coming from their phones. Officials believe it's some sort of attack using microwaves. We still don't know who is responsible or how they are doing it.",
            "In the UK in August scientists said the way the country was acting was going to cause exactly what is happening right now, and everyone in the government is putting on their best shocked pikachu face now"
        ]
    },
    {
        "post_id": "d0x7ki",
        "author": "None",
        "title": "Most Americans think other accents are cool (Irish, British, Australian, etc), but what does the rest of the world think about an American accent?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/d0x7ki/most_americans_think_other_accents_are_cool_irish/",
        "score": 24282,
        "num_comments": 5536,
        "created_utc": 1567869374.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/d0x7ki/most_americans_think_other_accents_are_cool_irish/",
        "comments": [
            "When I (‘Mercan) was hanging out in Blackpool England, a cabbie heard me talk and yelled “foook me, ya sound jus like Brat Pitt!!”\nUntil then, I figured my\nMidwestern accent sounded bland and ordinary.",
            "It sounds natural to me since Scotland has american tv shows along with the rest of the uk. If I ever hear an american accent in real life though it sticks out like a sore thumb",
            "I usually associate the American accent with Hollywood and celebrities. It sounds normal when I hear it in films but when I hear it in real life it's kinda odd. I also really like the southern accent.",
            "England here. As others have said, we're kind of normalised to it thanks to TV, movies, etc. But it always sounds a little strange in real life. Now and then you hear an American in England and (not to be rude) they almost always seem to be the loudest voice in the room. Not like they're shouting or being obnoxious or anything, their voices just seem louder. One time I was sitting in a hotel lobby in Wales and this American guy walked in. The sheer bass of his voice was astounding.\n\nHonestly though (and this is a bit off-topic), more shocking than the accent is just the manner of speech and general behaviour. I never get this impression from the way people talk online, but it seems like in North America (I've been to Florida and to Canada) people are always super nice to each other, especially to bus drivers, cashiers, etc. They always have such complete and wholesome goodbyes. \"Thank you very much! You have a great day, God bless\", etc. By comparison it feels like we over here are all just depressed and want minimal human contact. \"thx\"",
            "[deleted]",
            "I once asked a guy, “How you doin’?” He rocked on his heels and said, “I’m doin.’” I almost died!",
            "I really enjoy American accent. Hearing it all the time it's \"normal\", but every once in a while when I hear it in person it just sounds nice to me. Like round and squishy.\n\nEdit: This thing kinda blew up. I am from Croatia for those wondering. I love the fact how native speakers liked my description.",
            "The American accents are varied, from educated articulate person, to tin can chewing badger tripping on LSD.",
            "I’m British I like some of them but really dislike some others. The Hollywood accent I’m kind of used to as we get a lot of American TV shows and movies. I really love southern accents, I think they sound awesome. \n\nThe ones I really don’t like are New York and Boston accents. They sound overly aggressive and very jarring.\n\nEdit: Wow my first ever gold. Thank you kind stranger. I wonder if you have a delightful southern accent.",
            "All British kids have an American accent for playing at star wars or war.\n\nIt really is part of all our childhoods",
            "I'm salvadorian but speak in an american accent. But I gotta say, before i spoke english, I  thought an american accent was just adding the words \"o my gosh\" to everything you say.",
            "I've known a few Europeans who think it sounds vulgar: to them it seems like we're opening our mouths really wide and extending the vowels. \"blAHH blAHH blAHH\"...sloppy. Mostly from speakers of languages with precise enunciation and clipped vowels, of course.\n\nEdit: spelling",
            "Traveling outside the US and even out of the South, I have gotten compliments on my accent. My brother has gotten weird looks and even insults. We grew up together, but with different friends and interests, so we have different Southern accents. Some people on a train in Europe had a discussion about our accents because they were surprised we were from the same family. They said they liked mine because it was a softer accent and better articulated, whereas my brother's accent was what they called \"country\".",
            "I’m American and have been living in London for a few months. I went to a weekly board game meetup up at a pub, and there was one regular from the US. My first time there someone asked me if I was making fun of him by mimicking his accent.",
            "I'm from Texas when I visited Glasgow I had a group of girls who kept asking me to just say anything it was like a novelty",
            "[deleted]",
            "My in-laws were both born and raised in North Carolina. Highly educated. Both speak like they have a mouthful of marbles.",
            "[deleted]",
            "Yes, I have an Israeli co-worker who can’t understand why people ask, “How are you?” as they walk away. “Don’t they want to know?” It’s a fair question.",
            "Let me axe you sumthing.\n\nLouisiana accents are funny. Most americans talk a rather plain english, without much of an accent. At least I feel that way. There is a lot of slang and some accents from the southern states. Nothing too fancy imo.\n\n&#x200B;\n\n*Edit: It's obviously a bad idea to generalize anything and that is also true for accents. I didn't put a lot of effort into writing down what I wanted to say in my comment, so let me fix that:*  \n*There must be a variety of accents in the USA. Many might not be as distinguishable as british, scottisch or australian though. But with such a large country and especially landfolks living in the same places for centuries and not travelling and moving a lot, there must be differences. I'm from Germany and have lived in TX for 2 years, so I'm rather used to southern accents and I do see the movie actors way of talking as \"the\" american way to talk, which is obviously wrong if you give it enough thought. But the common movie talk is pretty plain, maybe actors even work on losing accents to fit general roles properly. Not too many (Sir) Sean Connerys around these days. That's what lead me to say american english sounds rather plain, compared to other countries english, but obviously there is a lot of variety in the american accents, just as there is a lot of variety in the american culture anyways. Californias movie production just kind of dictates what is generally viewed as american accents.*",
            " I knew people made assumptions about me because of my accent but damn, I didn't think so many people immediately labeled me as an idiot. Oh well.",
            "There are about 100 different american accents tho.",
            "I’m an American-born East Asian and I’ve been living in Australia for the last 2 years and most (if not all) locals who I chat with even in passing always ask if I’m Canadian first. Apparently there’s this thing where if you ask an American if they’re Canadian, it’s fine, but if you ask a Canadian if they’re American, it’s insulting. Can’t really argue with that lol. \n\nInterestingly, most of my dates have made some mention that my American accent is fascinating. Apparently I have a fairly strong Californian accent in particular, and the local Australians find that fun to listen to.\n\nI’ve even joked with girls that the reason Australians date me is bc of my accent. Apparently East Asians with non-Asian accents are hard to come by in these here parts.",
            "What I don't like about the American accent is how poorly it translated when pronouncing words in other languages.\n\nThat being said there are many American accents. Some I like, some I'm impartial to but I don't think anyone are as bad as say the Scouse accent.",
            "I absolutely adore the New York accent. Specifically the Jewish subtype. I find it interesting how Jewish people are able to preserve their mannerisms no matter the environment. For example, the Odessa accent is to Russian (Odessa is a port city in the south of Ukraine, great percentage of population is/ was jewish) what the NY Jewish accent is to English.",
            "There are some that I can't stand, like how like a lot of like people literally, like, talk in like California. \n\n&#x200B;\n\nI don't know which accent it is, I think it's some sort of Texan but I'm not sure so sorry if it isn't, but in the road trip episode of Brooklyn 99 season 5 there is this police officer that says \"Bovine transport unit\" and I love the accent he says it in. A bit random, but that's the only time I've hear it",
            "German here. Can't help but associate a southern accent with poor education. All the others? Flashbacks to weirdly overblown film trailer narration, mostly.\n\n\"T H I S   S U M M E R\"\n\nYou know the ones.",
            "Depends *which.*\n\nThe USA has a few different accents and some - or most - are pleasant, others, like Boston's accent are kind of annoying (in my opinion).\n\nI kind of like the southern accent too.",
            "for me it sounds cool, but sooo weird in real life, comparing to the ones we hear on TV. It’s by far the easiest to understand (and that’s my accent whenever I speak English). I lived in England for 4 years and the american accent just won’t give in. (I’m from Brazil).",
            "To me TV Americans sound fine and I actually speak somewhat similarly to them. (my Aussie accent from when I began learning English has rubbed off a bit and now I have a sort of \"true neutral\" accent). Real-life Americans sound insanely weird! They sound nasal all the the time, talk too fast and don't articulate. The most standard accent for me is the way Canadians tend to speak.",
            "Everyone eats up my southern American accent that I have met",
            "As a non-native English speaker I prefer American accent over UK, simply because I often don't get what those royals are trying to tell me.",
            "I'm from Scotland and I think American accents are so cool!!",
            "Here in France, most people think every American speaks with a texan accent. As a matter of fact, if there's an American character in a French movie, no matter where he's from, his accent is from Texas. (It's been changing recently now. But maybe that's because American characters stopped looking cool.)\n\nMoreover, most French people speaking english will use the very same accent they're used to, and some of them will actually try to correct you if your pronunciation is slightly different from theirs. Because French attitude does not need French language to apply.",
            "American = US\n\nSouthern US accent hears like exaggerated to me. First time I heard it, I thought they were joking and making it up.",
            "My parents have a thick Russian accent and I just think it’s annoyingly hard to understand. But also it sounds badass",
            "Whenever I hear Americans I picture burgers in my head I don’t know why",
            "American accents just sound smooth, like if you ever want to hear someone speak for a long time it would be better if it was a kinda soft californian accent",
            "As very unspecial.\n\nHigh class southern accent is sweet to listen to.",
            "Never realized that I even had an accent. Grew up in Chicago and the first time I visited California (LA area) people would ask if I was from Chicago. Freaked me out that they could guess just from hearing me talk.\n\nLater I was in Germany and the locals would ask where my accent was from. Again, what accent? Would tell them I'm from Chicago and they'd almost always bring up Al Capone.\n\nCHICAGO SLANG\n\n1. Grachki (grach'-key): Chicagoese for \"garage key\" as in, \"Yo, Theresa, waja do wit da grachki? Howmy supposta cut da grass if I don't git intada grach?\"\n\n2. Uptadaendada (up-ta-da-en'-dada): As in, \"Joey, you kin ride yur bike uptadaendada alley but not acrost or I'll bust yur butt.\"\n\n3. Sammich: Chicagoese for sandwich. When made with sausage, it's a sassage sammich; when made with shredded beef, it's an Italian Beef sammich, a local delicacy consisting of piles of spicy meat in a perilously soggy bun.\n\n4. Da: This article is a key part of Chicago speech, as in \"Da Bears\" or \"Da Mare\" -- the latter denoting mayor Richard M. Daley, or Richie, as he's often called.\n\n5. Jewels: Not family heirlooms or a tender body region, but a popular name for one of the region's dominant grocery store chains. \"I'm goin' to da Jewels to pick up some sassage.\"\n\n6. Field's: Marshall Field, a prominent Chicago department store. Also Carson Pirie Scott, another major department store chain, is simply called \"Carson's.\"\n\n7. Tree: The number between two and four. \"We were lucky dat we only got tree inches of snow da udder night.\"\n\n8. Prairie: A vacant lot, especially one on which weeds are growing.\n\n9. Over by dere: Translates to \"over by there,\" a way of emphasizing a site presumed familiar to the listener. As in, \"I got the sassage at da Jewels down on Kedzie, over by dere.\"\n\n10 Kaminski Park: The mispronounced name of the ballpark where the Chicago White Sox (da Sox) play baseball. Comiskey Park was recently renamed U.S. Cellular Field (yuck!)\n\n11. Frunchroom: As in, \"Getottada frunchroom wit dose muddy shoes.\" It's not the \"parlor.\" It's not the \"living room.\" In! the land of the bungalow, it's the \"frunchroom,\" a named derived, linguists believe, from \"front room.\"\n\n12. Use: Not the verb, but the plural pronoun \"you! .\" ! ; ;\"Where's use goin'?\"\n\n13. Downtown: Anywhere near The Lake, south of The Zoo (Lincoln Park Zoo) and north of Soldier Field.\n\n14. The Lake: Lake Michigan. (What other lake is there?) It's often used by local weathermen, \"cooler by The Lake.\"\n\n15. BoysTown: A section on Halsted between Belmont and Addison which is lined with ...I am editing this one for Headfi...Umm I think you can take a guess at this...lol\n\n16. Braht: Short for Bratwurst. \"Gimme a braht wit kraut.\"\n\n17. Cashbox: Traffic reporter slang for tollbooths. \"Dere's a delay at da cashbox on da Skyway.\"\n\n18. Goes: Past or present tense of the verb \"say.\" For example, \"Then he goes, 'I like this place'!\"\n\n19. Guys: Used when addressing two or more people, regardless of each individual's gender.\n\n20. Pop: A soft drink. Don't say \"soda\" in this town. \"Do ya wanna canna pop?\"\n\n21. Sliders : Nickname for hamburgers from White Castle, a popular Midwestern burger chain. \"Dose sliders I had last night gave me da runs.\"\n\n22 The Taste: The Taste of Chicago Festival, a huge extravaganza in Grant Park featuring samples of Chicagoland cuisine which takes place each year around the Fourth of July holiday.\n\n23. \"Jieetyet?\": Translates to, \"Did you eat yet?\"\n\n24 Winter and Construction: Punch line to the joke, \"What are the two seasons in Chicago?\"\n\n25. Cuppa Too-Tree: is Chicagoese for \"a couple, two, three\" which really means \"a few.\" For example, \"Hey Mike, dere any beerz left in da cooler over by dere?\" \"Yeh, a cuppa too-tree.\"\n\n26. 588-2300: Everyone in Chicago knows this commercial jingle and the carpet company you'll get if you call that number -- Empire!\n\n27. Junk Djor: You will usually find the 'junk drawer' in the kitchen filled to the brim with miscellaneous, but very important, junk.\n\n28. Southern Illinois: Anything south of I-80.\n\n29. Expressways: The Interstates in the immediate Chicagoland area are usually known just by their 'name' and not their Interstate number: the Dan Ryan (\"the Ryan\"), the Stevenson, the Kennedy, the Eisenhower (the \"Ike\"), and the Edens.\n\n30. Gym Shoes: The rest of the country may refer to them as sneakers or running shoes but Chicagoans will always call them gym shoes!\n\n31. Da Coach: The one and only Mike Ditka",
            "[deleted]",
            "Oh I love the southern, Gone with the wind type accent. Just oh",
            "They're ok but get annoying if it's southern",
            "Can people that live outside of the US detect southern and Northern American accents?",
            "Brit here: Best accent for singing. Not the best for talking.",
            "From growing up in the North of England, it was generally seen as exotic and cool. Guys would take the piss (what's up, douuuuuchebag?\" in a hideous impression of a West Coast accent); girls would get...*gooey*. Not gonna lie: my accent was a major selling point in the dating game.",
            "American English sounds like Germans speaking English",
            "Tbh, Americans hear British accents so often on the TV, and vice versa, that I dont really think its \"special\" for anyone. It's just something you notice and carry on.",
            "Not american specific but I heard speaking English in Japan is cool",
            "Disclaimer, am American.\n\nIn middle school/high school we had a substitute teacher from Finland who toured around the district named Mr. Arrolla. Dude was cool, always gave his backstory to classes he didn't recognize people in, had a strong but very understandable accent, English teacher who'd taught English in Finland before moving to the states. Dude claimed that American accents were the most beautiful versions of English ever, better than \"harsh British or Scottish accent\". Haven't thought about him in ages, but the second I saw this it all came back.",
            "I get complimented quite a bit on my southern accent (I am from Alabama) by people that are from other countries when I play games online but when it comes to Americans they make fun of me, especially from othe females. Most insults are that I am either stupid, sound stupid or am incest. 🤷‍♀️",
            "TBH and put it simple... everything in english sounds cool, really cool I envy it... it sounds a lot better than my own language",
            "I like american southern accent.\n\nOtherwise the american accent is the default english for me.",
            "Depends where. Not a fan of a NY accent, but I love Southern / Mid accents a hell of a lot",
            "I’ve always wanted an American accent, I’m pretty sure it would make it easier for people to understand me as well, I’ve tried changing my accent but I can’t without my speech getting all slurred\n\nI find that quite weird actually, I can do Italian, Spanish, Russian, Norwegian, Scottish, Irish, welsh, Ugandan etc but not American? What the hell?",
            "On tv it sounds normal because I'm so used to American tv. In real life it can sound cool, sexy, or stupid, depending on the person speaking",
            "Easier to pronounce, but doesn't sound fancy or anything",
            "I’m British but I tend to watch a lot of American TV and it just sounds normal to me now. However, when I am abroad in Europe and I hear that drawly/whiny American accent it just makes me full body cringe I have no idea why, although it might be more what’s being said than the accent.",
            "I think of it as a default sort of accent? As in, how you would sound if you had no accent",
            "From somebody that learned American English,I didn't find it weird until I started watching this one Aussie YouTuber a lot and some British people.",
            "boring (except southern accents which are awesome)",
            "[deleted]",
            "English person here: I went through a good chunk of my life not realising the Boston accent was a real thing. Whenever I heard it in songs or on TV I just assumed it was some American badly trying to mimic a posh English accent.",
            "Why is everyone in this thread speaking in an American accent?"
        ]
    }
]