[
    {
        "post_id": "aejawo",
        "author": "Nicolas_Mistwalker",
        "title": "What is the logic behind rewarding kids for perfect attendance? Illness, family emergencies, accidents etc. do happen and there is no way to avoid them",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/aejawo/what_is_the_logic_behind_rewarding_kids_for/",
        "score": 23000,
        "num_comments": 1407,
        "created_utc": 1547128295.0,
        "selftext": "I've always seen kids get high/valuable rewards for perfect attendance (even got one in another school since my teachers were only paid as long as I was present).\n\nI can't even unpack how wrong the concept is. It's showing how just coming is better than hard work. It promotes getting others sick. It degrades the importance of mental health and work-life balance.\n\nIs there any legit reason these awards are so popular?",
        "permalink": "/r/NoStupidQuestions/comments/aejawo/what_is_the_logic_behind_rewarding_kids_for/",
        "comments": [
            "Perfect attendance in my high school didn’t mean no absences, just no non excused absences ",
            "I just wanted to comment on this with a story that I always remember.  The day before I was to start 5th grade my closest grandmother had passed away.  Needless to say I missed the first two days of school and that was it.  At the end of the school year they did the rewarding ceremony for those who never missed a day and it was a trip to the movies.  All of my friends were going as they had not missed a day, but I already knew I wasn't because of my first 2 days of absence.  This crushed 5th grade me.  The teachers were giving out the permission slips to have our parents sign so they knew their children were going to the movies.  I will never forget this but my teacher stopped at my desk and gave me one.  Being the good two shoes I was I told her I had missed two days.  Her response is still with me to this day (I am a college graduate now): \"Your school year didn't start until you came in the third day, so you technically have not missed a day of school.\".  Her kindness to me has never been forgotten and it made my day.  Sorry for the random story.",
            "[deleted]",
            "I'm not American, but attendance is one way to assess a child's health.   At-risk kids are often absent from school for reasons beyond their control.   I'm Canadian, and I've never seen a perfect attendance award. An abnormal amount of missed days often triggers an investigation by the school or Children's Aid.  When my daughter had cancer in grade 4 (even though the school knew about it) we had a visit with the school board because of all of her absences. \n\nAs far as I know, attendance awards are mostly due to parenting, not the kids.  It's an appalling way to judge child health or learning.  But I think that schools in the U.S. often rely on funding depending on attendance, so it is what it is. \n\n",
            "My wife is a teacher and here's what she has to say...\n\nMany students come from families where education isn't seen as very important.  Many parents \"forget\" to drop their kids off, don't come to conferences, etc. Having a reward for good attendance is a way to help those children encourage their parents to bring them to school.  It's not seen as a\"come to school when you're sick\" type of situation but rather a \"see how important education is - you should make your best effort to come\"",
            "[Chronic absence can have a significant negative effect on student performance](http://absencesaddup.org/importance-of-school-attendance/). Obviously you want to avoid that because if you start out at a disadvantage early on it can have consequences throughout your life. \n\nHowever, its well known that trying to present nuanced or subtle distinctions is harder than presenting broad absolutes when it comes to messaging. If you present a moderated version of a message, you need to make sure that your recipient acknowledges and agrees with your message AND that they make the appropriare judgement on the degree to which they apply that moderation.\n\nSo its much easier to tell kids \"come to school everyday\" than it is to say \"come to school when you can, but if you cant thats ok, but not TOO ok, don't do it more than 2 times a month plus or minus 1 or two absences. Also there are different reasons you might miss school and some are more valid than others. Being sick is ok, having anxiety might be ok if its servere but you need to balance that against the cost of missing your education. Doctors appointments or other conflicting tasks could be fine, but its much better to schedule these things outside of school hours when possible. In general your parents can probably make that call for you and you should trust their judgement, but feel free to give ^your ^^feedback ^^^to ^^^^them... \"\n\nIts just a matter of trying to keep things as simple as possible to the message will stick. If you have a good reason to miss class, your parent or guardian should be able to make that distinction and advise you.",
            "I remember they gave this girl in my elementary school and award for never missing a day from kindergarten to 5th grade. She had a 'tiger mom' who would send her to school no matter what. In 1st grade she gave pink eye to most of my class and the teacher.",
            "I got to skip finals if I had perfect attendance.  Yep, I probably gave several kids the flu. ",
            "At my school as long as you didn’t have  “unexcused absences” you still got perfect attendance. I remember being confused getting a perfect attendance certificate after missing a week of school because I was sick.",
            "[removed]",
            "I don’t know what the logic is but I’ve seen two long-term perfect attendances before with varying rewards. \n\nThe first was a graduating upper class man who hadn’t missed a day all 3 years of high school with a younger brother (a grade older than me) who was on track to do the same. Both ended up in the paper together when younger brother graduated. \n\nThen there was a girl with MY graduating class that hadn’t missed a day since like, 7th grade or some wildly outrageous number. She gave the most god-awful speech at the graduation ceremony. She started sobbing because due to her perfect attendance she missed the funeral/final days of her uncle or something equally important. \n\nI’ve never understood perfect attendance, and preferred just to skip class/mandatory school wide lectures and go get a snow cone.",
            "My sophomore year I missed A LOT of school due to kidney disease. I honestly didn't give a shit that I wouldn't get a \"perfect attendance\" award. And I've never seen anyone cry bc they didn't get it. \n\nI see what you mean, but I really don't think it's that big of a deal.\n\nHow are high school superlatives supposed to make students feel? I got \"teacher's worst nightmare\", a blatant insult when I had a very decent GPA and most of my teachers loved me, except one. The one that was head of this superlative bullshit. But no one bats an eye? ",
            "I’ve always hated this. As a kid who has several chronic illnesses, I go to the hospital about every week. So many of the field trips I missed and parties I was left out of as a kid were due to the rule that you couldn’t miss X number of days. It was a bunch of bullshit, and made me feel really bad for missing, even though it was necessary because of my health. So yeah, fuck attendance requirements. People have lives outside of school and work. ",
            "The most I've ever seen given is a certificate. ",
            "At my high school, if you missed one class period then came to school, you'd be marked as attending a half day. I had braces from the end of my sophomore year all the way through senior year and the office wasn't open during non-school hours, so I'd miss a class or two and, due to this half day policy, I would chill til lunch. If I'm going to be marked as attending a half day when I only missed an hour, I'll just wait to come in and actually take a half day. ",
            "[deleted]",
            "It is ridiculous. Unfortunately the same will happen when you join the workforce. Bosses praising employees for coming in to work sick (making other people sick) rather than praising people for staying home",
            "It's worth noting that, at least in my district, each one of the absences you described can be marked as exempt to not effect perfect attendance. You do need a doctor's note or some sort of proof of the reason for the absence, though.\n\nSource: Database administrator at a school.",
            "Yeah I remember in middle school if you were late four times you got a detention which is retarded to two reasons.\n\n1) I'm in 6th grade, I'm not the one responsible for getting my ass to school on time.\n\n2) after the third time my mom would just keep me home if we were running behind. We lived far from school and I had a baby brother so being five minutes  late is going to happen. ",
            "A friend of mine took their kid to a theme park when the rest of the school went because of poor attendance, purely as a result of illness. No truancy etc. I'd do the same!\n",
            "Source: am ex teacher, managing school attendance is now my job\n\nIn the UK we're required by law to report persistently absent children to the local authority. We can then be questioned about these PA's and asked what support we're putting in place for the family to ensure the parents are fulfilling their legal obligation to get the kids to school. We have punitive ways of doing this (court/fine/prison) and nice ways of doing it - which is what you're seeing above.\n\nThe high value reward on offer is to wave under the nose of the persistently absent kids/parents. If this works as an incentive to reduce PA figures, the school can report a lower PA figure to the local authority which makes them look better in league tables etc. Where the school is an Academy, they'll have other questions to answer to the Academy sponsor as well. If the sponsors are assholes, this can create a climate of fear - leading to ridiculous incentives to get kids into school.\n\nAs far as a perfect kid missing out on one single day due to a family emergency etc, this is just a classic case of 'shit happens'. As I've said above, these incentives are designed to target persistently absent children, not those that take one day a year out due to emergencies.\n\nEDIT:\n\nI'm seeing a lot of comments on 'schools lose money if the kid doesn't show up' - this is not true in the UK at least. Some children are allocated extra cash per child if they meet certain deprivation criteria. If said child doesn't turn up for one day, the school still gets the money as it's allocated annually.",
            "Although I don’t agree with having a sick child go in, I do think strong attendance should be encouraged.  I had horrible attendance as a kid, my mom let me stay home often and I definitely went over the maximum of days multiple times.  I had inconsistent grades and grew up with a shit sense of duty - then I dropped out of college after withdrawing for poor attendance (I got my shit together in my late 20s).  \n\nI’ve worked in a school, and sporadic attendance really affects kids, too.  The kids that miss one or two days a month have to catch up with the class, and it’s hard on them.  I’ve seen one missed day throw off the rest of the entire week... \n\nMy son is in kindergarten, and he hasn’t yet been late a single morning or missed a single day (he also hasn’t been sick).  If we make the whole year, I do think he should be rewarded to encourage him to keep getting up and dressed, so that he knows that going to school is expected and important.  Not ‘call out whenever.’  His father wanted to keep him home two days before winter break for the convenience, and I said no because school is important.\n\nIf he gets genuinely sick with a fever or something, that’s when I will absolutely keep him home.  But I’m saving those days for when/if we need them.\n\nI kind of want a freaking reward.  Getting that kid up and dressed every morning is fucking hard, hahaha\n",
            "I’m sure this isn’t uncommon, but at my job, being just one second late clocking in counts against you just as much as calling in sick would.  It has been a common complaint around the office because we have some many people who work out of town and we live in a place where it snows pretty often in the winter.  In our last meeting I made a comment that HR did not like very much, I said, “if being one second late is equivalent to calling off sick for a day, then why should I even bother coming in at all if I am already late when I pull into the parking lot?” I thought it was a good point, but HR grumbled something about integrity and doing the right thing. ",
            "\"I haven't missed a day of work in twenty years.\"\n\nI step back quickly as to avoid the tree that, one day, karma is going to smash Mr. Perfectlife with. ",
            "Congrats on coming to school sick! As a parent I find this super annoying ",
            "Because, “wow you didn’t have any issues preventing you from coming to school!”",
            "It's kind of a \"broken-windows\" phenomenon thing. If a school gives even the slightest hint that it does not care about student attendance, and does nothing to monitor it or intervene when students are not attending school, then it creates a whole raft of problems for students, parents and schools later on down the line. In short, if students suspect that schools do not care about attendance, then attendance across the board will decline.\n\n>Illnesses, family emergencies, accidents etc. do happen\n\nSchools know this and have different codes used for reporting attendance. Whilst not a universal truth, most schools discount absenteeism on the basis of genuine emergencies. Some schools also award attendance certificates if you are present in school over a certain percentage of time, e.g. 95%.\n\nNonetheless, being in school all day every day is an achievement and it should be recognised as such. (In much he same way that the human race recognises a myriad of other such arbitrary achievements.",
            "I think its to discourage students from skipping school",
            "It’s not saying other people are bad for missing a day, it’s to congratulate someone for having that perfect attendance.\n\nCal Ripken played over 2,600 baseball games in a row. Recognizing that as an accomplishment doesn’t bring shame to anyone else. \n\nIf someone shows up every day, what’s so bad about giving them the thumbs up?",
            "OP makes a lot of good points and on balance I agree. But I honestly do believe that 80% of the secret to success is to just show up, on time. Dependable people are always offered opportunities. So that’s not a bad lesson for kids to learn. ",
            "Most schools get a per capita per day funding for student butts being in seats.  The more seat time they can squeeze from a student, the better.\n\nArguably, it also conditions students for the realities of the American workforce, where taking time off is frowned upon, and getting two weeks of paid time off a year is considered to be a great job.  (Conversely, in most European countries, having any less than a full month of paid vacation time a year is considered barbaric and downright slave labor.)",
            "I don’t see how it’s teaching them that showing up is more important than hard work unless this school is only giving out attendance awards but no academic ones. Showing up imo is possibly the most important thing in life, and we’re always saying i wish they taught me stuff that would actually help me in real life. Well here ya go. i’d bet a kid who was taught to strive to be the one that shows up more than anyone is gonna have way more success than otherwise. Lastly i remember my schools always excused sick days up to a certain number, and excused stuff like family vacations as long as they talked to the parents. Even if not i don’t think it’s damaging at all to the childrens’ psyche haha",
            "I believe these rewards have merit (see what I did there?), but they should only be based on unexplained absences. Kids who are genuinely sick, and whose parents have notified the school shouldn't be disadvantaged. Every day counts, and kids who are putting in the effort to be at school when others are wagging should be recognised. Our school gives them an attendance certificate, and acknowledges them in front of their cohort.\n\nEdit: Australian school. Funding is not tied to attendance. ",
            "My daughter was off school sick for best part  of three months with whooping cough. I got a red attendance letter off the school which I went ballistic about. Also her absence brought down the class attendance percentage level (they have prizes for the best class attnedance) and they buĺlied her for being off sick as it brought the figures down. The head teacher was a complete arsehole.",
            "I agree. It also encourages kids to attend school (or work, later on) when they’re sick which is silly.\n\n",
            "[deleted]",
            "There is a strong correlation between attendance and academic performance. While part of it has to do with state funding, it also has to do with what is best for the kids. Usually a dedicated student will have great attendance even if things do come up in their lives because they prioritize school. Perfect attendance just gives something for the students to strive for.",
            "The logic is surely that it instils perfect attendance for higher education / employment, which is a valuable asset and one that is valued highly",
            "[removed]",
            "I always tried so hard to get that award in elementary school. Never got sick, ever. But somehow I never got it because of one reason or another. It made me sad and angry because people I hated always got it. Made up for it by always getting the straight A award though. But still. It's demoralizing to try so hard and never get it",
            "What reward are you talking about? In every school I have attended, perfect attendance rewards have always just been a pin/badge you can put on clothing or a bag and they might write which students had perfect attendance in the school newspaper or yearbook. I don't think most kids care about that reward at all, so unless at OP's school they got money or a fancy prize, I don't really understand the question, because where I come from, nobody is coming to school sick for that reward.",
            "I got a free 1 time cinema ticket for perfect attendance, no major rewards.",
            "In the UK this is due to Ofsted (education regulating body), let by the government’s targets. It is one of the ridiculous targets they measure.\n\nIf you fall short of enough of these targets your school gets judged as inadequate and senior management, governors and other staff are all at risk of losing their jobs.",
            "Teaching is very difficult if you have a lot of students absent on a regular basis. Doesn't take long for students in the class to get way behind on the curriculum and not many students are motivated enough to catch up on their own so it just adds more work for the teacher. Plus by the time they get to high school a lot of students will stop coming if it's not really expected. ",
            "A friend of mine’s dad retired a few weeks ago in December, after 47 years service, did not have a single sick day in all that time. Made the local papers and everything.\n\nI have probably had 20 days in 10 years, 9 days of which I was in hospital, so that must of been one hell of a difficult accomplishment knowing that accidents happen.",
            "Ok but who actually cares about perfect attendance, as long as you get good grades you'll be fine. Also its not like the college you want is gonna look at your attendance and be like well he has a 4.0 gpa but he missed a week of school due to sickness and injury thats the deal breaker. Lol\n\n",
            "Sort of related; NPR recently did a [story](https://www.npr.org/2018/11/13/667285010/how-can-schools-better-persuade-students-to-show-up-for-class) on this recently that shows students who received the award went on to have more absences than their peers who didn't. ",
            "We decided early on that family time, especially family that lives thousands of miles away, matters more than perfect attendance. \n\nThis year, my kid has visited 35 states, mostly in the summer and school breaks but two weeks of travel did take place during the school year. That is much more valuable to me than perfect attendance. His most recent report card was straight A’s so I guess we are doing okay. ",
            "NPR reported on this last year. IIRC A study showed that rewarding perfect attendance had a negative effect on attendance for the next year. Kids who miss a day of school are more likely to miss more because they won’t be in the running for the award. I’ll try and find the study if you want ",
            "And it rewards sick children to still come to school, which has the risk of transferring the illness to other children.",
            "My goal for my final semester of undergrad was perfect attendance.\nFirst day of class was today at 8. I woke up at 10:30.",
            "American in the South here. We found out about my 8th grade year all my sudden and chronic illnesses stemmed from agoraphobia and bipolar. My stomach ulcer, sudden seizures from literally nothing, throwing up for days and weeks. All because of something I didn't know I had. We'd bring tons and tons of doctors notes but they do not care. School board tried to go after my parents but my parents lawyered up and won (this wasn't the first time in this district either). As a result any of my teachers would give me packets of packets of work with due dates at the end of the week since \"they never knew if I'd show up\" when after 8th grade my attendance was like 99%. Eventually my psychologist came to speak to the school board (literally told them to F themselves, this is just a kid)  and put a stop to the packets. Teachers would still try to pile on work. Because of this I quit taking school seriously. I dropped out of every AP class and took this college program only because you could skip and no one cared. I still passed every class with flying colors",
            "I attended an \"awards\" ceremony that included awards for perfect attendance (my sons award was for academic achievement).  The principal brought up a girl on stage for her perfect attendance award and while exiting the stage she vomited everywhere.\n\n&#x200B;\n\nMy opinion:  Schools are hurting children by valuing attendance over health, and putting all the other children at risk for communicable illness.  All for hoping to get a few more dollars.",
            "My understanding is that schools were designed to produce factory workers. The last time school was heavily reformed was before/during the industrial revolution. The world needed factory workers so classrooms modeled factory floors. Heads down, silent, always present, short, structured breaks, raising your hand to speak or use the restroom, etc. I saw a video about this concept years ago but can't seem to find it. ",
            "the school system was designed very similarly with factories, thats why kids move in batches instead of based on their aptitude (remedial and advanced classes aside, children are expected to be more or less homogeneous by age), as with factories, showing up is half the job.\n\n\n",
            "Don’t know where else to say it. But I had a friend in high school who never missed a day of high school. Perfect attendance all 4 years. \n\nHe ended up getting some sort of scholarship, a check, and a huge prize basket because of it. They basically created the reward for him. He never asked for it or anything but it happened when his guidance counselor noticed it. \n\nWas a real good dude. Very deserving and just wild that he never missed a day. ",
            "I really don’t understand this either, but the punishments for missing school are also out of line in my opinion. In the 6th grade I got a horrible case of pneumonia and had to be hospitalized. I ended up missing 2 weeks of school total. My mom did all the appropriate stuff like calling the school, bringing in my doctors notes and records, and picking up my assignments for me to do during the times I was awake enough to work on them. When I returned, I turned in all of my late work and ended the school year on the A honor roll. That summer I got a court summons to appear in juvenile court for truancy. My state required you to  90% of the school year no matter what and my doctor’s notes didn’t matter. I went to court and my mom tried to speak on my behalf (I was only 11 at the time) and the judge would not allow her. I tried to tell the judge I still did all my school work, I brought in all my notes from teachers backing up on being a good student but none of it matter I was found guilty of truancy and sentenced to 40 hours of tutorials. For the following school year. It might not sound like much and honestly most of my teachers would good sports and would just let me sit there and read or do homework, but this was all around a waste of everyone’s time and the courts money and schools money and I still to this day (20 years later) fee uncomfortable that the judge was adamant that I defend myself as a 11 year old and the pneumonia that causes hospitalization is not a viable reason to miss school. It’s ridiculous.\n\nSorry for the long post lol",
            "It starts with good intentions, since high attendance means the kids are learning more and hopefully doing better.  But then (at least in America) it gets entangled with the Protestant Work Ethic and toxic beliefs about having to always be Working. It's easy to reward based on attendance, and say that people aren't being \\*punished\\* per se for not having perfect attendance. ",
            "I have crippling anxiety about getting places on time / attendance due to the insanity that is American public school attendance policies. I was shamed, blamed, guilted, yelled at, etc almost every day K-12 and much of the time it was completely out of my control as to why I was late. Fuck the system.",
            "Nothing like sending sick kids to school to spread their damn illness. When I hear perfect attendance, I wonder how many other kids they knocked out of the chance for it. ",
            "I'm a teacher. Kids in seats = funding. When kids are absent, the district doesn't get paid for that child that day, despite all the services for that child in place. So, we try to make it seem like being there every day and never missing anything is critical...but it's about getting paid. \n\nNo one rewards workers for never missing a day - especially not teachers. \n\nI have battling my principal to stop publicly acknowledging \"perfect attendance\". Little kids like my students have no control over their attendance. Kids with special needs like my own daughter have to go to appointments when the doctor is available, not around a school schedule. And for goodness sake, even kids deserve to play hooky, go on vacation during the off-season, go to daytime baseball games or - heaven forbid - feel a little sick.\n\nPerfect attendance is a fraud to make money that shames small children for their illnesses and parental choices.",
            "Chronic absenteeism can lead to a lower chance of graduation. Attendance is important especially in Elementary school where you learn routines and other valuable skills. It's important to 'excuse' students from school to negate a high absent rate. ",
            "I’m currently working in a school where if there is less than a 95% attendance rate throughout the school year it will lose its accreditation.  They incentivize attendance because without it the school as a whole gets punished. ",
            "It makes no sense. My 16 year old sister had pink eye last year, but insisted on going to school. That shit is contagious! But it was the last week of the semester, and she had not missed a single day. She would get some kind of reward if she maintained “perfect attendance”. 🤷🏻‍♀️🤦🏻‍♀️",
            "Anything deemed “perfect” is hard to attain. It takes dedication and luck in the case of attendance.\nLet’s call it what it is-showing up. Showing up perfectly says something about you, and indirectly, the parents. It’s not something to be ashamed of to be better than average, quite the opposite!\nNow let’s look at real life. Showing up at your job every day may or may not earn you an award, but it will damn sure reward you with keeping said job. Why would you NOT want your child to learn a positive life habit?\nWe are way too comfortable with mediocrity. Teach your children.",
            "For that matter, what is the point in jailing parents who keep their kids home for more than a mere 10 days.",
            "Can't talk for the logic part, but my friend's grandmother died. She stayed absent that ONE day throughout highschool. She still received a perfect attendance thing.\n\nI don't think they count valid reasons (death in the family, sick WITH a doctor's note etc) against you.",
            "America, where quantity always trumps quality.",
            "Public schools here get money on a per student per day rate. If we missed school then it directly cost the district money.",
            "Yeah, we live in a world that raises workers. A workers who shows up produces money in some way. A worker who stayed at home sick is not producing money. \n\nAnd how bad can it be if the workers still come in even when theyre sick? So who cares?\n\n(Not how I want to see the world. But thats how its percieved.)",
            "Who cares guy?\nSo the kids who never missed a day don't deserve something for being on time, everytime? \nGtfoh",
            "At my job we give awards for perfect attendance to our students at the end of the season. However, we also award “outstanding attendance” (allows for misses still up to a certain number based on classes taken) and “most improved” awards, in addition to other unrelated awards of a higher caliber. The attendance awards mean the least here.\n\nThe concept is most certainly not to push attendance even when sick or during emergencies. It is to encourage “regular” attendance and participation. Our sport costs a pretty penny, and we have had instances where a student won’t advance a level after a season, the parent demands to know why, and the answer is almost always the same- “your child missed x amount of classes. This equals x months of our season. Missing that much, they will not improve as much as the curriculum allows them to, and we cannot reward poor attendance with advancement.” \n\nObviously extenuating circumstances arise and we take that sort of thing into consideration as well. But for people who just can’t bother to bring their kid on a regular basis, striving for a simple certificate awarded at the end of year performance can do a lot of good when encouraging regular class attendance. \n\nI can see where they are useless in a normal setting, but we make them useful to up our regular attendance, and it works. ",
            "I imagine that it's to encourage kids to go to school and to not bunk off if they can't be bothered. In my school it was in brackets, so if you had 95% attended it was basically 100%. I guess that took into account sick days and that.",
            "I went to a private school which did good attendance reward too. There were points allowed per month, three tardies were equal an absence, etc. In short, it was a strict but reasonable and fair system.\n\n90%+ of the school got this. Now, being a paid school got rid of the worst case \"I ain't going to no school today!\" types, so caring parents was a given.\n\nHowever, it did make folks go faster in the halls between classes, and the chronically late kids stepped it up a bit.\n\nI think we got a school pizza party for it as I remember.\n\nTL;DR: A reasonable level of attendance does make a difference, since realistic goals got everybody on board.",
            "Perfect attendance through highschool, never rewarded. However, people are rewarded because they were there every day. They didn’t ever skip class. It’s not a big deal but why shouldn’t you reward dedicated students? ",
            "Shit I wish I went somewhere that gave out awards. I've seen kids get a small scholarship or a news story, but I got nothing",
            "I received perfect attendance through my entire K-12 career. Having 3 other siblings, I was only one with perfect attendance and my family would have to bend backwards to accommodate getting me to school every single day. \n\nWhat was my award? A plaque they gave me congratulating me on 13 years of perfect attendance. No scholarship, no monetary incentives, nothing... Thanks? \n \nStill bothers me to this day.",
            "This is totally anecdotal, BUT my schools growing up were really strict on attendance, my bf's schools were the opposite. I never ditched class, nobody at my school really did other than the slackers and druggies, it just had such huge repercussions that it wasn't worth it. My SO on the other hand, barely attended high school and never got any type of penalty for constantly ditching. He now really regrets it and wishes his school had been less lenient towards those absences. If his school had been like mine, his whole life could have gone totally different. Some kids don't have a home life that motivates them to attend school, so is it really such a bad thing for schools to provide that motivation?",
            "So the kids who aren’t smart enough to get an academic award still have something to try for.",
            "Give the intiall purpose of school it is to train the need for perfect attendance at a factory. On top of that school is mostly a daycare for parents that work through the day. So if you miss school that defeats most of the purpose of school. But although you say there is no way to avoid them I have known a number of folks that didn't miss a day.\n\nOf course as others have said if you don't show up you can't do very well. But attrition isn't exactly the best way to fight a war or learn. Demanding more time spent in school after a certain point isn't affective.",
            "Illness, family emergencies, accidents, etc are usually excused absences and don't count against the student. (In all the school systems I've been exposed to through my/my wife/my kids schools, anyway)",
            "Brainwashing basically",
            "Maybe it trains you for workplaces that expect you to come in even if you have the flu, because missing a few days of work is somehow a bigger loss to productivity than getting everyone sick.",
            "My perspective in growing up in the rural Midwest is this helps program is into productive workers who don't call in sick to their jobs as adults. Just opinion.",
            "My parents make everything a fucking calamity if I wanna miss a day of school so I usually just dont do it unless my mom suggests it ",
            "My friend had perfect attendance in school from kindergarten to his senior year of high school, he never missed a single day. As a surprise at graduation they were gonna honor him with an award, gifts and a celebration. He didnt show up to graduation.",
            "They're trying to engrain \"you gotta show up\" with positive reinforcement by giving rewards to those with perfect attendance. When they're adults, there's no one that's going to force them to attend college classes or go to their jobs. Getting in the habit of attendance is far more pleasant as a child with award incentive than as an adult dealing with the negative consequences of failing a $1000 class or losing their job. ",
            "Lots of fun stories here but it basically boils down to attendance has a direct correlation with academic success.",
            "My own 4 years perfect attendance in High School is an example of how dumb these rules/awards are. Once I started driving, I was late to school at least 3 times a week and a day or two of the week my teacher would just let me in anyway. But you know what I always showed up no matter how late (if I remember correctly the rule was your not absent as long as you come to school before second period) I didn't even know I had perfect attendance until the end of sophomore year when they announced me and one other kid had it. \n\nSo I say this fun fact to people now because it's so non sensical that one of the most habitually late kids had perfect attendance. \n\nJust to play devils advocate a little bit though, I am proud that I never even thought about skipping school or showing up halfway through the day when I was late. I wanted to be on time I'm just bad at it. ",
            "Devils advocate here, but maybe it also promotes preventative health measures?\n\nThat’s all I’ve got.  ",
            "Money, don't listen to people saying \"oh its for the kids motivation and bla bla bla\" plain and simple public schools earn money from the school district for every kid that shows up, no kids showing up means less money which means smaller paychecks. ",
            "I also don’t understand how people even get perfect attendance. I graduated in May and they recognized a girl who had never missed a day of school, and that is just absurd",
            "When I moved to Texas for my senior year, my high school would OPT YOU OUT OF FINALS if you had perfect attendance. ",
            "Attendance at my daughters school is for being present at the start of the day.  The school gets funding for the day if the child is in class for roll-call.  So, it doesn't matter if the child leaves early.  So when she has to miss school I will drop her off, and then pick her up after an hour, and her records don't show anything about leaving early.",
            "This attacks me on a personal level. I never missed a day of school so far. Even if I was morbidly sick my parents would drop me at school with some cough drops. I feel bad for the other students who got sick off of me. ",
            "Schools get federal funding based on how many students are at school every day. By handing out these awards it encourages children to come to school regardless of their personal health or other situations so that they can secure more funding. \n\nThat's really all there is to it. These sorts of things are usually about money and the self-serving interests of school boards and less about sending good messages to children. ",
            "It promotes school attendance. It’s a great idea. It’s not perfect but it has a valid reason. Nothing is perfect anyway and you do the best you can.",
            "I'm a product of this.  And now, as an adult, I go to work even when I'm sick, because I feel bad missing work.  ",
            "Always thought that award was fuckin dumb. It made kids come to school with couching and sneezing their brains out, getting everyone else around them sicker, just to get a damn certificate at the end of the year!(my schools never gave prizes) ",
            "this was the absolute worst when i was a kid. my mother had to pull me out of school so much because of her and my doctor's appointments (like one a week, it was crazy). each week they brought a bucket of candy for the kids with perfect attendance to eat out of. i remember crying a lot because it's not my fault my mother lives at doctor's offices 2 hours away... ",
            "Attendance is highly correlated with performance, and the theory is that students who might skip on a whim would be less likely to do so if there’s some sort of reward. \n\nThe problem I’ve always had is it’s all or nothing. I knew a poorer kid that was trying to get it one year because they got an ice cream party. He made it from August until March and then missed a day. He then proceeded to miss a day every two to three weeks after that because he couldn’t get the prize anymore. ",
            "It's also a societal thing, I think. If you're trained young that you can never miss a day, even when sick, then as an adult the workforce capitalizes on that and milks as much work out of you as possible.",
            "Wait, it it’s wrong to encourage a good work ethic?  No wonder businesses can’t get people to come to work every day. \n\nEdit:  I’m my area all they get is a fancy certificate and a pin. ",
            "I got perfect attendance it is very important in life to be there and shpw up",
            "As the Nerd that got all of the awards in elementary besides perfect attendance, I just assumed it was meant to make one of the dumber kids feel better about themselves.",
            "I was sick a lot as a kid and I knew every year I wasn't going to get a perfect attendance award and it never bothered me. Once I got into middle school though teachers began to give me a lot of trouble for missing. In the 6th grade I began to get chronic migraines and it took awhile for doctors to figure out what they were, what was causing then, etc. My school principal began follow me around the school and watch me in my classes and my the nurse would get angry and harass me when I would come into her office. Multiple teachers asked me why I couldn't come to school with a \"headache\" and told me I was a baby. I missed 3 months consecutively and I still maintained my grades and did my work at home, just on my own time. I was harassed relentlessly by adults until my mom threatened to sue the school. Then when I got into high school I had even more health issues and they threatened to take away my credits even though I maintained my grades and was passing all my classes. I had an endless supply of doctors notes and my mom spoke to the school on multiple occasions and it was never enough. I ended up dropping out my sophomore year and did home schooling. The public school system is horrendous.",
            "I think the point is just punctuality. Like you wouldn’t generally want to be late to work or important events. But they shouldn’t be so hard on students in certain circumstances ",
            "The only reason they exist is due to the corruption and degradation of the American education system. The schools get money for every child every day from the federal and state gov. So every day a child is not there they essentially lose money. Therefore they give children an incentive to come to school everyday, a ridiculous award. ",
            "my old professor said to my class “there isnt anything more important that being here in class” like bitch i can name several.",
            "They gave out pins for bucket hats in elementary school. Brother and I have kidney disease, so we never had perfect attendance. It did kind of suck to see everyone have so many more pins at the end of 5th grade (4 pins a year k-5 = 24), but it wasn't crushing. I cant imagine keeping kids from field trips or something big though. That's awful. \n\nBonus: Since we never had perfect attendance, my mom would take us out of school early to go see Harry Potter. The theater was always nearly empty because everyone was still in school. All 13 movies. ",
            "I know it’s to discourage skipping classes, but all it does it encourage kids to come to school sick and contaminate the rest of the students. My school did away with these rewards and as someone with consistent perfect attendance it was disappointing at first, but the more I think about it the more sense it makes. ",
            "I teach at a high school, and they used to give these awards. A couple years ago, they had one senior who had gotten the award every year, and they asked him if he wanted to say anything. His message \"Wow, I didn't realize I had done that. I probably should have gone on a vacation or mission or something. There are things that are more interesting than school. Don't be like me.\"\n\nI love that kid. They don't make such a big deal about it anymore...",
            "To cut down on truancy. ",
            "Most States have mandates that create situations in which public school systems are considered responsible for their students attendence: States will often base funding off of student attendence, test scores and number of children with learning disabilities or impoverishment. The schools have an interest in keeping all of those things within an acceptable range, so they do two things: they give out awards for good attendence and they punish bad attendence. \n\nFor example, my children's school will send DFCS to your house if your child misses 5 unexcused days or 9 days total, excused or not. You just have to pray your kid doesn't get mono. I've heard horror stories of parents losing their kids to DFCS for their children missing too many school days...even when the reason was medically necessary (but I don't know anyone personally, so it's probably some Facebook bullshit). \n\nAnywho. That's why. \n\nOh, and studies show a correlation between attendence and test scores...but the studies don't often consider other environmental factors. ",
            "So you learn to be a good sheep.  ",
            "Perfect attendance was a load of horse shit. I showed up with what was probably the flu and some how they didn't get me the damn perfect attendance award, call me salty. It's to train kids into thinking they need to show up to work sick too, thanks food industry!",
            "I was a good student, but never got any of these awards because I have epilepsy, and would miss 20 or more days in a school year. It always made me kind of mad.",
            "I remember maybe once in 5th grade that they told all of us in the grade that if we got perfect attendance we were allowed to go on a field trip, you didn't get perfect attendance, you didn't go, whether it was excused or not. The teacher explained how the school gets paid for good attendance, never made sense to me. \"Don't come to school if you're sick but if you're sick you aren't allowed to do anything fun!!\"",
            "As a teacher, sometimes attendance is all a kid has.  They get decent grades, but not great. They don’t act out, but they don’t overly participate. Sometimes the only reason they come to school is for a hot meal. These are the kids that COULD sleep in and skip cause their parents don’t give two shits. It’s not much, but it’s something to them. \n\nI’m also an attendance mentor. My job isn’t to make kids come 100% but to have kids take ownership of their own education. Attendance goes far beyond “showing up.”",
            "My opinion? I was a perfect attendance child from k-12. It sets you up for the importance of career and being dependent. I have advanced significantly through my company in 7 years and a big part of that is reliably being to work!",
            "Ive always wondered the same thing with my job. Im one of those people who is late by a few minutes pretty often but I work hard and steady. Those people who make it a point to be on time every day are the same people (at my job) who hang out for an hour before even thinking about working and periodically start conversations to waste time. Yet there is no punishment for that other than \"get back to work\" while my yearly reviews suffer for a couple of minutes a week. Makes no sense. \n\nIn my head... Be on time but fuck around for hours on end = good employee\n\nBe 3 minutes late once a week but work the entire shift = bad employee. ",
            "Perfect attendance pisses me off a bit. I had perfect attendance from the first grade up until one day in 8th grade where I left *11 minutes* too early at the end of the day. They pulled up video footage and everything of me walking out of the school and that is the kind of petty shit I hate, especially since I was in to the actual class for 3/4 of the period.",
            "It's funny...when I went to high school, a parent couldn't call you in \"late\". So if you were late, you just had your parent call you in \"sick\" and no problem, day off of school, perfect excuse, and no detention because you were \"late to school\".",
            "This is one I know a lot about. Several school policies are based on how to address the lowest academic achievement.  Combine that focus with data showing kids who are lower achieving are often absent from school and you have the \"Perfect attendance\" award. Of course, it really  can't address the reason many children are habitually  absent....family. Meaning if you don't have an adult to get you up, ready and delivered to school you (As a first grader) can't get there on time or even at all. This doesn't end the older the student gets. \nIt's similar to the data showing homes with more books had higher academic achievement. Many saw the solution as putting books into the hands of \"at risk\" kids. There is no benefit to having more books if no one in your life is willing to read to you, or values books or reading. \n",
            "My school didn’t count it if you had an excused absence. So as long as your parents called the school to tell them why you were missing you kept your attendance streak intact.",
            "My high school did this.  I was new there for senior year so I was unaware.  If you had less than 3 absences you got to skip 3 finals of your choosing if you were happy with your grade.  Many teachers would even allow you to use the pass and take the test anyway but only count it if it improved your grade.  Normally they only allowed this for people who had zero absences but the swine flu happened that year and they decided 3 was a good amount.  \n\nI missed a week with the swine flu, I also missed a day for a funeral (I even had a dr.s note which was rare for me because we weren’t well off and only went to the doctor if we were super sick).  No exceptions were made  and I had to take all my tests.  I was one of three people in my AP Lit class.  It didn’t really matter to me anyway because if I had to be in one class I had to be in them all because I couldn’t drive.\n\n*edit: a word",
            "If you ask them to have a perfect attendance, and then excuse absences (my school was quite lenient if you had a reason) you never have an issue of people skipping towards the end of the year because they had wiggle room and knew it wouldn't effect their grade.\n\nBasically set a goal with the knowledge some won't reach it, so that the entire student body doesn't just not show up for 2 days.",
            "We had an assembly at my sons school and when they were giving out this award, I yelled out “Nerds!”",
            "Money! Schools are rewarded for attendance",
            "It does foreshadow the experience most kids will have in the working world, wherein there is only the barest, most begrudging, allowance for time off.\n\nI quit working at Kinko's because they were going to write me up for using my accrued sick time too many times within a year. (was a good while ago)",
            "I am a teacher and we are rewarded at the end of the month for the “perfect” attendance which means as long as there is a note from the parent or guardian stating why they were absent that counts towards the perfect mark, but without a note we do not get perfect attendance. ",
            "Well in America public education was designed to make kids the perfect factory workers. Factory owners didn’t want you to take any days off, and hard work wasn’t really what was important, just doing the job and doing it everyday. ",
            "Think of schools as \"Laborer Factories\" and it makes more sense. ",
            "There are *rewards* for perfect attendance, not *punishments* for poor attendance. So already it is not a necessity, but for those who are able to be perfect, it is to their benefit.\n\nEncouraging good behavior begets more good behavior, so I don’t see the issue. It is not a necessity (hence ‘reward,’ not ‘requirement’). Instead of rewards for good attendance would you prefer punishments for bad attendance?\n\nOkay I’ll bite. What specific examples have you seen where perfect attendance is legitimately more important than hard work?",
            "not trying to talk like a nerd but...\n\nkids with perfect attendance have knowledge and get further rewarded with \"unneeded respect that makes everyone hate you\"",
            "My mum always forced me to go to school even when I was super sick, so I never had a day off. We would get loads of certificates for our attendance, and of course because I got 100% I got so many. It was the most fuckin annoying shit because the other kids in class would always comment and tease. I really don't see why it's a thing, just put it on our record or something",
            "Chronic absenteeism is a really big problem in US schools. When I ran for the local school board it was hands down the most important issue. \n\nFrankly, it doesn’t matter why your kid isn’t in school. If they aren’t there they are falling behind. Across the country, more than 8 million students are missing so many days of school that they are academically at risk. Chronic absence — missing 10 percent or more of school days due to absence for any reason—excused, unexcused absences and suspensions, can translate into third-graders unable to master reading, sixth-graders failing subjects and ninth-graders dropping out of high school. \n\n——————\n\nSome research on the topic:\n• Chang, Hedy and Romero, Mariajose, Present, Engaged and Accounted For: The Critical Importance of Addressing Chronic Absence in the Early Grades, National Center for Children in Poverty, New York, NY, September 2008. This report documents the consequences, prevalence, potential causes and possible solutions to children missing extended periods of school in grades K-3rd. Although students must be present and engaged to learn, thousands of this country’s youngest students are academically at-risk because of extended absences when they first embark upon their school careers. Nationally, an estimated one in 10 kindergarten and first-grade students are chronically absent. The report recommends that schools, communities and families monitor and promote attendance, as well as to identify and address barriers to good attendance.\n\n• Balfanz, Robert, Lisa Herzog and Douglas J. MacIver, Preventing Student Disengagement and Keeping Students on the Graduation Path in Urban Middle-Grades Schools: Early Identification and Effective Interventions, Educational Psychologist, 42(4), 223–235, 2007. This study examines the application of an early identification and intervention system for students in the middle grades to prevent student disengagement and increase graduation rates. The authors follow a cohort of students to demonstrate how indicators reflecting poor attendance, misbehavior and course failure in sixth grade can be used to identify 60% of the students who will not graduate from high school. The authors find that by combining effective whole- school reforms with attendance, behavioral, and extra-help interventions, graduation rates can be substantially increased.\n\n• Allensworth, E. M., and Easton, J. Q., What Matters for Staying On-track and Graduating in Chicago Public High Schools: A Close Look at Course Grades, Failures, and Attendance in the Freshman Year, University of Chicago, Consortium on Chicago School Research, Chicago, IL, 2007. In this study of the freshman year of high school, researchers found that attendance in this pivotal transition year was a key indicator of whether students would finish high school. The study also found attendance and studying more predictive of dropout than test scores or other student characteristics. In fact, 9th grade attendance was a better predictor of dropout than 8th grade test scores.\n\n• Ready, Douglas D., Socioeconomic Disadvantage, School Attendance, and Early Cognitive Development, The Differential Effects of School Exposure, Sociology of Education, October 2010. Despite the substantial body of research documenting strong relationships between social class and children’s cognitive abilities, researchers have generally neglected the extent to which school absenteeism exacerbates social class differences in academic development among young children. This study suggests that missing school in the early grades has a more powerful influence on literacy development for low-income students than it does for their more affluent peers. Put another way, school matters more to children from low-income families.\n\n• Balfanz, R., and Byrnes, V., The Importance of Being in School: A Report on A.bsenteeism in the Nation’s Public Schools. Johns Hopkins University Center for Social Organization of Schools, Baltimore, Md., 2012. This report analyzes data on chronic absenteeism at the state level to begin the process of mapping its extent and characteristics. Although currently only a handful of states collect data on chronic absenteeism, results from a sample of states suggest that an estimated 10-15% of students in the U.S. are chronically absent each year. The report also highlights some promising practices among cities, school districts and nonprofits to combat chronic absenteeism. The authors offer policy recommendations on tracking and reporting chronic absence data and evidence-based interventions.\n\n• Hart Buehler, M., and Topanga, J., and Chang, H., Why Being in School Matters: Chronic Absenteeism in Oregon Public Schools, Attendance Works, June 2012. Although many states collect data on attendance in their longitudinal student data bases, the majority fail to make effective use of this data\nto analyze how many and which students are chronically absent. Demonstrating the value of such an analysis, ECONorthwest used data from the state’s Department of Education to determine that 23 percent of students K-12 in Oregon were chronically absent in 2009-10, with low-income students atthe highest risk of missing significant amounts of school. Attendance problems in the early years predicted absenteeism in later grades, and students with the highest absenteeism typically scored lower on state assessments. This research also showed that poor attendance is a solvable problem by identifying schools that beat the odds by maintaining lower than expected chronic absence rates despite serving high risk populations.\n\n• Bruner, Charles, Anne Discher and Hedy Chang, Chronic Elementary Absenteeism: A Problem Hidden in Plain Sight, Child and Family Policy Center and Attendance Works, November 2011. This study confirms the premise that districts and schools may fail to detect high levels of chronic absence because the problem is easily masked by average daily attendance, one of the most commonly calculated attendance measures. While many educators assume a 95% ADA rate is an indicator of good attendance, the authors find that this is often not the case.",
            "According to my teacher, it's because perfect attendance is something that jobs really look for, and being able to put an award for it on your resume is a good thing.\n\nWeird that schools might actually be helpful to us later in life.",
            "I don't get it. Growing up our school didn't even award it but my sister never missed a single day of school in all K-12. She had food poisoning one time and still went to school. I had many friends who missed extended periods of school because of serious issues or problems and the school always gave them a hard time.   ",
            "The emphasis on perfect attendance for students by school districts is either because the school receives funding based on the amount students attending school or because attendance is one of the criteria the administration is evaluated by.\n\n I am a teacher and in my district teachers actually have a financial incentive to not take sick days. We get paid a stipend at the end of the year paying us the substitute rate for 3 days if we miss no days, 2 days pay if we miss one day, and 1 days pay if we miss 2 days. It's only about $100 for each day after taxes but every bit helps when you dont make much, get paid once a month, and dont get a paycheck in July. I haven't missed a day due to illness in 2 years because I need that $300 but I haven't really been too sick either. ",
            "Not sure but I won a car for perfect attendance in 9th grade. One of the craziest things that’s ever happened to me.",
            "I hate it, I feel like it's  just a product of a system which benefits from people putting the system ahead of their own well being. ",
            "In my primary school, if you didn't miss a single day of school for any reason - family members deaths, being sick, having an accident - then you got to go on a trip. One year I was in school every day and thought I was going to be able to go on trip. Then I injured myself directly under my eye and had to go to hospital. I didn't go on the trip."
        ]
    },
    {
        "post_id": "tcb95x",
        "author": "Cool3peep",
        "title": "How come foster parents have to go through training to adopt a child but there’s no such mandatory training for couples trying for their own kids?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/tcb95x/how_come_foster_parents_have_to_go_through/",
        "score": 22999,
        "num_comments": 1926,
        "created_utc": 1647070631.0,
        "selftext": "Like shouldn’t we need something like a license to have kids",
        "permalink": "/r/NoStupidQuestions/comments/tcb95x/how_come_foster_parents_have_to_go_through/",
        "comments": [
            "\"Unintended pregnancies are at an all-time low in the U.S. but still represent about 45 percent of all pregnancies. \" [brookings.edu](https://www.brookings.edu/research/preventing-unplanned-pregnancy-lessons-from-the-states/#:~:text=Our%20primary%20findings%20and%20conclusions,occurred%20earlier%20than%20they%20desired)",
            "I have wondered myself the same but although it might sound like a good idea at the e surface it gets really messy. \nSure, there are certain people who are unfit to raise a child but how are you going to control it?\nForce them to take courses? Have a “license”? \nAnd what if someone without a license has a child. Do you force an abortion?\nWho sets the standard for who is “qualified” to have a child? \n\nIt can easily go down a slippery dystopian slope.",
            "Because its impossible to regulate without dystopian levels of survelanxe and control",
            "because one is a government funded agency, with its own set of regulations and standards, the other is between two people making a decision",
            "Because a lot of foster children went through really hard times. And not everyone knows how to deal with that.",
            "Because it's easy for it go downhill quickly. What constitutes a qualified couple? How will it be regulated, and essentially how do we know this power won't be misused and minorities are restricted from having a baby. It's a bad idea all around",
            "How would you enforce that? Taking away kids from unlicensed parents would be such an extremely unpopular policy that you'd have riots in the street before it even began being enforced. And if it's just a punishment but they get to keep the kid, in what way can you meaningfully punish the parents that won't also hurt the kid, defeating the whole point of such a policy?",
            "I'd imagine there's a few issues here\n\n1. Kids in care can often have psychological and physical problems, especially if they've come from homes of drug abuse. \n\nBabies can be addicted to heroin, alcohol and a bunch of other drugs, Children could have been abused physically or mentally.\n\nYou need a person with a special kind of mentality to be able to deal with that and give them a caring, loving home without fucking them up more.\n\n2. When you have your own kid, you get 9 months to prepare usually, people read a bunch of books, go to a bunch of classes, touch base with a bunch of doctors, nurses and social workers the training happens naturally.\n\n3. Regulating birth is a bit dystopian, we're still animals, reproducing is still part of our core biology, as a society we should support children and parents more.",
            "Just think about it - how would we *stop* unqualified people from having biological children? There is no answer that wouldn't involve completely unacceptable mass-scale human rights violations.",
            "[deleted]",
            "That's how you legalize eugenics",
            "Enforcement isn't the issue, sheesh. How about seeing others as actualized humans with body autonomy and the right, at a minimum, to use their own body as they see fit.",
            "1) A lot of foster kids go through really tough times, and in some cases have severe trauma. Without proper licensing, the most loving and kind people can end up accidentally harming the child more\n\n2) Fostering/Adoption is POSSIBLE to regulate, you can't regulate conception/birth without violations of bodily autonomy\n\n3) Adoption is a public act and so the govt has a job to see it is done right (sometimes the job is done badly, not gonna deny it). Having a biokid happens privately",
            "The amount of people on reddit that want the government to have overreach on who is legally allowed to have children is worrying.",
            "1. One is government funded.\n2. You can't tell me that any sort of parent license wouldn't be immediately used against minorities, especially racial minorities. There's already a history of claiming that Native Americans are shit parents so that the government can place their children in white homes, we don't need another version of that.",
            "Yes let's have the government control absolutely everything sounds good",
            "Everyone screws up their own kids a little. But if a kid has to be rehomed, they got extra trauma. How much? It might be \"wets themselves and sobs silently in the foot well of a car because you drove past the donut shop dad took them to after he used to rape them\" kind of trauma.\n\nSound too dark to read? Wouldn't you have liked someone to prepare you for how dark this just got? THAT'S why foster parents need training, and support.",
            "How do you regulate that? People have unprotected sex all the time. Pregnancies happen. If you're going to forcefully abort all non-approved pregnancies, you're basically at the level of eugenics, which most people agree is a big no no.\n\nNot to mention the blatant disregard for religious freedom if you're in the US.",
            "a lot of people don’t actively try",
            "You can't prevent unfit parents to have sex and children, but you can prevent unfit parents adopting out or fostering children in the system.",
            "How are you enforcing this in a non-dystopian, forced sterilization kinda way?\n\n&#x200B;\n\nA better solution would be to incentivize parenting classes, provide free mental health care and child care. ban abstinence only sex-ed, and provide a basic income for everyone.",
            "[removed]",
            "Because some jackass would twig the rules about what someone needed to be to qualify until black people, or jews, or anyone with tattoos, or who ever smoked weed or was suspected of being gay, or wasn't a specifc flavor of christian wasn't legally allowed to have children. Legal Genocide.  It's been tried more than once in the US.\n\nWhat would be \\*Helpful\\* is to offer free courses before or after the baby is born on the basics of how to raise a kid, with people a parent can call to ask questions, but nobody to report back to, so you don't get the above legislating-who-can-have-kids problem, while helping people not make as many dangerous mistakes.",
            "Adoption and fostering only happens when something goes wrong. The child usually experiences trauma because of it. This trauma will most likely cause the child to act out and become a \"problem child\". This means those in care of these children need to be well trained in understanding child development and how to respond to a child's misbehaviour, even the worst kind, all while having a loving understanding of the child. The foster families and adopting families don't usually do it right, even with training. \n\nIt's very different than having your own child.",
            "I suspect the main reason is the young people up for Foster care and adoption, have had a bad start in life. They may have trauma from whatever caused them to be removed from their birth families, be doing drug detox or alcohol detox if newborn or have learnt to mimic behaviors of their previous carers that a none f Foster child would not even know of.\n\nDue to them already having been removed from situations some discipline measures are unsuitable for them, no time outs for example as it can spike anxiety and abandoned feelings. There are also security concerns with some Foster children and their names and images need to be kept off social media to protect them",
            "I mean China had this whole one child policy and it wasn’t even training related but probably equal level of control from the government. I don’t think this level of control would bode well in western countries.",
            "You're a nazi clearly lol",
            "Variation of the trolly problem, at the end of the day.  If 2 people naturally become abusive parents, they hold all the blame.\n\nIf the government or a private agency helps 2 people become abusive parents, that is objectively worse because the root problem is identical AND you have more people at fault.",
            "Basically to sum up what a lot of people have already said, there's a line from that Folding Ideas NFT video that really stands out along the lines of \"Laws must be evaluated based on how they can be abused\".  While yes there is indeed value in ensuring basic competency in parents, things like \"I won't feed my child spoiled milk\", it's also just far too easy for such a system to go too far and go on to bias against things like poverty as a whole.",
            "I work in this space and whilst we don’t have adoption in my state we do have foster care\n\nFoster carers need to go through training and checks to ensure they are in it for the right reasons (believe me they’d plenty that aren’t) and they are going to be able to meet the child’s needs. \n\nFoster kids have a trauma background and the people who are for them need to know how to work with them in the right ways.  Parenting a child who’s experienced trauma is different to parenting a child who has not. \n\nTraining around supporting them to develop their identity is something hugely important so the children know who they are, where they come from and why they are where they are.\n\n\n\n\n\nIn my experience the majority of parents don’t want to abuse or neglect there child/ren. When they can’t we get involved try to work with them to get them back on track or if needed remove for the child/rens safety however this is the last resort. \n\nAlso there is no way to stop people having babies without creating a ethical shit show around who is deemed an appropriate person to have a child and who is not. Different parenting practices and options exist, doesn’t mean one is inherently wrong or right. There the notion of good enough parenting, you don’t have to get it 100% right 100% of the time. \n\nIf children were born to parent that didn’t pass the right test what are you going to do? Remove them? Because we have high enough workloads for children that are actually experiencing abuse or neglect without worrying about someone not passing a test.",
            "A license to have kids? That would require yet another government agency to over see said license, more laws and by-laws to be proposed and written and set. Ultimately more taxes to be levied to pay for all that. Education to be applied, more than crappy sex we get now. Then there would need to be policing of laws and policies, oversite of every step of this cacophony of fuk-tardedness just to say...yeah your fit to have kids. The government oversees enough of our everyday life, we don't need more. Don't need more people either, so theres that.",
            "On a similar note: my babies had NICU stays after they were born and I had to take baby CPR classes, a shanken baby warning course and several informational classes before I was allowed to take my children home. And nothing about the classes was specific to NICU babies, just things like \"how to bathe your baby and how often\" and \"ways to hold your baby\", with some bits about having medically fragile babies.\n\nI asked my mom because my brother had a NICU stay in the 90s, and she had to take similar classes. She said they told her it was because medically fragile babies are statistically the most likely to be abused.\n\nMy hospital told me that all the classes are available to all new mother's after they give birth, but only required for NICU parents",
            "The real reason is probably not as freedom-oriented as everyone likes to think. It's probably just so that the agencies are harder to sue for putting a child in a dangerous situation. Those kind of charges can carry some serious weight.\n\nTo everyone saying \"What are we gonna do? Take away peoples' kids?\" What do you think happens when a family abuses their children? They get taken away.\n\nI could see what constitutes abusing children or unfit parenting being expanded in the future. Never forced abortions. There will definitely be a gradual increase in child safety and quality of life as time goes on. The same way you could beat the shit out of your kids in the 70s and now a kid can call CPS on you for yelling. That trend will continue. Maybe in 40 years having under a certain amount of money will be child endangerment. Or not being home for a certain amount of hours a day.",
            "Reproduction is an inalienable human right that is not run by the government. The foster system is run run by the government and participation is a privilege. This seems obvious.",
            "Hello! I have friends gong through foster classes at the moment. \n\nFirst:\nIn the US you really can’t tell people who can have sex or who isn’t, or who can get pregnant and who can’t, I mean look at the current wave of anti-abortion laws as an example. \n\nOn to foster parents:\nFoster parent classes, in large part, about preparing foster parents for taking care of kids who’s life up until that point we’re probably pretty shitty. Many will have various kinds of trauma and mental/emotional disorders that can spring up as a result of a poor life. \nThe classes talk about these issues and try to help prepare foster parents. \nAnother big topic is the legal aspects of the relationship.",
            "How about making them available for free or offering some kind of benefit for taking them instead of forcing people to?",
            "Because controlling people's right to give birth is basically eugenics and is a form of fascism. It's understandable that people should have adequate education in raising children, but enforcing that is a *very* dangerous path to tread that starts with forced classes for parents and ends with sterilisation of people deemed inadequate to raise children.",
            "the practical answer is because you choose/screw up your own life when you have a kid but when you are a foster parent the state has approved you to take children and the state would prefer to be less liable.",
            "How would you enforce that? \n\nTaking away children from unlicensed parents would be so unpopular, you'd have more countries on your back than Russia does right now. Let alone the riots that would start\n\nIf it's punishment like a fine, well, your punishment is making the parents worse at parenting. You can't punish the parents without decreasing the quality of life for the kid, making any punishment counter productive.",
            "How the fuck are you gonna watch over everyone trying to get a kid?",
            "Because if people have their own kid and can't take care of it, it's more on them. but an organisation would be at fault if they put a child in the care of someone who wasn't prepared, and of course they don't want that",
            "Well it's everybody's right to have their own child and nobody can stop them, even if they will make shitty parents. But we don't have the right to have someone else's child even if they desperately need a home. So measures can be put in place to filter out the people that won't make good parents.",
            "So if a person has a child, and are good parents but refuse to do the training, what are you going to do? Fine them? Take their child from them? Put their child into adoption? Give the child away to another family?",
            "What will you do to stop people from having babies without permission? Will you rip babies from the arms of loving parents and put them in orphanages? Will you forcibly implant IUDs in every girl who has started puberty to stop her from reproducing? Any law like this is impossible to enforce without brutal oppression.",
            "There used to be a class in highschool (it was called home ec) where they taught some parenting stuff. You would see some students walking around school with a fake baby for a few days. Lol. It honestly didn't teach too much. Maybe they should make more in depth parenting classes mandatory for all highschoolers, even if you don't want kids at the time.  I read a bunch of parenting books after I had my child and I wish I had read them sooner because the level of emotional intelligence I learned would have helped me with all of my relationships.",
            "Oh wow reddit understanding what a slippery slope is for once. What a nice change of pace.",
            "Rather then a license why not have test and courses that if you pass you get some kind have reward for you child. To keep a focus on positive outcomes and avoiding the forced abortions/adoption.",
            "That’s moronic. How about you get licensed to live as well? Every 4 years you sit before a commission and they determine if you’re living up to the standards they set forth. Fail the test and be executed. You can control who you give a child too you cannot control a persons right to life.",
            "A license is not feasibile without falling into a dystopic scenario (like many other comments explained), but some kind of course could be a really good idea.\n\nWhere I live, the Catholic Church organizes courses of “preparation to marriage”. I don’t completely agree with what they teach because I’m not religious, but at least these courses make people reflect about the meaning of marriage. People that are getting married just because “it’s what you do” get the chance to better understand what they are about to do.\n\nIf there were public courses about parenting that people are invited to attend before deciding to have a baby, maybe it will be the same thing. People that want a baby just because “babies are cute” or “it’s just what you do when you’ve been married for a few years” would at least learn about some practical and psychological aspects. Of course these classes could not be mandatory, but could be strongly encouraged. In time, it could become the normal thing to do when planning to have a baby.\n\nOf course this wouldn’t solve the unplanned pregnancies problem (we need sex education for that) but maybe most future parents would be more conscious.",
            "I'm not saying that it's not an interesting idea but the minute they start legislating who can/cannot have children it's going to get real Hand Maiden-y real quick.",
            "I guess it's because adopted children come with a bunch of traumas someone's GOT to know how to handle. \n\nWould it be awesome if it was extended to everyone? Yes\n\nAre both situation the same thing? Not really",
            "The only time making a slippery slope argument isn’t a problem. History has shown us time and time again that when we restrict freedoms, it always affects the poor, disadvantaged, and racial minorities \n\nIt’s just not feasible to do without the risk of worse atrocities happening",
            "That \"license\" would give the state an insane amount of control over who gets to have children and who doesn't. Think of China's \"One Child Policy\" as a good example. While I agree that there should be a mandatory free/subsidized course given to people who will have a child soon, I disagree with the license concept.",
            "Because you can't control how people naturally reproduce.",
            "Because historically that has always wound up being just a way to oppress minorities. \n\nWould you have wanted Trump getting to decide who was a fit parent? \n\nIt is you're a Republican would you want AOC getting to decide who is a for parent? \n\nAlso, what do you do with people who don't pass your test? Take the kids and open a lot of orphanages?",
            "Technically yes they should but in practice that's something Russia and Asian countries would get criticised for by politicians and the government already has more power than it's meant to can you really trust them to control the right to breed",
            "Because there is no way to prevent people from having babies without violating their basic human rights.",
            "It's like how voter education tests sound like a good idea on the surface, but in reality were weaponised to intentionally keep non-whites from voting during Jim Crow south in the US. It's really hard to regulate.",
            "Chain of custody. Don't want the adoption agency to be part of the neglect so they do due diligence. It's a cover your ass (cya) policy",
            "Choosing who gets to be a parent - understandable sentiment on the surface but real bad in practice. However it would be nice if new parents in the US got baby boxes with starter supplies like they do in some other countries, and having books/information pamphlets included in that on important baby basics and the like would be cool, especially for parents who have no support system in place.",
            "\"Its easier to ask for forgiveness than it is to ask for permission\" works perfectly for this situation. I've had family members go through both processes, hell my own parents had to prove they were fit to be in my life at one point. However, one voluntarily wants custodian of a child while the other has to prove within reasonable doubt that they are of sound mind to be a custodian of a child. Unless they are shitty parents then they won't have to go through mandatory training to keep their child.",
            "Nothing, NOTHING good will come out of governments mandating who and who can't have kids. That's a line we can never cross. Not only would it be impossible to regulate, but it would absolutely be a power that gets abused. Also, see China's one child policy for how well setting child birth restrictions  worked for female babies.",
            "You'd fuck that kid up so bad if your birth parents couldn't raise you then you put them into another home that are incapable of raising you. (It still happens but at least they try)",
            "Easy answer is it'd be incredibly hard to enforce. Unless, like you suggest, the government requires you to get a license before you can have a kid, which would then require some sort of mandated birth control/abstinence and I think a lot of people would have a problem with that.",
            "Because you're welcome to fuck up your own kid, it's a free country. But you can't volunteer to fuck up other people's kids because they are going through a hard time and need assistance? I don't really know, just my first thought.",
            "simplest answer i would think is cause foster parents get money from the government.  money = government caring.  no money = government doesn't give a sh-t.  \n\nlicensing for pregnancy?  so - what would you do with all those \"criminals\" who have kids without a license?  don't think we could build enough prisons or ever get enough foster parents to take care of all the criminal's babies.",
            "How about the opposite, cause you know that controlling who can be parents is never going to something the public accepts.\n\nAs in, \"why do you need to pay so much money and go through training to adopt a kid\".",
            "That's called eugenics and it fell out of fashion in the 40s.",
            "what makes someone a good parent?  in order to enforce what your proposing someone would have to define it . what if mr and mrs jones have good paying jobs and enough money and resources  to financially afford a kid but are cold and and not loving  would you alow them to have kids ? or what if they had little money but could show the kid an enormous amount of love and care would they be denied?  plus all the cultural aspects of parenting . its to complicated to give one definition to.  my definition of good parenting would differ from yours and vice versa.",
            "Because, unfortunately, A LOT of children in the foster system have a lot of baggage and trauma, and foster parents need to be trained in how to deal with and help support children with said trauma. 😔  They need people with special training, and also the people who are willing to go through the training show that they're more serious about supporting the child than Joe Schmoe off the street.",
            "Because controlling who is allowed to have children is eugenics and foster kids are usually foster kids because they've experienced significant trauma, so they need especially good parents.",
            "One thing you have to remember is that kids in foster care are technically owned by the govt. like they are required to have their own lawyer provided by the state, go to court every once in a while, etc. I was a foster parent and the amount of paper work to adopt a child is more than it was to purchase a home.",
            "Not only would that disproportionately affect black and brown women, this would only allow people with wealth to have children.\nYou are essentially advocating eugenics for people who are poor, and poor people are not poor through their own fault.",
            "Because every country need soldiers and there's a very specific way of ensuring there's a steady supply.",
            "Ive been saying this forever. U cant do shit without a license. Drive, own a gun, even FISHING. But u can have all the kids u want even if u have no way to support them. This dilutes the gene pool horribly over time.",
            "This is super stupid. You want the govt to mandate who can or can’t have kids? How could that go wrong? Have you ever heard of eugenics?",
            "As an ex foster youth (who went through 6 foster homes), I would argue they don't do enough training of either party!\n\nFrom experience, and talking to other foster youth while I was in care, most foster parents are horrible. \n\nThey do the bare minimum (and often don't even do that) for the money, my last foster parent cooked for us maybe three times a year (all teenagers), banned me from using the kitchen entirely because she simply didn't believe me when I told her countless times I have awful memory. \n\nThe banning stemming from burning plastic stored in the oven (who does that!?!?!) Because I came from homes that stored nothing in the oven and wasn't aware they were there. \n\nAnd forgetting to clean my dishes, of which when reminded, I'd immediately apologize and clean them because genuinely, I didn't mean to leave a mess. But I guess I'm the unreasonable one. \n\nNot to mention foster parents, as far as I'm aware, have no training for neurodivergent youth or youth with mental disorders, despite most youth going through foster care either being neurodivergent or having a disorder. \n\nAnyways sorry for my rant \n\nTL:DR\nI agree it's weird training doesn't seem to occur for adopting parents, and even stranger that foster parents do so little training to care for foster youth (ex. Seemingly no training for neurodivergent youth)",
            "So you want less autonomy, and more government control? I'm sorry but no thank you. \n\nI'm sure you don't care because you think you're well socialized to society. No government would ever infringe on your ability to have kids. Let's ignore the fact that every 4 to 8 years, political attitudes can change dramatically. \n\nHow do you even suppose this could be accomplished? Mandatory abortions for any accidental pregnancies without a license? Forced sterilization procedures such as vasectomies, or tubal ligation at puberty? Maybe you could just impose a hefty fine? That ought to stop *everyone* from propagating without the proper papers. Or would it only stop the poor, and disenfranchised from having children?\n\nI know what this subreddits name is but, come-on...",
            "This. Everybody should have to do a (extensive and long) Training Behörde they should be able to have Kids.",
            "I ask the same question all the time. There needs to be a license to breed.",
            "Idk about other parents, but when you have a kid where I live (Alberta, Canada), we went to a bunch of different classes and got lots of information about how to take care of your baby. Pamphlets, websites, books, online/in person classes, and if your are proven to be irresponsible parents, you are forced to take even more classes and will only let you see your baby part time until you're finished. On top of this, you are required to do constant visits to various appointments to check the baby and they are constantly giving you resources to help you. Foster parents are a bit different, they often have to deal with kids who have been abused or through tough traumatizing situations. It makes some sense that there would be additional classes that cover information on how to deal with that. I would hardly say that there is nothing you have to do to be a parent, you just don't have to get pre-approved lol.\n\nTLDR, there are tones of classes and resources where I come from, and lots of required clinic visits and check-ups. Either they don't do that in the US, or most of you don't have kids.",
            "I don't plan on ever having kids, but if someone were to offer me and my partner parenting training as part of the various check-ups I would hop on that immediately. So maybe the question should be-\"Why isn't training offered to new parents having a baby?\". \n\nI'm sure there are some around, but the difference between 'available' and 'widely available and participation is advised' is considerable. In my opinion such things should be a normal part of waiting for baby.",
            "Found the tyrant.",
            "Because it's your human right to have sex and to have a baby.",
            "My parents started doing foster care when I was in junior high, so I can tell you that most foster kids are coming from really fucked up, abusive households.  Foster parents have to go through extensive vetting to make sure that they're not going to add to the abuse these kids have already suffered and to make sure they are equipped to handle the mountain of psychological issues that come with these kids. Even with the extensive vetting, there are always some abusive types that make it through and get a license. There are a lot of fuckwads who see foster kids as easy targets because they've already been groomed to tolerate abuse and the government gives you money for them to boot.",
            "It is because of the unfortunate fact that there are people biologically able to have children but may not mentally, financially or for some other reason be capable to take the responsibilities that come with creating a new life.\nI presume there are some laws that prevent governments from creating laws that say something about humans, bodies, life or something.\n\nHowever, my boyfriend and I think something like a training or certificate for new parents should exist. We choose not to have children. It is not that we don’t like kids by the way. We think we are good ‘parents’ by thoroughly considering whether we would want kids and whether we would be able to take care of them as we think they deserve.\n\nThere always are people asking out of the blue whether we want kids. We think it’s rude. Also it is crazy that it is kind of a standard expectation that couples want or are going to have kids.",
            "Child birth is literally the last thing I would ever trust any government with",
            "I think unfortunately its your biological right to have children no matter how dumb you are.  The alternative is a very scary universe where the government could literally ban stupid / poor / wrong political party / whatever type of person from having kids.\n\nThat being said, at least in the US we should do a better job of teaching everyone in school actual basic life skills that translate to being a good parent such as - how to read product labels, how to properly apply for and manage credit, and probably also how babies work and how to keep them alive",
            "Other things with mandatory training and entry requirements are already elitist or becoming moreso, like universities as one example. This could be exploited to enact a form of eugenics over time, quite easily.\n\nRequire a course fee. Course attendance. Standardized tests.\n\nYou've immediately gated off the poorest people, those working many jobs or with health issues, and those who couldn't afford other education or have no time to study.\n\nThe fact of the matter is, it's easier to perform well the richer you are. So we can't put a performance gate on reproduction easily",
            "I think the answer is that we just haven't figured out an ethical way of enforcing it.",
            "I think high school should have a mandatory ( not elective) course on adulting.  Basic cooking, bill pay, planning a shopping list and even parenting lessons.  The earlier the better.",
            "Because a rule is not a rule if you can't enforce it.",
            "I don't want whoever is in charge to define who can and cannot have children. What happens when a person who hates Muslims or Christians gets into the position and decides they can't have kids?",
            "Because adoption is a privilege and birthing is a right?",
            "The United States gave it a shot to try and filter out people who were evaluated to be future unfit parents.  It was an atrocity.\n\nhttps://www.npr.org/sections/health-shots/2016/03/07/469478098/the-supreme-court-ruling-that-led-to-70-000-forced-sterilizations\n\n> In 1927, the U.S. Supreme Court decided, by a vote of 8 to 1, to uphold a state's right to forcibly sterilize a person considered unfit to procreate. The case, known as Buck v. Bell, centered on a young woman named Carrie Buck, whom the state of Virginia had deemed to be \"feebleminded.\"\n\n> Author Adam Cohen tells Fresh Air's Terry Gross that Buck v. Bell was considered a victory for America's eugenics movement, an early 20th century school of thought that emphasized biological determinism and actively sought to \"breed out\" traits that were considered undesirable ...\n\n> All told, as many as 70,000 Americans were forcibly sterilized during the 20th century. The victims of state-mandated sterilization included people like Buck who had been labeled \"mentally deficient,\" as well as those who who were deaf, blind and diseased. Minorities, poor people and \"promiscuous\" women were often targeted.",
            "“Oi! Stop that! Where’s your reproduction license?!”",
            "Because nobody wants fucking regulations \n\nGet it hahahaha",
            "What would you suggest to make it fair? Less freedom in your home or less regulation to adoption.\n\nThe kids that are up for adoption already went through unvetted parents. It would be foolish to give them to just anyone a second time.",
            "Same reason people don't have to take training to eat properly.",
            "Because in an adoption, there are other parties that have responsibility to the child (like the adoption agency). Having your own kids, no one else is involved that can be held responsible.",
            "Because you would destroy society.  \n\nEither you would need to put up massive euthanasia facilities all over the place to dispose of unauthorized babies or kids, not to mention all the abortion clinics.  \n\nOr you would have millions and millions of kids in massive orphanages everywhere and an equal number of otherwise well meaning parents in rhe many many more prisons we would need to try and deter ignoring the law.  \n\nMany parents would try to dispose of the babies secretly.  So women who got pregnant would disappear for months and come back broken, if ever.  \n\nWe know these things because example exist.  It's the same reason abstinence sex Ed is worthless.  People are gonna fuck one way or another.  That will lead to babies eventually.\n\nYou might like like the book Brave New World.",
            "Oof... I get where you coming from OP. Some people truly aren't fit to raise children.\n\nBut once you start issuing \"licenses\" then you are open to the possibility that there are people that won't be eligible for it. Then what?\n\nLater, just as everything else, the issuing office will get corrupted and you will only be able to obtain a license for a large fee or only if \"you know someone on the inside\".\n\nBefore you know it nobody is allowed to have children but the very few selected by an unfair measure. And then there's the question.. what you gonna do with the people that don't have the license? Force abortion? Force adoption? Prison terms? Fines? ..\n\nThere should be, however, a program for people to learn. Something to the tune of \"Congrats, you're pregnant! Now attend these ten classes to learn about the biology and psychology of raising children\" Free of charge, maybe even \"Bonus for attending\" to get people to actually attend.",
            "Police who can and cannot perform a biological function? Seems like a slippery slope.",
            "You're only allowed to screw up your own kids, not someone else's.",
            "\"Sometimes I really think people ought to have to pass a proper exam before they’re allowed to be parents. Not just the practical, I mean.\"\n\nGNU Sir Pterry",
            "Because children in the foster care system are treated like property. They get money for them and treat them as such.",
            "Because the right to reproduce (bear children biologically) is a fundamental right that is acknowledged by almost every government in the world. The contrast to that is that the right to adopt a child created by another human is not fundamental at all. \n\nOnce a child is in foster care, it is the government’s responsibility to keep that child safe and to place it in an appropriate home. It now has an affirmative obligation to endure the home it chooses IS safe and appropriate. That affirmative obligation of the government is just nonexistent when a denizen of that State reproduces or attempts to reproduce.",
            "And what happens if you don't get the license? If you just get pregnant?\n\nDo they kill the baby or take it away to put in an orphanage?",
            "Because money and funding. Even with adoption it's the money someone already is spending on child why the vet so heavily.",
            "comforting to know I'm not the only one who has been thinking this!",
            "The issue is bad faith actors. You can't require a license for having kids because it would easily be used to stop \"undesirables\" from having kids, as just another way ethnic, religious, and political minorities can be abused.",
            "If you’re in the US, this should be obvious. You know who would be be given the “yes, you can have kids” licenses and who wouldn’t.",
            "The government is historically terrible at everything it does. Universal healthcare is well known to be popular with almost every person. Yet NO one wants government run healthcare. Wonder why. \n\nLetting the government run our fertility is the perfect way to end a country."
        ]
    },
    {
        "post_id": "jblpvl",
        "author": "Justryan95",
        "title": "Did Dick still mean penis back in the 50s and 60s when everyone named Richard just took the nickname Dick? If yes why would you want a nickname that also meant penis?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/jblpvl/did_dick_still_mean_penis_back_in_the_50s_and_60s/",
        "score": 22984,
        "num_comments": 1992,
        "created_utc": 1602761077.0,
        "selftext": "I'm at 16k upvotes right now. Does that mean this was a really stupid question?",
        "permalink": "/r/NoStupidQuestions/comments/jblpvl/did_dick_still_mean_penis_back_in_the_50s_and_60s/",
        "comments": [
            "Dick has meant penis since at least [the 1890s](https://www.etymonline.com/word/dick#etymonline_v_8536). But the nickname predates it by a long time so that's stuck around.",
            "Dick became short for Richard in the middle ages, when there was a trend to change the first letter of the name of a person to make a nickname. Thus \"Rick\" became \"Dick\" the same way \"Will\" became \"Bill\". There were probably more but those are the ones that stuck around until today.\n\nAs far as I know, the penis connotation is much more recent and unrelated.",
            "In the Middle Ages there were a lot of people with the same name, so to differentiate them in writing they'd use nicknames- so Richard becomes Rich or Rick and Margaret becomes Maggie or Meg. But if there are still more people with the same name, and even the nicknames are taken, they'd swap letters on the nicknames to create more variations. So Richard becomes Rick, which becomes Dick. And Margaret becomes Maggie or Meg, which become Peg or Peggy. \n\n[https://www.mentalfloss.com/article/24761/origins-10-nicknames#:\\~:text=2.,true%20of%20Bill%20and%20Will](https://www.mentalfloss.com/article/24761/origins-10-nicknames#:~:text=2.,true%20of%20Bill%20and%20Will).",
            "Well boner used to mean Mistake.",
            "Yeah but I think Dick also met something like detective. Private Eye movie sometimes they say a private dick, or Dick Tracey",
            "William becomes Will which becomes Bill\n\nRobert becomes Rob which becomes Bob\n\nBut people ask me me how you get Dick from Richard.  I always reply, \"I don't know, usually about two drinks.\"",
            "Had a buddy in high school named richard johnson. Still hilarious.",
            "My dads name is Richard and I asked him if people called him dick instead. His response, “ Only if they let me call them pussy. “ lol",
            "[removed]",
            "My real name is Dick Wiener so I've been a target of many homosexual bullies",
            "My eight year old asked me this yesterday. My husband's name was is Richard and I think she was really hoping for a cuss word loophole.",
            "[removed]",
            "Peter and Willie are also slang for penis.  John is a toilet or a man with a prostitute.  At some point, worry about this sort of thing is useless unless you're picking a fairly rare name with baggage, like Gaylord or  Pissdrinker or Donald.  That's where you should start considering your choices carefully before committing.",
            "I bet somewhere along there’s there was a Richard, that went by Dick, and he was such an asshile, like famously and asshole, so they started using his name as an insult. Like Karen today.\n\nMaybe.  Idk",
            "You guys should hear the album \"At Least I'm Not a Pianist\" by Dick Cox.",
            "[deleted]",
            "I should go ask my brother Peter or my other brother  Willie to see if they know why someone would want to be called Dick\n\n—Mr Johnson",
            "Peoples' minds then were no so full of constant cuss words and sexual innuendo.  Gay and Dick were common names and people did not think about homosexuality or the penis first.  My first grade reader was about Dick and Jane.  Believe me, it was totally wholesome.",
            "It’s not an issue. \nMy 3 sons are named Schlong, Dong and Whanger. None of them have ever experienced jokes being made about their names.",
            "Until about 1980 there were so many male names that could also mean penis that Dick didn't really seem any worse than the others, like Peter or Willie. For some reason (probably because it's a single syllable with hard consonants at the beginning and the end-- ideal for swear words), Dick captured the market. \n\nAlso, until the last 40 years or so, vulgar language was much less common in public usage, so people didn't necessarily know the connotations of names. As recently as the early 2000s, someone I knew named their son John Thomas and had no clue that it was a nickname for penis. (I didn't tell them. The damage was already done.)\n\nFinally, this is just personal experience, but I spend a lot of time with my elderly neighbor who is called Dick. In my mind, his name and \"dick\" are two different words. I mean, I know they're the same word but the concept of penis never enters my mind when I say, \"Hey Dick, how's it going?\" It's like how lead (verb) and lead (a metal) are different words and you know what's meant by the context.",
            "I am Dick, Dick I am.\nYou likely wonder why a man,\nWould spend his life with such a name,\nWell, ask my parents, they’re to blame.\nFor giving me a name from whence,\nThey named the male protuberance .\nYes I know, it seems absurd,\nI’m both a noun, and a verb",
            "Not gonna read through 1,000+ comments to see if this has been posted already, but ...\n\nQ: How do you get Dick from Richard?\n\nA: Ask him nicely.",
            "I don’t know if this has been mentioned yet but I just heard that the name for a male chicken, “rooster” came about after people started calling their dicks “cocks” and proper people didn’t want to go around saying “cock” all the time so they came up with a nicer word for the boy chickens 😂",
            "What about peter or johnson.. I think the issue here is men can't stop making up pet names and euphemisms for their penises",
            "Once worked for a family in the deep south. The father was universally referred to as big Dick, and his son as little Dick. Sometimes people called little Dick: Dickie.\n\nI cringed every time. Mostly tried to just call the Sir, Boss, anything but their common name.",
            "I went to school with a Richard Johnson. Dick Dick was his nickname.",
            "There's a movie about Nixon called \"Dick\", once my poli sci teacher wanted us to watch it so he told us to google dick movie...",
            "The nickname comes form old cockney traditions of replacing words with other words that rhymed w them like “stairs” turning into “Apple and pears” and “phone” turning into “dog and bone”. Rick is a much older nickname for Richard than dick is. It’s the same reason bill is a nickname for William",
            "When I worked at a large chain pharmacy the employees were getting pretty fed up with a lot of corporate bullshit. One of the little things that wasn't even a big deal but was still just seen as more corporate involvement was when they started requiring everyone to answer the phones with their name and also title. The pharmacist in charge (head pharmacist) went by the name dick, and out of spite he often would answer the phone with \"Dick-head pharmacist\" all said very quickly together. It was these little things that continued to bring a bit of joy into our lives. This was almost a decade ago and I still remember it vividly, thats how important this small win was to us",
            "How do you get Dick from Richard?\n\nYou ask nicely.",
            "I met a woman whose first name was Gay. But I guess that is an much newer implication. Not sure when that came into common usage as homosexual, but I can remember when it wasn't. (1960s say Wikipedia)\n\nLike Dick may have been used rudely, but it wasn't common parlance when I was young. Who remembers Dick Tracy?\n\ntl;dr I don't think \"dick\" was \"common\" parlance in polite society?",
            "ok follow up, who decided that pussy means vagina, and the middle finger is offensive? like who just decided that all these terms are now bad",
            "At least this is shorter. I don't get when they do things like call James, Jimmy. Jimmy is longer than James, why do that?",
            "I’ve met 2 older guys named Dick in my life.  Both were incredible people so I’ve actually always like the name Dick despite my entire life only knowing it as a reference to a penis.   Because the nickname is so old it’s just one of those things the mature people differentiate and immature people giggle about.  I imagine its the same with Fanny.",
            "I remember the word dink being more common than dick until the \\`80s, but that may be a regional thing.",
            "Dick is to the 1900s as Karen is to the 2000s. Fine before then, too tainted by meanness before the end of the century.",
            "I knew someone named their son Richard. Last name Head. True story. Poor kid.",
            "One of my best friends at school & best man at our wedding was Dick Short.",
            "People still have the last name of Allcock, Butts, Goldwater, etc.",
            "Back in the late 80’s, someone kept trying to register Dick Cling as their BBS account name. I kept deleting it. They finally sent a letter proving it is their real name (with a copy of their driver’s license).  It was a 50 year old man.  And he was pissed I kept deleting his account.",
            "I used to have a presidential bumper sticker from Tricky Dick’s election campaign. From his actual campaign staff in Austin, Texas that read: “Don’t change Dicks in the middle of a screw, vote for Nixon in ‘72.”",
            "Come from a long line of proud Dicks.  Why wouldn't you wanna be?",
            "It’s a hard cock life",
            ">I'm at 16k upvotes right now. Does that mean this was a really stupid question? \n\nYes, a stupid question that nobody else wants to ask but everyone wants to know the answer to",
            "My mum was once telling me of a father and son who were called Richard Senior and Richard Junior, I asked what were their nicknames? Big Dick and Little Dick?\n\nWell it got a laugh out of my mum anyway.",
            "I met a guy in the Nederland with a name Dick and he refused to be called Rick or Richard.",
            "No joke, an old customer of mine was named Richard and his last name was craven and he went by dick.",
            "I have a neighbor named Richard, he likes to go by Dick, don’t talk to him much he’s kinda stuck up.",
            "I was walking at walmart early 2010s and saw an elderly employee named Dick Savage. I was super jealous of his name. I followed Dick around the store to ask if he's gotten any attention because of his name and this dude just completely ignored me. What a savage.",
            "[deleted]"
        ]
    },
    {
        "post_id": "jkj4wb",
        "author": "None",
        "title": "Does anyone else have a moment when they look at the mirror and stare in disbelief at how ugly they are?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/jkj4wb/does_anyone_else_have_a_moment_when_they_look_at/",
        "score": 22949,
        "num_comments": 1374,
        "created_utc": 1604006698.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/jkj4wb/does_anyone_else_have_a_moment_when_they_look_at/",
        "comments": [
            "I think I look pretty nice in the mirror. My phone's camera on the other hand... yike",
            "it's one of the ways i check myself to see how i'm doing mentally. If i look in the mirror and i think i look good i'm probably in a good headspace. If i see the flaws then i'm not",
            "[deleted]",
            "I have the reverse, my mental image doesn't match how I think I look. When I see my face in a mirror I think I looked a lot better than I thought.",
            "I can’t look in the mirror any more since chemo treatments. I’ve lost like 70 pounds. All my hair. Muscle mass and color. I look like a ghost. I hate how I look now and don’t even have the energy to slap some make up on",
            "Yup. It's strange how the brain works that way. When I see people in public, I just think \"Oh just another person\".",
            "I need to know. Does phone cameras *actually* make you look uglier than you are or am I just really that ugly",
            "For sure. But shrug it off and run with it.",
            "Yes. \n\nBut on other days, I feel good looking and hot. So on days where I feel ugly, I try to think of when I didn’t, and hope I feel differently again soon.",
            "I don’t stare.. I look away as fast as possible and cover my mirrors with a blanket",
            "I stopped looking at myself whenever I could. I never look after using the bathroom, just makes me depressed.",
            "I'm more of a tactile (sense of touch) person, so for me it's not looks so much as how I feel. There are times when I'll feel my back skin folding from how fat it is and shiver in disgust.",
            "Every time I look in a mirror, I just think to myself “holy shit is this what I really look like?”",
            "Every day. I'm not a confident person. I mostly hate myself.",
            "Everyday my friend",
            "I'm not here to tell you you're crazy because you're not, but seeing a therapist just for this could be helpful.\n\nI thought I was super ugly until I learned to stop viewing myself in such a harsh way. For me it was rooted deeply and I needed a therapist to help me work through why I'm so mean to myself. For me it was connected to a lot of self-esteem issues formed in early years. \n\nSo you're 100% valid for seeing and feeling and experiencing this, and a therapist could probably help. Not everybody matches all the beauty standards like models do (I don't), but you deserve to like your own face and all the things connected to it.",
            "Yup, everyday. I stare and and stare, find everything wrong with my face then stand there wishing I looked like those flawless models on Instagram. No matter what angle I look at, mirror or camera, can never find myself beautiful. \n\n\nFriends and family tell me, but I can just never believe them. I know they’re lying just to spare my feelings.",
            "\\*dysphoria has entered the thread\\*",
            "Yes. \n\nThere are also days where I'm like \"hell yeah I'm hot!\"\n\nSelf esteem issues and depression are an everyday battle.",
            "I hate how asymmetrical my face is. Idk if it’s from chewing only on one side, or sleeping on one side... but I liked the way I looked til I saw the screen flip on FaceTime",
            "All the time. I keep thinking I’m going to see myself at 20, but I have quite a few more years now. And hell, even at 20 I hated the way I look.",
            "Yeah. I am legit shocked at how ugly I am... like who the hell allowed this?",
            "It's because you're just not your type.",
            "No, I see myself and think, \"if I were gay I'd fuck the hell outta that guy.\"\n\nBut I have low standards so that doesn't really mean anything.",
            "I don't think I'm a particularly bad looking guy, but sometimes when I don't sleep well, I'll wake up and I'll have bags under my eyes bigger than my eyes, and I'll think \"Holy fuck I look like a zombie.\"",
            "I once had a clean shave and was genuinely thinking I didn't look half bad. \nI then saw photos of me in a group and suffice it to say, I see why no female has bothered entertaining me as a companion.",
            "Every fucking day...",
            "At the hairdressers before your haircut when they shampoo your hair and drape the cape around you. Yeah, That thought has crossed my mind a few times.",
            "Well I'm trans so.... No I don't even look in mirrors if I can help it",
            "Dude I got severe face trauma last year during an epileptic seizure and lost my nose and good bit of tissue around my mouth and chin. I avoid mirrors like the plague but when I do catch a glimpse it takes all I have not to break down in tears",
            "No, because I'm not ugly",
            "What makes you think you're ugly, OP? Have you considered the possibility you could be wrong?",
            "Every day",
            "I'm normally not a big fan of how I look in the mirror. But when I'm high I LOVE how I look in the mirror and will stare and admire myself.",
            "I've heard it said that you're not ugly, you're just not your type. That makes some sense to me, I think I'm hideous but I've been married twice, both guys were very attractive by other people's standards, and I've dated plenty of other men so apparently there's lots of people who think I'm nice looking, it's just that *I* don't think I am.",
            "No. I'm fuckin' gorgeous.",
            "Yes, I genuinely hate looking in the mirror so much. I’ve had depression for about 5 years now, I have a therapist, a psychiatrist, a dietician you name it, but I just can’t seem to stop feeling unbearably ugly and disgusting. I don’t really know what to do about it anymore at this point. I wish I could like myself but I can’t seem to come to terms with the fact that I am just ugly. The least I could do is just accept it, but I can’t. I doubt if it’s normal to feel this way, but I certainly do almost every day.",
            "I think I look decent in the mirror. But I look fucking horrible in pictures.",
            "Oooh yeah. Try it out when getting a haircut, and it’s just your mug against the black apron.\n\nEdit: But good news! Super easy to fix. You’d be amazed what smiling, losing 10lbs and buying clothes that fit can do.",
            "I do stare in disbelief, but not perse because I think I'm ugly. My mental image is waaaay different than how I actually look, so I always stop and stare and be like \"wait... is that how I look??\"",
            "I go back and forth. Some days I think I look pretty good. Others I think I am ugly as fuck.",
            "I look in the mirror and see how ugly I am.  I look at other people and see how much of a failure I am.  Life sucks, but at least there's ice cream.",
            "If it helps, these moments can come and go - there’s a reason why it came to mind at a particular moment, rather than all throughout the day or any time you see a reflection in your window. Not everyone looks stunning, in fact most people really don’t, and we all (well, aside from narcissists) have a tendency at times to be harder on ourselves than other people ever would be",
            "I thought so, then I recently got a new drivers license photo and was horrified by how puffy my face was and how sunken my eyes looked",
            "[deleted]",
            "Not exactly, I look whistfully at my reflection and mentally remove all the wrinkles, bags and dark circles, and then I am good to go.\n\nIts all part of ageing I guess.",
            "I mean, at this point I'm not sure if there's anyone who DOESN'T feel this way.",
            "The opposite for me. \n\nI would walk around feeling ugly and then look in the mirror and realize I’m not as bad looking as I think I am. Then I walk away from the mirror and the cycle continues.",
            "Everywhere I look... I'm so fucking ugly...",
            "I am very vain and really like how I look most of the time, but I still get this once in a while when I see myself and be like \"well that's one ugly mofo\"",
            "Sort of! When I look in the mirror, I always wonder why people think of me as a good looking person.",
            "When I was on mushrooms I couldn’t believe what my face looked like",
            "mom help im being bullied online",
            "Yeah, but multiple people have confirmed that I'm pretty ugly, so sometimes the truth hurts.",
            "This reminds me of an article I saw online YEARS ago but still bothers me:\n\n“Scientists say your brain makes you think you’re 10% more attractive than you actually are!”\n\nI always think about this when I’m like, “Damn I look good today!”",
            "Me, I used to burst into tears because I’d remember how people said I was too ugly to befriend.\nSome might consider me the ugly duckling, but I sure as hell don’t feel like a swan. I think I’m average. But all the bullying has really fucked me up and I can’t really see myself as attractive. \nMy therapist said it can be a form of body dismorphia.\nBut yeah, it’s why I hate selfies and hate group pictures even more.",
            "Everyday fam. Everyday",
            "Everyday man. Going to have surgery early next year for it...",
            "Every damn day",
            "Well...tbf looking at the mirror arouses a bit of confidence...take a pic of myself and I look like a warthog that stuck it's face into the exhaust pipe of a  Corvette",
            "All the time. But then I remember that no one cares about me and I go about my day happy as can be!",
            "No but I do take mushrooms and stare at myself until my eyes start shifting, causing my to laugh maniacally at my distorted face. Try it some time",
            "I used to when I suffered with depression, not im on antidepressants and am in therapy etc. And I see just 'me' in the mirror, and me is pretty,  and my body isn't disgustingly fat it is just a little jiggly but it looks good!",
            "Nah - I’m used to it by this point. Sorry for the rest of you guys who have to look at me, though😞",
            "I think I look hideous. I try my hardest not to look In them. You are not alone.",
            "It’s even worse when you’re overweight.",
            "every goddamn day\n\nbeing trans literally makes me want to kill myself",
            "Every day",
            "I don't even like looking in the mirror. I actively look away most mornings when I'm getting ready. I truly don't even think I'm that bad looking, but I'm not impressed with how I look.",
            "Quite the opposite, however, changing room mirrors are the worst!",
            "Every fucking day",
            "Reflections by R.S. Thomas\n\nThe furies are at home\nin the mirror; it is their address.\nEven the clearest water,\nif deep enough can drown.\n\nNever think to surprise them.\nYour face approaching ever\nso friendly is the white flag\nthey ignore. There is no truce\n\nwith the furies. A mirror’s temperature\nis always at zero. It is ice\nin the veins. Its camera\nis an X-ray. It is a chalice\n \nheld out to you in\nsilent communion, where gaspingly\nyou partake of a shifting\nidentity never your own.",
            "Like as a human in general or relative to other humans?",
            "And I ask myself, “When did this happen?!!!”",
            "Every time when I look at the mirror.",
            "Nah. I accepted that fact a long time ago. No point stressing over something I can’t change.",
            "I think I look good in mirror bad in photos. Started making sure to look at myself from side on / other angles because that’s what the camera is getting and I look ugly as fuck. Nowadays I just laugh fuck it can’t change shit learn to live with it because you have no other option sorry bruv.",
            "Only in the car. Idk what it is about that mirror but it always makes me look dead even if i know i look fine",
            "/r/egg_irl",
            "I look ugliest when there is neon light, you can see every hair that is starting to grow just this moment. 😁",
            "My whole life I've done this. Got so bad that there were weeks where I wouldn't even look in a mirror. Stopped bathing regularly, stopped brushing my teeth, etc. I was using hard drugs (oxy, heroin, etc) just to quiet the voice in my head saying, \"you're ugly, you're shit, you're nothing\". There wasn't a day that went by where I didn't contemplate suicide.\nI wish I could say I had some revelation, I met someone, or I made a simple change, then all this simply went away. Well that's not life, and that doesn't happen for many of us. It's been a looong road, but I've made a lot of progress over the last decade. I spent my teens & 20s feeling that way, then spent my 30s working NOT to feel that way. I just turned 41 and I'm finally living my life. By no means am I at 100%, but I'm almost there and I'm cool with that. It will always be a struggle, but it's worth it. YOU are worth it and YOU deserve it too.\nYou can DM me ANYTIME you want. Today, tomorrow, or two years from now, I would love to share what has helped me in my journey. In hopes that it might help you even just a little.\nYou might not find yourself beautiful, but others do and they want you to be happy. This stranger does!",
            "Yes.",
            "I stopped looking in the mirror unless necessary",
            "I just avoid mirrors where possible.",
            "I often look in the mirror and think that this is the worst I've ever looked... and this is as good as it will ever be.",
            "That was me today, I have been trying to accept myself as the way I am for the past few months (when through a rough time, always believed that I WAS LESS THAN EVERYONE and I am trying to overcome these thoughts).\n\nAnyways, I was staring at my face, trying to tell myself that I am beautiful and i guess I stared a little too long (AND LIKE FOR REAL) and GOT SCARED at my OWN REFLECTION???? 😂 LIKE FUCK YOU MIRROR???",
            "When I actually look, I'm okay. But sometimes I'll catch a glimpse of myself in a store mirror, and think \"Who's that dumpy old lady? Oh, Crap! It's me!\"",
            "No, but I often wonder if everyone else sees me as ugly when I don’t. I’m also overweight, but I don’t see myself as overweight. It’s like I have positive body dysmorphia. Idk lol",
            "If anyone feels that way they have their priorities wrong. I'm not going to BS you about \"inner beauty\" Brad Pitt would likely not have been the celebrity he is if he weren't the good looking man he is. But measuring your worth by your looks alone is totally wrong.",
            "You get desensitized to it eventually",
            "Literally the opposite. Im only stuck looking in the mirror on good days.  If I look ugly I run away.",
            "I flip flop between the sexiest man in the world and the ugliest man in the world",
            "No I'm really good looking. Sorry u ugly :(",
            "Only when I’m being hard on myself. \n\nRemember the saying “beauty is in the eye of the beholder?” \n\nYou are what you believe you are, what you feel you are. If you’re feeling insecure, if you’re being hard on yourself, you’ll look in the mirror and find a face to justify how low you feel. You’ll blame yourself face for why you feel this way. \n\nWork on how you love yourself. How you respect yourself. Achieve a goal. Push yourself. Be that person in your life you wish you had. \n\nYou’re not ugly, you’re just struggling. And that’s okay. It’s okay to struggle. But try to pull yourself out, and pull yourself up. You can.\n\nOvercome hardships, and define yourself by the strength you provide for yourself.",
            "yes, sometimes I feel bad my family has to see the eye-sore of face everyday, but other days I feel like a sexy motherfucker",
            "I think most of us have unusual looks, I think what makes us beautiful is who we are inside.",
            "i try not to look at the mirror for this very reason. another perk of unemployment is i dont have to put on makeup cause i ain't goin anywhere so i hardly ever have to see myself!!",
            "You aren't ugly you have poor self esteem. No one is perfect. I believe everyone has looked in the mirror and didn't like their nose or their freckles, etc. Everyone wants to better themselves in some way. That's ok as long as it's not excessive like constantly getting plastic surgery. Boosting self esteem will be very helpful for everyone.",
            "Theres no other sub that you can take your attention seeking to? \n\nThis sub has really turned away from what it use to be: a place for legitimate questions that dont fall into other subs categories.",
            "Only in the morning when my face is still puffy, my eyes are red and my nose is running.\n\nI do hate when others take photos of me. I feel I'm not photogenic at all unless I'm taking a selfie.",
            "Every single day of my life since the orthodontist fucked up my face and made me look like a fuckin who from Dr. Suess illustrations",
            "Nope",
            "All the time",
            "You recognise yourself?",
            "no",
            "good looking*\n\nbut hey everything might be totally digital later and youll get your new avatar",
            "Hell no I'm fucking amazing 😎",
            "No",
            "I have this too. Search into your gender identity. It may be a manifestation of dysphoria",
            "Substitute ’ugly’ with ‘old’ then yeah",
            "I accidentally looked in the mirror at the tail end of a laugh. I'd never really noticed my smiling/happy face before. Who the hell knew I looked so old? Where did all those wrinkles come from? I learned my RBF is more attractive than my happy face.",
            "Every f-ing day.",
            "Uh . . . . yep.",
            "Yes",
            " yep always, but it's even worse with my phone's camera lol",
            "Yeah, but mainly because I'm a fat fuck. I'm not relly *inherently* ugly, when I'm less fat. I'm maybe a 7/10 on a good day. but the fatness takes four fucking points off the top.",
            "I've never looked in a mirror and though I was ugly.  But there have been a few times when I look in the mirror and for a few brief moments I just stop and go, \"Who the hell is that?  Is that... That's what I look like?\"  It's usually only the span of a heartbeat or two, but a really strange sensation.",
            "does anyone look in the mirror and forget they are an actual person sometimes?",
            "Shhhh impossible, you beautiful",
            "When I'm playing hand held on my Nintendo switch, the screen goes black when it's loading and I see my gross ass face in all its glory staring back at me and am horrified everytime. Same with my phone and tablet.  I think that's where the show 'Black Mirror's got it's name.",
            "Nope. I'm drop dead gorgeous and so are you . I don't care what anybody else thinks.",
            "No because unlike you I am not ugly. Fix your shit. Eat better drink water stop smoking cigarettes cut back on the liquor sleep normal hours dress like a grownup get a haircut stop fucking slouching all the time and hit the gym or at least go for a 5k run in the morning.\n\nEdit to add and brush your damn teeth",
            "'A moment'?",
            "Self-love, learn it. I crush on myself when I look in the mirror.",
            "I used to but I learned to accept myself and to see what my husband sees. Not that I don’t have occasional shudders when I’m in front of a full length mirror, but hey. I’m no longer a 20 something year old. I earned my mileage.",
            "No, but I’ve caught myself looking so sexy in the mirror that I masturbated to it.",
            "No. \n\nIf you or anyone feels this way, DM me. I can tell you a dozen ways in which you are attractive. \n\nDon’t think that you’re ugly. You aren’t.",
            "I may have Prosopagnosia, the inability to recognize faces. I have no perception of how I look in a mirror, and can’t picture the faces of anyone else I love. \n\nI sorely disappoint myself every time I see my face",
            "Nope, just into the mirror sometimes and think: \"Yep, still black. Better not encounter any cops today\"",
            "Downvoted since i cannot relate",
            "Nah",
            "People thinking they're ugly but they been in relationships and shit. You're actually ugly if you're a virgin over 20.",
            "yes.",
            "Yes",
            "No.",
            "At least once or twice a day.",
            "No",
            "Uggo here,  I can relate",
            "Yeah but I also occasionally state in disbelief of how good I look. I'm probably like a 5",
            "I’m cute as fuck",
            "Mmmm something like that. Whatever that joke or saying is about never actually seeing your face really bothers me. I don’t think I look anything like my MS or HS pictures. Barely my college pictures. So when I see myself in the mirror I have no idea what or who I’m looking at and I automatically assume I’m just ugly.",
            "Gotta break those mirrors",
            "Totally.",
            "Yeah, everyday infact",
            "Ooof I definitely have these moments",
            "Yes, and I remind myself how easy it is to make myself look better technically but then realize again that it's expensive and time-consuming to reach the point of my desired look (getting braces, laser surgery for acne scars, hitting the gym).",
            "Yes. All the time. Then I'll shave my head and trim my beard and realize how handsome I actually am 😎",
            "all the time. cant stand seeing myself, hearing myself back or photos of me.",
            "I tend to have a different outcome. I have pretty heavy anxiety. I'll be suffering from this or that throughout the day and I'll catch myself in the mirror and it'll just be me. Just me. Same as I ever was. Which I guess is kinda reassuring. But it always catches me off guard.",
            "Everytime I look in a mirror I have those moments",
            "After having three kids in 2.5 years, facing health challenges, never getting enough sleep and poor eating habits... yeah.  I avoid mirrors.",
            "its pretty rough",
            "At how ugly i am? Yes\nAt how pretty i am? Also yes\nAll in the same day...because im confused and have no concrete perception of myself",
            "When I'm getting my hair colored. 🤮",
            "Every time.",
            "For me it's kinda of the opposite. I get zero attention from the opposite sex so I've completely lost all hope and don't even try anymore or even think there's a possibility of anything other than casual acquaintances with anyone I meet. One thing that helps with this is the fact of my having this impression of myself being really prohibitively ugly. If I ever think about how I look during the day I must sort of iteratively make myself uglier and uglier in my mind's eye. So then when I notice my reflection at the end of the day I'm often pleasantly surprised by how ugly I'm not but also a little confused again. Maybe I also just have a really shit personality too, I dunno.",
            "I'm always having that conversation.\n\nJust be reminded that you are the best thing to have ever existed!",
            "It always shocks me seeing my hair before and after showers,\n\nI look normal after but before I look like a freak.",
            "Mirror, I appreciate. My phone camera, I’m a troll.",
            "Don’t you mean “bad ass”?",
            "Every damn day.",
            "Me every single day.",
            "Every day. Then I remind myself that while I may look like a gargoyle, I like me.",
            "occasionally yes",
            "Yeah... but only twice per day.",
            "If I take a quick look, I somewhat look nice. But if I stare for more than 6 seconds. I see horror.",
            "r/ugly",
            "Just about every day yes, the older I get the harder I shrug",
            "Yeah no lol",
            "yes about once a day 🤔",
            "Yeah, but other people don't seem to notice my flaws as much as I do. To be fair, I have looked pretty close.",
            "The worst is when an app opens your camera. Always a shocker.",
            "A lot of the time especially when I haven't been watching my weight. Gained 60 lbs since covid. Bulimia is at an all time high. Binge drinking galore. I can confidently say I am ugly now.",
            "Never",
            "had this on acid. went to the bathroom, looked in the mirror, walked out to my friends and told one: \"remember when you told me about your truffles trip and how you looked in the mirror and just thought you were pretty? yeah i just had the opposite\" \n\nthen we went to the mirror and were amazed by our ugliness.",
            "And by moment you mean every mirror or shiny surface? Yes yes I do lol",
            "yes all the fucking time. I just stand there and wonder how I've made friends when I can't imagine people wanting to look at me for extended periods of time",
            "daily",
            "When I was a teenager I knew I was ugly no one can change my mind.  I was really skinny and covered in pimples.   I hated looking at myself.  As I grew older I became waaaaaay more attractive.",
            "Can we end the DAE posts here? It's constant",
            "No, exact opposite",
            "There isn't a reason to believe an anonymous reddit user who isn't going to take a selfie, but I used to be a pretty attractive dude even a few years ago. Recently I lost almost all my fucking hair to genetic recession. Even shaving my head clean I don't look very good. At least to the opposite sex. You're damn right I look at myself sometimes and notice how ugly I got!",
            "You mean my morning routine?",
            "I go on months not really looking at myself so when I do I’m surprised at how old I’ve gotten. It also doesn’t help that depression and weight gain has changed my face. So disappointing.",
            "I have really small lips, and they pretty much disappear into my mouth when I'm sick or sleep-deprived. Sometimes I stare in awe at how oddly proportioned my face is without any real lips, but then I remember that my lip size is not up to me, I'm not getting fillers, and I also don't really care. Thin lips, and lots of other facial features, are made fun of for reasons that are beyond me. Sometimes I just don't care that I perceive myself as ugly. I'm indifferent towards my face. All of its functions work properly and thats all I need from it. To answer your question, yes, but not very often because I remember the function of my face is not to be beautiful.",
            "Daily.",
            "Yes this is why I try to avoid reflective materials at all costs",
            "No",
            "I think most people that think they’re ugly are average. As a 5/10 I know this feeling. Certain days I wake up and I’m like I’m so ugly, other days I feel indifferent, and on the rare occasion I do think I am a pretty good looking guy",
            "Every single day",
            "Yes constantly! And people pay me to be in porn and I’m on a few covers. No amount of validation takes it away.",
            "Every time I see my reflection in anything.",
            "I'm sure a lot of people do, but I don't. \n\nDo you know why? \n\nBecause the last time I looked in the mirror my reflection grabbed me and pulled me into the mirror world, and took my place in the real world.",
            "I turn away from the mirror when I brush my teeth because I can’t bare to see myself for a whole two minutes.",
            "The joys of wearing a mask in public, nobody can see my nasty ass face",
            "Nope"
        ]
    },
    {
        "post_id": "q7zo6f",
        "author": "Sad-Feedback-3970",
        "title": "My husband wants to switch to a bidet to be more environmentally conscious. Once you use it, how do you dry off? Do you use a towel on your butthole? That you reuse?? That sounds unsanitary.",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/q7zo6f/my_husband_wants_to_switch_to_a_bidet_to_be_more/",
        "score": 22941,
        "num_comments": 5584,
        "created_utc": 1634217933.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/q7zo6f/my_husband_wants_to_switch_to_a_bidet_to_be_more/",
        "comments": [
            "Warning, once you get a bidet pooping anywhere that doesn't have one is upsetting",
            "We have a bidet with a blow dryer built in (Biobidet).  LOVE it.",
            "During the Great TP-ocalypse (T-Pocalypse?) of 2020, when people were filling their garages with enough ass-wiping materials to survive until the heat death of the universe, I decided to grab a couple of simple bidets to install on the toilets since I have a wife and two daughters, and even before COVID, was starting to worry about my personal contribution to global deforestation.  They're actually really easy to install, just mount it under your toilet seat, connect the water line from the wall, to the bidet, then to the toilet flush mechanism.  Check for leaks, give it a test (make sure you have the toilet seat down, otherwise *fountain,*) and you're set to go.\n\nNow, if you're not used to them, the first few times will be a, for lack of a safer word, experience.  Your body isn't used to having a pressurized stream of water aimed directly at, well, *that* (especially if it's THAT, according to my girls).  Speaking from personal experience, it was a bit of a surprise, but not concerningly unpleasant.  For the ol' #2, once you get done dropping the kids off at the pool, you'll give yourself a nice jetting off (be gentle at first, these things can go from 'soft shower' to 'maritime paint remover' with a slight turn of the dial), then grab a bit of TP to pat off the excess water and sometimes get what's remaining.  I did find that the water tended to cascade down the ol' coinpurse when using it, and that had to be dried as well, so please let your husband know.\n\nFor #1, with guys, it's business as usual, bidet isn't generally needed.  For girls, I can only speak anecdotally...similar to #1, except use the 'female' setting on the bidet--I believe most have them, it simply jets the water a bit further forward to reach that area.  Also, be especially careful with the setting (remember, 'paint remover'.)  Pat, pat with a bit of TP, and go on with your day.\n\nI did find that our TP usage dramatically decreased after installing the bidets (like 75-80%), and everyone in the house was stating that they just felt *cleaner* post-install, rather than with just using TP.  I can confirm that...when I'm at work, or someplace away from home, and have to do it the \"old-fashioned\" way, I never feel like I got everything, and I don't feel quite right.\n\nNow, you can go 'super eco' and use washable towels to replace the toilet paper, but...seriously?!?  No way I'm keeping two buckets of those for 'new' and 'used'.  I just threw up in my mouth a little thinking about that.\n\nOne last warning--note that these do hook up to your COLD WATER LINE.  Depending on where you live, you may want to consider ponying up extra for one of the heated water bidets.  I grew up in North Dakota, and I know how cold the tap water can get in the winter, which is wonderfully refreshing to drink but...nope, not there.\n\nAnyway, that's my little contribution to this discussion.  Hope it helps.\n\nEDIT:  JFC, I didn't know this would blow up like it did.  Thank you, everyone, for your comments and awards--it really did make my day memorable.  For those of you that are curious, I did link the specific bidet I bought in the comments, but I'll put it here for easier access:  [Bio Bidet | SlimEdge Home Bidet Toilet Seat Attachment, Fresh Sprayer with Retractable & Dual Nozzles for Feminine Wash & Adjustable Water Pressure | Non-Electric, white](https://smile.amazon.com/gp/product/B0854GTXH4/ref=ppx_yo_dt_b_search_asin_title?ie=UTF8&psc=1)",
            "Toilet paper. If only being used to dry your butt one roll of paper will last all week",
            "You just shake off like a duck",
            "For certain poops, it can vastly reduce the amount of TP necessary.  But anyone who claims you don't need to wipe after using a bidet has a nasty ass.  How would they know for sure they are clean?  Even a single square is necessary for confirmation.\n\nSource- have bidet and a poopy butt\n\nEdit- many of you have nasty asses and I'm never shaking hands with anyone again.",
            "Toilet paper to dry lol",
            "I have about 100 small drying towels out of flannel (roughly the size of 2 t.p. squares). 95 % of the time they are only used for drying and have no residual matter. After the rinse, pat dry, place in covered basket.  Once a month run the lot through laundry on hot water with a splash of bleach.  Guests use regular t.p., unless they are curious.",
            "Your butt doesn’t need to be sanitized, it just needs to not have poop on it. The water does the job, you just use some toilet paper to wipe everything down. The really nice thing about the bidet is that it kinda shoots up in there and gets a lot of the leftovers out, if you catch my drift .. it’s the cleanest I’ve ever felt !",
            "Italian here.\nWe have a bidet in every bathroom, it's the norm here. \nYou do use a towel, even though when you propeely wash yourself with some intimate soap it won't leave a stain (since you're simply drying off and the cleaning has been done by the water and your hands). You may reuse it without washing it in that case. If there's a stain it's better to wash it (it's also an indication that you need to wash yourself more thoroughly)",
            "\"Can you spare a square?\"",
            "Three sea shells",
            "My bidet has a drying feature... you just do your business, flush, blow dry, and go. For those that don't have a drying feature, 2 squares of toilet paper can be used to dab dry.",
            "Just Naruto run all over the house till it air dries.",
            "[removed]",
            "Once you go bidet, all other toilets make you feel dirty.\n\nGet a bidet with a female option. Also check the pressure because you may need a regulator to avoid making a third hole.\n\nDry with TP.",
            "The purpose of the bidet is TO CLEAN YOURSELF. Do you use a towel after being in the bath or shower?\nExactly the same.",
            "Basket of clean white washcloths, and basket on the floor for dirty. Treat them like reusable baby diapers, but they don’t get directly pooped on, so much easier to deal with. The level of clean with a bidet feels so much better.",
            "[removed]",
            "I really just wait a moment for all the water to drip off and skin to dry.-\n\nI mean like... I'm on my phone anyway so...",
            "Isn’t just wiping unsanitary too?",
            "You wash with your hand and soap, then use a towel to dry, it's not unsanitary",
            "Italian here, using bidet for at least 55 years.\n\nTo use a bidet, first you wipe your BH with toilet paper as usual, then you wash your BH and genitalia on the bidet using one hand a and specific non aggressive soap.\n\nAt this point your BH should be very clean and you dry it with a little towel that is specific for that purpose. That little towel will be changed and washed very often.\n\nThen you wash accurately your hands and you are done.\n\nI repeat: a bidet is not a replacement for toiled paper. It is just a place more convenient than a shower where you can wash your BH and genitalia without undressing completely. Sitting also makes washing your BH easier.",
            "I have a dedicated \"butt towel\" hanging close to the bidet.... It is supposed to be clean when you use it. 😁",
            "It baffles my mind that some of y’all think dry wiping your ass after taking a shit is okay or good enough. \n\nThe bidet isn’t mean to replace toilet paper. You wash your ass with it after shitting, then use toilet paper to dry off. Because you’re cleaning your ass with water first instead of endlessly smearing shit by dry wiping, you’ll end up using less toilet paper. But it was never meant to replace toilet paper all together.",
            "[removed]",
            "Baby wipes are the poor persons bidet lmfao",
            "How are there still unsanitary civilizations out there who do not use water to keep their nether regions clean!?",
            "We use like baby rags. They're cheap and they come in pretty sizable packs and soft. A basket in the bathroom where we throw the rags and wash them separately from the other clothes. So happy to not have to buy toilet paper any more 🤗",
            "Fancy ones have fans! Otherwise just use a square or two.",
            "You can use toilet paper if you want, and will require less of it.  ESPECIALLY while menstruating.  Lady bidets are the best!  I personally use cloth wipes that I use once and toss into a basket to be washed.  I’d like to add that unless you live somewhere that gets REALLY cold, a heated water bidet isn’t necessary.  I never use the warm water setting on mine because cold just feels cleaner for some reason.",
            "Just installed my bidet this weekend. Sat down for a \"dry run\" test to make sure it worked properly, and didn't want water shooting out all over the bathroom.  \n\n\nWell, my house has kind of high water pressure, you see...  \n\n\nI turned the setting from off and when it took a second for anything to happen, cranked the dial and practically gave myself an enema. I yipped pretty loudly and almost jumped off the toilet! Figured out that getting \"low\" pressure is turning the dial just a tiny amount before turning my bidet into an ass pressure washer/roto rooter.  \n\n\nFWIW, I still use TP because my bidet is cheap and doesn't really have much customization or other bells and whistles but keeps my ass from being chapped from using too much paper after a \"challenging\" bowel movement.",
            "Honestly, you don't need to specifically dry after using a bidet. You wash properly and just let it drip for a couple of seconds. It air dries enough to just put your pants back on and move on. My country uses bidets everywhere and there's never any specific infrastructure for drying.",
            "How do you dry yourself when you get out of the shower? It's literally the same.",
            "Jordan Schlansky has the hottest take on this: [Jordan defends the beauty of the bidet](https://youtu.be/1Z3IBvDFhUo)",
            "My wife is worried the water will run into her lady parts, and cause problems. She is stuck on this idea a bidet goes against the wiping from front to back to stay sanitary, and somehow this brings the back to the front.\n\nWe discussed it a few times, and my observation about other countries using it en masse without outbreaks of infections, did not convince her.\n\nI'm in 'waiting it out' mode.  Anyone got any counter arguments for our next discussion?",
            "I have a bidet. I have never been so clean. I love it.",
            "If you had pigeon shit on your hand, how would you clean it?\nJust with water? Or would you use soap? Seems obvious which is the answer right?\n\nAnd if you use soap, is it unsanitary to dry your hands on a towel?\n\nWhy would you clean your hands with water and soap if they had pigeon shit but not so the same with your butthole if it has your own shit? Is your shit more hygienic?",
            "Bidet and toilet paper. Thick ones to absorb water. Life is so much more easier and you get a much cleaner butthole, feels great to have a fresh feeling after every poop, can't imagine going back to just tp.",
            "Don’t get a bidet, get a hand sprayer instead. Widely in use in South East Asia, you can easily target the bullseye, and there will be a small valve to adjust the water pressure",
            "Unsanitary?  \n\nYou've been smearing it all over for your entire life and you think water is unsanitary?\n\nLike Matt Damon says, \"When you get shit on your arm, you don't smear it around with toilet paper.\"\n\nBidets rock!",
            "You still use toilet paper. But not much at all. \nIt’s common in my country. We even take portable bidets when traveling (you can buy one off of amazon and see if u like it)",
            "You don't know how to use the shells?",
            "How do you dry when you are done showering. It should be the same process. If you aren't that clean, you are not using it right.",
            "I use a hose (common in the area of the world o live in) to clean off. I still use tp to dry off, but it requires a lot less than wiping and you get a lot cleaner.",
            "Trust me when I say a bidet is cleaner than wiping with just toilet paper.. u can wipe urself dry with fewer paper than u did without a bidet 👍🏻👍🏻 clean butt, cleaner conscious",
            "I have a bidet. It isn't about not using tp, it is about using vastly less TP. One roll lasts me months, before my sister moved in, because of the bidet.",
            "You still wipe but you'll only need to wipe once to dry off and make sure it's clean for sure and there won't be shit smeared all over your ass",
            "This is just an aside, but as a lady, bidet makes periods and sex cleanup much easier.",
            "We have a stack of small washcloths handy. Dry off with a washcloth, drop them in the laundry. Launder the stack about once per week. Each washcloth is used once between laundering. \n\nPreviously these were cloth baby wipes when the kids were babies. We laundered them then too.\n\nDrying off after a bidet is quite sanitary because your bottom is sparkly clean. It's not much different than drying off your hands after washing them really.",
            "When using a Bidet in SE Asia. Turn on the bidet and let me clean your Butt for about 10+ seconds to make sure it’s cleaning it properly and you can move your Butt around while it’s cleaning it to make sure it’s getting the surrounding area. Then turn it off and let it drip for a few secs and you can shake your butt to help speed up the process. Then you can just put on your undies or get a single piece of TP to dry off. After a while, you’ll get use to it. Assuming the water you’re using is not dirty, then you’ll be fine. But YMMV and on depends on your preference.\n\nBut a bidet is a good choice, no matter what! Once you can upgrade to a bidet with a blow dryer and/or seat warmer, it’s awesome.",
            "coz wiping with TP is so sanitary",
            "I'm not sure if I can post this here or not as this is talking about bidets. Because everyone is saying how much better it is on the butt than using toilet paper, has anyone heard of family cloth? It's a re usable damp or dry cloth that is used in place of toilet paper. You wipe, place it in a recepticl then you wash the used ones and re use them after they are clean and dry. My family started to use them after the toilet paper crisis began caused by  covid. We have been using them for over a year now and we love it. We figured out that we are saving 500 dollars a year not having to purchase toilet paper. You can buy cloth specifically for family cloth but it's kind of expensive. We decided to go with a basic microfiber cloth that we buy in bulk from Walmart I believe but you can get a big box of them from any car parts place or places like that. Our family was a bit stand offish at first but quickly discovered how nice they feel and how clean it leaves your bottom. Anyway, I didn't mean to sound like a TV commercial 😊",
            "You use a towel to dry your hands... They've been everywhere, it just doesn't matter because you've just washed them. Just don't mix towels, and wash them regularly (get maybe 10 small make up ones and rotate).",
            "[deleted]",
            "Still use toilet paper. Bidet don’t completely eliminate the usage but it does reduce it. If your willing to just sit there until your butt dries then by all means.",
            "Still gotta wipe, just less wiping",
            "You can use toilet paper or have hand towel for each person. It gets me good I never have any problems with leftovers. Also amazing for washing up before and after sex and washing up during your period. I would not get one without hot water tho.",
            "My bidet has an air blower but you can also use a couple squares of paper to dab dry."
        ]
    },
    {
        "post_id": "lnd6po",
        "author": "UnholyDemigod",
        "title": "Why do Americans clubs have people in the toilet who ‘help’ me wash my hands?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/lnd6po/why_do_americans_clubs_have_people_in_the_toilet/",
        "score": 22943,
        "num_comments": 2372,
        "created_utc": 1613732230.0,
        "selftext": "I went to America for my honeymoon, and me and the missus went to a club. I went to take a piss, and after the crowd and the sink dissipated, I stepped up to wash my hands, and some bloke sitting on the basin reached over with a bottle and squirted soap on my hands for me. I didnt know it was soap, so I nearly decked him, but it turns out this is a common thing. Like what??? I’m not 3 for fuck sake, why does your job even exist?",
        "permalink": "/r/NoStupidQuestions/comments/lnd6po/why_do_americans_clubs_have_people_in_the_toilet/",
        "comments": [
            "It's a deterrent to keep people from doing drugs/having sex in the bathrooms. They're not club employees, usually contractors, so they make money having cologne and other things set up.",
            "It's not just American clubs, they have them in England as well.\n\nIt's also not just posh places like someone else said. Local dive bar I used to go to had these nice ladies that would - for a tip - offer you a spritz of perfume, a piece of candy, some hand cream or some other thing.\n\nThey were also there to routinely check and clean the toilets to stop them getting messy over the course of the night.",
            "Lotta night clubs have these guys to discourage drug use in the bathrooms",
            "They have them in Europe too. The idea is to keep the restroom stocked, fresh, prevent fights/drugs/sex and so forth. The \"helping\" part is usually for tips which might be more American, I'm not certain. But if I see someone in there I throw some cash in their cup regardless. Who wants to put up with that \"crap\" all day.\n\nEdit: this is a good read \n\nhttps://m.clevescene.com/cleveland/confessions-of-a-strip-club-bathroom-attendant/Content?oid=3572120",
            "Then it will blow your mind that there are attendants in Mexican clubs who sell everything from gum, cologne, viagra, condoms and loose cigarettes. But they are also mostly there to make sure no one is consuming drugs in the bathroom.",
            "Growing up in the U.K. they were lovingly referred to as ‘bog trolls’. Some would come out with little quips about freshening up for a chance to get laid, convincing you that £1 for a spritz of £10 cologne was worth it. May or may not still be the case. Good times.",
            "Its so people dont fook in the washroom eh. Almost got lucky once but then the hand washer guy was smiling at us",
            "I hate it. Such an uncomfortable experience.",
            "Wait , what?\n\nIs this actually a thing?\n\nThe closest I’ve seen is in Changi airport, where there was an older person sitting in the corner ready to clean any mess as soon as it happened.",
            "Are you British? They have weird blokes in clubs here too, usually trying to spritz with aftershave in return for a tip. It is partly discreet security. It is a bit of a 90s thing, or what you find in the local meat market club these days.",
            "The term for this position is often referred to as \"restroom attendants\". Depending on how   \nupscale a venue is, their roles can include:\n\n* Babysitting the people in the restroom. They act as bouncers in the restroom, and if people are too drunk, getting high off illegal substances, trying to have sex, etc. they are to keep them from doing so, or calling for help.\n* Selling supplies (some places offer gum, cigarettes, mouth wash, toiletries, etc for sale; some even offer things like colon, condoms, lady products, etc)\n* Cleaning up the area when it gets messy. Mostly keeping the sink tidy and preventing the trash bin from overflowing, but can clean up the toilets from time to time (or alert the cleaning staff that a toilet is destroyed...)\n* Assisting customers with issues they're having.\n\nTheir main role is to babysit people in the restroom, but they do other tasks because it saves the venue money to have people cover multiple roles, plus it makes it less creepy that a person is in the restroom to just observe.",
            "As an American, where was this? I was born here and have never had someone help me wash my hands.",
            "To make sure you don't do cocaine.",
            "Just for the record, I've not seen this in America, but I've seen it in several places in Europe. I definitely don't think it's a uniquely American phenomenon at least.",
            "They are there to stop people from doing drugs / having sex.\n\nOn a humorous note I got kicked out of a place in the early 90s because my drunk ass thought it was funny to call them WIPERS from a stall and ordered them to wipe my butt. No I didn't need them but it was more a play from Coming to America.\n\nI still think it was funny.",
            "Ok, the actual squirting the soap is rather weird, but bathroom attendants are not. Generally they monitor paper usage and keep people from trashing the place or having sex or doing drugs. A busy place full of drunk young people can go downhill fast.\n\nI've seen this in multiple countries in Latin America, it is not a US thing.\n\nAlso, you should not be nearly decking people in general.",
            "I always assumed it was just to stop people doing drugs",
            "Wait til you find out we are expected to tip that guy too 😂",
            "So you don't jerk off and overdoses on cat pheromones",
            "As an American where in the hell did you find this place? Like I have never had that happen to me ever in the history of my life. I also probably would have the same reaction as you.",
            "As an American I personally hate that this is a thing. You wouldn’t believe the timing and planning I have to go through to avoid them when I gotta to",
            "Easy there killer",
            "American here. Guess I'm not rich enough to have ever seen this.",
            "Om from America and rarely ever see them in America and they seem more popular in europe",
            "[deleted]",
            "They have these guys in UK clubs too - they'll provide soap and a paper towel, but also sell you gum and aftershave while saying such classic phrases as \"no spray, no lay\", \"no Armani, no poonani\", and \"no splash, no gash\".",
            "They stand there while you take a loud shit? Then the two of you make eye contact while you hand them gross money right after washing your hands? Wtf",
            "It's not that common, usually more in fancier restaurants and some private clubs. Most places do not have restroom attendants and it's kind of archaic IMO, but it's more for upscale type stuff.\n\nEdit: That or, yeah, they're there to deter people from doing drugs I guess. Kind of depends on what sort of place you're in.",
            "To get more money out of you. You're expected to tip them for some reason.",
            "I remember when I went to Las Vegas (from Norway) and some of the clubs had these attendands next to the sink. I thought it was cool and I even gave that dude several dollars, because why not, lol. He had already provided me with some tissues and body spray few times that evening.",
            "I was at a night club and went to the bathroom. I've heard of bathroom attendants but assumed they were all in fancy restaurants and hotels like in the movies. Well, I decided to give him a tip because this place was crowded and I was a little tipsy. Turns out I gave him $5 instead of $1. He was extremely excited, he physically washed my hands for me and opened the door on my way out while shooing others out of my way. I went back to the bathroom later that night and he remembered me! He let me go to the front of the line once a urinal opened up. I was pretty uncomfortable and I tried to hold in my bladder the whole night as not to go to the bathroom again.",
            "As an American, this is new to me. I’ve only ever seen this in Europe.",
            "I've lived in America 40 years and never encountered this once outside of in TV shows or movies",
            "Its basically another way of providing jobs and to stock the bathroom and make sure people aren't shit house humping",
            "People like getting poor people to clean up after them",
            "It's not common. I've never come across it in person, only seen it in TV shows/movies.",
            "We do?",
            "To answer the “why” they do this: 1. It places an employee in the restroom at all times  to inform security/management if anything shady or fights happen immediately 2. Drugs & deals happens in bathrooms and allows them to keep an eye on the dealings 3. Drunk people create messes, soap & water everywhere, paper towels thrown near the bin instead of inside... someone to help maintain a cleaner bathroom 4. To create an upscale atmosphere to validate a $20 vodka soda",
            "Here is an example from American documentary Deuce Biggalow  [https://www.youtube.com/watch?v=hRN7nh7-eZI](https://www.youtube.com/watch?v=hRN7nh7-eZI)\n\nThe man in the bathroom is your father and will give you life advice as well as offer soap and a towel for you to wash your hands.",
            "Bathroom attendants date back to the mid 19th century in Europe high end hotels and restaurants.\n https://www.google.com/amp/s/www.nytimes.com/2019/05/08/style/bathroom-attendants.amp.html",
            "Reading these comments..... I disagree with this notion of \"its not just posh places\" I've been to nicer more expensive bars and clubs in multiple cities and I have never seen this once. Only seen it in movies.  \n\n\nI guess it depends on your definition of posh and rich places to me that must be like millionaire rich.",
            "I have only seen this in places that are out to squeeze every dollar they can from you. That guy is expecting you to give him cash for watching you piss.",
            "I’m a poor American so I’ve only ever seen those guys in movies but I will say rich people here like to be reminded of how rich they are in everything that they do",
            "This post beings back great memories.\n\nWhen I was a teen, my family was super into Irish music and and we went to Irish music festivals all the time.  At one particular festival that was at a 4-H fairground, every bathroom building had an attendant who was in charge of cleaning, restocking tp, handing out toiletries and all that.  I think it was one family that did this as a job and the matriarch was Minnie.  I ALWAYS went to the bathroom that Minnie was taking care of, cause Minnie was not shy about moving the line along.  \"RUSH AND FLUSH, LADIES! RUSH AND FLUSH!\"  It was an Irish festival, so you fkn now the beer was flowing, so the bathrooms were always packed.  Minnie was awesome. I probably tipped her $10 over the course of the night. She deserved every penny.  That bathroom (which was like 15 toilets and 10 sinks) was always spotless and well stocked.",
            "I went to a club in Vegas. Wore shoes that killed my feet after a few hours. The nice bathroom lady sold old navy flip flops for $30 a pair. They were 3 sizes too big but best $30 I spent at a club.",
            "they have these in america?? im american and didn't know this",
            "It's because we're fuckin' high class son.",
            "They generally keep the bathroom tidy. People can be morons in the restroom unsupervised.\n\n\"That place was great, but the bathrooms were a complete mess.\"\n\nKind of ruins the experience.",
            "A last vestige of pomposity.",
            "It’s the best way to guilt men in to wash their hands. \n\nAlso to keep people from doing drugs, jacking off and doing other shit they shouldn’t be doing in public.",
            "In Thailand some dude popped up behind me and without saying or asking anything while washing my hands violently cranked my head, cracking my neck. I wasn't ready for it, but god damn did my neck feel good after that. Sadly had no cash on me, so I thanked him and left awkwardly.",
            "Same in south africa",
            "I've lived in the US my whole life, i have no idea what ur talking about.",
            "This is most definitely not only an American thing. I encountered this in places while in Europe and in the States. Where are you from, OP? I’m taking a wild guess and saying Australia?",
            "I'm American, and I've never experienced this in my entire life.",
            "I'm American and I thought this was a shitpost until reading the comments because I have never heard of this practice in my life.",
            "I’ve never ever seen this is USA (born and raised), but it’s the norm in Mexico.",
            "As an american i dont support this. I actually hate it.",
            "You probably went to a club where lots of people do drugs",
            "It's very uncommon, usually in higher end places because I've never seen one",
            "As an American, never head of this",
            "Yeah even as an American it is a little weird you see it more in high end restaurants and clubs.\n\nIt more is a left over of bygone times when labor was cheeeeepp and was used essentially to buttress the self esteem of wanna be “bosses” lol.\n\nNow on the plus side, a bathroom dude who is good at his job CAN actually add to the experience esp if you are a regular and a good tipper.\n\nSay you are at a high stakes business meal and someone is being a fucking asshole.\n\nYou go complain to the home field bathroom dude and get some of the tension out lol.\n\nBig date?  Bathroom dude says “looking sharp man!” Etc etc lol \n\nI am not defending it, just explaining a bit.\n\nFinally, as astonishing as it sounds lol SOME people DO need help in being REMINDED to wash their goddamned hands!\n\nI agree though when I first encountered this phenomenon I was like “da fuq!” 😆",
            "\"No splash, no gash!\"\n\"No sanitation, no penetration!\"\n\nThese guys annoy the fuck out of me. \n\nI also feel sorry for them. Spending their entire night in a drunken pissy bathroom.",
            "I’ve never seen this. Sounds more like a tv thing.",
            "Wait we were trying to be European, you mean you guys don’t have a guy?",
            "Live in America. Never seen or heard about this before. It's definitely not \"common\"",
            "This is from a movie, mate.\n\n>I nearly decked him.\n\n\nYeah, okay, Paul Hogan.",
            "American here , ummm what .",
            "I have only ever seen this in movies and TV never encountered it in real life",
            "wait why do you call them clubs? are you guys trying to have a party in there? i'm just tryna poop.",
            "Am a minor. Never been in a club. Did not know this was a thing. It sounds like a joke on the “employees must wash hands” signs",
            ">I didnt know it was soap, so I nearly decked him, \n\n\nTo me it seems like you're really unstable if this event nearly caused you to assault someone. You should probably seek help.",
            "Never understood this shit.  This strip club I use to frequent back in the day had someone there to help wash and/or your hands.  He sat in between the two sinks.  He would offer you like towels, mints, all that shit.  If you accepted ANYTHING from him, he expected a tip.  I didn't know him handing me a paper towel was anything special, but he demanded a tip.  I had no cash, it caused issues.    \n\nThe whole thing was fucking bizarre and I still don't understand why the fuck there's basically a butler in the fucking bathroom of a strip club."
        ]
    },
    {
        "post_id": "1brkh3q",
        "author": "mp1845",
        "title": "Why are gender neutral bathrooms so controversial when every toilet on an airplane or other public transport is gender neutral? ",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1brkh3q/why_are_gender_neutral_bathrooms_so_controversial/",
        "score": 22936,
        "num_comments": 4295,
        "created_utc": 1711812459.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/1brkh3q/why_are_gender_neutral_bathrooms_so_controversial/",
        "comments": [
            "All single stall restrooms should be unisex",
            "No one cares about the single person bathrooms— it’s generally the stalls that people are uncomfortable with.",
            "They are generally not controversial when you're talking about single-use bathrooms. It's the mixed use of shared bathrooms that people complain about (or advocate for).",
            "I live in India so that's reason enough. If it's a single bathroom that's okay. I will never share a stall style bathroom with men in this country.",
            "Maybe because you don't share the airplane bathroom with several people at once, all of which could be any and all gender.",
            "One is single use, the other might be shared. Society has taken steps to safeguard itself against the predators that use these places to find prey. Assholes ruining shit for everyone else since the dawn of time.",
            "I think it is the shitty stalls we have that make people nervous. If there wasn't several inches around the door where people could clearly see the occupant it wouldn't be such a big deal IMO.",
            "Single-user bathrooms are fine. As a woman, I don’t feel safe using the bathroom if men are in the room with me even if there is a dingy door with inch wide gaps in them between us.",
            "Individual bathrooms are okay but mixed sex bathrooms composed of multiple stalls feel both uncomfortable and very unsafe if you are a woman using them during quiet periods when you could be cornered.",
            "Because only one person at a time can use the airliner restroom.",
            "South African here. Women don't change in singlecstall bathrooms on a plane and it's public enough that they don't need to worry about being raped. And yes, being raed in bathrooms is a thing. Not allowing kids to go to the bathroom by themselves is for a similar reason as well as kidnapping. Many wkmen find it threatening for men to be in intimate places",
            "Gender neutral bathrooms aren’t really controversial when it’s just a toilet. In fact I find it amusing when a bathroom says “all genders” and it’s literally just a tiny room with a toilet and sink. That’s just a bathroom.  The controversial portion are the bathrooms that are big rooms where men and women are sharing the same sink, and you have stalls with urinals and some without. Basically an environment where men and women are using the bathroom at the same time is the controversial portion. The women’s bathroom can be kind of seen as a safe space for some. Hell even a men’s bathroom can be safe space for men ",
            "You aren't in the restroom at the same time as the opposite sex.",
            "It’s kinda like the old Carlin line: imagine how creepy the average person is, and half of them are creepier than that.",
            "100 years ago separate bathroom for women were celebrated as a big step for womens safety and rights",
            "A woman walked into a men's room when I was a teen at Disney. She went to a stall to do her thing, but it was the only time eye contact ever happened in a men's room. Every guy there was *uncomfortable* suddenly and we all sort of had to double check we were in the right bathroom suddenly. Even the guys at urinals.\n\nSo, if I had to guess, it's *that feeling* that people want to avoid. Feeling like *you* don't belong. Or you're afraid someone will think something. Every guy has had a jealous girlfriend. And if you have taco bell butt in a unisex bathroom, you don't want to hear accusations when you were just fighting for your life.\n\nFor a woman maybe the idea of being partially clothed around a male stranger bothers them, but I dunno.",
            "Everything is controversial online.\n\nIve got two young girls. I hate gendered toilets. Some dudes clearly don't like when I take the girls in the gents to do their business, but i also feel like women feel some dude shouldn't be in there bathroom either.\n\nPeople need to calm their tits about the issue, it's just a room where you shit and pee.",
            "No one is complaining about single person bathrooms.",
            "Some people, mostly women, are uncomfortable in a (bath)room where men have access. This seems understandable and reasonable. Bad faith actors then weigh in with nonsense comments about plane toilets and home toilets being 'gender neutral ' when they are individual or in your own house and not part of the issue.",
            "You don't even have to go that far. Every restroom in every house is gender neutral. \n\n\nIdeally if stalls were actually private in the US, this wouldn't be a big deal anyway. But stores and businesses get the cheap stalls with large gaps and suddenly it's a societal issue.",
            "Single person vs multiperson situations?",
            "Am I having dejavu? I swear I saw this exact thread with these exact answers the other day?",
            "We want privacy",
            "Do multiple people use the airline lavatory at the same time?",
            "What is the occupancy limit in an airplane washroom? Or a bus or train washroom. One. \n\nDon't know why that's so hard for the gender neutral pushers to grasp.",
            "Single occupancy, you crack baby",
            "Your teenage daughter and her friends go to the mall.  Your daughter goes to the bathroom while her friends shop.  Five men follow her in.  In the current world this is weird and someone would surely say something.  In gender neutral bathroom world nobody bats an eye.\n\nSexist, definitely, but I've seen women go in men's bathrooms to avoid the line and have no problem with it.  Man going in women's bathroom is always a problem. \n\nIn planes and buses people are locked in.  There's one stall.  You're in there alone.",
            "The vast majority that doesn't give a shit doesn't get on a platform to loudly proclaim how much of a shit they don't give.",
            "To put it quite simply, because the vast majority of sexual predators are men, the data clearly shows mixed sex facilities are hotspots for such assaults, especially changing rooms.\n\n\n https://www.independent.co.uk/life-style/women/sexual-assault-unisex-changing-rooms-sunday-times-women-risk-a8519086.html \n\n\n As for bathroom closets with one toilet where one person at a time uses them being unisex I don't think anyone has any issue outside of [NOTHING, MENS PUBLIC TOILETS NEVER REEK OF PISS SO THERE'S NO FUCKING PROBLEM BUT READ THE REPLIES FOR THESIS ON WHO PISSES ON THE FUCKING FLOOR IN PUBLIC TOILETS].",
            "Because most bathrooms in the USA are terrible.",
            "In SFO there are gender neutral bathrooms that are multi-stall, not single stall like in airplanes. And for some people, especially women, it can feel a little weird being in them around a bunch of guys. Especially if you only see guys walk out of them.",
            "It’s only controversial if the bathroom is meant for multiple people at once.",
            "[removed]",
            "As it’s been explained, the issue is multi stall bathrooms, and even then, the issue isn’t even really trans people, it’s perverts that will take advantage. I’m not a statistician, but i’d be willing to wager there are more perverts and pedos in the country than there are trans people. I just use family restrooms when i need to take my daughter to a toilet, but we also avoid all public restrooms like the plague.",
            "In a school setting specifically, I can only guess that children would feel unsafe and uncomfortable using the restroom with the opposite sex around. Thinking back on school years, I barely trusted my own gender (M) inside those facilities. \n\nIf I were a F, I could imagine being afraid that some dude’s gonna come in and harass or molest me. Especially in the US with those shitty stall doors.",
            "Just shows how much privilege most people on Reddit have to not consider ANY possibility for ANY danger. People acting like a bathroom in an airplane is the same as a bathroom in some place where people could be isolated is just such a moronic question.",
            "Also every house has a gender neutral bathroom because they are made for one person to use at a time, the controversy is having males and females using the restroom in the same room at the same time. Kinda the same reason they don’t have gender neutral prisons.",
            "all it takes is once...and honestly with the dredges of human kind. let unisex stalls exist for .2 seconds and some sleazy fuck will ruin it for E V E R Y O N E.",
            "I'm not entirely sure that comparing a completely closed-off, one-person only chamber is comparable to an open, multi-person, doors/dividers not all the way to the ground and ceiling is really a good comparison.\n\nCould a creep get into an airplane bathroom to get access to a potential victim? Certainly, but it'd be fairly difficult, and you have loads of witnesses.\n\nCan a creep get into a stall in a public bathroom to access a potential victim? Very easily, and can probably pull it off without worrying too much about witnesses.\n\nYour comparison lacks nuance.\n\nI'm going to give you the benefit of the doubt and assume you're legitimately asking this question, and not just trying to fish out \"bigots\".",
            "Only one person at a time is going in the plane/bus toilet.",
            "I guess because they aren't shared and single person bathrooms? I dunno.",
            "lack of privacy",
            "[deleted]",
            "No one really cares until the TV man tells them to be mad about it.",
            "I’m old but back when I was young the implied public bathroom rules were as follows. The Men’s room was open to everyone. The Ladies room was for women and girls only.",
            "Last time I checked no one else was in the airplane bathroom with me",
            "Must admit that as a woman I prefer single person toilet/sink room. Walking out with blood all over my hands to use a shared sink space is really embarrassing. Hand sanitizer and TP only help so far. Doing it with guys around adds a new level of embarassment.",
            "Because airplane bathrooms only take one person at a time, there’s also ten other people who can see the bathroom door and can see if two people go in together.",
            "because people like to have something to have a moral panic over mostly",
            "[deleted]",
            "Single bathrooms aren't. It's the multiple stall shared bathroom types people care about",
            "Airplane bathrooms are single person at a time",
            "A valid opinion, yet does it have something to do with airplane and other public transport toilets being single use, and store etc bathrooms not single use.",
            "Because you can only fit one person in an airport and single person bathrooms. Hence why it’s called a single person bathroom.",
            "The argument is about multi-stall bathrooms. Big rooms with multiple toilet stalls, with communal sinks and accessories. Women and men deserve privacy, and designated bathrooms, locker rooms, and changing rooms afford everyone their own privacy. \n\nNo one cares about One-Seaters, because I'm not sharing that space with anyone at the time that I am in them.",
            "Airplanes and such are all single occupancy restrooms.  You can't be in an airplane restroom and have someone of the other gender just walk in.\n\nThis sharing space with other gender while partially unclothed is what the controversy is.\n\nIf I'm standing at a urinal, taking a piss, and some Karen walks in while I'm literally standing there dick in hand.  That's uncomfortable.",
            "Yeah I think that’s the consensus is that single use - fair game for all genders and that multi use bathrooms should remain gendered.\n\nI’m a gay guy and the thought of taking a shit next to a woman does sound a little weird? But not in a “I’m uncomfortable bc of my sexuality and feeling sexually vulnerable” kind of way but rather I’ve been taught to be polite and act a certain way around women and going to the bathroom/pooping next to woman would go against that behavior taught to me. But I understand how weird that sounds.\n\nIn unsure if that’s a flaw though in myself. But just speaking in self reflection.",
            "This sub should be changed to \"No Stupid Questions, But Only Pre-Approved Answers\". This comment section is more scripted than Putin's interview.",
            "Because republicans christians and the g o p fox news machine.",
            "The bathrooms at my job are gender neutral.  Nobody’s complained.",
            "we had coed bathrooms in college, nobody batted an eye.",
            "People hate trans people",
            "Because it's easy to divide and conquer with \"culture war\" issues to keep us from starting a class war.",
            "Because it’s not about bathrooms",
            "Why? Because people are jerks. That’s why.",
            "I think there is a difference of an airplane bathroom being unisex, and they’re little more than a Port-a-potty rather than a bathroom with 5 stalls and multiple people using them at once",
            "Outside of temporary setups such as portable units at outdoor events, it's historically very uncommon to have a multiple stall restroom that isn't segregated by gender.\n\nAs such, it's a new concept to many.",
            "Those are single-room bathroom, not bathrooms with multiple stalls and urinals. Nobody wants to replace all multi-stall bathrooms with individual rooms because it would significantly reduce the number of toilets in the same space (meaning longer lines).",
            "Single person bathroom.... Wow OP",
            "Single person?",
            "Single stall vs shared stalls.  Gender neutral bathrooms are called family bathrooms.",
            "They’re also single use.",
            "You are arguing single person bathrooms vs. bathrooms with a higher capacity. One you are by yourself, the other you share with others...\n\nNo one cares if a little boy or girl goes into the single use bathroom. But people start caring when a little girl is sharing a bathroom with a man.",
            "It wasn't about water fountains then and it isn't about bathrooms now. ",
            "I think its because it would be to accommodate so few. Only about 7% of the US at least are gay bi or trans. That means just over 1% of Americans would actually benefit from the bathroom thing. The amount of people benifitting wouldn’t outweigh the risks for a lot of people. Risks meaning, a bathroom where any man can be going into a bathroom area with women is generally unsafe of an idea for the women. In most cases to change or implement things for only 1% of a country’s people  will get lots of blow back. For reference of amount of people, \nblack people are about 12% of the US.",
            "Well for obvious reasons single stall bathroom are not the same as community bathrooms, as this is a painfully obvious point to include. \n\nRegarding gender bathroom they were introduced during the civil rights movement for females who felt unsafe in bathrooms with males. \n\nFunding and regulation created separate bathrooms for male/females.",
            "The only gender neutral bathrooms that are controversial are the ones that have multiple stalls or urinals in them.",
            "One has multiple people in it, the other doesn’t",
            "Because I don't wanna wait in a huge line to use a bathroom because women take forever, when mens have two toilets your in trouble during intermission.",
            "I've never seen anything about gender neutral bathrooms being controversial. They are a good option for people who don't wish to use male or female bathrooms.\n\nThe controversy is more evident (and well publicised) where males are accessing women's bathrooms and taking photographs of women and girls or exposing themselves.",
            "The men's/women's public bathroom was created 100- 200 years ago because women of that time period didn't feel comfortable sharing a multi-person bathroom with men.\n\n\n\n\nA lot of western women no longer have that apprehension, and parents can find them extremely inconvenient when taking their kids out in public without their spouse.\n\n\n\n\nA lot of women also use the men's room when the line to the women's room is too long just to give  an example of how comfortable many modern western women are with sharing public bathrooms with men.\n\n\n\n\nA lot of the pushback from them come from men. Men mainly use urinals and gender neutral bathrooms won't have them. Some thing like 5% of men will not shit in a public restroom, and ¾ will hold it unless it's an absolute emergency. So a lot of men are not using public stalls to pee or poop and they don't want to start.\n\n\n\n\nI was at a hockey game one time were the men's bathroom had a literal trough for you to pee in. Gender neutral bathrooms will speed up the phasing out of those kind of things, and they'll turn into the women's bathroom were any type of concert or club or venue will have annoying long lines.",
            "Having floor to ceiling walls and doors, with only a shared don’t area, is great. It’s never comfortable seeing someone’s shoes next to you, or hearing/ smelling what’s going on next to you. I’d like this to be a universal thing. The only positive I can see in keeping separate total areas, is that those who stand to pee, spend much less time in the bathroom overall. Of course, we sacrifice any sort of privacy; peeing shoulder to shoulder with others.",
            "Pax East, for the last few years, has had one of the bathroom pairs that were typically men/women re-labeled as unisex. Granted, that was just one pair of bathrooms in the whole convention hall that has a TON of bathrooms and the rest remain male/female. However, I've never heard any incidents from the one pair that were unisex.",
            "It's because American stalls are not the most private, and can easily be broken into.\n\nIf they were actually little private locking rooms, there really wouldn't be an issue.",
            "public transport is also controversial\n\nPeople like their cars",
            "Because US toilet cubicles are crap. You can see through them. Theres like 1 to 2 cm space between the door and the wall.\n\n\nOh and the gap to crawl underneath is like huge. I have always wondered of its due to potential lawsuits.\n\n\nI swear. I feel so incomfortable in US bathrooms, all female or not.\n\n\nAnyway isnt so much a problem in Europe. We have proper bathrooms that can shut. ",
            "It's a controversy looking for a target",
            "Because they label them gender neutral instead of just putting bathroom....",
            "Bathrooms should be divided by urinal or toilet. ",
            "It's a problem manufactured by politicians so they have a boogyman to fight.",
            "Literally, just have stalls everywhere and there would not be a problem",
            "I work in a gay bar for reference.\n\nWe have bathrooms that allow both. We ar usually full with people. Plenty of bright lights in the bathroom. You can go to the restroom as a guy and be washing your hands next to women. In a perfect world( my bar with security) it works fine\n\n\nWomen's (understandable) and conservatives non understandable issue would be sexual assault. If It's normal as a man I can be in restrooms with women, it can make them not feel safe. If I were a rapist I could close the door, and force my way into their stall. Or they could wait outside of the stall and force a women back into it.\n\n\nI'm not against the idea and I think it's cool where I work but I also work in a big city where I certain fuckingly want that. Other areas this would probably be really bad would be like a gym.\n\n\nI do want to ensure we understand these are not single person restrooms. I don't think anyone has an issue with the idea Porta potties aren't coming in twos, one for each gender.",
            "I personally dont understand it, at my school all the bathrooms are gender neutral, with shared basin areas etc and i honestly feel way safer than I did in single sex bathrooms.",
            "[deleted]",
            "Culture War profiteers",
            "Because people are spiteful bigots and hate filled. I don't like them because I don't want to have to sit on piss or shit but thats my only gripe. I think there should always be 3 of them.",
            "They’re only controversial in the tiny minds of conservative cunts",
            "Because, apparently, this world values outrage over common fucking sense and I’m just exhausted.",
            "I saw my first gender neutral bathroom in Belgium in 1987. When people have an individual stall, what's the problem other than realizing many men don't know wash their hands after doing their business?",
            "We had unisex and we had no issues. Then they rebranded them and we find the reason to be dumb as fuck.",
            "Cause people will always find something to complain about and it's usually the most trivial of things",
            "It's not even just airplanes... I'm 34 and \"unisex\" bathrooms have been a thing since I was a kid. But for some ideological reason, we started calling them \"gender neutral\" and the dumbest people on the planet (American conservatives) started losing their collective minds as if they're a new thing. Sort of like how they're suddenly pretending they can't wrap their heads around the concept of \"they\" as a singular pronoun despite it being used that way since the word has been invented.",
            "Because republicans think that the priest they take their children to weekly might show up in the bathroom",
            "SeaTac airport has a good design for genderless bathrooms. The urinals are basically in their own little room with a sliding door behind the stall area. The stalls also have actual full doors with proper locks.",
            "It's fake controversy to keep the rubes distracted"
        ]
    },
    {
        "post_id": "mjcexv",
        "author": "None",
        "title": "Is it weird to go eat in a fancy restaurant alone?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/mjcexv/is_it_weird_to_go_eat_in_a_fancy_restaurant_alone/",
        "score": 22908,
        "num_comments": 3319,
        "created_utc": 1617469069.0,
        "selftext": "My birthday is on Wednesday, which thankfully is a day off from work. so I was thinking of going to Cheesecake Factory or something, but I don’t have any friends, not even a boyfriend, so I decided that I want to just spend the day and eat outside because I love restaurants and I love food.\n\nIs it normal?",
        "permalink": "/r/NoStupidQuestions/comments/mjcexv/is_it_weird_to_go_eat_in_a_fancy_restaurant_alone/",
        "comments": [
            "I don't know if this is a cultural difference but it wouldn't occur to me that going to have a nice meal alone is supposed to be weird. Knock yourself out and enjoy yourself!",
            "I used to travel a lot of work, so eating alone was just so normal to me. I tend to try to sit at the bar and just relax with a beer but I’ve eaten in booths alone as well. I love it. I get to enjoy a good meal and not have to say a word lol",
            "Do it!  You might feel weird at first, but that goes away.  And I think you'll start to notice more just how *many* people do this.  I spent a year in a city where I didn't know anyone, took myself out to plenty meals alone.  No one thinks you're weird!",
            "What is weird? Just do you, friend. Nobody gives a fuck.\n\nCan you imagine someone going home still thinking about that guy that ate alone at a restaurant? Who's the fucking weird one now?",
            "I love taking myself on dates!",
            "Whoa that’s a lot of comments! You guys!! I can’t respond to every comment here but I just wanted to say that you’re all so pushing it’s so sweet and adorable to see! I’m definitely convinced I’m going now! I can’t wait for Wednesday! I can’t wait to fill my belly up! I love food especially when the day is my birthday!",
            "I work at a fancy restaurant. It's very typical to see people eating alone. You shouldn't overthink it :)",
            "There are plenty of people who do that.  It's way better than sitting at home browsing reddit on a day you have off.",
            "No, go for it.  \n\n\nA couple years ago, I did a variation of Shonda Rhime's \"Year of Yes\"... there were many things I didn't do because I didn't have someone to go with. And I said, screw it. Bands, sporting events, checking out a new restaurant, I didn't wait for someone to offer \"permission\" by agreeing to go. And it was a great year full of great times and helped me out mentally a lot.",
            "[deleted]",
            "My birthday is also Wednesday, and it's my day off. I'll be there with you in spirit!",
            "Do it. I used to eat at restaurants alone occasionally before I met my wife. I’d take a good book with me and read, eat, read, eat, and people watch.",
            "File this under important self care, you deserve it!",
            "This needs to be normalized.",
            "Why should it be weird doing something alone in times of social distancing?",
            "To be honest, if I'm out to eat I don't really notice who's at other tables. You're probably fine",
            "Just go sit at the bar. Perfectly normal.",
            "Doing things alone is seriously under-rated. Go for it, treat yo-self!",
            "I was once solo travelling in Barcelona, (I don't speak a word of Spanish).I wanted to try a really great paella, but the restaurant recommended was fancy! And I wasn't dressed well, I try to be as comfortable as possible when I travel. I really hesitated and felt embarrassed, alone and not dressed well? The waiters were wearing suits! \n\nI usually don't care about this stuff, but I felt the same as you because the place was indeed fancy. I gathered my courage and all the lady balls I have and just went in, casually, saying: one person please!\n\nI enjoyed the amazing paella and dessert too",
            "I've been out to plenty of meals by myself when I was single. You do you. \n\nThis whole idea of people judging anyone eating is dumb and not really a thing. Honestly it's never crossed my mind to look at other people eating food wherever and even consider whether they are alone or with someone. Who cares that much about total strangers lives?  I'm there to eat and enjoy myself. Honestly I wouldn't even notice if the whole restraunt was people on there own because my brain doesn't care enough to process unimportant shit like that.",
            "Not at all! Keanu Reeves regularly treats himself to nice meals (and lots of nice things) all the time, that man is a fucking inspiration, he actually talks about that pretty regularly too. He's the reason I learned that being alone is not the big curse everyone thinks it is.\n\nEdit: Just to appease the few who replied/messaged me with negative stuff, I'm not some loner whose never been with anyone, I'm coming off the back of a rough break up in August (that I'm now very happily past and much happier for) and a divorce (10 years married) a year prior to that relationship. Decided to stay off the circuit for a while so I can fix my mental health (doing much better!), be there for my kids and focus on uni. Like I said, being alone isn't a curse, you don't have to be lonely just because you're not with someone, you have yourself and it can be incredibly healing.",
            "Do it! Sit at the bar if that feels less awkward, but go enjoy your day and don't worry about others.",
            "Completely. I do it all the time. I love Red Lobster(semi fancy, but really just expensive). I go there every other week and spend near or over $100 on myself everytime. It's a way to treat myself. Fuck the idea of having to spend time with other people all the time. It's nice to just have time to yourself even if it's eating somewhere you've always wanted to",
            "**Normalize eating alone in restaurants** \n\nI file it under “self-care,” do it!!!",
            "I used to love to take myself out to eat- literal 5 star restaurants, $100-200/plate with wine. It makes you more confident I swear. Save up, test yourself, no one thinks it’s the least bit weird I promise",
            "I’ve done this the last few years, and in doing so I found a place that offered me the best banana pudding. And I don’t even like bananas! \n\nHappy birthday, fellow Aries and April birthday person!",
            "I’d order it to go, but that’s only because the less time I have to spend in a bra, the better.",
            "I do it all the time. The older I got, the less I cared about what people think. Theres nothing wrong with it if you truly enjoy it.",
            "Nah it's cool. The only thing I won't eat alone is korean bbq",
            "Not weird at all. I eat out quite a bit by myself when I travel for work. Ive even taken myself out for birthday breakfast alone. I enjoy chilling by myself.\n\nEdit: I've even gone to the Cheesecakr Factory alone. Don't have one near home, so when there was one down the street from my hotel I didn't miss the chance to try it.",
            "Definitely do it. I did this once by mistake. \n\nI had to go see a stage production live to review it and showed up 45 min before the show but I didn't eat dinner. So walked into the first restaurant I saw and straight away realised I didn't belong there (I was the only one not wearing \"fancy\" shoes.) There was a piano player playing all night and a bar in the centre of the restaurant that looked like a gateway to heaven. \n\nThe waiter still seated me and I explained I was in a rush. He assured me my meal will be done as soon as possible. I did order the cheapest thing on the menu (which was still Hella expensive) so I wasn't expecting much. \n\nI went to have a smoke in the cigar lounge and everyone there had different accents and dressed amazingly. I was only half way with my cigarette when I saw my waiter bring my food to the table. It took them 10min. I was expecting the food to be average considering the amount of time it took to make, but still to this day, it was the best meal I've ever had. \n\nPoint being, fancy restaurants are definitely worth going to, but they are even more interesting if you're alone in my opinion. You can people watch and really feel like a badass even though you couldn't afford dessert. \n\nTLRD: I went to a fancy restaurant by myself, paid a lot of money, but still had an amazing time.",
            "Do it. \n\nI use to serve and bartend. A lot of young guys girl would go and eat expensive dinners and a few drinks while just chilling. \n\nIt's just a great time to relax and escape from  the stress of home",
            "Normal? Dont limit yourself because of other people, we are all idiots. Enjoy yourself",
            "I’ve done this multiple times - because I want good food without without socialising",
            "Being a forever aloner I have eaten at many places single. It might be weird the first couple of times but it really doesn't matter",
            "My birthday is on Wednesday too! No, I don’t think it’s weird at all. I’ve had plenty of birthdays where I did stuff alone. Do what you want!!",
            "Totally normal to dine alone. The universal signal that you'll be dining alone is to carry a newspaper tucked under your arm.",
            "GO!! I've done this so many times. If I'm being honest, sure it can be a little awkward at first but I never let that stop me because why should I care what these people who I will never see again think? The servers are always extra nice to you so that's a plus lol.\n\n\nTake a book with you if you're worried about sitting there alone and having nothing to do. If you're lucky someone might even come strike up a conversation with you :) (this would actually be a nightmare for my introverted ass, but maybe it's something you'd be cool with) \n\n\nI hope you have a wonderful birthday-- whatever you choose to do!",
            "Don’t worry what others think. Just do what makes YOU happy.",
            "Eating alone in a restaurant is pure joy. You do exactly what you want, order what you want, eat as fast as you want. I mean, it's great.\n\nIf you are worried about feeling uncomfortable bring a book or a magazine to read. It's really not that uncommon.",
            "Nobody knows it’s your birthday but you. People who travel for business go out alone all the time. It’s not as uncommon as it feels",
            "Literally no one will give a fuck. Just like you, everyone is super concerned with themselves and won't really focus on anything outside of themselves. You're worrying that eating in a restaurant alone is weird, grandma nancy over there is wondering if her earrings are right for her attire, sam over at the bar is wondering if people are judging him for his girly cocktail (NO SAM COCKTAILS DON'T HAVE A GENDER ENJOY WHAT YOU LIKE), sally and billy over there are both wondering if people think they're in a relationship (THEY'RE JUST SIBLINGS). Hell, even the server doesn't really give a shit about you, they're focusing on doing their best possible job so that they can get a tip and earn a living wage.   \n\n\nThe long and short of it is, no one will even notice you. So fuckin go crazy. Order something funky and live it up.",
            "Woah are you sure you’ll be able to book a rez at Cheesecake Factory on such short notice? Is your tux ironed?",
            "Cheesecake Factory is like a 3/10 on the fancy scale FYI",
            "I haven’t been to one in over a decade, but I don’t think I’d consider Cheesecake Factory a “fancy restaurant”. Either way do whatever you want. Nobody will remember you after they leave the restaurant.",
            "You do you! You're allowed to treat yourself sometimes.\n\nCheesecake Factory though? I'll admit I judge you a little (just a little) for that choice. But hey, if you like Cheesecake Factory? It's your effin' birthday and you get to do what makes you happy.",
            "Is that a fancy restaurant?",
            "I travel for work and most of my meals are by myself at restaurants. It might feel weird at first, but you do you. I like to sit at the bar (in states where that's allowed) and chat with strangers, I've met a lot of interesting people that way",
            "Go for it! If anything just sit at the bar. Normally people who sit at the bar are by themselves too and everyone is pretty friendly. If you’re nervous about it take a book. \n\nI started doing stuff like this by myself a few years ago after my last girlfriend and I broke up. And it’s honestly amazing",
            "If you ever wind up traveling for work, you'll wind up going to restaurants alone a lot.\n\nIt's not that weird",
            "No it's not weird. You have to treat yo self every now and then.",
            "Happy birthday to you, fellow April 7th birthday person! It's something that comes with experience being comfortable eating alone at a nice restaurant. \n\nI'd recommend bringing a favorite book if you'll be dining outside. Bring your phone too just to have if you need it. Order whatever the hell you want and enjoy every bite! I'll be doing the same this week. It's so peaceful to eat alone.",
            "Tbh most people don't really think much of seeing someone sitting alone in a restaurant or going to a movie alone - I worked in a theater for 4 years and people did it constantly and honestly my only thought was always \"Oh thank f*ck I only have to clean one persons worth of crap!\" - it was never \"Dude what a weirdo.\" Go for it!",
            "Eating alone is great. Do it",
            "Totally normal, and I would go with you!    I love the Cheesecake Factory.",
            "every wednesday i like to go out and have lunch by myself and then go to guitar center to play all the instruments. so peaceful and relaxing. treat yourself, have fun, and happy birthday!",
            "take a note pad with you, write things down and they'll think you're a food critic!",
            "I can eat my dinner in a fancy restaurant...",
            "Just remember what Momma Ru always says, “If you can't love yourself how in the hell are you gonna love somebody else?”",
            "Do it. With confidence. It's OK and completely normal. Also Happy Birthday!",
            "Nope, I do it all the time. I normally take a book.",
            "Anyone who does it should be praised for great bravery. Also confidence is the best thing anyone can have so props to you!",
            "There are OTHER ways to do it?",
            "I wouldn’t consider Cheesecake Factory fancy but yes!!! I love going to eat alone just as much as eating with my husband!",
            "yes. also cheesecake factory is far from fancy lol",
            "Bring a book! I love eating alone at restaurants and reading an actual book!",
            "Bartender here. Sit at the bar if you want to have someone to make light conversation with. Give a $10 tip right off the bat. See if they have any drink recommendations, and food recommendations. Bartenders usually have been there a while since it's usually a promoted position. They love to chat especially when they know you tip. It's a fun way to have conversation, a yummy meal, and not feel alone",
            "Is it normal to think the Cheesecake Factory is a fancy restaurant?",
            "The Cheesecake Factory is not a fancy restaurant. For a very similar price, you can dine at a MUCH better place. Cheesecake Factory is a half step above fast food alongside TGI Fridays and Applebee's. It's comfort food for boomers that gets microwaved and served to you.",
            "That's what the Bar is for.",
            "Completely normal! Hope you have a great time and enjoy some good food!",
            "Self dates are important! I usually bring a book to read as well, but not weird at all, and as a server its still common for someone to come in on their own, i see it all the time:) though if you go to a fancy place they may seat you at the bar if its a busy night",
            "It is not weird! Treat yourself :)",
            "I would say it is weirder to consider CF a fancy restaurant.  \n  \nReal talk though, I love eating alone.",
            "If you feel like it, it’s absolutely fine. Nice even. If someone thinks it’s weird, it’s their problem, not yours. They only would say that because they have a need to do so stemming from their own (psychological) issues. That the case with a lot of things.",
            "Do it. It’s awesome once you get the initial awkwardness out of the way.",
            "I really miss being able to do this. Happy birthday. Have fun!!",
            "During my relatively small adulthood, I have never gone to restaurants with someone, aside from dates and one single case where a friend asked me if I was hungry. Indeed, 'twas weird as hell for me, like what are we supposed to do when we are eating? Talk, start a staring contest, try to eat our food faster than another? I generally don't like to eat with other people and no one has ever pointed at me and laugh no matter if it's a fancy restaurant or just a simple place that serves kebab and only kebab.\n\nJust do it. If people judge you, it's their own personal hell to go through, why on earth they would do something like that.",
            "who cares if its normal.. life is short do whatever you want!",
            "No, it’s not weird. It’s important to be able spend time alone, and being comfortable doing so will make things like travel a lot easier and more fun if you don’t depend on others to feel “normal” while doing something as mundane as eating",
            "Who gives a shit. Live your best life 💪🏼",
            "Go for it! And don't settle for take out. Enjoy a day doing what you love it's your birthday and no one will see you weird for it",
            "I always take my birthday off work. I figure I'd prefer not to get pissed, of and the place most likely to piss me off is work.\n\nI also like to go get food I like for my birthday. I used to go to this arepa place in the city. I tend to rotate my go-to depending on what I'm really craving.\n\nIt's your day. You get to do whatever the heck you want.",
            "I dont think it's weird at all :) I remember the first movie I went to see by myself... I left feeling so liberated! Treat yourself! Happy birthday :)",
            "It’s normal. And it’s awesome. Happy birthday!",
            "I think it can look badass tbh especially if you dress as fancy as possible",
            "When I'm in a simmila situation I just say to myself \"I dont give a fuck what this people who I dont know think of me\" and most likely they actually dont care so there is that.\n\nAlso happy birthday.",
            "“Treat yo self”",
            "Not weird! I do this quite often. It’s good to spend time with your self. It may be awkward at first, but it gets easier and so worth it!",
            "Just some regular me-time, not weird at all!",
            "Absolutely not!  Enjoy yourself!",
            "Think of it this way. If you saw someone go to a restaurant and eat alone, would you notice, or think of anything? No, why would others do that to you?",
            "It is absolutely normal, enjoy yourself and happy birthday!",
            "This is super sweet. In the immortal words of Gregory Jacobs, Dowhatchalike.",
            "I've been waiting tables for a decade and I've never even had a second thought about someone eating alone. I just think oh there's a new table to greet and nothing more. Now go treat yo self.",
            "do you! i'm sure you will love it! (we should 100% normalize doing things alone)",
            "Hell yes, my birthday is on Thursday and doing the exact same thing. Treat yo self",
            "Yeah, it’s normal and more common than you’d think. I used to solo travel a ton for work and would eat out by myself all the time. If you feel a little weird you could eat in the bar area (if they have one), you definitely won’t be the only solo-diner there.",
            "As others have said: **Do it.**\n\nAs no one else seems to have said yet: **Dress up**, too.  Nice dress or jacket/tie.\n\nNext effing level: Do you carry a bag of some type?: Take a small vase, buy yourself a single rose, and set them up on the table after you're seated!",
            "People eat alone all the time, for whatever reason. For example, my partner is vegetarian and sometimes I just want a steak. So sometimes, I just go out to a steak restaurant on my own and just have a steak and a nice glass of red.",
            "If you’re uncomfortable at sitting at a table by yourself, seek out a seat at the bar. Less awkward, faster service and fun to see bartenders in action.",
            "Go ahead. Cheesecake is my fav! Can i come?",
            "I have learned that purple are thinking/worrying about themselves too much to care what you are doing. They might look for a second but they go back to thinking about themselves real quick.",
            "Who cares if it's normal?\n\nNo seriously, who cares?If it's your birthday, it's a time for celebrating that you're alive.And doing something special on your birthday - like going to Cheesecake Factory - is the best way to celebrate being alive IMO\n\nIf anyone looks at you weird, just say \"it's my birthday, you're allowed to be 'weird' on your birthday\". x)\n\nHope you have a great day no matter what you choose to do! :D",
            "I do it some times.  It's kind of weird.  I enjoy it anyway.",
            "Self love is important! Treat yourself",
            "Go for it! If you fee uncomfortable, you can always sit up at the bar and order a meal. Treat yourself and early happy birthday!",
            "Former server for the Ritz here. \n\nCompletely normal experience to go eat a nice meal wherever you want. Doesn't matter where. I regularly had single diners at my tables. \n\nIf it's not busy and you're in the mood for convo, chat up your server or another patron that's dining alone. It's really not that abnormal.",
            "Yes, but its also pretty awesome and doing harmless things that you want to do despite social norms makes you a cool person in my book.",
            "Not weird at all. When instated becoming more comfortable doing things on my own I was surprised how freeing it was.",
            "It’s way more commonly seen in cities... that said, certainly normal",
            "Not weird at all! I love going out to eat alone because then I can go wherever I want and get whatever I want. It’s fun to have company too of course but no it’s not weird. 😊",
            "Please do it! You’ll enjoy yourself. Take a tablet if you want for something to view. I solo travel and dine and always enjoy my time. You mentioned eating outside. Eating at a restaurant bar is also pleasurable.",
            "I don't understand why people think it's weird in the first place. \n\nI started eating alone when I was in elementary school - a Chinese restaurant opened in my hometown, and I thought it was SUPER-EXOTIC. A couple times a week I'd skip lunch and walk to the Chinese place after school and get a bowl of wonton soup by myself. We moved when I was a teenager, and there was a Wendy's with a Superbar within easy walking distance of my house. A couple years later I turned 16 and got a car, and would sometimes stop somewhere while running errands or whatnot. Then I went to a commuter university where people didn't bother getting to know each other - the student center cafeteria would mostly be people sitting alone. Then I got several jobs at MSPs (IT companies you hire to do IT stuff for your company if you aren't big enough to have a dedicated IT department). I drove from place to place fixing computers all day, so my choice was \"eat alone\" or \"don't eat at all\". And there were occasional solo business trips, too. \n\nLong story short, my wife thinks eating alone is the weirdest, saddest thing ever, but I've been doing it for 40+ years and don't think it's weird at all. I *prefer* company, of course, but don't mind eating alone.",
            "Nope.  I am my favorite person.  Why relegate me to the places to the places I take trashy friends?",
            "I used to do it all the time. Especially when I travel alone, I often get better service from the servers.\n\nAlso, happy fucking birthday! You’re awesome!",
            "Just order 2 of everything and you'll feel like there's someone there AND have leftovers!",
            "It sounds like a great idea, and happy birthday! I hope that you have a prosperous and peaceful year to come.",
            "It’s actually really luxurious hanging by yourself sometimes. \n\nYou get to do everything you want without having to take someone else’s wants into consideration.\n\nJust treat yourself and have fun!",
            "I work as a travel tech. The pay is good, but lots of lonely dinners on the road. Nothing wrong with sitting down for a good meal by yourself. Sometimes I find it easier to eat at the bar when I’m alone.",
            "It shouldn't be. We should normalize doing things alone. I LOVE going to the movie theater alone!",
            "TREAT YO SELF👉👉",
            "I usually order the food to go and take it back to the room where I proceed to eat it with my hands.",
            "We share a birthday! I hope you enjoy yours, treat yourself at cheesecake factory! Buy two slices and eat your favorite, then take the other one home for later.",
            "We share a birthday! Happy birthday to us!",
            "Do you really care about the opinion of someone who would judge you for simply existing?",
            "My birthday is on Wednesday as well, I'll go with you.  This way you don't have to worry about being seen as weird and more about awkward conversation with someone you don't know!",
            "Do it! As a mother with two little kids, it would be sheer bliss to go out to dinner alone. Enjoy and happy birthday!!!",
            "you don't sound lonely to me, as you seem comfortable with yourself. Some people depend on the company of others to feel good, which I personally think is unhealthy. And also, eating in solitude at a restaurant is perhaps the most adult thing you can possibly do.",
            "You could always live stream it and take us with you!  Not try'na invite myself, but I'd go there with you thatta way!",
            "Bring your laptop and headphones, then we can have a zoom happy birthday dinner with you 🎂💐🎉",
            "Nothing wrong with dining alone. There is no rule you can only dine with another person/people. There is never a good reason to sit home doing nothing simply because you cannot find company to go with you. \n\nHappy birthday, fellow Aries. Mine is the day after yours :)",
            "No not at all, why should you miss out on great experiences just because you are alone? Maybe you'll even meet a new friend :D",
            "Here's the thing, it isn't weird, but it definitely FEELS weird! I used to go out to eat on my own from time to time and often I would cut my own embarrassment with humor. \"Just one?\" \"Yup! I'm today's token loser!\" However, it's really nothing to be down or weird about, no one cares and everyone needs to get out of the house from time to time. \\^.\\^",
            "Yes. People should learn to enjoy do stuff alone, or appreciate solitude.",
            "yes. If you still haven't find a way to your true self, and construct your reality by copying behavior of others, then yes, it will be weird for you to eat there alone. If you manage to get to know yourself in the course of your life, then you will go sit down there and have a nice dinner with yourself.",
            "You deserve to have a good dinner and a happy birthday! The Cheesecake Factory is never a bad idea anyways.",
            "I’m a single parent, and sometimes when the kids are with Dad, I do a me date. I go where I want to go, eat where I want to eat. I read, listen to music or browse Reddit while I eat.  It was awkward at first, but it’s actually less lonely than being in the normally busy house alone.  I can take my time if the restaurant isn’t busy (but I always tip accordingly if I stay longer). I can nurse a drink, people-watch.  It’s now something I do monthly. Doing it right now, actually! It’s a sort of reset for me.",
            "You should never ever be stopped to do something you want because of strangers that doesn’t even know you. Many people go out alone and you should go out of your comfort zone more and more.",
            "Can I go with you?",
            "Do it! I was in Bratislava two years ago, during the ice hockey championchips. I worked for a TV Broadcaster. It was my birthday and i was all alone in a country where i wasn‘t even speaking the language of. Woke up early, took a walk in the rain, ordered steak and whisky for lunch and got myself a nice piece of cake in a very pittoreske cafe afterwards. Took the time to think about myself, how i got there and what it means to be there, enjoying my own company. It was a very peaceful afternoon. You should totally do it. I think it is very important to be able to feel comfortable all alone. That you value your own company.",
            "This is probably going to go unnoticed after how many other people have replied already - but my grandpa once told me that one of the things he missed about being a bachelor was going to restaurants with a good book and just spending a few hours there, having a meal (or two sometimes) and just being taken care of somewhere comfy.\n\nI did it once myself. It was actually pretty damn relaxing. Consider it a type of spa day.",
            "I don’t think it’s weird to eat alone. Treat yourself! Enjoy yourself and hope you have an amazing Birthday!",
            "No way.  I travel for work all the time (3-4 months a year before covid hit) and I eat at nice restaurants by myself all the time.  Enjoy it!  I bring a book sometimes or sit at the bar if I feel like chatting.",
            "It doesn't matter if it's normal or not if you feel like doing it and it hurt nobody and is legal.",
            "Just think about how you’d feel seeing someone eating alone. Would you care?",
            "Fuck no!!! I eat alone all the time and go everywhere a lot alone! If I want food I go get it or if I wanna smoke a cigar I go! I’m not waiting on people to enjoy things in my life!",
            "are you kidding me, I’ll go do that right now. sounds like a dream, not having to talk to anyone but the waiter, not being judged by what I order, able to stuff my face with cheesecake until I’m sick. hell yes dude, go in there and have the best time ever! also Happy Birthday!",
            "Happy early birthday. 🎂\n\nSorry no advice on the question. I’m still to scared of covid to go out to restaurants in person just ordering takeout.  I do hope you have a good birthday whatever you decide. \n\nGo where you want to make ü happy.",
            "People who think it's weird to do stuff alone and judge others are the weird ones.",
            "You have already made your decision on what you want to do. So who cares what anybody else thinks? It’s your birthday, it’s what you want to do! So do it and be happy and proud. Happy Birthday btw :)",
            "Happy Birthday OP; enjoy your meal!",
            "At 910 comments, I doubt you'll ever see this, but no, it is not weird to take yourself out to lunch or dinner. I do it weekly. I don't have anyone in my life, and there are too many experiences to not enjoy in addition to having to sit around lonely. I invite friends, but at the end of the day all I have is me, and I must be enough for myself. If no one else is gonna treat me right, I'll have to do it for myself. Go out and have a fancy dinner. Enjoy yourself. Get away from the troubles in your world. Be sure to tip.",
            "All of the best dining experiences of my life have been solo. When I treat myself to fine dining, going solo is great because you can focus on the food, the service,  the ambiance. And since I am only paying for one, I can order whatever I want and just go crazy. I once dropped $250 on a meal for myself. It was absolutely worth it.",
            "It's not weird to do anything alone.",
            "One of the best meals I ever had was alone at a fancy restaurant on the water in San Diego. I will never forget it!",
            "Hey, we're birthday buddies! :) \n\nI'd say just go for it and treat yourself. Sitting inside all day is no good and it won't make you happy, that's for sure. Take yourself on a date and enjoy! Don't worry too much what other people in the restaurant might think. Their opinions don't really matter anyway.",
            "Sit in the corner mysteriously and pretend they call you Strider",
            "Dude they will just think you are a food critic or a travelling busniness man",
            "It’s weird to judge people, that’s weird. Live your live, in fact do it for all the people who wish they could go out to a restaurant.",
            "Not weird, it’s glorious! Take yourself on a date, treat yourself and have a wonderful meal. Happy Birthday!",
            "I eat alone a long but never at a fancy restaurant. I remember going IHOP once and the waitress kept teasing me",
            "I'm a flight attendant. I've gone to plenty of restaurants at hotels or just that I come across completely solo. It's not strange at all!",
            "Honestly I’ve been thinking this same thing OP but the more I think about it, the more fun it sounds to take yourself out to dinner or go to the movies etc! You don’t have to worry about making sure people arrive on time and splitting bills and all that stuff! I’d be doing this now if it weren’t for the fact that most/all restaurants & cinemas are still closed due to covid :/",
            "I don't goto fancy restaurants alone cus I'm poor af. But McDonald's, or subway, yeah absolutely. I also goto movies alone.",
            "You are in a relationship with yourself for the rest of your life. Treat yourself, and go eat out at a fancy restaurant😊",
            "Dine at the bar it’s more fun",
            "Dude. This whole doing shit alone stigma is whack.\n\nI used to feel weird for even thinking about it.\n\nI'm all about it now. Away from the kids and wife. Movies, resteraunts, walks. Hell...I'm camping right now with just me and my dog and some beer. In absolute heaven!",
            "My birthday’s on Wednesday too!  April 7th in the house!!",
            "Who cares. You're a paying customer.",
            "It’s not weird! I didn’t even realize some people felt odd about it. Every time you’re hungry you’re supposed to have friends that are hungry too? I used to work on Miami Beach, which has an excellent culinary scene, and I frequently walked to new restaurants during my lunch break to try new places. It was awesome! I would read or watch YouTube videos, and just enjoy my time.",
            "No it’s not weird at all, but don’t underestimate the divine satisfaction of getting a steak and potatoes for takeout and eating it in bed",
            "Do it!!! Tomorrow is my birthday and i also have no one to celebrate with besides myself. Make the best of it and do what you want to. I ate alone in a restaurant for the first time ever last week and it was a good feeling. I took myself out to breakfast.",
            "Don't go to cheesecake factory... ive heard some disgusting things on their cleanliness from people that have worked there. They are also overly priced.. go somewhere local and support the small guys instead 😊 To answer your question, it's not weird at all and a lot of times I, a 27 year old chick, go to bars and restaurants alone a good amount.",
            "No it’s not! Happy early birthday!!",
            "Eating alone is an amazing indulgence and my favorite way to spend time appreciating my own company. It helps you find confidence and grace. Do it.",
            "This is going to get buried, but it’s one of my favorite things to do. Pre covid times, I would tell my fiancé to kick rocks while I took myself to a nice restaurant and a movie. Just read, look at my phone, have a couple good drinks, and then go watch whatever was in theaters. You don’t have to worry about anyone not liking the restaurant nor the movie. It’s so relaxing. \n\nHeck, sometimes I’d dress nicely too. Just feels good",
            "Beware: doing this will make you look self-confident and that you don’t really care what others think. \n\n(**Do**. **It**. **!**)",
            "The Cheesecake Factory is not a fancy restaurant, and no it’s not weird.",
            "It’s weird to think Cheesecake Factory is a fancy restaurant.",
            "No. And it's cheaper.",
            "Not weird. Nothing wrong to treat yourself. Matter of fact, I'd like to pick up your tab.",
            "Do it all the time. It’s only weird if you think it’s weird.",
            "A. Who cares what's \"normal.\"\nB. You do you! I love eating at a restaurant alone. Before Covid it was something I did often and I have lots of friends and a boyfriend.",
            "I love going alone. I like pretending all the staff thinks I am one of those secret Michelin star food critics",
            "Ask yourself if you've ever noticed anyone dining alone. I'm going to guess probably not, even though it happens all the time.\n\nJust have a seat at the bar, or a small table, have some food and a cocktail or two, chat with the bartender if you want, and enjoy your meal. You deserve it.",
            "Honestly it is an experience you can easily enjoy alone.\n\nThere is nothing weird to go to restaurant alone.",
            "I live alone, I’m single, and I eat in nice restaurants by myself all the time.  I enjoy spending my alone time doing the same things I would do with someone.  I have been on vacations, restaurants, movies, art gallery openings, the ballet...all by myself.  I get to do anything I want and don’t have to negotiate.",
            "I used to do it all the time, and I’d bring a book, wear my Sunday best, and just enjoy the finer things life has to offer.",
            "This is one of my favorite me time activities.  I usually have a book.  I let the waiter know I’m done and would like to sit a bit.  I make sure I tip well to make sure the waiter isn’t getting hosed with me lingering, and leave if I’m they are busy.",
            "Absolutely do this! Enjoy yourself and what you are doing \"in the moment\" you may notice someone you want to talk to along the way.",
            "Perfectly normal. People on trips for business or single people traveling do it all the time.",
            "Go for it.  Cheesecake Factory has some of the nicest wait staff. Ask the server their name, tell them it’s your birthday and to recommend something on the menu.  They will sit and chat for a few minutes and also come back often to check on you.",
            "Don't let \"normal\" judgements determine what you do. Do what you want. I recommend ordering dessert first.",
            "No, it's not weird. No one will really remember you for the time you dined alone in a restaurant. It's also not weird, I often eat alone, it's good to have time to yourself, in fact, when you to into a restaurant, you're going to see a lot of people alone. It's normal.",
            "Some of my best meals have been alone. A strange city, an interesting restaurant, a good book, and an understanding and friendly waitperson.",
            "Absolutely not, my wife is Active Duty Navy, so sometimes we have to spend months apart. I am a food fanatic. I love to cook, eat out, and try new foods. If only ate out when I was able to eat with another person than I'd be missing out on all kinds of stuff. Not to mention, when you're alone you can go wherever you want. You don't need to limit yourself to a place that is mutually interesting or within someone else's price range. Like that  fancy seafood place your significant other doesn't like because they're allergic to shellfish, or that steak place that all your friends hate and think is too expensive but you love. Enjoying food in a public space doesn't require anyone but yourself",
            "I like to sit alone in a booth next to the window with a good book and take my time.",
            "Do it. Eat by yourself. Do things by yourself. You're the only thing that you'll always have for your whole life. Enjoy being with yourself and treat yourself well.",
            "I 100 percent eat and do everything alone. I'm almost 30, I don't have time for feeling embarrassed. Friends come and go. Sometimes I go out with family. You do you.",
            "It is completely normal. \nI had some anxiety towards eating alone, but the more I did it, the more I preferred it. Happy early birthday!",
            "Treat yo self!",
            "Whats normal? Do what you want!",
            ">> is it weird to go eat in a fancy restaurant alone?\n\nNo.",
            "It’s not weird. I used to do this for work. You can bring a book, use your phone or just stare at nearby people!!! :) \n\nHappy Birthday though I hope you have an awesome one!!!",
            "Nobody actually cares except those nosy, immature ones. They think it's sad, but some people who eat alone are just independent and enjoy their time alone. Don't let anyone dictate what you do in life. None of them matter.",
            "The sooner you normalize this for yourself, the sooner you are going to start having a new kind of fun solo experience that you can enjoy for the rest of your life.\n\nI’ll add two things: First, people that are comfortable with themselves are attractive. That’s worth something. And second, doing things on your own opens you up to experiences that you couldn’t anticipate. You start having unexpected fun and living in the moment. \n\nIt’s pretty great. And you don’t have to do it a lot. Just a little bit now and then can make you a more happy, living-in-the-moment person.",
            "I used to do it all the time on my lunch hour at my old job. I never wanted to eat in the break room or at work so I’d take off elsewhere and rarely had company, loved it. I would usually take a notebook to write or draw in and earbuds to listen to something. Or people watch and listen to the world around me.",
            "No it's not. (correction since you asked two questions)  It is definitely not weird in my opinion and should be considered normal.  I sometimes schedule a dinner out for myself when my family is out together somewhere else.  I am introverted so there is that.  There is just something about enjoying a nice meal in peace.",
            "I was going everywhere alone until I was about 22 and heard someone ranting about how they couldn't  go to the cinema because none of their friends wanted to see the movie. I had no idea that going somewhere alone may be weird for some people (most of them actually) but no one never said anything to me, like, the restaurant staff, people at museums, the guy who was checking my ticket at the cinema, no one made a single comment about me being alone.",
            "Nope, go on with your good dinner ^u^",
            "I work a lot. I travel for work sometimes and my work place is fairly far from home. I absolutely believe that eating out even at a fancy or super fancy place is Great. I get exactly what I want. I only pay for my food. I don’t have to coordinate meals or get something for the table. I do have to make small talk. I get to sit and enjoy my meal with occasional talk to a server who hopefully does not need to chat too much. I find it enjoyable enough to eat with others. But I find it slightly nicer to sit down at a nice restaurant relax and order a 10/10 meal.",
            "Call me weird but I kinda like eating alone at times. I don’t think it’s weird to do something you want to do. No one will care as much as you think imo. Do it!!",
            "Hey! I actually work as a host at the cheese cake factory and honestly it’s not bad to eat alone, we get guests who eat alone all the time and we don’t even think about it. So I say go for it, you do you. Also if it’s your birthday you do get a free little sundae.",
            "Bartender and server here. Extremely normal. Often time my bar would be filled with guests of parties of one.",
            "I love eating alone. It’s a rare treat. I will usually bring a book.",
            "Only weird if you make it that way, live your life homie.\n\nIts no different than going to a bar alone, a concert alone, or any other restaurant alone.\n\nCompany enhances the experience, but the experience doesn't require the company to still be enjoyable.",
            "I’ve done this so many times in various stages of life. To me it’s normal :)",
            "I can’t necessarily comment on normal, but this sounds like something you want to do. Perhaps it’s helpful if I share my experience. \n\nFor me, food is a huge passion of mine, work has allowed me to travel a lot and if I had waited to have someone to go with I wouldn’t have had so many of the most incredible meals of my life. It’s different, eating alone, especially at a fancy place where a lot of folks are there to celebrate and be together. However for me, this act of indulging my love of food, and self love has been transformative and I hope you give it a try. \n\nSo often if life, I used to wait for others to come with me for fear of being looked at strangely but my life would undoubtedly be worse if I hadn’t gotten over that fear.",
            "Thanks for making this post, I just moved to a new city, with no connections. I'll have to eat alone and explore the restaurants in the city!",
            "I do this a lot, actually. Well, before COVID-19 at least. When I eat at a nice place, I usually can learn something from eating food I couldn't prepare myself, and that's always a good basis for enjoying some alone time. \n\nDuring the pandemic, when outdoor dining became more safe, I went back to a place I was a regular and took advantage of nobody wanting to eat around 3-4p. As a single diner on an off hour, I got to talk with the owner and other folks all the time and now everyone there knows me.\n\nI've been doing this since college like, over a decade ago, and I stand by it. You're all good!",
            "Go ahead. You might get a few weird looks or people asking if you're waiting for someone, and you can just say \"no, it's my birthday and I wanted to treat myself.\" Happy birthday as well!",
            "I work FOH and whenever i see someone come in to eat alone i dont even think about it. No one really cares and the people that do, dont matter",
            "Happy birthday!! Dine by yourself and have a great time",
            "What I love about New York City is that most people are comfortable being and doing things alone including restaurants.",
            "It’s completely normal to go out to eat alone. If you’re self conscious just skip peak times and go slightly off. So an earlier or later lunch or early dinner. \n\nRelax and enjoy. Going to eat by yourself is awesome. To not go and miss out on delicious food or fun spaces is silly.\n\nNo one cares.",
            "No and ya gota dress up like a king and make a big deal of it while you do, make the dinning experience awkward for everyone else because they don’t know you and your friends will never know",
            "I love doing things like this alone. As a husband and father of two it’s dangerous how intoxicating being alone in a nice setting can be.",
            "I love eating in restaurants alone. Bring a book, maybe a tablet, even your laptop. Dress up and feel good about yourself.",
            "I like eating alone. I usually bring a book and just enjoy a nice meal.",
            "Happy early birthday 🎂 I hope you enjoy your food 🎈",
            "No. fancy restaurant worker for a decade. We love you. My favorite type of customer.",
            "It's not wierd at all. Be confident be proud eat delicious food",
            "If it is, it shouldn't be.",
            "Do it. And do more stuff alone when you’re feeling like it. My brother was supposed to go to London with me, a trip over from the stAtes together to watch some footy. Well he bailed so I said screw it, my son is small and my wife was pregnant so I wouldn’t be able to go back for a while and she was ok with it so I went alone. It was great. I always thought going to things alone was a little weird but not after trip. I don’t even think twice when I see people alone eating or in the movies.",
            "Literally no one cares. Go to a restaraunt and see yourself how many people there are eating alone. Do *you* care that they're eating alone? No? Well that's how everyone feels...",
            "Definitely not weird! Some of my most peaceful moments are eating or having a drink alone, just being quiet and enjoying being there. No agenda. No expectations. Take your time, enjoy, and treat yourself because you deserve it, especially on your birthday! 🎉🎉🎉🎉",
            "I've done it several times. It's only weird if you make it weird. I'll let you in on a little secret too: I actually enjoy it more than going out with other people. No pressure to socialize, just eat the food and enjoy the people watching. The server sometimes feels obliged to chat you up, but with a little luck, they'll take the hint that it's appreciated, but not necessary.",
            "Never weird! YOU are the BEST person you know!!",
            "Yeah also sitting at the bar makes it feel less weird for you at first, or also outside instead of a real inside table.",
            "Go for it!!!",
            "Before covid and the stress of covid reservations, I would treat myself to dinner alone all the time. I usually just sit at the bar wherever (tbh best seat for kitchen suggestions), but I’ve fully wined and dined myself at a table too. I’m a female in my late 20’s who started doing this about 3-4 years ago - if that makes any difference. \n\nHappy early birthday! Treat yourself!",
            "I mean, why should people only go to restaurants in groups?",
            "This question is adorable! \n\nNot at all! Enjoy your life :) I personally like eating alone. Especially at fancy places! You get to feel like a mysterious stranger.",
            "Not weird at all! I usually sit at the bar if they have one, even if I don’t plan on having a drink, when I dine out alone - there are usually just more people sitting alone there. But I’ll sit at a booth or table alone, too! Once you start doing it, you look around and see that other people dine alone frequently and feel a little less odd doing it. I hope you have a nice birthday, and enjoy your delicious fancy meal!",
            "Nah, treat yourself.  You deserve it :)  \n\n\nHappy Early Birthday",
            "Yes very normal I use to go to o my favorite restaurant and take a  book. They would see me and smile and take me to my table.  I would order food read and enjoy my time.",
            "Absolutely not. Treat yourself.   And you can do better than cheesecake factory.",
            "HEY! This guy is at the restaurant *alone!*\n\n\n...See? Nobody cares.",
            "Nope.\n\nYou do you.",
            "Of course it is normal. Enjoy your evening!",
            "Nope. Enjoy life.",
            "Do this shit. It's totally normal. I've been both a server to singles and a single and it's the best of both roles. You get to engage or not as you and the counterpart see fit and it's more enjoyable for both people. Plus, life is long and you're going to be alone for a fair amount of it. You have to become comfortable with doing things by yourself. Once you can enjoy things without needing someone to share it with you'll enjoy a lot more things.",
            "Not at all. I live with my other half, and a couple of times a year I go for a weekend away in a different city on my own. It's lovely, so relaxing, I explore, visit a museum, see a band, find some nice pubs. And I always find some nice places to go eat by myself. Once you get used to it it's quite enjoyable",
            "No, it's not weird, but you have probably at least 1,000 lonely nerds who would love to take you out for a nice meal and some delicious cheesecake in this thread alone, so I would say there's no need to eat alone. You are a beautiful goddess and you deserve happiness. \n\nHope this helps!",
            "Who cares if it's normal or not, you do you. Especially on your birthday.",
            "I never understood why my mom took her birthday off from work every year to go to the mall and have lunch alone. Then I became a mom. It's the dream.",
            "Go and enjoy! Tell them it’s your birthday so they sing for you!",
            "Absolutely not. Drink what you want. Order what you want. Pay for your own meal. Thumb through your phone. People watch. Breathe in and breathe out with no expectations or weight on your shoulders.",
            "I thoroughly enjoy have lunch at a restaurant alone",
            "No, I'm at a restaurant by myself right now. Not weird. Depending on the person though feelings of being lonely might set in so just be aware of that.",
            "it is!!! don't mind people's stare. they always stare anyway. i hope you can enjoy your birthday even tho you spend it with yourself only",
            "As someone who did some serving in a fancy resturant, it's more common than you'd think! They'll ask how many, if someone is joing you or something similar. This is just to check where to seat you. And to know if they should start talking specials and drinks right away. If its a really traditional resturant they might offer you a newspaper.",
            "Fuck no, enjoy that.",
            "For a few years my job was 30-40% travel, and most of those meals I ate alone.  I distinctly remember eating at the Cheesecake Factory in Seattle.  I’d typically eat at the bar so as not to tie up a table they might need.  Bartenders are typically happy to get the bigger tip that comes with a full meal as long as they aren’t busy.\n\nLong story short, nope, plenty of restaurants regularly see “Party of 1”.  If someone asks “Here by yourself?” and you don’t want to explain, just say “Eh, work, you know how it is.” And that’s usually enough.  They might press “oh, what do you do?” And or “where you from?”  Make up whatever you like.\n\nYou do you, OP.\n\nHappy Birthday!",
            "I love doing this and would do it often. Weirdly with coVid I’ve had a problem getting reservation for one; which I don’t understand it’s the perfect way to social distance. Go and enjoy!"
        ]
    },
    {
        "post_id": "vbtgzb",
        "author": "None",
        "title": "How do I nicely tell a 15 year old girl that I'm flattered she likes me but I'm fully 10 years older and this just straight up isn't going to happen",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/vbtgzb/how_do_i_nicely_tell_a_15_year_old_girl_that_im/",
        "score": 22837,
        "num_comments": 3867,
        "created_utc": 1655175236.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/vbtgzb/how_do_i_nicely_tell_a_15_year_old_girl_that_im/",
        "comments": [
            "I've been a guidance counselor (male) for 20+ years. In my work with students ranging from ages 13 to 19, there have been many occasions in which the kid opened up about a lot of personal things. Many of them have never talked candidly with an adult who cared about them and respected them. In some cases, they confused their strong feelings of gratitude and warmth with love (or, in a few cases, lust). This is akin to what's known as \"transference\" in therapy. \n\nKids can have especially intense emotions and often they don't have the ability to sort them out and understand them fully. I think a key thing to remember is that many adults view teenage emotions as being dramatic or silly. \"You just *think* you feel that way\" or \"It's just a phase\" or \"That's just from your hormones going crazy\" or \"It's just puppy love\" are very dismissive of the kid's feelings and thoughts, devaluing them and this can cause emotional responses of embarrassment, despair, shame, guilt, self-criticism, anger (directed at self or others), and thoughts of self-destructive behaviors including non-suicidal self injury (e.g. cutting) or suicide. \n\nJust as many adolescents don't know how to understand their emotions, some also often don't know how to manage them. I think it's crucial when interacting with young people (as their parents, relatives, teachers, therapists/counselors, employers, co-workers, friends, etc) to keep in mind that their emotions are just as real and can be just as intense as ours. It's critical for their development and self-esteem for adults to use empathy, consideration, and thoughtfulness when dealing with teens.",
            ">I'm fully 10 years older and this just straight up isn't going to happen\n\n^. ^.^.^",
            "However you word it you need to be direct. Yeah it’ll hurt her feelings but that’s better than her getting in a relationship with an adult as a kid. Plus legal stuff",
            "I  think it’s best to leave being flattered out of it",
            "Either straight up tell her you have no romantic interest or start saying that you see her as a little sister figure. Sisterzone her my dude",
            "You don't.  You *bluntly* tell her that this straight up isn't going to happen.  Forget the flattered bit, that will only encourage her.",
            "Like others are saying, be blunt, but also make it a learning moment to help ensure she is protected in the future.\n\nIdk something like, \"Listen, I have to be honest with you, I appreciate you having the courage to tell me (if she did), but this straight-up isn't going to happen. I'm not interested in you. It's not anything about you in particular, but I'm just not interested in anyone that much younger than me. And to tell you the truth, any normal guy my age should not be interested in you either. If they are, that's actually a major red flag. So if someone my age ever propositions you, please please please do not take them up on it. They are not normal and it only spells out bad, dangerous things. I get that it can be tough dating at your age. Teenage boys are idiots a lot of times who don't know what they're doing. They're all still trying to learn and figure the whole thing out, and that's tough, but those boys will genuinely like you for you and you'll get to learn and grow together. That's what you want vs an older guy who's had all those years to learn how to say all the right things, but is using that to mask his bad intentions.\" \n\nI think explaining, but also empathizing with her feelings in this way lets her walk away with her dignity and also imparts an important lesson. The teacher tone may also reiterate that you see her as a child and are therefore not attracted to her.",
            "Play Sting's \"Don't stand so close to me\"\n\nDO NOT play Depeche Mode's \"Little 15\" or \"Question of time\"",
            "Bro trust me be blunt say you don’t like her and be straight up and honestly you might need to be a little rude.\n\nThat’s if y’all aren’t close friends or anything like if she’s just a girl you know.",
            "Just like that",
            "\"oh, thanks. But sorry, I'm not interested. I will say though, if you *ever* meet someone older than 17/18, they have no business talking to you. I get you're young and whatnot but seriously, that's how you meet creeps who will think you're too dumb to realize how gross they are talking to a minor.\" reject her ***and*** lecture her.",
            "Just be careful, if you use the age difference as a reason, to phrase it like that. \"The age difference is too big\"  and not \"you're too young\". The latter can be interpreted in all sorts of hopeful ways, the former less so. \n\nHaving been a 15 year old with a desperate crush on a 29 year old dude... teenagers have an active fantasy life, and every little thing can be twisted to fit the fantasy. The guy I was semi-stalking once told me that a particular comic book (involving a plot about a girl with a crush on her teacher) reminded him of me. I spent months obsessing about that book and **what he could mean by that.** The title of the book is still my username in several places. I'm 37.",
            "I also want to say- do you people really never interact with anyone who is younger than you?\n\nI’m a 31 year old woman and mother of 4 who has a 15 year old male coworker. I talk to him every day! In fact, a lot of the people I work with are younger than me. I’m not sure why that’s an automatic red flag lmao.\n\nY’CANT TALK TO ANYONE YOUNGER THAN YOU OR YOU’RE A WEIRDO. Wtf? Lol.\n\nI’d be appalled if someone assumed I must have weird tendencies or thought I was a pedo because I interact with him. The audacity.\n\nIf he told me he had a crush on me, I’d feel terrible for having to let him down. Poor kid pours his heart out and now I gotta squash it.\nMy empathy and sympathy for his situation doesn’t mean I wish I was younger so I could smash. It just means I understand it’s a rough situation for a teenager to be in and how much it sucks to be let down, despite the age difference. It still hurts to get your heart broken and it hurts to break someone’s heart. Simple as that.",
            "As directly as possible. Just like you said it there.",
            "Exactly what you wrote in your post",
            "As others said, saying that you're 10 years older should alone be enough. She needs to understand that being underage like her means dating guys that much older than her would prove so much destructive for the both of you, no matter how she feels about you. It's not only illegal, but rather immoral as well.",
            "I had a friend's little 15 year old sister throw herself at me when I was 21.  I told her that she was awesome and great but the age difference wasn't right and illegal in my state. I told her she'd understand when she was 21. Pretty much kept a solid message not changing tone. Also never allowed myself to be alone with her. \n\nAbout a decade later she sent me a message on FB and said I was right and pretty cool for how I handled it.",
            "I am being serious when I say to absolutely crush her and explain why. It is not healthy and unfortunately the next person may take her up on it unless this idea is slaughtered in her. This girl needs to be protected and turning her off predator age people is helpful",
            "\"I'm way too old for you, sorry.\"",
            "\"I'm into girls my age. And not into prison\"",
            "\"While I understand your feelings I have no interest in a relationship with someone as young as you are and it is wholly inappropriate.  Any man my age who is interested in someone your age is not a man you want to be with.\"",
            "She’s hitting on 25 year olds, you need to talk to her parents. She could easily get herself into a bad situation.",
            "“I’m sorry this is conversation is inappropriate and makes me feel uncomfortable. You’ll be better off with someone your own age.” *block*",
            "i don’t think you have to be nice about it. gtfo there before someone finds out and calls police",
            "as a person around her age, be blunt as possible. record it too and get witnesses. you really don't want a case with any validity if she goes nuclear.",
            "\"You are 15 and I am fully 10 years older than you. It's a crime and it's immoral and any 25 year old who says anything other than that is a disgusting predator whom you should avoid.\"",
            "Honestly, just tell her. I had a similar situation when I was a teenager. I just wouldn’t leave my brothers friend alone. This would have been fine except I was 14 and he was 22. He sat me down one night by the fire and straight up told me he was never going to see as more than a little kid. He told me that he thought I was one of the coolest kids he knew, but still a kid and I shouldn’t waste my time on someone who would never feel the same way. I got upset not gonna lie, but over time he’s stayed close with my brother and we’ve talked about it as adults and he was very right. I’m grateful for the firm advice.",
            "Don't even mention the flattered part.\n\n\"I'm going to be upfront with this, you are 10 years younger than me and a minor. I could never be attracted to someone who is so much younger and in such a different phase of their life and such compliments, while they are well intentioned, are not welcomed in this context. You should not be trying to pursue a relationship with someone so much older, nor even bringing up a topic of attraction. You are putting yourself in an extremely dangerous position to be targeted by a predator or abusive person by doing so, and there's a legal risk involved for the other party as well even if they don't mean you harm.\"",
            "Hitting these points tends to work well...\n\n* **Make it no big deal, like she's going through something totally natural.** A comment like, \"Yeah, it's very common for teenagers to have a crush on older people. I did too when I was your age.\" Saying it in a laidback tone where you come across as totally at ease with the convo helps.\n* That first point is important. One: It helps her save face. Two: It's possible this seems like A Very Big Deal to her. And, to her at this point in her life, it very well may be. But in  the grand scheme of things, this isn't some unique love that's meant to be. It's a standard crush. It's part of growing up. Framing it like the above point can help minimize the fantasy and give her a (kind) reality check. She can still fantasize and crush if she wants. Fantasies can be healthy and often inspiring; crushes can be invigorating and make life more beautiful. She just needs to know there's a sharp line between fantasies and reality and that the crush will not get acted on.\n* **Be clear that you're not interested.** \"If I were 10 years younger, I'd be flattered. But this isn't a relationship I want at this age. You're like a little sister to me. ETA: To be honest, adult men who would want a relationship with a teenager are bad people.\"\n\nIt's very common for adolescents to develop crushes on adults. These are important experiences that help put them in touch with their own romantic and sexual feelings. Basically, you're a muse that's helping her uncover sides of herself and what type of people she's attracted to. Her feelings are genuine and will likely help her grow as a person. Covering those 2 points can help her feel respected, not shamed, and cared for platonically.\n\nIf she's really obsessive and her behavior is and remains out of line, then you'll need other responses too. The above points usually contain it though.",
            "Tell her you dated her mom.",
            "No is a complete sentence",
            "Just tell her what you told us",
            "I've been in her shoes. I had a crush on a man over a decade older than myself. Let her down easy. I hope she understands.",
            "Are you sure she even likes you like that? In my experience a lot of men read sexual desire into innocent things women do when it's not reality.",
            "Why would you be flattered? However you end up telling her, make sure it’s out in the open and maybe your girlfriend is nearby, just to protect yourself from potential accusations. Not saying it’s likely to happen, just saying be careful just in case.",
            "\"it's ok for you to like me, but with our age gap if I liked you back I'd be a giant asshole. So no, not gonna happen, and if an older guy ever says yes or hits on you, they're pretty much scum to be avoided.\"",
            "“Any 25 year old that would date you does not have your best interests at heart. Date someone your own age sweetie. This is what good boundaries look like.”",
            "“What are you doing later today?” \n“Eh, you know, 20 to life if you don’t get the fuck away from me. Leave me alone”",
            "it comes from an unlikely source but the webcomic shootout had a good line when a student had a crush on the teacher and told him about it. he said “if i’m the man you think i am i could never do that to you, and if i did reciprocate i wouldn’t really be the man you thought i was” just saying after you shut it down hard make sure she knows it’s not good so she doesn’t reach for that age range in the future with someone who might take advantage of her",
            "Feel like most people here make this mistake of assuming this 15 year old is emotionally and mentally responsible.\n\nSome are fucking psychotic and I’d like to imagine OP is asking because they can’t predict a very mature and fair response by just being “blunt”.",
            "Get the fookaoutaheere",
            "Why are you flattered that a 15 year old girl likes you?",
            "Why are you hanging around 15 year old girls?",
            "Better question: why are you putting yourself in a position like that with a 15-year-old?",
            "Send them the definition of statutory rape.",
            "“Hey if I fuck you im going to jail…”",
            "“Your 15, Im 25. It cant happen and we cant talk”\n\nYou dont need to sugar coat it.",
            "Why not just cease communication entirely? Why is this 15 year old having a conversation with you\n\nYou shouldn't even tell a 15 year at 25 that you're flattered because it's A. not flattering and B. easily misconstrued\n\nit's way more concerning than flattering",
            "Do NOT tell her you're flattered. You're trying to put a film of niceness by saying that, but that's low key encouraging her and also low key making it seem like you've even slightly entertained the notion. \n\nSay - \"No way this is happening. Period.\"",
            "I'll get downvoted for this, but talk to the parents and have them be part of that conversation. I don't know the situation here but it is never a good idea to take risks with a minor and a situation like this. Just invite her parents to listen to you say bluntly that this is inappropriate and you will not have any part in it. Otherwise they might find a picture of your face glued to a magazine cut out and that raises some really serious fucking questions. Never, ever, ever get involved in the romantic feelings of a child, even if those feelings are not reciprocated. Just don't and don't, I repeat, don't trying to have this conversation one on one with her. It's for both of your protections.",
            "I know the sub we are in, but how is this difficult? Be blunt, almost abrasive, don't let her think you're being playful or playing hard to get, just say absolutely not. Don't try to be sweet or cute, just draw a line.\n\nAlso why are you talking to 15 year olds alone? Regardless of gender.",
            "Tell her she’s a child and you’re not a pedophile.",
            "Just stop talking to her? Don’t say anything? What the fuck",
            "Would she date a 5 year old? Then why does she think you'd date her.",
            "OP is low key excited and happy about this. Pretty disturbing.\n\nMy advice is to be rude to her for even thinking about that. Be rude to her and tell her to fuck off and you’re 25. Jolt it into her brain that that ain’t cool.",
            "Don’t be a dick, but also do not give hurting her feelings a second thought…unless prison doesn’t seem that bad to you.",
            "Exactly that. Dude ffs she a kid. Be blunt or call her parents",
            "this is an interaction with a child.  \n\n\n\"X, that isn't an appropriate thing to say to me. I'm concerned that you would put yourself at risk of predators like this and I'm sorry but I think I need to let your parents know this has happened\".",
            "Are you sure she’s not just being friendly?",
            "Don’t acknowledge flattery, it runs the risk of leaving a ‘there’s a chance’ idea in their head. Tell them straight that you’re far too old for them. If you want to soften the blow, it helps to let them know that it takes guts to confess feelings to people, they just need to direct that confidence the right way and they’ll have no trouble finding a more appropriate date. Gotta make sure they know they haven’t done anything wrong by feeling feelings else you might dent their confidence, they just need to refocus on their own age group.",
            "Say nothing.\n\nBreak contact 100%\nBlock her number and on all social media.\nLet her refocus on something else because you are simply no longer in her sightline.",
            "Honestly, the fact your coming to Reddit to ask such a simple question tells me you and her are on the same level mentally.  Just be an adult and tell them. How is this difficult?",
            "….why are you even talking to a 15yr old?",
            "Honestly, the fact the you need to make a post about It is kinda SUS… How hard is it to tell a KID no?",
            "My man, you really shouldn't need help with this",
            "You’re a dumb fuck",
            "Why is this even a question lol just no and make it very clear .",
            "You’re flattered? Um ok",
            "Skip the part where you tell her you are \"flattered\" , that sounds so fucking creepy.",
            "Honestly I wouldn’t even be nice, I think it’s best to be blunt about it.\n\nI know that feels harsh and mean, but you need to curb this shit like yesterday my guy",
            "Dude has to ask reddit how to turn her down makes me feel like he's just looking for an excuse to say yes.",
            "Don’t even say your flattered.  Tell her that kind of relationship is not appropriate and don’t elaborate.  Be an adult.",
            "The fact that you’re a 25 year old man that doesn’t know how to speak to a 15 year old girl, tells me exactly why you’re talking to 15 year old girls in the first place",
            "When I was a lil younger but still in my 20’s some teen girls passed me a note with one of their phone numbers and some pretty explicit offers. I smiled at them and said loudly “nice try FBI!” Which they thought was pretty funny.",
            "MAKE SURE TO RECORD IT so you have evidence in case she becomes vindictive and makes up lies about you. Protect yourself as much as possible, you want nothing to do with her.",
            "Make sure you communicate this to several other adults to cover your ass in case said 15 year old feels vengeful. \n\nIm speaking from personal experience.",
            "I’m curious why you struggled with this and had to seek Reddit guidance. Where is the struggle?",
            "Tell her no, and then reinforce that any 25 year old man willing to date a 15 year old is bad news.",
            "With a female adult present in the room as a witness.",
            "The fact that you even have to ask this question is fucking terrifying.\n\nDo us all a favor and take your driver license out of your wallet and cut it up. You shouldn’t even be driving a vehicle if you’re this fucking stupid",
            "Next time you see her, pee your pants and start crying. The spell will be broken",
            "Tell her you're too old or don't even talk to her. Don't tell her she's too young that'll just piss her off. How are you talking to a 15 year old enough for it to matter though?",
            "Exactly just like that are you kidding?  You’re 25 grow a set",
            "Why you flattered bro? Shes 15 lol",
            "Just explain that while her feelings are normal, and you appreciate her honesty, you're too old for her. Assure her that its just a phase that will pass.\n\nEssentially what everyone else here is saying just dont be a brute about it. People want what they cant have so bringing a hard hammer down might encourage rather than dissuade. It *is* normal to have crushes on adults at that age, no need to give her a complex over it.",
            "Why are people upvoting this bullshit? Seems more like whoring for attention/karma/validation than a genuine question. And even if it wasn't, Why the fuck do thousands of people need to share and read this? What a waste of time",
            "what a fucking moron. why are you even posting this on reddit? literally just say that to her.",
            "“I’m seeing someone, sorry” \n\nFour words is all you need. Overthinking this because she’s a child isn’t sensible, reject her like every other person you’re not interested in.",
            "tell her exactly that? You telling me your 25 and are struggling with how to respond to this?",
            "How'd you end up talking to a 15 year old girl in the first place, op?",
            "\"I'm 25, leave me alone\"",
            "Audrey, you are a teenage girl, and I’m an agent of the FBI. Now get your clothes back on, I’m going to go get us some milkshakes.",
            "Just like you did here for all of reddit to see it.",
            "Just like you said on the post sounds good",
            "\"Nice try Chris Hansen\" should be fine",
            "what’s the big deal if you offend someone, tell ‘em you aint interested be straight to the point. unless your a creep and you are into it. then in that case you deserve any bad consequence that would happen",
            "15 will get you twenty. Also really creepy.",
            "Nicely? U are worried about the wrong thing. Create a boundary and be firm. Tell her she is too young and limit your interactions with.",
            "Tell her parents to tell her",
            "Dude don't be a weirdo. You're a 25 year old man just tell the fucking girl your too old for her ... simple as that. Why are you even in a situation where this is happening?",
            "Talk to her parents.",
            "A strict \"no\" and cut all contact",
            "You seriously needed to consult Reddit for this?\n\nI don't believe in the concept of this sub anymore. What the actual fuck?",
            "“It’s not you, it’s the police”",
            "\"I appreciate your feelings but it's wholly inappropriate for me to engage with you that way. It isn't going to happen. Please don't contact me with things like this again.\"",
            "I really don’t think any normal adult man would feel the need to come to Reddit to ask this question. Also suggesting you’re flattered… weird vibes from you. I think you were hoping for some weird affirmation to dip your toes in the water.\n\n “Someone on Reddit said it’s okay to flirt a little as long as I don’t do anything else..”\n\nI’m glad you’re not getting these responses.",
            "how is this even a scenario? how has it gotten to a point where she feels that this is something viable?",
            "Honestly this post seems like bragging a 15 year old has a crush on you. Gross",
            "You don’t. You stay tf away from her, and you go no contact, if possible. If it’s not possible, you never, ever contact her 1:1 or occupy any space she’s in without another adult present at all times.",
            "Don't be flattered, that's gross, surely you can see that. Just say no and be unreachable.",
            "OP has interest in that 15 year old for sure. Any normal people wouldn't have any doubts or problems to say: \"I'm 10 years older than you, go play with the other girls your age and fuck off\"\n\nNormal people wouldn't be posting shit like this on reddit and definitely wouldn't be flattered she likes me. This post reeks.",
            "Stop talking to the 15 year old. Cut her off completely. That's fucking weird.",
            "Who cares if she's disappointed? It's inappropriate and you're the adult in this situation. If you don't have the fortitude to tell her (which is a whole other issue), then ghost her.",
            "What’s wrong with you ? Really need to ask Reddit that ? How about you grow some adult boundaries? Tell her you have a GF , and I’m sorry you just too young right now. Be polite but laugh it off like childish flirting. Later when you are older …. Plenty of ways out. \nBut I seriously worried about a person who can’t figure this out for themselves and needs an online forum for advice.",
            "Don't start with \"I'm flattered\" for a fucking start.\n\nTell her it's wildly inappropriate and massively fucking illegal.",
            "She’s a 15yo who has a crush on an older guy. That’s it.\nWhen I was 15 I was MADLY in love with my teacher. Oh goodness I loved him.\n\nI was so in love with him that I even confessed it to him.\n\nHindsight is 20/20 wtf was I doing lmao\n\nYou know what he said to me?\n\n“Oh boy. Well, that’s very sweet and I think you’re a wonderful girl. I’m not naïve to teacher crushes. Lord knows we’ve all had one at some point I’m sure. However, that’s all this will be. You are 15, I am 35 and your teacher. I am here to teach you and help you learn and anything more than that is inappropriate. I know that hurts to hear, but you will find someone you love even more who is your age soon enough. Let’s hurry and go to lunch, you’re gonna miss it.”\n\nI was obviously heartbroken but he let me down easy. \n\nDon’t be mean to her. It’s okay to say “I’m flattered” because it’s just a kind reply to someone pouring their heat out to you, especially a fragile teenager who doesn’t understand how to handle a broken heart. You aren’t saying “damn, that’s hot, but I don’t wanna go to jail”.\n\nThis situation isn’t uncommon. Just be kind and let her down easy, making it a point to say it’s inappropriate and won’t happen.\n\nShe’ll eventually get over it and be okay.\n\nThank you for wanting help on how to let her down easy. You seem very sweet.",
            "Tell her parents, that way it can’t get twisted around on you.",
            "Uppercut her dog, date her mom, drop kick her cheesecake",
            "don't say you're flattered, that feels inappropriate as well because it suggests there's a small part of you that values this inappropriate flattery, which is coming from a child. and it's technically a lie because you are not, in fact, happy that a teenager is hitting on you :)",
            "Why are you talking to a 15 year old girl in the first place..? Where did she have an opportunity to tell you this???",
            "You might be better served asking yourself why you are putting yourself into situations with 15 year old girls in the first place. You should not be flattered at her attraction, it should make you uncomfortable. If you must interact, treat her as you would want your daughter treated. That would be to advise a teen girl not to be scoping out grown men.",
            "I feel weird reading this. You should instinctively know what to do in this creepy ass situation and not be turning to the internet for answers. You need some self reflection man.",
            "If you have to come to Reddit to ask that it sounds like you’re mentally on her level"
        ]
    },
    {
        "post_id": "abglx1",
        "author": "None",
        "title": "What’s the full version of the name Seth?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/abglx1/whats_the_full_version_of_the_name_seth/",
        "score": 22831,
        "num_comments": 72,
        "created_utc": 1546331539.0,
        "selftext": "I feel like there’s more to it, is it like Sethony or some shit",
        "permalink": "/r/NoStupidQuestions/comments/abglx1/whats_the_full_version_of_the_name_seth/",
        "comments": [
            "This sub hitting the new year strong, I love it. Yeah, Seth us just the name, it's like Hebrew for annointed or something",
            "...It's just Seth. ",
            "There isn't one, Seth is a complete name, it's from the Bible.",
            "Here ya go:\n\nhttps://www.behindthename.com/name/seth\n\nMore specifically:\n\nhttps://www.behindthename.com/name/seth-1\n\nhttps://www.behindthename.com/name/seth-2",
            "I went to school with a guy whose actual name was Sebastian but he went by Seth. His middle name was Thomas so I’m not sure where Seth came from.",
            "It's just Seth.  The name derives from the third son of Adam and Eve.",
            "[removed]",
            "[removed]",
            "[removed]",
            "Well, this has been fun, but the reports for joke answers is outpacing our ability to keep up.  Thread locked, sorry.",
            "[removed]",
            "[removed]"
        ]
    }
]