[
    {
        "post_id": "tf5hnp",
        "author": "_77-",
        "title": "Was Donald Trump actually the worst president?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/tf5hnp/was_donald_trump_actually_the_worst_president/",
        "score": 21976,
        "num_comments": 4868,
        "created_utc": 1647392744.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/tf5hnp/was_donald_trump_actually_the_worst_president/",
        "comments": [
            "I think Andrew Johnson was the worst tbh",
            "Andrew Jackson was basically a demon",
            "No. Probably Andrew Jackson.",
            "[deleted]",
            "[deleted]",
            "I wouldn't say the worst in all of U.S history, no.",
            "Efforts to have historians rank us presidents have so far put Trump very near the bottom, but not quite at it. There have been some *really* awful presidents.",
            "Too soon to tell. There have been some truly awful presidents in U.S. history, but you don't really get the best picture until at least 30 years have passed.\n\n&#x200B;\n\nEdit: A lot of the people lampooning me seem to think by not openly bashing him means I think he was a good president. That's not what I said, that's not what I implied, and that's certainly not what I think. Chill.",
            "Someone informed me that Regan removed or had something to do with removing the law that requires news stations/broadcasters to be unbiased... Giving birth to that huge divide you guys have in the media nowadays.\n\nThat's kinda fucked",
            "You’re not gonna get too many unbiased answers here\n\nBut in my opinion I’d say for sure the most unprofessional. But far from the worst.",
            " I don't think that it is possible to fairly rank current presidents. I think it'll take 20-30 years to say either \"Yeah we was a terrible president\", or \"Maybe he wasn't as bad as we thought\" about presidents like Trump, Biden, and Bush. Plus it's hard to say any modern president is the worst when many presidents supported slavery. Trump has done some stupid stuff, but when you compare him to Andrew Johnson he really doesn't look that awful.",
            "I am far from a Trump fan but he is definitely not our worst president. There are plenty of presidents who have done bad or not even done anything to help the United States. So even if you don't like him, it's hard to argue he's the worst.",
            "Absolutely not. Buchanan and Johnson outright tried to undo or prevent African American rights. At the very least, Trump was not as bad as them.",
            "I think Andrew Jackson was the downright worst. Causing a financial crisis, being responsible for the Trail of Tears…",
            "Trump was pretty bad in my opinion, it’s still a little to early to see the full effects his administration had but we can by no means pretend he was the worst president in US history. Allow me to illustrate the (in my opinion) contenders for worst US president:\n\n1. James Buchanan - the 15th president, while dealt a bad hand with the whole slavery debate at a standstill, his actions (or rather inaction) directly led to the civil war breaking out. He was ineffective, did not solve problems, and let the civil start (the first states seceded while he was president). Trump was pretty bad, but is he as bad as Buchanan? Not in my opinion.\n\n2. Andrew Johnson - the 17th president, who was only president because Abraham Lincoln wanted to appeal to northern democrats and unite the country, deciding to make him Vice President over his incumbent VP in 1964, and the fact that Lincoln became the first president to be assassinated. Similar to Buchanan he was dealt a bad hand as he had to fix the country after the civil war. One small problem however, he was a southerner and actively worked against civil rights movements and reconstruction efforts. He was the first president to ever be impeached and was (if I recall) one vote away in the senate from being removed from office. Johnson’s actions set the country backwards on civil rights for a century and the effects of that are still felt today over 150 years later. Trump was pretty bad,  it is he as bad as Andrew Johnson? Not in my opinion.\n\n3. Woodrow Wilson - the 28th president and probably the only slightly controversial opinion I have here was awful, I highly recommend the Cynical Historians videos about him. To sum up the video: Wilson was a tyrant who passed anti-free speech laws (that still exist), set up a quasi-militia-secret police thing, lied about involving the US into World War 1, was a awful historian, was racist (even when we consider the time period), only became president because his two more popular opponents split each other’s votes, plus when he had a stroke his wife became de facto president and she was bad as well. Trump was pretty bad, but was he as bad as Wilson? Not in my opinion.\n\nTLDR: trump was bad or below average at least. He isn’t as bad as Buchanan, A. Johnson, and Wilson though.",
            "Depending on your criteria, it would likely be Harding, Jackson, Buchanan, and your mileage may vary here but potentially Nixon, Reagan, or Truman.\n\nIn twenty years we'll know more about the longer term effects of Trump's presidency. He isn't going to be remembered fondly by historians barring a radical shift in both culture and politics, but it's pretty hard to top Jackson who was openly and proudly genocidal.",
            "Andrew Johnson, Woodrow Wilson, James Buchanan, Andrew Jackson, Warren Harding. No, I can't say he's the objective worst. Probably the worst of our lifetime tho.\n\nEdit: maybe that's not true either, Bush and his wars were definitely more destructive than Trump. \n\nTrump is far more unlikable and has more policies that I directly disagree with, but we can't forget Iraq and Afghanistan, pointless wars, pointless deaths.",
            "Andrew Jackson was pretty shit",
            "Depends on how you measure it, I think there is a real case that he was the most Unprofessional president we have ever seen. I mean where do I start, but if your going to look at tangible life under his presidency, we didn’t enter any wars, foreign relationships were pretty good, there was a good stock market and overall job growth. So was he a “good” president, absolutely not IMO, but I’m sure there were presidents where life was worse under, but that’s JMO, please respect it I’ll respect yours 👍",
            "As others said, it really depends on how you quantify \"worst\". I'm terms of GDP growth, up until the pandemic in the last year of his presidency, he wasn't bad. Same for unemployment. There have definitely been a lot of crappy presidents in the past, Wilson, Coolidge, Jackson, Buchanan. One can also argue that a lot of the issues we see today with income and wealth inequality had their seeds sown during Reagan's time with trickle down, supply side economics, the War on Drugs. So would Reagan get the blame for those or should Bush, Clinton, and W get the blame for not course correcting?",
            "I’d argue that James Buchanan, Lincoln’s predecessor, was the worst, followed very closely by Andrew Johnson, the successor to Lincoln.\n\nBuchanan was one of the biggest reasons why the Civil War came to be - an advocate of “state’s rights,” it’s assumed that he rolled out the red carpet for Jefferson Davis to present the Confederacy. Rather than try to quell secessionist vibes, it was as if he was cheering on the Rebels and stoking the fires personally - sound familiar?\n\nJohnson, in turn, bungled the shit out of reconstruction. His total ineptitude and his desire to “look good for the winning side” helped establish the hatred and distrust the South would carry to this day. In fact, his antics could be considered a plausible possibility for today’s version of racism, and may have been a reason why civil rights took forever to take root. (sound familiar?)\n\nTrump, while absolutely a terrible human being, is still alive and breathing. Because of this, we won’t know the impact he’ll have on this country past the immediate sense. However, with the above presidents in mind, it almost feels like he’s on par, but definitely not quite the worst yet.",
            "I hated trump but even I'll admit I'm sure there's been worse. I think every politician has/will do something that one side of the country will consider them the worst. \n\nBut despite his general stupidity he wasn't the worst.",
            "Woodrow Wilson",
            "The worse is very hard to say honestly. But a terrible president in almost every aspect? Yes, surely",
            "Aaaaaand out come the bots",
            "Time will tell but I think he probably isn't the worst America has seen so far.\n\n\nJames Buchanan and Andrew Johnson are normally rated at the bottom. \n\n\nWarren G Harding was super corrupt\n\n\nHerbert Hoover is one of the worst for his complete failure in leadership when faced with the great depression\n\n\nOutside of Polk pretty much every administration between Jackson and Lincoln was a clusterfuck whose inaction eventually led to the civil war. \n\n\nIt may be too early to tell but we are over 20 years out from 9/11 now and George W Bush's 8 years in office were a complete train wreck. I don't think history will be kind to his legacy. \n\n\nSome other presidents have individual actions, scandals or personality traits that lead some people to rate them as the worst. Like Andrew Jackson and the Trail of Tears, or people hating Woodrow Wilson lately because he was racist against African Americans, or Nixon and Watergate. \n\n\nI think when all is said and done that Trump will rate near the bottom with Harding but that Buchanan and Andrew Johnson will still be seen as worse",
            "No.",
            "How do you measure it?",
            "Trump's a piece of shit, but Reagan caused far more lasting damage.",
            "I feel like Ronald Reagan is up there. A lot of our economic issues today started with him. There are other Presidents that were worse in policies, worse in crimes against people, but he has done his fair share of harm.",
            "Perspective of a non American: If by worst you mean war criminal, I don't think he was the worst. Now if by worst you mean most incompetent, if you're looking at the one guy that made the US the laughing stock of the world, then he's that guy, and by a very long shot",
            "Random redditors can’t tell you that. Luckily, they do rigorous polling of US historians every time a president leaves office to rank the presidents. The last one was done in 2021 and [Trump was the third worst president in US history, according to historians.](https://www.c-span.org/presidentsurvey2021/?page=overall). You’ll notice there are only 44 presidents listed even though Trump was the 45th. That’s because ~~William Henry Harrison died a month into his presidency, before he could do anything of note. So they don’t bother ranking him.~~ Cleveland had non-consecutive terms. (Sorry, brain fart)\n\nIf you click a president’s name, you’ll see their scores and ranking in specific categories. Trump did score dead last in Administrative Skills and Moral Authority. His highest ranking was 32nd in public persuasion.",
            "Worst? No. Best? Also no. Somewhere in the middle? Probably. Are you gonna get unbiased answers on Reddit? *Fuck no.*\n\nEdit: I’m not here to argue with you guys. If you disagree just downvote and move on.",
            "No. People who think he is have not been properly educated in history. And judging by how flawed the US education system is, it makes sense.\n\nBut trump wasn’t the best president either. Hell no.",
            "We're still suffering from Reagans bad politics. Nixon was impeached, but then again Roger stone idalized him and that's why he wanted to help Trump become president",
            "No.  He tried to be but he was too incompetent to get through his proposals.\n\nGeorge W. Bush was the worst in modern history (his father George H. W. Bush was a good president).  Starting a war with the wrong country by lying about it, massively increasing the debt.  He severely damaged the U.S. in almost every way.\n\nBut there were terrible presidents in the 1800's as well.",
            "In modern times the most damage was done by Ronald Reagan. Trump is a close second.",
            "Woodrow Wilson was pretty awful.",
            "Donald Trump isn’t James Buchanan, no.",
            "He actually did some pretty good things for the economy and finally had the balls to push back on China regarding trade. There are several things he’s done that Biden hasn’t changed. Why is that? \n\nBottom 25% though probably. Nut job. How can you not be concerned about climate change right now",
            "Not even close, Andrew Jackson takes the cake and 2nd place is far away from him",
            "ITT: people recognizing that Trump was nowhere near the worst in terms of actual policy, but still tossing him at/near the bottom because of his personality/personal life",
            "Did he have the worst effects on America? Too soon to tell — history takes time to become clear. Democracy certainly seems uniquely imperiled now, but we'll see what happens.\n\nWas he the worst person to be president? Hard to say — as vicious and corrupt as he is, the patina of history sometimes makes it hard to judge the personal character of people in the past.\n\nBut it's pretty clear that he is the *only* president in the history of the country who didn't even take the job seriously, didn't even make an effort to understand what the job entails. Others did the job in stupid, corrupt, or downright evil ways; he never did the job at all. And it's not even his fault, in a sense; it's clear that he's not a fully-functional human being, who was lying even as he took the oath of office, which includes a pledge to \"faithfully execute\" the office — a concept which he is entirely incapable of understanding. The notion of a 'duty' is completely unintelligible to him.",
            "By modern standards yes. He was/is corrupt, a criminal and almost definitely a rapist. Not only was he an incredibly bad president he isnt a decent human.\n\nHe has close ties with Russia and openly compromised the duties of a national leader in favour of financial/personal gain.",
            "I actaully don't think he was the worst in effect.\n\nLuckily he was mostly ineffective except for exacerbating already existing problems and not understanding a god damn thing other than how to get attention, good or bad.\n\nDefinitely the dumbest AFAIK.\n\nDespite all the 'not a politician' talk, he IS a very effective populus politcal actor, in the worst way possible... but effective.\n\nAll the grade school tactics of 'I know you are but what am I?' and 'I'm rubber you're glue' and straightup gaslighting somehow work near flawlessly in Washington. And he is a master at it, as much as anyone can be a master at booger flinging.",
            "Recent history? Absolutely.\n\nHe didn't start the political division but he is singularly responsible for making it much wider with every tweet of his dumb mouth and every dogwhistling rally he went to.",
            "No way",
            "He sucked after Covid-19 happened because he got too desperate for re-election but he wasn't the worst. \n\n&#x200B;\n\nAmericans might change their opinions of him real soon in the future. I remember George Bush was hated as much as Donald Trump but people changed their mind when Bush started speaking against Trump. \n\n&#x200B;\n\nSo funny how people in America decide on politics like a reality tv show regardless Trump was a President or not.",
            "I kinda think Andrew Jackson is a pos",
            "Not THE worst but definitely up there",
            "In my lifetime? No not the worst. We seem to forget how terrible W Bush was. Millions of people died cause of his pointless wars. Trump was an idiot, but at least he was a pussy in terms of being a war monger…which wasn’t terrible for a president.",
            "This thread confirms that the average redditor has no real clue about anything going on anywhere, at anytime, at any point in history. \n\nAndrew Johnson =/= Andrew Jackson.",
            "He was the worst in several ways, but not the worst in others. He was one that, as a person, I liked the least so far. Just a pompous, arrogant wind bag. Incapable of admitting that he is, or ever was, ever incorrect, even slightly.",
            "If you were writing a role description for the President and then you evaluated Trump against it, he would be so disconnected from the minimum and preferred qualifications that you would assume he were placed there through some affirmative action.",
            "I just love how far-left is detached from reality. What Trump did? He talked shit because he is an idiot celebrity. That's all. Maybe he gave Pootin a blowjob. \n\nTake Bush for example. He did what Pootin just did to Ukraine. He made up lie and invaded a country destroying it. Bombing men, women and children.\n\nThat cages you were so mad about few years back? That was Obama.\n\nThen like someone pointed out there was Indian genocide.\n\nTell me... What is most horrific thing that Trump did that rivals Bush or Jackson?",
            "He was definitely one of the dumbest amd most embarrassing but the majority of the shit he wanted to actually do in office was blocked by the other governmental branches. I'd probably say Reagan was the worst and I can't wait to kick his ass when I go to hell",
            "He was the dumbest. And that's even after dubya...",
            "I think eventually this will be the general con census amongst most, excluding the deplorables that still would vote for this turd.",
            "Trump… he will cheat at anything and will lie about anything… and do it shamelessly.",
            "Yes Trump was a clown.",
            "Definitely in the worst 5",
            "Yes",
            "Worst and most corrupt",
            "Yes",
            "Yes.",
            "Maybe there were worse Presidents but Trump was probably the most dishonest, self serving, narcissistic, greedy and morally corrupt of them all.\n\n\n(I’’m Dutch, and everyone I know thinks this if him).",
            "Yes"
        ]
    },
    {
        "post_id": "btontj",
        "author": "Popular33",
        "title": "Why can teenagers find drug dealers but cops can't",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/btontj/why_can_teenagers_find_drug_dealers_but_cops_cant/",
        "score": 21982,
        "num_comments": 1242,
        "created_utc": 1558977711.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/btontj/why_can_teenagers_find_drug_dealers_but_cops_cant/",
        "comments": [
            "I imagine with teens it’s more of a who knows who thing. Cops can’t just 21 jump street some teens and be like “ hey do you guys know where I can buy some tree? “.",
            "Depends on your type of drug dealer, some people only really deal to friends and classmates. To find these people you'd have to have someone rat them out. Usually the answer is nobody cares enough to really do the work required to arrest small scale drug dealers, there are generally other more serious crimes to investigate and resources are limited.\n\nEdit: I'm generalising a bit with \"nobody cares\", there are plenty of examples people have of small town police putting huge amounts of resources into finding petty drug dealers.",
            "Because usually cops aren’t looking for the small dealers that a teenager would find. They’re looking for the big wigs",
            "Honestly you’d be surprised by how much the police know about the local drug scene.  The reason they don’t arrest all of them is because they are A. Looking further up the supply chain and arresting small timers puts the big guys on alert and B. They build a case with a lot of evidence before they pick anyone up.",
            "[deleted]",
            "Teenagers are usually willing to tell another teenager who their drug dealer. Teenagers usually don't like to volunteer that information to the police willingly.",
            "Cops dont hang out with teenage stoners",
            "Nice try officer, have a good day.",
            "Because when middle-aged cops try to dress up like teenagers and speak teen slang, everyone's too busy laughing at them to tell them where the dealers are.",
            "[deleted]",
            "Oh that's easy: Networking. Everybody knows somebody who knows somebody who deals. It was the same way when I was in high school, just asked a friend if they knew anyone. The cops have to grab people off the street and shake them down, illegally, to find anything. To get in with a dealer takes time and patience, two things that your average cop is not capable of understanding. And the other reason is because cops look and smell like cops, you can put a hoodie on him with a new pair of nikes but teenagers and dealers aren't stupid. You want to know if he's a cop? If he's dressing out of his age range, if his teeth look nice (they have a terrific dental plan) and his shoes will probably in good condition because they have to run a lot.",
            "Cops do know who dealers are, but can't just randomly arrest them without proper evidence.",
            "For the most part cops know exactly who the drug dealers are, some reasons why they’re not arrested is because most of the time they’re small time, it’s easier to keep an eye on someone you know is a drug dealer rather than have someone replace that person later on, most drug dealers don’t do much apart from sell drugs I.e. no attacking civilians or they’re just building there case against the dealer \n\nJust off my experience in my town however we’re quite small so I’d assume police are more bothered about the big guys",
            "Drug dealers don't really hang out outside selling drugs to passersby, they are friends of friends or older siblings 99% of the time.",
            "you probably don't understand what a drug dealer is. A drug dealer is generally just a friend of yours who buys drugs for themselves from someone else and is willing to buy you some as well. That someone else is just a friend of theirs who buys from someone else for the same in turn. And on and on till you find the guy who buys from the internet. Or stringer bell, but he's harder to locate/probably getting murdered ATM. Mostly it's the internet guy at the end.",
            "Other than what most people said about cops not caring about the small dealers, it's harder to find dealers with age, and from what I've heard it's easy to tell a cop from a regular customer even if they're better than \"Good afternoon, young man. Do you perchance know where I could purchase some cannabis?\"",
            "Cops have a certain, I'm not sure what the best word here, but *feeling* about them.  Something about how they act, how they talk, even how they look just screams \"cop!\" to anyone who makes a living illegally.  Obviously some cops know how to blend, but for the most part undercover operations aren't going after dudes selling dime bags on street corners.",
            "I actually became a low-key, cross-town drug mule for a guy in my Spanish class. \n\nTrue story. He grew pot in this weird...He’d plant a thousand plants, but he planted them 50 yards apart in the sort of zig-zag pattern that only a guy who was really into his own product would come up with. It was sort of a known thing. He was “that guy.”\n\nOne day in Spanish, he said, “Hey man, you work down the south end, right?”\n\nI said, “Yea? Thursday through Sunday.” (I was a waiter at night.)\n\nHe said, “Hey you know (guy everyone knew)?”\n\nI said, “...Yeaaaaa?”\n\nHe said, “You mind giving him something for me?”\n\nI was in the middle of trying to be a nice person, so I said, “Sure!” He gave me a bag that looked like the bag I carried my surf gear in, and I just assumed he’d borrowed some gear from the guy. I took it down with me, handed it off. Did this a dozen or so times over the next couple of years. He sure borrowed a lot of surf gear!\n\nAbout halfway through, one of the guys in the kitchen said, “Hey, you bring the stuff today?”\n\nI said, “Whaaa?”\n\nHe said, “From (Spanish class stoner)?”\n\nI said, “Oh...Yea.” (Why does HE care?)\n\nHe said, “Coo.” Then went out and bought like two ounces for the kitchen from (guy everyone knew).\n\nAnd that’s when I realized I was a drug mule.\n\nI’m pretty sure I was too stupid to be scared. I think my thought process was like, “Well, it’ll look weird if I *stop* doing it...”  I’m so white and straight edge, they never would have looked at me twice.\n\nI never got paid, but I got invited to *all* the best parties.",
            "Because we don’t care about the 20 year old who bought  an ounce of low/mid 60 dollars to sell to his brother’s friends for 10 dollars a gram. If we do get that dealer, it’s on  traffic stop. Depending on how much he has will determine if the officer will work with him on his charges, like telling him where he bought it from and he will just eat the traffic violation citation type of shit. the way my state has possession charges it’s not worth the effort pushing the issue of anything below an ounce unless they’re being dumbasses, charged with dui drugs or you’ve caught the person with weed multiple times.",
            "Because cops are not concerned with stopping drug dealing but administering it. The know who the drug dealers are.   \n\n\nThey just have no incentive to apprehend every single one of them when they could use them for some income, petty crime or leverage over some particular individual.  \n\n\nAlso, all this is most likely handled by someone in higher up in the county or state.",
            "The police don't care about the guy selling small quantities of weed to his friends. Plus if I arrest the guy selling dime bags on the corner he'll be replaced before I get back to the station. But if I know a guy is dealing enough to get 5 years and he knows i know that and can take those years at will when I need to know what's going on in the neighborhood (like say if somebody got shot or even who's having problems with who) he's more likely to talk to me if we both preserve the fiction that I don't know about the little shit",
            "They normally just don't have a warrant for their arrest. They know where everyone lives, from big drug dealers, to infamous mob bosses. The thing is either they don't have a warrant for their arrest, or they just look the other way because they're corrupt or need them for something else.",
            "!",
            "When I bought drugs in high school. It was pretty easy it was always just weed or shrooms. Since I live in Colorado I'd just have friends that would have their parents buy it then give it to them or they knew someone older or just someone that grew it then I'd buy it off of them. Shrooms were a bit more difficult with that I'd have to know someone that grew them usually I'd talk with friends and they would know someone. Shrooms were always a major bitch to get though but that's just my personal experience. I hope it helps your give you a better idea of how teens get drugs.",
            "Because dealers are looking for teens, not cops. It doesn't work in this order.",
            "Because a teenager can walk up to a friend and go \"can I get your plug\" a cop, not so much",
            "Most teenagers are going for weed. Not heroin",
            "The drug dealers want to be found by the teenagers that buy their product and don’t want to be found by the cops that want to bust them",
            "Yeah or like say someone in their early 20s who just graduated college and doesnt have the same connections anymore. How would they go about doing that. Hypothetically.",
            "Drug dealers aren’t exactly hiding from teens. Simple as that.",
            "Everyone stop answering OP is clearly a cop who can’t figure this shit out",
            "I have a relevant question: how come teenagers can find a dealer, but I have to drive all the way to Colorado to get some of that sweet, sweet devil's lettuce? It's just not fair. Cool people call it that, right?\n\nOh, crap on a spatula! I just realized I'm not cool and that's the answer to my own dang question. Thanks for the help, everyone.",
            "High school is a great market for drugs unfortunately. Teens want to find drugs and have money so dealers want to be found by them. \n\nDealers don't like cops obviously so they hide from cops. \n\nI guess what I'm saying is that the Dealer is why teens can find drug dealers and cops can't.",
            "When it comes to charging someone with a crime, its not what you know, but what you can prove.\n\nIn order to make an arrest, the police need probable cause. In order for the charge to turn into a conviction, the government has to be able to prove beyond a reasonable doubt that the person being charged did in fact commit a crime. \n\nIf someone were to walk up to a police officer and point to someone and say they were a drug dealer, how can it be proven? The police officer may even know that person to deal drugs, but with out any proof, it's just hearsay at that point. That police officer would need probable cause at that point in order to affect an arrest.\n\nIn the case of larger dealers, the probable cause is usually collected and a warrant is sought. All a warrant is is a statement of probable cause given to a judge, and based on what was presented, a judge can issue a warrant. This could be done for a search of an area, arrests, seizure of property, or combination of everything.\n\nIts not that the police aren't aware of who the drug dealers are, there are just a lot of rules and steps involved in order to arrest someone.",
            "I watched this documentary called 21 Jump Street and they trained cops to go under cover in a high school to find drug dealers.  It turned out to be pretty funny.",
            "Cops routinely use teenagers that have been busted for drugs to rat out other teens and their source. This goes for drugs or alcohol. Around my way, if a cop catches you with alcohol, they’ll make you go into the store that sold it to you and get you to buy more. If they sell it to you, they get their alcohol license revoked. Most gas stations sell a lot of alcohol, and losing their license means losing a lot of income. They make deals with the kids. They threaten them with trumped up charges if they don’t comply. It’s pretty fucked up, but cops are douchebags, so they don’t care. Keeping 20 year olds from drinking bud light is saving the world in their eyes.",
            "1. Dealers actively market themselves to teenagers while actively hiding from cops.\n\n2. Cops do still find them, all the time.",
            "This is the entire premise of \"21 Jump Street\"",
            "The real question is why can teenagers find a dependable drug dealer, and I cannot?",
            "Pen",
            "Is",
            "Where I live, the cops ARE the dealers.",
            "Life tip: If you can picture them in a uniform they’re probably a uniform",
            "Because they WANT to be found by teenagers",
            "A glaring example of how marketing to your target demographic works.",
            "Had a kid that i went to highschool with that worked at the school store and sold cigarettes to other kids of they knew the codeword. Never got caught. Our school cop never knew the codeword.",
            "There are far more teenagers than there are cops",
            "Nice try, cops",
            "[deleted]",
            "School",
            "Most the time the teenagers are the dealers. If you're under 18 it's supposedly less serious as far as legal consequences go. Maybe. Idk it's just a guess.\n\nCops know who the dealers are usually from my experience. They sometimes just want to see how far up the chain they can get. Hell, sometimes with CIs cops are the suppliers and dealers.",
            "Cops do find them all the time. Usually because somebody snitches.\n\nEDIT: What's controversial here, exactly? That people snitch, or that cops bust drug dealers all the time due to snitches?",
            "most cops don't do lines of coke off your dick",
            "Because cops get paid whether they do their job or not",
            "Some said it's because cops aren't interested in catching those guys, they want the big busts that make the news. In my city, cops know about many of the big wigs but getting enough evidence to reliably make a bust is difficult. Also, they like to turn mid size dealers into informants whom often continue to sell drugs while helping bust the dealers they know. It's not that they can't find them, it's just better for police to allow them, while they concentrate on larger drug seizures. my opinion is that it's not the worst thing ever since jails tend to be wonderful places to meet bigger and better drug sources which would be a bad place to send a whole bunch of small time dealers if you think about it.",
            "Cops can and do find drug dealers. There’s just more dealers than cops and they have to prioritize their resources so they don’t go out of there way to catch dudes selling dub sacks.",
            "Police know who and where most drug dealers are, but choose not to go for them as it requires a lot of resources just for one small win. They wait until they can arrest someone much higher up in the drug chain before arresting the smaller dealers",
            "I don’t know why but from my teen years until now I never found a drug dealer.....even if I wanted I wouldn’t know where to buy my stuff",
            "Why can't middle aged suburban women find drugs as easily as the kids? Come on guys, work with me here!",
            "cause they're looking for the guys supplying the dealers, not the dude on the street corner with a half O max on him.",
            "Because cops want to stop the drug problems at the source. They aren't going to the little guy with barely anything in him that he sells for a high price. They want the big bois that distribute large amounts.",
            "The same way they can find friends and I can’t.",
            "Better question, where do the drug dealers get their supplies?",
            "It's word of mouth. The small time high school dealers aren't worth the effort most of the time for the cops. If they're smart, they stay there and don't get to ambitious. Fly under the radar",
            "Cops *could* find small dealers that teens find. Thing is, they don’t care. They are interested in takin g out the supply chain, not random teens selling by the gram.",
            "Are you a cop?",
            "What makes you think they can't?",
            "Because you connect with a drug dealer through your social network, and the police do not have the same social network that you do.",
            "Because you dont want to arrest the small time guys who are nobodies. You follow the trail up to the important people and arrest them. If the smaller dealers get arrested you lose out on a lead.",
            "Real question is why can't I find one.",
            "Infiltrate the dealer, find the supplier.",
            "Because most cops aren't teenagers...",
            "I couldnt tell you since you might be a cop",
            "Used to work police roadblocks (non-police demographic surveyor): in my country, the police can *find* the big-league drug dealers, they know who they are, where they live, and their license plates, but they can't search their cars without a warrant (and if they're going through a roadblock without trying to run, chances are they're clean and there's no point searching anyway), and they can't detain them without sufficient evidence that they either are committing or are about to commit a crime (which is harder to get than it sounds). It takes more than just shoes over the power lines to raid a drug house - took six months for the cops to get enough evidence that a pre-dawn raid of the meth house across the road from my place was a good idea, and the one at the other end of the road hasn't been touched in over five years.",
            "Finding small scale dealers and putting them on trial is a waste of resources, which is why several police organisations in europe support decriminalisation of almost all drugs. Right now they tend to not bother.",
            " Cops know who the drug dealers are but they wait until they know when they’re dealing to catch them. Can’t just randomly roll up on people hoping they have drugs. You have to have cause.",
            "Because drug dealers don't offer cops drugs.",
            "Cops can find drug dealers, just not all of them.",
            "Lol the cops know who deals drugs, they just want their bosses",
            "4th and 5th Amendments, to start.  (Or equivalent in other countries.)   \n Cops can find the drug dealers, but knowing they are drug dealers is far different than being able to *prove* they are drug dealers.",
            "Idk man jails are full of drug dealers.",
            "No one mentioned this so far, but one of the reasons is that cops aren't the targeted audience for drug dealers. Meaning, drug dealers will put an effort to appeal to teenagers and put more effort to avoid cops. So they are easily found by their targeted audience",
            "They both find them actually.",
            "Cops can but they are usually more interested in who is supplying the drug dealers with the drugs, don't want to spook the big wigs by taking out one of the minor players",
            "Schools. I’m in 8th and I know like more than 5 ppl I can get weed from and like 3 I could get other stuff from (I wouldn’t get the other stuff)",
            "They can find the drug dealers just as easily, but just don’t care, or don’t have enough evidence, to arrest them. Many teenage dealers deal in a closed system and never provide the opportunity for getting caught.",
            "[removed]",
            "The ones teenagers come in contact with are street dealers where as police chase suppliers and distributors \n\nIt’s pretty obvious to anyone and this question is retarded \n\nOnly street dealers that get caught are also retards because no one is looking for them",
            "I imagine it has to do with humans being better at doing things they want to do and not as good at things they are told to do.",
            "well, that's a good question... so easy to get drugs, and so hard to find who sells them!",
            "The kids selling weed to high schoolers are a lot more likely to talk to a high schooler than a cop",
            "Because cops are dumb",
            "Shiny black FBI shoes on those undercover cops.",
            "I think it would be drug dealer who would be trying to find teenagers instead. Can't imagine why a cop would be trying to find a teenager otherwise either.",
            "...because they're minors and don't have to rat to avoid any kind of real sentencing. Adults have more serious penalties to deal with and may identify their dealer to lessen them.",
            "Maybe teenagers should be cops...?\nEdit: typo.",
            "Because when drug dealers ask if someone's a cop they have to tell them if they are.\n\nIt's in the declaration of Independence",
            "Because the drug dealers are looking for customers, not jail time.",
            "Drug dealers are dangerous, often well armed and not very reasonable. People driving 5 over the speed limit have a much less chance of shooting back. Same reason they fuck with black and brown people out in public a lot more than in their own homes. They want the probability of survival above solving crime or making you safer. Never forget the supreme Court ruled they do not serve or protect the public. They inforce laws that's it. Which laws? Well that's up to the cops themselves."
        ]
    },
    {
        "post_id": "fu45qg",
        "author": "psilocybin_fiend",
        "title": "Found friends mom on pornhub",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/fu45qg/found_friends_mom_on_pornhub/",
        "score": 21970,
        "num_comments": 2393,
        "created_utc": 1585900062.0,
        "selftext": "Sooo basically I was scrolling on the hub and I seen a face that looked fairly familiar so I clicked on it... and without a doubt it's my friends mom getting absolutely railed. My question is should I tell him his moms been doing porn or just ignore it so he doesn't have to hear about it... I'm a pretty honest person so I feel bad not telling him but I personally wouldnt wanna know if my mom was making pornography.",
        "permalink": "/r/NoStupidQuestions/comments/fu45qg/found_friends_mom_on_pornhub/",
        "comments": [
            "Rule of thumb: If you see somebody you know in porn, don't say anything about it. Not to them, not to other people, etc. Nothing good comes out of it",
            "Think of all the possibilities. \n1) He does not know and he never discovers it. -> ignorance is bliss. \n2) He does not know and he discovers later. -> He most likely won’t tell you. And if he does you act like you did not know and provide him support if he needs it. \n3) He knows -> If you tell him, he’ll probably be upset that his friends know too.",
            "I wouldn't tell him. What he doesn't know won't hurt him. It's not something you can unlearn about your mum either...",
            "[deleted]",
            "Do not tell him",
            "This is one time that reddit is worth listening for. Replies generally push for honesty in this type of situations, more than they would in some other forums, IRL etc. This really isn't something worth telling.",
            "Not to downplay the situation, but this [reminds me of a greentext](https://i.redd.it/cba80h3jhc511.jpg)",
            "[removed]",
            "Dude ya gotta keep that shit to yourself. It isn't lying, nor is it wrong to omit yourself from this narrative.  Your friend's mother has a right to privacy and no positive outcome will come about when your friend knows this information.\n\n&#x200B;\n\nBe a bro.  Fap and move on,",
            "I am a mom. And I know it distresses our kids to think that we like sex. So i try very hard to let my kids know that it is a normal healthy activity between consenting adults. \nBut information like that could destroy him her and any kind of family connections they have if the son is not comfortable with his mom's sexuality and most kids aren't until they are adults and have more of a understanding of sex, sexual needs and preferences.\nYou should mind your business. There is no need for him to know.",
            "Can we get the link?",
            "i would give the mom this useful tip of advice: geoblocking. she can block her videos from being seen by anyone in a certain area/state in the settings",
            "Don't tell him, seriously. Nothing's good going to come out of it.\n\n...but do tell us.",
            "[removed]",
            "[removed]",
            "Are you sure the mom knows she is on pornhub? This could be revenge porn. \n\nCreate a fake FB. Msg the mom and say you are concerned and that you will tell no one.\n\nNever tell the son.",
            "The only outcomes of telling are negative, and the mum doesn’t deserve to have her son told about it either. As is the answer 99% of the time, mind your business.",
            "The real question is did you have a tug to it? \n\nAlso don't tell him either",
            "Fap and forget. I repeat, fap and forget.",
            "Don’t tell him.\n\nTell us the link.",
            "Don't tell him. He will look it up and get fucked up for life.\n\n# OR\n\nDon't tell him. Show it to him, film his reaction and post it to r/WatchPeopleDieInside for sweet, sweet karma.",
            "Sooooooo we got a link here????",
            "Do not tell him. DO NOT TELL HIM",
            "I wouldn't tell him, not really any of your business",
            "Tell his mom instead and see what's good ;)",
            "Link?",
            "Even though this hit r/all, there are a couple of points I want to mention that I don't think have been addressed;\n\nFirstly - honesty is one thing.  Being honest doesn't mean you wilfully volunteer any and all information.  Think about all the random facts you know but *aren't* constantly regaling people with in the name of honesty.  You wouldn't go bump into him and go \"hey, an Intel Core i9-10980HK has 16MB of L3 cache\" because while factually true, there's no reason to say it.  Similarly unless he's actively pondering the question of if his mother has ever done porn, or is specifically doing something he wouldn't do if he knew, there's no honesty-related reason to volunteer an answer.\n\nSecondly - while I appreciate a lot of people are concerned about \"revenge porn\", anonymously contacting her from a fake profile is also a pretty creepy thing to do and could be seen as a blackmail attempt.  I'd avoid it unless you have a good reason to think there's an issue.\n\nThirdly - some people are just lookalikes.  There are billions of humans on this earth.  I appreciate you said you're sure, but I want to make sure you know that a LOT of doubt should be applied unless there's an identifying tattoo or something.",
            "Best thing to do, is go up to your friend, tell him hey let’s watch some porn and have a wank together.\n\nPlay his mom.",
            "Don't tell him. Sweep it under the rug. You'll feel bad, but it won't be as bad as what that info can do to your friend and his family. I heard a football coach use the term \"selective amnesia\" after a loss. I kind of like that idea.",
            "Omg please don’t tell him",
            "[removed]",
            "link for proof?",
            "„Im an honest motherfucker“, dude it’s your Friends mum",
            "You sure this is legit porn and not some revenge video posted without her consent?",
            "I think the only reason to tell your friend is if his mom is in danger because of the porn (like if a video turns up where she clearly didn't give consent)",
            "I wouldn't tell him but possibly his mom?  Lie and say it was a thumbnail and you didn't watch it, that you wanted to say something in case it was revenge porn or something.  Tell her you didn't tell her kid and you will leave any future discussion up to her to do.  It could actually be revenge porn, could be she doesn't know the difference between private channel uploads and blasting pornhub with it.  It will absolutely be embarrassing, but if it were me at your age it would be a relief to hand \"responsibility\" over to an adult to know about it and make decisions that could effect your friend.  \n\n\nI'm a mom (to a young kid), but I'd way prefer the above and getting to explain to my kid when he's older, than his friends showing him something.  \n\n\nAll advice though, don't feel like you have to do anything because of people on the internet.",
            "[removed]",
            "What? Why would you ever bring that up?",
            "[removed]",
            "I know a few women that do amateur and even some main stream porn.  They are some of the nicest people I have met.\n\nMost likely your friend knows, as most stars are honest with family since they know it will come out eventually.  They probably don't talk about it due to some peoples perception of it.\n\nIf you do tell him, do not do it in a negative way or make fun of him or his mom.  It is a job.\n\nI know one actress that was fired from her job due to her work.  So depending on where you live, keep it quiet from others.  I would say get to know your friend and his family more and you will meet some very nice people.",
            "[removed]",
            "What are the chances of him finding it by himself?",
            "[removed]",
            "This is what happens when we got kids out of school for too long. They start practicing their creative writing on reddit.",
            "Being honest doesn’t mean giving people unsolicited information. \n\nIf he asks you “have you seen my mom in porn?” Then you’d have yourself a pickle.",
            "I wouldn't tell him unless mom was cheating on dad",
            "What’s the link?",
            "Send the link bro",
            "What a fantastic time. I keep hearing these kinds of stories more often. It use be that there was this pornstar stereotype. Now with snapchat, onlyfans, pornhub being like a porn version of youtube, everyone can be a pornstar. Jack it to your friend's mom and let her know about it.",
            "[removed]",
            "I don't see anything positive happening by you telling him.",
            "Sometimes honesty is indeed not the best policy.",
            "That's not really your business to tell. Let it go.",
            "I strongly believe that nothing good will come out of this if you talk about situation with your friend. \nI say, never ruin a great stroy with truth.",
            "It is not often a man gets this type of leverage, use it",
            "Not telling him doesn't affect your honesty because no one will start a conversation about someone's mom being in porn.",
            "You should give us the link for research purposes.",
            "[deleted]",
            "Secret to the grave lad, secret to the grave.",
            "Really all you can do in this situation is rub one out and never speak of it again to anyone.",
            "But was it like she is a porn actress? Was something that someone recorded without her consent? Was it just something she did for fun with her partner?",
            "How is it your business, or his? Why would he need to know? Don't say anything.",
            "Yeah, keep your trap shut.",
            "Who do you think’s holding the camera?",
            "Is she aware she was filmed?",
            "I might discretely tell the mom so that she can work on getting it down if she didn't put it up. It might be good to check who uploaded it.  \n\nThen again these things usually spread Soo...",
            "I had an old regular at a restaurant who I adored. Found out she did porn, because I stumbled upon it. Never said a word, just don't ever say a word.",
            "Ops next reddit post would be AITA for telling my friend that his mom did porn?",
            "Don't tell him.\n\nJesus, dude. How would that even be the right option?",
            "Oy, thats a tough one. But not really. Never speak of it.",
            "You could reinact one of those \"Mom blackmailed\" pornhub videos then videotape it and put it on pornhub.",
            "1: is it her SO/husband? Think she’s cheating?\n\n2: if not cheating don’t say nothing.\n\n3: link?",
            "Link",
            "Sauce? For science.",
            "Hit us w/ that link bro",
            "Blackmail her and get your pp sucked",
            "Another dilemma, should you fap to that video first?",
            "Gonna need a link for science",
            "Send his mom the link",
            "Nah tell him . I’ve had a similar situation when I was in middle school . My buddies found a video of my mom on porn hub and told me about it . I didn’t believe them at first but one day they came over to my house and explained her bedroom then I showed them it and it was an exact match . So I was just like oh well. Moms a freak.",
            "Leverage this information for a \"Screwed my Best Friend's Mom\" scene",
            "Is she hot?",
            "Think about it this way, if your friend's mom wanted him to know, she'd have told him already. In fact, I'd say there's a good chance he already knows and just doesn't tell people. I don't know about you, but if I knew my mom was in porn, I would keep that to myself.",
            "I had friend in same situation. I told him, he was very grateful that i did. Because everyone already knew it, and I live in small place. It's better for him to know, than  people to talk behind his back. After that he told his dad and his parents divorced. Believe me its hard to tell, but real friend will appreciate it.",
            "think of the husband. eventually maybe hell find out on his on that his wife xheated. but it can take a lot of time until then. but the longer he waits the more itll hurt when he discovers it. tell your friend so it hurrs the husband less",
            "Ok fine, here's the link for everyone who's whining and complaining about it even though I probably shouldnt... [Hot Milf Gets Rough Anal](https://www.pornhub.com/view_video.php?viewkey=ph599caf1ee01a2)",
            "Don't tell him. It might mentally mess him up with his mom.",
            "As long as she's over 18 it's legal and also it's no concern of yours. She's not hurting anyone.",
            "Do NOT tell him.\n\nImagine how you would feel if you'd knew your friend watched your mom doing porn, speaking to him every day and such. That's a friendship over.",
            "no.",
            "Dude, STFU, would you like to know? Hell no",
            "r/thathappened",
            "Have you tried to blackmail her to have sex with you by threatening to tell her son? If not has Pornhub not taught you anything? Works every time.",
            "Live it alone. It's her life. She can do whatever the fuck she wants with it.\n\nIf it's not hurting his life because of this, then leave it the fuck alone.\n\nI hate when people have this need for somekind of fucked up \"justice\" or what to call it (I can't find the right word).\n\nShe loves fucking, who doesn't? She loves to film herself? GREAT. No one should judgge that. \n\nThe only person you would be allowed to tell is HER directly. She might not know her fuckbuddy put it up there. But leave everyone else out of this. \n\nLive and let live. Everyone has the right to do whatever the fuck they want.",
            "Send link",
            "[deleted]",
            "I have several questions:\n\n1. Does she look good?\n\n2. Was it like a decade old video or a new one?\n\n3. Di you jerk off to it? You did didn't you?\n\n4. I *know* you did",
            "No. Don’t say anything. Everyone deserves to preserve some illusions of normalcy in their lives. If karma or the fates want him to find out they will do it through some other means.",
            "Really not his business, why would you say anything? Honest mf or not, it’s not your place. There’s no good that can come from you telling.",
            "Definitely, without the single hint of a doubt, do not tell him. This kind of shit will fuck a man up",
            "Can't we keep this stuff quarantined to TIFU? I'd hate to lose another great sub.",
            "Tell the mom you stumbled across it and maybe she would like to take it down before he find it also? Or maybe she doesn't even know it's posted? Or maybe she doesn't care, in which case you keep it to yourself",
            "Just assume nothing happened.",
            "\\*15 min later\\*   \nmooom Meg is doing foot porn",
            "Gonna be real awkward next time he invites you over...\nFor the love of all things in this world, take this secret to the grave.",
            "Anonymous email id/text from a throwaway",
            "Don't tell your friend. Pretend you never found his mother on pornhub.",
            "Yeah keep that close to the chest. Dont. Tell. Anyone. \n\nI personally would delete this if this a good enough friend.",
            "Yup, don't say a thing. Ever. It will not improve the situation. Try not to smile slyly at her, lol.",
            "It's her job and it's her business. So what would he really gain by being told other than making his home life awkward?",
            "Link or it didn’t happen 😂😅",
            "Cant believe the top comment isnt: Did you fap to it!?!?",
            "You're allowed to lie in this situation.",
            "This sounds like a little piece of info you keep to yourself.",
            "Send him the link from a fake email",
            "Tell the father, no one else.\nIf she is doing porn and the husband doesn't know, that's wrong.\n\nYour friend doesn't need to know.",
            "Imo it's on her to tell him. I wouldn't interfere. I also wouldn't wank at that, could be really awkward for you if you visit them again.",
            "Sauce?",
            "In these types of situations I ask myself \"what would the Donald do?\" Bon appetite.",
            "Just leave it be. Not your business.",
            "Never speak of it.",
            "Did you finish watching it tho?",
            "You go to his mother while he is away and confront her...",
            "this woman's sex life doesn't concern you.",
            "Leave it, mate (in British).",
            "Personally I'd leave my friend alone and confront his mom about the situation",
            "Don’t tell him or anyone else. Imagine the situations were reversed, personally I’d rather live in blissful ignorance than know that. Also telling anyone else always give the risk that they’ll either tell him or tell someone who can’t keep a secret. Try to forget it happened and try not to be awkward around him mom.",
            "Just stay quiet. Don't tell your friend. He is gonna react badly to that. That, and you might lose your friendship with him forever.",
            "Hell nah, keep your secret and beat that meat. Hell you might even be able to fuck her. I'd let her know I knew",
            "Keep it to yourself.   And enjoy.",
            "OP how you gonna say this and not drop a link?  PM me at least bro",
            "If this is true, and I kinda doubt it, don't tell your friend. There's no benefit to him or her to do this and there's nothing wrong with her being in a porn video.",
            "You would meet this dilemma whenever you clean PCs\\smartphones for you relatives, colleagues or friends. It's not a big deal. Sex is a fun for everyone. Let it be.\n\nJust send her an anonymous letter to hide better if she wants to keep it. Not the best way for her son to face it.",
            "Boy you sure asked in the right sub because this is pretty close to a dumb question. It should be obvious that you need to keep this to yourself.",
            "You gonna link the video or what?",
            "Sauce?",
            "Link?\n\n\n\n;)",
            "Can we get a link",
            "stfu and fap to it.",
            "But did you fap?",
            "I would like to add to what others have said, if someone hasn’t already said it. Do not tell him, but if you wanna go the extra mile, you can notify her to block her videos to your country/state (unless you happened to be using a VPN). This certainly IS NOT your responsibility, but I thought it was worth mentioning.",
            "But did you fap to it tho?",
            "Ask yourself a question. How would you react if someone told you this information about your mom? And think of the situations. \n1) you didn’t know about it\n2)you already knew\n\nYou should be able to decide after considering yourself in both situations",
            "That depends, are both of your friend’s arms broken?",
            "\"But I personally wouldnt wanna know if my mom was up to shit like that.\"\n\nI want to focus on this comment. Agreed 100%. So your choice is very very very easy. Internalize that you've never even seen it in the first place, so you dont even have to worry about keeping it a secret.",
            "The real question: did you masturbate to it?",
            "Oh no terrible. There's like so many sites and videos though. Which one?",
            "Are you sure that his mom is model and it’s not leaked revenge porn? Maybe she dated an asshole before. Is better to tell her so she could contact site and remove the video.",
            "My answer depends on whether or not she is/was a porn star or if this is some amateur thing that someone posted without her consent. The former, don't bother telling. No upside. The latter. Create an anonymous email account and send her the link so she can get it taken down is she wants.",
            "You are not “honest” if you feel you need to run your mouth for no reason.",
            ">I'm an honest mf \n\nDon't use that as an excuse dude. If the information helps them in no way whatsoever, sometimes keeping something to yourself can help a person too",
            "How is this any of your business? Butt out! It's not your place to tell people when others are doing perfectly legal stuff. Telling ANYONE she knows just makes you a gossip and busybody. No one likes gossips and busybodies. You're not being honest, you're being intrusive and nosy.",
            "Don't tell him. His mom's sex life isn't his business.",
            "Tell the mom you know and make it her decision to tell your friend.",
            "We want update ! Did you told him or no ?",
            "Looks like you can now blackmail his mom... Gg",
            "So about that link?",
            "I think the real question here is, \"did you crack one out to the video?\"",
            "People had lives before you were born.  Just because they're someone's mother doesn't mean they don't enjoy what they did before that.",
            "Say nothing. To anybody. Nothing good can come from it. At best you’ll get an, “I know.” At worst you’ll create embarrassment for everybody involved. Keep this to yourself.",
            "If you don't know if you should and there's no pressing reason so, then don't.",
            "Just jack off to her and shut up bro",
            "The real question is did you fap?",
            "Link to the video?",
            "Are you sure it was filmed with her knowledge? If it looks like amateur revenge stuff, it would be nice to let her know privately.",
            "Well if it’s one of those homemade stuff then it sounds like it’s like a revenge video stuff but if it’s like those full blown, pardon the pun, production then I’m sure he knows it by now.",
            "Post the vid!!!",
            "Maybe he already knows and if that's the case he is probably praying all day everyday someone doesn't find out. I wouldn't say anything unless it was my best friend, cuz that is just such an awkward and unneccesary conversation.",
            "Well if he ever fucks you over you know what you can do at least.",
            "Find a way to discreetly tell his mom.  Give her the option of explaining it and tell her you do not feel like outing her here.  Give her the straight shot of I am being adult and letting you know that if I am finding you other of your sons friends might.\n\nLets you have a clean out if something comes from it because you took the high road.  \n\nAlso just fyi, if you are scrolling enough pron to bump into someone you know you might want to come up with a plan in your head for when you bump into a random girl you saw.  Nothing makes you feel like a bigger chump then giggling and muttering something about seen your boobs.",
            "I'll need to see the clip to provide a thoughtful response.",
            "You're a good person if you just keep that secret forever. that shit could turn his life upside down.",
            "Have you seen the 'its not porn, its HBO' video?",
            "This is not true unless OP posts a link. See what I did there?",
            "What you do is make a popular reddit post. And then post a link as well to make it more popular so it gets more views.\n\nNow your friend will either find the post on reddit or the video on PH, and basically he would have discovered this on his own.",
            "Maybe he filmed it",
            "Let’s just keep this our little secret you naughty boy",
            "Keep it to yourself lol",
            "Blackmail the mom",
            "Link or it didn’t happen",
            "tell him you wanna try watching porn together and see who can cum faster just start flipping through videos and change to her video right when hes about to cum it will be awesome and then you can post on TIFU and AITA too",
            "You could blackmail her and turn it into a different type of porn. /s <— OBVIOUSLY IM KIDDING",
            "Being an \"honest mf\" doesn't mean that you have stick your nose in everywhere it doesn't belong.  This is none of your business.",
            "I have seen this exact scenario in one of those videos.  It seems that the best way forward is to confront her about it.  From what happened in the video make sure you have plenty of contraceptives with you.",
            "Do not tell him. An adult woman's sex life is her own business. Her privacy must be respected.",
            "Nah dude I got the perfect plan\n\n\nText him be like dude I found this sweet ass video you have to watch it than sent him the link problem solved",
            "Tell his mom and see how she'll make you keep quiet",
            "Imagine it was you. Would you wanna go to sleep at night knowing she’s a porn star?",
            "Provide the link so we can make a more informed decision.",
            "Fuck what these other people are saying, TELL HIM if you are really his friend. Don't tell another soul about it, just him.",
            "The only move is to ask your friends mom if she needs an “acting partner” Then wink.",
            "If you were real friends you would 100% rip him all the time about it.",
            "Maybe you can get with the mom but I think that'd be easier news to take than their mom being in porn."
        ]
    },
    {
        "post_id": "u2474k",
        "author": "ThisIsExxciting",
        "title": "before the war did you realize Chernobyl was in ukraine?!",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/u2474k/before_the_war_did_you_realize_chernobyl_was_in/",
        "score": 21965,
        "num_comments": 3634,
        "created_utc": 1649783695.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/u2474k/before_the_war_did_you_realize_chernobyl_was_in/",
        "comments": [
            "Yes, didn't realise how massive the exclusion zone was though",
            "I knew it was in Ukraine, but, I didn't really think about it being in Ukraine,then I recently felt stupid for forgetting it was in Ukraine.",
            "Yes. However, I didn't know it was so close to Kyiv.",
            "Nope, I knew it was in Ukraine. \n\nAlso Auschwitz is not in Germany ;)",
            "Yes. Chernobyl never moved from its spot.",
            "I watched the show Chernobyl 3 times. I'm basically a nuclear physicist and Ukrainian historian, AMA.",
            "Yeah, I played STALKER.",
            "Yes. 50,000 people used to live there. Now it's a ghost town.",
            "Yup",
            "I knew all about Chernobyl, what happened, why it happened, but thought it was in Russia.",
            "Nope, thought it was in Russia.",
            "lol I did not. Mainly cuz I had a Russian teacher who talked about Chernobyl a few times as tho it were in Russia.",
            "I play Geoguessr, so these days I know my geography  🙂",
            "Yes I watched Derry girls",
            "Nope. I only knew the history about it and that it was in the Soviet Union, I guess I just assumed it was in the part that's still Russia.",
            "Yes, there have been many major news stories on it in recent years such as when they finished the huge \"sarcophagus\" structure to cover it and they always talked about it being in Ukraine.",
            "I think a lot of Americans are under the misconception that it is in Russia. But Ukraine is part of the former soviet union and may be responsible for that",
            "I did, but i actually only realized that relatively recently, within perhaps the past two years or so (and I'm 45, for context).",
            "Yeah, I saw it in ep of top gear",
            "Hell, I didn't realize it before this post.",
            "No, I suck at geography.\n\n\n\n\n\n\n\n\nand no, I'm not American.",
            "I have learned and forgotten this fact several times in my life. I mean, the HBO series only came out just a few years ago. Though maybe it was because everybody had a British accent that allowed me to forget.",
            "No, thought it was in Russia",
            "Yes but I live in Poland. It's no shame to confuse its place while living further away",
            "Yes. I’ve known that since 2007 when Call of Duty 4 told me :P",
            "Yes, but I'm European and I'm old enough to remember 1986.",
            "As a fact, I knew it was in Ukraine but without thinking much I would have always said Russia.",
            "To be honest, I didn’t, I thought it was in Russia, and only like a couple years ago I realized I somehow thought Chernobyl and Pompeii were the same thing.\n\nThis message brought to you by homeschooling.",
            "Yes; it has always been there.  Did people not think it was there?",
            "I thought it was in Russia.",
            "I did not. Somehow I never questioned which country Chernobyl is in.",
            "Yes. It was just part of the Soviet Union when the disaster occured, which is probably the reason why many people carry that misconcpetion.",
            "Yes because I have family in Belarus who were impacted by the Chernobyl explosion.",
            "I thought for some reason it was right on the border with Belarus. though it is pretty close.",
            "I knew that, I don't know if I knew its location before the HBO series but at least since then, 3? years ago I've known.\n\nI had no idea about geography of Ukraine before current events. I had not heard the names of several cities, only ones I knew were Kyiv and Odessa but couldn't have planted them on the map. Definitely learned a lot in last few months.",
            "I read a blog about a lady that rode a motorcycle through Chernobyl.  Plus I watched the miniseries Chernobyl on HBO. \n\nAnd still I had no clue it's in Ukraine. 🤣😄",
            "[deleted]",
            "Nope. I watched a cool drama/documentary show on it, when it happened it was the USSR, so my brain has just been making the connection that it was in Russia, rather than former USSR.",
            " Nope",
            "Yes, but mainly thanks to the HBO mini series.",
            "It took for me to see this question to realise that it was... I am not good at geography\n\n\n\nHow did I pass it at school",
            "Or rather: Before this thread did you realise Chernobyl was in Ukraine?",
            "Honest to God, I did not.",
            "Where else is it supposed to be?",
            "Yes, I've seen the top gear Ukrainian road trip, as any civilised person should have.",
            "Yes",
            "Yes",
            "Yes. But I'm the kind of weirdo that procrastinates while reading Wikipedia, so take it with a grain of salt, I think it's valid to think it's in Russia.",
            "I knew it was the Soviet union but I didn't honestly know where at. So no, I didn't know.",
            "I'm from Poland so YES.",
            "In a word, no. Always thought it was in Russia.",
            "Lol no.",
            "Chernobyl isn't a country?",
            "No",
            "yeah it's probably the biggest thing I thought about when thinking about Ukraine, I thought it was kind of Ukraines thing like LotR is to New Zealand or human rights violations were to Saudi Arabia",
            "Yes.",
            "No, I thought it was in Russia.",
            "No, i did not…",
            "Did... Did people think it wasn't?",
            "For some reason I thought it was in Russia, near Ukraine? Idk why.",
            "Yes, because I went to school in the UK...",
            "Yeah, the Ukranian army are the dudes that shoot you when you try to leave the map in the game Stalker.",
            "Nope. I thought it was in Russia.",
            "Maybe I’m asking a stupid question, but was it never not in Ukraine? I understand ukraine was in the USSR at the time of the disaster, but it was still in the state of ukraine.",
            "Gonna be honest I always thought it was in Russia.",
            "Yes, because I paid attention in school.",
            "Honestly I couldn't even point to Ukraine on a map before the war",
            "Lol, yes. Heck, it's not even *next to* Russia\n\nPryp'yat', where the reactor is, is basically a stone's throw from Belarus. It was put there for a reason.",
            "If I remember correctly, when the meltdown happened, Ukraine was still classed as part of the USSR, so in reality? at that point still classed as Russian territory, once the USSR collapsed, Ukraine became its own country, but people still associate Chernobyl with Russia because it was the Russian government at that time who tried to cover it up.",
            "Yes thanks call of duty",
            "Yes as I do not live in the USA.",
            "Ironically I thought it was in Russia",
            "No. I honestly assumed it was in Russia.",
            "No, I thought it was in Russia. I'm 17 from the US",
            "I thought it was in Russia, tbh.",
            "I love history of all kinds recent or ancient so I knew that already but if someone didn't know where it was I wouldn't think any less of them.",
            "Nope. Thought it was in Russia.",
            "Never knew it was in Ukraine cause when I first heard about it, it was in the Soviet Union.",
            "nope",
            "I did a big report on it in 8th grade so yes",
            "For years I assumed it was in Russia, wasn't until I made a RNG joke on a Ben 10 sub that I learned it's in Ukraine.",
            "I must be honest and said that no. I only learned it was in ukraine thanks to the TV series Chernobyl.",
            "Yes, but only because of the TV series on HBO. I probably may have known back when it happened, but I was barely a teenager and didn't know the difference between Soviet states.",
            "No, I did not.",
            "I did not.",
            "No I thought it was in Russia",
            "honestly no which is really odd considering how much i've learned abt it over the years",
            "To be honest, no, and I didn't feel too bad about it until I read the other comments here. :P",
            "No, I thought it was in Russia. I guess back then it was part of the Soviet Union so it all blended together?",
            "No",
            "Yes. I play r/Stalker",
            "No",
            "No, I always thought it was in Russia. I was very surprised.",
            "Yes. \n\nI play a lot of STALKER.",
            "Nope",
            "No…",
            "Of course it was in Russia 🤣",
            "Nope, always thought it was in Russia lol",
            "I didn’t know that until right now #TIL",
            "Honestly I didn't, I'd always assumed it was Russian. Made me realize I need to know more and assume less.",
            "No bruh",
            "STALKER has taught me many facts about Ukraine",
            "Nope thought it was in Russia",
            "No",
            "Not off the top of my head. I knew it was in a place that used to be the USSR and that if I ever needed to be more specific I’d have to google it.",
            "Yes. I've seen the show, and also am interested in nuclear disaster. But, I had coworker who lived in a town close to it when it happened and he told me stories",
            "Yes.  As a historian, and someone who grew up in the 70's & 80's, I was very aware of Chernobyl and it's location in the world.",
            "nope, thought it was russia, lol.",
            "Nah. Thought it was in Russia lmao",
            "I knew it, however I have a weird obsession with geography and I know a lot of people probably don't know it is in ukraine.",
            "I didn't until this post tbh",
            "I didn't. Thanks for educating me",
            "No and I don't believe most the people here saying they did",
            "I had no idea",
            "Most countries' citizens that were affected know exactly where Chernobyl is. It's understandable that you were not aware if you live in the U.S.A. or Japan...or maybe even Portugal. The Balkans and Scandinavia know for sure.",
            "Yes, but I'll admit I only learned that after the HBO show.",
            "Well yes",
            "Yes.",
            "Before the war I didn’t know Yakov Smirnoff was from Ukraine.",
            "Yes",
            "Yes. Did you know that anything west until like Ireland is considered uninhabitable due to everything being irradiated. In some countries, they have rules that it is illegal to eat the wildlife due to radiation. Alas, it’s kinda difficult to tell people to leave their home in europe and go somewhere?",
            "I wish you could see how big my facepalm is right now",
            "I literally learned so much from S.T.A.L.K.E.R.",
            "There was a  tragical land filled  with vodka, radiation, and hard-bass which was my  mental place-holder for \"Eastern-Europe.\"",
            "I did, but only because of Call of Duty 4.",
            "i dunno why but i always thought it was in korea for some reason",
            "Yes, but only because my home country borders Ukraine. Chernobyl accident happened two years before I was born in 1986. When this took place my mother told me they were told in Romania to not eat anything grown out of the ground for two years. My dad's father was so freaked out he took an Iodine pill. They lived in Bucharest at the time, that was before it was founded as Ukraine and when it was part of the USSR. My country was also a satellite communist country as well.\n\nEdit: slightly more detail and grammatical mistake",
            "Once more America learns it’s geography from where it’s sending it’s troops and weapons.",
            "Yeah, I watched that Top Gear episode where they have to run out of fuel before getting there, they left from Kyiv",
            "Well yeah. CoD4 was every teenage boy's life back then.",
            "It’s Chornobyl and Ukraine. \n\nChernobyl is the Russian spelling.",
            "This is actually one of the reasons why Ukraine gave up it's nukes. People were highly supportive of this because they didn't trust their politicians and actually didn't want another radioactive explosion anywhere. I guess Ukrainians were wrong. P.S. my granddad was a Chernobyl liquidator in 86 and died of radiation",
            "No, I couldn't even guess where chernobyl was because I never even thought about where it could be anyway lmao",
            "Yes but because it was built during the USSR, I mentally associate it with Russia because Russian communism was responsible for the meltdown and secrecy that followed.",
            "I grew up in a town of Ukrainians in Canada . So , yea. Plus Ukrainian food is amazing.",
            ". . . What? \n\nD-did people not know this even after all the recent media made in the past 5 years?",
            "Nope. Assumed it was in Russia. Might be depending on how this all plays out",
            "wow im dumb r",
            "I  always associated it with USSR and that to Russia.",
            "[deleted]",
            "\"What are you doing here Stalker?\"",
            "Yes, Top Gear taught me that.",
            "Let’s be honest half of eastern Europe has been considered “Russia” by Americans the same way Great Britain is just “London” and France is just “Paris”",
            "Yes of course",
            "Umm… Yes, where else would it be?",
            "Wtf I thought it was in Russia",
            "i never actually thought about chernobyl being in a country, like obviously it would be i just never thought of it like that",
            "I knew, then I didn't, then I forgot it is. It was just.. chernobyl. A place with radioctive doggos",
            "I think most people thinking it was in Russia mixed it up cause it was located in the Soviet union when it happened and I think most people just assume Soviet union = Russia",
            "Yes because i grew up in Ukraine 🇺🇦"
        ]
    },
    {
        "post_id": "jo8emy",
        "author": "SarifTheGreat",
        "title": "If I took a cat from Germany and put it in Japan, would it understand local cats?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/jo8emy/if_i_took_a_cat_from_germany_and_put_it_in_japan/",
        "score": 21960,
        "num_comments": 798,
        "created_utc": 1604535677.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/jo8emy/if_i_took_a_cat_from_germany_and_put_it_in_japan/",
        "comments": [
            "[deleted]",
            "Some animals, like goats, do have accents and cannot understand their fellow goats from other countries! Cats really only 'talk' to humans (and their mothers, when they're very young kittens), and communicate with cats mostly nonvocally, so this isn't an issue for cats.",
            "[deleted]",
            "Yes, but they'd likely disagree on political issues.",
            "[deleted]",
            "Fellow Redditors, here we witness the birth of an anime.\n\nIn all seriousness, cat language is generally a body language, and what vocal cues there are tend to the universal, like how a German baby would sound about the same as a Japanese baby.",
            "I moved with my 2 cats from usa to south america then adopted a street cat from there. Can confirm Communication was readily established.",
            "I always think it’s funny when pets know foreign languages. I’m like wow that dog etc. Is more bilingual than me",
            "Probably doesn't matter but I speak to my Korean adoptee cat in the few bits of Korean I know to ensure he remains bilingual because that's important for future job prospects.",
            "Yes French dogs dont go Le bark or French cats dont go Le meow ,except in old Looney Tunes of course.",
            "Humans and orcas are the only species that come to mind that would experience a language barrier when practicing international communication (communication within the same species).",
            "Leider nicht so gut, wie ich es mir erhofft hatte, bevor ich hierher gezogen bin. Mein tägliches Leben als Katze ist in letzter Zeit von Einsamkeit, Hunger und Traurigkeit geprägt.\n\nDas Land Japan ist ziemlich schön, aber leider ist das Erlernen der regionalen Katzendialekte eine verwirrende und mühsame Erfahrung.\n\nEs ist schwierig, eine gute Arbeit zu finden, ohne die richtigen Unterlagen zu verstehen, die erforderlich sind, um einen Antrag bei einer örtlichen Katzenbande einzureichen.",
            "Animal communication is a somewhat misunderstood phenomenon. My daughter asked me once something along the lines of \"don't you wish that you could talk to a dog?\" and my answer was that you can. Here is the problem though - it's a very basic communication and they can receive much more complex of a message than they can send. I asked her if she can tell when the dog is happy? Angry? Afraid? Yes to all. They don't have words, but their communication methods do include vocals, as well as encompassing body, eyes, and anything else that they can use. That is all for communicating TO YOU, now when it comes to them understanding you, they have a little bit more of an advantage. They can understand a much wider and more specific range of communication IN, but they just don't have the tools OUT.",
            "[removed]",
            "My cat doesn’t even understand the cat across the street",
            "Yes, the Germans and the Japanese were allies during the war and so their Granddads probably knew each other or something idk.",
            "There's a funny video that answers your question. \n(satirically)\n\n\n[irish animals dialect ](https://youtu.be/tgoLaO2A0eQ)",
            "Cats don’t tend to meow at each other, they reserve their meows for humans (except for kittens with their litters, they meow a lot but will grow out of it). \n\nCats talk via body language, rubbing scent, eye contact, hissing, hair up etc. \n\nSo yes , I think they would understand each other.\n\nEdit a word because I confused everyone. Litters. Not packs.",
            "This post title legit made me laugh.",
            "Cats are mostly nonverbal, body language communicators. They understand each other pretty universally. This goes for most animals. There's some \"regional accents\" but this might just be how humans raised with different languages perceive the sounds animals make.",
            "You want to bring back cat axis power buddy?",
            "No matter what country a cat goes or comes from, they will still be assholes. Except japanese cats. So fucking cute.",
            "Jokes on you. German cats can't understand anyone. They're all dead on account of their nein lives.",
            "I live overseas, we brought an American cat over with is and we bought a German dog once we settled down. The result is that the cat is confused when we use German in the house and the dog only responds to yelling at him in German and thinks English is the \"nice language\" when he is a good boy....",
            "Last time Germans and the japanese understood each other, it didn't turn out that great.",
            "Baumkuchen?",
            "90% of communication between felines (and most animals) is done through body language.  Some of the communication is verbal (not in the same sense as human verbal.) Things like growling, hissing, purring, etc are what I am considering to be verbal communication.  \nMeowing is more a way for cats to communicate to people than to other cats.  Non verbal communication between animals is definitely a universal thing, and does not vary between countries and different locations.  So, yes a cat from Germany would definitely be able to understand a cat from Japan.",
            "My cat and I are from Australia and moved to Germany. My cat has no idea what the German house-cat is saying. They now communicate by hissing.",
            "Well they're both axis cats, so probably",
            "So this isn’t about cats, BUT, whales from different parts of the world have different dialects and habits. I find that so fascinating. \n\nI’m glad you asked the cat question! Animals are so freaking interesting, it’s fun to think about all of the possibilities.",
            "It is at this point that i wish i had a imgur because i have the perfect picture for this.",
            "The last time germany and japan met it didnt end too well, what are you planning op?",
            "Not sure about cats, but they did a study and found that dogs have different accents lol",
            "Cats mostly communicate through body language so yes they’d be fine",
            "Well I am sure that regardless, a joint decision would be made to leave Italy out of it this time...",
            "all cat language are universal, except human's",
            "German and japanese cats have an alliance",
            "No because every cat in japan says \"nya\" instead of \"miau\"",
            "(Angry German meowing)",
            "It takes a while to overcome the language barrier but it works out after a while. I brought a cat from Poland to England and when he met my existing cat she said something. His face was of pure and utter confusion like “wtf did she just say?”. Their meows are completely different but after like ~3months they started to understand each other.\n\nThis might also depend on the cats ability to learn so it might vary from cat to cat",
            "Anecdotal but when I moved to Asia, I brought my cat from the US. I adopted a cat from Taiwan and now they live together. They have no trouble communicating with each other!",
            "What about dogs and other animals?  Does it work the same way?\n\nAlthough we humans can't communicate with different languages its cool to note that our gestures can be accurately determined.",
            "Just going to clarify that I am not a zoologist; however, I am a student of linguistics. How is this relevant, you might think?\n\nWell, let me tell you; part of my study involves research of language being innate, to this end, I looked at research into honeybees.\n\nHoneybees communicate via something we've labelled as \"waggle dance\" which involves shaking their back in specific directions, speeds, and intensities; each relays certain information... usually a map towards nearest food sources.\n\nThe researcher, karl Van Frisch, took Austrian honeybees and put them in an italian hive; instinctually, the bees knew their job was to gather food, however, when the Austrian honeybee did its waggle dance, it was found that the Italians did not know what the Austrian was doing, thus failed to find the food source the austrian honeybee located.\n\nConsidering this, it is somewhat safe to conclude that each species of animals and insects, that, whilst kinda sounding exactly the same to us, is not the same for cats; that beingng said, there is always the possibility of stumbling upon a sound that each will recognise to mean the same thing, and then we'll cats defining languages the same way humans do (that's a stretch. languages are pretty difficult)",
            "I am afraid not. Cats in different places have different sounds. Check these out.\n        \nhttps://i.imgur.com/peXHJ4R.png                    \nvs                  \nhttps://i.imgur.com/lAZ1Glw.png",
            "If life were a Disney movie, the German cats would speak cat with a German accent, and the Japanese cats would speak cat with a Japanese accent, and they would understand each other perfectly.",
            "Japanese cat here. Ich glaube, ich könnte deutsche Katzen verstehen.",
            "Umm maybe.\n\n Give your German cats some manga and anime. That will be enough for your cat to understand local Japan cats.\n\nP.S. - Try it.",
            "As a Bulgarian I used to be able to just stand around at a random place in my city and say \"мац пис пис\" and a couple of cats would appear and stare at me. We have a lot of stray cats.\n\nYou do this in Germany and all you get is Germans shouting \"HALTS MAUL SCHEISS KANAKENGESINDEL WIR MÜSSEN SIE ALLE ERSCHIEẞEN\"\n\nIt's weird how things work.",
            "A cat? Most likely. Some other animals according to the comments, no.",
            "Murakami would like a word with you",
            "https://www.washingtonpost.com/national/health-science/do-animals-from-geographically-distant-areas-speak-the-same-language/2012/06/25/gJQARLYJ2V_story.html",
            "I kept scrolling then came back because I needed to know.",
            "Similar question : Do they pick up the local accent overtime?",
            "Great question!!!",
            "Thats what we call a Gelical Cat",
            "There is a paper somewhere (Can't be bothered to look) that studied accents of cows from around the world, and found that they do have different ones. \n\n&#x200B;\n\nI'd imagine other animals probably would too...",
            "Oh, so that's the reason why my German shepherd so stupid, he didn't understand a bit",
            "Nein",
            "I honestly feel like cats from different countries don't understand each other.\n\nSource:\n\nHad two cats in Germany. Adopted a third from Russia. Unfortunately, one of the German ones had to be put down a yea later.\nAfter that we moves to the UAE and adopted to local cats who were strangers to each other.\n\nSo now we basically have 1 German, 1 Russian and 2 Emiratis.\n\nIt really does seem like only the two Emiratis talk the same language.",
            "I have German, Italian, and Mexican cats and they all understand eachother and me (American). It definitely took them longest to all understand me versus each other.",
            "There’s actually a theory that cats don’t meow for other cats but for us. So yes they would understand the foreign cats.",
            "Murakami : Write that down ! Write that down.",
            "Cats do not meow at other cats. Kittens meow to communicate needs to their mother, the way a baby would cry, but once they grow up, cat no longer use meowing to communicate with other cats. Cats meow only to communicate with humans.",
            "In UK cows says mooooo but in france they say mo like just a really fast mo sound that’s what my french friend told me so they must have some kind of country language understanding the animals that is.",
            "They may team up and attack cats from britain, france, and the us. But then a bunch of cats from russia and the us will attack and defeat them.",
            "There actually was a study on cows from different countries, where they found that cows moo different depending on where they are from!",
            "Sure it would. All cats speak Catalan.",
            "Cats rarely talk to each other verbally. Nearly all their language is through non-verbal ways. So it's likely a German cat and a Japanese cat wouldn't notice anything different about each other. \n\nI've observed my two cats and I honestly cannot remember any time they have meowed at each other. Silence even when chasing and playfighting. Most communication between them seems to be sniffing\n\nI've found playing a YT of (mostly American I presume) cats meowing always brings my two (Australian) cats out from wherever they've been hiding. Its odd in that they don't respond at all to my meowing but can recognise an actual cat meowing even when it's through my phone. Or better: through my soundbar. The surround sound really freaks them out! They search everywhere for the invisible cats. \n\nSome animals however can develop accents. This is good article about goats:\n\nhttps://www.npr.org/sections/thetwo-way/2012/02/16/146989664/study-finds-goats-adjust-their-accents-based-on-social-surroundings",
            "Interesting question. Can some zoology students do study on this as their graduating project? I’m curious now. \n\nDo one for the dogs too.",
            "You're take the sub-reddit title as a challenge aren't you?",
            "I don’t know.  Japanese can be quite racist towards foreigners.",
            "Cats communicate by scent they don't meow they only meow for humans and each cat and cat owner has their card evelope its own unique language that's why you know what your cat means when it meows",
            "Yes they will remember when they were both axis powers",
            "One of my dogs is from Germany and has lived in Japan for a few months on a couple occasions. He seemed to get on fine with the locals.",
            "I have a degree in cat law and can confirm that all cats are fluent in both German and Japanish",
            "I mean, if you got dropped in Japan I’m sure you would be able to tell from body language if someone is being hostile or friendly.",
            "Yes. Unless the cat was deaf, in which case they would be very confused by the subtitles changing from \"miau miau\" to \"nyan nyan\"",
            "Depends on what year you do this.",
            "Interesting side bar: the sound and the spelling we think animals make is very regional. A friend used to start conversations with immigrant taxi driver all the time with the line “in your country, what sound does a cat/frog/bird make?”\n\nhttps://www.boredpanda.com/animal-sounds-different-languages-james-chapman/?utm_source=google&utm_medium=organic&utm_campaign=organic",
            "Once an ally, always an ally",
            "My dog is a Siberian husky and i don’t think it put the effort into learning English and I don’t speak Russian. It’s the only explanation I have for why it won’t stop harassing my cat when I tell it to stop, or come when I call it.",
            "Well they're both axis cats, so probably",
            "[This cat](https://twitter.com/MikeChannell/status/597010203385683968/photo/2) would.",
            "lol NO ONE understands cats. Not even cats",
            "No, but they would both likely join forces with Italy, and then get all territorial over Poland.",
            "Yes. Those cats stay in the same groove..\n\nhttps://translate.google.com/#view=home&op=translate&sl=de&tl=ja&text=Beatnik",
            "All cats are telepaths and share a common thought language. Any audible communication is born of anger or surprise , like we curse or scream when we are pissed or scared.",
            "OP, what language do you think the cats in Japan are speaking as opposed to the cats in Germany?"
        ]
    },
    {
        "post_id": "v37reh",
        "author": "Linorelai",
        "title": "Please don't kill me guys. out of genuine curiousity, what is the point of adding new letters to LGBT+ when there is a +?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/v37reh/please_dont_kill_me_guys_out_of_genuine/",
        "score": 21953,
        "num_comments": 5111,
        "created_utc": 1654172889.0,
        "selftext": "Doesn't it make the added letters seem more important than the others? Don't people of other letters feel it's unfair to not be represented? Doesn't adding new letters lead to eventually include them all and end up with a ridiculous unpronounceable word?\n\nEdit: I was only dreaming of saying that, but Holy Shit This Blew Up! guys thanks for such a response, you are amazing, and you destroyed my notifications 😆and I can't read any new comments, sorting by new shows no comments",
        "permalink": "/r/NoStupidQuestions/comments/v37reh/please_dont_kill_me_guys_out_of_genuine/",
        "comments": [
            "I just use lgbt(q) cause it almost sounds like one word to Me so it rolls easier off the tongue. Ofc people Will know That its the whole community, not just the first 4-5 member groups",
            "A lot of people even in the LGBT+ community continue to stick to that format for that exact reason, other people just have different tastes as to which ones deserve the same emphasis as the four groups in the acronym (as it stands, Asexual and Intersex people sometimes feel sidelined)\n\nPersonally I usually say LGBTQ+ if I'm saying an acronym because Queer is a term intended to cover the entire umbrella. I'd prefer to just use \"the Queer community\" and usually say that among friends, however the use of the word queer is a much-debated topic of the community because its a reclaimed slur [but it was used before it became a slur too so that's a whole thing, but I digress~]\n\nThen of course you've got people who want to split the community and exclude certain subgroups often due to bigotry against certain them  [you see some transphobic gay and bi folks use just 'LGB' and that sort of thing] so including the extra letters AND the plus could be an indication of goodwill and support for a given group\n\n[To anyone who would object to my use of an arguable slur that they assume doesnt apply to me, I will clarify that I am queer myself]",
            "There have been movements within the LGBT+ community trying to exclude others, so some people try to explicitly include more letters so emphasize that they're not exluding anybody\n\nNot that that's stopping anybody. The \"T\" is always part of the acronym, but the \"Drop the T\" movement hasn't stopped",
            "[removed]",
            "[removed]",
            "This is kinda why I prefer GSRM, Gender, Sexuality, and Romantic Minorities. Short, sweet, and to the point, with no worries about who is or isn't listed.  However, it's not as well known of an acronym, so using it typically means having to explain it.",
            "It’s a decentralized group whose goal is vaguely “to protect and advance the rights of certain peoples”. It started simple with just LGBT, but seemingly tangential groups were added over time.\n\nFor simplicity, some smart fella thought of the shortening “LGBT+” and it’s become fairly popular in the general population. Of course, this doesn’t mean everyone likes it and plenty of people still prefer to be totally inclusive and keep adding letters.\n\nAnd this doesn’t even touch on the fact that there’s plenty of debate as to which groups should or shouldn’t be added. Asexuals are notably ostracized from plenty of LGBT+ groups.",
            "[deleted]",
            "I'm gay and a lot of us have said this, it feels silly to keep making the acronym longer. Majority of the world only knows/uses LGBT, that's how it was originally and that's the most popular version. It doesn't mean other identities are less valid or anything, it's just keeping it short like before, but i do think the + should be included.",
            "I think its so that other identities are also prominent in the initialism and not just condensed to a plus sign, but you can never get to every label so you tack on the plus too. I dont fully get it either though and Im LGBT. Personally I just say LGBT without the plus and hope people fill in the rest.",
            "The additional letters are generally meant to show that the other groups are in fact included. There are unfortunately lots of people both in and out of the community who do not accept certain flavors of gender and sexual minorities. Like the \"drop the T\" movement or the general erasure of asexuality. By putting something like LGBTA, you're specifically saying \"I support asexuals,\" etc. \n\nIt's the same reason why there have been updated versions of the pride flag that specifically include trans or asexual representation. That being said, I don't find many people that *take issue* with just saying LGBTQ or LGBT+ or using the traditional rainbow flag, unless the person using it is doing so specifically to exclude others. They just like to draw extra emphasis to those groups that have frequently been excluded when it's applicable.\n\nI think broadening acceptance is generally more important than whether or not the acronym is \"unwieldy,\" but regardless, everyone uses shorthand when it's convenient anyway. Nobody but a group of fringe pedants is going to care that much about what term you use so long as you're using it in good faith.",
            "I really prefer “queer”. It solves a lot of problems. Does society give you shit for how you exist or interact with the world in regard to gender, sex, or romance? You’re one of us.",
            "I’m not homophobic or anything like that & I hope I don’t offend anyone by what I’m about to ask, I’m just curious to know.\n\nThere are so many things now that I don’t even know. Am I the only one? Are all of the words you hear in the past few years (maybe the last few years idk I just hear a lot of new ones now), new words?\n\nAgain I don’t mean to offend anyone I would just like to know. I feel like there’s so many different words for people now, it’s so hard to keep up, I just want to keep up with the times.",
            "I think the \"+\" represents the fringe groups who lack sufficient defining characteristics to effectively label and the letters represent those segments that are well defined and have  enough significance to warrant a label.  \n\nAs an expert in linguistic efficiency, I suggest we can just use \"+\".  In fact, the other day I passed by a sign that read, \"LGBKT$5\" and I stood there for five minutes trying to decipher it before I remembered I was at the driving range.",
            "Okay since this is a curiosity thread, what is the difference between Pan and Bi? Bi likes both men and women, and Pan liking everything doesn't make sense because no matter what you identify as you have either a penis or vagina and as far as I know Bi-s like both making Pan redundant. Again, this is purely out of curiosity for my own understanding.",
            "I'm asexual (the first A in LGBTQQ2SIAA+) and I don't mind being cut off by the short acronym LGBT+. I recognize that most people know there are other identities besides LGBT, but don't know them each specifically, and being expected to know the acronym will just overwhelm them more. \n\nI personally say I'm a member of the queer community, and I'll share my identity when asked :)\n\nEdit: nobody expects you to have the entire acronym memorized. You can say \"LGBT+ community\" to keep it concise. \n\nAlso please remember that LGBT+ people use labels for THEMSELVES, not for you. We use labels to be able to accurately find resources, connect with communities who share similar experiences, and concisely describe our sexual/romantic/gender identity to people who recognize the label. We do not use labels to \"flex\" on people, and we also don't expect you to know each label. \n\nStraight cisgender people have a great time pretending this is an inconvenience for them when this is a tool for connection and support for us. This isn't about you.",
            "I’ve always wondered this too",
            "Surely it should be L+",
            "The additional letters are for when you want to spell the entire thing out for certain reasons. I don't know anyone who is spelling out the entire LGBTQQIP2SAA acronym every time. It's important they're there so people know they're included, but when it's being written out, most people will just use LGBTQ+ or some other shorthand",
            "Short answer from a massive advocate for my community here: no fucking clue, you're right, its counterintuitive\n\nSlightly longer answer: It may have come about because adding more letters to LGBT to include more people happened before someone decided to just stick a plus on the end. But the momentum kept going, coz people want to see themselves included in the acronym used by their community explicitly rather than implicitly. If they're included implicitly, in a '+', its very easy for certain groups/identities to be challenged and deliberately excluded (eg. aromantic/asexual people as of recent). This is just my guess though. Side note it sucks that queer history is taught approximately nowhere in detail because stuff like this gets easily lost; rationales, details, reasoning, etc.",
            "Whether or not you have a letter doesn't really make that much of a difference. Bi people have had a letter for decades and they're still always left out.",
            "Person in the LGBTQIA+ community here.\n\nI hate calling it that. It's stupid. I just call it the Pride community, because I can't reasonably see that name excluding anyone. We all deserve to be proud of who we are.\n\nThe acronym with letters and plus can make it seem like anyone who doesn't identify as or fall under lesbian, gay, bisexual, transgender, queer/questioning, intersex, and asexual, isn't as important and thus is only to be relegated to plus.\n\nWe're all just as important as the next one, regardless of how we identify, and I think it's completely fair to just use Pride.",
            "I thought lgbt+ was a new streaming service",
            "On a similar note, why are there so many rainbows? Wasn't the point to represent inclusion in the first place? Doesn't every new rainbow diminish that?",
            "To be very honest the motivation to add more letters confuses me. Like ten fifteen years ago it was all „no labels, no boxes, be what you want“ and now it‘s like the more specific label the better. If people feel like needing these specific labels to feel included, okay, I‘m just confused about it.",
            "Omg yes this has always bothered me.. I'm gay, totally support every single letter in existence, I think everybody should be themselves and that's great and it's none of anybodys business.\n\nBut yes... there's a \"+\"!!!!! The + means that there are more letters following! The first few letters aren't the only minorities that matter, they're just a familiar acronym to identify the group represented by the + (which is sexual/gender/romantic minorities). There are SOO many letters, we're always going to have to exclude some unless you want like a 200+ letter acronym which makes no sense. \n\nExcluding a letter is not saying that that letter doesn't matter, it's just for ease of reference. Saying LGBT+ references ALL OF US. \n\nIn essence, the only people getting mad and wanting to add more letters don't understand language and are kinda dumb.",
            "there’s actually a shorter acronym: gsrm\n\nit stands for gender, sexual, and romantic minority",
            "Because everything now has to be labelled and I, for one, am sick of it. I'm all for everyone being equal, but the more people have an agenda and a movement, the less I care. I don't see how that can be beneficial in the long run. Especially when there's such infighting in the movement and they're starting to unironically judge other minorities within that same movement.",
            "I’m old enough to remember it being just LGB. I believe in Canada it is 2sLGBTQ+. So that is the least and most inclusive I’ve ever heard.",
            "I thought the plus meant HIV-positive. No?\n\nAm... am I an idiot...?\n\nEdit: this wasn't a joke, I'm just an idiot",
            "Basically to have others feel included. I’m technically part of the community but I don’t even like doing anything more than the + or just the Q because queer is an umbrella term and so is the +. I especially don’t like adding the 2 into it because I’m indigenous and being two spirited is so much different than just some sexuality. It has a cultural significance and it’s opening the door to non-indigenous people claiming to be two spirited. \n\nI’m pansexual/bisexual and at this point in my life, I really don’t care to add all of the other letters. I’m open minded but it’s redundant. No matter if there’s added letters or not, you’ll have to explain to others what you identify as if they are not aware of what it is so what real difference does to make to add so much more than Q or +. I dunno.",
            "I'm a gay who is extremely open minded, be who you want to be, whatever, but I personally don't understand the whole 'everybody NEEDS their own personal flag/gender identity concept. \n\nA friend of mine posted a status recently about how she's...let me see, something like gray asexual/nonbinary and her pronouns are she/they and she hates having to explain that to people. \n\nI'm sorry, but...okay??? Most people probably don't ask and never would think too. It's YOUR personal business. My sexuality affects nobody else. I've never purchased a flag to display to tell anyone about it. \n\nSo I don't know what the purpose of the new letters is, I have heard that it's to block discrimination, and that + is simply non-inclusive or something like that.",
            "There's a divide in the community between those who just use LGBT+ as an umbrella term and those who prioritize hyperspecific labels so you can find LBGT+ people who use variations in the term.\n\nI personally think adding labels and colors to the \"brand\" makes it weaker in terms of cis people becoming more familiar with it.\n\nAlso the flag doesn't need more colors because the rainbow conceptually include every color, that's the point of the flag.",
            "It’s kinda dumb in general lmao. LGBT+ is enough. Q works instead of the + but it doesn’t account for stuff like intersex, asexual, etc. so the plus is much better",
            "As a gay guy, I think that expecting people to remember \"LGBTQQ2SIAA+\" is absolutely ridiculous, unrealistic, and harmful to our community.  I've seen first-hand how difficult is is for most people to memorize \"LGBT+\" so expecting them to memorize \"LGBTQQ2SIAA+\" is a complete and utter joke.  You could probably count on one hand the number of people who are going to remember this acronym...  \"LGBTQQ2SIAA+\" does nothing other than make the LBGT+ community less visible (ironic considering this is an attempt to increase visibility) and it ensures that people will forget it and thus forget about our community.    \n\n\nNot only is \"LGBTQQ2SIAA+\" obnoxious, it's also not \"all-inclusive\" nor will it be until it includes ALL sexualities & gender indentities (of which there are hundreds).  Our community needs to vote on this and decide whether we want to be known as:  **LGBT+** or **LGBTQQ2SIAARIGHPGASLNLTTBDLTRTNTAPLASBGAPALLPQSPTIAPCLBBBIOQCNINXASVPLGANDGPSTNGFFGPGDPPPATNANEMEAQDTLHTAAAQARDPLIDPDGDPOAADGLGGGQ...+**(I've included as many as possible but even this acronym is still not all-inclusive).  \n\n\nI believe that it is far more beneficial for these other minorities to be represented by a plus symbol than for them to be represented by something that looks to have been created by someone face-planting their keyboard.",
            "The + actually stands for premium. Its LGBT but with benedits like healthcare and dental",
            "Q+ would probably cover all the bases, but it kind of sounds like a programming language",
            "When one of the core tenants of the movement is inclusiveness, you’ll naturally have people who feel excluded if their demographic isn’t explicitly listed in the acronym. \n\nPersonally, I think the acronym is getting a bit out of hand and think we should just come up with a word that’s all encompassing of people who aren’t traditional heterosexuals.",
            "A gay here, it is mostly done by those striving for more hyperindividuality and is purely performative imho.",
            "I'm a member of the LGBT and even I don't take this shit seriously anymore. There's no concensus. Welcome to the circus.",
            "Anymore I just use the term Alphabet Gang",
            "I work for Pride events and totally agree about the confusing branding. Problem is that it's not like a single organisation dictating a re-brand or something. And it's about inclusivity + diversity, so dropping letters has a lot more meaning then just a re-brand",
            "Hey, don't feel bad for asking! It's always a positive to seek understanding, no one minds as long as it's respectful. \n\nTo answer your question the + isn't there as an etc... which is what I think most people outside or new to the community interpret it as, but as a symbol that recognizes that Queer* identities and our understanding and categorization of them is constantly evolving and changing. Some things change names depending on cultural factors, generational divides, gaps in our collective knowledge and many other factors. The + is supposed to acknowledge that and welcome people who may belong to a fringe community due to cultural or personal identity reasons or people who simply do not want or have not found a label to represent who they are.\n\nSome people in this thread have pointed out already that Queer* is an umbrella term and you're right! But Queer* has a very complicated and controversial history that makes it unsuited to be a broad representative of the LGBTQIA+ as a whole since many people do not see themselves as Queer* and emphatically reject that label.\n\nAs for the difference between Lesbian and Gay (men/mascs), as some people have pointed it out as well, it might seem like a pedantic division from a language point of view but historically the Lesbian community has a very marked intersectionality with Women's Rights movements which makes them a separate and individual community from Gay Men/Mascs, hence why they are represented in the acronym.\n\nThe LGBTQIA+ has a rich and full history that has unfortunately been much neglected in the mainstream media and with the younger generations, partly due to a lack of elders to tell it, but I hope what little I was able to share was both interesting and answered your question regarding our acronym. Oh, and happy Pride Month! :)\n\n*I have used queer here because I personally endorse the use of queer as an umbrella term/identity but this is not at all a viewpoint shared by all members so please ask your friend/acquaintance about their personal stance before calling them queer or you could find yourself in quite the awkward situation.",
            "[removed]",
            "I literally only see companies or organizations use LGBTQAI+ \n\nI don't care either way I just call myself queer because labels are too confusing and there's a fuck ton of overlap between them.",
            "It's funny that the movement has to keep adding more letters to be inclusive of everyone. It's a losing game lol\n\nJust keep it at LGBT or come up with a different name altogether lol",
            "Hot take: Q stands for Queer and should just cover all the bases.\n\nSource: a queer",
            "I just say the alphabet gang. It covers everything and it's future proof.",
            "It really comes down to the individual and how they see the world. Personally for me it’s lgbtq+ and about sexuality. Gender and race shouldn’t be a part of it. For me everyone is equal no matter your background. Be a decent human being there’s no need to look it at it outside of sexuality imo. As a first generation Latino, I’ve only seen this issue in America a lot. Outside of it, not that heavy.",
            "The fact you need to preface this with \"please don't kill me guys\" is crushing.",
            "Straight: One syllable\n\nLGBTQ+: Too many syllables\n\nIt's probably because it's frustrating talking about it, when it shouldn't be, just from all the extra wordage and energy that goes into making sure you say it right. Like having a conversation with a pompus english or science major who has to use the biggest combination of words they can muster, and people are asking why they don't just use layman's. Yes, that's a fancy word vomit you got there, but can we just refer to my pets as \"dogs\" instead? I'm just taking them for a walk."
        ]
    },
    {
        "post_id": "rttpmz",
        "author": "horker_meat123",
        "title": "How do worms stay on the hook?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/rttpmz/how_do_worms_stay_on_the_hook/",
        "score": 21924,
        "num_comments": 1759,
        "created_utc": 1641074420.0,
        "selftext": "When fishing how do worms stay on the hook?  Wouldn't they just fly off when you cast the line.\n\nEdit: I have now realised despite the sub's name, this is a stupid question.",
        "permalink": "/r/NoStupidQuestions/comments/rttpmz/how_do_worms_stay_on_the_hook/",
        "comments": [
            "You impale them on the hook",
            "Impalement",
            "Not a stupid question.\n\nWhen I took my kids fishing the first time I assumed they knew what happened to the worms. They didn't. \n\nWhen I explained that you had to insert the hook in the worm  they refused to do it. So we came back home with no fish and a bunch of pet worms.\n\nHappy New Year",
            "Favorite ask of 2022",
            "There's usually a barb in the hook. You put it through the worm and the barb keeps it from slipping off.",
            "Contrary to popular belief, they are **not** hugging the hook with their tiny arms",
            "I believe that I once saw an old looney toons cartoon in which a worm was prompted to stay on the hook under duress of being shot by a gun. I haven't fished since I was young, so this may not be the modern strategy.",
            "[removed]",
            "[removed]",
            "Dude you stab the worm with a barbed hook, it’s not holding onto it of it’s own free will",
            "[removed]",
            "[removed]",
            "You stab it through the body\n\nEdit: why the fuck is this comment poppin off rn?!?! Reddit is a confusing place...",
            "You dont pierce the worm perpendicularly, you run the hook through the length of the worm, and since the hook has a one way barb, it stops the bait from falling off",
            "[removed]",
            "You pierce the worm's body so it stays pinned on the hook.",
            "[removed]",
            "10% luck",
            "[removed]",
            "It’s not a stupid question OP, I remember being taught as a kid that I would have to pierce a living creature with a hook if I wanted to go fishing - therefore I don’t fish. But if you weren’t taught that then how could you possibly have known.",
            "Oh boy. Homie thinks the worm sits on the hook.",
            "This is not a stupid question, at all.  If you've never been fishing, how would you know?\n\nBasically, worms stay on the hook because you put the hook *through* the body of the worm so it stays put when you cast it.\n\nThere's several different methods, some of them even have names (The Texas Rig being one) and there's even some special tools you can get (Daiwa Worm Threader) to help you bait your hook correctly.",
            "Not a stupid question. It’s already been answered but even when you do hook it on right sometimes they do fly off :/",
            "This was incredible and light hearted, thank you lol",
            "Lol bless your innocent little heart!",
            "This is my favorite question of 2022 ♥️",
            "When you think reality is like what you see in the cartoons….",
            "The worm is impaled on the hook.",
            "The worm is a paid actor. \n\nalso, HNY.",
            "Some don't, but that's why you use a worm trained in fish communication. It's literally it's *job* to go down and talk the fish into coming up. \n\n(Joking aside I literally didn't realise they were stabbed until now, but I'm gonna make snarky comments anyway. In my defense, I remember back in the day in club penguin they just sat on that hook like good little worms in the fishing game—now I realised I was just sparred the brutality)",
            "Perhaps a better question for me to ask right now, is what’s the hook in my life, and what is the barb keeping me on it?",
            "I absolutely love your edit",
            "Every once in a while a question appears here that just makes you stop and think what was this guy thinking. Did you think people wrapped the worm around the hook like string?",
            "You hook them",
            "Looking at the answer makes me hope worms can't feel pain",
            "Don't you ever change, OP. :)",
            "Magnets.",
            "Advanced yoga",
            "You have time bribe them.",
            "it's ok a lot of cartoons show that [worm sitting on the hook](https://youtu.be/Dzbes9wiMJM?t=288), i don't remember ever seeing them show a worm impaled on the hook a few times.",
            "They do infact sometimes fly off the hook, either because you cast too hard and the hook rips out of their body, or the worm gets damaged from multiple casts or getting caught on something, and then you cast again but it flies off since the body doesn't have enough structure left.",
            "I never felt bad about fishing with worms til I had to read about technique in this thread and now I'm like \"good God I do this to worms I'm a monster\"",
            "The only stupid questions are the ones you don’t ask.\n\nI could go into how I just started learning how to fish and all that, but that doesn’t matter.",
            "Painfully",
            "They will fly off if you don’t impale and wrap them on the right way.  Or just push the hook through the worm long ways.  Ask me how many times a fling the worm off my hook before I learned how.  \nThis is not a stupid question.  Just a question from someone that either has not fished or just been once or twice.",
            "Well, I'm glad you found out this way, instead of being out on the lake and realizing you're going to have to impale a living creature yourself.  Never had much of a stomach for it, either.  Childhood sign I was going to end up becoming a pacifist as an adult.",
            "Just tell them to wrap themselves around the hook",
            "They have to be well trained, disciplined to stay on task.",
            "You ask nicely",
            "The trick is don’t use a worm at all. Just put the hook in the water. You don’t want to actually catch any fish because it will just interfere with your beer drinking.",
            "The hook has a barb.  Impale the worm just enough so the bard will hold them in place.",
            "Just wanted to comment, believing you have the question, to say this is not as stupid as you might think. \n\nIt is actually rather common when someone is first learning to fish.",
            "Oh dear child...",
            "If only you knew how a hook works.",
            "[deleted]",
            "This is kinda my favorite question ever asked here, tho.",
            "Start with a joke and hold the punch line",
            "Man i thought you tied them around the hook but I guess it turns out I'm an idiot",
            "i used to think you tie it on like a knot and that grossed me out",
            "A rubber band helps…",
            "Wholesome start to the year!",
            "I am literally going down and liking all the replies as some have made me laugh!",
            "Buy a worm threader. Its like a thin metal stick with a hollow point. You push the threader up the worm's ass, all the way thru the body out its mouth. Put your hook point into the hollow end of the threader and pull the worm off the threader, around the hook and onto your fishing line, leaving the point of the hook protruding. Have a split shot weight about 8 to 16 inches up and you have a fantastic trout fishing rig.",
            "there are no such things as stupid questions. truthfully is as easy as it looks. you tell the worm to lash on and wait for its pending doom.",
            "Barbs on the hook keep the worms on as well as fish if you catch any.",
            "There’s definitely a trick to it. My dad is good at it (much better than I am) and he kind of twists it and doubles it over on the hook each time, and you want to impale it three or four times. I try to do it and do sometimes lose the worm.",
            "They hang on to the hook.  They’d rather stay on the hook than hop off it and get snatched up by a fish.  Worms who stay on the hook have a better chance of surviving than those who don’t.  So they hang on to the hook out of fear for their life.  It’s animal cruelty really",
            "You tie the worm in a knot, and let it fly",
            "Reading the edit made me chuckle. Still isn’t a dumb question, I just imagined OP hasn’t gone fishing before.",
            "Maggots are used more after than worms from my knowledge and they have excess skin on their backs which you stick the hook through",
            "I love you OP",
            "When my family went fishing we always impaled the worm on one side of its body and pushed the hok through so the work was on there similar to a sock. No to little risk of falling off that way. Although now that I say it out loud, we tortured those poor worms before they died.\n\nAnd don't worry about it, no stupid questions means that there's no shame in asking about something that might be commonplace to some people. Ask and you will be answered, anyone gives you shit then they don't get the point of this sub.",
            "Do people actually use worms still",
            "It’s ok. I never really thought about this question cause I don’t fish. But I wondered a little.",
            "If you don't tie your worms into a truckers hitch around the hook, you ain't a real fisher.",
            "I legit thought you tied them in a knot..",
            "I used to cut the worm in half and put it on the hook like a sock and then just poked the tip through the worm so it’s exposed. I try not to use live bait anymore though. It’s not worth it and it feels cruel.",
            "Sometimes, they don't! 😃",
            "Additionally, when casting a worm on a barber, you shouldn’t be whipping it too hard out there lick you do for a spinner bait or artificial. I usually do a side handed pitch or underhand so I don’t but a lot of force to sling the work off",
            "I use bait holder hooks that have little barbs on the shank. That keeps them on. The main barb on the hook does a pretty good job as well.",
            "They think the hook is another worm trying to hook up with him",
            "if your having trouble you can switch to crack as bait. I once knew a guy named hank that had all the bass in the local waters riled up every time they heard his boat.",
            "You convince the worm that it’s a good idea or tricking it as a challenge of who can hold their breath the longest. Tell it you will time it and lower it under while it holds on, and worms can’t swim! They are luckily very dumb.",
            "Bait worms are naturally horny.  When they see the curve of the hook, think it's some skinny worm chick, and just start humping away even while immersed in water.  They hang on for life while trying to get the skinny worm chick to reach orgasm, and are so persistent at trying to give the girl a good time they'll hold on forever.",
            "It’s fucking horrible to do, but you impale them on the hook. I won’t ever do it again.",
            "The hook has a little barb that keeps the worm and fish on",
            "The worms you would use for fishing are usually much thicker and longer.  Think big, fat juicy upon noodles.\nYou hook through them long ways.",
            "The worms used are generally nightcrawlers which are definitely way bigger than you think, especially compared to the hooks used with them",
            "Worms don't usually slide around on the hook too much. Plus the ones I use, have a point on the edge pointing towards the actually hook itself. So if the worm does slide towards the edge, it would just get caught again so it's unlikely to slide off.",
            "If you are a beginner, yes, they will fly off. You will learn how to wrap it around so it will stop flying off",
            "[The Big Bang Theory](http://www.youtube.com/watch?v=lh477hHTI5w&t=0m52s) covered this pretty well",
            "Stick one through your finger and you'll figure it out.",
            "Easy:...The worms stay really \"dug\" into the hook...\n\nAnd barbs are really only important when saltwater fishing..circle hooks on the other hand are primarily a live bait hook and wouldn't necessarily be any more effective when \"freshwater\" fishing...",
            "OP has an absolute heart of gold by the sounds of it, poor worms",
            "Worms are pretty tough. If you manage to stab it on the hook a good amount, it'll stick when you cast it. Though some worms manage to wiggle free or the fish/another animal may only get some on the worm but not all of it and not get hooked. When that happens, make sure either to put a new worm on the hook or re-impale what's left of the first worm :).",
            "The barb onthe end of the hook prevents the worms from escaping.",
            "I just read the Headline as: \"How do Woman stay on the Hook?\" lol.",
            "Most hooks have a back catch that should prevent this.(look at images of hooks to see what i am refering to. You can also double pierce them. I've never had them fly off the hooks.",
            "This question is so wholesome and I love it.",
            "I have had earthworms fly off the hook",
            "I don’t like using worms for bait but there’s special ways to hook them repeatedly in a knot sorta. Shrimp is so much better for bait, whether it’s live or just pieces of shrimp",
            "Well. Way I see it is, you've learnt something here. On a few levels too. If you enjoy fishing mate, keep doing it. I love it.",
            "There is a barb. Also if you slide the length of the worms body onto the hook it is thoroughly impaled. I've fished with hot dogs and those fly off if you don't cast gently. But a nightcrawler is much more dense and supple than a frankfurt.",
            "I thought they are dead?",
            "Most fisherman I know that use nightcrawlers also use a tool called a worm threader. Basically a long, thin hollow tube with a handle. You skewer the worm lengthwise, stick the point of your hook in the exposed hollow end then shove the worm onto the hook and up the line. This keeps the worm more or less extended and secure on the hook.",
            "That’s a question that gets right to the point!",
            "Sorry, but I stan those fuckers twice so they don’t fall off the hook.",
            "You find the rectum, then the mouth with the hook. That usually keeps them quiet and on the hook.",
            "If I stabbed a rebar through your gut and then bent it 180 degrees and stabbed it through you again would you fly off?",
            "They hold on really, really tight.",
            "Blackmail",
            "Fun fact. Worms are 94% water. Hydrogen bonding causes the worms to adhere to the hook due to the dimond like structure that forms between the nets of Oxygen and Hydrogen atoms.",
            "I’m really disappointed that, at no point on this thread, has worm goatse come up.",
            "Found the city boy",
            "Shish Kabob",
            "Ask Barb",
            "The hook goes through the body of the worm a few times at different points on the worm so when you cast the worm is stuck on the hook",
            "Sheer determination. After being agonizingly impaled upon the barbed hook, the worm cannot take his woe out on the fisherman, so he focuses on the next worst thing: the motherfucking fish. \n\nYeah, worms're like the US working class--easy to turn against the middle class (who thinks there's nothing wrong with scoring a free lunch.) And the fisherman whistles on his way home with a basket full of fish and plenty of worms for the next outing.",
            "Not a stupid question, especially if you don't know anything about it. Here's an example of a stupid question: While I'm working an airport gate, an idiot walks up to my counter. I say idiot, not because I didn't like him or my job - he seemed nice and I enjoyed my job - but because his question was SO FUCKING STUPID! Anyway, he proceeds to say out loud, \"Gate D54 \\[Airline\\] flight 1291 to Charlotte.\" Then he looks at me and says, \"Is this gate D54 \\[Airline flight 1291 to Charlotte?\" I just looked him right in the eye for a 3 count, turned my neck to look at the gate monitor, looked back at him and said, \"Yes, yes it is.\"\n\nBut back to you... Putting a worm on the hook is pretty gruesome if you think about it. You (or the fisherman \\[master baiter if he's an expert\\]) impale the worm with the hook in a few different places along the body.",
            "The same way Vlad the Impaler's lawn ornaments stayed in place.",
            "The hook is barbed making backwards travel on the hook unlikely. But sometimes worms do make it off.",
            "Put them in handcuffs. That’ll teach ‘em.",
            "No such thing as stupid question except one that goes unasked therefore unanswered.  The hook is barbed in most cases to ensure the fish and therefore also the work remain in place.  Slides on easily but not off.   Various ways of putting worm on.  For example:  Can go tip to tip through their center so worm fits like a sock covering the hook or can go in and out its sides a few times so fits on hook in a few \"S\" patterns and leave longer piece of the  head and/or tail free to wiggle and hopefully help attract the fish.",
            "It’s a hook….. wtf are you serious?",
            "Like all things in life, it's a careful balancing act. But the pros make it look easy.",
            "PSA: No worms were hurt in the making of this thread",
            "I mean as far as impaling them they also have like tougher skin like us humans instead of slime. If you pierce your nose it doesn't just fall out.",
            "I thread the worm all along the hook and up the line so no metal is exposed. A friend gave me a tip run a wire through the worm and from there push it on the hook stays on better and supposed to be better looking for the fish",
            "They hold on for dear life",
            "You ask the worm to stay on the hook nicely",
            "I just put the worm on the hook like a sock",
            "Honestly this isn’t a stupid question at all. Worms stay on the hook for several reasons. Similar to why what you’re trying to catch stays on the hook. But most importantly, it’s all about how the worm is attached to the hook that matters.",
            "Granny Knot",
            "You impale them on the hook, the hook is very thin and extremely sharp. You can try skewering a gummy worm on a needle for reference (but the hook is thinner and sharper than a needle)",
            "they just hang in there",
            "You just gotta soak em in a little beer for a minute and they get all drunk and wound up and it’s like riding a rope swing for them.  They just hold on tight.",
            "Ugh I hate fishing. As a kid I LOVED it. We’d stand at the dock and cut up worms and my dad taught me how to filet them. Cut to years later after art school, flirting with veganism, coming out as gay and finding a boyfriend with a cottage on a Great Lake, I thought I’d give it a go again. Nope. I didn’t like the worm cutting part, and even if I did catch a fish, I had a visceral memory of the fish spines(?) on their back tensing and flailing. And it was so hot out, despite being 10am (we should’ve gotten out earlier but it’s hard to get the fishing boat down to the shore) and I’ve learned I hate fresh water fish. AUCE perch, I’ll pass. I’ll rather just enjoy my time on the water and drink, or paint, or whatever. I don’t want to dislodge a hook from a fishes eye ever again.",
            "Same way Jesus stayed up on the cross.",
            "The hook stabs thru them, usually multiple times. The end of the hook is shaped so it can’t slide back out of the fish’s mouth or the worm",
            "Cartoons show the worm happily wrapping itself around the hook and holding on as it is dropped to its death.\n\nIn reality, you stab it, fold it, and stab it again while a raised bit at the end of the hook prevents it from coming off (which is why when a person gets hooked, they have to cut it and push it the rest of the way through rather than simply yanking it out.)",
            "It doesn't sit on the hook like a cartoon bro😂 I can just imagine op spending all day on the water just casting out his line and reeling it back in after the worm flies off.",
            "The sheer innocence of this question.",
            "They hold on to the hook with their strong arms",
            "Your edit is priceless",
            "This is by far the best comment thread I've read in a while!",
            "You tie a knot of course",
            "They don't stay on the hook. A helpful honest fish grabs them when they fall into the water & gets hooked when they try to put them back on the hook for you.",
            "Zip ties",
            "There are no stupid questions, Buddy. Just inappropriate places to post them. Your question is not one of those. \n\nYou impale the worm on the hook. The hook has a barb that prevents the worm from falling off.",
            "You train the worm to hold on tight",
            "Ugh you just brought up memories of my papa tricking me into thinking we tied them to the hook..... imagine, a seven year old, trying to tie a fucking worm into a knot around a hook.... thankfully they didn’t let me suffer long and then told me the lovely truth of ease, just impale the little things and all is well.",
            "> Edit: I have now realised despite the sub's name, this is a stupid question.\n\nIn other words, this in not a stupid question. Just a bit funny how you were only familiar with cartoon fishing xD",
            "Glue.",
            "The subs name is supposed to mean more that there are ‘no stupid questions’ so this is the place for questions like that",
            "We always knot the worms the night before, then we can just slip them on the hook the next morning.",
            "Motivational dialogue",
            "It's not how deep you fish it how you wiggle your worm",
            "The barb of the hook keeps the worms on.",
            "The edit lmao, you good"
        ]
    },
    {
        "post_id": "msopdb",
        "author": "kriscrossi",
        "title": "Are ridiculously expensive funerals one of those fucked up american things we don't realize is fucked up, or is it like that everywhere?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/msopdb/are_ridiculously_expensive_funerals_one_of_those/",
        "score": 21894,
        "num_comments": 1924,
        "created_utc": 1618657301.0,
        "selftext": "For reference, according to google funerals here cost between $7k and $12k on average.\n\nEdit: thank you for all the answers!\n\nEdit2: I had no idea prince phillip's funeral was today. I made this post after seeing a gofundme to help pay for funeral costs.",
        "permalink": "/r/NoStupidQuestions/comments/msopdb/are_ridiculously_expensive_funerals_one_of_those/",
        "comments": [
            "Definitely also very expensive in post Soviet countries. Funeral agents somehow get info from police/ambulance when someone is dead and arrive sometimes as soon as minutes after the emergency services left. They then use the relatives distracted state of mind to get them to agree to ridiculous prices for everything (not like there's an alternative tho). Absolutely disgusting vulture practice.",
            "Caitlin Doughty — Ask a Mortician is a pretty famous YouTube channel and she goes into the costs in the US in a detailed way. [expensive funerals](https://youtu.be/yDfppCbKAXY) [her channel link](https://youtube.com/c/AskAMortician)",
            "Theyre expensive in Canada. Run you about $10k on the cheap end.",
            "Funerals in Australia can cost upwards to $10K. Cremation is a fraction cheaper than burial.\n\nEdit: To clarify, I'm saying cremation is not much cheaper than burial when it should be a _lot_ cheaper.",
            "In UK you can do it yourself, \n\nYou can buy a cardboard or willow reed coffin or you can make one from wood yourself.  There is no law requiring a coffin, the body can be simply wrapped in a shroud and a stretcher used to carry it between 4 people.  \n\nYou can pick up the body from the morgue/mortuary yourself, take it to your car. The morgue staff will let you use their gurney and they will assist you to get the body into the coffin. Your car, must be able to safely transport the body/coffin, you can use a trailer if you need to. Some long cars with fold down rear seats will be big enough inside for a coffin.   \n\nYou can then take it to a crematorium and pay for a cremation.  Or you can take it to the cemetery who will have prepared the hole or you can bury the body on your own land in the household garden for example.",
            "I'm donating my body. I've had so many surgeries and weird illnesses, it should make for interesting reading by some med student",
            "MIL passed in hospice. My spouse had prearranged to crematory who came directly to collect her. $500. I went there two days later to pick her up, carried her to her childhood hometown for chapel service, the out to plot she had picked decades earlier.  Never engaged with funeral industry. \nMy kids have specific directions to cremate and distribute ashes in River. Flow down to the sea and become part of the earths cycle. I think the practice of burial is barbaric. Family is scattered all over the country, I don’t want them to think they need to travel to a specific place to muse over my corpse. Just go out and stand in the rain.",
            "My wife passed away 5 months ago, collapsed here at home. I called an ambulance, which was $1,000. The fire rescue team had arrived before the ambulance, so the EMTs didn't do anything, but still $1,000. My wife was already gone. She wanted to be buried, no cremation. I bought a burial plot, which was $900. The embalming, visitation, funeral and burial were $8,200. I am now saving for a headstone, at about $3000. When I pass, our son (and only child) knows to have me cremated. No viewing, no funeral. My ashes can then be put in the same plot as my wife. I had a little life insurance on her, not much. It is bittersweet. My wife(we were together 38 years) was a well known and well liked person. There was a large turnout for the viewing and funeral. She was buried about 1 mile from our house, so I visit her regularly. I'm glad I spent the money for her. She had a good send off, and I am glad so many people showed their respects. I love you Paulette.",
            "I have seen where they put your body in the root pod of a tree and plant you.\n\nI like this, make me a part of the earth.  Don’t see the need for a casket and a cemetery is a waste of real estate when after so many years, no one is gonna know I even existed.",
            "Not just in America, here in Namibia it's the same too.",
            "You should see what the Ancient Egyptians used to do",
            "In countries where Muslims are the majority, its all free. All the men neighbors come to participate in burying the deceased, and in my home country, Indonesia, the women come to give staple foods or money as a form of empathy and solidarity. The lands for cemeteries are for public so everyone can be buried there.\n\nTho the expenses are not for the funeral, we have some kind of praying events (just the culture, not by the religion, therefore optional) which involve a lot of heavy meals for around one or two hundreds of people every couple of times to commemorate the deceased.",
            "Not unique by any means, but definitely much more on the expensive end here than many places — in many countries cremation is the norm, not burial.",
            "In SEA, the muslims has lower funeral cost (just dig a grave, prayer and chugged them into the grave) while the Christians has relatively higher funeral expense (had to do all the coffin stuff)",
            "Just looked up that the average cost in the UK is £3,837 (which is $5,310). So it’s not that much cheaper here.",
            "This is a good question. At first I thought you meant americans spend more to have lavish funerals intentionally (which some people do, I know) but I think you mean that the costs here are just crazy. Maybe things aren't so expensive elsewhere. I know that just to have my mom cremated with no other services (per her wishes) other than an obituary in the local paper, cost nearly $3000. I can't imagine what it would have cost for a wake, and a gravesite funeral, plus a burial plot. I'd probably still be paying for it 3 years later.",
            "That's shocking, in Egypt and all arab countries, it is almost for free.\nNo one wants to get paid for such a service.",
            "When I go, just put my carcass in a cannon and yeet me into the ocean.",
            "Insider tip from someone that is intimate with both a funeral home director and wedding industry pros... They're both, equally, predatory.\n\n**You do not need to spend money to grieve or to celebrate.**\n\nfuneral homes and wedding pros will guilt you into feeling like you're doing something wrong by wanting to do your own thing but it's your life and your death, spend as much or at little as you want. \n\nMoney does not determine the validity of ritual.",
            "In Brazil that seems pretty normal for a private funeral without the cremation ceremony.\n\nIn 2017, funerals were costing about 20k reais, the dollar was around 3 reais at that time, so 20k / 3 = 6.6k dollars. Yep, pretty normal, unfortunately. \n\nIf you add cremation, this could easily amount to 20k USD. It could even exceed the 20k if you decide to do something with the ashes, such as making a vinyl record, crystals, diamonds, etc.",
            "I’ve already told my wife to donate my body to science, cremate me, use the ashes to grow a tree, etc.  For a funeral go to a buffet or something.  Don’t waste money dealing with a body I’m no longer using.",
            "In Mexico a funeral is super expensive. Many people buy funeral packages when they are alive so that when they die, their family does not have to pay much. There are prob between 10-20k (dollars). Of course there are cheaper options.",
            "$7k is basic removal of a body and cremation. An actual funeral and grave will be way more than that.\n\nThere are a lot of differences between the death industry in North America and Europe. For example in Europe you have to pay for your grave every 10 years. Once you don’t have a relative paying for you they dig you up and reuse the grave. In North America they are forever spots and that makes them expensive.\n\nThe freakonomics podcast had a good episode lately on how in North America we’ve tried to distance ourselves from death and that is how a giant industry is able to capitalize.",
            "You've gotten a lot of good answers but I just want to add that the church part of the funeral if you choose that can be pretty inexpensive. I'm a church musician and I sing a lot of funerals (4 next week alone). I'm only paid $50 (admittedly though that's on the low end). I also run the music program for the church, so a lot of these people I know fairly well. If it's someone I was close to, I will refuse payment, and I know that's the same for everyone else involved. There's a small church donation, one for the priest, and also the organist gets paid. We've even started printing programs for free since we can't have shared hymnals in the pews due to covid risk.\n\nAll the expensive parts are the funeral home. You don't have to have the wake, but I would suggest doing one unless you only expect like 25 people. You can have a small visitation at the church for an hour before the funeral. I don't think that costs extra. We'll be there setting up anyway. I suggest you skip the flowers in favor of prayer cards. I keep some in my church binder and it's a nice reminder. Get a book for people to sign from a craft store or Amazon for like $12. \n\nAlso, if you have the body cremated, they will return the ashes in a paper box if you ask. My husband and his brother made their dad's urn in my husband's garage workshop, and it's beautiful and personal.\n\nLong story short, some costs are unavoidable, but most of the flair is entirely superfluous.",
            "South African here. Our funerals are damn expensive but there's enormous cultural pressure to make it a large celebration of the person's life (this varies by cultural group though). I've seen many, many people drive themselves into crippling debt just to meet familial expectations.",
            "I want every organ donated and the rest of my body donated to science.   \n\nFor the funeral I want a cookout with plenty of BBQ (smoked meats, not burgers and hot dogs) with plenty of beer.  I realize there will be some tears but I want three to be much more laughter.  Oh yeah, also I want Gone Away by The Offspring to be played pretty much on loop. \n\nMy wife knows this too. Traditional funerals are expensive and miserable.  Most people believe that there is some sort of soul that cares about the funeral their ex body receives.   Also, people that get life insurance checks from their deceased loved ones figure “well I got this money so who cares if I have to drop $15k on a funeral”. Also, I believe funeral homes take advantage of people in a tough spot.",
            "Personally just cremation and a few people saying some words about me, are all I need. If you care to indulge me, spread my ashes on the trails I so often walk, if not, well life is for the living. \n\nI personally think all grave yards and golf courses need to be repurposed, both are monumentally arrogant and needless.",
            "So there's essentially this comradery within the funeral industry where they've all agreed to pretend things really are that difficult and expensive and can't be helped. I'm not actually joking, there are now alternative funeral homes and directors trying to upset the status quo in the funeral industry because it's so fucked up. \n\nSo yeah, it's messed up here, but not because it has to be. Just because a bunch of old white dudes decided it would be and the government hasn't stepped in to regulate us out of that mess yet.",
            "In my country its almost free, you wrap the body in a shroud and Bury it wherever you want. You just have to bruy it on your land or in a graveyard",
            "Yes. When I die, I want my friends or even just a couple of hilarious strangers to 'Weekend At Bernies' me until it gets too gross. Then, dig a hole, throw me in, and fill in the hole.",
            "Selling \"waterproof\" caskets and burial vaults is a f*cked up thing I've seen.\n\nYour loved one will return to the earth, just let it happen.",
            "[Ask a Mortician](https://www.youtube.com/watch?v=wM6HeLp2ywg) has lots to say on this topic\n\nAlso [this](https://www.youtube.com/watch?v=MzrTl3kYHBE) and [corpse control](https://www.youtube.com/watch?v=qNxvppbhMhg)",
            "[removed]",
            "it's nothing unusual in the philippines",
            "[https://www.ted.com/talks/dan\\_ariely\\_how\\_to\\_change\\_your\\_behavior\\_for\\_the\\_better/transcript?language=en](https://www.ted.com/talks/dan_ariely_how_to_change_your_behavior_for_the_better/transcript?language=en)\n\n11:47 - he talks about funeral insurance in Africa.\n\n\" People spend up to a year or two years of income on funerals. \"",
            "It's funeral homes taking advantage of the grieving family for one thing.    Many people don't know that there's something called \"the funeral act of 1984\" that sets out guidelines funeral homes must follow but usually don't because people have never heard of this act and they're in shock.\n\nWhen my father died, I made a joke I should have bought a casket from my town as there was actually a retail casket store. The director fairly got mad and went on a rant.   Caskets are a major mark up for funeral homes.  \n\nHowever, by law, you are allowed to supply your own casket in all states but two.   Walmart actually sells caskets online and you can have it shipped to you within two days.  What you may pay for at walmart that's 1.6k could be 4k or more for the exact same casket.\n\nCaskets are very cheaply made to start with.   The casket gasket is extremely thin.   Run your hand on the gasket of your fridge and it's much more thicker.   \n\nThe funeral home will ask you about what you want, service, visitation, etc. and in my case, then they pull out this menu like thing with the prices on it.  How nice, they actually have all their services listed on a menu.  This required by law.  Rather than at the last, it needs to be presented before anything is said.\n\nWhen my mother died the old gal said \"now, we'll look at caskets and pick one from this room.\"  Wrong.    The funeral act states the list must be present prior to looking at caskets.  Surprise, surprise, my mother had a burial policy but a week later a neighbor who died did not.  The neighbor was in a basic steel grey casket not offered to us.   \n\nWhen I mentioned to the director later, he said the list is provided upon request.  How can you ask for it if you don't know it exists?   \n\nCemeteries are next on the list of scam artists.   They're out in force on decoration day wanting donations for money but then they won't keep it up, remove curbs to make life easier for them and are only looking to sell lots or make sure what salary they get is paid to them.",
            "Compost me.",
            "In Belgium it's between 1200 - 4000 euro\n\nAt least this local one here is priced that. This includes the more expensive cremations",
            "If no one had mentioned it yet. Watch Adam ruins funerals.",
            "next up...waste of money weddings",
            "Depending on which state you live in (US embalming apprentice, here), you can bury folks on your own land and basically pay nothing expect for a container of some kind and maybe a grave marker if you wanted one. \n\nFunerals do tend to be at least a few thousand dollars in the US, and like other places, cremation is typically far cheaper. \n\nIt’s a tough thing to lose a loved one, and people can get really frustrated with the cost of embalming and caskets and what have you. There’s a thing called “pre-arranging” your funeral, however, where you pick out your services and funeral details (basically whatever you want to be done preceding your death) and you lock in the price and pay into it however you’d please over time. I’ve seen pre-arrangements from the 80’s that are wildly cheap compared to current prices. It’s usually a good bet to 1. Have things they way you want them to be when you die and 2. Keep that price from inflating as the years go by\n\nEdit: also by pre-planning and paying into it ahead of time, you can avoid a surprise bill for your family when it’s your time to go",
            "When I die, throw me in the trash.",
            "Khufu enters the chat",
            "Same in Australia. Cremations on the rise bc about $3500 compared to about $10k for a burial",
            "Just commenting to let people know they do NOT have to buy the casket from the funeral home that is providing their service. \nMost funeral homes will make it seem like you have to buy their casket (in which they egregiously mark the price up), but LEGALLY they cannot force you to buy theirs. \nYou can buy caskets on Amazon or Walmart for relatively cheap, potentially saving you tens of thousands of dollars!",
            "Funeral directors are scummy as hell. One lied to me about viewing my father's body when there is no law in my state saying someone HAS to be embalmed for a private viewing. Then made a really nasty comment when I said that just the cremation and urn alone was going to keep me from paying rent for several months. \n\nAnother time a girl I knew who was in mortuary school went out of her way to SHAME ME because at 24 years old I couldn't afford a \"real\" funeral for my dad and had a celebration of life instead. I reported her to her school and eventually the company she was hired at but they said they didn't care. \n\n Most funeral homes don't care about your loss or family. They care about money and that's it.  Its actually really sad that even in death they are trying to scam folks out of money.",
            "I think the whole thing is fucked. You put a dead body in an expensive box to decompose underground? Thats weird man.\n\nI think we used to do that out of necessity and then all the lore was built around it but we dont need that bs anymore. \n\nAnd cemeteries are a huge wastes of land. Like golf fields.",
            "I think I’m going to have them remove my skull and process it and give it back to my family. Then have them take the rest of my body and use it to create two gems. These, I’ll have them set in the eyes. Each of my children will be required in the will to possess my skull for at least 5 years.",
            "Funerals are a dying business.",
            "Well you know what, it doesn't matter because ultimately its the *last* time you get to spend money on yourself; So fuck it.",
            "I help my low income HIV/AIDS clients set up a life insurance plan for these reasons. To imagine them passing and their kids having to front this cost and deal with services breaks my heart",
            "I hope my family spends the bare minimum on me and uses any leftover cash for iproving their lives",
            "Costs of cremation depends on your location. I researched prices locally (Northern New York) about 6 months ago. The lowest price was just under $2500, no service or urn. I prepaid for my wife and I. Just didn’t want my children to deal with it.",
            "Egypt still has us beat in expensive funerals.",
            "They are ridiculously expensive and a complete ripoff.\n\nIf you have Netflix, you can watch the episode of The Midnight Gospel with Caitlin Doughty, where this very issue is discussed in great detail. Her educational webseries \"Ask a Mortician\" on YouTube has more info.",
            "in turkey they don't really cost much, most people are buried by islamic tradition so the body is wrapped with a piece of biodegradable cloth and put in a random coffin then transported to a cemetery usually on the shoulders of the relatives of the deceased. then buried without the coffin. They usually plant a tree on or around the grave. the most expensive thing is probably the gravestone which costs less than 500$.",
            "If you are in the US and want a more traditional funeral, knowing your rights under the Funeral Rule can help keep costs down: https://www.consumer.ftc.gov/articles/0300-ftc-funeral-rule",
            "In our culture the caskets are made from donations given and graves are dug by young male volunteers while the young women make their lunch. It's a rather simple system but it's nice.",
            "In the USA, there is a new trend called green burials, where you can bury your loved one naturally in a state or national park, or a private reserve.\n\nA friends dad recently passed and they opted for that. There is no embalming, instead they bury the body in a coconut fiber degradable cloth.\n\nIt only cost them a few thousand. Most beautiful funeral I've ever attended.",
            "Funerals in muslim countries cost like 50$",
            "Texas law requires bodies to be embalmed even if they’re going to be cremated",
            "There's a good book about this - \"The American Way of Death Revisited\" (2000). It's called \"... revisited\" because the same person (Jessica Mitford) wrote the original, \"The American Way of Death\" in 1963. Sadly nothing changed in between. And probably nothing has changed between 2000 and now, over two decades later. It's disgusting. \n\nPersonally, I \\*slightly\\* blame the families who hold the funerals (I mean c'mon, if you need a GoFundMe to cover it, wouldn't you then go back to the funeral director and ask about cheaper options? Wouldn't  you figure out --- if BROKE AND DESPERATE -- that you can skip the embalming and open casket and all that?) But I mostly blame the industry for preying on people who are grieving and for making expensive and open caskets the norm. \n\nA LOT of the expense comes from the open casket aspect of our funerals, by the way. Because then you have to have a nice casket with nice insides, too, and the person has to be embalmed, dressed, done up with make-up, etc.",
            "If I'm in charge you get the 3K funeral. A mass, a cremation, a niche at the mausoleum and cold cuts at the house for the mourners.  BYOB, or better yet, stay sober, have a sandwich and get out.",
            "As someone who has seen funeral planning first hand. The upsell and predatory behavior of the funeral industry is disgusting. They target you during your most vulnerable states and try to upsell you and drain every penny out of you..\n\nPretty sure there’s an in-depth documentary on YouTube about it if you’re interested in looking into it.",
            "Its juat another way to make money. Ppl in grief make poor decisions. Mix in guilt well of course you got to give mama a big send off. If you were thinking rationally at the time nobody would payb5000 for a coffin.and an extea500 dollars to water proof one? Wow. But even though its a day we dont want to remember we still got to show out for the relitives. I mean poor daddy can't have a cheap aendoff evwn though in life he was frugle and spent wisely.\n     Also if you have insurance policy the funeral home will wait on it sonits not like your spending real money. \nWhen my brother died and was to be cremated the funeral home charged us 300 dollars for a box that a coffin was shipped in to put him in to create him. Its all a hustle. Just like. 2 months salary on a ring type thing was created by a jeweler.",
            "Throw me in the trash when I die",
            "Someone's probably already said it but in thr UK you can leave your own body to science. Its the only method that (I know of) has £0 funeral costs. They will even come and collect the body.",
            "In the United States it is legal to purchase caskets and the other burial items from outside sources and whatever funeral home you choose to use must use them. They don't tell you that information. So you can save a lot of money on the casket alone. \n\nIt's always bothered me that there is major bucks in the funeral business. What is most likely one of the hardest, emotional, vulnerable experiences humans go through. I understand the need to make a living but in a business that is never in danger of lack of 'customers' it seems like it shouldn't be such a draining expense.",
            "I can see paying a bunch for an urn or headstone, but honestly I was surprised at casket prices. And then mad, when I thought about it. I don’t want my decomposing body sitting locked in a big fancy box, I would rather go back to the earth and skip the price tag too",
            "I am not sure anyone from India has responded (most likely already did). Hindu here. In Western parts of India cremation is free of cost in the municipal electric crematorium. FREE. Can’t get any cheaper than that...",
            "I’m from Chad and usually funerals will cost about $600 to $1000, that is for the Muslim population, because we bury our dead as soon as possible usually the same day, but the service is can sometimes go on for days.\n\nWhen someone dies we bathe them at home and wrap them in simple white sheets, and add spices within the sheets. The neighborhood prays for them together(and I’m talking like hundreds of people) and form convoy, and bury them(no corporate nonsense). Some people skip the funeral service and in that case I guess it would cost only the price of the sheets and spices.",
            "In india haven’t personally organized any funeral, but people in Hindu culture(constitutes majority of Indian population) are cremated. The costs are basically to carry the body the cremation site, and it is open pyre so depending on your budget you can opt for the wood you want to be used to burn or also have other more cheaper options (using gas).\n\nI think personally this is a more sustainable practice else india would soon would run out of land to burry people.\n\nTLDR; way cheap in india since most people are cremated"
        ]
    },
    {
        "post_id": "jmor2h",
        "author": "Thomaswiththecru",
        "title": "Why are women who like children seen as nice, while men who like children are often suspected as pedophiles?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/jmor2h/why_are_women_who_like_children_seen_as_nice/",
        "score": 21891,
        "num_comments": 2118,
        "created_utc": 1604328603.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/jmor2h/why_are_women_who_like_children_seen_as_nice/",
        "comments": [
            "This was a prejudice that entered immediately after my wife and I separated 10 years ago. I had a school age daughter and was familiar with all the parents of all her friends (mostly other little girls). As soon as my wife was gone, I was suddenly a suspicious pariah. There was no playing together at our house after school, no play dates at our house, and basically no interaction that would have involved me being left alone with any of these other girls. I hosted a roller skating birthday party at a local rink and some of the parents only committed to letting their kids attend once they knew my mom was a co-host. It was baffling to me, and devastating to my daughter. There was ultimately one parent who absolutely didn’t care, and she supported me throughout the whole ordeal. She trusted me with her daughter like she always had, although we never really talked about it. It still killed me. Not having a wife doesn’t just turn a man/father into a pedophile, or reveal that he always was a latent pedophile who was only held in check by his wife.",
            "Kids love my S/O for whatever reason. He's a thinner guy, big beard and funny as hell so kids kinda gravitate to him. Kids within his own family mind you. \n\nHe has one cousin (I think that's how they're related) who absolutely adores him. She will pull him from conversation to come play with the other kids and he goes along with it. He got an exclusive invite to tour the behind the scenes of a zoo and he could invite one person. He picked her because she loves everything about animals and zoos. Of course he asked her parents and they agreed to let her go.\n\nOther adults in the family think it's weird, like his own parents find it weird that kids like him so much. People have this thing in their heads that kids can only like women and that any man who kids like must be doing something to the kids\n\nIt's sad reallyespecially because some people find it strange when men want children just as much as women do. People always have to assume the worst about men wanting children.",
            "Took my niece out when she was like 6 to watch the lion king at cinemas then grabbed food, as she was just at home doing nothing during school holidays, this was like a new world away from mom and dad with her uncle with less 'rules' and just chilled, let her play music in car off my phone, just drive around on way home then picked up ice cream to cap off day, 7 yrs later she still remembers that day, everyone thought I was weird to randomly do that, yet buying her presents is fine, that was last time i did that as my own family thought I must have another motive.....yet they let me take her brothers who are younger no problem.....I refused as it wasn't fair to leave her out and it's not the same no more.",
            "Same reason we refer to a man looking after his own children as \"having babysitting duty\". It's ingrained in our society that men should never be responsible for children",
            "I was following my 2 year old niece around the back yard and she ran around the corner and just stood by the gate in the dark.\n\nI went over and was trying to see what she was looking at and then I felt sort of a panic that I was alone with her in a dark part of the side of the house.\n\nI walked away and she followed me. Everyone saw me and her appear again and it was a normal reaction from everyone and we continued to play.\n\nIt's sad that had crossed my mind due to how people react to men and children.",
            "My dad is a single dad in his fifties and I'm 18F and we've always had a very close father-daughter relationship. When it came to physical interactions, as kid it was normal for me to hug my dad, sit on his lap, kiss him on his cheeks and to this day I still do all these things. It's never been weird to me or gross but I have had my fair share of judgemental relatives refer to my dad as my 'husband' and make creepy comments about our closeness, trying to imply that my dad is a pedo. As a child, those comments did make me a little uncomfy but now that I'm older idc. My dad is the best, he's always been there and we have the healthiest father-daughter relationship among all my friends as far as I have observed. Not all interactions between male relatives and female kids have creepy intentions.",
            "Because we are conditioned by society to see women as caregivers and men as predatory.",
            "I’m a loud woman with a child.  I’ve yelled from a fence for my kiddo to grab his lunch box that he left in the car, and I’ve sat on him and tickled him in a park.  The fence incident resulted in security surrounding me.  I handed them his lunch box.  The tickling incident (in which my son was laughing his head off and we were having a great time) a woman screamed in my face to get off him.  When I did she grabbed my son and asked him if I hurt him and did he know where his momma was.  When he pointed to me she shut down and rebooted.",
            "And on the other side of the same coin.. why are men who don’t like children accepted as fairly normal while women who dislike children are generally seen as vile selfish people?",
            "Because we still have sexist double standards. The sexist assumption made here, is that women are naturally nurturing, and men are naturally perverted. So when a man loves kids, sexists will assume that he can't possibly be nurturing, it must be sexual.",
            "I've worked in a few preschools which is a highly woman dominated field. Nobody ever felt bad for us, they were mostly just amazed at our handling of the kids. I had one male coworker once and EVERY father who spoke to him mentioned how difficult it must be to work with so many women and children. He was often asked if he really liked his job or not. People just don't see men as caregivers and in their minds the only reason a man would like children is because he is a pedophile which is very untrue.",
            "People have been conditioned to just always assume a man has ill intentions when it comes to children, especially if he isn't a father. Which is a shame, because all my favorite teachers as a kid were male.",
            "It's not just adults either, when I was like 12 me and my friend were hanging around some shopping centre type place, and we saw some little 7 year old kid freaking out. \nWe went to see if we could help and found out he couldn't find his mother.\nSo we told him we would help him look around for her.\n\nSo we're walking around with this random kid and asking if he can see her, and then she fucking walks up behind us and starts screaming at us. Completely ignored her kid and Karens the fuck out about us taking her son, and how he was fine where he was.\nAnd would you believe it, here come the concerned public to help her confront us child stealing hooligans. Of course not one of them gave a shit about the kid when he was all alone and melting down about it.\nTurns out she had literally just fucked off and told her kid to stay where he was and went to buy shit. But apparently we were the bad guys in this situation.",
            "This makes me so sad. When I was younger (like 15 or 16 and honestly looked like I was 14) and needed some help navigating the city by myself, I went up to a woman with a stroller and she ran away from me in fear...",
            "because\n\nWomen's body wash:\n\nlavender, soft rose, enlightening peach, heavenly fruit, passionfruit and all the lovely stuff in the world\n\nMen's body wash:\n\n**HURRICANE, TSUNAMI, AVALANCHE, ICEBERG, PHEONIX FIRE, CANCER, WORLD HUNGER, POVERTY, AND ALL THE TERRIBLE THINGS**",
            "Took my daughter to a movie, some Disney a long time ago.\n\nSome of her school friends were a few rows away and she wanted to sit with them......\n\nThe death stares I received as a 30 something man sitting alone on a matinee show was disturbing.\n\nUsher came down to see what’s up....glad we knew each other and my daughter still had to wave at me.",
            "Sexism",
            "Unfortunately, these kinds of attitudes help the female pedophiles get away more often.\n\nJust being interested in kids shouldn't be the red flag. Kids would be a lot safer if people knew what to actually look for: [https://www.d2l.org/](https://www.d2l.org/)",
            "So a number of things here.\n\n1. Women are overwhelmingly the primary caregivers of children, even in households where both parents work\n\n2. Pedophiles are overwhelmingly male\n\n3. I think the idea that men existing around children get judged as pedophiles is *way* overblown. It happens, but men being afraid of that perception while around a child doesn’t mean others are perceiving it that way",
            "Woah! This really made the rounds on the sub. I wasn't expecting so much attention on this.",
            "It's a society-wide overreaction to the fact that pre 1980s men were seen as responsible adults and children were seeing as naughty, mischievous, lying trouble-makers if they accused a man of sexually interfering with them.\n\nPedophilia was so unthinkable to most people, that pretty much everyone didn't think of it as real.  Pretty much every accusation of it was successfully swept under the rug because it was so easy to believe it was a false accusation, perhaps pushed by an adult with a grudge or a rivalry.\n\nWhen past pedophilia cases slowly emerged en masse, like from a Royal Commission in Australia (Victoria?) in the 80s, adults became hyper-vigilant because the idea was just so *bad*.  It didn't matter if pedophilia was relatively rare, and that not all men are pedophiles.  What mattered was that NOT ONE CHILD  got left in contact with an unknown, unvetted man.  \n\nPeople now knew that a simple conversation could be the start of a man sexually grooming a child.  \n\nI am very saddened by the overreaction to the discovery of the reality of pedophiles.  It's so unfair on all innocent adults everywhere this has occurred.  I'm hoping hard it dies away sooner rather than later while we successfully protect children (which we aren't perfect at yet).\n\nIt's just a very understandable overreaction.  And of course where it has actually saved children, then it has been a good thing.",
            "A trans man here - so, used to be female, and now male. \nI feel this so much. I’ve worked in retail my whole life, loved chatting to kids at work. Would always give high fives if the kids wanted to high five me. Would always try make them feel special by asking if they wanted to hold the bag to take it. Y’know, cool kid stuff. \nBut since presenting as male, kids really don’t talk to me as much. If I try and be friendly and ask about their day, they get so nervous and look to their parent for reassurance. \nIt’s something I’ve really struggled with, as I love kids! I have 5 siblings and nephews and cousins who I love, I’m not some creep, and it’s just sad.",
            "sexism, on both ends",
            "Personally, I can tell you that it’s because both my sister and I were molested by men that worked at our daycares years apart. I am forever paranoid. I try to check myself though and remind myself that most men aren’t like this. It’s just hard when my sister and I went through the same thing at both of our daycares when we were both so young. It messes you up.",
            "American culture has some issues. It’s not this way in Europe",
            "Unfortunately, we as a society have grown to expect that all women must love children or there's something wrong with her and all men must be emotionally detached or there's something wrong with him. Ergo, if a woman doesn't like children she's a cold hearted wretch and if a man does like children he's a predator. Obviously, that isn't true but that's how a vast majority of people have come to think.",
            "not everybody . i dont trust woman or men equally .both can be predators",
            "Negative Stereotypes",
            "[deleted]",
            "I think the answer is probably just cultural bias and sexism. We're geared to see men as ambitious and distant, and when you couple that with the fact that most violent crimes are committed by men, it's not hard to see people getting biased about it. And there's the converse, too; that women are seen as nurturing caregivers who *don't* generally commit violent crimes. Of course none of these things are literally true, they're just trends, but that's how stereotypes work.\n\nIt sucks though. I deal with it too. I'm a 41 year old father of three on my second marriage (kid #3 came with the second marriage by way of adoption, the first two are from the first marriage by way of birth). Plus I'm six feet tall and 320 pounds with a heavy beard and long hair. Allegedly I come across as a bit intimidating :P But I'm actually super quiet and chill most of the time, have never been in an actual fight, and hate the thought of both confrontation and violence. I love kids, and I think I'm decent with them (even if I look enough like an ogre to make babies cry on sight).\n\nI was divorced from my first wife at the end of 2012, and got full custody and decision-making authority for both kids, because my wife had some serious and dangerous mental health issues. They've lived with me (apart from their mom) since they were six and four, respectively. I was spared from a lot of this kind of judgment for years, for a couple of reasons: first, I was so damn busy trying to work full time and be a good dad that there wasn't time to go hang out in parks or whatever, where the judgy people would have seen us; and second, my social circle was small, and I was very open with all of them about everything, so they knew from the first moment what our situation was. They were all supportive, and I didn't deal much with the general public in terms of the kids.\n\nBut then about five years ago I got remarried, and when the pressure of just trying to survive was off (because there were two of us), I started getting out more, and I would see it. Women, especially, are untrusting toward me; the men don't care as much, or don't seem to. No one's ever accused me of anything, but I get the weird looks and the cold shoulder and the nervous behavior and all that. And it's not only about kids; it's part of a bigger problem of sexist attitudes, because I get this sometimes in other contexts. For example, I work in a mental health clinic where about 90% of the staff are women, including literally everyone else in my department. The previous supervisor (now thankfully gone) didn't know how to deal with me at all, and I still think she was afraid of me. She wouldn't come to tell me things when she told the others; she'd just leave me out of meetings, announcements, etc., and I'd have to hear it from my coworkers. It's frustrating, but what can you do? None of this is the kind of behavior that you could make a complaint about, and in the case of the kiddie situations, who would you even complain to? So I learn to live with it, and just always watch myself so as not to end up in a situation where I could be accused of something.",
            "Are we sure that’s not mostly an American thing? It’s not like that in my culture.",
            "This is what feminists mean when they say 'the patriarchy' hurts men as well as women. It sets up negative male sterotypes as well as positive ones (ratio of good:bad depends on your POV).\n\nPlus more famous paedophile cases involve men than women",
            "I imagine you don't think that, OP. I certainly don't think it.\n\nSo the good news is it's not universal. In fact, I would suggest that in *many* places, that view is the exception.",
            "Because it's literally not true outside of reddit. Men being good with children is universally \nseen as a positive trait",
            "The same reason headlines describe women that act on pedophilia as \"having sex with the child\", while with men they straight up say rape",
            "The reason, as most of our problems, comes from living in a society.",
            "Beats me, I've been accused of trafficking my own kid.  There is no doubt who's her father if you see us together.  People look for drama.",
            "So I can answer this 2 fold -\n\nI’ve worked with kids my entire life, I was a pre school teacher, football coach, holiday clubs and worked in crèches and now I still work with young people 20+ years later. It’s always something I’ve been aware of, wrongly, but I’ve just got on with it and if anything used it as an opportunity to prove the ‘stereotypes’ wrong. \n\nChanging a kids nappy that isn’t your own isn’t fun (or your own kids!) be it a boy or a girl, it’s a baby that you are responsible for and part of caring for a child involves taking care of any of its needs, but the initial looks I would get were horrendous, but after time I got used to it and it became normal and when I talk to young people now about work and careers, if we talk about early years childcare it’s something we talk about. Also, now as a social worker and experience in the area, children are far more likely to be abused by a family member / someone they know.\n\nI work with young people now who have had incredibly challenging starts to their lives and some, not all respond better to a man working with them based on their understanding and start too life, but what’s most important over that is they have people around them who are emotionally intelligent and able to talk to them on a level that works for them, much like being a parent - it doesn’t matter if you are a same sex couple, a single parent or a heterosexual couple, being a good parent is being a good parent and role modelling how to get on with people of all genders etc is part of that, they don’t need a male and female (in my opinion)\n\nPeople also always assumed I was gay, maybe it comes from being comfortable in my own skin and being perfectly able and happy to sing a song to a baby one minute whilst rocking them to sleep and then playing football the next - things that I am more than aware do not make you gay, but the stereotypical nature of being that comfortable with yourself I guess on occasion had led people to come to their own conclusions. One that I couldn’t care less about, I have just always found in interesting. \n\nAs for now a parent - generally I’m the only man at the play group or the baby swimming class, I couldn’t care less though, my work has flexibility in hours to I take my youngest whenever I can - my eldest the same when I can after school. What is funny though is when in a swimming group we start singing nursery rhymes and because of my previous work I know all the words, so we bust out some teddy bear teddy bear turn around, the parents who don’t know me’s reaction to a heavily tattooed man with giant holes in his ears that they expect to drag his knuckles on the floor, is always a funny sight. But I take pride in talking to and about being a man who cares for all the young people I’ve ever worked with and being a good role model for my boys.",
            "I used to be afraid of being with my niece's and nephews and what people might think. Avoiding taking photos of them for fear of what might happen etc.\n\nSince I've become a dad I've forced myself to let go of those fears or at least push past them. Sweet fuck all has happened. The opposite in fact. \n\nWhen I'm with my son or daughter and they're crying or throwing a tantrum. There's no odd looks like \"is what kids crying because he doesn't know that man\", I get looks of sympathy or even little comments like \"needing his nap lol?\". I've been inside the siftplay adventure things crawling around with all the other kids because my son isn't quite there yet to do it solo (daughter isn't even rolling fully yet) and I'll crawl past a mum and we swap a funny glance to each other. I feel welcomed as a dad tbh and probably more so as a man than I never did before I had a kid. \n\nNow I know the horror stories and how it's like 10000:1 ratio of them happening to men than women. But you have to remember their horror stories. For every dad that's been approached while he's at the park being asked what child is his, there's many many many others not being given a second look. To say it happens often, I doubt very very much. Not that this ever excuses someone for accusing a man for sitting on a bench while his kids plays.\n\nDon't be afraid when you're out with your friends kids or nieces and nephews to get more involved.",
            "Let me just throw out that toxic masculinity isn’t just guys being toxic, it’s toxic ideas about masculinity like this that hurt us too.",
            "One of my favorite lyrics is from the song “Thou Shalt Always Kill” by Dan le Sac v Scroobious Pip -  “Thou shalt not think any male over the age of thirty that plays with a child that is not their own is a paedophile; some people are just nice”. I think about this often. give it a listen: [HERE](https://music.apple.com/us/album/thou-shalt-always-kill-feat-pos-plug-won-ep/1452910607)",
            "It sucks,\n\n I like kids, I’m fond of children, I enjoy the company of children, I love kids. \n\nAll of those statements are completely harmless, yet all sound wrong when said by a man. unfortunately.",
            "So I have a story. (Also involves race). I am white and my children are white. My best friend and brother is a black man. My daughter absolutely ADORES her uncle! He is not blood but my kids could care less about that. So anyway me, friend (lets call him A) and my 4 yr old daughter went to a farmers market. \n\nA decided to give me a bit of space to do some shopping by myself and took her to another part. Well I come around a corner and look over and A is being questioned by the store manager and other customers. I headed over and the snippets I caught were \"...black man with a little white girl.\" \n\nBy the time I got there they were in the process of calling the cops. I flipped holy hell on all of them for assuming. Meanwhile my daughter is clinging to A and crying because shes scared and A is backed into a corner. He wanted to just run to find me but knew that leaving with her would make it all worse. \n\nSo when i got there, I picked up my baby and this woman starts going on about how \"This man is trying to traffic your little girl! She needs to stay with mom!\" And other bullshit about a man being with a little girl. Yall. I didnt even see red. I saw past red. I did throw a cast iron skillet at the b*tch and started to walk out of the store with my daughter and A. The cops pulled up and we did explain the whole thing. I admitted to throwing a cast iron skillet at her. Luckily the cop was a dad of little girls and since the skillet didnt hit the lady I didnt get arrested. \n\nBut anyway. A was mortified.  I was pissed off. My daughter wanted A to comfort her because she feels so safe in his arms. \n\nMoral: people fricken suck.",
            "There is a large paranoia about men being sexual predators in general. It's not completely unfounded, mind you, but it is indeed very sad. I love children. They are freakin hilarious. Plus adults don't ever wanna play Beyblades... I digress. Basically dudes are suspected of being rapists all the time as it is. The uglier you are, the more likely they think it.",
            "Because the patriarchy said women “naturally” are caring and good parents and men should be outside working. Something uniquely started in 1700s France when, for economic purposes, royalty started pushing monogamy/marriage onto common folk. \n\nWe don’t need to go down that rabbit hole - but yeah, it’s the double whammy of bullshit gender roles that also say men can’t be compassionate and loving parents. \n\nI feel like a weirdo for kissing my son, even in his damn forehead. So I kiss him more. And, I ask him first too and stay back when he says no.",
            "I’m not gonna lie, I love kids. Even before I had mine, when I was dating my girlfriend (now my wife) I used to play with her cousins kids. It never even crossed my mind that people would think I was a pedophile. Then one day, someone cracked a joke that I loved kids too much. Ever since that day, I am EXTREMELY careful around kids, even my own. Just one feeling or look of impropriety and my life would be over.... Now when I play fight, I make sure someone is always around, and I try not to be alone with anyone’s kids, especially if it’s a girl, except my own. I know it’s irrational, but it’s now become a deep fear of mine to be accused.",
            "tl;dr: Same shit happened to me. \n\nWe’d always had such a tiny family of all boys, so when my older brother had a daughter we were all psyched. I live about a 2-hours drive away from my niece and I rarely am able to visit. But I had a great idea. I love philosophy since it’s essentially the greatest hits of things that humans have thought. And there’s this novel called Sophie’s World where a young protagonist receives cryptic cards in the mail that ultimately teach her how to think philosophically. In the end it’s revealed they’d been sent by I think her grandpa or someone. So I started doing a version of that. Another detail about my family is that I’m the only one who went to college, let alone grad school. The rest of my family is superstitious, conservative in a bad sense, and make up answers to questions so as to not seem dumb for not knowing every possible thing. So I was motivated to be a positive role model regarding her smarts, as well as making it a bit of a game. I had the cards custom printed and everything it was like a whole project for me. After sending the first card I explained the premise of the book to my brother and his wife. My brother seemed on board. But then after the second one he literally told me that it seemed creepy. That really f*cking sucks. Our tiny family finally grows a bit and now I can’t even be a cool uncle to my niece from a distance because my brother is irrationally uncomfortable. I’m not able to have kids but I’m great with kids so I always looked forward to being the funny uncle. But apparently I have to wait and see if my other brother will have kids. Otherwise I’ll just have to continue to do magic tricks in the mirror for myself. 😖",
            "Sigh. I (31/F) went to dinner with my dad (61/M) earlier this year and someone asked if we were on a date. We both felt super awkward after that. Didn’t even hug goodnight. Thanks, waiter (and society as a whole) for ruining a benign evening out with my dad, and any ones in the future.",
            "Being a single dad taking his kids to the park:\nIn movie - gets a lot of attention from single moms\nIn reality - gets a lot of suspicion and occasionally cell phone cameras pointed at him.",
            "Story of my life.\n\n-Male elementary school teacher",
            "Women are rarely pedos. Most people hate other people's kids because they are generally annoying, uninteresting, dumb etc. So it can be creepy when a man takes a strong interest in someone else's child- it can look like or be grooming.",
            "This post brought up a memory that really has nothing to do with original question. I remember as a young male, maybe 6 or 7, definitely under 10 (I’m 47 now so sorry if details on age are fuzzy) was playing with a young girl (4 or 5?) in my bedroom as her parents were visiting my parents. We were wrestling on the bed and I laid on my back to rest. She jumped on my stomach and sat on top of me. She started unbuttoning the front of my shirt, think she was fascinated with the shiny buttons. I was tired from wrestling and just laid there letting her do her thing. Thinking nothing about it. She undid about 3-4 buttons so my shirt was half unbuttoned when her mom stepped to the door to check on us. I never had a sexual thought about this girl. Just two innocent kids rough housing with each other and taking a break. But as I lay there on my back on my bed, with this girl straddling me and my shirt half unbuttoned I could see from the look in her moms eyes that something wrong was happening. It suddenly dawned on me how this might look to her but my kid brain didn’t know what to say to that look on her face. She grabbed her daughter and I heard her making an excuse to my parents about how they got to go. Nothing ever came of it. Nothing was ever said to me but they never visited again and here at 47 that brief moment in time still bothers me.",
            "I know this started as a question and became sad depressing story time. \n\nBut as for an actual answer, it's likely due to common misconceptions around mens sexual activity vs women (the stereotypical men always want sex and women never want sex).\n\nAnd unfortunately, this is a positive feedback loop. Any time a male pedophile is found it reinforces the stereotype and if it's a woman pedophile going after a male child it is often (depending on the child's age) seen as the child getting what they want.\n\nNote that I'm speaking super generally and there areany situations that fall out of what I've described. However, societal perception in this regard reinforces itself.\n\nEdit: there are loads of other reasons too based on stereotypes. Men are predatory and woman are caregivers, women like looking after children men dont, mother's intrinsically love their children more than father's do. These are all societal perceptions both minor and major that combine to result in this double standard.",
            "airport six versed aromatic weather attractive spectacular drab doll punch\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Im a single father of an 8 year old girl.  my daughter has been approached by strangers in public asking, \" if shes ok? or where is her mother at?\" When she was 4 years old she was afraid to go  to bathroom stalls by herself so i would take her in the boys restroom and after coming out i would get the dirtiest looks.",
            "South Park did a whole episode on this:  \n\n\n[https://southpark.fandom.com/wiki/Miss\\_Teacher\\_Bangs\\_a\\_Boy](https://southpark.fandom.com/wiki/Miss_Teacher_Bangs_a_Boy)",
            "Statistically, the vast majority of pedophiles are males.",
            "Because of sexism",
            "Its not, or rather it only is by a select few whose views are remembered more often because of how abnormal they are. Most people think its a good and perfectly fine trait for a men to like children, and its definitely  detrimental to getting a long term relationship if you don't.",
            "Its sexist and small. \n\nI love kids. Adults get boring at parties. \"I need to know why Mario's hat is really stupid and red and blue?\" Or \"can we, if we are gentle, if we can pet the dog.\" Not \"who's president\" or \"why we can't have healthcare.\"",
            "chief complete gray drunk quaint grandfather ten boast coherent apparatus -- mass edited with redact.dev",
            "Media depictions. My dad was a stay at home dad when I was young. It was totally normal for us but you won't see a family like mine on TV.",
            "I think it has to do with gender norms and the subtle policing of gender norms. The gender norm is that women are caretakers. When a man undermines the norm by liking to be with children, machismo male culture must psychologically punish the man. This is achieved by perpetuating stereotypes that depict men as child predators when they simply want to be with kids. Everyone internalizes the stereotype so that even men who like kids may begin to  avoid taking care of children.",
            "I think it's a primarily American thing. I'm an Arab and a man who likes kids/a man that kids love is generally well regarded. It's pretty uncommon due to cultural norms, but these days it's a pretty attractive trait - especially to women who want to have a career.\n\nSome of the more protective parents might be wary and suspicious of men that gets along with kids, but this idea that men who like children are pedo sus is a primarily American thing, I've personally never seen it happen around my family/friends.",
            "I used to take my niece to the corner bakery and to a shopping spree to buy an outfit when she was good while we were on vacation (she’s had some behavioral issues and I was doing the whole “positive reinforcement” thing), and while she was in the dressing room a woman went into the dressing room next to her and knocked on the wall between the two and asked her if she was ok and if she was in trouble, and did she know me and who was the man standing awkwardly outside. She was 9. She’s a blonde blue eyed kid and I’m a brown person. She told the woman I’m her uncle and everything was fine. The woman asked “Are you absolutely sure?” She looks back on that moment positively; a stranger was worried and was merely checking to see if she was ok. I took it differently and it really made me rethink spending public time alone with little girls, especially ones from the white side of my family. People react strangely to a dark skinned man with a white child alone. I’d like to say it was the only time that it happened. It isn’t.",
            "Honestly tho. I’m a 23 year old male and I absolutely love kids and kids love me. I also love to take care of them. I’m afraid to go in public with my nieces because I’m afraid to be judged.",
            "Sexism.",
            "As a male middle school teacher who grew up with a lot of siblings, can't have children and married an only child... I wish this were not true. Fills my job with a lot of annoyances.",
            "I'm a man who finds kids hilarious.\n\nI was lucky enough to briefly work with children at an out of school care center. I found the kids starved for male attention and we had a lot of fun.\n\nHowever, when my sister was let go, I was not welcome anymore. Like her existing in the company kept me a safe person.",
            "For me who is a woman I don’t really like children I feel awkward and unable to talk to as I just never interact with a kid before and due to trauma from my past I don’t trust a lot of people nor children as well as people from my age group so\n\nso for the stereotypical woman is not really a thing at times and honestly the people should honestly just teach kids about dangers of people generally that are not good as anyone can be bad and gender does not count for someone being nice or kind\n\nSo for me I believe it comes from people watching to much villains shows were a male kid naps someone honestly",
            "Cause society views men as hostile and doesn't see us as humans, you'll see the pattern",
            "There's a difference between being good with kids and liking kids.\n \nIf you say \"I'm good with kids\" instead of \"I like kids\" it might come off as less creepy.\n\nLook at me, I don't like kids but I'm good with them",
            "As a mom and educator, I’m very aware of HOW people interact with their own and others kids. I don’t care if they’re moms, dads or family members. How you talk to a kid is the ultimate test. \n\nBefore we had kids, my husband was labeled as the fun uncle-to all nieces, lots of good memories for those girls! That’s how I knew I wanted to marry him, knew he would also be an awesome dad!",
            "The news. Stories get widespread coverage and attention. See a few stories, mistakenly assume it's common. Excessive caution wins. Stereotype is born.",
            "Some of us get suspicious looks even if we aren’t men. Cuz homophobia is still out there.",
            "Because patriarchy",
            "1 in 9 girls and 1 in 53 boys under the age of 18 experience sexual assault at the hands of an adult. 93% of child victims know their abuser. 34% are family members.\n\nOut of all the sexual abuse cases reported to Child Protective Services in 2013, 47,000 MEN and 5,000 women were the alleged perpetrators. \n\nKeep in mind that, since 1 in 9 girls is a victim, those children grow into women who are wary of those who may harm their children. FYI, I'm saying this as a woman who was assaulted by family members and a \"family friend\" all before I was a teenager.",
            "Tbh I just think that society sees man as predators and evil while women are just always the good one or the victim... it sucks.\n\nI have always wanted to be a father and I mean it when I say I would adopt a baby if I don't have a partner by the time I think I'm ready to take care of one... I just dont tell anyone irl about it anymore because some people started making fun of me saying I'm  a pedo and stuff.",
            "Because people confuse \"almost all paedophiles are men\" with \"almost all men are paedophiles\". This type of confusion happens all the time; it's true to say \"all white supremacists will vote for Trump\" but false to say \"all trump voters are white supremacists\".",
            "We don't have children of our own, but we seem to experience this when around people we aren't really close to.\n\nBest example: A few years ago, my husband was actively attending a church, and I went on occasion. He volunteered to assist with their vacation bible school. He had to take a child safety course and get certified. It was an online video program with questions, all about child abuse and the signs of it, etc. Basically, prove that you understand how to see these signs, etc.\n\nHe talked me into volunteering, but I could only participate on the final day. He was there all week. (Note: we both had to take the class and get the certification.)\n\nThey had him helping with snacks every day. \n\nWhen I show up on the last day, not knowing a single kid, let alone anyone else, they stick me with the three-year-old class because another person had an emergency. ME. The one who told them I was willing to help with food or crafts, and not my husband who was up for anything and had been there ALL WEEK. \n\nAt no point was I left alone with the kids. At no point did I have to assist anyone with going to the bathroom. There were THREE adults in this class. \n\nI was so infuriated when it was all over. Like, okay, I get it, you wanted us to take this class. I felt traumatised from the class because it went into a lot of victim described detail about their own abuse as children. As a victim myself, it was awful, and triggering. But I passed the class.\n\nMy husband had been going to the church, was volunteering, was there daily for whatever they needed his help with. \n\nAnd they just had him do things that didn't involve the kids. But me, the wife, the woman, gets stuck with the kids despite the fact that I was a COMPLETE STRANGER THEY HAD NEVER EVEN SEEN BEFORE. \n\nIt freaked me out. We never went back to that church for any reason.",
            " It's really jsut a double standard seeing as how women are expected to be the caretakers for the children and this fact is really depressing for me. I'm a teenage boy who loves babysitting and playing with neighbor kids whether for pay or just because I have nothing better to do so the fact that when I get older people will most likely be creeped out by me is honestly scary because I just love children.",
            "To paraphrase Louis Armstrong: \n\nI hear babies cry\n\nWatch them grow\n\nThey'll know more\n\nThan I'll ever know\n\nAnd I think to myself\n\nWhat sort of fucked-up world are the poor little bastards going to be living in",
            "Kids are awesome to hang out. They ask weird questions I never would have thought.\n\nBut as a guy I will never ever ever say this for that exact reason.",
            "As a male high school art teacher, I feel like I’m constantly walking on egg shells. I go WAYYY out of my  way to make sure nothing I do can ever be seen as inappropriate. \nWe had a male teacher a few years ago get placed on administrative leave for almost a month because a student reported him for sexual misconduct. Everything was a lie, turns out that she was pissed because of her failing grade. He kept his job, but it damn near cost him his marriage.",
            "Idk because people are idiots. Im a man and i love kids. I have 2 boys, a 3 year old and a 2.5 month old and theyre awesome. I have 3 nieces and i absolutely love playing with them. I dont care what other people think, im going to roll around on the floor and goof off all i want because it makes them happy and it makes me happy. Theres nothing better than my kids being happy to see me after work or when i see my nieces smiling faces when they get to see me.",
            "Sexism",
            "We also react less when the women do actually commit sexual abuse.\n\nI'm not saying that's good or bad (although I lean toward \"bad\") but it's logically consistent. If a society won't take *actual* female rapists seriously, then it stands to reason that they won't take *potential* female rapists seriously either.\n\nHuman trafficking operations can get away with quite a bit by just hiring women to do the kidnapping and extortion.",
            "I understand this. I'm a highschool senior, but I look quite a bit older. I absolutely love swimming, and children usually like to stick to me for some reason. So I helped a friend of the family with teaching his daughters how to swim. It was... awkward. Like, I understand that a guy with two little girls can seem a bit weird, especially at the pool, but you don't have to look at me with eyes filled with contempt. Seriously, everyone around me was just glaring, they weren't even trying to hide it. The only exception was a group of young adults who didn't give a shit. They're like little sisters to me, and they do call me brother at times (which is adorable), so it breaks my heart whenever people assume I want to do something bad to them.",
            "For several reasons but particularly sexist ones. Additionally, people generally aren't very good at nuance. The brain likes patterns, categories and labels. It's harder to remind oneself of the real complexities that exist. And some people don't know or care to. \n\n\nIt is only recent and in certain cultures that women's rights have come far enough for women to be seen as independent sexual beings with their own desires and needs. Some of this still exists in that men are seen as more sexual beings than women. Men are seen to have uncontrollable sexual desires. In part i would say this contributes to a narrative about women and men's sexuality.\n\n\nAdditionally, it is only recently and in certain cultures that women have been able to be independent financially, have jobs etc. Generally, women have been the child rearers and home makers. We still have many narratives about how women are naturally meant to be around children and men aren't, that it is unnatural for men to want to be around children because this would be womanly... or there is another reason that fits with the other narratives about men as sexual. \n\n\nWhether it's because of these narratives in part or in whole would be up for debate. But statistically men commit more violent and sexual crimes against women and children. Sure, women do it too. But it appears they do it less and when they do it it goes unrecognised/doesn't change our brain's shortcuts because it doesn't fit the narratives we already have. Also, the narratives explored above, as well as others about what femininity/masculinity is, prevent men from reporting. \n\n\nTl;dr: gender roles and brain shortcuts.",
            "Sexism",
            "Two sides to every coin. Statistically the biggest danger to women and children is men. However, we currently live in the safest society that has ever existed and simultaneously are the most fearful society that has ever existed. (Speaking strictly about child safety). It’s a weird world.",
            "Because nobody's yet broken the molested by my auntie/mom/mom's friend/babysitter ... web of lies yet.",
            "Double standards \n\nNo explanation needed really.",
            "Because enough of us have been abused that the thought triggers us.",
            "Because female predators have only recently been given a fraction of the punishment as male aggressors.\n\nInfanticide, however, has a long history of women getting severely punished.\n\nRecently a woman was jailed in alabama for an abortion.",
            "Sexism",
            "Because people might assume women cant molest or rape children. They can. Perhaps its not talked about and such cases get ignored but they do happen. Just society shit in general and bias.",
            "Becauce bullshit sexist double standards, that’s why.",
            "Women are seen as inherently nurturing and motherly while men are seen as aloof if not dangerous. A man can't bring a little girl to the park because he's a loving father, no he must be a molester. And a woman can't have raped her 14 year old student, no she was just nurturing him through his dick.",
            "Sadly because it’s more common. MOST adult woman can recall an uncomfortable situation where a male family’s member made a sexual advance towards them as a child.",
            "Because traditional gender role are men protect and provide resources and women have children and take care of them.",
            "Toxic double standards, pretty much.",
            "Prolly the same reason that I grew up in a super conservative family and my parents would always put my virginity on a pedestal. I.e: don’t sleep over at a friends house coz their father might rape you. Don’t go out at night or some guy might rape and murder you. Be careful of male friends, they just want sex and take advantage of you. Boys will be boys, they’re naturally horny, you gotta cover up because they are all animals that can’t control themselves. Men can’t cook and clean, that’s for sissies and that’s the women’s job coz men gotta be breadwinners.\nWhen you grow up in an environment where men are seen a deprived creatures that can’t control themselves and women are always seen as submissive housewives and have to devote their lives at home, it’s hard to think of men as being humans that can actually be nice and this just makes stereotypes that much worse.",
            "Me Filipino, my niece 3/4 white 1/4 Filipino and was about 9 at the time, and is straight up blonde with green eyes. I took her out for ice cream and people gave me weird looks ( mostly old white people)I feel like I had to keep emphasizing she was my cousins daughter. I did not kidnap this child lol.",
            "An abundance of caution",
            "Lots of ingrained sexism. Lots of people are still very judgmental of families where mother's work and father's stay at home.\n\nIt sucks all around. In the US, it's still not that common for men's bathrooms to have changing tables, so it's usually up to the mother to change a diaper when in public. For single dads, they'd have to change their baby on the floor or make someone else who's female do it. Nobody wins. \n\nIn my opinion, parents are to blame, because usually they are the ones reporting this stuff regardless if it's true or not. But there's probably other factors at play that influence public perspective of men with their children.",
            "I am a women. I have been a baby sitter, a nanny, worked in public schools and I am now a social worker. I have worked with families for 30 years. Ever since the Nancy Grace effect of  'everyone is after your child and is a pedophile' phase of \"news\" parenting changed to a lot of scared parents and public shaming when children were allowed  to roam free and speak normally to community members. It was this strange effect to remove the community from parenting or supporting parents. The unintended consequences of fear mongering. I do agree men suffer the most from this but it also is an across the board societal shift as well.",
            "Sexism keeps people locked into gender rolls, and anyone who steps outside of their expected rolls is considered suspect. Women are seen as caretakers/mothers, so their interest in children is seen as normal, while men, who are often expected to be unemotional/stoic, showing an interest in children is instinctively seen by some as strange or unhealthy.",
            "For the same reason women who don’t like children are considered abnormal: Thinking by analogy en mass",
            "Sometimes it's because they have personal experience with inappropriate male adults when they were young. My wife was molested regularly by the neighbor and so she is hyper vigilant when it comes to things like that.",
            "man bad",
            "I think you’d be surprised at how many men have sexually assaulted minors, I had to learn that through bitter experience.",
            "yeah, I'm 35 this month and I get looks when I'm out and about (i.e. grocery shopping) with my 9-year-old daughter...",
            "And being married clergy sometimes out alone with my toddler son, sometimes in my collar, it's even worse.",
            "Man, I took my little cousin out since I could not make it to her basketball game. I could not bear with the fact that I had to miss it, so I made it up to her by taking her out to eat and she showed me the video recording of the game. I gave her some money and told her to keep it up and if she ever needs anything to call me. I felt weird doing it too, I felt the scrutiny from her mom and her sister. Eventually I had my own kid and our families didn’t really meet up anymore for reasons, but she was the brightest in the family and I am extremely proud of her accomplishments. I just feel bad that I had other personal things like work and a girlfriend that I didn’t devote at least a day out of the year to her and to just simply be the best cousin I could be.",
            "I think people are typically a good judge of character and use discernment based off of prior knowledge. Also, people like to play the role of the victim when they are being judged for wanting to be with children (most mature men would just move on and socialize with their peers). These double standards seem to be a good defense mechanism and overall work to the children's advantage considering the cost/benefit ratio.",
            "Can't tell you how many times I've been followed to the bathroom with my daughter in public.",
            "Gender roles. Women get effected so much more by sexism but men still get hit a bit by it.",
            "Once when I was working for USPS I greeted an excited Yorkie tied on someone's porch and his human dished out the compliments on how she thought I was such a sweet and kindhearted man \n\nI'm a woman with a small chest, it's usually just a girl thing to like small dogs, but suddenly I'm an exceptional as a man who likes small dogs even though there are plenty of women who hate small dogs \n\nGender norms are weird and so much more complex and ingrained in society than many people realize",
            "Because for a number of cultural and social reasons, many men determine that there is a low risk, high reward for taking sexual advantage of a teen or child. Clearly not all men but starkly more men try to take advantage of the situation than do women.\n\nI, a father to a young daughter, am not fond of this reality but I do *get* it.",
            "I’m uncle  to all my friends kids. Always have been. And I remember one of the grandparents making a joke about it being weird which I haven’t ever thought of. \n\nIt completely ruined the genuine nature of having fun and just hanging with the drama free kids as opposed to the annoying political adults. \n\nHave a 3 year old now so and see people a lot less as we’ve all grown apart a lot so it’s all good. \n\nBut that definitely stung that that’s what goes through peoples heads",
            "I’ve neen told by a young parent to never walk through the public parks or sidewalks as she thinks I’m “suspicious”.\n\nBitch I’ve been walking the same paths for over 12 years and NOW only when I’m 20 it’s not okay because I’m a man, even though I’m just chilling to music with headphones on?",
            "Heuristics. If I ask you or a group of people to picture something, you’ll most likely conjure the same image. \n\nHeuristics helped our smaller brain ancestors survive tiger attacks. Now they’re are pretty useless and, sometimes, detrimental.",
            "Women were mothers/servants, men were hunters/fighters/workers.\n\nThis is how we worked, and in many places how we still do work.\n\nIt’s hard for us to shake of these preconceived notions so any activity that isn’t in line with them is immediately feels dodgy",
            "This is why i am afraid of working in a kindergarten",
            "Because there’s a societal bias that women are motherly and they traditionally are the ones always interacting with the kids, and any alteration that defies that bias is seen as weird and parental fear makes them question if the said man is a pedophile because it’s not “normal” to have them be people invested in children",
            "Because culturally in the past men were expected to not give a shit about children. People don't assume that they can actually care about them in good faith a lot of the time, so they assumed that if they do there must be some other hidden intentions involved.",
            "Could be gender roles with the old age idea that women are seen as caregivers and men as the workers.",
            "Statistics",
            "And women who don't like children are considered monsters.",
            "Because SOCIETY",
            "This is sexism. There is nothing more that needs to be said to answer your question.",
            "I quit teachers training for that very reason, we were told that as males we are not allowed to be anywhere near children alone, it scared me so much I gave up on my dream",
            "I hate this so much especially being in retail. Parents bring their kids to the store all the time and I normally gives out sample meals at work so kids normally get excited for samples of anything and I like to see that the kids like the sample and ask their parents to make it at home and some will tell me what they actually like about it but some parents look at me funny when I try to talk specifically to their kids and get asked where was the lady that did this even though she hadn't been there a year and try to say that their kids enjoyed her more.",
            "I'm only 20 but whenever I go to parties with family members I never met,I get bad looks simply for carrying my young nieces like i always do.",
            "Patriarchy and white supremacy. This isn’t common in all cultures.",
            "My wife tells me I look like a pedophile when I make funny faces at kids in public.",
            "My husband is one of those people. He’s a wonderful dad and grandpa.  Kids gravitate to him and he adores kids of all ages. He has often told me he would have loved to have owned a daycare but he knew that no one would bring their kids to a center owned and operated by a man. It’s sad.",
            "It's stigma towards men. I avoided working in pediatrics health care because of it. I just don't want to deal with the ignorance.",
            "It's just pearl clutching sexism. That's all.",
            "The same reason a lot of men's restrooms don't have a changing table. Women are supposed to be the maternal ones, and it's so deeply rooted in society that a man acting the same way is so flabbergasting to people that they assume hes a pervert."
        ]
    },
    {
        "post_id": "f6vado",
        "author": "MrsSamHandwich",
        "title": "What are the dimensions of an adult llama?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/f6vado/what_are_the_dimensions_of_an_adult_llama/",
        "score": 21886,
        "num_comments": 782,
        "created_utc": 1582215132.0,
        "selftext": "THE UPDATE YOU'VE ALL BEEN WAITING FOR: head over to this post by u/DJ117Xx for pictures of a llama in a tuxedo. https://www.reddit.com/r/pics/comments/fbzigv/5_years_ago_i_promised_my_sister_i_would_bring_a/?utm_medium=android_app&utm_source=share\n\nThe original owner of the llama my friend had booked ghosted him about a week before the wedding. My friend then found another person who had a llama handy with a week to spare. His name is Shocky and he is a very good llama and I love him very much. The suit didn't turn out how I wanted it to, but that's pretty much what everyone says when they make something. All in all, it's been an unforgettable day.\n\n\nOriginal post: I've been hired to make a tuxedo for a llama and I don't have it's measurements. I'm also assuming the llama is male.\n\nThe measurements needed are: \nLength of legs from just above hoof (ankle?) to bottom of torso\nHeight from bottom of torso to back of neck\nDistance around neck\nWidth across shoulders\n\nThank you!\n\nEdit: I'm really glad you guys are enjoying this but credit needs to go where it's due: my friend is on reddit! u/DJ117Xx is the one doing all this, I'm just making a jacket and shirt\n\nEdit to answer the most popular comments:\nYes, this is real. It is an age old tale of a sibling who will go to any lengths to playfully spite his sister. \n\nThere will be pictures, because I'm afraid for my safety if I didn't post them. The big day is March 1. I'm trying to get u/DJ117Xx to post them, as he's the one actually doing all this and should get all the awards and karma. I'm just making clothes.\n\nAnd thanks to all who gave really insightful tips on how to go about this, you're the greatest and I'm learning a lot!\n\nI have to go do work now, but I want to all to know I've been ending every argument with \"Excuse you Karen but I am famous on the Reddit.\"",
        "permalink": "/r/NoStupidQuestions/comments/f6vado/what_are_the_dimensions_of_an_adult_llama/",
        "comments": [
            "You're going to need his measurements. This question is like asking for the dimensions of an adult man so you can make a sweater that fits one.",
            "Just a heads up, a human-form tuxedo won't work even if it's the right size. Llamas, like other animals, have their arms \"to the front\" (imagine your arms raised directly forward, permanently). The chest line on the front is way shorter than on the back. Tuxedos/blazers aren't made to be worn while moving your arms to the front, which is why some old-time uniforms like rowing blazers had an opening at the back otherwise they would rip right through the mid-back line.\n\nYou're better off getting a pattern online for a dog tuxedo and working with that, then altering the measurements as needed. Or even better, buy a ready made large sleeveless dog tuxedo so you don't have to worry about leg movement and the llama won't suffer heatstroke or something.\n\nSource: Used to work in fashion and I love animals lol",
            "[deleted]",
            "[deleted]",
            "This might sound like a nice idea, but unless your friend is a very experienced llama handler and the llama in question is very well trained and used to wearing such outfits this plan has got a very high likelihood of ending up on r/WCGW or similar.\n\nA full-grown llama is 2m tall, weighs >250Kg and is very strong indeed. If it decides it doesn't want to do something then it will take 4 strong adults to persuade it to go. If it gets annoyed, it will start spitting vast green gobs of foul-smelling half-digested grassy compost. If it gets really mad and decides to lash out, its front claws are perfectly capable of giving someone a really serious injury.\n\nA well-trained, expertly handled llama can be a lovely guest at an event, but it takes a considerable time to get them to this state. If you are thinking of hiring a llama, make sure you talk in detail with the handler about what the llama will or will not accept in terms of clothing.\n\n(Source: have two pet llamas, either of whom would go completely apeshit if you tried dressing them up in anything or taking them into a room full of strangers)",
            "I think you might be better off making something like a horse or pony blanket that looks like a tux. Something like this: [https://s192.photobucket.com/user/ckrhphotos/media/2nd%20NOS%20Rehearsal%202010/IMG\\_8467.jpg.html](https://s192.photobucket.com/user/ckrhphotos/media/2nd%20NOS%20Rehearsal%202010/IMG_8467.jpg.html)",
            "Mate, what I’d do is make clothing to fit the upper 3/4 then have adjustable straps underneath.\n\nThen if you make your clothing for an average llama you can adjust it to fit on the day.\n\nAlso, aren’t alpacas a little tamer and will be easier to deal with, while still keeping the gesture reasonably true? I’m not a South American mammal expert, but it might be worth looking into.",
            "You either need to ask for measurements or just do a \"dog harness\" shaped one [like they do for horses](https://bree1972.files.wordpress.com/2010/07/fri2.jpg)",
            "Here you go: https://imgur.com/a/y21WiMw",
            "Which way will the Llama wear the pants? https://media1.s-nbcnews.com/i/newscms/2015_53/917821/dog-pants-today-151230-tease_0_1a27b77f361f07e5a1574feab11f84e7.jpg",
            "I think you might be trying to make this too perfect. I would suggest dumbing down your design a bit. Think about those t-shirts that look like a tux but are just colored fabric. Hang the 'tux' over the llama's neck and have it connect behind the legs. If the llama is okay with that you could try adding 'tux tails' by pinning two strips to the back of the llama. \n\nYou can probably use velcro in small amounts if that is the only way, but remember llama's have hair and it could get caught, which will upset the llama. \n\nYour idea probably looks much better, but may take more time than is realistic. \n\nTo answer your question on llama size. There are many breeds and many more differences based on age and coat thickness for the climate. If your llama is from a petting zoo and its job is for petting only, it is most likely a standard breed, but a smaller size. It might compare to a pigmy horse. You might not be familiar with that so it might be close to the biggest dog you've seen multiplied by 2, maybe 3. I would guess a max circumference at the breast near the legs of 4 ft, but bigger llamas could get to 5-6 ft.",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "Llamas come in radically different sizes. Like humans. You need to measure your specific llama",
            "[removed]",
            "Your problem here is that llamas vary is size quite a lot. I could get some numbers for you from one of mine, but even 2 are father and son and fully grown, they vary quite a bit in proportions and size. \nYou'll need to get the sizes of this particular llama.\nThe other problem here is that llamas are very bushy, and i imagine the llama will overheat very easily unless it is shaved, or the clothing is perfectly breathable. \nThe advantage of the bushiness of the llama is that you may be able to just get close to the right size and it will look like it's perfectly fitted.\nHis time of year, mine have about 4inches of fur in certain spots.",
            "Hey over to r/sewing. They won’t have measurements but they’ll have tips for making an adjustable tux which will probably make your life easier",
            "[removed]",
            "Make sure to also account for the llama's privates, just in case.\n\nI have goats here, not llamas so I can't get the measurements sadly.",
            "[removed]",
            "This.\nIs.\nEpic.\n\nOP and u/DJ117Xx are now my new favorite people in the whole world. One of you HAS to post a followup, I'm guessing it'll prolly be in r/TIFU or r/legaladvice\n\nAnywho, gonna need that link.",
            "[removed]",
            "I really hope you plan to do a follow up post. I am sincerely excited to see a photo of a llama in a tux at a wedding.",
            "It entirely depends on the llama. You'll have to measure it yourself or request measurements from the customer",
            "I haven’t seen this reply yet, but if he’s renting the llama, see if he can call the renters and ask for it’s dimensions!",
            "Could you use stretchy fabric? Llamas, unlike people, probably won't like being restricted from movement in any direction. They'd rip the tux in a heartbeat.",
            "[removed]",
            "47% of an adult camel",
            "I suggest you make all the various clothing ‘tear away’ design with velcro. Far easier to put on and and take off without fighting with the llama.",
            "I know this is NoStupidQuestions, but goddamn cuz what you smokin",
            "With all due respect, is this a Monty python sketch?",
            "Let me tell you the story of my people.",
            "I think this is my time to shine..",
            "Llamas are larger than frogs.",
            "I’m so happy you exist.",
            "I need pictures of that Llama in that tuxedo! And please give him a Fedora as well. Or any kind of hat.",
            "I live with 2 llamas and an alpaca. How exact does it need to be cuZ I'm not sure if I wanna be up in their face looking at the exact number.",
            "How the fuck are you possibly gonna make a suit for a llama without its measurements? I honestly don’t think that’s possible since they come in all different sizes.\n\nEdit: grammar",
            "You'll need a tape measure for that, maybe a large ruler to measure its height more easily.",
            "You could always add adjustable straps to the legs and waist with a way to secure the length of the extra strap. This way you can get close because it depends on the weight and amount of hair the llama will have. If you make it with adjustable clip straps will also make it easier to put on and take off.",
            "Anything bespoke by definition needs to be measured per the person or llama who will be wearing it. You can't expect an off-the-rack tuxedo to look like anything but shit.",
            "youd have to measure that specific animal. theyre different sizes",
            "You need to call the place that has the actual llama and get its measurements. A general person's measurements won't look good on a particular person, ditto llamas. You want him to look well dressed, not simply be dressed.",
            "Even if you r concerns are real, why would you ask here instead of the owner of the llama so you can make the tuxedo fit that specific llama?",
            "Instead of full tux you go with a shirt collar with a bow tie, and maybe cuffs for the feet? If you use Velcro you could adjust to fit on site. He would still look formal, but you also won’t have to worry about him freaking out if you put unfamiliar fabric on him? Or perhaps you could look up llama blankets to grab dimensions from that and just make a blanket with tails?",
            "If you're going to tailor an outfit, shouldn't you fit them first? Llamas aren't 1 size, just like humans.",
            "I dont know the demensions, but you damn well better post a pic of the llama in his tux once this is all over.",
            "OP when's the wedding, so I know how far back I need to set a remind me for, I want to see the lama in the tux",
            "So uh...we're getting pictures when it's done. Right?",
            "I feel like this is gonna be one of those reddit inside jokes now\n\nLike the \"I also choose this guy's dead wife\" thing\n\nAnd Im glad to have witnessed it",
            "They are 4th dimensional. They exist in 3 geometrical dimensions and time.",
            "Please post pictures of the llama when he's all dressed up!",
            "[removed]",
            "Did you get payment before starting this work?",
            "6",
            "¡Cuidado Cuidado Cuidado há llamas!",
            "Is... is this real? Please tell me it is.",
            "I love that you were hired for this",
            "Following this post so I remember to look for tuxedo llama later",
            "Hope he thinks about his sister and it being her day. No joke is worth ruining her special day as amazing as this is lol.  Make sure he knows it won't ruin her day please. People (hopefully) only marry once.\n\nPlease post pictures if this goes off lol\n\nEdit: terrible cell typo",
            "They're too varied to give you an answer. But this is one of my favorite questions I've ever seen. Thanks for asking!",
            "Make sure it doesn't have to touch his head much. Llamas hate things touching their heads.",
            "Are we talking Ecuadorian Mountain Llamas? Venezuelan Red Llamas? Mexican Whooping Llamas? Perhaps a North Chilean Guanaco (closely related to the llama)?",
            "I imagine it would be fairly difficult to get the exact measurements of a llama, so may I suggest some sort of tuxedo collar [like](https://images-na.ssl-images-amazon.com/images/I/61914wXwh2L._AC_SL1001_.jpg) [these](https://s3.weddbook.com/t4/2/2/2/2227592/dog-tuxedo-basic-bandana-vest-wedding-tux-black.jpg)? It would probably be much easier to put on as well.",
            "Why couldn't the owner of the llama just give them to you??"
        ]
    }
]