[
    {
        "post_id": "10bsisf",
        "author": "Revolutionary-Boss77",
        "title": "So about that cop orgy … why all the hate goes towards the woman involved only ?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/10bsisf/so_about_that_cop_orgy_why_all_the_hate_goes/",
        "score": 21163,
        "num_comments": 3029,
        "created_utc": 1673713618.0,
        "selftext": "I see so many comments hating on her looks meanwhile the men involved are not supermodels either. \n\nI see so much hate towards her only , things like oh she was married. The other men were married too. Also comments like oh but they risked their career for her.\nSaying things like oh maybe “the ass was big or the pu…y was good” to make up for that face \n\nReally ? It is all about what the men want. Why nobody is thinking about her as a human \n\nShe also risked her career. How those men career is more relevant than her career. \n\nIs there something I am missing ?",
        "permalink": "/r/NoStupidQuestions/comments/10bsisf/so_about_that_cop_orgy_why_all_the_hate_goes/",
        "comments": [
            "Cop orgy??? Wtf??? \n\nI'm gone for 2 days and I come back to this lol",
            "[removed]",
            "This is an ugly situation, it attracts ugly characters like flies.",
            "I could less of a shit about them having sex, I'm pissed that this is more of a fireable offense than beating or killing innocent people",
            "[deleted]",
            "Not only that, but a male officer was fired for choking a woman at her desk. Why isn't this talked about? Why don't we know his name? It's the same department during the same time. But sure, let's keep focusing on the women who had consensual sex.",
            "If you search up “cops fired” all but 1 of the articles are about her and her husband. The articles highlight her specifically. Like, “Tennessee cops, including married female officer, fired after repeated wild sex romps” So I don’t exactly blame Reddit themselves all to much. But yeah it is kinda weird they chose to only write stories about her.\n\nedit: the insults and hate towards her is absolutely horrible, just saying how I can see how most of it would be focused on her considering she is the most relevant when talking about the story itself.",
            "For those out of the loop, 5 cops were fired and 3 were suspended for doing sexual stuff while on the clock. (Sources: [one](https://torontosun.com/news/weird/tennessee-cops-fired-after-wild-sex-romps-with-female-officer), [two](https://www.usatoday.com/story/news/nation/2023/01/11/la-vergne-tn-police-sex-scandal/11034860002/) )\n\nAs for why the woman involved is getting the most attention, it's likely because she is the common factor.\n\n(Not that it's important, but there's some misleading understandings about the marriage thing. She's actually in an open marriage. Some articles phrase it as if this was done without her husband's knowledge. Also, the department is of 60 people, and is now down by over 10%.)",
            "Can someone fill me in? There was a cop orgy? What? Where? When?",
            "When we said fuck the police, this is not what we meant.",
            "There are at least four elements in play. \n\nShe is the central figure in the situation, so naturally stories and posts focus on her and reactions to her actions. The one-to-many relationship in a small network/cohort is what makes it atypical and therefore noticeable (hestiant to use 'newsworthy', but it's along those lines of selling newspapers).  \n\nThe second element is rooted in sociocultural norms and expectations. These are far from universal, but it'd be disingenuous to suggest they don't exist. Why the double standard exists, its genesis and other factors are worth discussing, but not whether they exist. Those drove a lot of the framing of stories and responses. \n\nThe third element, misogyny, plays a substantial (but not necessarily sole) role in leading to those norms and expectations, and drives a lot of commentary/reaction to it. Note that someone  can arguably harbor the mentioned sociocultural beliefs (which can be characterized as misogynistic) without necessarily being inherently misogynistic themselves. \n\nLastly, the fourth element is that it's a high-profile profession with its own set of norms and expectations (both internal and external). If this were a group of dentists or accountants, the story likely would not have gotten much traction. But it's a group that is supposed to represent following and maintaining rules. Whether this was an internal gambling ring or some other coordinated ostensibly illicit (or at least promise-breaking) activity, that it was a group of police doing it draws attention. That this was an ostensibly lascivious activity increases this element.   \n\nNone of these are mutually exclusive and not all are necessarily present in each story/post.",
            "No, it's pretty open mysogony. You're not missing anything",
            "I don't get why people give a shit really\n\nsure, keep it off duty, but they can bang all they want imo",
            "She even slept with George Santos when he was the Chief of NYPD",
            "If one guy had sex with all the girls then the one guy would be the focus of the story",
            "Welcome to the internet....",
            "What cop orgy? Link?",
            "thats what gets a cop fired? An orgy? 💀 Bruh",
            "Probably because the guys only fucked one person, and she fucked like 6",
            "They are all equally trash and unfit to be police officers in my eyes. \n\nI think the woman gets most of the flak because she was sleeping with 6 different people, while the dudes were just sleeping with 1 person each. She was to local roller-coaster.\n\nAgain, they are all equally unfit to hold the position they had and I don't feel bad they all lost their jobs",
            "While it is interesting the men have a lower profile, it's mostly due to the fact they all link back to her. If you mention the man, it includes her name and the various act they did together. \n\nIt shouldn't be national news at all, but sex sells in this country.",
            "Can we just agree everyone involved is bad and should be ashamed? Problem solved.",
            "She is the main focus of the article and the common link between all of the people involved. She was also the new element introduced into an existing environment.",
            "What cop orgy? what sites? tell me so I can avoid this despicable thing or accidentally stumble upon it.  😉 😉\n\nalso women bad (sarcasm)",
            "Cop orgy? I must've missed that one on pornhub",
            "Yeah and the Reddit algorithm keeps pushing it at me even after I tell it to frig off, Lahey.",
            "When i first read it i was thinking about how all their S/O's deserve better",
            "I honestly have to say, if I have to get pulled over by a bad cop, and I can somehow choose between a cop that has their entire department run train on them and a cop that is gonna sprinkle crack in my car, I choose train cop every damn time.  I just don't get why people even care about this when cops out here fucking killing people for no reason.",
            "Because she was having sex with 5 guys.\n\nThe other guys were having sex with 1 woman.\n\nAnd all news said she had a husband. They don't mention if the other guys had wives.",
            "To all the people saying it's ok because she was the \"link\" between the male officers:\n\nWhy does it matter who got penetrated and who did the penetrating? They ALL took part in that orgy.\n\nDo we even know if there was gay sex involved? Would it even make a difference? Why single out one person out of all of them?\n\nThey should all be held responsible equally and for the whole day, I've only seen HER picture. I don't even know what the other dudes look like. They get so be somewhat anonymous (so far), while her face is all over the internet. You can't tell me that's fair.",
            "because people hate women",
            "You could at least link to what you're talking about.",
            "I'm sorry slow down. ABOUT THE *WHAT*",
            "I understand it's unprofessional and completely disrespectful to their job, but like. I don't see this as such a big deal, it's not like they were raping anyone or trafficking people to a sex island. Absolutely disgraceful behavior yes, worthy of hate and outrage, not so much. The police commit far worse atrocities on a daily basis other than fuckin each other on duty.",
            "Fucking THANK YOU it was driving me insane seeing the meme pages with her face plastered all over them. If it was a guy who'd slept with a bunch of female police officers everyone would call him a \"chad\" and move on or some shit. Honestly knowing reddit I shouldn't have been surprised at all.",
            "Oh, it's literally just misogyny. Surprised it's so mainstream? Me too. /s",
            "The first article I saw had her picture, ONLY her picture. That stood out more than the salacious story.",
            "There's hate? I just want to see the body cam footage before I make any rash judgements.",
            "The what",
            "Because reddit abandons their morals when it's someone they don't like. It's a show for half these people.",
            "Sounds like a good time to me. Just don’t do it while you’re on the clock or behind your partner’s back.",
            "Yeah, I’m not crazy about that either. They all should be shit on equally.",
            "You are missing the link to whatever article or clip you are referring to.",
            "I mean, I'm a woman and I don't see misogyny. The focus is on her because she was with like five people when the male cops were just with her. I think it's extra hilarious because she looks so wholesome",
            "Also, many of the men involved were higher ranking (sergeants, detectives, etc)",
            "Sexism",
            "Because she fucked 6 dudes, 6 dudes fucked her. Also she lied about being in an open marriage and from what I understand she initiated it every time",
            "Misogyny is the correct answer. If you dig a little deeper, you'll find that one of the male cops, when confronted by his wife who found out about the affair, beat the shit out of her. Way fucking worse, and barely any coverage in the media.",
            "Of course it's fucking Tennessee",
            "Cause for women enjoying sex is still considered shameful in society, just standard misogyny. Same reason female porn stars get insulted and male pornstars put on a pedestal",
            "Because she fucked all of them. They weren't fucking each other as well. She entered a male dominated field and fucked a bunch of her coworkers. If a guy becomes a teacher and fucks half the other teachers at his school he's going to catch 90% of the flak because he's at the center of it all.",
            "I'm not sure what you're talking about. Unfortunately Google search brings up a lot of results that most likely aren't related. \n\nBut I think women often get very unfairly criticized.",
            "I think cops are always fooling around on the job one way or the other lol",
            "Misogyny, plain and simple",
            "I think the thing we're all missing is when did we need to make any of this hoopla our business? Outside of the communities those officers served, their proclivities really had zero impact on the rest of the world. Just another pointless distraction. Can't wait until this runs its course like those endless posts about the Johnny Depp / Amber Heard trial.",
            "Why has no one mentioned the most important part: the husbands name was Jedediah. Didn't realize this happened in an Amish police station.",
            "Can someone please explain to me what's wrong with consenting adults having sex? I get if they're mad that it sometimes happened while on duty because that is a misuse of taxpayer money, but the reports mention all kinds of off duty incidents. I understand people are married, but that is a domestic issue between the involved spouses and not a public one. The whole thing feels like an excuse to shame people publicly, especially the woman.",
            "Takes vary with the sub you're in. Transfer that many subs seem innocuous in the surface, but in reality are efficient hate machines filled with the rejects fleeing from many past banned subs like thedonald.",
            "Yeah, I agree it's weird.  Looking at the photos, she's easily the most attractive human in the department, let alone involved in the on-the-job fuckin'.",
            "[deleted]",
            "Bro if one girl fucks 12 guys of course she’s gonna be the headline. If one guy fucked 12 girls, he would be the headline as well. It’s not rocket science to figure out why she’s the main topic of conversation",
            "So is there a video?",
            "Googled \"cop orgy\" and....well let's just say I still don't know what you're talking about",
            "Wait until the hear about the fire service/ EMS",
            "i have no idea what you're talking about. this feels manufactured",
            "Can someone give me some context?",
            "It's exactly what you think it is.",
            "Because they were all fucking her, so she’s kinda at the center of this thing. Both literally and figuratively. If one guy was fucking ten women, I bet he would be in the spotlight.",
            "Because this is how we \"America'....we haven't even ratified the ERA ( and there is no push to do so because Americans are both ignorant and misogynistic).  \n\nWAKE  UP ...source: Rage Against the Machine",
            "[deleted]",
            "Fat ugly incel Redditors hate women who act like they would given half the chance. News at 5",
            "It is easier for a woman to get sex and they are seen a slut for having a lot of partners.\n\nFor men it is harding to have sex. There is less stigma for cheating and having more than 1 partner because the thought is they earned it through social status, charm etc.\n\nThis is not the PC answer but I think it is subconsciously  why people act that way.",
            "Think because she was the common denominator.",
            "The what now?",
            "reddit is full of incels. this is the type of content that brings them out of the gutters.",
            "I still don't understand why this affair make so much noise. Like \"Someone cheated on his partner with many others....wooo first time ever\" this whole thing don't make any sens. It's just a bunch of people who are crazy bored in their own life"
        ]
    },
    {
        "post_id": "mlsyli",
        "author": "Sycthez",
        "title": "Does any other guy watch no sports?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/mlsyli/does_any_other_guy_watch_no_sports/",
        "score": 21124,
        "num_comments": 4928,
        "created_utc": 1617765239.0,
        "selftext": "I literally watch no sports, and am wondering if anyone else doesn’t either.",
        "permalink": "/r/NoStupidQuestions/comments/mlsyli/does_any_other_guy_watch_no_sports/",
        "comments": [
            "Not one sport. My mom tried to introduce me to a few sports when I was young, but I’ve never managed to take any interest.",
            "Yeah +1",
            "I went to super bowls parties as a kid for the free food and would probably still go just for the free food if I were invited.",
            "If ever you find yourself asking/\n\n“Does anyone else...” or “Am I the only one who...”\n\nYou’re not.\n\nUnless you’re doing something really fucking weird.",
            "I watched Silence of the Lambs recently. That’s about as close as I get.",
            "Does anybody else feel like this sub is just kinda becoming another /r/Doesanybodyelse?",
            "[deleted]",
            "bruh... you're on reddit\n\n&#x200B;\n\nwhat do you expext",
            "Many men don’t. This isn’t at all uncommon. I work in a “manly” career field and some guys I know don’t watch sports pretend to in order to fit in. I don’t play that. I am pretty straight about not giving a crap about sports teams. Some dudes get all offended like “how could you not support *insert local team*” because it’s almost a cult around here. I counter with “I like video games so I watch videos of people competing in something I care about instead”. I value the need for hobbies and interests and getting hyped about a team you care about is perfectly fine, but we also live in 2021. Watching competitive entertainment is no longer restricted to watching a sports game on TV. I can cater my interests specifically to me, and receive quality entertainment in my niche",
            "Yeah. The only thing that I might watch are F1 races or at least highlights.",
            "Relevant \"IT Crowd\" link:\n\nhttps://youtu.be/msN7HNncHik",
            "I don’t watch any sports but I kinda wish I did. I’ve always wished I was a part of a certain sport sphere, because I recognize that there is a lot of interesting aspects that are in each sport out there. But I never played sports seriously when I was younger, and my dad wasn’t into sports either, so I never really grew up with it. I’ve tried looking into learning the rules of a sport, basketball in particular, and the sort of industry behind it but it all feels so difficult to jump in and follow.",
            "[removed]",
            "[removed]",
            "[removed]",
            "I've watched probably a total of two hours of sports in my entire life",
            "I only watch mma and disc golf",
            "it looks like the Majority\\* of young Men\\*\\* don't watch sports.  \n\n\n\\*51%\n\n\\*\\*age 18-24   \n[https://www2.deloitte.com/content/dam/insights/us/articles/TMT-Predictions\\_2019/R711978\\_Does-TV-sports/figures/TV\\_Sports\\_Fig1.png](https://www2.deloitte.com/content/dam/insights/us/articles/TMT-Predictions_2019/R711978_Does-TV-sports/figures/TV_Sports_Fig1.png)",
            "Sure. I'm a musician/producer, none of the musicians I know watch sports",
            "Sport bad",
            "I know a lot of men that do not watch sports. \n\nI don’t seek sports out but if it comes on, since I know the rules for American sports, I can find enjoyment.",
            "The Olympics and that’s it",
            "This really is a dumb question. Serious born in le wrong generation vibes",
            "Yep.... I find sports incredibly boring. Though I have gone to baseball games and quite enjoy it.  It’s a fun experience, even when you don’t really care about the game.",
            "Almost never.  I know sports, I've played and still play sports and I love live hockey but I almost never sit down and watch a game.",
            "I don't and it's surprising how isolating from other men it can be.",
            "I don't watch any. Everyone where I work watches it and when I tell them I don't watch any they look at me like I farted at a funeral.",
            "Yup, no sports for me!",
            "I don’t watch sports.",
            "Love playing sports, hate watching sports",
            "I literally watch no sports.  The only time I will 'accidentally' see some is if I am at my folks or in-laws' house when a game is on.  Like when we gather for thanksgiving and the rose bowl or whatever is on in the background but I never actually watch sports.",
            "I don't",
            "Oh yeah, for sure.  Sports aren't for everyone.  I personally love sports but I have a few friends that really don't have any liking for them.  They'll play them, but not watch and don't care.  So don't worry about if you do. 👍",
            "I do not except for every 4 years when swimming is on during the olympics other than that I do not care",
            "Only snowboarding and skiing",
            "I love one sport, and only one--baseball. I mostly love to play it, but I will watch it out of interest just to see how amazingly good the players are at the thing I try to do. \n\nI never watch any other sports--couldn't care less about football, soccer, hocket, etc.",
            "I stayed up all night and watched the 2014 world cup final with 10 of my friends in a hotel room. It was that day that I realized that I only care about the scores and the memes about the game, none of which require actually watching any game",
            "Played most of them, hate watching them. I like going out and being physical but why would I watch someone else do it when I can just do it myself. Like it's the same thing with twitch. Unless it is some god tier pro that I can learn cool tricks from, why would I watch them play a game I can just play myself and have much more fun.",
            "Not much else to add other than I don't either.",
            "[deleted]",
            "I watch zero sports. Have no interest in watching any sports. Never watched a game all the way through in my 34 years.  When people bring up sports in conversation I have no idea wtf they are talking about.   Name me a team and I’ll have no idea if it’s baseball or football or anything else.  Played waterpolo though, that was fun.",
            "I never watch sports, I find them boring.  And I played basketball in college.  \n\nI used to HATE watching game footage, even if I was playing...",
            "I used to, I just got no time now 🙃",
            "Non sports guy here. I don’t mind watching them if they happen to be on TV at a restaurant/bar but I don’t consider myself a fan.",
            "I like playing basketball and such but sitting down to watch a sport is the most boring thing I can think of. I don’t understand the fun, I don’t understand why people care so much about their teams. And it’s weirdly very un-athletic people that are obsessed with sports.",
            "Fuck man i dont even watch TV anymore, unless its when im hanging out with my kids, like Spongebob or something. Idk maybe i have ADD or some shit but i just cant get into anything anymore, let alone sit still that long",
            "Hello",
            "Same here. I always thought I was alone and that it was emasculating until I met more like me.",
            "Absolutely not. I have other things I like to waste my time on. And even more so, I don't care to waste any space in my brain with stats on people who often times have a very specific and meaningless skill set. Don't get me wrong, I appreciate the awesomeness of what some of the athletes can do, but I find it very entertaining when guys who are extremely out of shape, and most of which didn't even play varsity in high school, let alone college have a lot to say about a game. I've played sports in my day, but I can also say that fitness, intelligence, and personality are not at all tied to knowledge or interest in sports LOL.",
            "Not a fan. Simple as that",
            "Yup, me. Not even remotely interested",
            "I hate sports. Hate the bro culture and that they’re so fucking boring to me. You’re definitely not the only one bro",
            "I don’t watch sports on TV. My kids and I play sports but rarely watch them. It seems like a big waste of time to me.",
            "I think masturbating is a sport?",
            "None here.   41 years, and it just never clicked for me.",
            "My dad tried to get me into football (soccer) as a kid, 2-3 hours every Saturday from I was 4 to about 12, trying to make me ‘get good’ at it. I had no interest in it, but, you know ‘boys play sports’, so every Saturday it continued, as did my disinterest. Eventually my dad got so irritated with me ‘not trying’ he kicked the ball at me as hard as He could because ‘if you play in goals you need to be ready for this’. I tried to grab the ball but he kicked it that hard the impact broke 3 of my fingers. \n\nHe stopped trying after that",
            "Never been able to get into sports, my dad would always be watching football, darts and F1. I was more into mythbusters, Futurama and video games 👀",
            "I have nothing against them. They just don't interest me.",
            "No you are the only one. It would seem that you mental conditioning is faulty. Please stay where you are. The Secret Police, which none of us know about, will be by shortly to pick you up for reconditioning.\nRemember to Forget and Forget to Remember.",
            "I don’t, they are just not interesting.",
            "I don't. I find it boring. Sometimes I watch highlights.",
            "I dont usually, but I will watch the Olympic hockey every 4 years.",
            "I watch esports if that counts",
            "[deleted]",
            "The Olympics are fun sometimes (i.e Usain Bolt), but never team sports.",
            "Me, i really could not care less about them.",
            "I don't watch sports. It's kinda boring. And don't play either.",
            "It's an interest, just like anything else. The stigma that says male humans inherently should like sports (or any hobby) is basically gone in most cultures. Also \"sports\" can be just about anything from football to League of Legends and chess.",
            "I didn’t for many years.",
            "I only really watch Football, and wrestling if you wanna count that.\n\nI've fallen out of love with Basketball, Baseball, and Tennis, and I used to love and follow those a lot too.",
            "Played sports as a kid but could never really get into watching them.\nUsed to watch hockey with my roommate but that was more of an excuse to hang out and drink.",
            "The only sports that I watch are figure skating and marble league when my wife or daughter have put them on.",
            "I try to watch some a couple times a year but always get pretty bored. I don't mind hearing the final scores for my teams but beyond that it gets boring.",
            "I only follow world cups or olympics. I don't really care otherwise",
            "I also watch no sports. Have other things to do and it really ticks me off that I have to pay for all those many useless to me sports channels on my cable tv.",
            "I don't like sports, I'm a baseball fan.",
            "I don’t watch any. Live in MA and very close to the stadium the patriots in. People around here are shocked I don’t watch. I also hate the “we won” speak. Bitch you ain’t part of the team.",
            "Not really \n\nUsed to watch little icehockey but meh, not anymore",
            "I only watch esports",
            "I've always found playing sports more fun than watching. The only kind of sport I watch is racing of various types but I know many who wouldn't consider it a sport. The typical team sports though I have no interest in.",
            "So I don’t follow any, but if/when my friends invite me, I know the rules vaguely enough to any sport that I bandwagon with whatever team they’re supporting. For me, the real sports are the friends we make along the way",
            "I only watch the ones that I was playing. It was basketball in high school and university and tennis in my 40’s",
            "Hard pass. It's just another stereotype",
            "Never was good at sports so I never had an interest or knew enough about it to care. Personally I think its not a thing that can be quantified easily and most people who think they understand the game better than the coaches or players are talking out of their Asses. There are very few decisions in the game that Seem to influence game itself (outside of certain plays or formations etc.), and it seems to come down to what players are having good days or make the least micromistakes. I have much more fun watching e-sports the games rules are clearly presented and its much easier to see how the decisions the players are making are impacting their chances of winning. At least once youve put enough time into a game at least.",
            "What is this \"sports\" you speak of? \n\nI like to act like I don't know what sports dudes are talking about when they ask about how a particular team is doing.\n\nI found the pandemic's effect on sports in this country very amusing. \n\nTo answer your question, I don't watch sports. But I do know how to watch sports when I have to so as to blend in amongst sports fans.",
            "Yep dont care about it at all",
            "Same. And most people just assume I would because I totally look like the guy who would watch tons of sports. But it’s annoying. I love when people rant to me about a player or game and Im just standing there like I have no idea what the fuck you’re talking about.",
            "I don't watch. I don't play.\n\nMy father wanted nothing to do with me after he figured out I was \"bookish\". Instead, my mother brought me into the kitchen. It has taken half a century to make peace with this fact. Now, I step into the kitchen and cook for my GF. It's one of the things which has won her heart over.\n\nNo regrets.",
            "Not a single one, bores the hell out of me and I hate the culture around sports.",
            "Sports = stupid. Such a pointless waste of time.",
            "I don't even watch TV - It's on with my wife watching but I have my head in a book, magazine or on Reddit !",
            "My bf doesn't watch sports, he says they are boring🤷‍♂️",
            "I never developed an interest in watching sports, either on TV or live in person. I find that I have many (what I consider) more important/interesting things to spend my time on. I do think that watching sports is an individual interest, not limited to the male of the species, nor do I think it makes one any more, or less masculine to be interested in sports.",
            "My favorite guy watches no sports. ❤️",
            "Never liked sports...playing or watching.",
            "My husband isn't on reddit (weird I know) but he doesn't watch ANY sports at all! He thought he was the only one. You're not alone :D",
            "Not a guy, but my entire family can be described as football fanatics and I never ever liked any sport at all. All I could think about were my bones if I ever played and it’s so boring just to watch. \n\nAnd when “we” won the Super Bowl I was “yay go us! But whatever”",
            "If my husband had hooked up with a non-sports woman instead of me, he would probably have lived out his entire adult life without watching sports.",
            "I have never been interested in any sport, the closest I have ever come is watching the occasional  starcraft   progame",
            "I'm from sport family but I have no interest in sports, seems boring to me. It reminds me... \nMy father was a football coach and I still don't understand how offside works :-)  I often triggered his colleges with this :-) \nI don't understand how someone can watch F1 in TV, most boring thing ever...",
            "Yep, same here. Never got into it. Once I discovered music, girls and drugs - I was like, “here, you take the ball”...",
            "Yeah, same i find them really boring too! The thing with me tho, I like playing sports, but i hate watching them, even the ones im interested in (volleyball).",
            "Yes. This is the internet, someone will always agree with you.",
            "I watch e-sports.\n\nI think years of playing video games and being involved and being able to play those games just has made sports seem boring. What I can do in a video game is infinitely more entertaining to me than every sports game I ever watched.\n\n&#x200B;\n\nThat said I've played most sports through out my life and I very much so enjoy actually playing soccer or hockey or rugby. But watching it is so. damn. boring.",
            "I have never played, or given a shit, about any sports. Just not for me. Although I just won March Madness at my work by copying someone online.",
            "I've tried in the past, but I really don't find it very engaging.",
            "I wish I liked sports but they are all so boring.",
            "Yep.",
            "Sure. Sports just don't interest me. I sat through four years of high school football games because I was in marching band and that was enough for a lifetime.",
            "I never have, zero interest. Seems a\nhuge  waste of time. Interestingly\nA couple of my best friends are sports nuts. They are pretty good about not talking sports when we are all together.",
            "I live in Canada and give zero fucks about hockey...\n\nNever really liked watching sports in general, but I do go mad for the world Cup every four years (although again, give zero shuts about soccer any other time)\n\nI've gotten into MotoGP over the last year or two",
            "Hate watching sports.",
            "When we were learning about the rise of Nazism in the 1930s, my high school teacher explained to us about how being a member of a group, wearing the same uniform, and shouting things together in tandem all contribute to a sense of self-worth in people with low self-esteem. Additionally, the feeling that you are a \"part of\" a group which produces strong leaders can make you feel as if you, too, are strong. \n\nHe made a throwaway comment at the end that it was \"kind of like some sports fans.\" \n\nSo... watching sports bolsters our sense of community and of self-worth. I'd say that if you don't need that support it's a good thing! ... although it could just mean that you have a streak of arrogance! :)",
            "I don't watch sport. I get why people play them but I don't really get how people want to watch them on TV for hours.",
            "Go to r/IHateSportsBall you’ll see several guys who feel superior for not liking sports",
            "I don't really see the point of watching sports, personally speaking. I gotta be emotionally invested in the team for it to be interesting",
            "sports get boring really fucking fast",
            "There are plenty that don’t. They’re outnumbered by the men (and women) that do, but they exist",
            "Me",
            "Yeah I don't give a shit about sports.",
            "I don't watch any sports at all",
            "I hate sports. I'm a band teacher, so I have to watch a bit of football - but that's it and I don't really enjoy it.",
            "I’m 1 of 8 guys at my job and the only one who watches any sports. I only like basketball and I kinda wish there was just one person to talk to about it lol.",
            "I've never understood the appeal of just watching something instead of playing it",
            "As a Canadian I've tried to hide the fact that I didn't watch a single game of hockey my entire youth. I'm 27 and only last year did I start trying to follow along hockey, (the only sport I can handle watching) and I still end up changing the chanel",
            "My father.  It’s frustrating as we are a big sports family.  He will sit and watch with us and say “yay sportsball” when we cheer so I can’t be to mad at him.  And he makes food and drinks. So it’s a win all around.",
            "[deleted]"
        ]
    },
    {
        "post_id": "knp9ye",
        "author": "LifeText622",
        "title": "Considering that “LOL” stands for laugh out loud, as an English speaker I’ve always wondered in countries where English is not the native language do they utilize this same abbreviation even though they speak another language when texting?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/knp9ye/considering_that_lol_stands_for_laugh_out_loud_as/",
        "score": 21105,
        "num_comments": 2862,
        "created_utc": 1609418221.0,
        "selftext": "Or is LOL simply an English thing",
        "permalink": "/r/NoStupidQuestions/comments/knp9ye/considering_that_lol_stands_for_laugh_out_loud_as/",
        "comments": [
            "In Dutch, lol coincidentally means fun. As a kid, I just thought that's what it meant on the internet.",
            "\"Mdr\" in french, \"mort de rire\" = \"dead laughing\", but we use lol too.",
            "i don't know if anyone has mentioned this but thailand uses 555. 5 in thai basically translates to ha in english so when you say 555 you're saying hahaha. i think its quite cool",
            "In China it's \"h\" because it's pronounced like \"ha\" \n\nSo you might say \"hhhh\" to a funny meme in a text",
            "Where I grew up in Denmark, we used LOL even when speaking Danish, and it seems my younger brothers do the same.",
            "I am from Czechia. We just use English abbreviations, lol, btw, idk, tbh,... We do have some in Czech like 'mmnt' which means 'wait a minute' but we use mostly the English ones.",
            "I'm from Russia. We usually use hahaha as in хахаха или ахаха, but my peers (I'm 26 btw) quite often use LOL as лол or ололо, even though the latter is a bit dated already. We also use кек which was loaned from Korean. It can also be used as a verb, кекнуть, кекать. \n\nAs a side note, it's quite common to use parentheses instead of smileys, so it will be like )) instead of :) and (( instead of :(. If a person you're talking to uses parentheses this way they are quite likely from Russia or some post-Soviet country.",
            "in turkey you hit just random keys\n\nlike this : ASDKFDÖLEÖDDSWASOJ :D",
            "here in Brazil we use our own abreviations, it's really rare to see someone using \"LOL or BTW\" and we laugh in the internet with \"KKKKKKK\" mostly, but some people use \"KAKAKAKAK or KSKSKSKS\"",
            "[deleted]",
            "I have heard Japanese people using wwww or kusa(but the character which depicts this) instead of lol.\n\nI am not Japanese, and have little experience with that hemisphere! So anyone more experienced feel free to correct me.",
            "[removed]",
            "German 20 year old here that (I think) knows her way around internet culture pretty well!\n\nIn my social circles (around 15-25 years old) we use \"LOL\" in the context of when being in awe, I think. As in \"No way!\"\nExample: \nYou just found out that your teacher from elementary school, of who you had always thought gave off the vibes of a criminal, was convicted of a crime yesterday\n\nWe also use \"lol\" (no capital letters) as kind of like a chuckle. Or something passive-aggressive. A fake \"LOL\"..\nExample:\nA group-chat scenario: \"Look, doesn't this video remind you of [your name here]?\" (You're slightly offended/not amused, but dont realllly wanna start something right now).. so sometimes, people get the \"lol\" instead of a pure \"Hahaha\"\n\nWe also don't read/say the letters L, O and L but we just pronounce \"LOL\" as in Lollipop\n\nA little bit of German texting-culture trivia for you! Maybe this is the same in other countries, I don't know!",
            "I’m unsure how common it is, but I’ve noticed Spanish speakers abbreviate “que” as “k”",
            "Jajajajajajajajaja\n\n\nㅋㅋㅋㅋㅋㅋㅋㅋㅋ",
            "In Spain XD was always pretty prevalent. It even came to mean different things depending on the way you wrote it, like maybe xd has a sarcastic tone to it.\n\nWe use LOL too, though. It's easy to pronounce with Spanish phonetics as is, so we even use it vocally. But we also use it when something is bizarre. Like when someone's telling you something unbelievable so you go \"lol\".\n\nBut I can't think of something specifically in Spanish.\n\nAmong other acronyms WTF hasn't caught on, because we already have ¿Qué cojones?.",
            "in the philippines we have a word \"ulol\" which is a cuss word meaning an insane/crazy person. it can be both taken as derogatory or a light joke depending on who said it you or the tone they used. anyway, when i was growing up i thought \"lol\" was shortened form of ulol and later find out it was actually a completely different thing. but yeah, we use lol the same way.",
            "Not a native speaker but fluent in English. We use lol as laughing out loud even when we‘re not speaking English. Then again we might just switch from one language to another or use words and expressions from other languages.",
            "In Arabic we transliterate lol into arabic letters: لول",
            "In French we use \"mdr\" which is the abbreviation for \"mort de rire\" which translates to \"Dead of laughing\" :)",
            "xaxaxaxa or )))))",
            "In Finnish we use LOL and other English abbreviations and even words commonly in our speech. LOL has more or less the same meaning as in English.",
            "I'm from India and we use almost all of the same abbreviations that you guys use.",
            "I am Greek, and we use lol while chatting with my friends as far back as it was first introduced. It feels as it has become a Greek word with the years of usage.",
            "kek",
            "[deleted]",
            "Yes, we do in Italy, only young people that spend time on the internet tho.",
            "חחחחחחחחחחחחחחחחחח is hebrew",
            "In Orcish (the primary language of the Horde in Azeroth) they use “kek” (at least that’s how it sounds to the Alliance)",
            "I have Peruvian family members and they use jajaja.",
            "Saving this post because this is an interesting question",
            "In Mexico we say “NMMS *with laughter emoji at the end*” which means “No mames”. \n\nYou must include the laughter emoji or it can be interpreted as you being mad or disappointed. It depends a lot on the context but emojis are mostly critical to explain what you mean.",
            "In Italy we do",
            "In Hungarian so much English has creeped in. Even if you never really had English classes you know a bunch of things from the internet. I suppose that is a by product of being a small country. \n\nWe use lol and when it was fashionable swag and yolo but we have our own ones when texting. Like v instead of vagy (I am) and h instead of hogy (how but we also use how more than English does). \n\nSome Hungarians also decided to translate meme. So it turned into énén. Literally me+me. \n\nDisclaimer: I am not a linguist.",
            "Here in germany, Yes we do.",
            "Well, I am studying English language and can say that most of my peers do use many of those abbreviations, as well as a lot of people who know English very well - even when writing in our mother tongue. Those people who can't speak English do not use them.",
            "I have some Thai friends who use “555” instead of “lol” the Thai sound for “Five” sounds like “ha”",
            "Most of Italian teens I know use it but not everyone because only some teens are \"exposed\" to the wondrous world of English, some of us don't give af about English and just don't watch English things so they don't really know English acronyms, it's really rare for someone to not know lol or lmao tho\n\"ahahahahahah\" is more used but we put random letters in there like \"ahahagahahjagaggajjaahahgayahha\" because we ain't got time to write it properly lmao",
            "囧 (joint) is a word in Chinese but often used like an emoji to express a feeling of embarrassment. \n\nAlso:\n\n666 means unreliable, deeply\n\n250 or 251 means I love you\n\n33333/hhhh means laughs",
            "in brazil, we use \"KKKKK\"",
            "Yes we do, I'm mexican and \"lol\" is used very often, in fact nowadays people here tend to use a lot of words originated mainly in the english speaking community such as simp, cringe, cuck, etc.",
            "Lol = a guy with one arm bent and the other raised the air. People here associate it with old school emojis.\n\nAlternativelty, if you say LOL here people will think you are talking about League of Legends.",
            "German here, my GFs little sister told me some time ago, in her age its commonly understood as \"lachen ohne Laute\" (=laughing without sounds).\nAnd I'm really weirded out by that ^^",
            "German here.\nIn germany we use LOL exactly the same as english speakers because we \"germanized\" it.\nBut other shortened words are not that common to use.\nThere was a time where rofl was used a lot but yeah.\n\nFun fact: we made the mobile phone in germany to \"Handy\".\nCause english word and also \"germanized\".",
            "Brónzies in Irish. Tá brón orm means sadness or sorryness is upon me and *Z* isn't a letter in irish. It's a very informal way of saying sorry and would rly only be used in texting, generally",
            "French-Canadian here. We use lol when texting, but it doesn’t necessarily mean that we’re laughing. Nowadays it is more used  to say that something is funny, but it is not really related to the action of laughing itself.\n\nSide note: The expression is less and less used over the years and tend to be replaced by the laughing emojis.",
            "I have an Israeli friend on a discord server who uses   ךםך \n\nI love it. It both looks like a laughing face with their hands up and pointing left, and looks like a form of lol.",
            "I think the French academic community ran into this issue when they started using lol and their academics protested saying that it erased the French acronym mdr or mort de rire.",
            "I speak both Russian and Armenian, and both languages use LOL",
            "For me LOL means League of Legends. My written laugh is jajajaja",
            "[deleted]",
            "in persian, the only word that we do that kinda thing to is the word \"salam\" which means \"hello\". instead of writing the whole thing we write: \"s\". that is pretty much the only word we do that to.",
            "\"www\" is commonly used among Japanese speakers because the word for \"to laugh\" is 笑う, which is pronounced like \"warau\". Its shortening to \"www\" coincidentally makes it look like a line of cartoon grass, so sometimes \"草\" is used instead, which is the character meaning \"grass\".",
            "Here in mexico some people that know a bit about USA culture will use \"LoL\" here and there or if someone like me for example uses it with friends, they will use it too after they ask what it means",
            "Pashto/Urdu speaker here. I chatting with my friends I use \"hahahahahah\" ....but on internet like game chats talking with foreigners inuse \"lol\"",
            "In Brazil, we most commonly use \"kkkkk\"",
            "In Belgium we generally just use lol when texting. I've never met anyone who uses a translation of the abbreviation.",
            "In Spain we use \"Lol\" like a shock expression, in some cases like someone told something that we don't expect we say \"lol\" A lot of people know that lol is laugh out loud, but in some point we start tu use it that way.",
            "In french we use LoL a lot but also mdr which stands for \"mort de rire\" like \"dying from laughter\"",
            "In Sweden, no. I can't think of any abbreviations we use in our own language like lol, ask, brw and so on. Some classmates I play with online even say 'brb' when the have to take a short brake.  Could be that I'm old and have no idea what the kids write.",
            "in Poland, lol at least in my circle is more of a surprise, when someone said something that's unexpected but not neccesarly funny and you say lol",
            "- 60% of my friends press random characters in caps: DKNSIDJEJD\n\n- 30% type \"hahaha\" or \"puhahaha\"\n\n- 10% uses 😂😂 (mostly used by 25+ yo)\n\nCountry: **Turkey**\n\nBonus: \":d\", \".d\" and \"xd\" are used when someone fails to make a joke and its not funny.",
            "In Serbia we use LOL, WTF (vatafak) and OMG commonly even in everyday talk. We even have our own version of WTF - ŠKK (Šta Koj' Kurac? Literally: What which dick?) and OMG - OMB (O moj Bože, same meaning).",
            "In Japanese, you'll see wwww and 草 a lot. \n\nIt started as using 笑 at the end of the sentence. 笑う (warau) means to laugh. And after a while, instead of writing the kanji, people started typing 'w'. And when you look at a long string of 'wwwww' it looks like grass, which is 草 in kanji.\n\nSo if you ever see Japanese text and see 'wwww', 草, or 笑, they all mean lol.",
            "im german and most of us use all english abbreviations like lol,lmao,idk,idc,ffs and more",
            "Wow, this is so interesting... so K is the funniest letter in other languages huh",
            "In Italy we commonly use English abbreviations like \"lol\" and \"btw\" even when speaking Italian. I have the feeling that the use of those would be frowned upon outside those circle of youngsters who frequently consume American/English content, roam the likes of Twitter/Twitch/Reddit's English speaking communities, etc... And I myself try avoid using them or at least to only use lol.\n\nWe do have contractions though(ie \"cmq\", being short for \"comunque\", meaning \"by the way\")",
            "You mean it doesn’t stand for lots of love?",
            "When you don't speak the same language, the chat automatically translates it to \"KEK.\"",
            "German here, we use the English one laugh out loud and we have our own \"translation\": lachen ohne laute (laughing without sound)",
            "In Soviet Russia, laugh does you out loud",
            "Maybe it's been mentioned (I wont search among 3k comments), but at least in Mexico, lol is very common in everyday chating, but not as a \"heavy\" laugh, but as a filler when something is a bit amusing or silly",
            "Ok, get this: if you type LOL on a qwerty keyboard in Hebrew mode you get ךםך, which looks just like \"LOL\" rotated 180° (it reads as gibberish, something like khmkh, but with the wrong type of letters... the explanation is too long and not relevant here). This is quite a nice coincidence.",
            "I think its pretty well known that spanish speakers use 'jajaja' while americans use 'hahaha', but its also worth mentioning that lol is being used more and more through influence of the internet, as you would expect.",
            "In japan they literally write grass instead of lol (specifically  草  or kusa) because the abbreviated word for laughing (warau) is written as w, so people spam wwwwww which looks like grass, which end up with the most ridiculous, convoluted and yet hilarious way to write lol I've ever seen.",
            "[deleted]",
            "Many British people use LOL to mean \"lots of love\". I discovered this when they texted me with things like \"Sorry to hear your mother passed away, lol\".",
            "In Sweden a lot of People who grew up with internet and gaming culture actually use these abbrevations in speech. Maybe not ad common anymore, atleast not in my circles, but when I was in school people would often respond with \"LOL\" instead of letting out actual laughtet. A lot of people use WTF, AFK, BRB, IRL, in The middle of swedish sentences, even in speech."
        ]
    },
    {
        "post_id": "j639ms",
        "author": "pinhead28",
        "title": "Why do people stack their pancakes and pour syrup on?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/j639ms/why_do_people_stack_their_pancakes_and_pour_syrup/",
        "score": 21058,
        "num_comments": 2429,
        "created_utc": 1601983250.0,
        "selftext": "It makes no sense. Your top pancake is soaked in syrup but the rest just have a trickle down the side. \n\nWould it not make more sense to lay the pancakes out side by side and pour syrup on all of them?",
        "permalink": "/r/NoStupidQuestions/comments/j639ms/why_do_people_stack_their_pancakes_and_pour_syrup/",
        "comments": [
            "Aesthetics.",
            "I actually lay mine down one by one and pour syrup on each individually. For this very reason.",
            "I cut my pancakes first, spread out the pieces, then drizzle.",
            "Dipping the pancake into the syrup is the way to go. Otherwise the syrup just gets soaked in and I just continue to add more syrup as it gets soaked. As a result, I use way less syrup by dipping and keep the mouth feel of syrup + pancake rather than a sloppy wet pancake. I also eat them individually, even before I started dipping.",
            "You’d need a bigger plate",
            "So you guys don’t stuff each one in your mouth and take a shot of syrup?",
            "You don't eat them one at a time. You eat them like a layered cake so each bite will have some of the top soaked pancake.",
            "I think it originated in advertisements as stacking them produced a more pleasing image. People see the images and impulsively do the same, much like when people put toothpaste on their toothbrush they lay it across all the whole brush because that's what they see in commercials.",
            "True, but I don't stack them for syrup distribution. I stack them so I can cut and eat all 3-4 layers at once, like an actual cake.",
            "If you individually syrup the pancakes you get way too much syrup.  The pour on top is enough to flavour a stack of 2 or 3 cakes.  We dont want to have to dip into our strategic syrup reserve too often, or the strategic insulin reserve for that matter.",
            "I use a fine brush to coat the inside of my mouth with maple syrup between bites.",
            "What a perfect analogy for a trickle down economy",
            "Place a pancake, pour some syrup on it, then another pancake, then more syrup, repeat until the stack is done.",
            "If you put syrup on each pancake, you get way too much syrup and soggy pancakes. \n\nI always make sure to get at least a little syrup in every square of a waffle, though.",
            "Yeah if you want 50% syrup and 50% pancake. I can't handle that much syrup, better to cut throught all 3 pancakes, while having syrup going down the sides, still a lot of syrup but more pancake to even it out. Either way, diabetic coma here I come. I actually hate pancakes, waffles are ok, idk. Same principle applies.\nI just hate desert for breakfast overall.",
            "I don't like pancakes with syrup and i feel weird on this thread.",
            "I pour the syrup into my mouth until it’s trickling down my face and then I shove the pancake in",
            "Because I cut off, almost like a slice of cake, a vertical section that contains an equal sized piece of each pancake, then shove it in my big, fat, whore mouth",
            "I guess this is an American thing. Im sure they're available but I've never had the thick fluffy pancake you see on American TV. I've only had the thin slightly crispy pancakes that you'd call a crêpe. Which I wouldn't put maple syrup on 😅",
            "Stacked just so they can fit on the plate. Idk that eating only one with syrup is ever intended. Supposed to cut and soak them.",
            "It's for looks mostly, but it does let them maintain temp for longer, but you'll usually only see this style in media or at restaurants, at home we usually have a dry stack that everyone takes from.",
            "Its: butter, syrup, stack",
            "So it looks pretty. At least that's my reasoning.",
            "I pour a little pool of syrup on the side and have each bite of pancake take a dip. I don't like too much syrup or soggy pancakes.",
            "I don't. I belong to the [Icelandic pancake](https://allthatcookingdotcom.files.wordpress.com/2014/04/mg_8422-unnin-sykur-pc3b6nnsur.jpg) master race.",
            "Normal people fill every pancake individually with one of the following typical fillings: cocoa+sugar powder, cinnamon+sugar, nutella, jam, syrup if you must and then roll them up like a cigarette.\n\nOnly 'muricans do this barbaric thing. /s",
            "I eat waffles or French toast because I am a woman of wealth and taste",
            "As soon as you start slicing up the pancakes you chase the syrup around to get the right amount, pouring syrup directly onto the pancake tends to lead to them getting soggy.",
            "I mean, Rick Moranis knew the truth... \n\nhttps://youtu.be/ZMeYdUPhlAc",
            "Why not eat one by one?",
            "I’m a make a plate and get a bowl of syrup kinda pancake eater. Occasionally I’ll spread peanut butter on one or two but I’ll still dip them.",
            "So uncivilized",
            "Plate size vs pancake size.",
            "Because capitalism is the American way\n\nThe guy at the top gets so much its disgusting\n\nFor everyone else, its trickle down!",
            "It’s called trickle down economics look it up",
            "I pour it on each pancake as I stack them.",
            "It was a teaching tool by the great Economist Francesco von Pancake to teach the false hood of trickle down economics.\n\nYou see, the model demonstrates how when you give the top pancake all of the syrup, it takes almost everything for itself leaving nothing for the lower layers.",
            "The real solution is to eat a waffle",
            "Us brits tend to eat one pancake at a time.\n\nSo the pancake maker (PM) makes everyone one pancake, they all eat while the PM makes their pancake. They then eat their pancake whilst making everyone else's second pancake.\nThat way everyone has hot pancakes that they usually top with different things like sugar, lemon juice, chocolate spread, fruit, whipped cream etc.\n\nIt wasn't until I saw Matilda that I saw a stack of pancakes.\nAlso ours are thin and huge. Not small and thick like American style.",
            "I believe you're mistaking advertisements for reality.  On TV and in commercials, I also see this terrible stacking method.  However, in person, I've never actually seen anyone do this.  Advertisers stack them because it is aesthetically pleasing, not because it is practical.",
            "Pancakes are always eaten neatly stacked. Butter and syrup on top. Anything else is sheer anarchy and must be firmly discouraged.",
            "My stomach acid is already acting up just from reading the comments :)",
            "I use the pancake sorting algorithm - just kidding :-) \n\n[https://en.wikipedia.org/wiki/Pancake\\_sorting](https://en.wikipedia.org/wiki/Pancake_sorting)",
            "I cut them all up and then pour syrup across them evenly so each piece gets equal amounts of syrup and I don’t have to cut each bite before I eat it.",
            "Stacking conserves heat.",
            "I always lift and pour syrup on each one.",
            "I put syrup in between each layer, and the stack is never good, they're usually sticking out to the side",
            "Dutch pancakes are thin, we pour syrup on them on at a time and roll them up. Very tasty 😋",
            "I don’t syrup my pancakes, just butter em up",
            "I stack my pancakes, cut 4 lines, add butter and syrup. The butter/syrup mixture then goes in between the cuts I made, making it to the lower stacks. Not completely covered, but still a better distribution than bit cutting first.",
            "Because I want both soaked and unsoaked pancake in my bite, having a breakfast all one texture sounds dull",
            "Because we can’t all be rich with diabetes and some control is good for us.",
            "Marketing. \n\nI also question if vacuums work better pushing them fast like in a commercial or taking time and making sure it actually sucks up the dirt.",
            "President Reagan assured me they'd all end up coated more or less evenly this way.",
            "I view a pancake as a syrup delivery system. I never have more than 1 pancake though, each single cake can hold nearly 137 ounces of syrup if done correctly.",
            "I syrup/butter my pancakes individually then stack them",
            "Bowl of syrup on the side and ‘dunk’ each mouthful!",
            "retention of heat. The stack stay hot longer and if you eat a vertical section the syrup mix evens out",
            "Aesthetics, also stacked pancakes stay warm for longer",
            "I take one pancake, lightly butter, light drizzle of syrup and then a second stacked on top with the same for this exact reason. Although, I have questioned why I stack them. And then I realized most plates can't accommodate 2-3 pancakes next to each other thus the stacking.",
            "I put a thin layer of butter on each layer (so it melts in), stack them, cut them, and then drizzle syrup. I despise sticky fork handles and it's absolutely unavoidable any other way that I've tried.",
            "That's how it's done in cartoons and who can argue with their logic? ;)",
            "In my experience, I'm either having big pancakes - in which case the pancake's diameter is greater than the plate's radius, so I can't really pull one off the stack while keeping both on the plate - or I'm having little pancakes alongside something else (like sausage & eggs), so there's not really space on the plate unless I specifically eat the non-pancakes first to make space for the pancakes to be side-by-side for that.  Also, I don't have such a craving for sugar that I need all of the pancakes to have so much coverage.  I just put some syrup on the top and then, when I want some pancake, I take a slice out of the stack.  Also, any loose syrup will be on the bottom of the plate, so I can also rub what's on the fork in the syrup on the plate if I really want to, though it's usually unnecessary.",
            "I don't.\n\nI put one pancake on the plate, drizzle a little syrup, then put a second pancake on top, drizzle a little more syrup, etc.",
            "See I’m sophisticated (since I was a child) and I’ve developed the perfect pancake eating method.\n\n1. Get a stack of pancakes on your plate.\n2. Pour a “Syrup Pond” on the plate to the side.\n3. Cut a piece from the top pancake, dip into syrup.\n4. Place in mouth.\n5. Repeat and enjoy.",
            "Too much syrup is nasty. Look at the nutrition facts. It's tons of sugar per teaspoon. You don't need that much sugar. Put it on top and that's enough sugar.",
            "It looks good on commercials.",
            "u/_iris13 we actually did the thing that makes more sense 😝🔝",
            "Personally, I like to layer a bit of whipped cream between each pancake and then pour syrup on the top pancake with a square of butter.\n\nIts like a mini-breakfast cake. :]",
            "Same reasons a cake has frosting on top and sides.\n\nAlso, if you make your own pancakes, you can do what you want.  If it's served to you, or multiple people have to share the same syrup container, it'll be slow and awkward.\n\nIt also gives you control over how much syrup you want per bite, allowing for variability as you go.",
            "Or make the equivalent of pancake lasagna - put one down, syrup, then the next one, syrup, etc.\n\nPersonally, I lay them all out flat on the plate - I like my pancakes like little syrup-soaked sponges.",
            "Nah nah nah, pour syrup on each while laying the stack then cut out the prefect square all the way down the middle and pour syrup into that, it then soaks from the inside out into all of them",
            "I NEVER pour syrup over my breakfast goods. I cut off a bite and dip it in the syrup lake I create next to the stack. Now, I can hear you, \"But borkingsnark, won't the pancake next to the syrup get soggy?\" Yes it will. Which is why I strategically eat those bites first, scooping the syrup away from my delicious, unsoaked stack of cakes, thus preserving the state of my treasured breakfast goods.\n\nWhoever downvoted my breakfast preference is so wild lol",
            "I pour syrup on them one at a time *AS* I stack them\\~",
            "I spread ours out like a deck of cards when you \"Pick one\" in a circle round the outside of the plate, the bacon goes in the middle.",
            "I am gonna go out on a limb and just mention what \"I\" like ! I am diabetic and pancakes once a month is my cheat meal, I pour little bit of syrup up top and try to tell my mind that each pan cake is loaded with syrup :P \n\nIf I didn't have to worry about the sugar intake, I would each pancake in syrup.",
            "I do not stack my pancakes for i am very smart",
            "It’s a really American thing to have a god damn stack of pancakes instead of just 1 or 2.",
            "The secret to good pancakes is butter in between. Also to eat them while they are still hot. I think it was Mitch Hedburg who said \"Pancakes are like relationships. At first they're good and hot and steamy, and by the end you're fucking sick of them.\"",
            "I stack mine on their edges and spray them with a fine mist of syrup before shoving handfuls of mashed pancakes in my food hole.",
            "I dont have a plate wide enough for 5 pancakes",
            "Professional pancake eaters like myself lift each layer and pour syrup and spread butter up in that bitch.",
            "Pancake, syrup, butter, pancake, syrup, butter, pancake, syrup, butter, pancake, syrup, butter, pancake, lots of syrup, butter.",
            "You get the big pancakes that spread across a plate and there's no room for anything else.  Where else would you pour the syrup?  The idea is you take a piece of every pancake in each bite.",
            "I have the same issue with burgers people get a triple cheese burger when they could get 3 separate cheese burgers which would be far superior. Having 3 slabs of meat makes the ratio to bread all wrong.",
            "I met this girl a few years ago that poured syrup into a small bowl and dipped her pancakes into the syrup like you would a French fry with ketchup. Needless to say I married her.",
            "I pour syrup and butter as I stack. Then you get the best of both words",
            "Heat retention. Plus in a standard stack you have 3 pancakes. Top pancake gets doused, bottom pancake should be swimming in syrup. Middle guy is a wildcard. I like having those options.",
            "Because it's america and we go big. Stack those babies up a high as they can go!!!!!",
            "That’s why crepes are the superior tasty breakfast",
            "I'm not inviting any of you of you fuckers over for pancakes. You all eat them weird.",
            "Stack the pancakes, twist a series of holes with a fork, and then pour syrup. It isn’t pretty, but solves the dry pancake problem.",
            "perfect analogy of the trickle down methode currently at work.",
            "Okay, so I've done too much thinking on the subject and here's my take. Anything over two pancakes wouldn't fit in a normal plate, but there is a solution to syrup coverage: \n\nFirst, butter your pancakes and stack them like usual.\n \nNext, cut the pancakes (one on the other) into 8 like a pizza.\n\nFinally, drizzle syrup over top of the stack and into the crevices created by cutting. The syrup drips through all the layers and hydrate each pancake slice with enough syrup to enjoy, but not so much that it's a soggy slippery mess.",
            "So let me teach you something. Butter each pancake and stack them up nice and neat. Cut those bitches up into bite sized squares and mess the stacks up some. Pour syrup over top. Because you've cut them up and exposed the fluffy insides, even the bottom pancake gets nice and soaked with syrup.",
            "I personally like to cover myself completely in syrup then eat the pancakes with my hands and rub them on my body before each bite. Just personal preference.",
            "Bruh honestly ive never understood that either, when i have waffles or pancakes i place one, drizzle syrup, place another, drizzle rinse repeat for how many i have. Its so much better",
            "I stack them so the heat of the other pancakes will help melt the butter evenly",
            "Better titke: Trickle down pancakenomics only benefits the uppermost class of pancakes.",
            "You fools! Stacking pancakes helps keep them warm for longer. You put syrup between each cake to your liking. Then eat them stacked. Bonus points if you use real maple syrup. \n\nSource: am a dad that makes pancakes on Saturday mornings.",
            "The law states that you put down one pancake, put some butter and syrup on that one, then do the and with each pancake you lay on top.",
            "Trickle-down pancakeomonics",
            "How big is your plate that you’re able to lay them side to side? I usually stack, cut into pieces then drizzle syrup over",
            "YOUR ALL DOING IT WRONG! HEAR ME OUT!\nUse the trapdoor spider technique. Keep your pancakes in a stack, in the center cut 4 lines with your fork as though your making a square. (Apply good pressure) Before connecting the square with the last cut DON’T! You have completed the trapdoor spider!  with your fork lift up the fold you’ve created and pour your syrup in. This cutting should go through all your pancakes and if done right syrup will be released in the perfect quantity from the center of your pancakes out to the edge. \n\nBONUS: If your eating pancakes with other food on the plate this will keep your syrup from running off the pancakes and onto the rest of your food.",
            "I put butter and syrup on each and then stack. It tastes better and still looks pretty.",
            "You stack them as you cook them buttering and syruping each one in the stack. This is the real answer it makes eating it as a stack delicious",
            "There is something about the combination of 1 soaked pancake with 8 dry pancakes that just feels so right in the mouth.\n\nYou have to try it to understand it. Words cannot describe the feeling.",
            "You've never seen someone like me eat pancakes, I guess. \n\nI still eat my two pancakes stacked BUT lift the top pancake from one side to get to the bottom one and stab it with my fork and wiggle the fork just enough to leave noticeable holes in the pancake. I then pour syrup on the pancake in a spiral motion from the center to the outer edges. I lay the top pancake back on the first one and repeat the process. This ensures each layer has enough holes to soak up some make syrup and it's equally moist.........it also ensures I achieve diabeetus level 9000.\n\nIt's weird and so extra but that's the way I like to eat pancakes.",
            "Copying TV. Filmed that way because it just looks nice. \n\nTo be fair, it's perfectly fine since there's often a pool of syrup you can dip lower pancakes in. But it's still better to serve one at a time and pour over each individually",
            "When I was younger I read something about cutting a square in the middle of the stack and filling up the hole with syrup. It’s supposed to give you the perfect amount of syrup for the stack of pancakes and you don’t need to add anymore syrup as you eat. I don’t know if it was true but it works for me and I use that method to this day.",
            "In my country our pancakes are flatter and bigger (assuming you're taking about American pancakes in your post)\n\nWe spread chocolate or jam or something like it on a side, roll it and that's how we eat pancakes, rolled.",
            "I put peanut butter on my pancakes. \n\nCuts down on the soggy factor a lot.",
            "Never understood the single block of blutter on the top pancake as well. What about the rest?",
            "Wouldn’t it make more sense to treat your pancakes as if they were French fries and dip them in the syrup?",
            "[deleted]"
        ]
    },
    {
        "post_id": "r77ws7",
        "author": "Carnivore90",
        "title": "Is it rude if I ask him to brush his teeth before kissing and sex?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/r77ws7/is_it_rude_if_i_ask_him_to_brush_his_teeth_before/",
        "score": 21044,
        "num_comments": 3056,
        "created_utc": 1638453115.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/r77ws7/is_it_rude_if_i_ask_him_to_brush_his_teeth_before/",
        "comments": [
            "I would want someone to tell me If I smelled bad",
            "As long as you're kind about it. Morning breath can be a real turn off for me and my girlfriend knows this. Communication is key.\n(Edit: thank you for my first ever awards!)",
            "Does he have bad breath? I didn't know I had bad breath until an ex told me once, even after brushing. Problem was that I didn't floss and only got my teeth cleaned every 6 months at the dentist. The first time I flossed and took a sniff, HOLY SHIT. Now I floss all the time.",
            "[deleted]",
            "I would never wanna bang if my breath was bad",
            "Just brush your teeth at the same time? Like, \"hey, before we do this, we should brush our teeth. Just in case.\" That way theres no way you can be rude.",
            "my husband automatically takes a shower before we have sex, it's become routine now. And if I haven't showered that day I do as well.\n\nIt's just cleaner and overall smells better",
            "Just go into it with a mouthful of toothpaste or mouthwash. He'll get the idea.",
            "Noooo. I ask her to take a bath before we do it.",
            "Nope. I have sensory issues and smells kill it for me. My fiance has to brush his teeth every time we do anything\n\nEdit: actually idk why I just called out my fiance. We both have to brush our teeth, otherwise I'll get bothered by my own spit lol.",
            "That's actually how my lady let's me know she's in the mood. Rather than saying \"Hey, wanna bang?\" she'll say something along the lines of \"Why don't you rinse off and brush, then meet me in the bedroom? I've got somethin' for ya...\"",
            "I’m a dental assistant, it’s not a secret that mouths disgust me and you can tell me your brushing as for play. We all have our things.",
            "I hiss really loud and screech and then she knows that's the sound of a dragon and she's breathing fire on me.....",
            "Its never rude to tell anyone they smell in any way\n\nWhats potentislly rude is *how* you tell them",
            "Not if you say “it really turns me on to see a man brush his teeth before we engage in sexual intercourse”.",
            "So THIS is why my mother was so concerned about me taking a bath and brushing my teeth every night before bedtime",
            "As a guy, I would prefer my partner tell me that I need to freshen up than for them to suffer though it.",
            "Nope, my gf ask me too when i come back from work, you know cigarettes and coffee, no big deal as i don't remember to do it when i get home. i mean it depend where you are from but here we are upfront",
            "[That’s part of it… that’s foreplay.](https://youtu.be/WGOohBytKTU)",
            "Sounds like a pretty fair price to me.",
            "No. In fact, sometimes I look at my S.O. and suggestively say \"I'm gonna go brush my teeth...\" and she'll reply \"I think I should brush mine too.\". And then we go bang.",
            "No.  Absolutely not.  Good hygiene is a minimal requirement of good manners.  It is rude if him to not take care of this without being asked.",
            "It's not rude but I don't think it'd be sustainable for everyone. Either I need to fix why my breath is so constantly bad or my partner needs to deal with my natural clean scent.\n\nI can't imagine wanting to go in for a spontaneous kiss but feeling like my partner is grossed out because I didn't brush 5 min ago. It'd probably mess with my self esteem.",
            "Nope. I’ve been married ten years and my wife and I still shower before sex. She won’t even kiss me with morning breath, lol.",
            "i would try to do it together and make it a thing you guys do so it won’t upset him as much",
            "Certainly not! It's rude for him not to do this. Jeez...",
            "Should be mandatory.",
            "If he has terrible breath, he probably needs to floss more. \n\nA number of years back I remember my dentist asking, \"when is the last time you flossed?\"\n\nI said, \"4 days ago.\" \n\nHe said, \"What did you have for breakfast 3 days ago? If you haven't flossed it's still in-between your teeth.\"\n\nI started flossing more.",
            "Of course not. Have him floss, also.",
            "No",
            "Hell no babe!!!!",
            "hurry drunk waiting tidy sugar office beneficial narrow disagreeable support\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "Don't mention the sex part. He should be brushing his teeth every morning and before coming to bed anyway and proper hygiene should be mandatory to be with you. A proper gentleman should always be sharp and clean inside and out head to toe.",
            "No, that's general hygiene",
            "Nah but it could certainly kill the mood if it's spontaneous. Which doesn't mean it's on you to just deal with it, just means he might not try as much",
            "Not at all!",
            "No - just the Opposite. You want to have the best time possible for both of you.",
            "Christmas is right around the corner.. load him up with a couple tooth brushes toothpaste mouthwash maybe a voucher to the dentist",
            "No.",
            "No its not.",
            "No.",
            "Not at all. Cleanliness before sex is great.",
            "Naw. A woman came home with me and took her boots off in my bedroom and woof there was some foot smell. We went passionate for a bit but I eventually just said “hold up” and moved her shoes out to the other room. We continued after that. Next time she came over, she kept the shoes outside the bedroom and even showered her feet etc before coming into the bedroom. We are all human. Just talk about it.",
            "No, when my girl asks me to brush my teeth I get pumped. Some awesome stuff is about to happen. I would say it’s rude to ask after your start making out, like a tiny tiny bit.",
            "No. Even if it's getting got and heavy I say let's go brush our teeth real quick. A \"tooth brushing party\" is what I call it. I skipped this step in my early 20s once and my nipples have never stunk so bad , huge turnoff .. scarred me for life honestly",
            "Nah, not rude. Though it might be if you told him right in the moment, I could see him getting frustrating. I'd suggest mentioning it to him outside of the bed room.",
            "No it’s not. For some men that isn’t common sense, they have to be told. If anything, it’s rude for that responsibility to be put on you - instead of him being an adult and just showing up presentable. Go ahead and ask.",
            "I don’t know how people are comfortable doing any of that without being clean.",
            "Absolutely not! Hitting the showers is just treating you partner well.",
            "I think its kind of rude that you have to ask.  Why isn't this something people just do, not before sex, before living your life, in the moring when you getup?  ..",
            "Is this an AND statement or an OR statement?\n\nDo both conditions need to be scheduled prior to the brushing of the teeth?\n\nHow long after one of the inputs is triggered before the requirement is reset?",
            "\"Go shower you sick freak\" might not be well received but as long as you're kind about it, youre fine",
            "No lol",
            "No.",
            "No. Yuck-mouth is gross",
            "No. Just dont be insulting. Just be like i wanna make sure we’re completely clean",
            "No. You have the right to not accept yuk mouth and dirt dick.",
            "Nope. In fact before sex I usually do a thorough clean and brush.",
            "No",
            "No.",
            "That's fine the missus and I always stay fresh for each other and that includes genitals 😋 Nothing better than a nice clean eating area",
            "It's fine, me and my wife do this, if one of us has bad breath before we're about to do something nasty we let them know.\n\nAlso if I plan to go down on her I at minimum mouthwash mixing your days mouth bacteria into her pumpum is like asking for a yeast infection.",
            "Nope. If he's nasty make him fix himself. Saying this as a dude who forgets to brush occasionally...",
            "It's rude if your partner doesn't come correct with a clean, fresh smile.",
            "I HATE PICKLES AND MY BOYFRIEND LOVES THEM!!! GO RINSE AND BRUSH YOUR TONGUE!!! Nasty.",
            "No. It is not rude to expect someone to shower either.\n\nEdit: breath mints only cover up stink. Brush your goddamned teeth.",
            "My wife and I shower/take a bath together and brush our teeth before the sex.",
            "It's rude for him to not already be clean when trying to get some action.",
            "If you're cool with him asking you to bathe before sex then all's fair.",
            "Lol my favorite time to get freaky is after we share a nice shower and brush our teeth",
            "Floss, brush teeth and tongue",
            "No, and tell him to take a shower too because he apparently has hygiene issues and you don't want a yeast infection.",
            "Is it rude? Nah, just tell him nicely",
            "It’s not rude per say. It’s just rude *how* you I ask him. I’m sure you already know how to ask without being rude though",
            "Not at all. Halitosis is gross.",
            "Sex is the MOST intimate act any two people can share. If you think it’s rude to ask this then you shouldn’t be having sex yet with that person. That’s my take on it.",
            "Not rude, but depending on how close you two are, he might perceive it as rude. \n\nA lot of married couples make these comments towards their SO all the time lol",
            "Not at all, my ex smoked and I hate cigarettes, especially the taste I found out lol; thankfully she was a very understanding person.",
            "No.  The answer is no.   If someone is offended by you asking them to brush their teeth then tell them to fuck off",
            "Not nearly as rude as him trying to be intimate with bad breath.",
            "No. It’s rude for him to kiss you when he smells like shit.",
            "The easy , not asshole way to do it would be to do it with him.  Like shower and brush your teeth with him.   That will shame him into doing it.",
            "wait, this isn't normal? Do people not go into this with clean mouths?",
            "If it’s every time than yes you’re a psycho",
            "Eventually you have to get used to it. If you're living together, he is not going to brush his teeth every time before you kiss. So better get used to it. Only ask him if he ate something you really don't like or that tastes strong, like garlic.",
            "Nope, as long as you offer the same!",
            "I wouldn’t see it as rude. You just have to say it in a proper way. Or… suggest him to brush your teeth together.",
            "I personally have never asked my spouse in 37 years of marriage.  But he worked construction and usually took a shower when he got home. I think what ever works for you as a couple.  Couldn't hurt to ask.",
            "Not rude, depend how you ask. If i wanted \"sexy moments\" with my ex, my previous shower had to be maximum 4hours before. She was very strict on this, and to be honnest i didn't mind, always better to be \"fresh\" for this kind of things imho.",
            "Normally it’s never a problem but one time after she ate curry I had to gave her clean her mouth. So no it’s not rude",
            "Or maybe just ask “heys let’s brush our teeth together” and then do it",
            "Maybe have some Altoids on hand. But if this is a real relationship with a future then you need to say something.",
            "You could always offer a mint if it is about his breath. But I do understand that u want him to have a clean mouth when he uses it on u",
            "It would be nice if you made sure you were clean as well. It's only polite.",
            "Not to me",
            "No.",
            "I always ask my partner to wash his hands, so i think this should be okay!",
            "I would prefer if a woman did this as to avoid torturing her if my breath happened to be awful lol, wouldn't be offended at all (provided she brings it up tactfully)",
            "(M) \n\nNo. He should be doing it anyway out of being being conscientious tbf.\n\nI mean, if you don’t need to go anywhere one day then fine, who cares if you don’t brush but if you got a woman about yourself you should probably brush 3 times and rinse twice.",
            "Nope.",
            "Nope. or shower and wash yourself. Intimate stuff is all about being comfortable and it can definitely help to be comfortable with someone when they're clean :)\n\nAnd you're also allowed to occasionally be willing to waive these rules because the situation is different. (say you're both seriously in the mood and/or drunk and/or just in a rush). waiving your preferences once or twice doesn't mean they are off the table for any other time.",
            "Nope. My husband is bad about always brushing his teeth, which drives me crazy and grosses me out. I don't understand how a 33 year old man still has trouble getting into a tooth brushing habit. We literally had entire guest speakers and videos and days dedicated to personal hygiene and the importance of tooth brushing in elementary school.\n\nAnyways, I digress. I tell him all the time, even if we aren't kissing or anything. I used to be all sweet and shy about it, but not anymore. Just brush your fucking teeth, FFS.",
            "no, bc if you’re comfortable enough with each other u won’t take it personally if ur partner’s like “hey ur breath is stinky” however one thing about brushing teeth before sex: it creates microscopic cuts, and if ur worried about STDs and doing mouth stuff, bacteria/viruses can enter your bloodstream that way so it’s best to wait a little bit after brushing",
            "Man here. Not rude at all. We're clueless and appreciate the heads up.",
            "No I told my gf to just lat week. I would expect her to do the same to me",
            "no but don't make it weird if he pops a boner every morning while brushing his teeth.",
            "No. It’s not rude to tell him to shower or clip his nails either.",
            "Heck no! You don’t want a yeast infection from sugars, random flecks of food in your mouth or genitals",
            "No, ask him to wash his hands while he's at it",
            "Nope.  Just like it's okay for a dude to ask you to wash your ass before.  Same principle.  People want to engage in clean sexual activities. \n\nWell, most people from my experience lmao",
            "Just get to the poking. Skip the kissing",
            "lol EWWW",
            "Just make it sound like a group thing “hey! Let’s brush our teeth together before we go at it”",
            "You’re rude for posting this on the internet",
            "9 out of 10 dentists agree.",
            "Yes, take in that stank bitch",
            "Not rude but probably is going to fuck his mind thinking what made you do that kind of question.",
            "What's the point if he's going to be eating your ass",
            "Breath comes from your stomach. You can mask it with mouthwash, brushing teeth, gum, etc. However brushing can open cuts in your mouth whether you see/feel it or not so it might not be ideal depending on the partner, and the activities on the horizon.",
            "Nope.",
            "This is 100% something you should communicate",
            "NO, IT IS NOT RUDE. This person is about to be inside of you. Have communication",
            "Lol.  You know in the movies when people wake up and start making out. \n\nLike naaaa, thats doesnt happen hahah!\n\nTo answer your question, definitely not.",
            "Ive been asked that before and took no offence what so ever. Communication is important and your standards are as well.",
            "No it is not. My partner reminds meb anyone sensible will do it.",
            "If you have to tell him he probably needs a few lessons in hygiene",
            "Not at all. If he gets defensive, that’s him dealing with personal stuff of his own. You deserve to enjoy kissing him and not to suffer because his mouth tastes bad.",
            "if you wanna be subtle about it, slip a mint into your mouth and then slip it into his when you’re kissing.\n\nedit: but nothing beats communication",
            "Its okay to be rude about something easily fixable like bad breath, assuming it's not caused by a medical condition. \n\nIf you can't say \"Your breath smells awful  please brush your teeth\" then there's probably other issues with the relationship.",
            "How do you ask politely tho??",
            "I usually just say \"hey let's brush our teeth real quick, my mouth feels gross and we just ate\" \n\n\nThat should be a pretty clear hint without being rude or hurting his feelings. \n\nIf he doesn't get the hint then you can slowly escalate until you have to spell it out if he is really clueless"
        ]
    },
    {
        "post_id": "kmzn6d",
        "author": "EWhiskeyM",
        "title": "Does anyone else feel like they haven’t found a really comfy sleeping position since they were a kid?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/kmzn6d/does_anyone_else_feel_like_they_havent_found_a/",
        "score": 21008,
        "num_comments": 1292,
        "created_utc": 1609322911.0,
        "selftext": "I can’t really explain it, it just feels like it was much easier to get comfy and sleep when I was a kid. I’m not out of shape or infirm or in pain. I just can’t get that same comfy feeling from when I was young.\n\nEdit: Wow seems like this is a pretty universal human experience! Thanks so much for all your suggestions everyone. I haven’t finished reading all the comments, but I plan to! \n\nFor everyone struggling with this like me, it seems the most common suggestions are “if it’s been longer than 10 years - new mattress. Stretch before bed. Keep an eye on what position you wake up in (as this is your comfy spot). Get a weighted blanket and a body pillow.”",
        "permalink": "/r/NoStupidQuestions/comments/kmzn6d/does_anyone_else_feel_like_they_havent_found_a/",
        "comments": [
            "This year I upgraded the bed and mattress. It was not cheap but it’s genuinely incredible. 6 months later and each night when I lie down on it I still get a “holy shit this is so comfy” moment. I’m lucky enough that these days I have the finances available to afford this, but honestly if I’d known how good it was when I was younger I might’ve taken a loan or something.",
            "I sleep pretty comfy but the real struggle is finding a comfortable position to read in. I used to read 800, 1000 page books. All day reading, hours and hours without breaks. Now I read 3 pages and everything hurts.",
            "[removed]",
            "My wife thinks I'm insane but when I can't find a comfortable sleeping position I first PURPOSEFULLY make myself uncomfortable. For me: I lay on my back in full sweats and socks until it's so uncomfortable that I need to roll over. By then the bed is warm so j take off the sweats and socks and lay on my side to fall asleep",
            "This.  I lived on a futon in high school and then a air mattress that deflated every night and I woke up on the floor and slept great.  \n\nSuddenly I turn 35 and my sinuses or whatever make it impossible to breathe at night unless I am basically standing up. \n\nI assume at some point I’ll get so tired from lack of sleep I’ll fall asleep and people will assume I’m dead and bury me alive.",
            "This may help, say goodnight to your body parts and wiggle them as you say goodnight, start from you feet up if you're still not relaxed go from head down, like goodnight toes wiggle wiggle, good night feet and so on.\nI use to work at a kids camp and when my kids really couldn't relax and go to sleep we'd do this and they would be relaxed enough to fall asleep.",
            "Absolutely yes. Miss just falling into bed and sleeping. Now there's a whole rigamarole of getting \"comfy\" enough to fall asleep. It sucks",
            "[removed]",
            "Some nights... I just don't know what to do with my arms!?",
            "Oh, yes, on my tummy as a kid. Then boobs happened. Big ones. Bye bye tummy sleeping. I still miss it!",
            "Perhaps your mattress doesn't suit you.",
            "As a parent, have you tried sleeping as though you were thrown from a car? Perhaps as though you were twisted like a balloon animal? Kids sleep weird...",
            "I had the same problem as you. Thing is...as a kid you move much more and are much more active during the day.\n\n&#x200B;\n\nAs soon as I started to run a lot or do other sports I started to sleep like a baby again. Turns out our body is not made to sit in an office chair for 8 hours only to drive 2 hours in a car and relax 5 more infront of your pc at home.",
            "[deleted]",
            "I did, until I was able to afford to buy nicer things for my bed. A nice fluffy feathered pillow, faux fur pillow cases and blanket, a nice soft mattress and a fan keeping the room temperature nice and freezing. \n\nJust gotta find what works for you and what your happy, sleepy place consists of",
            "[deleted]",
            "you will never sleep like you did as a kid.  I'd use pillows if you sleep on your side.  Pillow between the knees if you feel hip tension, and a pillow on your chest if you feel tension in your shoulders.  If flat on your back is uncomfortable, try a pillow under the knees.  Also, vodka helps.",
            "Even when I was a kid I thought about how much easier it would be to sleep if I could just suck my arms into my body and not have to deal with them..",
            "Pro tip it's because everyone got rid of their stuffed animals. I bought a bunch recently and now I get cozy easier and asleep fast.  That's the thing you're missing from your childhood.\n\nI have no scientific evidence to back any of this up.",
            "Yep. My most comfortable sleeps as an adult pale in comparison to the cozy comfort I felt as a kid. \n\nI can’t even find a pillow that’s the correct thickness/level of support for me.",
            "The comfiest sleeping position comes when you take Benadryl and Ibuprofen before bed.",
            "I have, it's just that they stop being comfortable after 5 minutes.",
            "They also sell those like $50 foam mattress covers, which can make a cheap crappy mattress bearable until you can afford an upgrade. I'm a disabled vet with rheumatoid arthritis and my back is shot, and I've never really been in that position where I could just go \"Screw this, I'm buying a Tempur Pedic.\" Bought a $50, really heavy and thick, foam mattress cover, and I can at least get out of bed in the morning, and a full night sleep doesn't leave me physically debilitated. It's no Sleep Number, but if you're broke and your sleep is killing you, it can be a game changer.",
            "I mean if you get to a near unconscious level of stoned and then take some melatonin every night like me you sleep like a depressed piece of shit but you are comfy",
            "Oh yes. Sometimes it takes me an hour to fall asleep and I end up waking up again two hours later to repeat it all over again. I’ve found that I’m more comfy sleeping on my bedspread sometimes with a bunch of blankets. Also, a weighted blanket helps!",
            "[deleted]",
            "I legit fall asleep within a minute every day. Never had this issue. I''m chubby so this isn't small human thing either.\n\nSame position as I had 30 years ago. [Basically this](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQlLZQZcfvWDkwXwJx9biGUypnELk6ApLfoJQ&usqp=CAU) except the \"underhand\" is under the pillow.\n\nOh well, I don't think I'm revealing any secrets here. Just interesting that something that has never been an issue to me can be so common problem for adults.",
            "Even worse. For some reason my sleeping in 2020 has gotten so bad that I'm either sleeping not at all, or having really bad dreams or waking up with sore muscles as if I did a 3 h workout the day before.",
            "Edibles help.\n\nSeriously though.  It feels the older I get the more comfortable I need to be with being uncomfortable lol\n\nThankfully I'm like one of those dolls with the eyes that open and close.  Sit me up and I'm awake.  Lay me down and its goodnight regardless of comfort.   Then I spend the next few days realizing I'm getting old because I get creaky.\n\nI'm only 40...",
            "My mom says I sleep in the same two positions since I was a baby - on my stomach, one leg bent to the point I touch my elbow with my knee, one arm straight over my head or under my body, or the second position is like when you sit on your knees and touch the mattress with your face. I am comfortable and warm even without any blankets.",
            "Couple tricks I use:\n1. Getting a really intense workout like lifting weights to muscle failure will get you some of the best sleep of your life (alternatively just bump out like 20 push-ups or whatever you can do right before bed)\n2. Doing whatever exercise you do closer to bed time helps as well\n3. If you are really having trouble lay on the floor for 10 minutes. It sounds weird but especially if you have a wood floor your bed is so much warmer and more comfortable that you will want to fall asleep instantly \n4. Similar to 3 but less extreme you can lay in a really stupid position like with your feet and arms in the air, it has the same effect",
            "Lay on your preferred side, put a pillow between your legs, a small pillow under the middle of your torso and rest your head in a pillow. It perfectly supports the natural curves of your body. And my mom is a nurse and uses this with patients",
            "I would suggest you probably need a new mattress.",
            "In case it helps, it gets worse as you get older. 44 and feel like I’ve not slept in years.",
            "Recently (a few months ago), I, who is now 21, found a really comfy position. Belly down, facing right, left leg straight, right leg 90°, left arm by my torso, right arm around the blanket that I made into a ball, and head not on a pillow. I say, this is really comfy for me, and I'm fully aware of the happiness I gain from this position. This is the first position I assume right after turning the lights off. The second position is nearly perpendicular torso on my right, both legs at 90°, both arms cuddling with the blanket that I made into a ball, and head on a (medium-hard) pillow because my neck rises up now and my head tilts because of my shoulder. The third position is back flat on bed, legs straight, arms crossed on chest, and the ball-blanket now is fully wrapped around my body. The final position I assume looks like I'm a mummy. That's it. I keep repeating these three positions and alter them slightly every now and then to adjust for comfort level. I wish I had a girlfriend to cuddle with while sleeping though. I compensate that with a blanket for now :(",
            "When we were kids our brains were much calmer but as we grow up we have constant thoughts running in the background of the head. So the best way is to calm ourself with deep breathing or listening to something soothing so you’re focused on calling yourself.",
            "When I was like 4 I vividly remember sitting on my bed, back against the wall, pulling the covers up to my ears and tucking it all around me and I fell asleep sitting up. I remember being so fucking comfortable I still think of it fondly. So to answer your question, yes.",
            "I read down a little bit and I didn't see anyone address this, but I believe a major issue is weight. When you were a kid, you weighed a fraction of what you weigh now(and if you're overweight like me, it's even worse). Less weight means less gravity means less pressure, which I think equates to more comfort. Pressure is what all the high end mattresses attempt to address(used to work for Mattress Firm and did a lot of training on this stuff).\n\nWhen you go to shop for a mattress in person, take at least 10 minutes to lay in the position you normally sleep in and see if you start to feel pressure. If you're a side sleeper it still probably be in your shoulders and hips, back sleeper likely lower back and neck, stomach sleeper good luck to you, you're on your own.\n\nAlso, know that softer beds will always feel better initially, when you first flop down on it, but if you take a while to get to sleep or wake up often, you're going to want something a little firmer. Honestly, everyone sleeps better on firmer mattresses, but manufacturers are banking that most people will buy some fluffy crap that feels good for a while then turn around and buy a different one when it starts to fail. Most people also think softer means less pressure but that's not true, softer material collapses under your weight and creates more pressure over time it seems.\n\nLastly, a lot of people have mentioned pillows. Good pillows are almost more important than the mattress for some people. For me, I sleep on my side and if the pillow I'm using is even slightly too thick or too thin, my neck will hurt in the morning. A firm, but correctly sized pillow is key for me.\n\nGood luck!",
            "I can't figure out what to do with my arms anymore, and I can usually only fall asleep on my side can't sleep on my back. I usually hold a pillow or something but if I try an fall asleep with my arms above my heart my hands fall asleep and I hate that tinglingly feeling it almost hurts.",
            "So I actually work for a Furniture company and I never thought about it before I worked there, but you should really get fit for a mattress AND a pillow. Most people think they can sleep on anything, which you can; but to truly get into REM sleep you need to be fitted for whats best for your body. I wouldn't listen to people who say \"Purple is great! Casper is the way to go! Just buy a serta!\" Or something along those lines. Go into a legit furniture store and have a professional fit you for a mattress and pillow. But don't let them just sell you \"Top of the line\" cause \"Its great for everyone\". I've been doing this for 4 years now and sometimes a $2000+ mattress isn't the best choice for someone. A lot of the time I can find the perfect mattress for someone at about $600-$800 with pillow. \n\nTL:DR - Find a professional who will fit you for a Mattress and pillow designed for your body. Don't just listen to people suggesting mattresses, actually get fit for one, it doesn't even have to be expensive!",
            "I’m 14 and fear the day this is going to change",
            "Last time i felt in bliss when sleeping was when i was around  around 12 -13 and i could sleep anywhere at anytime now if my back is at a wrong angle i wake up with a dislocated arm and one of my eyes dont work for an hour or a day if the position was bad.",
            "I experienced that too, especially with the knees. My guess is that a child’s body has more fat that kind of softens bony parts. Or maybe I just lost weight growing.\n\nAnyway, if the knees are a problem for you, I recommand sleeping with a (rather thin) pillow between them : it is less painful and I reckon it puts your hips in a better position.",
            "Try a 15 minutes guided progressive muscle relaxation audio on YouTube.",
            "YES! Sometimes I think 'how do I reset my sleep patterns?' or 'why can't I get comfortable in any other position other than on my side (which ultimately hurts my shoulders, arms, and neck)?' or 'if I was able to sleep all the way through the night without waking, my life would be transformed!!'.\n\nDoes anyone have miracle answers? (Also, looking for tips re: waking up at the slightest noise or movement in my sleeping area...)",
            "Okay, how about this:\n\nYour alarm is ringing. It is 5 am, after you have only slept for no more than 4 hours. Your bones still feel tired from the previous day's work, but now there is another 13 hour working day awaiting.\n\n\"Just five more minutes\" is what your brain is telling your muscles as you change the position every time the snooze timer runs out. Now tell me each and every one of those positions don't feel like heaven. Its not that you aren't enjoying lying down, but you are just not appreciating it quite enough. \n\nAlso, your mattress might just suck- crazy to think how much we spend on cars vs mattresses, while spending way more time on the mattress.",
            "I find sleep to be a time where my body finds ways to injure itself.",
            "I had such a hard time finding a position too, until the other day when I tried out this new one called Unisom.",
            "I have a body pillow so no issue for me",
            "Try working hard, you’ll be tired if you do it right",
            "One concept that I haven't seen repeated here is this: Pay attention to the position of your body when you wake up.\n\n\nIt may be bullshit, but I remember reading something along the lines of \"the position your body is in when you wake up is one of your most comfortable, so try to remember that position and use it to fall asleep\"\n\n\nAlso, like everyone else already said, better mattress / better pillow are worth the investment.",
            "As a lot of people are mentioning, a good mattress is important. I have a decent mattress but I have a thick layer of memory foam on top, which is cheaper than buying a whole expensive mattress. \n\nAlso... weed. On nights that I'm having trouble getting comfy I smoke and then I *melt* into my bed.",
            "Dakimakura, and no you don't have to get one with a half naked anime character on it, they have normal covers and they're amazing. So fluffy and soft and big. It's like a hug that never ends.",
            "Yes. Either the boobs, butt or an arm is in the way.",
            "My shoulders just get in the way :/",
            "When I got bed I can not get comfortable, but after hitting the snooze button and position is perfect",
            "There's only one position I can really fall asleep in, I have to be kinda curled up on my side with my neck bent down. Which really sucks because a little over a week ago, I tore both sides of my upper trap muscles and they knotted up into what I can only describe as actual fucking hellfire between my shoulder blades and the only way I could lay down until yesterday was flat on my back. And even then, it was excruciating. But what made it worse is that while I was asleep, I was returning to my desired curled into a ball position, which meant I was really tearing those injured muscles and I'd wake up paralyzed and screaming.",
            "[As hilarious as this is, it's absolutely true](https://www.reddit.com/r/gaming/comments/fcvmfo/can_we_all_agree_the_tiger_knee_position_is_the/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "I have a cheap mattress with a memory foam topper which isn’t the best set up, but the real kicker for me is getting linen sheets-I’m a sweaty trash person when I sleep and will NEVER go back to having cheap varicose sheets. I also splurged on a buffy comforter and memory foam pillows with that extra 600 we were getting back in April. I still find it hard to get comfy on some nights but I feel like that has more to do with my physical activities?? On days when I go hiking or get some kind of exercise, my bed feels super comfy and my body can easily relax-but if I sat on my ass and did nothing all day, my body feels antsy and I’m hyper aware of any little part that’s slightly uncomfortable, so I toss and turn for hours. Not sleeping well is basically a mix from being an anxiety ridden adult (wherein everything hurts because old), mattress quality, and physical activity.",
            "Also if you have a box spring get rid of it. We recently bought new mattresses for 3 rooms (2 were 8 years old and the 3rd was at least 10). Box springs were the biggest thing holding them back from being the \"next level\". We had a friend build a frame insert that goes inside the frame to replace the box spring, and it feels noticably better!",
            "I don't know how old you are, but at 61, every night is more and more uncomfortable. It sucks.",
            "Two and a half years ago my boyfriend and I achieved the most comfortable sleep of our lives. We fell asleep and woke up in the same position. We both didn't want to get up because of how comfortable we were and couldn't believe how well we slept. We still talk about it to this day, but have never achieved that level of comfort again",
            "I really wish I could sleep on my stomach comfortably but my big boobs get in the way. First world problems right?",
            "Me as a kid: *sleeps on floor against furniture with my neck bent 90 degrees\n\nI slept great and I love you!\n\nMe now: *sleeps on pillowtop mattress with mattress topper for extra comfort\n\nI barely slept for 45 minutes. Death would be a release from this travesty.",
            "I haven't enjoyed much of anything since I was a kid.",
            "A pillow between the legs is a game changer.",
            "The only things between you and the ground are tires, shoes and a bed... those are 3 of the most important investments in life. Side sleepers should have a softer mattress, and there should be a pillow between your legs for neutral hip alignment. On your back, you should have a pillow under your knees. Roll up a towel and place it in the bottom of your pillow case for neck support. Never sleep on your stomach (unless you sleep on a massage table with a face hole).\n\nA lot of stuff was way easier when you were a kid... as a physical therapist, I have to explain this to patients almost every single day. I also tell people, \"You've been going thru the motions your entire life... it's time to stop and think about what you're doing.\" Hope this helps!",
            "Yeah. I think it's because I weigh 125 lbs, and not 70lbs anymore. And my back always hurts. When will my back stop hurting?",
            "It is 3:20 AM at this moment. \nI have been trying to sleep for approximately 2 hours.\n\n\nBack - My neck fat is suffocating me.\n\n\nSide - Meh.\n\n\nStomach - My body is pleased, although my tits aren't. \n\n\nIt's a struggle. As a kid I would sleep fine in any position, I guess. With sleeping on my stomach always being my favourite.",
            "mines the captain morgan facing down",
            "I used to sleep on my right side all the time but couple of years ago I broke my right collarbone so I can’t do that anymore. So yes and no for your question, I used to have a comfortable sleeping position but not anymore because sleeping on my right side hurts and any other position is not comfortable for me.",
            "Idk, maybe consider changing your mattress? Might help",
            "Wow...yes, but I didn’t realize it until I read your question.",
            "Maybe you need a better bed",
            "Try sleeping on the floor. Throw some blankets down underneath and give yourself a week or two to adjust. You may wanna throw in the towel after the first night or two but stick it out. You will feel much better in the coming weeks!",
            "I actually find that squeezing a pillow (any pillow, not necessarily a body pillow) with all my limbs really helps. Try that!!",
            "It's about time you flipped your mattress",
            "My bf and I are literally talking about this right now.",
            "i had to make a conscience effort to remember the position im in when I wake up.   I'm a side sleeper, I can usually fall asleep in about 5 minutes now",
            "It's nice to see things where I'm like \"aw hell yeah, I'm still kinda a kid\" because adulthood is a terrifying concept. That being said, not looking forward to this.",
            "This is what drinking is for.",
            "Two things which I found changed from being a kid:\n\n1) You tend to sleep in the bed yourself so no one else disturbing your sleep. \n\n2) If the bed was narrower as a kid, I find those are more comfy than double or bigger beds. Not dure why, but even on my own, a double isn't as good. \n\nEven found this as an adult, sleeping next to someone else disturbs your sleep. Oh and once you hit 40, you need to get up to pee more often.",
            "I don’t think the position is the it thing. Having a good mattress and a good overall environment is key. I wear an eye mask with speakers built in and between the pitch black and low level music I’m asleep within minutes",
            "There are dozens of variants when it comes to sleep, be it with yourself, your place of sleep or even your surroundings so getting a few good sleep habits is crucial. Maybe your discomfort comes from something unrelated to your posture but that may definitely be a big reason too.\nHaving a healthy diet, doing exercise, drinking water, no phone before bed, scheduled sleep and avoiding/dealing with mental stress are all point to take into account besides the usual good mattress/bed and so fort\nHope this helps a little bit!",
            "Invested in a good mattress and changed everything for us. \n\nThe box beds usually have sleep trials where you can try them out for 100 nights w out risk.  We went thru 2 beds and were unimpressed till we tried a purple bed.  Pricey for us, but well worth it.",
            "I had bought 2 mattresses within a short amount of time before buying a Slee ok Number.  Best rest ever!  I'm no longer achy when I wake up!",
            "As a 14 year old this scares me",
            "Take your arms off each night and put them on the nightstand",
            "My Mrs thinks I'm nuts,\nWe have a super king with memory foam mattress.\nI sleep with 5-7pillows.\nHalf the time I wake with 2-3 as I throw them out through the night.\nBUT I'M ONE COMFORTABLE MOFO!\nNext move is two duvets!",
            "Yup. It happens because now that you’re bigger, you’re also heavier. Now there’s more crushing force and tension. Woohoo.",
            "You might need a new bed. I went to go buy furniture for my new apartment and the lady at the store tried to sell us a bed. A $5000 bed. Way out of my price range, but we humored her. \n\nIncredible experience. It was what sleep was supposed to feel like. I had completely forgotten what a good sleep could feel like. \n\nI promptly left and went to sleep on my $300 mattress and $20 bed frame. \n\nIt's like buying a new car when yours is a decade old; you don't know how much can be improved before you actually start checking them out.",
            "I think it’s the same reason kids can sleep all slumped over like in a car seat. Their bodies aren’t as tensed up as adults’ are (and you can’t really fix that I don’t think, it’s just nature when we grow up). Kids are just more flexible and whatnot.\n\nI found similar information when I was looking up how my daughter could possibly breathe let alone be comfortable with her head slumped down in her car seat.",
            "I agree. I used to be comfortable on my stomach, but this caused serious neck problems so never again. Otherwise, I shift constantly until morning.",
            "My old hurts, too",
            "I use a body pillow so I can sleep on my side with something between my legs. \nHelps a lot",
            "I prefer the burrito wrap method however there are very few circumstances where it's practical as I live in a warmer climate and even the A/C doesn't help much. I believe it's a humidity factor. I've found that if I employ the burrito wrap method I am comfy for like 10-15 minutes but then I start sweating buckets and I have to abandon the position.",
            "The trick is to be tired. Really tired,",
            "I'm always able to find an incredibly comfy sleeping position right after my alarm goes off.",
            "i’m sure it’s been said already, get a new mattress or mattress topper. i did that this year and sleep like a baby.",
            "Yes!! And the best sleep I've gotten in a vehicle was in our 2002 Kia Sedona van because the middle seats laid flat",
            "I'm 30 and used to sleep nicely on my belly until a couple months ago, I think. Now every night that I do that ends up with me waking up with my lower back hurting like a bitch. Since I noticed that I started sleeping on my side and I still haven't gotten used to it.",
            "I feel like that but with everything. I'm not kidding. It sucks.",
            "In my own experience I've found a weighted blanket to help tremendously in this regard. It's so easy to get cozy under one. I don't have any issues sleeping but since I've started using one I've also noticed I wake up in the middle of the night significantly less.",
            "I'm only 24 and every fucking morning I wake up with a pain in my neck. Doesn't matter what I do. One pillow, 2 pillows, big, small, feather or whatever the fuck else.",
            "Sorta. I really miss just knocking out and being oblivious to my surroundings.   I’m a little jealous of my son. This kid can sleep anywhere and on anything ! We live about an hour from family so anytime we take a ride he’s out within 10 mins.",
            "Yeah, me, i just woke up because i couldn't get comfortable actually. And for maybe the first time in my life i am debating spending 6-700 bucks on one of those fancy purple mattresses, if you really think about it its the american dream, except for me actually cause im not dreaming and I cant get proper sleep because of it.\n\ne: i also got a plate in my wrist thats been making my life miserable as well, so if its not actually being able to find a comfortable position and waking up, im waking up because my whole hand feels like its on fire.",
            "I feel like I have to re-learn my sleep position every night. When I was a kid I could fall asleep anywhere. Now if I do that I pay for it.",
            "You might want to try stretching before bed. Or even in bed, just tense your body one part at a time. It's a good way to reset random tension that you may be unaware of.",
            "I felt the same up till I started living with my fiancé. But now she’s worn in my side of the bed because she can’t sit on hers and do anything anymore for some reason. Maybe try sleeping on fluffy blankets, changing your pillow out and maybe clean/ clean more often your bed stuff. You’d be surprised how much that does.",
            "I found, once. Just a pile of pillows in an internet cafe my buddy owned, I slept like a baby. No snore, no sore muscles, no nothing.",
            "Know what else? My 5 year old dominates me in matching games.\nI think the reasons are the same.\nAs an adult, a real adult, w a regular job, kids, animals, house to tend to, not just an age of majority no longer a dependent 20-30 something single person, there is so much more to think about at every moment of the day.\nSo many worries, knowing I'm trying to sleep but haven't paid that bill I was supposed to pay 2 weeks ago and that report sure as hell won't get done tomorrow because I don't have anything for my 2 yr old to do all day and someone is going to have to step in because my wife has a doctor appointment and a conference call for 3 hours in the afternoon and I haven't gotten my meds re-upped and thats not going to help matters....\n\nMakes me not sleep, which I get...\nMakes me lose soundly in matching, which I never saw coming, and add that back to the list of things that keeps me up at night... plus the fact that she luxuriously counts her number of matches and compares that to my count, when it is her turn... to a degree, it can't be innocent, though she has the benefit of the doubt, for now...",
            "Time is undefeated.  When young, you have shiny new body parts (especially joints) with limited weight (I.e. long term wear & tear) on them.\n\nWith age, weight slowly takes a toll, cartilage deteriorates, & the body’s ability to regenerate degrades.\n\nStrangely, though acutely impactful, many times exercise helps; moving joints & cleansing muscle.  One doctor told my wife:  ‘motion is lotion’\n\nAs others have mentioned, don’t ignore your mattress.  You spend 1/3 of your life there, & your body uses that time for super important stuff.  When mattress shopping, don’t be too seduced by ‘soft & cozy’.  That usually means unsupportive, creating awkward joint angles that will make many sore.  Firm can take a few weeks to adjust to, but is usually better for your sleep health.  We got a 36mo no interest deal on a temperpedic, at my wife’s insistence, that I fought hard against, & it’s one of the best purchases I’ve ever made.",
            "Just stop it. Stop sleeping. Sleep is a hoax created to sell mattresses.",
            "Fortunately my mattress is not that expensive and comfy for me, not too hard, not too soft.\n\nI usually sleep semifetal postion hugging a pillow looking left. If i sleep in a \"coffin position\" I get awful backache next day.",
            "9 times out of 10 my bed was super comfy as a kid because I had played until I was ready to drop.\nUnless there was a severe weather situation Mom would make us stay outside to play.",
            "Holy shit I do. The second I lay down I'm instantly in heaven. Try improving how your bed feels, I had to do that before I was able to get comfy. I stupidly let myself be in severe pain before I decided to bite the bullet and spend money on some nice bed stuff. I bought myself a body pillow and a very cushy bed cover, and use 2 huge blankets. Also helps to make sure the room is a good temperature and just cozy in general, no bright colors, dim lighting, etc.",
            "As a kid your bones haven't fused yet so your body and joints are more flexible.",
            "Maybe try working out? I know that usually puts me in the comfy-est mood when laying in bed after",
            "As a kid, you don't sink in to the bed as much.",
            "Weighted blankets are a game changer, I also usually sleep better if I'm on top of a heated blanket",
            "Yeah it’s called exercising",
            "Not sure if mentioned but do you exercise? That helps me quite a bit. Bed goes from okay to heavenly.",
            "I legit I do 1000 positions before I even get mildly comfortable",
            "It's because you with less than 100 pounds as a kid. Mass = uncomfort.",
            "I found this really comfy one called “drinking two beers and smoking a bong rip”, I suggest giving that a try!",
            "Thank you for your question, and for adding the main ideas!!",
            "I went through this, I was gifted a weighted blanket and it changed my whole life. I could probably sleep on a cot just as comfortable and sound asleep as I would on a mattress. Truly a 10/10 experience.",
            "I've been having this problem recently, I find my arms get in weird positions where it might even get a bit sore and wake me up, then I move it and it's fine, but that never used to happen to me",
            "U need a new bed. After I got my new one I slept like a baby",
            "Now I have to sleep with a pillow in between my knees and under my side. I miss when it was easier to get comfortable and I didn't always have back pain",
            "My entire life (30M) I've slept on my left side. Just recently (due to poor life choices and injuries) I've started forcing myself sleeping on my right, back, and occasionally on my stomach. Its awkward, takes longer to fall asleep, but what other options are there? I started stretching, working out, and meditating. This has all helped. Try a purple bed. Changed my life.",
            "Nothing will ever feel as good as my top bunk only in my childhood room. Had a nightlight and a basket attached on the side( basket was from a old bicycle)so I could read my calvin and hobbes and garfield comic books before i went to sleep, ahhhh thanks you for bringing this topic up, as i will think about this as i try and go to sleep tonight",
            "I’ve got a great mattress and a great pillow. I’m a side sleeper. I can be comfortable until I realise my ear is being squashed by the whole weight of my head and then I forget what I’m meant to do with my arms because wtf do you actually even do with your arms?",
            "I used to sleep front down, hugging a pillow.\n\nThen I became a mother.\n\nBeing pregnant ruined front sleeping for me for obvious reasons, but it has been 5 years since my youngest was born and I still can’t get myself to lay comfortable the way I used to.\n\nIt is strange how that conditioning has stuck. I can’t explain it and would love to sleep as comfortably as I used to.\n\nPerhaps there is some such conditioning that happens as we grow that we are unaware of.",
            "Try to bunch up your pillow as close as you can to yourself, between your neck and your shoulder. I find it instantly makes me quite cozy, compared to when I don’t do that and just lay down on the pillow. Hope that makes sense. I’m a side sleeper though.\n\nAnd try different pillows: 1 thick soft one vs 2 thin ones stacked up etc.",
            "pillow in between my knees either on my side or or somewhat on my belly...lloooovveeee it!!",
            "Yeah, I always slept in a ball with a body pillow even as an adult. I had surgery to remove my colon and I have chrons on top of that, so sleeping that way is a one way ticket to brown town these days. Felt good on the back, and that morning stretch would be just damn near orgasmic. Now I wake up after a restless night sore as all hell. Yippee.",
            "I slept on someone’s stair case after a house party, sober at 15. That was literally more comfortable than any nights sleep I’ve had in my own bed since hitting 30.",
            "I honestly thought that we would have evolved by now to fall asleep easier. I completely feel the same way though I'll be honest with you.",
            "Yes! I feel like I have about 4-6 hours where I can stay in bed. After that parts of my body start ache. Could be a should. Or my upper back.  Or the neck.  I have spent way to much on pillows. I have not found the solution for me yet",
            "At some arbitrary point in my very late 20s, I found it too difficult to breathe in the sleeping position that was my favorite since childhood, so it's been a disappointing night ever since",
            "Yes! Kids also screwed my sleeping pattern. Lately (past month or so) it’s the muscles in my chest that are tight — esp when I turn my head. Kinda worrying but when I have a good sleep I don’t feel it.",
            "Forget comfy, I’m only 23 and I can’t go to sleep without waking up with something hurting. As a kid I slept on my stomach, when I do it now my stomach hurts and my shoulders are sore. I sleep on my side and my shoulders hurt. I sleep on my back and I wake up on my stomach or my side. It’s all dumb",
            "OMG YESSSSSS. Thought it was just me",
            "I never find a confortable position and when I finally fall asleep it's always with my hands under my body so when I get up in the morning I have both hands asleep and useless... making it nearly impossible to stop my alarm.",
            "Yup, sitting downstairs again right now because I got so irritated from tossing around. Alarm goes in 5 hours.",
            "Is it that I can't find the same position or because i was able to contort myself into unimaginable shapes? I could sleep on the floor for a week at a friends and be ready to jump up and go. I lay down now for 30 minutes on the floor and it feels like I was dropped off a cliff.",
            "I think this is why so many have knee pillows, and tuck pillows, etc.. We get so damn heavy, relative to when we were children.  \n\n\nIt does make you wonder if there is a better way that isn't just a flat springy thing.  \n\n\nI'm a type 1 diabetic, and tend to have an insulin infusion set stuck to one side of me or the other, which ultimately means I favor one side for stretches of time, to avoid pushing on the site.  \nSometimes, I'll have had a site change and get to roll to that side, and the difference in tension release and 'comfort' is nothing short of crazy.  \nThis may be something we lose a feeling for too, for those of us who can shift and roll around wherever they feel like, without restriction, in my case through medical reasoning, but for many, injury, or age reasons..  \n\n\nMust be a better way..",
            "This is about getting your body used to a proper sleeping position. We go into the fetal position as babies. It is a naturally safe and relaxed position. Laying on your side with your knees pulled slightly up and your arms bent, your pillow should hold your neck + spine in a neutral position. So nothing huge or super flat. Also, try being aware of your spine position as you sleep. Rotate your hips until your spine is straight and comfortable. Be aware of the rotation of joints and the following effect on the spine with the goal being keeping the spine straight (from side to side). A pillow between the knees helps some people feel more natural with the knees in this position.   \n     The second part of this is learning to self soothe. Every night in a chance to practice inner calm and meditation. Most important is breathing. Count four in, hold for seven, breathe out for eight. Focus your mind on the breath. If you get light headed, extend the holding and exhale portion of the breath. This shouldn't be a long drawn out process that you stop looking forward to. This is something you do from two minutes to an hour, it's as long as you enjoy the experience. It's a time to allow your mind to calm. Simply focus on the breath.",
            "My boobs get in the way. And my hips. I want to be a kid again so curves don’t fuck up my sleep.",
            "I'm a side sleeper but probably not a typical side sleeper. It's more like side and partial stomach. Problem is I have to have the arm of the side I'm kinda laying on under the pillow and every 2 hours or less I wake up to my arm/shoulder being asleep. So then I flop to the other side and it happens all over again in another couple of hours.",
            "Lay on your side and put the pillow between your chin and shoulder. Bliss was found for me a couple years ago.",
            "Have you tried curling up into a ball? Works for me. I also move my feet up and down which is kind of like a cat making its bed",
            "Yoga! Also try out the child pose before bed.   \nTry sleeping on a comfy couch that gives you a v shaped back and side support.",
            "My problem is my back wants me to sleep on my stomach, my neck disagrees. I have to pretty much find the exact correct spot for sleeping in or I'm gonna be in significant amounts of pain the next day or two.",
            "I have found that comfortable position that I can sleep in every night. The only problem is it makes it very difficult to sleep in any other position. So if I'm alone I'm good, but whenever I'm sleeping with someone else I'm not likely to get much sleep.",
            "No, I find a new really comfy position every 2 to 5 minutes.",
            "I know I'm late on this but I've had a sleep number for over 15 years and it's been the best for the wife and me.  I sleep on a very firm setting and she sleeps ona softer setting.",
            "Firmer mattress.\n\nAs a kid you didn't weigh much so you wouldn't depress a mattress much.\n\nChanges as you age \n\nGet a firm mattress.  You can try making a pallet out of blankets on the floor a few nights to see what it's like",
            "My comfortable positions always leave my neck completely sore when waking up in the morning, so I have to endure less comfortable positions to not have my neck snap in the morning.",
            "Nah, like 2 months ago I started making a triangle in the corner with my two thicker pillows and now I throw my weight into it much as possible and wing it with the rest of my body... Been sleeping better than as long as I can remember 👌🏽",
            "I tell my gf all the time that \"i don't know how to sleep\". At least one arm has pins and needles at a time because I don't know what to do with them.",
            "I had forgotten about it until now, but there’s a certain *comfy* feeling I haven’t woken up with in a really long time. Like you’re on a cloud comfortable",
            "I have a hypermobility disorder. While learning about it I learned that people naturally lose flexibility as we age. I wonder if that has something to do with inability to find comfy sleep positions.",
            "I used to be able to sleep on my tummy and I loved it! Until I got injured in soccer and went to a chiropractor and that did it for me. Sleepless nights after that.",
            "Yes, often. Invest in a good bed and high quality sheets. Change your sheets every couple of days and always shower before bed. I have a tempurpedic bed and pillows and brooklinen sheets, but you gotta find what works for you.",
            "I loved sleeping in fetal position. But then I started working out in my twenties. Now I can’t sleep on my sides cuz I grew to wide... its the stupidest side effect from bodybuilding no one tells you about... typing this at 4 in the mornin cuz I couldn’t get comfortable sleeping... again... I’m kinda confound to laying on my back (which I hate). Pro tip: don’t grow too wide.",
            "I have this glitch in the matrix level memory of getting in bed one night as a teen and having absolutely no idea how I slept. It was like I had never done it before. I had to try every different position and nothing really felt natural. I ended up becoming a stomach sleeper for years which I think caused me back problems.",
            "I can’t remember what it was about but I remember a comment here on Reddit about a guy who wanted to be able to just remove his arms and hang them up for the night before going to bed. I always kinda imagined it like removing a shoulder yoke except your arms come off too. I think about it a lot as I accidentally strangle myself with one arm and the other falls asleep because I’m laying on it (so... ya know... nightly).",
            "I had one or two, but now I'm growing boobs and they don't work any more. It's a bummer.",
            "I lost a good amount of weight over the year (like 30%)  and am much more comfortable. I think part of it was weight and the other part was general bloating",
            "I have a memory foam mattress and then got a body pillow because im a side sleeper.\n\nbest sleep ever.",
            "Get stronger. Working out makes u sleep better, but also your whole body is just more supported by skeletal muscles when you're fit. \n\nAt least it worked for me, a super skinny dude.",
            "I'm 80 and still looking for that position.",
            "I sleep on my stomach/side with one leg straight and one knee popped out straddling near the edge of the bed and it is the only way I can sleep now. Its additive. But also means no sleeping on road trips in cars or on planes.",
            "That's because back then we were underdeveloped jelly with rubber bones. Now we are developed jelly with achy joints",
            "I never had to reshape my pillow but recently that bitch just can't stay comfy. Like how and why did it suddenly decide to turn into a pancake after 2 min. Not to mention sleeping sucks after I had to change the sides of the bed",
            "I sleep without a pillow now, and I'm the most comfortable I've ever been. It took a 3-4 months to get fully used to but I never wake up with neck pain anymore and feel MUCH more comfortable lying down.",
            "I totally agree, but I'm out of shape, infirm, *and* in pain, so that might be contributing...",
            "V from Cyberpunk2077 enters the chat",
            "A thousand times yes, I just bought a king size mattress and I still flop like a salmon swimming upstream",
            "I felt this way until I threw a pillow between my legs. Im a side sleeper and this had restored my comfy sleep. That is until I got sleep apnea. Now I'm back at square one.",
            "Anyone have experience with weighted blankets? i've wanted to get one for a while but I get hot when i sleep so i was looking for something breathable",
            "Dropped 3.5 k on a tempurpedic and omg it is the best money I have ever spent",
            "I’ve found the best sleeping positions is to lay on my back and put a couple of pillows under my knees to raise them up. A friend who is a chiropractor told me people sleep the wrong way, raising our head too high when we should instead raise up our legs and only use one pillow under our head or none if you can sleep that way. He also said if you must sleep on your side and can’t sleep on your back then we should put a pillow between our legs to square our hips and take pressure off our back. I called bullshit, he challenged me to try it. It works fantastically, though I still have not admitted it to him because I know he’ll be smug AF about it.",
            "its my arm bruh. I wanna lay on my side but my arm is always in the way.",
            "I don’t recall sleeping as a child, but recently I found a sleeping position I was very comfortable in.  I tried to hold on to this, but I’ve been unable to find it since.  I think about it often when I’m trying to get comfortable and sometimes get close.  \n\nI recall one of my legs was stretched longer than my other and I was on my left side.  The pressure was fairly equal between my legs, but I can’t recall how my arms were situated in the slightest.",
            "I broke my wrist and shoulder and am still in recovery. That was my sleeping shoulder and now I have to fight to fall asleep.",
            "It took me years of being uncomfortable before I realized that for me it boils down to pillow and temperature. It doesn’t FEEL like I’m uncomfortable due to my pillow or temp but that is usually what it is. I’m a side sleeper and can sleep on a memory foam, coil, or air mattress but if I have a bad pillow or the room is too hot, I’m screwed. It is to the point that I take a travel pillow with me on vacations.",
            "My only problem is I don’t know what to do with my arms.  The most comfortable position for me is sleeping on my stomach, except for the damn arms.  I think I might like to sleep in zero g",
            "✨Hammocks✨",
            "As a kid, you weigh very little. That's much less force pushing you down into your mattress or squashing your arm between your body and your mattress.\n\nWeighing more means more force and more discomfort",
            "Nope!  I've found 3 that work for me:\n\nCoffin pose - on my back, hands on my chest like Dracula.  Works well if I can relax (but scares my wife), but see below if not.\n\nFetal position, on one side with body pillow between my knees, arms up with one hand under my pillow, under my head, and the other on top.  Shuts out the world.\n\nIf I'm having trouble sleeping, Diver pose - almost same as Coffin pose, but with arms straight down by my side, palm down.  Hold steady like that and wait for the hypnic jerks to kick in and then I know I'm relaxed and on the border of sleep.  At that point I might roll to fetal position, or just stay steady.  I'll be asleep in no time either way.\n\nSleep-deprived enough, any position works.  But if I'm reasonably caught up on sleep, those three depending on mood and energy level are the ones that do it for me.",
            "Whenever I feel like I can’t get comfortable at night I know it’s time to clean the sheets. Somethin about crispy clean cool sheets is what does it for me",
            "Thank the square cube law. The larger you are the more mass you have per unit of surface area.",
            "I find comfortable positions every now and then, but what really weirds me out is how one day a position will feel great and the next day the exact same position will suck.\n\nI just don’t get it. It’s so frustrating. Sometimes I can even get a little ocd about making sure the pillow and the blankets are in the exact same spot so I can try to “recreate” what happened the night before but it rarely works.\n\nOne time I got on a hot streak and had like 4 great nights in a row and then suddenly couldn’t do it again for the life of me.\n\nWhat changed? Nothing. It just worked one day and suddenly didn’t the next.",
            "I need an extra blanket besides the one I’m already using with my wife. The extra one is only for me and I’ll hug it, I’ll roll my arms around it and the lower part goes between my knees and I’ll sleep on either side, left or right doesn’t matter but never straight (with my face up). \n\nMy wife was kinda turned off in the beginning because I wanted an extra blanket for me and it was actually a bit harder for me to tell her but we got over it and now I sleep pretty good. I absolutely must sleep this way otherwise I’m extremely uncomfortable.",
            "I used to love sleeping on my stomach since I was born, then when I turned 25, I still find it comfortable as fuck, but it feels like I’m compressing my own chest and I can’t breath or something \n\nIt’s stupid and unfair",
            "Purple mattress is insanity. I legit sleep like a baby on that, even after 2 cups of coffee",
            "I had to buy a cheap mattress after a breakup in college. (One of the least fun shopping experiences IMO)\nIt’s not great, but I liked it until I was housesitting and laid on their Nectar mattress. I get a “oh damn this is comfy” moment every time (I housesit often). I’ve only had my mattress for four ish years but I’m considering switching it out already"
        ]
    },
    {
        "post_id": "uhd6t9",
        "author": "HeyLarry158",
        "title": "Are guys really supposed to last for 30 min of penetration during sex?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/uhd6t9/are_guys_really_supposed_to_last_for_30_min_of/",
        "score": 20994,
        "num_comments": 4298,
        "created_utc": 1651574249.0,
        "selftext": "Very well might’ve been posted already so forgive me but yesterday I (21m) was having a conversation with a close friend of mine (20f) about sex and what not. We discussed body counts and like dos and donts just to kinda help eachother out as friends but then I asked her about how long a guy should last. She’s been with 4 people so I wouldn’t really call her inexperienced but she said all 4 of the guys lasted around 30 minutes and I made sure she knew I was referring to just penetration. Has she just gotten really lucky or is this actually the normal time a guy should last because I always assumed if you get like 15 minutes out of yourself down there you did a pretty good job lol",
        "permalink": "/r/NoStupidQuestions/comments/uhd6t9/are_guys_really_supposed_to_last_for_30_min_of/",
        "comments": [
            "I'm on antidepressants  so sometimes, It can take 30 minutes. Maybe she only fucks depressed dudes\n\n\nEdit- It tickles me that this is my best comment ever on Reddit thanks for the joy everyone!",
            "Studies seems to show 3-6 minutes of penetrative sex is average.\n\nhttps://en.wikipedia.org/wiki/Intravaginal\\_ejaculation\\_latency\\_time",
            "Well I have been with two people. My ex husband who would go on for 45 min and sometimes longer. And my ex bf who would last for 0-15 mins. Having penetrative sex for 45 mins is daunting, you get sore and it's not fun anymore. I much prefer 0-15 mins because I feel great getting him there that fast and it's over when it's still fun and I look forward to the next time right away.",
            "[deleted]",
            "30 seconds? Sure.",
            "Personally, I will get bored and my vagina will go numb being pounded that long. Get in there and get the job done lol. 10ish minutes is perfect if you've done proper foreplay.",
            "Most women do NOT want it to last 30 minutes.  It hurts after awhile.",
            "I think your friend loses track of time while having sex.\n\nEdit: Now that I think about it, it could be that her partners are just so bad that 3 minutes seems like 30.",
            "It's kind of a tricky question because 30 min of penetration doesn't necessarily mean 30 min of full-on vigorous thrusting.\n\nYou can vary in intensity and speed, change position, or pause for a moment and use your hand or mouth. Just stopping at the right time can let you last much longer than the time you spend resting. If you're not just thrusting as fast as you can like you're going for quicky, 30 min is a very reasonable time to reach with just mini pauses in between. Just remember not leaving the girl hanging while you take a break with your penis. And definitely don't stop if she's close.",
            "5-10 minutes is great if the woman has already gotten enough foreplay. More than 10 minutes of thrusting and she will start needing more lubrication or start wishing you’d finish already.\n\nA woman who has a guy hump away on her for 30 minutes isn’t lucky. She’s probably getting sore at that point.",
            "Focus on your breathing and you can last as long as you can concentrate. My records 7 seconds but that’s up from 5 all thanks to breathing!",
            "I personally wouldn’t expect or enjoy that.",
            "Even when i beat my meat, just basically moving my hand i feel like it's enough when i go over 15+ min. Can't really imagine a full body workout for 30+minutes",
            "This one woman’s opinion: please don’t. 10min tops, plus however long foreplay takes.",
            "Sex should last as long as you and your partner are comfortable with imo",
            "My ex lasted a pretty long time, I never watched the clock but maybe 15-30 minutes and it really wasn't that great. I'd get bored and start trying to make him finish lol. He was a self-admitted porn addict and maybe didn't quite have \"death grip syndrome\" but it was getting there.\n\nAnd compare that to my new guy who lasts... I dunno, 2-5 minutes, but he always gets me off first and we can go multiple rounds and I'm much happier.",
            "Depends on what your partner wants. Some people don't like penetrative sex at all. As long as you take care of what your partner wants in the moment, it's not a big deal if you cum early. It's only bad if you cum and then don't take care of your partner after.\n\nImo I think you should switch things up a few times with some oral/hand stuff in that time BC penetration for extended periods of time with no breaks can be boring for everyone involved, plus it gives you time to regain some stamina if you get me.\n\nTl;dr: the name \"foreplay\" incorrectly implies its only a preamble to penetrative sex. Switch it up and the sex can last longer and be 10,0069x better",
            "No, but they are supposed to get her off first or at least worked up enough that it can happen in under 10.",
            "30 minutes inside is a LOT, and a lot of women won't consider that lucky at all.\n\nIf you take that long to orgasm as a male you are liable to get turned down for repeats or told to break off because the girl is in pain. Even if not you'll most likely end up using a bunch of lube because a lot of (most?) women don't stay wet enough long enough for that kind of time on their own.\n\nIt's not super uncommon for guys to not be able to come in 3\\~5 minutes, and some need more than just a bit of P in V to be able to come at all, so it's entirely possible she found a few long lasting dudes. But it's not what I'd expect from the average shag.\n\n30 minutes of doing many things, including foreplay, oral, position changes, etc, sure. But 30 minutes of straight up in-out-in-out? Nah.",
            "Plot twist; she's a virgin who watched 4 pornos where the dude lasted about 30 min",
            "It really varies- most guys I’ve been with didn’t last more than a minute.",
            "Everyone is different. Endurance can be trained. :)\n30 minutes sounds tiresome though.",
            "I mean I dont even do 15 usually lmao",
            "In the words of the Pawn Stars guy: three minutes, best I can do.",
            "You don't need to last that long if you're engaging in good foreplay. You want to get a girl to the brink before any penetration happens, and then have sex. Otherwise it's not very fun for the girl. \n\nSometimes you won't be able to make her finish first, so you just gotta finish the job after and she'll be happy. Or if you aren't really feeling it anymore sometimes, encourage her to finish herself and help her out, kiss her, touch her, make her feel really sexy. \n\nFinishing during sex is far from the most important part of sex, and women just want to feel like their enjoyment matters to their partner. How long it lasts doesn't matter as long as both of you enjoy yourselves. \n\nMy partner doesn't last a very long amount of time, maybe about 5-10 minutes max most of the time. I'm on antidepressants so I also take longer to finish. But I honestly have never cared, and I've never enjoyed sex more because I'm deeply in love with my partner. \n\nI love when he finishes quickly because it makes me feel sexy and powerful, and I don't really have a problem taking control and finishing myself afterwards if I need to. Sex is fun when you're doing it with someone you care about, so try not to overthink and just make each other feel good",
            "[deleted]",
            "Yeah thats totally normal, oh wait MINUTES…..",
            "My.. uh, duration... was a hell of a lot better in my early 20s. 20-40 mins range was normal for numerous encounters.\n\nFast forward to present... married for a decade, things aren't as lengthy. Age? Less frequent? Same partner? Probably all factor in.",
            "4 different people all the same race times? I call bullshit.",
            "I know I'm late to the party but 29 minutes should be oral and 1 minute of penetration.",
            "Def not normal",
            "I'm 40 and have been with 50+ women and it differs for each experience. I've popped in 3 mins before and I've lasted +3 hours before. The equation as it relates to me is: the more comfortable I am with the girl = the longer I can last. \n\nForeplay is a huge contributing factor and can be the difference between an amazing experience and a shitty one. You should use foreplay to learn your partner's body, and be sure to communicate each others do's and don'ts to make the experience as pleasurable as possible for everyone involved. COMMUNICATION is key! DO NOT get your (s)expectations from porn! \n\nIf you finish before her, be a gentleman and do what's needed to make sure she gets there too. Everyone should cross the finish line. In fact, if I'm \"dancing\" with someone I love, I'll go down during foreplay and MAKE SURE she has her *little death* before we even get to the main event... personally, I like for her to *get there* more than once anyway.\n\nBottom line: Every experience is different and each partner unique. Lasting longer doesn't always equal a more pleasurable sexy time. If she crosses the finish line, how long you lasted probably matters more to you than it does to her. 5 minutes or 5 hours... it's really more about the experience than the time spent. If you communicate well, everyone will have fun and be happy. \n\nStay safe",
            "I’m truly shocked by how many people are saying 30 min sex is too long ….. if you are changing up positions and speeds then 30 min is a lot of fun and totally achievable.",
            "[deleted]",
            "Depends. Are they on antidepressants? Drunk? Both of them can kill boners and make things not too sensitive down there. Or she's a really, really boring lay.",
            "30 minutes is possible if there’s a lot of foreplay in between and you switch positions a lot. my husband and i usually have sex between 30 minutes to an hour",
            "If done in doggie style position. Every minute is  equal to 7.",
            "Using a condom helps you last a lot longer bc it’s less sensitive",
            "No.",
            "I'm either 30 seconds or 2 hours. Most of the time its 30 seconds.",
            "You're fine kiddo, eat her pussy good for the first 30 minutes and she won't care how long you last. Plus you're young, being a 2 pump chump at 21 is more forgivable than at 40 lol.",
            "No chance I'm letting my wife peg me for that long",
            "More than 15 minutes of PIV is a deal breaker. Do not want. Give me the best 3 to 5 minutes of my life and GTFO.",
            "So many of these replies are absolute shit. \n\n\"If you last long, you're not attracted to your partner\"\n\n\"If you dont last long its cuz you're in love\"\n\n\"You should be able to last as long as you want\"\n\nAll bullshit. How long you last is based on your sensitivity, how linked your orgasm is to physical or mental stimulation, what your sexual needs are, your fitness and how fast you get tired and how much getting tired affects your erection or pleasure, your stress level and how much stress affects your sexual performance. \n\nThere are a million factors. I find the more attracted to someone I am and the more fun I'm having the longer I last because I take time and slow down and I'm more focused on them and how they look or feel than I am on finishing or my own pleasure. \n\nIts different for anyone. \n\n&#x200B;\n\nAs for how long a woman expects a man to last, that depends on them as well. How wet do they get and how long can they sustain it? That can affect how long they actually enjoy the sex. Lube is your friend. Do they get off easy? Or is it a challenge for them? Whats their sensitivity like? Do they get off more so from clit stimulation or penetration? If its penetration, do they prefer closer to the entrance or deeper? \n\nI've been with a lot of people, and every person is vastly difference. \n\n&#x200B;\n\nPS. Its less important that you get someone off with penetration and more important that you get them off. Get good with your mouth and hands if you have a hard time lasting long enough with penetration.",
            "Really depends. Most times it can go for as long as we need, other times shit gets out of control and it only lasts a few mins.",
            "Were all of these guys on ecstasy? Because that’ll slow things down a bit.\n\nI don’t know man. It’s done when it’s done. Kind of like asking how many words a novel should be. As long as it takes to tell the story*\n\n*I am well aware that there are target word counts, but that’s more about selling books and less about telling stories.",
            "You can take 45-60 minutes if you prefer.",
            "I used to give girls a full 90 mins Football match. Once in awhile maybe a Cricket match. \n\nNowadays they're lucky to get a Hockey period or a Basketball Quarter. \n\nBut most times it's just 1 round of an MMA bout, and that's only if I don't get finished early.",
            "If it's a 30 minute window it should be 20ish minutes of heavy petting and foreplay followed by 5 - 8 minutes of penetration then a few minutes for clean up and high fives. If you're not in a rush you should work together to get everybody off, then the clean up and high fives.",
            ">Has she just gotten really lucky\n\nUnlucky if anything",
            "No, most penetrative sex is not lasting 15-30 minutes. At 20? Sure. Depends on the person, but it’s certainly possible she’s been with 4 guys that average a half hour. Unlikely, but possible. \n\nMy wife and I have been together since we were 14 and are now 42. Our first job was working in an adult video store her father managed when we were 15-16 and we’ve always been highly sexual. Still at our age we still have a few marathon nights where we’ll have a few drinks and have penetrative sex totaling hours, with breaks in between for foreplay. While fun in the moment, we regret it for days after because it takes several days for her to recover.\n\nMost of our sex lasts anywhere between 5 and 15 minutes, which is perfect. Sometimes a few minutes is all you want/need. Sometimes we just have to stop because I haven’t came yet. Booze, morning wood, whatever. Sometimes I never cum. Sometimes it’s over in a couple minutes. \n\nThis notion that men should be able to perform every time for 10, 20, 30, 60 minutes or more is absurd and it’s dangerous. It sets an unrealistic expectation and when you fail to meet it, it can do a number on you mentally. You can start questioning your *manhood* and then it becomes a self-defeating cycle. \n\nYou can’t set those expectations on yourself. Every mood and moment is different. Every experience is different. If something is off, communicate that with your partner. If you feel like you’re not lasting long enough, communicate with your partner and figure out if that’s even the reality. If it is, talk about how to approach it with them. I’d they aren’t understanding and on the same team, that’s not a healthy relationship. \n\nIf you’re planning on a full night of sex and you know you know you can last a few minutes, then talk about it. I like to call it “getting the easy one out of the way”. It takes longer to orgasm the more you have, so spend time on forplay and when you recover, go again.",
            "No, sometimes sure but trust me they don't usually want 30 mins of penetration either",
            "Depends a lot. If it’s a 1st rounder I’m not lasting more than 5 mins. If it’s the 2nd round I can last 3-4 times longer, but it depends a lot on the girl, the positions…",
            "It would definitely be outside of statistical norms for all of her partners to last that long. I have been with 8? Different People and I don't think I have ever gone over 30 mins of solid penetration. Sure if you take a break, switch it up a bit, and compose yourself you might get a session that hits an hour but even 30 minutes would be good going for me.\n\nI don't know if sometimes girls use this as a kind of clueless brag? Because you hear it a lot I guess. If they though about it, the better brag would be something like. \"No one can last more than 5 minutes once they put it in me.\"\n\nMoral of the story: the quality of sex has almost nothing to do with the duration of sex... I've had amazing sex that was done in less than 5 minutes, and terrible sex that lasted 30... don't get down on yourself for your staying power dude!",
            "30 minutes when someone is filming, 5 minutes when not",
            "Exercise helps with that stamina. Changing pace or positions also helps. But 30min of straight up jack rabbit thrusting... Nah. I think that's very rare or porn star status. 😱",
            "Penetration starts to get uncomfortable and painful if you do it for more than like 10 minutes. Your friend is either lying or has an iron vagina.",
            "30 minutes is ridiculous and unnecessary. I would actually be stressed out that I'm doing something wrong as a woman if a man cannot cum in 30 minutes. Wtf.",
            "Everyone is different.  My wife (and we've been having regular sex for over ten years, so it's not an 'experience' thing) gets sore and uncomfortable after more than five or six minutes, so we usually focus on getting her an orgasm with either external stimulation or in a position that requires a minimum of \"pounding.\"\n\nEvery once in a blue moon, my wife wants more than that and we really go to town on each other, which I really enjoy, but she is then invariably quite sore for the next few days and we have to take a break from sex for a while.",
            "This might sound strange. But when i get too close to climax too early i calculate 7x7=49 everytime i do that, i get an extra few minutes. No idea how, discovered that through coincidence i guess. But it works for me.",
            "my highs and lows are too varied but I'd say 5 to 40mins is my range. SO loves it either end so...",
            "Depends on how many rounds my partner and I (26M) go. First round can be 5-10 until i orgasm, but I've come to find foreplay between rounds allows for a reprise and the following sessions can last 20-60 minutes or until we're both exhausted. That's just what we like and what works for us because we're frisky as hell. Not everyone wants that though. \n\nhttps://youtu.be/QyViuXFyIE4\n\n\"EVERY BITCH IS DIFFERENT NOW. COMMUNICATE WITH YOUR BITCHES!\"",
            "Just slow down when you need to",
            "2.9 milliseconds",
            "With decent foreplay, my wife gets off in about 5 minutes. I just try to last that long.",
            "Try having sex on antidepressants. 30 mins would be quick. I used to just give up",
            "If you are lucky you find a guy on anti depressants and they can go for a long time due to the \"sexual side effects\". If you are very lucky you can find one on meth that goes all night. Just have a new bottle of lube at the ready and switch up positions often.",
            "Wear an extra thick condom and you can add a lot of time. Added benefit of safety as well.",
            "NO. there is such a thing as going on too long, which can get painful for us gals.\n\ni have had to let some people know.. it's been a good run, time to start wrapping it up!",
            "If I get into the 5-10 minute range, my wife very kindly encourages to hurry up. Laundry ain’t going to fold itself.",
            "Depends on the woman. Some want me to cum after 4 minutes, some want to see how long we can both go\n\nPersonal preference",
            "It’s all different a quick pump and a squirt, a decent amount of time , sometimes hours and hours with the right lady, so many things dictate so many other things. That is why it’s not a sicence it’s an art form",
            "My wife usually orgasms within 5 to 10 minutes from penetration and clitoral stimulation. She mostly prefers that I finish with her or shortly after.  Completely dependent on the situation. Sometimes she takes longer and we work it out.",
            "Of course guys can last 30 minutes during penetration! Personally I can last for about an hour on average, though I’m not the one doing the penetrating :)",
            "Idk if it's been said already but the key is to make foreplay important so your partner gets what they 'came' for, and then duration doesn't matter as much. As long as everyone gets one, it's all good and then you can just relax and enjoy what you get \n\nIf you're really caught up on lasting longer, try having a cheeky tug an hour or two before the sexy times. Tends to add an extra 5-10 minutes on but again, don't forget the foreplay",
            "Anything over 15 is difficult just from a cardio perspective, I might've gone 25 mins a few times in my life but I usually just cum once I'm tired. \n\nForeplay is the key, never had any complaints",
            "I think it all depends. Sometimes I'm good with my husband going about 10 to 15 minutes, other times we are going for am hour or more. He can absolutely last that long because it just depends on making sure we switch it up position wise if he's getting close. The longer we go though we eventually need lube because it doesn't matter how wet I am, the cooling effects of lube help cool down any friction.",
            "5 minutes or 5 hours, all feels the same. As long as you ding her bells, no one cares how long you last.",
            "Stop watching porn it rots your mind",
            "Ain’t nobody supposed to do nothin",
            "Some days we are wham bam thank you ma'am and other days we have to stop because we are going on 40 minutes and my bits a numb.  It depends on your situation and feel of the day but I would say we average 10-20 min.",
            "If it takes 30 minutes then he is doing something wrong or not doing the right things. \n\nAnyways. Condoms can make a huge difference.",
            "I’ve been 1 min - to 2 hours it fucking depends man are you in a hurry are you drunk are you making love or fucking it’s all variable"
        ]
    },
    {
        "post_id": "15ol70p",
        "author": "None",
        "title": "Do most skinny people over 30 have to think about what they eat literally all the time?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/15ol70p/do_most_skinny_people_over_30_have_to_think_about/",
        "score": 20992,
        "num_comments": 13974,
        "created_utc": 1691789070.0,
        "selftext": "I'm a 30 year old woman and as I got to my late 20s I realized that if I want to be thin (like average/healthy thin, not super skinny, just not fat) I have to pay attention to what I eat pretty much every single day, all day long. I'm always hungry and up for eating snacks so 24/7 I have to be vigilent and make sure I'm not eating too much.\n\nI cook nearly all my meals and it's mostly vegetarian food and limited oil/sugar, I don't drink soda ever, I never eat fast food, I eat junk food occasionally (probably once per week I make a bad decision like eating a bag of crisps), I do drink alcohol but not a crazy amount. I could easily eat like 3x the portion sizes of what I'm supposed to have for each meal, like it might be tofu and rice and veggies but I could eat a lot of it.\n\nIs this just what it will be like for the rest of my life? I have to stay vigilent and think about what I'm eating every day 24/7 or be overweight? Are the thin people around me having to be careful with everything they eat every day and that's how they stay thin?\n\n—-\n\nEdit: It would be useful to know if people responding are men or women as it might be quite different\n\nEdit2: Thanks for all your inputs and helpful advice. I’ve also gotten some weird DMs telling me I’m an idiot for being a vegetarian and a few men asking if I’m pretty, wtf. Anyway I learned a lot from these many comment responses so thanks yall.",
        "permalink": "/r/NoStupidQuestions/comments/15ol70p/do_most_skinny_people_over_30_have_to_think_about/",
        "comments": [
            "37M, yes and no. I pay attention a lot more than I used to, but i don't count calories daily. I check my weight on a scale every week. If it's up, I eat cleaner, if it's down, I eat out more or continue what I'm doing.",
            "When I tracked my Macros and worked out 5 days a week, I weighed 180.  I stopped and developed a bad diet.  I weigh 220.  So for me, yes.  \nMale\n5'9\"",
            "Meal prepping can help, but generally yes.",
            "I think about what I eat all the time and I'm fat and old.\n\n\n\nEdit.  Never thought anyone would even notice this comment. \n1. I'm fairly active and do exercise, though very limited due to wear and tear.  Many questions about my wear and tear.  I played college football and was a boxer until 28 when my daughter was born.  I wanted to have  adult conversations with her when she was an adult.   I have 30% of my PCL and have had 5 meniscus tear clean ups in my right knee.  1 clean up in my in my left. And plantar faciitis.   I do some limited lifting and the exercise bike for cardio. 4 days a week.  \n2. I was a chef for 12 years, and I refuse to eat crap.  What I should have said is that with my experience, I can prepare quality meals at home.  I don't eat out, I don't eat fast food, I don't eat highly processed pre-made foods.  Sorry for the confusion, yes high end restaurants don't necessarily serve high quality food. \n3.  Thank you all who have extended feeling similar.   It's feels good to know you're not the only one.\nFinally, I am not looking to lose weight.  I'm not telling people how to lose weight (I thought this was obvious).  I love who I am and my life as it is.  I do find it odd the number of people who hate fat people and make sure we know it. But you're going to have to sling bigger stones if your looking to hurt us. we are well padded.\n\nPer OP's request, I am a male.",
            "Yes, with certain foods, but I never deny myself  whole foods.\n\nIf I’m hungry but don’t want an apple or almonds, I must not be that hungry and it’s just a craving.",
            "I'm 67 (shit almost 68) and not as thin the past couple years as ever. (Thanks old age on your joints) but I didn't focus on not eating all day, every day. But I've also always tried to exercise mostly just walking and/or jogging. \n\nI think the urge to eat all kinds of things goes away after awhile, but I've also never been one to drink soda or eat chips or any of those things. I like them, but don't buy them. If it's not in the house it's hard to eat them. \n\nNow is when you need to start being careful about the weight, too, because the older you get the harder it is to lose. \n\nOh, I'm an old woman. Getting older is fine it's the getting old part that sucks. I also quit smoking and drinking years ago so that helps. It's the empty calories that really pile it on. I had my only kid at 32 and was actually in the best shape of my life for quite a long time after.\n\nBut it's not magic, damn it. You've got to work at it, like everything. And some people are just thin. Sad, but true.\n\nGood luck, it really is worth it. You don't want to be unable to do things not only because of weight, but age then as well.",
            "There are a lot of good comments about metabolism, diet and exercise.\n\nI don't see anything about the other major factor in controlling weight - hunger.\n\nA high carb/high sugar diet results in big peaks and big valleys in blood sugar. Low blood sugar triggers the experience of hunger. This means with a high sugar/carb diet, you can regularly experience hunger even when you have recently had too much caloric intake.\n\nStress and external experiences can sometimes develop into triggering hunger. Eating causes dopamine to be released. This can result in people eating as an adaptive behavior to stress. If you engage in this behavior enough, it can get to the point where stress alone can cause your brain to release hormones that trigger experience of hunger.\n\nThe microbiome in your gut also triggers hunger by releasing hormones that manipulate your brain into releasing other hormones that result in experiencing hunger.  This is particularly nasty because you may have eaten plenty of food for your body but if the food you ate isn't consumable by the signaling bacteria in your gut, it will release hormones that make you feel hungry.",
            "Yeah. Imagine being 5\"2 and only being allocated the portion of a fucking rabbit to stay skinny",
            "Yup- I’m 35F and it’s a daily fucking struggle. God help me if a enjoy a damn fry once in awhile",
            "I stay thin with stress and anxiety!",
            "Yup diet and exercise. I only go to the gym so I can have a little treat without gaining 5 pounds. It sucks sometimes but that's life right?",
            "Yes, I'm a woman.  It's an hour by hour struggle. Snack time is always on the table in my mind,  and it feels like my brain has a constant scrolling ticker running at the bottom of all my thoughts, suggesting possible snacks, why it could/should be snack time,  what's in the pantry,  why I should order grubhub..... it's constant.",
            "I'm a 44 year old man. Have never paid attention to what I eat. I eat junk all the time. Have always been thin. I do notice that when I eat, I don't eat as much as most people. I actually don't like being over full. I eat until I'm not hungry anymore instead of eating until I'm full",
            "I find I just have to pay a little attention so I'm not being gluttonous hahaha. I don't obsess over my weight whatsoever, I was underweight my whole life up until probably 50 or so but now I do notice that if I stop paying attention my pants are all too tight at the waist in a matter of weeks. It's a new thing to get used to.",
            "I’m 30 and I’ve had to do that pretty much all my life if I wanted to be skinny. I never had that 30 year grace period where I could eat whatever I want",
            "I have the ultimate super power of being able to eat anything at any time and never get fat.",
            "I do. I am in my late 30s. I eat healthy, no junk food, no food a couple of hours before bed, and daily cardio (Beachbody). I am 5’2” and weigh 108 lbs. \n\nWhen I let go and start eating ice cream here and there, eat before bed, and/or skip workouts, I gain weight very quickly and don’t fit in my clothes. I am much happier when I fit in my clothes, so I don’t mind not eating ice cream and working out every day.",
            "I am thin man and I can confirm I'm always hungry. But I dislike eating, and the hunger just doesn't bother me enough.\n\nTrying to stay thin when you enjoy eating/food sounds like torture to me. I'm grateful it's not my case",
            "I’m 48 and thin. I watch what I eat but I also eat what I want. I try to not bring home junk food, if I eat it it’s not at home. I also stay pretty active hiking and stuff. All of it help’s because thin is not in my particular gene pool so it’s work",
            "No, I just created a healthy lifestyle and stick to the same eating and exercise decisions day in and day out\n\nI don’t think about it because it’s second nature to me to eat well and work out",
            "I just use the ADHD cheat code and forget to eat for a day or 2.",
            "Hi! I’ve been a trainer for 10+ years and have worked with people of all shapes and sizes. Here’s what I know:\n\nNaturally slim people don’t think about eating very much at all. In fact, they tend to skip meals quite often and have to remind themselves to eat. They don’t particularly care to indulge, and the size of their meals are what you or I might consider a snack. They seldom finish their meals as they get full quite easily, and they take forever to eat the 3 bites of food in front of them. They over-estimate their intake by quite a bit. \n\nNaturally larger people are the opposite of this. They will eat larger portions, and tend to think they’re eating healthy (like with a salad) when they are grossly underestimating the total fat/calories in a meal. They seldom stop eating before their plate is cleared (except maybe around others), and they eat quite frequent, calorie dense meals. \n\nI get told by thin clients that “omg I ate so much yesterday” and that “so much” ends up being a bite of cheesecake after dinner. Thicker clients will say “I didn’t eat much dessert. I only had one piece.” Perception is a MF. \n\nTl;dr — yes, you’ll have to watch what you eat forever (me too).",
            "My advice: find an active activity/hobby that doesn’t feel like a boring workout.",
            "44F\n\nWait until you’re in your 40’s. The fun doesn’t stop for women.",
            "41 here, and it really hit me at 39/40. I am really active and in my 30s the activity kinda was enough to keep weight off. I ate healthy food but as much as I wanted. Now, I literally average 50 miles running a month* and have to watch how much I eat. I try to avoid fast food, and I now feel sick when I eat too much salt in one sitting, too. Alcohol takes forever to process too. Hangovers are like 3 day affairs. \n\nYayyy, 40s, lol. So if you're liking the 30s changes, just wait 😅",
            "Yes, I'm hungry and uncomfortable a lot but I want to be able to continue to fit into my clothes \n\nThe worst is trying to get that balance of not being so hungry you can't sleep but not eating too much either so that you put on weight",
            "I think it depends per person. If I want to be a normal weight (F) I have to really restrict. I do workout every day (cardio 5-6 days a week and lift heavy 4 days) but I have to consciously not eat and be hungry to maintain a normal weight.  But others I know are naturally thin and don’t think about it or have to try.  It’s a lot on genetics in my opinion.",
            "No...food is not a priority. So much so my wife has to remind me to eat",
            "For ppl who diet and still feel hungry, does your body not get used to the new lifestyle? I’m 27 but the way my lifestyle is now I eat usually 2 meals a day, maybe 3 if I worked out extra hard. But I rarely ever feel hungry. Sometimes I eat simply out of the routine but there’s days where I’ll only eat dinner and don’t even think of eating until then",
            "[deleted]",
            "I’m 5’11. I was 155 most of my life until I reached the age of 30. Then I popped up to 195 without realizing what was happening. I started tracking my calories around Christmas time and started being sensible about how often I snack, and what I choose to eat. I am down to 175 now by making simple changes. I don’t go extreme like some people do, in fact I still eat fast food 3-5 times a week, I just am mindful of the calories I get from there. I also allow myself only one soda can a day,",
            "I’m 34 and starving myself with Semaglutide to finally lose weight. I think I’ll be obsessed with food the rest of my life.",
            "Um... yes. I'm 36F and had my weight creep up into the overweight BMI category in my late 20s. I lost 35 lbs and am a pretty stable size 4. That said, I'm training for a marathon (running about 7 hrs a week now) and still need to be diligent about what I eat in order to not gain. \n\nI mostly stick to veggies, fruit, nuts and protein, and avoid sugar, dairy, alcohol, and grains. Like you, I LOVE food. I was in the very bad habit of treating myself to a baked good after long runs earlier this year, and a drink to end the workweek; I gained 10lbs really easily. \n\nI think many thin people are just not particularly food-oriented, but for the rest of us, we need to actively choose our way of eating and exercise for the body we want or are comfortable with.",
            "im a man. i think it’s normal for people to always think about what they eat especially once they grow a bit older. \n\nyour body doesn’t have the metabolism or gifts of youth anymore. and diet is INCREDIBLY important.\n\nif it begins to impede on your mental health then it’s a problem. and you shouldn’t bar yourself from eating some treats every once in a while.\n\nalso if you live in the western world it’s doubly harder. so much of the food around us is processed junk it’s an active effort to avoid it.\n\nwhen i’ve lived in other countries where the majority of food is just ingredients relatively farm to table it’s been SUPER EASY. i don’t even think about it. it’s just so much easier.\n\nbut walking into an American grocery store and i have to think all the time. \n\nalso if you struggle with volume (you want more than the normal portion size) you can work around it. leaner foods with less oil for example. i love roasted vegetables. i eat those a LOT. fruits are high in sugar but whatever. unless you’re diabetic just consider the calories. be careful with avocado and coconut but everything else go crazy. starchy carbs like rice, and breads…. well you’re going to have to watch out.\n\nketo options tend to be super low calorie. they don’t taste as good tbh.",
            "Yes. Constantly keeping a running tally of daily calories in my head. Trying to eat mostly produce.",
            "When you start looking at food as fuel for your body instead of what looks best on a menu or feels indulgent, it’s a lot easier to make the right choices",
            "Not if you’re very active. I know multiple guys who work physically demanding jobs, and they eat 2 Big Macs and at least 6 beers every single day. They are skinny as well. \n\nPersonally I’d describe myself (32 M) as moderately fit, and don’t really pay attention to what I eat. I just kinda got in the habit of making sensible decisions.",
            "It gets way worse after menopause. Im a 55 year old woman.",
            ">literally all the time?\n\nNo. \n\nMost people who exercise regularly do think about what they eat, but not nearly as much as you see to think.\n\nIf you're staying active you don't have to agonize over every calorie.\n\nAlso, if you're thinking about your diet as much as you say, that may be causing problems itself. Stop stressing so much, stay active, eat whole, unprocessed foods, and you'll likely be fine.",
            "I always think about what I eat and how it will affect me. If I don't, I would be fat.",
            "[deleted]",
            "Yep - and no one warned us :/",
            "How do people not think about what they eat all the time? I don't even consciously do it. It's just instinct to me.",
            "What makes one person \"thin\" is going to be vastly different than what might make another person \"thin\".  There's so many factors.\n\nBut for me, I'm a 38 y/o female.  I'm 5'5 and 125lbs.  I have to be careful, but it's not a 24/7 challenge as you make it sound.  I can't eat *anything* I want, but I'm definitely not skipping dessert after a long day or my brown sugar latte on my mornings off.  I probably work out twice a week on average. (some weeks more, some less)\n\nBut the thing is...I've been active my entire life. Started sports in the 4th grade.  And I have a weird job and eat at weird times throughout the day.  Sure, I might have pizza at 3am on one shift.... but I might also go 12 hours without eating anything the next.  I was at my heaviest when I worked normal hours and ate on a schedule.  I don't think our bodies are meant for routine.  I also don't snack throughout the day.  There are no chips/crackers/etc in my home.",
            "I don't. I don't drink any calories ever (I only drink black coffee , water, and sparkling water) and don't eat any sweets and for the most part. I tend to eat lots of fish, chicken, green veggies, beans, and potatoes (baked sweet potatoes r my fav) my BMI floats in the 22-23 range.\n\nIt sounds like your problem might be in refined carbs. It's too easy to overeat rice.",
            "Sort of? Mostly I eat healthy so I don’t have diarrhea. Gross, but true.",
            "Whatever you eat eat less.\n\nIf you order large get medium, if you usually fill a plate fill 2/3rds.\n\nDon't eat completely arbitrary meals.\n\nDon't eat when you aren't hungry.\n\nEat the vegetables first, carbs last.\n\nLet food go to waste, if you eat it all, all the time, you'll never recognise that you're serving / ordering / making too much.\n\nDrink lots, of water.\n\n30+M",
            "I stopped giving a F.",
            "I think you should keep a food journal for a couple of weeks and then contact a dietician.  Your stomach should not always be grumbling. Be honest at what you are eating and when. Even if you taking pics of the food would be good.",
            "My whole life I was underweight. People accused me of having an ED but I was just naturally thin, Didn’t crave enough calories, and had a super fast metabolism.\n\nI worked really hard to put on weight in my early 30’s bc I got tired of having no boobs and butt. I hit the gym hard with weight training and forced myself to consume extra calories to put on weight.\n\nWell I finally broke through and hit a “normal” weight range. Except now I’m struggling just like everyone else to stay at a healthy weight and not put on too much.\n\nMy tummy is my insecure area. Most my life you could see my hipbones and ribs (again not saying that is healthy, I was super underweight) but now I’m struggling with my waistline fitting into my pants despite the legs fitting. \n\nI do have to watch my diet and force myself to exercise where I never had to before.",
            "155lb man here.  I couldn't gain weight if I tried.  I hate eating, I only eat because I know if I don't I'll feel tired and miserable.  Doesn't matter if it's boiled carrots or McDonalds, I have the appetite of a 7lb cat.  \n\nI keep telling doctors this, but all they do is sarcastically quip \"oh lucky you!\" and assure me this is all perfectly normal.",
            "Nah I eat whatever I want.  \n\nMetabolism doesn’t decline until your 50-60s, so as long as you stay active you’re good.\n\nMost 30 year olds are less active than in their 20s, so they get fat. Has nothing to do with metabolism or aging.",
            "I'm in that age range and it took almost a year to get used to it, but I've found that eating nothing during the day (no breakfast, no lunch, 2 cups of coffee plus cream and sugar) lets me eat anything I want at night and maintain my current weight.  \nNow that I'm used to it, I don't feel hungry during the day UNLESS I eat something like when people bring crap into the office.  \nAlso, if I want to reduce my weight from here, I can cut soda from my eating habits (I drink 2 most nights) and that will allow me to lose about 1lb per month, reliably.  \nJust an easier way to manage weight without constantly denying myself. OH and weekends are free for me to eat anything any time as well, but I find I skip breakfast and lunch those days as well just out of habit now.  \nAt the end of everything, though, it remains true: the best diet is the one you will stick to.",
            "No. My wife is in her 30s and has awful eating habits. The women in her family were just blessed with a low appetite.",
            "Yes, absolutely. This is scientific by the way. If you are “thinking” about it and are still gaining weight, there is a nutritional and biological reason for that. You’re doing something not conducive to maintaining and you just don’t realize it. There isn’t anything mystically causing people to gain weight automatically without eating over their BMR. \n\nA lot of it is just that diets that are really promoted by the food industry aren’t very healthy because the healthiest diets won’t result in the greatest profits. So, a big part is just that people think they are eating in a way that will avoid weight gain when they actually aren’t. \n\nAlso, the old saying goes that you can’t out-exercise a bad diet, BUT people are by and large having a more sedentary lifestyle which sure doesn’t help.\n\nMy advice is talk to a scientist about what foods you should be eating. Don’t google articles or ask random fat people on the internet (nothing wrong with being fat btw, but fat people aren’t experts on how to not be fat). Go sit in a room with a nutritionist with a successful track record and have them teach you about food.",
            "I am in my 40s now, and it has only gotten harder. I work out for about 1.5 hrs a day for 5-6 days a week and eat a very healthy and balanced diet and make 90% of my meals. I still struggle with my weight. As women age, our hormones dictate our ability to lose weight more than anything. It might be time to get your hormone levels checked.",
            "No, not necessarily. For better or worse, some have a high metabolism or what we call in our family being \"whippets\", i.e. you can eat whatever you want all day and never gain weight. There's members in my parents' generation who've never weighed over 60 kg in their lives - super fit, eat constantly. It's genetic, and it's not always all it's cracked up to be."
        ]
    },
    {
        "post_id": "bhghxt",
        "author": "GCXAccount",
        "title": "Why don't people put the TLDR at the top of their posts?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/bhghxt/why_dont_people_put_the_tldr_at_the_top_of_their/",
        "score": 20982,
        "num_comments": 1112,
        "created_utc": 1556241531.0,
        "selftext": "It would save a lot of useless scrolling.",
        "permalink": "/r/NoStupidQuestions/comments/bhghxt/why_dont_people_put_the_tldr_at_the_top_of_their/",
        "comments": [
            "People are saying spoilers, but that could easily be solved >!by using a spoiler block!<",
            "As you are scrolling towards the TLDR you get to know how long the actual post is, so you can make up your mind if you want to read the TLDR or the post is of acceptable length to be read.",
            "Because then it could be a spoiler for those who do want to read the whole thing.",
            "If it was at the beginning, it would be “Too Long; Won’t Read”",
            "Because then it couldn't stand for \"too long; didn't read\". \n\nIt would have to be TLWR and that just looks dumb. Of course, are they sure it's too long by then? I don't know. What a serious dilemma. It seems easier to just leave it.",
            "Because they want you to read the post",
            "I feel like it's a bit of a spoiler for ppl who do want to read. Or, if ppl are actually skipping it all, they would stop to read the TLDR at the bottom. \n\nIdc where it's put tbh, so long as it's there.",
            "TL;DR at the beginning is called BLUF (Bottom Line Up Front).",
            "Cause you still have to scroll through it to get to the comments so it doesn't save shit.",
            "Oh god I HATE when people do that. Ruins the whole story.",
            "You know you can just not read it if it's too long, right?\n\nLike, too long; didn't read?",
            "A lot of the time it acts as a punchline, like \"TLDR I didn't get laid that summer\" - for a story about how a kid got bitten by a dog on his dick or something.\n\nFor me, it's a way also to express \"I'm sorry I know that was a long story, this is the gist of it\", but I still would want someone to read the story - why would someone put a lot of effort in writing something just to assume someone will read the first line and scroll past?\n\nAlso its like how a conclusion of an essay drives home the points. It's meant to reiterate the major facts of a good story or a bunch of info, not introduce them.",
            "Anyone who writes it obviously wants it to be read fully. So as a token for his efforts to write it he puts it in the end so that people who want to read it fully get the first go. Also because it only takes one swipe to get to TLDR.",
            "It's unnecessary in the first place and annoying",
            ">!hi I’m just trying to test the spoiler thing on mobile!<\n#and this one!",
            ">!I hope this works and I can!< trump >!all the other comments, this would be good cause I'm definitely!< guilty >!of being careless with stuff like that. If this doesn't work I'll look like the!< president >!of the dunce club. This would be handy to stop all this!< collusion >!with people trying to spoil endgame for other people, idc if it's mind blowing like they end up having!< sex with a cat >!or something, I DON'T WANT SPOILERS! NO MATTER WHAT THEY!< PUTIN >!THAT FELINE! Anyway that's all, I hope this works on!< mobile. >!Thanks reddit!< Peace. >!✌️!<\n\nEDIT: *put in",
            "Not to mention I have never looked for a TLDR I just didn’t read it.",
            "Can we also start a “Too Boring Dont Read”",
            "Presumption of a good faith attempt at reading before deciding it's too long and scrolling to the bottom for a summary. \n\nThis lets people who are interested in the subject read through normally while those who aren't don't need to worry about what they'll see by scrolling to the end.",
            "I always put a TL;DR at the end of my posts as a courtesy, because I consider myself civilized. But I don’t read them myself, either the first paragraph of your story grabs me or it doesn’t. \n\nPutting a TL;DR is for me the equivalent of wearing clean underwear.",
            "It's actually a preemptive response because you expect someone to respond, \"too long didn't read\" when you post a large block of text. \n\nIt's like adding \"inb4\" at the end to deal with some obvious thing people are going to respond with.\n\n*Inb4 someone says too long didn't read.*",
            "It's a summary, not an abstract.",
            "People in the US military do something similar in emails and memos; it’s called BLUF (bottom line up front).",
            "Because it would be a too long won't read, instead of a too long didn't read",
            "This makes sense. TLDR is basically an executive summary. They're at the start.",
            "I wish people would specify tldr is at the bottom at the top.",
            "Both sides of this argument make sense. It would spoil it for those wanting to read it. I just wish the poster would make the TLDR stand out somehow if they put it at the bottom. Like, make it a bold **TLDR** or something. Nevertheless, >!don’t let this debate distract you from the fact that in 1966, Al Bundy scored 4 touchdowns in a single game while playing for the Polk High School Panthers in the city championship versus Andrew Johnson High School, including the game-winning touchdown in the final seconds against his old nemesis, Bubba “Spare Tire” Dixon.!<  \n#####TLDR: Everyone wins in this argument!",
            "I put them at the top, maybe I should post more",
            "From my experience, when I start reading a post and get through some of it and see there is still a lot more text and the post isn't even that good in the first place, I will scroll down through the rest of the post because I already invested the time into reading a portion of it so I want to know the conclusion of the post without having to read the rest of it. \n\nTL;DR I started reading, got bored, still want to know how it ends.",
            "Isn't that what the title's for?",
            "Spoilers",
            "If the TLDR is not on top, I send it back.",
            ">!test!<\n\n>!yay!<",
            "IMO it should be at the bottom.",
            "It's right next to the comments when it's down at the bottom.",
            ">! What is this !<",
            "Because nobody will read further if it dull or sad topic",
            ">!because we like reading whatever is typed first!<",
            "Because they haven't formulated the TLDR until they've written the whole post.",
            "Because most normal people will scroll to see how long the post is. If it happens to be to long sometimes you'll skip it. Other times when youre lucky you'll get tl;dr because thats exactly what you did.",
            "Because tl;dr stands for Too Long; Didn’t Read.  \nNot for Too Long; Won’t Read.",
            "It spoils the story for people who want to read the whole post.",
            "Cause people add the tldr after they've finished writing the post.",
            "In the military, we do.  Except we state is as BLUF, bottom line up front. \n\nSo it would go,\n\n*Good morning,*\n\n*BLUF: Bathrooms are closed until we find out who has been shitting on the floor.*\n\n*Details: Over the last three weeks, the men’s latrine in bldg 203 has been found with feces on the floor [etc etc]*",
            "In my experience on Reddit, the TL;DR is usually used as a  way to sum up the post and get a laugh, as opposed to a more factual summary.  After you already know the story, here comes a clever punch line style way of summing it up, rather than a point by point retelling of the story. That, and people are egocentric. Whether deliberately or otherwise, someone put time and effort into the post, so people assume you will want to read the whole thing, so that comes first.",
            "Cuz then it would be TLNGTR",
            "I commend anyone that puts the tldr at the top. They are angels that need to be preserved",
            "!I don't know if this will work on mobile!",
            "099⁹9acX 9z  s992g",
            "If you want to read the whole thing without being spoiled in 1 sentence, having it at the top is annoying.",
            "Please excuse my ignorance but what does tldr stand for?",
            "Because its spoilers for those that wanna read the whole thing",
            "Why don't you put a conclusion at the top of an essay? Also nice repost",
            ">!test!<",
            "You're on a website centered around discussion. Go back to snap chat if you're too lazy to read.",
            "tldr: you should not have said that\n\nWhat the fuck did you just fucking say about me, you little bitch? I'll have you know I graduated top of my class in the Navy Seals, and I've been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I'm the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that's just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You're fucking dead, kiddo",
            "Congrats on being young, unmarried and unable to sense passive aggressiveness as if it were a sixth sense.",
            ">!test!<",
            "<!nani!>",
            ">!test!<",
            ">!This is so cool man!<",
            "TLDR is a resume and is easier to resume something after is finished.",
            "I think Too Long Didn't Read is what the person looking at the post, not the poster, says.",
            "Most people don’t want the story spoiled. It’s not that hard to scroll to the bottom and just read the tldr. People write posts so they can be read, it just doesn’t make sense to spoil the whole thing at the beginning. Also, when I write a long post I like to write the tldr after so I can recollect my thoughts. It’s just a preference thing. I’ve seen a tldr at the top before but I didn’t like it because I already knew what was gonna happen in the post.",
            ">!test!<\n\n>!Edit: OMG IT WORKS!<",
            ">! Testing this out!<",
            "It's even worse when they put the tldr at the bottom and then add a really long edit: at the bottom so the tldr us in the middle of the wall of text.",
            "!boom!",
            ">!bruh moment!<",
            "People naturally conclude stories at the end of them. a tl;dr is basically a summary/conclusion, so it naturally comes at the end.",
            "I usually do. If someone reads TL;DR but doesn't want to be spoiled, they know to just skip to the next paragraph.",
            "We should just start a TL;WR for the beginning: Too Lazy; Won’t Read.  It’d be nice.",
            "Because you scroll down to see if it’s TL, when you get to the the bottom if decide DR you can just read the TLDR.",
            "My guess is a lot of people don't think out those kinds of posts, and they need to write everything out first before they can themselves give us a TL;DR.\n\nWhy they don't then move it up to the top of the post after that, probably just laziness.",
            "How could it be too long to read if you haven’t seen any of the text yet?",
            "because people try to use tldrs to be funny not as an actual tldr",
            "Because people who truly went tl;dr probably read few paragraphs before giving up and then just skipping here and there to spot key details and then heading towards the end for the ending. Without that attempt and giving up it's not tl;dr but executive summary.",
            "I always thought the idea is that you check the post, if it was too long, you go to the end!\n\nIf it was in the beginning, how would you know how long a post is?",
            "I just did exactly this!\n\nhttps://www.reddit.com/r/ontario/comments/bh6v5x/-/elt57x1",
            "I personally like them at the end because then I can scroll down to see how long the post actually is.",
            ">test<",
            ">!Test!<",
            ">!I wanna die!<",
            "So you have to read like a decent human being.",
            "Best thing about this thread >!learned a new trick!<.",
            "The world's an imperfect place",
            ">!test!<\n\nEdit: ah damn doesn't work\n>! Sorry ! <",
            ">!peepee!<",
            ">!test!<",
            ">!hello!<",
            ">!BUTTS!<",
            ">!spoiler!<",
            "!L!",
            "Usually for me it’s because I don’t realize how much I wrote until I get to the end.",
            ">!like this?!<",
            ">!test!<",
            ">!Hmm!<",
            "Would it be a TLWR (Too Long Won't Read) then?",
            ">!oof!<",
            ">!test!<",
            ">!spoiler?!<",
            ">! Blah !<",
            "Because they haven't figured out what they're going to say yet. And then they don't take the effort to go back up to the top at the end. And because they want people to read what they've written.",
            "I always say because it’s a “too long, didn’t read”, not a “too long, not going to read”.",
            "So they don't ruin the story. Normally they just put \"tldr at the end\" in the top for those that don't want to scroll.",
            ">!What!<",
            ">!Shrek dies in Endgame!<",
            "!pretty cool!",
            "Because then it would defeat the purpose of even having the full text, even though the full text was written for a reason.",
            "You don't scroll down to the comments?\n\nAlso: you should decide for yourself, glancing at the full text, whether you think it's too long to read. If you can't even be bothered to do even that, perhaps you shouldn't even read the TLDR, because now you're only lying to yourself.",
            ">!test!<",
            "I agree. If something was too long for me to read, why TF would I keep scrolling to the bottom?",
            ">!Test!<",
            "because then nobody would read the rest of the post",
            "When writing a long post, it's probably easier for most people to summarizing all their thoughts after getting them all on the page.",
            ">!Woo!<",
            ">!hi!<",
            "Some do, but not us.\n\n\nTl;dr: Not us.",
            "!test!",
            "Because I'd rather READ the story in its entirety rather than a snippet. Is scrolling SO HARD?! You lazy fucks",
            "!ohmygod!",
            ">!this is wild!<",
            "I'm not 100% sure but I have two theories that are kind of overlapping. I think people hope that it it's at the bottom people will read the story anyways, where when it's at the top more people will just choose to read the TL;DR, and I think that the posters think the readers will be more likely to comment because they've already scrolled down all the way to read it. But that's just what I've heard from people",
            "Because, as the lord said at the beginning of time, you must put the TLDR somewhere.",
            "If people didn't have time to read, then they probably came for the comments. TLDR being at the bottom puts it closer in relation to the comments.",
            "Cause there’s idiots like me that don’t know what it means?",
            ">!dickbutt! <",
            "I think in a way they already do, but they do it wrong. Reddit gives a very generous character limit for titles, but it’s become culture on here to use pointless, unrelated or click bait titles rather than giving a reader enough information to see if they want to click into the post.",
            "Why not both?",
            "<!5est!>",
            ">!spoilers!<",
            "! test !",
            "!test!",
            ">!oh!<",
            "That's an impressive level of lazy",
            "1) Some don't exactly know how will their post look when they start writing it. So after they organised their thoughts by writing them, they just write a little summary at the end and post - which is a lot easier then summing up an unorganised story before you write it out.\n\n2) They are just to lazy to copy and paste to the top.\n\n3) Noone would actually read the whole thing if they had it summed up neatly at the top. It could couse to have a lot of comments miss the post's nuance.\n\n3) Because the name suggests so.\n\n4) Because everybody else does it",
            "Because they want the tl;dr to be the punchline",
            "You don't learn that life is useless and pointless at the start of your life. You have to do a lot of useless scrolling to get to the bottom of it. Chalk the TL;DR phenomenon to human nature.",
            "What about people who don’t put it at all?!?",
            "so that people will think there is no TLDR and read the whole thing. basically a marketing scheme",
            "Cause then it would be TK;WR",
            ">!have a nice day!<",
            ">!shrek!<",
            "In the adhd sub reddit, it's done like that. Or recommended to, at least",
            ">!They Do!<\n\nTL;DR ... People do",
            ">!Lol!<",
            "This thread is like playing minesweeper. I’m just waiting to click on a spoiler block to find an endgame spoiler",
            ">!Spoiler alert!<",
            "My preferred use of tl;dr was the first reply to a post.",
            ">!did I get it!<",
            "The US military uses BLUF: Bottom Line Up Front which is exactly this.",
            "!This comment could have been endgame spoilers be careful next time m8!",
            "Because they dont think of it until the end. Usually they just type out everything that needs to be said and at the end think \"wow that's a lot\" so they put the TL:DR",
            ">! Testing if this is real !<",
            "What does tldr mean? I'm new to Reddit and there's like a while fucking culture and language to this shit and it's mind boggling. How do y'all keep up with all these acronyms?",
            "Because it's easier to write a summary after you've written the full version, and it's just as hard to scroll up as it is to scroll down.",
            ">!yeet!<",
            "!pussymuncher!",
            ">!hi!<",
            "!try!",
            ">! Wow !<",
            ">!thespanishinquisition!<",
            "!boo!",
            "The TLDR can also work as a quick recap",
            "Endgame spoiler: DO NOT CLICK\n\n>! I told you not to click !<",
            "This >! Is so fun !<",
            ">!shrek dies in the end!<",
            ">!test!<",
            "Because the D is Didn't.",
            ">!test!<",
            "Because people are too fucking lazy. They'll most likely ask reddit to add a TL;DR tab.",
            "Wouldn't it become TL;WR for Too Long Won't Read?",
            ">!juicy testicles!<",
            "If the TLDR is at the top and spoils the story then Im not reading it after that, and the poster may as well have posted just the TLDR alone. \n\nFor those that enjoy these often lengthy stories having the TLDR up front ruins it, and those are the people these posters are writing these longer stories for.",
            "!huh!",
            ">! This is a test. !<",
            "Because less people would actually read the post. For example, if it is on /r/tifu, the post is telling a story. If you put summary (with ending) at the beginning, I'm less motivated to read the whole thing because I already know what happens.",
            "Because then it's Bottom Line Up Front (BLUF).",
            "!test!",
            "So people can scroll through and gauge for themselves whether they’re bothered to read without spoiling the reveal. Or because they can’t use the spoiler label.",
            "TLDR",
            "This is such a not stupid question",
            ">!test!<",
            "!test!",
            "sometimes you don't realize how long your post will be until you reach the end and it comes naturally to just write it there\n\nalso it's tradition, using the spoiler function is extra work, can't know if it's too long for some users but not others etc.",
            ">!sex!<",
            ">!dogs!<",
            ">!thanks!<",
            "What does it mean?",
            "I did that once...I got complaints that I didn't know what a tl;dr was because people though the entire post was the tl;dr not just the first sentence/paragraph",
            ">!testing!<\n\nOHH \n\nYou also need to do > and < before the ! \n\nAlso it just says testing"
        ]
    },
    {
        "post_id": "ye3hj2",
        "author": "None",
        "title": "Do any of you ever google a question and add “reddit” after the question because surprisingly reddit will get you straight to the answer rather than having to go through an annoying spammy website?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ye3hj2/do_any_of_you_ever_google_a_question_and_add/",
        "score": 20961,
        "num_comments": 1093,
        "created_utc": 1666804614.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/ye3hj2/do_any_of_you_ever_google_a_question_and_add/",
        "comments": [
            "It is apparently a widely common practice.\n\nhttps://dkb.io/post/google-search-is-dying might be of interest.",
            "Sometimes, yes. Depending on the topic, reddit discussions can be much higher quality than some random website.",
            "site:reddit.com all the time",
            "This has become a recent strategy of mine and I would say it has yielded fantastic results. Obviously, it doesn't work for everything. One example of it being good for me though was when I was recently trying to figure out a coding issue. I feel like a boomer when it comes to this kind of stuff and the coding message boards were no help, but Reddit gave me an answer. \n\nI just feel like when you read an article about a product, you never really know where the author's funding is from. With reddit, there usually isn't any incentive to share dishonest thoughts about such mundane things. Keep in mind that I am talking about small potatoes stuff. I'm not basing political or religious opinions on what I see here.",
            "I do that a lot when looking for reviews on something I'm considering purchasing, especially when comparing between two or more things. Nearly every review site feels like a paid for infomercial, and amazon reviews haven't been reliable for years. That's not to say reddit is above astroturfing and fake reviews, it's not, but as far as I know they don't actively suppress negative opinions, yet. And there is always someone quick to point out alternatives to whatever is being discussed.",
            "Literally every single time I type of a question into Google, that's what I do.",
            "Most of the time. Many time the first page is full of web thats gonna have min of 1500-3000 seo-ish words + lots of ads just to get to one simple line of answer.",
            "Yeah I tend to get answers from reddit, the way I see it is you'll know you're getting the right answer on reddit because if you're not then *someone* will correct it",
            "\"why does my ___ look like this\"\n\nad upon ad upon ad for unrelated health \"solutions\"\n\n*goes to images*\n\nunrelated crap including peoples facebook pages\n\n\"why does my ___ look like this REDDIT\"\n\nexactly what i need with specifics in the description in the first few results",
            "YES.\n\nFor the reasons you suggest AND, it increases the odds of finding the information in text instead of buried in a 5 minute video.",
            "Yeah google isnt that great anymore",
            "Yes because Google is trash",
            "Often, yes. Because Google isn't really there to give you the best or most popular answers anymore like they used to be, now it's about getting you the answers that make their partners money and by extension make them richer.",
            "For example i type \"reddit *niche thing*\". So no i type it before a sentence fragment",
            "I used to do this until I came across a topic I knew about fairly well and realized people just agree and upvote what *sounds* plausible even if it’s wrong",
            "Thats a great idea because often the reddit answer is correct and three sentences long!",
            "It depends on the topic, but 99% of the time yeah I'll do this. Especially if it's to do with troubleshooting something technology or game related. \n\nHad an issue with an Xbox headset the other week that 2 pages of Google couldn't solve. Added Reddit to my search and the solution was in the first result",
            "I tend to use this when checking if a site is safe. I know I won't get tricked on here 99% of the time because most redditors are good people",
            "Negl, I do this all the time… unless it’s medical, then I call my mom.",
            "I worked in IT for three years without a degree or formal training. Google and Reddit were my best friends. Nearly everything I needed to figure out I typed, \"reddit\" afterwards.",
            "[deleted]",
            "Yes.\n\nEvery question in this sub that starts with some variation of\n\n>do any of you ever\n\n>does anyone else\n\ncan be answered with the word, \"yes\".",
            "Yes",
            "It's less about reddit being right, and more so the dozens of SEO websites that are frequently filled with misinformation",
            "It's the only damn way now",
            "Yes",
            "I joined Reddit because all the video game questions I had were answered here.",
            "Question site: [reddit.com](https://reddit.com)\n\nadd the subreddit address after to be more specific",
            "That's how I discovered Reddit",
            "Redditors will turn a question into a huge joke which I find really annoying.",
            "That or Quora. Reddit's better for finding general knowledge, while Quora is more likely to point you to an actual expert opinion.",
            "Depends on the topic. For gaming questions, definitely.",
            "All the time.",
            "Also, Reddit is broad variety of random ass information.  Like I can look up info on ant colonies, masturbation techniques, recreational drug use ideas...",
            "I don't add just the word \"reddit\" to my search.\n\nI add \"**site:reddit.com**\" or \"**site:reddit.com/r\\/askreddit**\" to my search so Google only checks reddit.com.",
            "No. I prefer facts and credible sources.",
            "Yes, I hate wading through paragraphs of bullshit just get to a one sentence answer to my question.",
            "Google is dying as a browser. A lot of young people rather use tiktok as a browser because the results are made by actual people instead of the SEO crap articles that are in the front page of Google (plus the adds)",
            "Very often.",
            "Yes",
            "All the time",
            "Constantly, and google’s search of Reddit is always more thorough that Reddit’s search of itself.",
            "If you want to include other forums too then add this at the end (OR should be in caps):\n\n (reddit OR forum)",
            "Depending on the topic, for coding I prefer stackoverflow or github, but for the rest of the topics I look into reddit and youtube",
            "I do this all the time",
            "Not only that, but also if I want to read other people's opinions about a book, film and so on.",
            " Almost exclusively, very rare that I’m looking for something and I don’t consult Reddit first",
            "Always",
            "I frequently add the phrase site:reddit.com to the beginning of many of my google searches.",
            "I do that!",
            "Google search is so bad now - this is actually a life tip.",
            "no",
            "YES! Frequently and regularly. Medical questions, reviews, all of it.",
            "I do this almost all the time",
            "I frequently do this if I'm looking for peoples opinions on a product,  website, etc. \nGranted you have to take it with a grain of salt, but if most people are saying it's crap I avoid said product or service.",
            "WhY dIdN't yOu JuSt GoOgLe iT???",
            "I do it so often google remembers to suggest adding reddit at the end of my every search 🙃👎🐆🐴🦦🦶👆🖕🤨",
            "For niche interests, yes. For normal stuff, no.",
            "I often Google stuff that leads me to Reddit threads that haven't gotten a definitive answer either so it doesn't often help me. But yes.",
            "I do it all the time. I don't think it is because reddit necessarily has the correct answer. I think there are 3 reasons for this and it is merely speculation on my end. 1. Humans are social creatures and often times seeing the answer come from multiple reddit posts helps to reinforce our own answers or at least makes the answers more socially acceptable in our head. 2. It leads to an answer faster than scrolling through those damn blog posts. Bro, I just want to know if a certain gpu is better than another, not how you grew up and how your dad taught you everything about gaming and how it has affected you in your adulthood. 3. Its related to 2 in the sense we like instant gratification, specially now that everything else happens instantly on our phone, I don't want to go through all the trouble of getting the right answer. Someone just tell me.",
            "Every single time",
            "Yes if it's about anything mildly controversial or illegal.",
            "Yep , google search engine sucks at finding answers those days",
            "I've set up Chrome to automatically add \"site:reddit.com\" to my searches when I start them with \"reddit\"",
            "I do it because because for better or worse if I'm purchasing something a review from a redditor will probably be more useful than the review made by the freelancer who was given a prompt and told what to say about the product. Neckbeards have very high standards and even if they trash it you at least can compare their cons to easily verifiable pros listed on the products own site.",
            "Yes. Even if websites are made with the best of intentions, often articles are written by a single person with their own biases and limited experiences. It can be better to find something from reddit where many people can come together and you can see what most people think about the topic.",
            "Google always recommends me reddit after a search and I often click that one",
            "Pretty much exclusivley, yeah. There's a subreddit for everything.",
            "I do this often. I want a nuanced explanation from a user who experienced a similar issue I did. I’d prefer that to a generic article from a third party that does not know the context of the problem I’m facing",
            "Yeah. Most of the time my Google searches will bring up what reads like a copy-pasted article fluffed up with unrelated content and full of Amazon referral links. If I can find a thread about it on Reddit, then I can find a discussion where people talk about what worked for them/what's true in their experience and when someone posts something false, there's usually downvotes or replies correcting them.",
            "ALL THE SAMN TIME. The search bar now adds it all on its own.",
            "I do this often. Reddit is such a hive of useful information",
            "It's the best place to find out about Abraham Lincoln's role in the creation of the Internet.",
            "Seo kill internet",
            "It depends on what I'm looking for. I do generally try Reddit but I find that a lot of the questions that I'm looking for are either not answered before, or answered incorrectly.",
            "Ok but seriously shut the fuck up and don't tell other people about this. If the SEO assholes catch on, we'll have every single \"X Reddit\" search getting slammed with Reddit posts that are gamed to the top. \n\nI've already seen certain recipe websites spamming food subreddits, and despite average-to-lower upvotes and comments, their posts have really high page rank Google.",
            "All the time.",
            "Companies use SEO in order to get their ad plagued drivel to the top of google. Adding Reddit gets you legitimate conversations. \n\nThe new generation have begun using TikTok instead of google (it works surprisingly well, I’ve tried it). \n\nGoogle has taken note of this and are kind of in a panic, and redoing their whole results. I think they’re pushing video answers to the top. I personally don’t want video answers for my google questions, but we’ll see how this evolves.",
            "All the time now, largely because google is awful.",
            "Anytime I google search anything now, I put “Reddit” behind it.",
            "Yes. Ive also begun to consider switching to bing or duckduckgo. Google search results I feel like have been taking a huge nose dive in quality. Also not sure if I was a trial person, but they changed how you click on the images tab and instead added a bunch of BS options to expand the search. I ended up having to scroll to the right to get to where I can select images. Wtf is that??",
            "Literally all the time. The way I see it is that there is a community for everything on Reddit and if you have an issue someone in that community either has had it before and posted about it or you can make a post and they'll figure it out.",
            "The same reason why people look for things on TikTok instead of YouTube. You don’t gotta deal with extra BS",
            "yup",
            "Yep and always \"-Pinterest\" when searching for images",
            "Yes, I actually just did this today to look up a video game question.",
            "All the time. Best way to get quality answer fast.",
            "Too bad reddit's search feature is garbage.",
            "All the goddamn time",
            "Every fucking time.",
            "Honestly I just add a Reddit tag to every Google search and take it from there.",
            "Depends on the question but yes. Other times it's Quora or NYT or Stackoverflow that I tack on.",
            "i didn’t need to be called out like this",
            "Lmao yes",
            "I always do that for tech questions, it's easier that reading through mile long arguments on forums. Plus why would I when one incredibly knowledgeable turbo furry already wrote me an essay on my specific glitch on Reddit.",
            "Type into google:\n\n    site:reddit.com \"search phrase\"",
            "What are you guys searching that will only have an answer by searching reddit?\n\nI have maybe had 1 or 2 things that a reddit search helped, but in the end it was my own stupidity. Like, \"why isn't the quest advancing? oh, because I'm looking at the wrong step like this other dummy on reddit.\"",
            "Actually, I type it before the question and i use \"*site:reddit.com*\" + my question, which is a Google way to only show results from that site. Sadly, many non-reddit site have the word \"reddit\" in their article, so that method is preferable in my opinion.",
            "Only if I want opinions. Reviews of a specific product, fan consensus on a movie or TV show, fan theories, recommendations. Pretty much anything in the realm of \"subjective,\" Reddit is going to give you better information than Google will return on its own. You can find good objective information on Reddit too, certainly, but it requires more digging and fact-checking.",
            "My literal advice for anyone with ANYTHING “just google it and add Reddit!”",
            "Yes. All the time. Because Reddit (largely) is composed of people who know (rightly or wrongly) things instead of bots. If I google afternoon tea, and click the first result, the article be like “afternoon tea is a great pastime that can be enjoyed with friends. For answers to your questions about afternoon tea, look no further! Afternoon tea is afternoon tea. Afternoon tea can be purchased at xyz and is the perfect afternoon tea.” Like it’s NONSENSE. So some redditor’s anecdote about tea at their grandmas house is objectively more helpful because it’s not just random nonsense created by a bot to generate ad revenue.",
            "I thought I was the only one",
            "but also using the reddit search doesnt work quick right so you still you google but put reddit at the end. Yes",
            "No, I do the opposite. I don't want any answers from reddit.\n\nDo this experiment - go find a few popular threads on a topic that you happen to be an expert on. Then look at some of the top upvoted comments. That should tell you how completely full of shit most redditors are.",
            "I'm working towards a degree in comp Sci and the amount of times this technique has helped me solve some obscure problem 3 ppl including me have had in the past 5 years is both hilarious and sad.",
            "Weirdly enough an answer from a common redditor is more trustworthy for me than someone famous with a website full of ads.",
            "Yeah especially if I wanna check people's personal experiences with a product.",
            "I've spent so much time here, reddit is usually in four out of five top results anyway when I phrase the query as a question. The fifth is either Quora or those old Gamespot forums from like 2007 if it's a gaming question.",
            "I’ll google it and then click the Reddit link.",
            "Somehow googling with Reddit in the search terms works a lot better using Reddit itself. \n\nThey need each other.",
            "Short answer? Yes.\n\nLong answer? Yesssssss.",
            "So many people ask Reddit instead of Google for the human interaction aspect as well. Even more so the last couple of years. \n\nOnly for some dickhead to say “A quick 2 second Google search would’ve answered your question”, reminding the querier why he has been avoiding human interaction for so long.",
            "almost always",
            "All. The. Time. Especially if it's a very specific thing. If you Google literally any issue with your phone. It could be the craziest niche thing. You're always given the same exact \"9 Ways to fix your phone.\" With things like turn it off and on. Delete unused apps. Change your battery settings. Like no..... I accidentally deleted my boot image while trying to flash a boolegged OS update I had to download from the German version of the company's website. These steps aren't going to help with my problem. Why are they the first options every time I Google anything to do with my phone?\n\nI have an ad blocker so the first \"obvious\" set of ads are blocked, but I think the algorithm prioritizes certain answers over what you're looking for.",
            "Anything to do with drugs you have to do this or all you get is sites for rehabs",
            "This is actually the story of how I signed up for Reddit. One day during a google search, I found my answer on a Reddit link. Then it happen again, and again, so I was like fuck it, I might as well get Reddit, Reddit knows everything! And now I will die here.",
            "I will honestly search through r/ask if i have a specific question",
            "Always.  Reddit is like a throwback to Web 1.0.  Real people enthusiastic about literally.any topic I search for.   Not to say reddit isn't rife with bots and ads, but it's a whole lot better than the alternatives.",
            "Why yes! Sometimes it helps. Other times reddit doesn't deliver.",
            "Yes because fuck Quora",
            "Use \"site:reddit.com\" it's better",
            " I do this with porn lmaoooo",
            "I do that because after decade of being in this site they still haven’t improved their search function",
            "every time. I think they're getting wise to my tricks though.",
            "Yea and then it says Open on Reddit app, or continue and when I click open on Reddit app it goes to the App Store and can’t actually get to the app.",
            "Every time I have a question about a show other websites go on an entire essay rant describing the show the characters and the plot before they get to the fucking answer. And before they get there they reiterate the question 3 times! Like they’re trying to fill a word count.",
            "All the time",
            "All the time",
            "You have discovered the way, my young padawan.",
            "Yup, Googles low quality now.",
            "At the start tbh. Because some random dude on the internet will have had the same problem and talked about their solution on reddit almost every time.",
            "Yes. Google is becoming the worst search engine",
            "All the time. I used to add \"forum\" for the same reason but they're not as popular in recent years and Reddit became the go to instead.",
            "If reddit in-site search wasn't the worst, I'd come straight here.",
            "Almost exclusively now. Google is awful, and no matter how esoteric my question is there's an entire community of people who have ruined their lives with enthusiasm/obsession. If I'm looking for new towels, what sounds like the better choice:\n\n \n\n\n1. Sifting through dozens of paid ads and barely relevant, search optimized, AI generated blogs for two tiddlywinks of information?\n\n2. Going to an active battlefield of people who have made it their life's mission to know everything there is to know about towels and have thus instigated a crusade?",
            "All the time\n\nReddit might not always have the best answers or advice, but at least it’s coming from actual people instead of some website trying to disguise a bunch of paid advertisements as facts",
            "all the time. It's super helpful.",
            "That’s why I got a Reddit account. I was coming here for every question I had anyway. Better than all the spam websites with adds galore and usually someone here has the same exact question/ issue that I’m trying to find the answer to.",
            "No, but I will now! This should be on LifeProTip!",
            "Either 'reddit' or 'wiki' works for me!",
            "Dude, this has been me for the last few months. Google has gotten so polluted with spammy websites with SEO bots that make the search result exactly what you typed, but when you click it, it's something entirely different.",
            "One of the irritating things about using google search is sorting by time frame. Google will often say a search result is recent, but it is in fact old, sometimes very old.",
            "No because I use duck duck go that actually gives me results based on what I’m looking for and not ads",
            "Yes. Mostly for reviews and opinions on certain products, paid reviews are everywhere and Reddit is the only place where I can see honest answers and not a payed BS review where everything is perfect.",
            "Yesssss!! I’m not the only one!!",
            "Yes",
            "redacted ` this post was mass deleted with www.Redact.dev `",
            "No, I ask the question on Reddit and then get my post removed in 5 seconds and told to use the search function to the post from 5 years ago rather than starting a new conversation.",
            "Avoid political and opinion related searches as redit tends to lean into a clear bias... also avoid legal questions as there's far too many armchair lawyers. Oh, and complicated sciencey stuff, same reason. \n\nYou're probably better off switching \"reddit\" to \"4chan\" or \"tiktok\" /s",
            "Either those small drop boxes or reddit.",
            "I've never thought of this, but now I'm going to try it.",
            "Yes especially if I’m trying to find an answer to a game I’m playing like forager",
            "Yes",
            "Absolutely, I don’t even remember when I started doing it but I never stopped",
            "Every single day LOLL",
            "Always do it",
            "a real LPT here",
            "ALL. THE. TIME",
            "All the time when looking for a specific kind of battle map keyword",
            "All of the time.",
            "Always",
            "I don’t, but I notice google places some relevant Reddit pages in the middle of the first page of results anyway, so I’ll check them out if they seem like it will get me somewhere.",
            "Always",
            "Yes always",
            "Yep",
            "Guilty. 🤪",
            "I do it all the time. And idk how many times I show my girlfriend how great of an answer I got, she will never use it.",
            "Almost all the time. If I’m having trouble finding a solution to a problem chances are some Redditor had that question and another one answered it. \n\nReddit tends to be asinine about being right, so anyone with the wrong answer is very likely to have been downvoted to hell.",
            "Nope. Basic questions generally have fair response to them on decent sites. I've searched for things like 'distances between planets' or 'abortion in hungary' etc. type of questions and I'm damn sure not finding myself on reddit. I don't know what type of question you'd expect to find best answer from reddit thread where bunch of dumbos are responding. If it's actual basic question, wikipedia is always the best option, if it's a bit weirder, the google's preferred search result tends to still answer it fine and that's usually not reddit.",
            "It's a strategy i use for very niche specialty knowledge. \nReddit is huge and there's a subreddit for everything so odds are someone has asked my (beginner to said niche) question before, and some expert has answered it.\n\nIf the method above fails, you can go to a general forum on said subject, and post a wrong conclusion on this question. That will usually lead to an expert correcting you",
            "I had the same question and google just brought me to this thread",
            "No, but I always choose the one ending with 'reddit' if it is in the drop down list",
            "All the time!",
            "Oh, definitely",
            "Bro I ate some blue takis and it turned my shit neon green. Googled \"aforementioned problem\"+ reddit, 2-3 year old thread still had a few people commenting on it only days ago. If it works it works",
            "YES THIS LITERALLY THIS. Despite having a bad reputation in general reddit is really really fucking good at giving answers to questions about spesific topics. Other options are pure garbage. It either some blog/news site asking you to disable adblocker and giving you no answers or some retard at quora wanking himself.",
            "So many people do that, Google now automatically includes Reddit for certain questions now: https://techcrunch.com/2022/09/28/google-search-now-queries-reddit-and-quora-in-response-to-open-ended-questions/",
            "Especially if its tv/movie/video game related",
            "Always.",
            "It's all I ever do now mostly lol",
            "At the same time Reddit search is trash.\nSo\n\n- google search + google results = SEO garbage\n- google search + Reddit results = ♥️",
            "Wait, some people don’t do this?",
            "If Reddit bothered to spend money on their search engine, people could skip going to google.",
            "It's really amazing how shit google search is. It was good way back in the day, you could search something really specific and bam, results. Now? it doesn't matter, it gives you shit you didn't want.",
            "Literally almost everything I google yes lol",
            "No. Google autofill does it for me lol",
            "This is the only social media I trust tbh",
            "This is the way",
            "I also do this when I’m searching for something on Reddit because Reddit’s search engine is so bad it’s easier to look up “xyz Reddit” on Google",
            "It depends, if I wanna opinions I do because reddit is the new yahoo answers. But if I wanna more factual data I rather search google scholar or google/duckduckgo for a scientific article or a webpage linking to one.",
            "Ever since I’ve became a Reddit user, I’ve used this trick. The thread is usually 2 years old, but I find solid answers each time.",
            "Only always.",
            "I've been doing this for years and it's very effective.",
            "Google knows we do this and has actually made changes to search to make it easier for us:\n\nhttps://blog.google/products/search/google-search-discussions-forums-news/",
            "Every. Time.",
            "[removed]",
            "Why don’t you just use Reddit to search Reddit? \n\nTBF, I actually use the Apollo app instead of Reddit bcz I like it’s interface better, so maybe the actual Reddit doesn’t have a search feature? \n\nWhenever I have a question (I’ve checked on 3 issues in the last 2 days) I go into Apollo’s search page and search recent posts for the keywords. Have found satisfactory consensus on all 3 topics without much trouble.",
            "And you don't use the Reddit search directly cause it sucks?",
            "How many times a year does this issue come up? I remember reading about it 6 years ago.",
            "I do all the time 😂",
            "Yes",
            "SEO bullshit has killed the regular Google search for me.\n\nIf I search for a recipe, I need to add \"allrecipes\" to my google search string so I can get to the real recipe and not have to sort through several dozen bullshit blogs that all just rip off an existing Allrecipes recipe from like 15 years ago.\n\nIf I search for a specific question about a hobby or topic then yeah, I often add 'reddit' to the end cos Reddit is much more specific - again, if I don't make my search specific to a site or sites, then results get swamped with a bunch of useless fluff blogs that only show up due to gaming the SEO",
            "All the time, the answers are much less often paid, and there is often a dedicated community around to upvote/downvote answers so I know what the general consensus is, as well as a wide variety of answers at once for different perspectives",
            "Yes, and I really hope reddit will remain reliable for a long time to come",
            "not to mention the other sites are getting shittier and shittier",
            "I do that for most of my Google searches, yeah",
            "All. The. Time.",
            "Yes especially for recipes or quick tech answers. Websites are so bloated because of SEO. I don’t need a story or to explain some technical concept to me I just want to see my question answered.",
            "Yup",
            "That how I use Google how. Ty reddit",
            "I don't but is this the best way to search stuff",
            "Absolutely. All the time. Normal internet is basically just endless generic useless articles that half the time aren’t even related to the specific thing you are trying to find."
        ]
    }
]