[
    {
        "post_id": "zhra74",
        "author": "SkepticalJohn",
        "title": "Does anyone else think the 'Elf on a Shelf' thing is weird as hell?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/zhra74/does_anyone_else_think_the_elf_on_a_shelf_thing/",
        "score": 20727,
        "num_comments": 2239,
        "created_utc": 1670675003.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/zhra74/does_anyone_else_think_the_elf_on_a_shelf_thing/",
        "comments": [
            "[deleted]",
            "What is Elf on a Shelf? Outside of being an elf that is currently on a shelf.",
            "I fight against it because Snitches get Stitches",
            "Not sure if is an official rule but we told my kid she couldn't touch it or it would lose its magic. We hid that little bastard starting Dec. 1st for 4 years. Many times it was waking up at 5am with a gasp \"WE FORGOT THE FUCKING ELF!!\". This year though after being told multiple times to leave it alone she tried moving it without directly touching it and it fell on her face. The curse was lifted. We are free",
            "Feel like people fall in two camps on this stuff:\n\nYou either love the magic behind it for those who believe or you feel like it’s another example of commercialization that we’ve fallen for.",
            "Not gonna lie, I thought you were talking about the \"you've heard of Elf On A Shelf, now get ready for...\" memes.",
            "I don't think there's anything objectively wrong with it, but as somebody old enough that 2005 feels fairly recent, it feels obnoxiously artificial. Like, it's not a holiday tradition, somebody just started selling elves one year and declared it to be a tradition, and a bunch of people apparently fell for it.",
            "OBEY THE PANOPTICON OR ELSE",
            "My kids specifically asked not to get one. They thought it was creepy.",
            "I don't like it because I don't like the idea of teaching children that the only reasons to be good are to be rewarded and to avoid punishment. We should be teaching them to be good because it's the right thing to do.",
            "As a toy for the whole family to play with, a dynamic Christmas decoration, I have no problem with that at all.  Telling kids that it's alive and spying on them is creepy and terrible.",
            "There are two different ways to do it. I just learned this this year. \n\nOne elf on the shelf is just a fun game where the parents just move the elf around the house and put it in new and fun spots and positions. I have no problem with this version. \n\nThe other version is that the elf is a spy for Santa and reports on the kids behavior. This I find to be a fucked up babys first NSA type thing. I hate it so much and it genuinely creeps out my kid and I had to talk her down from it after she got exposed to this crap in school. Dear parents that do this crap, grow a pair and make punishments and threats yourself and stop using supernatural bullshit.",
            "Fucking hate it, always have, always will. It’s so stupid for it to “watch over kids to make sure they are not naughty” while every night doing naughty things and being moved around. Dumb, dumb, dumb! There will never be a creepy fucking elf in my house.",
            "Very much so.  \n\nBut admittedly, that may be because I only learned about this a year ago (I'm in my 40s) so maybe it's just \"too new\".  I spent a bunch of years overseas, and when I came back to the US, suddenly it was this big \"thing\".   How long has it been a \"thing\", and where the hell did it originate?  \n\nRegardless, I still think it's weird as hell...it's like conditioning people to being spied on.",
            "I've always been somewhat uncomfortable with the whole Santa Claus lie, but went along with it since it has been going on since forever. I think it's _really_ weird that my generation of parents made up a whole new holiday lie.",
            "You can call it weird, but to the kids at my place they call it fun. They look forward to it every time they come home. The story goes the Elf reports what he sees to Santa so kids have to behave. \n\nEven if that part isn't always working as intended, they will have fun memories looking for the elf. Its a harmless game so I see no problem.\n\nEdit: some of yall talk as if you've never seen the eyes of a child light up brighter than christmas deco. Actually observe them to find out if something makes them uncomfortable before assuming you know.",
            "Dutch person here\n\nIt seems like something that parents use to terrify kids into being good (similar vain as coal in shoe, or hoe Zwarte Piet would take kids away, or Krampus) and it gets a \"pass!\" Nowadays for nostalgia and looking \"cute\"\n\n\nBut its an ugly old doll\n\n\nIt's weird",
            "[deleted]",
            "[removed]",
            "yes this naughty elf shit is weird as fuck. Im avoiding it in my house but my kids school and daycare do it and its just not for me. I have 2 naughty elves as it is XD",
            "yes I do think it’s weird and I do think it is encouraging children to be okay with their behavior being surveilled. i do understand that that is not a new concept to this world, as it’s been a thing with Santa as well as many peoples’ & churches’ interpretations of God throughout the years as well. I happen to also think those things are weird. I have never been a fan of the santa story and the idea of conditioning children to believe that their behavior is being monitored. It’s ethically squicky from my POV to train kids that it’s normal to hypervigilantly avoid “being bad” to avoid punishment. Super carceral and I don’t like it. Even in my own personal system of faith which includes the omnipotent presence of God, I do not believe that we’re being actively monitored and having a tally made up of all of our good vs bad thoughts/beliefs/decisions/actions/etc that will be held against us on our death day.\n\ntldr: The whole idea around it is bizarre to me and that extends to other things that take on the same concept including Santa and Prison-warden-God. edits for typos",
            "We bought one and my kids roundly rejected it. They were 8, 6 and 2 at the time. The Elf went missing and they told me later they buried in the trash! So it got thrown away. His name was Shmelfy.",
            "If you think that's weird look up what we're doing in Easter in Czechia - \"[easter whip](https://en.wikipedia.org/wiki/Easter_whip?wprov=sfti1)\".",
            "This elf crap wasn't funny when it first came out and every year half my friends are \"hilariously\" posting this toy in various places. I've actually started muting them for 30 days on Facebook. About as funny as those animal filter things, which also aren't funny. Honest to god you have to be seriously lacking to find such banal shit funny.",
            "Yes",
            "This wasn’t around when I was a kid. Took me awhile to figure out what the deal is. Yeah I think it’s pretty weird too. Up there with gender reveals.",
            "In our house we do \"Whore in the Drawer\" which is a Barbie doll in slutty torn up clothes with a bunch of trashy tattoos drawn on and bad jersey shore makeup. One of them has a NJ outline on her calf with a star where her hometown is, and the other has a custom g-string.\n\n\nWe get each other by hiding the whore in various drawers, there's not really anything else to it though, this elf in the shelf shit is weird as hell.",
            "Yeah I find it weird. It's marketed as a \"tradition,\" but it came out in 2005. That's why too new for me to consider it nostalgic (I was already 25) so it felt like someone just created a whole new Christmas tradition and I have to go along with it.\n\nWhen I first heard about it, and how everyone acted as if it had always been a thing, I felt like I had stepped into a different world (thank you Truck-Kun, but next time Isekai my ass somewhere with magic and some sweet powers, not my same world with a creepy elf).",
            "I think so. I don’t like the “someone’s always watching” vibe it’s got going on.",
            "Not any weirder than Santa “he knows when you are sleeping. He knows when you’re awake. He knows when you’ve been bad or good”. \n\nChristmas has always been weird.",
            "Na I think its fun. All about how you do it. With my nephew the last few years he's enjoyed it. We don't do it as a \"He's always watching you so be nice\" type thing, we just have him move around and show up in different parts of the house doing silly stuff. Yesterday we had him set up in a knocked over pretzel jar on my counter along with a bag full of Hershey kisses dumped out with wrappers on the floor lol. When my nephew woke up and saw that he got a pretty good laugh about it.",
            "I’ve always found it creepy, I don’t believe in making kids thinking inert objects are alive.",
            "I think all Christmas stuff is weird as hell and materialistic. Most toxic part of it is being looked down upon if you don't want to buy gifts. Not to mention people having to work extra hours so others can get their precious objects.",
            "It’s creepy, stupid, and weird. Threatening your child to be good and these elves come and sit in your house and watch you and report it back to Santa but they only move at night and get into mischief. So the elves can be naughty but the children can’t? Make it make sense. I hate elf on the shelf and I have two young children. Won’t do it. It’s stressful for mom and I personally feel that it isn’t really believable bc they’re a sack of red felt with a Barbie doll head…",
            "Yup. Ain’t doing it with our daughter. People feistily tell us we need one.",
            "I think you can have Christmas magic and traditions without the elf on the shelf. All I hear are parents complaining about having to move the elf.",
            "To each their own. I think it’s ridiculous.",
            "Its creepy and perverted IMO. Idk why i feel that way. I just do. Them little elves stress me out and creep me out",
            "I just thought it was a creepy fucking elf decoration until my fiance informed me that thing is supposed to tell Santa if a kid is being bad. That just makes it worse. I told her that if we ever have kids we weren't going to have it in our house because being creepy is bad enough, but there's no need to make the kids paranoid too.",
            "It's weird. Some parents traumatized the heck out of their kids with it. Making them feel like every mistake of theirs is being watched and criticized. It's gross.",
            "If you think that training kids to live in a surveillance culture is cute and Christmasy there's nothing wrong with it at all.",
            "Yes, but I also think Santa is. \"He sees you when your sleeping\" How does that sound okay? If it weren't a super popular thing, and you seen a blog post on it explaining everything about it in great detail, would you think it was normal? Probably not. They both sound like they are spying on you 24/7. Forcing a kid to behave good doesn't make them actually behave. Anyways, I'm a teenager who never had anything to do with Santa so that's my take! :)",
            "What's weird about normalizing supernatural surveillance to facilitate fear of stepping out of line?",
            "It wasn't a thing for my childhood (thankfully) but I've always interpreted it as getting our culture ready and used to mass surveillance. You never know where the camera is going to be and god help you if you try to sabotage it.",
            "Aww yiss my favorite Christmastime topic. \n\n&#x200B;\n\nElf on a shelf is weird as fuck and one professor thinks it's training kids to accept living in a police state. [https://policyalternatives.ca/publications/commentary/whos-boss](https://policyalternatives.ca/publications/commentary/whos-boss)\n\n\"While the elf may be part of a pre-Christmas game and might help manage   \nchildren’s behaviors in the weeks leading up to the holiday, it also   \nsets children up for dangerous, uncritical acceptance of power   \nstructures. Certainly, teachers and parents can incorporate critical   \npedagogies alongside the elf’s presence in children’s play worlds and   \nsocial lives in “teachable moments” that cultivate children’s ability to  \n identify, question, and resist power. How do children conceptualize   \nbeing watched; do they perceive themselves to be engaging in   \nperformance, or is performativity a natural response to the elf’s   \npresence.\"\n\n&#x200B;\n\nSee also: https://www.washingtonpost.com/news/arts-and-entertainment/wp/2014/12/16/the-elf-on-the-shelf-is-preparing-your-child-to-live-in-a-future-police-state-professor-says/",
            "When we were pregnant with our daughter I made it very clear to all of our family that no one was to buy us an elf on the shelf. I will not do that shit. I already feel dubious about Santa (the whole lying to your kid about a fat man magically bringing gifts), so adding in a complicating factor to the lie makes me very uncomfortable. Also, that’s just a fuckton more work for me in an already stressful time of year. \n\nI want the magic of Christmas for my kid, I just don’t look forward to the day I have to explain that Santa isn’t real and I’ve been lying to her for years.",
            "Yeah, it's super creepy. The parents who are really in to it, in my experience, are super domineering and controlling.\n\n\n\"This elf watches you all the time and sees everything you do\" isn't fun, it's creepy. Couple that with the new \"fake elf surveillance camera\" and you're just teaching your kid police states are a good thing and result in presents.\n\n\nIt's gross. Plus, his dead little eyes skeeve me the fuck out.",
            "I prefer skipping the metaphor, lecturing my children about Bentham’s panopticon and then moving straight into the theory of the carceral.",
            "I never understood it until someone told me it was a thing devised by advertisers so you'd have a bunch of Elf on the Shelf crap to buy every year.",
            "Yes, that wasn’t a thing when I was young but I can easily imagine my 6-year old self having an absolute meltdown over the thought of being surveilled by some nasty little snitch planted by my own mother. \n\nI do not understand this concept of making Christmas a holiday about obedience and accountability. For me, Christmas was always more about making crafts, decorating cookies, going to local holiday events, seeing Santa at the mall, ABC 25 days of Christmas on tv, tree decorating, stuff like that. My mom was never like “Happy holidays, judgement day is nigh. Time for Santa and his morality elves to reflect on your yearly wrongdoings”…that just was not a part of it lol. The lump of coal thing was the only “bad” thing ever mentioned and even that was obviously just a joke. \n\nI think it’s kind of sick to let any child believe that there is a possibility that they would be deemed unworthy of a Christmas gift, and let that threat play a role in their decision making skills. Talk about negative reinforcement…jeez",
            "Yes, its weird. But I guess its fun for the kids.",
            "Not a fan-they give me the creeps!!",
            "As a transformers fan, I do \"Prime on a dime\"",
            "It is weird as fuck. But it’s also dangerous. \n\nThe Elf on the Shelf teaches kids to regulate their behavior out of fear of authority. Not to internalize their good behavior and be good for goodness sake.",
            "In Canada we have goose on a moose. \n\nNo lie.",
            "Never understood the appeal of it. Some people are more easily entertained than others I suppose",
            "I have one and my kids didn’t fall for it but that’s probably bc I hate lying to them. The jig is up on just about all the imaginary religious groups and their many weird holidays.",
            "There's long parental tradition all over the world of farming out custodial vigilance.  Just tell kids that if they're bad, some supernatural agent will see and punish them.\n\nIt's creepy as hell.  In the Mother Goose rhyme, Wee Willie Winkie is looking in their bedroom windows at night to see if they're sleeping like they should be.  That's basically the same energy.  \n\nSo it's normal, but it's pure high-octane messed-up.  Elf on the Shelf is just Krampus commercialized downward.",
            "My child recently requested one and I had to explain that an elf on the shelf’s roll is to watch you all year round and report back to Santa on your actions. And asked if she really did want that… to which she replied… hmmm nope I’m good. Lol\n\n I find that it teaches surveillance is acceptable at all times and that they shouldn’t be allowed privacy in their own homes. It’s definitely disturbing to me.\n\nThere are plenty of other holiday traditions that we keep for the magic and fun of it that doesn’t require an underlying acceptance of fascism.",
            "It totally creeps me out. Hadn't heard of it till recently. Are we trying to condition our kids to be okay with being watched? \n\nGiven the way tech is going, they aren't going to have much choice. Esp if you consider the weird social credit systems creeping in.... :(",
            "Not as weird as any other Christmas tradition, although this is definitely a newer one as it's barely 7 years old and clearly designed from day 1 to be a toy campign.\n\nWith that said, my sister in law told my wife and I to Not start that tradition as she regretted it. Every year for 24 days leading up to Christmas (we're Canadian so we ain't doing Oct 10th to Dec 24th) she had to find something different for the elf to \"do\" and she started that when my nephew was 5 and my neice was 3. Now over the years  thats 100 different places to \"hide\" for that elf to do, because my nephew or my niece remembers what he did in previous years.\n\nFurthermore, apperantly the kids can't touch the elf or it will loose its \"magic\" and resemble a toy (apperantly to explain why the elf doesn't do anything if the kids approach it.) one year this caused my nephew great distress as my niece unknowingly touched the dolls arm and caused it to fall over. He was crying and crying that my niece essentially killed it. My sister in law had him appear the next day with a cast around his arm.\n\nHonestly, I don't think it's a good Christmas tradition as it doesn't encourage anything other than believing in the elf itself. Imean maybe it encourages kids to be good as it reinforces the idea of Santa \"watching them\". But it focuses so much on the elf itself that it's hard to say. Either way, leaving a half eaten tray of cookies and milk does the same thing.\n\nAlso there's this https://youtube.com/shorts/A-ozCukX92s?feature=share\n\nSo enjoy!",
            "I hate that stupid elf so much. My wife brought one home when my daughter was a baby, and for a year or two did all the crazy shit everyone else was doing (which my kid wouldn’t remember). Now she’s a few years older and it’s just a chore. I get up to pee at 4am and oh shit we didn’t move the elf, I guess I’ll put it over there. My daughter gets upset when it’s time for the elf to go back home after Xmas, and I’m really looking forward to the next year or so when she figures out it’s all a lie. Should’ve said no from day one, but got shamed into thinking I was a bad parent because everyone else was doing it. \n\nSo parents of young ones, don’t fall for it. Your kid doesn’t need this to enjoy the season.",
            "Its fun as hell, I get to watch my sleep head children look for the elf. Christmas magic is real if you make it so!",
            "Training kids up to be more accepting to living in a surveillance society.",
            "I have a guy who goes to serious lengths every year on fb to do this, even though he's getting bored he's still doing it after 5 years.\n\nJust feels kinda sad at this point.",
            "You sound like so much fun OP.  Its for kids.",
            "I think it's weird and I love it.",
            "Yes it is!\n\nI was going to buy one but when I read the package I was horrified.\n\nWTF?? What an awful thing to do to your children.\n\nMy kids are grown, I just thought it would be a cute addition to the Christmas decor.",
            "Yup. It's weird.",
            "[deleted]",
            "Yes lol.",
            "Test",
            "10000000%",
            "I’m telling ya. It’s all a big conspiracy. They put a camera in the Elf. That’s how Santa knows so much. Big Toy tries to deny this, but we all know they’re in on it.",
            "It's suddenly become a trend in the UK over the last few years and it is just so weird how much effort people put into the \"pranks\" just for a few likes...",
            " I think you all are over thinking this 😂",
            "It's weird. Santa naughty/nice list is good enough. We aren't doing double duty with an elf",
            "I don’t think it’s any more inherently creepy than an old guy that works in the North Pole that “Sees you when you're sleeping” and “knows when you're awake”.",
            "Nah, its stupid",
            "When it first came out in 2005, I saw my nephews do it, I thought it was weird. Never did it with my kids.",
            "No I think if people do it in a sweet cute way like make the elf look like it's peeking in the presents or like it's gonna make hot chocolate but people use it on a sort of malicious way that just bullies there kids like drawing on there face which I think is weird",
            "I think it is an idea to keep kids in line like the Santa cam",
            "It’s better than its predecessor: Poop on the Stoop. What a marketing shitshow that was.",
            "Not only is it weird but seems traumatic that the Elf wreaks havoc. I would have been scared shitless as a child. I already hate clowns and ruffle dressed dolls.",
            "I think there are a lot of *other* things about christmas that are weird as hell....",
            "Yup I never even knew this was a thing until like last year..weird af",
            "Yes",
            "Yup! Very creepy.",
            "You can make it creepy or it can just be fun. If you go with the story that he's watching the kids and reporting back like a narc, yea that's lame and creepy. But if it's just a fun visitor and he does silly things, then whatever.",
            "Yes, it's very weird.",
            "Yes, and we refused to do it. It's creepy as heck.",
            "Agreed. And here I thought it was just an elf that you put on a shelf to “watch” your kids so that they be good. I hadn’t heard that parents hide it each night, and kids aren’t supposed to touch it or something.  Sounds really annoying to have to deal with.",
            "Like all things, it's as weird as you make it. We've always done advent calendar scavenger hunts every day so we have no need to hide more things for each other to find. But if we did I don't think it would be weird.\n\nOn all the parenting subreddits people are freaking out about the elf. Is Christmas not already ridiculous and commercialized? Is the elf really the thing that tips the scale? Cuz Santa is shady af and the elf seems like a fun game. You also don't need to buy one, you can use literally any object. And you don't need to tell you're kids it's spying on them.\n\nAgain, it's as weird as people make it.",
            "As a parent I can't believe that so many other parents looked at this and went.. \"You know what else Christmas needs? Another tradition that requires daily creativity and work by parents!\"",
            "Yes! I hate it! I did it for 2.5 years and it was pure hell. Best day was when I gave it to my 6 yr old niece",
            "Yeah it's weird and it sets kids up for a lifetime of paranoia.",
            "I never had this growing up and was gifted one of these stupid things when my daughter was little. Now having three kids I have three elves and having move these stupid things around every night is a pain my ass. I don’t understand the purpose or where these damn things originated.",
            "Hate it. Got away with not having one for years. Said that I guess you guys are good enough that Santa doesn't need to send one when they asked why all their friends/family had one. Then they wrote a letter to Santa asking if they could please have one. Cue the guilt ridden mom getting one for them. Think this may be the last year we have to do it (and the older child helps now) 🤞🤞 creepiest tradition ever!",
            "Before we even decided to have kids, my wife and I said that we would never expose our kids to such horseshit. We have an irrational hatred for that little fuck.\n￼",
            "It's creepy and annoying as hell.",
            "Yes.",
            "It is super weird and creepy. The fact that it's not that old and is already considered a tradition makes it more so. Add to that they people who move the damn thing around and give it a backstory, it just a messed up idea.",
            "At the first nanosecond on hearing what it was.",
            "In Europe they have the Krampus who deals with the naughty.  Somehow that's better....",
            "santa's whole list is invasive",
            "Fuck yeah, first ingredient in raising serial killers",
            "We have one. But I don't do the if you're not good it will tell Santa crap. I also don't do elaborate things or buy tons of gifts for it to give. I've always just enjoyed the kids looking for it then ignoring it. I do wish I hadn't started it because I'm lazy so I couldn't imagine the families that go nuts about it.",
            "Yes, it's very childish. I much prefer Whore in a Drawer or Snoop on a Stoop.",
            "Was busy just surviving as a single mother, never even heard of it until my grandkids came along. Sounds awful.",
            "Yes. It's weird, it's creepy and I would never do it.",
            "I literally have never heard about this elf on a shelf business until this year and it seems like everyone acts like it's a known time honored Christmas tradition.",
            "I never used it for my son. I think it normalizes boundary violations and can lead to some scary shit.",
            "Yes",
            "Yes",
            "Very weird lol let’s not normalize some strange little man running around our house causing chaos while we’re sleeping…lol",
            "Hey, what better way to indoctrinate your children into a living in a surveillance state? “Don’t worry, ‘Big Brother’ isn’t *really* watching! …it’s little brother watching“",
            "I find it odd and silly, but I also think lying to kids about Santa is weird too so I'm an obvious outlier. I don't believe in magic, sentient deities or tradition for the sake of tradition. I've agreed to go along with the Santa thing with my son but I won't lie that he's real once he starts questioning things.",
            "Oh yes.",
            "It's a ploy to get the kids to buy in on surveillance later in life.",
            "I think it’s ridiculous. But I also am not fond of doing festive activities related to Christmas, like put up a Christmas tree or enforce the idea that Santa is real. I’m a bit of a Scrooge in that regard. \n\nI like Christmas and think it’s fun. I just don’t enjoy (nor have I ever enjoyed) dealing with a Christmas tree.\n\nMy family used to have a Christmas tree growing up, but by age 8, I found the tree ritual laborious and not worth the effort. So us kids just quit participating in putting up the tree and my parents didn’t want to do it by themselves, so that tradition died when I was a bit young.",
            "Yeah, kinda surveillance-state-y to me. The man is always watching you!",
            "Yes, as is the whole “if you don’t be good Santa won’t bring presents” thing. It’s manipulative.",
            "Yeah its as weird to me as telling kids santa is real instead of telling them you love them and want to show them love with a gift and snacks and quality time together.",
            "My mom has been doing her own version of elf on a shelf, and she started 50+ years ago. We have those little elves from the 50s/60s, and she'd put them in her siblings beds, they'd wake up, she'd say the elves were moving around and that they climbed int he bed themselves, and she's scare my aunts/uncles with them. lol To this day, my uncles, grown men, are afraid of those elves... ha.",
            "I did. \n\nBut we got one this year, and the excitement of my children looking for where she’s moved in the night first thing every morning is absolutely wonderful.",
            "It is a little weird, but so is the idea of Santa and Jesus/God.  There isn't anyone looking out for your actions and judging you for them.  I will say kids like games and are very creative anyway, and Elf on the Shelf is appropriate for the age group that believes in Santa.",
            "Yeah, it's creepy and promotes comfortability with surveillance.",
            "Yeah it’s like Santa wasn’t scary enough as a long term threat so they had to throw in daily threats for behaviors.",
            "Weird as Hell",
            "Not just weird, it's much worse than that. I hate it.",
            "My boys are almost 7 and almost 8, and the year they were 2 and 3, they were gifted an elf. I read the story and introduced them to the elf, asking what they’d like to name him. My almost 3 year old held the doll for a moment, and then carried him to the trash and tossed him in. I asked him why he had done that and he told me the elf was yucky and naughty. \nAnd that was that. They’ve never been interested, and I’m okay with that",
            "Yes!!!",
            "My oldest wouldn't even stand for the tooth fairy or Easter bunny entering our house, she was terrified of someone coming in while we all slept. The idea of an elf spying on her for a month would have sent her over the edge.",
            "I'm so glad my parents never did this shit with me because.\n\n1. I was (and still am) a big scared-y cat so some weird elf \"moving\" would have freaked me **the fuck** out as a kid. \n\n2. It seems like a really stupid idea and can give the kids trust issues beyond lying about Santa.",
            "[Snitches get stitches](https://theneedling.com/2021/11/04/parents-mortified-as-kids-turn-elf-on-the-shelf-into-snitch-in-the-ditch/)",
            "Yes. It’s incredibly creepy.",
            "Yes. Have a 4 yr old currently and my mom asked if we wanted an elf on a shelf. Wife and I responded “no way” simultaneously. Not here to yuck anyone’s yum for those that like it, but it’s not for us.",
            "I think it's weird, and also unnecessary.\n\nSanta can already see uou when you're sleeping, knows when you're awake, and knows if you've been bad or good.  Why does he need a subcontractor?",
            "Yes! My husband and I have agreed we won’t have one.",
            "They creep me out!",
            "[deleted]",
            "Its fucking stupid. \n\nTold my 6 year old I am santa after the divorced mother tried lying to her. \n\nTold that child if they were bad, I wouldn't buy gifts and then they better hope santa is real. \n\nSo am I making up some BS about an elf? Hell no. \n\nI know when my kids are being bad. Have ears.",
            "Weird? Why would it be weird to have the cold dead eyes of a creepy ass doll watching over you with the canonically explicit purpose of reporting your every move to a guy planning a B&E on your home? Seems pretty normal, no giant red flags there.",
            "I don't see anything wrong with it."
        ]
    },
    {
        "post_id": "adjdwn",
        "author": "ftunny",
        "title": "People who own a banana hanger, what do you do when you get down to only one banana?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/adjdwn/people_who_own_a_banana_hanger_what_do_you_do/",
        "score": 20709,
        "num_comments": 1338,
        "created_utc": 1546878989.0,
        "selftext": "So I was gifted a [banana hanger](https://target.scene7.com/is/image/Target/GUEST_ff81f1df-4a66-45aa-8880-7a693f8a9deb?wid=488&hei=488&fmt=pjpeg) recently for Christmas, and while I'm not a huge banana enthusiast, I will occasionally eat them. I bought my first bunch of bananas since receiving the hanger the other day, and I'm down to 2 out of the original bunch of 6 bananas. I went to have a banana with breakfast this morning, but kind of stopped when I realized that would leave me with only one banana left. How would I leave this last banana on the hanger once I break apart these last 2 of the bunch? Should I try to break the stem on the one I'm about to eat particularly low and hope that it leaves enough of a little \"Λ\" on the remaining banana's stem so that it can still hang? Should I just lean the remaining banana against the back bamboo support arch on the hanger and just totally ignore the hook? Or maybe try to stab the hook through the stem on the last banana? I'm not at all sure what the protocol is on a situation like this, totally new to the banana hanger owner world. ",
        "permalink": "/r/NoStupidQuestions/comments/adjdwn/people_who_own_a_banana_hanger_what_do_you_do/",
        "comments": [
            "[deleted]",
            "You break the next-to-last banana off of the V-shaped pair of stems, so the last banana still has a V on top.\n\nFailing that, you lay the last banana on the counter.",
            "I break the stem, leaving a Y for it to hang on.   It has never been a problem.",
            "Nobody eats the last banana. \n\nYou look at it until it shrivels and talk about making banana bread with it.",
            "Don't bother with any of that. Just stab the last banana horizontally through the hook and leave it to rot as punishment for not being chosen by yourself to consume.",
            "My banana hanger was made of wire, and had a little crescent shape to rest the last banana in.",
            "Not sure. I eat my bananas in twos.",
            "You actually eat your bananas? I buy them and they sit around until they rot and I throw them away. Then buy another bunch the next time I go to the grocery store. ",
            "I have used a twist tie on the banana stem to create a loop.",
            "Eat them at the same time because I'm a college-age construction worker with an insatiable appetite, ask if any of my siblings want the last one, or just put it on the counter next to the hangar because screw the health code when it comes to my kitchen.\n\n*Or*, depending on how big the hook is, use the hangar not for hanging bananas, but for hanging a set of headphones on. Your gaming desk will never be the same!",
            "[deleted]",
            "That becomes 2 banana day. You force yourself to eat 2 whole bananas. You don't have to eat them both at the same time but you have to take them both with you. Put on on the front seat of your car, put a seat belt on it. VIP that banana throughout the day till you're ready for it to make banana love to your mouth. ",
            "I have a regular fruit bowl under my banana hanger. So, I just put the last banana in the bowl.",
            "Take the unchosen outside and throw it as hard as you can down the street. Don't throw it into trees or on to grass, it has to be run over and smashed for what it's done. \n\n\nOr just set it on the counter like you did before you got the hanger. Whatever works better.",
            "Put it immediately into the freezer. When you have a few saved up make delicious banana bread with them. ",
            "I use mine as a headphone stand",
            "Everyone knows you leave the last banana until you ya e a colony of fruit flies in your home to worship you. They’re my only friends. ",
            "Put it in your pants.",
            "This thread is a goldmine for comments! Kudos to all.",
            "My kids love smoothies...so when I get down to just 1 banana I peel it, put it in a ziploc and freeze it. Then when someone wants a smoothie we don’t have to use ice we just use the frozen bananas....",
            "I just lay it on the base. ",
            "Panic. The louder the better. We can’t have single digits on our banana hangar. That would be monstrous.",
            "TIL there is a wooden device used for hanging bananas.   What’s wrong with the society?",
            "You just purchase a banana hammock to hang on the banana hanger, which allows the last banana to rest peacefully until its' eventual demise.\n\nEdit: I'm sorry, u/Trobot87 , I didn't see your comment until mine was posted.",
            "I spent way too long reading these comments",
            "You eat the banana, thus disarming it!",
            "This is a top notch question. All the answers have been great. All around, quality post.",
            "I fucking threw the damn waste of space out.",
            "I buy 8-12 bananas, when they all turn black I know it's time to buy more bananas.",
            "Sharpen the tip of the hanger hook and you can impale the top bit of the last stem so it hangs by itself.",
            "Eat the Banana",
            "You give the last banana to someone who is homeless. Simple.",
            "[deleted]",
            "The person that gave it to you probably bought it for themselves and when they encountered the same issue, they decided to give it away as a Christmas gift.",
            "[removed]",
            "[removed]",
            "So, you know the hard part of your banana, which you hang it with on the hanger?\n\nI would try jamming it, through the hanger, making a hole, using the hanging bit",
            "What did you used to do before you had a banana hanger?",
            "Disassemble the banana stand.\n\nThere is always money in the banana stand.",
            "Okay so, my very chinese father who was a village boy once told me that the reason why you hang bananas is because it ripens much slower than if you let them sit or lean, allowing you more time in between eating them. \n\nIt’s one of those things which he couldn’t explain the science behind, but for some reason it just kinda... worked. ",
            "I put it on the counter? ",
            "I keep a pair of scissors in the drawer under it. Snip the next-to-last's stem so the last one still has it attached to make a \"V\" hook. No muss, no fuss",
            "Use it as a headphone stand",
            "What do you guys do if you buy two bunches? Get two hangers? ",
            "I keep the produce bag from the store I put them in. When I get down to the last one, I'll put it back in the bag, put on the twistie-tie, then hang it on the banana hanger.",
            "The last one goes in the banana hammock.",
            "My good friend has one and I have seen a lone banana both laying beneath the hook and - get this - leaning up against the vertical pillar. ",
            "I pull it out of the bowl the same as I do with all my other bananas.  then, occasionally, i'll shove the banana hangar around in the cabinet where it stays, bananaless, when I need to find a pan or something.",
            "why use a banana hanger when you could just use a fruit bowl? why is the banana subject to a life of isolation away from all the other fruit?",
            "Cry",
            "Who gifted you a banana hanger for Christmas?",
            "What do you mean last?  You can’t isolate a banana.  Pretty sure there is a cold place in hell for *banana isolators* and their sympathizers.  Do what you need to do and eat both, together, so they can meet their end with dignity...",
            "Anyone else bitter that this got 8K upvotes, 2 gold and silver? Just me? Alright...",
            "Lay it on the counter ",
            "I got a banana hanger that has a bowl attached at the bottom. So the last banana just goes in the bowl instead of sitting on the counter",
            "Buy bananas when you know you'll have guests over. It'll trick them into thinking you have your shit together. \n\nIf there's one left, leave that bitch on the base as a reminder to buy more bananas to trick people that you have your shit together, for forever.",
            "I freeze the last one and use it for a smoothie. It is usually about to not be great after the rest anyways. ",
            "This is one of lifes great mysteries. The legendary philosophers of ancient Greece pondered the same conundrum, yet failed to reach a conclusion. The 40 year banana stand war was fought over this, with one side declaring that the banana should be left on the counter. Heathens, I say.",
            "This is a great thread. Honestly just a wonderful look into the random things we think about on a daily basis. Nothing dire or serious. Love it.",
            "Once your down to your last nanner, throw the hanger in the trash",
            "The tradition is to leave a piece of V stem hanging on the banana hanger despite not having a banana! \n\nHaving no bananas’ in the house talks a lot about your intergrity my man. Be careful. \n\nThe global banana hanger Association keeps a tight watch on all social media to catch the alleged NO- banana hangers!",
            "Get really good at balancing?",
            "You have a banana hanger? You’ve made it! This is definitely a sign of someone who has their shit together.\n\nCongrats.",
            ">huge banana enthusiast\n\n\n( ͡° ͜ʖ ͡°)",
            "Why, I slip it snugly into my [banana hammock,](https://i.imgur.com/02R9X3Q.jpg) of course!\n\n[Seriously, this is what I do]",
            "When you're down to 2, buy a new bunch and hang it. Bring the last 2 to work/school with you and share with a friend.",
            "I'd use them for my headphones",
            "I just lay it down right by the hanger cuz I'm gonna eat it within the next day anyway",
            "We always just leave the last one sitting on the counter next to the hanger",
            "the solution is simple. eat the last two at the same time.",
            "Best post 2k19",
            "Eat it",
            "Eat the banana and hang ur google VR instead.",
            "I would say lay it down, but obviously that must be savagery.",
            "We don't put bananas on the banana hanger. The VR headset rests there. ",
            "*sits on hands to resist low - hanging joke material*",
            "Just keep putting the last banana of every bunch in the freezer and make banana bread after a few. ",
            "You have to buy an even number of bananas to begin with.",
            "Slice them up , dredge in cornstarch and sugar cookie crumbs and lightly fry.    You're welcome",
            "This is a beautiful no stupid question.  Things I never knew I didn't know",
            "My wife and I consume bananas regularly, so we just place the last banana down on the hanger base. It’ll get eaten in the next 24 hours, guaranteed. \n\nWe went through a couple cheap plastic ones before buying a nice metal one. They came with instructions on the “proper” way to handle the last banana. You’re supposed to cut the second-to-last banana off halfway down its stem so there’s a “v” for the last banana to hang from.\n\nThat’s too much work for this cave man. Me tear bananas away from family, not comfort them on last day on gallows. ",
            "TIL banana hangers exist.  Are they that common of an item that everyone else in here knew about them?  That sounds like a novelty thing more than something useful to me. ",
            "Put it on the hook like an old timey telephone.",
            "I tell ya what I'd do, man.\n\nI'd eat two bananas at the same time, man.",
            "I own a banana hanger, but use it to hold my gaming headset since I don't like bananas. Works great, and I never have the one banana problem.",
            "Cry.",
            "Never seen this before but guess who's getting a banna hanger tomorrow?",
            "Only eat an even number of bananas in each banana-eating session for the rest of your life sorry pal i don’t make the rules ",
            "This thread is making me want to check my banana hanger for a secret single-banana holster. ",
            "Answer: Snip the stem of the second-to-last banana you are taking (leave an upside down ‘V-shapes stem - do this with a kitchen scissor which does this trick easily, be sure to cut it night on the base of the banana top) so the final banana can ripen perfectly for another day.",
            "Just throw in the garbage. \n\nIt's one banana. What could it cost? Ten dollars?",
            "Push the tip of the hook into the stem of the last banana.  It doesn't break the seal on the part you are going to eat so the purpose of the hanger is still served.",
            "You do a double banana slamma.  Eat them both feel the potassium course through your veins.  Much power.  ",
            "I was thinking about this problem and then... \"what did you do with your bananas before the hanger came?\" is where I got.",
            "Lay is down to rest. It was the last of its bunch, a survivor. It derserves to rest\n",
            "You just have to eat the last banana. Right now. Sorry man I don’t make the rules ",
            "Impale the banana.",
            "This post has gone bananas",
            "Ah, this is what wealthy banana hanger investors refer to as, “ the throw away banana” ",
            "My go-to strategy is doing what you suggested and breaking off the 2nd last banana so that there is a \"Λ\". Sometimes when other family members have taken a banana without thinking about this, I've stabbed the stem of the last one through with the hook, or if it's gotten too dry to stab I've balanced the banana on top of the hanger.\n\nAlso as an alternative if that last banana is looking like it's gonna get too ripe and start browning, I take the skin off, put the banana in a ziploc and throw it in the freezer, now I have a nicely overripe banana ready to go next time I make a smoothie. (I like it to be overripe because it balances out the avocado I throw in with it and whatever berries I have available.)",
            "http://i.imgur.com/Jz2i4.jpg?1",
            "Follow up question, are banana holders really this common? I’ve never met someone who owns one in my life.",
            "The best r/nostupidquestions are the ones that are stupid questions.   (Not to imply that OP is stupid or that the question itself is pointless, just that it's a stupid topic.) ",
            "balancing act ",
            "Looks like it's two-banana day, my favorite day of the week!",
            "Lay the remaining banana on the counter, take a picture of something next to the banana. Post picture to reddit with caption \"banana for scale\". Throw banana away, it has served its purpose.",
            "[Put the banana on the arch](http://imgur.com/a/xiPoLO2).\n\nI don't have a banana hanger, I just want to see if it stays.\n\n\nAlso, when I read banana hanger I thought of a hanger where you land your flying bananas. DESPITE... knowing damn well what a banana hanger is.\n\nYour question might not have been stupid, but my answer and thinking process was/is. 😂\n\nEdit: Yes, that link provides you with my fantastic banana drawing.",
            "For some reason, I read this as banana hammock (aka wiener bikiner, speedo, 50yo Italian man-jams) and I was really confused why you ever has 2 'bananas' in the first place.\n\nAll better now.",
            "Why don't you just peel every banana from the bottom and leave the skin hanging? At the time you're finished, it will still look great!",
            "Put it in the banana hammock.",
            "didnt read the whole thing but lubrication",
            "I’ve stayed awake at night pondering this exact problem ",
            "This belongs in r/firstworldproblems for sure.",
            "banana hammock, perhaps?",
            "I have a banana hammock for that fella",
            "You fuckin eat it or wait another 2 hours and it’ll be rotten ",
            "Use it for holding a gaming headset.  \n\n\n[https://i.pinimg.com/originals/61/ea/00/61ea00703acfaf4410bc4447f1375d1a.jpg](https://i.pinimg.com/originals/61/ea/00/61ea00703acfaf4410bc4447f1375d1a.jpg)",
            "You could hang some sort of little potted plant in it, even a fake one, and keep the banana somewhere else when you have only one banana or no bananas. ",
            "I keep it on the base of the hanger",
            "Eat it",
            "Just set it down. ",
            "I eat the next to last one immediately, breaking off the stem so the last banana has two of them, and can hang",
            "You simply put it in a fruit bowl",
            "I try and tear them so there is a nub on the last one that I can still hang the banana from.",
            "Does your hanger have a hook like the one shown? If so IDK but I too was gifted a hanger that I just use as a hanging rest for my gaming headphones.",
            "Ive been gifted banana hangers twice in my life so far. Which is weird, because I don’t even really like bananas myself.\n\nThey make excellent oven mitt, or measuring cup hooks.",
            "I use a banana hanger to hold my headphones on my computer desk",
            "I balance it on top.",
            "I was thinking of a different type of banana hanger",
            "TIL a banana hanger is a thing",
            "As the final survivor, allow the banana to retire by hanging a speedo on the hook (or 2)  and letting it rest in a comfortable hammock until it rots.",
            "Headphones. Whats a banana",
            "You can use them to hang headphones on instead of bananas. Lots of people do this for wireless headphones.",
            "Often there is a bit of stem left on the banana from one of the other bananas that forms a sort of a hook. ",
            "I hang my headphones from one, does that count?",
            "Just eat the fucking banana right now!",
            "TIL that thing exist",
            "I just eat it.",
            "Stab it",
            "You can use to hang your PSVR headset",
            "Just let it sit there awkwardly on the base of the hanger until someone eats it or it goes bad.",
            "Uh, you fucken eat it.",
            "I use scissors and cut it so the remaining one can still hang..",
            "Eat it.",
            "You eat it.",
            "For some reason lately the last one has been ending up with the thing from the second last banana, so it can still hang effectively off the hanger",
            "I never rip the second to last banana off completely. I leave a bit of the stem so even when there’s only one banana left, there’s two stems that can support the last banana’s weight.",
            "I use it to hold my gaming headset.",
            "Throw it out because I never get to a single banana before they go bad.",
            "Mine has a built-in basket under it. I just put it in the basket.",
            "I cut the second to last banana stem off at the top of the fruit rather than peel it at the stem, leaving a hook at the top of the last banana. ",
            "i just leave it at the base of the banana hanger",
            "I thought you meant 'banana hanger' as in a Borat bathing suit.\n\nAnd all I could think to myself was \"wait, we only have *one* banana in the first place\".\n\nThen it dawned on me....",
            "Genuinely surprised most of these comments arent people telling you how to spray paint it and store your gaming headset on it ",
            "Binder clip",
            "I leave the top part in tact when I take off the second to last banana. \n\nUsually I don’t finish them before they start to go bad though, some often I just throw it out. I like to think I’m keeping third world banana farmers employed",
            "The old me would tell you that I froze the banana and then stored it in a special place, but I’m not like that anymore. ",
            "Cry",
            "I don’t throw around the word hero often, but I eat both bananas! ",
            "My banana hanger has a basket at its base, the last banana just gets to sit in there",
            "> Should I try to break the stem on the one I'm about to eat particularly low and hope that it leaves enough of a little \"Λ\" on the remaining banana's stem so that it can still hang?\n\nYes",
            "lay it down on the base of it.  >.>  or eat it.",
            "When I read banana hanger, I thought \"Speedo\" swimsuit.\n\nThen I was confused as to *who the fuck has more than one dick*?",
            "Thinking people eat unworthy bananas in 2019",
            "Upvoted for \"banana enthusiast\"",
            "Who gifts a banana hanger?",
            "My mom makes one of us eat it on the spot.",
            "banana hammock, duh",
            "If you don't end up using it often for bananas, you can use it to hang a headset. I know more people that use it for that than for bananas. Something like this https://i.pinimg.com/originals/61/ea/00/61ea00703acfaf4410bc4447f1375d1a.jpg",
            "When you are down to TWO bananas and about to eat that second-to-last one, use a pair of scissors to cut one off lower down the stem (closer to the fruit) than where you would break it if you were separating them by hand. so that the last banana is hanging by the \"V\" shaped stem left behind. That's what I do. ",
            "[deleted]",
            "Never trust someone who eats every banana they buy",
            "You can not talk about bananas and not expect to pay the banana tax. I demand picture(s) of said bananas!",
            "For some reason I thought you were talking about mens thongs. I, in 37 years on this earth, have never heard of the phrase \"banana hanger\". Yet I read it and saw a penis wrapped and held up by a bright yellow fabric the second the words reached my brain. I wonder what that says about me.",
            "Two words  -  duct tape ",
            "I bought a banana hanger because it matched my kitchen and was cute and I THOUGHT it would cut down on fruit flies. \n\nIt did not cut down on fruit flies.\n\nSo now my kid uses my banana hanger to hang his Xbox headphones on in hopes that he will stop breaking the damn things. That’s seems to be working. \n\n",
            "Binder clip the last banana stem to the hook. ",
            "FYI- it’s a “banana tree.” I read your post and thought “banana hanger? This dude got an airplane hanger full of bananas?” ",
            "The last couple just sit up there until they rot and then I throw them away. ",
            "I comically balance the single banana on top of the hanger ",
            "Binder clip on the stem, hang the handle on the holder. ",
            "Tuck it in a banana hammock",
            "Staple the remaining banana to the wall, as a warning to future bananas considering going it alone. ",
            "Am I the only person who hasn’t seen one of these before? How is this a thing?",
            "You never have 1 banana. You always eat the last 2 together so they don't get lonely",
            "I think trying a little noose out dental floss would be in order.",
            "Who uses banana stands for bananas? Headset banana stand for the win.",
            "I just lay it on the base and remember to eat it 🤣. If it gets too spotty (even for my husband who likes spotted bananas), then it goes in the freezer for future use in bread or cheesecake.",
            "People actually use banana hangers for bananas? I use mine for my headphones.",
            "It goes to the freezer for Banana bread. Or it rots on the counter as a true representation of my life. Either one works.",
            "I just place the last one on the counter next to the banana hanger.  We eat them fast enough that it’s not too cluttered.",
            "When you get down to two bananas you eat them both.",
            "TIL that banana hangers are a thing\n",
            "Test your dexterity and poise by balancing the banana on end at the tip of the hook.",
            "I keep my pc headset on a banana stand.",
            "I keep a binder clip attached to mine so I can hang single bananas when all the rest are eaten. Reading your question made me chuckle because it made me think about how ridiculous my solution actually was. ",
            "This is hilarious. I also was in your situation and bemusement gave way to incredulity to rage and I gave it away.",
            "Perfectly balance it atop the hook as all things should be. ",
            "scrap the bananas and use it as a stand to hang your headphones on",
            "Wait there are banana hangers?",
            "If you like smoothies you could chop up the last one and freeze it for later. (Also, banana bread)",
            "We have a fruit bowl directly below the banana hangar.",
            "We just stab the last fucker through its shell",
            "There are multiple solutions.\n1. Skewer the banana on the hook.\n2. Throw away the last banana.\n3. Eat both bananas for breakfast.\n3. Ask yourself why you own a banana hanger.\n5. Modify the banana holder to have a “last banana” rest.\nor\n6. Shun all bananas for the rest of your life.",
            "Make a smoothie with both. You can have the rest later if you don't finish it for breakfast.",
            "I prefer to spike it like a barabrian putting skulls on a stake.",
            "This sounds like a complex math problem but I know it’s not 🤔",
            "Studies show that everyone just throws the last one away. It’s too complicated for us to comprehend",
            "you either have 2 or more bananas, or no bananas. (you eat the last 2)",
            "I practice how well I can balance a banana.\n\nTurns out i’m not that good.",
            "Sometimes when you reach the end you just gotta double down.",
            "Fat answer: eat it",
            "I own one and I don't eat bananas much or go into the kitchen much so I don't know what my family does but I would probably peel the banana while it's still attached to the other one so it will hang normally still but if you don't wanna do that then I dont know what to tell you ",
            "Off-topic, but I really like your use of the '\\^'. ",
            "Wrap a rubber band around the stem a couple times and then loop the last bit over the hook. ",
            "I throw it against the wall as hard as I can out of frustration. Then I usually cry awhile. I almost always get over it in a week or so. ",
            "Last banana\n\nWait those things aren't for holding headphones?! ",
            "/u/ftunny You put it in [a banana hammock](https://smile.amazon.com/dp/B00004S1DL/)\n\nsfw link",
            ">So I was gifted a banana hanger recently for Christmas\n\nWho even buys a gift for someone they clearly dislike?\n\n",
            "Isn't the last banana used for sizing?",
            "Peel the desired banana to eat while still attached to its kin. The remaining banana will have to watch its family member rot. Bonus: the fear instilled will make the remaining banana stay fresh as to not meet its demise.",
            "I use my banana hanger for my gaming headset. Much cheaper than buying a stand. Also, I eat the banana. Its food, that's what you do with food. You eat it and force it to become poop.",
            "What a terrible Christmas gift lol",
            "Lay it on top of your fruits in the fruit basket or cut the second last one off its stem so that the last one can continue hanging. ",
            "I use my banana hanger for hanging up my headphones. \n\nConversely, I throw my bananas into the tangle of cords around my computer. ",
            "Just lay the last banana down gently on the worktop or just have two bananas.",
            "I just move to a new house",
            "On that day, he ate TWO bananas",
            "The banana hanger is in pieces and somewhere in my 3 year old’s toy box and the bananas are laying on the kitchen counter just like before we had the banana hanger.",
            "I lay it down underneath the hanger like an asshole. ",
            "I had to read the title a few times before I realized that we weren't talking about banana hammocks. I thought OP was having trouble keeping both balls in the hammock. ",
            "You eat two bananas. ",
            "The last banana goes directly into the trash, or you can throw it at the first person you see jogging outside.",
            "JUST EAT THE BANANA",
            "Just [fuck it] (https://reddit.com/r/Showerthoughts/comments/9q7gys/_/e87o988/?context=1)",
            "Something tells me you added Greek to your keyboards just to type “Λ”",
            "My cat would always destroy the bananas, so ask him",
            "Never happens, I always eat the last two as a pair. ",
            "welp guess im having two bananas ",
            "I started laughing immediately after I started racing this. Idk why but someone going into detail about a banana hanger is cracking me up.",
            "Holy shit, the world is doomed. You jam the hook through the center of the hard vine thing and hang the last banana from that.",
            "http://i.imgur.com/Jz2i4.jpg?1"
        ]
    },
    {
        "post_id": "k23olr",
        "author": "RelayFX",
        "title": "Why doesn't the US Government hire all the unemployed people to fix our failing roads and bridges?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/k23olr/why_doesnt_the_us_government_hire_all_the/",
        "score": 20666,
        "num_comments": 2285,
        "created_utc": 1606492623.0,
        "selftext": "The US has an unemployment problem secondary to COVID (I'm sure many other countries as well). Rather than just giving people free money, why aren't we hiring anybody who wants a job to fix the aging infrastructure of our nation? Isn't this a logical solution? Start em at $15/hour, fixes the unemployment problem.",
        "permalink": "/r/NoStupidQuestions/comments/k23olr/why_doesnt_the_us_government_hire_all_the/",
        "comments": [
            "FDR did that to alleviate unemployment during the Great Depression. The result was the [Works Progress Administration](https://en.wikipedia.org/wiki/Works_Progress_Administration#Criticism).",
            "Have done bridge repair:\n\nThat is dangerous work, and mostly skilled labour. Its not just manual labour. It is not the place to learn either.",
            "That’s exactly what FDR did during the Great Depression. Unfortunately, we’re a mostly service economy now, so most of the unemployed people aren’t qualified to do construction work.",
            "First problem that comes to my mind would be that the nation has no transportation infrastructure issues, 50 states do.  So now instead of your one solution of hire these guys to fix the roads you need 50 different plans that work with each states legal and economic nuances.  Next you would actually need to have these programs pass which is difficult because the majority of people in some of these states will argue every point into the ground.  Even if you were able to get through the red tape to use money to give people some jobs and to put money back into infrastructure, good luck doing it in time to help anyone.  And those are just a couple basic issues of essentially getting anything done in the US.\n\nEdit: Cause this got a little popular I just want to say this is an incredibly basic path of American government.  To those hating on the bureaucracy I understand your frustration but I believe this system works when people want it to.  These issues are vetted by everyone at all levels, people play devils advocate with new policies because they can easily do more harm then good.  Our system used to function when someone was able to present an idea and people listened.  Others pointed out flaws that were defended and people changed their minds when they saw the benefits.  That is rarely the case anymore and anyone who actually leads is accosted by everyone else.  Imagine any president ,does not matter if trump, Biden, Bernie, or any of our leaders tried to enact what FDR did back in the day.  They would be denounced as a tyrant by half the country the next day.",
            "The Works-Progress Administration did this very thing in the 1930s and into the 40s. They built roads, bridges, schools, hospitals and all kinds of public infrastructure. It was part of The New Deal under Roosevelt - which should tell you everything you need to know about how successful it was (very) and how much chance there is of having a program like that happen now (zero.)\n\nPeople were smart, practical and willing to work not only for themselves, but for the good of the country - both at the public level and at the government level. Too many people would never do it, too many politicians would never pass it, too many taxpayers would never agree to pay for it and too many corporations would never allow the government to directly contract projects they feel would prohibit profit.\n\nWe've become far too selfish, divided and anti-government to ever do something like this again, no matter how good an idea it would be.",
            "[deleted]",
            "[deleted]",
            "I don't even know where to start with this one. As a  Finish road grader operator, I have to ask what it is you think people who build roads and highways do? It's skilled, sometimes highly skilled labor. There is a reason we go through a minimum 4 year apprenticeship. Even after that, your not exactly skilled labor.... you just might not be a total loss for the company that hires you. \n So, we start a program that teaches people to build roads and highways ( thats something that already exists but I'll humor you), your a minimum of 4 years out right there. You next take this mass of people with a minimal skill set and have them go out and fix the roads, your going to get rough quality for the next 5 years at least. Nine years later you have a skilled workforce building roads.... but I'm not going to take my skill set that I have built over 20 years and sell it for 1/3 of what I make now. Most of us who do it for a living now, won't.\n  I could go on and on but thats the very basics, from a labor standpoint, as to why we can't just pay random people 15 bucks an hour to fix everything. Thats your 15 dollar an hour answer.",
            "My brother is an engineer for the state DOT. They are ALWAYS hiring and have 30+ positions to fill in his county at all times but very few want the job.",
            "It’s dangerous and it requires skilled work. What we have discovered is that if we just give poor people cash, they’ll spend it on things that grow the economy. (Whereas rich and middle class people tend to save, which doesn’t do much for the economy). Cash stimulus typically returns about $1.60 to the fisc for every dollar spent, so it’s actually profitable for the government to alleviate misery in this way. We should do more of it.",
            "I build bridges we are hiring all the time. People don't want to do the work. They come work for a bit then quit. Like 15% of people make it past 5 years.",
            "The house passed a trillion+ dollar infrastructure bill to work on this. Even trump was pushing a $2 trillion plan. Guess what happened in the Republican-controlled senate.",
            "Well this would hurt me, I'm union laborer who works on roads, an industry that is always hiring, you can literally walk in and get a job, and make more the 3x $15/hour on the first day of the job.",
            "Not all who wander are lost. Not all who are unemployed want hard labor for money.",
            "It wouldn't be a shorterm solution at any rate. You can't just go start building or repairing a road, months or years of planning go into that. And even if you made a law that would somehow shorten these times by a lot, by the time that law was passed and you have even started the massive project of hiring and training workers, the economy would probably be on the uptake again and you wouldn't have that many people that are even able to do any sort of serious roadwork to hire left, because of course those would probably also be the people that find work more easily anyway. Also you need qualified personal to lead those workers you hire and that will be in short supply and again, can't be trained that easily in the short term.\n\nI think we would need to see a lot deeper crisis like the Great Depression before something like this would be entertained again.\n\nAnd that is besides a myriad of other issues that would keep that from ever happening.",
            "I've thought about programs like this. There would have to be standards though. Not sure you want the guy that couldn't get hired at Carl's Jr working on bridges. But there's a whole plethora of simple tasks that would take the load off of several strained departments. I mean hell, just having people picking up trash and cleaning around municipal areas for a fair wage would be productive.",
            "What's you're describing is essentially a type of infrastructure bill. The republicans voted it down. \n\nIt makes a lot of sense to train unskilled healthy men and women and pay them to build infrastructure but you need everyone on board, which is difficult because American politics are in a bad spot now.",
            "Government doesn't directly hire people to fix roads and bridges and so on. They hire companies to do it, and those companies  bring in the architects, soil engineers, welders, excavator operators, flaggers, and the myriad other workers they need to accomplish the task. Most of those people are skilled, already trained, and already vetted by the companies.\n\nIf your county just bought trucks, backhoes, welding machines, generators, a bunch of steel in various sizes, and say an [asphalt paving machine](https://www.equipmenttrader.com/Construction-Equipment/listing/2002-CATERPILLAR-AP-1050B-5007106204), and said \"sign up here if you want to help build roads at $15/hour\", you can predict what you'd get:\n\n* broken equipment\n* dead and injured workers\n* lawsuits from the workers and the owners of property they destroy\n* **no bridges**\n* **no roads**\n\nWhat you are really proposing is to expand the number and value of infrastructure contracts, while at the same time directing the companies that do that work to hire trainees from among the pool of unemployed that you're trying to help. That includes store clerks, pencil pushers and computer operators of all stripes, drug addicts, and so on. The companies will naturally game the system by soaking up all available dollars to hire their nephews and grandchildren and in-laws.\n\nIt's not a simple problem to solve. It's worth trying, but could backfire in many ways.",
            "Personally, I'd rather someone who has experience.",
            "While I would appreciate it, people value themselves higher. There are plenty of jobs to do. Well maybe not right now but when it’s not Covid infested, people do not want to work for 10 dollars an hour because they think they’re worth 15 dollars an hour. So that job never gets filled because people are stubborn. When people say illegals take our jobs it’s because they take the 10 dollar an hour jobs that you don’t want to do. I know for a fact landscape crews always need people but we Americans are lazy to work 8-10 hours of hard labor. So it wouldn’t work out.",
            "Don’t assume that kind of work is something just anyone could do.\n\nOn top of being hard physical labor (which health or just general lack of strength could disqualify a lot of people)\n\nIt’s also a skilled position that requires the proper training. And it’s one thing to want to hire the unemployed (no real downside to prioritizing them) but having to train them cost time and money",
            "Hey, here’s a hammer and some glue, go fix that bridge or building or highway that’s looking pretty creeky.  \nThese jobs require very skilled civil engineers, mechanical engineers, contractors, architects, construction crews, etc.  They can’t be done by just anybody.  These aren’t government jobs.  They may be paid for by the government, but these are completed by highly skilled people from actual firms and companies that specialize in this type of thing.",
            "Because fixing infrastructures costs a lot of money, the paycheck is not the first problem.",
            "Why don’t the unemployed people apply for jobs with the road construction contractors?",
            "First off, you're massively underestimating the amount of skill and physical ability it takes to fix failing roads and bridges.  You can't just throw unskilled labor at it and hope the workers figure it out.  That would be a major safety liability and the job might never finish.\n\nSecondly, someone still has to pay for all the material and no one in their right mind is going to spend millions on material and hand it over to people who are unverified.\n\nThird.  Fixing roads and bridges requires the use of heavy equipment and those operators need to be trained and trusted.  You don't want a person with possible substance abuse problems operating heavy equipment.  Massive safety liability.\n\nFourth.  Typically, laborers are in a union which pays more than double $15/hour.  Like myself, I had to pay $800 up front just to join.  This would be the smartest thing for an unemployed person to do, if someone could front them that initial money.\n\nFifth.  You don't just need labor to fix roads and bridges, you need engineers, planners, safety inspectors, material inspectors, and traffic control.\n\nSixth reason this wouldn't work.  The unemployment situation isn't as easily remidied as giving them work and hoping for the best.  A lot of people don't want to work.\n\nThere already are programs like what you're talking about but mostly trash picking, recycling, or other work that doesn't really need to be supervised.  \"Community service\".",
            "Not everyone has the ability to work in construction",
            "Because that requires jobs skills that many people do not have",
            "A few reasons \n\n1) skills. Training people takes time and money. \n\n2) money. It costs a lot\n\n3) vested interests. In any effort there are well established companies this space. Nationalization of that sector will in effect be met with claims of communism. \n\nShareholders, executives and such will fight tooth and nail to preserve that business. Expect a high legal and political delay. \n\n4) philosophy. In all economics there is a balance between how much labor vs how much capital do you want to allocate. Many items are heavily tilted to capital. It’s more effective to buy heavy machinery to do the work of 500 people than to employ 500 people.",
            "Because they don't care. Most politicians are just sadistic grandstanding narcissists.",
            "Or they could hire professionals.  Do we want it done right or done Russian.",
            "Because the unemployed people are either unable or unwilling to do that type of work...\n\nGo on indeed and look for open positions trades, laborer positions...  I'm seeing hundreds of landscaping jobs (in my area) with a salary of $15 to $20/hr...  If the unemployed were willing and able, these openings wouldn't exist.  \n\nTBH... A good number of people are probably drawing unemployment and doing some side hustle for $$$. \n\n&#x200B;\n\nI have family that owns a  Factory with maybe 200 employees.  The minimum anyone makes is $15/hr.    They offer health benefits and 401k.  Lack of manpower has been the bottle neck for them expanding their business.\n\n&#x200B;\n\nYou'd be surprised how difficult it is for them to find people.\n\n* That can pass a drug test.\n* Willing to show up on time (or at all).\n* Willing to show up sober.\n* willing to give an honest day's work.",
            "They don’t actually want to solve the problem.",
            "They did but there’s also a limit amount of hired people. In California, highway 101 had been working on several sections for 8 months now. Not to mention some metropolitan area also have road and pavements upgrades. \n\nEven if it was government sponsor works there’s limited amount of available slots just like any kind of work. Not to mention the mentality of certain people who love to sue for everything with the “the building obstruct my view of the hills etc.” hence some construction projects get stalled to oblivion. The shopping mall project near my place had been stalled for years due to those people who love to sue to get some quick cash vs let the project finish and get a job over there.\n\nThat’s just the nature of US, the country that probably has the highest number of lawyers.\nWe can’t have nice things regardless how good it might bring. California probably has bullet train connecting Sacramento to Bay Area to LA by now if only those trees huggers stop suing for 5 years.",
            "Because rich people need tax breaks.",
            "Corporations don't like it when the unemployment rate is too low. That means less people desperate enough to take a position with shit pay and no benefits.",
            "Bernie wanted to do that, was a major part of his platform. Blacklisted by the media and the Democratic party. Government employment programs are bad for corporate profits.",
            "Because Democrats and Republicans would both rather privatize that work than try to create more government jobs which tend to have hefty paychecks and benefits.  That being said, there’s no reason; it’s imperative.  Our infrastructure is a joke, and it would save the economy overnight and propel the US back into the kind of prosperity we haven’t seen since WW2.",
            "Here's why.\n\nYou keep voting for the GOP.\n\nStop doing that and maybe we can start taxing the rich again, using that money to pay off the debt(after we stop RUNNING A FUCKING DEFICIT) and pay people to work in construction again to work on infrastructure projects.\n\nStop voting GOP.\n\nSeriously, just fucking stop.\n\nRon Desantis is such a piece of shit that he's banning localities in Florida from being able to put in place and enforce mask mandates.\n\nSeriously. DON'T VOTE GOP.",
            "Because contrary to popular belief, road work manual labour takes specialized training (you're around hazardous materials and/or operating heavy machinery), some skill and ability to do math, and to be physically fit. \n\nEven the flaggers need to be specially trained, can not be distracted easily, and need to have excellent reaction time. \n\nThat disqualifies a huge portion of the population.",
            "The right would scream socialism and cry",
            "They do, after they are convicted!",
            "I have always argued that Republicans are half right and all wrong. Well at least I did before Trump came around, and there was a real fiscal conservative stance. Truth be told, we shouldn't just give money away. There isn't any return on investment. We should however, pay any unemployed person to further job training and or education. If we educate people, teach them a craft or a trade, they majority of people will become tax paying citizens. Thus increasing our tax revenues. Sure it costs a bit more on the front end, but after 1 generation, the program would be self funded by the tax dollars of people who were previously poor. That's the concept of investing our money, that no one seems to be behind whatsoever.",
            "Do you know how to build a bridge?  Neither does an unemployed waitress.",
            "Maybe because rich people need tax breaks.",
            "It would be illegal. Under current laws all workers must be paid prevailing wages. This is so federal workers don't undercut wages of local construction unions. So before any work can be done, a survey of the wages in the areas where the work is to done is completed. Once that is done, which takes 6 months to a year, people can start being hired at the prevailing wage.",
            "I _think_ the unions would fucking hate that. Just saying.",
            "I don't understand the unemployment numbers where I live.  Everywhere I go I see help wanted signs.  I really am a bit confused.",
            "First of all this has been done. And done well actually with FDR, and somewhat in recent years. \n\nSecond problem, is there is a STARK difference between Homeless and Unemployed. As a nation we typically bounce between 3-15% in unemployed, and homeless/unwilling to work is NOT included in that number. That number of unwilling to work (homeless) individuals has been SKYROCKETING in recent years. I say this as a self proclaimed democratic socialist as well. The homeless problem in America has deeper roots than what FDR was dealing with awhile ago. He had millions of homeless men begging for work. In 2020 we have millions of men begging for a stimulus check.\n\nAnd the weird part is the current millions of men who are begging for a stimulus check actually have valid arguments regardless of current events, most being the vastly growing income gap of the top 1% which is actually a lot more scary than people make it out to be. It’s legitimately the early signs of a failed state.",
            "Short (undiplomatic) answer is the Republican party. Over the last 40 years the government has cut taxes (especially the top tax rate) so much, and introduced so many austerity policies, we literally cant. The Democratic Party has not helped in this as they're not as unified, and have a decent number of corporatist members still. Unfortunately there's not really an easy way to fix this. It's going to take a huge push by, and the collective political will of, the entire citizenry of the US to make the necessary reforms. With the country divided as it is now I'm not entirely hopeful on that.",
            "Repairing infrastructure requires qualified contractors, and manpower is not the limiting factor. Most contractors in the northeast are staying busy and maintaining their workforce; I believe most are hiring. Also the government contracts for construction work, it is not preformed by government employees. \n\nTime to abolish liberal arts programs :D",
            "Sounds an awful lot like socialism to me. Fucking commies. \n\n/s obviously.\n\n\nThis is exactly what happened under the New Deal under FDR. Have people work, and helped with infrastructure and other projects.",
            "Because they dont want to",
            "Shorten the question to \"**Why doesn't the US Government fix our failing roads and bridges?\"**\n\nAnswer: Because they don't want to. They want to build new things that \"show their accomplishments\". Fixing things only reminds people of what someone else did. This is a major issue in the US. They'd rather build a new bridge, then fix an old one.",
            "I almost voted for Obama because this was one of the things he mentioned he was going to do. Never happened though. Biden is saying again. Who knows. I'm pretty sure he'll just bring back the individual mandate, costing me thousands a year and, and call it a day.",
            "A lot of people are bringing up The New Deal and how the government doesn't want people to fix things but I see this more akin to the Five Year Plan. \n\nThis isn't simply getting ol' Jim-Bob's unemployed cousin to run out on the road with a bucket o' tar and a shovel, filling every hole he sees. The amount of prepping, teaching, guesswork, resource allocation, supervision, regulations, inspections etc. is unrealistic to say the least. There are companies with the trained men, equipment and experience to do this and they are hiring qualified individuals.",
            "I've been \"playing in the dirt\" for 17 years. This type of work isn't for most people.  12+ hour days with no ac or heat breaks people. And us \"dumb laborers\" actually do a lot of math. It sounds easy till you try and do it. You don't just hold a shovel. And you better be in decent shape.",
            "You can’t just have random people that don’t have the skills try to fix and work on roads and bridges. Many people also wouldn’t want this because having to pay thousands of more workers at a large starting wage of $15 an hour would most likely mean an increase of the amount of taxes that people will have to pay. Also, figuring out what needs to be fixed would also be an issue. What is considered a failing road and bridge? Do you fix every pothole in the road? How severe does the damage have to be? There’s not enough skilled workers to figure out how to solve this problem, especially when many skilled construction workers want higher wages than $15 an hour.",
            "Because that costs billions of dollars and we need more fighter jets God dammit!",
            "FDR has joined the chat",
            "You mean like the Corps of Engineers?\n\nHonestly though too many people don’t want to work, are too lazy or feel that type if work would be beneath them. Lets get real",
            "In this thread: a whole bunch of people who think the world is way more simple than it is.\n\nThis isn't like \"vote republicans out and you're good\" lol",
            "I’m unemployed from working in front of a computer. \n\nWhat the fuck am I going to do to build a road?",
            "Manual labor is not unskilled labor, thats an extremely privileged viewpoint.",
            "Because the skills to fix a bridge are very specific. I'm sure that if anyone wants to learn they can, but most people consider construction to be \"below them.\"",
            "Because the current US government would rather fuck your corpse than help you.",
            "Because then the several $3,000 chairs in every senators office would have to be replaced with something a poor person would use to pay for training and materials to fix our roads. Its not a lack of bodies. Its greed keeping our roads like this.",
            "The answer is complex and there are going to be many valid reasons. The most straight forward is that republicans do not believe in programs that will make the government larger, and the senate has been controlled by republicans for a while now.\n\nThat said, they have no problem if the military gets larger under the DoD or the DHS, they just don’t want programs that are wildly beneficial to the average person. Digging deeper, their base is rich people and evangelical Christians and neither of those groups supports broad social programs.",
            "The current administration would never go for something like that, because it's too communist.",
            "Pretty much every position on an infrastructure job is a higher skilled position. It isn't like the old days when you needed hundreds of dudes with shovels to move earth. I do agree though that the government should offer more low level jobs that benefit the employee, and the community.",
            "There is a concept called job guarantee that is very interesting and the only reason(that I know of) that it isn’t a “thing” is because parties can’t agree to go thru with it",
            "I’ve been advocating for several years we need to bring the C.C.C back.",
            "Drug testing.\n\nCertification.\n\nLicensing.\n\nTraining.\n\nInsurance.\n\nTurn over.\n\nLiterally every construction company that deals with roads. (This one mainly)",
            "Because according to the Right, that's Socialism.",
            "Along with the problems the top couple of comments have said, there's also the fact that a lot of the people who aren't working are people who *can't* work, not people who just can't *find* work.",
            "Because then we would have to budget to fix our roads and bridges in the first place. The reason they are in such a state to begin with is not properly budgeting for maintenance and/or replacement. Sure, hirijg a bunch of unemployed workers fixes the issue of finding labor, but it doesn't cover materials and the training most of that unemployed workforce would need to repair or replace our infrastructure in compliance with building code.",
            "Because it costs money and that would benefit the country as a whole and we can't have that",
            "Because the government no longer cares about taking care of it's citizens. It only helps those that before or afterwards line their pockets.",
            "If you have any questions about why the US government doesn't help people who aren't rich, then know it's because they don't care about people",
            "Amazon is doing the same thing. Some people dont want to work. Or think they are too good for 15.",
            "Some1 once hired a lot of people to build highways.",
            "because it's expensive and ineffective. giving people money works better.",
            "Those jobs are readily available. It's more a matter of people thinking they're too good to do manual labor.",
            "Because no skill is needed to construct critical major roads.",
            "[deleted]",
            "Construction takes skill and it’s hard labor so you don’t want a bunch of newbs running around because it’s dangerous.",
            "Uh, do these unemployed people have the skills and ability to consist infrastructure repairs?",
            "Cause then they have to pay them. And the goverment would rather burn money like the joker in dark knight then give it to the 'poor'",
            "The short answer is congress. The states senators have wisened up after pervious measures that were attributed entirely to one president or another and set in place enough legislation to stop the same approach twice.\n\nIf you want a change in government in the U. S. just understand the president is the figurehead for the congressional majority. Fire senior senators for change, the president is a Twitter figure head.",
            "Something something... socialism... something something...",
            "This will probably go unnoticed now this post is on all, but Australia has had a similar system in place since the 90’s. As part of our (robust) welfare system, long-term unemployed have to meet certain “mutual obligations” - apply for a certain number of jobs, undergo training, or participate in certain federal, state or local government work, a program called “Work for the Dole”. It’s often not *fun* work - and it’s certainly not road building - but there’s opportunities for upskilling, and it frees up funds and people to do the more skilled work.",
            "google \"the reserve army of labour\"",
            "Because they would then lose *two* campaign issues to run for office on.  No more \"infrastructure must be fixed,\" promises, an no more \"homelessness is a danger that must be addressed\" promises.",
            "The government doesn’t care. Which is why Domino’s ends up repairing roads instead. Because people want roads, so they’ll build and fix em if they have to.",
            "Because the local politicians have been pocketing the tax dollars and federal subsidies for decades now and the coffers are actually empty.",
            "We’ve been doing a shitload of roadwork in Oakland. But, we’re dirty commies in California. It’s not something real America would do.",
            "id do it. shit ask Cuomo to do it for new Yorkers and fix the Subway",
            "1. A lot of that work requires semi-skilled tradespeople; we don't build bridges by having 75 people pound rivets into steel girders like we did during the WPA era - workers operate somewhat complex pieces of machinery to do the job now. so you just can't take joe blow citizen and make him a bridge builder anymore\n2. unions who provide the manpower won't like this as it (if you could do it in light of #1) creates a wage-depressing oversupply of labor.\n3. contractors who normally bid for those projects and enjoy those profits won't like this, either.",
            "Shits expensive. And not everyone is a road builder. Some people are literally only good for being homeless.",
            "If only it were that easy 😂😂😂😂 the only problem with that solution is not everyone can fix roads and bridges, you actually need schooling and training to do that sort of thing.",
            "Hello, specialty contractor that focuses on structural restoration here. Couple of big issues:\n- Things aren’t how they used to be. People LOVE to sue over literally anything, so using guys that might be a bit ham handed due to lack of experience leads to lots of risk. \n- An overwhelming amount of homeless have either unchecked mental health issues or rampant drug problems. *THIS DOES NOT MEAN ALL HOMELESS. WE ACTIVELY SEARCH FOR AND EMPLOY THOSE WE CAN, PLEASE DONT JUMP DOWN MY THROAT*. Due to these issues not only do a lot of guys not want to work the same crew with them, but a lot of supers don’t like them on their job due to potential theft or breaking equipment while in the wrong mindset. \n- Minimum wage with manual labor isn’t the same as manual wage anywhere else. Where I work the minimum wage is like $10 or some shit, but you won’t be able to find any simple laborers let alone skilled trades for less than $18. Most companies have a hard time arguing that pay if they don’t get their moneys worth. And if the government subsidized it then other guys would follow suit of efficiency because why the fuck not. \n- Unions would become a fucking mess. Tensions are high with A LOT of trades all over the nation currently. Creating an environment where non-unionized labor can once again thrive is a very slippery slope (yes I understand that’s a shitty argument, but it’s true). \n-Do you really trust the craftsmanship of Billy who was pulled off the street on Thursday and had never touched a tool before to repair complicated structures...? Let them fix potholes, remove/replace busted sidewalks, perform menial repairs that would occupy their time while still being paid.",
            "Done it before. CCC.",
            "Because it wouldn’t do to give the people the idea that the government can do things. That doesn’t fit the narrative and goals of the conservatives who want a government so weak they can “strangle it in a bathtub”. \n\nIt also would give credence to the idea that the people working together for the good of all can accomplish great things. We have to believe that only corporations working for the good of a few can do that.",
            "Terrible idea. People are out of work currently because there is a pandemic. You really dont want them to be put back to work to spread said pandemic.\n\nYoud also need to pay much more than $15/hr. Infrastructure work is grueling work.\n\nWed also need an actual 100+ year plan designed first. And you can bet your ass that fossil fuel companies will fuck us over.\n\nThen theres the issue of the budget... Its necessary, everyone wants it, but damn is it going to be a bill. And \"but muh deficit\" is a major argument people listen to for whatever stupid reason.\n\nAnd ultimately; people need IMMEDIATE aid, else the economy will collapse. Even if you were to give everyone immediate stable jobs and people somehow didnt start dropping like flies due to the pandemic, without a multi-month stimulus to deal with crisis expenditures and keep money flowing in the interim, everything will fold anyway.\n\nThe reality is we live in a world where how we do things is massively outdated, and soon will only need like 10% of the population working to support everyone. Our idea of societal value and work has to change.",
            "It costs money and they only spend that kind of cash to destroy roads and bridges overseas. This is a legit answer.",
            "Canada tried somethings kind of like that but for students that would be unable to get a summer job because they are often in the service industry. Students were supposed to be able to volunteer and get some compensation (and work experience) unfortunately our Prime Minister chose a charity he had way too many questionable ties to, to manage the hundreds of millions of dollars, so it got cancelled. (Canadians feel free to change and add what I've got wrong but that is the jist).  It was a good idea though and it seems like encouraging people to volunteer in whatever capacity they are able, for government money is better than giving people money for nothing. It could at least help to build community, skills and purpose.",
            "It’s better to contact to businesses who know what they’re doing and construction workers are often very skilled in their trade. It also requires hard work and often lacking in the unemployed",
            "This question is peak Reddit",
            "Because unemployed people are not qualified to fix an engineering problem that people's lives will depend on",
            "Contrary to popular belief, this is a highly skilled job that pays way more than $15 an hour.\n\nA lot of people can't do that job either physically or mentally. You don't want my anxious ass building bridges, for example.",
            "Browsing this thread and wondering if anyone is going to point out not everyone can do manual labor such as construction or are we all just running off the assumption that everyone who is unemployed is a physically fit, and healthy and neurotypical?\n\nCause a huge percentage of people with disabilities are unemployed.",
            "That would require a functional House, Senate, Congress, and President working together to create a functional, thriving society.",
            "Because Bernie is not president and there is no job guarantee program",
            "Instead of making already poor people do manual Labour so they can eat how about we get the rich to pay their taxes. That’s how America was built, by the rich paying their fair share so that you could build roads and schools. Tax tax tax. That’s how you built your country and a bunch of rich, selfish cunts are trying to tell you it never happened!",
            "I say hire those with some kind of related knowledge not just anyone who is unemployed. I would not want some unemployed waitress/waiter working on a bridge. Not unless she/he has a degree in structural engineering. It sounds like a good idea but having the proper knowledge is probably why this does not happen. You need a properly trained workforce.",
            "That would generally in today’s atmosphere be considered the “radical left” ideology. That’s how bad of a shape this nation is in.",
            "Not everybody knows how to fix roads and bridges",
            "Because this isn’t the shovel and pick axe days. Building infrastructure is mainly experienced machinery operators.",
            "You realise that takes skill, right?",
            "That's communism \n\nWe prefer unemployment and racism",
            "Imagine someone on welfare\n\nThey sit around and do nothing and get paid - a drain on the economy. This is because they take money out of the system without creating wealth.\n\nImagine someone on welfare who is asked to fix a bridge.\n\nThey now have to fix a bridge, but are still taking money out of the economy without creating wealth.\n\nLarge public works often have a detrimental impact on the economy as a whole.",
            "ITT: people who think heavy construction is as simple as digging a ditch\n\nLmao yeah, reddit really values the working class - no respect for the skill/dirty work that goes into keeping peoples lives running smoothly",
            "I honestly think many of the unemployed people in America would be unwilling to do the type of work that is required (i.e. manual labor, likely in difficult conditions sometimes). additionally, I don't think the public would actually be satisfied by the program, no matter what it was called, because it would be \"forcing people to do hard manual labor for a low wage\" (even if it's $15/hr). There are already many well paying jobs available that people just don't want to do (shipping industry, carpentry, electric, construction, landscaping, etc.). not to mention the military, but that's off the table for unemployed people who need to pay back loans because they shouldn't be \"forced to risk physical and psychological damage just to get by. \"\n\nTLDR: no one would actually go for this because of the type of work that it requires.",
            "Great question! Mitch McConnell and the rest of the  Republican party (tools!)Their top .001% wealthiest campaign donors would rather pocket tax breaks and profits than pay fair wages for hard work. They have more money than any family can spend frivolously in multiple generations, but they want more!! They've developed a megalomaniacal personality disorder, and they don't give a shit about anyone else.",
            "Because that's socialism, brother /s",
            "You can't hire just anyone to do just anything.  If their skillsets were for retail it will take a lot of work to get them to be able to be useful in other things.  \"Fixing bridges\"?  Could you do that?  You've welded or built forms for concrete before?\n\nThe other group of unemployed people are unemployable people, and although they may find their thing in the process they're not going to be able to be much productive good.  \n\nThis is in no way a criticism of these people, \"there, but for the grace of God, go I\", but the idea you can just put them in a ditch with a shovel is both insulting to the ditch digger (who works harder than most of you) and unappreciative of the skills of people who *don't* dig ditches and build bridges.  It would take a lot of oversight and significant injury risk, and most of those involved would be mostly useless (and no fault of their own, and of course some fault of some).  \n\nI've been on habitat jobs with team of whatever people trying to do a charity drive thing.  About 10% of the people were working at all, the rest were waiting and eventually talking and eventually that's the day. Are we willing to accept that some people will be getting paid just to be there waiting sentry for the next time they can be useful?  I am, i know what the work takes, but most won't be.\n\nIf you have a good idea, you lead the charge, lead by example.  I've heard \"okay here's how you do it\" by bad project managers attempting to get more efficient work out of their labourers and then stopping the work dead, getting frustrated with *their own* ineptitude and then leaving enough times to know where the actual problem is. It ain't the labourers.",
            "Because that means that someone has to form a logistical plan...They actually have to do work!?  They don't want to do work...come on.  They will hire a committee to come up with a plan and then skew it so their families benefit from said constructions.  Don't you know how these things work!?",
            "As you can see from most replies it's a clear combo between the people not wanting to do that kind of work, the lack of skills and the absence of interest from the government to pay. We are doomed to fail.",
            "I think the same about refugees; why don‘t we just let them work, when they get money/housing, etc. Anyway. It would help them to integrate and learn the language.\n\nBut it would probably cause local people to lose their jobs and more refugees to come, for obvious reasons.\n\nEdit: but I still think a lot about this. Refugees or long term jobless people could do jobs that don‘t even exist, like they could hang out with old people or with handicaped people (helping them with grocceries, whatever)",
            "Because the United States spends $1.6 trillion per year on the war machine in one form or the other, which is pretty much 50 cents out of every single income tax dollar. The direct Pentagon allotment of $700-odd billion is just the tip of that particular iceberg, the government stats are deliberately obfuscated to make it look that the US isn't spending $1.6 trillion, when they are.\n\nThe rich, also, are busy siphoning out as much money as possible, they're literally exit scamming the US. \n\nThey've defunded the IRS, so the IRS no longer has the resources to go after the rich offenders, so they are beating up on the poor and the poor middle class instead.\n\nAnd of course, the culture is toxic and the idea of public works to improve the nation is anathema to the right-wing loons in the Republican party, unless of course they can somehow get in on it and siphon out most of the money for themselves and their rich pals.\n\nBasically, America is a broken mess, an oligarchy that's headed for a full on fascist rule, and it's probably way too late for America to pull out of the death spiral. Empires all end in similar ways; America is the Roman Empire now, burning down quickly.",
            "Sounds awfully lot like communism.../s \n\nThat’s the response you will get or worse from conservatives, even if they are becoming destitute and there life is falling apart around them.",
            "Do you trust meth pipe Mike to use heavy machinery?\n\nHonestly these are trained professions, you can’t just hire unemployed people with no training to do it",
            "Because that's socialism brother and we can't have anything that is for the betterment of the working class here in America.",
            "Well someone still needs to pay for the repairs, including these newly employed folks' wages. Then someone will also have to train these folks on how to do the job, which is a pretty involved, skill based job so that would also take a lot of time and money as well. An idea like that seems great in theory but as soon as you start to work out the logistics on paper you're gonna hit a lot of bumps in the road (pun very much intended).",
            "Infrastructure has a serious problem: in almost every situation, the infrastructure needed to support a town or city costs more to maintain than said community has to pay for it. You can find graphs of the \"profitability\" of many major cities, basically a visual representation of what neighborhoods cost money by existing and which generate money. The neighborhoods that generate money are a tiny fraction of every city, and not enough to pay for the entire city's infrastructure.\n\nTldr? There's literally not enough money to do that.",
            "1) The Feds only provide the money (which they actually borrow from a private institution with government oversight) and not the road labor.\n\n2) The state and local governments provide the labor or the contracts, or sometimes both.\n\n3) If the Feds did the hiring, OPM would have to figure out the classification series, budgeting would have to be put in place, wage grades (WG) would have to be assigned, decisions made about terms vs permanent, competitive vs excepted service, General Series (GS) positions would have to be created in whichever bureau/agency at the Department of Transportation got landed with the project so they can properly manage the project, and nothing would be ready for 5 or more years, when this plague footing will be over. Maybe. Hopefully. Wear the damned mask.",
            "Sure im jobless. No previous building/engineering/construction experience. Sure ill make your bridge.\nidiot.",
            "Training? It has never been easy to build a road and building has changed tremendously since FDR. Do you want some random never been handy guy/gal to torque bridge bolts too loosely, run an excavator over a hill, or fail to set the concrete properly? The government doesn't provide work crews and in most cases they throw out a job and choose the best bid.",
            "Beyond the problems with training people to build bridges, this is a controversial move from an economic standpoint. Look into Keynes and the arguments against this type of government program.",
            "Because not everyone who is unemployed knows how to do that",
            "Have you forgotten when Obama spent a trillion in stimulus on \"shovel-ready projects\"?  Yes, you did, because very little got fixed.\n\nPrograms like the one you are suggesting sound nice, but do not deliver.",
            "Random unemployed people do not have the education nor skills to perform rehabilitative infrastructure construction.",
            "There are a lot of people on here talking about FDR/WPA/CCC, but construction is a lot different now than it was then.  So are other safety nets.\n\nConstruction to a large extent is no longer unskilled labor.  There are unskilled jobs, but they’re easily filled and not relatively a huge percentage of the pool, and there are huge machinery costs.\n\nIt’s also worth pointing out that the WPA paid people a time-adjust rate of about $900-1,000 per *month* (depending on how you calculate the adjustment)",
            "I don’t believe labor is the problem as much as the cost of construction. I used to do road/bridge construction it’s quite an undertaking with lots of skilled operators and carpenters in addition to unskilled labor.",
            "This kind of job requires some knowledge most do not have. \nNot that simple.",
            "Where would the money to pay these people come from? There are three options:\n\n• Print Money: generates inflation and currency devaluation, which more or less defeats the purpose.\n\n• Raise Taxes: hurts businesses because people would have less money to spend, and make them hire less people. You would gain the construction jobs, but lose jobs everywhere else, which more or less defeats the purpose.\n\n• Borrow Money: increases the debt and would force the government to increase the interest rate, desistimulating consume, thus hurting businesses and making them hire less people. You would gain the construction jobs and lose everywhere else, which more or less defeats the purpose.\n\nThe government can't just sweep in and fix everything. The economy is governed by the market, and not by some burocrat in Washington.",
            "Sounds like the famine roads of Ireland... except they were slaves",
            "1. The US doesn’t have an unemployment problem. Prior to the pandemic the US had one of the lowest unemployment rates in the Western world.\n\n2. You can’t just hire anyone to do these types of construction jobs. Some jobs are fine for unskilled labor but you can’t have 100,000 people in unskilled labor roles holding stop signs or moving cones if you hope to finish a major project. You need people who can operate heavy machinery and do a bit of engineering, etc. Not to mention the basic physical requirements to work construction likely precludes a large chunk of the population right off the bat.\n\n3. There isn’t a shortage of skilled or unskilled labor. There is a shortage of heavy machinery, materials, engineering/architecture, and capital to fund these types of projects.",
            "This is incredibly insulting to the people that do repair roads and especially fucking bridges. Do you think it just takes a bunch of people with shovels and wheelbarrows full of asphalt? Absolutely asinine thinking right here. Just pay people $15 to repair fucking bridges. Jesus christ. You have no idea what you're talking about.",
            "Because that's socialism!!!!",
            "In case it isn’t obvious by now. The US government doesn’t care about its people",
            "Unions",
            "Because that makes too much sense",
            "Because that would involve actually allocating money to helping people. The government can't do that... That's socialism and is \"evil\". In the USA the government is a business, it exists to make money."
        ]
    },
    {
        "post_id": "9dyomk",
        "author": "xxquikmemez420",
        "title": "Since students sit in classrooms for up to 8 hours a day and tuition is very high, why are we still sitting in the shitty blue plastic chairs from like 60 years ago?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/9dyomk/since_students_sit_in_classrooms_for_up_to_8/",
        "score": 20574,
        "num_comments": 894,
        "created_utc": 1536355253.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/9dyomk/since_students_sit_in_classrooms_for_up_to_8/",
        "comments": [
            "Generally the more sturdy a chair is, the more uncomfortable it is.\n\nSchools have to buy a crap ton of chairs. They want them to last, be lightweight, and be easy to clean.",
            "Somebody asked that once when I was in high school. The teacher said it's to keep us from falling asleep. That and turning the thermostat down to 60 in every classroom even in the winter. ",
            "You might be surprised just how much those things cost at retail. i stumbled onto a 1980s furniture catalog full of office and school fixtures. They wanted an astounding $1000 for a 4x10 fucking CHALKBOARD! The cheapest chairs in the whole catalog were the teeny tiny preschool-sized ones with the three vertical holes in the back. They were $200 EACH.",
            "Get you a cushion off amazon cuz.",
            "\"If it doesn't make sense, it makes money.\"\n\nIt doesn't make sense that you still have 60 year old chairs. So someone must be profiting off that decision. ",
            "in college we aren't ",
            "Money doesn’t go towards school supplies...when people bring that shit up about taxes shoot that down because it’s incorrect. Money goes towards the companies that provided the textbooks. Almost exclusively Pearson. It’s an oligarchic company that has determined our education laws and set our standard below Eastern European countries.",
            "Schools have no money. My wife teachers in public school. We bought 10 yoga balls with pool noodles to hold them in place. We got 10 plastic crates and made cushions to go oh them and 10 big floor cushions. I bought a bunch of tables of his heights. Kids love them. Schools provide them? Hell no. Let the schools do it you get something designed in 1910.",
            "TL;DR if it still works, you're still gonna sit on it.  Saves money for the University since they don't care that much. More students need to speak up about it to make changes happen.  Too many generations of students that just make do and use the shit chairs.\n\nI'm talking only universities here, not middle or high school. OP may have meant that.\n\n\nOn a throwaway...\n\nMay get buried but I hope I can help with an answer from my day to day experience.\n\nOk, old chairs in class right?  So we have to ask the question, how does your school do with fixing things?  Is it pretty good inside and out? Is the outside shitty but the inside good?  Is the inside shitty but the outside good?\n\nYou say 60 year old chairs, so let's go with inside shitty, outside good.  Your school puts a lot of effort into making sure it will look good, online and in physical tours.  Landscapers are going all the time and the grass is definitely nice and cut.  Windows washed, you may run into custodial/janitors outside but never really inside...\n\nSo with that, chairs/furniture are the last thing on any Facilities manager's mind.  Hey, if it ain't broke don't fix it.  Chair 60 years old and works? That's some /r/bifl, buy it for life material my friend.  We ain't getting new ones til they all go down.  Lights work? Doors open and close? Enough seats for the amount of butts?  Check, check, check!  Let's move on to the 60 year old toilets and that nice fountain outside, needs to be shiny!\n\nPoint being, you need to see what your school type is with the inside/outside question first.  The 60 year old chairs are from an era of working until they melted in hot magma.  The chairs in the class aren't to keep you awake or anything like that, it's just works enough to last an entire day.  They are kept and maintained as a cost cutting feature.\n\nThere are new, good desks out there and they work well but have to get approvals from a thousand people to make sure they work.  Plus, they are most likely bigger than those 60 year old chairs, so the capacity is definitely going to get trimmed in those rooms, can't have that, so we're not buying because we have a ton of new students coming and need all the damn room we can get into these classes.\n\nAlso, private/public is something to pay attention to.  Your school is most likely public, so again they won't spend money on things that seem simple, like chairs.  Public school but good chairs?  Means that they are using money INSIDE AND OUTSIDE, probably missing a sports team or two.  Private school? If your ass doesn't have a good chair, they are either late to fixing that particular class/place, they are waiting for a catalog to just pick a chair, or they are TERRIBLY mismanaging money.  I've toured both types around the country, it's just crazy what private can do \n\nAll in all, seems pretty simple right?  Mostly sad, but simple.  I'm working to get better everything on the inside.  Tough to get change, but the best way to do it is actually from students saying that the chairs/desks/anything in a classroom is awful and needs to be replaced.  I've been yelling about it for a while now, and nothing seems to move the administration more than one student pointing at it and going, nope this sucks.\n\nDo your part! Make a change!  I'll be glad to bust my ass and get it done for you.\n\nWould you like to know more?",
            "So I can crack my back on it.",
            "As a Janitor at a middle school let me tell you we straight up just don't have time to really clean them. \n\nOut of my 8 hour shift 7 of it is spent taking out garbages, cleaning bathrooms, mopping and vacuuming. The last hour is spent locking up the school and doing other weekly chores (Mopping stairwells, cleaning windows, spraying down locker room showers). And when we have any kind of meeting or event it really fucks up our night and some of the above stuff does not get done\n\nThe only time we really do stuff is in the summer, winter break, and spring break. But even then we are usually doing other maintanence that we can't do with kids around, like striping and rewaxing any tile floors. Cleaning tables and chairs is one of our lowest priority jobs and if it gets done it will be right before school starts.\n\nFinally we really do try to ditch what old stuff we can but we have to have something to replace it with and unless we literally don't have enough chairs for the kids the district won't give us money to buy new ones and even then it usually is only enough to replace the broken ones",
            "The money is going straight to the school's beneficiaries and the university president, among other places",
            "Because football fields need multi million dollar fake grass.",
            "As an ex-academic: because schools care more about branding, Chancellors' salaries, and superficial improvements than they do about the practicalities of student learning or staff welfare. ",
            "See that shiny new stadium, and the new training facility, and the coach making about 1.5 million a year? That's what tuition pays for",
            "no one is sitting for 8 hours a day. be realistic. ",
            "Because education is a business. And you don't make money buying chairs if you don't have too.",
            "Maybe in your college ",
            "Yeah why the fuck am I  (5' 11\", 65kg) sitting in the exact same model of plastic chair that I sat on in kindergarten ( 2 years before starting school) when I was 1'11\" ?It hurts, it's not comfy, it's ridiculous. ",
            "Heck we don't even get nice toilet paper. We get the ones that pills up and gets all over our buttholes and hands when drying off",
            "You're still sitting in the shitty blue plastic chairs because decking you out with nice soft comfy chairs would hit your school right in the budget.  They have a limited supply of money and you getting something more expensive from one place means somewhere else goes without.  Your call. ",
            "If you're going to school for 8 hours a day then you probably aren't paying any tuition so this question is... yknow. ",
            "Profits ",
            "[deleted]",
            "They're cheap. Public schools like cheap. Nuff said.",
            "[My school's got these now.](https://i.pinimg.com/originals/7a/6a/e7/7a6ae7744ff23ed94aff8ec7d3c07c86.jpg) ",
            "So I teach middle school and I have sat in the student chairs many times and they are TERRIBLE! My only affordable solution is that the school gives me a very nice comfortable office chair so I let the student of the week sit in it all week during class since I never sit down during the day. The students love it and I wish I could get them all comfy chairs but on my salary it would take like 60 years so this is the best I can do! ",
            "Your question answers itself: you keep paying for it.",
            "cuz skools need big expensive foot bawl teams",
            "Because studying causes many students to feel sleepy. And guess what's the most uncomfortable thing to sleep on.",
            "Because facilities and equipment have almost nothing to do with the crazy rise in tuition. The two factors that account almost entirely for that are (1) administrative bloat and (2) reduced per- student state finding.\n",
            "Money at a university is an intangible.  It just exists to be used.  My mom and sister work for a pretty big university here in Canada and they seem to just approve any spending with a big stamp.  First off, everyone gets like 3 months paid sick leave a year.  On top of that they get 3 months paid vacation.  The other day someone in my sister's office mentioned something about a task being easier if they had Ipads.  The department head issued ever one of them personal Ipads.  Like theirs to keep.  Your insane tuition is just thrown around like it's nothing.",
            "Bold of you to assume that any significant amount of your tuition actually goes towards improving your university experience.",
            "Haha you get plastic....in college my Dept had mostly wooden from the 60s. F-in blew.",
            "Because our education system sucks",
            "Simple answer: schools feel that they need to pay the most money to the “best people” to serve as President of the school and other development roles.",
            "My school has decent chairs in most places, uses long tables if you’re not in front of a computer, wheeled chairs in front of computers, and several places on campus that have lounge areas that have couches. They also recently installed a massage chair. There are still classrooms with shitty chairs, but they are being phased out. My school is not cheap, even compared to other schools, but you can tell they put (some of) it to good use.",
            "They were comfy then. I'm 69😼",
            "$",
            "Depends on the college within the university for mine. Biology and chemistry buildings were shitty and out of date. But the energy building (oil) has the fanciest tech labs and the business college have fancy cushioned seats on swivels in the auditoriums.  Pretty sad. ",
            "My high school had chairs from like, the 1960-1970s. They were wood and had decades of gum/carvings on them.\n\nWe neglect our children's educations. Then we take in folks from foreign countries that actually put in an effort to educate their children and they take over entire business sectors. The Mexicans aren't your problem, your kid's dipshit education is.",
            "That's not what chairs used to look like at schools. When I was a kid, the chairs were wood and attached to the desks, [like this](https://thumbs4.ebaystatic.com/d/l225/m/mB1Z7f1NrNeS-wsXkIEnEgQ.jpg). Today, kids get pull-out chairs, perhaps because of obesity. \n\nI graduated high school in 2001, and there still weren't pull out chairs back then. I think the pull-out chairs are from the last decade or so. Not the same ones \"from like 60 years ago.\"",
            "Similar question, why do we have to pay for text books? With all the money we put into tuition, shouldn’t that be provided for us?",
            "Did finances for charter schools, admin makes way too fucking much money. Thank God I left.",
            "If you're in college and you're in 8 hours of class a day I feel so sorry for you holy shit",
            "Because all of the money goes to administrative bloat and athletics. \n\nGo to the admin offices or the sports facilities. They have *nice* shit. ",
            "Man I saw so many people mostly girls have their hair ripped out by it getting caught in the chairs back in the day. ",
            "Wait, are people using these chairs at university? I only saw them until high school, and tuition was not high at high school.",
            "Gotta pay administrators.",
            "because the football team, and the basketball team need nice uniforms",
            "Because all the money goes toward administrator salaries. Check out your institution's 990 online. It's \"fun\" to see how much your university Chancellor/President makes.",
            "The largest expenditures of an educational institution' budget tend to be employee compensation. ",
            "Half the reason I chose geology as a major was because they had some comfy ass seats in their main lecture halls ",
            "Lol you think they're spending the money people invest in school on bettering the quality of life and education for the students.",
            "Hey! I make them shitty blue chairs. Trust me they won't last 60 years, most of them don't make it out of the factory ",
            "Because fuck you that's why. More money for the university.",
            "Fun fact: it would be illegal for an employer to make an employee sit in those chairs at work, but it's okay to do it to children.",
            "Because newer chairs won't get you to pay more or get more students to show up.",
            "Most administrators are pretty much \"what if embezzling was somehow your job\". That's why. ",
            "Because that tuition is not designed to fucking make your experience any better. That was the case you'd have better equipment, books, and better paid teachers and professors. No these obnoxiously high tuitions are to line pockets. Maximum profit for minimum effort is the new American way",
            "There are a hell of a lot of people here thinking 8 hours of classes per day in university is impossible. I did 40 hours a week of classes for 4 years for my degree. It's really not that bizarre.\n\nI'm assuming this is the standard Reddit shit of assuming the American standard is the world standard.",
            "students love to ruin shit, so it would be a waste of money",
            "Because a professor made a /r/BuyItForLife post in the 80s, and since then no College has switcherooed.",
            "Because those fuckers last forever, and there are other consumables that the school had to buy. \n\n",
            "- The chairs are cheap\n\n- They won’t get stolen\n\n- They are durable\n\n- They are easy to clean\n\n- They are easy to replace\n\n- They are strong\n\n- They are balanced\n\nAny chair you can think of as a replacement probably lasts a third of the lifespan and costs three times as much.",
            "tuition? like college? 8 hours?\n\ni sat in classrooms for like 3 hours a day in college. who the fuck takes *8 hours* of classes a day in college?",
            "I never had a problem with them. ",
            "Comfortable seats will make students fall asleep",
            "Bc all of your money needs to go to the chancellor/headmaster/sea lion in charge to fund their vacations and paramours. Heaven forbid, the money should ever go to something useful, aka comfortable chairs and a cleaning service to keep them clean aks fresh because students sure as hell pay enough for this and more.",
            "Late stage capitalism ",
            "Damn OP quit being selfish! \n\nWhat’s more important, comfortable chairs or a $100,000,000 football stadium and coaches with yearly multi-million dollar salaries???? \n\nGet your priories straight, goddamnit; cushions &amp; lumbar support are temporary, bowl game wins last forever! \n\nThey make pills for lifelong back pain but no opioid can ever give you any of the absolute zero number of benefits you’ll receive from your school’s team winning some games. \n\n/s ",
            "I find basically all chairs uncomfortable. I'd much rather have standing desks in my classrooms.",
            "They’re cheap, like the budgie. ",
            "Get you a cusion off amazon cuz.",
            "Partially, the school wants to cut back on costs. ",
            "If you look at the stats the amount of administrators/non-education staff has skyrocketed compared to the amount of students and professors. \n\nThe pie is only so big and when you have proportionally more and more people taking pieces of the pie less is left over for everything else. ",
            "higher ups are lining their pockets.",
            "My school has spinny chairs. They're made of plastic, but they're spinny. We also have couches in the back of half the rooms.",
            "son how you gonna make them phat stax if you spendin it all on some bullllllshit",
            "Because we haven't built almost any new colleges or universities this generation, and the ones that exist already don't have to compete with one another to lower prices or enhance features with everyone's tuition being deferred/subsidized/borrowed/etc. ",
            "Because your school doesn’t give a shit about you, just what is cheap.",
            "It's all about the money. Nothing else.",
            "At my previous school we actually got to try new chairs that would be chosen for future students. They were more bouncy(?) than plastic/wood chairs and a lot more comfortable.\n\nI think your school just needs to up their chair game",
            "Interestingly in my first year at university two of my classes are in theatres. ",
            "Yessss",
            "Generally, your tuition is being leveraged for higher ratings on bonds the university sells to fund capital projects such as fancy research centers, auditoriums, sports arenas, etc. Part of the reason these bonds are rated so highly, which is also part of the reason universities are able to endlessly raise tuition without providing comparable service, is that there is no cap or limit on federally subsidized student debt. It’s probably the biggest sub-prime loan bubble in the world, and it’s ultimately funding university capital projects on the backs of students.",
            "What podunk school did you go to?",
            "? My local university has new chairs for days. I work there doing maintenence and we actually have a running joke about how they must hpave bought out a chair factory because they have so many different kinds of new chairs in different rooms.",
            "Partly for custodians. I was a custodian over the summer, shit SUCKS. High schoolers are gremlins. They deserve those awful chairs. ",
            "I like em",
            "Probably a conspiracy by the extreme centrists and the big chair lobbyists. ",
            "They have a great profit margin. Bam!",
            "Idk about y'all but my school renovated nearly every building in the past 6 years. And every new new building has nice, new seats. Still plastic but the swivel and you can adjust them ",
            "There are tens of millions of students who need chairs on any given day",
            "Because... ummm inflation, yep, inflation. \nAlso, making money off of test scores is really umm...\nI mean it’s just the economy it’s not our faults we sell our souls for not enough money and then resent the students when they don’t fall in line.",
            "I'm confused. Either you're talking about elementary/high school where you don't pay tuition, or college, where you aren't in chairs for 8 hours/day.",
            "My university has only chalkboards and it kills me ",
            "Low funds most commonly. \nGovernment schools usually recycle and reuse shit often. ",
            "so that whenever a kid throwns one at somebody it ends the life of the target, which prevents the victim from suing the school for having a chair thrown at them",
            "https://i.imgur.com/0sEXQPP.jpg",
            "Because school is used to prove you will jump through X amount of hoops to work for a given entrepreneur-led employer. It's like an endurance test. ",
            "I go to a private school that is filthy rich. We don't have shitty blue chairs, but we DO have wooden chairs bolted to the ground that are straight out of the 1960s. I am constantly wondering when chair technology improved, since these things are completely flat on the back and seat. Like when was lumbar support invented? Did they all have straight spines and no ass? It is untold hell to sit a 3 hour exam full of essays. Not only does my hand ache, bit my ass and back ache. I'm literally leaving exams like I'm as old as the fucking chairs.",
            "Sounds like your school sucks.",
            "Swedish universities often have the welfare of cushioned seats in the larger halls.",
            "My 4th grader has mostly wobble chairs and yoga ball chairs, along with a couple standing tables.\n\nI love that teacher. ",
            "PS tenure",
            "Because tuition would then be even higher.\n\nStrictly you don't want comfort you want attention.",
            "I went without sleep so much from studying that if my chair was comfortable I'd be passed the fuck out.",
            "well that plastic could be in a landfill is that what you prefer? ",
            "Most want cheap and easy to replace stuff (during the seldom times they actually are replaced). Some of the schools I have dealt with in the past still have all furniture made by local prisons. ¯\\\\\\_(ツ)\\_/¯",
            "Like 99% of questions, the answer is simple. Money. ",
            "why is education so expensive? ",
            "Because new chairs cost money, and increased costs get passed along to students.",
            " Because profit. ",
            "Because they worked 60 years ago- why wouldn’t they work now? Oh wait- your behind must have gotten soft...",
            "Because your tuition goes into someone's pocket, not back into the school.",
            "Beacuse of evil peices of shit like Betsy decks finneling money away from public school and into private charter schools",
            "I mean if you go to a super nice private school or expensive college the furniture is super nice. ",
            "My school sits in those one that are the tan and metal piped chair connected to the desk.   No Lower lumbar support has actually made my spine pained and it’s not like you can sue the school for it.  ",
            "My school's only 20 years old or so. We have some comfy ass chairs if I do say so myself ",
            "Not in college!",
            "You're worried about chairs when the best food you eat all year is the left overs from the presidents lunch they held the day prior? College cafeteria food sucks.",
            "No. None of these are the answer. The real answer is that it’s because their ability to make money or get high rankings is not affected by the crappy blue chairs. Students don’t complain enough. That’s why. "
        ]
    },
    {
        "post_id": "18wo5ja",
        "author": "eagleburp",
        "title": "Why have I never encountered a “Native American” style restaurant?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/18wo5ja/why_have_i_never_encountered_a_native_american/",
        "score": 20558,
        "num_comments": 6070,
        "created_utc": 1704197981.0,
        "selftext": "Just like the title says. I’ve been all over the United States and I’ve never seen a North American “Indian” restaurant. Even on tribal lands. Why not? I’m sure there are some good regional dishes and recipes.",
        "permalink": "/r/NoStupidQuestions/comments/18wo5ja/why_have_i_never_encountered_a_native_american/",
        "comments": [
            "Check out this restaurant in Minneapolis:\n\n[How Owamni Became the Best New Restaurant in the United States](https://www.newyorker.com/magazine/2022/09/19/how-owamni-became-the-best-new-restaurant-in-the-united-states)\n\n“In Sean Sherman’s modern Indigenous kitchen, every dish is made without wheat flour, dairy, cane sugar, black pepper, or any other ingredient introduced to the continent after Europeans arrived.”",
            "Hit the Smithsonian Native American museum in DC. Brings together tastes from many different regions.",
            "There’s a really good documentary about native Americans and their food culture called Gather. It’s definitely worth watching if you are interested in this topic!",
            "Attend the New Mexico State Fair in Albuquerque. There's a whole area dedicated to indigenous culture with Native vendors selling their food\n\nAlso check out Indian Pueblo Kitchen.\n\nBeyond that, a lot of restaurants have at least some native or native inspired cuisine on their menu. Pretty common to see the Indian Taco at many fast food places in New Mexico.",
            "I think this is a complex question, so I'm gonna do some generalization to make this not an essay. \n\n1: ~85% of our population died of disease after European contact. A lot our customs literally died. \n\n2: our culture was illegal. Literally. Our language, dress, dances, ceremonies...all of our ways to gather as a people were taken from us. Food culture is directly related to gatherings. \n\n3: residential schools groomed and indoctrinated stolen Native children into being ashamed of their ways. So they opted for TV dinners instead of Kanuchi. \n\n4: poverty and the reservation system. \n\n5: tons of other things (lol). For real though, small population, poverty, lost history, lack of access to resources...it all compounds. And it's a fucking tragedy, because our food is so healthy and so delicious. Most of the worlds most popular ingredients are from the Americas, so our food was delicious from the start. \n\nBut as everyone has been commenting, things are changing. Native food sovereignty is a big movement that focuses on us reclaiming our traditional ways of growing and gathering food. I'm Eastern Cherokee and my family and I turned Thanksgiving into a way to explore new Native food from all over Turtle Island. Shit's delicious.\n\nAlso a large portion of Latin American cuisine is indigenous in origin (minus all the cheese). So remember that next time your chilling at a Mexican restaurant!",
            "There's one in Denver called Tocabe that gets great reviews. I also remember one of the Food Network shows visited and shot a segment.",
            "There's a cafe that serves native food at the Chickasaw Cultural Center in Oklahoma.",
            " **Mitsitam Cafe** [is located](http://www.mitsitamcafe.com/) in the National Museum of the American Indian (NMAI) on the National Mall in Washington, D.C. The word “Mitsitam” means “Let’s eat!” in the Native language of the Delaware and Piscataway peoples, reflecting the cafe’s focus on the indigenous cuisines of the Americas.\r  \n\r  \nThe cafe is renowned for its menu, which features the indigenous foods of the Western Hemisphere and uses the culinary traditions of Native Americans. The menu is divided into different regions, including the Northern Woodlands, South America, the Northwest Coast, Mesoamerica, and the Great Plains. Each section features traditional foods from those regions.",
            "I was at 2 this summer on our drive through New Mexico.",
            "Please check out [Sherry Pocknett](https://en.wikipedia.org/wiki/Sherry_Pocknett?wprov=sfti1#) and her restaurant the Sly Fox Den Too. Sherry was awarded the extremely prestigious James Beard award (basically the Oscar’s for chefs) in 2023 for best chef in the North East. She is the first indigenous woman to win the award and she won it while fighting cancer. She comes from the Wampanoag tribe.\n\nHer food is phenomenal if you get to New England. We’re so lucky to have her and her restaurant here.\n\n[Sly Fox Den website](https://slyfoxdenrestaurant.com/)",
            "If you're ever in Seattle check out Off the Rez (https://www.offthereztruck.com/) they also have a food truck that does events and catering.",
            "Because American Indians are not a monolithic culture.  If you travel around places like New Mexico or Arizona, you would encounter restaurants run by locals that would be heavily influenced by their native cuisine.\n\nIroquois, Cherokee, and Pueblo food is going to be very different because they developed in very different climates.\n\nMexican food is a mix of Spanish and native cuisine, so you've probably already experienced it.",
            "They’re around, you just gotta know what to look for. Am from AZ and the fry bread places are all over the place, including food trucks! In Tucson, there used to be a really amazing Native American Breakfast joint that went under during COVID. \n\nThe “problem” I’ve noticed is the low population and lack of the ability to spread their tradition. When Europeans came here and settled, Indigenous people were incentivized to learn English and educate/teach/act/live in a more “culturally acceptable” manner. Traditions are dying. 😔",
            "Albuquerque NM has the Indian Pueblo Cultural Center.   On part of the center is a restaurant that serves amazing Native American food.",
            "Been on the Navajo rez many times, and there are many restaurants there, obviously smaller out of the way places, that’ll serve you up the kind of food you’re looking for. Eating a plant based diet myself and disliking squash doesn’t give me many options personally. 😂",
            "This is a serious answer and not a restaurant recomendation. It probably has to do with the fact that so many native Americans were wiped out during the colonization of America. I'm just an uneducated guy on reddit but this would be my guess.",
            "One of the BEST places to eat at the Smithsonian is at the National Museum of the American Indian (in DC, I haven't been to the location in NYC).  Unfortunately, it's currently closed until Spring for renovations -- it's called Mitsitam (which means \"Let's eat!\" in the Native language of the Delaware and Piscataway peoples).  When it's open, it offers multiple options for foods from the host of Native peoples throughout the Americas.  \n\nYou won't ever find a single \"Native American\" cuisine.  The traditional foods eaten by people from Minnesota is going to be very different from the traditional foods eaten by the people from Northern Alaska (which will, again, be very different from the traditional food eaten by the people from SouthCentral Alaska).",
            "Eagle Crossing Restaurant, Warm Springs Reservation, Oregon.  It's mostly typical diner fare but they do offer fry bread, huckleberry pie, Indian style tacos, elk bugers.  Great vibe and not unusual to see patrons in tribal dress.",
            "In Toronto we have:\n\n[Dashmaawaan Bemaadzinjin](https://www.instagram.com/dashmaawaanbemaadzinjin/)\n\n[Tea-n-Bannock](https://www.teanbannock.ca/)\n\n[NishDish](https://www.nishdish.com/)\n\n[PowWow Cafe](https://www.instagram.com/powwowcafeto/)\n\n[Ontario also keeps a province wide list of Indigenous restaurants.](https://www.destinationontario.com/en-ca/articles/experience-indigenous-cuisine-ontario)",
            "I mean, Mexican food is Native American food, when you think about it…\n\nEspecially when you explore Mayan dishes or the food of the ancient Aztecs.\n\nFor modern Native American cuisine, try the Navajo taco. YUM.",
            "Tampa, FL has Ulele. It’s pretty expensive, but tasty.\n\nhttps://ulele.com/",
            "Check out The Bannock House in Regina, SK, Canada. Try the bison burger.",
            "We have some in Oklahoma. 🙂",
            "There are some, but they mostly seem to be in the Southwest US. It's a damn shame too.",
            "[https://owamni.com/](https://owamni.com/)\n\n&#x200B;\n\nThere is a great one in Minneapolis, MN",
            "[Wahpepah’s Kitchen](https://wahpepahskitchen.com/seasonal-restaurant-menu) in Oakland, CA\n\n[Cafe Ohlone](https://www.makamham.com) in Berkeley, CA",
            "New Mexico has native restaurants",
            "1) There is no one single \"Native American cuisine\". The cuisine of, say, Ojibwe peoples vs Navajo peoples, is as different as that of Finnish vs Greek.\n\n2) Much knowledge of indigenous cuisine was irrevocably lost due to colonialism and forced integration systematically attempting to destroy indigenous culture. Such that many indigenous chefs today are left piecing together what information they can from scraps of information passed down from elders. Recipes also weren't always written down, instead being passed on via practice alone.\n\nI live in Minneapolis and there is an indigenous restaurant named Owamni that's received accolades. The owner / head chef has had to do extensive research of his own in order to discover what would constitute the cuisine of his ancestors.",
            "Genocide mostly.",
            "Wonderful question. Refreshing because it's unique. Commenting because this deserves attention.",
            "One of the best restaurants in St. Louis — Bulrush — specializes in Ozark food from the 1800s. They are big on ingredients native Americans would have eaten. The chef is a three times James Beard nominee. He works with Seed Savers Exchange and about 30 independent farmers to grow antique seeds from that time. So while not native-run, it gives you an idea of what they would’ve eaten at that time.",
            "Genocide",
            "Go to the American Southwest - specifically New Mexico and Arizona, near the reservations. There are tons of small restaurants that serve fry bread and traditional Native American foods.\n\nBut in general, the most famous foods of my grandfather's people (Apsáalooke) were pemmican and buffalo. Root vegetables aren't really in the market. Berries, yes. But not a lot of carbs. \n\nFor obvious reasons (IE, the mass killing of the buffalo herds and a lack of open range) there ain't a lot of buffalo around any more. And like one of my elders said, \"if you want traditional Native American food, you'll have to travel back in time and starve for a while. We found better things to eat. Nobody eats the whole buffalo when there's burritos, sushi, and Mac and cheese.\"\n\nSure, there are plenty of traditional foods still made but the delicacies that sustained various tribes were very specific to the regions where they lived. \n\nFor example, the camas root is PNW, the root wasn't consumed by the Algonquin or the Iroquois. Buffalo wasn't routinely eaten by the Hopi or the Pueblo. Elk wasn't often a staple of the Cherokee or the Tallahassee, and squash and beans were rarely a part of the Chinook, Duwamish, Swinomish, or Nooksack diet (salmon, berries, deer, yes. Squash and beans? Noooope).\n\nPoint being that an all-in-one Native American restaurant isn't really a thing because Native American cuisine was never a unified thing. But there are restaurants by reservations run by Native Americans that have their specialties as adapted to the modern cultural business of America.\n\nHonestly, though, if you eat alder-smoked salmon or cedar-planked deer backstrap over an alder fire, that is as close to NA cuisine as you're going to get. Food in NA culture was (and is still, sadly, in many tribes and reservations across America) less a matter of \"cuisine\" and more a matter of finding calories sufficient to get you and your family through to the next day without starving.",
            "Because there was a systemic and intentional system of cultural destruction of the native people. Do some reading about the boarding schools across the US and Canada if you want to learn more and be horrified.\n\nThere's work being done now to recover some of what was lost and maintain what was saved, but it's a big project.\n\nI saw Owamni listed below - Sean Sherman's work is really important and I hope there are more folks like him working to bring pre-columbian culture back to life.",
            "You have just not realizing it. “I’ll have the bison burger, corn on the cob and pumpkin pie.”",
            "I've seen several around Oklahoma. And any powwow you got to, will have vendors who serve some traditional things.\n\nIndian Taco stands are at any powwow, nd most any fair or festival in Oklahoma. They're ran by Natives, but I'm not sure how truly traditional Indian Tacos are.",
            "If you live in the southwest, there’s pop-up stands and food trucks for Navajo tacos and other Native American food pretty often",
            "Europeans were too busy wiping out the populations to worry about preserving the cuisine.",
            "If you’re ever in Rhode Island… native Narragansett Indian cuisine. Absolutely amazing!\n\nhttps://slyfoxdenrestaurant.com/",
            "There are Indian Taco stands all over in the Reno area.",
            "Miccosukee reservation in the Everglades has a restaurant",
            "I suspect a lot of the dishes just got completely subsumed into regional dishes for the area, so there's not much point most of the time? A whole lot of modern dishes are based on evolutions from native american cuisine for obvious reasons (they all use ingredients that are only native to the Americas), after all.\n\nDoesn't mean there might not be some worth making a restaurant around, they definitely exist (Sly Fox Den is near me, for example), but it does reduce a lot of the pressure to do so because it's just a subset of normal everyday food everyone eats.",
            "A lot of Mexican food is Native food but with some Iberian influences it",
            "Probably largely because \"Native American\" is not a style of food. There are more than 574 different tribal nations within the United States, and these represent a variety of cultures, languages, customs, and available ingredients.",
            "Tocabe in Denver is really good. https://www.tocabe.com/",
            "Here in the Bay Area we have two notable ones: Wahpepah's Kitchen in Oakland and Cafe Ohlone in Berkeley. Cafe Ohlone in particular is an eye-opening experience.",
            "in the san francisco bay area there are 2 that i know of, the ohlone cafe and wahpepah's kitchen (the owner crystal wahpepah is kickapoo). ive only been to the first for tea, chia porridge, and acorn brownies, but it was delicious. everyone says great things about wahpepah's and i just need to get off my butt and go there.",
            "Cafe Ohlone in Berkeley CA and Wahpehpahs Kitchen in Oakland CA.",
            "i’m sure there are some scattered throughout the U.S. but i imagine it’s because most indians and their culture were wiped out in the 1800s",
            "People forget that native American erasure has been happening alarmingly recently. They were still sterilizing native girls against their will in the 70s.",
            "There out there. \n\nBut you need a reservation.",
            "There's an extremely fancy one in the Bay Area (I think like $300 a plate), and a small bistro in Seattle. There is a resurgence going on right now, with many natives working to revive their ancestral cultures and dishes. Often including dishes they've never had themselves, but that were described to them by elderly relatives, or new spins on traditional ingredients.",
            "Owanmi in the twin cities (Minnesota) is Native cuisine and has gotten rave reviews.",
            "barbeque is actually indigenous in origin.",
            "Because we call it \"Mexican\"",
            "Mexican food is Native American food.",
            "because every time one settles in a location a franchise comes in and takes their spot\n\n&#x200B;\n\ni'm shocked no one has made this joke yet",
            "When your culture is systemically annihilated you may lose some culinary traditions.",
            "i’ve actually written a paper for college pertaining to exactly this. long story short, sacred traditions have been highly protected from outsiders ever since early colonialism and genocide. not to mention the years of forced conformity from outsiders didn’t constitute for a free flowing of ideas and insights causing NA to become even more protective of ancestral culture, teachings and traditions. additionally, the conversations around food is seen as extremely spiritual and purposeful, to not waste anything or to over exceed what you needed from mother earth so modern day consumerism directly goes against most religious teachings and interpersonal beliefs. not to mention the traumatic, longstanding, “reconfirm or die” history that stole their homeland and built America as we experience it today. i hope this conceptually helps. truth be told if you are interested in authentically learning about their culture and cuisines, my best advice i could give you is to spend as much time as possible with and around the cultures you are innately curious about.",
            "Fun fact, 2 of the top restaurant chains in South Africa (Spur and Saddles) are Native American themed. I have no idea why",
            "If you enjoy travel there is always Spur Steakhouses in South Africa. I would say it was probably originally based on American westerns \"cowboys and Indians\" at least since the 80s(when I was born) there has been no mention of cowboys.     [link](https://www.spursteakranches.com/za/our-story)",
            "Commenting because now I want to know more about Native American cuisine",
            "https://wahpepahskitchen.com/\n\nWAHPEPAH'S KITCHEN\n\nLocated at 3301 East 12th St Suite #133, Oakland, CA, 94601\n\nExcellent Reviews",
            "Sly Fox Den in Rhode Island serves northeast indigenous food. Chef won a James Beard award I believe. https://slyfoxdenrestaurant.com/",
            "In Berkeley we have the Ohlone Cafe, they serve an entirely native menu",
            "Co-signing Tocabe in Denver. It’s delicious! (Edited when I realized others mentioned it first!)",
            "There's a native restaurant in southern RI called [Sly Fox Den Too](https://slyfoxdenrestaurant.com/slyfoxden-too). The chef Sherry Pocknett won the James Beard award - the food is excellent, and representative of the natives of the area.",
            "New Mexican food (what most of the Southwest describes as Mexican food) is basically Native American mixed with Mexican cuisine since the two cultures are so intertwined in the state.",
            "Native Americans didn't really develop a \"dining culture\" that was comparable to France, Spain, or places like Mexico for a few reasons - poverty and destruction of their culture being the biggest factors, with poverty probably being the single biggest one. Reservations are often REALLY poor.\n\nSo that leads to very few Indians being able to get investment in their restaurants - you see way more food trucks out West than you do restaurants. And you don't really have a ton of \"staple\" foods like you do with something like Mexican - with Mexican food you have things like tacos, burritos, etc. With Italian you have pasta dishes, with British food you have Shepherd's Pie and beef stew, with Japanese you have Sushi, etc. With Native Food, there's fry bread - but most people don't know what that is, and there aren't a lot of easily recognizable dishes that people know and love, which makes it even harder for a restaurant to take off. It's hard to overestimate how difficult it is to sell people on food they don't know very well. So that's another uphill battle to getting restaurants opened.\n\nSo I'd say it's a conflation of a few factors - the fact that traditional Mexican food is actually pretty similar to a lot of Native American food, but people already know what to expect with Mexican - so you're competing in very similar food arenas, against a VERY well recognized and well-loved type of food. And tbh, having had both, modern Mexican is much more to my taste than modern Native American food, even though the latter was quite good. I think that's true for a lot of Americans - Native American food can taste a bit like Mexican food that is a bit blander. That sounds like a bash against the food, but I think it's partially realistic - it's going to be much easier to sell someone on a plate of Al Pastor tacos than it will be to sell someone on having grilled squash on fry bread (if you don't like squash, you're probably not gonna be into Native food at all either lol)\n\nSo you're dealing with a fairly similar food type being popular, extreme poverty among the people who would be opening the restaurants in the first place, the fact that most people don't recognize any staple dishes (ask people what a Native American dish is and you'll probably get a blank stare, or they'll list fry bread and nothing else). It's already really hard to get a restaurant started, and all those factors make it much much harder.",
            "That's kind of what happens when a government genocides your people and tries to decimate your way of life from the cultural zeitgeist. \n\nNowadays a lot of res food consists of what rations the older generations were given - canned foods, spam, etc etc.",
            "Step 0: \"Native American\" is the name for the agglomeration of many different cultures in US (in this case).",
            "We have Native American style taco trucks in town that are good. And when I'm on a reservation I try to stop at an old lady's house with a fry bread sign out front, fresh fry bread is the best!",
            "Navajo Hogan in Salt Lake City is a favorite stop of mine when I am in town.",
            "Check out Spur Steakranch. Maybe that counts.\nWww.spursteakranches.com",
            "Owamni by The Sioux Chef in Minneapolis, MN.\n\nThe co-owner is Oglala Lakota and opened Owamni in 2021.  The menu consists of meals that contain no dairy, wheat flour, cane sugar, or any ingredients that came over with the Europeans.  All ingredients are locally sourced and organic.",
            "Technically any Mexican restaurant is a Native American style restaurant.",
            "They exist but they rarely market themselves as a specific ethnic restaurant. You are more likely to experience them on the reservation in the form of a food truck, cafe, steakhouse, sandwich shop or a cultural center. \n\n Unfortunately like any place native cuisine struggles with competing against casinos, mega chains and fast food. I use to frequently visit a reservation for work / training and we all ate at this awesome chophouse that served native dishes as well as typical steakhouse food and it was just called \"Sam's \"  but once the casino opened their buffet and  McDonalds, Chilis and Wendy's came in Sam's closed. \n\nYour best bet is to look for small family owned businesses on or near res land and you will find awesome small businesses that will serve a dish or two of native or fusion food.",
            "I had some great food at little restaurants around Montana many years ago. Better luck in the West as it took longer for them to be exposed and scattered.\n\nI always love the obligatory fry bread at a Powwow too - tastes like victory!\n\nAny dish with the Three Sisters (beans, squash, corn) is a hit for my family. \n\nA lot of what is offered at Thanksgiving is from us. Turkey, cranberries, wild rice, all the potatoes and corn dishes, etc.\n\nMy main tribe (I'm a blend of delicious spices) loves wild onions and we eat them with everything! Always more wild onions than whatever else is on the plate. I'm a fan of frying up some bacon, using that grease to crisp up some sliced potatoes that I have already cooked in the oven, and then adding a giant heap of wild onions. It's scrumptious! \n\nJust wanted to also say thanks! Thanks for remembering we exist. I think we don't have a lot of restaurants because we, as a whole, are ridiculously poor and the US Government tends to punish (i.e., control the money) those tribes who try to better themselves. From my personal experience, you either get to stay on the Rez and be yourself or integrate into American culture and then \\*poof\\* most of who you are dies out. My family is sort of stuck somewhere between those two worlds. The government put my grandparents in boarding schools and that just about took us out of the game.",
            "A \"Native American\" restaurant would be like a \"European\" restaurant. What would it serve? It's a blanket term that covers dozens of cultures across a continent with vastly different foods.",
            "In fairness, a lot of native and indigenous cuisine has been incorporated into our own “American” diet in more ways than you might realize: corn, squash etc.",
            "You'll see some fried bread food trucks on the side of the road sometimes.\n\nAlso, I think 90% of us died. Those who survived were often forced to assimilate. Grandma had to go to a school we're she couldn't speak her native tongue. Tough to keep your culture when that happens.",
            "There’s a Native Food Truck in Snohomish County in Washington State. They are a fusion of Native foods and some other stuff, mainly Hawaiian. The fry bread sandwiches are INSANE\n\nThere’s tons of Hawaiian restaurants in Hawaii, which is technically not what you asked for, but also kind of technically what you asked for.",
            "[Sean Sherman: Why aren't there more Native American restaurants?](https://www.youtube.com/watch?v=Vrui-OctNEk&t=3s)\n\nI discovered this after clicking the link to the Owamni website.",
            "Full-blooded Navajo here. \nThe only thing I've seen people actually really sell is \"rez food.\" Food we've made from rational given by the U.S. government. It's what I grew up eating.\nHowever, though genocide and relocation a lot of recipes and ingredients have been lost. \nHowever, there are some that I've had like blue corn mush, chilchin(I think it's like a sumac berry porridge), Mutton, steamed corn stew, and kneel down bread.",
            "Hi, the SF bay area has a few, or had a few, recently.\n\nGoing to them, you realize that indigenous food could mean a couple of things. Either it means \"pre-columbian\" food, made entirely with \"new world\" veg, grain, meat, or it could mean the food indigenous people ate after colonization.\n\nIn the first pre-columbian case, you're dealing with \\*much\\* more obscure set of ingredients that are hard to source. And those ingredients aren't available on tribal lands for 100 years either: the populations of grazing and hunting weren't avaialble on tribal lands either, and that happened for enough generations that the old ways were greatly lost.\n\nIn the second, you're serving what really becomes poverty level food, like government cheese given to reservations. Things like \"indian tacos\" can be good, but it frankly reminds me that america is built off a very dark history, and while we all should be reminded of that, it's not something pleasant.\n\nIt seemed like it might become trendy for a bit. Here's a link about two restaurants. [https://www.sfexaminer.com/news/check-out-these-bay-area-restaurants-for-indigenous-peoples-day/article\\_f0d5d786-48c1-11ed-ad31-2f4badf75c55.html](https://www.sfexaminer.com/news/check-out-these-bay-area-restaurants-for-indigenous-peoples-day/article_f0d5d786-48c1-11ed-ad31-2f4badf75c55.html)\n\nWith the two restaurants quoted, it's hard to wrap your head around a sorrel and laurel sorbet and think native people were eating that 400 years ago, so it always seemed a bit weird and more of a concept than a reality.",
            "In Quebec's city, you can eat at Sagamité. They serve First Nations dishes. It's really good!",
            "Oklahoma has a relatively new native restaurant called NATV. They have indigenous foods using succotash, bison, pumpkin, and other local ingredients. The owner is from the Shawnee tribe.",
            "39 Restaurant at the First Americans Museum in Oklahoma City",
            "Largely because at our height we make up about 3% of the population, we also make up about 3% of the restaurants and 3% of the patrons to those restaurants so there's not a lot of what caters to us.\n\nIn the SW you'll mostly find our food in food trucks, and even then it'll mostly be what's known as \"rez food\" since almost all of it revolves around the limited ingredients you'd get on the Rez (i.e. flatbread since flour, salt, and water was about all you'd get).\n\nThere are a few really decent attempts at recreating what actual original fare would've been before the reservation system but they're very few and far between and you'll see most of the people giving you better recommendations down below, but yeah, just wanted to give you the reason why you don't see it.\n\nDemand equals locations and there's not much demand for a type of food only a few shades over the 3% of us that exist in the country have even heard of let alone have a taste for.",
            "We have one in Denver called a Kachina. It is delicious.",
            "I’ve been to two in Quebec, Canada (albeit that’s a pretty big area. Here’s a great one: [la sagamité](https://indigenousquebec.com/things-to-do/la-sagamite-restaurant-old-quebec)",
            "Here in Colorado we have one called Tocabe that was featured on diners drive ins and dives that I suggest you visit if you get a chance.",
            "There are, but you have to have a reservation. Buh-duh, tsk!",
            "Vancouver, BC:\nhttps://www.salmonandbannock.net/\n\nSeattle:\nhttps://www.offthereztruck.com/\n\nToronto:\nhttps://www.teanbannock.ca/\n\nElsewhere:\nhttps://www.atlasobscura.com/lists/restaurants-that-serve-indigenous-food",
            "Not to sound mean or to blame anyone; a lot of our traditional Native American Cuisine and traditional foods were wiped out, made illegal, polluted or repressed in boarding schools.\n\nSo we adapted. Many tribes became reliant on the government for food so our day to day food changed. This made many of us unhealthy.\n\nBut now, things are changing and some old ways are becoming new again.\n\nCurrently I’m working on putting together a channel, Instagram, writing a cook book and creating content around this revival or tradition.\n\nI made a post about how juniper is used, by burning it the leaves salt is made. This is important because our environment lacks it naturally. And this has been a traditional way to fortify and flavor our food.\n\nSo with all that being said, I’m learning about foraging and the traditional aspects so I can teach the younger generation and anyone willing to learn. \n\nThanks for your time, follow me audioarsonist on Instagram if you are interested. Eventually I will be releasing more.",
            "It’s late, but I’ll chime in as an actual Indigenous person who has worked on food systems (I started an Indigenous farmer’s market in Minneapolis.) \n\nBeyond all the other reasons people have stated, it’s really hard to open up a restaurant that needs to buy food that isn’t available from major distributors. \n\nThe magic of Owamni is that Sean didn’t just open up a restaurant, he had to do decades of research, foraging, finding farmers and ranchers, not to mention teaching cooks how to use ingredients that they’ve never worked with. He created his own supply-chain, from scratch.\n\nSo if you want to open a Native restaurant that is “authentic” it basically has to be expensive, because your food costs are going to be dramatically higher if you’re serving hand-harvested wild rice instead of something off the back of a Sysco truck. \n\nTo add to that, most tribal people ate very seasonally, so it can be even harder to be able to source produce and meat/seafood to be able to deliver a consistent array of dishes and not have to change the menu frequently.\n\nAnd one last thing, oddly also not mentioned here: few native people have access to the sort of capital it takes to open a restaurant. Before Owamni and Indigenous Food Lab opened, Sean had to spend years catering, writing a cookbook, and running a food truck. Things he also had to crowdfund on occasion.\n\nSupport your local Indigenous food makers, they’re working harder than you know. And support Land Back, so we can keep making good food.",
            "We have one in Sioux Falls called Watecha Bowl. They started out as a food truck and then opened a storefront. It is excellent. Owners are friendly, food is good, and they have Native American culture and information about Native American history on the walls. I wish we had more places like it!",
            "They exist. Instead of searching for \"native American\" or \"indian\" restaurants try searching for the actual tribe/nation name.\n\n For example, there's multiple places that serve \"traditional Cherokee\" food in western North Carolina. There's also places that serve \"Appalachian\" food which tends to be heavily influenced by Cherokee recipes. \n\nIt's also worth considering that in the last 300 or so years traditions will have changed so recipes being \"authentic\" is subjective.",
            "Uhh.. only time I ever seen any native restaurant was in Arizona. Cool lil frybread taco spot. \n\nThe problem with this question is native food varies by region. The food native alaskans eat isn’t the same as Arizonans or Oklahomans and so forth. Even if there was restaurants it would never be the same for each state."
        ]
    },
    {
        "post_id": "pxt2jb",
        "author": "None",
        "title": "Do you serve cake at adult birthday parties?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/pxt2jb/do_you_serve_cake_at_adult_birthday_parties/",
        "score": 20516,
        "num_comments": 3839,
        "created_utc": 1632913567.0,
        "selftext": "My wife recently celebrated her birthday by having a few friends over. I ordered a cake for the occasion and set it out after dinner. The guests seemed genuinely surprised to see the cake. \n\nAfter singing happy birthday, I cut a few slices and put them on dessert plates. No one touched them. I thought maybe they were being shy and no one wanted to take the first piece, so I offered them out. \n\nEveryone was either off gluten, on a diet or not interested in having that much sugar. \n\nIt made me wonder if not eating cake at adult birthday parties was the norm and I just missed the change.",
        "permalink": "/r/NoStupidQuestions/comments/pxt2jb/do_you_serve_cake_at_adult_birthday_parties/",
        "comments": [
            "It probably depends on your local culture/social group.  Where I live, it's not a birthday celebration without a cake, regardless of age (although people here don't tend to worry too much about what they eat).",
            "My grandfather turned 95  about 3 days ago. You bet your ass he served cake",
            "Man I’m almost 30 I still always ask for a chocolate cake every year.",
            "I still expect a birthday cake as a grown man.",
            "That's pretty weird. Of them, not you.",
            "I still expect to receive a birthday cake and I'm nearly 30.",
            "Cake is *awesome*. What’s the point of getting old if you can’t have cake?",
            "Im 33 and my girlfriend made me a space themed cake for my alien themed birthday party this year. Not weird and seems a bit rude of the friends!",
            "Birthday cake is traditional at every birthday celebration. \n\nYour wife has health-conscious friends, which means more cake for you!",
            "They were expecting you to hand out strippers and cocaine.",
            "Was it a good cake?",
            "It ain't really a birthday party without cake.🍰",
            "I find it depends on the friend circle. My closest friend circle always has some kind of sweet. If the birthday person doesn't like cake, we pick out something else for them - I'm a baker so I often get asked to prepare something for parties. I've done everything from scones to brownies to fruit tarts.\n\nThat being said, I'm not a huge fan of cake and will often turn it down at parties, especially if it's the cheap store kind with the nasty hard icing.",
            "Your wife's friends are very strange people. \nOF COURSE you serve cake at adult birthday parties. It's not a birthday party without a cake or cupcakes of some sort, in my opinion. I also believe that the birthday girl/guy/person should never have to buy or make their own cake.",
            "[deleted]",
            "I love a birthday cake, you just got unlucky with your guests. \nThere should be no age limit on cake 🧁",
            "Thats so lovely of you. They're wierd.",
            "Your friends are weird. Are they surprised when they go to a wedding and see cake?",
            "I just celebrated my birthday and had three cakes, well, a cheesecake, a mango paste cake, and an ice cream cake from coldstone.\n\nI just turned 39 last week. Can't imagine how many more I'll get for next year!!",
            "I don’t know why they would act surprised since it was a birthday party. I got fed up with trying to make treats for adults, though, because everybody is, as you said, off gluten, lactose intolerant, dieting, etc.",
            "I’m in my thirties and a couple years ago my wife got me a ice cream cake with a naked lady on it (from DairyQueen no less)!",
            "Clearly they don't know the joy of a caterpillar cake. That's on them though.",
            "Oh hell yeah!  A big ol' birthday cake is one of the mostest funnest parts of a birthday! ^You ^gonna ^finish ^that ^piece? ^:)",
            "I would be weirded out if there was no cake at a birthday party. Even a small birthday get together.",
            "Who cares about the others. How did your wife react? Maybe you can find out what she really wants (maybe it is regular cake) and get that. Then if your guests don't eat what she wanted they're being disrespectful of her wishes for her own birthday! (Ok, not really, but you get the idea). \n\nPersonally, for my own birthdays I like things other than traditional cakes and if others don't want any, I get MORE! But I think that's mainly because I go to enough kid's parties and get my cake fixes there.",
            "There has been a birthday cake at every birthday party I’ve ever been to adult or not",
            "Cake for any birthday is appropiate. Could they have been on a diet together that you didn't know about?",
            "It depends if they are under 30 yes and if they over 30 yes.",
            "Don’t change that tradition too. Everything has changed during Covid but I better get a birthday cake for making it through another year it’s a must!!!!!!!!",
            "Oh there better be cake at any birthday party. I don't care how old the person is...if you go to a birthday party there is an expectation of cake. These people are the weirdos not you",
            "46 years old, fuck yes there better be a cake\n\nIn my friend group I'm the one who makes them actually.  So if someone hasn't already planned on buying one or whatever, I almost always offer to bake one.\n\nIn fact we're having a birthday get together on Sunday for a friend who's turning 40.  I asked her for her favorite cookie flavors, she gave me three, and is likely expecting me to make one.  She's getting a full batch of all three.",
            "I'm 25. For me it just depends on the cake. I can't stand stuff that is too sweet. If the cake has fondant or too much frosting I won't eat it because I'll literally puke because of how sweet it can be. \n\nI really only like a carrot cake or just a small 1 layer cake with a thin layer of frosting. \n\nThat being said, we always have cake for my birthday. My mom prepares a cake for all my siblings (besides my brother and SIL who live a long distance) and her grandkids every year for their birthdays.",
            "Their dietary requirements do not speak for every grown adult person receiving cake on birthdays.",
            "I work in a bakery so I make the cakes for every party in my family lmao. And yes, they're all adults hahaha. Cake imo is a timeless dessert. \n\nIf health contentiousness is such a big deal, then maybe next year you could try to find a sugar free/gluten free option and suggest that?",
            "Their actions are so not the norm that I almost wonder if you were being pranked",
            "Lots of folks caring more about eating less sugar/gluten as we age to keep our bodies going but I’ll be damned if I have a birthday party without cake and pointy hats until I die",
            "I think alot of people buy into this delusion that adults arent allowed to have fun. No birthday cake, no video games, no animated TV shows, etc.\n\nIn all honesty, we need to break this trend and get back to the idea that being an adult means you can do what you want, instead of this idea that adults are somehow not supposed to have as much fun or freedom.\n\nLong rant to say, yes i want cake at my parties",
            "Cake is the best part!",
            "Cake is mandatory. If there's no cake, is it even your birthday???",
            "I just went to a friend’s 50th party and I was thinking about cake but suddenly they were all HERE’S CAKE and I was like fuck yeah, cake and I ate that shit so hard.",
            "I turned 48 recently and my wife made me a Buffy cake.",
            "I'm 37, and if I had someone throw me a birthday party, I'd expect a cake. If nobody else eats it, that's more for me.",
            "Time to divorce and look for new friends, buddy.",
            "It might depend on your culture and demographic. I would say depending on the people I'm around, it's more of an issue. It's sometimes I noticed a certain demographic of people are prone to bizarre diets (bizarre to me anyway) even if they don't have some type of health issues, while other demographic of friends might think it's kid shit and still eat it because it's free. I dunno, I kinda feel the same way, birthdays need cakes even if they're fancier and not have the cheap garbage frosting.",
            "[removed]",
            "My Dad’s 52 and he still expects cake lol. Your wife’s friends are weird",
            "Her friends don't eat birthday cake??  Sucks for them.  Today is both my payday and my day off.  I was already going to get some cake, but now I'm going to get twice as much just to spite these complete strangers I heard about on the internet.",
            "Cake. Always cake. Always.",
            "I am in my 40s and I will never turn down birthday cake. Never.",
            "Nah, dem people’s were weird. For my 31, a Bluey cake. Like, the kids show. It was delicious.",
            "The cakes not the problem - you need new friends :-)",
            "Well...your wife's friends really seem like they're the life of the party. Come on, really? No cake at a birthday? The fuck happened to them to make them so bland and/or jaded?",
            "Here in Canada we serve cake at birthday parties and sing regardless of age. 8? 17? 53? We’ll still serve cake and ice cream and sing. The adults love it too.",
            "Not a birthday without a birthday cake!",
            "It is not normal to not eat cake at adult birthday parties.",
            "From ages 20-26, I probably didn’t have cake at my birthdays.  But between those ages I was celebrating birthdays at the bar or football game or something.  If I was at someone’s house i might have cake if they offered.  Try not to overthink it.  You did something you like and they didn’t appreciate it.  As long as your wife is happy, no problems.",
            "Seeing as this thread is boring, with people only taking one side (MUST HAVE CAKE), I'll offer a dissenting opinion as a 29yo from Romania:\n\nI would also be *surprised*, not weirded out, if there was cake at an adult birthday *get-together* (i.e. day-time at someone's home; wouldn't call anything with no dancing or loud music a party). \n\n**However** even as the rare cake-hater I am, I wouldn't be a little bitch about it and not take a slice if the host brought it out. That would be very rude.",
            "I generally don't get excited when offered cake at parties. I appreciate the effort, but I actually dislike it when people offer and expect you to eat it. Don't want and don't need the sugary stuff. People grow up, watch their diet, try to stay healthy and lean (at least I do as a serious athlete) when they get older. Same reason I decline cake and other sweets at the office. But that's not to say there's tons of people out there who don't mind and have different preferences, and I don't think it's a childish thing. I definitely enjoy having a piece of cake when out on a long ride or after a run because that's when I need the sugars to top up my glycogen stores. Not when I'm sitting around all day.",
            "I think you need new friends :D",
            "If I don’t get a ice cream cake on my birthdays, I get depressed.  my wife knows this.  in my 30’s now lol",
            "Damn, do you still have the cake ? :D",
            "Ummmm nooo. My grandma is 94 and we still get her a cake every year.",
            "No, but because I hate cake and so does most of my family. Pie is the way to go for us.",
            "43 here... there better be cake for 44...",
            "If there is no cake and ice cream, how can you call it a birthday party?",
            "Clearly, your wife's friends were all replaced by alien who have clearly never eaten cake before.",
            "Next time in invite me and I will eat the cake!",
            "Hell yeah, I expect cake at a birthday party no matter how old the person is 🤷‍♀️",
            "A birthday is NOT a birthday without cake, no matter the age.",
            "Honestly I feel like nowadays more people care about their dietary restrictions or decide to eat a specific way.I wouldn’t be surprised if all the excuses  you received were legit",
            "it isn't a birthday party if there isn't any cake",
            "We say this when the cake sucks….",
            "It is clearly your social circle man. Like, let's be honest, what do you think is the percentage of adult people in your country that does not eat sugar or gluten?",
            "They sound a bit stuck up. Even if I'm on a very strict diet I'll make small adjustments and have a small slice of cake at a party, it's just being polite.",
            "It's a fucking birthday cake how is this complicated?  Very weird and kind of rude that. Socially, a few people should of stepped up to take a slice so it's not awkward",
            "Bruh they sing happy birthday but wont eat the cake?\n\nMaybe the cake just didnt look right lol idk man but i would appreciate a cake or similar baked goods like cupcakes and skip singing happy birthday instead.",
            "When food is involved, I always make sure there is a vegan low carb kosher halal gluten free, lactose free, sugar free, peanut free option available, just in case.\n\nI do like cake, but I respect other people's food choices as well.",
            "It's weird they thought it was weird.  As cake and parties go hand in hand..\n\nBut it could be they're reacting to you not knowing that everyone is on a diet or has restrictions since they're all part of your extended group through your wife. \n\n\nI worked at a place that had group parties and there were times we bought fruit and cheese instead of dessert due to over half the people either being on a diet or being unable to eat wheat or sugar or some other well known dietary issue. But then the Manager (who knew this because literally everyone did) would come in with cake and no alternative for more than half the team who were unable to eat it. So it was seen as the manager being an idiot and totally insensitive to his team. He kept doing it every year too.",
            "Idk man I still like having cake and ice cream on my birthday. Not weird. It isn't weird for people to have reasons to not eat it either though",
            "They were hoping for pie instead lol\n\nCake is totally normal, but some people don't like cake in general. \"Ah yes a slice of sugar that will make me feel bloated & like after I just ate a proper dinner.\" Some people just don't divulge in desserts, some people don't like sweets. Ever wonder why you see an older man eating black licorice? Maybe he just wants to or maybe he is sick of sweets.",
            "What kind of people are they? Monsters?! \nEven my workplace has a birthday party every month with cake!",
            "Always go with cake on birthdays. Even if no one eats it. It is the thought that counts. Also, what kind of friends do you have that don't like freaking cake?!?",
            "I'm not a fan of celebrating my birthday. That doesn't stop me from buying a Costco Red Velvet cake on my birthday.",
            "47. Still get a cake.",
            "No one is too old for birthday cake.  Those people were not fun.",
            "Cake is standard.",
            "I have found that the older we get, the less adults around our age want sweet stuff like cake - usually for the reasons you mention: diabetes, gluten-free, dieting, no longer like sugar as much, have a better sense for how many calories are in a slice of cake, don’t like how the blood sugar spike feels, would rather spend their personal sweets allowance on something more decadent, etc. Also, where is the cake from? I’ve lived enough decades to have experienced really really good cake. Eating a cake from Costco or Safeway now just isn’t worth it. Not near good enough. And I’m at the place in life where I have enough money that I can afford to buy that really really good cake whenever I want.",
            "Yes, I do. Cake or pastry and sweets are usually served at at every kind of birthday party for adults, teens and kids, unless the birthday person doesn't like it. Yummy cake!",
            "I’m 63 and every adult I know loves to get cake on their birthday. Is it possible these folks were hyper vigilant about diet or weight?",
            "Who doesn't like cake? Of course you do.",
            "Depends. I still like cake on my birthday. If you go to a restaurant I don’t usually see cakes because it’s a small thing and if you want dessert the restaurant often provides something.",
            "yes. i mean im still 19 but like, ive been to adult birthdays and they usually serve cake. Although, it's rarely chocolate and now it's a more *sophisticated* flavor like lemon or something.\n\n I do like every type of  cakes tho so im not complaining, just wish we got more fun stuff like chocolate.",
            "I haven't seen a single adult birthday without a cake.\n\nMaybe they are a circle or that kind of lifestyle where they don't have sugar or are Keto and that kind of health trend. But yes, it is expected to have a cake on birthday, not matter then age.",
            "What the hell is the point of a birthday party with no cake?!",
            "Your friends are weird.\n\nYou get cake on a birthday until you die of old age.",
            "Get some new friends. Those guys are hella lame! Bonus points if it's an icecream cake! I'm 30.",
            "43 and I'll take some cake plz. If I'm on a diet I'll do no bread and sugar most of the day that way I can have some cake.",
            "They sound like a bunch of miserable c\\*\\*ts.",
            "Nah, we still love cake. You just misjudged your audience. I’m surprised your wife didn’t warn you not to serve cake though.",
            "Who celebrates a birthday without birthday cake? That's absurd!",
            "I'm almost 40 and my MOM still makes my birthday cake each year. Those people were crazy.",
            "Man I haven't had a birthday cake for myself in over 5 years. Or a present now that I think of it, other than liquor anyways",
            "Sweet Jesus you need better friends.",
            "We traditionally had cake for every birthday in our office (all long timers and only 8 of us). Birthday person got to choose. One year (on a diet!) I choose a fruit platter for my \"cake\". \n\nIt was not appreciated.",
            "Some people like cake, some people like cookies, I got one niece, at 8, that wanted a large veggie tray instead of a cake, she's gotten one every birthday since",
            "If there is no cake is it even a birthday",
            "Wtf? I almost downvoted your post i was so irritated at the idea that a group full of \"adults\" made the terrible decision to avoid cake on a special occasion. What was the point of us all growing up and making our own decisions if they were just going to perpetuate the terrible decisions we saw in other adults?!",
            "Your wife and her freinds are Nazis. That's all. Poor you.",
            "You need new friends.  I will eat cake with you nfp",
            "I personally love cake and get one for all my birthdays. I am currently 31. Their loss.",
            "A birthday party without a cake is not a birthday party. You apparently have crappy friends.",
            "I’m gluten free. I would have at least eaten the icing lol",
            "Yes, you do serve cake at (good) adult birthday parties. That was weird of them.",
            "If I go to a birthday party and there's no cake, I will not attend the next time.",
            "I can't think of a birthday party I've ever been to, regardless of age, where there wasn't a cake. Sometimes it's just a small cake with various other desserts and sometimes it's a full sheet cake but regardless there is always cake.",
            "They are idiots. Even if on a diet or whatever other excuse a Birthday is automatically a special occasion and thus a cheat day. pshhhhhhh.\n\nanyway keep the cake at the adult birthday parties especially if there isn't free alcohol. I would have ate the whole cake if nobody else was having some.",
            "If you throw me a birthday party and there's no cake I'm going to be really dissapointed. So would my 81 year old grandpa. But to each their own I guess, and if someone can't eat gluten that's a pretty valid excuse.",
            "We get whatever the birthday person wants.",
            "You do if you're an adult and want a cake at your birthday party.",
            "I like brownies and ice cream. I've never really liked bakery cakes, they taste waxy. \n\nSounds like your friends are lame af. Next time try a fruit tart or fruit salad.",
            "Isn’t that what birthdays are about? The cake?",
            "I'm not a big cake fan, but if someone buys a cake I'm eating some. Those guests were rude.",
            "Fuck yes. \n\nI love cake. \n\nIf you can't break your diet to celebrate are you even living?",
            "> Everyone was either off gluten, on a diet or not interested in having that much sugar. \n\nYour friends... or her friends, or whoever's friends those are (I suppose definitely not yours, because if they were you would have known about their gluten free, sugar free/less sugar, or dietary lifestyles), are not the normal for adult birthday parties across the nation, let alone the world.\n\nI love cake. I still like having it for my birthday. In fact, I've recently discovered my favorite type of cake: chocolate banana mocha!",
            "As a fatass, I want cake. But considering your friend group, maybe consider making a healthier dessert?",
            "I quite like a cake especially if someone has gone to the trouble of making it. I would not be upset if there wasn't one though.",
            "I’ve never been to or had an adult birthday party without a cake of some kind",
            "I wish I were getting cake for my birthdays.",
            "I mean, I never got cake for my birthday as a child (poor people problems) so now that I'm twenty I make a point to get some sort of disgustingly sweet thing for my birthday. Just turned 20 on the 25th and got a cookie cake, was amazing :)",
            "It's one of the few occasions you get to eat cake, so fuck it, serve cake!",
            "Lol what? I’m 27 and if I went to a birthday party and there was no cake, I would be confused and disappointed.",
            "No, normal adults still have cakes for their birthdays. \n\nSource: 30-something year old with 30-something year old friends",
            "Yes of course.",
            "If there's no cake it's such a big disappointment 😑",
            "My wife's gift for her 30th was a super fancy cake from a well-known local bakery, it was a huge hit and her friends still talk about it two years later.\n\nNo Bake Cookie Cake: https://imgur.com/a/pYgqcMh",
            "That sounds like a really sad peer pressure-ie type phase they're all enabling each other through? Are they young like early to mid 20s?\n\nNever in my life have I seen a birthday party without cake.",
            "Wtf yes there should be cake",
            "What the hell's the point in having a birthday party if you're not going to have cake?",
            "what a bunch of bitches lol",
            "I’m in my thirties and I tell my wife not to bother getting my presents (I’m difficult to shop for) but if there was no cake she’d never hear the end of it",
            "I'm in my mid-30s and I've never had a birthday without cake (or something similar). They sound like a stuffy bunch, re: \"no gluten/diet/too sugary/etc\". \n\nI subscribe to the \"I\"m here for a good time, not a long time\" mentality.",
            "I don't care what diet I'm on currently. I eat the dam cake",
            "Why wouldn’t there be cake?",
            "I make my husband a ridiculous chocolate birthday cake every year. I have cake for my birthday too. It's not a birthday party without cake!",
            "YES ITS A FUCKING BIRTHDAY",
            "Serve cake? I buy MYSELF the birthday cake! People who come to my house and don't eat cake aren't invited back. I don't fraternise with their kind.",
            "I'm 40 yo and my mother still makes my favorite cake every year. She even delivered it to me durin quarantine last year. Birthday wouldn't be the same without it.",
            "I don't want to attend an adult bday *unless* there will be cake lol",
            "Of course! Not even touching their slices is so rude, they could at least have tried it. Very weird.",
            "My mom just had her 60th birthday party this past weekend - there was a lot of alcohol, a lot of dancing, a lot of finger foods, but we still had a cake with candles for her.\n\nI guess it depends on the people! All the reasons you listed that they gave you are valid reasons and pretty common especially with a group of women. Most people do let a birthday cake become a \"cheat\" snack, though, but I guess in certain situations not so much!\n\nMy whole family still do cakes for birthdays, as does my husbands family, no matter the age.",
            "yes, cake is standard at birthdays no matter the age. also, people spend hundreds even thousands of dollars on elaborate cakes for weddings",
            "That was so kind of you! I’m sorry no one ate it. In my family we always have a cake for each person’s birthday no matter the age.",
            "Idk, where i live people dont care, everyone loves cake",
            "You're never to old for cake. Unless you have allergies/health issues I can understand. But birthdays deserve some cake.",
            "Sounds like your wife’s friends are a load of fun to be around… \n\nEvery birthday I’ve celebrated has always been accompanied with cake.  🎂",
            "A birthday party with no cake.  That's fucked up.  That's the only reason I go to birthday parties.",
            "Did your wife make friends in OA or Weight Watchers or the gym or something?",
            "I like cake.",
            "We have a cake for every birthday every year. I'm sure it's normal to not have a cake for some people, but those aren't friends that I want to have. No offense, of course",
            "Gluten free? Diet? Too much sugar?\n\nThey don't seem like fun people to be around. Not even making an effort to touch the cake you laid out seems very disrespectful. Where I am from, a birthday party at home with no cake is not a birthday part.",
            "Birthday is my favourite kind of cake.",
            "Yes, omfg of course I serve cake.\n\nThere are only two days a year where I ever see cake, on my birthday and on Christmas. \n\nI couldn't imagine not having cake at my adult bday party that is literally just me by myself. Gotta fill that lonely void with something and it might as well be cake.",
            "I’d eat the cake."
        ]
    },
    {
        "post_id": "ffk0ab",
        "author": "None",
        "title": "Why do infants cry if they're tired? I mean, just go to sleep, nobody's stopping you",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ffk0ab/why_do_infants_cry_if_theyre_tired_i_mean_just_go/",
        "score": 20511,
        "num_comments": 938,
        "created_utc": 1583704940.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/ffk0ab/why_do_infants_cry_if_theyre_tired_i_mean_just_go/",
        "comments": [
            "Because they don't understand what being tired means or how to fix it. They cry because that is their main form of conversing with others. When they are tired, or hungry, or hurt, they don't know what it means, how to fix it, or anything, so they cry to get our attention for us to fix.",
            "Interestingly enough, many grown ups also behave erratically, become more irritable or even sad, when tired, instead of just going to sleep.\n\nWe (humans) are not as good as we think we are at figuring out what we feel or why we feel it.",
            "They don't understand that what they're feeling is \"tired\" and that going to sleep will fix it. Plus, sometimes, babies and little kids don't WANT to go to bed because it's boring. They also might be experiencing some kind of discomfort that they can't articulate keeping them from falling asleep, such as teething or they're too warm or cool. Processing a feeling and coming up with a solution independently is something that has to be learned.",
            "So according to my daughters pediatrician, not only do they not make the connection between feeling tired and sleep, they may also resist going to sleep because they are instictually afraid of becoming unconscious. Just like babies toes curl around things as a leftover reflex to grip branches, and will hold their breathe as soon as they go under water, they also \"know\" that if they are asleep they can't cry for help if something is wrong.",
            "I have this conversation with my 7m/o baby every night. It's like he's not even listening",
            "Because existence is pain",
            "This was (and still is) my number 1 gripe as a parent. Then I remember that my child for 9 straight months never knew any sort of discomfort. There was no night or day, all noises were surrounded by the overwhelming noise of my blood rushing around / my heartbeat, no hunger, no being too cold or too hot, no just being uncomfortable in general.\n\nBeing a baby and learning to sleep again is like leaving the best / most comfortable bed you’ve ever had (the one with 2-3 pillows of perfect density, the heavy but not too hot duvet and the nice high thread count sheets) and trying to sleep at a cheap motel. It’s really fricken hard.",
            "Does no one have a memory at about 4 or 5 feeling absolutely exhausted because you're sick and the bed is uncomfortable because you're hot and yet you feel cold and your stomach hurts or your ear hurts or you cant stop coughing and its making your head hurt and you're exhausted but you don't feel like you can sleep so you start crying because the world sucks and your parent coming in to just hold you then you wake up feeling better?\n\nAs infants it isn't just about feeling uncomfortable. Sometimes they are tired but not tired enough to actually fall asleep. Sometimes they cry because they are scared and mom and dad are their safe space. Sometimes it's something as little as \"Im lonely I need you hold me\" and you sit next to them they can see your face and they can fall asleep. Sometimes they have gone past the point of exhausted and cant sleep because of it. You also need to remember as an infant you cant shift your weight or roll to get comfortable. You rely on your parents to make sure you aren't wet. You aren't thirsty or hungry. That your body isn't in an uncomfortable position. That you aren't cold or hot because infants aren't the best at body temp regulation. This is why I never let my kids cry it out. If they cried more then a couple minutes I was on it. Because there was something they needed!\n\nAlso great tip. There are different cries by infants that change sound based on how their mouth is shaped. The mouth shape can tell you what they need. Like when they're hungry their suck reflex is more activated so they'll cry like \"neh neh neh\".\nWhen tired it's more \"owh owh owh\" like a yawn.\nWhen they need to burp \"eh eh eh\" because they're trying to push the burp up. When lower more of a \"eairh eairh eairh\" because they're trying to fart. And then the rest are normally \"heh heh heh\"\n\nA lot of mother's respond to these cues automatically and without realizing that's why they know what their baby needs. But yeah.",
            "They don't know how.   \nThey don't understand what feeling tired means, and they don't know how to just \"go to sleep\".   All this crap is brand new to them.",
            "They can't. It might not feel like it as an older person, but being able to settle yourself and fall asleep is a *skill* you have to learn. Babies not only don't have that skill yet - they don't even recognise what *tired* means. They don't take that feeling and connect it with \"I'm sleepy\" the way an adult/older child does; all they know is that something's wrong. And their survival programming as infants is that when something's wrong, you call for mum and dad. That's literally the only way they know to respond to something like that.",
            "If they don't attract attention from time to time they'd get eaten by something. surviving in nature for them required reminding people they were around. Think of how long you might leave them alone if they didn't make noise all the time.",
            "As an addict in recovery, we are told to be cautious of our cravings particularly when we are experiencing HALT - Hungry, Angry, Lonely, or Tired. As many have said here, it’s tough in the moment to realize you’re one or many of those things. Another good one is Bored.  \n  \nSo if we are experiencing a craving, or wanting to use, we are suggested to stop and recognize if in fact it’s one of those feelings instead, and address it.",
            "[removed]",
            "It has something to do with their nervous system not being fully developed yet. Being able to sleep when tired seems logical, but babies and even kids don’t sleep the same as adults because they have a very different circadian rhythm. \n\nIt’s ok though, they catch up by about age four. So if you have a newborn, you can have a good night’s sleep in four years or so.",
            "Come on, don't you ever get too tired and upset to go the fuck to sleep?",
            "Something I didn't think about prior but babies gotta learn to release their butthole to poop. First month with my wee one, worried because she seemed to always struggle before pooping. Turns out she just hadn't learned how to do that yet.",
            "Try telling that to my 15 month old. Currently sat in his room waiting to make my escape for the second time tonight and it’s only 2.30am. I have work in 5.5 hours. I have had about 1.5 hours sleep so far and won’t escape for another 10-20mins. Honestly I just wish he would sleep. Like, you’re tired? That’s fine, go to fkn sleep then?!!!! 🙈",
            "[removed]",
            "Have you met a toddler?  They cry because the wind blows.\n\nIt's a development issue.  It passes, with most kids.",
            "When you're a baby, every unpleasant experience is pretty much the WORST thing that's ever happened to you. Slight discomfort is devastating for a baby because they have nothing to compare it to. The only way they know how to respond is by crying",
            "because life is pain :(",
            "I once read about a study where babies’ blood pressure was monitored. When their blood pressure went up, it indicated distress. They found that not all crying was caused by distress and hypothesized that some crying was simply vocalizing because babies had no other forms to communicate.",
            "I hate babies",
            "I’ll feel cranky without realizing I’m actually just tired. Takes a minute to step back and check in with my body. If I were a baby I’d def cry",
            "They’re *infants.* They don’t understand cause and effect.",
            "If an adult feels lousy when tired, they can usually verbalize it or at least work through the grouchies to a certain degree.  Babies... not so much.\n\nThere is also a suggestion that infant crying helps stimulate proper lung development. (can't remember the actual citation).\n\nAs a parent myself, I can definitely vouch for the fact that sometimes (with all of the usual hungry, dirty-diaper, sick, cold, hot, etc. boxes checked and not found to be a problem) the only difference between a baby who is unable to go to sleep and one who is able to go to sleep appears to be about 15 minutes of crying.",
            "Sleeping is actually a skill. You have to learn how to know the difference between when it is safe to lie down and go to sleep, and when staying awake would be safer. That takes experience and a certain level of cognitive skill, both of which babies don't have much of.",
            "As an adult, there have been multiple times where I'm tired but too stubborn to go to bed. So I can only imagine how dumb a dumb baby is about it.",
            "You're assuming infants know what being tired means, why they're feeling it, or how to not be tired. They just know something is wrong, and they want you to know about it. The only way to let you know about it is to cry. Infants pretty much run on pure instinct. The amazing thing is how quickly they grow and learn. Kids learn things more quickly than any adult could hope to.",
            "Too many new things to see/smell/experience to just GO TO SLEEP!",
            "They don't know *how*.",
            "Because /r/KidsAreFuckingStupid",
            "Yeah, whiny bitch ass *babies*",
            "IME: A lot of the time there is something stopping them, like they're also hungry or the environment is too stimulating or just the stress of being tired upsets them and the crying keeps them awake. If you feed them, calm them, take them someplace quiet, or otherwise solve their problem, they usually conk out pretty fast.",
            "Stupid fucking kids not knowing how to understand their bodies. Dumbass fucking stupid ass babies can't even feed themselves or pay taxes",
            "YES THANK YOU!! Ive never understood this",
            "Haven't you ever been cranky? You're tired and you need rest and everything feels irritating and frustrating and *God damn it my shoelace is untied again for the umpteenth time, I'm gonna fucking kill somebody!*\n\nWell when a baby feels like that, instead of shouting or cursing or sighing dejectedly or killing somebody, they cry.",
            "New feelings that they have no way to process, so they get overwhelmed. They just need to learn about feelings and their bodies, etc.",
            "They’ve been alive for a few months. Each day feel like it lasts a significant portion of their lifetime. If they feel tired they don’t know that the solution is to close their eyes and relax - they just feel like “Oh sweet Jesus no I feel terrible and as far as I can remember I have felt terrible for like 10% of my life” - also their only forms of communication is usually smile/wave arms around/cry so there’s really only one option for negative feelings",
            "You gotta remember man. Humans are intelligent yes, but everything needs to be taught, seen be done once or twice or learned by accident. Remember, somebody once taught you how to use a spoon.",
            "Imagine getting sleepy but not knowing what that is or how to fix it. Now imagine that plus the same thing with being hungry, cold, having an itchy nose or a trapped fart in your belly. Most babies(i hope) get nice parents who are there to help with all that, some others sadly get the idiotic \"don't hold the baby all the time or you'll spoil it\" or \"let him cry to sleep\" monsters, and that's how insensitive people and bullies are made.",
            "Infants only have three problems. Tired, hungry, or shitty. They only word they know is \" waaaaaaa\"! Imagine living like that then all of a sudden being told to \"use your words\". Being an infant is a tough transition.",
            "I ask myself and my baby this question everyday :/ lol",
            "In my daughter's case it was a matter of not being \"comfortable\" enough to sleep. Babies dont know how to soothe themselves and comfort themselves enough to just drift off easily.",
            "This is why I fucking hate babys /s",
            "Imagine if adults did this\n\n\"I AM FUCKING TIRED!!! I WANNA GO TO BED!!! LET ME GO TO BED!!! I AM SSSOOO TIRED!!!\"",
            "They don't know how to go to sleep. They have to learn it. Seriously.",
            "You try just going to sleep",
            "You're asking a bunch or redditors?   We're all up in the middle of the night feeling cranky when we should be asleep too!",
            "r/infantsrfuckingstupid",
            "Infants don's know how to communicate verbally , what they know is pretty much: *If I cry ,others will know something is bothering me.*\n\nSo they cry to be carried to sleep or put to bed, whatever their sleeping routine is.",
            "Poke an infant in the leg and he'll move his arm. Squeeze his left hand and he'll look to the right. Pinch his butt and he'll grab his face. Babies so a bunch of weird shit as they are developing and experiencing non-stop new things during their waking lives.\n \nInfants are constantly learning what things do what. Neurologically speaking they're making motor skills and muscle memory which is essentially creating neuro pathways.\n \nSimilar goes with their emotions and feelings.",
            "One time I was playing the sims and I put my toddler in the game to bed and she kept waking up crying because she was too tired then passing out from exhaustion and waking up seconds later still exhausted. Whenever I put her to bed, she’s just keep waking up crying and she just wouldn’t stop. I spent, like, half an hour on the verge of tears trying to get her to sleep",
            "Once as a kid I was crying because I couldn't stop to cry :/.",
            "Babies don’t know what sensations like hunger, sleepiness, gas, discomfort, etc are but they know crying usually solves it after a bit. \n\nThis is what gives me a slight phobia of babies. Knowing they don’t know what they need and have very limited dexterity makes me feel claustrophobic and trapped.",
            "Cause theyre dumb as fuck. I mean no one can blame them, they just saw the light of the world and dont know how anything works. But they learn that \"if i cry, someones comes and helps me\". So they do that.\n\n&#x200B;\n\nThey literally dont get that they can just sleep until they learned",
            "The short answer is that they don't understand *sleep* or *tired*.  \n\nHere are two words that totally defeat infants and little kids.  **Bedtime.  Routine.**\n\nI've had my 7mo. old daughter on a routine since she was 2.5mo old, and it was/is the best decision I've made as a parent thus far.  \n\nWe do the same thing every God damn night - eat - play - bath - pajamas - Goodnight Moon.  Yes, the same book every night.  I have it fucking memorized at this point.  We have two copies, just in case we lose one - or go on a trip.  \n\nThen, I kiss her on the forehead, tell her it's time for her to go to bed (she's almost always half asleep at this point) - put her in her crib at 7:00pm on the fucking dot; and she's out like a light until 6:30am.  Every.  Fucking.  Night.\n\nShe knows it's time for bed; because the routine informs her so.  By the time I'm reading Goodnight Moon, it's like a mystical incantation.  'Oh...those are the sleep words...what are words?...I'm tired...'ZZZZZZZZZZZZZZZZZZZzzzzzzzzzzzzzzzzzzzzzzzzzzzz",
            "You've clearly never experienced the frustratingly tear-inducing impotence of insomnia\n\nAnd I envy you for that",
            "Adults don't realize when they're tired and whine and carry on like babies, too.",
            "As someone who works pretty extreme hours, your emotional control dissapears even as an adult with lack of sleep. Infants and children are no different, and they lack the means of communication to express their needsas well.",
            "I get cranky af when I am sleepy. I totally get it.",
            "To be fair, I cry whenever I'm sleep deprived. If I've had 4 hours or less, it's a guarantee that I will cry or throw a tantrum at some point, usually in private. If it was as simple as just going to sleep when you're tired, do you think anyone would be an insomniac? Babies don't know how to count sheep or mix up a nightcap yet. And everything is so new and exciting to their developing brains, all that stimulus keeps them awake past when they need to recharge. They also probably don't feel safe falling asleep without a guardian close to them for protection, so they cry when they're tired to make sure they're nearby first. It's instinctual.",
            "Learning how to self soothe doesn't come naturally to most babies. I have babysat school agekids that cried when they were tired.  It was somewhat annoying lol. Some adults don't learn this skill either.  Insomnia is somewhat big business.  I haven't had a problem going to sleep since I had three kids.  Sometimes they throw my sleep schedule out of whack, but I still can sleep when tired.",
            "Imagine having no idea how sleep works and feeling your body falling away from your control. I would cry too",
            "They’re dumb potatoes that don’t know how to fall asleep lol.",
            "IDK but they're loud and annoying - glad I don't have one.",
            "I guess because they aren't comfortable, not talking about being on a bed or not I meant that they feel unprotected so it must be a survival instinct we still have.\n\nBut thats an interesting question though, maybe r/askscience has an answer",
            "Animals tend to not want to sleep when they're not sure their surroundings are safe. Infants are dumb and don't know what means what, so they're more likely to misinterpret their surroundings.",
            "When you're a baby,  everything unpleasant is literally the worst thing you've ever experienced. \n\nBut he'll,  if I go to long without sleep,  I cry too.",
            "They cry because they require comforting and want to ensure mother is right near him. \n\nIt would be inconvenient to fall asleep when mother is absent. Sleeping baby is an easy meal for predators and its also much easier to step or squish a baby due to lack of movement.",
            "Uhhh I'm 32 years old and I still have this problem. It's looks a little different now, but not much honestly.",
            "the problem is not the crying the problem is the volume. anything beyond 120 decibels causes damage in the long term for prolong exposures.\n\nBabies crying can reach 150 decibels easily which makes it really hard to ignore...",
            "They're crying because they can't sleep; they need someone to comfort them so they can fall asleep.",
            "Some infants just want to watch their parents suffer",
            "I wanna cry when I can't go to sleep as an adult, knowing I'm tired. I'm sure a giant being warmly rocking me to sleep would solve that too.\n\nI'm not even kidding, that's the first answer I thought of.",
            "But wheres the fun in that?",
            "Because they want to be held and rocked to sleep",
            "Because they don’t know that they can just sleep and that nobody’s gonna stop them from doing that because they’re infants and that’s what they do.",
            "We all have a sleep window. \n\nTry to sleep too early and you aren’t tired enough. \n\nStay up past your window, and now your body has to start pumping adrenaline to keep you awake and alert. Thing is, adrenaline feels good. It reduces pain, slows time, and raises alertness. Combine this with being tired, and now you’re irritable. \n\nSo now you’re trying to put someone to sleep that is basically in the equivalent of a fight or flight response. \n\nYou have to calm them down first. They need about ten minutes of calm for the adrenaline to flush out of their system. After that, the tiredness can start to take over.",
            "It’s how babies communicate",
            "Don't pretend that you don't lay in bed and cry yourself to sleep like we all do.",
            "Because existence is pain",
            "From an evolutionary perspective, if an infant were to fall asleep without an adult present they could be in a lot of danger. If they make a bunch of noise and wait to be comforted before they sleep their chances of survival are higher.\n\nThat's my theory anyway.",
            "I ask my 8 year old the same thing",
            "Self soothing is not a natural instinct. It has to he learned.",
            "I suspect there is an evolutionary component to this as well that isn't about the baby, it's about manipulating it's environment. Crying triggers a reaction from the parent-teacher the parent realizes the child is sleepy and provides them with an environment conducive to sleep.",
            "I usually think that they love their life so much that it is unbearable for them to loose conscience and also they have no understandig of the fact that they will actually wake up again and things will be the same. So for them its like dying over and over again. I think i would cry as well if i thought i would not wake up again. But at some point  i got convinced that i always will. Maybe you should tell them :)",
            "I think of it as saying, “MY BODY FEELS UNCOMFORTABLE AND I DON’T KNOW WHAT TO DO!!! HELP!!”\n\nHow Emotions are Made by Lisa Feldman Barrett is a good book to read if you want insight from a smart person.",
            "Babies have no other way of communicating besides crying. So literally if anything happens that is adverse they will cry. Teething, tiredness, hunger.\n\nAs kids grow older and their language skills improve this becomes less of a thing because they can communicate their wants and needs more easily.\n\nTantrums happen but they're less frequent.\n\nThat's also why developmentally delayed kids in their younger years will throw significantly more Tantrums than a normal child because they don't have the ability to communicate in the same way and so they just resort to whatever noise making an attention-getting ability they have.\n\nIt's the same thing that basically goes through a baby's mine. I'm uncomfortable so I'm going to make noise to express that discomfort to try to divert attention to the problem",
            "They don't understand how to reason. They don't know what tired is.\n\nLike you can't think, I suppose.",
            "Parents have to teach babies everything, including how to sleep. Obviously it takes a long time to learn certain skills, sleep being one of them. They don’t know that they’re tired and need to sleep to feel better... this is all my opinion anyways. I wish someone explained this to me before i became a mother haha",
            "because being tired can feel *very* uncomfortable, and everything is new to them.",
            "not joking, I cry too when I am tired and exhausted and often do not know how to fix it. sometimes just \"go to sleep\" isn't an option to fix it.",
            "Don’t you get uncomfortable when you’re really sleepy? Or get annoyed at every little thing? \n\nThere are many many times as an adult I’d like to just plop on the ground and cry for someone to just put me to bed. Little ones just haven’t learned the art of dealing with it.",
            "Imagine not knowing what sleep is, you feel like fainting and you think this is it, you're gonna die, lol",
            "Learning how to put yourself to sleep is a skill which takes time to learn. About two days if left on your own. When my daughter was twelve weeks old, it was time for me to go back to work, so I couldn’t be rocking her to sleep all night. I let her cry it out. My husband thought I was cruel, but I assured him that’s what the books said. It was terrible. The second night was also terrible, but the third was night was awesome, and bedtime was never again a problem for her. \n\nI was much more indulgent with her brother...",
            "I KNOW RIGHT",
            "Because babies are bad at time managment \n\nHannibal B link: https://youtu.be/xp2KsaI4uKY?t=38",
            "Because every sensation is new to them.",
            "Because you have to pretend to go to sleep before you do got to sleep and babies do not always understand that because being tired is a chemical soup of your brain needing time to rinse to be able to understand that.",
            "INFANT CRYING DROPS TO 0%",
            "This is hilarious.",
            "Sleeping is an art and luckily I’ve inherited my dads ability to sleep through a storm (Hurricane Sandy)",
            "Babies aren't as smart as adults. They don't know what it means to be tired, and they don't know how to solve the problem either.",
            "Because r/kidsarefuckingstupid",
            "Why do people think it’s funny to call babies dumb, or dumb as fuck?  Or read Books like “go the fuck to sleep”. \nIt’s a parents job to teach them EVERYTHING and if you don’t have the patience for that please don’t have one. Its not cute or funny to swear at or curse at a baby. They are literally helpless little people that are crying out for love, comfort and attention. \nTo all of you that think it’s cute or funny, babies don’t get sarcasm. Even if your baby doesn’t understand what you’re saying, they can sense your irritation with them and it probably causes them more stress which defeats the cause of helping them fall asleep. \nComfort your baby the way you wish you were comforted. Take long deep slow breaths when you feel your anxiety rise and rock them and reassure them. \nThey aren’t stupid and it isn’t even a funny joke to say that they are."
        ]
    },
    {
        "post_id": "r4blzp",
        "author": "None",
        "title": "Are there any movies that have no trees in it?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/r4blzp/are_there_any_movies_that_have_no_trees_in_it/",
        "score": 20452,
        "num_comments": 7237,
        "created_utc": 1638126125.0,
        "selftext": "I had a conversation with my mother, and we couldn't think of a single one. It's getting quite annoying. Please help.",
        "permalink": "/r/NoStupidQuestions/comments/r4blzp/are_there_any_movies_that_have_no_trees_in_it/",
        "comments": [
            "Cube.",
            "[deleted]",
            "Exam. It all happens in one room.",
            "Sphere(1998) or maybe \nPandorum(2009)\n\nShark tale(2004) might not have any trees",
            "Buried takes place entirely inside a coffin. No trees there.",
            "[removed]",
            "All is Lost. Entirely set on a boat. Also completely void of dialogue. The only lines Robert Redford speaks is when he is trying to get help on the radio.",
            "I’m going to think this during every single film\nI ever watch now, but I actually don’t mind it as far as lifelong challenges go",
            "[removed]",
            "The platform",
            "The Thing",
            "The March of the Penguins maybe?",
            ">Paint Drying is a 2016 British feature film directed and produced by Charlie Lyne. The film is about paint on a wall drying, lasting for ten hours and seven minutes. [Wikipedia](https://en.m.wikipedia.org/wiki/Paint_Drying)",
            "Man I almost said Guardians of the Galaxy. Tried to think of all the planets they're on before realizing Groot is a tree",
            "Event Horizon?",
            "There was a show when I was in high school that only had one tree and it was on a hill.",
            "Many of the Star Trek movies.",
            "The Abyss\n\nAlien\n\nAliens\n\nAlien^3\n\nAlien Resurrection.",
            "Enemy mine",
            "There’s a film called The Platform that I don’t believe has any trees. I think it’s a Spanish film. It’s basically set in this weird prison where the top levels get to eat from a table of food first and as the table makes it’s way down to the lower levels, there’s less and less food. I think it’s supposed to be a metaphor for a social classes or something. Definitely worth a watch. Anyway, as far as I can recall, there are no scenes outside the prison and therefore, no trees.",
            "Something that’s in space the entire time",
            "That movie where Ryan Reynolds is in a box the whole time.",
            "Deep Blue Sea?",
            "Moon. Great movie\n\nEDIT: OK I completely forgot theres trees at the beginning. You guys can stop replying with it now lol.\nJesus one person even narrowed the trees down to the second! Good job",
            "Metropolis, made in 1927. Takes place entirely in their idea of a futuristic city, which was totally devoid of trees.",
            "Blade runner?\n\nThere are also a fair number of movies that I can imagine taking place entirely on a ship ( space or otherwise)",
            "Pitch Black.",
            "I’m not 100% certain but, “Saw”? The majority is set in a bathroom.",
            "I'd say your best bet would be movies that take place at sea, in the arctic, or in space. \n\nThere is also The Decent which takes place entirely underground/in caves. I don't recall if there are trees in the beginning. \n\nPretty sure The Thing has no trees.",
            "\"Does it have trees?\" Isn't something I have in mind when watching movies, so I can only guess, but some of the Batman movies may not have them.",
            "Im pretty sure mad max fury road has no trees in it idk i may be wrong tho.",
            "Tron?",
            "12 Angry Men?",
            "Das Boot \n\nMOON",
            "Phonebooth",
            "THX1138",
            "If you mean real trees, the LEGO movie has none. If you mean representation of a tree than idk",
            "Locke with Tom Hardy.",
            "Interesting. I've never really thought about it.",
            "Robots",
            "The first SAW movie",
            "Alien",
            "Open Water maybe?",
            "Titanic",
            "[deleted]",
            "Snowpiercer?",
            "Dune?",
            "The movie Bug which is based on a play that takes part entirely in a hotel room. It’s a great play, currently at the Steppenwolf if you happen to be close to Chicago",
            "Eraserhead maybe?",
            "Glengarry Glenross :)",
            "Wall-E?",
            "Finding Nemo?",
            "My dinner with Andre",
            "Maybe 'Das Boot'",
            "12 Angry Men, the entire movie transpires in a jury room as they decide the fate of the defendant. Amazing movie if you haven’t seen it.",
            "Moon",
            "The Abyss",
            "U-571?",
            "Event Horizon",
            "Bronson.\n\nTHX 1138.\n\nWhere there any trees in The Fifth Element ?",
            "Maybe something like the Maltese falcon or other film noir type movies that are primarily based in cities and offices",
            "The Lorax",
            "Alien, Aliens, Aliens 3\n\nThe Thing\n\nMy Dinner with Andre maybe?",
            "The Riley Reid porno that is of average length to a full movie, could be considered a full movie in which no tree was ever seen. Only wood",
            "Dogville I think",
            "Inside by Bo Burnham",
            "Buried w. Ryan Reynolds",
            "Dogville?",
            "Ay first I thought Water World would be a good choice, but then I remembered that tiny orange tree he was growing and dreaming of harvesting from.",
            "The Guilty. Watched it recently and is only about Jake Gyllenhaals character at a 911 call centre working night shift. Guess no trees there.",
            "This needs to be a category on Netflix.",
            "Hyper cube. Whole movie is filmed in one room. Fantastically God awful movie",
            "Apocalypse Now. Siege of Firebase Gloria. Platoon. Full Metal Jacket. We Were Soldiers. Casualties of War. Hamburger Hill.\n\nAll the trees you see are actually VC/NVA.",
            "Ass",
            "Finding Nemo?",
            "The cube",
            "The Platform, Blade Runner, off the top of my head.",
            "Cube",
            "Happy Feet",
            "Locke. Whole movie is in a car.",
            "Alien?",
            "Nanook of the North",
            "Some porn movies",
            "I almost said Guardians of the Galaxy and then I realized one of the main characters was a tree.  I was trying to think of outer space movies and that was the first one that popped in my head.",
            "I saw a Mongolian movie called “the cave of the yellow dog” I’m pretty sure there were no trees in that movie since Mongolia is largely a giant field",
            "Underwater w Kristen Stewart",
            "Dune??? (The new one)….I just remember desert sand only, and some rocky areas, but no trees, I think???"
        ]
    },
    {
        "post_id": "mh5lz7",
        "author": "B34TBOXX5",
        "title": "Why are mass shootings only perpetuated by males?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/mh5lz7/why_are_mass_shootings_only_perpetuated_by_males/",
        "score": 20450,
        "num_comments": 2809,
        "created_utc": 1617195703.0,
        "selftext": "Every time there’s a shooting announced, it’s always a male shooter. I did some reading and found that according to the FBI, only 9 of 250 mass shootings in the US from 2000 to 2017 involved a female shooter, even though they make up 50% of the population. From social media posts I’ve seen shared it seems there are many women who are into the 2A open carry gun crazy culture that exists in the US, why aren’t there more females that commit gun crimes? Is it related somehow to the psychological differences in men vs. women?",
        "permalink": "/r/NoStupidQuestions/comments/mh5lz7/why_are_mass_shootings_only_perpetuated_by_males/",
        "comments": [
            "I don't have an answer, but I wanted to add another question by pointing out that familicide is more often committed by men too: [https://theconversation.com/why-do-men-kill-their-families-heres-what-the-research-says-132314](https://theconversation.com/why-do-men-kill-their-families-heres-what-the-research-says-132314)",
            ">Shooting into a room full of innocent people as they cower in fear \"is very sadistic,\" O'Toole said. \"And sadistic violence like this is almost exclusively male.\" \n\n>Most men, of course, go through life without killing anyone. And motives for crime are very individual; not all women and men who kill do so for the same reasons. Each case is unique, experts stress. But something in the combination of male biology and socialization makes men more prone to violence. Notably, the gender gap in violence is found in almost every culture around the world, Garbarino said.\n\n>**There are no simple answers. The easiest theory to digest is probably an evolutionary one: Males, over hundreds of thousands of years of development, have historically been rewarded for aggression.** A tendency toward violence is seen in chimpanzees, humans' closest living primate relative. (Bonobos, humanity's other close primate family member, are far more peaceful, though recent research has shown they are drawn to jerks.) Violence can beget status for males, both in chimps and in humans (just look at how many action heroes get the girl). And for males, a lack of status can mean missing out on the chance to mate.\n\n>Indeed, sexual frustration is a theme running through the writings of many male mass shooters, Lankford said. Many shooters leave manifestos explicitly detailing their hatred of women and of men who seemed to navigate relationships with women with ease.\n\n>\"By contrast, I'm not aware of any female attackers, even though we have a small sample, I don't know that any of them complained about not being able to have sex,\" Lankford said.    \n\n>Status plays a large role in school shootings, a particularly male phenomenon, said Katherine Newman, a sociologist at the University of Massachusetts, Amherst. Newman, author of \"Rampage: The Social Roots of School Shootings\" (Basic Books, 2005), argues that there has never been a typical school shooting with a female perpetrator. A case in San Diego in 1979 involved a teenage girl who lived across from an elementary school and started shooting children and staff from her home one morning. But in cases of random shootings on school grounds by a person who is part of that school's community, the perpetrators are all male, Newman told Live Science.\n\n>These boys and young men may be responding to a cultural script that equates violence with masculinity, Newman said. Most are not loners. Instead, they try to join social groups but struggle. Their experience is one of disappointment and humiliation. So, they decide to trade in their \"loser\" persona for something more appealing, according to Newman.\n\n>\"Sadly for all of us, that something more appealing is the role of the antihero,\" Newman said.\n\n>Girls aren't similarly targeted with the notion that becoming a violent antihero is appealing, Newman said. Their reputational struggles play out in other ways, usually involving self-harm or nasty gossip.\n\n>The gap in aggression between girls and boys has narrowed, though, said Garbarino, author of \"See Jane Hit: Why Girls Are Growing More Violent and What We Can Do About It\" (The Penguin Press HC, 2006). More popular media show girls and women acting in violent ways, which provides role models for female aggression, he said.\n\n>Still, the gender gap in lethal violence hasn't shrunk like the gap in general violence, Garbarino said. It's a mystery as to why. Men may be biologically vulnerable: Variations in a gene called MAOA combined with early developmental stressors like abuse or drug use can raise a man's risk of criminality. Men are also more likely than women to base moral decisions on abstract principles rather than on empathy, Garbarino said.\n\n[Female Mass Killers: Why They’re So Rare](https://www.livescience.com/53047-why-female-mass-shooters-are-rare.html)\n\nEdit: Several people have commented that mass shootings occur only in the US, but that is not true--the US doesn't even have the most people killed in mass shootings *per capita*. Norway holds that honor, thanks to the shooting of 77 people a few years back. Take a look at [World Population Review](https://worldpopulationreview.com/country-rankings/mass-shootings-by-country)'s page, \"Mass Shootings by Country 2021\"\n\n>For a highly developed and wealthy nation, the United States has an unusually high rate of mass shootings. However, it is a common misconception that it is the worst country globally in terms of mass shooting rates. The truth of the matter is that the United States is number sixty-six on the list of countries in terms of mass shooting rates per capita, but they have had more mass shootings than any other country in terms of overall numbers.",
            "You may not need to go as far as referencing mass shootings. I am sure someone else has said it already, but men commit most violent crime.",
            "Men are responsible for far more violence in general, so I don’t think it’s surprising that most mass shooters and serial killers are male, either. As for WHY men are typically more violent, there are a million reasons from biology to sociology. It’s very complex",
            "So as someone who studied criminal justice it really boils down to how male and females connect to their victims and how their emotions play into their crimes. Women tend to commit crimes against people they know intimately( like spouses, their children, other family members). Anger, betrayal, hatred women feel tend to be towards someone in particular rather than a large group. Therefore they will kill in more subtle ways and don’t make spectacles of the murder. \n\nMen on the other hand tend to vary in that regard. But we do see a trend in their anger, betrayal, hatred feelings be placed on a large group of people and why the mass shootings tend to happen though both genders do use firearms. \n\nIt’s kind of complicated and it’s really interesting to deep dive into these things but that’s basically the gist of it. It’s also important to keep in mind that the horrors that happen is the suspects/perpetrators attempt to gain control in a period of time where they don’t feel they have any. That can also drive to different responses. It’s pretty wild.",
            "Men have less tendency to seek help when they’re going through difficult times.  The idea that men are to be manly and admitting you need help or are struggling isn’t seen as manly by many people.",
            "Men don't want to get help or feel like they can't get help, and because of both biology and the social climate, men are just more violent on average.",
            "Don't have source on hand but my friend who studies psychology told me about studies and studies of men and women and where they differ in performance. As you might expect women and men are almost identical in all performances. Of course the physical ones are related to body strength and such but intellectual tests don't show any difference.\n\nOf courses for this one thing and that's aggression. Apparently men are 3 times as aggressive as women and that is a variable in everything else. This could be the answer to your question. Men and women both suffer from shitty delusional world views but the dudes will grab an ak and go to town",
            "[removed]",
            "[removed]",
            "Copy and pasted this from a similar question in another sub.\n\nWomen and men are largely the same when it comes to personality traits.\n\nAs in say women have an agression of 4/10 then men might have one of 5 or 6/10. But if you take into account that they both have a normal distribution then almost all of the 1/10's will be women and similarly almost all of the 10/10s will be men.\n\nUsually these mass shootings etc are catalysed by terrible upbringing or poor mental health or being fed  hateful lies or consuming hateful ideas. So when a 10/10 aggressive person gets landed with a life where they experience some or all of these things etc then they can result in incredbly violent out bursts and will almost always be men.\n\nAlso keep in mind that amoung men theres is a very strong stigma around mental health and venting etc so even if there was an exceptionally aggressive women it may be they she would have grown up with better mechanisms for coping with negative emotion.\n\nNote: I picked aggressiveness for ease but obviously theres many personality traits etc that can play into this.",
            "I guess women just don’t have bad days.",
            "Just for info, you probably meant “perpetrated” rather than “perpetuated”.",
            "[removed]",
            "[deleted]",
            "Men are statistically more prone to violence than women. Testosterone is an agressive hormone by it's very nature. Also men are less likely to admit they need help and to seek it (therapy) because if you're walking in to a public space with the intent to gun down innocent people, you clearly needed help long before it got to this boiling point.",
            "I believe it's a combination of several factors:\n\n1. Biologically men are more prone to aggression, having been the hunters and competitors for mates before civilisation began and rules changed\n\n2. Socially men are allowed to be more violent. Men are allowed, sometimes even expected to rough it out and use physical violence to solve issues\n\n3. Men are less likely to seek psychological help. Seeking help for mental issues is still seen as a weakness by most of society, and men especially are ingrained to not show weakness. So psychological issues build up over time.\n\n4. Men tend to be less social, which further eliminates a form of psychological support\n\n5. In recent times, the rise of groups like the incels and redpillers have created online bubbles that reinforce and regurgitate misogynistic and misanthropic ideas that lead these men to taking up violent means\n\nLikely to be more factors at play as well, I'm just listing what I have seen written about this subject.",
            "Margaret Atwood said, “Men are afraid that women will laugh at them. Women are afraid that men will kill them”. And that quote always makes me so sad as a woman. Actually, as a human.",
            "I think women are more prone to internalizing pain and men are more likely to externalize it. But who knows",
            "Historically men are more aggressive and volatile. It’s why I can’t understand why we haven’t had a woman’s president yet in the USA. I grew up in a town that strongly parroted that women would never make a good president because they would start a war every time they were on their period. But with statistics proving men are more prone to violence, I just can’t understand.",
            "Very much could be. Testosterone is a hell of a thing.",
            "Generally speaking: women tend to turn their pain/rage inward, while men release it outward",
            "I'll get roasted for this, but whatever.\n\nplotted along a normal distribution whatever metric you want, males will have higher variance compared to females.\n\nthis means that your psycopathic killers are very largely going to be men as a general rule.\n\n[https://en.wikipedia.org/wiki/Variability\\_hypothesis](https://en.wikipedia.org/wiki/Variability_hypothesis)",
            "[removed]",
            "Not a scientist. \n\nBut I’d have to guess it has something to do with how men are generally rewarded for their aggression and valued for the ways they can physically dominate others (sports, fighting, movies, warfare). \n\nThat has traditionally been less true for females in most cultures I’m aware of. \n\nI’d imagine the rates of female mass murder go up as women doing violences gets more normalized and celebrated... but who knows?",
            "There's a simple answer to this, not an easy one.\n\nMental health issues and how we resolve them. When societal norms punish for (or prevent people from) addressing their needs or being treated as subhuman...these people break those norms in a big way when they believe it's the best option. We knew this 19 years ago with Columbine and refuse to make the mental health system better.\n\nThese events will continue until we address the mental health stigma in the US (which places more constraints on men than women emotionally).",
            "I can't speak for every man, so take this with a grain of salt.\n\nIt always seemed that as young men we're taught that we're entitled to a certain amount of power and control in our lives. When we're, \"denied\" this power and control, an act of grandiose violence seems to be an acceptable response. Similar to when an abusive father flips the table at dinner. It wasn't a reasonable response on his part, but everyone present will still try to modify their own behavior in order to avoid further violence.\n\nWhen men of any age behave irresponsibly and irrationally we're typically defended rather than shamed. Like: \"Boys will be boys.\" Or something similar. \n\nSo if a troubled man feels that he's losing control and he concludes that extreme violence is necessary to reassert it, people will typically show him sympathy and defend his actions, no matter how irrational they were.\n\nAfter every mass shooting committed by a white man that I've seen, there is ALWAYS efforts to re-humanize him and sympathize. To me, this is essentially someone saying, \"Remember, he has every right to be violent when we don't behave. Just be better and maybe this abuse will stop.\"\n\nIt's victim blaming because a large part of our culture teaches young men that when they don't get what they want they need to respond with abuse and violence, and everyone else involved is at fault for not meeting his expectations in one way or another. \n\nIt's a man's way of expressing his frustration over his lack of control that he felt he was entitled to.",
            "Many are radicalized online by shit like MGTOW, the red pill, alpha male bullshit, and right-wing reactionary groups e.g. the proud boys, III%ers, “oathkeepers” etc. Look at shit like the columbine shooters, Dylan roof, the New Zealand guy, Timothy McVeigh, the Bundys and many more.  We cannot ignore the fact that so many of these people act to carry out some right-wing and ultimately white supremacist political motive. You can find statistics of terror attacks by ideology, and the huge majority is right-wing.",
            "i mean, why do way more men commit suicide than women? might be completely unrelated, maybe its got something to do with our biology, but i feel like maybe theres a connection. While we have come along way in gender equality, i feel like societal expectations towards men havent really changed at all over the past 100 years. women are \"alowed\" and encouraged to be independent and provide for themselves, but they dont have to if they dont want to. they can still choose to look for other peoples help and show weakness if they want to, and either way its considered to be brave.\n\nnow as a man, if you arent strong and independent, youre a failure, a looser, and people arent gonna hesitate to tell you. especially online, you WILL be made fun of. and if you show any signs of being hurt by all of that, its just gonna make it worse. If you fail, its your fault, and while im sure its not like this everywhere, its the reason why so many young guys nowadays feel isolated and dont have friends. When you hear the phrase \"grow up\" or \"be a man\" over and over while growing up, you quickly learn that people dont want to hear what troubles you, they are annoyed so all you can do is bottle it up inside.\n\nnow when you live in a world that seems to not give a flying fuck about you or your emotions, its easy to get angry and look for things you can blame your misery on. sometimes you see everything wrong with the world in yourself, which makes alot of people kill themselves, and sometimes people blame everything but themselves, so they take it out on others.\n\nmaybe all of this is nonsense, this is just my drunk opinion.",
            "Most tragedies are done by men",
            "Society subconsciously pushes men towards violence and steers women away from violence",
            "Men are raised to believe that violence is a method of solving problems.",
            "Because men are more violent. \n\nWhen you look at the average, it is true you won’t find much different. But mass shooters aren’t the average. When you look at the extremes, men are much more violent.",
            "> **Why are mass shootings only perpetuated by males?** \n\n&#x200B;\n\n>  only 9 of 250 mass shootings in the US from 2000 to 2017 involved a female shooter \n\nSemantics, but your original question should have been \"why are mass shootings disproportionately perpetuated by males\".\n\nI'm no psychologist but I think speaking from a place of rationale and reason it's easy to look at how warfare is marketed to males as opposed to females. The industry of weaponry and warfare is vastly targeted towards males. Hunting magazines are filled with dudes with all kinds of rifles and pistols. The toy industry puts billions of dollars into promoting toys that promote warfare - G.I. Joe, Nerf, etc. The video game industry is also by and large dominated by male players, though females have joined the fray in large numbers over the past 20 years, but outside of that every Call of Duty and Battlefield game is saturated with manly dudes doing \"manly war stuff\". *YOU* are the hero in most of these games. It might be odd to hear this, but there's a certain amount of romanticism surrounding it all, and it plays to what we're taught and shown as a male's base instincts of fighting for what you believe in. Even professional sports... they talk about fighting for a playoff spot. \n\nYou also have the stigmas of \"manliness\", such as \"just don't talk about your problems.. toughen up! Be a **MAN!** Why don't you grow a pair!\" There's so much toxicity surrounded the stigma of manliness. Being \"manly\" doesn't be a derogatory aspect, and it shouldn't be toxic, but toxic people get on social media and stigmatize \"manliness\" and then you hear people talk \"iT's An AtTaCk On MeNs!\" Toxic. It's toxic from both sides.\n\nAll of this is fairly anecdotal but it's really easy to look at the evidence and the state of society in the things that I mentioned and NOT see how it adds to a violent nature in males; which isn't to say that \"males are violent\". That's not the takeaway from this. The takeaway is that boys/males are targeted from a young age and across a wide swath of industries in a way that promotes violence. There are millions of video gamers who will never pick up a real gun and shoot another person, and there are a very minor portion of that population who *will* see gun violence as the only solution to their perceived problem. Those people are mentally vulnerable and that's why it's important to have approachable and affordable mental health care available for everyone.",
            "It is a combination of testosterone levels in males and socialization.   ~~We see aggression in males drop off after they turn 25 when testosterone levels also drop off.~~",
            "Even if the differences between genders is really really small, it gets exaggerated at the extremes. Only the most violent people will commit such an act. If it's a bell curve, while at the middle it might be a, say, 49.9-50.1 split, at the end, you'll see way more men. Same goes with the prison population, the homeless population, billionaires, etc.",
            "> Is it related somehow to the psychological differences in men vs. women?\n\nProbably, since single-offender violent crime is much more likely to be committed by a male.  Look at page 26 in https://www.bjs.gov/content/pub/pdf/cvus0702.pdf to see in 2007 that only ~20% of single-offender violent crimes were committed by women.\n\nAnecdotally, I think a big factor is in male culture during development.  As boys, we are very physical and it's just \"boys will be boys.\"  I routinely had my friends do things like dead-arm me and tackle me and smash me into things.  I have also accidentally broken friends' bones getting too physical during things like street hockey.  All of this and I am definitely what you would consider as a nerd, being on the receiving end from my stronger/bigger friends.  Then to top it off if you are always on the receiving end of this then one day you might just explode and a gun is the one tool to empower your rage as you've never felt power from within before.",
            "It's a great question and the even bigger thinker here is that 90% of all violent crime across the board is committed by men. I dont think it means men are bad or biologically designed to be this way, it's largely a societal issue",
            "Unrelated opinion: The idea that something like “250 mass shootings in 17 years” is normal/ shrugged off for this country makes me very, very sad.",
            "My personal opinion? Look at the reasons why mass shooters commit the act to begin with. It's almost always because they are at the bottom of the barrel of society. They're outcasts. \n\nThere is an expectation of society that men will take care of themselves. If a man can't fit into this mold there is no one to take care of them. There's no one that gives them sympathy. If a woman is down and out society takes care of them. Whether that be the government, their family or a man. A man who can't take care of himself is seen as weak and despicable. \n\nSo a man who can't take care of himself is put in a desperate situation. He either accepts his situation of nothingness. Dies. Or goes out in a blaze of glory. \n\nWhen you look at the mass shootings that have been carried out this is usually the reason. A man who has been slighted or outcast or oppressed or wronged in one way or another who decides to carry out his revenge on the society that did it to him. They see it as their only option because for one reason of another they have failed in society or are outcast and don't see any way out. \n\nThere is an enormous mental health stigma towards men. If a woman has mental health struggles it's okay for her to be cared for. She has infinited possibilities of marriage or living with her parents or living off the government. Society has ample protection mechanisms for women in place with little to no stigma or negative repurcussions. \n\nNone exist for men. Men do not have that option. Most will turn to drugs or alcohol or crime to survive. Kill themselves. Or simply bear it in silence. \n\nAnd sometimes they decide to take it out on the society that enacted it upon them. \n\nThat's my theory as to the reason for why men are almost always the perpetrators of mass violence.",
            "The one at Google was female but I am not sure it counts because she missed everyone.",
            "Repression, probably.  I feel like guys have a bad tendency to ignore what's bothering them until the explode.",
            "Men in this society are not taught to deal with weakness, but are taught to dominate others. That's it. That's all. The brain, as a unit of biology is not that fucking dimorphic.\n\nIt's also why cultures where men are told they can have emotions other than anger and frustration or where there's just less general impetus to dominance are *way less violent*. In preconial africa the americas many tribes in some spots *fought wars* nonlethally. The modern canadians have almost as many guns(and are probably, on average, better shots) but don't have anywhere near the mass shooting problem Americans have. Central and south america are shot through with machismo and violent guerilla movements (thanks cia!), but spree killers are, relative to the US; uncommon there.\n\nSo unless you're willing to talk about the evolutionary differences between Americans and canadians, let's not resort to evo psych bullshit. it's the culture.",
            "Women go to the source and kill their husband. Men bottle up their rage and release it on who ever may be available for punishment when they snap",
            "Toxic masculinity and repressed emotions.",
            "250 mass shootings in a 17 year period. Who would want to live in a country where this can happen by where at anytime?",
            "Despite making up 50% of the population, males commit 96% of the shootings",
            "The majority of violent crimes are done by men.\n\nIt could be biological- testosterone makes people more aggressive.\n\nIt could be cultural- men are often taught that most healthy ways of dealing with their emotions (seeking help or support from others, crying, etc) are demasculinizing and shameful. Meanwhile we glorify violent heroes in media- men who solve their problems with guns.\n\nMost likely it's a combination of the two, and then some.",
            "Women take their pain out on themselves.",
            "Larger and more direct question, if I may? Why are there mass shootings so frequently in the US?",
            "Men have no social floor and the endless pit beneath many of them paired with isolation leads to insanity and hatred",
            "Only 1% of people of death row are females",
            "There’s also very few women serial killers. It’s a major point of fascination with Aileen Wournos",
            "I heard something somewhere a long time ago about males are more likely to commit homicide than suicide and females are more likely to commit suicide over homicide. I forget the reasoning.",
            "When women/girls get sad and angry the kill themselves. When men/boys get sad and angry theyre more likely to lash out. That my personal theory.",
            "When you realize that a mass shooting is basically suicide by cop/murder suicide, it makes more sense.   \nWomen don't normally blow their brains out. They also don't normally have fantasies about \"taking them all with me\" when they go.   \n   \n\"Mass shootings\" are a final \"F-you\" to the world, by a suicidal person whom has given up on life.    \nWomen are far more likely to just take a bunch of pills, or slit their wrists in the bathtub.",
            "There've been a few by women.  For example, Brenda Spencer.\n\nIn general, gender conditioning.  Men and women are taught to deal with anger and stress differently.  This is an overgeneralized categorization and there are plenty of exceptions, but women tend to direct that anger towards themselves, while men are more likely to direct it outward.\n\nRemember that this is largely based on what and how they're taught.  If it were based on their personalities alone, you might see a more even distribution among the two, as women can be just as capable of angry and vicious behavior.  They often learn to carry out their vicious side differently, in a way more acceptable to their gender conformation.",
            "[removed]",
            "Because most men don't learn to control their emotions. They're thought that having emotions is weak. Then again it's not an excuse, because at some point in your life you should be able to work on yourself, but I think the discrepancy comes mostly from this",
            "[removed]",
            "I was driving down the road about 3 days ago with my wife when the truck in front of us started quickly swerving back and forth in the lane.  There was a car in front of them driving maybe 5 mph under the speed limit so it looked like this person was getting really impatient with them.  I said something like \"Look at this guy\" to my wife and she said something like \"Yep, that's gotta be a guy driving like that.\"  I didn't argue, and a second later when I put the hammer down and passed that fool like he was last week's news, tires chirping as the shift-kit kicked in and the diesel smoke engulfed his POS truck, I glanced over casually and....  Yep.  It was a dude.  Crazy, I know.",
            "my guess is it's less biological than social. men are raised to glorify violence as \"manly\" whereas women are not. men are also more frequently encouraged to hide their feelings... and instead deal with them through violence. this culture raises a lot of issues and i think the epidemic of \"violent men\" is one of them.",
            "In our American culture, men are much more stunted emotionally than women (of course there are going to be exceptions to what I'm about to say, but as this is a general question this will be a general answer).  \n\nBoys are taught from a young age to \"suck it up\", \"don't cry\", and sometimes even \"fight back\". Girls are taught to \"be quiet\", \"don't cause problems\", and so on. As we go, men are told they can achieve whatever they want, while we have discouraged women from higher education and leading roles for centuries. When a man punches another who insults him, we call him brave or proud. When a woman gives an order we call her bossy or uptight.   \n\n\nMaybe you can see where I'm going with this. In American society, men are taught that they can have whatever they want, and many of our iconic role models (both fictional and real) use violence to solve their problems. Women are taught that their place is to be seen and not heard, and if a problem arises, it is their fault and they will take it out on themselves rather than another.  \n\n\nAdd in the biological reasoning that males are naturally more aggressive and have more testosterone running through their body, it starts to be a little more clear. Note that nothing I have listed here should be read as an \"excuse\" for men who commit these atrocities. The responsibility lies on their shoulders. But it does stand to reason that our gender norms are outdated, and potentially dangerous.",
            "Short answer: Toxic Masculinity",
            "I'm pretty feminist, but legalized prostitution would help a lot as odd as that sounds. Safer for everyone.",
            "Incels",
            "It is NOT because of “societal expectations of men/masculinity”\n\nThese people do NOT care what society or others expect of them; to the contrary, they want to absolutely REBEL against it, and that’s mass murder.\n\nThey commit mass murder EXACTLY *BECAUSE* they are taught how WRONG it is, how morally repulsive and legally condemned it is.",
            "A combination of things  ( testosterone )men have 17 times more than women as a result there are a certain amount of men  that don't fear death  (Usually this benefits  a society).  Testosterones is the action hormone but if you combine it with  mental illness  or personality disorder you get a criminal or a maniac.  Fortunately  testosterone usually creates men who build  things or do dangerous jobs  that benefit society.",
            "When you ignore Men's mental health, these things tend to happen",
            "Let me just paint a picture of how the average boy and girl were usually raised.\n\nBilly: \"Here's a brand new toy pistol that looks like the real thing. Why don't you go outside and imagine you're shooting those nasty Indians? Or maybe pretend you're robbing a bank! How about you're storming the beaches of Normandy like your grandpa did?\"\n\nSally: \"Why don't you help mommy bake a nice cake? Oh, everyone will love it! I'll show you where to start. First you'll need...\"\n\nHeadline: \"Man mindlessly slaughters 12 in anger-fueled rage. He seems to have no ability to empathize with the victims.\"\n\nParents: (Shocked Pikachu Face)",
            "I have 2 reasons, Maybe cuz males have more testerone than women(which influences aggression) or maybe cuz, men are socialised to be aggressive, and violent like when two boys fight most people would say ‘boys will be boys’, and girls are socialised to be sweet and gentle."
        ]
    },
    {
        "post_id": "afxas9",
        "author": "GingaTheNinja110",
        "title": "What’s the toilet bowl on Reddit?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/afxas9/whats_the_toilet_bowl_on_reddit/",
        "score": 20446,
        "num_comments": 774,
        "created_utc": 1547482361.0,
        "selftext": "I really don’t understand. People talk about awards, and ‘Thanks for the gold,’ but people never see anything wrong with the toilet bowl. It literally has a turd on it. Can somebody please explain?",
        "permalink": "/r/NoStupidQuestions/comments/afxas9/whats_the_toilet_bowl_on_reddit/",
        "comments": [
            "Are you referring to the Silver badge, which is a white shape with a poorly-drawn letter \"S\" on it?",
            "I always thought the cake for cake day was an envelope and the idea was you could send someone a message (by clicking on their envelope) on their birthday (cake day) to wish them happy birthday.\n\nThen I realised it was cake, for cake day. Still looks like an envelope to me! ",
            "[removed]",
            "I don't see it, can anyone help me out? \n\n(No, I'm not asking for silver, I would like someone to point it out in an image, because I don't get the resemblance.)\n\nEdit: :(\n\nEdit 2: Mega :(",
            "Why is everything removed?",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "i havent seen reddit silver on pc, only heard about it on mobile but never actually seen it, what does it look like?",
            "[removed]",
            " It kind of looks like a creepy toilet now that you mention it. \n\n That’s honestly probably really fitting since silver is shit anyway. \n\n Hell, the new gold is as well. ",
            "[removed]",
            "Why are 90% of people getting removed? And to answer your question question OP, it's not really meant for anything. Bragging rights at most though. And you get access to a subreddit called r/vip which is only for people who have been gilded.",
            "[removed]",
            "This is stupid. It's a stupid post.",
            "I came here looking for a comment explaining what the silver does and there’s NOTHING what gives? ",
            "[removed]",
            "Wow didn’t know you could just pretend to be stupid to get karma",
            "[removed]",
            "[removed]",
            "Is this the biggest fish for gold ever? It apparently worked as they currently have 123 silver, 3 gold, and 2 platinum. ",
            "[removed]",
            "[removed]",
            "I am 100% referring to Reddit Silver as a Reddit Toilet Bowl from now on.",
            "[removed]",
            "[removed]",
            "[removed]",
            "Wait reddit silver actually has an award thing now? I thought it was just a joke",
            "[removed]",
            "So we have a silver toilet with a turd, a golden star shitter and the toilet full of Listerine",
            "didn't reddit gold used to be a month of improved reddit? now they added platinum and made gold a week? that's platinumedly stupid",
            "The S is for Shitpost",
            "The S stands for shit.",
            "Platinum",
            "!oof!",
            "It's for the shitpost :D",
            "I love you random citizen for having this amazing question, take this platinum for my last coins",
            "Yo",
            "[removed]",
            "[removed]",
            "It means your post was so bad someone spent money to make sure people knew it was bad, kind of like an inverse gold award",
            "I always thought it was rock with the s carved in it, like for a caveman.",
            "[removed]",
            "[removed]",
            "I used to think it was a stone tablet with an “S” craved into it, as if a caveman made it. But it’s actually a silver medal. That’s what the “S” stands for (silver).",
            "It's silver lol.\n\nWhy give OP 123 toilet bowls when you can give a poor fella like me also a toilet bowl. I also need to take a dump, damn.",
            "[deleted]",
            "[removed]",
            "[removed]",
            "[deleted]",
            "[removed]",
            "Toilet - 100 coins. People don’t like toilets.\n\nBlue raspberry slushie - 1800 coins. People REALLY like blue raspberry slushies; even if it’s in a toilet bowl.",
            "[removed]",
            "As other people have said, it’s the icon for Reddit Silver. I’d also like to mention that it was [originally a meme](https://goo.gl/images/ZhXSBp), but then the people in charge of Reddit decided to make it an actual thing.\n\nAnyways, did I just witness the birth of a meme?",
            "Could also be a toilet lid?",
            "Looks more like a toilet seat to me. Guess someone was just impatient?",
            "Maybe the silver one should have Ag written on it. I wonder would it cause less or more confusion. "
        ]
    }
]