[
    {
        "post_id": "gxmfiw",
        "author": "leverage180",
        "title": "Why is it that Presidential elections always feel like choosing between the \"lesser of two evils\" and not \"the better of two good candidates\"?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/gxmfiw/why_is_it_that_presidential_elections_always_feel/",
        "score": 40376,
        "num_comments": 2669,
        "created_utc": 1591428159.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/gxmfiw/why_is_it_that_presidential_elections_always_feel/",
        "comments": [
            "Because your country runs on a first-past-the-post system. Only a single person can be elected and that person is whoever gets the most votes, so it makes sense for ideologically aligned people to pool their resources and present a single person instead of all trying to win and losing to a different unified party.   \nThis is why endorsements from the same party exist and why third party candidates can never win more than a few percentage points.",
            "Because it takes a fuck ton of money to get elected and that comes down to securing wealthy donors, who want something in return.\n\nThe incentives of politcans are fundamentally not aligned with the working class.",
            "God damn how I wish we had ranked voting- then we could actually vote our conscience without giving the election to worse guy",
            "I think this has a lot to do with the length of the election. Presidential elections now are almost constant with opposition forces aligning on election night for the next one. With almost four full years to scrutinize candidates and dig for dirt on people, everyone ends up looking like a lying criminal either because they are or fabricated \"evidence\" has time to be produced. And there is just so much coverage and analysis that the public just ends up voting for who they think is the least objectionable.",
            "It's the [problem with first past the post](https://youtu.be/s7tWHJfhiyo) voting.",
            "Because every single candidate is a compromise between two huge groups of people.",
            "2008 definitely wasn’t viewed this way. Idk why the other comment saying this has negative karma. There was huge nationwide enthusiasm for Obama as a genuinely good candidate and not a lesser of two evils.",
            "1.) We know more about their personal lives now. \n\n2.) Americans have become more polarized, and basically demand their politicians be lockstep with them on every issue. 40 years ago party discipline was less strong, and if a candidate agreed with you on 80% of issues, including your 2 or 3 most important ones that was good enough. Today that same candidate is a lesser evil.",
            "Every campaign spends more time tearing apart the other candidates than building themselves up. So all you get is negativity.\n\nThey do it because it is effective.",
            "Here's [an old comment](https://www.reddit.com/r/politics/comments/8fahr6/the_republican_party_not_trump_is_the_real_threat/dy1zzur/) of mine that addresses it.\n\n>We've got two major parties campaigning year after year on hating the opposition because if you hate the other team enough, you become blind to the corrosion of your own. It makes punishing your own politicians a non-option and leaves plenty of time for the grifter class to get on with the grifting. In the midsts of that a bunch of exceptionally corrupt assholes has settled within the upper echelons of the republican party and turned it into the dumpster fire it is today. Anyone who criticises them is labeled a dissenter or secret democrat or whatever. They're genuinely terrible by any standard, and lots of their own voters really hate them. But who are they going to vote for? Democrats? This sub has plenty of examples of democrats who practically trip over themselves to hurl insults at anyone who's not already a 'real' democrat. Any criticism of the party gets one labeled a dissenter or secret Russian or whatever. Of course, voting third party is treated like voting for the enemy too.\n\n>The net result is a bunch of entrenched voters who'll vote for \"their side\" no matter what, and a bunch of non-voters who are simply disgusted with the whole process and hope some hero will appear one day to clean up the mess.\n\n>The real threat to that entire system is education and journalism, which have been systematically decimated in the US.",
            "I'll go against the grain and suggest that it's because of:\n\n1. a concerted effort by certain people to depress enthusiasm and engagement, as this will favour their interests;\n\n2. an instinctive desire to \"see both sides\" of an issue, even when it isn't appropriate to do so;\n\n3. the media's need to maintain a horse-race narrative, as well as individual journalists succumbing to point 2; and\n\n4. the intellectually lazy culture of hating all politicians (\"they're all just as bad as each other\"), which is used to shield people from having to challenge their own beliefs.\n\nThis isn't to say there aren't elections where you have to choose the lesser of two evils, but I think it isn't as common as some people would like to pretend.",
            "Because when you run for president both candidates are demonized heavily by the other side so both are often viewed negatively. Also career politicians are almost always lying, stealing snakes so theres that",
            "A huge number of problems we have with our political system is directly caused by the very system we use to elect our officials. It's quite literally because of the First Past the Post voting system we use.\n\nRead more here: https://en.wikipedia.org/wiki/Comparison_of_electoral_systems\n\nFPTP guarantees a two-party system. It's seen in every single place it's instituted that it eventually devolves into an entrenched, fairly diametrically opposed two-party system. When you have an entrenched two-party system you get something called the spoiler effect. There's a lot of other problems with this voting method. It drives down voter turnout, it radicalizes both sides. You can actually see it polarizing 50% of the population against the other 50% anywhere it's implemented.\n\nBut the bottom line to answer your question is that we end up with vanilla candidates who's qualifications are, \"They aren't as bad as the other option\".",
            "Its because a 2 party system for a country of 300+million people is a garbage idea, a ton of developed countries have a multiparty system and it makes way more sense, society is too complex to be able to always find representation in just red or blue.",
            ">The major problem—one of the major problems, for there are several—one of the many major problems with governing people is that of whom you get to do it; or rather of who manages to get people to let them do it to them.\n\n>To summarize: it is a well-known fact that those people who must want to rule people are, ipso facto, those least suited to do it.\n\n>To summarize the summary: **anyone who is capable of getting themselves made President should on no account be allowed to do the job**.\n\n>To summarize the summary of the summary: people are a problem.\n\n>And so this is the situation we find: a succession of Galactic Presidents who so much enjoy the fun and palaver of being in power that they very rarely notice that they’re not.\n\nDouglas Adams",
            "You know it's a cold day outside when you see a politician with their hands in their own pockets",
            "Because campaign donation is legal corruption tbh",
            "Not sure if it has been discussed much yet, but in my opinion, the primary process has a lot to do with this as well. In the primaries, the really invested, hardcore Democrats and really invested, hardcore Republicans are choosing a candidate. This leads to radical candidates; more radical than the general voting public. \n\nHowever, this also leads to people making weird judgement calls, like what happened this time in the Democratic election. Choosing the person who is \"electable over people who may be better humans and leaders. Or looking toward who they will be up against and who is better primed to beat that person, instead of just choosing someone on their own merit. This leads to some compromises in who is the \"best\" candidate. \n\nAND, these organizations that run the primaries are not without their own agendas. The DNC and RNC are private organizations, with leaders who want to remain in power; with leaders who have their own back-door deals, friendships, investments, and personal agendas. This can also lead to the true \"best\" candidates being screened out in favor of someone who can benefit a small few already in positions of power.",
            "This is just your outlook.  Instead of looking at the person who is the lesser of two evils as the lesser of two evils, look at them as the better of two candidates since being the lesser of two evils makes you the better candidate.",
            "Because leadership, true leadership, is almost completely missing in the USA and other countries.",
            "Media.",
            "To quote Douglas Adams:  “The major problem—*one* of the major problems, for there are several—one of the many major problems with governing people is that of whom you get to do it; or rather of who manages to get people to let them do it to them.  \nTo summarise: it is a well-known fact that those people who must *want* to rule people are, ipso facto, those least suited to do it.  \nTo summarise the summary: anyone who is capable of getting themselves made President should on no account be allowed to do the job.”",
            " Because anyone who chooses to run for president is an asshole.",
            "Because the system is rigged against Americans. Democrat or Republican, it does not matter. Same result which history proves. The group at the top on both sides are heavily incentivized to maintain the status quo.",
            "I don't care who you like, support,  or policies you think your candidate has that will work.  Clinton Vs Trump was a complete joke and absolute shit show. Now we got Biden Vs Trump and yet again Im left sitting here thinking to myself...this is what our country came up with?another damn shit show.  We got Biden, a man borderline forgetting why he's even speaking but seems to have no problem smelling and creeping up on his underage relatives. A damn near full blown alzheimers patient. Oh and in the other corner you have Trump  a one percenter, land developer, reality TV show host who has been known to for a fact grope women and pay for sex. Known friend of Mr. Epstein whos the most famous sex trafficking pedophile in American history. I promise that no matter who you vote for it will do no good at all. Yeah,  yeah, we should exercise our freedom and vote, make a change....yeah, make a change alright.  If Mrs. Clinton is Bidens  vice prez I think within his 1st year she'll have had him assassinated and she'll be sworn in immediately.  Them slowly over the next year or so after Mrs Clinton has put a few laws and policies into the works members of congress, white house employees, secret service men and random citizens who oppose her will start to mysteriously start dying from conditions they never had, car accidents, and \"invisible \" snipers. Then the only man willing to put up with her madness, old Bill Clinton will step forth into her chamber deep within a white house bunker. There they will fight to the death. Meanwhile our new all powerful alien overlords will solve 99% of our problems in a day. As Bill Clinton raises  from the bunker ashrs with Hillary's skull mounted on his shoulder his eyes meet the new world paradise created by our new all powerful overlords. A beautiful race of creatures who only want to help and teach us how to live in perfect harmony with science and nature with unlimited free energy and the option to live for hundreds of years happily without sadness. But we decide we should decide exactly what we do with the knowledge they have taught us. The new countries of the world think they should control all others. Using stolen alien weaponry we didn't completely understand....we blow the entire solar system into dust.  Completing Elon Musks original plan as he heads to a n.v ew universe with a really strange mate he would call Grimes or something like that. That is the last bit of Earths written history.  By the Alien only known as Weird Al. Circa 2040. Written while om a 20system tour of 47 planets. He ends all his shows with God bless and Good night plant Cleveland!!!!",
            "In 2008, I voted for Obama but thought McCain was a completely acceptable candidate with many admirable traits. If McCain had won it wouldn't have bothered me. I voted for Obama against Romney, again if Romney won I'd be OK. Trump vs Clinton was the most disgusting choice I was ever faced in my life. I'm still not mentally right after that choice.",
            "Because for a lot of people politics is like a team sport. When their team loses they get salty and treat any other team as horrible. \n\nBernie bros are a perfect example for that, as soon as their team loses, they reveal they don't care about the actual policies, but their team winning.",
            "The amount of propaganda and day to day news you get. Perhaps this is just me being naive, but in my voting years:\n\n* Obama/McCain: better of two good candidates\n* Obama/Romney: better of two good candidates, midterm usually has a slight drop in quality of challengers anyway\n* Hillary/Trump: a shitshow\n* Trump/Biden: The Crybaby in Chief and one good candidate who has aged\n\nI'm not thrilled with Biden, but I think on some level he's a good person who has enough experience for the job. He brings life experiences that I think will be valuable. While he's not as progressive as I would like, I think his political compass is about where America's political compass is. That's a good thing, at least for now. I also think he recognizes that he needs to have wins for the progressive wing of the party if he wants to have another term or a Democrat succeed him.",
            "Because political parties need to make coalitions to get 51% of the electoral votes. Assuming you are a white male, college educated,  18-30 year old, you represent maybe 3-4% of voters. Everyone you know may agree with your political positions, but that’s because you’re only hanging out with people in your same narrow demographic. \n\nIt may seem obvious to you that weed should be legalized, student debt cancelled, socialism is great, etc. But here’s the thing, those issues don’t matter to a majority of Americans. Or they have different opinions. Other issues matter.\n\n Your opinions are not as obviously “right” as you think they are. politicians also need to take positions that represent other groups to get 51% of the vote.",
            "It's always between a giant douche and a turd sandwich. Nearly every election since the beginning of time has been between some douche and some turd. They're the only people who suck up enough to make it that far in politics.",
            "Because you have a corrupt political system that will only allow two parties the opportunity to see a candidate become president. Of course, those two parties will protect that.\n\nVoters believe that they are in a democratic country. They are not.",
            "As others have said it takes a lot of money to get elected.\n\nMoney makes the world go round, so you would be kidding yourself to think that an average Joe can suddenly win a presidential election. It takes many years of building up your following, getting lobbying power behind you, making friends in the right places who can give you endorsements.\n\nAll of that means that by the time you're in a position where you could potentially run for president, you had to do at least some degree of selling out, backing a corporation etc etc.\n\nIt's not exactly a secret that there is a lot of cutthroat, disingenuous practice to becoming the leader of a 300 million person country.\n\nOn top of that the media and political commercials are generally going to be hyper focused on making one candidate look bad.\n\nnews stations are going to present every story they can to make someone look bad, liberal outlets and vice versa. Goes both ways.\n\nto the point of completely dishonest and intentionally misleading reporting\n\nFox, cnn, etc will present quotes from Obama, trump clinton etc etc however they can to push a narrative. Sometimes it may be valid, and sometimes it may be an unfair Distortion of what was actually said.\n\nBut this means that when people watch the news, whether they are watching conservative Outlets or a liberal Outlets or relatively independent Outlets, they are seeing a message pushed of equating a given person with negativity at every turn.\n\nSo it quickly becomes a lesser of two evils situation.\n\nWe also live in a day and age where it is much much easier to see these stories. To watch the clips from news stations. So were exposed to influence reporting far more often then we were 20 and 30 years ago. the amount of negative media that we see is far greater. So this further perpetuates this notion.",
            "I mean, probably polarization. But it may be that as you get older, the image of who a “president” should be changes when you realize they’re all in it for their own interests. Idk if it has always been that way.",
            "Because it is much easier for large groups of people to agree on things they hate than it is to agree on things they like.",
            "It's very rare for a presidential candidate to perfectly align with your individual, unique alignment. So you choose the one that is \"close enough\" to your ideals. \n\nThe closer the aligned values match your core ideals, the better.... but sometimes both candidates only match your less important ideals so this feels like choosing b/w lesser of 2 evils.",
            "Because our political system is broken in ways I could never hope to accurately describe.",
            "Because the two party system is a cancer to this country",
            "The two party system is abysmal with your average American being brainwashed into hating the other party for the sake hating the other party, without understand how similar the two parties are on a vast majority of issues",
            "Because by definition the candidates are American.\n\nOkay, seriously: because in the US money buys votes and that makes politicians highly corruptable.",
            "The people who should be president know that it's not worth it to be president. The government was designed to make sure the president/executive branch doesn't hold too much power. The president in theory is a figure head with minimal power. You're \\*generally\\* going to attract people who are drawn to being in the spotlight and being a figurehead, not people who actually want to do good. \n\nOther roles, such as state government, gives you a chance to create more change and effect people more directly. In my opinion, that's one of the reasons so many governors have handled the coronavirus pandemic so well - they are smart people who genuinely want to serve the people, not just have the title of \"president\" for their ego.",
            "And this election sets the record. I think these candidates show how just much the system is broken. With all the incredibly intelligent people in the US and these two are what we get.",
            "Because the two party system is corrupt. Voting third party is the only way out.",
            "We often don't vote for the candidate that we like, in the US. We vote *against* the one we are told that we don't like.",
            "Because the two party system is bullshit.",
            "the truth is you actually have no choice. the presidential election is just a result of interests competing between two parties.",
            "Because it takes a degree of shittiness to get to a level of power where you can run. The money, the influence, the support, the *balls* required to run for president are not things every one has, and definately aren't things every good leader has. \n\nYou gotta lick some boots, bust some asses, sell people out, lie for money, all while keeping it together. \n\nThat said, trump has proven that the right doesnt need to do any of that.",
            "This problem is caused largely by the first past the post voting system we use, which is why ranked choice voting is so important. \n\nAlso, corruption: https://youtu.be/5tu32CCA_Ig\n\n'It comes from a very ancient democracy, you see...\"\n\"You mean, it comes from a world of lizards?\"\n\"No,\" said Ford, who by this time was a little more rational and coherent than he had been, having finally had the coffee forced down him, \"nothing so simple. Nothing anything like so straightforward. On its world, the people are people. The leaders are lizards. The people hate the lizards and the lizards rule the people.\"\n\"Odd,\" said Arthur, \"I thought you said it was a democracy.\"\n\"I did,\" said Ford. \"It is.\"\n\"So,\" said Arthur, hoping he wasn't sounding ridiculously obtuse, \"why don't people get rid of the lizards?\"\n\"It honestly doesn't occur to them,\" said Ford. \"They've all got the vote, so they all pretty much assume that the government they've voted in more or less approximates to the government they want.\"\n\"You mean they actually vote for the lizards?\"\n\"Oh yes,\" said Ford with a shrug, \"of course.\"\n\"But,\" said Arthur, going for the big one again, \"why?\"\n\"Because if they didn't vote for a lizard,\" said Ford, \"the wrong lizard might get in. Got any gin?\"\n\"What?\"\n\"I said,\" said Ford, with an increasing air of urgency creeping into his voice, \"have you got any gin?\"\n\"I'll look. Tell me about the lizards.\"\nFord shrugged again.\n\"Some people say that the lizards are the best thing that ever happenned to them,\" he said. \"They're completely wrong of course, completely and utterly wrong, but someone's got to say it.\"\n\"But that's terrible,\" said Arthur.\n\"Listen, bud,\" said Ford, \"if I had one Altairian dollar for every time I heard one bit of the Universe look at another bit of the Universe and say 'That's terrible' I wouldn't be sitting here like a lemon looking for a gin.\" '\n\nDouglas Adams, So Long, and Thanks for All the Fish (Hitchhiker's Guide to the Galaxy, #4), 1984",
            "I also believe a big part of the issue is the popularity of “smear campaigns”, wherein it is more important to demonize your opponent rather than talk about what a candidate actually brings to the table. As a result, the majority of ads seen by the voting public make it seem like any candidate they choose is a villain. You’re then left to either believe the ads, and feel dirty about your vote, or ignore the ads and thus begin to distrust the media. It’s very lose-lose, and the resulting desensitization of the voting public opens the door for actual villains to gain office.",
            "Because there's really only 2 sides to pick from, and they're both diametrically opposed to each other on what the function of government should be. The DNC and the RNC pick the candidate that gives their party **the best chance to stay in power**. Bernie Sanders is leaps and bounds more popular than Joe Biden, and was even more so than Hillary Clinton, and in both elections the DNC made a concerted effort to hitch their wagon to the candidate that best aligns *their* - not the American people's - interests, which often includes corporate interests. \n\nVoting 3rd party is essentially wasting your vote - no 3rd party candidate has gotten over 20% of the popular vote since Teddy Roosevelt in 1912... and Teddy was already a fairly popular President from 1901-1909. Most 3rd party candidates since Ross Perot (19% in '92) can't even squeeze out 5% of the popular vote. Hell, Bernie Sanders isn't even a Democrat, and still ran on the Democratic ticket because only the 2 party powerhouses have the money and the influence to make a viable run at the White House.\n\nSo based on the de-facto 2 party system we have, we are often left with 2 candidates that each only appeal to about half the electorate, and even that appeal may be more a function of being \"less crappy\" than the other candidate",
            "Because of the illusion of choice, and how easy it is to manipulate people who are scared",
            "Because you dont consider the rest of the ballot?\n\nIt has been 32 years since I voted for an R or D for prez, and while sometimes I dont feel much better about my vote,  but sometimes I do.  This year I will be happy voting.",
            "Because you're deluded.\n\nBarrack Obama is a stellar human being. John McCain is pretty good too. John Kerry is an excellent human being, as is Hillary Clinton. Mitt Romney is...not a terrible person. Jimmy Carter is as good as they get. George H.W. Bush is a decent person. Joe Biden is a good person too.",
            "Because you people keep voting for them. Find somebody to vote for, rather than just voting against somebody.",
            "Dawg there hasn't been a good serious candidate on the ballot since 2012",
            "Because we have a corrupt two-party system owned and run by the wealthy? It's not a secret.",
            "Because the media does an exceptional job on both sides of demonizing candidates that in all honesty are pretty regular people. We turn presidential candidates into mustache twirling villains who want nothing but the destruction of half of the country. \n\nNobody wants that, no candidate wants to get elected just to ruin the country. They have some differing ideas but buy and large they all want strong foreign policy, booming economy, and peace at home. They have different ideas on how to get there and anyone with a degree in policy can make them seem like they’re trying to tear down the very fabric of what this country stands for but all in all they’re usually two old white dudes saying the same things every candidate has said for the last 250 years. \n\nEven George Washington was demonized as a secret agent of the British Monarchy trying to undo the work of the framers of the constitution. Believe what you want about a president who owned slaves but I doubt a secret agent of Britain would sacrifice his personal fortune to oust them from the country, he was also president of the constitutional convention so I doubt he was trying to destroy that either. \n\nHistory shows us that since the dawn of this age of Republican Democracy people with agendas seek to uproot the reputations of relatively benign boring individuals by making them seem like grand masterminds bent on the destruction of the very institution they want to go down in history as effectively leading. \n\nThe government is by design very inefficient so for a president to be exceptionally damaging to the country they would need to preside over a very unlikely unity in all three branches across the board. \n\nI wouldn’t even bother to vote for a presidential candidate if you don’t like one. Vote down the ballot pick state and local politicians who genuinely believe as you do. Vote for senators and representatives who have your same goals. \n\nPresidents aren’t as powerful as we think they often just get blamed for the actions and failings of the government as a whole. \n\nPick a presidential candidate based on what you can tell about their judgment and ability to lead not so much their beliefs. Presidents don’t legislate policy they execute policy that is already written.",
            "Because we have a gamed duopoly. This is why ranked-choice voting is so important to establish.",
            "Because smart people don't do politics",
            "2 party system ran by criminal syndicates and the vast majority picking person over policy.\n\nIndependents in this Left vs Right war must feel like the Middle East during the Cold War.",
            "Because Boomers vote for shit candidates in the primary and young people don’t vote enough.",
            "Because people don’t vote in primaries nearly enough.  The people that do, typically are the most extreme and dedicated to that party.  It creates polarizing candidates.",
            "I was proud to vote for Barack Obama and still am.  So not always for me anyway...",
            "Because you started paying attention to politics in 2016",
            "Because the Democrats refuse to back Bernie.",
            "Because we don't have a choice, only the appearance of a choice.  \n\nEach party of the two party system picks their candidate who will meet their parties standards and needs... They don't care about you, just their own party and the leaders needs.",
            "Simple, third parties are not given fair coverage by the media and the system is rigged to make it extremely difficult to get on ballots.",
            "I’ve been told that because both the Democrat and Republican parties are largely profiteering corporations, they push for who will be the most profitable to them. They’ve enacted laws and rules to smother election reform and outside party and non corporate-friendly candidates.",
            " Because you have a stupid two party democracy",
            "This is not normal. You don't have to buy in to this. Vote third party.",
            " Lol! Just like South Park does every 4 years, choice of turd sandwich or giant douche.",
            "Because there are only two parties that have very polarised views. For example, you might not like immigration policies, you believe they are too loose but you want free healthcare and education. Or you like a laissez faire policy regarding immigration, but you don't support free healthcare/education. What do you do in either of these two situations? Of course, these are just examples, but I think they are pretty accurate in painting an image of the problem: there are ONLY TWO major parties that are pretty different, at least regarding domestic policy.\n\nAnother problem is that the parties themselves can have polarized views, and I think the best example was this year's Democratic roster, Biden v sanders v yang.\n\nFor example, even in a poorer country like mine, there are usually more than 5 candidates that legitimately have chances to win the elections. We also have a lot more parties, with more than 4 big parties.",
            "Because you’re made to think that.\n\nThat absolute worst thing for democracy and bastardising the “two party” system is SOUTH PARK:\n\nIT CAPTURED this GIGANTIC pool of 10-25 year olds that said: “who. Fucking. Cares. Douche or turd.... (ha ha ha ha).\n\nWell. Now we have trump. Four years. And 95% Trump another 4. (2024? I’d put money on trump again or his family or the worst version of the GOP. 70/30) Trump wins in 2020.... bye bye America as #1. China WILL be #1; they’re already making moves.\n\nSo thanks South Park. You told a couple generations of kids that voting sucks and all parties were equally guilty: enjoy your $500million fortune while we all forget the guys telling us all the candidates and parties are the same and to not vote BUT ARE MEMBERS OF THE 0.1% club.\n\nAHAHAHAHAHAHA hahahahaha.",
            "Obama vs McCain seemed like a choice between two really good people with different agendas. Same as with Obama vs Romney. You may just dislike the candidates, I don't know. Trump's base thinks he is better than Jesus, so they easily will feel like they are choosing the better candidate. Likewise, anti-Trump people will have zero problems fantasizing about a nice calm Biden presidency and easily think he is 1000 times a better candidate. But really it just comes down to what you consider a good candidate to be. I thought Obama and Romney were both good people, but they were both portrayed as the antichrist/worse than Hitler by opposing sides.",
            "Im Mexican and that happens here too. Too sad cause we dont actually have the power to choose for a good president but for the less stupid.",
            "Because that's exactly what it is. Always has been. Forever will be, sadly.",
            "You must be too young to remember 08.",
            "Because the two American parties both have a core elite that basically wants to run the show forever and they will sideline anyone who is even 10% of an outsider because anyone who isn't fully part of their mafia (yeah I said it) is a threat. Many of the people they put forward are thus elitist, greedy, sanctimonious, hypocritical and outright corrupt. Now semi-outsiders can get in if they have no decency and are willing to play even dirtier than their opponents, which is kind of what Trump did, he was such an asshole that he was invincible because all of his opponents appeals to some hypocritical and hollow notions of decency had absolutely no effect on him, and I say this as a person who dislikes him. \n\nSo there you have it. The majority establishments play it safe and push out corrupt, out-of-touch or even evil figureheads who keep the lid on things while the only outsiders who can penetrate are horrible because you have to be a real one-of-a-kind asshole to cut through this kind of web. That's why it's lesser of two evils almost always.",
            "It doesn't always feel like this. After Bush started invading other countries it was a no-brainer to vote for anyone but him, and when Obama came up on the ticket I was overjoyed to finally have an actual leader to vote for. Most of the other races have been the lesser of two evils, though, and I've been voting since the 80's. (I know people who saw Reagan the way I see Obama, too.)\n\nThe only other general-election candidate I actively wanted to be in office was Perot, but it was always clear (even at the time) that he couldn't win, so that wasn't a real choice.",
            "I think that’s just the last two"
        ]
    },
    {
        "post_id": "hgnj79",
        "author": "cristinayang2005",
        "title": "Does anyone scroll past a post and then scroll back up to upvote because it took a second for your brain to process it and once you get it you have to upvote it?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/hgnj79/does_anyone_scroll_past_a_post_and_then_scroll/",
        "score": 40224,
        "num_comments": 465,
        "created_utc": 1593234103.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/hgnj79/does_anyone_scroll_past_a_post_and_then_scroll/",
        "comments": [
            "Yep. All the time.\n\nGlad I’m not alone, lol.",
            "I do this and the opposite where I upvote it, click to see the comments, find that it’s either untrue or a repost and remove my upvote",
            "absolutely, I do it backing out of comments too",
            "Yes, but can we please stop with these simple \"DAE\" questions? Take that to oh, I don't know... r/DoesAnybodyElse",
            "I do this all the time. I also do a similar thing when I’m talking to someone where I ask them to repeat themself but respond before they say anything.",
            "Not so much process the information, more process my evaluation",
            "When my wife watches me scroll, and when I start laughing really hard, then keep scrolling, she like:\n>bitch I know you didn't just love that and not upvote it\n\nsavior",
            "Yes and also I read a post and think,  \"That's fucking brilliant!  I'm saving this for me to have to use somehow in the future,  wow, people on reddit are so smart!\"\n*continues scrolling*\n\nOops I should probably upvote that person.",
            "I did that with this exact post. I do it all the time.",
            "Yeah, I do it to downvote threads like this that belong in /r/DAE, not here.",
            "Usually it’s Bc I’m too lazy to upvote. Then I realize the post was actually deserving, so I scroll back.",
            "I kind of do the opposite. Sometimes I’ll absentmindedly upvote before I even process the post and then scroll back up to decide if I should keep the upvote or not.",
            "No offense but can we gently escort this sort of question to /r/DAE ?",
            "just did that to this post but with downvoting ♥️",
            "This was the first post I saw after one that I just did this to.",
            "Yeah but not for this one",
            "*\"You know I need it yesterday!",
            "Nope. I do not do this. I do it when I want to downvote a post though. I did it to yours.",
            "Nope, absolutely no one else does this.",
            "No, my brain is pretty damn fast. What kind of answer do you expect? You already know other people do this too. Go to r/DoesAnybodyElse",
            "Guess what i just did",
            "Aaaallll the time!!",
            "Oh yeah. Frequently",
            "Just did that :p",
            "Oh I did the same for this post.",
            "no, i am always 100% certain in my decisions",
            "Yes. No. What?",
            "I did that to this post so I would say yes",
            "I literally just did it to this post 😂",
            "[removed]",
            "Everyday all day. SOmetimes it hits me a few scrolls down as well",
            "All the time. \n\nI also often have to go back to posts once I realize I accidentally downvoted them to remove that mistake. I usually hold my phone with my right hand and the app has the downvote button alll the way to the right.",
            "I often close a thread and have to open it up again to look for an interesting comment I saw just as I was closing it.",
            "yes. \n\nany post that makes me laugh, I have to upvote.  personal rule.  even if they are insulting me (or trying to)\n \nsometimes by the time I realize I'm inhaling sharply,  I'm already down the page, or off the post completely, and have to go back to obey my rule.",
            "Yup. I *always* upvote progress pics on /r/intermittentfasting. Sometimes I'm just scrolling fast and may pass it. Some of those people, whoo. Just look fucking amazing. I'm always so god damn proud of them.",
            "I just upvote everything first them look at the post and if it's not insulting someone or calling to violence I leave it.",
            "Yes. I do it in real life too to extent. Someone will say something to me, my brain will take a second to process it, while I ask them to repeat themselves; by the time I’ve finished asking my brain has fully processed it so now I’m just standing there listening to them repeating themselves for no reason",
            "Literally me when I saw this post",
            "Not me, I don't really vote on anything. Sorry.",
            "I actually did this with this very post. Funny how that works out...",
            "Na",
            "Exhibit A: me on this post",
            "[deleted]",
            "Yes, in a way. Usually I hit the back button on my mouse while scrolling and then my brain sees and processes something the moment I hit the button. Then I have to go back and try to find the post again.",
            "Yes.",
            "Pretty often, yeah",
            "I do that but out of guilt",
            "No",
            "Is it a sign of that I am stupid?",
            "I upvote just to spread the good karma. \n\nIf I question upvoting, I usually give it the benefit of the doubt.",
            "ADHD’r here. Can confirm...I’ll actually do this a few times on the same thread...",
            "Did that to this post",
            "Kind of upset it happened with this post.",
            "I just did it with your post, lol",
            "I do it in real life between rooms and such.",
            "It is just what I had done now, you watching me?",
            "Same. It's kinda like when you check the time on your phone and you immediately forget and have to check again lol",
            "I had to scroll all the way down",
            "I actually just did it to this post lol.",
            "No you're the only one who has ever done that",
            "I'm the horrible non-voting or rarely-voting monster. \n\nI don't vote posts outside of hobby subs. For comments, I'll upvote poignant posts. I'll downvote people who are factually wrong, and karma crybabies who wine about downvotes.",
            "I do that all the time",
            "Fuck cheese",
            "I'll get back to you on that.....",
            "Sometimes I’ll get and enjoy a post right away, scroll on, but then scroll back up because my brain says: hey, you laughed at that, why no upvote?",
            "Did it on your post actually. A well earned upvote",
            "Ya'll upvote?",
            "I've never developed the mental habbit of giving a post recognition. Never have. Not Facebook, not Instagram, not YouTube. I just don't think to upvote/like unless I really really like it, or it's a response to my post or comment.",
            "does anyone never really upvote anything at all ? or im i the only asshole here ?",
            "I try, however a third of the time just as I'm scrolling up I'll accidentally hit something, or if I'm mobile the app will hate me, and Reddit will reload and I will have lost the post.",
            "I do that and if it only got less than 400 updoots I go and give it one.",
            "I just did that to your post",
            "Mostly because I feel guilty not showing the love even if I mildly enjoyed it",
            "This was exactly the answer we were looking for",
            "It’s more like deciding to upvote it or just let it slip",
            "Literally on this post....",
            "Literally did it to this post",
            "Yep. Did that with this post",
            "Just like I did with this one. \nCame to comment also, yes its true",
            "Errytime",
            "Yeß",
            "I did exactly the same thing with your post",
            "Did that just now!",
            "Son of a bitch just called me out as i did it to his post",
            "No because I don't upvote posts.",
            "Having the same with down vote. Actually way more often.",
            "All the time 😂 Take my upvote haha",
            "I do this with comments. I think I'm done reading through the comments and as soon as I back out my eyes read last one as I hit the button. Then I feel compelled to go back into the thread to give the post the upvote it deserves.",
            "Yeah, it's weird maybe but I want people to deserve my upvote... Once spend some mins finding a post back to check if it's a repost I just saw and downvote the repost",
            "I very rarely upvote anything. My upvotes are not easily given. If I do, I'm sure to leave my calling card.\n\n>Dear user,\n\n>I am writing this comment in order to inform you that I have upvoted this post. I know I know. Take a moment to breath. Take it in buddy. It's okay. Truly, you deserve this upvote for such a fantastic post and I'm more than happy to hand it over.\n\n>No no... Don't thank me. (I can see you typing the comment now haha). Please please. I'm a humble man I don't need your thanks.\n\n>With that said I have to tell you that I will be following your progression in the fantastic world of Reddit so keep it up. Maybe, just maybe. You'll do something worthy of my upvote again some day.\n\n>You have a fantastic day fellow user.",
            "Just did. Almost missed upvoting you.",
            "Lmao, I did it with this post.",
            "All the time dawg",
            "Nah. Fuck upvotes. I downvote like a motherfucker though.",
            "Literally did this to this post 😬",
            "All. The. Time.\n\nProbably because I'm on here at 4am...",
            "All the time, lol.",
            "Yes. Its just like the instances where someone says something, and you say \"what?\" and then your brain processes what they said",
            "Imagine camping in your back pocket?",
            "No. I'm very antisocial. I just lurk",
            "No",
            "No",
            "Sometimes i have to read a few comments to understand context ngl",
            "Just did.",
            "Yep. Happens every day.",
            "I'd say \"Yes, but that's because I now have an ABI (Aquired Brain Inujury) through alcohol abuse after divorce, but then I'd have to revisit this comment and dissent.",
            "No, I never upvote anything because I don't have a reddit account.",
            "Y'all upvote?",
            "Don't worry, I knew what to do with this one right away.",
            "No. No. No. No. No. No. No. But I usually  love reading and up voting all the comets. Then as I move along I down-vote OP.",
            "I did that for this post...",
            "Always",
            "Does it matter? I’m male",
            "You don’t lose it",
            "All the time. I even do this in conversation, like my mouth is faster than my brain. \n\nOften, when people ask me questions I say huh, and then I immediately answer the question without waiting for them to repeat it.",
            "can’t believe i had this feeling with the post directly before this one in my feed ...",
            "Nah. See, like this post. I immediately downvoted because I disagree.",
            "all the time",
            "Sometimes this happens with comments too lol",
            "I did it with this post just now.",
            "I did it with your post too😂",
            "I just did this with this post",
            "Nope,  never. Not even once.",
            "No ive never upvoted a post",
            "Yes, it happened while scrolling past this post 😂",
            "I literally just did that with the post above this one",
            "[deleted]",
            "I just dont vote on anything tbh",
            "Happens with downvotes too. Which I just did.",
            "i like to take it up a notch and comment on something else before i give it that uppity dangervote",
            "No, my brain doesn't lag.",
            "all the timeee",
            "Not this time, though.",
            "Does anyone else = yes",
            "Just wondering: Is that because you tend to read images in your mind rather than actually read \"live\"? Like, say, \"scan\" a frame and then read what text's there.",
            "Not only do I go back up to upvote, but also to read the comments and find out more. Idk how my brain misses stuff that I actually want to read.",
            "I did it to this post",
            "I do the opposite. Scroll past something and roll my eyes, then a moment later I go \"no, screw it, I'm gonna downvote\"",
            "Sometimes I scroll back up to upvote just based on the principle of it.",
            "Honestly, when I joined I was just reading, never even being able to vote or comment. And somehow it just stayed that way. I have barely given 200 upvotes on my 7 year old account. \n\nI feel like I gotta start giving more upvotes.",
            "It's worse when you see it on a page just as you click next page.  You click 'back'.  And..  It's gone.  And you never see it again.  So many upvotes lost because it took my brain half a second longer than expected.",
            "I just did that to this post",
            "Just did it with this post",
            "  **it took a second for your brain to process it**  all time",
            "Yes",
            "Yes.",
            "Yep. Nearly did with this post",
            "Nope.  We are all bots since the incident. Are you a hUMan!?! ALERT. alert!!!",
            "No. The vote function is stupid. I don't use it at all.",
            "Sometime I keep scrolling then feel bad for consuming a good post and not upvoting so I go back and upvote",
            "I feel that with upvoting I'm promoting content which I consider to be valuable. I also sometimes scroll back to upvote something because I consider my passivity towards something I find valuable morally wrong, I feel bad for not upvoting. I would even go so far as to say that it is our civic duty to help promote content which is aligned with our values and our quality standards.\n\nIt just crossed my mind that I never scroll back to downvote something. I wonder what can this tell me about my psyche...",
            "Yes",
            "no",
            "Yeah just now but I down voted your post.",
            "ok then I'll pay for my hip op",
            "Same with comments",
            "Nope, I frequently scroll back to downvote though because I realize how incredibly stupid the post is",
            "I often see new posts that somehow made it to my frontpage and I'm sceptical. I'm afraid it might be just a post pushed by bots or some agenda. So I hesistate to click it, watch it, read it. Until i wake up 10h later to see it's blown up, i trust all theses upvotes and watch/read it eventually. But by that time the post already has 100k upvotes and 50k comments and now my take on that matter is insignificant..",
            "It literally just happened to me with this post. Are you David Blaine?",
            "Just happened",
            "I do scroll back up but for a different reason, usually I just 'forget' about the whole upvote/downvote system. Then I think 'oh someone else may like this too' so I go back to upvote for visibility lol.\n\nSame reason I can't remember the last time I downvoted anything, simply don't care enough so I just keep to the next one.",
            "Does anyone else tired seeing this kinds of post?",
            "Just did.",
            "Yeah do that \n\nBut I downvoted your post",
            "Yes.",
            "Anyone in here who doesn’t upvote anything because in the grand scheme of things won’t matter anyway?",
            "i just did it",
            "I love to give original post a arrow up!",
            "Since it happened to someone else for free\"",
            "Every time my I find a r/breadstapledtotrees post",
            "Upvote for accuracy",
            "Lmao it just happened right after I read this post. Smh",
            "Yes",
            "Yup, but not this one!",
            "all the damned time.",
            "I did that exact thing on this post.",
            "Happens every time",
            "They’ve been cuffed behind her back????",
            "I vote on every post since my settings hide posts I’ve already voted, keeps my feed fresh.",
            "I literally just did this for this post",
            "Nice way to trick us to upvote this",
            "I just did that on this post...",
            "I don’t do this, but what I do do, is start watching a video and immediately realise that I like it, and so I upvote it, and then continue to watch it, and then when I get to the end I go to upvote it again and get disappointed that I can’t",
            "Nope, think I've upvoted 2-3 posts since I joined",
            "Does this have to do our part",
            "Scrolled back to downvote",
            "Happened just now",
            "What's an upvote?",
            "i saw a mushroom joke. At first I just acknowledged the premise. Bro a week later, it just fuckin hit me,  \"Ohh... [the premise].\"\n\nIt was the fungi-fun guy thing- but with a girl. So fun gal. haha. yeah no. it literally took a week for that to click, \"fungal\"",
            "Damn, litterly just did it with this post.",
            "Naw. Oh wait. Yes. Had to scroll back up.",
            "I just don’t really upvote that much.",
            "All the time.",
            "Yup and did it with this one",
            "I did it with your post.",
            "All the time !!",
            "Yup. Did it to this post",
            "I'm sure quite a few people do. I'm one.",
            "Sometimes we all do a double take",
            "Sometimes I see the amount of upvotes it got and give it a second chance because it must be good I just missed the joke",
            "Uh duh doy",
            "Just did it to this post lol",
            "nope",
            "Usually I'll scroll back up if I've decided to vote after the fact.",
            "Yep mostly posts about dogs.",
            "[Yes!](https://media1.giphy.com/media/TJgotk8MoedYFsvuYz/giphy.gif)",
            "[deleted]",
            "No",
            "I did it with this one",
            "Do you ever have a dream where you can where do can where you can do anything?",
            "Yesssss",
            "Only about 30 times a day",
            "Mostly happens to me on cool looking pictures.",
            "It's the internet version of a double-take",
            "I just did that for this post XD",
            "No",
            "Looks like more than 20k people, with their pure need to conect to others, fell into your trap",
            "Just did it for this post lol",
            "I do, usually I think oh that's cool then a minute of scrolling later I need to go back and scroll up to it.",
            "This happens to me with comments even when I had already close the post",
            "Constantly",
            "I do this with comments. On phone the \"disappear\" when you press on them long enough and I have time to read short funny comments in the meantime.  So I have to press again and upvote and then I see there are other funny comments below.",
            "Angrydownvote",
            "Me too! Although sometimes I scroll through, and I see a post I like, go past it, then scroll back up to see how many upvotes it has and the sub it was posted to",
            "Thomas wouldn’t think they had anyone behind Falk",
            "All the time. \nI did it with this post too.",
            "Get out of here with your karma farming.",
            "Just scrolled back to upvote",
            "Lol just did it here",
            "I upvote stuff before I click it.",
            "Just happened to me like 5 seconds ago. Anyone who reads this comment will know what I mean.",
            "DAE write shitty DAE posts for karma?",
            "I've just done this with this post lmao",
            "I always see sometime i like in that split second of the page being reloaded and i can't stop it in time.",
            "Did the same with this post",
            "Yes.",
            "Ha! Just did it on your post.",
            "no",
            "Did that with this",
            "Always",
            "Yup",
            "I just walked past this a couple of centimetres",
            "Me: *scrolls past this one without upvoting *\n\nThen me: “wait”\n*upvotes*",
            "W- the-222w2z22s22z222",
            "All the time bro",
            "They all get a load of this guy...",
            "[removed]",
            "Oh you mean like this one? All the time",
            "I do the opposite, I auto upvote and then realize it's garbage",
            "Yes. And in return, I get downvoted.",
            "RetardsInPyjamas...can't think of anyone better."
        ]
    },
    {
        "post_id": "r0rfrg",
        "author": "Ok-Praline-2940",
        "title": "Are men really that much stronger than women?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/r0rfrg/are_men_really_that_much_stronger_than_women/",
        "score": 40125,
        "num_comments": 15763,
        "created_utc": 1637713196.0,
        "selftext": "I’m a man, and recently I’ve been seeing post about women being weaker than men exponentially. [This post](https://www.reddit.com/r/tifu/comments/qulzyd/tifu_by_showing_my_girlfriend_my_actual_strength/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) is the one that surprised me a lot. It made it sound like the average guy is much stronger than the strongest woman. [This post](https://www.reddit.com/r/Cringetopia/comments/r09hsd/the_girl_is_cringe_the_guy_is_chad/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) had comments saying that her deadlift isn’t super heavy. I do lift weights and can deadlift over her weight, but I thought it was just because she doesn’t work out much. \n\nPersonally I have never been a situation where I have had to fight a women or pin one down, so I don’t know. I just thought women were slightly less strong if not equal, but I’ve been seeing things that say otherwise.\n\nEdit: To everyone calling me a dumbass, the subreddit is called no stupid questions.\n\nEdit 2: I have gotten so many replies my inbox has literally broke. Please stop.",
        "permalink": "/r/NoStupidQuestions/comments/r0rfrg/are_men_really_that_much_stronger_than_women/",
        "comments": [
            "I know some people have been acting like OP is silly for asking, but I don’t think every man actually understands. I remember trying to fight a guy off when I was a teenager, we were the same age and the situation got uncomfortable, I kept pushing him and trying to pull myself away, and I don’t think he even understood that I was doing everything I could to get away. I’ve also heard of trials where it’s argued that the women didn’t fight hard enough, but as hard as you can might not even be hard enough to notice with a man with tunnel vision. \n\nWe need to have these conversations because it’s dangerous to pretend we all know or even worse that we’re equally matched.",
            "When my fiancée and I play wrestle she always gets the idea she can overpower me but even when she starts on top, she's never even close. Sometimes I feel kinda bad about pinning her so quickly but that's because I forget how much of a gap there really is between our strength. \n\nA larger frame and a lifetime of testosterone makes a massive difference in overall strength even if you don't work out.\n\nI'm seeing a lot of comments in this thread of woman saying they took self defense classes and its great that they're taking that initiative. However it's valuable to keep in mind that confidence and a couple basic martial arts moves won't help you when there's such a gap in raw strength. Regardless of gender, best thing to do in violent situations is to run. Can't get grabbed, punched, kicked or stabbed if you've already run 50 feet away.",
            "This post is really opening my eyes to how many people did not grow up with a sibling of the opposite sex 😂",
            "Had an ex bf play tackle me once… you know, the way guys do with each other. It completely knocked the wind out of me and put me in a state of fight or flight. Once I got my breath back and realized I wasn’t going to die, I had to explain to him that women can’t handle that same force.",
            "I used to be friends with a dude who was 3 inches shorter than me and probably about 15kg lighter at the time. You can imagine my surprise when he pinned me to the ground with ease after i tried to say i was stronger than him.",
            "In terms of raw strength it would take years of weight resistance training for a woman (naturally) to be on par with an average untrained guy. \n\nThe trained woman would obviously have amazing endurance compared to the untrained guy.",
            "Way back when in Marine Corps,I was paired up with a guy during some hand to hand combat training. First punch to the foam pad and the guy knocked me out flat. \n\nI still have a visceral reaction when I remember getting knocked out.\n\nI'm very strong for a girl but it is no contest next to a guy.",
            "Growing up in the middle of a bunch of sisters and nieces my age, I could push 3-4 of their combined strength around at once. Where as my older brother could throw me at them like a bowling ball and they the pins.",
            "I realized while play wrestling with my fiancé. No way in hell could I get out of his grip so I better never get caught in the first place by a man that wants to hurt me lol",
            "There was a moment with myself and my older sister. \n\nShe's 10 years older and always fucked with me. Not in a bad way, just an older sibling way. We'd have punching contests and she would always win.\n\nShe then went to college.\n\nShe came home from college and I had grown from age 12 to 16.\n\nThe family went out to dinner and she tried to play the punching game.\n\nShe punched as hard as she could, in the arm.\n\nI, then reciprocated, with that same playful mindset.\n\nI punched her out of the chair.\n\nShe cried and I bruised her bone.",
            "[deleted]",
            "Quite a while ago I trained in a mma gym Im Venezuela since my back is really not great and because of my age I tried to stay away from the Young fighters. But I ended up becoming the older brother To everyone there. There was a young girl who I absolutely believe could make it big in mma. She had a temper and tended to be a little bit rough on training. From what I know she had some issues growing up and they would come out from time to time.\n\nShe got into an altercation with someone else and I made the mistake of trying to separate her from the person. She hit me 2 times and tried to take me to the ground. I lifted her up and took her to the other side of the gym. She calmed down and stopped talking to me for years.\n\nShe told me years later that she was afraid of me because I barely even moved when she hit me. It saddened me a little. \n\nTo be fair, I’m pretty sure she would have broken something if I let her take me to the ground.",
            "My husband and I are both weightlifters.  We work out with each other, so it's not like he trains a bunch more than I do.  We both hold a few of the records at our gym.  His heaviest deadlift is 4 times mine.",
            "I (woman) took a self defense class in college. Women led, all female class. We trained the whole semester on various techniques to escape an attacker. The point was to give yourself an opportunity to get away, not to over power anyone. End of the class we all had to “test” out against a fake male attacker. Our “attacker” was 50+ overweight, out of shape, campus security guy, who basically just swatted at us with boxing pads. Even so, within 2 sec of test starting, even using my “techniques,” I realized even this schlub of a guy was so much stronger and easily, EASILY could over power me if he were really trying. Sobering experience but I am glad I learned just how much stronger men generally are than women during that test.",
            "\"Edit: To everyone calling me a dumbass, the subreddit is called no stupid questions.\"\n\nI think your problem is that you hit r/all, so douchebags don't care about what sub it is.",
            "I think a lot of women have had a moment with a man they trust when they realize he is MUCH stronger and could hurt us easily if he wanted.  \nMy teenage son almost knocked me down being silly, not realizing how strong he is now. He felt terrible and did not mean to hurt me. My husband had to explain to him he can’t use the same force goofing around with girls than he does with his friends. My husband said his dad had to tell him the same thing when he grew stronger.",
            "A study done on the grip strength of 1,654 healthy men and 533 healthy women aged 20-25 years found that even professional women athletes in sports like Judo and Handball were significantly less capable than their unprofessional male counterparts. Although grip strength isn't telling of overall strength, it is still quite telling.\n\n&#x200B;\n\n>90% of females produced less force than 95% of males. Though female athletes were significantly stronger (444 N) than their untrained female counterparts, this value corresponded to only the 25th percentile of the male subjects.\n\n\\- [Source](https://pubmed.ncbi.nlm.nih.gov/17186303/)\n\nTo put that in perspective, if there were a room filled with 100 men and 100 women, 90 women could at best contend with the 5 weakest men. The remaining 10 women outliers, as advanced in athletics as they may be, could only grip as hard as the bottom 25 guys.",
            "The average man is noticeably stronger than the average woman.",
            "Yes.  The separation is around 3 standard deviations so the average man is stronger than roughly 99% of women.",
            "it's true, when I was being strangled I had to play dead after I realized quickly there was no way I could be stronger",
            "Due to a lifetime of testosterone, (we) men naturally build more muscle with less time and effort. It’s a scientific fact. And yes, the difference is massive. If it wasn’t, we’d actually compete in coed sports and not have it be a total joke.",
            "I’m a guy and of course I knew that men are usually stronger than women, but never realised that the difference was massive. Really makes you understand why women are genuinely afraid of strange men.",
            "Men are essentially on steroids (testosterone) when compared to women. I mean women have some test but when compared to men there is a very noticeable difference",
            "[deleted]",
            "I realised it when I challenged a guy to an arm wrestle for fun. I'm a big woman, 5'9 and muscular. I'm no body builder but pretty strong for a female, whereas my friend is a short and skinny dude. My other guy friend told me I won't even be able to win our skinniest friend so I tried and woah was I mind blown. \n\nI mean I kinda knew men are stronger, but I thought I'd be evenly matched with a small guy. Hell no I was not, it was instant KO. I'm glad I realised this at a young age, I'd be terrified if I lived my whole life thinking I can be stronger than men only to be proven wrong at a very critical moment.",
            "Yes. [This](https://www.castironstrength.com/elite-strength-sports-ipf-and-iwf-a-comparision-of-sex-and-performance/) is a good article on the topic of pure weightlifting sports. To put it in perspective [this article](https://law.duke.edu/sports/sex-sport/comparative-athletic-performance/)  by Duke Law says \"Just in the single year 2017, Olympic, World, and U.S. Champion Tori Bowie's 100 meters lifetime best of 10.78 was beaten 15,000 times by men and boys.  (Yes, that’s the right number of zeros.) The same is true of Olympic, World, and U.S.  Champion Allyson Felix’s 400 meters lifetime best of 49.26.  Just in the single year 2017, men and boys around the world outperformed her more than 15,000 times.\"\n\nYup, you read that right \"boys\" males under the age of 18. The best mature women in the world with a decade more training can't even touch an elite male high schooler's numbers. A woman has never broken the top 500 in the world in any of the athletic sports listed regardless of sex and they rarely break the top 1000.\n\nEdit: Thanks for the award strangers! This  is my first silver!\n\nEdit 2: oh my god thank you for the gold! This is my first gold too!",
            "I met my ex-wife when I was around 30 and because I was not into any sports or exercise and was relatively average to thin, she told me at one point in conversation \"I'm obviously way stronger than you\", because she was a more athletic type. I said ok, would you like to arm wrestle or something to see? She then was really shocked at how easily I prevented her from even moving my arm, let alone having any hope of winning, and then asked her when she had had enough proof, showed her that when I wanted to, her arm was going down.\n\nShe didn't understand that while exercise and athletics can have a massive impact on physical abilities, there is also simply a massive innate biological difference between the sexes when it comes to natural physical strength.  If you see a male that isn't an athlete, don't automatically assume he's weak.  You'd be surprised.",
            "I am a woman that has been lifting with the sole intention to get stronger for about a year now, with a focus on upper body. I recently took a young man I was mentoring to the gym. He is well-known in our group for being really small and weak— think like 5’ 6”, 120 pounds. He could bench as much as I could on his first time ever touching a bench. Testosterone just controls so much about your basic body structures; men are built for strength.",
            "Yes, men are generally quite stronger than women on average, testosterone is a hell of a drug.",
            "[deleted]",
            "Average for how much people can deadlift:\n\n[https://strengthlevel.com/strength-standards/deadlift/lb](https://strengthlevel.com/strength-standards/deadlift/lb)\n\n&#x200B;\n\n||beginner|novice|intermed.|advanced|elite|\n|:-|:-|:-|:-|:-|:-|\n|men|171|244|334|439|552|\n|women|85|132|194|267|334|\n\nIf you generalise this you can see there is a huge difference in the average strength levels of men and women.\n\nWhen I was 17 (not even fully grown) someone bet me I couldn't dead-lift 120 kg (two 50kg plates and a bar). I did it, and had never lifted a weight before or even been to a gym. . That's 264 pounds. But I am not notably strong for a man; just average.",
            "It's true. Men in general have more muscle mass than women do, we're also generally taller and heavier which also impacts the results. That's why weight classifications are so important in martial arts, you're very unlikely to be stronger than someone who weights way more than you.\n\nI'm a skinny and somewhat weak men thanks to a sickness I was born with but even I am stronger than most adult women to the point where only girls my size but that are also heavier can overpower me with some effort.",
            "Yep. I am a woman and I do Brazilian Jiu Jitsu and holy crap even skinny men can easily have their way with me. I’m still pretty new to it, but one day I will become more of a pain in the ass for them lol. And I was a drill sergeant not too long ago. Guess who was struggling more with tasks that required strength? Women. It’s reality, but none the less women should still strive to become stronger. Hit the gym, lift heavy weights, it will help with aging better and prevent osteoporosis.",
            "Im strong for a chick. Could propably become a decent weightlifter, if i tried. I chop wood, carry heavy shit and farmwork every day. My very thin boyfriend can absolutely ragdoll me. It's crazy how strong this very lean man is. Never met a man who wasnt stronger than me 🤷‍♀️",
            "Mens record deadlift is 1104lbs, womens is 636lbs.",
            "Just in terms of explosive power, not related to fighting:\n\nWhen I was 16 I competed in a county athletics championship. I'm pretty fast and despite not doing any dedicated training and running in spikes for the first time ever I managed to win the silver in the 100m sprint. I was very proud.\n\nThe time I got would have placed me 7th in the women's Olympic final the same year.\n\nThe guy who beat me, who was only 15 at the time, would have won it.\n\nIt's an order of magnitude difference.",
            "Only my own experience- when I first started dating an old girlfriend of mine, we were play fighting and she bragged about how she was pretty strong and could hold her own against her previous boyfriends; like they would try to push her while play fighting and she could withstand it. She worked out a lot, and at that point I had gotten really lazy and stopped working out- so I was intrigued.\n\nSo I was like, okay, let's test this. I pushed her at about half strength. \nNearly put her through the goddamn wall.\n\nI felt terrible, but after the initial shock we both did laugh a lot. She realised they weren't really trying (and I felt even worse for being the one to actually push her lol)",
            "Yes. There have been plenty of accounts of perfectly average men even beating women who train a lot.\n\nThe biological differences between men and women when it comes to strength are pretty monumental. There's a reason men are, on average, taller and more massive as well.",
            "The difference is pretty big, speaking as someone that was in the USMC working along side women. Even for such things as running times, not just raw strength.",
            "As someone who loves strong women this thread is breaking my heart lmao",
            "Hematocrit (percentage or red cells in blood) is 10% higher in men compared to women. Red blood cells carry oxygen so men have higher oxygen availability to work muscles.\n\nhttps://www.researchgate.net/profile/Cameron-Craddock-2/publication/272081679/figure/fig1/AS:271517581836319@1441746245009/Hematocrit-HCT-results-HCT-is-highly-correlated-with-hemoglobin-Hb-concentration.png",
            "In short, yes. \n\nA flabby, unfit man could overpower even a pretty fit woman, not accounting for specific martial techniques (such as stabbing him to death with a knife).",
            "When i was 17 and had been powerlifting for two years, my total was a few pounds higher than the *female world record* in the closest weightclass regardless of age",
            "As a (m28) I didn't realize until a few years ago how much stronger I am than most women. I mean working in the food industry I would always do the heavy lifting and didn't think anything of it. It wasn't until I lived with my SO that I realized my strength. I'd close the water bottle lid normally for me and they could never open it. Hey unikorn can you move this object for me it's really heavy. Go to move it mentally prepared for a challenge and it super easy. Just watching them struggle lifting heavy suitcases and asking for my help. My SO wasn't out of shape or anything. They worked out regularly.",
            "Yes. Men are, on average, substantially stronger than women. Men’s strongest will always be stronger than women’s strongest and men’s median will always be stronger than women’s median.",
            "I grew up wrestling with my brothers. Gave me an inflated sense of my own strength. The first time I got into a fight with a dude who wasn't my brother, I was SHOCKED by how much stronger than me he was. I was a black belt (but taekwondo, which doesn't really count) and he was just pissed. He fucking wiped the floor with me, literally.\n\nSince then, I've been beaten up by multiple men. I've learned that unless I get the opportunity to knee him in the balls and run away right at the start of the fight, I don't stand a chance. Which is why I don't play-fight with my husband any more (it's bad manners to knee your husband in the balls).\n\nIncidentally the last time I wrestled with my husband I was pregnant, and the nurse at my routine appointment thought I was in an abusive marriage because my arms were covered with bruises simply from me trying to wriggle out of my husband's grip.\n\nTL;DR - most men are stronger than most women so knee them in the balls and run like the wind",
            "This thread makes me feel so helpless and scared. I’ve always struggled with feeling unsafe even around men I know well. I’m just so aware of how badly they could hurt me if I do something wrong.",
            "[removed]",
            "Wow this comment section is making me feel hopeless … I should buy a Doberman",
            "[deleted]",
            "I'm a woman and yes men are much stronger than woman in general. It is why you hear stories of women being afraid in public or going outside on their own after dark. It sucks. It isn't how anyone should have to live, but yes it is true. I've never had a male partner that I could even half way hold up to when it comes to physical strength.",
            "I've never met a women in my life that was nearly as strong as me. I have met some that are strong enough for most reasonable tasks though.\n\nBut even like picking up and carrying an 80 pound bag of sakrete is something that is basically impossible for most women, and I can carry 2 any day of the week before I've had my coffee (I'm 175 pounds). That's why they always ask for help moving or carrying stuff.",
            "The US women’s national soccer team, by most accounts the best team in the world has on multiple occasions been beaten in training matches by men’s U16 teams. FC Dallas U16 I believe",
            "I've been a tattoo artist for 13 years and I can unequivocally say that women have a much higher pain tolerance .",
            "Yes. Testosterone is a hell of a chemical.",
            "I do jiujitsu and roll (compete) against both men and women.  When I compete against men I use my strength without holding back.  When I compete against women I have to actively use no muscle at all and it still feels like folding clothes.",
            "So imagine you have a person. She's normal. Her constitution is adapted all around growing a whole other human body. Her hips, the way she collects fat, even the way her brain works. Everything about her is a super-optimized bridge between connecting the basics of living like a human- intelligence, endurance, longevity, acute senses, traveling long distances, et c. to the problem of having the most advanced babies possible. That's a woman.\n\nNow imagine you take that person and free up 99% of that adaptation and commit it just to being physically robust.\n\nYou think of what millions of years of sexual dimorphism have done to that difference- they have literally different chromosomes.\n\nIt is a profound difference.",
            "I read a personal experience story about somebody transitioning to female using hormones and that was one of the things they chose to highlight: how much physically weaker they felt and were",
            "like all things theres a bell curve but yes men overall are a *lot* stronger than women",
            "As a programmer, I'm not sure. Male and female programmers have 0 levels in strength. Lulz",
            "Yup. And it sucks. I hate it here. \n\nDefinitely at a disadvantage. .",
            "There were a couple of mitigating factors, but when an u15 side beat the Aus National Womens soccer team 7-0, the disparity in strength/speed was pretty obvious.\n\nhttps://www.dailymail.co.uk/sport/football/article-3609949/Matildas-lose-7-0-Newcastle-Jets-15s-Rio-Olympics-warm-up.html",
            "When I was 22 and working in retail, a 30 year-old coworker of mine grabbed me without permission in the most terrifying “embrace” I’ve ever experienced. I was pushing with all my strength to get his arms off of me, but he just laughed at how weak I was. I’d never been more afraid of a man than in that moment. When he finally let me go, I cried and asked if I could go home early. My manager said I still had three hours left on my shift and didn’t want to hear about how we were “horsing around”.",
            "Man how do so many of yall not know this, yes and the difference is big. That's why women are generally very cautious and even afraid of men. They can easily overpower you one on one, so the only thing you can do is stay vigilant or get a weapon. It's why women smile or \"play nice\" to guys who are awful (for example harassing them). If they get mad and decide to get physical, how tf are you supposed to handle them? Shit is laughably unfair. Men who make fun of women for being \"\"paranoid\"\" about their safety will never know what it's like to have half the population posses the ability to easily restrain you with their bare hands. Note that I said \"posses the ability to do so\" (since just this thought/possibility is unnerving by itself). Ib4 the barage of \"not all men blah blah\" . Men would behave in the manner most women do if placed in our shoes.",
            "Women CAN be strong\nMen CAN be weak.\n\nWith that out of the way, the average healthy male is MUCH larger, faster and stronger than the average healthy female. It's not a bad thing, or a good thing. It's just a thing",
            "Grip strength is a good indicator of overall strength.\n\nFor an average man, it's about 73 lbs, and for a woman it's about 44 lbs.\n\nSo, most men have about double the strength of most women.",
            "Yes, men are naturally stronger than women, a lot stronger",
            "I remember reading a statistic somewhere that essentially suggested that 90% of men are stronger than *all* women, and that the strongest 10% of women are only about as strong as the weakest 10% of men.",
            "Honestly, this is why they say you shouldn’t hit women. Not because you aren’t entitled to defend yourself, not because of some outdated gender notions, but because men can just do so much more damage to a woman physically than a woman could do to a man.\n\nHere’s my example: a road rage incident turned into a physical confrontation. I’m not sure if she was drunk or just irrationally angry but she threw a beer bottle at me (that was in her vehicle???) and I pulled my phone out to record. She slapped the phone out of my hand and I saw red. I put a hand on each of her shoulders and *pushed*. Not really even that hard I thought. Probably the force you would use launching a basketball while trying to make a three-pointer. She *flew* and fell flat on her ass. And that was the end of the fight. Whereas before she had been full of piss and vinegar, shouting and hollering, all the fight went out of her completely. She walked, head down and silent, right back to her vehicle and drove away.\n\nThat was the moment I realized men are *so* much stronger than women. Obviously I’m not saying I have anything on a deadlifter. But any average man is going to be leagues above the strength of any average woman. It’s not sexism, it’s testosterone. It’s crazy what an effect is has on muscle development.",
            "Imagine you as a man walking around and half of all people you meet are NFL-level athletes. That's how it is and it must be scary.\n\nAnd it's just not strenght, it's athletism as a whole, remember 14 year old soccer players destroy professional adult female soccer players.\n\nWhy it's this way I don't know. In some species females are the bad bitches and males are cute little puppies",
            "I think the usual answer is you can always find some woman stronger than some man, but on the whole/average, men are stronger. Pretty obvious when you look at competitive sports. It’s biology.",
            "My wife works out and has 20 lbs on me.  When we goof around I am always surprised at how litte strength I have to use against her.  I think a lot of women do not understand the huge strength and athleticism difference between men and women.",
            "Whenever I hear this question I like to think of what it would be like if men lived in a world were the opposite sex were 7 ft tall 400 lbs ogres who cat called and harassed them on the streets.",
            "Yes, I am a short man 5.6’5/5’7 and whilst I’m pretty muscular (200lb) I’m conscious that most people will view me as weak because of my height. I’m fairly non-confrontational due to this, but have been in many fights with men growing up.\n\nWeirdly, i have been the victim of one attempted mugging and the assailant was a 6’2 burly women lol, she stepped out of the alley I was walking through and swung for me and connected. I’ve been punched by men of similar statue before and it would at least rock me, if they had any weight behind them it would hurt like a motherfucker  and in this situation where I was unprepared, potentially just KO me. But I honestly barely felt it, to the point where I just laughed in surprise. The women stopped and stared at me and I looked at her and it was honestly the weirdest interaction of my life. I don’t know if it was the first time she had ever tried to mug someone and saw a short guy and thought it would be easy pickings or something but neither of us said a word after looking at each other for what felt like ages after the failed attempt at knocking me out. She just ran off and I walked away. It was bizzare, but I realised that even a ridiculously big women is much weaker than me.",
            "In context. The Serena sisters thought they could take on top ranked men. So the 198th player at the time challenged them on tht bet. He showed up drunk and pissed about. Destroyed them with ease due to sheer power difference. Serena was a beast bigger and more athletic than most men. But that didn't make a difference as men just has more muscle mass due to sexual dimorphism.",
            "When I was at the military I was serving alongside women. In the physical tests, which involved running and push ups, not only there was an insane gap in the demand (5 pushups for girls vs 30 for guys etc.) I, who have never trained a day on my life have easily outperformed girls who were professional athletes and ran in competitions after just three months of training (same training, btw). So yes, the gap is so big it's unbelievable",
            "So I don't want to make out like I was roy Jones Jr or anything, but before I transitioned I worked in a steel warehouse moving 500 pound bars 10 hours a day and I could handle myself. Well.\n\nAbout a year into estrogen and testosterone blockers (along with an office job), thinking that nothing had changed *that* much, I got into a fight at a bar. I was a little bit bigger than his guy and he didn't even know how to throw a punch, he just kind of swung his knuckles at me like he thought arms were a baseball bat or something\n\nAnd he *kicked the shit* out of me. There was literally nothing I could do. I was holed up in bed for 3 days afterward.\n\nI know people insist on believing that trans women have man strength, but I'm telling you firsthand that all of my muscles just melted away. I have the same strength level as any other woman with my size, build, and exercise habits\n\nAnd the difference between those two strength levels is terrifying",
            "Long time athlete and power lifter. The answer is yes. I know a female at my last gym. She was noticeably jacked. Hard core power lifter. Watched her hit a PR of 315. Knowing 315 isn’t exactly easy for females I congratulated her thoroughly. The first time I ever deadlifted I deadlifted 315 for multiple reps.\n\nThere are some strong fucking females out there though. Females who can out lift my PR (580 lb deadlift for me). But they’re extremely rare.\n\nSo again, yes. The short answer is men are indeed on average remarkably stronger than women.",
            "As a transgender woman… YES. Testosterone is a helluva drug. I’m not a particularly strong person but I could 100% feel the difference in since I started taking hormones a decade ago. \n\nEven the smallest of guys could easily beat me up. Men have significantly more strength; I’ve been in situations where this has been eerily apparent. \n\nThis is why “doping” and steroids are such a big deal in sports. Androgens have a direct link to muscle production, there’s some great periodicals about this if you want to read more in depth.",
            "The average guy is not stronger than the strongest woman, but is definetly stronger than the average woman. But if you pick the strongest guy and strongest woman and have them both fight to death, the woman is gonna be destroyed."
        ]
    },
    {
        "post_id": "u2r0y1",
        "author": "Ultomatoe",
        "title": "Is Russia truly doing such a poor job in the invasion of Ukraine or are we just being fed propaganda?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/u2r0y1/is_russia_truly_doing_such_a_poor_job_in_the/",
        "score": 40096,
        "num_comments": 4918,
        "created_utc": 1649858528.0,
        "selftext": "Propaganda is certainly in full swing on both sides but the narrative, from a western perspective, is that Russia has royally screwed the pooch during this invasion. If we are to believe what is being spoken it seems like they are just throwing meat and materials into the grinder in Ukraine and getting obliterated. Are the Russians truly taking such monumental losses and is their economy soon to be as fucked as people claim?",
        "permalink": "/r/NoStupidQuestions/comments/u2r0y1/is_russia_truly_doing_such_a_poor_job_in_the/",
        "comments": [
            "I think it is because they were believed to have a dominant military, and they are struggling compared to what the world's expectations were.",
            "There's an element of the fact that the west is generally on Ukraine's side, and that we're therefore seeing a Ukraine-centric perspective\n\nBut at the same time, the maps don't lie: Russia was expected to roll Ukraine over in a matter of days or weeks, yet is now 7 weeks into the war and have clearly not steamrolled Ukraine or even achieved their likely/apparent goals\n\nThere's no way around the fact that Russia clearly (despite their new \"You didn't dump me, I dumped you, I didn't even want to date you in the first place\" narrative) wanted to take Kyiv and enforce regime change. And not only did they not achieve that in the first few days as they clearly expected, and not only have they not achieved it at all... but they've even retreated away from the area and given up on the objective entirely. There's no way to realistically paint that as anything other than an abjact failure\n\nEven if this had been a near-peer conflict (a war between two sides expected to be of roughly equal strength) then the attacker would expected to achieve some major objectives, otherwise why are they attacking at all? But Russia was one of the most feared militaries on the planet and Ukraine barely even a blip on the regional map, and Ukraine fought them to a standstill well short of Russia's objectives.\n\nThat's not to say Russia can't get anything out of this war or will have entirely failed - but thus far they've tanked their economy and killed 5-10k of their own men, shattered their military reputation on the world stage, united NATO and the EU, started Germany on a re-militarization path, pushed Finland and Sweden into NATO's hands, and is still nowhere near to even achieving their \"fallback\" goals of taking the entirety of Donbas.\n\nIt's possible that Russia could have a successful offensive in the east and take the rest of Donbas and secure Mariupol (which looks inevitable), on top of the canal supplying Crimea's water which has already been captured. You could consider that Russia has, at that point, achieved enough objectives to be worth the invasion - but the cost for that has been huge and it's hard to argue that it's been worthwhile\n\nThe only thing Russia has *really* achieved is to secure the Crimean water supply, and to ensure Ukraine doesn't join NATO... but that was already off the table since 2014, all Russia had to do was continue quietly supporting the existing war in Donbas and Ukraine was going to stay out of NATO anyway",
            "While I have no way to know for sure I’d imagine the truth is somewhere in between. Both sides are trying to exaggerate the others losses. \n\nWhat is kind of indisputable is that the invasion has not gone well for the Russians.   They made a very obvious drive to capture Kiev immediately and failed to do so.    Given the size and armament disparity between the two countries, that’s a pretty stunning defeat. It’s far from over though as Russia still has all of the advantages, even if momentum is not on their side currently.",
            "Good question.  Here's my understanding so far:\n\nRussia has a logistics issue.  They have a lot of tanks and mechanized vehicles but they can't get the supplies to them.  Reason is they rely heavily on their rail network which the closest one, in the beginning of the war, was in Belarus at the border of Ukraine.  A few weeks ago, the Ukrainians and some Belarus defectors blew up the rail line at the Russian border which caused the Russian supply lines to fall back even further.\n\nRussia was prepared for a 7ish day war.  Steam roll in there, knock out the capital and retake the country.  That didn't happen due to fierce resistance and now they're facing that supply chain issue which continually gets worse the longer this goes on.\n\nThe whole thing is very interesting in that Russia believes NATO to be an aggressor and an enemy.  Russia wants a buffer zone between themselves and NATO.  Geographically, the border of Ukraine and Russia is sparse farmland with no natural barriers.  If Russia were to push it's borders further west, then they have geographic barriers like mountains.  Strategically, this makes sense to give them a buffer against, what they perceive, is a NATO invasion.\n\nCrimea was taken in 2014.  Crimea has a lot of oil reserves off the coast.  This was also a foothold into Ukraine.  The one thing that Crimea doesn't have is a lot of fresh water.  They have one river that runs thru Ukraine and thru the area which Ukraine dammed off in their territory.  This caused Russia to have to import water for 2.1M people during a time where record breaking heatwaves were occurring.  Logistically, this was a nightmare for Russia as they had to build infrastructure (Bridges) and use trucks to get fresh water into Crimea and continue their oil exploitation.\n\nThere are vast oil reserves off the coast of Ukraine and Crimea.  If Russia can just capture the coastal areas and unblock the dam then they can land-lock Ukraine and cause economic and supply chain issues into Ukraine.  This would force the Ukraine to the bargaining table and possibly force them under the Russian umbrella.\n\nIf you look closely at the [battle map](https://www.bbc.com/news/world-europe-60506682) and whats going on, you can see where Russia has pushed themselves along the coast lines to make the above possible.  I don't know specifically where the Dam in the Ukraine is located, but at one point during the beginning Russia had done a spearhead attack directly up that river.\n\nSo, it's a \"Win\" for Russia if they can unblock that dam and if they can capture the coast.  It's a bigger \"Win\" for Russia if they take the entire country.  The longer this drags on though, the worse it's going to get.\n\nThe West has evolved in Warfare (Debatable, but hear me out).  We don't carpet bomb cities anymore.  We don't indiscriminately gas civilian population centers.  Russia doesn't care about this and will carpet bomb as they see fit.  The longer this goes on the more of a chance to see Gas attacks on civilians and who knows what's next after that.\n\nBack on point, to answer your question:  Yes, propaganda on both sides.  However, the battle map is really what to keep an eye on with those points above in mind.  The atrocities are horrible and I hope this will end soon.  If Putin can get those above goals, he will most likely call it quits even if he doesn't take the country itself.",
            "Everyone expected Russia to conquer Ukraine in like a week. Everyone both underestimated the Ukrainians and overestimated the Russians. Their performance has been a shit show. The fact that Putin does not control the country and is in fact pulling back and focusing specifically on the east is proof enough that things are going badly.",
            "You don't fire 150 FSB personnel because things are going well. \n\nYou don't abandon Kiev and the western 90% of the country because things are going well.",
            "Problem is when we think of Russia we used to think of it in terms of USSR and Warsaw Pact.\n\nThey are no longer that powerful.\n\nRussia GDP is HALF the GDP of California.\n\n11th in the world by GDP with 1.95% of world GDP (by comparison USA is 24% and China 15%), and 65th in GDP per capita.\n\nRussia isn't a superpower anymore, it's only relevant because its inherited nuclear arsenal.",
            "It seems like Russia is having an issue of occupying Ukraine. But they seem to be destroying the country just fine. It is hard to keep an army in a country, isn't hard to drop bomb after bomb and flatten it. Seems like they will do what they did in 2014, occupy a very small part close to their border where they dont have to spread themselves thin and keep and overarching threat of another full invasion to keep Ukraine from joining NATO.",
            "Having worked off and on with Russia, Ukraine, and a few other FSU states over the last 30 years, as well as being a little bit of a history buff, Russia has a history of using a meat grinder approach to war.  They always have.  Most of the soldiers in Russia's military are 19 and 20 year old kids who don't wanna be there and many are minorities (there are over 100 different ethnic groups in Russia).  The Ukrainians and Russians have intermarried for a thousand years.  So many of them are family.  The story of the common Russian person over the centuries is one of struggle, oppression, and abuse.  Putin is following the same path as the Soviet Leaders before him and the Czars as well.  The Russian \"peasants\" are expendable.  Is there propaganda on both sides?  To varying degrees, of course.  However, despots like Putin and the ilk before him take propaganda to an entirely different level.",
            "Plug for Beau of the Fifth Column on YouTube. I find his analysis and research to be balanced and carry a better understanding of nuance and the situation in Ukraine.  Incidentally, he is also of the opinion that Russia is doing poorly and miscalculated big time. Even when balancing the exaggerated reports from both sides",
            "Both. Russia’s invasion has been a shitshow *and* there’s a lot of propaganda around. Some of it just happens to be accurate.",
            "While we are certainly being fed propaganda, the fact that Russia has yet to make significant headway at taking Kyiv despite all their (supposed) military advantages definitely indicates at some level of failings.",
            "Without going down into the strategic level, because remember, we are not military experts, no one on reddit is (except for a minority), we are being PUMPED with wartime propaganda. Every nation has a vested interest in either Ukraine or Russia. I just wonder why wars like the Azerie Armenian war wasn't hardly covered at all, or Yemen, or The Congo, etc.",
            "That’s a good question. With Russia being in the top 3 militaries in the world, it’s kind of weird they are having a hard time.",
            "I have absolutely nowhere near enough familiarity with this situation to give you an answer. I just want to say OP, this is absolutely a great question to ask and something I've been wondering. Thank you for asking and thanks to the rest for answering!",
            "It’s one of those impossible missions like Afghanistan. No good/clear objectives. If the job was to “kill all Ukrainians”, Russia clearly has more firepower and could do it. They have enough tanks and bombs to flatten everything. \n\nInstead their job is to liberate a country that does not want or need to be liberated. What exactly can a tank do accomplish this mission?",
            "Oh, it's a proper propaganda stew. From all sides. There's so much BS that hip waders are a waste of time.",
            "\"Poor job\" is a relative term. Russia is doing a good job in that Ukraine is suffering terribly and sadly stands a good chance and losing the war eventually. Russia is doing a poor job in the sense given their military dominance, they should have been able to win far faster and far more decisively than their current rate of progression.",
            "Both. I'll read something about Russians being pushed farther from Kyiv one day, then some actor/politician dies in a certain city, so I look it up and it's a city just outside Kyiv",
            "I think the fact that it's still going is a sign that it's not going well for Russia. They thought it would be over in a few days",
            "It is important to look at the experience Russia has built in Syria. If you look closely they use a lot of the same tactics as they did in Aleppo. It's the same guy in charge so that's no wonder. The 'humanitairian corridors', destroying homes and infrastructure and waging war on the population. 'Assad or everything burns' was the slogan there. Ukraine is being destroyed as well right now. In Syria Russia kept Assad in charge and deported most of the opposition into Idlib, partly through the humanitarian corridors. If the land is mostly empty and the people have been subjected by terror and lack of basic needs it is free for the taking. However, Ukraine is no Syria; it does not have a population that is so divided, no army that fell apart into militia and an economy that will probably hold for a while. Also the international community is more inclined to help Ukraine than they were to help the opposition in Syria. My guess based on 5 years of working with refugees and seeing war every day? They threw a hail mary trying to get the whole of Ukraine but it was never the main goal. The main goal were just 2 territories, the war is used to spread terror and to deport/kill most of the population in those areas. Then take them and have Ukraine so happy the terror of war is over so Russia can keep those lands.",
            "It’s more of a contradiction of existing propaganda, with movies and TV and the news we have been led to fear Russia as a true rival power militarily instead of taking an actually accurate view based in their capability and performance. That said Russia is underperforming not only for our expectations but also for what they should be capable of. It’s primarily a logistics failure with supply and comms but using conscripts and the general lack of Russian training is showing. It’ll be interesting to see if they learn from their errors and perform better now that they’ve reoriented towards only east Ukraine",
            "You can use some facts to figure this out for yourself to be honest. Let's say every single video post or article since the invasion started is western propaganda. \n\nSo let's turn to the following:\n- Russia GDP 1.48 trillion USD\n- Ukraine GDP 0.15 trillion USD\n- Russia army size 1 million personel wit 2 million in reserve\n- Ukraine army size 0.2 million personel with 0.2 million in reserve\n- Russia outnumbers Ukraine in terms of military equipment by far.\n- Russia has nukes\n- Russia is a covert dictatorship. We know this because Mr Putin changed the constitution so he can serve more than two terms \n\nAnd yet, dispute all of these known facts, they have been unable to conquer Ukraine by now. How is that even possible given the massively superior armed forces? \n\nAnd this is just stats... Then if you look at history you can see that Russia has no problem with commuting crimes against humanity. Is it that hard to believe they're doing it again? China is doing it all day long but we're choosing to ignore that since they are not bothering any western country yet. So is north Korea for that matter but do we care? Nope. \n\nStarting wars in Europe has always caused massive global issues, nobody wants that, so the responses to it is in kind.",
            "I for one am glad Russia failed so badly. Maybe it'll teach Putin to not try something like that again.\n\nReal salute to the hardy Ukraine military and people. And people that traveled there to fight. Very admirable willpower and courage",
            "Ray Dalio has a very good take on this  ---> https://www.linkedin.com/pulse/how-can-we-tell-first-battle-long-war-control-world-order-ray-dalio/\n\nyou should see Ray Dalio and his video on the Rise and Fall of Empires\n\nThis invasion is a test by new powers to see what the Empire (American Empire) will do\n\nyou can look at it through lots of different lenses\n\nHowever, at the very crux of it\n\nThe Old Empire decided to not intervene militarily, and to try sanctions\n\nLook at Ray Dalio's post -> https://www.linkedin.com/pulse/how-can-we-tell-first-battle-long-war-control-world-order-ray-dalio/\n\nMy reading of the situation is that US just told China, India, Russia, Brazil\n\nwe will wield US dollar as a weapon and attack economically\n\nwe are not strong enough any more to intervene militarily i.e. not willing to invest into wars all over the world (and in a way it is true as declining empires cannot keep supporting military bases and wars all over the world)\n\n******************\n\nso now we will see two things\n\nA) move by BRICS and some Oil countries to a new world currency. Over time period of 5 to 20 years\n\nB) More testing by China and Russia and even smaller countries of US' willingness to intervene militarily\n\n********************\n\nIf US is your main 'protection' they just signalled that they will let you get invaded and screwed and will just do some economic sanctions\n\nThis in the long term will make a lot of countries shift more towards China",
            "I'm Russian myself, and I'd say that yes, they did a terrible job. Even our TV propaganda (which supports the war) admits that Russia failed\n\n Plus, according to the stats, around 40% of all the soldiers refuse to go to the war.",
            "I've been wondering this myself. I also wonder even if they're doing a bad job does it matter. They have the men to just keep going until they win no matter what it costs them.",
            "According to my russian friend, yes russia sucks.",
            "So the world expected Russia to steam roll Ukraine. Like first invasion to government captured or in exile inside 2 weeks, then it would just be another instance of Russia dealing with guerilla fighters and \"terrorists\". \n\nThe reason this didn't happen was, rampant corruption. Oligarchs were paid to supply and maintain 1000 fuel trucks with viable fresh fuel and reported that they were ready. When actually it was 700 fuel trucks with old fuel and only 30% full for any of them (this is just an example of the types of things that went on not a real example that I know good sources on). \n\nThings like this happened all over the Russian military. Men were supposed to go through training and were handed to their fellow soldiers to learn by doing. Well if you have an entire squad of new people, who is the old hand to train them? They did not even have the bullets to train them with. If you used ammo you were expected to buy your own replacement. \n\nSo the rich fed on the Russian military and it wasn't till Ukraine that it became apparent. Eventually they realized that they couldn't just push real hard and get the same effect and the Russian forces had to stop and reorganize. I am sure now they are taking full inventories, putting old hand infantry with squads of guys who have no training and a thousand other little things that should have been maintained along the way. \n\nWhat's going to happen from here? Who knows. Maybe Russia will get its shit together, maybe they will find a politically viable way to slowly back off. Maybe they will Nuke Ukraine and events get out of hand and we all go together when we go. Only time will tell.",
            "Ukraine is using propaganda, but all governments at war use propaganda of some form. I think Ukraine’s propaganda has generally been helpful to their cause. Western media is not propaganda free, but even high quality, independent Western journalists have reported that Russia’s war has been largely a failure to this point. It’s indisputable that the retreat from Kyiv represents a major failure for Russia. If you follow high quality unbiased Western reporting on the war, you’ll get good information. It’s good to follow Ukrainian reporting as well, they are closest to the war and reports come out more quickly, but take it with a grain of salt. What Ukrainian officials and journalists say is often meant to help morale at home and rally international support (which is not at all a criticism).",
            "This is the kind of healthy scepticism that we all need in disinformation land.",
            "The Russian economy is absolutely fucked. That part is, if anything, understated by many who can't see past a Google exchange rate.\n\nAs to the war effort: Russia has done terribly for the weight they have to throw around, *however* they have a lot of weight to throw around. People are right to laugh at the Russian war effort to the extent that if you ran the simulation 100 times, none of the results should be as poor as it's been. That said, Russia has a lot of resources to lose, human and equipment, and can still \"win\" a war by raw overwhelming numbers - a strategy that has consistently worked through Russian history. \n\nThat said, Ukraine is the defending army and modern warfare is defined by asymmetry. If anything the most unconventional aspect to this war is how conventional it has been: wars aren't really fought like this has been fought anymore (and such fact is arguably a point to obsolete doctrines in the Russian army). Even if Russia does win, if only because of occupation and agreed ceasefire, any projection of long term war prospects that doesn't account for insurgency, NGOs and the new modern convention of asymmetrical warfare should be dismissed as ignorance.",
            "To put it simply, we have photographic evidence of how russia is faring thus far in the war, that much is indisputable. Unless of course someone is convinced these too are fake, but those kind of people will not accept any evidence unless they were personally placed in a combat zone and saw it with their own eyes.\n\nAs for the propaganda, absolutely we are being fed propaganda, the only reliable sources have been small groups like Oryx that only document incidents on visual identifiers through experts. Everything media covers will have a tiny trickle of truth between gallons of exaggeration or misinformation (not always intentional, but sometimes will be)\n\nBeing Skeptical is the safest bet, and referencing information gathered since the collapse of the Soviet Union has shown that modern russia is not the soviet bear they once were, and unfortunately for them they have not caught up with how warfare has changed.\n\nIt's so incredibly brutal and depressing for all sides involved. I feel for the average russian that doesn't want this war and my heart goes out to the innocent Ukrainians that have lost their homes and lives to what is quite literally just a failing powerplay by one of the last major dictatorships of a bygone era.",
            "This can only be assessed in perspective. Right now, there is no way of knowing what Russia's expectations were, or what objectives they have. We may be being fed pure propaganda, or we may be getting the absolute truth. We will find out in some years, reality will most likely fit in the middle of the options, with a varying truth to propaganda ratio.",
            "Seeing all those burned out rusted tanks and APCs is pretty convincing.",
            "Yeah it's propaganda Russia said it would take Kiyv in two days and it's been 50\n\nWhat?",
            "I have a biased opinion as I have adopted 2 kids from Ukraine and am helping a few refugees to get to the USA.   \n\nIMO what Russia is doing is taking over a small town, killing the parents, and removing the children to Russian so they become Russian and then retreating.  They will keep doing this over and over.\n\nTheir propaganda, even if they retreat, shows they won because they are removing children from \"Nazi's\" and getting the children to Russian homes.   The people in Russia are shown loving families adopting the children from the area of the special military operation.",
            "Its propoganda.",
            "I like looking at Al Jazeera. They are usually pretty unbiased on all news outside of Qatar.",
            "Old thread, thousands of comments, but I will still point something out I haven't read. People think of propaganda as made up. But that's not what propaganda (usually) is. Propaganda is about promoting a particular thought or feeling about the world or particular events. The best propaganda is the propaganda that doesn't have to stretch reality or manufacture events to fulfill its goal.\n\nSo, a journalist's report can be factual *and* propaganda at the same time. This is why the US army is so happy to help Hollywood films and in general (other than classified material) is happy to let documenters in.\n\nThe second best kind of propaganda is taking some event and explaining it or presenting it with a spin towards the propaganda's goal. This is the kind that is hard to discern.\n\nThe worst kind of propaganda is having to misrepresent something that happened on the basis of technicalities or straight up lie, in order to keep up an image. On this range there are plenty of strategies that can be best represented by the latest strategies used by Russia and in the long string of anti-democratic governments proliferating in the world today.\n\nHere's the kicker. For the opposite side or neutral parties, the last kind of propaganda might seem obvious. But for the person used to exist on either the first or second type of propaganda, the third is seamless. For the propaganda operator, distrusts in all sources of truth is a victory on itself. If you don't trust anyone, you can't go against the hegemonic truth.",
            "Maybe not the best idea to try and get an unibased opinion from the pretty much the epicenter of the propaganda which is reddit. \n\nWhy do you think that the top comments in here will have a different narrative as opposed to the frotn page or any other mainstream subreddit.\n\nThis is a website for woke western nationalists to circlejerk with each other and participate in pro western disinformation campaigns. I couldnt think of a worse place to ask.",
            "Putin may be an asshole - though to what degree is heavily debatable because opinions of him are absolutely influenced by propaganda - but he’s very intelligent. There’s multiple things to consider:\n\n1. As others have pointed out, Russia is treated as if the USSR still exists. The White House and media outlets talk about Russia as this massive evil entity but seldom gives examples.\n\n2. When there are examples given, they’re framed poorly to make the US look good and Russia look bad. The US stands firm that Russia, under direction of the Kremlin, ran a massive big brain campaign to influence the election. The reality is cybersecurity in the US is piss poor, the majority of Americans can’t think critically for themselves, and social media deserves a lot more blame than it gets for contributing to the rise in major societal issues.\n\n3. Russia was formed from the USSR. With exception, countries who left were free from becoming Russia. It wasn’t Russia who determined Ukraine was no longer part of the USSR and thus the reformed Russia, it was Ukraine and their allies. There’s hypocrisy in the fact when Texas “joked” about seceding, the response was “even if every state and American citizen agreed, it won’t happen because the constitution disallows it.” In other words, the US believes not a single inch of US territory can EVER, no matter who says what, leave the control of the US, full stop; BUT the US believes it has the authority to say a country that wanted to secede had every right to do so and Russia is evil for trying to stop it.\n\n4. Again, Putin is not an idiot, and he’s allegedly mentioned playing 4D chess by “invading Ukraine.” It’s not off the table that Russia is putting on a show to demonstrate the instability of foreign governments. Even if that’s not the case, it’s happening as Biden’s handling of the situation has been lukewarm at best, a national entstandenen at worst. \n\nInstead of trying to come to any answers, the intelligent thing to do (of course, looking at the past many presidents, unlikely) is to maintain a big stick philosophy instead of trying to buddy up with Putin (which he clearly didn’t care about) or threaten him (which he also does not care about.) world leaders should be keeping quiet on the matter, send resources for Ukraine to defend themselves as reasonable under agreements, but largely shut the hell up.",
            "Goebbels said it- Feed the people so much bullshit that they can’t possibly decipher what is real. I think that’s the only answer we can know.",
            "Throwing meat at the problem is kinda their M.O.  Yes there is propaganda on both sides but if the Russians were half as good as they claimed then this should be over long ago.",
            "*asks on a site that's known for spreading propaganda",
            "Ukrainian here. I’m not a military expert so I can’t speak on the rest, but I do know that Russia receives almost a billion euros for gas and oil from the EU every day. The idea that sanctions are actually tanking the Russian economy is ridiculous in light of that. The only people who are affected by the sanctions are average people in Russia, but Putin has plenty of money for this war. The media isn’t talking about that enough because it would probably outrage people. It certainly outrages me.",
            "Russia failed the “blitzkrieg” phase so now they are doing the usual soviet shit: plundering and destroying cities and infrastructure, while kidnapping children and killing local population. It’s a war of attrition for them now. Slow, sloppy, inhumane. Yup, Soviet ways never die.",
            "Ukraine is getting destroyed and western media has lied to us about it. Everyone thinks Russia was trying to take Kyiv, but in reality it was a feint. A feint that will be studied for years at western war colleges. The Russians were able to convince not just Ukraine, but the entire world that they were stupid enough to try to take the capital with some paratroopers. What this did was prevent reinforcements from going to the east (which is where most of the real fighting has been). Right now, the Russians have basically surrounded the Ukrainian army that was in the east (which btw was about to invade the Donbas and end the civil war thats been going on there for the last 8 years). Russia beat Ukraine to the punch and invaded first.\n\nThey've also pushed west along the coast and are threatening Odessa. However, the Russians aren't necessarily about conquering big cities right now. They had to in Mariopol because they was a large Ukrainian force there of about 14k. Those troops have been pretty much destroyed at this point.\n\nAs well, the Russians have destroyed almost all the Ukrainian tanks and armored vehicles. As well, they've destroyed most of the fuel depots, so even the tanks that are still there, they can't go anywhere. Once the Army in the east (which is believed to have been around 60k, though some have estimated upto 100k) is destroyed, it will be game over. The Russian army will start to move west and begin to take real territory once that happens and it may result in the complete collapse of Ukraine, like happened to France in the beginning of WW2.\n\nWhat us in the west aren't understanding is that the Russians are fighting an old school manuever war. They aren't worried about taking cities, they are about taking out the armies. If the armies are destroyed, the will to fight of the populace and the leaders will collapse. Our media has no idea what is really happening in Ukraine (or worse they do and are lying to us about it).",
            "Kinda odd I never hear about Ukrainian military deaths, only Russian.",
            "Propaganda 100%",
            "In 2014, Russia rolled over the Ukrainian defenses in the Donbas and Crimea with basically no meaningful resistance. Ukraine has spent the intervening time getting their military squared away. When Russia sauntered in expecting a repeat of 2014, they got their asses handed to them. \n\nTo give you an idea of how badly Russia misjudged the situation: their paratroopers landed with dress uniforms for a parade. This salient went so badly for them that they had to abandon their thrust towards Kyiv. Russia’s been losing so many men and so much war materiel that they’ve called up 60,000 reservists. \n\nThis is not what a Russian victory looks like. This is *bad* for them. The Ukrainian propaganda is certainly in full swing, but this war has been a string of disasters and miscalculations for Moscow. This is a country that wants to oppose the West getting its ass handed to it by a regional power. \n\nThe balance of power still favors Russia, simply because of the assets they can bring to bear, but this invasion has been a debacle on par with the first Italian invasion of Ethiopia."
        ]
    },
    {
        "post_id": "ymecm2",
        "author": "ThunderGunFour",
        "title": "Am I allowed to cut the chip off of my credit card and attach it inside of a magicians wand so I can tap it to magically complete purchases?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ymecm2/am_i_allowed_to_cut_the_chip_off_of_my_credit/",
        "score": 40088,
        "num_comments": 2078,
        "created_utc": 1667605860.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/ymecm2/am_i_allowed_to_cut_the_chip_off_of_my_credit/",
        "comments": [
            "Be aware that the antenna on cards is usually extremely fragile when not protected by a slab of plastic.\n\nI did this with a transit card twice (reshaping the antenna so that it would slide into a glove), and neither attempt survived more than a day",
            "Unfortunately, the antenna for the 'tap' functionality is actually not just the chip but multiple lines of wire around the edge of your card. So, legally, I have no idea, functionally, it wouldn't work.",
            "If you use [acetone to dissolve the card](https://www.instructables.com/Transform-your-Oyster-travelcard-with-sugru/) you might be able to extract the antenna successfully.",
            "It’s not illegal but prepare for idiots to call the police on you. Someone extracted the nfc chip from their train card here in the UK and stuck it inside a Dr Who Sonic Screwdriver toy. Someone witnessed him tap it at the turnstiles while pressing the button to make it light up and make the noise, and phoned the police on him for “hacking the system”.",
            "I’d go for the comedic magician that doesn’t carry a wand but rather an ornate fly swatter of magic.",
            "Please do this and post the video",
            "That would be a great \"tap to pay\" option. Until some guy puts the chip on a dildo so he can pretend to tap with his dick.",
            "[removed]",
            "the problem would be when they ask for the card to verify the name. the card would look suspect all ripped up like that.",
            "After looking through a few really, really basic articles (so basic that i'd go as far as to say that they don't even accomplish what they claim to, which is explain tap tech), I finally found this vid: [https://www.youtube.com/watch?v=T-IYgH3CjNQ](https://www.youtube.com/watch?v=T-IYgH3CjNQ)\n\nSuper useful, succinct, and informative. The gist is that you'd need to take the tiny cpu out of your card as well as the antenna, and put them into your wand. Because the antenna needs to cpu to actually transmit anything useful, and because the cpu needs the antenna to receive power and communicate info, both are required.",
            "I mean I don’t see why not, you’ll have to talk about it with whoever gave you the card just to be sure.",
            "This exists already   \nhttps://www.card-cutters.com/ollivander19-first-contactless-payment-wand/",
            "I hate that I am now obsessed with the prospect of this.. please post a video of you doing it.",
            "How high are you right now",
            "Why can't it be a cane with an ornate head that you can slide the card into?",
            "I don't know. But I was in a bad mood and this made me laugh a lot. \n\n(ty)",
            "Why don’t you gently warm and soften the card into a tube and make a wand with it. Leave the chip unpainted for better conductivity and Whah - LAH!",
            "Sure, or you can buy Ollivander19 for $99.99\n\nhttps://youtu.be/HmepDkRY-fo",
            "Don't cut the card, heat it and roll it up, this should leave the antenna intact.",
            "There is a company that cuts the chip off and glues it onto a metal replacement card, so I don't see why you couldn't",
            "Once",
            "Tried this already, though I attached chip to a special hat I made for my penis, it's not so much like a hat, more like a wrestler's mask- you know what it's kinda like a wrestler's mask and hat combo.  Anyways,  the chip sat atop of the hat, as if it were a diamond, it wishes.  I digress again, so I wont go into details, but trust me, dont try this, ever, and I couldn't get it to read the chip anywhere ;(",
            "I think this is a most excellent idea and I do hope you.will update with a picture of the product!!",
            "You are clinically adorable for even thinking of this.",
            "We had a [bio-hacker](https://www.abc.net.au/news/2018-03-16/opal-card-implant-man-pleads-guilty-transport-offences/9555608) in Sydney Australia do this with his \"prepaid public transport card\" a couple years ago, had the chip implanted in his hand, it worked but when inspectors asked to see his card they fined him for not being able to produce it when asked. \n\nApparently he had other chips implanted in him as well one being his bank card.",
            "I have no idea but I’m loving your vibe. I aspire to be like you",
            "The real solution is to make the wand big and grandiose enough to fit the whole card in",
            "if you can make a wand that has a wider section at the end, you could have a slot where u slide the whole card in and then use the wand the way you intended.",
            "Finally, a worthy question. Update us OP if you do this.",
            "I think you can instead do that with an NFC device or something connected to your phone that has the card stored in it, I don't know I am no magician",
            "No idea if it’s permitted or if it will work but the world would be a boring place without people like you!",
            "On a similar note, there was a great story from the Moscow underground. Some dude put his transit card inside his winter hat, walked to the turnstiles and loudly shouted \"Oh Lord I pray to thee, grant me a metro fare!\" (in Church Russian obviously), crossed himself and bowed towards the turnstile which promptly opened. Caused quite a sensation among the older folk 😂",
            "[deleted]",
            "So the technology that does the \"tap to pay\" is a technology called NFC (Near-Field-Communication).    This is a common technology phones have it, nintendo Miibo's use it, all kids of stuff.     \n\n\nSo what does this mean?    It means you can get a scanner (sometimes an app on your phone will do!)  And you can buy \"NFC TAGS\" (the \"chip\" as you call it)  and then you can scan, copy and paste the code onto as many NFC TAGS as you want.   Now make sure you keep track of them, but if you slipped an NFC TAG into a wand, and it was imprinted with the same NFC data as your debit/credit card, then you are golden! No card cutting/destruction neccessary!",
            "Are you “allowed”?  I mean, nobody’s stopping you, right?  I say cut that Amex up and give it a tap.",
            "I don’t know why but I’m crying laughing so hard right now at the randomness of this question. What a fun idea! Update us if it works!",
            "Ok...but why is this not an actual thing.",
            "This is one of the best posts I've ever read",
            "I suggest gluing it to your forehead so you can headbutt the device to complete transactions.",
            "That was the best idea I’ve ever heard 😂",
            "Great idea until the machine says tap isn't working please swipe the card or insert it..lol",
            "don't forget the sock 🤭",
            "I ponder the fact that I wasted my time reading all the comments. It would be nice if I could just tap a magic wand and get my 14 minutes back....",
            "I love you",
            "You're thinking small. Use one of those fake finger that slide onto yours and convince people you're Midas.",
            "[It has been done](https://youtu.be/HmepDkRY-fo)",
            "I don’t know where you’re located, but here in Australia some banks do card accessories, small chips that can go inside watches or other wearable things, maybe check banks around you and see if they have something like that?",
            "Isn’t this like cutting off the tag from a mattress?",
            "I'm pretty sure this is my favorite question I've ever seen on this sub.  I wish I had an award for you.",
            "I like the way you think, OP!\n\nBut remember the wand chooses you 🤭",
            "Holy shit this guy may be no to something",
            "It won't work because there's also an antenna in the card which you would cut through.",
            "It is not illegal, but it is extremely unlikely to work, and the retailer has every right to refuse payment from a mutilated card. In fact, they probably are required to refuse to accept payment by their payment processor agreement in order to help prevent fraud.",
            "On reading the answers saying you can't disassemble it, I wonder if you could warm the card then wrap it around your wand.",
            "Typically the terms and conditions of your bank account will state that the card is the property of the bank, so you're probably not *allowed* to modify it like that. That said, no one who works at the bank is going to care even slightly, and the only way they'd ever know is if you told them.\n\nOn a somewhat related note, I used to work on a banking customer service line and I once had a call from a man reporting his card had been refused at an ATM. When I checked the systems it showed an error code that would usually indicate a damaged card. Which was odd, as I could see the card had only been issued a month prior.\n\n\"No,\" said the man, \"that makes sense. I don't like contactless so whenever I get a new card I take a holepunch to where I think the antenna is.\"\n\nI told him that would do it, and I sent him a non-contactless card.",
            "The chip you see is not responsible for tap, it is infact another chip inside with a thin wire usually running along the edge of the card for a few loops",
            "Not all of those chip cards work with tap (card needs the tap symbol).\n\nSouce: Me at the checkout",
            "I have a men’s black ring from Visa that I could pay with. Used it 5-6 times but had no way to reload it. Was a prototype and gift from them and had $50 on it. When I did pay people looked at me like I was crazy.",
            "Wait you guys have money? Is that a magic trick too?",
            "I would literally pay $1mm to someone who can show me how to do this.",
            "Ok but I would actually love it if a bank offered payment wands",
            "As others have no doubt pointed out, the chip you see is not the NFC. Thank you for coming to my talk, Ted.",
            "Create a wizard's staff instead with a slot to insert the card. \"This charge shall paassss!\"",
            "*Oh our tap isn't working today, just insert the card please.*",
            "It’s against the terms of use for your card. And the retailer might call police or something.",
            "Sure, go right ahead.  And when it doesn't work make sure you tell the poor support person you call what you did.  People who work in banks LOVE those stories.",
            "As someone who has worked in retail for a while, and was working in retail at around the time chip cards first started getting big, I would say that this is a really bad idea. Just the fact that you are trying to make a transaction with something that isn't a card—or a phone, in the case of people that have the tap function—it is going to throw up some red flags for any employee that gives more than a single shit about their job. Even if you would technically be legally allowed to do so, it is your card after all, chances are you're going to run into a lot of issues where people are going to flag the card use when you don't have a physical card, and they're going to want to see proof that the transaction you were making was with a card in your name. If you don't have the card to be able to present the number along with the security code on the back—also with your signature on it by the way, that part is a lot more important than people think, I also worked for a while in customer service for a credit card company and I can't tell you how many calls I had to take where a customer was being declined a charge because the retailer asked to verify the signature but they didn't have anything to compare it to—they might decline the transaction. Worst case scenario, they might even call someone suspecting you of credit card fraud. A lot of retail employees could give a shit less, they don't get paid enough to deal with that sort of thing, etc, but I have known some cashiers in the multiple places that I have worked retail that would have absolutely jumped on the possibility of ruining someone's day because they just get so pissed off at customers in general that they will take any petty vengeance they can.",
            "I knew I guy who did that but had it implanted in his wrist. No one believed him until he took off his shirt, we frisked him, then he bought a can a soda with his arm.",
            "Yes",
            "The sub lied.",
            "What",
            "Yes",
            "Anyone heard of NFC?",
            "Just put the card under your mask then pay",
            "okay just get an nfc chip conected with smartphone via bluetooth and use google wallet",
            "It can only done by using a Harry Potter wand",
            "Only if you wanna be awesome!!!",
            "What is your plan for if they don't have the equipment for tap to pay and you have to swipe or insert?",
            "Legally yes, or at least I assume so because there's that metal credit card peeps. It's just actually making it functional which is more than just the chip\n\nEdit: if you figure it out please let me know. I would love to do it",
            "The tap cards use a technology called NFC. If you could copy the info from your card and write it to a different NFC tag (which are available online for around a dollar a piece), you could put that NFC tag onto or into a wand.",
            "You'd be fucked next time it asks you to verify the pin.",
            "We used to have people drill holes into the chip to stop it working. \n\nIf you tried to use it and we could see deliberate damage we would reject the use of that card to buy things",
            "If you are really interested in this you could see what Amal over at dangerousthings.com could do for you, he does payment conversions for sub-dermal implants, he could dissolve the card, remake the antenna, and install it in something. If he was up for it. Post on the forum I’ll probably see you over there.",
            "[deleted]",
            "how do you have a witty reply to each comment, that’s some serious commitment",
            "Yes, but only if you wear a black cape and comically large top hat, and pay with a dramatic flourish. This is actually spelled out in the cardholder agreement.",
            "Illusions, Michael",
            "You would have better luck cloning it. The data is yours, so you can clone it and be legal. But cutting the chip out would be difficult.",
            "Only if you limit the use of \"Avade Cadavra\" to paying the hitman.",
            "Honestly, love this question and am rooting for you to find a solution. You’d maybe have to cut out a bigger chunk. But please make this happen",
            "I’m sure it legal but I’m not sure it’ll work",
            "Someone did this with a Dr Who-style sonic screwdriver: https://www.instructables.com/Doing-Payments-With-a-Sonic-Screwdriver/",
            "It won't work but sure?",
            "I mean, nothing is stopping you, but no promises that it’ll still work.",
            "Just tape the whole card to your wand and make it blend in somehow, even if it doesn't actually blend in at all",
            "This is my favorite question I’ve seen on this sub",
            "Go for a magic spatula instead of a wand. Problem solved.",
            "omg what a lol great idea. What an unexpected pleasant laugh the you, the op have presented. If you stole the idea, you should tell us the source. Otherwise, i hope you will have some more wonderful questions to ask!"
        ]
    },
    {
        "post_id": "rcbdfo",
        "author": "pwa09",
        "title": "Is it a red flag if a guy you just started dating asks you to delete all the guys off your snapchat and delete your Facebook altogether?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/rcbdfo/is_it_a_red_flag_if_a_guy_you_just_started_dating/",
        "score": 39708,
        "num_comments": 5001,
        "created_utc": 1639030297.0,
        "selftext": "I'm trying to convince my friend that right off the bat, this is alarming requests from a man she just started dating a few months ago. It's giving insecure and controlling. \n\nWhat y'all think?\n\nEDIT: Whoa fuck this got alot more upvotes than I thought. Unfortunately some women can't read the writing on the wall. I wish her luck but she's already knee deep with this guy. She is more attracted to his looks and status than his behavior. Let's all wish her well!",
        "permalink": "/r/NoStupidQuestions/comments/rcbdfo/is_it_a_red_flag_if_a_guy_you_just_started_dating/",
        "comments": [
            "*finds a box of pretty red flags*\n\n\"Even though the box is clearly marked and I can see what's inside, I'm still going to date it for six months\"\n\n-my favourite meme",
            "Sounds more like a red alarm.",
            "#yes",
            "Definitely. Maybe if you show her this page, it can help https://www.thehotline.org/identify-abuse/domestic-abuse-warning-signs/\n\n> Signs of abuse:\n\n> Showing extreme jealousy of your friends or time spent away from them.\n\n> Preventing or discouraging you from spending time with friends, family members, or peers.",
            "Red Alert!   \nShields up, and begin evasive maneuvers.",
            "That's a goddamn stopsign",
            "YESSS isolating someone from their support system is literally the first thing abusers do",
            "🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
            "#The frst thing abusers do is distance you from friends and family. That's what this sounds like",
            "Absolutely, I speak from experience when I say that the moment a man tries to make you stop talking to your friends is the moment you dump his ass. It will start off with small things and will end up being the controlling person you wish you never came across. My ex started off this way, made me stop talking to my friends until I had none and slowly progressed to making enemies with my fam. What ever bit of family I still spoke to I lost contact with. Then he just got abusive, wouldn't let me go no where alone, not even go outside in my own fucking back yard! RUN SIS!!!!!",
            "Lol HUGE red flag.\n\nIf he says “never mind” because he doesn’t want you to leave him.\n\n1. HE WILL go through your phone and shit regularly. He WILL find a way whether you give him permission or not. Even if you never give him passwords\n\n2. He will use it as ammunition in an argument one day.\n\n**source** I went to therapy because I was ruining every relationship I was in. But I made the choice. No one could “fix” or “change” me. I had no control in my life and thought I could control my relationships that way. It was terrible and none of those people I was with deserved to be treated like that. Neither do you.",
            "Asking it at any point is a red flag. She should block this guy",
            "This is a form of control. There is also a very strong connection between control and abuse. What they're doing is slowly strip your support system. When they have no support system, who do they have? The abuser is their only person. Then they feel very stuck and cannot leave.\n\nWitnessed this shit with my mom. She had no family, friends, was forced to quit jobs anytime my dad thinks some guy is trying to \"fuck her\". She finally left when my brothers and I got older. We became mom's support.\n\nThen guess what? In the beginning of the relationship I was exactly like this. Thanks to therapy and shit. I've improved and cut that shit. \n\nThat guy is the red flag.",
            "Sounds like a teenager…if he isn’t a teenager super red flag, if it is a teenager then he’s super insecure and could grow out of it with patience and communication.",
            "No this is not a red flag.  It's all of them.",
            "It's not a red flag, it's a blaring siren",
            "It’s a huge red flag and absolutely control. Wishing your friend the best!",
            "It would be a red flag if my husband of 27 years asked me to do that. She needs to dump him and run, full speed, away from him.",
            "Yes",
            "Is he offering to do the same thing on his Facebook and Snapchat? Its a red flag either way though...",
            "I mean, facebook and snapchat are weird as fuck and everyone should delete them, but yeah this is crazy.",
            "Definitely red flag",
            "Absofuckinglutely. Run far, far away.",
            "You ever watch those crime channels full of shows about women being killed by their boyfriends? They all start like this. Seriously.",
            "[deleted]",
            "I mean, ditching Facebook is a great idea.\n\nStill, run away. Sounds like how most domestic violence cases start, TBH.\n\nRun. Away.",
            "Instead of saying the same thing everyone else said, I just went and up-voted them all.",
            "No red flags here.\n\nMore like a Hollywood red carpet attached to the Empire State Building's spike.",
            "Run",
            "This is an attempt at controlling and isolating you. Run. My ex did started with this and it only got worse, ending in bruises, stalking and stolen underwear.",
            "Not even China's flag is that red.",
            "Yep",
            "There is no time in a relationship where that is an appropriate thing to ask.\n\nThis is also probably just the beginning of the horrible shit this guy has in store for her so make sure you keep the friendship alive, she might need you in a couple of months.",
            "Hi 👋\nFormer domestic abuse survivor here; this behavior is a huge red flag 🚩 and she need to get the hell out right now. This is how it starts and it’ll only get worse from here. She needs to RUN NOW!\n\nEdit: clarification",
            "One of the reddist",
            "Yes. Dump him.",
            "Yes.",
            "Some people aren’t lucky enough to get such a beautiful, pure, blatant, unadulterated red hued flag so early on. This is a gift in some ways.",
            "100% so many red flags. That's so controlling and if he feels comfortable asking that almost right away imagine what else he might try to control in the future.",
            "RUN! he's toxic manipulative and dangerous",
            "Thats redder than communism.",
            "That's not a red flag so much as literally a nuclear bomb being set off.  Your friend should never speak to this person",
            "i’ve seen fewer red flags when i was in Tianmen Square",
            "Where the fuck did you find this shit spackled muppet fart? Yes. Super red flag, waving violently.",
            "My ex made me do that. That explains why she's my ex.",
            "If you feel the need to ask if something is a red flag, It probably is.",
            "That’s a red flag at any time.",
            "I think you're spot on. What else needs to be said?",
            "Absolutely, the controlling behavior will only get way worse from here. This sounds like a guy who will accuse you of all kinds of stuff just for the hell of it, especially if you don't do what he wants you to..every. time.",
            "That's not a red flag. That's a big fucking red battle banner.",
            "This has more red flags than a CCP military parade.\n\nTell them to RUN - break all contact - and don’t look back",
            "Yes 100%",
            "Thats an army of red flags....",
            "Yes. Doesn’t even matter how long they’ve been dating. I wouldn’t ask my wife to fo anything like that and we’ve been together four years.",
            "Yes yes yes run fast and far.",
            "Definitely a HUGE red flag! isolating the victim is abuse 101. It’s a lot easier maintain control over someone when they have no outside opinion and no one else they can turn to for help. It’s why so many victim of domestic violence wind up homeless or in shelters.\n\nIt’s sad things like this are so common. I’m a parental abuse survivor and I’ve taken family psychology courses, so I can personally recognize the signs, but I’m in the minority. I believe that all required Heath courses should have a section on psychology and recognizing abuse. It’s important to know the signs!",
            "It's a whole series of red flags no matter how long you've been together. Like a whole Soviet military parade of red flags.",
            "That's a red banner being dragged by a red airplane that launched off a red runway from a red airport",
            "It’s a run the other direction when any guy early on in the dating process asks me to alter anything about my personal life. He’s going to want to control you.\n\nI say “early on” as when you’ve been dating for a couple years or married, compromise is what it’s about, tho never in a situation like the above.",
            "Bruh his red flags are redder than the Soviet Union's flag. I suggest that you send a private text to calmly tell her to leave him. Hopefully in a very quiet way that minimizes damage. Go with her, or bring another person along if needed.",
            "I mean. \n\nI tell everyone to delete their Facebook \n\nI’ve never used Snapchat but it sounds suspicious, like Tinder and Grindr.\n\nI’m with this guy. Delete all men and women and your accounts.\n\nAnd then tell your friend to delete this guy too.",
            "Agreed!",
            "Yes. Absolutely a red flag. And bells. And an alarm. And a frying pan hitting you in the face. Everything about it is a massive red flag.",
            "Imo this is beyond red flag. A red flag is something you should keep an eye on this would be get out relationship now for me.",
            "There were Soviet May Day parades through Moscow with fewer Red flags than this.",
            "ABSOLUTELY a red flag. A HUGE one",
            "There is no sane, rational person who will in *any way* be a good partner that would make this request. This isn't a \"don't date\" red flag, this is a \"block everywhere and avoid contact at any cost because they're deeply unwell and likely dangerous\" flag",
            "What exactly would make you question that it might not be? Not trying to be an asshole, I just legitimately can't see how this would be seen as anything other than a red flag.",
            "The only way I see it as NOT a red flag, is if she has used the apps to be unfaithful during their relationship. If shes innocent, run!",
            "Yes. It points to jealous tendencies or possibly narcissism.\n\nNot a healthy way of life.",
            "Sounds like a control freak it'll only get worse. Avoid entirely",
            "It's not a red flag, it's a parade of big waving red flags.",
            "Yes. Even if they were dating longterm, I would view this as a red flag",
            "Not to sound condescending but this is like asking if it’s a good idea to spend the weekend alone in a cabin in the woods with a confirmed axe murderer. Of course this is a red flag, you don’t need Reddit to tell you that.",
            "Yeah, red alert. He wants to socially isolate you which is the first mark of a toxic abusive person. Run!",
            "This is a huge red flag for an insecure and most likely very controlling boyfriend",
            "One of the first thing abusers do is to isolate their victim from their friends.",
            "Yeah that’s not good your friend should probably bail. I know reddit has no nuance when it comes to relationships but in this case they’re totally right.",
            "That's a red everything, just run.",
            "Short answer: yes\n\nLong answer: YEEEEEEESSSSSSSS!",
            "I don't think so, no.... A red flag would be asking to delete a specific someone, asking to delete everyone and their Facebook is as much a red flag as Russia is a city. So No, I wouldn't say it's a red flag, I would say it's a red neon outdoor complemented surrounded by multiple red flags.",
            "🚩🚩🚩🚩🚩🚩🚩🚩\n\nSource: male",
            "Yes it is. I had a work friend who’s ex boyfriend made her do this. I used to pick her up for work as she lived on the way and she’d be on the phone to him as she was waiting and the majority of the car ride and she’d have to say it was my girlfriend that was picking her up as he’d freak out if he knew it was a man. We worked in care and if we’d take clients out for the day she would have to say she was out with female staff or he’d get angry. He got violently abusive with her in the end.",
            "Top of the list red flag. I'm a guy and I can't even imagine asking my girlfriend this. Or maybe that's why I don't have a girlfriend.",
            "This is an alarm 🚨 loud enough to wake up Snorelax",
            "Yu want to get her out of that relationship, and as far away from that guy as possible, before she has to start hiding the bruises.",
            "thats an isolate and abuse guy  - your friend needs to run fast and far from that",
            "\"This guy I'm dating is asking me to cut myself off from all my friends and family and come live with him in a farm house in a rural area, told me that is where my new family will be. Is that a red flag?\"",
            "They should dump that guy but still delete Facebook and Snapchat.",
            "I've lived this life- it doesn't end well",
            "More red flags than a victory parade thru Moscow in 1945...",
            "Uhm, how do I put this? **YES!!!!**\n\nAnytime someone wants to control any aspect of your life that you don't want to give up, it is the reddest of red flags.",
            "Every girl that I've dated that had the same request, cheated on me.\nI'm gonna say that this is projection, besides manipulation",
            "Nah. Completely normal behavior.",
            "I dated a girl like this. Didn’t like me having any friends who were girls at all, eventually it built up to me not being allowed to have any friends. \n\nI spent almost 3 years suffering her abuse, she turned me against everyone, including my family. \n\n\nTell your friend to run, it only gets worse.",
            "uh.. yeah obviously, that guy is genuinely being controlling.",
            "Asking to delete any male contacts shows that he suspects cheating or something like that. In my experience, people think that everyone else is just like themselves. He is the kind of guy who will cheat, count on it.",
            "#THE BIGGEST RED FLAG 🚩",
            "It's a ref flag if they demand you to do anything.",
            "HAHAHA This is not stupid at all because it's for your friend but yeah, this is a textbook red flag. Actually I laughed because \"is it a red flag\" sounds like an understatement but it's really serious when you get down to it. It's hard to find an appropriate reaction when someone you fell in love with asks you something like that. 'Just say no' is a lot easier said than done with someone who will have no second thoughts about using emotional blackmail to get what they want, let alone leaving a relationship she's emotionally invested herself into with a partner who may play the victim or make himself look vulnerable to guilt trip her into staying (\"Why are you doing this to me?\", \"I can't continue without you\", etc.)\n\nI tried to help a (male) friend out of a toxic relationship in the past, it's not easy but it is even less so for the friend who is in that situation since they're the one who's under pressure from their partner. It think it takes a lot of listening and understanding to help them out of it because from their perspective you think without all that pressure on you. From a theoretical point of view, \"is it a red flag if he wants me to delete all my male contacts?\" is a 'well duh' question, but from a practical point of view it's hard to act on that red flag. When my friend talked to me about his relationship, I immediately noticed the red flags, told him about them, got personally mad at his girlfriend (I mean not to her face but between him and me). This is not the way to go, all it did was make him believe I was jealous and shrug it off. Try as much as you can to be neutral and to focus more on how she feels than on getting her out of this relationship asap, taking this kind of decision takes time and it needs to come from her, not from you.",
            "Here, I’ll provide the counter argument to all the yes responses:",
            "Is it a red flag if the guy I just started dating dug a grave in my front yard and I found a text message to his friend saying he was going to \"get rid of that bitch\"????",
            "100%",
            "It's all of the red flags",
            "A red flag, a sign to do a U-turn, it's both!",
            "Run do not look back. \nDO NOT GO DOWN  TO DARK CELLAR..",
            "That's not a red flag, that's a red sun. No person in a relationship has the right to DEMAND anything from the other person. You can have expectations but not demands. He will be abusive, if not physically emotionally.",
            "Holy fuck that recks(?) of insecurity...\n\nIf anything, I’d want her to post pictures of us together so all the other guys can get mad jealous...",
            "YES, VERY MUCH SO\n\nA few months isn't just starting but still that's a massive red flag.",
            "1000% red flag. That screams jealous and controlling from the rooftops.",
            "Yes it is and a really big one at that",
            "This leads to spousal abuse. She will be stopped from contacting anyone at all.",
            "Yes probably, but he might not like Snapchat cause guys send dick pics through it, and maybe he's just one of those \"you're better off deleting Facebook types\" looking out for her interests though poorly. Still those aren't reasonable asks if somebody you just started dating.  Also depends on how he reacts if she says no.",
            "Hahaha flag ? Not one but many . run far and fast !",
            "As a man, this is ... more than a red flag.   \n\n\nThis is a locomotive, painted bright red, with one of those giant snow plows trains have on the front, with a red flag pained on it, carrying 200 freight cars, loaded with nothing but red flags, destined for other abusive relationships, and it's arrival at the port is being heralded by alarms--not just any alarms, the Tsunami Warning Sirens, that also trigger the red flashing lights on all the signs through town. You, as a friend, are the Tsunami warning center in Palmer, Alaska, now sending the signal, world wide, that the red-flag express is in port.   \n\n\nShe's on a one way trip to 'getting murdered and he's convicted but there's no body' town.",
            "That's a sprinkle of beginnings of abuse",
            "Well deleting Facebook altogether is good advice but it needs to be an _advice_, not a demand.",
            "Yep, big red flag.",
            "More like Hell's Bells roaring and the ground cracking open. Run.",
            "Nah, when you start dating someone you should delete all your contacts, quit your job and set fire to all your belongings",
            "Run away now",
            "Yes. A thousand times, yes.",
            "Yes. That's controlling.",
            "Run away",
            "Massive Red Flag the size of the gigantic flag they have in Saudi Arabia.",
            "Run!",
            "They are trying to isolate them from others. It's a huge red flag. Tell them to say no politely to see how he reacts. \n\nHonestly someone telling their partner to delete all their social media without a legitimate reason and discussion is very controlling and worrying.",
            "Yes.",
            "I don't think it's a red flag. More like a [Parade](https://mamayevkurgan.files.wordpress.com/2012/07/091.jpg?w=845&h=&zoom=2) to me.",
            "Red flag, foghorn, huge light up arrows pointing to the red flag, highway directing her towards the red flag. The red flag is enormous. It has left the entire world in its shade.",
            "That's an entire barge planted back to front full of red flags sailing with red sails out of the red sea into the \"WARNING : HUGE RED FLAG AHEAD\" canal.",
            "So it’s 3,400 red flags and 0 that’s normals so far.",
            "Bruh that's like a nuclear airhorn...",
            "Pretty sure that's called *controlling behaviour*. \n\n\nIf it's this early on, its most likely gonna get worse from here, like maybe checking phone messages, never being allowed to do anything by themselves, must come home every night (no staying with friends / family).\n\n\nAnd possibly worse....\n\n\nTell your friend to either put their foot down that they are their own person, and No - not happening. Maybe the guy isn't noticing what they're doing and someone pointing it out *may* nip it in the bud. \n\n\nMaybe give them *one* chance to be a man, and act like a modern adult. \n\n\nIf the new BF freaks out, yah - red flag, break it off. \n\n\nThis is all my opinion, though.",
            "🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
            "Friend should run for her life!!!",
            "RUN!",
            "Let's be Real. A man who ask that is 100% a Beater of Woman and a Rapist....or he want to sold her to sex slavery.",
            "It's not a red flag...\n\nIt's a crimson one.",
            "Flag on the play, Ted Bundy's cousin needs to be removed from the field.",
            "Yes. Next question, please.",
            "Yes",
            "I mean, everyone should delete Facebook anyway but I don't think this guy really cares about the terrible impact it has on society / individuals so yes, massive red flag.",
            "why does this have 4k upvotes and hundreds of comments lmao it's common sense ??",
            "Sounds normal for a serial killer.",
            "Seems like you already know the answer.",
            "I’m getting ‘Sleeping with the Enemy’ vibes.",
            "Sounds like your friend DONE FUCKED UP. But yeah that's some Phyco Shit.",
            "Yes",
            "Yes.",
            "Looks like your friend has walked into a red flag factory… Thats insanely controlling.",
            "That’s a red flag even if they didn’t just start dating.",
            "🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
            "That's a big red nuclear flag",
            "Yes great, big, huge, gigantic, massive, colossal flags litteraly everywhere. He's massively insecure and controlling. I advise running away very quickly and immediately.",
            "Yes.",
            "This is defcon 1 level of alarm. Stay away from that man, that behaviour is not normal.",
            "That's a red tarp",
            "That's an air raid siren",
            "Obvious red flag.",
            "issa red dead redemption",
            "Run friend",
            "RUN RUN RUN RUN RUN RUN",
            "Yeah nah. Say see you later alligator 🐊",
            "Wtf yes that’s mental",
            "This is like the sound those alien things made in war of the worlds.  Leave.",
            "I'm refusing to believe that when people lack this much common sense and that posts like these are just strictly attention-seeking.",
            "Yes\n\nNot really understanding the logic of deleting Facebook but keeping Snapchat, unless something has changed over the last 5 years doesn’t everything on Snapchat disappear after a certain time?",
            "It would even be a red flag if you've been with this guy for years. Or married. Never date someone who tries to control your contacts.",
            "It's a red flag that such an obvious red flag has to be asked if it's a red flag.",
            "Does she actually think this is ok? Mmm. Poor girl. This is just the start to something really sinister",
            "Jesus Christ.\n\nDid we learn NOTHING from that whole thing with Gabbi Petito?",
            "Deleting your Facebook is very good for your mental health, but I will bet both of my kidneys that is not his reasoning.",
            "Deleting Facebook is just sound advice, deleting only your male friends is a massive red flag.",
            "Red alert, red alert, it’s a catastrophe.",
            "Very insecure and controlling. He likely has low self-esteem which he will just create more problems down the road for her.\nI would tell your friend to stop seeing this person.",
            "Errr, if you cannot tell this is a red nuclear alarm, I wonder what has happen for you to go \"ohhhhhh, yeah, that's a red flag, totally\".",
            "I don’t think that’s a red flag tbh. \n\nIt’s closer to if we put a red filter on the bat signal and shined it directly into your eyes",
            "Major red flag. He's trying to isolate your friend, classic abuse tactic",
            "Oh wow. There is nothing normal or acceptable about this. Even if he's not an abuser, why would you isolate yourself for anyone without a damn good reason? But *maybe* he's not an abuser. Maybe he's \"just\" jealous beyond anything remotely reasonable. Maybe he's \"just\" a conspiracy theorist nutcase or something. Either way, it's not someone you should have in your life, much less be romantically involved with.",
            "it's a red flag at any point in any relationship IMO",
            "I'm amazed you're still allowed direct contact with this friend. Do you have to yell through the air-holes in her cage?",
            "That is a huge RED ALARM.\nNo healthy relationship would ever develop or thrive with that type of controlling crap.\nIt’s a predatory behavior and she should run the other way as fast as possible. Run as though her life depends on it…..",
            "It sounds insecure. I mean I understand in todays society where a girl or a guy can metaphorically talk to whoever he/she wants whenever he/she wants. If your friend is a beautiful girl it just brings out the insecurities more.",
            "As a normalish dude, I would not do this. Seems like a tactic to control and isolate someone. 99% chance this dude is bad news",
            "Yup very red",
            "Since when does just started dating = a few months.....\n\nBut anyway yeah I think that's stupid.  But tbf this seems to be concerned reasonable when it occurs in the inverse.\n\n\nI find it funny that everyone in this thread equates attempts to abuse with, \"I don't want you snap chatting others guys\". Literally nobody has any info if this are friends from childhood or just the other people she's trying to date or just dated haha. Would you people be saying a women is abusive if he told the guy she was dated she doesn't want him talking with all the girls he's previously banged?",
            "A huge, gigantic red flag that should be fliwn above a Perkins for abusive men.",
            "Get out",
            "I was gonna say \"this is likely the biggest non-criminal redflag to exist\" but I don't even think that's true. Not because \"maybe there's something worse\", but because the implications of it are legitimately criminal",
            "This is why there are problematic relationships.  People think it's okay to request this, and people think that it's okay they ask it.",
            "RUN",
            "Yes! This is a major red flag!! \nIt will literally only get worse for her, I went through this with my ex\nAfter that request it was every male I spoke to regardless of topic, even for work according to him I was into them and wanted to date them or cheat on him\n\nShe does not even need to go through anything like that save her the pain now and help her see that he is crazy before she invests her time into the relationship some more",
            "Yeah No. that dude needs to kick rocks. He’s probably got a sex dungeon and not the good kind",
            "I'm a guy, and that just screams jealous control freak! Tell your friend to run for the hills!!",
            "One hundred million percent yes.",
            "He’s insecure controller 1000%",
            "As a guy, this a huge red flag. Please leave",
            "Run far away",
            "Raise the nuclear threat level.",
            "It’s a giant red flag. He’s going to try and control every aspect of her life and this is just the beginning. First off, no, don’t delete shit. See his reaction. His reaction may warrant her breaking off the relationship.",
            "He's likely a very insecure narcissist.",
            "Command & Conquer: Red Alert",
            "Yes! Yes! Yes! If that's not clear YES! He might as well use a flare gun. What is next? Read your texts?! Close your bank accounts!?",
            "Open your eyes. What's the point in these posts",
            "This is a siren with flashing lights and emergency flares",
            "Is water wet?",
            "not a red flag, more like a giant crimson banner the size of those American flags at car dealerships. tell your friend to run",
            "That's not a flag, that's a god damn national emergency alert",
            "Flag? That's a whole air raid alarm! Run!",
            "Yup. I could make a simi argument for Facebook, but if the only reason he wants you to do it is because you are talking to other guys as friends, yeah big red flag. The first step to an abusive relationship is to isolate the person.",
            "Those people are often the first ones to cheat because they project their insecurities of being caught.",
            "Is the Pope Catholic?",
            "This is classic behavior for abusive relationships. Step one is this isolation of the victim, convincing them to cut contact with others, and working their way from the outside in, I.e., casual acquaintances, then friends, then family. Guilt and threats of abandonment will be key. It then allows them to create an emotional dependency on the abuser, and then the kinds of abuse will escalate from there. \n\nLike someone else said, this is a red alarm.",
            "HUGE RED FLAG!  If anyone I am dating tells me who I can and cannot talk to, there's probably gonna be a break up very soon."
        ]
    },
    {
        "post_id": "goiaa5",
        "author": "None",
        "title": "Has google search gotten less accurate in anyone else’s opinion? In the sense that I’ll google something and often have to go to the second page to find the result to get past what look like ads. Even Wikipedia is often on the second page instead of the first result now?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/goiaa5/has_google_search_gotten_less_accurate_in_anyone/",
        "score": 39436,
        "num_comments": 2659,
        "created_utc": 1590149840.0,
        "selftext": "Maybe it’s my head",
        "permalink": "/r/NoStupidQuestions/comments/goiaa5/has_google_search_gotten_less_accurate_in_anyone/",
        "comments": [
            "I actually noticed this happen to me for YouTube. I'd look for something and could hardly find what I'm looking for, so I click on a video that's close but not exactly what I want, and then I find what I want in the related videos (with the keywords i searched!)\n\nThis only started happening recently, like maybe the recent weeks or months. I wonder if anyone else experienced this lately?",
            "[deleted]",
            "Google has DEFINITELY Got worse over the last couple of years. \n\nGoogle scholar doesn’t work as well, and image search just floods with crap from Pinterest. Google has become severely less effective for me. \n\nThey’re more bothered about sending you to places that have paid to be at the top, rather than actual legitimate sources for anything.",
            "Holy shit I thought it was just me.It used to be that there were a few pages full of the results you were looking for I kinda get half of what I'm looking for mixed with my recommendations based in my history gone to absolute shit.Lets not even get started on how bad YouTube has become I really need an decent adblock for my phone but I cant find a decent one\n\nEdit:Thanks to everyone who replied with suggestions went to the settings on my phone and changed a few things as well as installing an app",
            "They deliberately changed image search because it was a popular way to shop without using their shopping format, which provides them additional revenue.",
            "A lot of it has become more intuitive, but the more technical your question gets, the more it just throws its hands up.\n\nAlso, I absolutely HATE that it will drop words from your search just to produce more results. I typed those words and I mean it!",
            "Google images is pretty much completely unusable for me now. It's so fucking bad.\n\nBoth from a design standpoint and results.",
            "Yes SEO has ruined everything. Look up fossils you get watches not dinosaurs, I had a pet scorpion but when searching scorpion it always gave me Scorpio horoscopes. That’s why Japan Sued Kim Kardashian for trying to call her underwear line Kimono, they were trying to preserve the importance of a significant part of their culture. Plus appropriation and all that.\n\nEdit: u/butyourenice has corrected me accurately: “ “Japan” never sued Kim Kardashian. She caught flak/bad PR and Mae the choice to rebrand. The whole thing could’ve been a PR stunt, but there was never a lawsuit.”",
            "Google is absolute garbage for searching anything related to a product. If I'm trying to learn something invariably I am required to search another source like Reddit through Google. \n\nFor example, I became introduced to the concept of weighted blankets and was intrigued. So I Google \"why use a weighted blanket\" and \"weighted blanket benefits\". Just by virtue of the word \"weighted blanket\" being in the search I got pages and pages of nothing but ads trying to sell them, and zero meaningful discourse on why I would use one. So then I have to resort to limiting myself by searching \"site:www.reddit.com weighted blanket benefits\" just so I can get connected to real people talking about the device and its benefits/drawbacks. \n\nAnyway, fuck Google. It's still okay for searching about concepts, but if you try to search anything even remotely commercial or that can be sold as a product then good fucking luck. Unfortunately the alternatives aren't much better because engines like Duckduckgo just simply aren't as good at indexing and giving you the results you would want.\n\n2000's Google was the best in my memory.",
            "I've been complaining about this for at least 5 years, but everyone always looks at me like I'm crazy. I feel like I have to try way harder with a lot more variation in words to find what I'm looking for.\n\nEdit: and whereas I used to automatically click the first and second links, now I ignore them.",
            "It’s a combination of Google doing a lot more monetization, and sellers and website hosts developing a more aggressive use of SEO. Googles algorithms are widely studied, such that if you take a course on SEO, you learn how to optimize for Google. Once you know how it works, you can use your SEO terms to “hack” Google’s algorithms and get your potentially useless shit up front. Amazon is suffering from the same problem with a lot of Chinese produced goods. Check out the titles of products, they’re just packed with SEO terms.",
            "The Wikipedia things I’ve definitely noticed I usually have to include wiki in my search now because it’s no longer on the first page most of the time",
            "My problem with Google search is that a couple of years ago they stopped including all your words in search results.  So if I want to search for something like \"arizona green tea\" they may drop green tea and give me a lot of search results about Arizona the state.  Sometimes you can find under a search result that it'll say \"this result doesn't contain your search terms\" and then there is an option to click to tell Google that yeah, you actually wanted those search terms.  It's obnoxious.  Like, I put those terms there because *that's what I'm searching for* and there are obviously tons of results if you would just *let them appear,* Google!",
            "Exactly.Really noticed it over the last few months.  Just yesterday got fed up and searched on duckduckgo so thanks for asking this question I would love to know the reason.",
            "It has, I used to be able to search a specific phrase and find the page I was looking for, now I search the same phrase and it’s on like the second or third page. I know a couple other people who’ve noticed this",
            "It seems to me that at some point in the last 3-5 years Google Search changed in that it started deriving intent from your search (e.g. he must be searching for watches).  Once it thinks it knows your intent, you see results for that, even if you add more specific terms to your query.  It has already decided what it thinks you want and shows you results for that. As others have mentioned, I now have to often add quotes around specific words/phrases to get reliable results.",
            "glad to see I'm not the only person feeling this way. now when I'm searching for images I usually type \"-pinterest\" to get rid of that",
            "IMO as a developer, the issue is that Google has tried to rely more on things like prediction and less on what you're actually typing in. \n\nI find it getting harder to find what I'm looking for because when I type something in, EXACTLY how I want it, the search results are polluted with \"similar\" shit that doesn't match my query. \n\nEven when I use Quotes, it still doesn't perform an exact search half the time.\n\nThey've done this shit throughout a lot of their products. Even the history search doesn't return things ver batim. The URL bar also searches history and doesn't return half the sites I've visited, only the things it *thinks* I want. This means that unlike in the past, if I know I visited a site, half the time the only way to get the URL is to manually scroll through my history.\n\nI'm assuming this is to cater to people who have no idea how to use a search engine, browser, etc, but for those of us that got used to crafting explicit queries, it's really fucked us over.\n\nIt's the same shit MS has done with Windows. The windows search became shit because it started trying to guess what you want instead of just returning what you type in. \n\nIt's the stupification of consumer electronics.",
            "Definitely worse. It's horrible for pics especially since all I get is useless pinterest results at the top.",
            "Very much so.  For at least the past two years, Google search has been useless.  I use DuckDuckGo now.  Gosh, even Bing is better than Google!",
            "Search Optimization is a thing now too, with many companies in a cat-and-mouse game of gaming the algorithm to appear higher in the search listings.",
            "Like others have said, it's not just in your head and it is unfortunately 100% intentional. It's true that Google spams ads in Search and any site that uses Google Ad Services with hidden trackers (about 76% of the internet as reported by CNBC), but the more sinister thing to consider is WHY do they do this? I put a TL;DR but it's very worth it to check out all the links I tagged in this.\n\nTL;DR - It's not about money. Everything Google presents you is a social experiment to see how you will interact with what they put in front of you. Google intentionally inconveniences you as part of the experiment. All of that data is collected, attributed to the personal profile they have of you and used educate their machine learning and artificial intelligences, just like in the movie Ex Machina. Google will probably be first to create sentient AI. Here's their progress from 2 years ago so they of course are farther along now. [Google's AI Assistant Can Now Make Real Phone Calls](https://youtu.be/JvbHu_bVa_g) \n\nThe Daily Mail and Forbes report Alphabet (Google's parent company founded by Google executives) is valued at over 1 trillion dollars. Google is by no means struggling financially and does not NEED to spam the whole internet with ads so then why do they do it? There are many reasons and none of them as simple as greed. I have a friend who used to work at Google X (Google's own Area 51 branch) and he's confirmed to me many times how Google is the most brilliant, nefarious company on earth. \n\nIt's not about money. Everything Google presents you is a social experiment to see how you will interact with what they put in front of you. Google (and Facebook and Amazon) track how you INTERACT with a page's information ([Google and Facebook are watching our everyone move online.](https://www.cnbc.com/2018/01/31/google-facebook-data-privacy-concerns-out-of-control-commentary.html) ). \nThis means how long you hover over an item with the mouse, how long you keep your screen positioned on certain objects, what you do and don't click on, how long you stay on a certain link or page, how have you interacted with similar links/objects in the past and much more. They have a system in place that measures where they think your eyes are focused when looking at the screen. Google intentionally inconveniences you as part of the experiment in order to see how you will react (Facebook got in trouble for the same things years ago but everybody does it now [Facebook's secret psychological experiment on users.](https://www.theguardian.com/technology/2014/oct/02/facebook-sorry-secret-psychological-experiment-users) ). All of this data is collected, attributed to the hugely intricate personal profile they have of you and used educate their machine learning and artificial intelligences, just like in the movie Ex Machina. In that movie, the genius founder of a tech company similar to Google funnels all the information from the world's search history into an AI to potentially create sentience. Google's legitimately doing the same thing. I am not a conspiracy theorist and I mean this in the most literal, non-sensationalist way but Google genuinely wants world domination thorough tech. Not money, not simply power or influence, but the ability to manipulate the minds and lives of the masses however they please. It's the closest power trip to being a god. The more you read insightful tech news with insider knowledge, the more you come to see this is true.\n\nEDIT: Forgot to say, if you really care about your privacy, which we all should, then you should use Firefox as your default browser with AdBlockPlus and DuckDuckGo.com as your search engine. These are the only major players who don't track you and sell your data. Also check your privacy settings on all social media because you have more options than you realize, and finally, you can turn off the extreme default personalization of Google Ad Services if you want. You'll start getting lots of weird random ads but they won't be based on invasive info collected on you. [Google Ad Services Options](https://adssettings.google.com/anonymous?hl=en&sig=ACi0TCg7iUV-M8RkhWgEpdI2CgTD9-gcvsdl63ZOzgXdHKMSNYZGvNwvblFh9IZJrPlRbbDCHuv73JcR3KBgNLTxlhu9KNM_Eu80WCUoJe7So2flQ3207g8&od=1)\n\nEDIT 2: Thanks for the gold! I really care about people understanding their control over their own data and what's really going on behind the scenes with these tech giants.",
            "Yeah I might be paranoid- but it seemed to start for me after the whole net neutrality business. Ever since that was lost I've been saying to duck duck go, which seems to pull up similar results to Google from a decade ago.",
            "[deleted]",
            "Whenever I used to have a tech problem, i could search my problem and get several results of forums where they talk about the issue or similar issues. Now when i do the same, it seems the first page is full of web stores selling the item and product reviews. As if its somewhat ignoring the entire troubleshooting portion of my search.",
            "Yes, drastically. \n\nIt used to be that you could include keywords that would be weighed based on how specific they are - makes sense to determine if you're googling for a broad topic, or looking for very specific information.\n\nHowever these days the algorithm prioritizes the popularity of a result over the quality of the match with your search terms. \n\nFor instance, you may be searching for \"Win 10 VPN split horizon routing\", and it will give you results related only to \"Win 10\" or \"Win 10 VPN\" that have nothing to do with the actual query, because the result's ranking is higher than that of the actually relevant match.",
            "Yeah, Google is fucked. Try googling \"white people\" in Google images.",
            "I've complained about this a year or two ago and observed it for maybe 5  years. \n\nThe biggest problem is when you're trying to look for something slightly more specific. The search engine favors popular search results over what you actually want. Something google used to be really good at.... \n\nI can't think of any specific example for this but basically it ends up with you getting the exact opposite result of what you want just because \"why bananas are healthy\" is more popular then \"why bananas are unhealthy\", even if you search for the latter you get results for the former, for no reason. And if you search for something like \"big bananas linked to blah blah blah because blah blah blah\" instead of getting specific query you will still get \"why bananas are healthy\" and nowhere will you get a single article even trying to answer the thing you're looking for.\n\nPopularity of the article and of the website itself seems to be weighted far more important than answering the actual querry.\n\n\nduckduckgo is just as useless\n\nbing.com can sometimes be better actually, but nowhere near Google's former levels of fame.\n\nI think this might be a result of search engine optimization too.",
            "It's especially bad when you search a gaming question like \"How do you ___ in the game ___?\" Then you get 500 clickbait articles that are all copy-pastes of each other of a wrong answer that some bottomfeeder at polygon pulled out of a reddit comment. \n\nOur when looking for a recipe or cooking question. Bunch of terrible recipe sites and no actual useful info.",
            "Use DuckDuckGo!!! It’s gotten really good lately!! Been using for years and all through college too. And it respects your privacy!",
            "[removed]",
            "I'm old, so I was around when Google started. It was revolutionary in its ability to index websites better than their existing competitors.\n\nThey peaked, but then suffered from their own success, as people desperate for traffic injected every bit of SEO nonsense into their sites possible. \n\nMore controversial, Google now seems to display a political bent. They seem to promote and suppress results based on how they fit to their politcal leanings.",
            "There’s definitely some ads at the top, but nowhere near enough to fill the full first page in most cases. Clear your cookies and/or enable stronger settings for your adblocker - you should see very few of those search-based ads",
            "Google wants you to spend more time on search results pages. The more time you spend there the more money it is for them.",
            "Try out DuckDuckGo. Google feels basically unusable now.",
            "The one \"feature\" of Google I hate the most is that it always gives you movie results first, even if the term input has much more significance as something else. This is particularly terrible for books, whose disastrous Hollywood movie adaptations are given the spotlight.",
            "I know image searches have become very hit or miss.",
            "Everyone here a should type into a Google search: Why does Google suck now? to send a message.",
            "As an IT professional almost 15 year into my career, it’s gotten closer and closer to unusable for what I’ve used it for. \n\nBack in the day, google an error message, find actual discussions about it. Now? Google an error message, find 250 different pieces of garbage software that have games SEO to be on top. “Use our software to solve all windows errors including 0x04538824”\n\nBack in the day, if you were interested in buying a new product for you home, you could find actual reviews of products, and people discussing them. Now? 5000 blogs trying to get amazon referral clicks “Best quadcopter reviews 2020” “best refrigerators in 2020”, “our favorite k cups for 2020”. “Top 10 inflatable swimming pools under 48 inches deep that are colored white for 2020”\n\nEveryone has been fighting for google results for so long you can’t even find what you’re looking for anymore. \n\nIn the last few years I’ve gone from never needing to go past the 2nd page of google, to not even being able to use google",
            "Just a few hours ago I thought the same thing and dismissed myself “oh come on it’s google it’s fine, I must not be asking a question clearly”\nI finally just gave up my search because it was so frustrating. I was trying to be clear, concise, and descriptive yet it didn’t know what I was looking for. \n\nThank you for asking this question, I thought I was just going crazy.",
            "DuckDuckGo will give accurate results usually, but I looked up a Leatherman tool and it pulled up porn one time, so there's that too.",
            "Another thing I noticed, there is like a code to google searches, like add “ around something to make sure it includes that word. Add - before a word, and it excludes that word from results. \n\nHowever, I try to search the shopping tab for a product, and the top 30 results are all ebay. Even when I type -Ebay or -site:ebay.com nothing happens. All the shopping results are still Ebay. I want to buy the product from a company, I dont want to bid on it from some random dude who ships it from his house. Ive gotten too many fake reproductions from random Ebay sellers. I just want to find online retro game stores. I know they exist, google! Ebay must pay google a huge chunk of change to fill up every search result and to not allow the “-site:” code to work on the shopping tab.",
            "Not for me but these comments are interesting for sure.",
            "yeah man idk what's happening but whenever i search for what i want it appears momentarily but reloads to display weird shit that i have no use off. What i wanted before always ends up being on the second page.\n\ni think it's just them having more aggressive ads now which is dumb",
            "Even when I search with quotation marks I get so much unrelated results. My Google Fu is not what it used to be :(",
            "I left google for Duck Duck Go a while ago.\n\nThe only thing I don't like is that DDG uses Apple maps.\n\nEDIT: spelling",
            "What I find really interesting is google results based on geographical location. I live in New Zealand and I find it relatively easy to find factual info on google straight away (with the exception of a few sensationalised news articles). However, sometimes if I accidentally leave my VPN on, I end up accidentally using US google and the results that come up on US google vs NZ google are mind blowingly different.",
            "Absolutely! Now I use reddit to search for things because I haven’t gotten any interesting results for what I’m looking for from google in months",
            "Piling on, yes Google is terrible and their other products, like Backup and Sync barely work.\n\nBeen using DuckDuckGo.",
            "Google is trying to push everything besides Google to the 2nd page. They're straight up stealing content and putting it in the search results, too. Bing is 10-1000x better depending on whether you're talking normal search or images and DuckDuckGo feels like going back in time (in a good way).",
            "I can't really tell if Google has gotten worse, to me, it just works as intended.  I have always used an adblocker, <uBlock origin>, in my endeavors and rarely see an ad, when I do well I go to ublock settings, purge cache and update.\nSomething I've noticed, is that Google search results try to guess what is it that I want and gives results based on that, compared to Bing, that gives you literally what you typed on the search.",
            "It's because Google isn't a keyword search engine anymore, it's a profiler.\n\nIt takes all your ad data, and generates results based on \n\n1, a \"honeycomb\" algorithm that pulls results from the 6 most related popular search terms \n\n2, results that are designed to generate clicks, not results that are specific to what you're seeking.\n\n\nGoogle is not a search engine anymore, it's a content aggregator similar to reddit that uses a consumer profile instead of upvotes to manage what you see.",
            "Everyone is gaming the Google algorithm to get to the front page... you no longer find the most relevant results at the top or first page, it's full of sites with the most \"spend\" or smartest SEO team/person.   \n\n It's sad - when I ran the e-com for a boutique motorcycle parts distributor i was constantly bombarded by sites and people offering to get me on the front page of our competitors searches... it's all so shady, but, it's a business and Google doesn't care, as long as they get their cut",
            "Yes, I distinctly remember it changing around ~2015-2016 from being a master of the specific, always finding that exact thing you were looking for, to bring completely diluted by keywords. Now if you search like, “chromecast timeout error” it just gives results for like, what is a chromecast, developing for chromecast, etc. \nI’m sure there was a good reason for this change but it really has gotten completely keyword-focused these days which makes it a lot less useful for me (a programmer)",
            "Wow these comments really hate google.\n\nI've tried most of the things that \"don't work\" just now, virtual machine so no cookies or anything. All of them work just fine. I get disliking google, there's probably a lot that they can be blamed for, but a non-functional searching machine just isn't one of them.",
            "If I ever need something like information on Google, I usually type \"reddit\" after it. I get what I'm looking for 90% of the time",
            "When I started using images to search for something, I tried Google's and it was just horrible. I started looking for other options and found Yandex which is very accurate. Been using it since then",
            "Years ago google started treating each term you put as an OR evidenced by the 'must have' under some of the links.  Also they customize the results for you based on historical and algorithm searching somehow as well (I don't know how better to describe it)\n\nI frequently use double quotes for the words I need to be in my results and if I'm really frustrated I'll open an incognito window to reset the algorithm."
        ]
    },
    {
        "post_id": "qg8yc2",
        "author": "Rodbrollin",
        "title": "Why do billionaires and other very rich individuals try so hard to avoid paying taxes when they will still be rich whether they pay the taxes or not?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/qg8yc2/why_do_billionaires_and_other_very_rich/",
        "score": 39297,
        "num_comments": 5755,
        "created_utc": 1635262228.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/qg8yc2/why_do_billionaires_and_other_very_rich/",
        "comments": [
            "This is a complicated question. Let me first start by sayin that most of the ultra wealthy have wealth through assets, either physical property or stock ownership NOT through income. When we say Musk is worth 200B, most of that is assets. His liquid wealth, while still substantial, is likely much much smaller, maybe a few hundred million. You also must understand that money is not the same to the wealthy as it is to us. Money for them is a tool used to create more wealth. Anything which diminishes that tool must be minimized in order to maximize the usefulness of the tool. Basically we have a few motivating factors here, one is the desire to sustain a lavish lifestyle utilizing a much smaller amount of liquid assets, so paying 25% of 300 million will actually lower their ability to own all those fancy houses and yachts and rub elbows with politicians and officials. Second, is the desire to utilize wealth to productively to make more wealth. While a few million less may not be substantial, those few million may be worth 10x or 100x if properly invested, so the pain of that tax is many times multiples. Third the desire to avoid taxes on assets which is a whole separate discussion around property rights, but when 98% percent of your worth is in assets, you sure don’t want that to happen.",
            "Let’s say you could pay $20k a year of taxes or $5k for an accountant and $5k in taxes, which one would you pick? That’s why.",
            "[deleted]",
            "Because after a certain point it isn't money any more, it's just a high score.\n\nNobody can reasonably spend a billion dollars on themselves. It's just an absolutely insane amount of money. So the difference in lifestyle and purchasing power between 1 billion and 500 billion is really meaningless. At that point it isn't money, it's a score that you want to run up so you're richer than your rich friends or just because you are compulsive about \"winning\" at finance.",
            "Because most people take whatever deductions they are allowed to take.",
            "They do but it's not perceived like people think. Most millionaires/billionaires do not have liquid capital and are sitting around like Scrooge McDuck. They have stock portfolios, IRAs, 401ks, own real estate, own business. These items are only worth what people are willing to buy them at. Stock market crashes then you're screwed. Business goes under, screwed. Property values tank, screwed. Want to sell the business/property? Then it's only worth the selling price. What the wealthy end up doing is they take out loans or lines of credit at the bank. The bank knows they're rich because they own amazon (Bezos) so the risk of defaulting is low. Sometimes they trade it for their company stock. \n\nOverall, people get taxed on yearly income or capital gains. If you dont claim an income... no tax. Your business took a loss? No corporate tax this year. Capital gains tax kicks in once you pull out of your portfolio. \n\nCant tax you for spending your loan money (yet).",
            "To answer, I'm gonna rephrase the question: why would *regular people* try so hard to avoid paying taxes?  \n\nAnother similar question would be: Do you use coupons when available? Do you look for various rebates etc when buying a new phone?\n\nAnd this behavior isn't specific to the rich. HR block, turbo tax etc heavily, almost exclusively base their ads on maximizing deductions and tax credits, and those ads are targeting the average citizen, not the rich. \n\nSorry to answer your question with a question, but: Why would anyone willingly pay more than they need to?\n\nRegardless of how people feel about the rich, they generally dont get rich by simply wasting/unecessarily spending money. Some studies place 88% of millionaires as \"self made\" meaning they didn't start rich, and more likely than not had to put considerable effort into minimizing costs/expenses. That is not a skillset that just evaporates at an arbitrarily determined level of wealth. \n\nAre there problems with our tax system and how the different deductions and incentives work? Sure, but that's a different question and a different conversation.",
            "greed.... also most of their money is invested, not stockpiled",
            "There are a couple of sides to this. At one point as one amasse wealth, one learns to keep it close or working to make more money by avoiding taxes (legally) which makes one even richer. The other side is that the billionaires understand that taxes are like a game. Has you play better, you get less taxes. If you can avoid paying taxes and keep it as capital which can be reinvested to make more money and generate more value to the economy, you are not cheating the system, you just better control where the money goes and how it's used in the economy. \n\nOf course there is the greedy kind that will cheat on their taxes but these are amateurs. There are plenty of loopholes build in the tax systems to exploit and legally reduce taxes.",
            "These wealthy people aren't doing their own taxes. \n\nThey pay an accounting firm to do those taxes. There are multiple accounting firms competing for that business through a combination of their fees and the amount of money they can save the rich person in taxes. \n\nThe wealthy individual is not setting up offshore accounts or tracking their receipts or lobbying for tax law changes. They go to lawyers and accounts and pay them.",
            "Because it's a tax accountant's job to file taxes in the most effective way possible.  It's also their job to do it in a legal fashion.\n\nUnless you're colluding with a sports player to skim points or something illegal like that, nobody would hire someone to do their job poorly on purpose, that's ridiculous.",
            "To earn your first million you probably started a successful business. If you start a successful business, you probably have to carefully watch your expenses, including taxes and minimize them.  Same thing with going from $1 m to $2m to $10m and so on.  These types of disciplined number driven people can’t turn it off their personality magically at some point when they have enough that they can’t spend it.",
            "The simple answer is, you don't become a billionaire by giving money away.",
            "Relative to the amount of money they keep, the amount they personally do or spend to reduce their tax burden is probably fairly small. I suspect that at that level of wealth the process is almost automatic from the billionaire's perspective. \n\nAs to why bother, I doubt there's a level of wealth at which you suddenly think, 'That's enough.' Your wealth generates more wealth, and a lot of people other than you have a stake in perpetuating it. Having it is better than not having it, and it costs you barely anything to gain more. Even if you do decide to give it to people with greater need, like Bill Gates, you'd probably prefer to give it away to the people you choose in the style you choose. I'm sure Bezos has just as many objections to how the government spends his tax money as the average American does.",
            "Half of this comment section is just people saying that all rich people are evil while the other half are giving valid explanations. It helps to try and see things from other people's points of view, rather than denouncing anyone more successful than you as evil. I'm not saying that there aren't a lot of rich evil people, but to imply that everyone who makes use of loopholes in the tax system is evil just shows a lack of understanding.",
            "Humans are extremely complex. There isn’t one single answer why, and there’s more than just one theory as to why people might act like this. Some would espouse this is natural human behavior, at least more common than not, and some would say these people are an extreme, bordering or even fitting psychological disorders \n\nGenerally, it wouldn’t be wrong to boil it down to human greed; rather, the desire for more in of itself. Like mentioned, some say it’s natural some say it’s an extreme bordering insanity, just depends on which perspective you take.\n\nTL;DR it’s complicated, but I’d say greed is good enough as an answer most of the time.",
            "As a poorer person I would do anything to stop paying taxes. So I don't even blame them really. The second I can figure out how to stop myself I will.",
            "Hey, if Jeff's trucks and the fed ex planes use the roads and runways infrastructure and Wal marts and all of them then why don't they pay for it to be rebuilt, maintained, upgraded or whatever.",
            "If you can avoid paying taxes legally why wouldn't you?",
            "I've never seen a place such as Reddit, where everyone is an expert on billionaires, their motivations, and how everyone else knows how they should spend their money.",
            "There's a few layers to unpack here. It's not that they actively try hard to avoid them - the thing is, the government encourages people to own businesses and to invest, so they throw in  tax incentives to do so (e.g. business expenses are tax deductible, selling stocks after 1 year will get you less tax fees, etc.). \n\nThese sorts of rules (in theory) create jobs, value, and innovation while a business owner or investor will choose to abide by them in exchange to get their kid's tuition, their mom's hospital bills, or if all is going well, a new car. They probably could do it either way like you say, but if we were in their shoes and know all the tax \"cheat codes\", we'd probably be doing the same thing.",
            "No stupid questions, just stupid answers. LOL\n\nThey play the rules that have been set by the government. Their goal is to be maximally efficient for the sake of their employees, future employees, and most of all share holders.\n\nAlot of this money is actually reinvested into growing theirs and other business to   \ncreate more jobs and prosperity. Not sitting in a pile Scrooge McDuck style like Reddit would have you believe.",
            "[deleted]",
            "I don't know why in the US, but in Argentina we evade taxes because we hate the government. They have done nothing but rob and humiliate us, why are we going to pay them money? Evading taxes is a patriotic duty to defund the regime and eventually collapse. I shit on Kirchner and I also shit on Maduro. There is a war between the citizen and the dictatorship, and the way to destroy it without falling into a civil war is to strangle them financially. Where other people's money to spend runs out, socialist dictatorships collapse, they cannot function without squandering money to support their lackeys and thugs.",
            "IT'S MY MONEY AND I NEED IT NOW",
            "There's also a facet to this that people don't tend to consider for whatever reason, which is simply, why wouldn't they try to avoid taxes?  We are upset that billionaires don't pay enough in taxes, which is fair, but it's up to the government to tax them appropriately, not up to the billionaires to be like \"Well, my taxes were only $140k this year, but I tacked on a couple million more, get yourself something pretty.\"  Let me tell you, when it's time to do taxes, I'm looking for every legal deduction I can take, the same as they would do.  \nPlease don't take this as me stating billionaires shouldn't pay more, it's rather the opposite.  It's up to the government to raise the taxes on the millionaires and billionaires to make them pay what they legally owe.  The problem is the implication with a question like this is that they don't pay what they legally owe, and that's generally not the case.  They will, and do, exploit every possible loophole to avoid being taxed, as would I, and most likely anyone here would, too, who's smart.  The trick is to close those legal and quasi-legal loopholes.  \nIn the 50's, the upper tax bracket on earnings over $5M in a year was 90%.  If you're not familiar with tax brackets that means ONLY the amount you make OVER $5M is taxed at 90%.  The secret of this trick wasn't the government trying to take 90% of their money, the the trick was that reinvesting in your business, paying your employees better wages, paying for pensions, investing in the arts and sciences, all of those things are tax deductible.  So as a millionaire, if I make $6M, I can either give $900,000 of that last million to the US government, or I can set up the 'Regional Memorial Hospital Richter12x2 Cancer Ward'.  That makes me look good, saves me money, and helps the community for a long time to come.  Which was what was intended.  Reinvest the wealth in the community versus hoarding it.  As a millionaire, would you rather have another increment in the bank account, or a literal building with your name on it you can drive by each day as a reminder of what a hot shot and all around good guy you are?  \nEventually though, the people who write the laws and tax brackets were replaced by people who really didn't understand the strategy of the system, and the tax rates were lowered.  Then at some point, millionaires and billionaires figured out how buying politicians could also possibly be a tax deduction if it was done by their corporation, which is also a person on its own for the purposes of wrong-doing, and now we are where we are, electing politicians who we thought represented our interests, but who end up voting for whatever their corporate sponsors tell them, and pushing through whatever bills are written for them.",
            "Why do people salivate over taxing the wealthy more and more, when there is no indication that the government will actually spend that revenue on the things you want them to?",
            "Why would anyone want to give an entity their money for it to end up in politicians pockets.",
            "Nobody became rich with a philosophy of giving money away",
            "I'll answer it in more general terms rathe than \"the rich\".\n\n&#x200B;\n\nLet's say you make $50k a year and live comfortably.  If the government came to you and say they were going to take an additional $5k in taxes, would you object?  After all, you're not \"starving\".\n\nI've built my wealth from literally nothing, and I'll be damned if I'm going to just give it away to the government to watch them piss it away on stupid shit, run up our national debt, then turn around and have the fucking NERVE to demand more money from me.\n\nThat's why.  When the government starts spending money responsibly, THEN I'll look into giving them more taxes if needed.",
            "This is some dumb shit I’m reading. None of this even makes sense. These super rich people, do they have more money then they know what to do with? Yes. But is it all cash sitting in a bank account? Hell no. Most of the accumulated wealth comes from holding stock in their own business. What? You want them to sell off all their stocks, no longer hold any shares of their own company, and give it away? Like yes I agree they can and should do more but the majority of their wealth is tied into their own business. Can you imagine the ripple effect that would occur if a CEO or founder of the company sold off billions $ of shares in their own company. Imagine if Bezos just sold billions of his own stock off. The company would lose so much money as people would begin panic selling their own stocks and price per share would plummet literally just evaporating wealth into thin air. That may not be guaranteed but generally speaking it doesn’t normally farewell for a stock.",
            "I think everyone tries to pay the minimum tax they owe",
            "Because people always want more, that's all there is to it. We are never satisfied.",
            "It's because the higher your net worth, the more people target you. So you need more money to protect yourself if that ever happens.\n\nFor example, if you are Bezos and you have most of your wealth inside Amazon stock, that means that if a new government policy can somehow ruin Amazon, you've just lost most of your money. \n\nSo you need to make sure you have as much money as possible to use to pay off politicians and control the situation.\n\n\"The bigger you are the harder you fall\"",
            "In my economics class we learned that someone with 10 million dollars will say they need 18 million dollars to live comfortably. The more wealth you have the more adjusted you become and the more you think you need. It’s fascinating how someone can look at the rich and think “how can they need/want more money?” Until that person themselves becomes rich and suddenly they need/want more. \n\nThe cycle will never end.",
            "Because they don't care about anyone else's problems any more than you care about the problems of most anyone else.\n\nThey just have a lot more money to not care with.",
            "If you're selfish, you don't want the US government *taking* your money.\n\nIf you're selfless, you don't want the US government *spending* your money.\n\nA selfless person would probably allocate their money more effectively than the US government.",
            "It is also about getting over on the rest of us. I worked for a few years in Beverly Hills  for a couple of pretty wealthy guys who drove Bentleys and Lamborghinis and who had many properties and art collections. Their day job was a business where they employed mostly illegal aliens from all over the world which I ran crews of all over the country. They had a little side thing connected to the business where they traded labor for huge quantities of used furniture that was sold at auction and they got a little percentage of the money from that. I was once given $5,000 by an auctioneer and told to give it to Udi and Paul when I got back to L.A. These guys split the money up and literally danced around the office holding it on high and giggling like school girls. It was pocket change that meant nothing to them. I had to entertain clients with or without other employees higher up the food chain and we would spend $5,000 on 4 or 5 guys eating and drinking and going to topless bars. When I found a client who was opposed to topless entertainment if we were in one of a few states where it was legal I would go shoot machine guns with them spending several thousand dollar. It was all written off the taxes, but the money that was secret was the sweetest to them.",
            "That’s how they got rich in the first place. Old habits are hard to break. 🤦🏽‍♂️",
            "Once you have enough money that all your needs and desires are met, money stops being a tool to survive and instead becomes points in a game. Rich people don't like losing, and they all want to have the high score regardless of the cost to human life or the planet.",
            "Because wealth inspires greed. There’s no reason at all why the rich don’t pay taxes, it’s just that they’re greedy motherfuckers and don’t believe in a better world for everyone, only themselves. \nProve me wrong.",
            "When you have been trying to amass wealth for a  really long time, it takes a lot of effort to switch to cruising mode, cash out and pay your taxes.",
            "Because they don't-- they do pay taxes like anyone else... The US Tax code is complicated and is progressive based on adjusted gross income. Now, the wealthy have many adjustments and non-liquid assets, which may render they annual taxes smaller, but not due to tax evasion, but due to deferred liquidation, or in other words, due to the fact that they do bot keep their income in liquid assets, thus not paying income taxes on them. However, this doesn't mean that they won't pay taxes upon the liquidation of the said assets. Another little circumstance that helps the rich to pay less taxes is the long-term rate on capital gains, which is significantly lower than plain income tax. This is because the long-term investments are encouraged by the state to spur business activity and economic growth.\n\nAll-in--all, the rich probably wind up paying more taxes than lower 50% of the income bracket. It is just that relative to the amount they earned or have the amount paid in taxes seems to be insignificant, when compared to the median income family's tax burden in absolute dollar terms. This is, obviously, due to the vast disparity in incomes, and not to the tax cheating or tax breaks.\n\nI think overall, the progressive tax code in the US is fair and much lower than elsewhere in the developed world...",
            "Billionaires and other rich people are the ones most conditioned to be preoccupied with money. It doesn’t just stop once they make a certain amount.",
            "The more appropriate question is why don't billionaires pay tax when they are gonna lose half of it in divorce anyway.",
            "Why give the government more money to militarize police, start wars, fund pork barrel bullshit government programs that only benefit small groups of donors and create more public support programs with minimal oversight?  Maybe they should optimize spending to begin with.  More to education and healthcare workers would be a great start.  Once I see my hard earned money going to actually benefit other humans efficiently I’d gladly share a bit more of it.",
            "Greed",
            "Maybe they don't like paying for children in cages or drone murder.",
            "Rich people do pay taxes. When you hear on TV “reach people need to pay fair share” you immediately think that they don’t pay, but they do. Also, tax on wealth could be thought of a double taxation. Say person make $1million a year pays taxes but over time his account accumulates $10 million. Person already paid taxed on it by now s/he will need to pay additional tax just because s/he saved the money. Not everyone is up for it. Also here’s from tax foundation: “The top 1 percent paid a greater share of individual income taxes (40.1 percent) than the bottom 90 percent combined (28.6 percent). The top 1 percent of taxpayers paid a 25.4 percent average individual income tax rate, which is more than seven times higher than taxpayers in the bottom 50 percent (3.4 percent).”",
            "[deleted]",
            "You won't get rich with that I want to pay taxes attitude.",
            "because theyre sociopaths who want power and money = power.",
            "There's multiple reasons but, personally, I think one is America's misguided faith in the \"self made\" myth.",
            "GREED!!!!",
            "For the same reason anyone does - including you I am sure - they don't want to give money to a government that doesn't use it properly... since they earned it to begin with it is theirs... grow up...",
            "Because nobody *likes* ~~having their money stolen at gunpoint~~ paying taxes.",
            "they don't. \n\nthey pay other people to work very hard for them to find ways to avoid paying taxes. whether lobbyists or lawyers or accountants.\n\nrich don't work hard. \n\nthey own assets and they make executive decisions. other people they hire work hard to make their decisions become reality or they get fired.",
            "Would you rather have $5 billion or $2 billion?",
            "This question is rooted in the assumption that rich people are Bond villains that are doing the most evil scheme. In reality, it’s more like:\n\nGovernment: “If you build in this area to provide jobs and boost the economy, we will give you a tax credit”\n\nRich people: “Okay, sounds good”",
            "Cuz they can!",
            "The richer you are the cheaper you are.. in most cases.",
            "You don’t get rich paying taxes",
            "Oh, not paying for things is how they got rich, mostly.  So it is an ingrained habit.",
            "Why to sprinters try to run faster when they are already fast?  It is a sport.",
            "You don't get rich by spending more money than you need to.",
            "So few of them try to avoid taxes. Mostly, it’s just the ones that are like this that we hear about. The top 10% pay 90% of the total taxes in the US, so obviously most of them aren’t avoiding.",
            "So one of the problems with how we see their wealth is that for most it is tied up in the companies they founded.  Bill Gates, Elon musk, Jeff bezos.  Their net worth is based on shares of the companies they founded that that are holding but not selling.  Selling the shares would dilute their voting power and control over the company.  This would be like saying my net worth is $1m based on the value of my paid off house and retirement accounts.  Neither of those are liquid at this point.  \n\nSo if Elon musk is assessed a tax of $20B as was implied he would need to sell or transfer to the federal government 2m shares of Tesla stock. This dilutes his holdings and voting power in the company.  He likely has paid minimal taxes in the past by not selling shares, which incurs tax liabilities but borrowing against shares used as collateral.  Since the loans are not income he does not have to pay taxes on that money he pulls for spending. It’s an interesting approach really only available to the truely wealthy.   For me to leverage the value of my assets I would have to get a loan on my house and use it as collateral or a loan gain at my retirement accounts. I wouldn’t want to do that because it affects my future retirement plans. So even though I may have a $1m net worth it is not really very accessible. \n\nMusk is in a different boat.  It doesn’t really affect retirement, but it could affect the amount of control he has over Tesla and his other companies.",
            "Why do you file a return and try to get back as much as you can?",
            "Because they can and its cheap (for them) to do it. You can pay lawyers and tax accountants $1 million total, if you made $1 billion in a year, $1 million is worth it yo save $400 million in taxes\n\nThe question is why do government allows billionaires to do this. Where middle class pays higher tax rates. They should eliminate tax loopholes but they’re paid by lobbyists, which is paid by rich billionaires",
            "The tax code has loopholes.  Rich people are rich because they know how to manage their money - and with a few exceptions, they like to keep it.",
            "Most of the billionaires don’t handle their direct finances.  They go to a tax/law firm and pay them extremely well to find every available loop hole and exclusion possible. It’s the firms handling the billionaires wealth that get the taxes down to nothing. They also provide feedback to the billionaires on tax issues that cost the billionaires money and suggest bribes (called campaign contributions in the US) to specific politicians who will update legislation for more favorable tax policies in return  for the bribe.",
            "Because nobody ever got rich paying their fair share of anything.",
            "Wife and I talked about it this morning. I’m 72 and when we got married in 76 I was making around 10,000 a year and she as a RN about the same. First house was 29,000 fixer upper.  Last year between the to of us we made 110,000. We are planning on selling our house and down sizing. Small house on Florida is around 375,000. I have to pay tax on my social security and my small amount we get from IRA . Local property taxes, and cost of maintaining a home don’t leave much. We pay more percentage wise than people who make millions.\nThis is far from complicated",
            "Because they have developed a sociopathic fixation that involves trying to have the one thing that will always prove to be unattainable: \n\nEnough.",
            "Because they can just pay a tax expert 0.2% of their wealth to save them 15% of their wealth.",
            "Same reason why I choose the lesser priced pack of meat. Just cause I have the money doesn't mean I want to pay higher for it.\n\nRich people hire accountants to get them around taxes legally (most of the time). Blame the game, not the players.\n\nIf we want rich people to pay their taxes, we need to remove all loopholes and just say: Your money and assets wealth increased this much this year, you pay this %.",
            "What makes you think they try hard? They are typically billionaires because of the stock or assets they own. They have enough money to hire an accountant that tells them what to do and gives them advice. They simply take relatively low salaries because they don't need the cash and prefer to get stock. That results in less or no income taxes with little or no effort. \n\nHowever, they usually pay pretty steep property taxes, luxury taxes, and sales taxes, so there's that.",
            "Leverage.\n\nThe point of a capitalist society is to \"force\" (through the [Invisible Hand](https://en.wikipedia.org/wiki/Invisible_hand)) the participants to, not only preserve but, grow their capital. I.e. you try to pay less for more, and you try to charge more than your product/service cost, to make a \"gain\", or generally, \"profit\".\n\nIn absolute capitalism, there is nothing stopping from a crypto-fascist from taking over. That is where the government steps in. The one flaw of capitalism is that greed and infinite wealth is a goal, the market does not price greed down. The market optimizes for the valuation of goods/services, but this is where it gets tricky because value/income produced by the \"proletariat\", the workers, trickles up to the managers, manager's managers, etc, etc. What you often pay for is \"infrastructure\", which are basically other capitalists working together to maximize profit.\n\nAll of this is to say, it's an oxymoron. They did not get rich by looking to give their money away. The business of being a capitalist is to preserve as much capital as they can.",
            "You don't want to be rich, you want WEALTH. You want to pass that on to your kids, your future generations. When you worked 80 hour weeks to acquire that wealth, you will definitely resent people just taking it. Plus, who doesn't like giving the finger to the tax man? Most people would if they can get away with it. Wealthy individuals have way more options to obfuscate their wealth than you and I. They can hide it better, so they do.",
            "It's man so in love with greed, he has forgotten himself and found only appetites.",
            "CPAs have a fiduciary responsibility to all clients, rich or not. Their job, when they are tax preparers, is to implement the proper strategies to minimize tax. A CPA isn’t going to do Elon’s taxes and then, just, *add* extra tax for fun. And they won’t just *ignore* tax savings, etc. It’s not that billionaires try that hard to avoid tax, they just hire CPAs and the CPAs do their job.",
            "Superiority complex",
            "You don’t stay rich spending your money.",
            "Lol #reddit",
            "The main reason is that wealthy people hire accounting firms to handle their personal business and taxes. Those firms then optimize on tax avoidance because at least some people will choose the firm specifically for that. Wealthy people aren’t typically sitting around trying to figure out how to evade taxes, they hire people who do that as part of the services they provide.",
            "Because once you are so rich that you can have or do anything then eventually the only thing to do with all that money is see your number grow. It's just a fun game and a competitive thing for the ones who are competitive. \n\nIt's a mental illness, and such wealth should not be allowed to accumulate because it's extremely dangerous to human societies and economies. It's almost a guarantee that if someone is rich beyond reason then they will use their wealth to make the world a worse place.",
            "They are hoarders.",
            "Because they are evil.\nWhy are we to to humanize clear demons ?",
            "It makes me mad that 33% of my pay cheque is gone to taxes, but these rich people pay almost zero tax….",
            "Avoiding taxes is a huge part of how they get and STAY rich. And staying rich is a huge part of how they avoid paying taxes.",
            "\"Because the only thing betta than a crawfish dinna, is 5 crawfish dinnas!\"  Lol",
            "I've wondered this myself, but I have come to believe that it's because they have a win-at-all-costs mentality.",
            "Poor man wants to be rich. Rich man wants to be king. King ain't satisfied till he rules everything.",
            "Idk anything about this but I will answer it anyway. And I will answer it with a question. \n\nAren't taxes percentages of what you make and not like a specific amount?",
            "Well, its really simple, you don't have to get into wonky explanations about preserving asset value and leverage ratios. The reality is this. You don't become a billionaire by being the kind of person who likes to give their $$ to Anyone. Normal humans say, it's only money, it comes and goes. It's only worth something if you spend it. Billionaires don't think like that. To them, it's a game to get the highest score, and all their behaviors are designed to maximize that score. It's self fulfilling really, if you don't act that way, you'll never accumulate a thousand million dollars worth of anything.",
            "Greed knows no limits.",
            "I'm pretty sure they wouldn't mind paying more if they were certain that the taxes went spent wisely. Just a thought.",
            "You think rich people are hunched over a calculator and stack of receipts?\n\nThey hire folks to do their taxes.  The folks hired do the tax reporting according to the laws as they are required to do.\n\nWho would give the govt money when you pay a company/tax person to advise you how to position yourself to avoid taxes?\n\nThe govt doesn't care about tax revenue.  They spend as much as they can.  That is why there is a $28.5 trillion debt.  There is $120 trillion in unfunded liabilities.\n\nAttacking rich folks is a distraction from the true villains, the politicians that write the tax laws.",
            "Everyone tries to pay the least amount of tax...",
            "because they pay others to do their taxes for them, and the people who are hired don’t have any other success metric other than $$$ saved through loopholes. musk, bezos, etc. probably aren’t spending lots of their time thinking about how to avoid taxes nor can they actually navigate that themselves.",
            "Isn’t this an easy answer? If you could not pay for something, wouldn’t you? \n\nIf you can not pay taxes and get away with it… wouldn’t you?  \n\nThey can, so they do.",
            "[deleted]",
            "Literally everyone tries to pay the least allowed by the law. Be mad at the politicians.",
            "Tl'dr, because theyre greedy bastards",
            "Nobody wants to write a check for $32 million to a group of corrupt, out of touch morons who are going to squander it.",
            "A lot of times because these people live in a 'bubble' of other billionaires and they are not measuring their wealth on the world we know, they are measuring their wealth against each other.",
            "Being rich is a mindset",
            "To extremely over simply it….\n\nTaxes are for losers, rich people are winners",
            "Billionaires have good spending habits ingrained in them.  If I told you you could buy a Ferrari for $200000, or the same car but for $1 million, you aren’t gonna pay the extra $800000.",
            "I am an attorney who helps rich people avoid paying these taxes (after their death) so I feel like I have good insight here (at least as far as the payment of taxes by their estate is concerned).\n\nReason number 1: it’s simply a good business decision. If you can pay me $10-15,000 so that your kids don’t get taxed $800,000 from the estate tax it’s a good investment.\n\nReason #2 “I (or my family) earned this money and I shouldn’t have to pay more because I (or my family) is successful”. Basically it boils down to they feel entitled to pay less either because of political ideology, inflated self importance or a mixture of the two.\n\nReason #3 they want as much money to go to their kids as possible because they want their family to be financially secure for as long as possible. These are people who value family “dynasties” and generally view themselves as “nobles” rather than rich cunts who made our like bandits during the tech booms.",
            "They’re rational actors. Why would anyone expect them to pay more in taxes than then they have to? They’re playing by the tax code rules as they re written. If you want to blame anyone, blame Congress and the mess of a tax code they’ve created.",
            "It's not \"avoiding\" taxes as much as tax laws are written in a way that they don't need to pay. The system isn't broken; it's by design.",
            "Rich people don't get rich by giving it away",
            "Very late to the party, but the billionaires of this world are not tax specialists, they are not accountants.\n\nWhat happens is, they hire a firm or a consultant, who puts in place a range of strategies to minimise their tax bill. The billionaire really doesn't give a toss if its 20% or 21% tax rate, but his advisors who are paid a percentage of the tax savings do. \n\nSo as Governments change tax law, the consultants can find loopholes to maximise their income, whilst billionaires can stay as they are - pretty much indifferent to a 20% or 30% tax rate.",
            "How much extra tax per year do you pay genius?  No-one wants to pay any more than they have to… why would anyone “rich” or “poor” voluntarily pay our stupid government more of their money in the form of taxes?",
            "They don’t try that hard. Their accountants do. For them it’s just writing a check. Spend a couple million on accountants and save a couple hundred million in taxes.",
            "IT IS THEIR MONEY! They are only doing what the law allows. Everything I see this question posed it reeks of resentment and jealousy.",
            "More money > less money",
            "#GREED",
            "Because taxation is theft",
            "Because the Income Tax is unconstitutional. It's bad for poor people and the middle class and extra wealthy alike. It has eradicated the middle class, and reduced them to being poor and living paycheck to paycheck. Social Security IS nothing more than a tax, and we the people got scammed. The SCOTUS has ruled on this numerous times, it IS a tax and is NOT for ANY specified purpose whatsoever, not even anyone's retirement. It is used in whichever fashion the vote of Congress chooses to use it, which is %100 legal, but how many actually are aware of these facts? These are some of the things that drain everyone's wealth so that only a few ever reach being rich.\n\nCapitalism IS selfish, and that is exactly why it works so well. People will always serve their own best interests first. True, some take advantage and go too far, but if there were an evenly apportioned tax as the Constitution originally called for, everyone could far more easily  become rich themselves.\n\nWhy worry about what the ultra wealthy have or do? Why not worry about making yourself ultra wealthy instead? Want to be egalitarian and help everyone else that isn't smart enough to make themselves wealthy? Hey fine, it's YOUR money, do whatever you want with it. But NEVER assume anything to be given to you by the effort of others. Do yourself a favor and serve yourself by gaining wealth, then save some of it, even to hoarding if you'd like. No one owes anyone a living. Period. Self responsibility needs to be a thing again. There is far too little of it these days.",
            "Cause then they’ll have less. Like the rest of us.",
            "The real joke is that just because billionaires taxes increase (which they should) the General public’s tax liability will not decrease (which it should)",
            "Greed.",
            "Greed.  Greed.  Greed."
        ]
    },
    {
        "post_id": "h0wlea",
        "author": "ToastFaceKiller",
        "title": "We just got flaming hot cheetos here in New Zealand. Do normal human beings actually eat these?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/h0wlea/we_just_got_flaming_hot_cheetos_here_in_new/",
        "score": 39177,
        "num_comments": 5986,
        "created_utc": 1591870715.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/h0wlea/we_just_got_flaming_hot_cheetos_here_in_new/",
        "comments": [
            "Get a nice burn going from the hot cheetos. Next, chug down an ice cold soda. You'll be able to briefly see into the future",
            "Wait till you try the XXTRA spicy hot Cheetos 🔥",
            "They were out of stock at the store last night. I walked around for five minutes looking for a bag... then left without getting any chips because nothing else would be as good.",
            "[deleted]",
            "The pain helps distract us from everything else that's going on",
            "They’re delicious! I’m genuinely surprised this is something that is just now being sold there",
            "I used to be a teacher in middle school (about grades 5-8, so ages 10-13) and a TON of kids would have Hot Cheetos for breakfast AND lunch. (Then they wondered why they weren't feeling good...)",
            "Bit of a loaded question there... What is it you take issue with that leads you to wonder if \"normal\" people eat them: the heat, taste, texture, etc?",
            "Are you sure they’re the American ones ? Australia has tried our hands at an adulterated version which are considerably worse than the original.",
            "A mexican janitor made that cheetos. It is certainly popular among latinos.",
            "Yes.  It’s even a small stereotype for teenage girls in some places.",
            "Flaming Hot Limón tastes like a big bowl of Phở! Delicious!",
            "I do, I prefer Takis Fuego though!",
            "I’m not trying to seem like a r/iamveryvadass but my friends and I don’t find them very hot, definitely a little spicy but not much",
            "[deleted]",
            "I live in South Texas and kids here love them. There’s a soft drink called Big Red that pairs well with them.",
            "Mexican here...we love our hot cheetos and anything spicy. If you ever make it to Mexico you'll see we put chilli powder or hot sauce on EVERYTHING!! \n\nThanks OP now I'm going to go drink a btl of tapatio.",
            "I live in the US (specifically Arizona, which has a growing population of spice consuming cultures, me included) so I might have a skewed image, but from my experience they're pretty much omnipresent whenever junk food is offered. I think you'd be considered a little strange if you've never had hot cheetos before. Even people I know who don't like spice in general have at least tried them. \n\nThat being said, it's not exactly considered a culturally important food or anything. It doesn't have any of the same mythos that burgers, steaks, and apple pie have. It's just a common junk food that can be bought basically anywhere.",
            "You mean to tell me people actually eat the non-flaming hot cheetos?",
            "They aren't spicy tho. That's why they had to produce the XXtra Flaming hot",
            "Yes, I use them a lot when cooking. I like to crumble them on top of my baked mac and cheese. Try it!",
            "Baked flaming hot Cheetos are even better and I will die on this hill!",
            "Bold of you to assume Americans are normal humans. We thrive on pain",
            "Years ago when I was back in highschool we'd sandwich these between a bagel and cream cheese. The cream cheese would negate any lingering spice. Not sure how I feel about this now. Lol",
            "Flaming hot puffs are amazing",
            "[deleted]",
            "Mexican toddlers love them",
            "Only when we have the unstoppable desire to suffer.",
            "They do. \n\n\nhttps://youtu.be/_1y6bpdT3a4\n\nThe reason they aren’t to your likening is likely because it’s a cuisine developed by Mexican immigrants. \n\nOur palate is influenced by culture. Not very educated on New Zealand immigrant culture. \n\nBut you likely don’t have a sizable Mexican community. So they likely won’t be as palatable.",
            "Once upon a time I was in the US Marines, in the barracks where hard liquor was NOT allowed...I was underage at the time anyhow but for whatever reason I had a bottle of 151 proof rum and I was all alone over the holidays, drinking rum straight from the bottle.\n\nSome time went by and I decided I was hungry and I visited the vending machine downstairs.  There I saw flaming hot Cheetos and purchased two small bags and returned to my room to eat these red treats while drinking my rum.\n\nShortly thereafter I didn’t feel too pretty good and decided to lie down on the floor.  It was at this point that my body decided that it didn’t like the rum or the Cheetos very much and this mixture was violently expelled from my mouth and nose onto the floor.  It was even spicier coming up the second time having been saturated in pretty pure ethanol.\n\nI remember looking at the floor at this red goop...and thinking how painful this experience had been and I was grateful at being intoxicated because it would have sucked much worse had I been sober.  I think I slept in that goop that night...and I haven’t bothered with spicy Cheetos since.",
            "Just got my hands on some Flamin Hot dill pickle chips, yum!",
            "[deleted]",
            "Yes we do. One thing I noticed living in New Zealand is that Kiwis do not like super spicy food like we have here in the US.",
            "Mexicans:  Do not normal human beings actually eat these????",
            "I want hot Cheetos now.",
            "They’re great! They have these Flamin’ Hot Chilé Limon kind here in the USA, they’re better!!!!",
            "Here in Mexico people buy them and then put a hot sauce over them.",
            "Well some lady brought her 3 year old to the clinic where I worked because “he says his stomach hurts after he eats hot cheetos”. So, yes.",
            "I gotta be in the mood to torture my tastebuds, but yeah they’re  good.",
            "Oh dear lord yes those are amazing.",
            "Tbh, to my Indian pallet they’re a micron above bland on the spice scale",
            "Tbh, Flaming Hot Cheetos are just meh for me atm, I need something hotter..",
            "Holy shit dude, in California kids eat these for breakfast.",
            "If you're amazed by this, check out /r/spicy to see some of the other hot things people eat.",
            "Don't you guys eat Vegemite on toast or is that just Australia",
            "I’ve never understood humans who enjoy the uncomfortable feeling of burning on their tounge",
            "Normal human beings? No. Americans? Yes.",
            "Not if you're health conscious.\n\nThat being said, plenty people do",
            "Am American. I tried them once and spit them out. I can handle spicy food but the flavor was unbearable.",
            "They’re not even hot.\n\nIn Florida they have “extra flamin hot Cheetos” and those are actually pretty damn hot.\n\nThe normal flamin’ hot are pretty mild imo..",
            "[deleted]",
            "Don’t judge.",
            "Well, I don't know about normal human beings, but Americans do.",
            "I am more into the Extra Flaming Hot Cheetos.",
            "WARNING!!!\n\nSPOILER ALERT!!!\n\nWAIT UNTIL YOU SEE WHAT HAPPENS IF YOU EAT THE WHOLE BAG!!!\n\nYou will poop red and it will scare the living bejesus out of you, and you will swear you are dieing.  Eat those flamin hots and wash them down with water, lotsa water.\n\nYou will swear them off for a few days but those sweet fiery inferno sticks will call your name and you will suffer again....did I mention the burning?\n\nFlaming hot cheetos and hot fries are my holy grail of snacks.\n\nFor a while they had a kind with double nacho cheese and shaped like a paw....I would eat all the paws and chips shaped like nets.\n\nStarting to think I might not be normal...\n\nBicycles will save the 🌎!!!",
            "Here in USA we love Cheetos so much we put one in charge"
        ]
    },
    {
        "post_id": "lcgow6",
        "author": "poop_wagon",
        "title": "How do you get out of bed every morning just to go to a job?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/lcgow6/how_do_you_get_out_of_bed_every_morning_just_to/",
        "score": 38898,
        "num_comments": 7194,
        "created_utc": 1612448643.0,
        "selftext": "I don’t understand how people would rather have a job than be dead. I genuinely don’t understand the motive. I picked a field I love, I became educated, I have had multiple jobs that are vastly different from eachother and every one gives me the same overwhelming feeling of “I’d literally rather die than do this”. It’s been every job I’ve ever had, even before graduating college. I simply don’t feel rewarded when I put in effort to complete a task, I never get fulfillment out of a job well done. I don’t understand how people do this their whole lives",
        "permalink": "/r/NoStupidQuestions/comments/lcgow6/how_do_you_get_out_of_bed_every_morning_just_to/",
        "comments": [
            "Oof. This is giving me flashbacks to my quarter life crisis. Honestly, I think we've been taught to think a career/job is supposed to be fulfilling, give you purpose and satisfaction, blahblahblah. Eventually you realize that's bs for 99% of the world and most of human history. A job just pays the bills. What you do outside of it is where most people find meaning. It's a bit morbid, but read some obituaries in your local papers. The most interesting ones don't talk about their jobs.",
            "This is how I used to feel in college, but I had no clue what I wanted to do so that's what caused it which led me to drop out. My first job at a gas station didn't make me feel any better because I was treated like garbage, then I was a busser at a sports bar/alehouse place which had the same problem (except the one manager who was awesome to me, fuck yeah he was great.) Then I landed a job as a plumbers apprentice, and it really has reinvigorated my love for living. Tldr I have disliked living for most of my (short) life but being able to do something as important as fixing people's plumbing or repairing their BFPs has been a great experience. I feel like I have a reason to live since I'm enjoying this job and am doing something that helps people directly, as lame as it may sound. Also my family has been a big help the whole way helping me stay sane :)",
            "I have people who depend on me. I won't lie, some days I feel it too, I almost hope I get into a car accident on my way in...\n\nHowever, I have a little girl and an aging mother I am responsible for. I could just quit, skip town and never look back but I could never, ever forgive myself for it. The little one didn't ask for any of this and my mother has given her life raising 3 kids. The way I see it, if I can give back to mom and provide a better life than I had growing up to the little one, it makes it all worth it.\n\nEDIT: To the person who reported this to Reddit Care Resources, thank you. I appreciate the thought very much  but I'm doing just fine. I assume it was this comment, I can't actually tell lol.",
            "I have a dog I love very much. He makes me wake up every day. He’s hungry.",
            "I've developed the ability to have fun regardless of the situation. Job, jail, stranded along the road, it doesn't matter, I have the tools to make it not suck. My productivity could be better and I'm not going to be employee of the year but at least I'm not burned out or depressed like a lot of my co workers who are productive.",
            "I'm a masochist. And people depend on me. Not just that, I have animals that depend on me. I can't look my kitties in the eyes and not feel like I have to do everything I can to provide for them.",
            "I've struggled with this my whole life. I fight every day with it. \n\nThe only reprieve I've found within is knowing that I can make the lives of those around me happier and better, as the absolute biggest \"fuck you\" to the gnawing dread of the void that awaits us all.",
            "If it wasn't for my dogs I wouldn't bother keeping a job honestly.  I despise my job, I tested positive for Covid two weeks ago and was screamed at for being in quarantine last Friday.  I am back in the office this week and I told my boss I am getting a test today during my lunch break (takes about five minutes) and I was screamed at for wanting to get another test.\n\nSo, dogs.  If it wasn't for [Lilith and Zero](https://i.redd.it/74bu5wzrx7461.png) I wouldn't subject myself to this mundane 40 hour a week (minimum) grind.\n\nAlso, before this job I was poor, stole groceries to survive, struggled with substance abuse and lived off ramen for a couple of years.  That gave a little bit if perspective, I don't want to struggle like that again.\n\nBut mostly, dogs.",
            "I honestly had to double check that I didn't write this. I'm with you. I got a degree in engineering, supposed to be what I loved doing. I've had 3 career moves. One to a similar industry but different company, also smaller company. One to an entirely different industry. \n\nFor as long as I have had a career, my work ruins my Friday nights because I am depressed about knowing I have to go to work Monday. I can't even enjoy my time off because I dread going to work. \n\nMy jobs gave been fine. I've always had great bosses. I've always done well I'm my jobs. Promoted easily enough. Paid well. Rarely OT. I just absolutely dread the 9-5 grind.",
            "I am a teacher, and I thoroughly enjoy seeing my students, teaching them, and getting to know their tiny worlds. But I still hate waking up at 5:30 every morning, driving 30 minutes in the snow, shivering in front of my space heater, and spending 8 hours working just to drive another 30 minutes home in the dark to do it again the next day.\n\n40 hour work weeks are awful no matter what you do. They shouldn’t exist. Wouldn’t matter if I lived in a sunny place, kids shouldn’t even have to be at school for that long. It’s too much.",
            "That's the thing about work - for most of us life isn't about work. Having a dream job is an idea instilled into us at a young age but very few people actually do, and of those very few get to do it. \n\nSo it becomes about the reward. 50 years ago that deal was working a full time job and getting to own a house, support a family, and put money into your true passions. \n\nNow you need to go into massive debt to get the kind of education the job market demands. Regular jobs don't cut it for independant survival any more, never mind saving any money. Cost of living is so high that dual-income parents can't support their kids. Property is nearly inaccessible to anyone born in the last thirty years. \n\nAnd in response to this we're constantly told to just try harder. Pull yourself up by your bootstraps, get a side hustle. It's a degrading system, the alternative to which is homelessness. People get up every day because they have no choice. There's nothing wrong with you. We just weren't meant to live this way.",
            "I was like that until mid 20s then said Fock it, I’m doing what I love even if it’s less pay. Haven’t regretted it for a second.",
            "I work in the evenings.",
            "I'm going to go out on a limb and suggest that you probably don't like your coworkers? \n\nI've had many previous lives. From working on a boat to banking compliance to engineering to warehouse work to executive customer service to drug addicted criminal. \n\nUnequivocally, the best jobs weren't the most interesting or the best paying. Those were the ones where I genuinely liked my coworkers.",
            "I love this post. I’m depressed and have been for years and have wondered the same thing. If you don’t make a certain income and/or are living paycheck-to-paycheck and you’re not passionate about your work, I really don’t understand how people do that for years on end. I’m only 25 and I was fed up with working years ago to the point that I even became suicidal. Maybe I have a sense of entitlement having grown up with many things given to me admittedly, but even if that hadn’t been the case I’m pretty sure I would still feel similar, maybe further down the road. I don’t know how people go for 40 years spending 1/3 of their lives doing something they hate. Many people respond to that with reasons such as having kids or family members to take care of, and while I respect that, it still sounds depressing to have to sign away a third of your life just to make ends meet for yourself and a few other people.\n\nNot to change the subject but I really feel as though the current wealth gap at least in the U.S. is a main contributor to why so many people have to live this way. It’s unfortunate. I’m not hating on people that have become successful, but more than 50% of all wealth is in the hands of 1% of the people. This is what creates the unhealthy work-life balance that many people experience while people like Jeff Bezos and Oprah have multiple homes which are unoccupied for most of the year. Spaces which could very well be inhabited by people that would be more than happy to live there full-time.\n\nUltimately time is money. Everybody knows that. So following that logic, if there is someone such as Jeff Bezos or Bill Gates that could never work another day in their life and still be more than comfortable, that means that proportionately, logically, and inevitably, there are going to be numerous people that will never get to experience what it’s like to have more than 8 hours of down time per day (really 5-6 or even less if you count commuting and taking care of other responsibilities).",
            "Because not having money sucks more. I've fallen into a job which I 'dont mind', I do however put absolutely minimal effort in to not get fired and as soon as I leave I don't think about work at all, I refuse to look at emails ect at home. Combined with a pretty happy home life I believe this makes work tolerable.",
            "I work to live; I don't live to work\n\n\n\nThat's what I tell myself anyway.",
            "I'm a diesel mechanic. Not a big fan of my job, but I don't think about the in terms of \"job well done\" or \"task fulfilment.\" \n\nBut I have hobbies that my job funds and that's what I focus on. I buy Magic cards I really want to build the best decks I can. I buy rare collectibles to add to my collection. I buy hard to find anime that I've always wanted. I buy video games or old consoles and stuff like that. \n\nMy job is merely a means to an end and since I started looking at it that way, it's greatly improved my mood. I just leased a 2000 Blazer that I'm taking on extra work to get paid off as quickly as possible so I can start building it into a badass 4X4 trail rider. \n\nIt doesn't work for everyone, but if there are things you like doing then focus on those to get you through the day. I've struggled with Depression since I was 13, and I'm 32 now. I've only recently taken on this mentality and it's greatly improved my work days.",
            "I used to feel that way in my 20s. Im in a field I love but back then I was in junior positions that had awful balance and terrible managers. My daughter probably literally saved my life. It started to fade when I started making over 70k, I felt like I could breethe. Once I hit 100k all of the bs mostly stopped bothering me. \n\nThe main point here is that people are happier when they dont feel crushed by making no money in a deadend job.",
            "I don't feel like I have a choice, poverty/debt are the new slavery. I feel like a prisoner. I want to be a writer, and I do write from time to time, but I've got to work to pay bills. So I work, and in the end I might have to work until I'm dead, and ultimately all my effort will make someone else rich, while I just barely get by. Maybe someday there will be a utopia where people no longer need money, nor have a need to work if they don't want to. Where people can pursue their passions and hobbies without limitation.",
            "[removed]",
            "I remember how I felt when I didn't have a job, I was a financial and interpersonal burden on the people who cared enough about me to take care of me, and I felt like I had no control of my life to change any of that. Wished like hell I could have a simple, relatively low-stress 9 to 5 so I could rebuild my social life and that would enable me to cover my own expenses so I could contribute with the bills and buy some cigarettes or snacks without feeling like a goddamn parasite.\n\nNow, when my alarm goes off and I have 30 minutes to get clean and dressed to get out the door for my hour-long commute to work, I count my blessings. I have some friends at work that are happy to see me and I have a little bit of money to buy things I want once in a while. I've graduated to merely being an interpersonal burden on the people who care about me.",
            "The secret is to half ass it. I don’t get paid for the work I do but the time I spend in the office. So I just Reddit most of the day. Chat with coworkers and with friends online. Just generally don’t give a shit. Watch the movie “office space”. It has an important message. You only get fired if you have an argument with your boss. Not if you are almost useless at work. Of course you will have to do some work to be almost but not entirely useless but that’s like one hour per day. \n\nAnd doing that gives you money for a pc, video games and more interesting activities on the weekends. \n\nDon’t take your job too seriously. It is not taking you seriously either.\n\nIt took me a lot of time and a nervous breakdown to realize that.",
            "I get what you mean, and I'd feel the same if I didn't do anything other than my job.  \nDon't get me wrong, I like my job, but what keeps me going is also especially everything else, so find what you like and do it.  \nCould be anything: sports, cooking, reading, etc... as long as you like it and you are willing to invest time in it, so that it satisfies you, and also improves you.  \nDon't do something just because it's easy like watching Netflix everyday (unless you are truly a big cinema fan)",
            "We are simply not evolved to live in the society we've created. Hunter-gatherers \"worked\" for an average of 4 hours every day doing their hunting and gathering. The resto of the time was spent with their families and friends: their tribe, the people that they loved. Sure, they had plenty of other stressors, including a shorter lifespan, high infant mortality, deadly disease and animals, etc., but they were external stressors that the mind had millions of years to evolve to deal with. HGs weren't worried about money or politics.\n\nOur HG brains are not equipped to deal with 50 hour work plus all the other shit in life. u/poop_wagon, you are not alone, and feeling like this is completely normal.\n\nMy best advice is to take up meditation, because the structure of society is not gonna change any time soon. \"We can't control what happens to us in life, but we can control the way we experience it.\"  \n\n\n*Edited for grammar*",
            "I have no idea what you do for a living, but (and this is just a suggestion) maybe you should try doing something either more physical or something that involves creating/building something? My most satisfying job I’ve ever had was being a farm hand. It didn’t pay well but I always felt contentment at the end of the day. Also, I’ve always felt better “mentally” after a long day of physically demanding work. Maybe I’m alone with this opinion but it’s worth a shot, especially if you’re at the point where you are questioning whether you should even be alive. A carpenter or house builder always seemed like they would be satisfying careers, as well. Just my two cents",
            "You must get to the point where you do not get up for the job. Unless you omit for the sake of privacy aspects of your life (which would be perfectly legit), it sounds like main part of your day is the job. My motivation improved when I got a cat (or you can get any other pet, I just like cats) and I knew I'm getting up to play and give food before going to work. Going home from work I would not be drenched in cloud of \"this job sucks\". I would be automatically caught in \"is the cat waiting on the window, or just sleeping\" and these small little things help to improve jo psychological hygiene. Getting some hobbies that are far from work and if possible active (sitting home with Netflix or games leads often to idle thoughts) helps as well.\n\nSo I get out because of cat(s) and airsoft. Try to find something to cheer you and keep you going as well.",
            "Because we have to. Sure I'd rather be dead but I don't want to die. That means I need food, water, and shelter which means I need money. That's where the job comes in. Some people luck out and are born with the drive others find enjoyment in work but most of us suffer through it. \n\nJust have to find your reason for pushing through the muck. Don't do it for family, it can lead to resentment. Me ? I need to be able to support my fishing habits. So while I gruel through a work day I remind myself of the fish. \n\nFind your fish and the work day might get more bearable",
            "I think you're not alone! I got to the point where I began to sob in the shower before going to work. The whole thing about worker alienation Marx talked about is real and in our time it's getting worse. Capitalism, whether you are for or against it, does have this effect on the working class, and all of us who aren't owners are workers plain and simple. The idea of a middle class , while a handy descriptor for some discussion of social values, is really just a way to keep the working class divided and our attention away from the owners who run society.\n\nAs workers, everything we do belongs to somebody else. Our creativity, our dedication, our altruistic intentions, all of it belongs to the owner class.  It's no wonder we feel lost and alone.",
            "Poverty.",
            "Oh I'd rather be dead than have a job. I hate this and everything about it. \n\nI'm $100k in student loan debt because my parents said college wasn't a choice and I had to do it or move out pretty much everyday since I was little. \n\nNow I just go to work because if I dont my dad gets stuck with all that student loan debt.",
            "I don't.\n\nI get out of bed each morning for other reasons. \n\nA job isn't one of them.\n\nI don't do my job because I like it. I do my job because it makes me money and that gives me the ability to do things that I do like.\n\nBut I would say, if you live in the United States, that economic system is very draining and heavy on the shoulders, it very much beats down their employees, no holiday, no days off, low pay, low benefits, it's truly awful and I don't blame anyone for being depressed in such a system, because it works hard to take away the benefits of life.\n\nI got out of bed this morning because I wanted to take a walk and think about things, life, the world, things I wanted to see and visit. Work is just something, one of the things, that I do. It's not who I am, or all that I do. I enjoy going out and helping people, so when I walk to work, that's an opportunity for me to find chances I can help people. Even if it's something as simple as picking up an extra apple and giving it to someone else.\n\nThat helps I think. Finding what does make you happy and just doing that. I feel rewarded from helping others and experiencing new things. Work just gives me money to do that.",
            "The older I get, the more I'm starting to think that the idea of a \"dream job\" is just propaganda.\n\nCheck out r/antiwork\n\nEdit: I really mean check out the suggested readings in r/antiwork",
            "I feel you on this one. Are you a creative type per chance?\n\nCreatives tend to be “free spirits” and feel confined and stunted in any work they do regardless of if they like or are good at it.\n\nDo you particularly have ADHD as well? That’s also a typical feeling ADHD people have (speaking as a person with ADHD who’s also studied psychology).\n\nHave you considered/looked into becoming self employed in some way? If it’s not financially feasible to be self employed, a temporary solution is to work a job that pays the bills but also allows you enough time to work towards being self employed. “A job to pay for your hobby” if you will. A small example is how my mother in law works a technical job but couldn’t care less about computers to supplement her ceramics shop and her horses that she loves. She works 12 hour days but only for 3 days and has 4 days to herself to do what she enjoys. She only has a high school diploma as far as I know so degrees aren’t even necessarily that integral (not useless, I have a degree and proud of it, but it’s not always necessary).\n\nI hope you can find your passion. If you’re under 30, this is quite normal to feel. We go through a few life crises throughout our lives and I learned in one of my psychology classes that the average adult will change careers at least 7 times in their entire lifespan. \n\nIt’s annoying and frustrating but don’t give up! Just keep trying to find yourself and worst case scenario, there’s always retirement to look forward to.\n\nSending you positive energy on your journey!",
            "If it wasn’t that I feared death I probably would’ve committed suicide by now. Sometimes I think to myself what’s the point in life. But you have to remember life isn’t just your job. You have friends and family and hobbies. \n\nI think quarantine has taken a lot of these things away from people and that’s why they are thinking like this",
            "I never understand why people get upset that others don't want to go back to work and want UBI. Like isn't that the goal? To make life easier and better for everyone.",
            "Because I'm a man and you've got to get shit done. \nI have a wife and kids and a 35 year mortgage.\n\nI work in a coffin factory, we're (me and another guy) now making 260 coffins a day.\nIts heavy, repetitive work with awkward half-bending motions, and constant hammering.\nMy wrists, elbows and back are fucked and nothing we do is enough. They've got us on overtime and coming in on Saturdays, \n\nWe are absolutely dead inside. \n\nWhat are you gonna do though, live in a cardboard box?!",
            "Because job give money. Me like money.",
            "No one ever told me how low the actual bar was in a job until I started my career. I had high pressure parents, I got good grades and scholarships and all that plus a job in the field of my degree. My professors told me day in and day out you had to be the Best and win awards otherwise why are you even taking up oxygen?\n\nOnce I stopped pretending I wanted to be the Best at my job, it got easier. Once I realized my Mediocre could beat many people’s Best, it got easier. Once I realized the consequence of polite indifference was nonexistent, it got easier. I stopped putting pressure on myself to attempt performative greatness or climb the ladder. The ladder climb still occurred!\n\nI genuinely like my job. But I don’t love it. I have enough distance from it so it doesn’t control me. I go home and I play video games and spend time with my family. The job is just a thing to keep me fed and flush with video games and my stuff repaired and working. I do enough for my personal level of achievement and that’s (so far) been enough for my employer too. \n\nNot everyone is supposed to be an entrepreneur with big ideas. Some people need to be cut loose and have their own freedom to explore tasks on their terms. No right or wrong way about it. You didn’t Do It Wrong, friend. You just learned that your current job style isn’t right for you. That’s okay. Maybe you can find a way for work to be Just Enough, because abject misery just breeds contempt. Or maybe the Outside of Work becomes the beacon that makes the drudgery worth it.",
            "I absolutely love not being homeless and/or starving so I go to work and make money.",
            "You've been mistakenly informed over the course of your lift that you're supposed to be fully fulfilled by your job and your accomplishments. This is not true, and will only lead to disappointment and the need to constantly find the next high of achievement.\n\nYou are one of billions of humans, and you will only find happiness when you find your place within that body. Build relationships and find out who you are with others, making the perfection in that your life's mission instead of whatever field you've chosen.\n\nYes, bring your full self to work and find a job in which you can find some meaning, but that is not your goal. Your goal is to love others and live your life.",
            "Most of us have jobs so we can do other things that we enjoy doing.  The reason why they pay people to do jobs is because nobody wants to do them for free.\n\nIt's easy for someone to look down on many jobs as something you wouldn't want to do, but a lot of people have no choice in the matter.\n\nWork to Live not Live to Work.",
            "[deleted]",
            "Have you ever had a manager you liked? It makes a big difference.",
            "Having to work sucks. But I'm a lazy piece of shit on my days off, so working brings a slight sense of being productive, which I need. Plus, like others said, I have people that depend on me. Having an income allows for a better home, and the ability to travel and do things we enjoy.\n\n\nI'm an ICU nurse and I work with a group of people that make the job bearable. We get along well and have a unique, morbid sense of humor. Going to work and being in shitty situations with people I like makes it's less shitty and almost fulfills that human need to socialize. So yes it sucks, but at least I get to hang out with friends while doing it.",
            "a ) I enjoy my job, which is unusual it seems but it's a field I love, with people who are great, solving interesting problems that are neither too hard nor too easy. \n\nb ) I have a lot more going in my life than just my job. I have a tonne of hobbies and a great pack of friends and family that give me fulfillment and joy. Sure, life where you *just* work seems pretty bad, but thankfully I and many others have a few other things going on than just sleep, eat, and work.",
            "I've always been passionate about not starving to death in the streets.",
            "It's not normal or healthy to get no sense of satisfaction from your efforts, and want to die than work. It sounds like perhaps you might be suffering from depression?",
            "As an optimistic nihilist, my advice would be to just have fun wherever and whenever you can, so long as you don't prevent anyone else from doing so. Currently I'm going down a career path that doesn't necessarily appeal to me, but it is something im good at, and it's something that will enable me to do more fun things with/in my life and remove many worries brought on by daily life. The kid in me would say to keep searching until you find your dream job, but at some point, and in some situations, that's just not the best way to go about your life. If you're focusing on your job, then perhaps it's taking up to much of your consciousness. Do what you love, and when you can't, work towards it.",
            "Maybe see a psychiatrist. Anxiety, depression, ADHD and other conditions can cause these feelings",
            "I tried for a decade and it just got worse and worse every day. Asshole bosses, out of touch corporate, sycophantic coworkers, pretentious team building exercises, making our lives harder just for the hell of it, every employee acting like they will be ceo one day if they kiss the right asses... I hated every single aspect of office life.\n\nSo I cut my expenses, moved back home, do a little part time freelance stuff and my stress levels have gone from 98% to almost nothing. I don't have plans of starting a family or buying fancy things, so what's the point in busting my ass and making myself miserable. Work may be life for a lot of people, but it's just not the life for me.",
            "I compartmentalize. I go to my job and basically go into robot mode. Just get it done. Then I leave work and go back into human mode. I just try to enjoy my time away from work. It’s a balance and it’s not exactly ideal but I look at it like I am privileged to have the opportunity and ability to work.",
            "I completely understand what you're saying here. I [24M] have been working ever since I turned 16. I moved out at 19 and have had to work full time ever since. I have been absolutely miserable at every single job I've worked at. It felt purposeless doing a job I didn't give a shit about. Plus, if you add a dickhead abusive manager who treats you like shit into the equation and he will make going to work everyday absolutely miserable. It's the equivalent of waking up every morning and driving directly to you're bully's house just to hangout for 8 hours straight.\n\nAfter bouncing around from job to job I began feeling helpless and like something was wrong with me. I've walked out of multiple jobs due to the fact that I was so miserable going into work everyday and doing something I wasn't passionate about. That's when I decided enough was enough and started on my path to get an education. I'm now studying computer animation and I am happy to say I am chasing my dreams and will one day be working in a job field I am truly passionate about.  In the meantime I found a job that actually works for me and I'm not actually miserable at. I get to work alone (no boss, no manager, no coworkers) and listen to interesting podcasts all day. I feel like I have more control over my day and my decisions and I'm trusted to do my job while no one is watching. It's the perfect job for me to be doing while I'm getting my education. Things are finally falling into place for me.",
            "Pixar’s new movie Soul describes this perfectly",
            "I see it as a duty to society. In the end, others are working fulltime to  conceptualize, test, manage, create and finish products you can use. In all industries.Your car. The house you grew up in. With materials farmed, processed and assembled by workers. By regular people (if your father didnt build it with his own hands). \n\nFor example. I recently purchased a VR headset. Researched, developed and materials gathered and processed by hundreds if not thousands of people in the process. I've paid it with my hard earned money. That i got for being productive for society. Its not much. I dont even know where exactly it ends up but its just some industrial material thats gonna be usefull for someone somehwere else. Its a giving and taking.\n\nPeople have to stop seeing themself as something special. Were all cogs in a big community called society. The ones bigger, others smaller. Its up to you by how much you want to return to society.",
            "I think my highscool physics teacher gave me the best advice I've ever been given, and something I try to follow. If you *can* find a job you love, that's great. If you *can't*, find a job that gives you the ability to pursue the things you love.\n\nI don't like my job, but I do like that it pays me enough and gives me enough time off that I can do the things that I love to do.",
            "Easy. I like my job, my coworkers and bosses are cool, and the pay is decent.\n\nIf you're asking me this at 5AM, then the answer instead is \"Because I don't have any other goddamn choice\", \"It's too early for this Shit\", \"Stop talking to me\", or \"fuck my life\".",
            "You touched on a couple of things and I think k this is mostly a philosophical question: the answer is highly subjective since it depends on several factors, including your standards of comparison, but is in no way limited to just that domain, work. You could literally swap it for any activity and the question will stand. \n\nHave you heard the myth of [Sisyphus](https://en.m.wikipedia.org/wiki/Sisyphus)? Long short, it's a myth about a guy who was condemned by the gods to roll a boulder up a hill only to roll it down once it got all the way up, and start all over the following day. One of the morals of the story is to be able to find meaning in the most mundane tasks.\n\nIt also depends on personal preferences, some people like work, some people like specific lines of work, and others simply don't. It's never as simple as the FB quote \"find something you love doing and you'll never have to work a day of your life\". It simply may be true or not.\n\nThen it depends on what you're comparing it to. What metrics do you use to measure something that you **enjoy**? How does your understanding compare to something that you **abhor**? When do you consider that something has crossed the threshold into being abhorrent? I think people naturally don't spend much time thinking about this but I think it helps.\n\nBut I also think the question can get expanded to other areas, such as hobbies, school, entertainment, relationships, and ultimately, life.",
            "Here's a good question to ask: What would I rather (prefer) to be doing with my time? - other then be dead - and its okay to say something that doesn't make you money, like watching TV.   \nOnce you figure out that answer, its going to guide you further into what a more enjoyable and fulfilling career, hobby, or pastime will be. If you really would prefer to just watch TV, what programs do you watch? Why do you like them? What about them are interesting?   \nDo you only watch drama? Fantasy? Do you like fantasy stories? Have you tried writing before? Etc. Etc.  \nToo often are we forcefully given this option: What do you want to do for money? and as necessary as income is, it doesn't NEED to be fulfilling either. Income is the requirement for living in a society of luxury, fulfillment is what happens when you pursue your interests and passions.",
            "It's worse for me... I had my dream job, never looked forward to Friday for years, and then the company goes bankrupt because the CEO is a goddamned moron (fuck you, dumbass piece of shit).\n\nNow I have a typical \"I hate my life\" job while I long for the days of my dream job.",
            ">How in the hell could a man enjoy being awakened at 8:30 a.m. by an alarm clock, leap out of bed, dress, force-feed, shit, piss, brush teeth and hair, and fight traffic to get to a place where essentially you made lots of money for somebody else and were asked to be grateful for the opportunity to do so?\n\nCharles Bukowski, Factotum (1975)",
            "Union job or own your own business so that you get every ounce of equity paid back to you eventually for your hard work/overtime. \n\nThis is how you function in a capitalist economy if you don’t want to be a wage slave. Good luck brother.",
            "Sadly it’s this rational that people hate their jobs and that’s acceptable as the honest reason that most managers suck the life out of us and companies get away with it. I believe that if you have passions and you know where your deeper ones lie, you should work toward working in that field. I have a history of sales jobs that I’ve honestly always hated sales... but it’s what currently pays the bills while I return to school yet again to pivot my career yet again from tech to being a therapist. I’ve avoided my whole life getting the degrees necessary, afraid of the debt as a survivalist and previous foster kid, I didn’t want the debt and wasn’t patient enough to press on. Now that I’m in my thirties I’m much better as a student and know that, officially, after working in many industries and trying to find happiness in many types of positions, that I should’ve just sucked it up and pressed on to be a psychologist to help people with PTSD. Sometimes it takes guts, courage to try again, ignoring the fear of failure and even just doing a couple classes a semester in your free time from work. I’ve been doing it for several years and I will continue doing it for the next career change bc I refuse to believe we have to be miserable to make money. Pretty much everyone I grew up with in my homestate stayed there. Still works at the same bar and grills, prioritized love and having babies over a passionate career. Meanwhile people like me left. I encourage whoever feels this way to yes, continue to find joy in your hobbies... and then see what hobbies have stood out to you your whole life as bringing you that burning passions, that innate joy, things you could talk to anyone about and enjoy the convo. Those are where you need to point to. That’s your direction. Now thrust yourself out of your comfortable situation and do what it takes to get there. That’s you dedicating yourself to self care and finding joy. That’s the meaning of life. Don’t give up!!! The universe hasn’t given up on you.",
            "I genuinely have no idea. I ask myself this every day. I don't have friends, I hate my job, I don't enjoy being alive. But I keep going. Maybe it's a vague hope that things might eventually get better.",
            "Mmmm thanks for bringing that buried thought to the forefront",
            "It sure beats starving to death",
            "You sound like you need a hug."
        ]
    }
]