[
    {
        "post_id": "uy2y6x",
        "author": "IAintNotPedobear",
        "title": "Do American children really 'swear allegiance' to the American flag?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/uy2y6x/do_american_children_really_swear_allegiance_to/",
        "score": 17190,
        "num_comments": 4052,
        "created_utc": 1653553940.0,
        "selftext": "It just seems so... Cult-y, Y'know?",
        "permalink": "/r/NoStupidQuestions/comments/uy2y6x/do_american_children_really_swear_allegiance_to/",
        "comments": [
            "We say the [Pledge](https://en.m.wikipedia.org/wiki/Pledge_of_Allegiance) of Allegiance in schools but nobody I went to school with put much thought into the words we just repeated it by rote. \n\nKids do have the Constitutional [right](https://www.freedomforuminstitute.org/first-amendment-center/topics/freedom-of-speech-2/k-12-public-school-student-expression/pledge-of-allegiance/#:~:text=Conclusion,speech%20doctrine%20requires%20as%20much.) to sit and be quiet instead of participating.",
            "I am in Asia and I used to go to an American school. The American kids did their pledge after our national anthem and pledge. \nWhen I went to uni I noticed that they only played our anthem during ceremonies and there were no pledges.",
            "In Texas they have us swear to the American flag AND the Texas flag. Two separate swears  \n    \n     \nedit: This is not all schools, your Texas school district probably had different guidelines for the pledge, if they did it at all. It's not something new, it just depends on your district. I know plenty that do and plenty that don't",
            "Yes. Every single morning without fail. I'm reading in this thread that it's not legally required, but when I was a kid (in the 80s and 90s) you'd get in big trouble if you tried not to say it. I mean big trouble by kid standards of course; yelled at by the teacher and sent to the principal's office for example.\n\nOnce we had a substitute teacher who was an old veteran and he became absolutely enraged when a kid in the class tried to sit out the pledge.",
            "Yes. Went with my high school to the US to see our penpals (honestly great way to create bonds across oceans , still friends with them a decade later). \n\nFollowed my penpal to her high school and was quite embarrassed because It's not something we do in Europe and I didn't want to be disrespectful. They had their hands on the chest and I felt it was weird/hypocritical if I did so but I felt it was disrespectful to stay in my seat so I just stood up and waited.",
            "I remember being in elementary school and watching a news program like 60 minutes and there was a girl who got in trouble because she didn't want to say the under God part of the pledge.",
            "Some schools even sing the national anthem right after saying the pledge",
            "I haven't seen anyone post the actual pledge, so here it is for the people across borders.\n\n\"I pledge allegiance to the flag of the United States of America, and to the republic for which is stands, one nation, under God, indivisible, with liberty and justice for all\"",
            "They *say* it. They don’t *mean* it.",
            "I went to a lot of schools and it was generally phased out by high school (ages 14 to 18). Almost every school has the kids younger than that pledge every morning first thing.",
            "No...... You 'Pledge' allegiance. \n\nI stopped in high school. You get weird looks in southern schools sometimes as a result. Even from the teachers.",
            "Even creepier was the [Bellamy salute](https://en.wikipedia.org/wiki/Bellamy_salute) that was supposed to be done while pledging allegiance.\n\nConservatives would be aghast to learn that Bellamy, who wrote the pledge, was a socialist.  And even though he was a minister's son, he did not include the \"under God\", that was inserted during the Red scare years.",
            "Yes. Although many do not understand this is an optional thing. I realized about 9th grade that no one was gonna do anything if the weird kid in class decided, screw allegiance today, and then pass around a form to start their own militia instead. (I really did that, I was a very strange teenager, what's stranger people actually signed up)",
            "Bruh I’m in high school and I still do that every morning",
            "As far as I'm aware this usually is a thing we did in schools and not really anywhere else. We had to do it every morning at the start of the school day. It was weird as hell. Not to mention I went to public school and it states in the pledge \"one nation under god\" as if everyone believes in the same God. Fucking weirdo shit man.",
            "It is culty. Even if they don't force you, it is. You could be punished if you did not both stand and hold your hand over your heart while saying it every morning. It depends on the school of course. Some don't enforce it as much as others\n\n\nI only saw kids get in trouble in kindergarten/first grade. Later on I don't recall anyone getting in trouble for it but everyone did seem obliged to do it anyway despite no one really caring.",
            "Yeah, it's culty. Even more weird that the \"under God\" bit was added way later.",
            "In Australia they would make us sing national anthems and the school pledge every assembly. It's not just the USA that does weird shit like this.",
            "Yes, daily. DAILY.",
            "The funny thing is the pledge was just a marketing ploy by a baptist socialist dude to sell flags to every classroom in the US in the 1800s.  The Founding Fathers would have found the idea of a forced pledge of loyalty to be the complete opposite of what they stood for.  \nhttps://people.howstuffworks.com/culture-traditions/national-traditions/pledge-allegiance.htm",
            "Most but not all, yes. But it’s not expected to mean anything; the kids don’t pay attention to the words. I didn’t put any thought into parsing them until I was in my teens. It’s certainly not supposed to be *binding* or anything. \n\nIt’s just tradition for tradition’s sake. Dumb, but I’ve yet to meet someone who thinks it should be taken seriously as a real “pledge.”\n\nDon’t get me wrong, it’s weird, but it’s not really thought of as anything other than “just the routine.”",
            "Depends on where you're at (we only did it on elementary) and yeah it is. It's not like most kids actually pay attention to what they're reciting since most don't know what its even about. Do you not do this as an adult? \n\nEvery country is a cult. There's levels to it.",
            "Every. Single. Day. It's a morning routine in a lot of schools.",
            "I haven't been a student for about 20 years, so I don't speak for the children of today. When I was a kid, we said the pledge every day, as early as kindergarten. We were so young and it was part of a greater set of new experiences (school itself) that we all just took it as part of the routine. Personally, I had very little understanding of what it even meant, and just mindlessly repeated it. For the first two years or so I thought the phrase \"for which it stands\" was. \"for Richard Stantz,\" who I just assumed was a civil rights hero or something.  \n \nBy high school I still stood for the pledge but stopped reciting it, but not out of protest exactly--I just noticed that the our teacher didn't expect us to (some teachers didn't even stand themselves). In middle school, I had a classmate who conscientiously refused to say or stand for the pledge. I shamefully admit that at the time, I thought it was a little fussy--\"just do it, what's the big deal?\" I had thought. But I, and no other students or even teachers, ever gave him trouble for it. Much later in life, I reflected on this and realized how the daily pledge was both ineffective (it was an automatic ritual that wasn't taken to heart or even consciously thought of) and arguably effective (I didn't question the pledge and, for a time, balked at those who did).  \n \n \nFunnily enough, I *did* balk at the national anthem at sports games and certain call-and-response prayers in church--probably because neither were ingrained at a very early age or done on a daily basis.",
            "I never cared much about religious stuff like God. I just replaced that word with Satan whenever I did the pledge of allegiance in school.",
            "Yes and in hindsight it was pretty culty",
            "Yes. It's like working for Hydra.",
            "Yes although there is no requirement to actually perform the pledge. As a teacher I have never done it and generally the half of the class that even pays attention to it just mumbles through it so no one really cares.\n\nYou're right though it's incredibly creepy and hypocritical when we complain about other countries brainwashing their citizens with no self-reflection. Personally for me though it's more about not feeling any pride for this country as of late.",
            "When I was in elementary and middle school, we did the pledge of allegiance every Monday with the entire school and we’d stand outside in the recreational area of our school ground. They had it over the loud speaker too. If we didn’t do the pledge or goofed off with our friends (like children do) we would be disciplined with detention, or after school gym scraping. In highschool, it was more chill. I don’t recall ever doing it. But every Friday football game during the halftime show, we had an aspiring choir kid sing the national anthem and we’d all stand up and stay quiet. National anthem is much more normal than the pledge of allegiance though. Possibly irrelevant info: Attended public school in CA",
            "I don’t understand the beef with this. It’s about unity to one’s country and patriotism. That’s the goal of every country’s national anthem. I don’t think this is unique to the US either, but it is common in schools as the US has a very patriotic culture. I don’t find anything wrong with teaching people and especially young people that they are apart of the country through pledging the flag. Allows people and young people know at a young age that your neighbor should not be a stranger, they are a fellow citizen whom you should look out for.",
            "pledge allegiance, but yes. and yes.",
            "Depends on the school. Some do, some don’t. It’s more ceremonial than literal, you’re not like legally bound by saying it.",
            "It was started to push flag sales. Nothing more America than that",
            "Yes, all together in unison. Yes, it does sound like a cult. Yes, I don't actually say it anymore. Just go through the motions.",
            "It's funny how we have separation of church and state, yet some people treat the flag like it's a religion.",
            "Yeah, I’ve always found the pledge of allegiance to be an odd and uniquely American thing. I am from the US, born and raised, and I have yet to hear of another country with a pledge of allegiance.",
            "Yes…at least 20 years ago they did. \n\nMy dad told me I didn’t have to and told me that if I wanted to say it I didn’t have to say the “under god” part. \n\nIf I had kids, I’d tell them not to. Why you ask? Because it American not everyone has equal rights and this definitely isn’t a “free” country.",
            "Yep... and if you go to Christian school you get to pledge allegiance to the Christian flag, and the Bible. Three... every f-ing day.",
            "Yes.\n\nWe have the Constitutional right not to, but I did it because I didn’t know that then and because I didn’t want to seem weird(er).\n\nNevertheless, I never said the “under God” part (I’m an atheist).",
            "I was taught in school that evolution and global warming were lies designed to discriminate against Christians. In science class. And yeah, also swore allegiance to the American flag. My hometown was 10/10 a cult.",
            "It honestly depends on the school. \n\nIn Elementary - Middle School we did. But it was optional.",
            "Yes. And it is culty. And no you can't legally be punished for not saying it. Yes you're punished if you don't.",
            "“And to the REPUBLIC, for which it stands!”... \n\nAnyone else remember that line?",
            "Yes. Right before active shooter drills.",
            "Yes. It is a cult",
            "Yes. And yes, it is. America needs to realize it’s not the 50’s and we don’t have to assert our superiority over the godless Commies anymore.",
            "What do you mean by that?\n\nDo they say it? Yes\n\nDo they mean it? Probably not which is why most classrooms sound like mumbled murmurs of the pledge. \n\nBut yes, very culty, we prefer our indoctrination to start young",
            "It felt like it was more in remembrance of the people before me who sacrificed everything.  That is what I got out of it.  Definitely not cult like.",
            "In Texas we would turn to the Texas flag and swear allegiance to that one too. We were also reminded occasionally that Texas was the only state allowed to fly their flag at the same height as the US flag.",
            "When I was in school it was \"Pledge\" not \"Swear\"",
            "Also fun fact, texas has its own pledge of allegiance, so in texas public school we had to say the US pledge and then the texas one. I didn’t realize this was not normal until I went to college",
            "Honestly, I always kind of liked it. It makes the point that the flag stands for \"liberty and justice for all\" and the ideals of the Republic, so if you pay attention to the actual words, it's more than empty flag worship. The United States is basically held together culturally by this kind of indoctrination - we don't have a shared ethnic history to define our identity, as the European nations do. It's democratic ideology that makes you an American. Until Trump, that is - he and his ilk are trying to give us a Euro-style ethnic identity, maybe so they can pretend those core values don't matter.\n\nI heard that the God thing got shoe-horned in there by anti-Communists in the 50s, could do without that creepy part since it doesn't fit.\n\nEdit: which is interesting, since it was originally written by a socialist (Francis Bellamy) - from Wikipedia:\n\n\"Bellamy's original Pledge read:\n\nI pledge allegiance to my Flag and the Republic for which it stands, one nation, indivisible, with liberty and justice for all.\\[1\\]\\[24\\]\n\nThe Pledge was supposed to be quick and to the point. Bellamy designed it to be recited in 15 seconds. As a socialist, he had initially also considered using the words equality and fraternity\\[22\\] but decided against it.\"\n\nhttps://en.wikipedia.org/wiki/Pledge\\_of\\_Allegiance",
            "A cult removes your identity until its the only thing you are. The way we did it was more of a respect thing. We remember those who died and what they fought for, especially because my grandfathers have fought in the wars since the revolution. That's how it was explained to me.",
            "My youngest hated doing so in school. Shes a deeper thinker than I am.",
            "I never even thought about it till recently.  Yes, we had to pledge allegiance to the American flag.  We are also supposed to stand with our hand over our heart when an American flag passes by during a parade.  It does sound like a cult.  It's been bothering me.  If we are free, why do we do it?",
            "Every morning from age 5-18 in school. Across the country. We would stand during the announcements, place our right hand over our heart, and recite in unison:\n\n“I pledge allegiance, to the flag, of the United States of America. And to the Republic, for which it stands, on nation, under God. Indivisible, with liberty and justice for all.”\n\nI remember our elementary school principal tore us a new one (I think grade 5?) because a few students in my class replaced some of the words with nonsensical ones. She screamed at us, took away recess for a week, and wrote a letter to all of our parents about respecting the flag and our founding fathers.",
            "The school I teach at doesn't do the pledge at all. Just the other day my students and I dissected the words (we are studying argumentative essays) and they gave a collective \"nah miss\".",
            "This question has been asked at least 1000 times on this sub.  You're not progressive or edgy.",
            "[deleted]",
            "Took me a long time to realize I didn't want to say it- and I'm pretty obnoxious in my \"standing up for what I believe\" attitude \n\nWhen my son started school I didn't say much at first cuz he was 5 lol but when he started back after they were shut down for the pandemic I was like look, dude, you don't have to say this. Listen to these words and decide if you want to say it. You don't have to make a big deal- you can even pretend you're saying it- but I'll back you up. (He is very shy and wouldn't want the attention of sitting quietly) \n\nHe just told me he never says it but he stands. \n\nWhen I worked for Girl Scouts we had a meeting once where we all stood and we were dosed to say the pledge and the GS promise- the woman asked to lead it just calmly said \"oh I don't say that- but I'll lead the promise if you want\" and it was totally no big deal. \n\nMade me realize not everywhere is as weird about it as high school.",
            "Yep. It's incredibly culty and It's just one step to indoctrinating us all into a life of compliance and following orders.",
            "Anyone else think this is brainwashing/propaganda?",
            "Yes, to the flag and to the republic for which it stands.",
            "It wasn't until I was in college talking about it to international students that I realized how insane it is. At the time I abstained from the \"under god\" part of it, but otherwise went along with it to avoid punishment and ostracism.",
            "yes, and under god too. So sucks if your atheistic, polythesist, or spiritualist.\n\nEDIT: i think spiritualist might be something different, and what i was thinking of was Animism.",
            "Bro this is America, the fact that we have a pledge of allegiance is the least of our issues right now",
            "Do Muslims really pray 5 times a day?\n\nSeems kind of cult-y...amiiright?",
            "We are supposed to say it daily. I typically just 'forget' and blame it on wanting to maximize teaching time. Not one child in 8 years has complained or asked to say it. That being said our state leaders push it hard. One of the places I may have to give in eventually to keep in good graces at my job. The few time 'we' have said it, I am the only person who does. I also typically like to follow the pledge with a shirt reading from a reformer or activist from someone connected to my community.",
            "Our teacher could not care less whether we do it or not",
            "It isn't legally required for them to do so, most of the time the younger kids do it just because an adult told them to and it's part of a morning public school routine. But by the time we get to high school most of the kids are sitting down in their chairs and ignoring it lol. But I will say it both depends on the state and individual experience, so other people's pov's might be different. But I do know it's a constitutional right not to be forced to, some teachers in deep red states might try to punish the student for it but I'm pretty sure if they make a stink about it and point that out (preface by saying they shouldn't HAVE to) they'd get out of trouble.",
            "I'm a substitute, I would say about half the time the class or school does this",
            "Yup.",
            "Yes and in Texas to the texas flag too\n\nI pledge allegiance to the United States of America indivisible by all one nation under god.\n\nI pledge allegiance to Texas one state under God , one and indivisible\n\n\nRecited from memory and I have been out of school since 2012",
            "When I was in public elementary school in New Jersey, circa 1961, after the Pledge the teacher led us all in prayer. Failure to comply earned you a trip to the Principal's office. \n\nAfter SCOTUS ruled that mandatory prayer was unconstitutional, we only had the pledge. When a student asked why reciting the 23rd Psalm was not allowed, but saying \"Under God\" was mandatory, he was sent to the Principal's office.",
            "I went to a Christian school and they had us say pledges to the US flag, the christian flag, and the bible.",
            "Well we use the word 'Pledge' but basically yes.",
            "Yes. I got suspended in my jr year of high school for refusing to stand during the pledge and refusal to say it.",
            "It's peer pressured into you and part of a daily routine of a USA school. However the ACLU has pushed back against this and technically you can opt out if you want to deal with the bullying and peer pressure. Looking back on it, it's very much some cultish MLM style bullshit they pander to the naive and vulnerable. If I have children, I'd tell them to do what they want if they thought it was dumb.",
            "Yup. You can ask to not participate or stay sitting down in a large crowd. Ive come to find it as a joke. \n\nIn some places you can be punished for not doing it. Such as schools in places like texas or florida. I remember my brother got sent home once because he didnt want to, and argued with a teacher about it. \n\nAnd yes, very culty.",
            "It's encouraged, sometimes strongly, but it's not legally required. Kids can stay seated, or stand silently if they want to. A previous supreme court decision allowed that.\n\nIt is very cultish though. Even as a kid, I thought it was weird and rarely participated.\n\nEdit: I also work in a middle school, and they only do it about once a week here anyways. Maybe it's a regional thing though.",
            "Yes. By the constitution it's entirely optional but some adult weirdos think it's ok to force them to do it.",
            "I think it depends on whether you go to public or private school and where you live. I remember doing it in public school in the 80s and 90s, but I never had to do it when I went to private school. I also went to public school in Berkeley, California in the 90’s just before I switched to private and I can’t remember having to do it there. I did do it in San Francisco and I think also in New Jersey in the 80’s.",
            "Yup did it from K-12",
            "In my private school we had to pledge allegiance to the US flag *and* the christian flag.\n\nIt was just as fucked up and weird as you would think, as were the people that didn't see how fucked up and weird it was.",
            "Yep! Then they have to continue their day, wondering if they’ll be shot while taking a quiz.",
            "It's law to do it everyday in the state of Missouri in schools. As a Christian I don't do it and find it very hypocritical to pledge to a flag. It is an object and honestly feels like an idol.",
            "Brainwashing kids to be patriotic essentially.",
            "Can you refuse to do this?",
            "yes and when i stopped doing it in high school i would get harassed for it by other kids",
            "They start us out in kindergarten. My schools had all the kids do the Pledge of Allegiance while standing. At the time, the absolutely awesome kids would refuse to stand. (Not in kindergarten per se, but later in school years). I didn’t understand why at the time. Now I think those kids were smart and gangster",
            "Yes they have swear allegiance to the American flag. I never have which always put me in trouble in school but I always sat quiet until i reached highschool when my teachers and principal asked why and simply replied america is filled with hypocrisy. They asked why and I told them that’ll be your assignment not mine. And went back to class. They tried to suspend and expell me and i contacted my uncle who worked at the board of education and was friends with the boss. And there was a whole case. So ever since then in my highschool they made it an option to either pledge the allegiance or to stay quiet and be respectful to those who did and was never much of an issue afterwards.",
            "I went to a Christian school and had to pledge allegiance to both the Christian and American flags in the morning.",
            "We don’t swear allegiance, we pledge it",
            "“I pledge allegiance to the flag of the united states of America, and to the republic for which it stands, one nation, “under god” indivisible, for Liberty, and justice for all.” \n\nThey added the “under god” bit in the 50s because communism. \n\nHad to recite this every morning in elementary and middle school. And most of high school. They broadcast it over the school intercoms.",
            "I don't know anymore. We did in the 80's, I can tell you that.",
            "Well it’s called the pledge for one, and yes. And sure it is culty but correct me if I’m wrong military service isn’t required here like a few other countries so in theory it’s culty with no forced drinking of the proverbial koolaid.",
            "Was just saying this exact thing to my wife a week ago. It is Very culty.",
            "Yes, they do. In Texas, they also pledge allegiance to to the Texas Flag",
            "I (27M) haven't said the pledge of allegiance to the flag or for any other reason since kindergarten when we were each forced to take turns leading the class in indoctrination",
            "Fun fact, growing up in Texas I had to swear allegiance to the American flag and THEN THE TEXAS FLAG.",
            "I think this sketch sums up how we think of it as americans... we know it's culty and stupid as fuck\n\nhttps://youtu.be/GiCaqA0ngRc",
            "Yes. And then there's the \"one nation under god\" part. And then there's the forced pageantry of the national anthem.\n\nNow, theoretically, you have the right to be silent and not do it. But my experience was no one told you that and no one told the teachers that (or they knew and didn't care). I got detention twice for not standing during the anthem twice until my senior year in high school when I found out.\n\nI'm sure there's be some teacher led bullying if I were younger and refused to do it in class.",
            "Its Pledge not Swear",
            "From grades 1-5, they also forced us all to march around in single filelike little nazis, singing war songs every spring.  \n  \nIndoctrination is a motherfucker.",
            "According to my American husband, yes. And I think it is cult-y, too. I was never ask to swear the allegiance to flag in my home country.",
            "The lead a pledge of allegiance, but there have been Supreme Court cases that reaffirm that no citizen is ever required to take a loyalty oath. \n\nI was born and raised in the US. I view my relationship with my country the same way that I view a job. I’ll play by the rules, do my part, and take advantage of every benefit that I am offered.\n\nBut if I get a better offer somewhere else, I’ll definitely be putting in my two week’s notice and heading out.",
            "Yes and to the USA and to the republic for which it stands.",
            "Interesting to see so many people say its optional. When I was in highschool (around 2006) it was technically optional, but teachers would argue with you and the kids would give you shit if you sat down. There was a muslim girl in my grade who wouldn't participate; everyone, including teachers, harassed her for it. I started to sit too in support and it did not help lol they just harrassed both of us.",
            "This sounds like brainwashing...",
            "I went to a private catholic school and we had pledge allegiance and say prayers every single day while standing. I remember being called out for sitting down or not saying it. I had teachers who understood that it was okay, but I got threatened and got detention a few times by the strict ones.",
            "Where i live everyone has to sing the national athem before starting clases.... it was anyoning and most of the time i just skiped it.",
            "Yeah friend. Every morning from elementary school through high school",
            "Wait till you hear about this thing called the \"second amendment\"  now thats stupid.",
            "When I was in school in my small rural town from 98-2011 everyone always stood up and placed their right hand over their heart and recited the pledge. I worked at an inner city high school in 2020 and not a single kid stood up, which I think is a good thing. It’s dumb as hell to pledge allegiance to a piece of fabric.",
            "We didn’t really do this in my classes growing up.  Maybe a few times at like big events and we learned it.  But We were not forced to participate.  We have a constitutional right to freedom of speech, including not speaking.",
            "Doesn't matter. Talk about anything negative/criticism on the US and you will hear it. It's definitely 'culty' whether people admit it, swear to the flag or not. The US definitely has a big upstanding for its country",
            "/r/AskAnAmerican is a great subreddit if you are curious about the USA. This sub works too, but just letting you know.",
            "Yes we do every morning and most schools will reprimand you for not participating",
            "We pledge allegiance to the flag\n\nAnd to the republic for which it stands",
            "Yes, this question has been asked and answered many times before and many times this week as well, I wish redditors learned how to use the search function.\n\nTo reiterate things already stated in previous threads\n\n1) it's not only the US that does this\n\n2) It is totally optional and not legally required though when I went to school you may receive odd looks from your classmates. To be frank you appear to be \"THAT\" guy \n\n3) It is a pledge not a swear\n\n4) In Texas you do both the texas flag and US tho its again optional.  \n\nI don't know why this seems so weird anyways don't they do this at most major sporting events too?",
            "Since 5 years old yes and it’s required",
            "If by \"swear\" you mean \"pledge\", then yes. But as we've learned the past couple of weeks, \"pledge\" is the same as \"donate\", so yes, American children donate allegiance to the flag.",
            "Everything is a cult if you even barely scratch the surface. But yes, as an American it’s one of the largest failed cults ever. Nationalism died about 20 years ago over here and only people over 50 fall for that shit any more generally. Minus the obvious outliers. You’re always gonna have a few Alex Jones’ drinking their own flavor aid. (I chose flavor aid because it was the actual brand used in the Jonestown massacre and I refuse to disparage the glory that is kool-aid with malicious false sayings.)",
            "no one means it when they say it",
            "The pledge of allegiance is a pledge, not really a swearing.\n\nBut also, not really, it's just a thing you do, it doesn't mean anything outside of indoctrination.",
            "Yes, and people looked at me weird when I moved from another country and finished high school here and didn't pledged allegiance. Not my flag.",
            "Kids being forced to say the pledge in schools pre-WW2 is even funnier. Back then, you would give the \"Bellamy salute\" while you said it. And then hitler came along and ruined the Bellamy salute. I was in school 1970-1982 and we never did the pledge."
        ]
    },
    {
        "post_id": "o8tjw2",
        "author": "dovakihn101",
        "title": "Is it completely normal to have no interest and intention on having a kid?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/o8tjw2/is_it_completely_normal_to_have_no_interest_and/",
        "score": 17179,
        "num_comments": 2797,
        "created_utc": 1624784937.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/o8tjw2/is_it_completely_normal_to_have_no_interest_and/",
        "comments": [
            "It seems in the current generation there are a huge amount of people that dont want to have children.",
            "[deleted]",
            "Yes, your life your decision",
            "Yes, especially I think nowadays with how easy it is to find information online- it makes it easier to realise just how hard raising a kid can be so more people are making informed decisions",
            "This is the advice I gave my daughter when she asked. If you do not have a very strong desire to have children, if it is not something you think about, yearn for, pray for and can't live without, don't do it. You're not having babies. You are having toddlers, teens and adults. It is perfectly okay and normal to feel that children have no place in your life. It is not something some people just naturally want.",
            "Absolutely. I think the previous generations believed you werent a true adult unless you had a kid. Now a days with costs of living being so high and the world looking so bleak it's made many younger millennials second guess having kids. They're definitely not for everyone.",
            "Yeah. It’s normal to have 0 interest or intention on kids. Society will tell you otherwise but yeah, totally normal.",
            "My life is stressful enough without having to worry about a child’s future 24/7. There are enough people in this world anyway. Live how you want to, it’s your prerogative.",
            "I am someone who don't have any interest or intention on having a kid.Let's just say \"normality\" is an abstract concept. I would define it by what the majority of people do. If you consider that point of view, then you might not be \"normal\".\n\nFor example, I don't sound like someone \"normal\" to my family or to other random people. For them, having a kid is normal. Having a kid is somewhat a goal in life that everyone must complete. However, when you ask them \"why?\", they'll answer : \"well, it's like that\". To me, that answer doesn't sound anything like \"normal\", it sounds like \"conditioned\".\n\nSo, in this case, it's not about being normal or not. You don't have a kid the same way you buy a car. It has to be a thoughtful decision. No one's forcing you so if you don't feel like doing it, just don't.Yes, you won't sound like normal to other people but hey, that's something you don't decide just because \"it's like that\". If you want to have a kid, then do. If you don't, then don't.\n\nAs simple as that.",
            "Some people don't realize they want kids until they have them, others don't realize they don't want to have kids until they have them lol\n\nOur species is growing quick enough that no one has to be pressured into having kids, so if you don't want any, that's totally fine!",
            "I was just thinking about this the other day. I have no interest in being a parent but I also am jealous that all these other people experience the want to have kids. Like I’m a lil broken. But I still don’t want them.",
            "Given the current state of the world.. im not surprised that people in my age have a higher rate of not willing to be parents.",
            "Absolutely. My main reason is that whether rich or poor, beautiful or ugly, smart or dumb, my children will inevitably experience suffering. But not if they aren't born.",
            "I am someone who doesn't wanna give birth to a baby, but prefer adopting a kid. I have met a few amazing men in my life, but everyone wants a biological kid. It's disheartening to find your type of man only to part ways because of this one reason, even though it's a major one!",
            "Define \"normal\".  If you want kids, have them.  If you don't, don't.  There's nothing inherently wrong with either scenario really.  Just keep in mind at your young age folks are going to repeatedly say you're going to change your mind.  And you very well could, guess what, it's your decision. :)  But, as a gen X person who chose not to have children, for me there's no regret like people were always telling me.",
            "Yes. The problem is that our families generally assume we're going to have a \"normal life\" and raise us with that expectation... marry someone of the opposite sex, have two kids etc. If it wasn't drilled into us as kids we wouldn't have such a hard time realizing there are other completely valid ways of having a life as adults.",
            "Honestly this planet needs more people who don't want kids.",
            "Totally normal, plenty of reasons not too.  The world is a shit show atm, raising a child can be expensive and stressful,  or even if you just plain dont like kids.  Dont let people pressure you into living the life they think you want.",
            "Yes. The contrary is simply societal pressure",
            "These questions keep popping up recently...\n\nYes its fine. Dont get pressured into having any if you dont want to. Not by your spouse nor by your family. \n\nThere are a lot of reasons to not want any and every single one is okay",
            "I've worked at a pet store in the past. You'd be surprised at how many people come into that store and want to buy a bearded dragon without doing the slightest bit of research. It was policy to educate, and if they balked at the price of lights or the years that they would have to take care of this critter for, plus the mass amounts of food they would have to provide, that we would not sell them a critter. \nI think of kids as pets now more than ever. Some people are not good pet owners. They don't do the research they need to provide that critter with a happy life, they provide shotty training, poor quality food, not enough vet check ups, and as a result they end up having another problem adult in the world with little to no idea of how to be a good parent to their own pets.",
            "I wanted to have kids, but as I got older and saw how shitty the world is I realized having a kid wouldn’t be the best decision. Also I wouldn’t want to have a baby mother that I’m not married to and even if we were married, 50% of marriages end up in divorce. So taking that risk doesn’t seem appealing. Not to mention how expensive the cost of living is nowadays.",
            "Yes, tradition is just peer pressure from dead people.",
            "Yes, it is. I personally know at least three different couples that have no intent on having kids. It’s becoming more and more popular.\n\nI also don’t want kids. I think they’re loud and annoying, expensive, and not worth any of the hassle.\n\nAlso, if it matters, kids are environmentally unfriendly just because people are not environmentally friendly. More people means an unhealthy environment even if they are as green as they could possibly be by recycling and reusing their waste and only using public transportation.",
            "Yes. Don't let society pressure you otherwise.",
            "I'm 28 and have my tubal ligation coming up. One of the reasons I married my husband is because he also doesn't want children. He's open to adopting which was another reason I said yes. I think our generation and the younger ones have made it normal so it doesn't feel any different than many couples we meet that are also childless. \n\nAside from our beliefs on the world, my main reason is my upbringing. My mother constantly told my sisters and I that she prays we have children so we can know the true meaning of suffering, pain, and regret. Well guess what? None of my sisters are having kids either. And now my mother has the audacity to ask why we have forsaken giving her grandchildren.",
            "Normal: yes\n\nSocially Acceptable: no\n\nI am 42, child-free,  no regrets.",
            "My view on it is that there’s really no point. \n\nMost people talk about working hard and saving money to give their kids a better life, but from my perspective in 20 years from now the earth is gonna be in a state where better life isn’t a option",
            "It's normal, but oh my god do people bug you for it...\n\nI don't want kids and I'm hoping to have a vasectomy soon. This fact offended the majority of my family. Why? \"We want grandkids!\"\n\nPeople have kids for selfish reasons, some don't, but some do.\n\nI for one don't want to bring any life into this world with an impending apocalypse on the horizon by 2040-2060. Food shortages, water wars, resource depletion, and so on. I will likely live to see modern human civilization collapse. Thus, I think bringing kids into the world is selfish since they will suffer to a higher degree than I would.\n\nPlus, I'm pretty apathetic to our species continuing. We've had enough time to get our shit together and we've failed. Our tribalism has been our downfall along with our false self importance and giant ego.",
            "Yeah, I think it's for the best honestly. Between automation taking away jobs and the economy and environment not looking so good, it's probably for the best that most people don't have kids.\n\nAs someone said in a similar thread the other day: \"Having kids is either an economic need for farmers, a mistake, or a commodity for the wealthy\".",
            "Yes. I personally think the obsession with reproducing to be odd.",
            "I am worried about future climate change, lack of social safety nets, hard to buy house as millennial, expensive education, expensive healthcare, decreasing regulations for infrastructure, future water scarcity, food scarcity due to water scarcity, and ever increasing job market competitiveness, so on and on. At this point, hard to think of any positives for future gen other than being a corporate slave",
            "I have 0 interest. I'm getting shirts made that say \"cats not kids\" because I'm tired of people asking when we're having them",
            "With the availability of birth control, the financial cost of childcare or a single-income family, climate change creating the threat of an unsafe future, and the fact that not everyone desires giving decades their life to the care for another person/people, yeah.",
            "Yes, check out r/childfree. My father recently told me he is going to take me out of his will if I don’t have kids. My response: ok go ahead",
            "Yes - and don't let people tell you you'll regret it. My partner and I never wanted children and we've never regretted it. If it turns out later in life that you have the urge to do a bit of parenting you can always do some volunteering or something. Personally I find children annoying and the further I keep away from them the better.",
            "I'm in my 50's and I never wanted children. I like kids and I'm glad my siblings have them. I just never felt the desire to be a mother. No regrets!",
            "Yes. In fact, the people that need to justify anything are the people who are having kids. They had better have a damn good reason because unlike child free people, their decisions effect other people.",
            "If i can barelly make enough for myself i sure as hell won't be having any kids.",
            "It’s always annoying to me how the brainwashed parents and ones who aren’t fit to be parents always have the most amount of kids.",
            "completely normal",
            "Completely normal.",
            "I never wanted kids. I have 2 now and I still don’t want kids.",
            "Yes.",
            "Yes",
            "Yes. Don’t let anyone shame you for it, because it’s your life and your personal business, nobody else’s.",
            "Just realize that wanting kids is also on the spectrum of normal. Don't get sucked into the pro-kid or anti-kid cults. You do you, they can do them.\n\nMy two cents is kids can be fun and cute, but they also monopolize your time and budget and take over your life. That being said, I have a kid, but my wife and I were in our 30s before we wanted one. For me, it was about wanting to do things with my life before being tied down. For her, it was about wanting independence and not ever being with someone before that she thought would be a good child-rearing partner.\n\nIn retrospect, there was more stuff in life I should have done first, so too soon. My wife's perspective is we started a few years too late. It is what it is.\n\nWe have plenty of friends all over the spectrum: have kids and love it, have kids and regretted it, no kids and no SO and loving or hating it, no kids but have SO and loving or hating it, and single parents and loving or hating it \n\nWhat I hate seeing is unhappy people. Do what makes you happy, and don't let anyone give you crap about it.",
            "Even if it wasn't normal, who the hell cares about being normal all the time. Normal is boring as fuck.",
            "Yeah! Absolutely",
            "Yes it’s normal. My take is if you’re not 100% yes about having kids, then that’s a NO.     \nBecause once you have them you can’t take it back. If there’s any doubt, don’t do it.",
            "Fuck yea. Never wanted a kid. For a small moment when I got pregnant once I felt sentimental but still knew that it wasn’t for me. Fuck the advice like “you’ll feel different when you get older”. Some people just know.",
            "Yes. Live the way you want.",
            "r/childfree welcomes you",
            "Yes. Not everyone wants kids/like kids.",
            "Yes. Its better to be honest than to be a lousy parent.",
            "Yes!  and I believe it is more common than most people think.",
            "Yes. Kids are expensive, annoying and smelly. So many people are not suited to being parents but decide to have kids anyway. So many children are in foster care or can be adopted.",
            "Check out childfree or truechildfree subreddit",
            "Absolutely. You don’t need a reason or justification or explanation for it, either.",
            "Yeah,",
            "https://www.reddit.com/r/antinatalism/\n\nhttps://www.reddit.com/r/childfree/",
            "Join us over at r/childfree",
            "My sister had a baby last year January and honestly it's crazy how much I love that lil girl. I was holding her while fam visiting a few months ago and my aunt said \"Ugh look how good you are with her! Doesn't it make YOU want one?!\" I threw my head so far back and laughed and said HELL NAH!!\n\nI LOVE my fam but I'll be damned if they're gunna influence MY life choices",
            "Of course it is. Why is it that you would ever want to bring another person into the world who didn’t even need to be there to suffer the painful consequences of existence?",
            "Yup. Been saying I don't  want kids since I was still a kid myself. I'm 32 now, still don't want money sinks. Been hearing people say I'll change my mind some day, still can't see myself trading freedom, money, weed, all the videogames I could possibly want, going out or even traveling at a moments notice, and so much more, for the chance of spending money on mountains of diapers, having to change those diapers, waking up several times every night, being worried the little fella will die or.get sick  because I fucked up somehow, wasting money for years on pointless education, then seeing the little shit growing up to hate me, become a tiktoker and play Fortnite on a ps7. Not on my watch. Everyone else can have their kids and love them, I'll just focus on myself, maybe get a dog or two, and that's that. I'll be that cool uncle that brings the cool gifts and is always happy (hopefully) to my friends future kids, assuming any of them wish to fuck up their lives.",
            "Yes!! Kids are an option, not the only path. Some folks don’t realize they don’t want kids until they have them.... expensive and tbh scary as shit sometimes. I love my kid but we stopped at 1 cause the world is fucked... real possibility of no clean water and global climate change effecting his lifetime... too many people not enough global resources.",
            "r/childfree",
            "[deleted]",
            "Yep",
            "100%, there are more than enough children on this planet. Live your life how you want to live it and if you change your mind, you can always adopt.",
            "I had a whole surgery to prevent pregnancy (I’m a woman) so no, not at all. You don’t want kids? Then you don’t want kids and there is nothing wrong with that.",
            "Normal for me, at least. The way I see it, there are vastly more people out there who regret having children as opposed to those who did *not* have them. I'll choose the latter any day.",
            "Completely normal. I see no reason to bring up and raise humans you don't want. You're gonna hate your life and eventually them.\n\nDo what make You happy, not what others would consider that will make you happy. If someone likes grape juice, doesn't mean you also like grape juice.",
            "Yeah, you might want to check out the subreddit called Childfree too, it talks a lot about how people live childfree",
            "For sure. I personally would never want to pass on my shitty genes to another life. Also the world is plenty populated. I think more people need to consider whether or not they can/should raise a child.",
            "Yes. A lot of people feel that way, probably more than will admit it.",
            "Nope. Life is better without them if you have other things to enjoy.",
            "Yes.",
            "Completely normal r/childfree for others that share your view.",
            "Why wouldnt it be normal? Dont you think its more abnormal to feel that reproducing is your only goal in life?",
            "Yes. In fact there’s a subreddit called r/childfree that has over 1 million members that don’t want kids. I don’t want any either",
            "Yes. It’s called r/childfree",
            "Yes! Check out /r/childfree",
            "I feel better about the decision to not have children every day.",
            "Absolutely. Kids are the worst.",
            "Totally normal try r/childfree",
            "Yes it's perfectly normal, acceptable and fine.",
            "Yes. Despite society’s expectations that all people will grow up, get married, and have kids, it completely normal to not want any of those things",
            "100% and don’t be afraid to voice your opinion. One of my best friends was afraid to tell anyone she was thinking about not having children because of other friends reactions (who have kids). It’s none of their business what she wants to do with her life. And same goes for you :)",
            "Ignore anyone who is saying no. Go on r/childfree and r/antinatalism, I'll see you there",
            "Whether or not it’s ‘normal’, I wish less people would have children.",
            "I hate kids and I’m terrible with them. They are annoying, unpredictable, and just plain horrifying.",
            "36 year old male, here, with 0 children and 0 interest in having them. Happily married to a wife who shares a similar view. \n\nI know I'd be a resentful parent, because I'm selfish. I want to spend my life doing what I want and that does not involve sacrificing my goals and ambitions for a child. \n\nTherefore, I'm better off not reproducing and bringing a child into the world that I'd ultimately resent and hate for curtailing my ambition.",
            "You are not only normal, you are (even if inadvertently) doing the environment a favor. I find that this makes people get furiously defensive but overpopulation is behind both our depletion of resources and the excess of our emissions and waste. \n\nThere are many valid personal reasons to forgo the experience but there are ethical ones as well. There are some subs dedicated to this if you are interested.\n\nr/childfree for the personal choices\n\n  \nr/antinatalism a little more nihilistic but for the ethical choices\n\n&#x200B;\n\n⬇️ I'll just go ahead and put this here to save people the time <3",
            "Absolutely that's why /r/childfree is also a sub.",
            "Yes! I always was on the fence about kids, I met my husband and we decided to try for one! And now I have my son whom I love dearly (and we’re planning for one more!). I always tell people to not have kids just because everyone else is! If you’re on the fence about it, take a long time and have a lot of serious talks with your partner, if you both decide to go for it then do it, but if there are doubts just keep waiting until you are absolutely ready! If you know you don’t want kids then don’t let people try to change your mind or feel bad about it!",
            "I’ve always known that I didn’t want children. Many reasons- the pain of pregnancy/childbirth, the cost, the time you have to give up, you can’t guarantee how they are going to turn out, massive carbon footprint…and recently I’ve added another one, this is not a nice world to be joining right now. r/childfree has made me realise I’m not alone in my views!",
            "Hell yeah. You don't have to be a parent.\n\nBut if you are somehow responsible for the making of a child than you do need to do your part, either by going to court and signing away parental rights, or child support, etc.",
            "I believe you will feel at home here r/childfree",
            "r/antinatalism",
            "r/antinatalism",
            "Take a look at /r/truechildfree - Definitely not alone.",
            "Yes it is completely normal.",
            "r/childfree",
            "Definitely.  Idk why people get pissed off at childfree people.  We aren't demons who walk around harming kids.  We just don't want any of our own.",
            "I will say this. I had little interest in having children and had a hard time getting excited about it while my wife was pregnant, but becoming a parent is the single best thing that has ever happened to me. It is indescribable what going through the birth process with your partner is like and the love you can spontaneously have for another human being you met merely seconds ago.",
            "Yes come join us at r/childfree",
            "I went 30 years not wanting a kid at all, then I had a weird period of depression and came out of it wanting a kid. My boy is 6 months old now and I can't imagine not having him but I see both sides of it.",
            "Same",
            "Of course.",
            "Most certainly",
            "Yes",
            "And even if it wouldn't be completely normal: do whatever you want and what makes you happy!\n\n(without hurting others)",
            "Yes",
            "Wtf even is normal? Seriously. If you go by statistics (ie people who have kids vs people who don't) no, it isn't \"normal\", but fuck normal. \n\nIf you mean is it okay that you make decisions for your own life that are not the same as everyone else, absolutely. You do you.\n\nPersonally, I would just develop a succinct little blurb about why (or why it's no one's business) to have prepared for when people ask. Because they will always fucking ask.",
            "Yes.",
            "Yes. Never had kids. No regrets.",
            "Yep. Live your life. Only you know what your happiness is.",
            "Yes. Any decision in having children or not is up to you!",
            "Yes, that's normal. Sometimes desires change, sometimes they don't. \n\nObligatory \"it's a major responsibility but super rewarding.\" Cliche but true. It's wonderful but incredibly, incredibly difficult. I wouldn't put pressure on myself to feel either way.",
            "Nothing abnormal about it.",
            "That's what I've always felt and I'm completely normal. I think...",
            "indeed it is.\n\nis there a law which mandates couples, be it married or unmarried to have children? not exactly.",
            "Of course it's normal. Don't let anyone tell you otherwise. \n\nBtw I have 2 kids.",
            "It's pretty normal for birth rates to decline as a society becomes more developed, you'd be a part of that statistic.",
            "Kids are great if you want to have them, but if you don't and you do anyway its terrible for you and the kids.",
            "Absolutely! Parenting isn’t for everyone, and I think it’d be nice for more of us to assess if we’re detail oriented enough and thoughtful enough to truly provide what a child needs/ want one for ego reasons/ just aren’t really into kids. Completely normal & natural imo.",
            "It took both my wife and I awhile to arrive at that conclusion. It doesn't help with the societal pressure to have a family, to have a child. And the pressure from family to do the same. But in the end it's about what you desire in life.",
            "The fact that you have to ask is breaking my heart! of COURSE that's normal. Kids aren't just a \"given\" for everyone. They're like... a WHOLE deal. Some people get really into sports, some people are just uninterested. Likewise, some people are uninterested in having kids, and that's just as normal as having them. Life your life for YOU.",
            "If you want the right to choose not to be a parent, make damn sure you support places like Planed Parenthood and make known to your elected officials you demand proper birth control be readily available. Without a woman's right to her own body such \"choices\" become moot.",
            "Yes it’s completely normal. It’s not mandatory to have kids, so if you don’t want them, don’t have them. Plain and simple. Just make sure you truly don’t want them because having them later in life may be more difficult. But I’m sure you have plenty of time to decide.",
            "Having children is a choice.  Some people love little children and want as many as they can have.  Others just don't want children.  They see them more as little monsters always wanting.  It okay to choose not to have children and if you don't like little kids much I suggest you just don't have them.  You can make your life full without children.",
            "Yeah I can't cause of trauma so I write fanfiction",
            "Absofuckinglutely.",
            "Absolutely. I knew I wanted kids my whole life. Stands to reason that someone else would know their whole lives that they DON'T want kids.",
            "Definitely. Totally normal. Just make sure to discuss this early when starting a relationship. It's one of those irreconcilable topics where it's better to be aligned 100% from the start. You can always negotiate whether you want to buy a house or not, where you go in vacation, or who takes out the trash. Having a kid is life-changing.",
            "Yes it is. Having kids is a very serious thing, there is no on and off switch. It’s life changing.",
            "According to strict dictionary definition it is not in fact normal to not want kids . But in this case normal is of no consequence if you don't want kids because of the financial/emotional commitment or simply don't want them . It's up to you and you're partner and it's no ones business but yours",
            "Come join us at r/truechildfree there is a lot of us.  If you're not 100% try r/fencesitter",
            "A good half or so of the people I know in their early 20s don't want kids. It's possible some will change their minds but I bet a lot of this young adult generation will stay child-free for various economic and cultural reasons. I think that's a good thing!",
            "Yes. I'm too self-centered, I like to keep more of my money, and the world has enough people as it is. I'm very grateful that I found a partner in life who feels the same way.",
            "Is it *normal*? Eh, I don’t think so. The desire to reproduce is effectively hardwired into our DNA, and I’d say that it’s normal for people to go with the flow of that instinct. \n\nIs it acceptable, respectable, understandable, and valid to not want kids? Yes, absolutely.",
            "My wife and I decided not to have kids and a procedure was done to ensure it. It's our life and we are happy knowing that we can get up and do whatever we want at any time (within reason). Ie: on a whim we can choose to go traveling. If we had kids, that wouldn't be an option. \n\nWe did get comments from others at a younger age stating that we will change our minds but I'm now in my 30's and that's still not happening. \n\nThe decision needs to be based on what you want with your life. Other people aren't living your life and they shouldn't have any power over this decision so it's ok to ignore them and not feel bad about it.",
            "It is and don't anyone tell you different.",
            "Yes. I have no interest in working as a life saving doctor. Doesn't make me mean (everything else about me does tho lol) .\n\nHaving kids is honestly a very selfish decision, that requires a shit ton of time, money and selflessness inorder for that child to successful. Most shouldn't have a pet rock let alone a kid that's gonna influence someone's life in the future.",
            "Yes. I'm 28 and a lot (roughly 70-80%) of my circle of friends- and extended friend group all have kids, my brothers and my sister both have kids are only a few years older than me and they have kids.\n\nKids are great but I have zero intention at this stage in my life. In all honestly I can't see my view changing for minimum about 7-10 years, given my outlook on life which is exactly the same as it was back when I was 21.",
            "Having a kid is as wonderful and life fulfilling as they say. Its also as stressful and soul crushing as they say. Having more than one doesn’t multiply the experience, it exponentially increases it.\n\nIf you want them it is worth every second, if you dont then it’s best to avoid it. I love my kids, but i have friends who watch them as a form of birth control lol.\n\nTo answer your question: yes it’s normal.",
            "Of course, just like some people just know they want kids.\n\nEither way you are completely normal and don't let anyone make you feel bad about you choice.",
            "Yes. Tbh people around me are always like \"are you fr? Are you sure?\" when I say I do want children lmao\nI think it's nice that things are changing! Maybe in the fututre nobody will care if you have or not children. Yay to freedom?",
            "I don't and never did.  Best thing I never did!\n\nMy mom always told me \"who's going to take care of you when you're old\".\n\nThere's no guarantee that would happen if you had/have kids.\n\nMost of my brothers were druggy/Alcoholics and caused her tons of grief for years.\n\nSo, if you decide not to have kids, I think that is perfectly ok..\nfrom my experience.",
            "Yes. Myself, both my ex-girlfriends, my current girlfriend, and  at least two friends have no interest in children. I never have, but if I were to change my mind I would adopt",
            "Yes! Personally I do have a child but my cousin has absolutely no intention on having kids for a long long time, if not ever. She grew up with a hoarder as a mother and had four siblings. Growing up the way that she did made her not want kids and she's very adamant about that. I support her 100%, even if I think having kids is a blast, I don't want her to be forced into thinking being a wife and mother is all there is to life when she's very smart and athletic and has a whole life to live child free.",
            "Yes. It is. Don’t let anyone talk you into having a kid. It is a complete labor of love and a life changing event. If you don’t want it with ALL your heart. Don’t do it.",
            "Yes, it's normal, and it's fine! As a mom of 2, I definitely understand this isn't for everyone. If it feels right, I hope that you can find a role as mentor, role model, or other such non-parental position in a kid's life. Some kids need them, don't have them, and would benefit from it so much.",
            "How about not worrying about \"normal\" and follow your feelings on the issue and what is best for you.",
            "The problem occurs when two people in a relationship have different opinions on this issue. There are many things that can cause stress in a relationship: finances, political views, frequency of intimacy, etc. But one of the top ones is whether and how many kids to have.",
            "No it’s really weird.\n\nMy life is so awful not having a kid and being able to do whatever I want all the time and have tons of extra money",
            "Yep. I have no plans to have a kid ever. The way I see it is that kids are leeches that just take your money. I would much rather spend the thousands of dollars on stuff that I enjoy.",
            "I can barely afford myself let alone a kid and I still have really expensive things I wanna do.. I don’t want a kid in a situation where I can’t afford it",
            "I wouldn’t have kids if you offered me a million dollars. 10 million maybe but I’d still be hesitant.",
            "It’s a minority decision, but not to the point of being abnormal",
            "Absolutely! I have kids and my biggest regret is allowing them to inherit this shit hole world with all it's problems and not being able to fix it before I brought them to life. At this point I can only hope they care enough to try and be the change the world needs. There are many many reasons to not have kids",
            "I don't know if this is \"normal\" since most people seem to do it.  But it's OK to be abnormal.  All I want to add here, not knowing how old you are, is to not write it off completely.  A lot of people's interests and intentions change as they age.  I've known people who chose not to have children and lived perfectly happy lives.  But I've also known a few couples who chose not to, and then sat there looking at each other when they were seventy wishing they had something of value and purpose in their life other than TV and bridge with their elderly friends.  Children, while not being \"fun\" and not being easy, provide a purpose and meaning to many people's lives that made it worthwhile many times over.",
            "Thanks to r/relationships and r/AITA now I'm childfree! :D",
            "Is it the standard in today’s society? No. Is it normal? Absolutely.",
            "Yes, some people in your life may tell you it's not but they're wrong. Ive never wanted kids and now that ive had the experience of basically raising my three brothers i want them even less.",
            "It is very normal to not want children. A childless life can be just as fulfilling as one with children. Besides, if you have siblings and they end up having kids, you can be their kids cool aunt/uncle.",
            "Dogs > children",
            "It is normal to not want to have kids. \n\nBut, you do have to take your age into account. As we get older we start thinking about things differently. You may change your mind, and that is ok too.",
            "If someone doesn’t like or want children that is a perfectly OK mindset to have. “Normal” plays no part in it!",
            "Absolutely. We're 10+ years married and 100% childfree",
            "It is, but it isn’t treated as normal, unfortunately.",
            "of course yeah it’s just a preference, just don’t make “not wanting kids” your entire personality that gets annoying",
            "R/childfree",
            "Someone people (myself included) just have no urge to procreate. I think it's always been that way but that in the past, unplanned pregnancies were more common due to lack of birth control and also societal pressure to have them was greater than it is now.",
            "I'd say so. I've never wanted them, but I think I was put off at an early age from seeing how nasty and needy they can be. Whatever reason is still legit imo.",
            "My recommendation is if you’re unsure get 2 dogs. One of my 2 always need something. If they are even half of what a kid is like, I never want them.",
            "I have no interest in having a kid. It doesn't help that I have two step brothers who seem to have no interest in their unplanned kids. Eldest step brother only played dad when things with his girlfriend got serious, before that he barely had anything to do with that poor kid. Middle step brother is a bit better but still hands off his kid to my step mom to do all the work.",
            "Very normal to me at least.\n\nI was one of five and watched my parents struggle with money my whole life. \n\nI struggle now alone with a “very decent” job. \n\nI’m all good on making it harder for me and the potential kid.\n\nPlus I’m honestly just not that interested in bringing life into this world and I think expecting people to is how we get so many unwanted kids who grow up aimless and apathetic.",
            "These days yes. I don't know how the fuck people my age can afford kids.",
            "I think so, and it is a positive development, in my opinion.",
            "Wouldn't say normal, but it's completely fine. It is a personal matter.",
            "Some parents have kids to have a mini-me version version of themselves, to see how they would have turned out if they became a doctor, etc.\nThe same parents have kids to do chores for theem, and to look after them in their declining years years.",
            "I wish it were more normal to celebrate not having kids. It is truly easier to just let “nature take its course” when you are lazy about contraception. Literally anyone can accidentally get pregnant and decide they will keep it, but is an incredible amount of effort to stay barren on purpose. \n\nWhat really gets me is when people think just because they followed through on the natural urge that they automatically know what is best for their kid. It was the parents’ of my students who finally made me embrace being child free. \n\nSource: raised by conservative Christians and still afraid to have to tell my parents if I ever got pregnant even at 40 with 13 years of marriage. No regrets! I love not having kids every time I have to spend time with other people’s kids.",
            "I have a decent amount of friends who don't have)don't want children. Also my mother has a good amount of friends who are kind and childless, some have even been married most of their lives. You'll be happier if you don't go after a life you don't want.",
            "Yup. Not to mention it’s insanely fucking expensive and people can barely afford most things by themselves nowadays. Who the fuck would want to have a kid in this economy?",
            "Most of my friends with kids are pretty miserable. They love their kids, but the amount of stress caused by the kids and the time and attention required by them really gets to them.\n\nFor a long time having kids was a no brainer for me as it's part of the family ideal I had in mind. Early on I got away from marriage being of any value, then I was looking into alternative relationship types, but I always hung on to the idea of kids.\n\nFor a few months now I realize that I may not want any.. just because of what they did to my friends' lives.",
            "It's different for everyone.",
            "Yes, absolutely, it's the responsible thing to do with the current world situation, what kind of world are you bringing them to,?\n\n When I was in my early 20s I decided that I didn't want to ever have kids, I'm fifty-six now, I have zero regrets!",
            "Ever since I was in highschool [maybe even before that, but my memory doesn't serve me well on that age] I knew I didn't want to have a kid. I'm 32(f) now and am still in the same boat.",
            "These days there's easily a hundred reasons why people don't want kids\n\nAnd that's completely fine",
            "If you are aware of the coming climate apocalypse, if you aren’t obscenely wealthy, not only is it normal, it’s the only rational decision you can make. \n\nIf you have baby fever, you can always adopt a child in need.",
            "Yes it's normal. Society just thinks it's not normal because they expect you to have a kid. However we learn that it's our choice whether we want kids or not.",
            "A child is- a choice, a lifelong commitment, expensive, difficult mentally and emotionally\n\nA child is not- inevitable, part of the tm lifescript, a fashion accessory, a way for you to feel loved if you cannot love yourself, an assurance of care in old age, a pawn, a way for you to keep someone if the relationship is rocky, the only way you could understand real love, a dress up doll for you to pawn off on unwilling person's in your life, a reason for you to ditch your animals at a shelter",
            "Absolutely YES, kids are hella expensive. Also the ages of 0-5 seem like a tornado of chaos.\n\nAnd my dream job isn’t exactly high in pay. BUT hey it’s what I want to do.",
            "Yes. Kids are highly overrated anyway.",
            "After seeing how my friends treat their kids... but I doubt I could do better so I'd rather not.",
            "Hell i have 2 kids (17 and 19) and i discourage them to have kids. Overpopulation, climate chamge etc",
            "Yes.",
            "Yup.  Don't let anyone pressure you into feeling otherwise.  Some people just know kids aren't in their future.",
            "Not just normal, but logical.",
            "Totally normal, especially now with everything that’s going on in the world. I remember when I was a kid all I wanted was to be a mom. I wanted 3 for a long time. Then life happened and I woke up to the mess that is our world. I decided not too long ago that I (24 F) didn’t want to bring a child into this world until it was safe. If that means I never have children, I’ll be happier knowing I didn’t bring any into this one to suffer like the vast majority are today. Don’t feel bad about that decision. Also, it should be noted that I don’t have an issue with anyone who has or is expecting or planning to have children, to have them or not to is a human right I will fight for forever, and we are all entitled to making those decisions for ourselves. Good luck with your journey! I wish you the best!",
            "Sure. I've said it before and I'll say it again, I enjoy silence and money.",
            "100% I’m 30 this year and have never wanted children. I have also always had a fear of something growing inside of me and recently discovered Tokophobia. This is a fear of being pregnant!! I never knew others felt the same.",
            "YES!!!! My son (28) and his GF (25) don't want kids or to get married. Good for them! I totally respect that. I (53f) have a lot of female friends who never had kids. The amount of crap they've taken from family, friends and strangers is mind boggling. It makes me wonder how many people get married, have kids because of some misguided belief that that's what you're supposed to do. Millennials and younger are the first generations in a long time, that are not expected to do better than previous one's. I wouldn't have kids now either, economy, climate change, pandemic, etc. I had one kid when I was 25. I knew I didn't want more kids and NO doctor would tie my tubes. They said I was too young and would change my mind. I never did change my mind and it pisses me off that I wasn't allowed to make reproductive choices about MY body. You do you.",
            "Totally normal, early on in dating before getting serious I told my now husband “look I don’t ever want kids, so if you do we should probably end this early”, luckily he didn’t either and just got a vasectomy. I turned down a lot of dates because they had kids from prior relationships, and I just have zero interest in having kids in my life at all. Enough people are going to be parents, you don’t have to feel weird or abnormal for not wanting to be a part of that percentage.",
            "It's completely normal. Plus, some scientists say earth is reaching its carrying capacity because of overpopulation",
            "Thought it said no internet.",
            "#FuckThemKids",
            "I'm the same, I don't have any desire or interest in having kids even if I could afford them.  \n\n\nHowever, I do feel like I'm in the minority as it sounds like plenty of people do desire to have kids but are put off by the rising costs of living or are more appealed by career prospects.   \n\n\nHonestly, though there's nothing wrong if you simply just have zero desire to have kids, you don't need a reason. No one should have kids that they don't want.",
            "Yes",
            "Not at all! Ive been in the same boat for 21 years and have no plans on changing. Whats really annoying is when I tell people this and they always give the same \"Oh youll change your mind when youre older.\"...sure.",
            "Being seriously afraid of ending up alone and sad it's very common and I think many couples decide to have kids to avoid that. But there are so many chances you'll be alone and sad even if you have a bunch of kids. They might have psychiatric issues, they might be drug addicts, they might die, they might be jerks and so on.",
            "I've never liked baby humans. It took me about 40 years to finally think, 'I guess they're sorta cute.' I'm not sure why I'm like this. I used to do a lot of baby sitting as a kid and I'm not bad with kids, just have zero interest in raising one of my own. They're really noisy. \n\nI think I'd be a pretty decent teacher.",
            "Starting from your parents, you can trace your family tree. You are part of a lineage that goes back from your parents, grandparents, great-grandparents, great-great-grandparents, and finally to the dawn of humankind. Even 100,000 years ago, there were two people who are your direct ancestors.\nIn the entire chain of this family tree, you are the link that ends this line forever.",
            "Most people that have kids, didn’t want them and aren’t responsible to have them",
            "For me it is! I prefer the free time and spare cash on a daily basis 😅",
            "My wife and I are struggling with this question at the moment. \n\nOur life is easy (too easy probably) and tbh we don't wanna go through the hassle of deal with another human .",
            "100% normal, too many people feel pressured to have children and end up with a damaging relationship, poor living situation, or at worse abuse and such. Not wanting to have a kid, whether it's because you aren't ready, have no interest, or don't feel equipped is really good to know about yourself and it is incredibly responsible to act accordingly and not have kids unless you feel ready and willing later in life.",
            "100%!! On the flip side it is bananas that people have kids even though they have no interest in them but feel its a tick box exercise 🤪",
            "All of these comments make me chuckle, the entire point of human existence is to reproduce and raise children. Y'all have been sipping the cool-aid for too long. It is OK if you don't intend to have children, but lets not pretend that it is normal, or should be normal.",
            "Yes.  Not everyone has what it takes to raise a kid.\n\nAlthough I personally can't relate because I've always wanted to have kids.",
            "YESSSSSSSSSSSSSSS. and it case you didn’t hear me YES. \n\nYou know what shouldn’t be “normal”? Having complete strangers, distant relatives, or truly anyone weigh in on such a personal matter such as the decision to have kids.\n\n\n**full disclosure: I LOVE kids. But I can relate whole heartedly because people simply won’t accept it when I tell them I don’t want kids of my own.",
            "Looking at all these comments, what has the world come to, I wonder.  Sounds like having children is the worst can happen to a human being.. wow, humanity,  you don't seem to make it too far.  Let's all replace children with pets and call them our babies instead. I know it's already happening,  it's more like a trend now . We are headed in a good direction.",
            "I say yes, totally normal.  Much better than having a kid and realizing you didn't want one.",
            "[deleted]",
            "Hahaha, you're asking Reddit. There are way more anti-child people on here than you'll meet in real life.",
            "Normal is an illusion.  Whats normal to the spider is chaos to the fly.\n\n-morticia adams",
            "It's just being responsible. The World is 100% going to shit. So would suck soo much to live on earth in 20 years 😂",
            "YES.\n\nI was told for years that “I’d change my mind one day”, “you will want them in the future” or “just wait till you hit your 30s”. \n\nMind was not changed. Zero desire to procreate. Loving the freedom. Still dote on my nieces & nephews. \n\nTimes are changing, and my once rare choice is becoming more and more common.",
            "As someone who grew up with parents who clearly didn’t want kids, I have no intention of having my own kids until I am 100% positive that’s what I want. \n\nI don’t plan on having kids at all tbh because I’m not mentally, financially, or physically stable enough to give birth to and raise a child. If I did have kids, they would be adopted and I would do it in my 30s or 40s. Definitely not early 20s like my parents.",
            "Wife and I talked about having kids before we married - pros, cons, and could we afford it.\n\n25 years later... We've never been financially stable enough to afford all the things that come with a child, even with us both working full time.\n\nWe've never regretted our decision, it just wasn't what we wanted in our lives.",
            "Yes it is. \n\nUnfortunately, it also severely limits your daring pool. Especially in your 30s. \n\n*sigh*\n\nI don't dislike kids. I'm proud to be an uncle to some amazing children. Fatherhood just isn't for me."
        ]
    },
    {
        "post_id": "x58l1u",
        "author": "Pm_blue_hair_women",
        "title": "My 4 year old daughter saw a beautiful woman today while out shopping, she said \" I love your hair it's soo pouffy!\". My wife talked to her about that being offensive as the woman was black. I don't think so, she's just complimenting, who is correct?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/x58l1u/my_4_year_old_daughter_saw_a_beautiful_woman/",
        "score": 17168,
        "num_comments": 3178,
        "created_utc": 1662249526.0,
        "selftext": "As a white male, I honestly don't know. I would assume calling hair \"pouffy\", wouldn't be offensive unless it was so because of bedhead or some silliness. If she said long, blonde, curly, red or any other number of adjectives they would be considered flattering. \n\nPouffy, is pronounced poofey. In case pouffy wasn't clear.\n\nEdit; to be clear my wife was teaching this from a place of love. Trying to help her navigate and not over step or offend. Alot of the comments are saying \"as a 4 year old\" this isn't offensive. Which intones at a certain age it becomes offensive.",
        "permalink": "/r/NoStupidQuestions/comments/x58l1u/my_4_year_old_daughter_saw_a_beautiful_woman/",
        "comments": [
            "My niece use to tell everyone that was black that she loved there beautiful black skin. That it was so silky smooth and pretty. It was like chocolate. She was 3…I told her we had to work on her compliments because she came across like a miniature serial killer at times.",
            "My hair do be poofin. Kid’s a sweetheart",
            "When my daughter was either 3 or 4 she walked up to a Black gentleman and straight up petted his arm while he was trying on shoes and said \"wow your skin is so pretty\" she was in awe! She had never seen skin that dark. I on the other hand was MORTIFIED! The man was so sweet and could tell I was red as all hell! He said \"that was probably one of the most innocent and sweetest things a child has ever said to me. It's all good mama!\" I'd tell your wife to leave that up to the person to be offended 🤷‍♀️",
            "I’m black. This was not offensive. It was adorable.",
            "The first part of this was \"I love your hair...\" don't worry about it she was trying to make a compliment.",
            "No one should ever be offended by a compliment from a 4 year old.",
            "A black lady was told that her natural hair was beautiful, and somehow that's rude?? How else is the kid supposed to describe an afro. It's a poof. It's poofy.",
            "My family of 4 and I were sitting at a table with our daughter's classmate and friend, who happened to be black.  \n\n\nHer friend was around 5, and suddenly blurted out \"Wow, is your whole family that white?\"  And we just laughed, cause we're like stupidly white... get a sunburn from standing too near the window for 5 minutes white.  Confuse us with albinos white.  \n\n\nWe all just laughed, I could tell her mother was embarrassed, but I did let her know our daughter has a cousin who's black... but yeah... we white as your daddy's tighty-whities.",
            "Kids speak their minds with innocence. \nMy daughter (who is now 33), and I were on a subway when she was 6.  We had just moved back to Toronto from the west coast.  I guess she had never or seldom seen a person of colour and in Toronto there are a lot of amazing people.  There was an elderly man on the subway who was black.  She and I were standing next to him.  She looked up at him and said \"you're just like chocolate\".  She smiled at him and he reached down and hugged her.  I was mortified but he really smiled and told me how sweet she was.  It was a good moment.",
            "When my nephew was like 4 and he must have learned about leaves changing color and he saw my teeth were very yellow because I'm a long haired dirty scumbag and he says joyfully \"your teeth are changing color\" in front of like 5 people and we all just laughed. And that's what I have to say about 4 year olds lmao",
            "4 year olds aren't very good at lying. Your daughter genuinely liked her hair because it was \"pouffy\" and there's nothing more to it. I'm sure that the woman receiving the compliment knows that a 4 year old is not being racist because she complimented her pouffy hair. If an adult said that it might be misconstrued even if it was a nice comment but a 4 year old that likes big hair is not going to be considered racist. Your wife may have been uncomfortable on behalf of herself with the comment your daughter made but I don't think that anyone should be worried. Your wife is very kind to feel self conscious about how the comment was taken but as an outsider I think your wife just needs to relax and remember kids are kids and teach them what you will...",
            "It sounds like she was trying to describe super curly hair and that was the closest adjective she could think of! I would definitely take that as a compliment. She had good intentions just the vocabulary to describe her hair.",
            "You'd have to be the biggest hard-ass with an attitude problem to take anything a child under the age of 5 says as an insult.",
            "One time in a store, my daughter (3) told a man, “I love your head, it’s so…. Bald.” Yes he was bald. He and his wife laughed as I apologized. It’s less about an inappropriate compliment for me, and more about hoping the people have a good sense of humor and do not get upset at my 3 year old. It’s happened before :/",
            "If a young girl came up to me and complimented my natural hair like that while I had it in a fro, I would thrive on that compliment for the rest of my day. I'd melt from the cuteness. Children are precious.",
            "I'm going to make this one about me with a personal anecdote. At the mall, a 4-year old very white child once LOUDLY mistook me for a real life Moana.\n\nHer parents were absolutely mortified. I was thoroughly amused. And if I'm honest, I DID look like Moana that day.\n\nNow of course there are so many layers of racism one could peel back if one wanted to, but I promise you no 4 year old is getting excited about ANYONE'S physical features out of hate. Ironically it's the parents who teach it to their children over time, both verbally and nonverbally. We don't live in a post-racist world just yet.",
            "As a black women with “pouffey” hair I would have been delighted",
            "White people need to stop talking for people of color. A little white boy asked if I was Mexican and his white mother told him that was offensive. It’s not offensive. I’m brown and the boy is not color blind.",
            "My four year old son pointed to a Sikh man on the bus and shouted “mom - look! A genie!”. This was about 30 years ago (when Aladdin was the big Disney movie). I was mortified.  I told him that it’s impolite to shout and point at other people. Then I told him quietly that the man is a Sikh and genies were just from the movies. Later we talked and he asked me what a  “sick” was and we had a nice chat about other cultures and that they are people with families and were fundamentally the same as us. I’m happy to report that he grew up to be a lovely progressive young man without hang ups concerning other peoples cultures, ethnicity or sexual orientation.\n\nBottom line - kids say embarrassing stuff but it’s a good thing because it opens the door to explain other stuff.\n\nEdit: The man on the bus turned and smiled sweetly at my son and this was also likely important in my son’s learning experience.",
            "No, I doubt the woman found it offensive.  A 4 year old has no idea about race unless it’s taught.",
            "Lecturing a child about appreciating someone's uniqueness is where the issue is. Instead you need to assure your child, yes she has beautiful hair and it's wonderful people get to have all types of hair isn't it. Little kids aren't born racist, it's learned. Perhaps next time let the person speak for themselves, that compliment may have made their day cause kids just say what they are thinking, they don't make up lies so she knows it was a real from the heart compliment",
            "She told her she loved her hair, and more importantly, she's four. It's unlikely she thinks the child is malicious.",
            "I think it's great that mom is aware, and took steps to school the kid, but I don't think there's anything to correct. Noticing the beauty of others and knowing to tell them, in a way that is kind and with love, is so important imo. Yall are doing fine. It's not the compliments, it's the touching. As a black guy, I have no problem with someone saying my hair is the way it is, but it gets weird when strangers ask to touch it. Don't touch without permission is the only lesson I would suggest.",
            "First of all she’s 4\n\n\n\n\nSecond, she said **”I love your hair”**. I don’t understand how can that be offensive. I agree with you mate, don’t overthink it.",
            "She said \"i love your hair.\"\nThats adorable.\nIf a 4 year old black girl told my wavy haired, red head wife \"i love your hair, its so red and wavy.\" Would that be offense?",
            "100% an innocent compliment. \n\nUnlike my 3 year old who asked the obviously trans cashier if she (he) had a penis the other day… \n\n\nI’ve never wanted to “I don’t know her” so badly in my life… But she came out of me… so I couldn’t… 🫠🌚",
            "Offense is in the intention, not in the words. Don't let your wife spoil your daughter's joy of admiring, reaching out and complimenting people!",
            "As a black woman, I absolutely would not be offended hearing that from a 4 year old, but I work be mildly offended/annoyed hearing that from an adult (the “poofy” part, not just a general compliment). That’s because I know children are genuine and naive, while many adults are not. Plus, by now I’d expect white adults to realize the specific comments about black women’s hair are interpreted as microaggressions most of the time. So yeah, *eventually* you’re gonna have to teach your kid those nuances, but right now she honestly won’t get it",
            "Yeah man. There is a whole history with black hair and we are only now really seeing natural \"good black hair\" being normalized. I don't see anything wrong with this especially at that age but I also see your wife not wanting to engage in something which might offend the other person. We just don't know what is or is not personally offensive and can only do our best. If the lady was offended apologize and move on but I bet she felt beautiful after choosing to go with her natural poof. Then again I am a very basic and bald white guy so who knows, no one complements me on my fringe.",
            "Not a black women but a black guy. While I'm not a fan of kids and don't like being touched by kids or adults I'm happy to let kids mess with my hair, let alone talk about it. Better to have informed kids than the teenagers and adults who think their curiosity is a reason to weirdly rub my head or beard.",
            "NGL I think your 4 year old was in the right on this one",
            "Jesus. Maybe talk to your wife",
            "Can we not just be human beings naturally interacting with each other? What sane adult black woman would be offended by a child admiring her hair, regardless of what race the child was? I hope I’m not alone in finding it ludicrous that people feel the need to dissect this.",
            "Your daughter was correct.  No explanation needed.",
            "My morning are spent trying to get my hair poofy. I would love this complement!",
            "I think the only person who can really decide if it was offensive is the woman from the store.",
            "As a black woman, I’d melt if a child said this to me. Baby girl meant absolutely no harm at all.",
            "We took our 8-year-old on vacation this summer and he made a friend at the kids club. In the VERY CROWDED elevator on the way back to our room we asked how the kids club was, he excitedly said \"It was awesome! I made a friend and he's really nice!\" so we followed up with \"That's great! Tell us about your new friend!\" and our sweet sweet boy says loudly and full of intensity \"Well... he has black skin and he likes video games!\"\n\nHalf the elevator choked on their own laughter while the other half immediately started staring at their shoes. Kids are always awkward. Always. Later we had an interesting conversation about what we should focus on when describing new people we meet.",
            "[deleted]",
            "When my daughter was 4, we were on a train and talking about random stuff and she suddenly gets this wicked grin on her face and says, \"I like chocolate!\"\n\nThen she turns and looks right at the African American woman in the seat behind us and makes a series of biting gestures, complete with sounds effects, like she was mining taking bites out of this woman.\n\nTBH, the woman's skin was exactly the color of milk chocolate.\n\nThe woman's eyes got wide like WTF is happening and I was like, \"I am so sorry\" and then started in with my little girl about how she can't just pretend to eat people in public. Meanwhile my daughter is cracking up like she's made the best joke ever.\n\nWe got off at the next stop and walked for a while.",
            "It's endearing.... Nothing else.\n\nI'm African, as in actually born there and lived there until moving to Europe as a teen, Americans (including black Americans) are so annoying with seeing racism everywhere.",
            "In Scotland that would be quite offensive, but only because poofy means homosexual here.",
            "I once had a young kid say they loved my legs because they looked comfy. \n\nI do be a lil thicky and yes they are comfy, thank you for noticing. The intention was pure and I can't fault that",
            "I've had an kinda big afro on and off for years. One time at a gas station a little girl behind me said to her mom \"Look mommy it's a clown!\"\n\nI still laugh about that, wasn't at all offensive. Might get weird if it wasn't a kid though lol",
            "I'm biracial so I have my white mothers hair texture but all the volume (aka pouff) from my black father.  My hair is very curly and very big when I wear it down and I either get made fun or or told it's beautiful, but two words I can always remember it being called are pouffy and fluffy! I can tell you I'd be HONORED if your baby had complimented me! Four year olds tell it how it is with no filter on what they think so I'd take it as an extreme win lol. \n\nThat being said I DO understand your wife being cautious about it because not everyone has the same views and she doesn't wanna be put in a situation where it's \"you're teaching your daughter to be racist\". But 99% of the time people are gonna take that compliment and say thank you.",
            "When I was very young, my dad and I were standing in line behind a black lady who had long, beautiful cornrows to her waist. (I remember none of this, it's something my dad told me.) He said I was fascinated, and finally asked, very loudly, if my hair could look like that someday. He laughed and told me my hair would probably never look like that. The lady turned around to see what was going on, and my dad just shrugged and said, \"White kid from the suburbs.\" The lady laughed and laughed, then bent down to let me see/touch it. (This was mid-80s, somewhere outside Detroit.) Most reasonable adults can tell the difference between a kid being curious about something different from them, and a kid who has been taught hate. A 4yo is pretty innocent of all that, they're just learning the difference between red and green; skin color isn't much different, and they only know the historical connotations if they've been taught. In my experience, at least. Nothing wrong with addressing it, but I really hope Mom didn't discourage the curiosity. Curiosity breeds understanding, and understanding is the very basis of cultural acceptance.",
            "Stop assuming everything is offensive. It’s not.",
            "Your wife is overthinking it and probably spends too much time listening to the internet.",
            "Not offensive at all.. I think your wife is over correcting the wrong things.\n\nTheres one thing to teach your child to be polite and kind to everyone and then theres making them afraid to compliment someone under the concern of offending them because of the color of their skin.",
            "So cute that you have to explain how puoffy is pronounced l",
            "The kid is only 4. Don't start lecturing, she just gave a compliment. And a cute one I must say.",
            "Did the lady find it offensive?",
            "If she is 4, and said she loved it, thats all you need to know.",
            "It’s a young girl seeing hair she likes.\n\nThere’s zero malicious intent behind it. It’s not big deal.",
            "I'm Black, Black women are use to people commenting on their hair. Your daughter did nothing wrong. It's called \"The innocence of a child\"",
            "I'm Black with \"poof hair\" if a 4yr gave me that compliment I would accept it and say than you.  If a pre-teen on up said this to me or I believe any race then that would be a problem bc it's rude and they should have a better vocabulary and social skills.",
            "I'd probably be a bit uncomfortable, I'd probably be even more uncomfortable if the parent says anything. I know kids don't mean any harm when they say stuff like that so I've learned to laugh it off. \n\n\nI've had kids lick me to see if I'm chocolate. It was gross and funny. In that situation as a parent I wouldn't address race I'd address boundaries. Your kid shouldn't be licking people.",
            "The fact that she started with \"I love your hair\" and is a child so I imagine sarcasm was not in her nature lol, then anything that follows is a compliment.",
            "How did the lady react? That is really all that matters here. If the lady took it as a sweet compliment, then move on. No need to take it farther than necessary. It’s just important to teach your daughter to see the beauty in everyone. Which given her compliment, she’s on her way to being this way!",
            "Your wife is an idiot.",
            "You know what your wife did? you just made sure that your kid is going to be afraid to say anything around black people. Congratulations.",
            "There are a lot of layers to this because your wife has decided to make race a big piece of this, and you have decided that any compliment is okay due to the intent behind your daughter's words. We all know a 4 y/o will not have ill intent behind their compliments.\n\nHere is my question for you: if your daughter approached someone and said \"I love your belly! It's so round!\" What would be your next steps? Also, to points against your wife, does race *really* play a role in educating your daughter here? I have big naturally curly hair. While I am not offended by a child calling my hair \"poofy\", I definitely would be thinking about my frizz level for the rest of the day! Lol\n\nIt's completely okay for your daughter to compliment someone, BUT it is your job as parents to guide your children to understand what is an appropriate compliment and what is not, intent being second in command. No one is going to get offended by a 4 year old. But it's good to remember that one day your 4 year old will be a 16 year old going to school with people who look different than her. 4 years old is as good of a time as any to educate her (age appropriately) about how calling someone's hair \"pouffy\" may not be as nice as she thought. \n\nJust my two cents!",
            "I mean, it IS poofy... That's like saying how dare you point out that my dress is pink",
            ">Pouffy, is pronounced poofey. In case pouffy wasn't clear.\n\nthe word is poofy, fyi\n\nalso not really offensive, it's just a fact, and the kid said they liked it. Anyone taking insult from a child is probably gonna be grumpy no matter what is said.",
            "no, this is sweet. any sort of alienating comment or unwanted touching of her hair, or constant/hostile staring is what people are usually referring to when they talk about black women's uncomfortable interactions around their hair.\n\nthe kid saw something different and just complimented it. probably the best way to process something you're not used to.",
            "Pouffy coming from a 4 year old is sweet. Appreciate your wife trying to teach consideration and respect though! That is equally as sweet. If she said flat/straw like/thin/bald could be taken as offensive possibly, but not from a 4 year old, as long as she always knows you can look and compliment, never touch or demean.",
            "My five year old nephew just said to me that he likes how fat I am because it makes my hugs feel so nice. That was also not offensive because he's five years old.",
            "Im black, that's a compliment, I get my hair touched in public all the time, always love it,  ain't no way in HELL you gon tell a child that's racist. Now you listen to me, there's a difference between being racist, and stating facts, and she was just speaking facts.",
            "Feel like if she wanted to correct her she could have just said “that’s called volume” and agreed that the lady’s hair was nice. She’s describing what she likes using the words she knows, maybe add to her vocabulary if you’re worried about misinterpretations?",
            "doesnt feel offensive as a black person but i really respect your wife’s effort",
            "Don't be embarrassed, most people get that kids are genuine.",
            "It depends on the person- I grew up with people petting my hair and saying all sorts of things that made me uncomfortable so I’m always a little on edge about that sort of thing but that’s personal baggage. When she’s a little older you can try to teach about adjectives that people may not like and safer compliments - like you might say I love your freckles they’re so Annie the musical like! But someone might hate that comparison so maybe it’s safer to get your point across by using simple compliments. Or at least to not dig her heels in if someone says they personally don’t find the compliment flattering, if you run someone wrong just say whoops my bad.",
            "Your daughter was being perfectly fine because she is so young. With her small vocabulary at this time due to age, she associates that word with something positive. It's fine if your wife corrected her. I'm a teacher so sometimes kids don't have the right vocabulary word for things. When that happens, intention is everything and clearly she was just being kind.",
            "I would not interpret a 4 year old’s compliment as being backhanded.\n\nYou can relax.",
            "Nah it was fine. It was a descriptive word not an insult coming from a child. An adult however saying that would be rude. They should know better words, or just leave it as \"I like/love your hair\"\n\n\\-a puffy haired American",
            "[deleted]",
            "I'm a black woman, and I would not have felt offended. It's a cute comment!",
            "When walking to the library with my four year old, we saw an incredibly obese man.  My kid whispered to me, “He must never poop.”",
            "Im as white as a4 paper and would kill for any kind of hair complement",
            "It’s a learning opportunity. Your daughter said it out of place of excitement and enjoyment. Now, it becomes a chance to teach her that while we can find other people’s bodies interesting and attractive or amazing, there’s better ways to compliment them.\n\nChildren first start noticing racial differences between the ages of 4 and 5 yr old, and children of color recognize differences on the earlier end of this. This is a great time to start introducing your daughter to the fact that, yes, no one is exactly the same and that’s a good thing. \n\nThere are some great books out there for young children and how to they can note these differences and be appreciative and comfortable with them.\n\nIn effect, neither of you were ideally correct…your wife heard an innocent (even kind) comment and ascribed a negative to it that a child was incapable of fully understanding. Your impulse was to dismiss this, as though these differences don’t matter and aren’t something to mention. However, racial differences do exist, and if nothing else, society does treat people differently. It’s a positive thing to be able to use this as a jumping off point where you all can start to talk about this. Progress in racial issues, like many other things, starts at home.",
            "I think this gets at the heart of a problem that we used to not see as a problem.  It reminds me of that video of the white guy dressed as a stereotypical Mexican (sombrero, poncho, thick mustache) and he did a person-on-the-street interview.  All the white \"woke\" people found it offensive, while the Mexicans thought it was cool.\n\nOr when the 1932 film Freaks came out, people protested the film because they thought it was exploitive to people with disabilities.  The \"freak shows\" pretty much ended in the US for this reason as well, yet if you talked to these people, they didn't want people to come to their rescue.  They found a niche that made them a good living and it was shut down.\n\nTrying not to offend people is not necessarily a bad thing.  It comes from a good place.  But I think we need to have more open discussions with people to find out what they consider offensive.  \n\nIf that black woman loved her pouffy hair, it might be offensive to say that it's offensive to call it pouffy.\n\nCultures are constantly evolving.  We'll figure it out!",
            "I’m sure the black woman had no problem with this and if she did… her fault for having the problem.  What your daughter said was simply a compliment.",
            "That seems sweet! I am black and if somebody said that to me, I would be flattered!",
            "I’m pretty sure I accidentally called a Chinese woman some racial slur when I was 6 and she just smiled and waved.",
            "Give me a break. She's 4. And she liked someone's hair. For fuck's sake.",
            "Literally y’all white ppl need to stop being so scared lol your kids are allowed ask questions and if you don’t want them asking strangers of colors in fear of offending them, then maybe you should be talking to them about this shit at home and actually educating them. I feel like if you raised your kids to be *Correctly* anti racist, then you shouldn’t be scared or nervous about your kids intentions when talking to POC.",
            "Jesus fucking Christ, people are getting dumber and dumber. How the fuck is a compliment offensive?!",
            "Reading the comments made me realize y’all Americans Redditors are really traumatized with racism, touch some grass for real. Lmao 🤣",
            "The fuck race have to do with it? Kids are honest. She loved it. And I'd be correct the lady in question loved the compliment.",
            "There was nothing offensive about that, at all.  Your wife was wildly overreacting.",
            "Im gonna say something that might be unpopular. We need to stop finding reasons to find offense in the little things just as much as people need to sometimes consider what they say before they say it. The world is already full of even blatant hate. Sometimes people are legitimately trying to give a compliment - like your little girl here - and instead of understanding the intent its automatically taken to extremes. \n\nIm a Latina woman. My hair is extremely curly and poofy. In middle school the boys made fun of me and called me poodle and other names. It was offensive because they did it with malicious intent. In that case they were obviously being ignorant, not trying to pay a compliment. \n\nGot my revenge though. Once we got to high school I started learning how to style it, got cute clothes and they developed crushes on me and suddenly wanted to be with me. A real 90s teen movie moment. Not relevant to the story but it still makes me laugh to this day at the audacity of bullies.",
            "Was just a compliment",
            "Step 1- Grab your wife's phone\n\nStep 2- Uninstall Twitter and/or Reddit",
            "Pretty sure its a compliment.",
            "Sigh I have poofy hair 😅😅 but I wouldn’t care if a child called it that. More so if an adult said it…",
            "That was not offensive.",
            "That kid has no idea what race is. She just sees hair that looks different than hers and thinks it’s beautiful.",
            "I think people need to figure out what is an observation and what is criticism.",
            "Sounds very cute and non-offensive to me. Not so much an incident that happened with my boy when he was little. We ordered pizza delivery, and when the delivery person came, my boy asked \"are you a boy or a girl?\". I was a bit embarrassed and the delivery person said nothing. Honestly, I was wondering myself... I literally could not tell.",
            "This isn’t offensive that’s the best descriptor a 4 y/o has.",
            "I'm black. It was a compliment. It's fine. Sometimes my hair is poofs. It's not for every it seems.",
            "A little girl once told me she loved my hair and it reminded her of mini mouse when I had it in two pom poms. It’s not offensive at all & I even let them touch my natural hair (I even let adults). It’s my hair, it’s cool & I don’t see the issue with letting people be in awe of its coolness.",
            "Yea that’s not offensive, very cute. She’s a child, how else could she explain but the best way she can? Clearly she thinks the poofyness is beautiful.",
            "She's 4. She looks at it, it looks pouffy, she calls it pouffy. There's nothing racist about it. Now would it be correct for a 30 something to go up to that lady and say that, probably not. But she's 4 to her it was a compliment.",
            "Wait til she sees girls of a certain weight wearing Tweety bird t-shirts.\n\n𝘓𝘰𝘰𝘬, 𝘮𝘰𝘮–𝘴𝘩𝘦'𝘴 𝘴𝘰 𝘧𝘭𝘶𝘧𝘧𝘺…ⵑ",
            "As long as she’s not touching the hair or looking at the Black woman like a zoo animal you are fine.",
            "I wouldn’t think that to be offensive. When my daughter was 2 years old, I took her to a large city for the first time in her life (we live in rural countryside), and as we sat on a bench, a very dark skinned gentleman came to sit next to us. My daughter who has never seen a black person before, turned around to him and says “do you want to use our bath? you are very muddy” and pointed at his skin 😳 i was mortified and apologised profusely. The man was kind and just chuckled.",
            "Puffy isnt offensive if it's coming from a child. They're still developing their vocabulary. Main thing is to teach her not to randomly reach up in someone else's hair. I can't tell you the amount of grown women who just feel entitled to insert hands into my hair. Now that's highly offensive and inappropriate. Your child was admiring  the woman's hair and maybe your wife felt a type a way because usually when wht people use the term puffy for straight hair it's done so in the negative. I think its a good thing though that she cares enough to try and teach your daughter to be respectful to other people and differences.",
            "My favorite thing about your post is the comments saying\"if it's a kid it's fine, an adult though\" pretending like kids will just idk know this knowledge organically? Lots of things are compliments and rude. \"Wow you're so smart guess being Asian helps\" \"You beautiful black creature\" \"I love you're food! Tacos are amazing\" to a Hispanic. I'm of the opinion most people say these things and genuinely think they're complimenting but it's actually rude and puts people in stereotype boxes  and some borderline if not are offensive. I think you're wife is fine, yes it's just a compliment and I doubt anyone would be offended but people on here aren't a spokesperson for their whole race or group of people and it's important to teach kids young that there are correct ways to compliment and there are bad ways to compliment. Finally if it wouldn't be ok for a 18+ to say it's probably safe to tell kids it isn't because they're just going to keep doing it if no one stops to instruct them.",
            "It's a four year old, who cares. But it does get annoying as a black woman constantly hearing how poufy, frizzy or fluffy your hair is. Nobody ever says my hair is beautiful or cute, it's always \"omg ur hair is so big\" followed by them trying to pet me like a dog.",
            "Coming from a little kid, I’d laugh and say thank you and make it a positive moment. If mom wants to make it teachable that’s a parents prerogative. I’m not offended by kids being kids.",
            "My best friend who just passed recently had the biggest fro.. He used to get uncomfortable when people would come up and try touching his fro but loved the compliments on his hair.. Don't get offended on other people's behalfs because it just makes you look condescending... Also cherish every moment you have with people..",
            "It’s not offensive in my opinion for these reasons:\n\n-\tHer intention is to compliment\n-\tHer vocab is limited (at that age) so she’s describing something the best she can\n\nSo your edit about ‘age’ and if at a certain age this becomes offensive? I would say maybe at a certain age, it is expected that one should have a larger vocabulary and can either use the correct term or describe it better (though pouffy isn’t that inaccurate).",
            "Welcome to this world. Where you're not sure if it's okay to be nice.",
            "Children are not born with hate or bias, their parents give it to them.",
            "I think that at 4 years old it a genuine compliment and very innocent as it should be. As a adult though and growing up there are things that should be phrased differently. If. 30 year old came up to me and said that I wouldn’t be offended but would definitely know that someone would be. And really doesn’t have anything to do with race as depending on your genes anyone can have poofy hair. I wouldn’t worry about it.  There doesn’t seem to be any negativity behind what she said.",
            "This is adorable coming from a kid. Pending vocal tones as adults, this could be took the wrong way. After a certain age, things get weird. I remember having a Afro in middle school at a school where there were like 25-30 black students. Kids would ask to touch my hair. Shit was mad awkward though to them it’s something they’ve never been around in their life yet.",
            "A 4 year old isn't going around being a sarcastic dick to people just for the lulz.  If you ever find a 4 year old that's an asshole it's because it's parents are pieces of shit.\n\nI think people are saying \"As a 4 year old\" because as I've stated earlier 4 year olds aren't sarcastic assholes.  Kids generally don't become assholes until 4th grade.  I know, I work with kids and see them be pieces of shit to each other when parents aren't' around.",
            "A lot of the time it's the adults who make it weird.",
            "She’s a kid. Come on a 4 year old knows nothing of racism. (I would hope)",
            "She got triggered lol like a 4 yr old is doing it to be racist???",
            "She said she liked it and what she liked about it. No way to be misconstrued.",
            "She’s four - she doesn’t know what racism is.  The only people who will call this racist or offensive are white people.  It still wouldn’t be offensive or racist if a teenager said it, though I personally wouldn’t compliment someone’s hair by calling it poofy simply because that’s a childish way to compliment someone… not because it’s offensive or racist.\n\nWhite people just love to be offended for black people.",
            "Pretty sure reddit is not the best place for adviceon these things.",
            "My daughter saw her first black man with dreads when she was 2 almost 3 and said “Mama! That big chocolate Daddy has snakes in his hair”",
            "As a black\nWoman, I don’t find it expensive, kids don’t always know how to give proper compliments but you know it comes from a place of love, I do appreciate the mom trying to teach her however it’s not a big deal at all. 😁",
            "You and your wife were both correct. Your daughter was paying an adorable heartfelt compliment, and that behavior is to be encouraged and praised. \nHowever, a teachable moment also presented itself. Political correctness is important. Words can hurt, even without intent or malice. It’s not ok to say something that hurts another person just because it was not your intent to hurt someone, or because “it’s true” therefore it no one should be hurt or offended by it.",
            "\"As a white male\"...\n\nLook at how they pussified you. Like you can't have an opinion before crushing your own testicles first.\n\nJesus."
        ]
    },
    {
        "post_id": "vt6q2i",
        "author": "CompetitiveArt2138",
        "title": "How to report a 911 Operator?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/vt6q2i/how_to_report_a_911_operator/",
        "score": 17168,
        "num_comments": 588,
        "created_utc": 1657158483.0,
        "selftext": "Someone I know is a 911 operator and tells everyone who will listen all about her calls. Names, addresses, medical information, really horrible things. Rape, murder, suicide attempts. Has even called from her personal phone someone she knew  who called 911 about suicide and told them she was their operator.\nShe even uses the police systems to look up people and find out about them. Also a no no. \nWe live in Georgia. How do I report her anonymously?\n\n**EDIT**\n\nThank you for the awards, yall. But mostly thank you for the advice. I appreciate your help in helping people in my home county.",
        "permalink": "/r/NoStupidQuestions/comments/vt6q2i/how_to_report_a_911_operator/",
        "comments": [
            "Retired 911 dispatcher here to say she is breaking numerous laws (federal, state, and employment) which she is 100% aware of as she has to sign an annual, legally binding document explicitly stating she will not do exactly this (most especially the looking up people.) She is going to get fired, and will most likely be prosecuted for more than one federal felony if the investigation uncovers that she’s done this *even once*. \n\nThank you for not being ok with her behavior, thank you for asking for advice, and thank you for protecting the public from the threat that she most certainly is. Her employer needs to be notified, and it is 100% best that you **do not** provide *any* information to anyone in dispatch. Call their non-emergency number (you’ll get a dispatcher, do not tell them anything) and request to speak with the on-duty supervisor regarding filing a formal complaint against an employee of the department. At this point, it is illegal for the dispatcher to ask why/who/what for or to pressure you in any way. They may transfer you immediately, or need to call you back (depending on how large their department is/if they have a department or officer dedicated to handling complaints/or due to volume/type of incidents they’re handling at the time of your call), or they may ask you to come in in person. They’ll want your phone number, but you can request to remain anonymous and most agencies will not require more given the nature of your call. They will 100% want to know so even if you meet resistance at any point initially, be firm, confident, calm, and consistent in stating that you will only speak with the on-duty supervisor/watch commander.\n\n**Make sure not to call while your friend is on duty.**\n\nThe department will be required to have an external agency investigate/do an audit, and that agency will notify all appropriate governing bodies about any violations. There are systems in place at every LE agency to deal with exactly this sort of situation, and they will be far better equipped to handle contacting whoever needs to be contacted than an individual citizen. \n\nIf, for *any* reason, this department is so podunk that you’re concerned about it being covered up, or if you are refused a meeting (either by phone or in person) or are forced to provide the specific reason for your call by anyone other than the watch commander/supervisor, simply hang up, and contact a separate, parallel county or state agency. \n\nAnd again, thank you for taking this next step. What she’s doing is a gross violation (ethically and legally) and you are inarguably correct in reporting her. She needs to be stopped, like yesterday.",
            "Accessing LE databases for non-LE reasons is generally a very serious offense. The other things you mentioned could get her fired, but this could probably get her charged with a felony.",
            "That’s a HIPAA violation. [You can learn how to file a complaint here](https://www.hhs.gov/hipaa/filing-a-complaint/complaint-process/index.html)",
            "No idea what to do, just wanted to say thank you for working to stop someone who is exploiting the privacy and vulnerability of people she should be protecting.",
            "Call the non-emergency police line that has jurisdiction in the area in which she works",
            "[deleted]",
            "Call the agency (police, sheriff, state patrol) she works for and ask for the “GBI or NCIC coordinator”. Tell them. Also google GBI or NCIC reporting phone numbers regarding her looking people up. All of those inquiries are recorded in the state and federal computer systems. You, as a Dispatcher, have to prove (CYA) that the search you did in that system was used for “police purposes” only. If not, you will lose your clearance to that system. You can’t be a dispatcher without this clearance. We train and test on this every 3 years with massive warnings to not abuse the system. They take this very seriously. Depending on her infraction she could be fined and jailed too. \n\nAs for the other stuff it’s not professional to tell everyone’s business but it’s not really a crime. Maybe the HIPPA stuff, but that’s harder to prove cause we tell the stuff on the air and there’s scanners the public can hear and we tell other agencies (like fire dept, ambulance, flight for life, etc)  this stuff so it’s kinda protected a bit. \n\nBut running and sharing info in the “clearance system” is illegal and provable. \n\nSource: Retired 20 year police dispatcher.",
            "911 operator here report her to the director of the center, high up as you can go. If the center is under the jurisdiction of a police agency email the chief of police. If that doesnt work try city counsel, shoot the mayor a call. \n\nFuck this person as hard and as ungently as you can.",
            "you can do the following things:\n\n&#x200B;\n\n1). you can go directly to the police station she's in or one nearest to you and report her to them.\n\n&#x200B;\n\n2). you can call the non-emergency number to that goes directly to a police station nearest you and submit a report.\n\n&#x200B;\n\n3). you can file a complaint to the [HHS.gov HIPAA Complaint Form](https://www.hhs.gov/hipaa/filing-a-complaint/complaint-process/index.html) and file it there i would directly try the top 2 first before filing a complaint you can do it after as well",
            "Find out what agency they work for. Call and report it to a higher up (Captain or watch commander ideally). Even better if you can get in touch with the internal affairs bureau of their agency.",
            "Report her to her agency. I am also a 911 operator and we have fired people for less. People trust us to keep them safe and that is just disgusting.",
            "Call police headquarters and talk to IA. That's a huge privacy concern.",
            "I work for a 911 center and find this absolutely disgusting. Go to [Police Locator](https://policelocator.com) and choose your state and then the county she works for. Call the number listed and ask for the administrative line. If it’s a larger town, their 911 call receivers likely won’t be answering that number. Small towns, though.. you never know. When you call that number, ask to speak with a 911 supervisor.  I don’t work for an actual law enforcement agency; our 911 center is separate from our police department, but we do dispatch their calls.",
            "When I was in high school here in Texas, I got a speeding ticket one night. The next day at school, another student I barely knew asked me about my speeding ticket. Apparently his mom, who I'd never met, was a police dispatcher and told him about it. Never met the mom, barely knew the son, and she felt the need to give him my name and what I was charged with in the very short time she could have had with her son either before he went to bed after she got off work or before he went to school the next morning. I was flabbergasted and very angry, but had no recourse.\n\nThis unfortunately happens all the time. I've made friends with, or already had friends who became, policemen, firefighters, and paramedics, and the stories they have told me over the years have violated so many HIPAA rules, it's ridiculous. Texas is wildly corrupt and disregarding of any decency or privacy.",
            "Maybe get proof of the claim before acting. When worst comes to worst it is best to have a recording/text receipt of the interactions than just your word v theirs.",
            "Most likely the center is ran by the sheriff.  Give him a call or an email.",
            "You should contact your Inspector General.  They are charged with investigating misconduct.  The State one is below.  911 Services may be run by a particular county.  If so, the State Inspector General can tell you who to contact.  \n\nhttps://oig.georgia.gov/report-fraud-waste-abuse",
            "Former 911 dispatcher here, her behavior is absolutely reprehensible. Like others have said call when you know she's off duty and ask to speak to the watch commander or the director of 911 even. If that fails contact GCIC through the GBI. They take abuses of that system extremely seriously and rightly so. It's a privilege to be trusted to use that tool, and she has broken that trust and deserves the consequences. Many of us talk about calls to our family, its a good way to vent the stress and deal with the vicarious trauma we experience from taking them, however it's never ok to give specific names, addresses, or medical diagnosis to someone. Things should always be kept general like oh I had a crazy caller who thinks there's a dwarf living in her walls, or I took a really nasty call where the patient didn't make it and could use some help. It sounds like your friend is in 911 for all the wrong reasons and I hope they find a new job soon, all they're doing is dragging down the profession.",
            "If you are afraid of backlash or inaction by local law enforcement or city government my advice would be to reach out to the Georgia Inspector General's office. They may or may not be the ones to handle the case but if you inform them that the concern is with emergency services and local law enforcement they may be able to get you to the right people. \n\nhttps://oig.georgia.gov/",
            "If this is true this is an extreme offense and she should br fired and have a lawsuit",
            "Report it to local police internal affairs probably.  I would also report her anonymously.  Everyone knows each other in smaller cities.  It will somehow get back to her if you report it.",
            "The software I'm familiar with logs your searches and inquiries. They can be audited at any time and you need to be able to explain why you looked up what. A bunch of officers looked up a \"hot\" female officer's photo in the system and that caused a shit storm in my state.\n\nJust know, you're spilling the beans on \"their own.\" It can get buried. There have been officers who've shared photos of crime scenes with women, thinking that'd impress them. But considering they're just a Dispatcher, I don't see why they won't get burned unless some important people REALLY liked them.",
            "These are felony offenses, ask to speak to the dispatch manager or on duty police lieutenant",
            "Federal laws being broken. Turn her in.",
            "911 Call Centers are often under the authority of the County Commission or similar governing body.  Start with the County Commission (or your equivalent) and the Office of Emergency Management (OEM).  As you search through their site for the right office, be aware that 911 Call Centers are also known as Emergency Communications Centers or Public Safety Communications Center.",
            "Also as a consideration, they may be in need of extensive counseling, as with the job comes the constant exposure to the worst times of another humans life, and in great frequency.   There may be little to keep psychologically sensitive humans from crumbling under the existential weight of it all.  \nGood luck.",
            "It sounds like she has access to NCIC which is a federal database. Report them to the FBI\n\nhttps://www.justice.gov/actioncenter/submit-complaint",
            "Who polices the police? The police police 😎. But who polices them? Well I guess that would be the police police police who police the police police. In other words, police police police police police police.",
            "\"We live in Georgia\" Check out.",
            "I haven't looked through it, but a quick Google search brought me to [this](https://classroom.synonym.com/) site. Give it a read, it might have helpful information for you.",
            "I hope she enjoys prison.... Fucking wild",
            "I'm sure the GBI would love to hear about this",
            "Call your local non-emergency number and you can ask them if there is a form to fill out or have them transfer you to dispatch and ask for the supervisor to file an official complaint",
            "Report it to GECA. Georgia Emergency Communication Agency, under the GEMA umbrella or report it directly to POST.",
            "Of course all the information is available if you request it. At least in my state with sunshine laws\n[http://myfloridalegal.com/ago.nsf/Opinions/9AAB8B6093729F9685256242004ED8FE](http://myfloridalegal.com/ago.nsf/Opinions/9AAB8B6093729F9685256242004ED8FE)",
            "she's breaking federal laws about privacy and personal information tell the authorities",
            "You can call the non emergency line to the 911 center she works in. Literally just ask to speak to a manager. Report any details you know that they can link to real calls. You’ll needs dates, names, addresses, call types - any combination of those. Tell them about the phone call she made. Beyond HIPAA, these are major confidentiality and ethical violations. I can’t believe she called someone on her personal phone to tell them she was their dispatcher. \n\n-former dispatcher",
            "In addition to HIPAA, using the police system for curiosity is also against CJIS regulations.",
            "I'm sorry that I can't help, and there are many professionals below who know the proper answer. \n\nThis situation reminds me of the Latin phrase \"Quis custodiet ipsos custodes?\"\n\n\"Who guards the guardians?\"",
            "Call 912",
            "Using ncic for personal reasons is fireable on the spot and possibly a felony",
            "Depends on who she works for. I can tell you in GA I'm pretty sure using criminal information systems for non work related is jail time and 10k fine. You can always look into GCIC (GA Criminal Information Center) to file a complaint.",
            "just thinking out loud, but the system access (looking up people) can be confirmed through logs, the calling people from her personal cell can be confirmed if they get a warrant for the logs.  The verbal is going to be tougher unless you have video or go get sworn statements (which kind of nixes the anonymity of it).",
            "I just want to say thank you for standing up to uphold our code of ethics. It takes brave people like you to use their voice against injustice to save the world. Every one that's a bystander and turns a blind eye bc \"it ain't their business or affect them\" is the reason the world is in so much pain",
            "Go to the website of the phone cpmpany, About is, contacts, email chairman or investor relations",
            "I commend you for doing the right thing! One thing I hate more than a blackmailer is a snoop",
            "What state are you located?\nThis is reprehensible behavior. \nI am a 911 Dispatcher with 20 years experience and there is no excuse for this.\nDepending on who 911 operates under you will need to contact their administration. It may be the Sheriff's Dept, Fire, City police or a consolidated 911 center.\n\nI'll be happy to assist in anyway.",
            "Sadly this isnt unusual.\n\nI know police officers and doctors who tell everyone everything about you. Sure if you are a random person they wont say the name. But it goes often like that:\n\n\"Remember the math teacher we had? He died from overdose last week. Also he had xyz\". \n\nThats why i wont trust anyone and avoid doctors that are friends of the family",
            "Check the local law & record her first. If it's a one party consent state you send that to DA",
            "Inside addition.  Bonus if you have proof.",
            "i would call the cops tbh",
            "This is highly illegal",
            "You can report a police dispatcher to their Internal Affairs Bureau. There are federal guidelines that must be followed and if the dispatcher is accessing the department computers for personal reasons,  the department can be fined and loose accreditation. If that happens, the police department would not be able to access any federal databases, which would stop the whole department from running any person, even for legitimate reasons.",
            "> Has even called from her personal phone someone she knew who called 911 about suicide and told them she was their operator\n\nWas it at least to check up on them or just be an asshole about it?",
            "Are you in Liberty County, GA? This sounds like someone I know.",
            "Contact the Governor's office and the GBI I'm sure they would be more than willing help. Also the 911 operator knows that everything they are doing is against the regs and law they literally shit the bed when it came to the responsibility of their job.",
            "Please report them and make an example of them.",
            "Many counties and big cities have anonymous call in numbers where you can leave anonymous tips about crimes. \n\nhttps://www.wetip.com/submit-a-crime-tip/",
            "Just call or write to the comm center director. But unless you give proof, its likely to end in a talking to (at best).",
            "Call 911",
            "Contact your councilman/woman or mayor directly.  Some people may advise to start with the chief of police, some, but nit all, of them protect their dispatchers like an officer.",
            "Have you confronted this person to say her behavior is not okay? I'd imagine she gets off on sharing these details with people, but if others just go along with it or seem interested, then this may be enough for her to continue in her ways. If you care about this person in any way (not sure of your relationship), speak bluntly with them first to warn them you will go to the police if her behavior continues.",
            "that asshole voted for MT Greene, you KNOW it",
            "I live in Georgia. Go to the county sheriff's office",
            "I'd be wary of her having friends in local law enforcement. Maybe send a tip to the local news media and/or federal/state law enforcement agencies.",
            "I reported a dispatcher for being really cold and shitty to me when I called last summer for a grill fire. I’m pretty sure I just googled my way to finding a phone number. The person I talked to said there likely wouldn’t be any repercussions.",
            "Georgia the country or the state?",
            "Georgia USA or Georgia sakartvelo?",
            "You could find out what company they work for or file a police report. I've filed hippa compliants and nothing has come of it.",
            "Report this to the State Police, they will investigate.",
            "Step one: \n\nCall the agency, ask to speak to a supervisor, and tell them this story. All phone calls, keystrokes, and radio transmissions are logged. If they use their personal cell phone on company time and discuss details that should not be discussed, that can be subpoenaed. \n\nStep two, as mentioned: HIPAA violations galore. The local employing agency can take care of this, as well as the…\n\nStep three: State DOJ arm, which will look into misappropriation of police systems, including medical records, RIMs databases, NCIC databases, ORI databases, DMV and Criminal justice databases. Most agencies have to keep a log of in depth research into criminal history, and misuse of these systems ranges from a misdemeanor to a felony.\n\nReport them.\n\nEdit: a word.",
            "What county in Georgia?",
            "Call 911 and ask for the manager",
            "Id go to the press before i go to the police. That way if the police try to sweep it under the rug the press can run the story and hold them accountable",
            "Don’t dispatchers fall under internal affairs?",
            "Call 911 to report this.",
            "Tried calling 911?",
            "Have you talked to that person ? Maybe you could achieve the same end-result without having to deal with the whole system.",
            "Why anonymously?\n\nPresumably they're a huge piece of shit because of their behavior, why would you even entertain the idea of maintaining a relationship with them?\n\nWalk into the station where they work and ask to talk to their immediate supervisor, or even *that* person's supervisor.\n\nTake it as high up as you can manage.",
            "[removed]",
            "Hippa!!",
            "Oh HIPAA\n\nI just want to see the bot...",
            "HIPPA",
            "Snitch",
            "A simple google search would point you in the direction but I guess that’s not as fun as getting on the internet to talk shit and farm karma with strangers.\n\nWhy is this website so driven by rage bait?",
            "Obviously it's not a good thing, but if you think they don't vent about that shit to coworkers or others you're just naive.",
            "Just call 911",
            "Why don't you just explain how serious what she's doing is before trying to get her life ruined?",
            "You can’t. They’ll stake out your house and bully you if you try and stand up to a pig",
            "If you waited til she died, it would be a violation of HIPAA -posthumous",
            "[removed]",
            "I would recommend minding your own business",
            "[removed]",
            "[removed]",
            "[removed]",
            "This means s incredibly common, same with nurses and admin workers for hospitals they all gossip and talk about the shit they know even though they know it's completely illegal.",
            "I don't think you can?  \n\n\nAFAIK and have read from [https://naemsp.org/NAEMSP/media/NAEMSP-Documents/Annual%20Meeting/MDC%20references-multi-year/MDC-OTHER-REF-21-Legal-opinion-EMS-patient-communications.pdf?fbclid=IwAR1mo5HXN7XTkovET0WV4mTpa8ZK6VpGKK6fGcUKPB2FIlQybpVoO7jdcDI](https://naemsp.org/NAEMSP/media/NAEMSP-Documents/Annual%20Meeting/MDC%20references-multi-year/MDC-OTHER-REF-21-Legal-opinion-EMS-patient-communications.pdf?fbclid=IwAR1mo5HXN7XTkovET0WV4mTpa8ZK6VpGKK6fGcUKPB2FIlQybpVoO7jdcDI)  \n\n\nyou don't need to be HIPPA certified to be a dispatcher. so get fucked.",
            "I'm pretty sure this is only a problem if they're using real names and addresses. I don't think it's against the law to talk generically about things that go on but obviously if it's personally identifiable stuff that's a major problem.",
            "[removed]",
            "[removed]",
            "[removed]",
            "What a narc.",
            "call the non emergency number and ask to talk to a supervisor",
            "It's a violation definitely- if it isn't now it should be wth.",
            "Contact Georgia State Police or FBI",
            "Might want to consider walking into the police station and filing in person. You can probably still do it anonymously, but if you call then a case number will be generated by CAD and it’s just a risk worth avoiding",
            "I assume you go to the police department or file a complaint online.",
            "Sounds like a Lifetime movie! Seriously,  this is horrendous 😢!",
            "The state patrol is over that database. Let the state know what is going on and they will yank the license.  Big no no and it's need to know info only. Lot of information is contained in there about yourself."
        ]
    },
    {
        "post_id": "rxk0ng",
        "author": "None",
        "title": "Can I become famous but never show my face?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/rxk0ng/can_i_become_famous_but_never_show_my_face/",
        "score": 17160,
        "num_comments": 6048,
        "created_utc": 1641490360.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/rxk0ng/can_i_become_famous_but_never_show_my_face/",
        "comments": [
            "[removed]",
            "Loads of faceless YouTubers with huge followings - as well as the more traditional celebrities that people have mentioned",
            "Buckethead",
            "Didn't daft punk always remain anonymous?",
            "Plenty of YouTubers out there that make quality content, tons of subscribers, and never show their face.\n\nEdit: I'd like to suggest [aloneintokyo](https://youtube.com/c/aloneintokyo) as a great Youtuber who not only hasn't shown their face but has also never talked in their videos either. They do Rust gameplay videos with some great background music going at the same time. Sounds basic, but their videos are very popular and entertaining.",
            "Banksey. Yes you can.",
            "There’s plenty of famous streamers who have yet to do face reveals.",
            "Thomas Pynchon! Famous author who’s novels often are in college literature courses. Never been photographed above the age of ~20, no known location of residence, has lent his voice to The Simpsons playing himself with a paper bag on his head.\n\nEdit:\n\nhttps://youtu.be/QcYXWfGt7DY\n\nhttps://youtu.be/-Ds4OLUDIvg",
            "[removed]",
            "TheDooo",
            "Daft Punk.\n\nLiterally any VTuber.\n\nCorpse Husband.",
            "MF DOOM",
            "Orville Peck!",
            "HowToBasic lol",
            "Most certainly you can, look at John Cena he’s super famous and no one’s ever even seen him",
            "Marshmellow",
            "Slipknot and Sia would both indicate you can",
            "The Unknown Comic\n\nDaft Punk\n\nGorillaz\n\nKiss",
            "Depends on how famous, but you could surely get some decent recognition",
            "Satoshi Nakamoto",
            "Ethoslab is on the lower end if famous and had never shown his face.",
            "Like D.B. Cooper?",
            "I have a 4 year old daughter and she knows all of the girls who play with kids toys and stuff on YouTube. They never show their faces lol prob justsmoke a ton of weed",
            "[Allow me to introduce you to the biggest Mexican Celebrity possibly ever, El Santo.](https://youtu.be/eqx9eoEvuoo)",
            "Sia did it. Daft Punk did it. Many people have no idea what authors or movie directors look like. You could voice act. Nobody knows what Banksy looks like.\n\nIn short, yes.",
            "you could become a masked Luchador",
            "Create an account called the-real-Q and make obvious conspiracy theories posts to a low iq crowd.",
            "Depends on the level of fame you're going for but off the top of my head I can think of a few.\nDaft Punk,\nBuckethead,\nThe Suited Racer",
            "Why do people keep saying Sia? I just googled her and the first thing I saw was a picture of her face.",
            "BlindBoy wears a plastic bag over his head.",
            "Satoshi nakamoto",
            "Is your name Satoshi?",
            "John Cena.",
            "Corpse husband",
            "[removed]",
            "Blue man group is an example",
            "i mean yeah im sure theres plenty of people out there. \n\ni know PornHub has accounts w millions of subscribers and there people dont show there face, also voice acting i mean im sure you can look up what most of them look like but realistically its not in the job requirment",
            "Corpse Husband did it",
            "Become the drummer of Coldplay.\n\nEverybody knows that Coldplay has a drummer, but does anyone know that his name is Walter Cahill? Well, it is Will Champion. And even fewer might actually be able to identify his face. Everybody in Coldplay makes the same, and willing to bet you will be able to attend similar if not for all the same parties.\n\nWill Champion was apparently invited as an extra to Game of Thrones, where not only nobody recognized him, but everybody thought he was an average extra. He even portrayed a drummer. But nobody made the connection.\n\n[Credits to Nish Kumar.](https://www.youtube.com/watch?v=gsmuV7wLCl8)",
            "[El Santo](https://en.wikipedia.org/wiki/El_Santo) literally wore his mask to attend his own funeral. They buried him in it. How famous was he? Well, from Wikipedia:\n\n>Rodolfo Guzmán Huerta (23 September 1917 – 5 February 1984), known profesionally as El Santo or in English The Saint, was a Mexican Luchador enmascarado (Spanish for masked professional wrestler), actor and folk hero. El Santo is one of the most famous and iconic Mexican luchadores, and has been referred to as one of \"the greatest legends in Mexican sports\".\n\nSo, yeah. You can be a literal legend without showing your face.",
            "gaming youtubers",
            "I present to you: Corpse Husband. A YouTuber who, despite never revealing his face to the internet, manages to run a successful live streaming account, YouTube channel, a musical career, etc. \n\nThe downsides are that due to the increase in his popularity, he deals with constant social anxiety and is sometimes too afraid to leave his house. This and the fact that he has a very distinct voice also puts his mysterious identity in jeopardy, which adds to his anxiety, as you can imagine. \n\nBut yes, it's definitely possible.",
            "Yeah, you just gotta be Anonymous",
            "[removed]",
            "Have you ever heard of Technoblade",
            "Gorillaz, Banksy, Daft Punk, Sia, Dead Mau5, Gwar",
            "Burial…",
            "Vtuber",
            "Corpsehusband",
            "you can. Look at daft punk, while we've seen their faces, they pulled it off for the most part and have been largely incognito since",
            "Satoshi Whomever who founded Bitcoin.",
            "Marshmello!",
            "Sure. Wear a paper bag on your head like the alien in Futurama...it worked out great",
            "Banksy",
            "Vtubing. Write a book, under a pen name if you don't want people to know your real name. Draw/animate porn. Be a YouTube hand channel."
        ]
    },
    {
        "post_id": "9nafsc",
        "author": "kazablang",
        "title": "If I legally changed my name to Babe Ruth, then made a career selling 'baseballs signed by Babe Ruth' would that be illegal?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/9nafsc/if_i_legally_changed_my_name_to_babe_ruth_then/",
        "score": 17131,
        "num_comments": 800,
        "created_utc": 1539268045.0,
        "selftext": "Like, technically it's true, and you would make quite a good profit.",
        "permalink": "/r/NoStupidQuestions/comments/9nafsc/if_i_legally_changed_my_name_to_babe_ruth_then/",
        "comments": [
            "[deleted]",
            "This reminds me of Pete Best. Formerly the drummer of The Beatles, he released an album titled \"Best of the Beatles\". Fans of The Beatles mistakenly bought it, thinking it was a collection of Beatles songs, but oddly these duped fans and The Beatles themselves had no recourse.\n\nIt was completely legal. There was no confirmable evidence he took extra steps to mislead fans, as everything about the product was factually true. His name was Best, he used to be in The Beatles, and it was all his music. If any part of this was false or altered intentionally to mislead customers there would have been grounds for several groups to seek legal action.",
            "[deleted]",
            "If you're misleading them into thinking it's signed by the original babe ruth, yes, that's a crime. It's called fraud.\n\nIf you made it clear (or well implied) that it's signed by you, maybe not. ",
            "~~Contracts are only valid if there is a \"meeting of the minds,\" meaning that both sides have at least a similar understanding of the underlying deal.~~\n\nYour example would be like naming a pig \"horse,\" and then selling it to someone for the price of a horse. When they received the pig, whether illegal or not, they could at the least go to court and reverse the contract, forcing you to give back the money and them to give back the pig.  \n\nThat's what would happen here, most likely.  If the police could then show that you were deliberately misleading people about what they were buying as a way to cheat them, it might also be a species of criminal fraud.",
            "If your name was already Babe Ruth, you might be fine as long as it wasn’t specifically about the Yankees and you didn’t copy his signature. The act of changing your name with the intent to be deceptive would hurt your case a lot",
            "As long as you aren't claiming they are from the original Babe Ruth, it's probably legal. However no one will buy it unless they believe it is from the original Babe Ruth, so good luck selling them. ",
            "- You understand that autographed memorabilia from celebrities can be sold for value? Yes\n- You know that Babe Ruth was a celebrity? Yes\n- You know that Babe Ruth was famous for playing baseball? Yes\n- What was the name you were given on your original Birth Certificate? Kazablang\n- Did you legally change your name to Babe Ruth? Yes\n- After you changed your name to Babe Ruth, did you begin autographing Baseball related merchandise and market it as \"Signed by Babe Ruth\" with the intent to turn a profit? Yes\n\nNot a good idea. This is how a case would be made that you had intent to defraud.\n",
            "Did you lose your step dad's signed ball over the lot fence, OP?",
            "\"Babe Ruth\" is a registered trademark:\n\nATHLETIC APPAREL, NAMELY, SHIRTS, PANTS, JACKETS, HATS AND CAPS, ATHLETIC UNIFORMS; BOTTOMS; JERSEYS; SHORT SETS; T-SHIRTS; TOPS. FIRST USE: 19860411. USED IN ANOTHER FORM\n\nhttp://tmsearch.uspto.gov/bin/showfield?f=doc&state=4806:popd9e.2.4",
            "As far as I can determine, it wouldn't be illegal to sell 'baseballs signed by Babe Ruth', but it *would* be illegal to change your name to Babe Ruth for the purpose of selling said baseballs. It's illegal to change your name for 'fraudulent' purposes, and even though what you propose to do wouldn't be illegal per se I think most judges would agree that it would constitute a 'fraudulent purpose'. As part of your name-change hearing you would have to state in court your reason for wanting to change your name to Babe Ruth - meaning that you will either have to admit to wanting to dishonestly sell baseballs or lie and perjure yourself. You'd be risking jail time with every sale of your baseballs, because any angry customer could turn around and sue you and it would be very easy to claim that you did in fact change your name in order to start the business.\n\nIf you were born with the name Babe Ruth you'd be perfectly fine, though.",
            "It wouldn’t be the same signature and authentication of the baseballs would show that’s it’s not “the Babe Ruth",
            "I has an awkward last name, and changed it before getting married to not pass that name along to my wife.  In the United States, you generally have freedom to change your name to your liking.  One notable exception is if you selected name is offensive or violent in any way:  you can't change your name to \"Swede-killer\".\n\nIf you were merely a baseball fan, you could change your name to Babe Ruth.  But changing your name to someone else's, *for any commercial purpose*, would be illegal, and would result in your name change being revoked.  The example that I remembered was that you could change your name to \"Frank Sinatra\", but you could not do a tribute act under that name.\n\nAlso, if it were assumed that the baseballs that you were signing were actually *the original Babe Ruth's signature*, you could be charged with fraud.  As it is, you might have problems violation the copyright of Major League Baseball, as well.\n",
            "My guess is if it can be proven that you are deliberately trying to fool people into thinking they were buying a signature of the Great Bambino, you could have a lawsuit on your hands. \n\nEspecially since your signature will likely not match, and if you try to fake his signature that’s a whole other can of worms. ",
            "r/nathanforyou",
            "\"You were coached by THE Hank Aaron?\"\n\n\n\"I was coached by *a* Hank Aaron...\"",
            "[deleted]",
            "A lot of people on Ebay/Amazon/etc. will sell something, but then have a whole description on the bottom saying that they are only selling a picture of it, with the weight, length, etc being only of the picture and not the item in the picture. I believe they get away with that as long as that’s all accurate. I’m sure you could do the same with a signed baseball and rely on people that didn’t read the description of the product.",
            "Who’s babie ruthie?",
            "Who's baby ruth",
            "One of my family members has the same name as a famous football player and he gets stuff in the mail to sign and he usually does and sends back ",
            "Do it. We expect an update. ",
            "Reminds me of this case on Case Closed (Caso Cerrado) on Spanish TV where the defendant sells a colonoscopy kit on her website that’s FDA approved, but when probed about it confirms it means it’s Frederica Diaz Antonia approved (her name). Needless to say she lost the case and got arrested. ",
            "You'd have better luck if you made it a parody. FOOTBALLS SIGNED BY A BABE RUTH! ",
            "Let me turn off trending",
            "I am not a lawyer. If you sell them for a reasonable price and make it clear it’s not the famous Babe Ruth you would more than likely be fine. Any attempts to imply it’s by the baseball player or any attempts to obscure would make it an attempt to defraud and would make it illegal.",
            "Changing your name with the purpose of committing a fraud is in itself a crime.",
            "Intent to deceive is a crime. You’re literally admitting to doing this to deceive people into buying it. Nothing you do will mitigate this intent, since it’s the core of your business plan. \n\nIt’s more likely you’d simply be ignored though. If this was profitable people would be doing it (and probably already are).",
            "When I was in middle school my lockers were next to Carl Marx (spelled that way) and Ian Flemming. My name is Patrick Duffy. It was a true never tell me the odds moment. Also I worked with a Tom Petty a few years ago.",
            "I think that would fall under the \"idiot in a hurry\" legality, where if an idiot in a hurry could mistake your product for another, it's probably illegal ",
            "Sot his whole post is just OP wanting advice on how to scam people and people are helping with that? ",
            "Ugggh. Be prepared to get sued into oblivion. Just because it is legal dosn't mean there isn't legitimate grounds for people to sue you for fraud.",
            "I see I'm late to the party and this will probably get buried. You've gotten a shit-ton of bad answers. \n\nBottom-line: yes, this is probably illegal. There are two legal elements involved here: 1) the Right of Publicity; and 2) the Lanham Act, which  prevents people from using marks that create \"a high likelihood of confusion.\" This can include the name, image, or likeness of celebrities. \n\nTogether, these parts of the law would prevent you from knowingly using the name \"Babe Ruth\" on baseballs because is is very likely to mislead buyers as to the source of its origin AND you are capitalizing on Babe's fame to make \"a good profit.\"\n\nWhoever owns Babe's estate would have a decent cause of action against you.",
            "When you are sued, this reddit thread would be \"Exhibit A\" and go towards showing intent.",
            "Reminds me of that time when I bought a car that was owned by John Voight. ",
            "It is legally known as fraud by deception",
            "I’d think it’d be hard to make a career doing so.  All the legit baseballs signed by Babe Ruth were already signed and likely accounted for.  Doing so now, you’d have to find unsigned baseballs of the time period, use ink that has aged like it would in real life over 70 years and those are likely not possible.  Your career would never get started and you’d have changed your name for nothing other than a cool story.  ",
            "The top answer about trademark is needlessly complicated. \n\nIf you did this with the intent to mislead a person into believing the ball was signed by *the* Babe Ruth and that person reasonably relies on that misrepresentation then it's fraud. \"Technically true\" is not a defense to an intentional and material misrepresentation. ",
            "Hahahah yeah I don't think the judge would accept that argument",
            "As long as you're not forging his original signature, im sure you can do it ahaha anyone knowledgeable on what they are purchasing would recognize the fraudulent signature you placed on the ball though..",
            "In the 60s Pete Best (original drummer of The Beatles) covered some Beatles songs and released it titled 'Best of The Beatles'. I'm not sure how it sold or if it legit caused people to think they were buying a 'best *of* The Beatles' but it's kinda funny.",
            "All legality aside, it is not the name Babe Ruth that is worth money, it is his actual signature. So anything that you signed Babe Ruth, a sports memorabilia collector would be able to look at that signature and know that it did not belong to the actual Babe Ruth. Even if you could copy it almost exactly, they would be able to establish the providence of the item and know that the actual babe Ruth was not the one that signed it just some guy with the name Babe Ruth. \n\nI have no doubt in my mind that there is someone in this country named Abraham Lincoln, and if he signed a copy of the Gettysburg address it would be worthless. ",
            "Define illegal. The state isn’t likely going to launch an investigation. If you’re successful it would decrease the value of real baseball signed by Babe Ruth. The market would recognize that it’s flooded with inventory. Or, it would recognize the speed in which the inventory exchanged hands. In theory, the owners of the actual baseballs would band together to create a an autographed Babe Ruth baseball cartel to regulate this market. The speed at which this happens is a reflection of information symmetry and which start/end points you choose to use. \n\nThis is where it gets interesting. This hypothetical cartel would require the ability to verify the authenticity of the balls. They may also seek to grade the balls on quality and how well-preserved they are. Essentially, it would likely spawn a cottage industry around it... all because of a stupid wacky scheme. The   If you were to actually do this it could create a media sensation. The unintended affect is that some people may actually prefer the fake balls more! This is memorabilia we are talking about and not something you *need* to survive. At the end of the day all three of babe Ruth’s balls are commemorative and have significance. The original signed by the actual babe Ruth. The fake ball you’d be selling, and then the fake ball as it exists as a collector’s item from being a media sensation. In essence, it’s quite possible for your balls to become more valuable than the originals. However, you didn’t add value to the balls. The media event added value to the balls and its affect could be reduced  to market forces, however strange that may be. ",
            "If you are committing fraud if you know people think that the baseball is signed by the Yankee player or reasonably should know that these people think it’s signed by him. As it seems there is no reason for you to change your name to Babe Ruth other than to deceive people. YES ILLEGAL. Also probably committing perjury as to legally change your name you must state under oath (CA LAW) that you are not doing this to commit fraud. So criminal and civil liability. ",
            "Tort of appropration of likeness, also possibly fraud and misrepresentation",
            "Babe Ruth’s estate would sue you out of existence. ",
            "Best I can do is tree fiddy. ",
            "Like 10 years ago the guy who owned (partially) my favorite CD store changed his name to Andy Griffith and ran for Sheriff. Andy Griffith sued him.\n\nhttp://www.washingtonpost.com/wp-dyn/content/article/2006/11/11/AR2006111100280.html?noredirect=on\n",
            "Do the normal collectable store move and just fake the signatures. ",
            "A babe Ruth signature that isn’t verified is worthless so go ahead",
            "try Rabe Buth baseballs. seems like a good middle ground.",
            "I'm selling a third generation iPod, actually used by a Charlie Chaplin.",
            "The ol' bait and switch you sly son of a gun. No that would not be illegal and if i heard about it and saw some random person selling \"babe ruth signed baseballs\" because their name is legally babe ruth i would probably get a laugh and may make a purchase just for the story how i was comedically duped. ",
            "If you just put \"baseball card signed by B. Ruth\" people would buy.",
            "Mens Rea, intent to defraud.",
            "I can't see how it'd be ILLEGAL, it'd just be really dishonest.",
            "Theft by fraud",
            "r/legaladviceofftopic",
            "I wonder why he thinks the US doesn’t have any jurisdiction over him but he can drive the streets of the US. If I was visiting another country I would think I would need to follow the laws of that country.",
            "You wouldn’t make a dime. ",
            "It's not illegal to change your name but proactively selling autographs claiming to be the legit Babe Ruth would land you in court thing to defend against a material misrepresentation charge that you'd lose.",
            "Yes. Fraud.",
            "So many responses to what is a simple answer:\n\nBecause you are not a legendary baseball player whose autograph on a baseball would be sought out, it would be easily argued that you were intentionally misleading people into thinking you were *the* Babe Ruth by signing an object so closely associated with him and his career and not at all with you. You would be sued into oblivion and probably jailed for fraud.",
            "Maybe. If Babe Ruth isn’t trademarked, then it technically would not be illegal to use his name; that being said, if you made your signature look identical to his signature, you could probably be convicted of forgery and or fraud even if your name actually was Babe Ruth. The likelihood of this would increase if you sold your materials with likenesses (i.e. pictures) of Babe Ruth to trick people into associating the two. If you sold random stuff with your unique Babe Ruth signature and no likenesses of the famous Babe Ruth, then it would not be illegal. ",
            "A judge might well find that your buyers had a reasonable expectation of receiving the genuine product. Judges don't like smart arses.",
            "Yes, Criminal Simulation would probably be what this falls under. At least in Texas it would. ",
            "Illegal in the USA; in addition to fraud laws, look up 'Trade Dress'.",
            "All the kids would ask why you’re signing baseballs and ask if you’re related to that candy bar? ",
            "I’ve wanted to open up the Franklin D. Roosevelt school for political science, even though he’s dead (spoilers). Is this also illegal? What about Thomas Jefferson. Has to be public domain by now right?",
            "Criminal law is all about intent.  Some jurisdictions look at subjective intent.  Either way it would be hard to prove, in my opinion, that you had no fraudulent intent.  Ie intent to mislead ",
            "Wouldn't you need to find 100 year old balls for the scan to work?",
            "So long as you make it extremely clear to your customers that the baseballs are not signed by \"the\" Babe Ruth but by a different Babe Ruth that they likely have never heard of before, you're probably ok.\n\nOf course this also undermines your business model to some extent.",
            "You really don’t want an office job do you?",
            "There's no way, that if you did it enough, it wouldn't severely impact the value of Babe Ruth's autograph. Even if the two signatures looked nothing alike, the legacy of the autograph would be tarnished by that guy who decided to do something shady.   \nYou'd be surprised how a seemingly insignificant thing can ruin the value of a signature. You would be attaching yourself to every legit signed ball, and every legit signed ball would be questioned. No matter the legality of it, you'd be a pariah in so many communities. Sports memorabilia collectors, autograph collectors, candy bar fans, baseball fans, fans of John Goodman, etc. etc. It's not worth it.",
            "You'd be better off changing it to George Clooney and calling for reservations at restaurants. ",
            "It would be illegal if they thought the ball had been signed by the baseball player and you lead then to believe that",
            "I mean, why be *that guy*? I don't understand why ppl want to go around screwing other ppl and think that when they get to the end of this crazy game that they will be happy with the life they had",
            "Reminds me of the joke: A company is holding a contest and they tell everyone the winner will receive a brand new Toyota. When the winner is selected, he is taken out to the parking lot where a Toy Yoda stands in a parking space. \n\nIf you do that, it is so obvious what you're trying to do and there is no question about it. Its not an acedent, you're deliberately trying to mislead your customers. Some members of law enforcement would probably consider that fraud. So I wouldn't try it.",
            "I don't think so, since many Musicians have been sued for looking or sounding too much like themselves after losing rights to their own works. Since someone else owns babe ruth, you'd be sued  ",
            "[deleted]"
        ]
    },
    {
        "post_id": "mu6fxm",
        "author": "snorken123",
        "title": "Are animals aware of people are wearing clothing, or do they assume humans have fur which change color?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/mu6fxm/are_animals_aware_of_people_are_wearing_clothing/",
        "score": 17120,
        "num_comments": 1150,
        "created_utc": 1618855197.0,
        "selftext": "I'm wondering what animals think about humans. Humans distinguish themselves. We're wearing clothing, lives in houses, have furniture and drive cars.",
        "permalink": "/r/NoStupidQuestions/comments/mu6fxm/are_animals_aware_of_people_are_wearing_clothing/",
        "comments": [
            "I'm no expert, but during lockdown last year, I was able to hand feed peanuts to the squirrels in my backyard. At first, I would go out in the morning, wearing my blue bathrobe. The squirrels were a bit wary, but everytime I went out it would take them less and less time to approach. One day, I went out in the afternoon, and the squirrel would not approach, instead remaining on his perch up on the fence. I realized it might have been because I was wearing jeans and a green T-shirt. They may have become accustomed to taking food from a fuzzy blue me. I tested it a couple days later, going out in the afternoon wearing my bathrobe, and what do you know? A squirrel came up for a peanut.",
            "Different clothes is on the checklist of things you need to socialise puppies to before they are three months old or so, or it might freak them out as adults, because they _do_ \"change\" how people look. A man in a puffy coat might look like he is huge and looming threateningly, sunglasses might make faces look scary and \"inhuman\" and so on. If they are exposed to it as puppies, they know it's just normal human stuff.\n\nI don't think dogs understand what clothes are \"for\". Dogs live their entire lives surrounded by things they don't understand, they are used to it. They just vibe.\n\nEdit: Thinking about it, there is lots of stuff in my daily surroundings I don't know the purpose for, but it's just normal and not that interesting so I don't ever really think about it.",
            "Aww this reminds me of when my roommate a few years back got a puppy in mid November  so the puppy's first few months of life were during winter. We all wore socks and slippers in the house those first few months and then when summer rolled around would walk around bare foot. The dog absolutely lost his mind the first time seeing our feet, whining and sniffing and licking at them. We think he thought we had had our paws skinned or something, but he got used to it after a few days.",
            "I would say so. Dogs will react to a human that wears something similar to a human that they fear or were harmed by.  I had a neighbor's dog who would freak out if it saw me with a bandana on my head, but like clark kent and glasses, the minute I removed it, the dog treated me like a completely different person. \n\nMy dog was never harmed, but I remember the very few times I undressed in front of him, he just stood there confused. I'm pretty sure it looked like I was shedding my skin to him.",
            "My cat likes to play with shirt sleeves when I wear them, but he always avoids scratching or biting the actual arms. Which is useful, as he literally tore my last cotton long-sleeved t-shirt in just one bite, and I don't want to think how it would feel if it was my actual skin.",
            "I know for sure my dog can differentiate clothes. He will know when my mom is getting ready for work and when she is staying home based on cloth she wore that day.",
            "Our dog will bring us a sweater to put on her when she's cold. She understands clothes.",
            "My dog sometimes sees me change and they aren’t concerned, so I’ll say that they know clothing isn’t fur",
            "[removed]",
            "My dog knows what clothes are. He even knows his own clothes and gets excited about certain shirts.",
            "My dog gets very excited if she sees I'm wearing clothes I wasn't before.",
            "The family cat in high school liked to hide under a chair in the living room and scare family members by pawing at them as they passed. If you were wearing shorts, he'd just pat you with his claws retracted, but if you were wearing pants or jeans, he'd catch them with his claws out.",
            "Whenever I fully take my clothes off my dogs know I'm showering and run into my bathroom ahead of me.  I guess they have some sense of what clothing is, possibly.  Just an assumption though.",
            "This reminds me of the time I bleached my then-black hair to platinum blonde... my cat looked at me like she didn’t even recognize me, and when I sat down she ever so gently started pawing at my hair! Don’t know anything about her thought process there, but it was kind of funny.",
            "I don’t have an answer to this, but I know that my dog “knows” my clothes. I assume it’s by smell. For example, when I put on gym clothes, he gets nervous because it likely means I’m going for a run outside without him (the audacity), or when I put on work clothes he gets very sad because it means I’ll be leaving him for several hours. So I’ve noticed that his mood changes depending on the type of clothing I’m wearing.",
            "My rabbits have no issue chewing on my clothes, occasionally biting through hard enough to hurt, but they’ve never bitten my bare skin. I’m not sure to what extent they understand what’s going on, but they definitely recognise that there’s a difference.",
            "The first time my old Border Collie saw me change my clothes, it scared the shit out of her. After that, she seemed to accept it as part of reality. I honestly don't know if she decided it was just how our fur works, or if she was able to figure out it wasn't attached to me but it was an interesting moment.",
            "My cat is always criticizing me for wearing stripes with plaids",
            "My cats were always bothered when making contact with my bare skin. When they went on my lap, they were not touching the parts where my skin wasn't covered, I know it doesn't mean anything but i've always wondered what the cause for that reaction was. Maybe they thought I suddently stopped having fur at the end of my t shirt and like this area wasn't part of me ahaha.",
            "Cats are 100% aware that we wear clothes\n\nDo they know why we wear it?\nNot sure.",
            "I will tell you my dog is absolutely aware. \n\nBlack jeans. He goes to his bed and awaits a treat because I'm going to work.\n\nGym shorts equals front door looking at the door to the basement because we are going walking/jogging or we are going down the basement to work out.\n\nJust boxer briefs. Hit the couch buddy.",
            "The farm cats would get into the basement in summer and piss in the dirty clothes basket.",
            "Some recognize that its a human thing. I had a dog, growing up, that let me dress him up. I had another that would grab clothes from the dryer and look at us like, \"you're going to wear this\". He had this look that seemed to mean, \" fix your outfit before I'm seen with you\"",
            "I love my dog, she doesn't judge me when I change clothes in front of her. Her facial expression never changes from \"dude I love you\" eyes whether I'm naked or wearing work out clothes or wearing business clothes or whatever. she accepts my body however it is.",
            "Honestly, i have no idea. but it would be pretty wild to think that my dog sees be take off my tshirt and would think that I'm tearing off my own skin every night. Weirder that he's totally cool with it.",
            "When playfighting with my dog, he definitely knows the difference between biting clothing and biting skin. He won't bite skin, but he sees clothes as fair game and will tug and tear and not let go, the little shit. So he knows the clothes are something we put on rather than a part of us.",
            "well dogs see us as different species, not like one of their own family, so they probably just think its a weird human thing. idk about other animals.\n\n(knowing me this is probably completely incorrect so correct me if im wrong)",
            "Really depends on the animal. Not just the species, but the individual itself. Just because dogs are generally intelligent doesn't mean their aren't some lower intelligence  dogs out there. We are the same, that way.\n\nHad a parrot that'd think I'm sick or something whenever I painted my nails.",
            "Honestly, I don't think they think about this too much about this. There's other things that might seem strange to them such as why we stand on 2 legs, why we don't look like them, why we do things they don't understand. Clothing is just one small difference that I'm sure they have thought about at some point but isn't too important to put too much thinking over.\n\nA collar is a form of clothing is it not? They just get used to seeing clothing at this point. A wild animal will wonder many things about you but it's not different from seeing another animal with different habits and looks.",
            "Well, scientists performed an experiment to figure this out. They asked the animals if they understood what clothing was, they have yet to receive a response.",
            "After a month or so of staying home because of covid, my dog figured out that we are going for a walk when I put on real pants. So either he knows about clothes or he thinks I have special fur for walking.",
            "Well my dog frequently wants to copy me. If I drink out of a water bottle he wants water—-pouring in a dish —no.. he wants to try to stick his tongue in the tipped bottle and drink. \n\nHe watxhes me pretty close.  When I put a blanket on myself in the couch, he pulls over his little rug/blanket.  \n\nIf I put a sweatshirt on he gets excited for a sec because that could mean going outside, but he will whine til I give him a shirt. \n\nHe does have clothes but he shivers so it’s a necessity.  \n\nNot sure if he “gets it” but he knows putting things on him means warmer. \n\nAs for exposure— there’s a dig on my street that goes bonkers if anyone with an umbrella or skateboard goes by. (The exposure part of the convo)\n\nMy previous dog didn’t like mustaches—rescue do idk if he was hurt by someone with one or he never saw them?\n\nIt’s common for dogs to not like glasses, especially reflective ones— it messes up human faces but they also see two other dogs looking at them.",
            "My gf changes her hair color a lot, when she changes it to bright colors one of her chameleons gets super intimidated. He puffs up, turns black, and just shoots her a dirty look when she passes by. He doesnt do this when her hair is darker in color.",
            "Not sure if this answers your question, but my kittens were born in lockdown and have only ever seen us in \"home\" clothes (pajamas, soft sweaters etc). When I do dress up for work or dress up to go out they definitely run and hide and stare fearfully from under the sofa. When my father wore a suit once they were terrified. And they disappeared one day when I wore a sari. They aren't used to seeing varied clothing and are not on board with it at all.\n\nDisclaimer: They've lived all their lives hanging out with us in bed in our pajamas and are not abused. They just can't recognise the person in different clothing.",
            "The question nobody asked but everybody needs the answer to.",
            "I wondering this exact thing just yesterday!",
            "My dog gets super happy when I put socks on and gets fucking elevated when I put shoes. So I guess he knows a bit",
            "Horses pick up on different things first. Smell and body posture matter more to them I think. Some even know I am coming (picking me out from 40 other people around)  by sound alone (they start whinnying even though they can't see me because I bring treats).  Since horses communicate through body posture while horses themselves can have a wide range of colors, I don't think the color of clothing matters all that much to them. They do understand the difference between clothing and skin though. One they can freely nibble on, the other they know will hurt if bitten.",
            "my cat thinks I am an asshole. He finds his food, I wont let him have it even when he tells me how much he loves me. I also make the food less accessible.   \nNot only do animals understand clothing is not part of us they know what different items mean. My cat doesn't like it when I put socks on it means I am going out soon.",
            "The first time I brought home our yorkie back from the groomer after adopting our chihuahua. The chihuahua barked at the yorkie thinking she was another dog.  There was some barking back, then butt sniffing, and then everything was fine.",
            "My dog taught himself the difference between my work clothes, socializing (pre-Covid) clothes, comfy clothes, and clothes that would mean he gets to come too. He both looks up and down to check the top and bottoms, then boops the pants at least once for sniff check/excitement. \n\nHe used to come to work with me at one job (I had 3 at the time) so he taught himself that first, I believe, and would be ready/excited. The others he learned based on whether or not he got to come...wearing nicer clothes to meet up with friends...no go, very sad. Comfy clothes...we don't go anywhere :((. Walking/hiking clothes...holy shittttt let's go let's go let's go!! \n\nWith Covid it doesn't vary much and he comes to work with me, but he knows that if certain pants are on and a flannel is present... we're going on walkies. He's adorable.",
            "A bit late, but whenever I put my coat on, my dogs know I'm going outside. They wait for me to put my shoes on when taking them out. I'd say they recognize it at least a little bit.",
            "As others have stated before, domestic dogs learn by observing us that our clothes are something we put on, and which are separate from our body. \n\nAll the dogs I had have passed through a kind of epiphany in this regard, when they were pups. I could see the realization in their eyes as they understood that playfully nibbling on our sleeves caused us to bitch less than when they did it on our naked skin. Also, doggos are super attentive to context, as they know different clothing means different things. Whenever I go visit my family house, my parents' puppers get all excited and tippy-tappy whenever I get out of my daily clothes and don my sweatpants and oversized hoodie, cause they know it means I'm gonna stick around a while. Conversely, they get all sad and sigh-y when I change out of them and into my \"leaving\" attire. \nOur youngest had even developed a habit of stealing and hiding my socks in a desperate attempt to prevent me from going to work, a couple years ago.\n\nSame goes with when they see my dad donning his woodworking uniform: they'll instantly zoom out in the garden, all happy and playful, cause there's nothing they love more than napping in the shade while my old man carves his umpteenth wooden spoon, lol.\n\nDogs are happiness incarnate.",
            "I go nude as to not confuse the animals",
            "If you change in front of them. They will see that you can shed your skin and not be trusted. Given their limited communication skills, they will use their Yahoo accounts and spread a theory of lizard people posing as real humans, who do not shed in front of you. If this happens, it is a sign that you need to take your dog outside and socialize with other dogs, instead of getting acknowledgement from faceless users, who in fact, are probably lizard people",
            "While my cat may or may not know why I'm wearing clothes, she's far more careful with her claws on parts of me that don't have clothes covering them. Even places like my upper thighs that are normally covered, if I don't have pants on, she's far more careful. She is definitely aware of the concept of the covering but and that I cover myself but beyond that I don't think she has a grasp of why I do it.",
            "My dog wears his vest when he’s working, so I think he gets the concept. He also has a harness he wears out for walks, and his collar comes off for brushing and grooming. He knows his clothes have meaning. My parents’ dog loves to remove socks. I think they understand the general concept.",
            "/r/titlegore",
            "Depends on the the animal. I'd imagine your house pet knows it's a cover of some sort. Wild animals probably don't think about it or even care, same way the majority of people don't notice when the color of a birds feathers change.",
            "Fur where there was no fur before.",
            "My dog knows outside clothes mean he’s going for a walk. Especially if it’s cold out and you’re wearing a hat/large coat.",
            "All I know is that when my cat refuses to get out of the bathroom before I undress for a shower she gives me a judgemental look and then turns to face the wall until I'm covered by the shower curtains...",
            "I moved into an apartment during covid, and because I have to occasionally pass neighbors to reach my door I wear my mask on the walk from the car. The first few times I entered my apartment with a mask on, my cat got super freaked out! Half a year later she's gotten used to my masks, but it was funny when she learned about them",
            "Yes. They know. They are very jealous of this fact. Animals love fashion.",
            "My dog reacts differently depending on the clothes I put on. Example, I put on my pajamas, she curls up on the bed. If I put on my work uniform she “pouts” and goes into my husband’s office. If I put on my jeans she gets excited because I’m staying home. It’s adorable and kinda freaky. She is ALWAYS in my room when I’m changing clothes. She sniffs what is laid out on the bed and responds exactly the same every time.",
            "You should probably ask an animal",
            "Our dog came from an (obviously) abusive previous home.  He's not fond of men, especially ones he doesn't know, but he's cool with my husband and son.  Whenever he sees a tall man with a baseball cap, he goes ballistic..  It's made for some awkward moments at the dog park, but we've learned to watch out for someone that fits that description, and re-direct him.  The previous owner was a tall guy who used to wear a ballcap a lot.  Hmm....",
            "I think many animals will either understand that clothes are over out actual bodies if they spend enough time with us, OR they won't care.",
            "Given that I've seen cats sniff a used shirt and then curl in a ball on it to then purr loudly, I'd say that at least some of them are aware of the concept of clothes",
            "Fuck how stoned are you? What a great question.",
            "well my dog goes ballistic every time i just touch an item of clothing i usually wear when taking him for longer walks, or my hiking boots. he knows that those mean we're gonna go hiking. if i put on a nice coat or jacket, he can't be bothered to even look at me.",
            "Chickens get freaked out if you wear red, and my cockatiel screams the house down when my husband wears his cycle helmet and glasses.",
            "My cats understand that if I’m wearing shoes in the house that someone might be going to the Vet, they start hiding.",
            "This isn't a problem for my pets since I haven't changed the clothes I wear since the pandemic started. (In all seriousness, I wear the same stuff around the house all the time. So the times I dress to leave the house makes them go crazy.)",
            "It's said that dogs chew shoes because that's what we use when we leave them, so maybe a little bit?",
            "My cat will claw my clothes like bedding, but never my skin.  So she knows the difference.",
            "My cat doesn't think I live here.  Every day he's annoyed that I'm still here, and wanting to know when exactly I'm next planning on leaving the place for a bit.  I used to think, before I worked from home, that maybe he missed me all day, and I still think a little bit he did.  But he's had more than enough of me now.  I think he does look twice when I change clothes, but I don't change so often anymore, so I don't think that's what's putting him off me.  I think it's just familiarity.",
            "Definitely understand clothes. I don’t wear pants/shorts, normally, in the house. The moment I start to put on any pants/shorts, my pups start freaking out because they know I’m about to go somewhere.",
            "My dog knows when I wear my work clothes and doesn’t follow me to the door. When I wear anything else he gets excited bc he assumes he’s coming with (which is usually true lol.)",
            "Anecdotally, my dog knows that when I change out of pajamas and into day clothes, it's time for his walk. He'll see me come down the stairs in jeans and a t-shirt instead of pajama top and bottom and get excited. At the very least he knows that my clothing changes, and that the type of clothing indicates whether to go for his leash or lie down again.\n\nAnd, as other people have already said, it's important to socialize your puppy to different clothing and features. Baseball caps, turbans, beards, sunglasses, puffy coats, all the uniforms, etc. Most of a dog's fears towards a certain type of person isn't previous abuse but a lack of proper early exposure.",
            "My dog gets super bummed out when I put on my work uniform. He definitely understands that uniform=going to be gone awhile.",
            "Well I assume most pet owners have been naked in front of their pet. So surely they understand our clothes aren't part of us.",
            "all i can say is anecdotally my cats seem kind of bewildered and get wide eyed when put on a ballcap on or take one off. \n\nthey arent scared, just more mesmerized, like 'whaaaat the fuuuuuuuuck...' then a couple seconds later they dont give a fuck.",
            "Now that I work from home, I rarely wear anything other than pajamas. My poodle gets real excited when she sees me put a bra on, as she associates my bra with going for a walk. I can change my shirt or pants and she’s nonplussed, but reach for the bra and it’s happy time. So, based on my admittedly limited experience, pretty sure she knows I’m wearing clothes.",
            "Ive always heard that cats think people are just larger, awkward cats. So I’m wondering if my cat thinks he should be wearing clothes as well.",
            "My dog knows that when I’m putting shoes on that often means I’m taking him out for a walk. So he at least recognizes that",
            "They probably have a hard time with it to an extent, and it probably changes from animal to animal. Crows are capable of recognizing human faces, so changing clothes would probably not matter much to them. Other animals with poorer visual individuation skills might not be as quick to realize that you are indeed the same person you were dressed as yesterday. They might need to associate *you* with your smell more than their sight, etc \n\nThe squirrels on my college campus only recognize me and come up to me when I have my cane with me. I wear the same three or four outfits, otherwise. If I leave my cane in the classroom when I go to eat lunch, they don’t really bother to come check me out. But, when I have my cane, they actually will follow me across the quad and run up to me wether or not I have food out. \n\nI’d like to think that In their tiny squirrel brains I’m the big weird three-legged thing that gives them food. Without my third leg I’m nobody to them, I’m just any plain ole human.",
            "Considering that I cannot wear a hoodie in the house without my dog flipping out because that means walk time, I think yes. \n\nI have 2 hoodies for wearing in the house now, because I don't wear them to walk him. But the rest? \n\nSo, they have to have some concept of it.",
            "I’m fairly certain they do. My cat can tell the difference between pjs and outside clothing and act differently when I wear different types of clothing.",
            "My parents pet corella will try and bite to the point of drawing blood and ripping flesh off anyone wearing glasses (not just sunnies). No glasses? Can give him al the neck scritches in the world.",
            "Not to sure but I swear one time I was hanging out with my dog and I had to change a bandage on myself. While playing dr I noticed my dog watching me intently and when I pulled the band aid off he lost his mind. I felt as though he thought that I was pulling off my skin or something. It was forsure pretty weird for both of us.",
            "Depends on the dog. My dog can definitely tell apart what clothes I'm wearing and what they mean. If I'm wearing my cap, running shoes and sunglasses it means we're going for a walk, and he gets excited. If I'm wearing jeans, I'm going out for a while so he'll stay inside like a good boy. If I put on my work clothes he'll say bye and then go to our bed.\n\nHe also does not like chef hats since one fell on him when he was a puppy and he's been scared of them since.",
            "I wonder if when snakes see us change, they think we shed our skin.",
            "My cat always knew that when I had my long sleeves and we were playing she can go to town and get her predator instincts out.\n\nThe second she felt skin she stopped.\n\nI miss her :'(",
            "My bird definitely knew the difference between clothes and skin, though the first 2-3 times I changed in front of her she got a little confused.\n\nWith skin and hair, she‘d preen it, nibble, cuddle up. With my clothes, she‘d play with them, pull on parts, try to nibble patches off, things like that.\n\nWhen climbing up, she’d only use her beak to pull herself up on my clothes, never my skin. She definitely knew the difference.",
            "I believe most understand that it’s different than fur, because they see us take them off (I’ve definitely changed my shirt off in front of my pets at least) and I know they have the ability to understand blankets and the warmth they provide. I assume they think we just run around cold and in blankets all the time.",
            "My grandmother had a dog that absolutely knew what clothes were and he loved them. He had a sweater for every day and he would pick them out",
            "My dog knows that when I put my jacket on (and my mouth cover by now) he is going for a walk. So I would say yes, they know its not our fur basically because it doesnt always smell like us but to soap!",
            "I cant speak for all animals but a few dogs ive interacted with definitely know some things about clothing. For instance my one friends rescue dog knows what a baseball hat is but thinks they are weapons. You cant wear a hat around him or he gets aggressive and if you hold the hat in your hand he will run away scared. Poor doggo. My pup on the other hand knows that certain clothing means certain things. So if i go to put a certain jacket on he knows we will be going 4-wheeling and if i put on a skinnier coat we might be going for a walk. He knows my work coat and clothes means he isnt leaving with me and if im still in pj's and we are heading outside he knows he doesnt want to come with because im just going to the garage for a couple smokes. He also loves wearing clothes himself and will ask for certain sweaters as a way to ask for that activity.",
            "My dog knows that when I put on pants he has a pretty good chance of going outside.",
            "My snakes know that the breast pockets on my shirts are warm, so there’s that. And the sleeves.",
            "My mates cat looked away when I pulled down my pants for going to the toilet. I thought that was funny, like the cat understood when not to look.",
            "Not clothing, but my dogs are fully aware that if I put on a certain pair of shoes, my running shoes, it's time to go outside. I have boots for work, slides for in the house, a nice pair of 'dinner' shoes, and my running shoes.  Even when I buy a new pair of running shoes, they recognize that they aren't my boots, slides, or 'dinner' shoes. Even when I put on one of the other pairs of shoes, they don't react in the same excited manner. I have no idea how or why, but they're so smart, and it blows my mind.",
            "Ever see a dog tug on a shirt or a pant leg? Ever seen a dog tug on someone's actual leg (meaning not in a violent way, but a \"hey pay attention way\"). \n\nMy dog knows that sweatpants are for staying home and jeans are for walks. She isn't sure she gets to go until I grab her leash. I can tell. \n\nI would say it's a matter of experience. Can animals understand clothing? Probably. Do they without experience that teaches them? Probably not.",
            "It's way too early to put this shower thought in my head",
            "My dog definitely knows, especially since quarantine lockdowns, that when I put on my outside legs and my outside feet, it’s time to go for a walk.",
            "My dog recognizes my “outdoor” or “dog park” clothes and shoes and will get super excited when I put them on. He will also get really sad when I put on clothes that are not related to his favorite activities.",
            "[deleted]",
            "Anecdotal- but my cat 100% treats clothing different from skin. He’ll dig his claws to get a good grip on tough fabric and climb me- but would never ever do that’ll bad skin",
            "I think they get it and they don't get it. \n\nEvidence that they don't get it: \n\nDogs go nuts about hats, sunglasses, hoodies, backpacks, and umbrellas. Also every dog at my dog park went through a \"humans wear masks now\" adjustment. Dogs have to keep being reminded that these are just clothes, not raised hackles and wide, staring eyes or gaping mouths.\n\nEvidence that they do get it:\n\nThey recognize people they haven't seen in months despite the different clothing. They see their owners in tons of different outfits. They put on \"clothes\" like collars, leashes, and harnesses (and sometimes actual clothes) themselves. They understand that putting on a leash means going out, and they totally know that when we're putting on jackets or shoes it means we're going out.",
            "When I’m under a blanket, my cat acts like I’m a floating head.",
            "My rescue tries to protect me when my dad gets dressed in his paddock gear (akubra, long sleeved shirt, long pants, boots) but is fine when my dad doesn't have that all on. He gets more anxious the more of the outfit dad has on. But also he only sees my dad when we visit, and he doesn't suddenly not know me if I change clothes or don't wear my glasses. So I assume, with dogs at least, they use a combo of scent and visual aids to identify their people",
            "My two dogs recognize that we're not doing *anything* until I put pants on, and the difference between my work shoes and regular shoes. \n\nBut I wonder, how do they feel about wearing clothes themselves?\n\n Olivia (8 yrs chihuahua terrior mix) isn't allowed to wear dog sweaters with plastic decorations on it, she will find the nearest wall and walk back and forth; just to hear the noise is my guess?",
            "I definitely believe cats see clothes as an extension of us, much like fur. Cats are extremely focused on physical presentation, it's how they communicate with each other. Most vocalizations are actually more about socializing cats to humans because they notice we respond well to sound. With each other, you may notice they really don't \"talk\" vocally, and especially don't meow at each other. There are examples to the contrary, of course, but this is the norm. \n\nI've also noticed that my cats will respond to me differently depending on what I'm wearing, and they especially do not like hats. When the head silhouette changes, it puts them on edge. I'm pretty sure they view clothing the way they view their own physical displays (whiskers oriented forward or back, ears held high or pressed back against their head, stomach exposed or back arched, etc). They think it's us communicating physically. This seems to be especially true with my feral cats, where as the ones I've raised from kittens seem far better socialized to human behaviors and don't react nearly the same way.",
            "My cat would jump on me just when I have clothes on but when I don't he doesn't dare to do it. I guess he kind of understands the difference. Do anybody else can relate?",
            "They prolaly saw you skin yourself live and put on another fur.",
            "Each cat I've had has watched somewhat amazed as the clothes came off on a hot day after work. Their gaze followed each piece of clothing then back to me again. I cant prove it but I always felt they looked genuinely embarrassed seeing me in the buff.",
            "Dogs often flip out over people wearing hats/helmets",
            "I see some people give their pets clothes, do they feel weird about this? How do they feel when they wear this?",
            "Are people aware that animals do not possess the bicameral mind?",
            "They know we are covered or not, if they are around people enough.",
            "Dogs aren't stupid , they know we wear clothes . And why . That's why they lear at us when we are naked .",
            "Neither. \n\nAnimals relate by smell, not physical appearance. \n\nFor animals which can see bright colors, it has been shown they will respond favorably if they recognize the smell to associate with the color. People who feed birds, squirrels, and other small animals by hand typically do so regardless what they wear, but many have stated bright colors seem to attract them faster.\n\nI used to feed a squirrel when I was in college, and it didn't care what I wore (typically a hunter green coat). Over time, when it saw me, it acted \"happy\" knowing I had a few peanuts with me.\n\nIt wasn't long before I was feeding more than one squirrel. I suspect they communicate with each other in a manner to indicate I was \"safe\" and not threatening.\n\n\\*sigh\\*\n\nI miss those days.",
            "When I play with out dog she usually \"play bites\" only on clothes, seems like she understands that it will hurt less there than on skin. so it seems like they understand a Little",
            "My pets tended to look at me interested and quite confused as I was changing clothes.\n\nSo I Think they need to learn that its not a human body part but an accessoire.",
            "My dog has learned to understand that the human action of putting on a coat, or putting on shoes, means he gets to go for a walk.",
            "I remember a news article about a zookeeper who used to feed a lion daily. This lion was used to him so he would walk in there like it was his own home. One day he forgot to wear his uniform and got attacked as soon as he entered the lions cage. So maybe some animals recognize clothes as a part of you. Probably depends too on if they see you in different ones often.",
            "My cat won’t walk on my bare chest. If he wants to come up/cuddle when I’m shirtless I need to put a blanket or something down",
            "Some animals wear clothing, too.  I doubt they understand why we do.",
            "I wish I could read their thoughts to know the answer",
            "Yes they are aware.",
            "My cat refuses to sit on my lap if I don’t have pants on, so yes?",
            "I think this is why some dogs freak out when people wear hats around them. They don't see them as a human anymore but the scary big head creature.",
            "I think it depends on the situation the animal is in. Wild animals and livestock probably think we can change colors, but housepets probably understand that we put things over our skin for some weird reason.\n\nThough even for housepets I think it can depend on various factors. My dog has seen everyone in my house change clothes, so she's definitely aware of the concept. (even if she might not know why we do it.) On the other hand, my parrot has only ever seen my dad change his shirt in front of her, so she might think it's some weird sexual dimorphism thing going on.\n\nAs for all the other stuff you mentions, houses and furniture are probably special hand-crafted nesting things, and cars are terrifying deathtraps that have some weird symbiotic relationship with us and are also weirdly obsessed with taking animals to other humans that like to poke and prode at them with metal objects.",
            "I always wonder what my cats think when they see me naked.  They don’t visibly smirk, anyway.",
            "My bf’s cat seems to have learned the difference between cloth and skin. She loves laps but we don’t like accidental scratching, so now she waits for me to put a blanket over my legs before she climbs on me.",
            "My baby is used to seeing me in different clothes but his mind is blown any time I change in front of him, it's hilarious",
            "My Great Dane is a extreme Morgenmuffel (German word for hating to get up in the morning). No amount of activity will stir him except me putting on FRESHLY ironed jeans or cowboy boots. If I put on yesterday’s jeans (because I have to quickly get something out of the car or sign for something at the front door) NOTHING. Oh...& he can HEAR the difference between putting on those day-old jeans and a fresh pair. The sound of that first leg going into clean ironed jeans has him on his feet in less than a second. Slacks, tennis shoes, sweatpants, etc. all get ZERO reaction. Foot in boot = “LETSGOOOOOOOOOO!!”\n\nOh, & apparently I walk down the stairs differently when I’m about to go somewhere (and he most likely will get to ride in the car with me) & when I’m just going to the kitchen. I can go up & down the stairs 50 times with my wallet, phone & keys but when my intent at the top of the stairs was to go down & get in the car he comes RUNNING from wherever he is in the house...\n\n...soooo it might not be the clothes in my case but rather that my dog is psychic.  ¯\\\\\\_(ツ)_/¯",
            "I know a horse who distrusted me because of my skin color. Hear me out...\n\nFor a while I worked on a ranch in Brazil, where they would catch feral horses, train them, and use them for ranch work. All people who worked at the ranch had dark skin, because we’re talking about rural Brazil. When I tried to catch that horse and work with it, it was literally afraid of me. I really think my European appearance was the main factor, she wasn’t accustomed to seeing someone like me.",
            "Great question, not stupid",
            "My cat understands. If I’m wearing shorts and my shins are exposed, he won’t use his claws to grab while stretching before hopping on my lap. If I have pants on, he lets them out just a little when stretching. My other cat will use his claws no matter what so I just pick him up so I won’t be scratched lol",
            "I think dogs get used to see some people change, like my dog would see my mom getting ready each morming so that was normal. She saw me getting changed only once when she demanded to go to my room first thing in the morning and she had such a horrified facial expression, I thought her eyes were about to pop out. \n\nAnd of course dogs learn stuff about clothes, like when we'd put our working uniforms on or go outside with bags, she knew we wouldn't take her with.",
            "A little late to the party but my dog wears clothes when it's cold too, so I guess she understands better the concept of clothes. She sees us taking off and wearing clothes, we put on and take off her clothes, she knows I'm gonna put her clothes on her when I grab it, she also knows I'm gonna take it off when I grab it"
        ]
    },
    {
        "post_id": "r69f8e",
        "author": "burnaftereading21",
        "title": "Why is it that human childbirth is excruciating pain but in the animal kingdom they seem to not give a shit all that much?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/r69f8e/why_is_it_that_human_childbirth_is_excruciating/",
        "score": 17126,
        "num_comments": 2583,
        "created_utc": 1638344609.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/r69f8e/why_is_it_that_human_childbirth_is_excruciating/",
        "comments": [
            "As a former veterinarian, they indeed do feel pain when giving birth and can be quite distressed.",
            "We have especially narrow pelvises that are useful for walking, but not for Childbirth, but we aren't the most extreme animal births at all, we're just on the more extreme end.",
            "Bipedalism = narrower hips\n\nSmarter = bigger heads\n\nNarrower hips + bigger heads = pain",
            "It's because of our skulls. Humans evolved enormous brains, which means enormous skulls. Which means the woman has to push an enormous skull through a vagina that has to dilate massively to get it through.\n\nThis is also the reason that we're essentially born premature. An infant deer can just get up and start walking after a few minutes; we're utterly helpless for about a year.",
            "My family bred Siamese cats and poodles growing up. It still definitely hurts.",
            "To add to the great points I’ve seen here, we also usually don’t really do it the correct way. Giving birth while squatting, while still painful, would be much easier than laying down on your back. When you’re laying on your back, you’re also pushing the baby uphill requiring more contractions. For some reason we still do this anyway. \n\nIt’s like pooping—it comes out much easier when you squat.",
            "I’m assuming because they cannot make human noises we recognize as “help super painful” and they’re instinctually quieter as to not draw the attention of predators. Imagine being eaten alive while in the middle of giving birth. I’d be fifty shades of pissed about it",
            "Having grown up on a farm I can assure everyone all animals will need help birthing sometimes! I especially note cattle. Egg layers even have problems sometimes have chicks die when unable to break the shell. Birthing usually is a great event but it’s possible for death to be the result.",
            "While animal reproduction is diverse, it is generally true that it is much more painful and dangerous for humans.\n\nWe got these big ol brains, see, and these fat heaps of computing flesh are difficult to fit through even the stretchiest of orifices. So difficult that it is both painful and potentially dangerous to the mother.\n\nHowever, it would seem that the reward is worth the risk. Not only did humans with bigger nogs clearly survive better (causing this evolution to begin with), but it has allowed us to take over our world, so I'd say evolution knew what it was doing (so to speak) when it took us down this path.",
            "As someone who has watched several animal species deliver they are in incredible pain as well.",
            "It was excruciating pain for both my kitties when they gave birth. Both \"screamed\" when the 1st baby came. I think animals only \"seem\" not to give a shit. I think they are in pain too just like we are. That's my opinion tho, I could be wrong 🤷🏽‍♀️",
            "Not all animals. Should look up how a hyena gives birth. It's crazy.",
            "My dog has screamed in pain having puppies, I believe other mammals do sometimes as well. Remember, they can’t talk! If they aren’t whimpering or crying you simply don’t know if they are in pain.",
            "Probably because you aren't seeing the animals that don't survive. I cannot speak for wildlife, but I've seen cattle and rodents in former workplaces that were struggling with birth. Some survived and others didn't.   \n\nThe cow I saw struggling was in extreme distress. We called the cowboys and they were able to save her and the calf, but the vultures were lurking. That's how we saw her, there were a bunch of vultures circling her and perched in the trees. They were just waiting for her to die.",
            "So there's a lot of good answers here about anatomy but I just want to throw out there that there's an element of culture and psychology as well. In some cultures, childbirth is generally not a huge deal. Women mentally anticipate that it will be fine, they've seen many other women give birth, they utilize any posture that's comfortable for them, they walk around and move and may have an experienced midwife providing counter pressure for back comfort, etc etc. In America, and in a lot of European history, childbirth has been a very woman-unfriendly experience for ages. Women anticipate a horribly painful traumatic experience, and this has direct consequences on how the body works and in turn actually makes it more painful. Women are required to lay still, flat on their backs, during the entire labor (sometimes), or at the very least they have their movements restricted by various monitors and IVs. They often only have nurses, who have other patients to attend to and aren't necessarily trained to support women so much as they're trained to keep women alive (which is good and I love my nurses so much), and a doctor who shows up right at the end. They're very very often made to or encouraged to lay on their back for birth, pushing uphill with limited movement, so the physician can see what's going on. They're told when to push and for how long. They're surrounded by bright lights, beeping monitors, not allowed to eat or drink. They're on a timeline; if you take too long you're using up bed space. Births that take too long are pushed along by medications like pitocin which create unnaturally painful contractions. This often leads to an epidural which makes you bedridden in most cases, which tends to prolong birth and require more intervention. It just goes on and on.\n\nSo yes, our anatomy makes it harder than it is for like...a horse. But our anxieties make us have an even more painful and longer experience, and our medical set up makes everything worse as well. It *is* worse just because we're humans, but it doesn't need to be like you see on movies. It doesn't have to be awful.\n\nSource: three babies born mostly naturally. Had to do pitocin for my preemie and that birth was the hardest - I also wasn't mentally prepared, I didn't have a single loved one with me, and I was scared for my baby.",
            "It’s not always nice in the animal kingdom. Have you heard of hyenas, sea lice, and kiwis?",
            "There are certain animals that do experience discomfort during birth. Women struggle because we walk upright and the skull and shoulders of infants passing through a small hole is going to be painful no matter how you write it. \n\n\nI don't have kids but my friends, sisters and mom (obviously) all did and I asked them about it. They say the baby doesn't hurt as much as the contractions do. The muscle spasms are the worst. The cervix opening (if it even does) is the worst. Period cramps are pretty brutal so I can't imagine birthing contractions. \n\nAlso animals aren't as vocal as people as well. They're very good at hiding pain or discomfort. No idea why, but they are tougher than we will ever be. When my cat had her babies she barely flinched. You could tell in her eyes she was uncomfortable, and she wanted to be next to me the entire time, but she didn't cry or moan or anything. She just pushed the babies out. She was more confused than anything.",
            "We got nothing on the hyena.  Look that up.",
            "Our evolution, being bipedal, is making our hips more narrow thus birth canal is narrow. It only gets worse from here.",
            "You clearly have not seen a dog giving a birth?",
            "Animals are instinctively quiet when they give birth.  It’s a very vulnerable time for them and their babies in the wild.  It’s hard to tell how much it really affects them.  Of course, as others have said, the pelvis shape aids them as well",
            "Limited options, our failure to recognize an animals pain does not mean that pain doesn't exist, only that our understanding is lacking.\n\nAnimals don't have the luxury to expose their weakness so they deal with it and keep going to survive best way they know how.",
            "Look up hyenas. You'll be thankful for our experience.",
            "I have seen horses give birth they deffinatly give a shit. I don't know if it is painful, but it takes a lot of effort and is exhausting for them.",
            "Also the way people give birth in the more developed nations is counter to what it should be. Ie laying on our backs is the wrong thing to do. We should be crouched down.",
            "Animals can't talk.",
            "Humans have not fully evolved to situation of have bigger heads.\n\nIn all animals, the head size is proportional to the size of the nether regions allowing a newborn to just slip out.  Over the last 100.000 years or so, humans developed a bigger brain, and therefore a bigger head, but the size of the nether regions have not caught up.\n\nWithout human medical capabilities, this would eventually solve itself, and more moms and babies would die in childbirth when  baby head is too big for mom nether region, slowly favoring those with the better proportions for a safe birth - pure darwinism - but humans, with our bigger brain, have found ways around having moms and babies die, so here we are.",
            "My partner just had our first child, 7 weeks ago and she said to me that she’s convinced if it were men who had to give birth and not the women that science would have come up with a better, pain free way of giving birth by now and you know what? I think she’s right.\n\n\nEdit:\nI see I’ve upset some women. I think you’ve misunderstood, it wasn’t meant to say that only men are scientist, the point was that men wouldn’t be able to handle the pain of childbirth as we know it so would ensured a new, painless way was found. \n\nTake your head out your arse long enough and you’ll realise it was a compliment to women and a dig at men.",
            "Asked my wife this very question last night. Her response: to make us think twice whether we want to do it again. It's nature's population control.\n\nWhatever the true answer is, I like this version best.",
            "As something who observes bovine birth yearly I can guarantee they feel pain during. Some less than others. I but there are definitely some who take a while to recover.",
            "We learned this in anthropology and it's really neat.\n\n\nBasically humans are so smart, with such large craniums, that our newborns ride the line between killing the mothers during childbirth and not.\n\nHaving your mother die isn't very good for survival, so evolution selected for us to be born quite prematurely, as well. Which explains why most animals can walk  and do the basics of taking care of themselves within a few days of being born, and humans are useless sacks of crap for the first year or more.",
            "So... I don't know if that's really the case.  Those of us in \"Modern  Western Society™\" live a lifestyle that we weren't really meant to live, and I'm certain it takes a toll on how our bodies work.  \n\nI remember watching a documentary about life in a remote village (forgive me I don't know what country it was in) in a lush part of Africa with lots of fresh water and big plants.  Looked like paradise.  The people in this village lived in very simple huts and it seemed like a matriarchal setup.  The part that changed my life was when they showed this lady about to give birth. She was working on whatever and just put down her things, walked over to where the lake was, squatted down for like a couple of minutes, and popped the baby out with little effort.  Cut the cord, washed the baby off in the lake, took a short rest, put the baby in a sling and literally went on about her day like it was nothing.  She had zero help. It was the most hardcore thing I have ever seen and it made me feel like a HUGE PUSSY because way less dramatic things can drag me down.\n\nI want to know why those women have that kind of strength and I feel like such a pile of mush. I can only chalk it up to society ruining our natural processes.",
            "First: bipedism. Our hips are narrower in comparison to those of other primates. That's because we need them smaller to be able to walk and stand.\n\nSecond: our heads are bigger than those of other baby animals... Which doesn't work well with the narrower hips.\n\nThird: the way we give birth is not the most appropriate. Laying in a bed with our legs open and lots of doctors and stress around us makes an already hard job, harder.\n\nLaying down is a popular way of giving birth, but it is not the best. Squatting and standing are way better (in fact the WHO advises against laying down labours), but both of them make it harder for the doctors and we have \"medicalized\" labour to the point the comfort of the doctors is more important than the woman's.\n\nMany women have tried giving birth with less doctors and a calmer ambient, in water, and being able to move around as they need, and they always say it hurts less.\n\nI'm not saying no doctors are needed, because, of course, there should be a doctor to help in case anything goes wrong, which could be lots of things. But the hospital atmosphere is not the most relaxing one, and that increases the pain...\n\nSo yeah, that's basically the reason giving birth hurts so much.",
            "Because doctors are morons that think women should labor on their backs with their feet in the air.\n\nThis common practice is literally the worst way to give birth.",
            "Goddamn sorting by controversial is just people citing Genesis. People, when these are asked, they most likely mean scientifically. I'm not saying your beliefs are invalid, I'm saying that there are also scientific reasons for it. Namely largehead and narrow hips.",
            "Where the fuck did you get the idea that it's not painful for other animals?",
            "Evolution, our brains and heads evolved to be bigger which ended up causing all the issues during the child birth",
            "Humans aren't built well for childbirth",
            "Animals feel pain, they just try not to show it because it makes them look like easy prey.",
            "I have no scientific proof of this , this is just my opinion, but I think they have a higher pain tolerance than humans. You see videos and pictures with antelope or zebras missing a HUGE chunk of their body, like a whole leg or shoulder muscle or their rear and they’re still grazing away and chilling like it’s nothing .",
            "Learned behaviors… native women all over the world delivered their children, sometimes in solitary or out of the village. Sure, there can be complications but it’s a mindset as well. Preparation for childbirth requires more than filling out paperwork. Also difficult if you have to work until delivery so you can get the 6-8 weeks disability AFTER the birth to bond with your newborn. \n\nAlso, wish I was told to practice LaMaze breathing when taking a shit-really can’t practice when labor hits & you have to just “do it” without knowing how or if you’re doing right/wrong.",
            "I think it’s more instinctual for animals to try to be quite when giving birth because it’s a very vulnerable predicament they’re in at the moment and they might be preyed upon if they show signs of distress but it does hurt them.",
            "I have seen plenty of painful animal births on a farm I worked at. I took care of pregnant goats and their babies on a dairy and helped with pigs sometimes too. The mothers would scream and look very uncomfortable while pushing the babies out. Birthing is an experience full of suffering.",
            "Our heads are too big. Compare a baby's head:body ratio with, say, a kitten's. We've got fat fuckin' heads.\n\nAlso, since the advent of caesareans, babies have been getting bigger. This makes sense evolutionarily, as more developed baby = more successful baby, but where once we had a sort of evolutionary limit on the process (how big of a baby could be stuffed out through a human vagina) now there's no cap. People have babies that are too big to be born traditionally and then those babies go on to grow up and breed and have their own even bigger babies.\n\nIt's getting to a point where there's a likely future for humanity in which we are totally reliant on modern medicine for childbirth. We're just going to be producing babies that are flat-out too big to be given birth to. They'll be mandatory c-sections."
        ]
    },
    {
        "post_id": "t21xnm",
        "author": "BenVoc218",
        "title": "Can I walk into a movie theater just to buy popcorn?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/t21xnm/can_i_walk_into_a_movie_theater_just_to_buy/",
        "score": 17122,
        "num_comments": 1309,
        "created_utc": 1645895554.0,
        "selftext": "Me and my wife were talking about going to a movie tonight, but there is no movie we want to watch. We do however love movie theater popcorn so would it be stupid for us to walk in buy popcorn and then just leave?\n\nUpdate: We went and got the popcorn they were real cool about it they even gave us a lid. Also we are well aware it is way overpriced we do not care.",
        "permalink": "/r/NoStupidQuestions/comments/t21xnm/can_i_walk_into_a_movie_theater_just_to_buy/",
        "comments": [
            "My local movie theater stayed afloat during the pandemic shut downs by selling giant bags of popcorn so thats pretty normal in my area now lol",
            "The theater in my town sells HUGE bags of their popcorn that anyone can buy from the front entrance. \n\nYou can even have it delivered through DoorDash.\n\nAnd I'm talking HUGE bags",
            "If you want to pay way too much for popcorn, they are certainly not going to stop you.",
            "[deleted]",
            "YES!!!! We have actually started doing this with our family. The movie theater is just down the road from us but we have decided that, aside from the popcorn, it’s not worth going and paying the prices. \n\nWe have started making forts with our kids and then going and buying the popcorn and having a family movie night!!! Way more fun and it’s easier to justify buying expensive popcorn when you’re not paying for a movie.",
            "The popcorn and other drinks and snacks are how they make their money, not the tickets. Why wouldn't they be okay with this?  \n\n\nYou could just learn to make your own though.",
            "Concessions is where movie theaters make a majority of their profit, so yes they will let you in just to buy food and drink",
            "All these people judging you for liking the popcorn are lame. I've invested in many products attempting to get the same quality of product at home and it's just not the same. Movie theater popcorn is better!",
            "YES! You can actually! I’ve actually done it. When you walk up to the ticket booth just say you wanted to buy some popcorn. They will look at you weird and go into panic mode. If you say how much you love the popcorn while in panic mode they will let you come in without calling the manager. If they do call in a manager, they will say let them in. I’ve done this several time now. Anytime I go they just assume I’m getting popcorn and it’s a joke now when they see me come up.",
            "No one would even notice",
            "I had a buddy in my car hanging out one time who said he wanted a snack. Dude only had an amc gift card so we had to stop by an AMC so he could buy food inside.\n\nEdit: also just lookup how to make popcorn taste like movie theatre popcorn. They aren't doing anything you can't do at home.",
            "Yes. I can't speak for other states but in California for tax reasons it's required that concession sales are available even without a ticket. Source: movie theatre manager",
            "They will.  I did it when pregnant and craving theater popcorn.  I just told the ticket guy I just wanted to buy a popcorn and he let me through.\n\nIf I was a dishonest person, I'd use this to see free movies.\n\nThey make their money on concessions, so one extra person willing to spend 1275% markup for a popcorn without a movie...pure profit baby!",
            "Yes, we had people come just for the popcorn because we made them with old Popcorn-Machines (two iron popcorn pots). The popcorn shift was my favourite, making popcorn for 8 hours, filling the whole room with bags for the next week. If you wanted to take a break you had to let the pots cool down and instantly clean them, so nothing would stick forever in them. And after the break heat everything up again. Everything smelled like popcorn after that. Oh I miss the popcorn :( the cinema had to close down because of the pandemic. Luckily one part will be preserved because it's a historical cinema from the 20s.",
            "I had a couple come in and do this weekly at the old theater I worked at [flagship cinemas] \n\nIt's all good. We do not judge.",
            "As a former cinema worker, you are vastly overestimating how much I think about or care about the customers.",
            "As someone who used to live across the street from a movie theater, I did this quite often. Go nuts.",
            "I used to work in a cinema, go for it! We could not care less :)",
            "Most movie theaters’ money comes from concessions,  not tickets. I’d imagine they wouldn’t mind since you’re giving them business.",
            "For real - no one would notice. And eve if they did - 99.99% of the world would laugh and agree walking in just to grab some popcorn is a great idea.",
            "Stovetop popcorn + store-bought movie theater butter is the way to go. You can make a lot for cheap and it’s really quick and easy:\n\n1) grab a wide skillet (~12 inches wide with ~2 inches deep) and a lid\n\n2) pour enough oil (movie theater flavored or corn, or a mixture) to coat the bottom of the pan evenly (3-ish tbsps, maybe more)\n\n3) pour enough popping corn kernels to cover 75-90% of the bottom of the pan in a single layer, sprinkle with generous amount of salt, cover with lid\n\n4) turn on high heat until the first kernel pops, then turn to low heat/simmer\n\n5) let all the kernels pop with the lid on until you hear 2-3 seconds between each pop, then remove from heat. Pour popcorn into serving bowl and add topping oil or other toppings if needed/desired\n\nAlternatively, you can use a deep pot, like for spaghetti or chili",
            "Yeah my wife used to do this. Ridiculous behaviour paying an absolute premium for popcorn",
            "Some of the theaters near me have concessions before the ticket taker. At those places, you can, of course, buy concessions without a ticket. I'm not sure about the ones where they have the ticket taker first",
            "During the pandemic, I was on a mission to learn how to make movie theatre popcorn. It took months, but I was finally successful. I could only purchase most items in very large sizes, so I could probably make popcorn for the next 20 years. To replicate AMC movie theatre popcorn, you will need: \nButter flavored coconut oil. \nFlavacol. \nThe butter flavored petroleum oil you pour on top(which I could only find the right stuff by the GALLON). \nMushroom popcorn works best if you find the good stuff but I find Orville redenbachers popcorn kernels to work really well. \n(I can look later if you want the exact brands I use for the coconut oil/topping because that took testing too) \nOne large metal pot with a lid. You melt several tablespoons of the coconut oil first, toss in a couple teaspoons flavacol(careful because a little goes a looooong way) then add 3 kernels, cover and listen…once they’ve popped, add 1.5 cups kernels and cover….wait for popping, occasionally shaking the pot. When it’s done, pour into a bowl and test…if you like it saltier, sprinkle more flavacol. Then pour on that”butter” until you’re sure you’ll have to run five miles a day for a week to burn off those calories. \nThis makes at least a large sized bucket of popcorn. Total cost of years worth of making it at home…about $45 total. But the great thing is, everything is artificial and the expiration dates are many years out. AND, your whole house will smell like a movie theatre.",
            "99.9% of theaters will say “absolutely!”.  Concessions is the only thing they make any good money on",
            "yep",
            "Yes! I've done it before. Like, two or three times a year, I just get that itch. Walk in, get it, and eat it on the drive home.\n\nNever once regretted it.",
            "Why not? Theaters near me have the snack stand in the center of the lobby. Easy to get your stuff and leave.",
            "Sure, I've done that many times (speaking for Germany)",
            "Yes, you can. We just had to tell the ticket person, and they watched us like a hawk to make sure we didn't sneak back to the theaters.",
            "lol why not I did this so many times there was a theater in Munich/Germany they make such delicious Popcorn with the option of salt and sweet. I buy both of them  and watch a movie at home that was great unfortunately I no longer live there and beside this they had to close the theater cause of financial problems thanks to the covid-19!",
            "Yes.\n\nI worked at a movie theater and had several customers do exactly that because they thought our popcorn was better than store-bought (and it definitely was).",
            "Yes you can",
            "You can but let's do it at home for far cheaper...\n\nYou need to buy some Flavacol. It is an amazing popcorn seasoning that You can get on Amazon and it will last forever. Its what makes movie popcorn taste so much better than other popcorn. You have to pop the popcorn on the stove but its worth it and its super easy. You just need a big skillet or pot with a lid. \n\nAdd it to the oil when you're popping the corn and when its done finish it with some clarified butter or butter flavor topping and you'll never go to the movies again.",
            "I worked at a movie theater in high school, we occasionally had people come in just to buy popcorn or a drink and not see a movie. It wasn't an everyday thing but it wasn't outrageously weird.",
            "Yeah, i used to work at a theater and you could do this.",
            "Yeah I’m most of the theaters I’ve been to, the concessions are before the ticket takers so you’d be fine. Even if you had to pass the ticket takers to get to the concessions, if you asked, they’d probably let you go make a purchase.",
            "Call up the theater. The ones near me started selling giant bags of popcorn as lockdowns were getting close to ending. One still does it.",
            "Former movie theater employee here - people do this a lot more than you’d think. The most common type of people who do this are spouses of pregnant people trying to satiate their partners cravings or parents hosting sleepovers for their kids!",
            "[deleted]",
            "Want movie-theater popcorn at home, and I mean truly movie-theater popcorn?\n\n1. Stir-Crazy or other brand of popcorn maker that has a revolving stir rod to keep the kernels moving, and the domed lid that doubles as a bowl has vents in the top to allow steam to escape. The stirring and the steam venting are both are essential for large, crispy kernels. Available at many stores such as Target and Wal-Mart, and on Amazon.\n2. High-quality popcorn kernels that DON'T come in any kind of non-air-tight container (such as a plastic bag).  The secret to big-popping kernels are those that still contain a higher water content, so the fresher the better, and an air-tight container retains high moisture content.  Orville Reddenbacher in a jar can be found just about anywhere, or look online for other brands in air-tight containers.  There's a type of popcorn called \"mushroom\" - so-called because of its shape when popped, like the rounded curve of a mushroom cap.  This pops very large and very crispy although it does seem to have a higher proportion of hulls.\n3. Butter-flavored popcorn oil.  Coconut oil is the best but choose a liquid oil over the ones that are solid at room temperature.  There are many brands, but Great Northern (doubles as a topping) and Snappy are the highest rated.  Available online and on Amazon, as well as at Costco or Sam's Club.\n4. Gold Medal brand Flavacol butter-flavored popcorn salt.  Available online and on Amazon, as well as at Costco or Sam's Club.\n\nWhen popping, add twice the amount of oil recommended (it won't be greasy, I promise), and add salt to the popcorn and oil at the same time.",
            "You absolutely can, and if you make a habit of it, the manager will love you.",
            "Cineplex in canada you can even uber eats it",
            "I’m thinking a FRESH POPCORN NOW sign kinda Lind the Hot-N-Now sign at Kristy Keene would help popcorn sales.",
            "The theater in my town allows it , infact they even sell food through skip the dishes. I have seen a few people order popcorn to there house",
            "I worked at a movie theatre where tons of people came in only to get popcorn. We had special to-go bags for it. Not only is it welcome, but it’s encouraged because movie theatres just barely break even on ticket sales. Most of the profit is through concessions.",
            "I too, have craved movie theater 🍿, but I did something about it so I could have it in my own at home anytime I want. \n\nHere's the secret: Flavacol. It's like an intensified shaved salt. I could only find it on Amazon. \n\nNext secret: butter flavored coconut oil, also found on Amazon. \n\nGet yourself a popcorn maker and add 3-4 tablespoons of butter-coconut oil and 1/4 TEASPOON of Flavocol (it is extremely salty so a tiny amount will do!) \n\nYou will never go back to a theater for popcorn ever again! I promise.",
            "i mean concessions is where the money is",
            "Our movie theater will sell you a garbage bag size of popcorn for $25. \n\nWe buy them for PTA to serve the students. I know *most* people don’t *need* a garbage bag size of popcorn but it’s cheaper than what you’d pay for a large bucket lol.",
            "I bought a [container of Flavacol](https://www.popcornsupply.com/flavacol-butter-flavored-seasoned-salt) so I can make movie theater popcorn at home. A container will still probably last several years (I use a teaspoon for half a cup of kernels)",
            "When my wife was pregnant with our 2nd kid, she had huge cravings for these specific roasted nuts at one particular theater in town. \n\nI walked in there at least 4x/wk and but the time the kid was born they would see me and pull out a handful of bags ready for me.",
            "I worked at a theatre for several years as a teenager and we had people stop by and just  buy popcorn all the time. Most of the profit comes from concession sales anyway so I'm willing to bet most theaters wouldn't mind if you just wanted popcorn and didn't purchase a ticket.",
            "My mom does this all the time! She’d make the trip to the movie theater just to get popcorn (with an insane amount of extra butter) and go home. Then, when I learned to drive, she’d make me go get it for her.",
            "I do!  The ones who check tickets at the front door usually ask me to leave something with them - phone, car keys… something that says I’ll be back in a few minutes rather than a few hours.  The ones who check tickets AFTER concessions don’t give a crap.",
            "My closest theater has ticket check before you can get to the concessions.",
            "Yes! Source- me. Pregnant. Wanting movie theater butter popcorn lol I just walked in, got the goods and walked back out- Regal cinema",
            "That's literally what I did yesterday! I walked into the theater with my little sister in tow, gave a friendly nod to the suspicious security guard, wandered over to the popcorn section, got a bunch of butter on top of it, paid for the overpriced but yummy shit, and then happily walked back out of the theater.",
            "They would be stupid not to sell you popcorn.  It's one of their most profitable products",
            "theatres make their money from concessions, not ticket sales. They won’t mind the sale one bit.",
            "I don't think the candy bar staff are going to ask to see your ticket so yes, you could if you wanted to.",
            "in non covid times, they'd probably be happy about everyone just coming in just for it",
            "They don’t make much on movie tickets. They make their money on popcorn and soda sells.",
            "Yes I have done it",
            "Do it that’s how they make money but take some extra butter in a sippy cup",
            "Yep, I do this all the time. Just go up to the usher and say \"mind if I go buy some popcorn?\" and they'll usually let you through. \n\nIf you're in the US, Cinemark theaters have what they call \"Pack-a-Pops\" which are basically massive bags of popcorn you can buy for like $10. They're specifically for people who want to take popcorn home cause you can't take them into movie theaters.",
            "My pregnant coworker used to buy popcorn from a theater near our job because as soon as she could smell it she craved it. They started giving her a discount and in her last month (before maternity leave)they delivered free giant tubs to her at our office it was really cute.",
            "You kidding? The manager would probably escort you to the counter personally, and offer to valet your car while you’re in there!",
            "If you like movie popcorn enough to pay their INSANE prices, then I feel like you and your wife would be better off just buying a professional quality popcorn machine.",
            "Straight to jail.",
            "Yes. I had planned to take my 9 y.o. son to the movies. He got covid. Went to the theatre (masked with well used sanatizer in my pocket) got him popcorn and had movie night at home.",
            "Of course you can always buy popcorn? If they sell it, they want you to buy it. It's not like they keep tabs on who has a movie ticket and who doesn't. :P",
            "Our local theaters sell tickets and concessions at the same cash registers, they'd be fine with you just buying snacks.",
            "I used to crave theatre popcorn when I was pregnant… husband must have made that trip at least 20 times in those 9 months! Yeh .. that’s expensive.",
            "Obviously your question has been answered thoroughly at this point, but I just wanted to point out that if I were a movie theater owner, I would be a terrible business person to turn away someone coming in off the street and buying the good that I sell that has by far the highest profit margin. You want popcorn? Absolutely. Oh, and you want to take it and eat it at home so I don't have to clean up after you? Sure, how many trash bags full do you want?",
            "Ask them if you can just put your head under the butter dispenser and have them pump it into your mouth",
            "Obviously he is diamond-handing AMC",
            "Just make popcorn at home. There are many recipes for theater style popcorn on YT.",
            "A lid?! \n\nIm over here in 2022 and this movie theater is in 2222",
            "I keep microwave bags of kernels in our fridge. Fresher and pops better. Heh now I’m craving popcorn.",
            "My theatre will sell you a big hefty trash bag full of popcorn for $20 if you call ahead!",
            "Do you guys not have microwave popcorn there? Or even jiffypop? Or those home popcorn makers?\n\nWhy spend 8 to 10 a bag, when you could make the same amount for a dollar or two? Add a bit of salt, melt a couple tablespoons of butter.",
            "There is legit a store one mile away from me that just sells “theater quality” popcorn.",
            "Yeah I do it all the time. Some theaters, Cinemark in particular, have a deal where you get a free refill on a large popcorn. So I’d buy a large, dump it into a clean plastic bag, then immediately get the refill and have popcorn for days",
            "When there's no good movies at my local theaters. I will go get all my popcorn, drinks and treats. Then watch a movie at home.",
            "Bro just buy the movie theatre flavored popcorn from the grocery store",
            "Yes. Source: my mom does this. She's obsessed with that popcorn.",
            "Yes, i have had a dude literally buy a 5 pound bag of it and then go home, this was from when I worked at a movie theater!",
            "get flavacol and a silicone popcorn bowl for the microwave, its like 89% the same was movie theater popcorn",
            "I too budget $150 for a dinner date with my wife.",
            "I love this. My wife and I do things a bit off like this and we don't care either ha. Live your life to the full as long as it's not hurting anyone else right?",
            "In Florida you can get killed for throwing popcorn!",
            "If you’re asking if the movie theater will take your money…. Yes, yes they will.",
            "I work at a movie theater, if you just ask the guy at the front he’ll let you through every time. On the off chance you go to a movie theater you didn’t pay to be in, the company literally wouldn’t lose a cent. The movie is being played anyway 🤷‍♂️",
            "Yes. But ev n more miraculous you can make popcorn at home for close to to money!",
            "https://www.recipetineats.com/homemade-movie-popcorn/\n\nBest cinema style popcorn I've never made at home. Kept me going through lockdown. I recommend giving it a try sometime!",
            "The movie theatre in our town actually had popcorn drop off when covid restrictions were hard and the town was actually really helpful and a lot came through to buy popcorn. I think some still do but I just don't see it so idk.",
            "When I lived near a movie theatre they did Uber eats. So good to have a home movie night with cinema trash food.",
            "Yes you can if you want to spent 8 dollars on it.",
            "This is a bad idea because you can get the same shit at the grocery store for half the price.",
            "Are you also going to buy a massive bucket of cola? (The.'medium')",
            "Do u really want 15$ popcorn lol",
            "Buy a jar of kernels. Cook on medium high with Ghee. Finish with a little melted ghee and salt. Movie popcorn.",
            "Not at my place. You pay for the ticket first. This place is HUGE and has shitty popcorn already in bags so they dont have to pay people. So expensive and not worth it. Sometimes I question whether my tastes have changed as an adult or if the products are really just shittier.",
            "No they might arrest you.",
            "Probably depends on the movie theater. If you can get to the concessions area without a ticket, then go for it. Personally, I'm not a huge fan of movie theater popcorn, especially if they use butter flavored oil instead of real butter.",
            "Some theaters (the minority I think) are laid out so you have to show your ticket before you get to the popcorn stand.  I think it's more the old school ones that haven't been renovated.\n\nMore modern ones seem to not check your ticket until you're about to enter the auditorium.",
            "You can buy a popcorn machine.\n\nThe butter they use is some sort of ‘butter flavored oil’ you might be able to buy it at a grocer.",
            "You can literally do whatever you want any time",
            "Tbh if you just YouTube it you can make popcorn 10 times better and more tastier",
            "Does anybody ever watch the movie they paid for, and then walk down the hall to watch a completely separate movie that you didn't pay for? There's literally nobody that's guarding all of the movie entrances... Just the 2 where you give them your ticket and that's it.",
            "You could probably make it at home indefinitely for not much more than the theater would charge you for one serving.",
            "Sure thing, bruh. If you get off on paying insanely high prices for popcorn, have at it.\n\nOr you could spend that cash on a home popper, some good kernels, and coconut oil.",
            "Probably not. Usually need a ticket to get past the door.",
            "Sure but you have to buy a ticket to SOMETHING just to get access. They don't sell to passers by. They sell to MOVIEGOER\nEdit: looks like I'm wrong. It's your money. Go for it",
            "Yes it would be ridiculously stupid. but that's because of the price. \n\n&#x200B;\n\nJust buy your own popcorn machine and kernels and don't pay the 5000% markup.",
            "Hey if you want to go into dept to get great popcorn I don't see why they would complain.",
            "[deleted]",
            "Very surprised by all the people saying yes. All the cinimas in my town you have to show your film ticket to get far enough in to buy popcorn",
            "No",
            "Didn't know someone could or would do that, have you also gone to restaurants just to order a drink as well?",
            "but...why? lol wouldnt it taste the same if you make them at home",
            "My wife and I have done that before It's possible.",
            "Our local theaters sell popcorn by the large plastic bagful. You can walk in and buy and leave.",
            "I’ve done this plenty of times. Bad financial decision but it’s less effort.",
            "Yep. I used to work in a theater and it happened all the time especially when it was raining outside for some reason .",
            "I have done some Uber and skip in my spare time and there are a few orders I pick up from Movie theatres. so my guess is you most definitely can",
            "My grandma used to do that with me.",
            "They have the movie theatre on skip the dishes where I’m from so you can just buy popcorn n shit",
            "My ex accused my of lying about going to the movies once even though I came home with popcorn. He said I could just walk in by and buy it.",
            "Some theatres check for tickets before you reach the snack bar, and others check them after.\n\nEven the ones that check it before I would probably let you in if you asked nicely.\n\nSkip The Dishes delivers from our local theatre.",
            "Go to a theater near closing. They usually have a ton of popcorn leftover and you can get it for cheap or free",
            "I mean you can but you're going to spend more.",
            "Yes. It's not like they check tickets at the counter or anything; unless you deliberately say \"We're just here to buy popcorn and go\", they'll probably just assume you're regular movie goers.",
            "Yes or even merch. \nOr just to look at the posters.",
            "1000% percent markup ...... the choice is yours kind stranger.",
            "Yes. I've done this before and they've never given me any problems.",
            "I do that all the time. Move theater fake butter cravings creep up on me.  I live by a theater. It works.",
            "From my experience you can also walk in a movie theater and go watch a movie without paying for anything",
            "Better off just buying and popping your own popcorn seeds, then drizzle them with a ton of melted butter and salt and walla! Movie theater popcorn for 1/36258th of the price!",
            "Theaters are not doing real well right now. They will take what they can get.",
            "Most theaters now encourage people to do this..",
            "The cinemas here are on ubereats. We ordered popcorn and nachos once. Once. \nVery stale.",
            "it feels illegal but its not",
            "I mean popcorn is amazing so I get it.",
            "Depends if the popcorn is before or after the ticket check.",
            "Yea, at least I was able to do it in a theater near me. Just told them what I was up to, buying popcorn, and everything was fine.",
            "Yes, unless they require tickets for building entry as opposed to theater entry. If they have a lobby you enter first with multiple places inside to choose food from you can treat it like a mall food court.",
            "If it’s the end of the night you could ask how much for a trashbag with all the leftover popcorn they will throw away. Some trash the popcorn at the end of the night or put it in a trashbag and save it for the morning.",
            "I always thought jiffy pop was better. It's still around but not at like every grocery store",
            "Yes, when I went in the manager actually looked happy and gestured for me to go to the stand",
            "yes, I've done it many times.  you can get the 2.5 gallon ziploc bags and bring two and then get the large popcorn and the refill and put them in the bags if you like",
            "We have a little local theater in my small town, and during the pandemic they kept their doors open by selling popcorn, soda and candy on the weekends. They couldn't show movies but they could still sell the snacks. Kept them afloat.",
            "A theater close to us sells it 50 gallon trash bags.",
            "You should just buy an at home movie theater popcorn machine",
            "Dude absolutely go do this! I do it all the time. My theater sells a massive bag of popcorn for like $14 that I bring home and my family will graze on for weeks. Theater popcorn is far superior to store bought",
            "Most movie theaters will, I used to work at one and we always just let people in if they just wanted snacks. Granted, we will tell our coworkers over the radio that you're only here to buy snacks and to keep an eye out that you're not trying to sneak into any movies.",
            "I’ve seen a few movie theaters in malls that sell popcorn through a window to mall shoppers.",
            "If the snack bars are before the ticket check then sure why not? The big theaters at my place have the snack stations after the ticket check though.",
            "I have been to theaters where they will let you. \n\nI have been to theaters where they don't.",
            "they will gladly sell you overpriced popcorn even without a movie",
            "Fuck yeah. My wife and I do it at a theater near us often!"
        ]
    },
    {
        "post_id": "ks3ley",
        "author": "Zro6",
        "title": "Does anyone know the name of a government website where you can send pictures of your hotel room? Its to prevent human trafficking and pedophilia rings by using the pictures to identify what motel the person is at.",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ks3ley/does_anyone_know_the_name_of_a_government_website/",
        "score": 17108,
        "num_comments": 368,
        "created_utc": 1609986906.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/ks3ley/does_anyone_know_the_name_of_a_government_website/",
        "comments": [
            "TraffickCam? There's an app for it.",
            "I'm just here to say I'm so glad things like this database exist and people actually use it to help out. That is such a great idea!!!",
            "Would be great if all hotels did that voluntarily. Surely they not okay with it either.",
            "It's TraffickCam. 😊",
            "How does sending a picture of the hotel room prevent human trafficking?",
            "Did you find out?",
            "For the people still bamboozled by this:\n\n1. Law enforcement agency has pictures, videos, etc of sex trafficking victims, child porn, etc taken in some kind of hotel room.\n2. They run it through a database of real, unedited pictures of hotel rooms taken by officers and also members of the public.\n3. They compare details such as decor, room size and shape, window and door placement, any kind of branding, etc.\n4. They hope for a match with either a brand or a specific location. For example, if they matched a photo to a small motel chain in one particular state, even if they couldn't get the specific motel, they could start looking at known offenders within a certain radius, victim ID for missing persons in the area, possibly gather evidence for prosecution (things like CCTV or witnesses), etc.\n5. ???\n6. Hopefully justice or closure.\n\nLaw enforcement at all levels in all countries require civilian assistance to be effective as possible. This is one way.",
            "I believe I have it saved in my bookmarks. Let me check for you quick. Forgot about this site.\n\nEDIT: I guess it was a reddit sub called r/traceanobject",
            "[removed]",
            "I have an app called TraffickCam. (iOS)",
            "I just add them to public Google photos and reviews of the hotel because that will show up in the public Google photos for the people to search and compare.",
            "I had no idea something like this existed. Could they not use photos from the websites of  many accommodation pages ?",
            "Does this only work in the US? Or can you use it in other countries as well?",
            "r/tipofmytongue is better for this type of post",
            "Can confirm the TraffickCam app had actually helped locate children who’d been photographed for pornography.",
            "Fun fact but really this is often used by police to arrest working sex workers instead of actually stopping trafficking",
            "I work in a hotel. On a major highway. \n\nGonna do this with every room. Thanks op.",
            "The government of what country? The world is kind of big you know",
            "Yes FBI have a section aswell as Interpol you can also look at rooms and objects to help them too.",
            "fbi.gov",
            "Why not force hotels to send pictures of their rooms to the government?",
            "Question, is there a way to scrape images from hotel aggregator websites like Expedia to make this even more efficient?",
            "huh?  hows that work??",
            "I would assume it works worldwide since sed trafficking is a world wide issue, I would give it a go and see if it works",
            "Why can't that government agency just scan all pictures from booking.com and similar sites?",
            "For once living in the cesspool of Ohio might pay off. Being close to major cities and the Canadian border makes my area infamous for trafficking. Glad that if I live here, I can do my part to help out.",
            "Random, but does it include the exterior, view through windows in the room? Seems like it might be helpful to narrow down but I’m not expert. Very new to this world.",
            "Do most human traffickers take pictures in hotel rooms of their people?",
            "Is anyone else alarmed that the government can identify any hotel based on pictures of the inside of the room you’re staying in..?",
            "Please explain this I am completely confused. I read the op, and what is being asked. To send photos of your hotel room to see if people were abducted there? Like why? For people on blind dates, first dates?",
            "[removed]",
            "[removed]",
            "How exactly can you tell if someone is \"trafficked\"? Because they look foreign?",
            "Ig its the police. Take photos, go to the police and show them. Or sens them anonymously with a throwaway email.",
            "isn't most human trafficking done by government organisations?",
            "[removed]",
            "[removed]",
            "But you're also targeting consensual sex workers when you do that, not that I think that you care at all about them\n\nEdit:. Let's go for -1,000,000 I know you can put me in downvote history for handing out hard truths",
            "[removed]",
            "Just walk around in DC, they have CCTV in every corner.",
            "[removed]",
            "Do you just upload pictures of your hotel room and thats it? What happens after that?",
            "There are some subreddits that do this. For example: r/TraceAnObject",
            "Question... so when you upload pictures of your hotel room does a software compare that room to those in videos or pictures posted online? Or is there people watching all these illegal videos and seeing if they notice anything? \n\nI really hope it's the first one I said",
            "It's an app called TraffickCam",
            "This is amazing.  \nI travel often for work (well, pre-Covid) and I wish I had known about this then. I will be sure to use it!",
            "Great now all the people know to film with blankets covering the room...",
            "Would it help if a new subreddir is created so redditors could upload there photos of the hotel rooms they stay in?"
        ]
    }
]