[
    {
        "post_id": "t0rm7a",
        "author": "beachv0dka",
        "title": "Do men just make brownies sometimes?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/t0rm7a/do_men_just_make_brownies_sometimes/",
        "score": 16367,
        "num_comments": 3579,
        "created_utc": 1645753772.0,
        "selftext": "Serious question from my girlfriends and I. At 2am when you’re bored and find brownie mix, do y’all just bake brownies for the hell of it? Put your lil oven mitts on and have at it? Cause we do.\n\nI need to know.",
        "permalink": "/r/NoStupidQuestions/comments/t0rm7a/do_men_just_make_brownies_sometimes/",
        "comments": [
            "I sometimes just bake a cake and eat it all by myself.",
            "My fiance is a terrible cook. He always bites off more than he can chew, and everything is always either burnt or not cooked.\n\nHe is, however, REALLY good at making pies. He makes them from scratch. He wakes up every once in a while and says \"I think I'm gonna make a pie today\" then goes to the grocery store to see what kind of pie filling is \"speaking\" to him.\n\nThen we have home made pie for the next few nights and he feels like a domestic godess",
            "My husband hums and baked all the time.. he makes killer cranberry orange scones",
            "Everyone in my family, male and female, will often bake or cook at 2 or 3 am. We call it having Dark Lunch as in \"I made brownies for dark lunch last night. There's a couple left. Want one?\"",
            "*Brownie, because it only counts as one if you don't cut it",
            "Not a man, but I have a brownie recipe that doesn't require a box mix.\n\n[https://www.allrecipes.com/recipe/10549/best-brownies/](https://www.allrecipes.com/recipe/10549/best-brownies/)\n\nI like it specifically because I almost always have all the stuff I need for it.",
            "You ever met a man who doesn’t like a goddamn brownie at 4am? There’s your answer",
            "I make midnight scones sometimes cause they're easier but yeah. Also this late-night [nutella pull-apart bread](https://i.imgur.com/dtK5UmJ.png).",
            "Haha I did exactly this last night!",
            "Sometimes, it’s homemade cookies… :|",
            "Depends how high I am",
            "Not out of boredom, but because I was craving brownies. Also, I don't have any oven mitts; I just use a towel to pull things out of the oven.",
            "Not brownies bc that's a lot of sugar for e but I do a lot of stovetop cooking after midnight",
            "Only real men do",
            "Probably like every other weekend, sometimes it's a cake or cookies.  \n\nJust made muffins for my mom.  She made baking fun when I was a kid, getting to help her and lick the spoons or bowls clean, always got to taste test the stuff before everyone else.  Now it's relaxing and I get tasty treats for a few days.",
            "Did once, I was more baked then the oven and almost burnt the house down..",
            "My husband's always in the kitchen baking random shit. Brownies are a popular one with him",
            "My dad does. It never occurred that this could be a sign of his masculinity. I guess I’m not truly a man yet.",
            "My boyfriend bakes all the time, it's awesome.",
            "Haven’t done it in a while, but my recipe for oatmeal raisin cookies has me put the dough on some wax paper, make a sausage, and place that in the freezer. So that’s cool for 2am insomnia- take out the tube, cut 12 cookies, put them in the toaster oven. Watch tv for 30 minutes, eat cookies and then go back to bed.",
            "I'm from the bush and my primary hobby is woodworking. But I'll be fucked if I don't make the best damn chocolate chip cookies you've ever had. The trick is almond extract.",
            "Never at 2am, that's sleeping time.\nIll bake if I feel like it, but generally on a weekend when I have some free time.",
            "Who just gets bored at 2 in the morning and goes, “fuck, now seems like an appropriate time to bake”",
            "I can’t find the photo, but my husband (then boyfriend) and his male roommates desperately wanted brownies on a Sunday night. I found a box of mix but then we discovered no one had a pan to bake them in. It was late so no stores were open. The guys were all engineering students and proceeded to spend 30 minutes creating a reinforced “pan” made out of foil. It worked! They were so proud lol\n\nEdit: a word missing",
            "I have not once ever made brownies for \" the hell of it\", I do however want brownies because I want brownies. Brownies are a very sacred and serious topic, not something you just do on a whim. One does not simply go \"oh I'm bored guess I'll make brownie\", because then that's a waste of brownies, you do not truly want them then and can not appreciate them in all their greatness.  One must have an actual purpose for making them, not a whim",
            "I don't do it at 2 am, but I do it.\nI eat them à la mode, with vanilla you scream and Hershey syrup.\nJust finished one 15 minutes ago.",
            "Yes. Everyone, regardless of gender, sometimes just makes brownies.",
            "I bake the hell out of them. I love the Barefoot contessa recipe but we always have boxes of Betty Crocker/Duncan Hines to scratch the itch.",
            "My upstairs neighbor knocked on my door at 11 last night asking for an egg because he was making brownies. A little earlier than 2 am, but yeah. \n\nI’ve been known to bake myself and then some brownies at all hours myself.",
            "Mainly cookies",
            "I bake alot and do all the cooking in our house. No apron or tiny oven mittens and sure as hell not at 2AM . I have 3 daughters and its something we enjoy doing together.",
            "No. Of course not. We make it during the day anticipating eating it later.\n\nBeing a dude is about proper planning.",
            "Literally just made my wife sugar cookies with some caramel bits and white chocolate chips an hour ago.\n\nAlso, no oven mitts, I'm not a lady.",
            "No? I make them from scratch. Also cinnamon rolls the size of dinner plates.",
            "[removed]",
            "Very cringe to think this is a cute or interesting question to ask. Like me as a dude asking if girls ever just make Mac and cheese.  You know cause that’s a quirky thing us guys do in case you didn’t know. Please I need to know.",
            "I made a batch for my wife out of the blue this past weekend.",
            "Only time I hear of brownies being made by a guy, and especially at 2 am, is if they have ganja in the mix?\n\nEdit: by looks of the other comments ganja brownies are popular with the dudes.",
            "I remember being new on my adult life journey, walking through the market in my early 20's buying cereal and milk and walking through the bakery aisle for some reason. I saw brownie and cookie mixes and I realized I could make my own. It was an amazing revelation and a treat I still do to this day. So, yes. Some men do just bake brownies sometimes. :)",
            "As a man, no I don’t. However, now I’m questioning why I don’t because I love brownies. I guess it just never occurred to me that I can make brownies anytime I want.",
            "people bake brownies. Men are people.\nthere's ur answer",
            "Yes, 100%. If there’s mix, that shit is getting baked.",
            "If you mean edibles, then yes. If you just mean regular old brownies, then still yes.",
            "Hell I’ve woken up at 3am and made roast dinner just for myself before \n\nI now realise how sad and lonely that sounds, I’m happy!",
            "I do idk bout other people tho",
            "I've done this, yeah. I went to school for cooking years ago and sometimes I make random things. Makes me focused and I relax.",
            "I made scratch brownies today on a whim, but it's just because I had the day off due to weather. I wouldn't normally.",
            "Absolutely, but usually I do cookies more often. This tends to only happen when I'm baked when my hunger overcomes my laziness towards making food.",
            "I do.  And eat them hot out of the oven.  Yum.",
            "I make cupcakes.",
            "I like cake more so I definitely make cake here and there, for no other reason then just to have cake.",
            "Or chocolate cake. Or trifle. Or and or and or.",
            "I'm getting there\n\nWas I raised to? Nah. But I'm a full ass adult.\n\nI'll bake when I want to dammit",
            "If I have cake mix in the house my bf will get bored some weekends and just make us a cake.",
            "Cookies, but yes.",
            "Do cookies count?",
            "Is there weed or hash involved?",
            "REAL men make blondies.",
            "Men actually make pudding at 4 am, because they lost control of their lives.",
            "No, only women ever bake because it's so quirky to bake.\n\n....",
            "R/twoxchromosomes",
            "Only if there’s weed in them",
            "I do.",
            "Oh I sure do",
            "If we’re high we do",
            "Hell yeah. I love brownies",
            "My very stoned boyfriend absolutely will, and there will definitely be a mess left.",
            "Fuck yeah! Brownies!",
            "I usually make flatbread or tortillas and eat them with crema.",
            "Hell yeah I do.  Brownies are amazing.  Matter of fact, I got a box in my pantry for this weekend.",
            "Yes, but to be completely honest I'm more likely to make banana bread if I get a wild desire to bake out of nowhere",
            "I definitely do!",
            "Yes. Cookies too.",
            "I'm a guy and wouldn't you know it, I just made a batch of brownies from scratch (Katharine Hepburn's delightful recipe). I made it because my wife requested it, though",
            "I am man. Yes, I have done this. Ate cereal while brownies baked.",
            "never done it or thought to and now i really want to",
            "Holy shit I will now good idea.",
            "Fuck dude I bake cookies when I’m sad and ain’t no one gonna judge me for that",
            "Hell yes. Except I don't use brownie mix. From scratch is 10x better.\n\nAlso I don't do it so much anymore since I realized that there's, like, 4000 calories in a tray of brownies, and if I'm not careful I can finish one in a day or two...\n\nAt one point I tried cutting off a few to eat now and freezing the rest, so I wouldn't be able to just nom them all day. That was how I discovered that frozen brownies are *delicious.*",
            "56 year old Man here. Hell yeah I make brownies! 2am brownies are better than 6pm brownies. Doesn't everyone keep some brownie mix around?\nOr maybe I smoke too much weed?",
            "I think if you put \"your lil oven mitts on\" before you have even started making the brownies. You are gonna probably fuck up those brownies",
            "I do, when i know some friends come over i bake brownies, spike half of them, mix them up and put them on a plate. You win or you lose, depending on your point of view. Good fun everytime.",
            "Many years ago I was climbing Mount Rainier with 11 other guys, dad, uncle and a bunch of his buddies from work at REI. I'm in decent shape but that first day was brutal. Hiking with a 40 lb pack is tough, and when your feet are sinking into the snow up to mid thigh it's frikin work.\r  \n\r  \nThat night as we setup camp one guy pulls a 2-3 gallon plastic party keg out of his pack, (just... how?) and another has a box of cheesecake mix and a pan. The plan is to heat it up on the fire and float it on the lake to cool it.\r  \n\r  \nThe directions called for an electric mixer and he brought... a tiny little wire whisk.\r  \n\r  \nI watched some of the most physically fit guys I've ever seen take turns trying to frappe cheesecake mix by hand, passing it around every couple of minutes when their arms couldn't take it anymore. So yes, real men bake.\r  \n\r  \nDamn good cheesecake.",
            "Men and women are essentially the same, yes we are humans. Don’t segregate lol. People make brownies. People make food",
            "People of all genders that want diabetes make brownies at 2am",
            "Don’t brownies take like an hour to cook? I’m not gonna be up till 3+ for brownies. No thanks to being up that late anyway.",
            "No. What the fuck? I'm asleep at 2am and you should be too. That's not healthy.\n\nEven if I was bored, baking would not be the way to go. I don't see the fun in tasks that involve a big 40-minute (or whatever) wait in the middle.\n\nPlus, the last thing I need is a big pile of brownies to myself. I'm already fat as shit. Food preparation can never just be a 'hobby'.",
            "Brownes? Not really, but that same situation can and does often lead to chocolate chip cookies. \n\nI regret nothing.",
            "Not much of a baker myself and I don’t think I’ve had brownie mix in the house since I lived with my parents. If I’m up and bored at 2am the last thing I’m gonna do is cook.",
            "I don't think I keep that sort of stuff in my house",
            "Only if mcd’s is closed",
            "I definitely have",
            "I personally don’t, but that’s cause I suck at baking period",
            "I do. But it's not out of boredom. It's out of desire to have brownies.",
            "I too tired to do anything at 9pm let alone cook/bake at 2am.",
            "Made some last weekend. Might do it again on Saturday",
            "Normally I don't eat for taste so under normal circumstances I wouldn't have brownie mix to find at 2 am but I definitely get what that vibe is and get it alot",
            "Men bake brownies any time.",
            "me and my girlfriend do this all the time",
            "Bakers gonna bake\nABB\nAlways be baking",
            "Yup, sometimes I make chocolate chip cookies too.",
            "Never considered baking at that early cuz I'm asleep but hell yeah brownies",
            "I have neither oven mitts nor brownie mix.   \nor the wherewithal to complete such a task at any hour of the day. But besides that, yeah I could see myself doing that",
            "My husband makes homemade apple pie and cookies from scratch! I love him for it!",
            "Depends on how stoned we are.",
            "How high are you?",
            "Stoners make brownies at 2 am.",
            "You might find better luck on \nr/AskMen",
            "how many girlfriends do you have?",
            "I'm a 36 year old hetero dude and I've been baking chocolate chip cookies from scratch pretty often",
            "Something about this post is Sus but I can't put my finger on it",
            "OMG! A guy friend of mine made brownies. Not just brownies, but brownies with Carmello candy bars in the middle.",
            "Oh yeah definitely!! 😄",
            "Even young guys make brownies!!\n\n-But they may or may not contain special ingredients that impair your driving skills",
            "My brother is a scruffy, flannel-wearing, power-tool-wielding, big-dog-loving, truck-driving dude...and his red velvet cookies are to die for. I'm his older sister and I think I've made brownies about three times in my adult life because I don't care for baking.",
            "I used to make brownies before they started drug testing me.",
            "I'm a night shifter so i make a lot of things after midnight",
            "My husband randomly bakes brownies sometimes and they are delicious. He made some yesterday, actually lol.",
            "Sure and cookies too.",
            "Instead of brownies it’s often just a bowl of cereal at 3 am",
            "I know at least one man who does. Enjoy life. Don't let gender expectations get in the way of your joy. Sometimes you just need some brownies.",
            "Dude I randomly made lemon basil sugar cookies at 1:30 am for no reason while playing Spyro on PS4. I didn’t even pause the game, I just got up and went to work in the kitchen. When I was finished I went back to playing my game like nothing ever happened 🤷🏾‍♂️",
            "I make more than just brownies! Bread, cakes, cookies, biscuits, cinnamon rolls, all of it! But I am making brownies soon for my birthday :)",
            "I'm going to be honestly, all the men I know are the cooks in their relationships. Most of their wives/GFs might be fine if you left them with boxed Mac and cheese, maybe.\n\nPersonally I have baked brownies or other treats just for the hell of it, although I resent the idea of using a \"little oven mit\". I use a rag or burn myself like a real man lol",
            "I’m a type 1 diabetic and lactose intolerant, i don’t make brownies at 2am.\n\nGarlic Bread on the other hand, yup.\nPizza I’ve done.\nFlapjacks a while back.\nBut my speciality are perfect pancakes, been making 2am pancakes for years now.",
            "Brownies, muffins, biscuits, cakes and pie.  All the time.  I'm fat as fuck and happy about it.",
            "Am man. Bake brownies and cookies when the mood strikes me. Working on jumbo muffins at the moment.",
            "I’m a single male that lives by myself. I bake all sorts of shit to satisfy my sweet tooth at night when I’m off from work. I’ve actually done brownies at 3am with cold milk and Netflix several times.",
            "This guy does.. But from scratch, not a box\n\nEasy, amazing recipe. If I get enough up votes I'll post the recipe here \n\n(up votes are not an ego thing... If no one cares about this amazing recipe, why post it?)",
            "I make cake batter and eat it raw. Salmonella be damned.",
            "I am a man. I am a damn good cook. I like making large dinners for my friends. I never make brownies. But sometimes my neighbor makes brownies for me. I love those damn brownies.",
            "And where can I find said men…asking for a friend 😂",
            "I bake all the time. It’s like a science experiment with delicious results. Just did brownies last weekend.",
            "Yeah, I also make all sorts of other shit too!",
            "I would imagine that most men who go to the effort of making brownies at any time are doing it to put drugs in there.",
            "I am a man and I love baking. I don’t see anything wrong with that.",
            "48yo solo dude here.  I just watched emmymades last video on those corn flour cookies.  Around midnight i found all the ingredients and made a batch.",
            "Single male living alone.\n\nYep. Especially on days when I feel bummed out.",
            "Rarely is there brownie mix in my house, but you can bet your sweet ass I'll be going to get some tomorrow. Ghirardelli fudge mix is the tops",
            "I do not do this. Not because I am a man, but because I am fat and make sure not to have brownie mix in the house.\n\nIf I *did* have brownie mix, you bet your asses I would.",
            "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\nEdit: this is a copy and paste and I encourage you all to do it too where appropriate!\n\nШановні українці!\n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий.\n\nЦе брехня.\n\nЯкщо ви шукаєте притулку – йдіть до польського кордону.  Ми готові до вашого приїзду.  На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу.\n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl\n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги.\n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ.  ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ.  ВІЗИ ПРИСПИНЕНО!  ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!!\n\nEDIT2: як доказ того, що вам більше не потрібна віза:\n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en\n\nВибачте, якщо це дурниця, я використовував Google Translate\n\nWant to support Ukraine? Here some charities: https://www.reddit.com/r/ukraine/comments/s6g5un/want_to_support_ukraine_heres_a_list_of_charities/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nEdit: added charity link\n\nThis is a copy paste",
            "There is no gender divide when it comes to enjoying fresh baked goodies.",
            "Idk about brownies but I’ve been making damper, basically Australian Aborigine bread, at like 1am.",
            "Who the fuck makes brownies with oven mitts on? They're strictly for pulling shit out of the oven.",
            "Brownies are out. We’re baking banana muffins now. /s",
            "Currently 4:35am and I'm eating fresh baked cookies sooooo yes. Yes we do.",
            "I was once high af and hungry,  I decided to cook a ready meal lasagna.\n\nNext thing I know my hand is warm, I look down and I've got my oven mitt on with the cooked lasagna in it.\n\nI go to put it down and there's also a cooked lasagna there.\n\nSo I figure I'll put not back in the oven, let it cool off and reheat it another time... boosh, third lasagna in the oven cooking.\n\nI had a giggle fit eating the second lasagna on my kitchen floor and watching the third one cook.",
            "I did when I thought I was a man and still do now that I know I'm not lol. \n\nBrownies are good and relatievly easy to make. It's a win win in every way.",
            "I bake all the time. I've made cornbread, brownies, cranberry orange bread, and banana bread this week. Only the brownies were a mix.",
            "At 2AM? Hell no I'm sleeping or at least trying to sleep.\n\nBut yes, I bake recreationally. Yesterday I had a craving for something sweet and noticed I had all the ingredients for pancakes, so I made a batch.",
            ">Serious question from my girlfriends and I. At 2am when you’re bored and find brownie mix, do y’all just bake brownies for the hell of it? \n\nSounds like you lost control of your life.",
            "Yeah",
            "No… but once in a while cookies",
            "I do. Or cookies, or a cake. I love to bake so I keep the base ingredients around. I take them to work or give them to friends because I can't eat sweets but people seem to enjoy it.",
            "I make banana bread does that count? With pecans and semi sweet chocolate chips.",
            "Did this a bit back when I was in college because I was bored.  Oh boy gaining the freshman 15 tasted so good.",
            "Brownies, muffins, flapjacks, pancakes, scones. We men make the bake in our house.",
            "I made a cheesecake from scratch because I wanted cheesecake one night. Turned out really good\n\nEdit: It was premeditated because either had all the ingredients bought about a week before.  The day I made it was spontaneous",
            "I bake every other weekend. Last week was banoffee pie and the time before that was mixed berry muffins. Brownies was last months and i bake enough for a whole week or two cause those cravings set in after meals.",
            "Better than making pudding at 4am because you've lost control of your life.",
            "no, but maybe if I had a girlfriend",
            "I make brownies from scratch",
            "you bet your bippy i do.",
            "I, as a man, would never make brownie mix. Brownies from scratch only. And WITH walnuts.",
            "My husband got the Kodiakcake brownie cups. You just pour water or milk in, microwave for a minute or so and bam, brownies. He loves it.",
            "I bake brownies for my wife when it's her time of the month. Calms the demon inside.",
            "My teenage son does!  I'm lucky if I get one though.",
            "Yes. sometimes a pie too.",
            "I do but not with mix, I found a simple one bowl recipe that I can knock out pretty quick.",
            "Not brownies, but I (34m) do most of the cooking more recently. I bake on a whim sometimes, but it's usually with my daughter. I'm trying to teach her young that cooking at home isn't that hard.\n\n\nShe's 5, so I think she's already got the idea cooking/baking isn't a \"woman\" thing because she sees me do it all the time and - it just isn't. I told her to marry someone who will cook for her.",
            "Cinnamon rolls!",
            "This made me giggle so I read it out loud to my Husband was like “oh shit, we’ve got brownies, don’t we??!”",
            "Damn reading these comments has me shocked how many dudes bake\n\nI’m 22 and not once have I ever baked anything from scratch or from a box lol not once",
            "Muffins. I make apple muffins."
        ]
    },
    {
        "post_id": "aw0oj2",
        "author": "Cheff_excelence",
        "title": "Did paper airplanes get invented before or after real planes?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/aw0oj2/did_paper_airplanes_get_invented_before_or_after/",
        "score": 16368,
        "num_comments": 267,
        "created_utc": 1551415384.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/aw0oj2/did_paper_airplanes_get_invented_before_or_after/",
        "comments": [
            "Before, but they called them paper darts. ",
            "It is believed that the Chinese were the first to construct stuff like paper airplanes (since they were the original inventors of paper). It is also said that the Wright brothers used paper airplanes as part of their research in building the first plane that carried people. But paper airplanes really didn't become popular until WW2, when material to make toys was limited, but paper was plentiful.",
            "Hey, I figured there had to be some existing writing on the subject so I thought I'd take a look around the internet. Surprisingly, Wikipedia's history section did say that the **Ancient Chinese made paper airplane like origami structures**, but it lacked citation. So I decided to poke around more.\n\nKen Blackburn, holder of the Guinness World Record for longest paper plane flight, has a history page on his [site](https://www.paperplane.org/about). He describes predecessors like Chinese paper kites and French paper air balloons, handheld folded gliders. He cites that the earliest source he's found for \"paper planes\" specifically is a book by aircraft designer Jack Northrop from the 1930s, who used them during prototyping. If we count prototyping, then the Wright brothers undoubtedly constructed models as well, so I wanted to focus on recreational usage.\n\nAn author H.G.G. Herklots seems to have the first book specifically using the term \"paper airplanes\" as a way to pass time, which has him constructing them in 1918.\n\nLooking back further, it **becomes challenging to search for because \"plane\" and \"airplane\" aren't the words we would've used prior to 1903** — the year of the Wright Flyer, generally accepted to be the first airplane. However, there are numerous references to ***paper darts*** in sources older than 1903. For example, from a story in The British Essayists published in 1803:\n\n>...he presented himself to the wondering eyes of Euphorion with a huge black bush wig stuck full of paper darts, and as thickly spiked as the back of a porcupine.\n\nAnd another from The Spectator, Volume 23, 1850 :\n\n>If I'm not there they'll be larking about throwing paper darts etc. and messing the place up.\n\nInitially I wasn't totally confident that paper darts were quite what we were looking for, but after digging through a number of different 19th century activity books, I am happy to say that I found this [diagram in Cassell's Complete Book of Sports and Pastimes: Being a Compendium of Out-Door and In-Door Amusements from 1896:](https://ibb.co/bXSywvJ)This hardly answers the question on the date of invention, but I think it's safe to say this **qualifies and certainly predates the invention of the airplane.**\n\nI suspect the difficulty of this hunt is due to the fact that the search is limited to only English sources. Given that origami is extremely old (6th century), it's inevitable that the Chinese would have created gliding constructions. Flying origami structures were incredibly popular with the ancient Chinese. So, the best guess would be that **paper airplanes indeed date far back than real airplanes even though they went by different names.**",
            "[removed]",
            "[removed]",
            "Didn’t Leonardo da Vinci make flying paper models?",
            "This has also been asked on /r/AskHistorians a couple of years back - there were various answers with expert opinions\n\nEDIT: [there were actually a couple](https://www.reddit.com/r/AskHistorians/search?q=paper+airplanes&restrict_sr=on&include_over_18=on&sort=relevance&t=all)\n\nEDIT2: an [answer](https://www.reddit.com/r/AskHistorians/comments/1d30ly/is_there_any_documentation_of_paper_airplanelike/) from u/intangible-tangerine given 5 years ago:\n\n> Yes paper planes pre-date manned flight, but obviously they weren't called 'paper planes' they were called 'paper darts' in British English.\n> \n> Some examples dating from the late Victorian or Edwardian period were found at an archaeological search during the refurbishment of St Anne's chapel in Barnstaple, Devon http://www.barnstapletowncouncil.co.uk/st-annes-chapel-3.asp\n> \n> Note a paper plane's flight is really just controlled falling, which isn't like powered flight, but is like the flight of an arrow (and a dart is just a small arrow)\n",
            "Paper existed before invention of actual planes. People must have folded paper is many ways, threw it, and was like \"oh it flies!\" They probably were called something else though.",
            "Great question!",
            "[Here's a Smithsonian article on it](https://www.smithsonianmag.com/smart-news/paper-airplanes-flew-decades-real-ones-did-180955129/).   I found it using the keywords \"divinci paper airplane\" because I recalled that Leonardo di Vinci had one as well.  ",
            "I've never thought about this before. I'm assuming they based the design of real planes off of the paper ones if they were invented before?",
            "Kites",
            "This sub never fails to ask and answer the real questions.  Things you think of randomly, then Forget you wanted to know - or forget that you even wondered in the first place.  Open reddit one morning.... sitting on the can.  Oh.  Yeah.  I always wondered about that ..... never bothered to really look into it..... And twenty minutes reading this comment thread.  ",
            "This reminds me of a scene from the original Planet of the Apes. Taylor is put on trial by the apes. They assume if there is one talking human there must be many more in hiding, plotting. \n\nTaylor tried to explain that he came there in a flying machine from another world, which they thought was preposterous. He then astounds them all by making a paper airplane and throwing it.\n\nI thought this was the most unrealistic scene. Yes, on a planet full of talking apes I thought this was the most unrealistic scene. There is no way that millions of intelligent creatures who have paper have never folded one into a shape better suited to gliding.",
            "Do you happen to be a student in an English class that literally just had this discussion yesterday? If so—hello! If not, we just had this same discussion in English class! ",
            "Best way to make a paper airplane is to staple a rubber band on the front tip so you can fucking launch them",
            "Ancient chinise suprisingly",
            "Amazing question. Apparently the answer is well known but the question never crossed my mind.",
            "[removed]",
            "[Harvard wants to know your location]",
            "Most likely before, because they are so simple, compared to real planes",
            "Very interesting.... never thought of this before.  TIL!  Thanks!",
            "Yes.",
            "Before but they were called gliders and darts",
            "Ancient aliens brought flying technology to the ancient Egyptians and Mayans ",
            "The Wright Brothers loved to build paper planes before they invented the plane.",
            "Leonardo the Great, maybe?",
            "Off topic,, but this is why all questions are allowed, and simple questions that can easily be googled are allowed. The discussions in this thread are amazing.",
            "[TL;DR - Best comments in thread](https://ibb.co/Byx5Nqt) ",
            "TIL that the paper plane or Paper dart has existed since 500 BCE in Ancient China.\n\nhttps://en.m.wikipedia.org/wiki/Paper_plane",
            "Paper airplanes that you designed, constructed and colored yourself are the cutest!✈️ No offense to the origami planes. ",
            "You could as the same question about origami swans lol ",
            "This is a very good question!!!",
            "   You ",
            "Before. They're actually what inspired normal airplanes.",
            "Flying carpets were a thing before paper, no? \nAlso: kites were made of paper, too. ",
            "[removed]",
            "[deleted]",
            "[removed]",
            "interesting but stupid"
        ]
    },
    {
        "post_id": "10kxnd0",
        "author": "MajorRichardHead7",
        "title": "Why do many non gamers assume that gaming is some time suck that they can't afford? Most single player games are the same length as a season of a TV show.",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/10kxnd0/why_do_many_non_gamers_assume_that_gaming_is_some/",
        "score": 16337,
        "num_comments": 1876,
        "created_utc": 1674650194.0,
        "selftext": "I recently had this conversation with a friend who really likes the new Last of Us show and was telling me about how if the games came out when he was much younger he would've played the shit out of the TLOU games but now he has no time as an adult.\n\nI was flabbergasted by this comment and explained to him that not all gaming is a World of Warcraft and Call of Duty time suck. The Last of Us Part 1 for example is like a 10-12 hour long game, which is basically a season of a TV show. It's not open world like GTA, so you really have to follow the linear path of the story. You can break it up into 1-2 hour sessions and play it like you would watch a weekly TV show. Or binge it in two sittings in one weekend like I did. After the story is over the game is done.\n\nIf you have time to watch a TV show, you have time to game. Especially most story driven linear single player games, they're all more or less similar in length. And with subscriptions like GameFly and Gamepass it pretty much costs the same as a streaming subscription as well.\n\nI wonder why people got this idea that gaming has to be some disproportionate time commitment.",
        "permalink": "/r/NoStupidQuestions/comments/10kxnd0/why_do_many_non_gamers_assume_that_gaming_is_some/",
        "comments": [
            "There is no learning curve to watching TV, and it can be done passively.",
            "Even if someone has hobbies that take the same amount of time as gaming, they don't necessarily have any time that isn't currently allocated to something. \"I have no time\" can often mean \"I have no time that isn't currently taken up by something I need to do/would rather do/have the energy to do over something else.\" \n\nAlso, some people prefer to be able to take large blocks to play games and don't have those large time blocks open.",
            "You're right that depending on how much time you sink into one game, it quickly becomes one of the cheaper forms of media.\n\nHowever, the initial cost is usually higher. Not just of the games themselves, but also the cost of a console and controllers or a decent gaming pc. If someone isn't sure whether they'd like the hobby or not, that can be a major deterent.",
            "A lot of people watch things as a communal activity, with their other half or whatever. On the other hand most people consider single player games solitary activities - it takes a particular sort of person to enjoy watching someone else play a game, or sit in the same room and play games separately. I think that's one of the big differences. I love games but when my gf comes round I typically stop playing and we choose something to watch.",
            "You deleted your comment by the time that I was done replying, but I'll paste it here:\n\n> most people assume gaming has to be a much larger time commitment than a TV show, and I'm wondering why that is.\n\nNot *time* commitment, but *attention* commitment definitely. Most people consider watching TV as a passive activity and gaming an active one. They do other stuff while watching TV, like chores, paperwork, research, etc. This is the \"adult lack of time\" that your friend was talking about.\n\nEDIT. A lot of r/ImTheMainCharacter  syndrome in the replies. You are not representative of all people. Congrats on watching TV with 100% of your brain.",
            "Personally, as a non-gamer, I don't play games for three reasons: (1) at the end of the day, I just want to not do anything mentally active and just turn on the TV/Netflix and watch something casually/have it in the background while doing other tasks (like watching an episode while I'm doing laundry). I feel like playing video games is a mental (albeit fun) task but I'm mentally drained after a full day of work and I just don't have the mental energy. \n\n(2) it's really hard to have a conversation about video games with my social group. I can easily talk about an episode of stranger things or the new avatar movie and dissect different scenes with my friends, but it's hard to really talk about a specific game scene/character (disclaimer: my friends are also non-gamers)\n\n(3) Cost. I just don't want to spend $500 on a new console and $60 on a new game (or a monthly video game subscription system)",
            "I can think of a few reasons;\n\n1. That's true for TLOU, but lot of games don't actually have defined end points, if you're playing Eve or, I don't know, FIFA or something, you can literally keep going forever if you want. And a lot of people don't have the self control to stop.\n\n2. TV can be a background activity whereas gaming can't by its nature. However, if what your TV is background to is just scrolling your phone then I think gaming is a better use of time tbh.\n\n3. People are picking one or the other, not both. He means, 'I don't have time to game AND watch TV.",
            "I would love if my SO would game in 1-2 hour sessions, he does not, he does open world raids that can last many, many hours -like top comment says, gaming isn't passive, you can't do anything else while you're gaming, it can definitely be a huge time investment but some people are willing to commit to it, others are not",
            "I don't have time to watch TV either.",
            "Becuse all hobbies are that: a time and money sink.",
            "I don't know about the rest of you, but if I put even half the time I put into video games into any kind of skillful activity, then I'd be an employable professional at it by now.\n\nProblem is, then I wouldn't have video games to distract me from the misery of existence.",
            "I’ve never actually played The Last of Us, so I can’t comment on the length of it specifically, but in addition to what other people have posted, I’ll add that a game that would take an experienced gamer 10-12 hours to complete could take someone with less experience significantly longer. There are a lot of assumptions baked in any time the length of a game is given in some number of hours.",
            "Because you can watch TV while cooking, cleaning, doing exercise, sorting mail, folding clothes, watering plants, checking emails, painting nails…\n\nVideo games require you to spend that time specifically on the game.",
            "I have a mid-to-high-range gaming PC and still struggle to find time to spend gaming unless I dedicate a full day/evening to it. \n\nYou really have to dedicate a time slot because a mission could take 10 minutes or an hour.",
            ">If you have time to watch a TV show, you have time to game. \n\nNo. It's one or the other. What you are discovering here is that some people would rather just watch TV than game. It's a lot easier to get sucked into a TV show and pass out than put a ton of attention and effort into a video game.\n\n\"I have no time to game\" in this context really means \"Other things take up too much of my time, so I don't have any left over for gaming\"",
            "Gaming doesn't work in hour long stretches. Plus you might **only** have that hour or two of free time so it's either watch a show **or** play a game, not both. \n\nWatching a show is easy and there's no learning curve that usually takes longer than an hour. \n\nIf you only played The Last of Us for an hour you wouldn't even have learned all the mechanics yet. \n\nAnd if you only have an hour then you're not going to progress in a natural way. \n\nAnd with some save systems it's not even possible or that efficient to stop in the middle of something if your hour is up.",
            "*looks nervously at 600 hours played in elden ring*",
            "Everyone already said it but TV allows for multitasking. A lot of people have children or pets or chores. They need to split focus on two or more things, and playing a game doesn’t allow that.",
            "Some games have tutorials, have to be downloaded etc, create character, takes 30 minutes to get some games set up and playing with stories and all that.",
            "My wife and I watch TV shows while relaxing together. So it’s together time. For alone time, I’ll be playing musical instruments or making art. If I took up gaming I’d have to give up something else that I care about. Gaming seems mildly interesting to me at best, compared to the other things in the world that are waiting for my attention.",
            "I don't watch TV shows either... because they are a giant time suck that I can't afford.",
            "> most story driven single player games are around 10-12 hours in length \n\nNot to be rude, but have you never played a JRPG before? I can think of dozens of games within that genre that are 40-60 hours in length, and almost all of those kinds of games are also story driven single player experiences.\n\nWith games like the Last of Us and Resident Evil, those *are* pretty short games that you can potentially binge in a weekend like you said. But I don't think that you can really say that *most* single player games are that short. Most of the Final Fantasy games (and there are at least 15 of them as of now), for example, are at least 40 hours in length, possibly much longer if you decide to take it slow and do a lot of the optional stuff that's not required for you to progress in the story. If you're a completionist, some of these games might take you 100 hours to fully complete. \n\nIt's possible that your friend feels like he doesn't want to rush into things with games like this. If he's the kind of person who feels like he has to resist the urge to play his games to 100% completion, then it might seem like a daunting task to play *any* video game, even the ones that are really short. Video games can be very addicting, and if you're not careful with how you spend your time with them, you could develop a legitimate addiction to them. \n\nNone of this is to say that video games are the devil, or that TV shows are any less addicting than video games. But there are legitimate reasons as to why someone might want to play them but decides not to. It also doesn't help that TV has been ingrained into our culture since at least the 1950s, while home console video games only became a phenomenon in the 1980s. A lot of people just aren't used to the concept of playing video games, and it might take them a lot of time to \"get good\" if they have no frame of reference for how to play them. Meanwhile, everyone and their grandma has watched a TV show at least once in their lives. Even if they don't like to watch TV, they still are more familiar with the concept of TV than video games. There are plenty of people alive today who have never touched a video game in their lives, but there's almost no one who's never watched TV before.",
            "I've never been a gamer but I did play a lot in the late 90s early 2000s. Too many times I would start playing a game like Vice City after dinner and then the sun started to come out. Somehow I lost 12 hours. I don't hate on others that play but I don't have the strength to limit myself properly.",
            "I can watch a show and not focus. Video games require focus and my hands.",
            "Something I haven’t seen anyone else mention is that many of the games you’re referencing are single player— and I mean true single person experiences. I would love to play more long, immersive one player games! But I often choose to do other things instead bc I can do them with my wife or friends. \n\nThat’s not to say I don’t play single player games—I do. But I’m usually cramming in an hour after my wife goes to bed, or 30 minutes of unexpected free time on the weekends. And some games just aren’t conducive to playing 2 or 3 hours per week over a couple months without having to reteach myself the controls or mechanics, or remind myself what’s going on. \n\nThat latter point is why I only made it 15-20 hours into Elden Ring. I started it when my wife had work but I had a 2 day holiday. I got about 12 hours in, but after that two day binge I played maybe 1-2 hours every few days. I simply could not remember what the ever loving hell was going on, especially without an in game journal. So I stopped playing.",
            "Your own explanation makes it seem that way. $12/month for all the Netflix I can watch, or $60 per video game? If I watch one season of a show per month or spend that same amount of time playing one video game, then gaming is 5x the cost.",
            "Honestly, any time someone says they 'don't have time for that' it just means they don't prioritize the event.  \n\nWhether it's reading or video games, I know a lot of friends that simply just don't care and will say 'I don't have the time for it'",
            "I can excersize, cook, clean,  and fold laundry while I watch a TV show",
            "If they have a SO that could be a lot of it. Last of us requires 10-13 hours solo time, which can even harder to come by than tv time.",
            "With the first SIMS (cheatcode: buddhamus) I was so entertained I could play for hours. One time I was champion of the world on a word puzzle game for two weeks - built up extra lives so I could run to the loo and pee. Addictive personality + ADHD + WOW widow = I won't risk more than Patience or Backgammon.",
            "Because lots of gamers make it appear that way casually bragging about playing 12h a day. Vocal minorities have spread bullshit about hobbies for a long time. \n\nSame reason outsiders think that anime fans are a bunch of socially awkward weirdos with waifu pillows. They exist. And they’re just easier to notice than an average person acting like a normal person.\n\nI need to add, I feel like 12h games are rather rare. Most single player rpgs I’ve recently played are more between 40-60h. Still, it’s nothing you’re supposed to rush within a week.",
            "It's also a money issue. I love video games, but the biggest reason I didn't even start playing until 2020 was because of how much a console costs on top of not even being sure if I'd actually enjoy it enough to justify the cost.",
            "I don't watch much TV anymore for the same reason. ¯\\\\\\_(ツ)\\_/¯",
            "I love gaming, but I rarely play nowadays precisely because of how much of a time suck it is. Sure, I can play a game of FIFA or COD for 10 minutes here and there, but the games I like to relax with tend to be things like Satisfactory, Cities Skylines and OpenTTD. All of those will suck every last moment out of your day and send you to bed dreaming about how you can optimise them further.",
            "Video games have become way too complex.  The industry started out making things that could be fun for 5 or 10 minutes while food is in your oven but now it seems like they are doing the opposite.  You have to be more like 5 or 10 HOURS into it before the fun part really begins!  That's more geared to teenagers who can't drive yet home from school at Christmas, Spring break, or summer.",
            "When I think of gamers without context, I don't think of people who play single player games once through. I think of people that paly competitive multiplayer, that requires time and dedication to hone skills at, and a rig that would cost more than my monthly salary",
            "It took me 30 years to get over the guilt society put on me for enjoying this specific hobby.",
            "[deleted]",
            "I think it's because it's not one or the other for a lot of people. They're going to game on top of watching tv, if they do it. So, if they have to choose one, they choose tv, and say they don't have time to also game.",
            "I'm a \"gamer\" and have been since the early 90s. I think for me its about the controls. Getting to know a game and its controls enough to feel comfortable with them takes a bit of time. If I go a week or two without playing that game and its control scheme I kind of forget the muscle memory and feel like I shouldnt bother until I have enough time to propery learn the controls. Which in my busy life almost never happens. So I end up buying the next flavor of the month game thinking it will be different and it never is. Shame is even with games that have easy to remember controls just end up boring me.",
            "I mean, there isn't enough time to be interested in everything.  Someone who is really invested in TV shows might not want to engage with gaming because there is always something else to consume on TV.  Like why play an 8 hour game when you can watch a different 8 hour TV show.\n\nBut the same is true in reverse, I know plenty of people who won't watch a show I recommend to them because they're are of the line of thinking \"why watch an 8 hour show when I can play 8 hours of a game\".  \n\nPeople like what they like, and they have limited time, so they are going to spend that limited time doing what they like.",
            "1. You can't multitasking while playing most games. Video games replace hobbies/reading, not television.\n\n2. Games aren't a good medium to experience good stories. TLOU's story is excellent compared to other video games, but you can experience better stories in less time by reading a book, watching a movie, or listening to a podcast\n\n3. Gaming is an expensive hobby and you'll never have anything real to show for it.\n\nI'm saying this as someone who plays games.",
            "More like the opposite concern. I don't want to get into an online game that never ends and I've spent a month straight in my room doing nothing else.",
            "I’ve played over a thousand hours of Minecraft at this point, I think it’s safe to say that’s longer then any tv show in existence",
            "Please tell me some good single player games that only take 10 hours to beat!",
            "I am so bad at video games everything takes me forever. To the point where it isn’t that fun when everything is so hard. I don’t understand how someone puts in that much time. I try so hard like at Zelda BOTW especially and everything still takes a really long time and I struggle with everything.",
            "My parents enforced a 1 hour videogame limit everyday and then after that I got to sit next to them and watch 4 hours of television",
            "I'm a gamer and it is a time suck. I like to play fallout, sims, GTA, and Skyrim. Those open worlds are the best way to blink and realize it's the next morning. And just thinking about sims, all the DLC they have. I mean it's like a good 1k for all the packs. \n\nAnd even not in Open worlds I'm still struggling with super Mario 64 and I've had it since 1995 🤣\n\nI also think people think about big gaming computers too. I know i do, i want the set up but it's soooo out of my budget.",
            "If you're bad at the games they take a lot longer. :'(",
            "I love playing video games…when I have the mental energy for it. It’s understandable to me to have the time but not the energy to play a game. It’s a lot easier to unwind and watch a show than it is to get invested in a new game.",
            "I don't even have time for TV.  Only eat, work, sleep.  It sucks.  Currently pursuing a different lifestyle so that I can quit my job and work freelance.  It sucks less.",
            "I just don't want to play video games. I have literally zero interest in the subject. My only knowledge of video games comes from constantly seeing certain subs pop up on Reddit all the time. \"Oh, this 'genshin impact\" thing people keep talking about must be some kind of video game.' \"Oh, everyone is talking about something called \"the last of us;\" it must be a video game\"\n\nI don't judge anyone for doing it (and I don't think people with no interest or knowledge of games should be judged either), I simply have no interest in the subject whatsoever. I have never enjoyed playing video games, even as a kid playing Atari and ColecoVision games circa 1982-83. I'd play for a few minutes, find the games ultimately boring, and go listen to music. \n\n**Video games are just not interesting whatsoever for a large segment of the real world, and that's okay**\n\nEven if they give you a reason YOU find bogus, you should respect their disinterest\n\nAnd I don't know why OP feels like people *have* to play video games, or why he feels like he needs to, like, *peer pressure* other people into liking his favored hobby. If people aren't interested (for whatever reason: time, disinterest, aging out of certain activities, etc.) leave 'em be. Let them do what THEY want to do, and if they don't wanna play video games (for ANY reason), that's okay",
            "It isn’t that they can’t, it is that they choose not too.  Usually because they aren’t gamers and don’t enjoy it or think it’s a dumb hobby. Also because you can watch an episode of a show in about an hour and you feel like you did something but in a game you don’t necessarily have everything broken down where you feel like you accomplished anything in an hour. People all prioritize what they spend their time doing.",
            "And a lot of the video game crowd will sit down and have 8-10 hour gaming sessions at a time. \n\nAnd you have the guys who whine that they can’t get a girlfriend or they can’t afford to live in today’s society. But they spend 30 hours a week sitting at home playing video games.",
            "Wow, are games really this short now?  When I was gaming regularly if a single player game clocked in at under 40 hours people would be pissed.  10-12 hours??  The game better be $3.",
            "They don't like gaming, that's all. When you really love something, you'll find ways to make time for it.",
            ">I wonder why people got this idea that gaming has to be some disproportionate time commitment. \n\nBecause most games want to be your forever game.  All the biggest games that non gamers know about are the massive WoWs, LoLs, and GTAs that try to be your only game.  Hell even indie games do this now.\n\nEven the games that don't try to do that but are really really good, people find ways to make them last longer.  And these are the games people talk about most.  The ones they have put 100s or 1000s or hours into.\n\nThe Last of Us is not the kind of game that that people talk about with thier neighbor.  They don't mention last of us, they mention Minecraft/Roblox specifically because they kid never stops playing it.  Those are the only games they actually hear about.",
            "I can watch TV with my wife\n\nI do play some games, but I have limited time for myself each week.  As I get older, I’d rather spend it exercising, playing guitar, or drawing.  \n\nThink about it: a full work week, a couple of gym trips, personal hygiene, meal prep, connecting with your spouse, having sex, music practice, art practice, household maintenance, socializing… there isn’t much time left for games.\n\nTV is easy because after a long day, you can flop on the couch with your loved one and hang out together with no effort. \n\nAfter a full day, the last thing I want to do is tell my wife to have fun by herself and go try to play video games.",
            "That's fine for single people, but if you have a family that's an hour or two out of your evening that you're completely ignoring them (unless you find a game you can all play together). TV and movies can be a family activity.",
            "How many times did you turn the TV on to sit on your phone. \n\nNow hamy times did you turn on a game to sit on your phone",
            "Some of the games I like to play are open-ended so you can sink as much time as you have into them. Stuff like football manager or total war games in my case. \n\nI think things may get mixed up when I say 'i don't have time to play games' and people hear that and therefore think all games are time consuming",
            "You literally can play all the biggest games every year playing 5 hours a week.\n\nBut most people assume you need to spend thousands of hours because online games allow you to spend thousands of hours there.",
            "You need high speed internet to game so there’s that cost. \n\n\nI’d like to game but it’s just too much. My brother gave me his old ps4. Tried buying GTA 5 from Walmart to play it. And I had to download 40 GB update. Which I did from my phones hotspot. Only to realize it would need to download updates at least once a week when I fired up the system and game.  Just to play a non online game mode I needed the internet to download shit. \n\nThat was it for me. Games have gone to far in that matter. \n\nHaving all that set up just to try and play for 30 min- hour is stupid.   I ain’t got time for that. \n\nI have money for internet but I don’t need it so I don’t wanna pay the 50/75 dollars a month for it.   I have my phone, and my personal work office is right up the street so if I use a computer I’ll do it up there.",
            "I exclusively play single player games because they have a finite time period - they generally have a beginning and end. Conversely, online mutiplayer games have no end. I could be wrong, but isn't online gaming the largest portion of the market?\n\nI would imagine people equate gaming to playing several hours every day, continually, as opposed to a few hours every day, for a few weeks.",
            "Because they usually fall into an urge to excess the limit time they set.",
            "A season of a TV show is too long, too.",
            "I'm not a gamer but I have many friends who are, all now in our 30s. I do have a few who are like what you describe -- they get a story-based game here and there, and will casually play through it. These people have a few things in common: \n\n1) Gamed more heavily when they were younger. Gamers by and large do not understand how much time it takes to get used to game controls and mechanics, especially as an adult playing for the first time.\n\n2) Child-free. If you have kids, you don't really have time and energy to game, by and large -- at least, not if you are pulling your weight with the kids. (Same does not apply to TV shows in the same way because you can hold a baby and watch TV on earbuds but you cannot hold a baby and play a game.)\n\n3) They don't have a romantic relationship that takes up a lot of time. They are either single, their partner is an introvert and needs lots of time alone, or they are polyamorous and have fewer partners than their partner does.\n\n4) You would not know that these people are gamers unless you bring up games to them. The friends I have who *lead* with gaming -- who would bring it up in a group setting on their own, or who would bring it up to me as a non-gamer -- are people who would happily spend the whole weekend and hours every night gaming. They don't have a lot else going on.",
            "Because by my standards you have about 1 hour a day to do sth useless, and it would be good if you spent that outside. Then you can spend like 2 hours enjoying food or sth, 2 hours social activity and the rest is work. And on weekends you clean and visit family or sth.",
            "Call me a gamer who goes months without gaming. I don’t really watch tv either. I got halfway through the menu the other night, I’ll finish it over the weekend probably. Mostly I watch tv if I can double up and call it spending time with someone too. If I have a solid free block though, I’d rather game. Overall I don’t have time for either.",
            "Because of the long, significantly more widely known games you mentioned in your question",
            "As a games/tv shows/movie enjoyer - it's much simpler than you think. Watching a tv show is passive, you literally sit on the couch and eat chips. And trust me I love it sometimes when I'm tired after work. \n\nIt's also sooo much shorter, 20 mins and you are done, some people do not have much time for themselves. A game, depending on the kind, will take you 30 mins or 3 hours. Some you cannot stop in the middle, some just grab your attention so much that you sit until morning. \n\nIt's the same story with tv shows and a movie. A movie is 2h+ commitment. A tv show is 20 minutes x amount of episodes I'm willing to watch. 20 minutes and you can stop or continue. You will not stop a movie after 30 minutes (unless you are a barbarian than go ahead).",
            "I'm into board games and a lot of them I can/do play solo as well as with people. Sometimes people say \"you play board games solo?\", and I ask \"Don't countless people play video games solo?",
            "To add onto what other people have said here: games don't respect my time. \n\nI can pause a movie/show or stop in the middle of a page of a book. Some games won't let me pause or skip cutscenes, won't save progress in the middle of a mission, have timed events... Want to start a new game or replay one from the start? The tutorial/intro is 2 hours long, fuck you, non-skipable.  \n\nA game requires my full attention for a period that's determined by the game and if I fail to pay attention for that amount of time I'm punished. \n\nI do like gaming and enjoy hard games, but these days I don't have the time for that so I don't play them.",
            "I have a bunch of kids, when I watch TV, I'm constantly interrupted and half the time have to get up and go get someone food, a toy, whatever. They way I see my one kid play fortnight, this is not possible. your on till the end and as others have said, the learning curve.\n\nI wouldn't have time to practice a lot and wouldn't be good, you think I want to lose hundreds of games in a row? hell no, not relaxing.\n\nI played one time and hid until I couldn't hide anymore then got destroyed by a 10 year old.",
            "You know there's also the point of some games don't get good until like hour 6 and a 1/2.\n\nThat's like 3 episodes of a show hour show, only more work mentally.",
            "I play real life. Lust for life is why it's worth living. I also don't judge, so play away as you wish. I don't even enjoy simulators. They annoy me! Ain't nothing like the real thing baby.",
            "Experience",
            "Yea as I get older I realize how little time there is, and even my hobbies I find guilty because they don't bring my life forward.",
            "Matter of preferences and priorities, you may not have time to watch that TV show if you play video games. Or your work/ family  doesn't let you put enough time to video games.\nI ve been a gamer my whole life and now that I'm in my thirties I barely have time to play :(",
            "I'm late 40s.  Played a decent amount of video games as a kid. Play games on my phone in spare moments and can rack up a decent number of hours per week but it's all spare moments.  \n\nI have so little interest in \"real\" games now.  I'm just not interested in getting good at using a controller.  The strategy tactical stuff is fun but the curve is too big especially when 90% of the time I'm playing a game I need to be able to stop within a minute or two, and physically don't want to have to go sit in some room alone to do.  \n\nAs for tv shows I go weeks watching nothing then go through a series but it's always with family.",
            "my brother is a father of 2 kids under 6 years old. former gamer basically. he still plays, but not AAA games or mmorpg's. \n\nfor him he plays simpler games that are done in an hour or so. he doesn't have time to buy into the lore and play through the tutorial because by the time he's actually playing the game... he has only 15 minutes to play. starting over in a week or two and trying to get good at controls...\n\nthere's a lot of reasons his wheel house is stuff he knows and played a lot already that can still surprise him. but if he didn't already have that... he wouldn't be successful at starting a gaming hobby",
            "I can watch tv, surf the internet, pay bills, eat dinner, and chew bubble gum all at the same time.  Something I cant do with a controller in my hand. \n\nSo yes, to a non-games video games would be a time suck.",
            "TV is also a massive time suck I can't afford",
            "I cant cook dinner while gaming. I can’t wash dishes while gaming. I can’t change diapers while gaming. I Can do all of those with the TV on",
            "I usually explain to people that gaming is my form of tv watching, only with gaming you have some form of agency - tv and movies, you have no agency.",
            "My 40 year old husband literally spends 40 hours a week playing Minecraft and has for years.",
            "When it comes to cost, it's not just non gamers. It's gamers as well.\n\nThe amount of people complaining about a $70 game is astounding.\n\nPeople have no issue dropping $40 on a meal. $25 on a night out to a 2 hour movie. $50+ on a bar tab\n\nBut somehow $70 for a game that'll probably get you 100+ hours of entertainment is way too expensive? I don't get it. I feel video games are one of the best return on investments you can get",
            "Dunno. Paid 60$ for elden ring a year ago, over 500hours in. No TV service has given me that much bang for buck in 40 years",
            "Because the media have brainwashed people over the years into thinking that gaming is a terrible, harmful thing and the reasons for the ills in the world.\n\nGaming addiction is a problem but therefore so is binging tv shows if people equate time invested as being the main issue. However I’ve noticed a trend in there being a stigma against games that require any kind of mental investment beyond time. \n\nE.g someone playing candy crush multiple times a day which adds up to over an hour compared to someone sitting and playing one game for an hour straight. The former seems to be more accepted than the latter.\n\nA lot of people also don’t understand that games can be art and have well written narratives. Many think it’s all running around and shooting people, playing football or driving fast cars.",
            "A SINGLE run-through of THAT game is maybe 10-12 hours IF you know more or less what you’re doing. But you have to explore every nook and cranny, and if you’re inexperienced to that type of game engine it’ll take longer. And then you’ll go back and play through it a second time or a third with different choices to see how it changes the outcome.\n\nAnd that’s a notoriously SHORT video game. Cyberpunk 2077 is about 27 hours to beat if you ONLY focus on the main mission, and we’ll over 100 hours of you delve into side missions (and we all know gaming isn’t fun without a side quest!). And many of the most popular games don’t have any real endpoint because they’re multiplayer: things like CoD or WoW.\n\nHere’s the thing… if my husband expected to spend 6 hours every day going to the bar with his friends - this missing dinner with me, foregoing a snuggle & movie on the sofa that I offered, and even turning down a blatant offer of sex - just about everyone would say, “Dude, you’re neglecting your wife and spending too much time with your friends.” But men will ROUTINELY do that exact same thing with online gaming. Or they’ll leave out the friends part and do it with solo gaming.\n\nIf a partner came home, logged on, and spent an hour unwinding with a game before dinner or before bed, I don’t think anyone would complain. But it never happens like that. It becomes 4 hours, 6 hours, 10 hours and by the way didn’t you look at the time you’re going to be hurting at work tomorrow morning. \n\nI know some gamer girls that game like that, but most of the gamer girls I know - even when we play the same games - will use moderation and play in smaller chunks of time. But every gamer guy I’ve ever met - no matter how much they protest otherwise - if you actually look at their Steam stats, you’ll find that they don’t HAVE short gaming sessions; they only ever have marathons. That’s the problem."
        ]
    },
    {
        "post_id": "yo3u9v",
        "author": "Fishbuilder",
        "title": "Should i let this girl know the real reason why i don't want to date her",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/yo3u9v/should_i_let_this_girl_know_the_real_reason_why_i/",
        "score": 16315,
        "num_comments": 3710,
        "created_utc": 1667771066.0,
        "selftext": "A few weeks ago i got matched with a girl on a dating app. Conversation went well, we had a lot in common and eventually decided to meet up.\n\nNow, she didn't have a lot of pictures on her profile but on all of them she was pretty normal-weight.\n\nWe meet up and it becomes clear that her pictures were old: This girl had gained a lot of weight since the pictures were taken. She was not grossly overweight or anything like that - but still quite big and not really my type.\n\nI didn't comment on it but just went along with the date. The date itself went well and we hit it off quite good but i still felt lied to and didn't really want a second date.\n\nThe girl keeps writing to me and i politely answer. I'm sure she expects a second date and i could just tell her that i didn't think the date went well (lie). Or i could tell her the real reason and maybe make her update her dating pictures so future dates won't feel lied to like i felt.",
        "permalink": "/r/NoStupidQuestions/comments/yo3u9v/should_i_let_this_girl_know_the_real_reason_why_i/",
        "comments": [
            "[deleted]",
            "Just tell her you’re not interested in going out again. That’s all you need to say",
            "In my opinion harsh truths are reserved for close friends. Anyone else it'll just come across as nasty criticism.\n\nTheres no chance she'll see it as the genuine reason that it is you'll just look like an arsehole and upset her. White lies were made for this sort of thing.",
            "“I don’t think we are a good fit. Wish you all the best!”\n\nETA y’all are bumming me out with all the mean jibes.",
            "air worthless plate modern sharp dirty airport slim squalid plucky\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            ">maybe make her update her dating pictures\n\nThis probably wouldn't make the situation better",
            "FWIW I’m a big girl and I make it 100% impossible for people to not know my body shape and size. Honestly if I was lying to myself and posting old pics and someone said something like “it was nice to meet you but when we met irl the attraction wasn’t there for me. It felt like you looked different than your pics. Wish you the best!” I’d think that was fair and honest feedback.",
            "No. you don't know her that well. She is well aware of her weight. Just say you enjoyed the date but didn't feel a spark.\n\nBut if you really did hit it off and DID feel a spark...I dunno, think about whether you genuinely aren't attracted to her or if you just feel deceived. and if it's the latter, well, people's weight fluctuates and sometimes they like pics they took a couple years ago for other reasons, and they don't think that hard about it. and some people don't think weight is a thing that merits deception or truth telling. It's just a neutral fact.\n\nObviously don't date her if you're going to resent her, or if you think of her weight as a serious problem, but if you're gonna keep tinder dating, maybe think further about this.\n\nAnyway, do not tell her to change her pictures. Definitely don't. There is no benefit to either of you.",
            "(I realize I'm not the Queen of fat people and I can only speak for myself, which is all I'm trying to do here) \n\nI'm a fat girl and I really think you should tell her that it's because her photos don't match what she actually looks like. You won't have to say it's because she's fat, she knows what she's trying to hide. I do think it's prudent to be honest about things that impact others like this. \n\nShe basically lied, physical attraction is a big part of dating, and she tried to hide what she actually looks like. It's totally fair to be upset by this, and it would behoove her to know that she shouldn't lie, and that she doesn't need to hide her looks because plenty of people will find her attractive anyway. \n\nWe learn how to behave by being told how we effect the people around us. If she just continues to have this same scenario play multiple times, she won't know what she needs to do differently to get better results. \n\nYou can totally do this without saying it's because you're not attracted to her if you don't want to say that.",
            "Just say you’re not ready to take this any further. Keep it literally that simple and brief. Move on.",
            "Nobody ever needs to give a reason why they won't date or sleep with someone.",
            "So a heavier woman that doesn’t try to hide that and has a healthy attitude is definitely way more attractive than a heavier woman that uses pictures from their sophomore year of high school before they gained weight to try to attract people.\n\nShe never really gave herself a chance with you. You don’t owe any explanations. You can’t just guilt yourself into being attracted to somebody. Just be clear you’re not feeling it and if there’s anything coming back at you over it just block them. Whatever problems they have here are not yours.",
            "You don't have to phrase it as \"you are fat!\", but saying \"I feel that you posting older pictures instead of current ones was a deliberate lie and I don't like that\" feels okay to me. It's the lie that breaks the potential relationship, not the fact.",
            "Send her this link, that should do the job.  https://www.reddit.com/r/NoStupidQuestions/comments/yo3u9v/should_i_let_this_girl_know_the_real_reason_why_i/?utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=share_button",
            "\"I had a nice time talking to you. I'm glad to have had a good date, but I don't think you are 'the one'. Best wishes with your future date\"",
            "I disagree with the top comment.\n\nYou don't owe her an explanation, but it would be the polite thing to do and you don't lose anything for doing it. \n\nThe honesty might be good for her. After all, the thing that stood in the way of you wanting a second date was her *lack* of honesty.\n\nI might say something like, \"I'm sorry. I had a good time, but I'm not interested in a second date. I'm going to be honest about why. You looked a lot different in your photos than you did in real life. I don't know if they were old photos, or maybe you edited them, but they don't look very much like you. It felt dishonest or misleading.\" \n\nAnd yeah, maybe she'll hate you for that, but if you phrase it right, maybe she'll realize that misrepresenting her looks isn't going to work.",
            "Lol Reddit is super anti lying until it's time to tell a girl she lies about her weight. Yes tell her. I'm tired of the Instagram photo filter culture",
            "I would just say, there was no chemistry in the air and the date felt friend-like to you. Nobody can force a spark.\nBut if you want to tell her that it is only about her looks/weight at least she can tell all her friends about this awful guy who clearly placed apperances over personality although he does not look that flawless himself and they can congratulate her for dodgeing the bullet",
            "[deleted]",
            "Let her know the truth - you're not interested but also bring up the outdated photos could be a problem for her for future dates.",
            "If a girl didn't like you for whatever reason, she most likely would just stop answering you, or she'd just give you some vague reason about \"not feeling the connection\" or some shit. \n\nSo no, you don't have to give a reason. The fact you even let her know at all, instead of just straight up ghosting her, is pretty nice of you!",
            "Chances are she knows her pictures are outdated and is purposefully keeping them to get dates based on how she looked X months/years ago. She's hoping she finds a dude who overlooks the subtle catfish and continues to see her. \n\nI'd just give her a generic \"it was great meeting you but I don't think this will go anywhere. Good luck though!\" and call it a day. \n\nBut if you feel strongly about her using old pictures. You can mention it with a \"it was nice meeting you but sorry I'm not interested. I was put off that you used different photos and feel like it's not a good start on meeting someone when someone lies about something\".",
            "When I was online dating I was always truthful on my profile about my weight and included recent photos. I wanted people to want to date me, not a lie I was presenting in order to snare them. It weeded out people before any expectations and hopes could be raised and to be honest, there was still plenty of interest.",
            "Just let it go.  Say the date was ok but you're not interested.  She'll probably be upset but that's life.  You don't have to say why exactly. \n\n\nAt least she wasn't massively overweight.  f she was massively different then it would straight up be catfishing which is not cool.  Insecurity isn't a reason to mislead people. It only serves to hurt the persons self esteem in the end. Trying to explain this to an upset catfish wouldn't work so either way,  just let it go.",
            "If it were me I'd go ahead and see where it went. People gain and lose weight over the years. The only thing that stays similar are the personalities.\n\nThat's being said, you're not me. And if you don't want to date her or aren't attracted, maybe you won't or don't want to be. I can become attracted to people, but if you don't want that to happen, that's totally cool.\n\nBut yeah, dating is super hard on everyone. Being nice but firm is the way to let her down. We had fun, but I didn't feel that connection I think I saw as an earlier reply. I'm sure someone will say it more diplomatically.\n\nYou can also stick with, 'no is a complete sentence.' Nothing more needs to be said",
            "Nope. At least not first. Responses in order if she pushes:\n1. I had a great time but I don't think I want to do it again\n2. You seem great but I don't think we have that type of chemistry. \n3. I'm not attracted to you physically.\n4. The truth",
            "Dude. She's fat. She lies.  Been there. Cut her off",
            "You don’t need to give her a reason—she knows she’s gained weight, and likely already feels bad about it. You never know why she gained it, she might be going through something. Just tell her you didn’t hit it off. \n\nIf you genuinely did feel a spark or hit it off, then I would look internally and decide whether or not you want to try for a second date and really analyze what is a dealbreaker.",
            "Dude, I once had a man tell me I looked *more attractive* in person than in my pictures and even that was offensive. \n\nGood rule: If you ever feel like giving “feedback” about someone’s looks…just don’t.",
            "\"You're a wonderful woman and the date wasn't bad, but I just didn't feel an attraction. I wish you well in your search for the right guy.\"",
            "She shouldn't be shamed because she's overweight, but it absolutely should become normal to shame people who grossly misrepresent themselves prior to meeting in person for the first time.  That's bullshit.",
            "I think it’s fair to feel that way, you felt lied to. Maybe a bit of both approaches would be ideal?\n\nSay you had a good time, you had hit it off, but felt you had been a tricked with older photos where she looked different, and feel that honesty is something you greatly value and thus wonder about your compability with one another?",
            "I once showed up to a Tinder date and she was literally 100 lbs heavier than her pics. But she was still kind of bad and her energy was sexy so I went for it anyway lmao. The only fat girl I ever hooked up with and honestly it wasn't a terrible experience.",
            "Besides the point of letting her know. You should NEVER feel bad for wanting someone who’s normal weight.\n\nFat is like the plaque in your teeth. It’s a temporary part of your body but it doesn’t have to be their identity. Someone with good habits like brushing and flossing won’t have them and hygiene is important to many people.\n\nMaintaining a healthy weight isn’t taught by parents or schools but it’s still something you can put as a standard for the people you want. The vast majority of people can an lose weight just like the vast majority of people can do other things that take care of themselves in small increments.\n\nBut, of course, don’t be an asshole. Some people are fine the way they are and it’s not for us to put them in a hierarchy of importance. Everyone is important.",
            "Ignore the people lying saying it’s body shaming.\nShe deceived you and you should let her know so she hopefully doesn’t do that to other men in the future.",
            "I am an overweight women (190 lbs), and it would be nice if you were honest with her so she can stop deceiving people and maybe snap out of denial. Just be nice about it, like “hey the pictures you had didn’t resemble you and I felt lied to and that made me feel uncomfortable. If you would have just posted recent pictures of yourself I wouldn’t feel this way. I had a great time but unfortunately I no longer wish to see each other. Thank you.” and if she starts being rude about it, then you dodged a bullet because as adults we should be able to be honest with one another and behave amicably. Hope all this helps.",
            "Bruh, ghosting is a perfectly acceptable response when someone is deliberately deceptive.",
            "How is telling a person that her pictures are deceiving, body shaming? The girl is hefty in real life, her pictures indicate otherwise. There is absolutely nothing wrong in telling this person how you feel or think about the situation. She catfished you. Whoever thinks this is body shaming, you are SOFT.\n\nP.S. It sounds to me like you did the deed. Are you unsure on what to say because you slept with her anyways? Even though she was husky? Tell the truth.",
            "There is zero upside for you. Just walk away.\nShe intentionally cat fished you.",
            "You've been fat-fished",
            "Whatever you do, don't drag it out.  \n\nTell her there won't be another date.  \nHonesty may be easier;  but if you want to keep it polite you can say something else.   \n\nYou could just say something like \"You don't look like you do in your pictures, and that was important to me.\"    \"I don't have anything else to say about it.\"  \n\nShe's going to be upset no matter what you say; and you really don't \"owe\" her a detailed criticism.    \nI'd tell her it isn't going any further.   Don't let it drag out.  \nIf you want to give her more, then the pictures don't look the same, aren't current, aren't accurate - something like that might be enough.",
            "No don't tell her. She already knows she's gained weight. No need to make her feel bad about it.",
            "Tell her why. Otherwise she's just going to keep catfishing guys into dates in the hopes that one sticks. She's the one that lied first, so sparing her feelings shouldn't be your concern. Honesty is always the best policy, and it'll help her in the future with dates.",
            "Disagree with a lot of comments. Misleading pics is not cool, it’s an automatic red flag and turnoff. To the point that I’m going to walk out of the next time if and when this happens. I have told one girl once that I felt her pics were not recent and misleading. No need to into detail about weight but people should be called out on this behaviour otherwise it will keep happening and wastes everyone’s time.",
            "IMO it would helpful if you told her the truth.\n\nShe falsely presenting herself as one person when she was another.  You can even suggest to her that she update her pictures so it doesn't happen in the future.",
            "Why not just tell her you weren’t attracted to her and call it a day? Why do you need the people of Reddit to tell you what you already know? You’re dragging it out for no reason, you have no intention of seeing her again. If you want to tell her she’s fat or a liar—that’s on you. Rip the bandaid off and be done.",
            "Sorry you're not my type. I enjoyed our date and I wish you the best of luck. Goodbye. \n\nThen if she goes full on nice girl or asks if it's because of her weight just ignore her. You've been polite and said goodbye. Don't engage. Sure she might be upset but you aren't helping by engaging further. She'll get over it.",
            "Dating is a test between two people to see if they are compatible in marriage, you feel that you aren’t compatible with each other. Say that you two aren’t.",
            "Formerly anorexic now big woman here.not speaking for all big people, just myself, but I would want to know the truth.\n\nFor a while, I didn’t want to admit to myself that I had gained weight. honestly I couldn’t see it, but I could feel it, and once I did finally see it, it was because I saw a photo of someone else took of me, and one of the comments said they couldn’t believe how much weight I had gained.\n\nYou can Tell her you had a nice time, however, since she does not look like the photos you saw, you do not want a second date.",
            "Don't say it's because of her weight.  You're not helping her by pointing it out.  You'll just make her feel even more self-conscious if she's aware of the weight gain (and she likely is.)\n\nTo hell with the people who say she's being deceptive.  She probably didn't think it would matter that much, or she's been telling herself she'll get back to her original weight eventually.  She wasn't deliberately setting everyone up in some kind of half assed scheme to trick someone into dating a fat person.",
            "Don't tell her the reason. Just say that it doesnt feel like your clicked and you dont want to meet again.\n\nDo not say anything about her weight, I repeat, DO NOT SAY ANYTHING ABOUT HER WEIGHT.",
            "you know i find it so funny in these types of posts how you need to carefully say that you don't like her bc she's fat without saying she's fat bc otherwise ppl will downvote you and shit. I don't get what's wrong with saying that you don't want someone bc their fat/skinny",
            "If you hit it off well enough I urge you to give her another shot.\nLife is too short to be so superficial.\nSure, if she's just absolutely not your thing.. You do you, politely let her go.\nBut 30 years later will the trophy still be your friend?\nSex is big sure, but beyond the lovey dovey shit youre looking for a mate.\nYou won't find the best one if you don't give them a chance.  You could pass her up because you were to picky in the moment.",
            "Everyone saying to not tell her the real reason and that it'd be body shaming, but I'd be pretty annoyed if I was lied to and wasted my time. \n\nI'd tell her to update her profile so she doesn't waste other people's time as well, and there's also many guys that are more interested in the chubby type. You'd be helping her regardless.",
            "Yes. You could just tell her she's not your type.\nAlso we need to normalize leaving right away if we don't like a person irl.",
            "[deleted]",
            "Why is everyone so against them telling her the truth? I can’t tell you how many girls straight up turn down guys because they’re too short, but when it’s an overweight girl it all of the sudden becomes a “sensitive issue” because “she might get her feelings hurt” \n\nTalk about double standards fuck this",
            "Do not comment on her body. It sucks that she might be insecure and that's why she hasn't posted \"newer\" pictures, but you just can't say that to someone. Also it sucks that you connected with someone and that you aren't attracted to them because they're heavier. I hope you don't want your future lady to get pregnant 🤷🏻‍♀️",
            "Gals say don’t fat shame. \nMeanwhile 6-3 dude shows up with 6-4 on profile: fuck your short lying ass.",
            "I will take a go at an answer. No, do not tell her just say you are fun and such but just not connecting in some way.  Now for the real answer, weight is a non issue, why? It can come off, normal people gain and lose weight often in their lives. In the last 5 years I lost 170lbs( I was 340). So I have been heavy and slim, I more connect with people as they are, as weight can be a temp thing. If you like her, and get along well, you liked the pictures when she was thinner, which is is totally able to get to again.\n\nA lot of people and ladies especially emotionally over eat or eat. A lot of men do this also, depression can easily cause this. So if you date her, she may stop over emotionally eating and will get down to a size you are more comfortable with. Heavy girls and thin girls are the same besides the look. I have met nice and total bitch versions of all body types. She could also have self confidence issues in being rejected that led to emotional issues and over and emotional eating.  It is very easy to get fat, I was there. One day I was like damn I hate that fat nerdy jerk at work.... oh shit I look just like him, lol.",
            "Don't say anything about her weight. Believe me she knows she doesn't meet the norm in weight. If you can't overlook it. Just say that circumstances have changed for you and for her to not expect a second date and be sure to wish her well in her dating ventures.",
            "Too many people are trying to find the right person but enough are trying to be the right person.",
            "What would there be to gain by telling her more? Just say “I don’t think we’re a good fit.”\n\nMove on.",
            "It's one date. You don't have to go into details nor do you have to lie. The fact is, you don't want another date. That's all you need to say. \n\n*I don't feel we have enough to meet for a  second date, but, it was good to meet you.*\n\nYou're not obligated to tell her why. Again, it was one date and you don't want another one. If her response is hostile or she wants to ask why, *it is not your job to tell her*. Your responsibility at this stage post-app is to you, not her. \n\nMy guess is she knows why and she will deflect onto you. Personally, a lie like that would earn an unmatch and block after you've told her you don't want a second date because she knows she's in the wrong but doesn't want to face it. \n\nMove on and find the ones who don't feel the need to lie. Don't waste your brain space trying to help her out. She chose to keep dating with old pictures and there are consequences for that.",
            "Good rule of thumb - if you're going to tell someone something like this, ask yourself if the hurt you're going to cause is worth the help... and help in a way that they are not likely to figure out on their own. \n\nI think she's either going to figure it out on her own, or meet someone who doesn't care. And telling her that she's too heavy compared to her pictures is a LOT of hurt. Pretty minimal help for a lot of hurt.",
            "Just say as nicely as possible that you do not want a second date as you did not feel the connection and wish her all the best with her search. \n\nI agree with everyone, although her photo is misleading, please do not body shame her.",
            "Just tell her you had a good time but didn't feel a connection. It's not necessary for you to point out the pictures. She already knows.",
            "You ordered a Mountain Dew and got a Pepsi. Lame",
            "Just tell this girl you enjoyed your conversation but aren’t interested in dating her.  It’s as simple as that.",
            "Instead of responding politely just say, “hey, I wasn’t really feeling a connection. I did have a good time, but I don’t feel compatible with you for a romantic relationship.” Why are you still talking to her instead of just saying you don’t want a second date? Wtf.",
            "Nope, she lied to you, guys have preferences too and if someone isn't it not a bad thing to just say \"this isn't for me\" know your worth and stick to your guns",
            "Had this happen to me once, and old accomplice from Hs reached out to me one time a few years after we graduated and we talked for awhile and then went on a date and then when I saw her in person.. she had gained probably 60+ lbs since we last saw each other.. the date went well and we talked like we always had before.. but just like you my type is more petite and she kept messaging me more often after that so I just told her basically hey although I had fun and it was good to see you I don’t see this going anywhere personally and don’t want to waste your time. And that was the end of it. ABSOLUTELY DO NOT body shame her but just say hey i didnt appreciate you having old pics of yourself and I felt upset because thats not your true self and i felt lied to",
            "She catfished you. Say you \"didn't feel that spark\" you expected and move on. Don't feel bad at all.",
            "The point of going on a date is to see if you want to go on a second date (and a third, etc).  So no, telling her that you didn't think the date went well isn't a lie.\n\nJust say you don't feel interested in a second date and leave it at that.",
            "Honestly doesn't matter what you say since you'll likely never see her again",
            "Happened to me. She wasn’t overweight, but her face was so different the whole date I felt deceived. Even though it went well, the next day I just said something like the distance was going to be too far. That was the end of that",
            "It was certainly wrong of her to catfish - she knows what shes doing is deceitful. However, no reason to be a jerk. Just tell her that you had a wonderful time but do not think she's what you are looking for (or something gentle like that). She's definitely aware of her weight, otherwise she wouldn't be pulling that shit, but it's not cool to destroy her over it.",
            "There is no cosmic justice that will reward you or her for your honesty. Kind rejection is way better than honest rejection in a situation like this.",
            "Just say you're not interested. You had fun but didn't feel any spark",
            "Say: “I think you are a great person and I also think we aren’t a good match.” It’s polite and honest. Don’t ghost, people have feelings and you impact them.",
            "May very well be insecure already. “I don’t think we’re a good fit” oughta suffice. Let em down easy imo.",
            "You don’t have to tell her the real reason. Just say you didn’t feel a spark and wish her the best. Fat people know they’re fat, it’s unnecessary to kill her confidence.",
            "You're making this way more complicated than it needs to be. \nJust tell her you're not interested. Do not tell her it's because of her size. Do not reference her photos. Just a polite \"had a great time but I don't think it'll work out.\" is good enough. If she presses you or keeps bothering you, block and move on",
            "No. You don’t need to tell her.",
            "no",
            "It’s not your job to tell her to be a decent person and post accurate depiction of herself.  She already knows she’s intentionally deceiving.  That’s her problem at this point - saying anything will just spin you into asshole territory.  Say thanks but you’re not interested right now.",
            "You had one tinder date, you’re under no obligation to meet again. Just say you aren’t interested and move on",
            "She’s texting you and you’re engaging in some conversation. If you want her to stop contacting you, simply reply with “I’ve thought about it and I’ve decided that I’m not interested in a second date, but I wish you the best.”\nWe don’t know how long ago they were taken but women can fluctuate quite a bit and she may not see such a huge difference in how she looks at the moment.  Depending on the angle and outfit I can look like I have a 10-20 pound range on any given day.  And if she is actually purposely misleading people then you telling her won’t change anything.",
            "Just tell her you're not interested in pursuing it further, though you did enjoy the date, it doesn't feel like a good fit for you. That's it. There is no good reason for bringing her appearance into it, it will only harm her self-esteem. Besides, you do not owe her any explanation at all. Telling her you find her unnattractive is cruel and unnecessary. It won't motivate her to take better care of herself, so don't kid yourself into thinking you'd be doing her a favour.",
            "If you're not attracted to someone, you're not attracted to them. There's absolutely no reason to bring up \"why\" that is, just be kind and get on with it",
            "Date is a sorta test drive and adults should be able to just take a \"yeah, I don't think this is for me\" and you move on with your life.  Probably best to cut it off before people become emotionally attracted. Don't bother  giving reasons.",
            "Being lied to happens all the time. White lies, “I forgot” lies, “I’m tired” lies. Don’t get hung up on the lie-aspect. You’ll be alone forever if it’s not something you slightly anticipate on a dating app. \n\nSay, this: “Hi Kathy - it was nice meeting you. I’ve put the brakes on dating for now. Best of luck and take care”. \n\nIt’s so vague it’s meaningless. One hopes the person doesn’t mull over it for months and suffers. You say she “keeps” writing to you. You shouldn’t have let that continue. \n\nPeople know very fast if they’re physically attracted to someone - if that was a total fly-by, you shouldn’t have kept up an e-mail relationship. Tell your date right away it’s a pass if they reach out to you. You’re not an ogre - just recognize how you feel and end the other person’s expectations -quickly. Best of luck!",
            "I would rip the band-aid off so she doesn’t feel led on and you don’t have to worry about her messaging you anymore. \n\nI certainly wouldn’t mention her weight. Good luck!",
            "She told me she looked like Janet Jackson. When she pulled up she look like Freddy Jackson.-Smokey the great.",
            "I won’t date short men and they intentionally do not put how tall they are and then show up at 5’ flat. I have huge home grown boobs and won’t show them on my pics for fear of the nut jobs looking for tits either. I also don’t like skinny men and put that on my profile too, yet here we are. Doesn’t anyone read those things.",
            "I would not contact her further unless you already promised her a second date.... It could be that the pics were just flattering and not necessarily old. She may have been the same weight she is now in her pics, just that she only posts pics on there that aren't close-ups of her gut (in which her weight isn't obvious). If you comment on her weight, you will seriously hurt her feelings. Please don't.",
            "\"Or i could tell her the real reason and maybe make her update her dating pictures so future dates won't feel lied to like i felt.\"\n\nDude.\n\nShe didn't lie. She did what you did and posted pictures she thought were flattering. You said you had a nice time with her so why do you feel the urge to hurt her? \n\nTell her you're not interested, delete her number, and move on with your life.",
            "reddit is hateful",
            "Don’t tell her the *why*. That’s strictly reserved for when she asks “why?”",
            "Let her down gently.\n\nMoving forward you should ask your match how recent their photos are even before setting up a date.\n\nBest of luck",
            "Personally, I would because I don’t like leaving people in the dark and if something upset me that much, I’d tell them and they can react however. Like why not nudge her in a good direction for her to work on herself? If she’s constantly getting a response of “you don’t match your profile pics” and she realizes she can change that, why not mention it to her? Whereby if you don’t mention it, she’s not going to know why and just always wonder probably and maybe blame everything on “men”. \n\nAnyway, you don’t have to if you don’t want to.",
            "I think you should tell her that after the date, you felt she wasn't exactly your type, and that you're not looking for a second date. I don't think it's a good idea to bring up her weight because it looks like she's insecure about it, and that's best handled by someone closer to her.\n\nI know this isn't what you asked, but if you did hit it off, maybe give it a shot?",
            "Don't you dare tell her it's because of her weight or you will literally ruin her life and self esteem forever and I'm not exaggerating. Say \"I had a great time with you that night but I didn't  think the chemistry was there like I had hoped. but You're great woman and I wish you luck!",
            "If all it takes is a little weight to lose your interest in a girl who you otherwise found pretty cool, she deserves way better than you. I am sure you are not physically flawless and can almost guarantee you that she found things in you she had hoped were different or better......maybe you are shorter than she imagined, very photogenic, much thinner, with some linguering adult acne the pictures didn't show, with a future than includes baldness and your gums show too much when you smile, etc, etc, etc but she is just not as shallow as you are, so please, tell her you had fun but got a friend vibe, not a romantic vibe and let her be.",
            "Never under any circumstance tell a woman that the reason you are leaving her is because of her looks. That would destroy her self-esteem and confidence. I swear I made a mental oath to myself to never say the real reason. I’ve done it twice before and all I said was I’m no longer interested in going on another date. Leave it at that. Oh… and never say you are sorry because if you were sorry you wouldn’t be doing this in the first place. I’ve honestly made the mistake twice of thinking their personality being a 10/10 would be enough but truthfully you need to find them attractive.",
            "Still quite big and not really my type..\n\nBut she was your type as a thinner person I take it? \n\nWhat happens if this relationship progresses and she gets pregnant.. would you leave her for being \"not really my type\"?",
            "These commentors are all giving the worst advice. Tell her you're not feeling the connection and cut contact. But also make sure you tell her why, if you don't she won't know why and be left confused.",
            "Absolutely not.  In fact it’s ok to almost always tell someone a half truth about why you’re not into them unless you know them well or feel that you must.  For example like I don’t put up with people that put their hands on people,  or you get really drunk all the time and are mean to everyone-  that’s ok to say.  But PSA to those asking-  all of the stuff that is like personality comparability or looks etc just say it’s not a good match or you don’t feel a romantic connection.  Because in truth, someone else has a different taste in those things and will be into that’s person so you are being truthful anyways.  This way however you aren’t being hurtful or giving them a complex.  It’s also a lot easier.",
            "Just be honest. I wouldn't mind if a girl is on the heavier side, it's the lying that ticks me off. If she's willing to lie and be deceiving about something that's OBVIOUSLY going to be discovered, that tells you a little something about what's going to come for things that are less likely to be discovered. It's a HUGE red flag, in my book.",
            "Stop trying to look like a good person and just admit you don't like fat girls. Just admit it and move on.",
            "Do not body shame her.\nDon't forget it's only ok for women to do that to men .",
            "My response will probably never be seen but I would be honest. You don’t have to be rude about it but state that her photos were misleading and appear to be a few years older and you’re not interested at the moment. Not saying anything means she really will not know the issue is because her pics are old and she doesn’t look like that anymore. It’s not helping her fix the issue. Being told she needs more updated pics to better reflect what she currently looks like, maybe she’ll change them and then get better dates with people who are actually attracted to her.",
            "Yeah. Don't waste her time if you are shallow. You aren't letting her down easy, you aren't good enough. So stop lying to yourself and her and just be the dick you know you want to be.",
            "She was not genuine with you.  Just tell her you are not interested.  The weight thing is whatever but she is not a trustworthy partner.  Don't string her along either.  It's a waste of time all around.",
            "i'm glad you're not planning on going on a second date with her. she doesn't deserve to be with someone so shallow. the date went well, but you're hung up because she's \"not your type?\" blondes aren't my type, but that doesn't mean i wouldn't give one a chance. go ahead and downvote this idk i know defending fat women is always unpopular on this site.",
            "It’s like George Costanza made a Reddit account.",
            "Just break up. Don't say anything, because even if she lied, you are going to be the asshole.",
            "I feel like you went to this sub for a reason and you know it",
            "Idk I think you should tell her you didn’t appreciate that she lied about her appearance, not that she was too fat lol \n\nPeople like this need to understand that life isn’t going to be easy if they run around on dating apps lying about what they look like. It’s kinda cat fishy even though the pics are still her…",
            "Wow why don’t you just talk about it since it’s bothering you even though you had a good time That would be the honest truth and the best factor to start in a relationship. I actually have the same issues with my profile photos and I have brought up the subject upon meeting the first time. I totally intend to get back to that size but due to a back injury I have gained some weight for now. I don’t think I am lying because my photos are what I usually look like most of the time I kinda think that you are being too harsh and the fact that you both got along is of much more importance than a couple of pounds. Try it out and you may have the best experience ever but you can ask what her thoughts are. Are you completely perfect? Share your profile pic with us ☮️🌺💕",
            "You don't have to give a reason, she's not owed a relationship, no one is. Just say you don't want a second date, not wanting a date is perfectly fine and normal and doesn't need an explanation",
            "Be a man, hit it and quit it?",
            "Why shouldn't you be honest with her? Tell her the true reason but be careful with your words because you don't want to hurt her but want to be honest.",
            "\"I had a great time with you, but there just wasn't a spark for me. Thank you for a fun evening and I hope you find someone amazing soon.\"",
            "You don't need any special reason or golden slip to get out of dating someone, if you've lost your attraction to her due to her weight and the fact she was being deceitful then that's okay, you are not obligated to date her.\n\nNow granted you can maybe leave out the part about how it's about her weight and just let her down gently the whole I think we should see other people response you know the drill.",
            "Just ghost in this situation, complete waste of time.",
            "Tell her you felt lied to and that she was dishonest to send out of date pics, and you're not interested in someone you can't trust. Leave it at that, and block her. That gives her needed input to changing her approach and increases her chances of finding a REAL match.",
            "no absolutely DO NOT tell her its because of her weight. It will destroy her self esteem. Someone will want to date her eventually, she just has to keep searching.",
            "Just link her this thread and tell her to read the comments",
            "You went on one freaking date. Just tell her that it didn't work for you and move on.",
            "\"it just didn't click\" would be the response, just a general sentence that says you are not going out anymore",
            "Tell her you just found out your ex is pregnant. Works life a charm.",
            "Starting off with things to hide ain't a great start imo.",
            "No. Say you had a good time but you aren’t interested. If she says why, say no chemistry on your end. Not a lie and no mention of weight.",
            "Women don't take criticism very well. Telling her truth probably won't help her in the future. Just let her down easy and move on.",
            "You can't just get her drinking coffee or something? ☺️ This is amazing stuff.",
            "I think you just need to say you're not interested. When asked \"why\",  It's well within bounds to say she doesn't look anything like her pictures, and you're not feeling the attraction.\n\nThe truth is she's being dishonest, and it's ok to call that out",
            "Can be honest without being a dick.  Tell her you’re not interested in dating her.  If she presses for “why?  The date went so good!” Then you can gently admit that while her personality was great and you enjoyed the conversation or whatever, you weren’t physically attracted to her.\n\nOr you can ghost her.  Continuing to politely talk without making intentions clear is kind of leading her on.",
            "You can just ignore her. It’s okay she’ll get over it. Tinder isn’t a serious commitment unless you promise otherwise. But I would recommend that you get to know her better and have fun. Looks aren’t everything and some people you might not think are attractive can be really fun to spend time with. Also what if you two work out together and she loses a lot of weight. Then she’ll be hot again :) you’re welcome.",
            "You could say that your need for honesty, integrity and trust was not met.",
            "I think theres a way you can do this without bodyshaming. Like she needs to understand that catfishing is not OK, but it doesn't need to be like a hateful thing. Something to the effect of, hey I had a really nice time, but you're not what you portrayed yourself to be, and I don't really feel the need to be with someone who will lie to me about uncomfortable truths. Except make it more eloquent and well thought out haha",
            "If the reason is she is too fat for you that would be pretty hurtful to say.  If the reason is she lied by using old photos of herself I would say that’s a good enough reason on its own.",
            "Just tell her you don’t want a second date. You’re not gonna be some savior by telling l her why. No need to be an asshole. Just move along",
            "> and I politely answer\n\nI know you mean no harm, but don’t do this in the future.\n\nJust say something like, “I don’t think we should go on another date.” Continuing the conversation after a first date will imply to her that you’re still interested romantically",
            "you're in every right to feel how you feel, you were essentially catfished, it's up to you if you want to be brutally honest which might humble her so she doesn't do it again to someone else or just politely friend zone her",
            "Be honest. What she did was not be honest with u and that was the problem.",
            "No need to be rude, but also no need to lie",
            "Interesting answers. Personally, if I got catfished I would let her know that is the reason. \n\nSomeone does you wrong, you let them know it, no matter what situation. \n\nMaybe it will hurt her feelings, but hey, next time or after a couple of tries where she gets the same response she might realise that this method doesen't work. We will have one less catfish, and less headache for her victims.",
            "No, you don't know her, no need to do her dirty by saying na I don't like you tubby. Just say you aren't interested say sorry and move on.",
            "If you don't want to date her just say that",
            "a huge amount of men and women have old pics on their profile. you're not going to change anything by saying something. best to just move on",
            "I'll tell ya one thing that I don't think the commenters realize. What she's doing is unethical and annoying, but it comes from a place of insecurity. Fact is, someone else will probably shit on her for doing this. And it won't be helpful at all",
            "Why are guys still asking this question, its ridiculous you dont like her tell her your just want to be friends.  That you just dont like her that way.  Since it sounds like you did enjoy talking to her.  When we meet people its either going to click or its not. No reason to completely humiliate someone for being slightly over weight. And one more thing.  Slightly overweight girls can lose that weight as quickly as they put it on so watch the bridges you burn.",
            "Just tell her you don't feel it or something. She knows she has a body and that it has a shape. She probably thinks about it way too much to be healthy without your help. You don't have to like people of certain shapes, and you don't have to like the fact that her photos aren't up to date, but you also don't have to tell her that. It's not going to help her.",
            "I mean consider giving it a shot weight is not an indicator of health or morality or even physical fitness. I mean but maybe she doesn't deserve some one so shallow",
            "Do not",
            "You don't have to lie or tell the truth to blow someone off.",
            "It seems it’s not about weight at all. It’s misleading and a lie. Just recommend she update her profile pics if she asks for advice. OR if you care, offer advice if you consider her someone you want better results for. \nHappened to me too. My date was way older looking than his pics. I look younger than my age, and he looks way way older than his age. Not fair. Wasted my time. And my time is my least commodity with my work.",
            "“I had a wonderful time, but I just didn’t feel there was a spark. I wish you well!”",
            "Anything is fine except the real reason or going 👻",
            "Tell her the truth, but only if she asks. Say something along the lines of, “Hey, I had a good time at dinner, but don’t want to pursue this further”. If she presses further, say something along the lines of, “Your photos looked much different than you look in real life.”",
            "Honesty is the best policy. Doesn't mean you have to be a dick about it. Tell her the truth but give it to her easy.",
            "Always be straight and upfront with people. How much detail you get into is up to you and based out the peoples relationship they have built, even if it was two weeks talking on an app.",
            "I hope I'm not too late but the right wording here is \"I don't think I feel the chemistry between us\".",
            "I'd be honest. Don't specifically cite weight, but say you feel she was being dishonest by using old photos."
        ]
    },
    {
        "post_id": "11yoggz",
        "author": "Altruistic_Good_9053",
        "title": "Are women scared of men in elevators?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/11yoggz/are_women_scared_of_men_in_elevators/",
        "score": 16234,
        "num_comments": 6550,
        "created_utc": 1679502920.0,
        "selftext": "Recently I entered an elevator at 1 am, there was already a woman in the elevator, she didn't look happy about me entering the elevator and looked at me throughout the entire time, for reference I'm 6'4. Perhaps she was afraid of me. Is that common",
        "permalink": "/r/NoStupidQuestions/comments/11yoggz/are_women_scared_of_men_in_elevators/",
        "comments": [
            "Hi /u/Altruistic_Good_9053,\n\nWe noticed you are a pretty new Reddit account, so we just wanted to let you know to check out the subreddit rules [here](https://www.reddit.com/r/NoStupidQuestions/wiki/rules) and maybe have a read through our [Frequently Asked Questions](https://www.reddit.com/r/NoStupidQuestions/wiki/index/faq) - they make for fascinating reading!\n\nWe're called No Stupid Questions because we believe nobody needs to be attacked for asking a question, but *that doesn't mean there are no rules!* This sub is meant for users like you to ask genuine questions. Please don't ask jokes or rants disguised as questions - that's not in the spirit of this sub. While you *can* ask almost anything here, please keep illegal and offensive questions elsewhere to give people a good experience here - and if you have a medical question, please ask your doctor, not us. \n\nOtherwise, welcome!   \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NoStupidQuestions) if you have any questions or concerns.*",
            "I'm a big fella, so I rarely feel worried walking around. But once I was in Vegas with a buddy and a few guys were walking behind us for a while. It was 2am, August and hot as fuck. These guys were wearing large jackets and kept reaching inside them. My buddy was oblivious, but I stopped us right infront of a security camera, and just chatted. The guys following us kept coming, but out of the corner of my eye I saw one look up at the camera, say something to his friends and the left the way they came. My butthole was puckered pretty good. I feel bad that the ladies have to feel like this so often.",
            "They are cautious. My wife went to college in the early 1970s. A couple of the male professors there were so notorious *for groping women students* that if they got on an elevator, the women would get out.\n\nEdit: Typo, added a phrase for clarity.",
            "From my experience, the best way to avoid unintentionally scaring a lone woman in an elevator or small closed-off space is to just fuck around on my phone while only \"half-paying attention\" to my surroundings.\n\nThey usually relax after noticing that I have no interest in them and would rather be glued to my phone (for at most few minutes) to minimize face-to-face interaction. It also helps to have a relaxed, \"mellow\" bodily posture (if you're standing up all stuff and robot-like it looks creepy).",
            "Pull out your phone and start playing clash Royale with sound on. It will immediately relieve any tension in the situation.",
            "I'm not worried about sharing an elevator. I'm much more worried that they're going to follow me after I get off the elevator.\n\nETA: Holy jumpin'. Didn't expect this much reaction to my comment. Thanks y'all. I'm trying to read the replies!",
            "Yes, but don't take it personally.",
            "You kidding? Middle of the night at that size? You will run from from you.\n\nJokes aside, I'm male. 6'1. Even I feel the pressure with anybody being near me in the middle of the night. Especially someone bigger than me. It just isn't safe in many areas. Can't blame the lady.",
            "It can be common. However I would be on high alert with any stranger in a small space. I work as a child and adolescent psychiatrist now, but I did forensic psychiatry for years. It’s not a bad idea to remain aware around strangers.",
            "In general it doesn’t bother me. But context matters. Like 1am on the elevator at my condo where we’re all neighbors and theres a doorman and security camera? No problem! Elevator in the dimly lit parking garage at 1am after I’m leaving the bar? I’m sure you’re a nice guy, but I’m still going to be a little on guard.",
            "I am a woman, and if I were riding an elevator at 1 AM and a 6'4\" guy got in with me, yes, I would be on edge.",
            "I was sexually assaulted by a man in an elevator when i was 10-11 years old. Hit the stop button then slammed me into the back wall of the elevator.  I am very uncomfortable alone in an elevator with a man who is physically bigger than me.",
            "To be honest, I'm a guy and I just hate being in an elevator with anyone I don't know ever. Even another guy I'm uncomfortable. I will be walking toward the elevator in my complex but if I hear other footsteps hearing the elevator I will turn around or walk to the nearest stairs, whichever is closer. I'm not socially anxious or anything, not claustrophobic, or anything of the like. Just hate being in an elevator with someone I don't know. \n\nTo actually answer your question, probably yes they are. If I was 5'5\" or so and some tall guy at 1am came into the elevator with me, I'd honestly probably get out and pretend to walk towards wherever I came from like I forgot something.",
            "I once rode an elevator with friend who was a girl, late at night, during a traveling field trip I think we were in Toronto. Along the ride 2 large men hopped on. After they left she was like HOLY CRAP CHARLIE IM GLAD YOU WERE HERE. \n\nSo I'll say yes",
            "[deleted]",
            "Brother, one man to another, women are afraid of men. Period.",
            "In a situation like this I usually have a couple things I like to do. I'll face partially toward them so they can see my face and hands but not directly face them. I keep my hands visible but close to my body. Then the big thing I do is lean against the wall and rest my head/close my eyes like I'm resting. With your eyes closed you really can't do anything and from my experience seems the least threatening posture if you have to be in the same room with someone. Unfortunately that person wouldn't see any of that until the door is closed and they have no choice but to ride with you. Definitely better to ask or take the next one.",
            "Women fear men they do not know in general. Never know or are fully aware of their intentions and in an enclosed elevator with just the two of you could be intimidating to her.",
            "I’m 6’8” was working in my office on a saturday, I did not realize a girl who is like 4’11” was also working we rounded a corner and she took about 3 steps of a run before realizing it was me and said she was sorry. 🤷🏼‍♂️ I have no perspective of how she feels so I didn’t really feel like she should say sorry and I told her that, it does however remind me that I am a very tall human.",
            "Not a Woman, but think about it.\n\nAlone in an enclosed area, that can easily be stopped with a button, where nobody can help you. And with a random person. And most don't have cameras. I think it's perfectly reasonable for a Woman to feel scared. It's just sad we live in a society where they have to feel that way from sexual assault being so prevalent and even brushed off.\n\nMight seem extreme, but at that time of night, I'd probably take the next elevator and try and think of making the Woman more comfortable without me crowding her.  \n\n\nEdit- Probably hyperbole saying \"Most\" don't have cameras. My point still stands.",
            "In an enclosed room with a strange man and only one exit, which he's in front of? Yes she was scared.",
            "[deleted]",
            "At 1 am yes",
            "There are many reasons for women to be afraid of men in elevators. They’re generally taller and stronger, there are real stories and people with experience of being sexually harassed, and men tend to be more likely to commit a crime than women are.",
            "Depends on the context. Was it at your apartment complex? Was it at a hotel? If that was the case, I probably wouldn't be alarmed. Other situations, like an outdoor parking garage, yes. I'd be on edge.",
            "At work? No. \n\nAt my apartment and I’ve never seen you before? I’m always guarded.",
            "Yes. This is a very common thing. If I could, I would always pass on being alone with a dude in a elevator at late hours.",
            "As a large man (6'3, 250lbs) also, I have always wondered if some women are secretly clutching a weapon when they are around me. My wife had a knife open and ready in her pocket on our first date.",
            "I’d bet that most times a woman is alone in an enclosed space (or anywhere without other people around) with an unknown man, she’s going to be nervous. \n\nMy partner is 6’9”, the most benevolent, feminist guy I’ve ever met, and he’s always in search of ways to look less intimidating and make sure women aren’t on edge when he’s around. The reality is that there isn’t a way. If you try to strike up conversation, you may be scarier. \n\nI’d say, try your best to look completely disinterested and preoccupied. Look at your phone, move to the other side of the street, maybe wait for the next elevator or take the stairs, etc.\n\nETA: these replies are so useless. Yes, because he actually listens to the women around him and knows that *we have reason* to be afraid of men, he’s aware that his presence could be scary for a woman who doesn’t know him. I’m a sexual assault nurse examiner and I have heard hundreds of scenarios in which a person was hurt by a man when other people weren’t around. Doesn’t mean I think all men are dangerous. But I’m not willing to take my chances so I am immediately on defense. And no, it’s not exhausting for him to try making others comfortable. It’s a normal part of being a kind person. And no, he doesn’t think women need protection. He thinks women need one less scary moment in their day to day lives and doesn’t want to be the reason someone feels stressed.",
            "Yes. We don’t know what to think, and we are cautious. Every single woman knows someone who has been hurt, attacked, followed, threatened, or something of that sort. Especially at night, and especially when we are alone, we are not likely to take chances.",
            "No, I wouldn't be but I can understand others feeling that way. \n\nI might suggest pretending to be on the phone with your mom or something.",
            "I've had guys demand I go to their hotel room. I've had hair sniffers. Then there are the guys who stand too close. Basically, we know most men are decent but how are we supposed to know who is safe? The unknown is terrifying.",
            "As a man, I just avoid being in the general vicinity of women at odd hours. They don't need the stress, I don't need a pepper spray to the face.",
            "I'm sure they do. I've even had a woman be scared that I was going to rob her. I'm in a wheelchair, so I was like, \"It's not like I can outrun you if I did.\"\n\nIn a way, it makes me sad that they think any guy can rob or attack them, even paraplegic ones who can be stopped by stairs. One of our society's shortcomings.",
            "Absolutely. I'm 6'3 235 lbs and I've found the best way to handle it is to stand looking at the front corner that's not the button corner. Everyone is free to stand behind me and watch me while I can't see them. If it's extra tense I hold my phone a little higher so anyone can see I'm just a dude looking at a social media feed on my way home. It's gonna be awkward, no way around it. And for good reason: people are fucked.",
            "In college I looked like a dirt bag with long hair, tyedye, and ill fitting jeans. I still remember one afternoon going down to the lobby in the elevator when it stopped on another floor. The door opened and a woman looked at me, then turned around and took the stairs.\n\nHonestly I don't even blame her. I know I'm harmless but she had no way to know.",
            "I think so because I had a woman intentionally shut the door quickly with the button to avoid me entering lol no joke",
            "At night (and even the day), every man is Schrodinger's rapist to the average woman. He both is and isn't until something happens or you part ways. It's absolutely exhausting for women but assault is so common we can't afford not to be on edge",
            "Yes",
            "Yes, we are.",
            "I don't mind sharing the elevator with men. I do feel awkward (regardless of gender) because being in a small space while being silent feels rude. Makes me feel like I need to make small talk for the 30 seconds it takes to get to my floor lol.",
            "Women are afraid of men in elevators on multiple levels.",
            "I am. And would get off the elevator. No offense but not everyone is nice and I’m not tying to die.",
            "I've had dudes see I was alone in the elevator in broad daylight and say \"I'll catch the next one.\"\n\nThey are good dudes.",
            "yes. i am always on my phone in the elevator with my camera very visibly open and sending selfies to my friends",
            "Yes. If you want to help make others comfortable, pull out your phone or bring a book and pretend to be absorbed in it. \n\nAs a woman being alone in an elevator with a large guy who I didn't know would definitely have me very cautious. Especially at 1 a.m.",
            "Yeah, you can’t walk through a parking garage as a woman without clutching your keys so you have a makeshift weapon. Being a woman means having your guard up at all times. My best friend was raped in a parking lot while putting her groceries away. A man just snatched her, threw her in her own car and raped her. It happens all the time, all over the world.",
            "You could kill her with your bare hands without even trying. She has to stand within your reach. She knows nothing about you. Her fear is rational.",
            "Male here: \n\nI always use my phone even if I have nothing to use it for and turn away from the woman so that she can feel that I’m not interested in the slightest and she can feel relaxed.",
            "I was in a situation like this. I saw a woman was alone in the elevator at night and chose not to enter. I'm a big scary looking guy but I will walk over any insect or bug on the ground that I can see and I do not raise my voice or get violent with people even when my life is threatened lol. (Actually happened a few times, being threatened by the mentally unhinged \"Alpha Male\".)",
            "The only real solution is to lie flat on the floor, facing down, with your hands behind your back for the entire ride. Establish full submission to convince her you are not a threat. The confusion will ease the tension. \n\nSerious answer: just act normal. We can’t control how we are perceived. All we can do is not actually do anything wrong. Or, if you’re not in a rush, tell her you’ll wait for the elevator to come back down. Might be overkill but if you’re more worried about putting her on edge than getting back to your apartment sooner, you may consider that the best option.",
            "Personally, if I have to use an elevator at 1 a.m., I'm using it alone.   I don't care if it's a male or female getting on, I'm hopping off and taking the next ride.\n\nShady stuff at night (or any time of day) isn't exclusive to the male gender.",
            "I once wanted to use the elevator at a late time and a lone woman was inside already.\nI said to her \"I'll take the next one\" and I staid outside. she said thank you.\n\nSometimes one should be more considerate towards women at later hours, remember that they are already uncomfortable being alone",
            "Yes, you may not be a threat but as women we have no way of knowing that and have to be on edge. If I am alone with a man (especially one I don’t know) I usually have an exit in mind just in case. With an elevator there is no way out and nowhere to hide.",
            "You have to understand that a lot of us women are always on guard and act cautiously around strangers.  I’m on high alert just walking out to my car in a parking lot and I don’t have anyone that I know of following me….especially at night.  Some of us have trauma in our past with men so we are always expecting to be victimized again.  If it happened once, it can happen again kind of a deal.  So yeah, I would be spooked if I was on an elevator alone and a guy got in with me at 1am.",
            "Yes. I'd be scared of you. As a woman, if I'm alone with a stranger man at 1am in an elevator, fuck politeness.",
            "Personally, no. I've never had anything bad happen to me though. Lots of women have been assaulted and I cannot and won't speak on their behalf. \n\nBut on the behalf of someone who has lived an incredibly easy life free of assault, I am fine with being alone with men in enclosed spaces. If I had been assaulted at any point I can imagine not being OK with it.",
            "I’m not comfortable in an elevator with a guy I don’t know.",
            "Depends on the guy. But if you give me bad vibes, I’m not getting on and could care less if it seems “rude.”",
            "unfortunately. but don’t take it personally. shit happens to women often and it makes sense to be on edge in situations like that",
            "Elevator mechanic here. And I’m about your size. \n\nI make it a point to be presentable on the job. And have a friendly demeanor. Since I’m in and out of elevators hourly with other folk, I try to practice best elevator etiquette. \n\nLate nights in offices are when I get “looked at with concern”.  A “good evening” and a smile followed by a healthy dose of minding my business      Normally quells an uneasy look I get. Also, social distancing worked well before Covid. \n\nWe really can’t blame anyone for feeling uneasy while riding in a box with a stranger. Being polite and not trying to go out of your way is the best solution.",
            "Actually, in many ways most men aren’t aware of, women are constantly on guard and checking to make sure we’re safe and measuring risks. Everything from where we travel or walk at night, in a parking lot at a mall or grocery store, elevators, any unknown areas, locking car doors, gas stations while filling your tank ( remember to lock car doors while doing that, etc. It’s not that we’re paralyzed by fear, just can’t be ignorant of the fact that dangers exist and some people are evil, sadly many times those ppl are men. Fact of life.",
            "A little, because it’s a small enclosed space with no way to exit until you get off, and there aren’t always cameras. \nLuckily I’ve never felt threatened myself, but I have felt uncomfortable a few times when guys in my old building would start asking me personal questions when I had no way to really not engage (“hey I’ve seen you around, how long have you lived here? What’s your name?” Etc)",
            "Not that scared but im cautious",
            "I get the feeling this question is less about the specific situation - it's night time, you're alone in an elevator, you're much larger than she is, it's pretty easy to see why she'd be scared in these circumstances - and more about whether women are scared of you? \n\nIt's almost certainly nothing personal. Women are basically trained to fear being  blamed for their own rape. \nWomen walk this sickening tightrope where they are simultaneously hyper aware of their physical weakness compared to most men, while knowing that if they are assaulted, they will also be blamed for it. \nYes he's 6'4\", but what were you wearing?\nWhy were you alone in an elevator at 1am anyway?\n\nTo be honest, she was probably aware of you as a person but wasn't prepared to interact with you on that level. She wasn't just riding in the elevator; she was watching, she was waiting, and statistically it's also likely she was remembering some past unpleasant event. \nSo if she was unfriendly towards you, it's not you, and it's not the elevator. If she looked or acted scared, it's not that you are necessarily a threatening person or that you did anything wrong. It's just that women are constantly put in positions where they have to decide between their own sense of physical safety and someone else's feelings, and they're constantly told that only bitches put themselves first, and at 1am in an elevator with a big guy you don't know, well, your feelings aren't gonna be her priority. Sounds perfectly normal to me.",
            " Honestly, I’m nervous in any elevator with anyone. I don’t know what a stranger could do. Women are just as crazy as men.",
            "It’s also the idea of being in a confined space with no one who could intervene and someone hitting the “stop” button. \nAn expression I commonly use about people who make uncomfortable is “I wouldn’t wanna be stuck in an elevator with them”.",
            "Reading through these comments really is an eye-opener about the level of fear women have in every day life.",
            "I'm not but it seems like a lot of women commenting are. Never really thought about it I guess.",
            "Back to the wall and never exit first, so he can't hit me from behind.\n\nOnce or twice I have ended up in an elevator with a (dodgy) man and even though nothing happened the anxiety I experienced was through the roof.",
            "Yes. When I was in HS, a young girl went on a club trip to another popular country. She ended up in an elevator all alone. She was beheaded. Never caught the guy, he didn’t have a sexual motive like most predators, he just killed her and that was that. She was her parents only child, one they had worked for years to have and it destroyed them. It also horrified every one back home. It’s scared me ever since.",
            "Im scared of pregnant women on elevator I've seen way to much TV to know what happens.",
            "Yes, women are scared of men ~~in elevators~~",
            "At 1 am alone, ofcourse they are going to be wary of you. Duh",
            "I’m a man and I would be having a little anxiety. At that time in that place you need to be careful regardless. \n\nBut I wouldn’t keep looking at them. That’s the dumbest thing you can do. If they are psychos you don’t want to trigger them.",
            "yes",
            "Oh yeah. I can count on two hands the number of times I’ve been assaulted by men in an elevator. It wasn’t strangers though, it was people I knew.",
            "If I was in an elevator at midnight with a 6'4 tall figure, I'd be scared too regardless of their gender. And I'm a guy",
            "Being trapped in an enclosed space with an unfamiliar men? Yes, we can be, and not without good reason. While it's certainly true most men may not be a threat, enough are that we don't feel safe when we don't have the ability to get away.",
            "She doesn’t know you or your intentions. She just knows you’re a big dude that if you chose to, could do some terrible things to her.",
            "Yes. I’m generally afraid of men, and in closed spaces it’s worse. I’m also like 4’11 and like 120 lbs so … it’s just scary to be this small.",
            "An upsettingly large percentage of us have been sexually assaulted so probably yes she was afraid of you. Nothing personal!",
            "From my female friends, worry of rape, or assault or getting robbed is constantly on their minds when alone and if there is a male stranger near by.",
            "They should be …. Prime crop dusting area",
            "I would leave the elevator as soon as you came in. I leave the train if it’s just me and one other man. I do not want to be alone with any man who I don’t know. I have been touched, groped, and threatened far too many times. I’m terrified",
            "Women are kind of scared of men all of the time.",
            "As a fellow big guy, you have to think from their perspective. In this situation, they’re essentially rolling the dice and hoping you’re not a big psycho. Of course, most people aren’t, but you never know. This is their reality every time they leave the house.",
            "The other night I left my apartment and went to the store. From my door to the store is maybe a block and across the street, there was a woman a couple paces ahead of me (I’m 6’5) and we happened to take all the same turns (meaning we both crossed the street). She looked over her shoulders at me several times in the maybe 100 meters from my door to the store. She looked really scared and pulled into a doorway to let me by. I didn’t know what to do or say, I’m gay and I don’t mean any harm, but I’m sure she had reason to worry",
            "Yes. We are scared of men everywhere.",
            "My wife told me it would be like me getting into an elevator with a large dog that is showing no behavioral inclinations. IE no wagging tail, no growl, no anything. He's just standing there staring at me. You are pretty sure things are going to go fine but if that thing wanted to it could fuck up your day.",
            "Pull out your phone and start watching gay porn with volume turned all the way up.",
            "Ngl, if I see anyone by themselves in the elevators, past sunset/no others around, I’ll catch the next one, it’s just a few minutes more.",
            "Given the shit that goes on in the world, I don’t blame women. We men have some of the worst people in our gender"
        ]
    },
    {
        "post_id": "xce5r1",
        "author": "None",
        "title": "What do I say to homeless people?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/xce5r1/what_do_i_say_to_homeless_people/",
        "score": 16231,
        "num_comments": 4934,
        "created_utc": 1662992600.0,
        "selftext": "Last night my girl and I were getting McD's around midnight, and it's in an area locally known for having a lot of homeless people around. A guy ran up and asked for any cash so his friend could eat who hadn't eaten in days. It felt off but I had 3 bucks on me and, if he was telling the truth, it'd get him a cheeseburger. So I gave it to him and he ran off, idk if he got the food. My girl rolled her eyes and said I need to stop believing homeless people asking for cash (this isn't a habit, I just happened to have a little cash i didn't specifically need) and I told her I really don't like lying and saying I don't have cash. So this got me wondering: is it okay to lie to homeless people about having cash when you think they're just trying to get drug/alcohol money? I'd still feel bad for assuming they weren't legit people needing food.\n\nEdit: Holy hell y'all blew this up. I appreciate the responses! I always try to help people when I can but I'm a college student and extra cash isn't readily available to me lol.",
        "permalink": "/r/NoStupidQuestions/comments/xce5r1/what_do_i_say_to_homeless_people/",
        "comments": [
            "I've been homeless and a polite rejection is plenty. Just be nice.",
            "Don't bother lying. Just say \"sorry, can't help you\".",
            "I always say, “sorry man, not today” seems to go over the best. \n\nI’ve done this for years. One time a homeless guy recognized me and said, “how about today?” \nWith that kind of costumer service he deserved the dollar.",
            "I talk quite often with homeless people. \n\nWe talk about various subjects, e.g. the weather, their day or mine, their dog if they have one, life in general or I sometimes check in on them - if the weather is particularly hot or cold or they look like someone who needs it.\n\nMost of them are actually really nice people who just don't fit our society for whatever reason. I don't always give away money, sometimes I just shake my head or say \"sorry not today\". \n\nBut one thing I know:  I myself don't always spend wisely and when I hand it over, it's theirs.  I believe that all people act based on one rationale or another - not always a wise one - but I will not and cannot dictate or judge how they spend their money cause I will never know their full story.",
            "I live close to many homeless. I cannot possibly give to everyone of them. So, I go with my gut. If for some reason I feel it. Maybe the look in their eyes, whatever it may be. And of course, if I've got cash on me. Each situation is different. Do what you can, when you can. Thanks for asking a question like this. We can feel so uncomfortable when not knowing what to say or do.",
            "If you're concerned about them being legit just get them food. I've been feeding the homeless for about 2 weeks, And it's been an eye-opening experience. They're just people. Who are unloved and unwanted and undesired in society. Is certainly takes a toll on your psyche to be put in that situation. Certainly some just want drugs or alcohol, It's how a lot of them got into that situation, but some genuinely do want a meal.",
            "\"Sorry not today\" Is what I usually go with. \n\nI'll give someone a dollar sometimes if I have one but I haven't carried cash this decade. \n\nIt's not like you'll solve the homeless problem out of your own pocket.",
            "In my area I don’t even stop walking unless I want to risk getting hurt or possibly killed. \n\nLast time I tried to help someone thr guy threatened to kill me if I didn’t go to a specific spot to give him money. \n\nSo in my area I just don’t and if I really want to help then there are charities. \n\nGuys probably don’t have to worry as much if they feel confident in their ability to fight back if needed, but as a short female I can’t risk that.",
            "**Top three beggar lines I get hit with monthly:**  \n\\- I ran out of gas. My (truck, car, motorcycle) is right over there. I don't have any money. I just need a little cash to get home.  \n\\- My buddy hasn't eaten in (insert number of days). I'm trying to get him a meal.  \n\\- I'm trying to get money so I can take my (dog/cat/bird/chinchilla) to the vet. He's right over there laying down. He's the only thing I've got in this world.\n\nGet proactive. Find an organization that really helps and volunteer some time with them. It will change your perspective as to who really needs help and who's trying to fleece you. It's still a challenge, but you'll see the world differently.",
            "I work with the homeless population and have had friends and family that were homeless. \n\nIf you want to give them money, do it. Don’t police how they use their “gift”. Typically when people give them cash and I assume you as well, it’s pocket money. that you probably wouldn’t even notice if it fell out of your pocket on the couch. \nIf you give them cash it has to be with the assumption they may use it for drugs and alcohol. \nAt that point when I give them money, it’s not my money anymore - it’s theirs and they can decide how to spend their money as they please. They are grown and can make their decisions. \nI don’t really mind. \nMost people I know have drank and done some form of drug before, so i’m not going to sit on some moral high ground that poor people don’t deserve to do that… especially when you give them 1-5$ they aren’t getting much with that. Living on the streets is hard and just like a lot of people, they may turn to drugs or alcohol at times (how often do you hear “man this was a rough week I can’t wait to go home and have a beer / smoke” or something to that effect? it’s a pretty human reaction to have to stress and hardship) \n\nIf you don’t feel comfortable giving cash but want to help out, you can always give them a water, bag of chips / nuts etc, hand sanitizer, baby wipes, socks etc. \nIf they ask for cash and you don’t want to give or don’t have any just say “sorry not today” or something…. unless the person is very unwell they usually say ok and keep moving.",
            "I was once leaving an ATM and I had a homeless guy ask me for money. I asked him if he had change for a $20. We just stared at each other for a few a seconds and then I walked away.",
            "Just say \"no\", I always say \"I got nothing\" which is just short for \"I've got nothing for you\". Don't stick around to listen to the story, just keep walking while saying whatever your version of no is",
            "If I give money to a homeless person, I do so knowing that they may or may not spend it on food, clothes, or other essentials.\n\nAnd once I give them the money it’s none of my damn business what they do with it. If they want to go get high, then I can’t blame them; I’d probably want to get high, too.",
            "Having recently been homeless myself, I can tell you that besides from the harshness of living like that, the absolute worst thing about it, is that most people assume that you're some kind of villain that lies, steals, cheats, does drugs and that you have probably always been like that. Really makes it hard to see kindly on mankind, even if you really want to.\n\nSo my advice is to give if and when you feel like it, and keep your money if you feel like that. And saying \"sorry, can't help\" is perfectly legitimate.\nBut don't assume that you can read minds, or that all homeless people are the same.",
            "Either you’re worried about the $3 or you’re not. You’re not under any obligation to give anyone anything.",
            "My personal philosophy is that if I get a chance to show someone that they’re valuable, I will. I’m not naive, but I choose to assume the best in people. \n\nThat said, I don’t carry cash and will be honest about that, but offer that I can buy coffee or something similar if that doesn’t stretch my boundaries too far. Back when I used transit often, I’d keep a spare bus pass with funds on it. When cash or food wasn’t easily available people seemed to appreciate it.",
            "Hi. I work in homeless services.\n\nWhen someone asks for money, I typically tell them I \"just have my card on me, sorry, but I hope you find what you need.\" Sometimes they'll follow up by asking me to go in and get them something, and if I don't want to or can't, I just say \"can't do that right now.\" It's okay to have boundaries with your money with folks on the streets as with everyone else.\n\nThat said, it's indeed true that sometimes people on the streets take the money given to them for \"food\" and use it on other things. A lot of people put conditions on their donations and get angry when those conditions aren't fulfilled. I offer you all a different perspective: sure, they may not use it on food like you hoped, but they WILL use it on something that will help them get through the day. It's tough enough being on the streets. If a Bootlegger will help dull the senses, who cares?\n\nWhen you donate, donate knowing it can be used for anything or don't donate at all. If you'd like to help another way, keep supplies in your car or get familiar with the resources in your area and share that information. You'd be surprised how many people don't know what services they can access.",
            "Crackheads used to stop people coming out of a restaurant I worked at years ago. It was a cash only place, so pretty much a sure thing that people had cash on them.\n\nThey always had something they needed money for. Most common was can you spare 5 or 10 bucks for gas. They supposedly ran out of gas far enough away that you couldn't see the car. Sometimes they'd add that they were going to a job or picking up their kids for added sympathy. My favorite when they did the gas thing was I'd say, \"Dude! It's your lucky day. I just filled up a 5 gallon container of gas for my lawnmower. It's in my trunk right overthere. I'll drive you to your car and we can put the gas in. They'd just be dumbfounded. Saying crap like,\" umm but I need the 10 bucks for gas.\" Yeah man I got the gas right here. It was just funny watching their faces after I said I had gas in my trunk. They literally didn't know what else to say because I went off script.",
            "I never bother to try and differentiate the legit from the lies, it's beside the point. If I have the extra cash, I hand it on over, and I usually make a comment about them not needing to justify their need to me, a stranger. If I don't have the extra cash, I apologize and say I'm pretty broke rn, and sometimes offer a cigarette instead.\n\nThe way I see it, if they need money bad enough that they had to resort to begging strangers for it, they can just have some of mine. I don't care if they spend it on food or crack, the money belongs to them once I've made the choice to give it. If you don't wanna hand over the money they ask for with no strings attached, a polite \"sorry, don't have any cash\" is all that needs to happen. We have no right to interrogate them over their intentions or demand they buy certain things with the money we choose to give them. Give freely or just don't bother, because those folks have enough problems without weirdos demanding they dance for their dinner.",
            "Most of the time giving them money isn’t going to help them long term. Donate to soup kitchens, homeless shelters and places that specifically help people like that. Also brush up on what resources your city has for the homeless.",
            "Having been homeless before, its actually not hard to stay full in America if that is really your concern. From white boxes, to churches and the dumpsters across the country- there is always free food somewhere. \n\nAnd yes, its ok to lie back at people.who are lying to you. The three bucks was for a fix, not food.",
            "I live in Germany. People can get welfare over here. If a native speaker is begging, money is not his main problem. \n\nI work in a school for adults and most of our customers live of welfare. Its not fun but they manage.",
            "Have you read that story about the father who advocates for doing good recklessly? If someone says they’re hungry and you have the means to help them, help them. It’s good to assume the best when it’s not hurting you to assist them. \n\nAnd if he was lying? Jokes on him. **He’s** the asshole, but you did your kind deed for the day.",
            "All homeless charities say you should not give them cash. If you’re concerned you can contact the relevant charity or authority to get them help.\n\nI started doing the above, and I was shocked to find out that every person I had referred was already known to the charities and already had assistance and/or a home.",
            "I usually give people a small amount of cash if I have it. I generally believe them that they are hungry, and even if I didn't, I think it is ok for poor people to sometimes have alcohol or drugs, just like other people",
            "If someone is outside a fast food place I will buy them food, as much as they want, but otherwise I don’t usually carry cash. \n\nSame would go if someone asked me specifically for hygiene or comfort items. I would happily buy them.",
            "it's your money, so do whatever you want with it.",
            "Your girlfriend is right. I live in a downtown area with plenty of homeless, so I interact them almost daily. Many cities and organization already providing them with hot meals, so nobody is staving to death. He most likely lied to you when he said he hasn't eaten in 3 days. Sometimes I walk around and see huge plates full of uneaten food next to homeless people who beg for money\n\nMost homeless people in my area have some substance abuse issue and are looking for cash for purchasing alcohol and drugs",
            "So, here a couple ways to look at this.  \n\n\nPerspective 1:  \nSo for a number of years I was a rent-a-cop, and I worked graveyards at a couple of different sites. I got to know some of the local homeless folks. Mostly my job was to send them packing, with alacrity. If I could not convince them to mosey under their own power I would be required to involve local law enforcement to further encourage them.  \nSo one Christmas Morning about 2 AM, I see a regular leaned right up against the front glass in a seated position. Its cold AF so I assume hes trying to get the heat from inside the building. I Asked him, has he eaten today... he said \"no\". Asked him if he was hungry, he said \"yes\". I went back to my office and heated up the entire Christmas dinner my fiance had brought me, two heaping plates of amazing family style chow, and brought it out to him. Told him I would be back by in a bit, and just leave the plates on this bench. I'll pick them back up.\n\nLater I came back, the dude stole the knife and fork, splattered the food across the glass and shattered the plates. I was beyond angry at that point.\n\nAfter that, it got a lot easier to do the \"bum rush\" part of my job.\n\n  \nPerspective 2:  \nSeveral months later, I was taking my mom out for brunch. At an intersection in this same town GUESS WHO came running up the passenger side of the truck begging for cash. Mom opened up her wallet and gave the guy cash, right on the spot. It was easy to see shes an old lady and there was MORE cash in the wallet. I was worried my mom was getting scammed like this on the regular, and that she was making a target of her self. I told her this, but did not tell her I know this guy. I said, he's just going to blow that money on terrible booze.  She said to me, \"Well, I at least know that I personally tried to help him in a way I could, that I gave him the CHOICE of a hot meal or not... I gave him that power today. Besides... if my best outcome for the day was to sleep in a shelter instead of a storm drain somewhere... I'd probably want a bottle of cheap whiskey myself.\"  \n\n\nSo either way, it's a complex issue. IT really depends on what your personal expectations for outcomes are. Today, many years later... I will give homeless folks a couple of bucks if I have it on me. Further, I'm not really the \"rob me\" type. I have flat begged my wife to never roll down her windows or get out of the car if she even things there is a chance of a bum near her. Again, too much experience from the rent-a-cop days, none of it good... and for the most part I think she humors me.  \n\n\nFor yourself, you need to judge the short-term and long-term risk/reward. You simply do not know what the bum is getting out of it. You know what YOU expect to get out of it. So, \"to thine own self be true\" and to hell with the opinions of others.",
            "I don't have any money for you.\n\n(the money I do have is for me)",
            "The best way is just to not engage. Don't say anything and just keep walking. You don't owe them an explanation or money.   \nIf you're a soft touch and want to give them a few dollars, then keep a few spare bucks in your pocket so you can whip it out quickly and pass it over, while still moving without engaging. You don't want to stop and pull out your wallet in front of an unknown person who may be desperate or dangerously psychotic.",
            "I say I don't carry cash, but if they really needed the food they wouldn't turn down a warm meal",
            "Last time I went to Chicago for a concert this happened to me too. I was walking from my hotel to the gas station for some snacks. Homeless dude came up asking for food for money. I rarely ever have cash so I told him I would grab him something from the station. I got my stuff and grab a $6 pre-made sub and a water for him. Gave it to him on the way out, told I'd been Where's been and it can certainly get better (he told me about a drug problem) and keep his head up.\n\nWay I look at it this. If I can afford a concert in another state that I drive 3 hours to get to, a hotel, and everything that comes with not being home (eating, drinking, gas for travel, etc) I can afford to be a decent human being and help someone when I can. From the sounds of it, you can too.",
            "Don’t carry cash and hand them food. I gave a homeless guy my katz delicassen",
            "I had someone ask me for money at a gas station and I honestly did not have any so I said “sorry I rarely carry cash” he was cool about it. No big deal. While I’m pumping gas, I see him open the cigarette butt post and start digging in it for cigarette butts. This was too much. I am a former smoker myself and I know how strong that addiction is, so I sympathized. It will bring to do that, I promise. So I approached him and said “you don’t need to do that. I really do not have cash but I want to buy you a pack of cigarettes. Come into the store with me and I’ll buy you what ever brand you smoke.” His face lit up, he put what butts he had found into his pockets (he knows the fresh pack won’t last. Save your resources I suppose) and went in with me and I bought him a pack of smokes. I hope he’s ok and doing better now. I think about that guy pretty often.",
            "if i have the spare money i just ask them what they want, and tell them i'll buy it but i wont give cash. if they accept then great, im glad to help - and if they refuse and just want cash, then too bad so sad.",
            "You don't have to lie, but you don't have to tell the truth either. Just treat them like a person, and that can be enough. I'm in NYC, and usually, \"Sorry, I'm broke. Good luck out there.\" and sometimes, \"Stay safe.\" is accepted. Acknowledge that they're a person and you sympathise with their situation",
            "Some homeless are legitimately enduring about the worst times ever and digging out of homelessness can be a monumental ordeal. Factor in mental health issues, substance abuse and a genuine lack of resources and it makes a portable nightmare. Most know where to go to get the free stuff. \n\nSome homeless are fundamentally hustlers that give the real homeless a bad rap and incline people not to help anyone.\n\nIt can be hard to tell the difference.\n\nFood yes! Money no. I might add that the difference in homeless folks and housed folks is about a period of missing paychecks. \n\nAlot of people live on the edge.",
            "Don't pull your wallet or all of your cash out in front of them. People do desperate things when they need a fix.\n\nUnderstand that your money has a very good chance of going towards drugs or alcohol. I'm not trying to bash homeless people; I use to work with my city's Department of Behavioral Health. Most (as in overwhelming majority) homeless people are dual diagnosis, which means they suffer from both substance abuse and mental health issues. It's just reality.\n\nDonating your money to a homeless charity is like flushing it down the toilet. Where I live, nobody except for people like us are helping the homeless; there's no non-profit down there feeding them and giving them tents and clothes and whatever. The city doesn't do shit to help them. The only help they get is from regular people from the community trying to make a difference. Fuck homeless charities.\n\nMake your own decisions. Decide on what you're okay with. And then offer help in the way you deem best.\n\nGood luck!",
            "Do what you feel like is right. You can't know what he'll use the money for, but there isn't anything wrong with treating a fellow human with kindness - whatever you feel like that means for you.",
            "\"No, sorry.\" If you're feeling super generous offer food - but in my experience they just want drug money and will run off or demand money instead. Don't say you don't have cash bc that opens the door to demand cash app or Venmo. I get it's harsh but you gotta look out for yourself and not open the door to a heated interaction. In NYC area it's pretty bad",
            "Lying, as a general rule, is wrong. And you know what for three bucks that guy was unlikely to be able to score anything that you would really have a problem with him having. There are times I don't have the money, I'll tell them the truth I don't have the money, or I don't have cash. However if I've got a couple of bucks I'll hand them a couple of bucks. If they're so desperate that they're willing to humiliate themselves that way then I'll just help them out.",
            "Instead of giving to the homeless, give your change to your local (not big) homeless charities. \n\nMost of them constantly tell people to stop giving change because it can perpetuate worse drug issues, create competition around \"territories\" which lead to violence, and a host of other problems. You think you're helping but you might be making things worse. \n\nNot necessarily the big guys, but small local charities usually know how to spot the addicts and know how to get them help. They have food services and shelters that are in DESPERATE need of money, and they can provide real, boots-on-the-ground support.\n\n\nEvery time I want to give to a homeless person, I pull out my phone and I send a $20 or something to my local shelter. There are great websites that review and analyze charities to show you which ones are bullshit and which ones are doing real work.",
            "If they’re directly outside a store and ask for money, I say “I don’t have cash, do you want anything from here?” And I’ll pick up a thing or two for them. The requests are usually something like chips, made to order food, sodas, deodorant, mouthwash, etc. \n\nI’ve had two people decline the offer and one get angry. Be safe about this, you don’t know who’s mentally I’ll and/or an addict, anyone anywhere, homeless or not, can be unpredictable. I avoid interactions with anyone period if there’s no other people around. \n\nFor context, I’m a young woman and I’ve lived outside of Boston, DC, Baltimore, NYC, and Athens (Greece), and now outside of an opioid city in WV, so your experiences may differ wildly depending on age, gender, location, etc.",
            "Nobody is entitled to your money, you don't have to give it to them.",
            "I just say “No, sorry, I have bills to pay”",
            "I try to be nice, but I don't give them money. You're better off giving money to organizations dedicated to helping them if that's what you want to do. \n\nSomething like \"no sorry, have a nice night.\" Firm but kind.",
            "I usually just smile and say “sorry I don’t have anything on me”. 85% of the time I’m telling the truth. But meh. I think the important thing is to just be empathetic. You don’t have to give them anything, but just don’t be rude. They’re still human beings.",
            "One time instead of giving cash, I invited some into my apartment so they could shower and rest the night. That felt better in a way. There are a lot of scammers but sometimes its just normal people who are struggling.",
            "In my early 20's I had issues and ended up homeless on the streets.  Believe me, most people who are homeless have significant mental illness, physical ailments, drug issues and/or have had a lack of opportunities.  Helping them out in any way is helping them out.  \n\nPersonally, I seldom have cash these days as everything is transacted with plastic, so giving money out is really not an option.  I now have a great job and make good dollars, have a family, and choose to give significant amounts of money to local charities that specifically focus on the poor and homeless.  Ignoring them, blaming them, assuming the worst about them is not constructive.  I personally love giving money to help somebody who is down and out.",
            "I kinda just give homeless people money if I have an extra couple of a bucks or a ten I had no plan for. If they’re gonna use it for drugs so be it, they’re life is tough as it is without withdrawal symptoms, and until we have a better way of publicly caring for these people I feel like it doesn’t matter if they do. Idk I also have enough disposable income to be ok parting with my small bills from time to time like that, and absolutely wouldn’t condemn anyone who doesn’t have enough to do something like that.",
            "Not every homeless person wants to eat a burger from McDonald's or other fast food every day. If you want to help either Give them the money anD trust them, or Give the money to a homeless aid group. Lots of homeless people have to save up for larger items like sleeping bags, hygiene products, etc. Food is often the most readily avaliable supply. If you don't want to help, or don't trust the money will be going to the right place. Just say sorry not today.",
            "I've been homeless myself your money would go along way for some who dont like drugs or alcohol but the ones who do have ruined it for everyone else. Next time offer food if they say no they legit just want drugs bro. There is help out there for the homeless lots of it but most of them dont want it. But no for real I went a month with no help or anything and needed money for work clothes and shoes and I went on the internet and asked.",
            "Formerly homeless person here: there are *plenty* of ways to get food; soup kitchens, food stamps, food banks etc. etc. If a homeless person is asking you for money the chances are exceedingly likely it's just for drugs or alcohol. If you don't mind contributing to that fund - because homeless life is fucking horrific - fair play, but if you don't have the money don't worry about not being able or willing to contribute; just say \"I don't have any cash on me\" or words to that effect.",
            "Don’t carry cash on me, if I’m walking into a store and they say something like can I get a dollar for a water or a snack I’ll say what kind and if they tell me I’ll usually add it to my gas/snack total.  I usually throw in a water to whatever they ask for when it’s hot too.\n\nSide story, a month ago I went in for gas and it was super hot.  Guy came up to me super sunburned and sweaty with a gas container and asked for a dollar or two for gas.  Didn’t have cash but was going to get cash back anyways, decided to get a $5 for him as $2 was pretty much nothing in gas.  Got a couple waters for him too. When I drove off after pumping gas I noticed him pumping gas…he put in $2 and I saw a 40 ounce miller in the bag of waters I gave him… just had to smile and think well I hope his day goes a little better now and technically he used the $2 he asked for lol",
            "Just don’t carry cash",
            "Well I’d buy some food vs giving cash too for homeless.",
            "I've heard saying \"sorry\" can be annoying so a simple \"I don't have anything\" can be fine\n\nBut also, if they can buy drugs for 3 dollars then they're getting a terrific deal",
            "A doctor who worked at a hospital in internal medicine and had many alcohol addicts, told me that \"they are just buying alcohol (or other drugs)\" is a stupid excuse for not giving beggars money, since life on the street is barely survivable without any drugs, so it is essential to them. Even alcoholics can die due to withdrawal and even if they don't, it sure as heck feels like dying. We shouldn't decide, what's a wise thing to spend their money on, when society is not capable of helping them properly.",
            "I believe that it doesn't matter what the homeless person buys with the 3 bucks you gave him. I give money to the homeless here in Vegas all the time and to spend it for them too would take away from the blessing I feel. The fact that you made the guy's life better for that moment should be enough.",
            "I've been homeless and a polite rejection is plenty. Just be nice.",
            "I personally don’t care if it’s for drugs/alcohol/food. If they’re enough of an addict, they’ll die without drugs/liquor before they die from starvation. I’m just tryna help regardless"
        ]
    },
    {
        "post_id": "13tfgl3",
        "author": "TheRealerChief101",
        "title": "Does it piss anyone else off to see crabs and lobsters boiled alive?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/13tfgl3/does_it_piss_anyone_else_off_to_see_crabs_and/",
        "score": 16219,
        "num_comments": 4269,
        "created_utc": 1685214378.0,
        "selftext": "I'm not a vegan or anything I eat meat but boiled alive seems so cruel",
        "permalink": "/r/NoStupidQuestions/comments/13tfgl3/does_it_piss_anyone_else_off_to_see_crabs_and/",
        "comments": [
            "It's illegal in Australia. Crustaceans have to be killed or sedated before boiling.",
            "My understanding is that experienced chefs kill them first. Apparently there is an easy/quick technique to do that.  \n\nI learned that from my first wife who lover lobster but would ask how it was killed.  So the chef would always come out and explain.\n\nEdit: “loves lobster” not “lover lobster”. But I’m leaving the typo because it’s awesome.",
            "A lot of chefs will put them in the freezer for 15-60 minutes to disorient and sedate them before boiling. Some chefs stop here and some will also use a knife to kill a lobster before cooking. There's a certain area you plunge your knife into that pretty much kills them instantly. It's the most humane way.",
            "Yes, but mostly because it’s incredibly easy to kill them with a knife. There’s a spot near the head that’s as instant as knifing a zombie on round 1. \n\nI get mad at deer hunters who won’t finish off a deer they shot because they “don’t want to ruin the mount” as they lay there bleeding out and dying. Quick shot to the base of the neck and they’re gone.",
            "I have just attended a lobster festival in Western Australia, which is a major exporter of lobsters. According to the experts, the most humane way to kill them is to put them in a slurry (a mixture of ice and water), this slows down their metabolism, then put them directly into ice, before using the knife to instantly kill them. Not only is it humane, this method also preserves the flesh better.",
            "Friendly fact to anyone who may not know: pigs are scientifically much, much smarter than dogs and have a larger emotional range. They're considered our smartest domesticated animal.",
            "Wait till you see how they make eels for sushi",
            "No but seeing Octopus being cooked or prepared certainly does",
            "After 20 years of being a chef I hate hate hate it. Softshell crabs are the worst because you have to snip the face off while they're still alive. \nA few years back, an old boss wanted to give the Valentine's day lobsters a comfy spot before we have boil them alive to order. Took a 6in hotel pan and put lettuce and mushroom stems in there and even heated the immersion circulator so it was like a jacuzzi.\nI come back from a cigarette break and there were like 30 lobsters all belly-up and starting to smell. Chef Freddie didn't salt the water and they all basically drowned. Like 3 of us cried lol \nDon't even get me started on cleaning rabbit!",
            "As a teen I worked in the kitchen at a Chinese restaurant. There was a dish of stir fired lobster where the diced lobster was still in the shell and you got a special fork to dig out the meat. I saw the cooks prepare this dish and prior to stir frying, they diced the lobster while it was alive. The severed pieces were twitching as the dumped it into the wok. Put me off lobster forever.",
            "All animal cruelty pisses me off. What blows my mind is that it doesn’t piss everyone off.",
            "It's actually a crime in many places nowadays. It's considered animal cruelty.",
            "There's a scene from a TV show called \"my name is Earl\" if you haven't seen it I would highly suggest watching it, it's very good. But a guy named crabman has a scene where he's putting crabs in water and he just wants to cry it breaks his heart but he needs to do his job. Once you learn his personality you'll completely understand why he hates it.",
            "There was a thread about this a few weeks ago, and everyone was saying its because if you kill them earlier, then store them in the fridge, it gives you food poisoning.",
            "Yeah I stopped eating that kind of meat after watching one being cooked alive. Something about the way it kept trying to push the top of the pan off and desperately trying to climb out of the boiling water got to me. I ended up looking into the research on whether they can feel pain and sure enough they can.\n\nIt sucks because I find crab and lobsters tasty, but the imitation stuff is totally fine too.\n\nEdit: Since folks are confused by what happened, I can elaborate that it was a large crab. And basically the person cooking it was having a hard time getting it in the water because it kept trying to push the lid away and get away from the water. They finally just smashed the legs with the lid so it withdrew it's claw and then it was fully submerged so obviously it wasn't able to push the lid after that. It died shortly after I assume, but it was still hard watching them try to get away before the lid finally closed.",
            "I used to catch Dungeness crabs. What I did was this:\n\n* Put the crab on its back in the sand. \n* Place hatchet up the middle of the crab's underside, lined up dead centre.\n* Give hatchet a whack with a piece of driftwood, halving the crab and instantly killing it. \n* Pull off the carapace.\n* Hold each half by the legs, give it a firm downward throwing motion, all the guts fly out.\n* Rinse in the ocean.\n* Straight into the pot boiling on the beachside fire.",
            "What really bugs me is when they cut up octopus alive in Asia, those creatures are obviously sentient it just seems so cruel.",
            "It's fucked up, but not any more fucked up than the rest of the meat industry. Every single animal you eat has been treated like shit",
            "Consider reading \"Consider the Lobster\" by David Foster Wallace: https://en.wikipedia.org/wiki/Consider_the_Lobster\n\nGreat audio recordings available online for free: https://www.youtube.com/watch?v=_fZOl7C_vDI\n\nGreat essay and great debate by one of the greatest minds of our time.",
            "I ended up going vegetarian because I started thinking about this stuff. I believe everything has a soul, and I just cant justify ending a life for my own greed. I don't need it to survive, I am surviving even better now and am healthier, and in much better shape than when I ate meat.\n\nI miss the taste and convenience in a huge way, but it's just too much of a mind F for me to justify - I was doing serious mental gymnastics to justify eating a cow but not dog for example. I love my dog so much, and if cows and pigs are intelligent and emotional as them, then what the hell am I doing? \n\nThat's just my personal perspective though, and I don't judge others for choices they make.",
            "All forms of animal cruelty piss me off so yes absolutely.",
            "I mean, the lives of animals for even dairy is abhorrent and cruel, let alone meat consumption. The animal agriculture industry is insane, objectively horrendous for the environment, and rocketing us into the post-antibiotic era with the overwhelming use of non-theraputic antibiotics (hooray for superbugs). \n\nI've been banned from subs for even bringing this up, but it seems relevant to the post.",
            "The animals we eat regularly aren't exactly agony free either",
            "100%. It’s a living creature that has pain receptors.",
            "I won't eat them since I heard that, at the very least, they feel the discomfort if not pain. So unnecessary and sadistic.",
            "The meat industry is unspeakably cruel.\n\nAt least lobsters get to have a decent life in the wild before being killed traumatically.\n\nMost meat animals live a tortorious horrific nightmare in a factory farm until they are killed traumatically.\n\nIt's all bad.",
            "I have uncomfortable amounts of empathy, yes I do feel bad for them",
            "I would probably feel bad if I wasn't from Maryland",
            "For eons, the hominid ancestors of humanity were hunted by the Crustaceans. Men, women, and children were thrown in boiling water and served with drawn butter and a roll. Eventually, eating us made them very stupid. They devolved. Their starships and cities decayed to dust. We evolved and it is our birthright as bipedal hairless apes to take horrible revenge on the crab people by devouring them as they did us. Sic Semper Crustaceans!",
            "And that’s why I have only worked for one seafood restaurant whose policy it was to properly (read: humanely) dispatch the lobsters.",
            "Sounds like a good reason to stop eating crab and lobster.",
            "Yeah it does. It’s awful.",
            "To avoid the food poisoning you can kill them immediately before cooking them. Like take out the lobster, plunge a knife through its head, then boil it right away. That way the bacteria in their flesh won't have time to multiply and make you sick.",
            "You think that’s bad? You should look into the meat/dairy industry.",
            "If you are against it, you should be vegan. Else you're a hypocrite and it makes no sense being against it. Either animals deserve moral consideration or they don't. And if you can be vegan, that means any kind lf animal products is a cruel choice. Live in allignment with your morals. Don't pick and choose who deserves to be tortured and who gets a free pass like some maniac dictator.",
            "Anyone else follow Leon the lobster?\n\nhttps://youtu.be/9sI7WveN7vk",
            "Fun fact: pigs are often gassed first so they’re stunned, but some will remain conscious. Then their throats are cut. Then they are emerged in scolding water to clean them and get rid of the hairs and stuff.\n\nSome pigs are fully conscious and alive when thrown into the hot water. There are plenty of clips available that show this.\n\nWhat happens to crabs and lobsters is horrible and should be illegal, but there is no humane way to murder someone. Or exploit, for that matter.\n\n[Consider educating yourself❤️‍🔥](https://www.dominionmovement.com/watch)",
            "Never cared for it, I'll take a salad",
            "All things considered that lobster, crab, mussel ,oyster, scallop etc lived its life free in nature for the most part. I feel worse about cattle, pigs etc raised on factory farms their whole lives and then off to the abattoir.\n\nEdit…Don’t get me wrong, I love a great steak, just sayin.",
            "Yes I do and I’m glad someone else feels the same",
            ">Does it piss anyone else off to see crabs and lobsters boiled alive?\n\nNo. You're the only one. Jesus, how does this get 14k upvotes and end up on the frontpage?",
            "Yet, you'd douse an ant pile with pesticide. Lobster's are the ocean's bugs.",
            "Pretty low on my list of horrible things in this world that piss me off.",
            "No.  Pass the butter please.",
            "You can get them drunk, freeze them a bit, or stab the brains. No reason for any animal to suffer.",
            "I don’t eat lobsters exactly for that reason",
            "yeah i have no idea why chefs don't just brain them before boiling, the whole reasoning behind boiling them alive is because the meat spoils extremely quickly, but there's no reason you can't just kill them right before boiling",
            "Read 'Consider the Lobster' by Wallace. \nAmazing and debunks most of the arguments for humane treatment through freezing to disorient and plunging a knife to insta-kill them.",
            "No.",
            "Make no mistake: given the chance, lobsters and crabs would boil you alive and everyone you care about /s\n\nIn all seriousness, though, I do enjoy eating both lobster and crab. I won’t go into detail, but I make sure they are dispatched quickly and with respect before going into the pot. I grew up on the ocean and this is how I was taught to do it. \n\nIn general I feel compelled to respect my food, seeing as how someday I will be food for something else.",
            "100% feel this",
            "I worked at a restaurant where the chef STEAMED them alive at a lower temperature. So they suffered for long before they died. And he also tied a knot around their tail connected to their head so they would stay straight and not curl up while being slowly killed. Sick",
            "Yes. The way we treat animals we eat is fucked up to be honest.",
            "\"It tastes better when they suffer\" is something that really makes you step back and wonder what the fuck we're doing here",
            "It's absolutely revolting",
            "I can't believe that some people are ok with this.  They are literally boiling an animal alive. I'm sure they wouldn't be ok with their dog orcat being boiled alive which is exactly the same thing.\n\nIt's evil.",
            "It's completely understandable to have concerns about this practice, given the intuitive discomfort many of us might feel. Now, let's get into the science of it.\n\nFirst, it's important to know that crabs and lobsters belong to a group of animals called invertebrates, specifically a subgroup called arthropods. They have a very different nervous system from us mammals. Their nervous system is more decentralized than ours, and it doesn't include a brain in the way we understand it. Instead, they have ganglia, which are clusters of nerve cells, distributed throughout their bodies.\n\nNow, the central question is whether these creatures experience pain or suffering when they're boiled alive. Pain perception in such organisms is still a subject of active scientific debate. Some researchers suggest that crustaceans, such as crabs and lobsters, may experience a sensation analogous to pain, while others argue that their nervous systems are not complex enough for the subjective experience of suffering.\n\nThe principal argument against crustaceans feeling pain is based on their nervous system's simplicity. Some scientists argue that the experience of pain requires a level of cognitive processing that these animals likely do not possess.\n\nOn the other hand, some studies have shown that crustaceans exhibit avoidance behavior to harmful stimuli, which could be indicative of a pain-like experience. However, this is not definitive evidence of experiencing pain as we understand it because it could be a simple, reflexive response without the conscious perception of distress.\n\nIn summary, the scientific community does not have a consensus on whether crustaceans like crabs and lobsters can actually experience pain. Therefore, the reaction to their method of preparation often varies based on individual perceptions and beliefs about animal welfare. However, alternatives to boiling live crustaceans are increasingly being proposed and practiced, such as stunning or chilling the animals to insensibility before cooking.\n\nIt's a fascinating topic that continues to be researched and certainly opens up important discussions about ethical food practices.",
            "I find it weird that you need to clarify that you're not vegan or anything. Like it's so uncool to speak against animal cruelty that one has to preface it by saying they still eat meat",
            "Yes, you are supposed to chop their head in half between the eyes before boiling lobsters. It is humane and kills them immediately, which is significantly leas barbaric than the way a majority of animals go.",
            "I remember seeing on video on Tiktok of a woman just grabbing a crab, prying the carapace open, and digging in. As a meat eater with no intent on becoming vegan, that made my stomach fucking *churn*, bro. Totally understandable to be pissed off when you see someone cause an animal undue harm.",
            "Yes. In general it bothers me that most humans have a lack of respect for other lifeforms. Their suffering still matters even though they aren’t like us.",
            "It's illegal in the UK as a study done a few years ago determined that crabs and lobsters do indeed have sentience and can feel pain.\n\nIt wasn't always though.",
            "If you think that pisses you off, wait until you see Earthlings or Dominion (documentary)",
            " Yep.",
            "It’s better then microwaving them.",
            "No",
            "Just makes me hungry. \n\nBut killing an octopus (for any reason) does make me sad. They are more intelligent than Trump voters.",
            "They may, or may not feel pain, but they definitely react to stimuli (like boiling hot water). I did the Google, and it says they can live up to 45 seconds while boiling.\n\nApparently there’s an electric lobster stunning device, that kind of knocks it out beforehand. You can also throw them in the freezer for a while before cooking, though that begs the question, would you rather slowly freeze to death, or be boiled alive for less than a minute?\n\nYou can plunge a knife to the CNS, just behind their eyes or so (not sure exactly where, I’m no lobster surgeon), but it’s best done right before the boil.\n\nEdit: the knife plunge supposedly keeps the “meat” more tender, because they don’t freak out as much as plunging them into boiling water. Chefs are very divided on all these options, as opposed to a farmer with a captive bolt pistol.",
            "Just stopping in to say that there is no way to humanely kill something that obviously doesn't consent to become your dinner. In a world where alternatives are readily available and killing animals for food is a choice, please don't soften the reality of what is occurring by calling it humane. \n\n I'm not trying to be preachy or tell anyone what they can or cannot eat, but it is a pet peeve of mine when people talk about \"humanely\" killing a probably perfectly healthy animal for food.",
            "Why? They’re just fish. All of the animal kingdom exists by predators tearing one another apart, often eating them alive.\n\nWhy do we have to feel a weird guilt about behaving like an animal?!",
            "I’m conflicted tbh. Nature is violent and cruel. I’ve always found it strange how we’ve imposed limitations and morals on ourselves when it comes to such things, as if we aren’t part of the natural world. We are the only animal that gives a shit about how our prey feels. \n\nBut yeah, despite all that,  I think boiling an animal alive is fucked up.",
            "Nope.\n\nI understand this is somewhat of a double standard, but i just don’t feel empathy for crustaceans the way I do for mammals, birds, or even most reptiles. Crustaceans are just big sea bugs, and I have less than zero empathy for bugs. Granted, i care about crustaceans more than bugs, but you get my point, i just don’t care that much.\n\nThat said, you can use a knife at a specific spot on lobsters’ and crabs’ bodies that will basically kill them instantly, and I would prefer they use this method. The suffering of the crustacean, however brief, isn’t necessary.",
            "Makes me feel better if I kill it first. Boiling it alive is extreme.",
            "I used to live in maryland, the crabbing center of America. The sad truth about crabs is that is really the only safe way to cook them that’s available to most people. Also studies show crustaceans nervous systems don’t quite work the same way humans do so they don’t exactly feel pain, rather discomfort.",
            "No. It’s not very likely they would feel or even know their lights are going out. A shark that gets gaffed by a fisherman will eat his own guts, as an example.",
            "Yeah it pisses me off",
            "Yes you are not alone",
            "This kills the crab.",
            "It’s very unsettling for me too",
            "Yes. I don't see why they couldn't stab them in the brain just before tossing them in.",
            "I completely agree OP",
            "It hurts me to even walk past the tank.",
            "Me, an intellectual, knowing that in certain countries dogs are skinned ALIVE for meat.",
            "Yeah. And it's revolting to eat essentially a giant cockroach by pulling its body apart.",
            "Wait till you find out about oysters",
            "Look, if that bothers you (and it should), you may want to reconsider all animal products. Factory farming is beyond cruel."
        ]
    },
    {
        "post_id": "vpsghv",
        "author": "FrigDancingWithBarb",
        "title": "If your future self came to you right now with a totally unbelievable but important message, what question would you ask them to 100% confirm their identity?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/vpsghv/if_your_future_self_came_to_you_right_now_with_a/",
        "score": 16211,
        "num_comments": 3868,
        "created_utc": 1656770510.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/vpsghv/if_your_future_self_came_to_you_right_now_with_a/",
        "comments": [
            "Wouldn't you like to know, this definitely isn't a ploy for the shapeshifters to infiltrate easier",
            "My brother and I have a very wired and totally unique secret handshake that we have never done in front of anyone.",
            "Which of these pictures does NOT contain a traffic light",
            "I’d ask him “What did we see in Florida when I walked into my dad’s room”\n\nIf he answers correctly and isn’t me, I’d be very interested how he managed to pull that answer out of his ass",
            "Psshhh I’d know my ugly ass when I see it.",
            "“Remember that time that guy on Reddit went fishing for security question answers?”",
            "Nice try of a social engineering attack to gain \"inside\" knowledge. Whom are you targetting?",
            "\"Name the participants of the forbidden threesome.\"",
            "[deleted]",
            "I do in fact have an identification protocol set up, but obviously if I explained it here it would be useless. Suffice to say, I'd be able to be sure.",
            "this is more of a r/askreddit question.",
            "I'd say fuck it, I'm bored with life. And just believe him.",
            "Have them unlock my phone via finger print",
            "I’d ask, “Ok, future boy. What was my biggest stupidest mistake in life?” If he doesn’t immediately say, “Going on that first date with my future 2nd wife after meeting her at a party just the night before,” I’d tell him to pound sand.",
            "What was you first \"wet dream\" about and who",
            "What are tomorrow's lottery numbers? If he didn't bring me winning lottery numbers from the future, he ain't me.",
            "I got this worked out and have a code word that way even if I gotta send someone else back in time I'll know to trust them",
            "Nice try impostor from the future",
            "I never realized that I don't have anything in place for this situation.... Now I'm going to have to come up with some security code or question....",
            "What's the name I use in my inner monologue for myself?",
            "I have one secret that I’ll take to the grave, it was a secret only my friend and I knew before she passed meaning it’s truly something only I would know.",
            "I'd ask them for the code i just thought off, since their me from the future, anything i think of now, they'll already know.",
            "I would change my phone code then say: “I just changed my unlock PIN code and I will be using it for some time. What is the code?” \nIf he is from the future, he should have lived through this, so he should be able to unlock my phone. Most probably wouldnt have forgotten it because I remember passwords I’ve used 10 years ago.\nThis gets more complicated if we think of different timelines where my code might be different, though.",
            "“What was his name?” I was molested by a family friend and to this day I’ve yet to ever tell anyone his name, or that it happened.",
            "How many bitches they have. If none it's future me",
            "What's our kink ?",
            "Recite all of the lyrics to “Albuquerque” by Weird Al",
            "It’s a question I wouldn’t even type on here",
            "...like I'm telling the internet...",
            "Considering the state of my mental health I'd be shocked there is a version of me from the future in the first place.",
            "What porn videos do you watch.",
            "During our childhood, how many lego mini fig heads could you/we stuff inside our foreskin without any of the yellow showing? \n\n6 is the answer.",
            "How much wood could a wood chuck chuck if a wood chuck could chuck wood chucks?",
            "what number are we thinking of right now?\n\ncorrect answer: 69 duuudes!!",
            "Nice try, timetraveller! But Only I know what I'll ask myself!",
            "I have a secret word that if ANYONE walked up to me and said it, i would 100% believe them",
            "[deleted]",
            "You know what I'm going to ask. What is the answer?",
            "What totally not important mid life crisis have I been having involving mass effect.",
            "What is the time loop password?",
            "\"yeah, you look like an older version of me, I believe it\".\n\nThat alone is hard enough to do. I'm familiar with my face. It's not special or anything, but I've never seen a real look-alike. Chances are higher that I'm from the future than they are that someone could pull that off just to prank me with a message.",
            "Can we have sex? If they says, \"you wish,\" so I can reply, \"bitch, you hope AND pray.\" I know it's me.",
            "They would have to tell me how we got the scar on our penis.",
            "I have a secret word. Only I know what that word is, I have never told anyone, and it's from a \"language\" I made up as a kid. There's no possible way anyone could ever know that word unless I was directly and knowingly involved.\n\nI also have a more common word that could be very subtly dropped in, and no one would know. It looks totally normal but is rarely used, and could be meaningful with the proper context.\n\nAnd yes, I 100% did this specifically in case of a time-travelling future-self.",
            "When I was in elementary school some narc of a classmate decided to point at me when the teacher asked who was talking in class. Several of us were talking, not just me! I wasn’t even talking loud! But it didn’t matter. I was unjustifiably punished and had to stay in detention after class.\n\nI thought to myself, “I’m going to remember this date so that if I ever discover time travel I can show up and save myself from this abuse!”\n\nSo yeah, I would just ask my so-called future self what date that was.",
            "What was your Id number in college. I have a very good memory with numbers. I never forget a birthday and I never forget my ID numbers",
            "first of all, wrong subreddit for this.\n\nsecondly, i’m not gonna say it here because that gives others the chance to use it against me and trick me, obviously.\n\nthirdly, i’d ask way more than one question.",
            "Call her a dumb bitch and see if she automatically turns and looks around before saying \"Shit! Mom's here too?!\"",
            "What were the names of the two trees you played at in elementary school?",
            "I’d tell him to paint the night sky with hazy clouds\n\nif he continues it, it’s really me",
            "Mother’s maiden name, first boyfriend and street I grew up on. DUH",
            "“What… is the air speed of an unladen swallow?”",
            "\"Why was the potato so small\" and the answer is arthritis if anyone was wondering",
            "what is a quesadilla? (pronounced quesadil-la)",
            "I would ask them to correctly identify which one of the following pictures contain motorcycles",
            "“*Do you remember the 21st night of September*”",
            "I would ask:   \n\n\nWhat is your quest?   \nWhat is your favorite color?   \n\n\nWhat is the terminal air speed velocity of an unladen European swallow?",
            "This person is clearly from the future and planning to impersonate our future selves so not tell him",
            "Oh I've got a secret code that I haven't told anyone that I don't believe anyone else would come up with, and I came up with it years ago. It's mainly for if someone told me they were in a groundhog day loop, then I would give them the code which they will tell me on the next loop, then I would believe them. I suppose I could use it to verify myself to myself as well.",
            "I will ask myself following question:  \n\n\"If we have Sex right now, - is it incest or masturbation?\"\n\nIf I get a laugh it isn't me. But hey, at least I'm gonna fuck a time traveller.",
            "What did you text your middle school soccer coach from your dads phjne",
            "I liked it better when this was a place of  genuine questions of experience from an understood position of harmless ignorance rather than the challenge for nonsense it has become.\nIt happened pretty quick too. I feel as though just the right amount of people found the sub recently not quite understanding the subtlety of the colloquialism and ran with the “stupid” part of it.\nThis used to be a place to ask genuine questions about life that you perhaps felt were so obvious to everyone else that it would feel odd or alienating to ask in person. That is why there is a strict understanding of being nice in this sub, because the questions are meant to be coming from a place of vulnerability. I could be wrong but I don’t think it was originally intended to be a playground for r/showerthoughts.",
            "How old am I?",
            "What's the magic password?",
            "I'd ask what's my favorite music genre",
            "Where did someone say to you “ Sorry, I thought that was someone else’s duck?”",
            "Its a trap!",
            "My biological father's middle name. No one would ever guess it.",
            "I've got a passcode and plan in place that my future self would know about, however revealing them here would render them pointless",
            "Nice try, secretly conscious Google AI.",
            "nice try future identity thief",
            "Touch him immediately and hope we both die",
            "I'd skip the questions and go straight to the bangin.",
            "wouldn’t you like to know weather boy.",
            "So I've had what I call a time-travel safeword for years just in case this happens. It's actually 2 separate phrases, depending on my degree of trust I want to give.\n\nOne that I will never tell anyone so that I will 100% know this is future me, no matter what physical changes happen.  \n\nThe other is one that I will give to a trusted person who is traveling back in time to meet up with past me. I would not 100% trust this person as if they were me, but enough to know that future me has vetted them and I should most likely listen to what they have to say.",
            "I made up a friend from america, made an account for him, and spoke to my friends as him cus they kept asking where all my new clothes came from and why i had so much money. I just didnt want to tell them i dealt drugs.\n\nI'd ask how old my friend from america was or somthing like that",
            "There wouldn't be 1 question. We would need to have a discussion and based on that, I'd see if he really is me or not."
        ]
    },
    {
        "post_id": "s30jvu",
        "author": "catxxxxxxxx1313",
        "title": "How famous were the twin towers before 911?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/s30jvu/how_famous_were_the_twin_towers_before_911/",
        "score": 16215,
        "num_comments": 2952,
        "created_utc": 1642083736.0,
        "selftext": "I was born late enough that I have no memory of them before that. How well known were they to the average American?",
        "permalink": "/r/NoStupidQuestions/comments/s30jvu/how_famous_were_the_twin_towers_before_911/",
        "comments": [
            "Pretty well known.     They were mentioned or referenced in tv shows set in New York fairly often.   \n\nThey were a tourist destination for many people visiting New York, since you could go up the top floors or near the top to see the view and there were restaurants and stuff up on the upper floors.",
            "Just New York Skyline Famous \n\nSo noticeable after the were gone. \n\nIt didnt look like the same city",
            "You couldn't look at the NYC skyline and NOT see them. I saw them in person as a kid a few times.",
            "I'm in my early 40s, for reference.\n\nThey were the tallest buildings in the world until the Sears tower was built. They were famous enough that in the 70s when they remade King Kong he climbed the WTC towers instead of Empire State.",
            "As a european they were synonimous with NY's skyline. \n\nLike the  Eiffel Tower means Paris, La Sagrada Familia means Barcelona or the Space Needle means Seattle.",
            "When I was in New York for New Year's Eve 2000, my then girlfriend and I made sure to visit the top of the South Tower the next day. To\n\nI often think about the people who were working on the top floor observatory and wondering if they were there on the day the building collapsed.\n\nThe funny thing is, if I say I hope not, then that's just saying I wish somebody else was there to die, when, I would have hoped there was nobody there.",
            "Not as famous as the Statue of Liberty, more famous than the Rockefeller Centre",
            "Pretty much any show or movie set in NY would have them in the skyline somewhere during the show or in the beginning. I was 15 when they fell and had never heard of them, but my parents had.",
            "Famous enough that when The Simpsons visited New York, it’s one of the places they feature (along with the Statue of Liberty, Broadway, and the Empire State Building).\n\nOne other thing to point out is that in addition to being a global financial centre and a major feature of the New York skyline, they were also the site of an earlier terrorist attack, a truck bombing in 1993, that had also garnered major world attention.",
            "Very well known, as the tallest buildings in the largest city in the country.\n\nThey had been iconic for years. Photos of downtown almost always were taken from an angle to highlight the WTC. For many people who don't live in the area, the towers really started to enter the public consciousness in 1976 when King Kong climbed them in [that year's remake](https://en.wikipedia.org/wiki/King_Kong_\\(1976_film\\)#/media/File:King_kong_1976_movie_poster.jpg) of the classic movie.",
            "Famous enough that a Frenchman traveled here just to illegally string a tightrope between them and walk on it.",
            "Proof is in the pudding. Famous enough to plan an attack and die for. They didn’t hit a random building.",
            "You know how the Statue of Liberty is almost on everything NYC related? It used to be the Statue and the Twin Tower on everything. It's on par with The Empire State Building and Times Square. \n\nIt was a symbol and popular enough to be the target for a terrorist attack twice. It was the financial symbol of the US that the terrorist attacked, along with the military/defense symbol in the Pentagon and the leadership/government symbol by targeting the White House or Capitol Building",
            "There are a large number of movies that my grandmother cannot watch anymore because they feature shots of new York looking over the shoulder of the statue of liberty, and center on the twin towers. They were iconic. \n\nSpiderman released a game in 2001 that was delayed to remove the towers from it because they featured in the design of the city. \n\nJust a few references.",
            "Pretty well known, from what I can tell. An Animorphs book (bear in mind, they were written in the 1990s) even presented a vision of the future where they were the only part of the New York City skyline which was still recognizable.",
            "Every single picture, movie, show etc about New York had them. They were iconic.",
            "Iconic. They were not only a symbol of New York but America.",
            "A lot of people here are right that the towers were famous as an attraction, but get the reasoning for them being targeted on 9/11 wrong.  The towers were home to some of Wall Streets biggest names and chosen as a symbol of American capitalism.  It was more to do with money in the hopes of crippling the economy by taking out Wall Street.",
            "I'm currently watching the series \"Friends\" for the first time.  Pretty much every episode for 8  seasons has a quick scene with a skyline of New York City which include the towers. Then after season 8 it just suddenly stops.  About half a dozen episodes pass and then it starts up again but the towers are gone. It's just so strange because you know what happened and for the episodes without the towers they peppered in easter eggs like new NYFD shirts or \"united we stand\" on a chalkboard, etc.",
            "Wow...your perfectly-valid question just made me feel sad and old. Imagine being asked: \"Is it true that there once was once an immense, green statue of a lady holding a torch in New York Harbor?",
            "Very. I grew up in rural Maine in the early to mid 90s and knew about them as an iconic New York symbol even then.  One of my first diary entries ever, from a trip my family took when I was about 6, depicts me and my family looking out from the top of one of the WTC towers. I drew an illustration and everything.",
            "They were as synonymous with New York City as the Statue of Liberty, better recognized than the Empire State Building.  Maybe even more so, since the Statue of Liberty has broader connotations of the United States more generally while the World Trade Center was specifically a reference to New York City.  If any TV show or movie needed a quick establishing shot of New York City, nine times out of ten they’d show the twin towers in that shot.",
            "World famous",
            "For perspective, they were so well known and literally iconic that not only would every American recognize them, but a terrorist group from the Middle East chose them as the symbol of America and Capitalism to attack and level in the largest and most devastating terrorist attack in American history.",
            "Pretty famous. About as famous as say, the Gherkin in London. Not everyone knows it by name but you can’t miss it on the skyline when the city is on TV.",
            "They were pretty iconic for the area. Think like eiffel tower in paris or statue of liberty. A big landmark.",
            "In the 70s and 80s the twin towers were basically a synecdoche for NYC in movies and TV in the way that the Empire State Building was 30 years earlier",
            "9/11 was not the first time the towers were attacked. The first time was in Feb of 1993. The attack injured thousands and sadly 6 lost their lives.  I always think of the Biggie lyric in his song , “Juicy” it goes, “Time to get paid, blow up like the world trade, born sinner…” I always wonder if anyone had been genuinely confused by the song. Because he absolutely not trying to have a take on geopolitical issues - just a really talented lyricist / rapper and artist.",
            "The World Trade Center was arguably the center of Western global economic power at the time. They were the tallest buildings in the world at completion, and were as much a part of the New York skyline as the Empire State Building. When the world thought of America's wealth and reach, the Twin Towers were the image that arose. I went up to the observation deck of one of them in 1990, on a class trip. I'd never flown at that point, and it was the highest I had ever been. I guess you could say that they were famous enough to change the world when they were destroyed.",
            "The average American would know what they were if shown a picture of them, and would know that “the twin towers” are those two big boring buildings (they were impressive and huge but c’mon… they were just rectangular blocks compared to other buildings) in New York.",
            "I was 18 and when I heard a plane had crashed into the World Trade Center, I didn't know what that was.\n\nThat said, they were the standard shot in TV and movies establishing that the show happened in New York City.",
            "Non American here, I knew that the twin towers existed the day they fall",
            "Pretty well known, if you ever saw the NYC skyline they were unmistakable, and they were positively gargantuan if you were anywhere close to them. That is one thing that people tend to forget, they were really imposing structures. The one now is pretty imposing but there were two of the old ones! You knew you were approaching something special.",
            "There was that episode of The Simpsons where they go to New York to get Homer's car back, which is illegally parked outside the Twin Towers. Homer has to per so runs to the top of one tower, finds it closed, then runs to the top of the other tower, then his car gets another ticket.\n\nAfter the attacks, I probably didn't see that episode again for about a decade",
            "As a Swede I saw them for the first time in the Simpsons",
            "I feel like the comments are downplaying it? I thought it was top3 most famous building(s) in the world. Tallest building in the world, but it also being in NY kinda automatically gets you that spot. And I'm European so no local bias.",
            "You couldn’t picture the skyline of NY city without them there, seeing them behind the Statue of Liberty was an iconic image for decades.",
            "One of the Tobey Maguire spiderman movies had a trailer with them in it. He stopped a helicopter with a web  between them and it was the iconic shot of the trailer. Most shows and movies set in new York had them in tons of B-roll. They were always there until you realized they weren't. \n\n[The trailer was pulled from airing for obvious reasons.](https://youtu.be/Ozz8uxW733Q)",
            "You see them in the background of Friends intro. I lived down there for a while, walked into to get the subway. Buildings change. Suddenly a safety awning is taken away and the world seems open. If you go back to a neighborhood you haven’t been to in a while everything changes. The towers were a reference, when I got out of the subway, that was south. Now it’s a different building. That whole area is different. When you get older things seem to change more. Life goes faster. You can feel the impermanence in your body. I read Pynchon’s Bleeding Edge the other day and I realized that I hadn’t really processed the experience much. I remember the smell. Everyone awed at the heroism, the horror and the oily politicians trying to rub some good on themselves. So many stories. The Pearl Harbor of my time.",
            "Home Alone 2 famous, Simpson famous (that whole episode of Homer going to NYC and his car is stuck in middle of twin towers) lol",
            "Iconic. When you visited NYC,  you saw them.",
            "Law & Order showed the Towers as the theme song played until 9/11 happened then they were removed. Just about any show and movie filmed in New York had them.\n\nAn example would be on the DVD of Home Alone 2, Kevin can be seen standing in front of the buildings then again on the roof as a tourist... but out of respect for those who lost their lives (not including the hijackers) on 9/11, that scene was removed from the TV version. A lot of TV shows and movies have done the same. \n\nBut yes, they're iconic/popular and I think even though it's been 20+ years since 9/11, they're always going to be well-known.",
            "The twin towers were almost synonymous with New York City. In movies, photos, books, etc if they were included somehow you would immediately have a sense of place even without mentioning the character was in New York, even if you knew next to nothing about the US you knew the WTC and the Twin Towers. They say over 400 movies featured the Twin Towers in some way.\n\nI see lots of posts here with people trivializing them as just big block buildings, or not that important until after 9/11, you guys are just wrong or you are trolling. If you lived in the tri state area, when those buildings came down it was like someone ripped our collective beating hearts out of our chests. They were two buildings out of a larger grouping known as the World Trade Center, but most people really wouldn't bother recognizing all the other buildings, even after 9/11. No offense to anyone who lost anybody in WTC 7, but the other buildings were not recognizable or iconic, capturing the hearts and minds of the world. After all, at one point they were the tallest buildings in the world.\n\nSome people are comparing the twin towers to the Eiffel Tower, or the Statue of Liberty, etc while that might be good comparisons, the problem is they are more meaningful than that. Yes Eiffel Tower and Statue of Liberty are iconic, meaningful symbols of the US or France, but WTC was a symbol of US economic power and greatness. Tons of people worked in those buildings, television was broadcast off the top of those buildings, they represented the massive success of America. Yes the Statue of Liberty represents the promise of freedom connected with coming to America or being American. But it is hard to imagine the magnitude, importance, sheer size and volume of these towers without being there, looking out your bedroom window to see them every day, having friends and family going to work in them every day, without understanding the real attraction and importance of NYC overall.\n\nAlso recall they were attacked in 1993 as well as 2001, and after 1993 the political / cultural significance of the WTC definitely increased, we talk about \"never forget\" in terms of 9/11, but those of us who live(d) in the NYC Metro area do not forget 1993 either, and the sense of community which grew surrounding those attacks as well. \n\nI tell you nobody really cares about the new One WTC/Freedom Tower, there just isn't the same emotional attachment to it as the Twin Towers, and I doubt there ever will be. Trump started gaining popularity way before his presidential run when he opined that the twin towers should be rebuilt exactly as before, except with one more floor, just to stick it to \"the terrorists\" and the world. That's really symbolic of the NYC attitude and mindset, and unless you've really been part of that world it's hard to get.",
            "I knew them by photos, but not really by name as much.",
            "They were well known and prominent, but not big tourist attractions.  They were just big, ugly buildings that dominated the skyline.\n\nThe Empire State Building has been the big tourist attraction in NYC since it went up.  Even if it wasn't the tallest, it was a lot prettier and more famous.\n\nThey didn't meet at the top of the World Trade Center in Sleepless in Seattle.",
            "Anyone else who didn't live or visit New York is lying. NO FUCKING BODY KNEW OR CARED beyond it just being a tall building. Was only famous for being in the very beginning of sky scrapper history. But the fact you didn't say their actual names. You know. WORLD TRADE CENTERS. Exposes how much they were cared about outside newyork. It was only sad because a giant structure we mad symbolic with strength and safety was demolished.",
            "I'm going to be honest.  I was an adult who lived most of my life in Arizona at the time, and I had no idea what they were.",
            "New York without the twin towers is like Paris without the Eifel tower, SF without the golden gate bridge or London without big ben and so on.",
            "I'm blown away at how different my opinion is compared to most of the other comments. \nI was about 17 and lived in NJ when the towers fell. In my opinion the twin towers were the most famous buildings in the united states. The tallest buildings in the most famous city in the world- and there were two of them. Along with the statue of liberty, they were the highlight of the NYC skyline. Every movie\\show taking place in NYC featured them in a shot. They were beautiful and projected power. The tower that replaced them, although beautiful in its own right, does not even come close.",
            "i was 13 and didnt know what they were until that day. i had seen them, i knew they were some iconic buildings, but never knew really what they were outside of a few tangential references",
            "The first spiderman trailer had him swinging between the towers, they had to cut that from the movie for obvious reasons",
            "That’s actually part of the 9/11 memorial museum, there’s a section with news and advertisements and tv shows, etc that featured or mentioned the twin towers.",
            "Very famous, made more so by the piece of guerrilla art where a man illegally tight rope walked between them (if you're interested there's a documentary movie called *Man on Wire*). I was 10 when they came down and living in rural England and I'd heard of them.",
            "Outside of popular culture, it was a very important landmark for finance, since it was close to the NY stock exchange and housed mostly financial and finance service firms. With NY being the center of the financial firm, even more then then today.",
            "Slightly off topic  but if you're interested I recommend watching [Man On Wire](https://www.imdb.com/title/tt1155592/) (2008) about French high-wire walker Philippe Petit who illegally wire-walked between the Twin Towers just as they were nearing completion in 1974.\n\nThen watch [The Walk](https://www.imdb.com/title/tt3488710/) (2015), the dramatization of Petit's achievement",
            "I was in high school in Ohio - I had no idea what they were before 9-11. I had never been to NYC at that age. The Empire State building was probably a more familiar landmark. The towers were frequently shown in movies in establishing shots of NYC, though that was something I only noticed later.",
            "There used to be a pretty pricey restaurant at the top called windows of the world. I mean touch screens in the 90s and as fancy as it could get. \n\nI'd think it was pretty \"famous\". It was a massive business building/monument not a just monumental building. \nNow it's just a monument. \n\nSad. \n\n\nRIP 9/11 victims.",
            "I have been to NY once. Went up one of the towers (there was an observation floor for tourism). Also went to the Empire state bldg and Statue of Liberty on that trip. The twin towers were famous as a destination. \n\nYou know how movies show a skyline of the city they supposedly take place in? It was a key identifier. When you saw those twin towers at the start of a movie, you knew it was NYC. Sadly, right after the attacks many movies were altered to remove the twin towers or change the scene outright.\n\nThere were 4 planes used. The terrorists went for what they believed were the best American targets. They chose the White House, the Pentagon, and 2 WTC buildings. I'm sure they spent a lot of time thinking and rethinking their targets. Yeah, the WTC buildings were pretty famous on the world scene.",
            "It wasn't really something that we talked about at all, but you'd see them on tv and stuff.",
            "I was born and raised in Southern California and the planes hit when I was 12 years old. I knew exactly what they were and where they were. \n\nThe Twin Towers AKA The World Trade Center was in fact, world famous. Just watch any NY based movie pre-2001. The Twin Towers are almost always present in some fashion in some kind of flyover as the backdrop. \n\nThe Twin Towers maybe weren't as famous as the Empire State Building, but they were close.",
            "I lived in NYC for 40 years from late 70’s to a couple years ago.   They were incredibly prominent, anchored the area.   It was a big fucking deal",
            "As a NYer, the towers were a landmark that could easily be seen anywhere within the 5 boroughs and in parts of NJ. \n\nYou could get off the train (usually by climbing to street level from underground) and quickly get your bearings by looking for the towers. \n\nThat’s the part I miss the most. \n\nI watched the towers fall from the furthest point in Brooklyn (Mill Basin) - there are further points but not really residential. I could see the towers while kayaking in Jamaica Bay. Driving from JFK airport or from Long Island there was a part of the highway in Brooklyn where it suddenly comes into view. \n\nThere’s was nothing more exciting for me to be driving in New Jersey and hit that point on the highway (or driving across the GWB) where lower Manhattan and the Towers suddenly came into view - because it meant you were almost home. \n\nYou can still see the city at those points but my brain always goes to “it’s missing.”\n\nAlso consider the pop culture references. \n\nDuring the King Kong remake, Kong climbs the Twin Towers and not the Empire State Building. \n\nThere was supposed to be a scene in a Spider-Man film where he catches a helicopter in a web spun across the two towers. \n\nhttps://youtu.be/yzha4kUowf4",
            "Iconic. The Manhattan skyline with the Twin Towers was one of 4-5 standard establishing shots for movies set in NYC for about 30 years.",
            "I was 11 and I'm from the UK but I had never heard of them.",
            "They weren't. That was their big break",
            "Brit here. I was 18 when 9/11 happened.\n\nI knew that there was a building called the World Trade Centre in New York and I remember news of the 1993 bombing, but I wouldn't have been able to pick it out on a photo of the Manhattan skyline. In fact I was surprised to learn that the WTC consisted of two separate towers. I only found this out when the 9/11 attack took place. What I previously thought was the WTC was actually the UN building.\n\nThis is just my own experience as a non American. I never really took an interest in New York buildings. I didn't know that the Chrysler building and the Empire State were two different buildings until I was in my mid twenties.",
            "Good question. From the answers in here, I agree that most of the US got to know them through Hollywood after 1973. Ex: The opening scene of Barney Miller, Men in Black, Home Alone, The Butchers Wife...etc. There are more than I can remember. As someone who toured the towers before they opened and worked in them almost until the first bombing in the underground parking lot. I wept on that day for the lives and the memories.\n\nHere is something I haven't read in here. If you worked in or visited the streets of Manhattan, you could always use the twin towers as your landmark for direction as they could be seen from any street, certainly Central Park South and below. Also, there was a television transmission antenna on the north tower that (in the day) if you aimed your TV antenna at it from anywhere in the city, you had perfect reception. The towers provided so much office space, they were never fully occupied in their history. Rest in Peace, WTC."
        ]
    },
    {
        "post_id": "ptcats",
        "author": "MercSapient",
        "title": "Meth isn’t a “cool” drug, so why do people try it?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ptcats/meth_isnt_a_cool_drug_so_why_do_people_try_it/",
        "score": 16167,
        "num_comments": 2817,
        "created_utc": 1632331177.0,
        "selftext": "Something I don’t understand about meth addiction is how people end up trying it in the first place. Other drugs I do sort of understand. They have a certain mystique or romanticism. Marijuana has the laid-back Cheech and Chong vibe, ecstasy and cocaine are associated with partying and having a good time, and even heroin has a certain dark allure to it. But meth has none of that. From a pop culture perspective, its associated with the homeless, prostitutes, and gangsters. For most people, these are NOT appealing things to be. So what compels someone to decide to try such an “uncool” drug?",
        "permalink": "/r/NoStupidQuestions/comments/ptcats/meth_isnt_a_cool_drug_so_why_do_people_try_it/",
        "comments": [
            "I started doing meth because I was already doing heroin. I started doing heroin because I got addicted to pain pills and heroin was cheaper. I'll have five years clean in October.",
            "I started because it was available prevalent and cheap. A guy gave me a line. Turned into the worst 4 years of my life.",
            "You're depressed, alone, and you struggle daily just to get out of bed.  Meth?  Sure, why not it can't get much worse!  You feel alive for the first time in years!  You have energy to actually clean your apartment and shower for the first time in days and maybe do some projects you have had wanted to complete.  You have new self confidence and without sleep you are getting so much done.  You start losing weight and things are actually looking up for you.  Nobody told you that the magic is short lived and before you know it you're right back into that rut of depression but only now you have an expensive habit that does little more for you than daily coffee.",
            "Because you can get really high for like 3 days for 10 dollars, it’s a poor persons drug",
            "My mom, speaking from experience, always said:\n\n\"If you think *drugs* are bad, just imagine how bad it already is in the person's head or in their life, that make drugs the *better* option.\"\n\nIt might be kind of a \"duh\" thing, but it really hit me as a kid. People seek relief in drugs. Whatever they're experiencing in the moment makes the consequences of that drug a moot point.\n\nFor my mom, the drugs were the only way to escape the pain of childhood sexual abuse. It didn't matter to her that they were making her sick or putting her in a toxic crowd or taking her money or anything else. It stopped the pain *right now*.\n\n(of course, she eventually got clean and found MUCH more lasting relief from therapy, supportive and loving friends, etc- which is always the better path. But some people don't have access to that yet or aren't in a place to accept it)",
            "It's cheap, easy to find, and makes you feel really damn good while you're high.",
            "Because it makes you feel like God and fuck like a pornstar. \n\nSex on meth is more addictive than the drug ever thought about being. \n\nIt takes months to get the balance back in the feel good hormones in your body. \n\nYour teeth never come back\n\nThe stupid shit you do while gakked out burns in your brain and haunts you for years. \n\nYou start of doing it for reasons. Then it turns you into a shell of a human. The lucky ones die and aren't haunted by the memories and the urges to once again ruin your life. \n\nI've struggled for years. This time around I'm more angry and resistant than I have ever been in 6 years. \n\nTake it from me. It's not worth it.\n\nEdit: word\n\nDrugs effect everyone different.",
            "sloppy wrong joke nail chop versed station seemly divide snatch\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "It's one that you just eventually end up somewhere you shouldn't be and it's offered and then one thing leads to another. And/or you cannot get what you want and in desperation let curiosity win because- start at beginning.",
            "People don't do it to be cool. They do it because it gets them high",
            "It’s naive to think that most people do drugs to look cool. People do drugs because drugs feel incredibly good, and they get addicted because it’s hard to choose to not feel incredibly good.",
            "Basically because people tend to take drugs in order to feel better. They’re in a bad place, they’re unhappy, their life sucks and they want some kind of escape. But drugs can be really expensive. Meth meets both criteria. It gets you high and makes you feel good and forget your problems and it’s relatively easy to make and is comparatively cheap",
            "I tried it when I was a teenager but i didn't really get how bad it was, to clarify I never did it again luckily, back then there wasn't these huge ad campaigns explaining the dangers of meth except dare and they really didn't villifiy it as bad, I have since seen friends really struggle with addiction to it so I wouldn't touch it ever again.",
            "Because your coke dealer \"doesn't have\" any coke when you want it but he has this way stronger, way longer lasting and way cheaper alternative",
            "Someone described it to me once.\n\nHe said to imagine the best you could possibly feel and the worst you could possibly feel.  We'll label the best as 10 and the worst as 0.  He said that his first time doing Meth created a new range, the scale now went up to 20.  Now, there's the best you can possibly feel, then there's the best you can possibly feel while on meth above that, and even the worst you could feel on meth was usually better than the best you could feel when you aren't on meth.",
            "People don't do drugs for image, they do them to feel good. The pop culture image is supposed to disuade people away from it, but it will never be 100% successful because at some point someone will need to mention what the drug actually does and at least a few people will be interested.",
            "Many reasons why, Ignorance was mine, my cousins introduced me to cocaine while I was drunk; I was so naive and only 21 years old;I loved it! My life went down hill from there.\nI did cocaine. Meth, crack(which it’s the devil) pot, combined them all sometimes, it fucked me up.\nLife was never the same after that.\nI’m 58 now; I have been sober for years now.\nNonetheless; my mind was never the same.\nBoth of my cousins are dead now, one was drunk riding a motorcycle, the other one got a stroke from snoring Meth.\nMy life is so much better now, 4 wonderful daughters, 3 beautiful grandchildren, I am at peace with my past; I buried it long ago, my point is; one bad choice can change your life and the people you love.\nAlcohol and drugs are not okay, don’t start you never \nknow how it will change your life.\nRemember; you only have one to live.\nHopefully this short story will help someone not start or stop if they are already using.",
            "[deleted]",
            "Easiest drug to find, was at a low point living on the streets and was severely depressed. One night hit ends with myself, found myself going to the bad part of the downtown. Walked up and stood in the middle of a block, a man walked up 30 seconds later and asked “you looking for anything?” Replied ya, need some clear, 10 minutes later lines were being chopped on my iPhone. Ended up in the hospital fighting 5 nurses/security gaurd’s because I thought people were chasing me, and that the nurses were going to harm me in some way. Woke up handcuffed by feet/legs to a hospital bed. Worst experience of my life. Got my shit together the day after, and been doing good since. At least with Cocaine you can say “coke is one hell of a drug”. All I can say about Meth is “clear is fear”.",
            "I did meth because my dealer ran out of everything else. I'd just lost my daughter and had only recently become a user of anything and had stuck to using downers but at the time, meth felt like a better idea than the numbness of sobriety. I just said fuck it. It was the most incredible rush of my life and knew immediately that I needed to not be a daily user because I would absolutely choose to feel that way every possible second of my life. I was happy, energized, focused, buzzing, dizzy and horny. I hadn't felt any of those things in a long time. As a bonus, it helped me control my weight while I was struggling with anorexia. I used off and on for 5 years and have been clean for about 7.",
            "Because it works. I’ve never done it, but that’s the best I can tell. I think for early users snorting/taking orally it’s not all that much different from coke/mdma early on.\n\nThe main advantage is it lasts much longer. If you’ve done any coke/mdma benders, you can see the advantage of something that just works for hours. I think a lot of people switch or pick it up that way.\n\nPeople that go straight to meth are probably desperate for something, or have a bit of a death wish, and don’t care about their safety. I’d argue there can be a similar, but distinct allure to meth for the same reasons you listed.\n\nYou should take what I said with a grain of salt, because I have no experience here, and don’t think I’ve even seen it. There’s a lot of smaller “refer madness” misinformation campaigns even for dangerous drugs.",
            "It's a dangerous evil drug. I tried it at art school as I moved out at 16, was working to afford a crappt bedsit while trying to study while working late nights in a kitchen.  Its certainly cheaper than coke and has a hell of a kick. It's also very addictive, mentally if not physically.",
            "[deleted]",
            "Because it gets the job done",
            "To escape . To go numb. To make mediocrity  of your life tolerable. To not sleep. To lose weight. To give you some energy when you have nothing left to give.  Before a workout.  Before sex. To help you concentrate when you're studying. To get going into morning.  To cover up the fact that the job you have isn't going anywhere.  To forget that you don't really matter...... Oh and to help you deal with the fact that the fucking wifi doesn't work even though you are right next to the router.",
            "Addicts aren't in it for the glamour. There's a fucked up part of them that compels them. While they may tell themselves that they are just \"partying\" while they do lines of coke, the fact is that they are fucking their lives over.\n\nThey don't wanna \"look cool\", they just wanna get high to medicate whatever raw nerve is in pain. There's a reason alcoholics will get drunk on the cheapest, paint-strippingest turpentine of a hooch, and street kids will huff glue.\n\nMeth is way cheaper than other drugs and more readily available. Doesn't even have to be pure or a fancy blue color. Addicts will get their high.",
            "Most of my family does it regularly so i was obviously curious. Only did it once and had the worst experience of my life.But I could see why my family likes it so honestly for me it was some kind of morbid closure",
            "My dealer showed up with meth instead of the coke I wanted and I wasn't about to wait another day or two to party. Turned out I liked it a LOT more than coke.",
            "Because some people don't try things because they are \"cool.\" They try them because they are curious",
            "Because no one who actually uses drugs does it for some sort of imagery, they do it because they wanna get high. And if you're someone who enjoys being sped up and just a little bit schiz, meth achieves that.",
            "Kids do drugs that are “cool”, adults use drugs that are effective",
            "Watch the Netflix docuseries \"How to Fix a Drug Scandal,\" and that will tell you everything you need to know. Coming from someone who has experience with someone close to them battling meth addiction, I think they did a pretty good job breaking it down for the audience. \n\n\n\"Generally, meth is one of the easiest drugs to become addicted to. This is due to meth’s effects on the brain. Meth creates an intense but brief “flash” or “rush” that can be connected to dopamine in the brain. Dopamine is the “feel-good” chemical responsible for elevated moods, and meth heightens dopamine to unnatural, euphoric levels.\" \n\n\n\nAlso humans are fucking stupid, so there's that...",
            "Because *Breaking Bad* was S tier television. /s",
            "So. I tried it twice. My best friend kind of pushed me into it (not an excuse) and I agreed. After being high, and on no sleep for 4 days, I decided it was the most evil drug out there. I was manic, anxious to the point of almost pulling my hair out… it was rough. That was about 11 years ago, and never ever again. The BFF who turned me onto it are not friends anymore, but she is sober. So that’s good.",
            "I started meth when the girl I was hanging out with brought it around and it was what was available and said fuck it. My meth addiction eventually lead to a heroin addiction. Wasn’t worth it. I never enjoyed when I was high on meth , shit sucked",
            "People don't do drugs to feel good, they do them to feel less bad.",
            "My cousin is a former addict. He describes the high as feeling “invincible” or feeling “like a superhero.” \n\nI personally feel bad for those who get hooked on it. It seems like a very destructive and damaging drug that makes people engage in a lot of anti-social, inconsiderate, and selfish behavior. \n\nI find the users in my city frustrating to no end, but I understand that the root behind much of it could be any number of things from poverty to mental illness to abuse to wanting to be socially accepted by friends or all of the above. It’s a terrible, terrible life choice that I wish people would stop making.\n\nIt’s bad for them and it’s bad for society.",
            "After reading through some comments, I think I got a good answer:  \nMeth isn't a gateway drug.  You start out with the sexier drugs, but those often come with a premium.  So you eventually find yourself looking for a high, but you can't afford the \"good stuff.\"  Enter meth.",
            "Earlier addict of junkie-drugs here (Rivotril) 🖐. You need to understand that for the most part, what's making people do drugs like this are motivated by stuff like anxiety and depression. My motivation and absolute truth was that I'd reached a point in my life with 2 choices; massively self-harm and commit suicide *OR* I could begin maintaining myself with  heavy drugs something that was crucial for my survival at that point. The thing is though... and here comes the important part:\n\n**Most of us do it because we've entered an evil downwards spiral towards suicidality and the only way to slow down the spiral (not stop it! Only way to stop it and reverse it is by getting prof help) is by taking heavy drugs and accepting what the street offers us. *Every* single current and earlier addict I've ever met, including myself did it because of this reason and this reason only. I've never heard anyone say the sterotypical \"Oh, I was curious and I was offered so I tried it and now I'm an addict:\". There are almost always underlying reasons behind why people choose to do taboo drugs and what's \"cool\" or not is extremely irrelevant.**\n\nI hope that answered your question! 😄",
            "I always associated it with bikers and truckers and other white trash, but that's not the whole story. \n\nSpeed has been popular for a long time among many professions where there are insane deadlines or require unstoppable maintained focus. Bikers make long drug and gun runs on their motorcycles at night, and long haul truckers have to focus on nothing but lines for days upon days, but architectural drafters push through dozens of pages of changes and revisions with short turn around expectations, dancers have to learn new choreography constantly and maintain body weight on the road, house moms need to get a crazy amount of things done to be super mom. Law researchers, programmers, students, live sound techs for concerts, overnight anything... \n\nI hate that drug. I've tried a bunch of different things and never got hooked. But, knowing that level of concentration was possible but not maintainable is a cruel reality. It haunts me to know... it's like adding 30 IQ points for 4-6 hours with a complete sense of love for everything simultaneously... maybe it just amplifies what you feel already like turning the volume up on life. It's not to be underestimated. It takes over people, because it's such a good thing for a short while. It's like living your best mental version of yourself, but leaves you wrecked like a race car afterwards. Anytime the cure to the problem, is more of the problem causing cure, it creates a devastating feedback loop.\n\nTL;DR\nMeth is like plugging your brain in vs running on battery.  Not to be fucked with. Professionals beware.",
            "If I understand correctly, while it's not the same for everyone, a lot of the time it's like this:  \n\nI am in a position where I need to work a labor-intensive job for minimal pay  \n\nthe more time I spend working, the more money I make  \nwith some of that money, I can buy meth, and not only work longer but be high as fuck while I do it  \n\nrepeat until it doesn't work anymore, but you're addicted \n\nso you need to smoke just to keep 'an even keel', and then soon you're addicted to opiates becase you injured yourself on the job and were prescribed them.   \n\nyou lose your prescription, you're still in pain, and you need to work  \n\nyou start doing illegal opiates, for the pain, and meth for the energy  \n\nrepeat until you die, partway between daddy capitalism already sent a few new generations down your path so you'll be replaced when you're a worn out cog.   \n\n\nit's what's called the american dream.\n\nEdit:formatting",
            "I had a coworker I worked with that overcame her meth addiction of 4+ years. One day she was telling me all the crazy stuff in the past that did while she was high on meth. I asked her what lead her to try meth in the first place and what did it feel like when you did try it? She told me she had been in a car accident and hurt her back. She was experiencing severe back pain for months on end and *unsurprisingly* her doctor had over prescribed her pain pills. She said the day came when the doctor wouldn’t refill her pain pills and that she was in excruciating pain. Her boyfriend had been doing meth for some time but she wouldn’t ever partake with him. He had never pressured or even ask her to do it with him. He would do it in another room away from her. After her pain pills ran out, her bf said that the meth would take all her pain away if she didn’t want to hurt anymore. She thought trying it once couldn’t cause her to become addicted to it. But she was wrong. She said it felt like when you go over a big drop on a roller coaster and you feel butterflies in your stomach. And then it feels like a warm bath covering every inch of your body as all your troubles seem to disappear. You just feel high on life. But you never feel the same high as you do that first time. Which is why it’s so addictive. It took her losing everything in her life and becoming a convicted felon to get clean. But I am so proud of the person she is and that she overcame that dark period in her life. It is never too late to turn your life around.",
            "Meth is the Denny's of drugs. \n\nYou don't \"plan\" on going to Denny's. You \"end up\" at Denny's because it's there and you're hungry.",
            "Meth makes you feel like a God. If you have any type of pre-existing mental illness, particularly personality disorders, it gives you everything you ever wanted: confidence, sex appeal, wisdom, the best and most compelling words, motivation, readiness. It'll make you say yes to anything mildly appealing to you... things you've subconsciously denied yourself from (most likely wisely). This lasts until you've experienced all the good it can bring, and that happens very quickly after you first consume it. From there, it's definitely a quick fall but it still tricks you into being excited about the world of good it can bring to you. Basically, from the minute you try it to the minute you hate yourself because of it, it treats you well. Once you've introduced yourself, you feel like its slave. Even after the romance wears off you want it. Meth is the partner, the parent, the person you always wanted to be.  It seduces you quickly and lets you hang on until you're all out. So, in short, meth gives you an insanely good feeling and then you're all out of happy juices so you fall and crash only to realize you've burned all your bridges and spent all your casino money.",
            ">how people end up trying it in the first place. \n\nI can only offer an anecdotal story, but my ex got laced when she was offered weed. She was smoking out of a bong with an arab man twice her age, and hes like \"here try this\" without telling her what he put in. Next thing you know shes smoking meth. Then its \"try snorting it, its better\" and then \"try injecting it, it's better.\"",
            "In a nutshell, there are a bunch of different reasons people try drugs, other than allure or cool factors.\n\n1. Their friends are doing it, and they want to belong.\n2. They want to get high to get away from other problems.\n3. They intend to have sex, and drugs+sex is a really fun combination.\n4. They'd rather do something else, but couldn't find it.\n5. They'd rather do something else, but couldn't afford it.\n\nFor meth in particular though, my experience with tweekers has been that for every one guy who maybe works regularly and does it a couple times a year for fun, but still has his shit generally together, there are at least 1000 tweekers who are falling apart, both metaphorically and literally (teeth coming out and gross stuff), who believe themselves to still be functional even though they most definitely are not.\n\n1-800-662-4357 is the number for the Substance Abuse and Mental Health Services Hotline (US, open 24/7/365). If you have any question in your mind whether or not you should call that number, you absolutely should. It isn't too late. People do still care about you, even some who keep you at arms length to protect themselves. You deserve to be healthy and happy, and you can do this.",
            "Well, if you do all though other drugs enough, they won't really do anything for you. Your body gets use to it.\n\nPersonally, I think people do meth because they're desperate to get a good high after doing everything else. But at that point you'd be going too far",
            "for the ability to fight an entire neighborhood at once.",
            "The DARE program really did a number on you if you think the only possible motivation to do drugs is to look cool. \n\nI have never been motivated to do meth, but I would imagine the biggest motivator is just \"to get high.\" I'm not sure you're quite thinking like a drug addict if your only argument is \"there are *cooler* ways to get high.\"\n\nEdit: specifically, socially. If you think \"other people will think I'm cool for doing drugs\" that's really not the motivation.",
            "People do meth to gain superpowers like beating their meat while simultaneously fending off 10 cops at the same time. One handed 💯",
            "People try meth mostly because they are experienced with prescription amphetamines, like adderall, vyvanse, ritalin, etc. and want something that is cheaper with more intense effects. Win win, right?\n\nMeth is almost as cheap as dirt nowadays and readily available, so why buy expensive harder-to-find prescription drugs second hand? And once you try it, it takes hold like no other drug I’ve ever experienced. It’s honestly the only drug I would tell someone to not try, even once.",
            "Blue collar physical labor is very exhausting and they work you like a rented mule.\n\nIf you don't do blue collar work and never have, you can't understand.\n\n&#x200B;\n\nIt's usually set up like you \\*can't\\* survive on a standard 40 at your pay grade, so 50-60 hours is a lot more common.  No man past 30 has enough energy to give 50-60 hours of hard physical work to an employer naturally.\n\nAll things considered, meth is very cheap and is by far the longest lived stimulant.  One dose has you running at triple speed and overjoyed....  BUT one hit or line too much and you feel like your heart is gonna burst, you have a thundering headache, and you can't sleep at all for 24 hours.  It's really hard to find the sweet spot sometimes.\n\n100 bucks a week can usually keep a seasoned meth head happy and that comes out far cheaper than most hard drugs.\n\n&#x200B;\n\nDo I approve?  Fuck no.  I personally hate the sensation despite trying it a few times.    And if you're in a such a situation where meth is required to deal with your hard physical workload, you're being exploited and should quit your job.  Even if meth is keeping you so fired up you can keep up with the workload running like that will break anyone's back in 20 years.  Permanent physical damage.",
            "I was introduced to meth by my brothers looking back the only reason I could think of was wanting to be somewhere doing something with someone we grew up in the middle of nowhere and I never even really felt like I belonged in my family but my brothers ended up getting me to do alot of really bad shit for them and I ended up going to jail I've been clean for 4 years now after a month long relapse when I got out it's genuinely a horrible drug and everything around it is horrible.",
            "Poverty",
            "The interaction with other drugs can be ideal, for drugs.",
            "Desperation.",
            "Abysmal American mental health care system forces desperate people to find cheap and easily accessible ways to cope with the excruciating mental and physical pains of being alive with mental illness and trauma.\n\nI’m not an addict, but I’ve had loved one who are/have been.",
            "Because it makes cocaine meh.",
            "Well you should know most of them graduate from coke to that when they can't buy coke anymore",
            "If you do drugs long enough, late enough, enough times, it can lead to bad places you’d never thought you’d be.",
            "Do you really think that wanting to be cool is the only reason people use drugs?",
            "well for my sister she worked her way up to it tbh...started with weed and alcohol as a teen then cocaine and ended up doing crack then pills and then for whatever reason she moved on to meth and still popped pills when she could get them...she's in prison for the second time ...she would be super charged on the meth tho so I guess it gives you a good high is all I can think of..",
            "\"hm life sucks dick should I kill myself?\"",
            "Because they lied to all of us as 5th graders and said weed = heroin = crack and they all ruin your life\n\nWhen you try weed and realize they lied to you about how bad it is, the next logical step is to try everything else",
            "I miss smoking fat shards and watching porn all day. Emerge from your room every 6 hours to get water covered in sweat and out of breath. Just say \"fuck I was having a great nap, going in for round 2\" to your roommates as they look at you in disgust",
            "I spent years on heroin. Tried meth a few times and it never did it for me. Won't get into the reason I did. \nI've been 100% clean 8 years this October. Haven't even looked at a drug. Anyone commenting about their issues, I just wanna say that it's better here and y'all can do it!",
            "As someone that's worked in warehouses for 5 years, some of the older folks use it here and there just so they can match the numbers of younger workers. Shit hurts to see once you know the red flags",
            "Have you ever thought to yourself:\n\n“I’m already going to be tired tomorrow, I should just stay up and be really tired.”\n\n“I’ll eat the whole box eventually, should just eat the whole box.”\n\n“Fuck, I’m fat, I should just eat more what does it matter?”\n\nSometimes people feel like their life is already fucked, why not really fuck it up.",
            "ima take a guess and say a mixture of temptation and peer pressure.",
            "You seem to be misinformed about some of the effects of meth, which are different and affect in varied degrees depending on the quality, quantity, and the individual who does it. Homelessness, prostitution, and gangsters all existed long before meth did and go back as far as the existence of civilized society. People who have never done meth become homeless all the time and it has nothing to do with meth or even drugs at all. Homelessness is the result of financial crisis more than anything. Prostitution has more to do with financial issues as well, such as an attraction to easy money or desperate times calling for desperate measures. The attraction to meth is probably the energetic feeling, the sociability and elevated mood, the fact that there is little to no withdrawal from meth compared to cocaine or opiates, and the fact that it's affordable and easy to be a functioning meth user if done moderately. It also helps people lose weight which is why its available by prescription to patients who are obese. Its not like doctors prescribe methamphetamine and the obese become prostitutes or gangsters. It is simply a matter of the individual and their ability to effectively moderate its use. Not everyone ends up in a ditch, toothless and picking at their faces. Those who do would have probably ended up that way anyway, just from something else.",
            "Meth was used by StormTroopers.  There are some that romanticize that.  \n\nDrugs very much like meth are used to treat ADHD, weight,  and excessive sleepiness.  Sometimes it starts as a functional self-treatment attempt."
        ]
    }
]