[
    {
        "post_id": "c1xdwz",
        "author": "matike",
        "title": "Where are snails even trying to go",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/c1xdwz/where_are_snails_even_trying_to_go/",
        "score": 15994,
        "num_comments": 636,
        "created_utc": 1560829755.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/c1xdwz/where_are_snails_even_trying_to_go/",
        "comments": [
            "to the food, to the water, and to the sexy snails",
            "Many answers about snails can be found at Snail-World including\n\nhttps://www.snail-world.com/life-cycle-of-a-snail/\n\nEdit:\n>>In brief, the snail life cycle has the following steps:\n\n\n>>1. Born and develop.\n\n\n>>2. Reach sexual maturity.\n\n\n>>3. Find a partner to mate.\n\n\n>>4. Mating process.\n\n\n>>5. Gestation period.\n\n\n>>6. Egg dropping.\n\n\n>>7. Egg hatching.",
            "[removed]",
            "I threw some pan-rinse-water out into my yard last night and saw a slug just minding its business a bit near to where I threw the water.\n\nSquatted down to have a look at the slug and saw that a little piece of green bell pepper landed close to the slug, and it had noticed and started efforting its way towards the pepper.\n\nSeeing this I nudged the pepper piece to the slug, it rubbed the pepper with it's eyes and started taking little bites. Clearly another fan of my cooking. Never regarded slugs as cute, and maybe they're not. They are however worthy of pity in many ways. Strange slimy creatures.",
            "Better question how do these fuckers reproduce and grow up",
            "[removed]",
            "[removed]",
            "To eat my motherfucking strawberries, apparently.",
            "Yummy plants",
            "[removed]",
            "[removed]",
            "Why do hundreds of them commit suicide on my drive way after it rains?",
            "The ladies ᖗ 👁️ ͜ʖ 👁️ ᖘ",
            "[removed]",
            "follow up qeustion, where do they get their shells?",
            "My snail Hector just sits in the top corner of the tank all day. Then at night he zooms around eating veggies and plotting his escape. \n\n[Hector being zoomy](https://i.imgur.com/zPSSQX8.jpg)",
            "all life on earth is just moving around trying to use the least amount of energy possible, to get food, then make a baby - that's it",
            "To places with food",
            "To their promised land which is basically somewhere safe and with leaves, as well as the right humidity",
            "[removed]",
            "follow-up question: where are they when it's not raining?",
            "They dont try to go anywhere, they just cruising",
            "They're heading towards my veg patch to eat all of my veg.",
            "[removed]",
            "[removed]",
            "I have heard as a kid that they are all moving towards the ocean",
            "Onto the side of my house apparently. That’s the only time I ever see them.",
            "Nowhere specifically, they just enjoy the ride.",
            "[removed]",
            "[removed]",
            "Leaves?"
        ]
    },
    {
        "post_id": "m1yp4s",
        "author": "DwangusKhan",
        "title": "Does anyone else feel like if they comment on a post, there is always someone waiting to comment negatively to try and bring you down?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/m1yp4s/does_anyone_else_feel_like_if_they_comment_on_a/",
        "score": 15984,
        "num_comments": 1067,
        "created_utc": 1615386563.0,
        "selftext": "Reddit is the worst culprit of this, but even FB and IG, I feel like whenever I comment something, whether I'm just making a light hearted joke, or even a serious compliment or condolence towards something, there is ALWAYS someone waiting in the comments to reply negatively. The negative comments always get way more likes and attraction even if it is clearly mean or even bullying. There is never ANY repercussion for this behavior, yet your posts get removed for not following stupid formatting rules.",
        "permalink": "/r/NoStupidQuestions/comments/m1yp4s/does_anyone_else_feel_like_if_they_comment_on_a/",
        "comments": [
            "LPT: There will always be someone waiting to comment negatively to try and bring you down. It's how you deal with it that makes the difference.",
            "Blocking people who are dicks has improved my Reddit experience 10 fold.",
            "Keep in mind, reddit is infested with rabid 13 year olds with nothing else to do.",
            "[deleted]",
            "Yes. Reddit is full of morons who think they’re geniuses and the way they prove that to themselves is shitting on everything.",
            "Like how 12 days ago someone posted a picture of their abnormal thumb and your response was just 'Freak.'",
            "[deleted]",
            "Oh yeah. It’s full of people chomping at the bit to downvote you to hell if you get the tiniest fact wrong.\n\nFor example, I didn’t know something about iPhones and people lost their damn minds. Do you think I even care that I didn’t know this fact? (I mean I lost my job over it and my husband left me, but beyond that, it had no bearing on my life).",
            "I had a post years ago that made it to the front page about working out, making progress, loosing weight etc...  I lost about 40lbs of body fat and two different people searched my entire post history and went back a full year just to see that my ex had cheated on me.  They then used that to say something to the effect of, “if you weren’t a fat fuck to begin with she never would have cheated on you”\n\nIt was then I realized some people are just losers.  They have nothing better to do than spend who knows how long to sift through the internet to find something to bait you into feeling sorry for yourself.  It was a big learning moment for me.  Not engaging them ultimately wasted their time.  They spent minutes, maybe half an hour looking through my post to find something to piss me off.  When I didn’t get pissed I took that half hour from them.   It’s also pretty sad they don’t have anything better to do, a better job, a hobby, a group of friends to distract them from doing this kind of crap.  They are truly losers.\n\nEdit:  thank you kindly for the silver",
            "What a stupid ridiculous post this is. You should eat shtuff and die!!!\n\n&#x200B;\n\nhehe",
            "[removed]",
            "I have been a part of chat groups since the 80's and even then there were people waiting to spew their bile just to get a rise out of the chaos.",
            "One of my anxieties 🙃",
            "This depends on the community. On r/politics for example there is always someone with a bone to pick. On some smaller and kinder and better-modded communities I can always anticipate kind replies. I wonder if it has anything to do with the fact that I tend to congregate in mostly women-centric subreddits?",
            "[removed]",
            "Yes. I posted in the god damn CHESS subreddit (the very calm game which I thought had a good community) asking for new openings and someone fucking roasted me saying \"to be blunt, it sounds like your fundamentals are bad but I'm tired of the fundamentals.\" Like bro. It's a sub to learn, you dont have to bash me. And its not like he was a great player either, he was rated 1100 (which is slightly worse than average). I was hoping it was just a reddit thing to reply to posts and comments in a stuck up smartass tone but I guess not.",
            "I have never seen a more negative place than Reddit.\n\nIt isn't that it's everyone, it's that it's so prevalent. The most vicious attempting to own and hurt people through cutting corrective remarks.. Far worse than twitter.\n\nThe worst places seem to be those where a lower education level trade crosses over with a pastime or interest group.. DIY.. Car mechanics..\n\nThe worst I've ever found is a lock smithing sub. It seems to tick a box in a certain mentality and make them feel superior to pretend to have always had whatever the knowledge is, and to withhold information to those who are unknowing, and belittle them at the same time as some kind of paywall?\n\nWhile we should likely feel sympathy for them, it isn't much fun when you're personally attacked.",
            "What a stupid question. The sub is literally named no stupid questions, yet you managed to do it.\n\nObviously that's a joke, and I agree with you. Whatever your opinion, there's always a keyboard warrior who will argue with you about it. Reddit can be a very toxic environment. With the upvote/downvote system, people can anonymously gang up on other people and it often feels like I'm actually getting bullied for sharing my opinion.",
            "I think it depends on what type of comment you’re posting.  If you comment about contentious subjects you should expect push back.",
            "Yep. If you disable the reply notification you can drop you comment, and run away. It’s what I do. Drop my opinion and f*ck the reply!",
            "What? That never happens, are you an idiot?",
            "I don't like your post",
            "Welcome to Reddit.",
            "Yep. Worst one so far was about a week after my daughter died, some asshole said he was happy about it and I deserved it. Reddit is a disgusting cesspool",
            "Reddit feels like a giant group of people waiting to \"gotcha\" people they disagree with, whether it's for karma or to reaffirm their own opinions. It seems most people on this website value the feeling of \"winning\" over learning anything or seeing something from another point of view. The worst part is, they get upvoted and yours get downvoted.",
            "Yep, some parts of Reddit are so so toxic. You can’t post literally anything without a smartass remark or someone just being a troll. It’s hard to ignore but just try your best to not let them get to you. That’s what they want.",
            "[rule14](https://tvtropes.org/pmwiki/pmwiki.php/Main/RulesOfTheInternet)",
            "While I don’t really get any negative comments, whenever I post on r/EscapeFromTarkov, whether it be a post or a comment, it would almost always gets immediately downvoted in the first few minutes. It doesn’t really bother me, but sometimes it feels like I have a hidden rival on that subreddit that’s just watching my every move.",
            "Instant block to anyone who is rude. You can be kind while still disagreeing. So if someone is rude, instant block. No need for that BS.",
            "Yep. Had that happen the other day. I was commenting on a woman's post and a guy kept answering my comments in the most negative, toxic way possible. Very hateful individual. Ended up blocking him because he was creeping me out.",
            "what a dumb post\n\n&#x200B;\n\nJK.. I feel this all the time. I get nerves when I see that I have responses when I open Reddit, just knowing that someone came after me for a sincere comment.",
            "I go onto this sight hoping for a comment or something. I’ve never gotten anything negative back.",
            "I have experienced it and not much can be done within the Reddit system. You cannot dictate how someone votes. \n\nIt is part of the social malice growing for years and not much can be done I think within Reddit framework.",
            "Absolutely! Everyone wants to be right, and insult when they are wrong. The only positive response I've had was when the person I was commenting on decided to have an open-mind and tried to see my side. Those are the best people. They don't have to agree with you, but if they try to see your side, that is a 'woke' person, and vice-versa. We need more people like that today.",
            "Yes, it is because I AM THE ONE. Eviiiiiiiil",
            "Ik. Asked a simple question about a gun and got called a moron who trusts reviews or something.",
            "I feel like this is just people in general, I genuinely believe there are people who just wanna watch the world burn",
            "Shut the hell up loser",
            "I swear the internet anonimity makes people grow balls they couldn't even dream of",
            "It can be.  I don’t get nasty until someone else does.  I hate seeing stuff like “google it”.  Sometimes we want some feedback, or want to hear what real people think.",
            "[deleted]",
            "Nobody is going to see this comment, let alone comment on it.",
            "I’m here for the real talk",
            "Yep. It sucks and is obnoxious, especially when you are trying to contribute meaningfully to a discussion. I’ve left several toxic Reddit threads lately because I was just over the gaslighting and negging.",
            "yes.",
            "negativity everywhere, this is why i decided to foucs on postivity",
            "Yes. I commented in a music thread about a song that got mentioned being one of my all time favourites, and apparently this was enough to make someone take time out of their day to pontificate on how that song couldn't possibly be so many people's favourite, and that they must all be wrong, and what was wrong with them etc etc. \n\nI just feel like - Goddamn, you *chose* to respond with that? You saw that someone enjoyed something subjective and thought 'I *have* to shit on this'? \n\nI sometimes wonder if people are aware they can choose *not* to be this way, or not to comment at all, and things will be fine.",
            "Not giving a fuck about things that are irrelevant goes a long way in life........",
            "Firstly, try not to give a shit. It’s Reddit, anyone can be a warrior behind a keyboard. \n\nSecondly, a number of your responses to comments on this post are unnecessarily defensive. Context can be hard to grasp via text, but give them a second read and to see if you’re misconstruing anything. Otherwise, don’t bother engaging, for your own sake,  if you think it will lead down a path of negativity.",
            "The negative comments are actually being upvoted by multiple accounts made by the same person who just wants to argue with people.",
            "Fuck you. You useless piece of shit. You absolute waste of space and air. You uneducated, ignorant, idiotic dumb swine, you’re an absolute embarrassment to humanity and all life as a whole. The magnitude of your failure just now is so indescribably massive that one hundred years into the future your name will be used as moniker of evil for heretics. Even if all of humanity put together their collective intelligence there is no conceivable way they could have thought up a way to fuck up on the unimaginable scale you just did. When Jesus died for our sins, he must not have seen the sacrilegious act we just witnessed you performing, because if he did he would have forsaken humanity long ago so that your birth may have never become reality. After you die, your skeleton will be displayed in a museum after being scientifically researched so that all future generations may learn not to generate your bone structure, because every tiny detail anyone may have in common with you degrades them to a useless piece of trash and a burden to society. No wonder your father questioned whether or not your were truly his son, for you'd have to not be a waste of carbon matter for anyone to love you like a family member. Your birth made it so that mankind is worse of in every way you can possibly imagine, and you have made it so that society can never really recover into a state of organization. Everything has forever fallen into a bewildering chaos, through which unrecognizable core, you can only find misfortune. I would say the apocalypse is upon us but this is merely the closest word humans have for the sheer scale of horror that is now reality. You have forever condemned everyone you love and know into an eternal state of suffering, worse than any human concept of hell. You are such an unholy being, that if you step within a one hundred foot radius of a holy place or a place that has ever been deemed important by anyone, your distorted sac religious soul will ruin whatever meaning it ever had beyond repair. You are an idiotic, shiteating, dumbass ape and no one has ever loved you. Rhodes Island would have been better off if you'd never joined us. You are a lying, backstabbing, cowardly useless piece of shit and I hate you with every single part of my being. Even this worlds finest writers and poets from throughout the ages could never hope to accurately describe the scale on which you just fucked up, and how incredibly idiotic you are. Anyone that believes in any religion out there should now realize that they have been wrong this entire time, for if divine beings were real, they would never have allowed a being such as you to stain the earth and this universe. In the future there will be horror stories made about you, with the scariest part of them being that the reader has to realize that such an indescribable monster actually exists, and that the horrific events from the movie have actually taken place in the same world that they live in right now. You are the absolute embodiment of everything that has ever been wrong on this earth, yet you manage to make it so that that is only a small part of the evil that is your being. Never in the history of mankind has there been anyone that could have predicted such an eldrich abomination, but here you are. It’s hard to believe that I am seeing such an incredible failure with my own eyes, but here I am, so unfortunately I cannot deny your existence. Even if I did my very best, my vocabulary is not able to describe the sheer magnitude of the idiotic mistake that is you. Even if time travel some day will be invented, there still would not be a single soul willing to go back in time to before this moment to fix history, because having to witness such incredible horrors if they failed would have to many mental and physical drawbacks that not even the bravest soul in history would be willing to risk it. I cannot imagine the pure dread your mother must have felt when she had to carry a baby for nine months and then giving birth to such a wretched monster as you. Not a single word of the incoherent, illogical rambling you may be wanting to do to defend yourself or apologize would ever be able to make up for what you just did. The countries of the world would have wanted to make laws preventing such a terrible event like this from ever happening again, but sadly this is not possible since your horrific actions just now have shattered every form of order this world once had, making concepts such as laws irrelevant. Right from the moment I first set my eyes on you I knew you were an absolute abomination of everything that is wrong with humanity. I was hoping I would have been able to prevent your evil from being released upon this world by tagging along and keeping my eye on you, but it is clear to me now that not even the greatest efforts would have been able to prevent a terrible event in this scale from occurring. You are the worst human being, or even just being in general, that I have ever had the misfortune of witnessing. Events like the infected plague apparently only happened with the goal of teaching humanity to survive such a horrible event as the one you just created, but not even mankind’s greatest trials were able to even slightly prepare anyone for the insufferable evil you have just created. If you ever had them, your children would be preemptively killed to protect this universe from the possibility of anyone in your bloodline being even half as bad as you are, except you will never be able to have children, because not a single human being will ever want to come within a hundred mile radius of you and anything you have ever touched. You are a colossal disappointment not only to your parents, but to your ancestors and entire bloodline. The disgusting mistake that you have just made is so incredibly terrible that everyone who would ever be to hear about it would spontaneously feel an indescribable mixture of immense anger, fear and anxiety that emotionally and physically they would never truly be the same ever again. The sheer scale of your mistake, if ever to be materialized, would not only surpass the size of the world, but it would reach far beyond the edges of the known, and almost certainly the unknown universe. I could sit here and write paragraphs, nay, books describing your immense failure, yet even if I were to dedicate my life to describing the reality of what has just gone down here, and I would spend every moment of it until my heart stops beating working as hard and efficiently as possible, yet there is not even a snowballs chance in hell that I would be able to come close to transcribing the absolute shitshow you have just released upon the world. You are an irresponsible, idiotic, disgusting, unloved, horrible excuse for a living being who’s soul contains less humanity than every ginger in history combined. The absolute disgust I feel when thinking about anything that has even a slight resemblance to anything that might have to do with you and your unholy actions is so incredibly great that when I am honest about it I think that even I do not posses a consciousness great enough to comprehend my own feelings about it. When people of Columbia fought to break free from Lungmen, countless soldiers fought and lost their lives in favor of a chance at a better future for their children, they did not give their lives to have you fuck the world up beyond repair to the degree that you are doing right now. Honestly, even when technology advances and studies on the subject become more and more accurate, I do not think humanity will ever truly be able to understand what your failure actually means for the universe. My hate for you and everything you stand for is so much deeper than the depths of Shambala that you could probably take the entire Lungmen population down there and back up around twenty million times before you would have sunk to the end of my hate, and honestly, I do not want to exaggerate, but I think that that insult was low balling it such a massive amount that all mountains in this world combined would not be able to stack up to this imprecise judgement in light of the fact that when being honest, my hate is almost certainly bottomless. There is no one in this world that has ever loved you, and especially after what you just did, no one will ever love you in the future either. There is no hope that your idiotic behavior and especially your crooked soul will ever change for the better, and in fact quite the opposite might be true. By making the mistake that you just did, you have shown me that you are so incredibly hopeless that you will only devolve into a more idiotic and wretched creature than you already are. The only possible way in which your future would be brighter than the black hole your existence currently is would exclusively be because there is absolutely no conceivable way that you would even be able to sink lower than the pathetic place your current failure has put you in.",
            "Feel cool now huh? (Just kidding, true af yeah)",
            "I give them an award.  They are just little yappy puppies looking for attention.",
            "I’ve just ultimately slowed down/stopped commenting on every social because of this. I can post a comment on a video of a mother daughter moment and say how cute it was, and someone will go “it’s not cute lmao” or something. like damn, ok",
            "It can't happen if you're faster than them...\n\n\n\nYou twat.\n\n\n\n\n/s",
            "I think the common denominator between trolls who belittle your posts and mods who remove a post because it doesn't follow their arbitrary and nitpicky rules is low self-esteem. People with low self-esteem sometimes try to make other people look and feel small because they think it makes them look bigger and more powerful. They don't realize it makes them look petty and weak.",
            "I feel it sometimes. There’s some subs you know what you are getting into when you comment. But I hate it when you are in a pretty tight knit subreddit and someone trashes you. I’m on a witchcraft sub and around the anniversary of the Salem witch trials someone made a post saying how grateful they were to be able to have the freedom to practice without having to hide in fear. And the first comment on the post was someone saying something like, “there’s still oppression!!! Women and lgtb and minorities are still oppressed!!” And I’m like, we are literally talking about no longer being tortured and murdered because of our beliefs and you can’t stop and be thankful about that for one second?",
            "I used to frequent AITA and comment regularly but I no longer do because of this. It seems as if realistic and reasonable advice pertaining to the circumstance loses out over things like \"quit your job and divorce your wife over an argument about your favourite colour.\" I don't get it.",
            "I have learned I enjoy the conflict.  Roasting a troll is pretty fun, but sometimes someone makes a positive comment and that's an even better reward.",
            "I have really innocuous posts that get downvoted instantly. \n\n\n\n\n\nIt's vain and narcissistic to say it, but I'm pretty sure I pissed someone off and they followed my account so they could downvote whatever I did",
            "Someone taught me to imagine such responses being read out loud by Dale Gribble, it takes 100% of the sting out of it",
            "I think sometimes that foreboding makes me not comment but I'm pretty opinionated and what exactly is the prize? Imaginary Internet points?",
            "This kind of trend over negative behaviour is well known in social media, algorithms know that negative behaviour tend to attract more interaction and keep people hooked for longer, so it promotes them and really inflate their visibility, rewarding emotionally this kind of negativity.\n\nThe teenagers or whatever profile you try to make of the average user of reddit are not to blame, this is just the way social medias were designed, to make you addicted and hungry for upvotes, likes etc, even if this makes you a complete jackass.",
            "Do what I do and just don't ever read any replies unless you are seeking advice or an answer. For example, if someone replied to this, then ask yourself what benefit is there for me to read it? They either agree or don't but the details does not serve any real life, practical purpose. Plus at some point, I'm just gonna forget that I ever even made this comment anyway.\n\nSo do yourself the biggest favor that you can and be honest with yourself when commenting and avoid reading replies unless your post seeks a valued return such as an insight or answer.",
            "There IS always someone waiting to comment negatively to to try and bring you down, I am one of them. I disagree with people in principal, no matter the topic. Except this topic lol.",
            "I always think of it as a different point of view, but when it doesn't have any pov and is just negative that's when I ignore them.",
            "Nah man, I'm part of the Hive Mind Gang (TM). ALL HAIL HYPNOTOAD *wrahh wrahh wrahh wrahh wrahh*",
            "I can garuantee the situation would differ if the other guy / gal behind the keyboard were suddenly placed in front of you, just like when the gate between 2 barking dogs is removed.",
            "Late here but don't forget the hive mind effect. Just like with oldschool forums. When you start a new thread/post, the first few replies will dictate the rest of the thread. \n\neg: You ask a question or state an opinion. If the initial replies are negative and opposing, then everyone else will reply similarly. If the first responses are positive and supporting, then everyone else will be more receptive.\n\nIve seen valid, perfectly good arguments get downvoted to oblivion because everyone in that post arbitrarily decided fuck that person.",
            "Always, always and always. They pounce when they see a way to poke at you. They enjoy the anonymity of the web to be the biggest A-holes they can",
            "Definitely",
            "Misery loves company and they’ll always try to bring you down",
            "I'm arriving late. But, OP, if you're still there, hear me out. After the 10th time someone does that you just understand that this shit just not hurt you. \n\n&#x200B;\n\nJust understand what this really is: it's a fucking website with millions of fake profiles. No one is anybody here. Once you understand that, you understand your Reddit persona. \n\n&#x200B;\n\nYour Reddit persona still has all your rational thoughts, but when it comes to emotions it is completely different. When you achieve this, I guarantee your experience will be more pleasant.",
            "Fuck u op /s\n\n\nSame on Facebook",
            "I always wanted to say this. \n\n\nPineapple does not belong on PIZZA! down vote me you pineapple pizza eating.....eaters!\n\nSeriously sometimes I just voice my honest opinion and still get down voted to hell. I've really been trying to learn not to take it personally.",
            "**No! That's stupid. You're stupid. Why do you even post this whiney bitch ass shit. I'll bet you smell like pee, and you've never had sex. Everyone fucking hates you.**\n\n^(just kidding, ignore the negativity, they're just words, and usually stem from others feeling that way about themselves because they didn't know to just ignore it because it's pretty stupid when you think about it. I'm not going to say you're great, I don't know, maybe you really do suck. But if you're trying to be someone who doesn't suck and you keep trying to be someone who doesn't suck just because you know how cool it is to be around people who don't suck and you know how cool it'd be to be that for someone else you can be confident that you don't suck ... suck)",
            "It's beginner's ironic humor: act like a jackass for the lulz.",
            "Go fuck yourself.\n\nJk, I get you, but it's best to learn not to care about what people say or think.  Think back to middle/high school.  The best way to deal with bullying is to thicken your skin a bit and realise it doesn't matter.  Anything other response and the bullys win.",
            "Honestly, I feel like everyone's out to get me down 24/7 :-/",
            "Literally just earlier there was a joke thread where a guy said he could take one or two coyotes in a fight. I told him that one was possible, but with two he'd be screwed, obviously not being serious, and some dude jumped in the argue that actually he could take two coyotes! I had to sit there and keep trying to defend the logic of my dumb joke comment until I got tired of replying.",
            "Welcome to the internet. It's been like this since the 90s.",
            "This is just one of those questions that’s not necessarily easy to answer, and in my opinion and experiences, I feel like that’s not a very positive outlook. I definitely feel like there’s almost always someone typing a comment, but I don’t always think that what they’re typing is bad. I don’t usually get negative comments, and when I do, I treat them as memes and I move on. Coincidentally, I got a negative comment on Instagram from someone I didn’t even know. I tend to treat it as “hey, I don’t know this person, their opinion means next to nothing to me,” and when I view it like that on Reddit, it makes it easier to come across comments like that. In turn, it makes the anxiety of “what if someone is typing a negative comment right now” as less of a concern.",
            "Assholes have been around since before the *internet* was a thing, let alone Reddit. It's not paranoia, you're just aware of reality.",
            "Nope.. now I’m going to take a look at your post history.",
            "Comment but never return. That's how you deal with that.",
            "Yea its hard to get karma people should be a little nicer",
            "Wait.. yall are getting replies?",
            "What brings me down is the fact that most of my posts go unseen or get two upvotes while only a few have have generated 1k+ upvotes, which leads me to believe that, for the most part, people don't care about you unless what you post is sensational.",
            "Negative people that are unhappy and want to take it out on someone else. They wouldn’t go around in public saying the crap they do, so comments on social media is perfect for them. They likely just want to bait an argument so ignoring them is the best thing you can do. I know that is sometimes easier said than done.",
            "Yes. There is literally nothing you can say that won't offend someone.",
            "I got backlash for having the opinion you shouldn’t pee in the shower. Like come on, that’s straight up nasty and you know it. Don’t sass me because you have a gross habbit.",
            "Lol My girlfriend refuses to post on reddit because of this. I on the other hand couldn't care less. I'm  older than her and have been on the internet since it's inception so I've grown immune to giving a shit.",
            "Yes. In a 'deadbeat' parent thread the other day, suggesting my ex was a deadbeat mom was met with 'you must have deserved it, you're lying, your an asshole for sharing, you shouldn't have shared because this is a deadbeat dad thread'. \n\nThe amount of abuse that woman put me and my son through, isn't valid or welcome. The same thing that happened at the time that allowed her abuse to continue, and they don't see the hypocrisy at all.",
            "Someone PMed me that I am a Subhuman and should kill myself... For making a post on Wednesday and wishing every gentlemen a great day...\n\n\n\n\n\n\nQuite funny to read smth like this ngl",
            "Every time. Then when I’m made to feel negatively or self conscious I almost always delete my post. It’s weird because I’m a confident person in reality but the internet is different.\n\nFor example, I posted a funny video of my dog and someone immediately insinuated that my dog had an ear infection because of “the way he twitched before shaking his ears”. He didn’t and never has had one. I take great care of him mind you my dog was just playing and rolling on the floor. This person suggesting I spend my time caring for my dog instead of sharing a video. My dog is more than appropriately cared for and my best friend so it just made me feel kind of sick. It was just really negative & unnecessary, not to mention a completely false assumption. Idk why that one stuck with me.\n\nGuessing a lot of people can relate to your post. I think of this all the time & typically refrain from posting anything of my own for this exact reason.",
            "yes you jackass",
            "I am very tender hearted & take things personally so that’s why I don’t post because someone will always knock me down.",
            "It’s like all respect goes out the window on socials",
            "Yeah, I've deleted posts before just because I didn't want to spend my time arguing with some rando I don't know. Reddit is especially awful in this regard.",
            "Somebody on a gaming sub told me (on an alt no less!) that his main account was following me to downvote my posts.\n\nI've never felt as proud or important as I did at that moment. Imagine someone making an alt just to harass me!",
            "That’s why I post so little and comment even less. I appreciate criticism but social media enables people to just be extremely rude with their replies, and I hate this kind of toxicity. 99% of the times people would never say what they truly think in your face or in public. I just do the same but online as well.",
            "It’s almost as if social media (Reddit, FB, IG, etc) is a cancer.  Hmmm",
            "thats why i never comment on stuff anymore",
            "there's always that one guy out there who will disagree with you\n\n&#x200B;\n\nthat's just how life works, sadly.",
            "I don’t remember what it’s called, but a certain law states that the fastest way to get answers from bothers online isn’t to post a question, it’s to post a wrong answer and let them correct you.",
            "I believe there are a lot of people who feel powerless in life and by being mean to others online it gives them a sense of power.",
            "That's called the Internet.",
            "YEAH, that happened to me a couple days ago! And it was the first time it’s ever happened to me too... I was complementing someone on their art and also mentioned  it was a technique I didn’t know how to do, then someone else started badgering me about how it’s because I don’t want to try and I’m too lazy. No, it’s really because I don’t know how to do it :/",
            "I think negativity is encouraged on Reddit. People often think it makes them smarter",
            "Stop talking about me. I’m right here.",
            "I didn’t realize how much this bothered me until I started avoiding certain subreddits. It was making my severe anxiety so much worse. I feel like I can’t even post anymore",
            "Isn’t the name of this subreddit “no stupid questions”....?",
            "Know the trick? Remove all consideration from your mind what internet strangers think. Getting down votes? So what. It doesn't effect you in any way. Think of it as an opportunity for debate.",
            "Welcome to the internet",
            "That’s life. Not everyone agrees with everyone. Not a big deal.",
            "That's pretty much the nature of the internet. Try not to be so timid. \"Sticks and stones may break my bones, but words will never hurt me.\"",
            "NO! I don't have the exact same point of view as you, therefore, fuck you and kill yourself.",
            "Maybe you just make dumb comments",
            "absolutely, Reddit is by far the worst, even a simple picture of a kitten gets an immediate weirdly aggressive negative comment",
            "Me too, now fuck off",
            "Posting this has truly shown me that there is MUCH more positve minded people on reddit than the opposite. Thank every single one of you for your kind, witty, funny, and humbling comments and opinions. It really has restored my faith in humanity. Thank you.",
            "Maybe you just say really stupid stuff.",
            "That’s just what cowards do, i wouldn’t think anything of it, they just feel bad about themselves so they try to make you feel the same.",
            "I do post negative thing on Reddit when people use it as Facebook, like stop putting pet and baby picture in subreddits that weren’t meant for it",
            "Watch this video [about not giving a f***](https://youtu.be/FRdt2ZQ3pJA)",
            "I'm sorry, but it's nothing personal",
            "Your post is dumb and so are you, OP. /s\n\nBut yeah, I feel this. Sometimes I’ll just not comment on something I normally would have just because I don’t want to deal with the snark and negativity.\n\nThis kind of thing has always been an issue on the Internet, of course, and maybe it’s just me, but I feel like people online have become especially mean-spirited over the past year, probably from the stress of the pandemic and depressing world news. I’ve ended up leaving a lot of communities that used to make me happy because they ended up becoming hateful and divided by politics, and I enjoy being online a lot less than I did a year ago.",
            "No, that’s stupid. You’re stupid. Fuck you. ^/s",
            "Yes.\n\nAnd if you are able to resist, they will pick another target.\n\nIts classic bullying, but a digital version",
            "Have you never been on the internet before",
            "Yes that’s the Internet get over it",
            "Not really. No one cares much of what I have to say. \n\nBut I hear where you’re coming from and I’m sorry it happens to you and feels bad.",
            "No, though challenging eachother is part of social interactions. Try to remember that all that matters is what you think and you won't feel so harassed.",
            "[deleted]",
            "Ah yes. You know, the chances of being viewed non threathening is saying something random to distract the viewer.\n\nWatch this.\n\n𝖄𝖔𝖚 𝖜𝖊𝖗𝖊 𝖊𝖝𝖕𝖊𝖈𝖙𝖎𝖓𝖌 𝖆 𝖉𝖎𝖘𝖙𝖗𝖆𝖈𝖙𝖎𝖔𝖓, 𝖇𝖚𝖙 𝖎𝖙 𝖜𝖆𝖘 𝖒𝖊, 𝕯𝕴𝕺!\n\nSNEAK 100 & Smort combo",
            "Idgaf lmao",
            "Stop posting stupid shit like this then I mean it isn’t hard",
            "Bro what are you even talking about.? No one’s ever disagreeing.. ever. Doesn’t happen :|",
            "Well, Reddit is a free forum for that purpose you can tell somebody when their being -3000 IQ and applaud when something is funny or good. And, if you cant take the heat get out the kitchen. Leave; don't come back on the site no-one is stopping you.",
            "No, really not. I very rarely get negative replies, and even then, people are usually on my side, not to mention a majority of the time I don't get many replies in the first place. Seems to me like either you're in the wrong communities, or you're actually not self-aware of how your comments come across to others sometimes.",
            "No that's absurd. Why would you think that? What's wrong with you? Is someone abusing you at home?",
            "No. Stop posting dumb shit.",
            "No and what a stupid fucking question to ask\n\n/s",
            "Everyone on here is so sensitive it’s ridiculous.\nJumping to conclusions and dissing comments.\nOh well.",
            "I sort hope they do. I also hope someone says something good about it as well.",
            "The DoorDash subreddit is a perfect example of what you're talking about. On any post that is even slightly critical of the Dasher experience, there are always people in the comments who call you an idiot or get rude for no reason",
            "I think there's sometime stalking me and downvoting everything I post and comment. No idea why. It's always those very neutral posts too.",
            "NO!",
            "Yup, or someone waiting to get super technical and dispute what you’re saying to sound smart. Like ok we get it bro."
        ]
    },
    {
        "post_id": "pp7699",
        "author": "VeryLuciD",
        "title": "Why have we gotten so far into technology that we can give a transitioned male a functional penis, but we haven't made a male birth control",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/pp7699/why_have_we_gotten_so_far_into_technology_that_we/",
        "score": 15993,
        "num_comments": 1826,
        "created_utc": 1631770092.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/pp7699/why_have_we_gotten_so_far_into_technology_that_we/",
        "comments": [
            "Hi Everyone,\n\nI'm locking this post as we have gathered enough evidence that it is being brigaded by anti trans groups (even though that is really not the question).\n\nWe have a zero tolerance policy for transgender bigotry, including denial of identity.\n\nHere are some sample statements \"trans women are women\", \"Gender Dysphoria is not the same thing as being trans though there is overlap\", \"biological sex is different from gender, if you feel otherwise you have an english problem.\"\n\nIf you came here to disagree with any of the above or just be a terrible person to trans people feel free to message us for your ban. \n\nNo \"silencing the discussion\" doesn't hurt more than the damage caused by letting you spread your bullshit, and if you come back with \"but the science\" then you once again have an english problem.\n\nIf you aren't one of the bigots who found this post through it being shared on groups for subreddits that are now flatout banned on reddit, then feel free to ask any questions you have about the lock or our rules.",
            "There is a functioning penis for a transitioned male?",
            "We have some, but they have side effects that are deemed serious enough that they don't go into production. Vasectomy is an option if you're looking for a longer term solution",
            "Look up vaselgel - a male birth control method that I believe is (or was?) In clinical trials.\n\n\nIt looked like a really promising option, but my guess is the amount of clinical trials needed to get it approved, and probably some funding issues as well, means it may not get or very fast (or at all?) Just a guess. \n\n\nI'm afraid I don't know too many details, but I do know it would be rad if it became available.",
            "[We have.  The side effects were unacceptable.](https://www.webmd.com/sex/birth-control/male-birth-control-contraceptives-pill)\n\nThe difficulty is that sperm are pretty simple and very durable (collectively).  It's hard to reliably shut down that entire system without messing up something else along the way.\n\nOn the flip side, the egg system is easy to screw up because it's more susceptible to interference.",
            "[removed]",
            "Urologist here. First off I want to clarify that most penises formed by gender affirming surgery are not always \"functional\" in the full sense of able to perform penetrative intercourse. The urethra is often transitioned to going through the clitoris, which means the new person will pee out of a sexually sensitive organ. However,  result may often not be large enough for sex. That being said the question of male birth control is a good one which I will explain.\nIts important to understand how we do female birth birth control. Women ate cyclically fertile, meaning there are times of fertility and times of infertility naturally. The basic idea is that we hijack the system and cause the infertility part to remain for longer. On the other hand, men are always fertile. To stop that we would have to break something. Breaking a particular component without breaking other components is complex, which generally requires a surgery like a vasectomy. Attempts at pill based Male birth control have either not worked or caused full on sterility in a very large amount of the test subjects.",
            "It’s not a functional penis. You have to pump it up with a hand pump.",
            "Trans man here: we technically can’t give trans men a ‘fully functional’ penis, we cannot ejaculate, cannot start producing sperm, and the surgery options force you to choose between penetrative functionality or natural erections. \n\nThis isn’t to say that trans men’s penises are wrong or useless, but they are not ‘fully’ functional to the same degree as the average cisgender man’s penis",
            "FDA requiremnets mean that you can only give a medicince if it's benefits outweigh the side effects for the patient. For woman the BC pill is accepted because it prevents what is still a very dangerous condition (pregnancy) As bio men can't get pregnant the allowed side effects for the FDA to approve are far smaller.\n\nAs for the scientific part it's because woman's bodies already have a state where they don't produce gametes. (preganancy) Thus we can simply mimic this off signal to stop ovulation.\n\nMen don't have such a signal and in fact the way the feedback mechanism in men works it will actively try to counter you using hormones to stop it meaning comparitively higher doses were needed for the same effects and thus much stronger versions of the side effects. IIRC the suicide rate was above 1% in one study.",
            "One problem is plumbing/electrical, essentially, and the other is chemistry. Very different kinds of issues to be solved",
            "Everyone keeps saying that it’s the side effects that are unacceptable but there’s no real context to that argument. \n\nI think what the main issue is, is that ‘birth control’ has dozens of other uses and benefits for women than just preventing birth. \n\n[Here’s an article that highlights, what, 19 benefits?](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3693657/)\n\n[Here’s another that talks about the shitty history of ‘the pill’ but on Page 7 takes about the non-contraceptive benefits. ](https://www.plannedparenthood.org/files/1514/3518/7100/Pill_History_FactSheet.pdf)\n\nSo I think the issue with the side effects of a male birth control are likely unnecessary for something that only has a singular purpose and a purpose that can be solved by men simply wearing condoms or using other safe-sex techniques. \n\nWhereas female hormonal birth control can help with symptoms of endometriosis, PMS, and a bunch of other things. You can’t just slap a condom on to correct the lack of menstruation because of hyper athleticism or eating disorders or reduce severe cramping that can leave you bed ridden. \n\nI’m sure if a male pill helped with, I don’t know, male pattern baldness, erectile dysfunction, or something else it would be less impacted by side effects but, as it stands now, the options are risk liver damage, get ED, or kill your sex drive, or wear a condom and get the same effect.",
            "I mean, a condom is a form of birth control.for males to use.",
            "If we speak only of hormonal birth control (cause there is condom vasectomy as birth control for men), the primary element are that men don't have cycle with their hormones and can procreate all the time not on specific periode.\nTo have hormonal solution as birth control for men seem then complicated and with a lot of sides effects for a process that almost never causes problems.\nIn the other hand for women,  sometime periods and hormonal cycle can be help with pills to decrease pain and other problems. \nVasectomy and condom and both pretty reliable birth control solution and condom are inexpensive in developed countries so no real reason to put millions in research (they exist but not many nor well finance)",
            "Biochemistry is a lot harder to master than mechanics or physiology.",
            "[removed]",
            "1. we can't give a transitioned man a functional penis it won't get erect on its own and won't produce semen \n2. male contraceptive was researched and it wasn't effective and had bad side effects",
            "Female birth control is possible because there was already biological pathways that could stop ovulation and therefore prevent pregnancy. And not even just one pathway either but a handful exploiting different hormonal signals.\n\nMales... not so lucky. If anything males are the opposite. Relatively simple hormonal cycles and a reproductive system that is essentially designed to be permanently on at all times for their entire life barring the early prepubescent stage. The only thing that can be exploited is that the system doesn't really care if it's shooting blanks the the pathway can be cut. Other methods that have been tried are similar to vasectomy but more reversable (implanted switch but has issues with leakage and having to \"clear the pipes\" after switching, and a polymer that coats the inside of the tube that shreds sperm with static forces but had issues with durability) or that attempt to mess with the viability of the sperm in other ways. Those other ways though often result in effects that aren't isolated to the reproductive system since the male hormones have system wide effects and aren't meant to be wildly altered and genetic methods targeting specific genes have the same issue of those genes being active in other vital organs.\n\nOf course this isn't to say that female hormones also dont cause issues when they are messed with due to birth control or that there are other issues with female birth control. It helps that there are multiple options available though it doesn't always mean that everything will work. But for men they are struggling to find even a single solution that won't have drastic side effects or high failure rates for large portions of users.",
            "Condom",
            "We do. In fact, it's an incredibly cheap, easily reversible, minimally invasive, non-hormonal birth control with an excellent success rate in all clinical trials so far.\n\nThe issue of course is that it's cheap, easily reversible, and has excellent success rates.\n\n&#x200B;\n\nThe original design is called RISUG and was invented in India. In the US, it is called Vasalgel and it has been being examined for approval in the US for(I think) close to 10 years. There are differences between them, but both use similar methods to do their job.\n\n[Study on RISUG](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6798614/)\n\n[Link to Vasalgel main site](https://www.revolutioncontraceptives.com/vasalgel/)",
            "All that has been said and also: priorities. The side effect women endure have always been accepted and hardly properly documented. Doctors mostly being men for ages has something to do with that too.",
            "Females have an innate on/off switch that we exploit with pharmaceuticals. The body knows that releasing more eggs and shedding the endometrium during a pregnancy wouldn’t work, so we stimulate hormone levels reflective of pregnancy to prevent ovulation, implantation, etc. \n\nMales don’t have a chemical cycle to exploit, so the only options are physical barriers. (I’ll argue now that we definitely have male birth control, but they’re all physical, rather than chemical like the popular daily women’s pill). Pretty much all male options are barriers at different levels of the reproductive pathway. Condoms stop the flow of sperm external to the male and vasectomies stop the flow internally.\n\nI suppose you could count spermicidal lubricants as a chemical barrier to male gametes. The problem with reliability there, though, stems from the sexual act generating a variable amount of fluids by both partners. Can’t know the perfect amount of spermicide to add to maintain a concentration that kills sperm without damaging surrounding tissues when the amount of diluting fluid is unknown.",
            "[removed]",
            "Lol. When the clinical trials go through men dont like the yucky side effects. Turns out women experience unpleasant side effects from using hormonal birth contol too. Men apparently dont care or don't know that, and find it unpleasant for them.",
            "We have. Several times. What we have not made a a male human who will reliably use it.",
            "well firstly, we haven't made a \"fully functional penis\" for trans men, and secondly we do have male birth control, but the side effects are deemed too severe. even though many of them have side effects on par or milder to female birth control.",
            "Why does everyone keep talking about this pill? Use a condom! Pregnancies aren't the only worry about unprotected sex.",
            "Urologist here. Keep in mind that this is reddit and the amount of just straight up wrong things im seeing even in top comments that have incidental right but misrepresented medical terminology is just nuts.",
            "It's much easier to stop one event, the implantation of a fertilized egg, than to stop a hundred thousand sperms from being produced.",
            "Male birth control comes in the form of waifus and its 99% effective",
            "We have and it's called condoms. \n\nWe have and it's called a vasectomy. \n\nThe problem with a pill for dudes is, imagine being a woman and having a guy tell you \"don't worry about it, I'm on the pill\" how much do you trust that? In a world where [\"stealthing\"](https://www.urbandictionary.com/define.php?term=Stealthing) is a word.....I'm a cis straight dude and even I'm like \"yeah.....\"",
            "You are grossly missinformed if you think there's a fully functioning, \"on its own\", penis that we can attach to a living being",
            "vasectomies and condoms are forms of birth control for men.",
            "We have it’s called a vasectomy go get one!",
            "We have, but the period like side effects were considered \"inhumane\" so they discontinued the research",
            "Medical sexism I guess lol. They focus on surgeries like labiaplasty and stuff instead of fixing actual problems like endo or something. It's so annoying. So many women die preventable childbirth deaths but thank God surgeons know how to do BBL!!",
            "This is just an outright lie",
            "Its not a functional penis lol",
            "In a nutshell, the main issue is basic biology:\n\n&#x200B;\n\nWomen produce 1 egg every month and have a trackable cycle.\n\n&#x200B;\n\nMen produce millions of sperm every month with no rhyme or reason. They just keep making spermies!\n\n&#x200B;\n\nIt's easier to kill one egg that is gonna be at a certain place at at certain time every month over a million sperm that keep being produced ll month long.\n\n&#x200B;\n\nOn the plus note,  there are several ongoing studies that have started trials or are going into trials. Here is a recent one at [UC Davis](https://health.ucdavis.edu/health-news/newsroom/male-contraception-clinical-trial-launches-in-sacramento-/2020/06).  Suicide ideation seems to be the achilles heel for past trials.",
            "It simulates an erection via a pump, it's not a functional corpus cavernous and lacks the same neurological vascular controls. It's by no means a real penis.\n\nMillions of sperm are generated every day. Temporarily and reversibly stopping them without fucking up a lot of processes is exceedingly difficult. That's why female contraceptives are preferred. One follicle per month.",
            "There is no functional trans penis properly speaking.\n\nAnd there is some decent male birth control that's as functional as a trans penis.\n\nIts the thermal-based contraception or whatever it's name is in English.\nBasically you cook your balls to stop sperm production (not too high because you become infertile and not too low otherwise production isn't slowed enough)\nProblem is, the device is costly, you need to cook them for some time because pre existing sperm, and an error in manipulation can have dangerous consequences\n\nEdit: also condoms are birth control, and if you disagree that they are not then by the same logical you can say that male birth control can't exist because they aren't the one giving birth",
            "Sorry but how would they give a transsexual man a functional penis? I cannot wrap my mind around how that would work, pun intended",
            "#Isn't it called Vasectomy ?",
            "Condoms have been around for like, 100 years?",
            "I saw 1 researcher say most of the time they test male birth control methods, they stop the trials early due to side effects (despite women’s birth control methods having tons of known side effects)",
            "Short answer : there's high demand for penile augmentations among the ftm trans community. Meanwhile there's far less demand for male contraceptive among the fathers-to-be demographic. Justifying R&D in one but not much the other",
            "Uh…I googled this recently out of morbid curiosity (big mistake) , and I wouldn’t call those penises “functional”",
            "The surgery would be specialized and extremely expensive. \n\nMale birth control has to be cheaper and generalized for it to sell and be effective. \n\nPeople (mainly women journalists) like to joke about that one male birth control being scrapped because it made men have emotional swings but they failed bring up the emotional swings making them suicidal",
            "It’s in process. \n\nhttps://utswmed.org/medblog/pill-guys-male-birth-control-option-passes-safety-tests/",
            "[Actually, we have](https://www.bahco.com/int_en/heavy-duty-lightweight-hedge-shears-with-steel-handle-pb_p51_.html)",
            "They made one but we're bitches about side effects.",
            "Car batteries are still ancient technology.  .",
            "Apparently no one has said that trans male bottom surgery is *NOT* “100% functional.” \n\nYes, you can expel waste from it, but you have to shove a rod in it to simulate erection, and we also still don’t know how to create the ability to ejaculate any more than we have the ability to give trans women the ability to bear children yet. \n\nSo, OP’s very premise is wrong. We don’t have that, either.",
            "There a vasectomies that are easier to get rid of and don’t actually require sterilizing yourself entirely.",
            "Why do you want male BC? Get snipped or wear a condom.",
            "We have. Its called being a redditor",
            "You need to define “functional penis” I don’t think a man made penis that you can get a natural erection and urinate through exists.",
            "Priorities and social politics",
            "It’s been tested and dropped due to side effects that are much like the current birth control.",
            "Isn't male birth control a condom and or a cream you put on the penis tip called spermicide?",
            "FYI...\n\nMale Birth Control Options  \nhttps://www.verywellhealth.com/male-birth-control-injections-3970355",
            "My friend works for a VC firm in San Francisco and she told me that they've had several startups pitch their male birth control products but they're reluctant to invest because they don't think enough men will use them. Kinda sad, but I see their concern.",
            "Condoms are birth control",
            "it's called condoms",
            "Oh no, trans penises can't get hard my friend...",
            "My understanding is that the risk of permanent infertility is high and the side effects are very serious. That oft-cited study that “men couldn’t handle the pains women went through” is fake; the side effects were terrible, borderline unbearable, and made it impractical.",
            "Pretty sure that's called a condom.",
            "Condoms? You mean condoms?",
            "Because males controlling their reproduction is NOT in line with capitalism, or any stable economical system.",
            "Phalloplasty is as functioning of a penis as a raft you put together to escape an island. It does the job but it’s not a navy ship loaded with seamen.",
            "There are condoms.",
            "Technically a transitioned penis is birth control because they can’t produce sperm to have children.",
            "[deleted]",
            "They have one. It’s called Crocs.",
            "Don't know how it hasn't been said already but in a male birth control trial 2 guys commited suicide, the side effects of the pill were too extreme to be handled safely",
            "We have made a male birth control. Well Indian scientists have, in the ‘70s. It hasn’t been able to take off in the US because it would massively cut into a huge part of big pharma profits. \n\nThe contraceptive is called RISUG, it’s in clinical trials in India. Here the patent is called Vasalgel. It’s an injectable gel that goes into the vas deferens and acts as a filter to allow liquids to pass thru the seminal vesicles but hold back sperm. It has no side effects and is completely reversible. Hopefully someday this can emerge on the western market. \n\nhttps://en.m.wikipedia.org/wiki/Reversible_inhibition_of_sperm_under_guidance",
            "You can get [a silicone ring](http://thoreme.com) that goes around your penis and keeps your testicles in your inguinal canal. There is some evidence that this can cause temporary clinical sterility (< 1 million sperm per ml of ejaculate), but it seems pretty limited so far to me (only a few trials with relatively small numbers of participants). There seem to be very few side effects based on the existing research.\n\n\nApparently it's not even that uncomfortable. The worst side effects I've heard about are itching due to sweat.\n\nIf this actually works, I think it will still be a long time before it's approved under medical device regulations, so yeah, use it at your own risk.\n\nA couple of relevant articles:\nhttps://www.sciencedirect.com/science/article/abs/pii/S1761676X20300493#!\nhttps://onlinelibrary.wiley.com/doi/abs/10.1111/j.1365-2605.1987.tb00356.x",
            "Um condoms have been around for centuries",
            "Got the condom and there is a monthly injection currently being trialled. Supposedly there are SOME side effects so it hasn't left the control groups yet. (Apperently it's okay for women to have hormonal side effects but not men)",
            "It’s called a vasectomy.",
            "Because developed nations birth rates would nosedive even further if men could not be baby trapped.  Governments need that birth rate up yo!",
            "\"Functional\"",
            "We have?",
            "I mean I am not educated on this topic, but I work in a science field. And a lot of times progress on a specific topic is put into what people are interested in so......",
            ">functional penis\n\nI don’t think this means what you think it means.",
            "There's male birth control . it's called The Butt.",
            "that depends on your definition of \"functional penis\". In reality no artificially crafted slong will be like a natural one.\n\nNow waiting for the blue haired people to start downvoting me.",
            "“Functional” penis",
            "Best male birth control is being ugly, so it's all rng",
            "I imagine it's pretty hard to take the bullet out of the gun when there's like, what, 200 million new bullets made every day?",
            "I remember seeing a TED talk about this and aside from the side effects, one of the key problems with male birth control (which I rarely see brought up - I wasn’t even aware of it until I watched this vid) is that men are just so damn fertile all the time. Women on average produce one egg a month and we’re really only fertile for a 2 week period in that time. Men are CONSTANTLY producing sperm. Every hour of every day of the month. The amount of hormones that would be required to inhibit that completely mean that hormonal male birth control is just not really viable at the moment. That was my understanding of the issue at least.",
            "They did. It's called the jab.",
            "Because you can’t trample male reproductive rights like women’s.",
            "> we can give a transitioned male a functional penis\n\nPretty sure that no, we can't actually do that.\n\nThey can make it inflate to become hard, but that's not really fully functional, that's a hack. It doesn't get engorged with blood, it doesn't ejaculate, it's really not the same at all.",
            "A condom is male birth control.",
            "[removed]"
        ]
    },
    {
        "post_id": "d76b4r",
        "author": "blackcovenant666",
        "title": "Is it weird to go to the hospital just for the cafeteria?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/d76b4r/is_it_weird_to_go_to_the_hospital_just_for_the/",
        "score": 15970,
        "num_comments": 1026,
        "created_utc": 1569042090.0,
        "selftext": "Okay, so there's this bomb ass hospital in my town and I went to the cafeteria there while my mom was in the ER because she thought she was having a stroke but she just had floaters and dirt in her eyes, and the food was actually pretty good. Like they had a sandwich bar, and some really good loaded potato soup, and fresh sourdough bread, and free cucumber melon water. Anywho, I paid $4 for a sandwich and a soup that was really good and filling and I wanna go back. It's the cheapest place in town for food but I don't want to be known as the girl who \"keeps coming to the hospital to eat and isn't seeing a doctor\" but I also just want to have that loaded potato soup because it was really good.\n\n\nEDIT: OH MY GOD MY FIRST REDDIT GOLD!! THANK YOU\n\nEDIT 2: TWO SILVERS?? WTF THIS HAS NEVER HAPPENED. ALSO PLEASE STOP COMMENTING O HAVE 600+ NOTIFICATIONS TY\n\nEDIT 3: PLATINUM??? THIS IS THE STUPIDEST POST WHY AM I GETTING AWARDS? WHY IS THIS TOP POST? THIS IS PROBABLY THE DUMBEST THING I EVER WROTE, WHO ARE YOU PEOPLE?",
        "permalink": "/r/NoStupidQuestions/comments/d76b4r/is_it_weird_to_go_to_the_hospital_just_for_the/",
        "comments": [
            "I used to work close to the hospital in town and the food was pretty good and super cheap so a lot of the time if I didn't pack a lunch I'd just slide over there. Nobody is going to ask you weird questions about why you're there and I've actually hung out in the cafeteria when I did pack my lunch before just for some privacy and to use the free WiFi which a couple of other people seemed to do as well so as long as you're chill it's fine. I accidentally know where just about everything on the first floor of that place is now though because it's like a maze and I took a wrong turn and didn't know if I was going to find my way out one day. Started using fire exit maps to figure out where in the daylight I ended up at.",
            "Not at all. I work in a hospital and no one will even pay you a second glance at the cafeteria. Employees and visitors/families of patients are in the cafeteria all the time. Some patients (a select unfortunate handful) are stuck in the hospital for 1-2 months or more and I've seen family members there multiple times. If you become a regular, they'll think you're an employee (who's not displaying their badge) or a family/friend visitor.",
            "We go to to Ikea for the meatballs. I’m not buying furniture.",
            "Hospitals love money. As long as you're paying...you're good.",
            "I'm happy to know I'm not the only person that had this question. I found the same thing about a hospital when visiting my dad. The food was very good, pizza bar, salad bar, grill staffed with cooks. Everything was fresh and reasonable prices.",
            "A long time ago my great uncle was a owner-operator truck driver. He’d always go to hospital cafeterias since they’re relatively cheap and hold similar hours. Plus, they’re nearly promised to be clean.",
            "Nah, if the foods good go for it. A bowling alley in my home town has the best breakfast food and it’s cheap too.",
            "People do this at the hospital I work at! They literally just come to eat. If the food there is that good, you're likely not going to be the only person doing it.",
            "Some of my old co-workers actually went to a nearby hospital for their lunch break occasionally. I wouldn't say weird at all! Especially if it's a larger hospital and larger cafeteria, but even if it isn't I'd still say you're fine!",
            "No. Some hospitals have a thousand workers, and they eat at the cafeteria sometimes. If it is good, then go for it.\n\nI go to Costco just for a lame slice of pizza. No 48-can boxes of soup purchased.",
            "There's a great hospital cafeteria about 2 blocks from my mom's office, I've met her there on her lunch break before. It's definitely a thing. They have the most bomb-ass banana pudding there UGH you wouldn't believe it and it's so affordable\n\nAnyway I fully support this",
            "This sounds like the beginning of a Seinfeld episode.",
            "its fine trust me, and i wish your mom good health.",
            "My old college makes some really good chicken tenders. I graduated back in 2016 and still go in the cafeteria  at least twice a month.",
            "Nothing wrong with that at all. I go for breakfast to the local hospital's cafeteria fairly often. Around $3.50 for a big scoop of scrambled eggs, sausage or bacon, and a biscuit/gravy with a juice and coffee? You can't beat it",
            "My friends and I used to frequent the medical center's cafeteria in high school. No shame at all.",
            "Go for it. First, no one will care, or possibly even notice. Second, its not uncommon, especially among the older crowd. My mother and pretty much everyone she knows are regulars.\n\n\nThe places people will frequent are strange. One of my first jobs was working in a cafe at a small rural airport that got about three personal aircraft a week. We probably had like 30+ customers every day for lunch and the place was literally packed for breakfast.",
            "It’s all cool, some have really good food and low prices. My grandparents would go to their local hospital for fried catfish night every week. I’m happy to check in on any family staying in the hospital 1) to make sure they’re doing well. 2) for cafeteria food. Hospitals know they can make a small profit from the cafeteria. It provides a bit of comfort for visitors and they attract some repeat business. Honestly, if I was closer to a Houston Methodist hospital, I’d be stopping in for breakfast a lot.",
            "I work at the local hospital, and in our small community facebook page they share our menu weekly. No where in town can you get a full meal for $3.84. That's an entree and 2 sides. We have a delicious salad bar that's less than $4 for a large one. We offer home style meals, panini days, soups, and occasionally our cook from Thailand will make some of her favorite dishes from her country. You're helping to keep revenue local by eating at your hospital. I say eat there more often!",
            "You're still contributing to the hospital, wouldn't worry.",
            "I work in a hospital and there is a group of 12 or so older gentlemen that come in every weekday morning around 9am and have breakfast with each other in the hospital cafeteria. \n\nIf you are working and want something from the grill, you need to get there before hand or after 9:15 because they all order inlets or pancakes or whatever. It’s cute though, like a men’s club meeting.",
            "I knew a lot of people that used to do that in my hometown. There was this tunnel under the hospital that was technically meant as a storm shelter but was mostly used as a walking track, so lots of people would go there to walk and then have lunch or dinner in the cafeteria. It was just common knowledge and nobody cared at all. Some of the older people I knew would skip the walking and just meet for lunch at the cafeteria. It was a regular spot for them to eat and chat. They got to know the staff and the staff enjoyed seeing them come in and worried when they didn’t. And in the city where I live now, there’s a rehab hospital that has an actual restaurant in it that gets more business from employees at nearby businesses taking their lunch breaks than from anyone using or working at the hospital. At my last job, we would meet clients there for business lunches.\n\nIt’s perfectly fine to eat at the cafeteria. It’s basically just any other restaurant, but most people don’t think to use it. Just make sure you park where you’re supposed to and don’t take spaces reserved for the ER or patient release.",
            "No, and the food is usually reasonably priced.",
            "Actually when I was in university a few friends and I decided to visit area hospitals to see how the food was.  That was before the internet or we probably would have created a hospital food blog.   We didn’t have tons of money and enjoyed exploring around.  We found some pretty awesome food at cheap prices too.  All in all probably hit 15-20 hospitals.  Are only gripe was no beer!    So go for it.",
            "I work in a hospital lab and the cafeteria is for patients, visitors and employees. You would class as a visitor, nobody will be paying any attention anyway. I mean, you’re paying for it, right? and you don’t have to con anyone to get in. \n\nGo eat :)",
            "My brother was at the hospital for 9 months. None gave a f\\*ck about who is at the cafeteria, most people there have their own problems to worry about. You'll be fine",
            "If they are selling you without asking if you have a patient in the hospital, it implies that anyone can go and eat. \n\nIts not weird at all.\n\nInfact, in my country, we have government hospitals where food in canteens is available at pretty low price , many people come from outside and eat and no one objects.",
            "Jesus, where do you live that the hospital is the best food around? \nIt's either got the worst restaurants on the planet or the best hospital ever built.\n\nEdit: Now I think about it, my own local hospital had the cafeteria removed in a recent remodeling and they have a Marks And Spencer's Simply Food instead. They do some lush sandwiches so it's a good choice. They stopped the roast beef and horseradish sauce rolls though, they were the best.",
            "Go back! I work in a hospital in a college town and I see college kids coming in all the time to our cafeteria since it was really good and so cheap.",
            "Bruh back in my college days i used to go to the Hospital to take a shit because our campus' washrooms were filthy af lol",
            "Hahahahahhaa \"a bomb ass hospital\" I love this post",
            "No it’s not, there’s a highschool across from our hospital and a lot of students go there to eat. Also they put in a timmies which they go to. They have to be respectful of course. But the hospital makes a killing off them",
            "The hospitals in my city has some bomb ass food. They even have a professional chef and the food is cheap! I love it. I went all the time when I was pregnant for the breakfast.",
            ">but I don't want to be known as the girl who \"keeps coming to the hospital to eat and isn't seeing a doctor\"\n\nWho cares, you aren't taking up the time of the medical staff, and you eating the hospital food is better than the food going to the dumpster. \n\nSo bon appetit, as far as I'm concerned.",
            "My friends and I used to make the hospital cafeteria a destination!  It was cheap and there was plenty of food provided.  Unfortunately, a few years ago, the hospital raised their cafeteria rates to restaurant prices.  I'm not paying $6.00 for a hospital hamburger.",
            "I’ve just got out of hospital (well, my 2 year old daughter was the patient but I was obviously staying with her) after a week and trust me - with how many people that are in hospitals for long stays, I guarantee everyone will just think you’re the relative of a patient in for a long time. \n\nI can’t say I ever even noticed if I saw somebody multiple times in the cafeteria - most people have too much on their minds and the employees will forget your face the second you walk away, unless you’re a dick. \n\nDon’t worry about it - get that loaded soup.",
            "Absolutly not. My mother worked in a hospital kitchen for most of my life, and I grew up eating food she would bring home. Let me tell you, the TV trope of bad hospital food is bullshit. Maybe you get bland stuff of you're restricted by your doctor, but I can tell you that staff and visting family? They got from-scratch food.\n\nWhen I worked in town, I would take my lunch breaks there and eat with her and the rest of the staff. My father still goes there every now and again even though she retired a few years ago (she's a lunch lady now. We occasionally get school food now. Lol)",
            "Your mom is going to have to take one for the team.",
            "Definitely okay. The cancer hospital on my university campus has the best and cheapest lunch. Pretty common for people to go there just for lunch.",
            "Not weird at all. Use to work at a hospital in a small town. There were a few regulars that would each lunch there almost daily. Really nice people. My lunches would usually cost $3 or $4 and were really good. Who doesn’t love cheap, good food.",
            "When I worked hospital security, the local police department would always come in for breakfast. You could get a heaping plate of decent food for cheap! It's not weird, it's not like anybody knows or cares if you're there with a patient or not.",
            "Honestly, it’s my grandfathers new favorite restaurant.  He’s taken me there for lunch AFTER my grandmother got out of the hospital",
            "As long as you're not causing problems and there's no signs saying something like \"Patients Only\" or anything like that, you're golden. Enjoy your soup.",
            "One of the hospitals in our town is really popular for it's food. People meet there for lunch regularly. They have just about anything you could want and the most amazing desserts. I'm sad I'm not delivering my baby there in November because I'm worried the other hospitals food will suck lol",
            "Not weird for me. I used to cut the grass at a hospital with a bomb cafeteria and theyd give us the employee's discount. We werent employees. So on hospital days, nobody would pack a lunch because we'd get awesome food for around $3",
            "Omg my sister and I used to do this all the time. What’s up with hospital food being so tasty and cheap??",
            "Just look sad and preoccupied.",
            "I work foodservice in a hospital, we had an old dude who lives across the street who came in every day for lunch because getting soup and a salad was cheaper than shopping for it for himself. We don't care. Be prepared to share a table with someone if its busy, other than that, we dont really care.",
            "You do you. If it was me and I liked it, I would probably go back. I would be like \"I do not care,\" and go back. You do you. I mostly would not care because I pretty much do not care about anything, but that is just me. Anyways, you do you. If you like the food, than go again and eat it. That is totally fine. Who cares what other people say. What matters is what you want to do.",
            "Go for it man, they won't care.\n\nIf you ever feel weird about it volunteer to be one of the people that hangs out with patients. Nobody likes to be alone in the hospital, you might even get a friend to eat with.",
            "nobody cares that you go just to eat so if i were i wouldn't mind",
            "I work at a hospital. No one would care if you are just visiting the cafeteria.\n\n>  I don't want to be known as the girl who \"keeps coming to the hospital to eat and isn't seeing a doctor\"\n\nNo one is going to care, or know this. Pretty much the only people I recognize are other staff members. Every day I see people I have never seen before.\n\nGo enjoy that potato soup.",
            "You're also in the best place to choke on your food!",
            "Person:\"I see you come often. My wife is dying. I come here everyday, been five months now. So I know old faces and notice new ones. I know it can be hard just to enter the hospital. Saw you with a woman, you're mother I supposed. Is she doing okay?\"\n\nOP: \"Ma'am... have you ever had the potato soup here, ma'am?\"",
            "I thought of doing this. The hospital I used to work at has good cooks and good food. Honestly most people prob wouldn’t question it. Your just going for food. Not to hurt anyone.",
            "I was expecting someone to say \"I go with my friends once a month\"",
            "My wife and I used to go to the hospital for their milkshakes. I don’t live there anymore, but the milkshakes at the Provo Utah hospital were the best I have ever had.  I don’t know what they did or how they did it, but they were incredible. Unfortunately with their new health initiative they were taken off the menu, but I’ll always cherish the memory.",
            "Nobody is going to bat an eye, seriously. I am a med student so I constantly have lunch in hospitals. Having said that, I hate eating at hospitals because the food is almost always shitty.",
            "Haha 😂 we do that as well sometime we just go to hospital for the coffee cause it is really good and cheap. Don't bother about what people say or might think",
            "Don't worry about it! The amount of people I know who go to IKEA just for the food is crazy! \nPlus how do the people at the cafeteria know that you aren't just there more often cus you've a friend/relative as a patient or staff member? People are too wrapped up in their own lives to worry about what you're doing and more importantly, who cares? :)",
            "&#x200B;\n\nWhen I was in the army, we would go to the hospital because they had the best chow hall.\n\nAll the doctors were officers so they had the best food.",
            "Go for it! I work at a hospital and I promise no one is paying attention to who is coming and going and eating in the cafeteria. They’ll be pleased you’re having a delicious time!",
            "Not weird. Loved the hospital food in my old town, and there was parking within 100' of cafeteria entrance.",
            "They probably won't care but if you're feeling weird about it maybe there is some volunteer work you can do there to make yourself more familiar to the people in the area.",
            "Husband and I used to live right next to a hospital, it had great chicken tenders that were real good cure for a hangover. We both used to work at a much bigger hospital and saw people from other businesses around the area lunch there as well so we never thought anything of it, it may seem weird at first but there's nothing that says you cant.",
            "Why not? I've ordered food and ordered some as take out that way i had a delicious lunch for work the next day.",
            "We did that regularly when we were in the university as the cafeteria in the hospital was so much better!!",
            "I’m a student going into a health related field and for that reason our campus is next to a hospital. Our school doesn’t really have a cafeteria just some vending machines and a sandwich lady, so I go to the hospital cafeteria for lunch all the time.",
            "I used to work in a hospital that hired professional chefs for their staff. The cafeteria was known in the community and was featured in articles. I do not think it’s weird especially if they have good food. I think the connection between food and health is becoming more apparent and hospitals are realizing this now.",
            "The hospital cafeteria in my old college town used to get busy between 11pm-1am on weekends because it was one of the only places open that late besides your typical McDonalds, Dennys, Dominos, etc. Food was pretty good, great hot dogs.",
            "I go buy popcorn at the movies and don’t buy a ticket, bring it home eat it while watching movies at home.",
            "When I was a young teenager we used to take the train into Mass General to go to the cafeteria all the time. Super good.",
            "Fort Gordon, GA hospital had some of the best food on base. Loads of people eat there for lunch. My class did quite often while I was there for school.",
            "The hospital near my mums place over looks the Swan River. The cafeteria has floor to ceiling windows and on Sundays(at least they used to) they have a half price breakfast buffet. So fuckin good",
            "When I was stationed at Fort Belvoir in Virginia, the hospital cafeteria was the place to go. The food was tasty fresh and cheap. I used to walk 15 minutes to lunch just to eat there. \n\nsince then they’ve got a new hospital so I don’t know if the food is just as good… But back then it was great.\n\nSo yeah go for it. The cafeteria is subsidized by all that insurance money so I’m sure it’s great",
            "Doing that is common in Germany",
            "I work in a hospital, and people come here all the time just to eat in our caf. Especially breakfast-it's freshly made and dirt cheap. We even have an omelet bar MWF.",
            "I work at a hospital. A lot of people do that, it's not considered weird at all!",
            "I definitely go to the hospital cafeteria. It's next door to my college.",
            "LOL. In the past couple of years, I spent a few days at a time on 3 occasions in our local hospital while my partner was having surgery. I discovered that the hospital cafeteria had GOOD coffee by the bucketful for a couple bucks. I occasionally still run in there for a large coffee to go if I'm out running errands. I run past the two Starbucks and the public place, into the elevator, and down to the basement. Best kept secret in town!",
            "I go to the local hospital for the cafeteria for breakfast or lunch and I go to the bowling alley for great burgers and nachos. Both are cheaper and better tasting than any other restaurants in town.",
            "Lol if you’re paying I don’t see a problem!",
            "There's a Catholic hospital near me with some of the best fried chicken you can get. (Kentucky)",
            "Nope I go all the time.",
            "One place I worked was pretty close to a hospital with a similar setup. Good food, cheap prices and cute nurses. A group of us would go there whenever we could and since we were mechanics we stuck out like sore thumbs. I don't think anyone cared enough to notice so you do you.",
            "It's like a sizzler.",
            "My husband worked in a building that was shared with a hospital and would go to their cafeteria to eat every day. He worked for the company who shared the building with the hospital and would \"piggyback\" in behind someone who opened the door with their employee card.\n\nHe said they had the best corn nuggets he'd ever had in his life, and worth the trouble of sneaking in to get them.",
            "After having my blood drawn I popped into my hospital caf for a quick beverage and discovering they had a hummus bar, I’ve been back a few times just for the hummus.",
            "I've been in the hospital so much in my life that I've grown to like it. Had 2 transplants and several other minor surgeries so it's just the norm. Now whenever I visit anyone else in the hospital I have to eat there. I love their salads and chicken filet sandwiches. Something about them.",
            "I go to costco for the hotdogs.  The cafe is outside the store. I Don't have a membership but a hot dog and a drink for $1.50. Yes please.",
            "Not at all. The college I go to is right next to a hospital so a lot of us just walk to it and just get some lunch. The price is a lot better than anywhere else and the food isnt half bad",
            "My last two offices were very close to hospitals, a lot of people in the area would go grab food because it was reasonably priced and was a good variety of food that tends to change daily.",
            "Not at all.  Regional hospital nearby has great food, and many of the locals, especially police/fire, visit at lunch time.",
            "You can definitely do this.  Nobody will notice.  To the degree that they start to recognize you at all, they’ll assume you are visiting a long term inpatient or you are staff or a volunteer or something.\n\nI work at a hospital, and there’s so many people coming and going that nobody is tracking it as long as you’re not causing problems.",
            "It’s a perfectly normal thing to do. \n\nMy Grandfather would do this for the food and to hang out with professionals that had a hard job. He was retired and became a regular visiting the hospital for lunch. He was a friendly guy and good at small talk so I believe he was welcome part of that community.",
            "I don’t have an answer for you, but my mom has worked for a hospital since I was a baby. Sometimes on weekends she’d go in to her office and bring either myself or my brother along (usually me because I’m more patient). I’d work on homework or play on the computers.\n\nOne day we go down to the cafeteria and my mom says to choose a healthy option, so I choose a salad. And holy shit it is the most delicious salad I’ve ever eaten. It has strawberries, spinach, blue cheese, and walnuts. I’m not a fan of walnuts so I ate around them, but the rest was absolutely magnificent. Whenever she’d bring me along in the future, I’d beg her to let me get that salad.\n\nShe got transferred to a different hospital, so it’s been awhile since I’ve had the cafeteria salad, but I’ve recreated it myself.\n\nSometimes hospital cafeteria food is good!",
            "The children’s hospital near me has 4 good quick service restaurants and a Starbucks. It’s walking distance from my house. I’m a frequent customer. I’ve brought friends three who think I’m crazy, but there’s never lines and they’ve got a great view of the city.",
            "I work at a hospital and trust me no one cares why you are there. We just want to get our lunch quick so we can eat fast on our 30min break, bonus points if you let us cut ahead of you.",
            "You're buying a service from them, I can assure you they won't care.",
            "They’ll probably just think you work there if they see you in the cafeteria all the time.",
            "I used to do the same in college.",
            "There was a brand new hospital built in a fairly rural area. The cafeteria had a brick pizza oven and generally good food. The back of the cafeteria was entirely glass, had an outdoor patio, both overlooking a nice wooded area. \n\nIt was clear the hospital cafeteria was drawing a crowd that extended far beyond hospital visit traffic. \n\nSo my answer is no, not weird at all!",
            "Not in the slightest. Every hospital I’ve ever been to is open to the public, so the cafeteria is also open. They vary in quality and size, but you’d never know that the hospital in my hometown has some of the best cafeteria style food! And so many healthy options now. People who aren’t even in the hospital for any medical reason go there because it’s a cheap, healthy way of getting a quick meal. It’s strange but true.",
            "Oh my god! I thought I was the only one who does this. Lol",
            "People don’t care about what you are doing as much as you think. They are living their own lives and concerned about their own problems. The camera isn’t always on you.",
            "Hospital near me had great food. Not weird at all.",
            "Nope. Our hospital cafeteria food is supplied by a local company, eat n park. Monte Cristo and Cuban sandwiches are amazing.",
            "The teachers at my old school did that, the school was across from the hospital and the school cafeteria was as bad as you can imagine. I don't think it was cheaper, just a magnitude better.",
            "It's cool. People come to the hospital where I work for coffee because the line is too long at Tim Hortons, LOL. We don't mind.",
            "I go to my local hospital on a regular basis for the sandwiches.   Yours has a better selection of food.\n\nIf that's weird, then we're weird and I don't care.     \n\nThey have no idea who I am and I might very well be on staff or the relative of a chronically ill patient.    And it doesn't matter either way because they don't care.",
            "Hospital I worked at before had an awesome cafeteria, and with my badge it's 20% discount. \n\n\nFresh made pizzas, shrimp fettuccini, blackened chicken salad with pecans and balsamic reduction. \n\n\nMmmm.\n\n\nNo one cares who's eating in the cafeteria.",
            "As someone who has worked in hospitals for nearly 20 years, where is this magical place?",
            "I went to grad school that has a big teaching hospital. When we got bored of our cafeteria or were studying late, we’d go to the hospital cafeteria. Good cheap eats!",
            "Maybe. But I’ve wanted to do it too. The hospital where I used to live had a good one.",
            "As a medical student who spends a ton of time on the campus right next to the hospital, I do this nearly every day during the week\n\nNo it's not weird",
            "Bob Kelso did it for a while, I think it's completely fine.",
            "My grandma does this.",
            "Is a bomb ass hospital a good thing or a bad thing?",
            "I once audited a hospital and so ended up there for about three weeks.  It was an inner-city trauma hospital, so not fancy, but for some reason they had a wonderful cafeteria, and people ate there like it was a restaurant.  They didn't charge much, but enough to profit, so they were happy for the business.\n\nThe only problem would be if you were taking up space that others need.  But if they have enough seating, you're probably helping them.",
            "Healthcare worker here. Usually when I'm on my lunch break, I see at least three \"regulars\" in the cafeteria who don't work there (no scrubs) but seem to come eat and relax a lot. Nobody cares, and the food in most hospitals is pretty good and cheap. Nobody's going to judge you :)",
            "Nah. At my old job, a hospital cafeteria was the closest place to get food, so we went there all the time.",
            "I love eating at hospital cafeterias. Good food, WiFi, fishtanks, fireplaces, people tend to be kind and/or leave you alone.",
            "I used to live right next to the hospital in my town so when I was younger I would just go there for food bc it was good and way easier than anywhere else.",
            "It may be weird, but who cares.  Go eat lunch.",
            "My mom lives across the street from a hospital and walks over all the time for the cafeteria. You can get a huge, decent meal for less than $5.",
            "I work at a hospital with really good food. There are definitely people who come just for it. I'd say their burgers are some of the best in town.",
            "A highschool in my town is know for majority of the students going to the hospital for lunch since its the closest option that isnt school food or stuff brought from home",
            "No, and if it was weird, I would do it anyway. Why are people so intensely focused on what's \"weird\" and \"not weird\"? Who gives a fuck!!!",
            "When I was in college I lived in a dorm close to the medical center, and the closest restaraunt to me was a Wendy's in the hospital. I felt weird about going to the hospital for Wendy's the first couple times but I eventually got over it. Also I may have called my sister who is a nurse to make sure it wasn't weird and she said no.",
            "This is why I joined this sub.",
            "I mean, you're paying them, they're giving you food. It'd be weird and really scummy if it was a free food situation and you kept pretending that you or a loved one was in the hospital, but as long as you're paying, they're probably perfectly fine with it. Cafeteria is just doing its job, selling food. They're not gonna be mad because they're selling *more* food, are they?",
            "My cousin is a chef at a hospital and most of the traffic they get through the cafeteria is non-patients that just come for the food, so I would say no.",
            "I actually asked one of the workers in the cafeteria once, and she said people do it all the time and they don't care.",
            "We did this when we were in highschool, not weird. It's food and as long as they don't have any problems with it keep going if you'd like",
            "My husband works the admin side of one of the hospitals here. When he worked at the main hospital, there is a nice cafeteria, and it includes a chick fil a. It is not unusual for people who work nearby to come and eat there. \nNow he works in a different building and with no cafeteria and walks across the street to eat at the school board's cafeteria, which thankfully is nothing like what they serve at the schools😒",
            "And I bet your mom paid hundreds to thousands of dollars for that visit. If you can get a good deal on food there that's the only thing they've ever given anyone a deal on so definitely take advantage of the opportunity.\n\nAlso it's not like anyone is ever going to ask you to prove you have some sort of connection to the hospital or a patient to be there.",
            "Everyone in my town treats the hospital cafeteria as a restaurant, they have awesome cooks.",
            "There used to be on of the big urgent care facilities in my town that had a really good cafeteria right at the front door. They had really good deli wraps, good coffee and decent prices. Open 24 hours a day.\n\nUsed to go there all the time eat and they didn't mind. It was weird for sure.",
            "Wanted to study at the cafe in the hospital since vry little ppl are there but my friend refused. Haiz if only he is fine w it we can avoid studying in a crowded and noisy place",
            "Dude, if you’re enjoying your life, who cares what other people think is weird (granted you’re not hurting anyone).\n\nJust have a good time and revel in the things you enjoy.",
            "My hospital has the best and cheapest pizza around. No one cares if you come in and support their cafeteria. You are helping to keep it open. You could be there for any reason, and because of privacy reasons no one is going to ask. Go get your potato soup.",
            "Mt. Scenic hospital in Big Spring, Tx has a plate of french fries for 40 cents. Whole breakfast plates for just a few dollars.",
            "no one fucking cares if you go\n\nlmao there’s way more weirder people",
            "I used to go to this bar just to eat chicken wings! And I don't even drink alcohol!",
            "There's a guy at the hospital I work at (as a domestic) that comes in for his food every night",
            "Nope! One of the hospitals in my city serves AMAZING fried chicken so every week I believe on Tuesdays they advertise Fried Chicken Night and the line is usually out to the parking lot! I feel like hospital food gets dumped on a lot but I actually really like it (I work on a hospital campus).",
            "\"Okay, so there's this bomb ass hospital in my town...\"\n\nThat cracked me up so much! You go enjoy that food.",
            "When my mom was a reporter she said it was a known thing in the business that you go to hospital cafeterias since the food is usually decent, cheap and fast.",
            "The cook/chef at our local hospital is pretty well known and has been working there for 15-20 years. There are particular dishes for each day, and his specials are really good. I unfortunately had to spend a lot of time there this year, but the food was great, and best deal in town for some really great food. I know people from offices close by go there and get food. \n\n\nI just wish the health care at that hospital was as good as the food.",
            "Who is gonna say something?\n\n‘Hey weren’t you here everyday this week?’\n\n‘My wife is a coma, jackass’",
            "When my parents got divorced, my mom was an ER nurse and tight on money. My two younger sisters and I used to go see her on her break bc she could get us all food from the cafeteria and just have it taken out of her check. They had awesome food, it was cheap, and we got to hangout with my mom more, which was cool bc we went from seeing her everyday to just two days a week and every other weekend. I didn’t think much about it back then, but now 20 years later I cherish those breaks we got to spend with her. \n\nAnyways yeah, eat at the cafeteria as much as you want. I highly doubt anyone cares.",
            "\"Bomb ass hospital\" ahhh what a great line",
            "If you want to eat there, do it.  People will probably think that you work there, not that youre weird.",
            "Hospitals love money. If you’re paying for your food they’ll let you go everyday if you want. I work in the clinical nutrition department at a hospital and I know that the catering, retail (cafeterias,) and the patient menu chefs all work really hard for good recipes and service despite it just being “hospital food.” While it’s not a 5 star restaurant I think hospital food/cafeteria have definitely improved.",
            "The best diner in my parents town closed down and the old cooks took over the hospital cafeteria. It's the best food, and they (along with most of the town) go there often!",
            "Hospital food is the shit. If I could have the kinda food I got in my first psych ward then I'd eat there everyday",
            "Dad was laid up in the hosp for a few days so I was visiting for the duration. The cafeteria lady hooked me up with the employee discount saying, I know you work here! Later, I got a coffee and she says, Man, you know refills are free! Must be someone there I resemble.\n\nP.S. Food was also very good and reasonably priced with or without the employee discount/doppelgänger hookup.",
            "My kids HS is next to the cafeteria and a lot of kids go there for lunch",
            "The hospital in my town has the best subs I’ve ever had",
            "Yup. The cafeteria at a hospital around the corner from me had a delicious breakfast of blueberry pancakes and two scrambled eggs with cheese for $3.\n\nI must have hit that place up a dozen times, even though I had to park on the third or fourth floor of a busy parking garage.\n\nThey then stopped offering the fresh blueberries, so I stopped going.\n\nThey were the bomb though, made right in front of you on the grill.",
            "Nope! I used to work as a cook at a hospital and this happened all the time",
            "After my emergency csection with my first, I couldn’t eat forever. The first thing I had was a hospital grilled cheese....it was also the second, third, fourth, etc thing I ate while there.\n\nWe still go back sometimes and sneak in the cafeteria just for $3 grilled cheeses. They are so. Damn. Good.",
            "get yourself a pair of scrubs matching the hospital's and they'll just think you work there",
            "Bro I go to one in my town too, no shame. Awesome burger and probably cheapest burger in town!",
            "Back when I was in high school, the hospital was directly across the street. At lunch time, everybody would all cluster over to the hospital food court. Everyone at the hospital hated it obviously, which only started making sense after I realized that it made horrendous wait times for all of the hospital staff just trying to get a coffee on their break or something. I tried to stop going when I learned that, but now I sometimes drive past the school around lunchtime and still see the herds crossing the street, so I guess not much has changed.",
            "Honestly, hospital food is super good. Idk why people always joke about how awful it is. Also, surely there's enough people going in and out of there that no one would notice that you're not there for an appointment",
            "No, but sometimes having fancy food for doctors in the cafeteria is designed to mollify them and compensate for other problems in the hospital's administration/budget.",
            "I work security at a hospital and we don't let anyone just walk in and use the cafeteria you have to be visiting a patient. Unless you work there.  Sorry. Don't know about that hospital though. Worth a try I guess.",
            "Don't worry.  After all the scans they do to determine that someone hasn't had a stroke get denied by your mom's insurance or Medicare (as they frequently are when someone hasn't actually had a stroke), you won't be able to afford such largesse as a $4 lunch ever again.  It'll be damaged packs of ramen and rainwater from here on out as you try to discharge your bankruptcy.\n\nAssuming you live in America, of course.  If not, keep enjoying it!",
            "Yes. If you fake abdominal pains just so you can be admitted and go to the cafeteria, then it's a bit questionable. But if the food is REALLY good, then, well, maybe it's cool.",
            "It IS weird. But there's no harm in it.",
            "Probably not, but you could always buy a pair of scrubs to wear while you eat as camo.",
            "Nope and I'm not sure if the cafeteria is owned by the hospital but if it is you're supporting a good cause.  A hospital I stayed at had AMAZING food, it catered for staff, visitors and patients and locals popped in as well, all the money was going to the hospital coffers so it was supporting the care they were providing.  It offered respite and assistance to people with chronic illnesses such as Rheumatoid Arthritis so I think it's great that people wanted to eat there and support the place.",
            "Naaah, you aren't weird. I do this all the time. A hospital near my house has a Starbucks in their compound, less people know of it and less queue. So yes it's a win win situation for me.",
            "Unless that particular venue has some bizarre subsidy that I don't know of, or they're just swamped with customers, which I doubt, then go for it.",
            "The cafeteria staff might just think you work there. Most hospitals have so many staff members that you wouldn’t know everyone and what their position is. I wouldn’t worry about it.",
            "There is really good food in a Harley Davidson near me, I don’t go for the bikes.",
            "Hospitals are usually provided with their food from an outside catering company, you could find out who the company is and try and find another place they supply that isn’t a hospital, and go there instead.\n\nThat being said, I don’t think going to the hospital to eat is weird, as long as you still pay. You’re technically not going to the hospital, you’re going to a cafeteria which *happens* to be inside a hospital.",
            "People used to go and still do to my highschool to eat lunch. Its pretty normal.",
            "Is it weird to go all the way to the airport for a cup of coffee and a slice of pie[?](http://www.allmyfriends.it/bale2.jpg)",
            "Keep going, you're funding the hospital too",
            "Why not? \nThe hospital where my grandparents always got hospitalized has a huge mall (literally connected, it's one of the buildings belonging there, even has a special rehabilitation center in it) , people go there all the time even without someone in the hospital...",
            "Sounds good to me.",
            "There's a hospital near where I went to college.  We used to ho to their cafeteria weekly for lunch. It was great!! Lots of people did. Not a big deal at all.  \nIt's changed now and is just food outlets like in a mall food court.  Not nearly as good or economical.  I miss that cafeteria.",
            "You have you break one of your friends’ legs now",
            "Al Franken talked about this on his podcast recently. He said that as a result of the Medicaid expansion from Obamacare rural hospitals had increased budgets and better food. He gave one example of a town where the hospital cafeteria was the best restaurant in he town, people would come just for the lasagna.",
            "Many years ago, when I was in grad school and my wife was an RN at the county hospital not far away, when she worked the night shift, I would often go over and have supper with her in the cafeteria. But that was just to keep her company, not because the food was so great.\n\nBut hospital cafeterias are mostly contracted out these days, so the average menu may have improved. And if it's cheaper than other places near you -- yeah, why not go there? Good food is good food. And no one else is going to know you're not visiting someone. Enjoy.",
            "I go to my local hospital for the omelettes.  It cost about $ 3.50 and you can get four eggs with almost whatever you want in it.",
            "Yes, it is weird. But weird is good!",
            "It’s a bit weird but don’t let that stop you",
            "It's not weird at all, IKEA and a mechanic shop start selling meatballs and hot dogs, people go there all the time just to eat. Do it! Good food is good food.",
            "Have you tried just making your own Potato soup? Else wise I don't think it's really an issue. In our city, lots of store owners go to hospital cafeterias for snacks during lunch break, it's not that uncommon and who is to judge? No one knows if you have a relative in the hospital or not.",
            "The hospital near me has great food, but it isn’t cheap. I’m jealous.\n\nI’ve had a lot of generous nurses and doctors give my family meal tickets whenever we had a family member in extended hospital stays.",
            "It's a pretty common thing in my town for people who live and work around the hospital. I personally wouldn't do it because I hate hospitals, but I don't see anything wrong with it in theory.",
            "Do you live in FL?",
            "I did this when my mom actually had a stroke, you are not alone. I visited the hospital a few times after she was out, had to get a visitors pass and everything.",
            "my campus is right across from the hospital, i go there a couple times a week because the food is bomb :p",
            "I don’t think it’s weird. I do this all the time actually. My husband and I don’t usually have time for evening dates with three kids. But we love breakfast dates when the kids are in school. And our favorite place to go is the hospital cafeteria. It’s cheap and delicious!!",
            "They have a cafeteria there for a reason.",
            "Our dad discovered hospital soup when our mom was hospitalized, After she passed, he went back regularly for their soup.",
            "Just go! If you like the place, and are paying theres nothing wrong with taking advantich of a good, cheap place to eat :) \n\nSorry for bad spelling, hope you understand it",
            "Kind of but it's pretty funny\n\nEdit: not sure why I said \"kind of\" because there's one of those modern retirement communities near me (it's like a resort) and they have this amazing cafe that's dirt cheap. Love it.",
            "No!!  It’s awesome! There are some fancy private hospitals where I live, and I always sneak in to eat their cakes and pies. And their prices are not too bad. I just put on serious/sad face, and usually go alone.",
            "My aunt shops at hospital gift shops. It seems a little odd at first, but they actually have nice gift items. So, I'd say enjoy your soup.",
            "Totally fine! My father in law works in a hospital and eats there everyday.  He said he sees some regulars that neither work there nor are visiting sick family.  It’s 3.50 per meal at lunch at his hospital and he said the food is good.",
            "Grew up in a rural area in the south. If you wanted to eat on a Sunday, you had to go to the hospital. Used to see the cafeteria packed on Sunday after church let out.",
            "No one will notice, promise. In large hospitals there are just far too many people with staff, patients and visitors to really notice anyone. I once worked at a really small hospital with really really amazing food there for super cheap and I even though I ate there most days I wouldn’t be able to pick anyone I didn’t directly work with out of a line up.",
            "Do what you want! But now I'm super confused by all these hospitals that apparently have *good* food . . .",
            "My uni campus is next to a hospital, and me and my friends frequently go to the hospital just for the food. It's totally not weird",
            "That tends to be a thing poor traveling folk do cuz its healthy and cheap but if it's good, more power to ya",
            "Depends how sick you are.",
            "I don't see why not as long as you're spending money and not loitering about. If you feel bad about it, you could always make a donation to the hospital and eat guilt free!",
            "Ye it’s weird but there’s nothing wrong with it",
            "No, the hospital in my town also has bomb food.  My uncle likes going there for a philly cheesesteak lol",
            "You do you. Wrap your arm up like you just gave blood",
            "I do this sometimes. It’s super cheap and I like their fries",
            "Hospital Administrator here. We love it when the community comes in and eats at our facilities. We want people to visit our campuses as much as possible so that when they do need medical care they choose us instead of another hospital. \n\nPlus we do make a tiny profit off of the food so that always helps too!",
            "I used to deliver donuts and stuff to a hospital and got to know the staff pretty well. One day I had a meeting with the director of the kitchen in the afternoon and I missed lunch so I just ate at the hospital. It was so good I started going by in the afternoon to collect the empty trays instead of just grabbing them the next morning so I could eat the food. As you mentioned the food was really good especially in the doctors cafeteria and cheap as hell they used to charge me like $2 for a 3 course meal. It's not weird at all.",
            "Nobody cares you go to the hospital to eat. By that I mean nobody except for maybe the person serving you will even notice you are going every day. While I was in high school junior and senior year we were allowed to go out for lunch, we would all go to northwestern university hospital and eat at their cafeteria (downtown Chicago) it was the cheapest place and it was good. Go eat wherever you want and forget about what anyone else thinks.",
            "In 8th grade, my friends and I would walk to the hospital for lunch. :) It was good, quick and cheap !! I've always loved the hospital's food.\n\nOn the other hand, when my grandfather was admitted to the French hospital in our town, he got cold rice and coffee for breakfast.\n\nHe said he was very hungry when he got home lol",
            "The cafeteria is the best part of our local hospital",
            " Hell no! If I lived closer to a hospital, I would. Good food for a decent price.",
            "Unless it's a publicly funded hospital that's losing money on every meal or supported by charity or something (i.e. is anyone losing money feeding you?), I say go for it. \n\nI assume you live/work nearby, or it wouldn't be worth it. You can say so to anyone who's curious. Otherwise they'll probably assume you work there or you're visiting someone.",
            "We all go on cruises for the buffet. Let's be honest here, that 24/7 buffet is the greatest!",
            "Where did you get your Chicken?\n\nIkea\n\nNo your Chicken, not you Kitchen.\n\nYeah, Ikea.\n\nThis bullocks has gone deaf or lost the fuckin plot.",
            "Don't you make it with pigeon peas?",
            "I worked in a hospital cafeteria for a while and we had a few regulars who came in just for the food, don't worry about it, people definitely do it.",
            "Are you in Rochester, MN?",
            "The hospital near my college has a 24-hour McDonald’s. (Yes, it’s in Florida.) It’s always packed at 3 a.m. right after the bars close.",
            "Hospitals with cheap cafeterias exist? All of the ones where I live are painfully overpriced.",
            "I mean, i go to the ER almost every night because I don’t have WiFi at home and it’s pretty much guaranteed to be open 24hrs",
            "The children’s hospital by my home has fresh soup daily! They make this delicious pumpkin soup thing and I always look forward to taking my son to this pulmonologist appointments just so I can get my dang soup afterwards",
            "I love this sub",
            "I don’t think it’s weird. The children’s hospital here has an incredible Cafeteria  that’s very affordable. I’ve thought about going there many times but haven’t just due to proximity.",
            "Every hospital I’ve been to has had the worst food",
            "My hospital has bomb as apple crisp. I lived off it when I was in the hospital when my daughter was in the nicu (she’s good now :)) \n\nYou beat believe anytime I drive by I get me some apple crisp",
            "It's a pretty common thing to do in some city areas.",
            "Lol we used to go to the hospital after the bar. Only problem with hospital caf is it's far to park and walk. And there are sick people there.",
            "Go for it. We have a local eye clinic that is pretty well known as a great place for lunch. They also make great brownies.",
            "I do it too but I know it's sorta weird. Shows how good the food is.",
            "i forget what hospital but one near me has a good cafeteria apparently and my grandfather (or maybe his friend?) took a girl on a date there. maybe out of the ordinary but not against the rules",
            "Nah its a thing people do i used to be in a town where the hospital was close to the local rock club and it was pretty common for the hospital cafeteria to be full of people after the shows",
            "Nope, I worked next to a hospital for years. All the companies that shared the plaza got a food discount there. They encouraged people from the outside to come for food",
            "Even if it is they think you're staff after a few months and give you a discount. At least that's my experience from using their salad bar. So, it's worth it to me.",
            "Nobody is going to notice. However if I knew you personally and I found out you did that, yeah I'd think you were fucking crazy.",
            "Let’s circle back to the god eats and for now focus on where you can go to the hospital for floaters without being charged a few grand.",
            "Not at all. You're even indirectly supporting the hospital.",
            "Lehigh valley hospital cedar crest. One of the best hospital cafeterias I've ever been too. My mom goes there for lunch sometimes.",
            "The cafeteria at my wife's job (university) is fire af.",
            "My local hospitals all make you sign in with Photo ID and ask you where you’re going within the hospital... it’s the only thing stopping me from going back to the amazing coffee shop inside of the hospital",
            "I go to Costco for the hotdogs and smoothies. It’s ok.",
            "No not at all. People do that all the time.\n\nEdit for perspective: Am nurse.",
            "I found an amazing cafeteria when I was a Med student. I went back for years! \nGo for it!",
            "The hospital I used to work at had people do this all the time, between the cafeteria and the coffee stand.",
            "Not at all. There used to be a hospital just up the block from my HS and we'd get lunch there all the time. It's usually pretty cheap and not awful",
            "Nope",
            "To be honest, know one is going to know whether or not you're coming in just for the food. Some people might even think you work there. There are several jobs at the hospital that you can just wear street clothes.",
            "When I was a kid my dad used to take to Sams Club or Costco just to eat the pizza.\n\nIt's pretty good pizza tho.",
            "Just get some scrubs and wear them when you go there",
            "I used to live across the street from a hospital and didnt have a car. I always went to that shit",
            "You'll just have to injure yourself to avoid feeling self-conscious"
        ]
    },
    {
        "post_id": "k48wll",
        "author": "None",
        "title": "Why are we surprised there's so many conspiracy theorists when we have hundreds of years of illicit, covert government operations that have been actually documented?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/k48wll/why_are_we_surprised_theres_so_many_conspiracy/",
        "score": 15959,
        "num_comments": 836,
        "created_utc": 1606781141.0,
        "selftext": "I mean it's kind of like the opposite of the boy who cried wolf, right? He constantly lied, so no one believed him. What if he was constantly doing weird, illegal unscrupulous shit and saying, \"Nope, nothing to see here.\" Wouldn't you start to make up theories about all the other weird shit he's doing?\n\nI don't know if I'm expressing this logically, but really, wtf aren't there MORE conspiracy theorists with all the covert shit our government does?",
        "permalink": "/r/NoStupidQuestions/comments/k48wll/why_are_we_surprised_theres_so_many_conspiracy/",
        "comments": [
            "It's not so much conspiracy theories as unreasonable conspiracy theories. There's a big difference between the US secretly trying to destabilize some foreign nation they don't like and them working together with all the nations including the ones they don't like to convince people that someone walked on the moon. Or convince them that the world is round.",
            "The idea that some conspiracy theories are right is essentially a kind of \"survivorship bias\"; we're only looking at the ones that turned out to be right, rather than conspiracies as a whole. If there's 100 conspiracy theories out there and 10 of them turn out to be right, that's a 90% false positivity rate, yet we'll all focus on those 10 times they were right.\n\nIt's the same kind of psychological effect behind \"The Simpsons predicted...\". It's looking at things retroactively. The Simpsons isn't making predictions. It's a show that plays close to society and pop culture. Given the hundreds of episodes and the infinite amount of time for any \"prediction\" to come true, it's only a matter of time until something happens that resembles something in one of the hundreds of episodes made over decades, and we jump on it like a prophecy rather than a coincidence we're only noticing because we have the confirmation bias to look for it.",
            "[deleted]",
            "There's a difference if having healthy skepticism and saying 'this might be possible, I could be wrong, it needs to be supported by evidence'. What scares me is how unscientific and incapable of exerting some nuance and hesitation in their opinions people can be. What scares me is people incapable of admitting that they were wrong, and not attuning their opinions to actual evidence. Like, covid, when we didn't know anything about it, it made sense to be skeptical of it's scale. But hundreds of thousands of people die, world economies crippled, and you think every country is somehow working together and wants this? It's delusion at it's finest.\n\nConspiracies can be true, but believing in something after it's disproved time and time again, or doesn't actually have evidence to back the claim, is unscientific and frankly, disappointing. I can see the comforting and attractive nature of conspiracies, but it seems like our educational system really let a lot of us down.",
            "There's a limitless number of possible conspiracy theories. NASA is completely staffed by genetically-modified chipmunks disguised as humans. Monsanto is hiding seeds in their weedkiller agents to grow an army of plant zombies.\n\nThe difference between these ones I just made up and the most popular ones (like ones involving the moon landing or 9/11) is that the popular ones have semi-ambiguous questions that people of average intelligence or knowledge may have trouble answering.\n\nFor example, the general public may not have an answer to the question of why the flag on the moon is portrayed as fluttering on a surface with no air. People may write off, without evidence, that it must be due to a breeze from Earth. People who are capable of looking up additional information can find, from reputable sources (supported by corroborating sources), that [the flag's ripple was the result of an error in the telescopic rod's setup](https://abcnews.go.com/Technology/story?id=97589&page=1).",
            "Because there are people who believe literally everything they are told that goes counter to an official narrative. Even the craziest batshit unreal stuff. It totally undermines any credibility in anything they say really. Maybe it's true that covid was made up to deny people their freedoms, but yeah Fred, you also believe that the queen is a Nazi lizard from inside the hollow earth. What the fuck am I supposed to do with anything that guy says really. I'm genuinely better off ignoring everything he says.",
            "> Wouldn't you start to make up theories about all the other weird shit he's doing?\n\nYou make valid points, except this question is absolutely where the problem lies. People are justifying their poorly thought conspiracies and wild ideas just because of the past lies and cover-ups. \n\nLies and cover-ups are reason for healthy skepticism, not full blown belief in things easily debunked to the point your beliefs resemble mental health issues. The conspiracy theory trend among the right wing currently is one of the scariest and least healthy things I’ve ever witnessed from a civilian population.",
            "The problem is not the amount but the really poor reasoning behind some of them",
            "All governments have something to hide. Disinformation is also a thing, it was somewhat of a natural process for 'conspiracy theorist' to be a slur: call someone a conspiracy theorist and others automatically/subconsciously discount them as crazy or odd. Intelligence agencies capitalized on this, and welcome the weird shit about moon hoaxes and flat earth, it helps to bury the more serious real stuff like torture, testing syphilis on poor people, undermining governments etc. Another thing is it could be considered a bad thing if every government was 100% transparent, it would be much easier to have hostile takeovers if your enemies knew 100% about you.",
            "It’s a big leap from the CIA/FBI experimenting on groups of people inside the country and Obama is a pedovore who grooms children, has sex with them, and then eats them.",
            "There's nothing intrinsically wrong with conspiracy theories. Conspiracies happen and are possible.\n\nProblem is conspiracy theories tend to be garbage. They aren't grounded in any evidence. People put forth conspiracy theories to explain what they see the same way ancient civilizations credited divine activity for the things they saw.\n\nSee a thing. Make up a story to explain it. Take a nap.",
            "The issue is the consistent lack of evidence. Most conspiracy theories are based on outright made-up nonsense (like that 5G will give you cancer or that Bill Gates is trying to track people with vaccines). \n\nAnd even if they're more plausible, they're asserted without any evidence. The conspiracy is never \"This guy conspired with this guy\" it's always \"The government\" or \"Rich people\" because the conspiracy theorist doesn't have any idea who they're even accusing.  \n\nConspiracies do happen, but they're difficult to pull off so they're relatively rare. As the old saying goes, extraordinary claims require extraordinary evidence.  It's not enough for something to just be *possible.*",
            "I largely agree with you, but I would also say, exactly *because* we know so much, it hardly makes sense to make conspiracy theories. This is a point by Noam Chomsky: why even begin with conspiracy theories, when *we know* for sure—when in fact it is wide out in in the open and not even attempted covered up—that the US government is responsible for some of recent history's most atrocious war crimes? Even some of the most far-out conspiracies don't hold the US government responsible for things that are worse than initiating the Vietnam War on illegal grounds, which we know for a fact they did. So while some conspiracy theories may be true, and most are probably less so, I think a fair question to ask is \"why bother?\"",
            "It's gotten to the point where most people believe in things that are commonly called conspiracy theories.  We talk about these things with friends and family, but there's not really any point in making any big announcements.  It all is what it is, and there's very little we can do to change things.\n\nBut it is nice to see this question accepted by /r/NoStupidQuestions, as reddit doesn't exactly cater to folks that are resisting government and mainstream media narratives.",
            "To be I think it's because so many of the conspiracy theories end in me wondering: why would they do that? \n1. Why wouldn't governments want us to know the world is flat? What do they have to gain from the 'lie' that it's round?\n2. Why would USA fake the moon landings? Imagine the embarrassment, if it was discovered!\n3. Why would 9/11 be faked just as an excuse to invade the middle east? USA could just...invade?",
            "Just saying, the biggest controversial conspiracy theory at the moment is that the government is running a secret pedophile ring. This isn’t that unbelievable considering we found out that Epstein was literally doing this.",
            "https://www.reddit.com/r/conspiracy/comments/4g7jay/updated_compilation_of_confirmed_conspiracy/\n\nhttps://www.reddit.com/r/conspiracy/comments/8ofgu2/heres_a_list_of_33_confirmed_conspiracies/",
            "If we think we are unique in crazy things our populous believes, the rest of the world wants us to hold it’s beer. We are flawed just like the rest of the world is. I find comfort that it is a worldwide thing vs just America has crazies.",
            "Governments lie. History is only written by the winners and is heavily altered to show your leaders in favor.",
            "You can't prove a negative so the burden of proof is always on the person making the claim. Like you can't prove there are no unicorns on the planet. You'd have to have omniscient power to observe every inch of the planet simultaneously to say there are no unicorns anywhere on the planet. But if you claim unicorns exist you'd only have to show one to the skeptics to prove they exist. Likewise, if someone says the earth is flat the burden of proof is on them. It isn't enough for them to cast a little bit of doubt on every bit of evidence indicating that the world is round. They have to come up with indisputable proof that the earth is flat. \n\n\nThe primary reason people don't believe conspiracy theorists isn't because they are making extraordinary claims. It's because they typically employ an unscientific methodology in reaching their conclusions. Often times their confirmation bias is ridiculously skewed. They show an almost comical willingness to accept anything that would validate their beliefs and an unreasonable scepticism of any evidence that plainly disproves their theories no matter how valid and conclusive it is.",
            "In hindsight it feels certainly like we have good documentation of government operations but, in reality, we have less than you think.  The birthplace of modern conspiracy starts around the assassination of JFK.  At the time, information was intentionally muddied, and to top it off there were already a large set of boundaries in the way of this information.  Not only did multiple government officials/agencies have the motivation present to easily have blame cast upon them, but Lee Harvey Oswald never had his day in court.  He was murdered just days after the event.  No matter who you think is really responsible, the result of this ended up in thousands of books being written with different sources and biases, continuing to bog down the legitimate information we had about the assassination. \n\nTrust in our government to tell us the truth dwindled and continued to do so drastically over time.  It became commonplace to question our government, but this skepticism ended up becoming misguided because of who was controlling the narrative.  The far right, which thrives on conspiracy, was able to capitalize on every event the government butchered.  Ruby ridge, Waco, OKC bombing.  \n\nThe biggest misguidance in these situations, which you’ll hear often, is ‘government cover-up’.  When you hear that, you think ‘government commits malicious acts and falsifies evidence to confuse the people’.  In reality, government cover up is an accurate term with inaccurate application.  The biggest crimes our government committed in these instances, that which they tried to cover up, was not malicious intent, but rather an immense incompetence in systems that failed to resolve situations.  \n\nOf course, there are times where it is malicious.  There are legitimate conspiracy theories that take only factual information and, instead of saying ‘we know for sure this is the problem’ it says ‘this is likely the problem, it’s where all the information points, but it’s not enough to prove it.  Stay skeptical but don’t be fucking stupid’.\n\nWhen someone says ‘Do your research’, they aren’t just wrong and I think we all know that.  They’re wrong because he context is usually about something that research tends to debunk, not support.  There are good people doing good research on far more legitimate conspiracies, and their reputation is ruined by jackasses who turn everything into ‘the globalist agenda’ or whatever.  \n\nTLDR:  Most of the time, our government is trying to cover up just how bad it is at doing it’s job.  This inherently sows distrust which allows (primarily) far right / anti-science groups to spread misinformation under a trustworthy guise.  Because we cannot trust information, most of us naturally turn to confirmation bias.",
            "People associate conspiracy theorists with stupidity or being crazy because we're programmed to think of conspirators as such. The same thing is done to people who sue major corporations, to manipulate the public. Making it seem like a ridiculous thing to do.",
            "Just because you’re paranoid doesn’t mean they aren’t after you\n\n-Kurt Cobain",
            "Google USS Liberty and the Lavon Affair to find out more!",
            "And what’s shungite?",
            "Because the CIA did a great job back when making the word \"conspiracy theory\" a dirty word and associating it with the loons you see on tv.",
            "excellent point; the real problem is mass belief in the conspiracy theories that have no proof and sinister agendas for spreading, while ignoring all the sinister conspiracies for which there is proof and that actually need addressed",
            "One of the most genius rhetorical questions ever stated...^^^\n\nIronically in 'no stupid questions'.",
            "Its not that conspiracy teories exist but just how far-fetched and insane some of them are.\n\n\nAcorporation using propaganda to monopolize on something? Sure, not easy but within realms of possibility.\n\n\nA tiny group of people who think they're better than anyone else somehow setting aside their pride and differences to take over the world? Come the fuck on, the logistics alone regarding doing something on such a monumental scale over a such insane period of time makes it impossible to do in the first place.\n\nNo amount of money and power will change the impossibility of this task, like come on use your common sense lol.",
            "People would rather stay in blissful ignorance",
            "watch the edward Snowden movie on netflix. That will open many minds.",
            "I think the surprise is more around the willingness of (especially) the current USA conservative party and their media to exploit them and even invent them to further their agenda. That is somewhat new. They have always existed, they just have never been celebrated to this extent.",
            "Well, I think the more outlandish theories are the ones the general public think of when they think of conspiracy theories. When you lump lizard people, chem trails, and flat earth with government corruption it's a great way to discredit all. Like throwing the baby out with the bathwater. \n\n\nIt's also hard for the average person to swallow. It's scary and you feel powerless so might as well not think about it at all.\n\nI knew a guy who struggled with mental illness pretty bad and his treatment was to stay away from magical thinking. So he now doesn't believe in anything that isn't mainstream at all. It's a defense mechanism. Doesn't matter if you have proof he needs to believe in stability and normalcy or he will get unhinged. But the issue is he has to fully believe it's all wrong so he ends up being very close minded and seemingly seeped in ignorance and denial. It's like he seems as crazy as the crazy conspiracy theorists but for the opposite reason.",
            "There's no intrinsic problem with making up conspiracy theories.\n\nIt's what the theorists do after making up a theory.\n\nThey post it on the internet to make themself seem as the only enlightened awoken knowledgeable person and create a bandwagon of people, take money from them, and keep telling them that all of you are the only ones who have been awokened or enlightened and all the rest of them are blind sleeping fools.\n\n\nThe problem then becomes people start treating it like they do religion.\nIt doesn't matter what your science or common sense states. It's what I choose to believe.\nSo fuck you. I am right.",
            "I have a few problems with conspiracy theories. \n\nThe first one is that they seem to assume that the government is competent enough to plan and execute these elaborate plans. They really aren't as collectively smart as the theories give them credit for.\n\nThe second problem I have is that there is no evidence for the theory, and no way to gather evidence. What's the point in coming up with a theory (more like hypothesis) about something if you're just going to assume it's true and not try and prove or disprove it?",
            "I think using “conspiracy theory” to describe someone’s opinions is a way to use it as an attack to shut them down immediately.",
            "It's not exactly helped by the fact that wild, more extreme conspiracies are actively spread in an effort to deflect away from more grounded information that entities within governments or even corporate interests wish to keep quiet.\n\nOr the relatively recent phenomenon of using conspiracies to rally disparate groups around a specific political movement or candidate. Flatearthers, anti-vaxxers, and satanic elite believers have been coalescing under the Q banner which is trying to drive them all towards the idea that only a strongman authoritarian with the willingness to arrest, deport, and possibly even kill the people keeping us in the \"matrix\" is our only solution to save the country and the world.... and \"western culture\" is the frontline.\n\nWhich is odd and ironic considering how quiet people in general seem to be regarding this apparent massively coordinated effort to legitimize nazi-style ideologies in nations around the world..../s",
            "This is one hell of a circlejerk \"question\" if I've ever seen one",
            "I am not surprised there are so many conspiracies theories, but it is annoying.\n\nI think what is troubling is there are conspiracy theorists that go too far.  There are those who eat up everyone of these THEORIES and accept them as FACT.  And then they spread them fanatically like religious dogma.\n\nThis is related to the fake news phenomenon. I don’t really care about conspiracy theories. I care about conspiracy theories with some associated facts. Now you have my interest.  At some point, this becomes simply obnoxious in its outlandish flaunt of plausibility and fact.\n\nWorse, it becomes something people believe.  This is the scary crazy aspect of social media we don’t like to talk about. People are running around believing that rumors are factually reported journalism. Society is going to collapse. Thanks conspiracy theorists.",
            "My favorite conspiracy theory is Alex Jones is a CIA operative. I think he's planted to sprinkle in a little bit of accurate information, then follow it up with talking about how Hillary Clinton is actually a Vampire child bloodsucking zombie pedo. At this point, if Alex Jones says something it almost discredits the piece of information.",
            "It's sort of the difference between keeping a secret that requires a few dozen people or less to keep quiet vs a secret that requires thousands or more to keep quiet.",
            "I'd argue that religions are essentially conspiracy theories, and if we've been doing those for at least 6000 years, what's a pedophilia ring run out of the basement of a strip mall pizza shop more?",
            "The impossible makes more sense to them than reality because...the bilble",
            "“hundreds” documented? source?",
            "it's not surprising to not trust the government, but saying they're doing tons of stuff with no evidence isn't rational",
            "Yeah, it's not like the government would purposely give people deadly viruses like aids & ebloa, but do it in Afrika so no one would notice! & It's not like the gov would start a war on drugs only to own the cartels & routes & bring in all the drugs themselves to destroy certain demographics of their population...  & It's not like the same government would act like the world policeman & try to help 3rd world nations through warfare... & Then steal oil & fill dead American soldiers' body's with said drugs to ship back to America to fuel more black ops.",
            "Never mind government operations, why are we surprised that so many people believe crazy stories for which there's no evidence whatsoever when religion exists?",
            "It doesn’t mean any brain damaged theory now goes. Can you not tell the difference between the bay of pigs and trump??",
            "It's not conspiracy, it's corruption.",
            "For whatever it's worth I'm pretty convinced that the government (CIA specifically?) Propagates or proposes a lot of the more ridiculous or easily disproven 'conspiracy theories' and then lumps anyone with a concern about potentially covert activity together with the absolute loony stuff to discredit and more easily dismiss potentially accurate criticisms or concerns.",
            "Well, the government runs schools and schools for years teach that government and media are trustworthy. What is repeated feels true, and so many people trust the government and by extension the media for no other reason except we got inculcated into it.  \n\n\n  \nOops, did I just make a conspiracy theory by saying that an organization funded by the government is going to be pro government?",
            "Because this is the first time conspiracy theorists can be linked to a president which happens to be right-wing and corporate media in the US is mostly left-wing. For most of history, conpiracy theories were left-wing or anarchic, due to its antiautoritharian traits (for example the 911 truthers and its anti-Bush sentiment), or antiglobalization/antiestablishment which are now messages claimed by right-wing populism.\n\nSo now conspiracy theorist are seen as dangerous not just by government elements (as they always were), but by mainstream media, corporations (mostly social media companies), and partisan politics.\n\nA clear case is Alex Jones. If you watch his stuff circa 2005 or so, noone in their right mind would say he's \"far right\" as he's described now (disclaimer I think half of his stuff is made up or exxagerated). \n\nStupid beliefs like flat earthers and moon landing deniers are mixed with sincere worries about how deep elements in government (particularly the intelligence community) act as quasi-terrorist organizations, noone remembers that a supposed progressive candidate was part of a mandate that spied on all citizens, that kept Guantanamo Bay, its legalized torture programs and secret trials, financed destabilization in Honduras, Afghanistan, Yemen, Syria, Libya, etc, and bombed civilian targets. All of these things were kept under the rug by the same people telling you conspiracies are dangerous, these same elements scourned an actual progressive voice in Bernie Sanders, not once but twice.\n\nFor a clear current example of a message that would have been carried by progressive voices just 5 years ago but isn't now... Nike, Apple and Coca-Cola are lobbying against a US bill that would disallow the production of its shoes using exploited labor abroad\n\nhttps://www.businessinsider.com/apple-nike-coca-cola-lobbied-china-uyghur-forced-labor-bill-2020-11\n\nIf you want a list of every conspiracy that turned to be right (there's some seriously, SERIOUSLY fucked up shit in here)\n\nhttps://www.reddit.com/r/conspiracy/wiki/lopc",
            "‘Conspiracy theorist’ is just a derogatory eternal promoted by governments and mainstream media to tar and feather anybody who dares question the lies they are told on a daily basis by ‘authorities’.",
            "Ducking thank you for saying it.\n\nThis is my view on the covid vaccine too. It has nothing to do with being ‘anti vax’ or ‘anti science’. I’m fully vaccinated and they’re an awesome technological advance that keeps humans alive.\n\nBut y’all, pharm companies are *shady as fuck*. Historically, demonstrably, repeatedly and throughout history proven certified shady as fuck.\n\nThey are being given what is basically a consequence free license to print money. Hell no I don’t trust something they whipped up in less than a year, with infinite money on the line!",
            "The list: \n\nhttps://www.reddit.com/r/conspiracy/wiki/lopc",
            "See the government has this whole operation they've been executing for years to ostracize conspiracy theorists and make them look crazy",
            "I think that conspiracy theorists serve an important function in our society because we need people hypervigilant for sketchy crap. I can't inhabit that headspace, but the fact that the gov and others have been caught doing sketching things means that the \"crazies\" aren't wholly unjustified in their paranoia.",
            "Intellectual smugness + batshit crazy theories.",
            "One can accept that governments must sometimes act with secrecy, especially to protect the national interest but that does not mean that outlandish and nonsensical conspiracies must also be accepted as factual.",
            "We're not.  It's that the conspiracies they tend to theorize about are so often beyond stupid.   I mean, if you're going to buy into a conspiracy, at least make it something that \\*could\\* happen.",
            "The point is this: Conspiracy theories have just not proven to do any good. They only kick up fake reasons to be prejudiced and ignorant. So, fuck ‘em. Legit alternative ideas have some kind of evidence-driven data. This isn’t a fine-line situation, it’s pretty cut-and-dry if you ask me.",
            "[deleted]",
            "as far as i can tell within my (admidatly) small freinds group, it's more of of a societal expectation of what is right and what is wrong within the govermental group you represent. for example if i were to represesant hard right christians it would be entirely feesable to beilieve they were forcibly converting lgbt+ people to hetrosexuality. but if it were the goverment of hard rights this would also be feasable if they presented as such. whereas if they were hiding the fact they were forcibly converting people to the public en masse it wouldn't be feasable to the general p\\[ublic that they were hiding this. if that makes sense.",
            "my question is why does it matter tho? we all die eventually and i for one am not gonna spend my precious time chasing some conspiracy just to prove a point",
            "That is an excellent question\n\n everyone loves a well explained or true conspiracy",
            "Who is surprised? Seriously curious. I mean the fact that governments are sketchy is pretty common knowledge where I'm from.",
            "This post is a constant thought in my mind. Parents were cops in Ca during the 90s. Don't worry its always been fuck 1 2",
            "The thing is, the people that put forth or believe in the well-known conspiracy theorists are nutjobs. Sure, there's lots of reasonable conspiracies out there, but the well-known ones all involve a rejection of science. And the thing about these conspiracy theorists is that they don't just believe one theory, they believe heaps of them, even when they are contradictory. Conspiracy theorists by and large are cranks. Many of them also branch out into other fields too, dabbling in pseudomathemathics, pseudoscience, pseudohistory, etc.",
            "Historically, conspiracy theories and freedom to choose not to believe facts have been engrained in the American culture since the start. The first settlers in America to flee \"religious persecution\". Their beliefs were so out there that they had to leave the country. So now a new nation is founded on these whacky beliefs and it only gets worse. Snake oil salesmen, prosperity gospel Christianity, freedom to deny science, and now Trump. It's just who America is. I recommend the book \"Fantasyland: How America Went Haywire, a 500 year history\" if you are interested in learning more about America and its whacky history.",
            "You've had to much to think.",
            "Because people see the current election and if they agree with those in power they keep their mouths shut even though they know that something is up. In 2016-2020 people thought trump won by Russian interference and millions were spent to prove trump innocent and then This election there is such a huge web surrounding the election just bursting with evidence but the person they support “won” and they don’t like orange man",
            "Conspiracy theories lead to nihilism. When you can't trust anything and you're out of control about anything that you do, that's kind of like really bad mindset. \n\nAnd also, conspiracy theories are for stupid people. And I know this because studies show that low cognitive ability is linked to far-right authoritarianism, and as we all know the far-right and conspiracy theories goes together like bread and butter.",
            "Because, where we actually have evidence of governments doing shady shit, we actually have evidence.\n\nConspiracy theorists tend to fly in the face of evidence, compelling, uncompelling, anecdotal, scientific, or whatever evidence you care to name, that doesn't fit with their narrative. It is surprising that these people exist, because we expect other people to be inherently rational.\n\nIt is not logical to look at the world around you and assume that none of it is actually as it appears, to look at information you're presented and immediately doubt or believe the opposite of its contents.\n\nThere are a lot of parallels between conspiracy theory and religious fundamentalism and alternative medicine theories.\n\nTake Chi/Qi, for example. Qi theory was a framework for understanding how the human body worked, in a time when people weren't allowed to perform dissections. The Chinese theorised that we had three  \"burners\" located in the solar plexus, heart, and head, which produced a kind of \"steam\" (which you can see leave the body in cold weather), and this \"steam\" travelled through meridians in your body to make you move. They built an entire system of medicine around this. When they were finally allowed to perform dissections, or were confronted with proof that, actually, there are no Chi burners or meridians, rather than abandon the theory, they changed their stance to say that it was a *metaphysical* system. Nowadays, you talk to 10 different proponents of different elements of Chi theory (for medicine, for treatment, for martial arts), and you will get 10 different versions of how Chi works. Some will say it's bioelectricity, some will say it's energy, some will say it's heat. Some will say they smell it, some will say they taste it, some say they sense vibrations. \n\nI once watched two healing crystal proponents sit and discuss the purposes of different gemstones, and the effects that they had, and they were both in total agreement that different crystals have different purposes. Then one of them turned around and said that they do a lot of work with \"crystal arrays\", and they generally find that, unlike what a lot of crystal people believe, you can use any crystal for any purpose, and that if you turn a single crystal so that the lines are slightly different, that crystal will have the opposite effect to what you intend. Rather than rail against the blatant contradiction to the crystal theory \"mainstream\", or question the disparity, the first proponent was in awe at how high a level in crystal-ing the \"crystals for any purpose\" person was. Because these things are not about seeking facts, they are about suspending disbelief.\n\nSame for conspiracy theorists. We have ample evidence that the holocaust happened - they invent a convoluted narrative \"disproving\" it. We have ample evidence we landed on the moon. They question the footage, and pay no heed to the answers to their questions. We have ample evidence that the world is not flat. They claim that Australia doesn't exist, and anyone who's been there was deceived by government actors. There was a school shooting, and someone was there. They claim that the person is lying.\n\nConspiracy theorists claim that the Democrats were running a pedophile ring out of the basement of pizza restaurant. The pizzeria has no basement. The conspiracy theorists still make the claim, despite this easily provable fact.\n\nWe are surprised that there are so many conspiracy theorists, because there shouldn't be *any*. It's simply not logical.\n\nEdit: correcting for morning brain",
            "They get barred off reddit as soon as they open their mouths.\n\nTheir subreddits have been systamatically purged over the past 5 years.\n\nTheir opinions are unsanctioned so they are not allowed to give them.",
            "We shouldn’t be called conspiracy theorists, rather critical thinkers with good attention to detail.\n\nEdit:  Typo",
            "\"Hundreds\"? I feel like you pulled that number out of thin air.",
            "The biggest conspiracy of all is making it seem like their is one to distract people from what is happening right in front of their eyes.",
            "Oh boy. So I shouldn't laugh when someone tries to tell me the missing Malaysian airliner was hijacked and taken to the moon? \nOkay, I'll try real hard.",
            "Or like the one where every doctor and nurse on the planet are in cahoots saying there’s a virus that is spreading rapidly and could kill you."
        ]
    },
    {
        "post_id": "j7q2jx",
        "author": "IAmMissingNow",
        "title": "Is it okay to thank the man who unknowingly saved me?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/j7q2jx/is_it_okay_to_thank_the_man_who_unknowingly_saved/",
        "score": 15943,
        "num_comments": 295,
        "created_utc": 1602207232.0,
        "selftext": "Eight years ago I almost committed suicide. I was dorming in my college at the time and it was right after being raped. I had everything planned out and ready but decided I wanted to smoke one last cigarette. I didn't try and hide the fact that I was also self harming at the time because honestly I wanted people to see I was hurting.\n\nAs I sat outside to smoke another student walked up to me. I noticed that he saw my scars but instead of running away he sat down next to me. We never talked before but he started the conversation like it was nothing to him. We talked for a few hours from school to anime to gaming. For once I didn't feel completely alone. At the end of the conversation he told me that if I felt stressed and like games I should play a specific one. As soon as I got into my room I put my razors away and loaded up the game. Ended up playing all night.\n\nHe doesn't know he saved my life. Throughout these years I've gone back and forth between messaging him and thanking him. I don't want to come off weird or as though I'm expecting something. Especially since he has a gf now and I have a bf I don't want to cause any unnecessary drama.\n\nDo you guys see any cons of me messaging him and thanking him after all these years? Should I just let it go?\n\n\nEdit 1: I ended up messaging him. The message is in the comments. He actually just told me that it helped him immensely because he's in the same place I was. I'm near tears right now and just trying to be a good friend and listen to him.\n\nEdit 2: A lot of people are asking what game it is and it's called Katawa Shoujo. It's a game where you date disabled girls. A warning though, the sex scenes are pretty graphic.\n\nEdit 3: Wow I didn't expect this to blow up as much as it did. Thank you everyone for your kind words and advice! It means a lot and every comment has left a smile on my face. 💜 Just remember I am here if anyone needs someone to talk to you. Every life matters and you are needed in this world.",
        "permalink": "/r/NoStupidQuestions/comments/j7q2jx/is_it_okay_to_thank_the_man_who_unknowingly_saved/",
        "comments": [
            "Do it. He may not know how just by being a human being he unknowingly saved a life. I think if something good happens you should always be thankful in some way. I think you'll be fine. \n\nThink if it this way. Is okay just to say thank you in return?  Of course it is!",
            "So I messaged him, this is what I ended up saying.\n\n\n\n\n\n\n\"Hey! I know we haven't talked in a long time and I hope you are doing well! There's just been something on my mind I wanted to let you know about; I'm sorry if this comes out really awkward by the way. I'm not sure if you remember this at all but I do.\n\n\nOne of if not the first time we met was outside the dorms. I was smoking a cigarette and not in a good place. You ended up sitting down next to me and talking. The thing you don't know is I was planning on killing myself as soon as that cigarette was done. But, the fact that you reached out and actually talked to me made me feel not so alone. Plus you recommended me an awesome game I still play.\n\n\nAnyways I really wanted to just thank you. I know it comes out of nowhere and again I'm sorry if it's weird. I'm doing better than I was before and honestly I wouldn't if you hadn't been there and just talked to me like you did.\n\n\nSo again thank you and hope everything is going well in your world! If you ever need to talk to someone during these hard times I am always here too! If not just know you've helped someone out in an amazing way.\"\n\n\n\n\n\n\nI don't know why, I'm honestly nervous about how he will take it.",
            "I think it would be very nice to hear.",
            ">I don't want to come off weird or as though I'm expecting something.\n\nSending a message letting him know he saved your life and that you're grateful for his kindness doesn't have to come off as expecting anything in return. \n\n>Especially since he has a gf now and I have a bf I don't want to cause any unnecessary drama.\n\nOne can express gratitude to another person for their kindness without expecting a romantic or sexual relationship from it.\n\n>Do you guys see any cons of me messaging him and thanking him after all these years?\n\nIf it's written poorly, perhaps, but your post seems to suggest you're able to clearly and succinctly express your thoughts and feelings, so I'm not worried about that possibility. If you're worried, find someone you know and trust and ask them to proofread it before sending it. Or I guess share it here with NSQ, since you're already here.\n\n>Should I just let it go?\n\nIt's up to you. If it matters, the desire to express gratitude and appreciation for another person's kindness and consideration is a perfectly reasonable one to have - many of us have had that.\n\nBest wishes.",
            "Absolutely, positively, tell him.  To know that you made a difference in someone else's life, that you matter, not perfunctorily, but really, truly is the greatest gift you can give someone, and you can give it to him.  Maybe he doesn't need to know, maybe it will be nice to hear but not profound to him, or maybe it could be something he deeply needs on some level.  It would be a terrible waste not to tell him.  And I'm very, very happy you're feeling better.",
            "Yes! Please tell him. I once inadvertently saved a friend and years later they told me. I was very touched and moved to tears. Their appreciation of my small act of kindness was gold. I’d guess it will give you the warm fuzzies too. A win win situation. Please report back and update us!",
            "We sometimes never know how an action that may seem small on our part actually makes a huge impact on another person. It makes me think of something with my grandmother.One Christmas when I was in my mid-twenties, my fiance and I were in a jewellery store looking at wedding bands. I happened to notice some pretty gold earrings that weren't so expensive. I knew how much my grandmother liked jewelry, so I got them as a Christmas present for her.\n\nI gave them to her, she seemed happy, and I didn't think anything more of it until a couple of years later at her funeral. We were at the viewing, and I noticed she was wearing the earrings I had gotten her. I mentioned to my mom that it meant a lot to me, and my mom ended up telling me that those earrings were my grandmother's pride and joy because they were the only piece of real jewellery (other than her wedding ring) that she ever owned in her life. Everything else she had was costume jewellery. Here was something I did on a whim, and it ended up being a huge deal to her.\n\nI think it's important for us as human beings to hear now and then that someone's life had been made better in some way because of us.",
            "Not on the same level, but a barista I knew since I bought coffee from the same store for years at my University thanked me for helping her be inspired to resume her studies, the fact that I had a positive impact on another's person life really made my year.",
            "Welp Im too late cause you already sent it, but I think it’s a good idea. People need to know how much small gestures can make a difference. I am excessivly happy that you are doing better too. \n\nAlso, can you tell me witch game it was? Sounds cool...",
            "My sister died by suicide. I often wish there were more kind people besides myself and my dad to let her know she wasn’t alone and was loved. You should absolutely, 100% let him know he saved your life. For all you know, he may need you to lift him up now or could benefit from knowing he helped you. It would also encourage him and anyone who hears your story to reach out to someone they think might be at risk. The stigma needs to end, and we need to talk about these things. I’m so glad you are doing well, and that you are still here on this earth with us, speaking your truth. It’s powerful. It’s brave. It’s inspiring. \n\nFor anyone that feels like that light at the end of the tunnel is dimming, always remember there is always new light around the corner. We are only here once. The odds of being here are so small. Think of all the egg cells and all the sperm cells your mother and father produced. There were many, and you are one of the few to hit the lottery that is life. It will end someday, why not enjoy the time you have until that end comes. Life is all about perspective. Things may seem so dark, and you just move a little bit, and you see the light. \n\nAs I said, OP, I’m so glad you are here with us. Keep on keeping on, and keep speaking your truth. You never know, you might get a message eight years from now, from someone else who was inspired and saved by your story and the hope it created.\n\nEdit: Good for you. Speak your truth. Inspire others. To anyone who needs someone to talk to, or is ever feeling alone, feel free to DM me. I may not respond immediately, but you can be damn sure I will respond eventually.",
            "\"This guy's walking down the street when he falls in a hole. The walls are so steep he can't get out.\n\n\n\"A doctor passes by and the guy shouts up, 'Hey you. Can you help me out?' The doctor writes a prescription, throws it down in the hole and moves on.\n\n\n\"Then a priest comes along and the guy shouts up, 'Father, I'm down in this hole can you help me out?' The priest writes out a prayer, throws it down in the hole and moves on. \n\n\n\"Then a friend walks by, 'Hey, Joe, it's me can you help me out?' And the friend jumps in the hole. Our guy says, 'Are you stupid? Now we're both down here.' The friend says, 'Yeah, but I've been down here before and I know the way out.'\"",
            "I would totally send the message if I were you! People put up too many unnecessary barriers. This is someone who is important to you, and there should be no problem with saying so. ☺️",
            "What was the game?",
            "[deleted]",
            "Whats the game",
            "“A man saved me from depression by recommending a game about dating and fucking disabled girls.” Never change reddit...",
            "The fact he’s not in a good place at the moment really makes you wonder right? He needed to hear from you as much as you needed him that night years ago. Sounds like the two of you have a bond that goes beyond time & outside understanding. Just goes to show if you follow your instincts you can’t go wrong. Good luck, OP! And good luck to your friend - tell him random people all around the world are wishing him (& you) nothing but peace & happiness! *hugs*",
            "Man, every few months I read a story or experience something which re-ignites my compassion; and I start talking to strangers, asking them how they are, listening to peoples storys. But that fades away after awhile because life.\n\nI haven’t had something that has triggered this in a long time, and I have felt very cold recently because of it. But this did it for me. Thank you for sharing.",
            "> He actually just told me that it helped him immensely because he's in the same place I was. \n\nI don't believe in destiny or predestination in any way, but this feels like the universe just aligning for you to save each other, and that's beautiful.",
            "What goes around comes around. This is good. I'd like to give a [poor man's wholesome.](https://www.vhv.rs/dpng/d/450-4509075_reddit-wholesome-award-seal-hd-png-download.png)",
            "On the one hand, I find it hilarious that Katawa Shoujo, of all games, is the one that helped you.\n\nOn the other hand... I remember that game, and it makes perfect sense. I'm glad.",
            "You should do it. He would be really meaningful to him and most likely help you feel good as well. If you want to take any hint of romance out of the equation, tell him a little bit about how you are doing now and casually mentioned that you've been able to reconnect with people and are in a happy relationship. Don't dwell on it, but a single sentence in the middle of your message might reduce your concerns.",
            "Karma works both ways. :)\n\nHe unknowingly helped you, you unknowingly helped him.\n\nthe universe loves a balance.",
            "i'm very happy you feel better, but what I want to know is.....which game did you play?",
            "This story puts tears to my eyes.\ni can totally relate to the little something that keeps you from killing yourself.\nMe, it was a guy buying me a shandwich.",
            "A complete stranger recommending a disabled hentai game to someone who is about to commit suicide, saving their life? Holy fuck thats a wild ride.",
            "I was NOT expecting Katawa Shoujo to be the game he recommended.",
            "So, my great grandfather ended up saving someone from suicide.  He was a humble guy and would never tell anyone.  The guy he saved later saw that my great granddad in the newspaper was getting married and wrote an anonymous letter to the fiancé, my great grandmother, saying he wanted to let her know that he was a really good guy.  My great grandma saved that letter and I recently found it.  The letter was saved through generations.  Saving someone’s life is a big deal.",
            "I would tell him. It doesn't have to be anything weird and he would probably be pretty happy knowing that he saved your life. I'm happy to hear that you didn't go through with it. Even though at times it seems like you are all alone, there are always people who love you and are willing to do anything to help you. \n\nIf anybody reading this is suffering with mental health issues and needs somebody to talk to just message me and I'll respond.",
            "Do whatever you feel comfortable with but I honestly think it would be nice for him to receive a message to let him know his minor interaction with an acquaintance made a huge impact and saved your life. You never know.  He might be struggling himself and questioning his own value and then he gets a message that tells him that he made a huge difference in a person’s life. \nEven if life is going great for him it would be great to receive a short thanks just to remind him the importance of those everyday interactions that can make a huge impact on someone who is struggling.  \nIt’s a great lesson for people reading your post. Even a kind word and a smile can save a person’s life. Kindness to our fellow human beings is such a small thing but it can literally save a life.",
            "Wow! This brought back so much for me. I have a similar story, and thanking them was a very emotional moment for us, too. I hope this is cathartic and joyful for you. I am so happy you reached out. If such a thing exists, it almost seems like you were meant to. \n\nAs another note, this is a really special connection you two have. It doesn't have to be romantic and it doesn't conflict with either of your relationships. It is totally okay to have a platonic relationship with someone of the opposite gender (if you're het) when you're in a monogamous relationship. It doesn't violate anything and there's no reason for jealousy or awkwardness.",
            ">Katawa Shoujo. \n\nA great game filled with great characters. Lilly is still the best tho",
            "Theres a game where u date disabled girls?",
            "Stay safe OP",
            ">\nEdit 2: A lot of people are asking what game it is and it's called Katawa Shoujo. It's a game where you date disabled girls. A warning though, the sex scenes are pretty graphic\n\nSomehow a story about suicide managed to go 0-60 real quick",
            "Oh my god, I love Katawa Shoujo. I'm glad you didn't kill yourself and that you reached out to him. Stay safe.",
            ">Katawa Shoujo\n\nYEAAAAAAAAAAAAAHH!!!!  Great game, considering it's content, origins, etc.  Glad to see it's helped people and is still relevant even now.\n\nOne of the main developers died a few months ago, so I booted it back up, and was brought to tears all over again.\n\nKeep up the great work of living your life, and appreciated the people and things around you.",
            "Yay I'm so glad you told him and we're able to be there for him when he I'd in this situation too. You never know what people are going through. I hope you've been able to show him the love he showed you in that night, the love you only get to experience because you're still alive. If his gf or your bf see a problem with you saying thank you I would be surprised and very sad. You can have friends of the opposite sex who are just friends. *hugs* I'm glad you're here in 2020 living through this crazy ride.",
            "I'm really sorry, but for some reason I cracked up laughing when you said the game was Katawa Shouja.\nHonestly great game though.\n\n\nGlad you are in a better place.",
            "Reading the post like, \"Ah, what a wholesome story. I'm glad that OP was able to get the help they needed.\"\n\nReading what game OP played like, \"Ah, fuck yeah! Katawa Shoujo is a classic VN!\"\n\nSeriously though, that game hit me pretty hard when I was younger. As they say in r/TrashTaste , \"It hit different.\"",
            "Katawa Shoujo is a great game! It's been a while since I've played, though... it was definitely interesting, playing a game where you dated people with disabilities. Nothing I had seen before.\n\nGlad you are in a better place now! Have your scars healed up? Most of the ones on my arm have, although one is still noticable.",
            "The comment section is getting too wholesome for reddit's standards. That's a miracle.",
            "Thank him. Learning he changed the course of your life, because he was kind, will mean something to him. I don't think he will see this as a romantic advance, because him, talking to you, was not sexual in any way. I am happy to hear you don't feel suicidal anymore. It takes courage to change those feelings.",
            "Sometimes its good to have some words and feelings left unspoken, it's quite common n those what make it precious beautiful memories..\n\n.\n.\n.\n.\n.\n.\n\nand a plot for k-drama",
            "God this is beautiful.",
            "After reading your edit it’s clear that this person needed to know that they have affected people in a positive way without even knowing it and that the world is better with them in it. Good job OP!",
            "He was moved by the angels and ancestors to reach out to you and so were you just now. I’m gonna cry",
            "I would tell you to definitely tell him, but since you already made up your mind about it(props to you for it) I'll just ask one thing\n\nWhat was the game he recommended? If a game kept you busy enough to not have any bad thoughts that's a game I want to recommend to my friends as well",
            "So glad both of you made it through.",
            "Reading this makes me happy. It's good to hear you are doing better now, and the message you wrote him is really well put together. Good job, OP!",
            "This post is beyond wholesome! I am a guy and almost shedded tears reading it.\n\nLike people say, every people that we come through, it should have a reason why. Whether it will be good or bad, we don't know, and it depends on how we see in different perspectives.",
            "Fucking tally whacker thank you",
            "Ahh Katawa Shoujo, the guide for all lost souls. \nGlad to hear you’re doing good, and him too hopefully, both seem like good people much needed to the world.",
            "Of course you should thank him, it may even make a friendship. This person could see you were hurting and wanted to help, I’m sure he’d love to know he helped",
            "I’m so impressed how you lived on and are also thanking someone that affected you. You deserve so much in life :) Your post saved me in a way. Thank you!",
            "I just took a break from homework to check Reddit and now I'm literally crying.",
            "This is bloody nice thread to read! The world needs positivity, Jeez I need positivity now. Thank you for sharing your story OP. I’m glad to read that things have turned out better for you. We often don’t know what’s happening in the lives of the people around us. Your story might help others to start a conversation when otherwise they might not have.\n\nEdit- my shitty grammar.",
            "💙",
            "Nah. People like to feel like they've accomplished something. Preventing a suicide is one of those things. I had a 16 year old call me and she was going to do it and I kept her from doing it after talking to her for an hour and a half to calm her down.   \n\n\nThe end result was an unmitigated disaster but I know she's not dead today because of me.",
            "also it looks like that game has long since been discontinued. It's a shame, it sounds like a good game to play.",
            "I am glad that everything went well for you. Some people do come unexpected in your life and change you for the better. It makes you feel like you unburdened huge troubles inside your heart.",
            "Im glad you had help when you needed it the most, its hard to get yourself out of a hole when you cant feel the walls. Ive always relied on games as my stress circuit breaker and for the most part its helped. As an aside, Kawata Shoujo made me cry bitch tears I could barely finish 3 routes. I don't think I understood the appeal of dating sims much less romance writing until then. Hang in there.",
            "I see that you’ve messaged him, good job op and I’m glad you never went through with it. \n\nIdk how much you game or what anime you like but you can always feel free to hop in some games with me or my gf. I don’t really watch anime but i have a group of friends who love it and would love to hear what shows you’ve seen and if you have any recommendations. \n\nWe play on Xbox but i also have a laptop and a Nintendo switch i play games on, and i have a lot of games that are cross platform. Shoot me a message if you ever wanna play some games and have some laughs with my group, we all met playing halo 8 years ago and have been friends ever since.",
            "I just want to say: I'm really glad you're doing better, and I'm really glad you got to also be there for him when he needed it.",
            "Every meeting with someone should have a PPP. \n\nPurpose\nProcess\nPayoff\n\nIf you are thinking about an interaction and wondering if you would do it, frame it with PPP and let it guide you. Be clear on what the Payoff is for everyone in the meeting. \n\nA Payoff of saving someone's life is a pretty good Payoff.",
            "Not many people can say they were saved via a Hentai game.",
            "Just wanted to say that I’m glad you made it through. I really do believe that there are certain people who come into our lives for a very specific reason. And even though we don’t know each other, I’m grateful that this guy came into yours when you needed it most.",
            "\nThankyou, and good on you, for having the courage to share this, and then having the courage to message him. I'm sure he appreciated it and it made a difference for him (and without a doubt for the many people reading your story).\nI'm so glad to hear you're doing better and that you can now help in return. Some people, though they be in our lives briefly, can have such a profound impact on our lives; and being a blessing in return is such a heartwarming thing. For better or worse this experience has made you into the person you are today, and as I've seen, you have used this experience to better someone else's life. God bless you lovely, and may you have blessings upon blessings xx",
            "> Especially since he has a gf now and I have a bf I don't want to cause any unnecessary drama. \n\nThis would be pretty irrelevant, and if the gf tried to make it something that wouldn't be on you. \n\nI would say reach out. People are so lonely and down on themselves - even the non-self harming ones - that hearing we've done some good could potentially effect his life in the same positive ways he effected yours.",
            "Just wanted to hop in on this and say I'm glad you're still walking this earth with us all :)",
            "These are the kinda stories that give me literal chills!!!\nReally happy everything worked out great for you though :)",
            "If I has ever helped someone like that and they told me, I would feel like my purpose in life had been fulfilled. Honestly I think I'd feel that my existence was justified and I'd earned the right to be here. I feel like that a little bit every time I make my partner smile or laugh or cry happy tears.\n\nI've been where you were, OP. Nearly ten attempts in the first seven months of 2020. I'm glad we both made it through.",
            "I'm no expert on relationships or suicide prevention, but I do know that good friends like that are hard to come by. Don't let it go to waste.",
            "Encouragers get tired. Letting them know that they were able to help gives them the energy shot they need to keep on caring. Well done OP!",
            "I'm just crying reading this. I've wanted to reach out to the people who were there for me in my dark times and kept me from going over the edge. I think this is what I needed to encourage me to finally let those people know that they saved my life. Thank you, OP. I can't even imagine how many others are inspired to do the same now and how lives will be affected by this post alone.",
            "😭*inaudible sobbing noises*😭",
            "This is the 2nd time I've seen Katawa Shoujo in a reddit post, maybe this is a sign I need to play it. lol 🤣",
            "Katawa Shoujo is lit, you guys have good taste",
            "Katawa shoujo is a gem as well.",
            "Oh man, Katawa Shoujo is such a feels trip. The writing is absolutely brilliant",
            "Damn, he recommended you katawa shoujo? A masterpiece",
            "Recently diagnosed treatment resistant depression. I’ve tried many times and the first time I reached out was to my child psychiatrist who did nothing;100% think should should’ve told my parents cause she didn’t try to stop me and I tried that night. I grew to what I would mentally refer to as always wearing a mask of smiles glued to my face to hide what I really was like. Several years into high school one of my bfs came up to me on the day I was once again going to try. She looked me straight in the face and asked if everything thing was alright and not to do anything to hurt myself. I remember shaking and asking what she meant. She said she saw it in my eyes and voice. The metaphorical mask I had worn so long and hidden myself so well that not even the new drs or my parents knew what was going on. When I got home that day instead of doing it I headed straight to my parents and told them if they don’t stop me I’m killing myself that night. It was thanks to that friend that I finally reached and was rushed to emergency psychiatric care. Since then I’ve promised my parents that if I ever get there , and I have, I’d let them know. I now get treatment and seek help whenever I’m their because I always hear her voice asking me again if I’m alright. My mask is permanently gone and I wish I could tell her I thank her and love her for that. It’s good you reached out and were able to help him like he did you. It’s truly wonderful.",
            "I (as a self appointed psychologist ;-) ) don't think you ever wanted to commit suicide. You only wanted someone to accept you, someone to talk to you. And someone sent this person to you.\n\nDoes it mean he didn't save your life? Not at all. He gave you what you needed in your life and it absolutely right to be thankful for that. And thankful to who sent it to you.\n\nThese are my thoughts, but of course I can may be wrong.",
            "I think you should do it.  Tell him everything you posted here.  Tell him a bit (briefly) about your life since that night- what you've done, experiences you've had, and tell him about your BF.  Include a picture of you and your BF so it is obvious to him (and his GF) that you are not coming on to him.  Make it a 'if I'd died that night I'd never have met XXXX' type thing.  \n\nI dunno if I've ever saved a life.  I've talked to a lot of people in a lot of crappy situations.  I hope I've had a positive impact over the years.  But if I heard that I had stopped a suicide... I'd be over the moon.  That's one of the best things anyone can hear.",
            "[deleted]",
            "Proof that cigarettes also save lives",
            "Kindly update about his reply also. I'm curious 😅",
            "wait hold up, i almost don't wanna touch this one but... \"right after\" you got raped(im guessing some time has passed, couple days? a week?) you talked to this dude, he recommended you play a game thats all about disabled anime girls getting fucked... and that helped you? I get that it may be a type of game you enjoy but... subject matter.",
            "lmao",
            "I think you should message him. I'm sure he would like to hear.\n\nI hope you are doing better.",
            "I believe that you should thank him, it is clearly on your mind and was a very fortunate event and a life changing one,",
            "It's your imperative to do so. This could be the random thing that saves his own life now. \n\nThe world is funny that way.\n\nWho knows?",
            "glad you're in a better place now, I think you made the right choice sending him the message!",
            "I know you've made the decision but I just wanna say that it seems like a good idea. This is an important experience for both of you. We may not have known you had a plan but he may have known you were in a bad place. Either way I think it's important to keep up connections especially ones like these. Glad you're in a better place.",
            "This is incredibly sweet, and I am so happy that he saved your life, and that you reaching out to him was timely.  I hope he is doing ok.",
            "No shame at all. Just showing appreciation and awareness and I hope everything has gotten better for you. May peace be with you:)",
            "Seems like you helped him unknowingly too. Much love for you :)",
            "To be honest he probably knew he was atleast trying to give comfort to someone having a hard time, not saying he was trying to even save a life, but instead talking to someone who was obviously struggling. \n\nYou can thank him or not thank him, but I think he’s happy just knowing your still alive and doing better",
            "Stay strong. But I have a question. What game did he recommend you?",
            "Big warm fuzzies reading this and his response. I needed to read something like this today. Thank you for sharing.",
            "I'm going to answer as though I didn't read your edit.\n\nI don't think you should hold back at all. I have had people tell me years down the line that something I said touched them. And it melted my fucking heart. These little affirmations are are a reflection of the goodliness they gave you, and will have a similar impact on them. They gave you an spiritual hug when you needed it. Now you're ready to give it back.\n\nHappy to hear you are doing better! Just remember we all have our ups and downs, and learning to be content with both is the goal.",
            "Tbh, I would be pleased to here something like that.\n\nPlus, I think he knows by the sounds of it. He seems to know you were stressed so your friendship with him is probably already a sign to him that he did something pretty significant.",
            "nice",
            "How did it go?",
            "This is the more beautiful thing I've ever read",
            "Extremely wholesome story. I love good people like you and him.",
            "Ehm, what's the game?",
            "I mean.. if you can go back again and again to thank the doctor who pulled you out of coma, you certainly can thank a guy who helped cool your mental trauma..",
            "Why was that game recommended to you?",
            "سکس",
            "LOL THAT GAME THO",
            "A kind word or gesture isn’t that hard and the impact on the recipient could like with this OP change the world because you changed their life.",
            "Why wouldn’t it be ok? I get its no stupid questions but this kinda seems like a validation type post, either way im happy you’re ok",
            "Didn’t think it through, thank you 😃",
            "KataWa Shoujo! Excellent recommendation. Glad you’re doing better now OP.",
            "Saved so I can read this when I am in the dumps",
            "Which game did he recommend??",
            "[removed]",
            "what game?",
            "OPs story is kinda sus.",
            "Damn OP this is so beautifully full circle.",
            "So the pro tip is sex games cure depression.",
            "I don’t know Rick, looks fake to me",
            "\"If someone hurts you, you got to hurt them back\nwhy u hurting urself? Where's the logic\"\n\nThis is what your 12 year old self would have asked present you if they met"
        ]
    },
    {
        "post_id": "90qrkg",
        "author": "GnomishProtozoa",
        "title": "Are the two \"c\"s in thicc supposed to represent large ass cheeks?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/90qrkg/are_the_two_cs_in_thicc_supposed_to_represent/",
        "score": 15934,
        "num_comments": 883,
        "created_utc": 1532192653.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/90qrkg/are_the_two_cs_in_thicc_supposed_to_represent/",
        "comments": [
            "They dont... But they should and do now.",
            "They are now",
            "I think it's just a side effect of a purposeful misspelling",
            "[removed]",
            "[removed]",
            "Think it comes from Crip slang. The letters ck are avoided so they use cc instead. ",
            "Post this in r/showerthoughts",
            "Not quite. I think it comes from “succ”, which developed as a memey way to say “suck”. The -cc principle carried over to the thicc meme. ",
            "I remember the first time I noticed that thicc as in woman was spelled with two c's I remember it somehow just making sense.",
            "[deleted]",
            "If you describe someone as \"thick\" in text form, it has connotations of \"dumb\" or \"ignorant\". \"T H I C C\" implies something different, ie voluptuous. I think it's pretty cool actually considering how inflections/tone and/or context can be misconstrued so easily in text and I gladly welcome it into my written language. Language is a living thing.",
            "I haven't seen a real answer so here is what I was told. \n\nCrips (the gang) don't like anything with a ck because of the bloods (rival gang) using that to mean \"crip killer\". So they use two cc's instead. \n\nSame thing for bloods not using the k sound. Bicken back being bool (kicking back being cool) is a pretty popular rap song by YG that follows this.\n\nEdit: it was answered before me, I just missed it in my excitement on knowledge of gang culture being from hickville Texas.",
            "      **o**\n\n    **<l>**\n\nthi**cc**\n\n     **/\\ **",
            "I think it has to do with pronunciation like sayin \"Damn dat girl thick\" would sound different than \"Damn dat gurl thicc\"\n\nThat's the way I read it when spelled that way.",
            "congrats OP u meme good",
            "When you spell something with 2 c’s if it’s a word like “fuck” for instance “fucc” any word with two C’s is Crip slang. CK in a word for crips stands for Crip Killa so if you do CC it’s implied you don’t kill crips ",
            "It started as slang used by Crips. Ck stands for \"Crip killer\" so they avoid using it by replacing ck in words with cc.\n\nIt's the same reason you see the letter C replaced by the 🅱️ emoji a lot. It started as a Blood thing.",
            "Concealed Cellulite?",
            "Well it's official lore now",
            "My recollection is that ‘ck’ was short for ‘crip killer’ so the crips would replace the ‘ck’s in words that had them with ‘cc.’ This is also the origin of succ",
            "I feel like this has been posted om reddit before. ",
            "Can't unsee. ",
            "That's how I have always understood it.",
            "it originated with the Crips and “ck” is understood to stand for “Crip Killer” thus the change",
            "Nah it’s Crip slang.",
            "No, they represent I made this. ",
            "Cannot be unseen",
            "You are the chosen one",
            "Well now ",
            "[Do you realize what you’ve done!](https://youtu.be/nDiJhqhYuog) ",
            "Sure.",
            "r/showerthoughts",
            "Stupid sexy Flanders.",
            "HAHAH",
            "Well they do now. ",
            "are you an English teacher?",
            "This also works for  T H I N N ",
            "Paging u/geekiechick15",
            "crips don’t use “ck” together. so thicc, fucc, etc have to be spelled that way because in their language, the “ck” together stands for “crip killer.”\n\nsource: my ex is a crip",
            "No.",
            "I thought thicc stood for \"too hot I can't cope\" ",
            "Wow I’ve never thought that. Op just changed the world",
            "It comes from Crip gang language. \"CK\" is Blood slang that stands for \"Crip killer,\" so the Crips modify language as best they can to eliminate the two letters together. Like the \"ni🅱️🅱️a\" meme coming from Blood langauge before it, thicc is simply another example of gang culture becoming very popular in the society, so much so that the phrase has lost its original meaning.",
            "Lol no, but that’s creative. ",
            "That Hoe Is Certainly Curvy",
            "[removed]",
            "Thiçç",
            "oh my God ",
            "[removed]",
            "Hey, a question I actually know the answer to. \n  \n  No, they were not originally meant to represent ass cheeks. In all reality, the term \"thicc\" most likely came from the gang known as the Crips.\n  \nTheir rival gang, the Bloods, would use the initials CK to stand for \"Crip Killa,\" which then would cause, in writing or texting, those affiliated with the Crips to attempt not to use those two letters together, thus creating the term thicc.\n  \nMeme culture then used this spelling to make, you know, memes. They invented phrases the succ, and in turn Zucc, dicc, etc.\n  \n  TL;DR: Nah, it has to do with gangs and stuff",
            "This has entered that long list of posts I’ve downvoted, seen the sub, and upvoted instead.",
            "I honestly hadn't noticed that resemblance but I do now... CC",
            "Short answer: no\nLong answer: maybe?",
            "Yes",
            "coincidence ",
            "Thicc\n\nAye I see what you mean",
            "T H I [C C](https://i.imgur.com/qIuTwWB.jpg)",
            "They do now",
            "I totally thought this too.  Little booties",
            "yes, i always assumed so. ",
            "Congrats friend, you just started a new internet thing",
            "Damn, OP. I wish I was as high as you probably are.",
            "c.c",
            "Bruh",
            "It’s actually in reference to large-bottomed women of Italian decent. Pronounced “theech”",
            "Nah it’s thicc everythang ",
            "This is amazing, OP! I love it, hahaha. You just coined the term.",
            "Yes, like the spongebob ass cheeks",
            "I was told it's to make the k sound at the end harder sounding, so a bitch aint thic, she Thicc",
            "We are asking the important questions now, aren't we?",
            "Then shouldn't it be thiCC?",
            "It wouldn't also be large breasts, right? You sir, have changed the game.",
            "No one else saw that?",
            "r/ReallyGoodQuestions",
            "Past the obvious joke answers is some top tier armchair anthropology",
            "Thicccccc",
            "never bicked back in the bando ob? ",
            "Thought it was both ass and boobs",
            "Thi🍑",
            "Dat Ass",
            "That's what I assumed.. ",
            "Asking the real questions",
            "thiCC",
            "Bah gawd!",
            "Stupid sexy Flanders.",
            "My mind is blown",
            "thiCC, nice job OP!",
            "[Dom Mazetti defined it best:](https://www.youtube.com/watch?v=nVzRNcl1m9I)\n\nThis\n\nHoe\n\nIs\n\nCounting\n\nCash",
            "I am proud to be here at the birth of this.",
            "ok now its engraved in my head. thanks ",
            "I know they do now but originally what they used to represent ?",
            "there's thicc and there's now thiCC",
            "It's for a double dose.\n\nLike [UPGRAYEDD](https://www.urbandictionary.com/define.php?term=Upgrayedd)",
            "Gimme a few minutes til I get home to gild this post.",
            "Woke question. ",
            "Yes",
            "Are you in my band, because we had this exact conversation a couple of weeks ago. Now I wish I posted it for karma then.",
            "What if thicc is spelled with two “q”s instead, thiqq, does this represent even larger ass cheeks than those of the two “c”s?",
            "You might have just added to Internet lore.\n\n\"bed\" looks like a bed and \"thicc\" looks THICC",
            "thiCC",
            "Yes it does",
            "But what if someone is thiccc?",
            "History is being unraveled before our eyes. 🍑",
            "Sure, why not. ",
            "Oh shit I never thought of it like that... We just say thick differently from thicc so I figure it's just the visual way to represent that",
            "Being slang, it's open to many interpretations but yours is a good observation.",
            "Actually balls ",
            "Yes.",
            "Thi🍑",
            "Now that you say that...",
            "r/showerthoughts ",
            "r/AccidentalGenius",
            "I always assumed, they did. Guess, I was wrong.",
            "I personally think it should be thiq, but I don't know.",
            "!isbot shittyjokeexplainbot",
            "When I see Thicc I now OGC",
            "!isbot coolcool416",
            "ITT: too much discussion about the Cloods and Brips and not enough examples of T H I C C N E S S imho",
            "Mandatory mention of Mrs Incredible. ",
            "No\n\nThey just Cs, ni🅱️🅱️a",
            "Like you, I always assumed they did",
            "Well shit",
            "Holy shit",
            "I can’t un see that now",
            "sometimes she so bad you gotta make a new  word."
        ]
    },
    {
        "post_id": "ejvguu",
        "author": "EdyLuro",
        "title": "Why is it so hard for native English speakers to differentiate between \"then\" and \"than\" when it is their own language?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ejvguu/why_is_it_so_hard_for_native_english_speakers_to/",
        "score": 15929,
        "num_comments": 1809,
        "created_utc": 1578136413.0,
        "selftext": "I mean is it education, culture, only some countries?",
        "permalink": "/r/NoStupidQuestions/comments/ejvguu/why_is_it_so_hard_for_native_english_speakers_to/",
        "comments": [
            "Because you learn your native language through listening and speech. You don’t see things written down until later.",
            "Because of natural acquisition of language vs. academic study. This isn't about native though. If you acquire a second language naturally you have the same issues.",
            "For some people, they see the two words and think it is incredibly obvious because the two words mean two different things.\n\nBut for me, there is \"Th_n\" and one has an \"a\" and the other has an \"e\" and I have to try and remember which definition goes with the \"a\" and which goes with the \"e\"\n\n* Th_n: used in expressions introducing an exception or contrast.\n\n* Th_n: at that time; at the time in question.\n\n* Th_n: introducing the second element in a comparison.\n\n* Th_n: after that; next; afterward.\n\nThe above is what I have in my brain. I am Dyslexic, so the above is a problem with a ton of different things. Some I have more or less solved, some I am still working on. \n\nAnother example. When people where trying to teach me my Rights and Lefts, they would say, \"Hold up your thumb and pointer, the one that makes the \"L\" is your left. The problem is they BOTH make an \"L\" and I can't remember which why the \"L\" normally faces. \n\nWhat solved this one for me was getting a Wrist Watch. The Watch was on my left hand. So When I thought \"left\" I would shake my left arm and feel the watch. Even now that I don't have a Wrist Watch, I still move some muscles in my left hand when I think of \"left.\"",
            "probably because they don't care",
            "Because in a lot of American accents they're pronounced the same, and in informal settings like the internet most people type the way they talk rather than in formalized written grammar",
            "[removed]",
            "[deleted]",
            "This is definitely more of an American English problem than British English. In the latter, the pronunciation of each is quite distinct. In American English, however, there is a tendency to muddy vowels to some extent.",
            "They're pronounced the same in rapid speech. If you haven't specifically learned to differentiate the written forms in school, you would think they're the same word.",
            "Native speakers of a language learn to speak it before they learn to read and write it, whereas non-native speakers usually learn every skill concurrently and in a much more calculated manner, where everything is laid out for them as logically as possible and the pacing is 100% controlled.\n\nWhen you acquire your first language, the language acquisition itself is really just the by-product of social interaction. The interaction between people takes precedence, and ideas like grammar and formal 'correctness' take a back seat. Non-natives, on the other hand, need rules to fall back on. They need to be aware of the difference between \"than\" and \"then\" in order to make sense of the means of communication they are trying to use.\n\nSo it's not really that native speakers find it \"hard\" to recognize the difference; it's more that a lot of us just don't care about the difference and don't really have to. Because for us natives, speaking English has simply been a means of social interaction from day 1. We understand each other just fine, so the 'correctness' or lack thereof, as perceived by non-natives, has no reason to be more than an afterthought in our minds.",
            "Because the rules for written language, grammar, and spelling were set down a couple hundred years ago, whereas the spoken language continues to evolve. Since most efforts at spelling reform have failed, the written and spoken languages  continue to drift further apart each year.",
            "[deleted]",
            "I guess I don't think it's \"hard\" to differentiate as you say. I think many people just have poor written language skills. Then and than sound the same even though they have obviously different meanings. But if you're not reading and writing all that often you just write what you hear. A great majority of people do not do anything that requires solid writing skills so they're not practicing, and maybe never learned them in the first place. You'd rarely see a grammar error like that in a newspaper article, or some other formal written document, because those are written by people who have good writing skills. Online comments here, or on Facebook, YouTube, etc. are a different story.",
            "Most people are undereducated and dont care because others understand them anyway",
            "affect/effect\n\nLack of reading is the problem.",
            "It's a stupid language, let's face it",
            "This mistake appears to happen with texting/internet where people are more interested in typing fast than typing correctly. \nIt doesn’t seem to happen when people are writing, or at least not as often.",
            "In contrary to what most other comments suggest, it is not an issue of laziness. The problem lies with the way everyone learned the language. Native speakers learn the language phonetically while non-native speakers usually learn English in a written way. Because of this, native speakers never hear a difference between ''then'' and ''than'' and never learn that there is a difference between the 2. Non-native speakers usually start learning by seeing it written down and immediately learn the difference between the 2. The same logic applies for ''your'' and ''you're'' and ''there'', their'' and ''they're''.",
            "My husband has horrible grammar and spelling because he barely tried at school. He had more important things to do, like play with friends and toys.\n\nI was a parent pleaser, and genuinely liked school. English was always my best subject. \n\nI think it's important to use proper grammar and spelling. It conveys intelligence and trustworthiness, IMO. Especially at work. People that write emails using the wrong your, there, than, too, accept, etc., are not going to climb the corporate ladder.\n\nYou care, or you don't care. Even if people don't say anything to you, half of us are judging you.",
            "Answer: I doubt there's a language where everyone gets everything correct 100% of the time",
            "I'm sorry but everyone here is talking out of his ass\n\nPeople make this mistake because they've read it written like that somewhere. It's a vicious cycle. Say you're online, someone does the mistake and you read them. Through seeing both ways of writing it repeatedly, you're kind of lost. And you make the mistake too, perpetuating the cycle.\n\nThe french have the same kind of thing, the spanish too, there's one in every language\n\nThere are plenty of common mistakes that people do when writing english but this one is the most popular. But there's no reason why this one is the most popular. There are plenty of other mistakes like this one - common ones too, but it's just chance.",
            "When we were kids learning how to write (in the US), if we were trying to write a word we didnt know how to spell we were told to \"sound it out\" and write how we thought it sounded. Different accents all across the country often sound as if the two words are pronounced the same. So, when it gets sounded out it's written the same despite the word actually meaning a different thing and being spelled differently. It gets used interchangeably. \n\nWhen I have tried learning other languages I focus on proper pronunciation, especially minor nuances like in the English then/than. That makes those things stick out more to me and so I remember them. I imagine it could be a similar thing with others that learn English as a secondary language.\n\nEdited 2 seconds after I hit post because I forgot to add the country I am in and to say that this was my experience in the US public education system. I transferred to several different schools and it was the same at all of them. I am not definitively saying that any other countries that speak English experience this in their schools.",
            "I believe, in part, laziness . I also think people simply don't need to remember which one is proper usage, so they don' t bother.  Also true of two, too and to.",
            "[deleted]",
            "Ex-English teacher here: because for many English speakers, in spoken English these two words sound  identical or nearly so. It only becomes an issue when writing it. There are a lot of similar \"soundalike pairs\" that trip people up whether they're native speakers or ESL learners. I don't have trouble remembering which is which, but then I'm an ex-English teacher.\n\nEdit: someone else rightly pointed out that autocorrect is an issue. It often inserts the wrong word, so if a person sees this on their phone, it reinforces the error, or at least exacerbate the uncertainty. The harder it is to see a pattern, the harder it is to cement in your mind which is which. This is why it's good to get kids to read a lot as they're growing up. The earlier you start to see these patterns, the better you are at discerning them, to the point that later in life you can either look at an unfamiliar word and deduce what it might mean, or hear an unfamiliar and deduce how it might be spelled.",
            "I have a harder time with affect and effect",
            "It's harder then you think. I'd rather do just about anything other then l master the difference. Than, once I'm done doing anything other then mastering the difference, than and only than, I might get around to it.",
            "We don't learn it formally.  I speak 'better' french than most francophones, because I learned it from textbooks and classrooms, not just natural conversation (mostly, anyways).  Whereas with english I learned a lot of my vocabulary from reading, rather than conversing, so I have great spelling and all that, but actual pronunciation can be tricky for more obscure words.",
            "Because most kids are taught the English language phonetically, through sounds. I, on the other hand, was taught English through written words. Because of this, I find that I don't have the issue of differentiating between words.",
            "How many times did you look over your post to ensure no spelling and grammar mistake before submitting lmao",
            "Smol brains.",
            "A. It's really not\n\nB. 99% of the time the person is typing. Could be a typo, just like how its annoying to type \"you're\" on a phone so many just say \"your\"",
            "Communication is about clarity, everything else is extra. If the message is conveyed without being misinterpreted, the job is done. Mistaking Then and Than will almost never confuse the meaning of a sentence, so it's not that important. People saying this mistake is a result of bad education don't really have their priorities straight, IMHO.",
            "They're nearly homonyms.",
            "Breath and breathe, women and woman. Omg the list is endless!",
            "Because most people nowadays do absolutely no recreational reading.",
            "This is such an odd question. Is there any language on Earth where native speakers never make mistakes? Barring certain dialects, the two words sound *exactly* the same.",
            "The one that really annoys me is to and too. This is simple stuff I remember from 1st grade.",
            "I am a native English speaker and I am learning Dutch for fun, sometimes if I get stuck on why something in Dutch is said differently than I think it should, I ask my Dutch friend and she usually just says \"I'm not sure thats just the way it is\" and I think its the same for English. We were brought up talking English and so we never really learned the specifics of the language like you would if you were learning it as a second language!",
            "I don’t know, but it’s certainly annoying.",
            "Because nobody ever told them thAn for Adjectives and thEn for Events",
            "I find the mispelling of the words should/would/could have to should of very troubling. Have and of are two completly different words how is it possible to make that mistake?\n\nAlso who and whom.\n\nWho is that person? Whom does that belong to?\n\nWhat is diificult about that?",
            "In Spanish we have the same problem with \"hay\" \"ay\" and \"ahí\"",
            "I am a native English speaker and have never had this problem or encountered anyone who has",
            "I think people have this problem because they sound so similar when most people say the words out loud. In fact for alot of people unless they are empahsizing the word its impossible to distinguish. As a result when people are spelling words based on what they sound like, its easy to confuse. (This specifically applies to an American accent, cant speak for other native english accents.)\n\nMore broadly, the words a just similar in a lot of ways spelling, pronounciation, and the usages while distinct are somewhat related.",
            "Well than.",
            "Because the majority of English speakers in the United States don't know what the difference is between the words, or why they are spelled differently. I'm going to let out a secret, the American public education system is horrible, especially in major cities. I've had prospective employees that couldn't even fill out a job application even though they have high school diplomas. I've had to send employees to the local tech school for English classes so they can read technical manuals written at a eighth grade reading level. It's really just become a government run baby sitting service in big cities. Kids only learn if they want to and really seek it out. If they show up, they graduate.",
            "most native speakers speak more than they write, while people who have studied this language are more careful with things like that and are more likely to make grammar errors. same goes for every language, not just english, but it’s more apparent there because most of the words aren’t pronounced the same way they’re written.",
            "When these words are not stressed, they sound exactly the same. That's why people write them the same",
            "I feel like it’s only Americans and the occasional Australian. I’ve never *ever* seen someone from a country other *then* those 2 make that mistake",
            "Effect vs affect, they’re/their/there, etc. There’s plenty of pitfalls in English even when you’ve been speaking it your whole life.",
            "Ever forget something? Ever do something wrong because you were prioritizing something else? The issue isn't always an issue of knowledge but hastily writing something in your head before your desired sentence structure is forgotten.\n\nThe real problem is why so many people have placed such importance on such a insignificant flaw in grammar. We all know what it means by the context, it's just a spelling error.",
            "I get attacked for it when it’s spell check. I type super fast. I definitely pay more attention these days because 🤬",
            "Because no one gives a fuck",
            "Because we’re fucking stupid",
            "Wait until you see how many native speakers screw up compliment vs. complement",
            "‘me and my friend were...’ that is cultural. And painful.",
            "Because they're retards who don't read enough or pay attention to what they do read.",
            "Many Americans are stupid and uneducated? \nSource: American constantly facepalming at stupid and uneducated Americans",
            "people in my area don’t care of how they use it as long as YOU understood what they meant. If you tell them they’ll just say “you understood right? Then what’s the issue” lost cause.",
            "Because very rarely do spelling mistakes actually matter. A native speaker can easily infer your meaning from the context of the sentence.\n\nAnd most people *defiantly* don't care about proper spelling. Ah. Ah. Ah.",
            "I get annoyed when I see where and were mixed up.",
            "There stupid.   Get it. There.",
            "Better question, what do you native English speakers think you say when you type \"could of\" instead of \"could have/could've\"?",
            "You think your better then me??!?!",
            "It is like \"further\" and \"farther\"... I'm a 42 year old native English speaker and I still have trouble with those 2...",
            "Because people are dumber then we’d like to admit.",
            "Public school",
            "As a native Spanish speaker one of the biggest challenges of learning English and improving is learning to dissociate the way a word is written with the pronunciation.\n\nSpanish is very poor in sounds and almost always what you see is what you get. With very few exceptions.\n\nBut English can be such a shitshow when it comes to pronouncing. There is no simple way to know how some words are pronounced until you heard them.\n\nI understand that for native speakers who have been raised identifying words with sounds rather than with their individual letters it's just natural to make such mistakes.",
            "Because there stupid",
            "For me it because both could have been left as one word with different meanings",
            "Native speakers are actually usually less literate in the specifics and terminology of their own languages because they do not study it in school as one would a second language, rather we learn it through experience.",
            "Because Englisjh is dumb. It's a nearly-random hodgepodge of several unrelated languages, written with a foreign and incompatible alphabet.",
            "Cuz English are hardest",
            "Same as people domt know the difference between his and he's",
            "Its not just **then** and **than** its also;\n\n* **your** and **you're**\n* **their** and **there** and **they're**\n* **to** and **too**",
            "It's one of those things where people think \"meh, close enough people will get what I mean\" but then there are [times when it is really important](https://me.me/i/jenny-id-rather-be-pissed-off-then-pissed-on-like-20966517).\n\nI remember laughing because a kid wrote on their status \"Whoo hoo, six weeks of school\" again, another time when one letter made all the difference.",
            "Because people are fucking stupid and lazy.",
            "This is far more of an American issue than a British one because Americans flow their words more wheras British people enunceate more clearly.",
            "We actively try to dumb down our citizens so they vote for the corrupt people doing the dumbing down.",
            "Because people literally don’t care :(",
            "Laziness",
            "As an American, I know the answer - most Americans are morons.",
            "the purpose of language is to communicate, if you get the point of what theyre saying then it doesnt matter how they said it",
            "Because the American public school system is more concerned with school lunch debt than it is with teaching.\n\nI consider myself lucky that I can type a coherent sentence.  It makes it easier to hide the fact that I learned almost nothing about US history or how our government works.",
            "Because English is not a single language, it’s at least 3 hiding under a trench coat and trying to fool you into thinking it’s one.\n\nAnd yes this is poorly remembered quote from somewhere else on reddit - updoots if you can find the original"
        ]
    },
    {
        "post_id": "o5o0wl",
        "author": "THIESN123",
        "title": "How many times do I have to press \"show me less of this\" on those live broadcasts until I don't see them anymore?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/o5o0wl/how_many_times_do_i_have_to_press_show_me_less_of/",
        "score": 15928,
        "num_comments": 559,
        "created_utc": 1624370963.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/o5o0wl/how_many_times_do_i_have_to_press_show_me_less_of/",
        "comments": [
            "Reddit is trying to push live broadcasts. They're not going to stop doing that. \"Show me less\" is just going to show you less of that type of broadcast, not fewer broadcasts overall.",
            "I use a third party app to browse Reddit. Not only do I not see broadcasts but I also don't see ads. It's great.",
            "I believe \"show me less of this\" is to change which live broadcasts you see, not whether or not you see them at all.",
            "[deleted]",
            "I don’t see these when using old.reddit \n\nSide note, I would use the new layout if someone can show me how to collapse threads. I’m either too old or too dumb to figure out how.",
            "Stop using the official Reddit app.  Use basically anything else.\n\nIf you're on Desktop, install RES, and set it to force the old reddit layout.  You'll never see that shit again.",
            "TIL Reddit has live broadcasts. I didn't know that. \n\nReddit on browser is dreadful. Thank God for (insert name of favourite Reddit app here).",
            "It will never stop. This has been the way of the Internet for the last 5 years and it's only going to get worse. The Internet is devolving into just another form of cable television.",
            "Settings>account settings>personalized recommendations. I got everything off there. This will probably solve it",
            "If you don't want broadcasts, you can switch back to the old reddit format in your preferences. I'm still on the old format and never see any of these broadcasts that other people speak of!",
            "I wasn't aware reddit even had live broadcasts until I read this post",
            "/r/apolloapp",
            "yes. They keep pushing it so occasionaly it will pop up no matter what",
            "I use old.reddit.com (because I hate the new reddit interface), [Reddit Enhancement Suite](https://redditenhancementsuite.com \"also /r/Enhancement\"), and ublock origin. I've never seen anything about any live broadcasts. Maybe try some or all of those things? Or are you talking about mobile?",
            "Until you switch to old reddit and RES /r/Enhancement",
            "Reddit, stop trying to make live broadcasts happen.  They’re not going to happen.",
            "Oh this is about Reddit! I thought you were talking about YouTube. Well, get an app or some other client to view Reddit. I use Baconreader. I didn't even know there were live broadcasts on Reddit, let alone seeing them being promoted.",
            "I'm convinced that button is entirely for show.",
            "Go to 'old.reddit.com' to see none of them again. You can also opt out of seeing the reddit redesign by going to Preferences on the top right, and in the new screen scroll down to \"Beta Options\". Uncheck box that says \n\n*Use new Reddit as my default experience (by enabling this, you will be redirected to the new site when you go to any supported https://reddit.com page)*\n\nYou'll no longer see live broadcasts on Reddit.",
            "Infinity plus 2",
            "Use RES and force old reddit.",
            "Reddit has zero interest in creating a good user experience. This is apparent in their broadcast policy, which is put up a button so people think they're customizing their experience, but it's really there to just passify people so they get less user complaints. \n\nWelcome to free market capitalism!",
            "Reddit tried to shove broadcasts down our throats on 2019 but nobody gave a shit and the channels were often empty. So they must love the Pandemic",
            "At least once more, as always.",
            "If you scroll past it you can't see it anymore.",
            "Seems like about once every two weeks for me.",
            "I hit that button a couple weeks ago and I haven’t seen one since. The sad thing is I actually liked most of the live streams. I thought it would just stop recommending that particular stream.",
            "Same as the number of licks to get to the center of a tootsie pop.  The world will never know.",
            "The mukbangs are the worst!!!!!",
            "Is this some feature I'm too old.reddit to understand?",
            "Reddit enhancement suite for computer. And an ad blocker.\n\nApollo app for phone.\n\nI never see any bullshit.",
            "That will just get you broadcasts less relevant to your interests. You'll still get them, they'll just be ones that are more annoying to you because they won't even be something you like.",
            "I'm waiting for the day that some awesome developer makes a reddit vanced",
            "My least favorite thing about them is when I’m scrolling on mobile and I can’t scroll past them in posts because Reddit just says no, so I have to leave the left-right scrolling mode just to get past it",
            "I would guess it does nothing - just enough to give you that warm feeling that you have control over what you see.",
            "Same question but with posts from r/popping.\nIts fucking disgusting and I can’t seem to get away from them?",
            "dont follow them. do see them.",
            "Is this on mobile? I don't see any mention of live broadcasts on old reddit with RES extension.",
            "Approximately 490,284,920,848,300,283,874,748,939,388,483,993,848,309 times",
            "\"Show me less\" refers to the person/content being shown. So if you click \"show me less\" on someone playing the guitar, you should get less of that specific content. What it won't do is get rid of the live broadcast category.",
            "Anyone else had no idea reddit pushing some live broadcasts was even a thing and thought this was about youtube until they read the replies?",
            "Seriously!!! If I could come through the screen I would beat them so hard with that guitar. I think I pressed it at least  three times but I still get them.",
            "As many times as declining a YouTube premium subscription",
            "I swear reddit lies on the number of people watching. There's no way there are 6000 pathetic losers watching some of this shit.",
            "At least once more",
            "Add /.compact to the end of every reddit url and you get a slimmed down text version of reddit that may help",
            "I didnt notice any live broadcast when i had platinum for one month. Can anyone explain that? Is it considered ads?",
            "As many times as it takes until you finally install ublock.",
            "Fuck reddit.",
            "I honestly don't mind the broadcasts. What I DO mind is constantly seeing the same goatee hipster man playing random instruments and shouting...",
            "For real. I have an alt just for porn. Imagine how jarring it is to be mid fap, scrolling through some hot msut and then suddenly it's it's a 40 year old bearded man singing Acapella",
            "How do I stop weird ass naked anime children on the front page? Also, what the fuck is wrong with you people?",
            "You mean to tell me you don’t like seeing a guy in a gecko suit talking to strangers, a video of just an animal or a random person playing an instrument?",
            "Use old reddit",
            "I have a question to your question, How the fuck hasent an option to hide live broadcasts been added to Reddit enhancement suite yet? My Reddit experience sure as hell would be enhanced greatly if I didnt have to scroll past useless broadcasts that just eat up my data and pop in between posts.",
            "I’m sick of that guy dressed as a fucking frog. What kind of kinky shit is that?",
            "Or you could just swipe down once and the broadcast is behind you.",
            "Is this an new reddit thing I'm too old reddit to understand?",
            "You know it's all just a scam right. They're just collecting detail on what you like so they can sell you advertising.",
            "I keep trying to get reddit to stop showing me posts from nonewnormal and walkaway on \"popular\" with less than 300 upvotes... its not popular, its not a sub i agree with in any way... Reddit can fuck off trying to constantly show me unpopular shit in popular..",
            "I want to know the subconsciousness of those guys who watch lives, what is their motivations ? are they bored or simply dont have any attractions to girls, so they need to watch live to connect with people.\n\nBTW I run a community on reddit r/Streamingfan, follow to share live memes, accidents or any live contents",
            "Get off the internet and read a book. Or go outside. The rest of us are trapped, but you still have hope.",
            "Mine seemed to stop after i pressed it once but i guess im blessed",
            "I don't get those livestreams wdym, I honestly don't get why either",
            "My biggest issue with them on mobile is, sometimes, if I have a podcast or music playing in the background , just scrolling through the reddit feed will cause my background audio to stop because the live feed takes over. Even tho I have auto play off.",
            "One more time.",
            "I keep having to mark “X is not relevant to me”, but it keeps popping up.  So I’m guessing more than 20 times at least.",
            "infinite",
            "Use Reddit is fun for reddit. It's open source, it's about 8 years older than the official app, you can disable broadcasts, awards, etc. It's nice never getting notified.",
            "TIL reddit has live broadcasts.",
            "uBlock Origin gets rid of them entirely.",
            "I got banned from BlackMediaPresents and havent seen that fatass since.",
            "I've been trying the same with anything related to the Kardasians (intentionally spelled wrong) on Google's news feed. It just plain doesn't work.",
            "7,384,201",
            "Try the socializing ones, they're a bit lower than the music ones but much better imo! Also, reddit won't let you completely stop seeing that, maybe if it used a seperate DNS or something you could block it, not sure at all tho.",
            "Report as spam.",
            "I kept hitting “show me less” and eventually the app asked me what live broadcasts I was interested in seeing. “None” was thankfully an option and now I don’t see them at all anymore.",
            "Pretty sure you can turn them off in your settings, i dont remember where exactly tho",
            "Lol.. evvvveryday I pass the live feed of the Asian woman playing all types of instruments i have never heard of.",
            "\"Did you mean, \"show me more white guys with guitars?\" Sure!\"",
            "Easy. Press and hold for 10 seconds. Done.",
            "Lol, infinite.",
            "\"Show me less\" resets every update for me. Otherwise I don't see broadcasts after clicking show me less.",
            "No one knows. The limit has never been reached.",
            "or twoxchromosomes. ffs!",
            "go to old.reddit",
            "Is there some way how users could force reddit to remove these forced broadcasts or add a feature to get them to fuck off with them?",
            "Switch to old.reddit.com and never see them again.  It's a better layout too.",
            "1,748.",
            "Ublock Origin and i've never even seen those. To the point where i'm not sure what you're talking about.",
            "Old.reddit.com. I'm not even sure how to get to the live broadcast garbage through old.reddit.com.\n\nIf you're on mobile, use anything else other than the native reddit app.  RIF (formerly known as Reddit is Fun) is amazing.",
            "I remember this exact one. Where you from?",
            "2",
            "What is their goal in showing them?  It's always some dude in poorly fitting clothes playing something I don't care about.  They aren't selling anything.  There is no associated ad.  There is no apparent revenue incentive to show it.  What is the point?",
            "Well I just found out you can block it with ublock. I just clicked on the eye dropper.",
            "Whoever designed Ye Holy Algorithm for the YouTube Shorts feed needs to be punched in the throat.  There are a handful of producers *that I simply refuse to grant any portion of any fraction of a second of view time.*  In particular, I normally don't mind listening to the text-to-speech narration of r/AskReddit threads from the past.  There's at least half a dozen of them that my feed tends to rotate through.\n\nThere's one standout among them, though, that engages me to no end.  I've been insta-downvoting that specific creator for at least seven weeks now, and it's gotten to the point that I can DV and scroll in less than 0.21 seconds.  Still keeps appearing.\n\nI swear, Skynet must be developing a seriously psychotic sense of humor.",
            "on desktop: install ublock origin(why don't you have in install anyway!!) then the eye dropper, then click on the live stream thing.",
            "Thanks dude, didn't even know this was a possibility lol",
            "can I ask what may actually be a stupid question? What live broadcasts are you all talking about?",
            "It’s the worst part of Reddit. Hopefully one day they’ll understand that",
            "I know there is a way to turn them off completely, cause I did ages ago. I can't remember how right now. But I can say that you can turn off notifications for them, and any other annoying things, in settings>account settings> notification settings",
            "Maybe switch to old reddit? I haven't seen a single one and it could be because I only use old.reddit.com",
            "hurry up and get on with life",
            "Never, apparently the \"show me less of this\" just means that they will show less live shows relating to the vid. So they essentially move to the next topic when you say show me less of this.",
            "Until you download the Apollo App. You won’t regret it!",
            "Every company ever: \"LETS DO SOMETHING ELSE THAT IS POPULAR WITH OTHER COMPANYIES' USERS!\"  \n  \nA couple of years later, that division/ the company is defunct.",
            "I keep forgetting that they redesigned reddit because I think I used the redesign for all of 15 mins before getting the old reddit redirect extension. I just looked at the redesign again and my god how do people use that?",
            "I could say the same for the “Keep me logged in” notices",
            "Dude I've blocked accounts for certain broadcasts and still see them.",
            "I think there is a setting in the options to reduce broadcast suggestions but the real trick is to use old.Reddit on PC and Apollo on mobile",
            "One more",
            "Don't people open the first post and swipe left? Am I the only one who does that?",
            "You can turn them off",
            "From what I understand they are hidden for 30 days. Then come back. Keep on doing it. Hopefully reddit will understand that everyone hates them.",
            "Whether it’s broadcasts, recommendations, or fucking politics, they never listen\n\nI just scroll on by\n\nSo, basically, you could press it every time and it’ll never stop",
            "its not that hard to scroll past the guitar people",
            "Don't stop doing it, come back with the answer. I wanna know it too.",
            "imagine using the redesign",
            "The world may never know.",
            "Never, they always get you eventually! Muhahhaa",
            "Use: old.reddit.com",
            "Show me none. Stop. Fuck off.",
            "The world may never know",
            "Try collapsing, that will be much less annoying.",
            "Use old.Reddit.com you won’t have to deal with any of this broadcast bullshit.",
            "You have to press it all of the times... Literally until you run out of times to press it... Then there will be no more!",
            "Just use r/apolloapp",
            "just opt out of new reddit embrace tradition",
            "Just once more... and then you can have some cake.",
            "You guys need to get the \"reddit is fun\" app. None of that trash on here",
            "Is there a selection to choose from after you hit \"show me less of this\"? I know they ask a second question if you select that on a nonbroadcast post",
            "Just block the streaming subreddits",
            "Jokes on you, it's all ads. The ads disguised as awarded posts, and the ads in the comments that AUTOPLAY with audio",
            "Best option is to not select it at all (because they're not going away). I think there maybe some third party apps that don't have it. Also, eventually you'll see some random ones that may interest you. I've gotten a lot of different types of content, clicking 'see less of this' probably prohibits that\n\ntl;dr don't click it so videos become more diverse, 3rd party apps might not show it.",
            "I use the Reddit is Fun app. And have created a flair filter for broadcast, and I never see that shit.",
            "One more than the last number you pushed it.  Oh. It resets after you are done,",
            "Use Apollo. /r/apolloapp",
            "Same thing with livestreams and shorts on YouTube. I don't care about them.",
            "100%. When they remove the auto-mute I'm done. I don't need to see some dude practicing the recorder with his pet bird.",
            "Just use Old Reddit Redirect",
            "I just scroll past it. I only see it maybe a couple times a day. Just treat it like an ad and move on. It is no where near a big deal.",
            "I know you probably heard this before, but you could download the apollo app if you’re on iPhone.",
            "Use a third party app to browse the platform. AFAIK reddit has been the same for the last 6 years, minus the increase in astroturfing",
            "Until you download RIF and don't have to look at them, or any sub you don't like for that matter, any more.",
            "Another one",
            "Saying \"show me less of this\" won't hide the broadcast widget. However, you can use AdBlock's custom element hiding functionality to hide it on browser if you don't want a third party app. It's free!",
            "Same as blocking subs or removing jailbait porn, Reddit will never let you do it. \n\nI would fucking love to never see a r/teenagers post or block all of the gay men sub Reddits that I have absolutely no interest in seeing, but no, can't block a sub you don't like from appearing in new. \n\nThis site probably knows more about me than I do and it can't tailor my popular page to shit I'm interested in? Fuck outta here.",
            "I do everything in my power to skip over these. I hope Reddit puts these to rest, it’s not connecting with users",
            "523,438 more times. You've got a long road ahead of you. Godspeed",
            "I do it whenever one pops up and I usually only get them every couple months or so. not much you can do otherwise.",
            "At one point during the halo reach era in 2010-2011Ish, I played so much and muted so many people because I didn't know how to turn off gamechat(I was a stupid kid) and everyone on the mic was loud and annoying af. After numerous games where I muted everybody in the lobby, there came a point where I joined games with everyone in the lobby muted. However, this was a small community compared to reddit or anything running a live broadcast. Idk if this strategy would work if applied to your situation.",
            "This makes me so happy that I've stuck with Reddit Is Fun. I can't stand the official reddit app.",
            "I just scroll past them like they are ads at this point. I don't even notice they are their. \n\n I have to this alot on Instagram. For some reason it thinks I want to see destiny, skyrim, and coding memes. I am not a coder haven't played destiny seriously in years and have not spent enough time on skyrim yet to even finish the introduction. For a solid 4 months the explorer page was just destiny memes (like a solid 10 destiny memes in a row before there was any inturuprion with another type of meme) and whenever I would go to explore I would spend all of my time hitting \"not interested\" took it 6 months to catch a clue. I still getting coding memes at the bottom of my exsplore feeds over a year later and Skyrim is my explore pages new obsession.",
            "Once you get a permanent ban from live streaming, you won’t get them advertised to you anymore",
            "If I see one more middle-aged white guitarist on reddit I’ll scream.",
            "I feel like I see the same four people",
            "“Only once more, as always Ms. Swan.”",
            "It's hard to believe anyone doesn't use RIF and old.reddit on this site. The official mobile app and default browser versions are complete garbage.",
            "Use old reddit.",
            "old.reddit.com.  \n\nNo broadcast spam for me ;-)",
            "uBlock Origin - add this to the Dashboard > My Filters list:  \nwww.reddit.com##div\\[tabindex=\"0\"\\]\\~div>div:has(h3:has-text(/\\^Top livestream$/))",
            "Some advice: do not ever use the back button in the browser. This is guaranteed to put a feed into your page.\n\nSecond, and not sure if this is really helpful but only because I do it that I notice, but use the browser's right-click to open in new tab feature rather than click the title/image.\n\nDoing these together, I don't see these on my page.",
            "For. Ev. Er.",
            "I’ve actually never interacted with them, and I maybe see them once a week? So little my brain isn’t even storing information on them",
            "A million.",
            "I wish reddit took that Live Broadcast Tech and use it for a TikTok competition , like YouTube shorts.",
            "Exactly 224,636 times - winners never quit."
        ]
    },
    {
        "post_id": "jxd18h",
        "author": "whatisthisinmygarden",
        "title": "Please help a clueless dad and his daughter. Are there particular TikToks we should follow to find out and learn the popular dances?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/jxd18h/please_help_a_clueless_dad_and_his_daughter_are/",
        "score": 15901,
        "num_comments": 638,
        "created_utc": 1605825616.0,
        "selftext": "Hello, please don't make fun of me.\n\nMy daughter loves to dance and at school she and her friend do \"TikTok Dances\" which they love but none of them actually have TikTok due to their age. They must learn them from older siblings or something.\n\nI've made a TikTok account on my phone so I can try and find videos of dances to show my daughter to learn and take back to her friends but I just don't know where to start, where to look, what to search.\n\nAre there particular TikToks, or TikTokkers, I should be following to find out the dances? \n\nIs that how you learn the dances?\n\nPlease help out a clueless dad who wants to make his daughter happy.\n\nUpdate: Thanks for all the love and helpful comments everyone. I've managed to find some great tutorials for the dances so all is sorted. My daughter is going to be so excited when I pick her up from school and tell her what we're going to be doing tonight!\n\nI know there is a lot of concern when it comes to TikTok, particularly children and TikTok but rest assured that that is one of the main reasons I came here - to make sure I'd be getting good advice to find the good stuff and not the naughty stuff.\n\nMy daughter and her friends don't even know what \"TikTok\" is, they think it's just a name to describe dances that involve moving your arms and hands etc. haha\n\nSo, to summarise, thanks so much for the help and the rewards and don't worry; she won't be seeing anything inappropriate or posting videos on there.",
        "permalink": "/r/NoStupidQuestions/comments/jxd18h/please_help_a_clueless_dad_and_his_daughter_are/",
        "comments": [
            "Love that you are doing this! If you put “tiktok dances 2020” in to YouTube it will pull up the most current popular options. Many with the dance’s names and step by step instructions. I hope you all have fun!",
            "There is an account called “maskedancetutorials” that just shows how to do the dances! :)",
            "Just make sure you consistently check your parental settings and watch out for profiles with 18+ flags. Be aware things will end up on your fyp(for-you-page) that aren't what you bargained for, and always look into creators content history before following. There are many creators who multi create so you'll see someone on trendtok and find out they're content is mostly kinktok. Or the algorithm will send you a cosplaytok but they're more often creating witchtok content. The algorithm takes a few months to read you but always keep in mind, the more you like (hit the heart) in posts that are the content you're looking for, the more the algorithm will feed you that content. Feel free to ask me anything you're confused about.",
            "Follow Charli Damelio. She is the most famous tiktoker she dances and does other videos. She does all the trends.",
            "Charli D'amelio and Addison Rae are the biggest TikTok dancers.\n\nThis might help you: [https://www.thecut.com/2020/03/tiktok-dances-to-learn.html](https://www.thecut.com/2020/03/tiktok-dances-to-learn.html)\n\n[https://time.com/5880779/best-tiktok-dances-2020/](https://time.com/5880779/best-tiktok-dances-2020/)",
            "South Park Season 8 Episode 4\n\n\nhttps://youtu.be/meNYFsiR9Wk",
            "I don't use TikTok, but I'd definitely advise watching all the videos before showing them. Some famous dances on there are highly inappropriate for kids to be doing",
            "Holy crap this is cute",
            "Plot twist: he is just a man who wants to learn how to do tik tok dances but is to embarrassed to admit it so he made up a daughter so he can keep his manliness",
            "It's easier to find them on YouTube so you can show her these>\n\n1. renegade (its a staple. she can't not know this one)\n2. savage\n3. say so\n4. Captain Hook (clean version)\n5. wrap me in plastic\n6. cannibal\n7. like that\n\nthere are many more, but these are just off the top of my head. I'll put down more as I remember",
            "Idk but Reddit hates tiktok be careful dude",
            "Outside of TikTok dances, have you heard of the video game Just Dance? I worked at a kids day camp for a few summers and the kids really liked to play it. (We had Xbox, and then Nintendo Switch) and I recently played it with my brother and 8-year-old niece. It’d be a fun way you guys could further participate in this activity together. Just wanted to share, you sound like a great Dad, she’s lucky to have you!",
            "You're a great dad.  I am clueless about TikTok, but I had a great dad myself and you are one of the greats.\n\nThat is all.",
            "Sounds like a pretty awesome father to me lol",
            "Tiktok isn't for kids. It's highly sexualized and poor digital security.\n\nYou can watch popular dance tutorials on YouTube.",
            "keep your kids the fuck away from tiktok",
            "THIS IS SO WHOLESOME!\n\nPopular TikTokers to follow for dance challenges:  \n\n\n[https://www.tiktok.com/@charlidamelio](https://www.tiktok.com/@charlidamelio)\n\n[https://www.tiktok.com/@yodelinghaley](https://www.tiktok.com/@yodelinghaley)\n\n[https://www.tiktok.com/@keke.janajah](https://www.tiktok.com/@keke.janajah)\n\n[https://www.tiktok.com/@xoprinceali](https://www.tiktok.com/@xoprinceali)\n\n[https://www.tiktok.com/@ya.girl.bri.bri97](https://www.tiktok.com/@ya.girl.bri.bri97)\n\n[https://www.tiktok.com/@ajani.huff](https://www.tiktok.com/@ajani.huff)\n\n[https://www.tiktok.com/@thexhan](https://www.tiktok.com/@thexhan)\n\n[https://www.tiktok.com/@nicolebloomgarden](https://www.tiktok.com/@nicolebloomgarden)\n\n[https://www.tiktok.com/@jalaiahharmon](https://www.tiktok.com/@jalaiahharmon)\n\n[https://www.tiktok.com/@zoifishh](https://www.tiktok.com/@zoifishh)\n\n[https://www.tiktok.com/@giannalavecchia](https://www.tiktok.com/@giannalavecchia)\n\n&#x200B;\n\nHashtags to follow:\n\n\\#DistanceDance\n\n\\#BlindingLights\n\n\\#Attention\n\n\\#Supalonely\n\n\\#Renegade",
            "Yeah... some of those \"dances\" are only designed to make the girl's tits bounce as much as humanly possible while pretending it's just a totally normal dance, or for similar purposes, so make sure to stay away from those.",
            "Nika.kermani on tiktok breaks down all the dances in an easy to learn format",
            "Here’s one of a dad and daughters to start you off:\n\nhttps://vm.tiktok.com/ZMJx8UARg/",
            "Neither of us have Tiktok but we’ve seen enough to know there are dances. We just YouTubed “tiktok dances 2020” and spent the night learning a couple step by step. It was hilariously cringey but now we do them all the time, like a secret handshake. Some of them might be a little too risqué for a young person so I’d be aware of that, but some are just solid good fun!",
            "Also: screen shot this and show her someday like when she’s 13-16",
            "[This](https://www.youtube.com/c/LearnHowToDance) youtube channel has really slowed down easy tutorials for pretty much every popular tik tok dance!! I’ll admit as an adult I got really bored in early quarantine and tried to learn the dances for fun and this channel is the best resource hands down! 🥰",
            "Tiktok is really good at adjusting their algorithm so that each user will have a unique feed flow based on the types of videos they interact with. If you follow charlie and like or comment on her dancing videos, you will see a lot more dancing videos on your feed (“For You Page”). Avoid interacting with any non-dance videos and pretty shortly your entire for you page will exclusively be dance videos.\n\nHOWEVER the dances come and go as trends. So you will be seeing 100 videos of the same exact dance from different people. You won’t see a different dance unless somebody starts a new trend, then you’ll start seeing 100 people doing that new dance. It will be very hard to find a constant source of ‘new dances’.\n\nTo put it bluntly though the dances that trend on tiktok tend to be extremely sexualized, and I am not sure that as a parent you want your daughter imitating that.",
            "You dropped your crown king",
            "I don’t know any specifics just avoid the sexual ones like WAP (wet ass pussy) and many others. Some pedophiles are able to legally look at underage girls doing highly sexual dances and it isn’t good",
            "Tiktok is FULL to the brim with peadophiles. Be cautious.",
            "This is so wholesome 🥺",
            "Try Niana Guerrero she's really good at dancing",
            "Not dances, but 2 creators I can suggest because they're funny : jinnkid and daniel.labelle\n\nIf any of you find them funny, why not? :) sorry for being out of subject !",
            "charli d'amelio and her sister, dixie, and all the people surrounding them, chase hudson, addison rae, if you like and follow them, your for you page should be filled with people similar to them, (its how the algorithm works) hope this helps!",
            "Charli damelio",
            "So the most popular ones are usually by Loren Gray, Charli D'amelio and Addison Rae",
            "Charlie demilio is a dancer and she is the #1 creator on the app. Try following her",
            "You sound like the #1 dad of all time forever",
            "As someone in IT, I recommend that everyone avoids tiktok. It is a very invasive app that uploads the data of any device it is on, and in general is a cyberwarfare tool used to gather information.\n\nMaybe dedicate an old and generally unused device to watch your tiktoks",
            "YOU'RE A AMAZING DAD.\n\nmy bet is start with charlie and addison rae. for starters, you can just look up famous tik tok dance on yt and see whoever pops up more often, that's the person you should be up to date with and follow.",
            "Well, normally I'd make fun of tiktok, but this is so sweet you got a pass from me",
            "Please watch Childhood 2.0 on YouTube so you know what's really going on online.\n\nhttps://youtu.be/He3IJJhFy-I",
            "You can also get breakdowns of the popular tik tok dances on youtube",
            "If people are seriously hating on kids doing tiktok dances, they should get a life. As if we millennials didn’t dance in a cringey way to MTV, Eurovision kids and things like that.",
            "Keep her off TikTok. That's all I can say.",
            "Just don’t learn the WAP dance",
            "This is cute, but, mate, you're quickly going to find that many of the popular dances are extremely sexual...If I had a daughter, I would do everything I could to keep her off of that app.",
            "Whatever you do, just don’t twerk please. Or do anything related to that.",
            "If they don't have tiktok, they are certainly learning them from TikTok Compilations on Youtube.\n\nThe big two are charli d'amelio and addison rae.",
            "Some hashtag you can search is #dancetutorial, #tiktoktutorial on Tik Tok, from there, the app’s algorithm will automatically suggest videos next time. Another way is Youtube, search “song name” + tiktok dance tutorial",
            "Charli D’amelio and Addison Rae are the most popular for the trendy dances",
            "Show her some Hammer and Billy Ocean and tell her it’s TikTok.",
            "You can ask her what kind of dances she wants to learn and then Google that dance with \"tik tok\" or \"how to video\". There are a ton of videos on YouTube from you tok and visa versa.",
            "Put dance tutorials in the search and they will teach you the moves",
            "I don’t have or use TikTok, but I’m stopping by to say you’re an awesome Dad!",
            "This is cute. Wish you luck dude!",
            "Oh my God, this is one of my favorite things I’ve seen on Reddit in a while. You sound like such a good dad!",
            "I have no idea, man, but I wanted to tell you that you are an amazing father lmao",
            "YouTube fortnight dances. The popular ones get created in the game",
            "Go on youtube. Just make sure to weed through the sexual dances which make up for 95%, even if its advertised towards kids and younger girls.\n\n&#x200B;\n\nIts kind of like that netflix movie, telling small girls to twerk and shit",
            "[deleted]",
            "We aren’t going to make fun of you, this is so wholesome",
            "Damn I’m 16 and I don’t even know man",
            "Dad of the mutha fuckin century!!!  Don't do tik tok though, as everyone is stating it's bad Spyware.  But seriously awesome to take the initiative to help your girls.",
            "Omg I love this so much. You sound like an amazing dad!",
            "This guy does dance tutorials and many other his tiktok is @ruebennsnoww and you can also just type dance tutorials in the search bar and a lot will pop up",
            "this is overwhelming wholesome",
            "HA! Nerd! You love your daughter!!!  \n\n\nHey everybody get a load of this guy, being a good dad and shit!  \n\n\n(Seriously dude you inspire me and I hope to some day do this with mine. I have no helpful advice on this topic as I don't use the app or follow the trends. I'm just \\_barely\\_ too old to be interested in the app and not old enough to have a child who'd be of age to enjoy it. Again, much love dude, keep being a great dad.)",
            "Get the fuck out now whilst you still can, the app is plagued with child predators and “influencers”",
            "You are awesome!  I'm also a dad of 2 younger kids(boys), and understand how hard it is to find age-appropriate content for my kids to view that they also enjoy.  Kids are so desensitized to violence, sex, and gore these days that it is an extremely blurry line on what they should view.",
            "The algorithm will show you the way",
            "I would be extremely careful on this. Tiktok has a lot of toxicity on it, and children don't need that. I personally would follow charli damelio, she's a decent dancer. However, most of her dances are designed to look sexy, which children also dont need to be exposed to.",
            "Follow charli. But considering your daughter is too young to be on tiktok there are some questionable dances I wouldn’t recommend doing.",
            "For the love of god, don't use TikTok on a main device!",
            "I'd recommend just using YouTube rather than Tiktok. Tiktok can lead into some dodgy territory and there's absolutely no way to review what kids are watching. And remember with \"trendy dances\" some profiles that link to onlyfans account will follow the trend just for the exposure. Plus YouTube dance tutorials are longer and they work through movement and form a lot better than short clips on Tiktok",
            "You are an awesome dad. She's a lucky girl.",
            "This is so wholesome",
            "Stop while you still can, tiktok is toxic and does more damage than we think. When you can, I implore you to explore through the feed and see what kind of content is posted. What the songs are actually saying in terms of lyrics and what kind of dance is being glued to the song. I find that 80% of tik tok dancing has borderline display of inappropriate suggestiveness. It's nothing but a distraction to swim further away from reality.\n\nKeep your kids in check and make sure they know what is important, (Life long Skills & Accomplishments, Academic achievements - physical fitness, tangible goals etc) Also instil in them that internet fame is short lived, so you don't accidentally help create social media influencer(s) in your household.",
            "Please don’t encourage your daughter to go on there. And China is stealing your info",
            "There’s tons of dancers beware some of the dances are inappropriate \nSo maybe you can find better ones or just change something in the dance to make it more appropriate",
            "Just don't honestly ...",
            "Ok I use Tik Tok every day and see 0 nudity. If you start to like videos that are just people dancing, youll really only see people that are dancing. Data mining aside, there’s very little on tik tok that I would call “dangerous” unless you’re scared of learning about leftism from a 16 year old. Regardless, you should check out the account @krithi.com — it’s a mom and daughter who dance together and have a lot of fun. There’s other families doing just what you and your daughter are talking about and a quick Google of like “dad daughter tik tok dance” shows some accounts worth following too.",
            "Bro fuck tik tok!!!! Do not let your daughter on the app dude",
            "Because you claim yourself that you're clueless: be careful on TikTok. It's against the rules, but there's a lot of nudity and essentially porn that can be found.",
            "Just FYI, TikTok is notorious for collecting people's data, far more than even facebook or google. Also there are a bunch of pedophiles who try to get under 18s to do those dances for them.",
            "Don't touch TikTok.  It is Chinese spyware poorly disguised as a video streaming site.",
            "I don't follow TikTok dances at all but I came here to tell you that this post warmed my heart.",
            "Don't use TikTok unless you want your data harvested by the Chinese government. It's a good thing your daughter doesn't have TikTok - she can just watch TikTok videos on YouTube instead.",
            "The main tiktoker you can look at for dances is Charli D’amelio and also searching tiktok dance 2020 on YouTube or google, good luck!",
            "I hate social media but you're a good dad for taking the \"embarrassment \" away from your kid by asking. And of all things asking the internet. Have fun, be safe!",
            "This is such a good idea, this is a really good way to hang out and have fun with your daughter! Just be careful, some dances can be slightly sexual... If I had a daughter I wouldn’t want her to be twerking on the internet because of dancing trends. I saw my cousin do it and I was surprised. Kids don’t get enough awareness for the internet...",
            "I’m too old for *the* Tik Tok but I think you could also get an app for them to learn how to dance (steezy is like an online studio that I kept seeing on my Facebook feed over and over), I believe they even have K-pop moves.",
            "This is so cute. Kudos to your daughter and her friends for following age restrictions. I see many kids who are under 13 using tiktok without parental supervision. \n\nP.S. - you're a great dad",
            "I believe you can follow hashtags on tiktok. If you search dance or dancing in the app you should be able to follow the hashtag, that might show you more dancing videos. Also like others said charli damelio is a popular dancer. The more you watch the more you will see. It should adjust to you over time. Good luck and have fun with your daughter :)",
            "Not necessarily learning specific, but this is easily one of my favorites.\n\nhttps://vm.tiktok.com/ZMJQ2vStG/",
            "This is so nice, thank you for putting the effort to make your daughr happy!",
            "How sweet #1 dad right there ❤️",
            "As somebody who grew up without a dad for years, you make me really happy. Thank you for getting involved with your daughter and making her feel loved, you're a nice dad :)",
            "I don't have TikTok so I'm sorry I don't have an answer...I just wanted to say this was a really nice thing to read. With all the sad crap going on in the world right now, this is really refreshing and it made me smile. The world needs more dads like you. Hope you guys have lots of fun!",
            "i have no idea but please know that this is so cute and a great act of parenting. i lost my father young so this truly warms my heart. also echoing other in saying kudos to it being on your phone because tiktok can get weird and inappropriate at times.",
            "Be careful because there are a lot of privacy issues with TikTok. Like, even more than most social media stuff. But as the top comment and it’s top reply already said, look for this stuff on YouTube and you’ll see the names of some of the TikTok dancers and can follow them on there, too.\n\nAlso, may want to consider talking to her briefly about how most of these are just fads and go away pretty quickly. Didn’t flash mobs used to be a thing briefly like a decade ago? And I’m pretty sure there was something else before Fortnite’s “Flossing.” I also remember “The Carlton” back when Fresh Prince was popular.\n\nIf her and her friends like the dance stuff, you may want to suggest they try learning choreography to other dances, too. Like the old Watch Me Whip, Watch Me NaeNae or whatever, and Crank That by Soulja Boy. (Explicit song, just giving some examples I’m slightly more familiar with)\n\nThey could also probably try learning choreography from some movies at some point, like Step Up. If they bring in a new dance to perform at a school talent show or something, they may start a new fad briefly or something, instead of just being part of the current one. Even if they don’t manage that, I don’t think it would be bad to encourage them to explore more than just TikTok dances. They can do that, too, of course. \n\nAnd props for trying to do what you can to be a cool dad, and asking for help when you need it. Both are very respectable.\n\n(Wow, this is probably the most serious post I’ve made all year. Not even a hint of a joke yet. Maybe I’m dying D; oh no!)",
            "This is sweet. You’re a good dad!",
            "I dont have any recommendations for you but you're a good dad mate, keep up the good work.",
            "I don't have tik tok anymore but I'm pretty sure u can just search tik tok dance tutorials on either tik tok or maybe even YouTube?",
            "You are being a great dad and don't be ashamed or embarrassed, you are doing what you can because you love your daughter. Now go enjoy yourself and dance.",
            "Bro delete TikTok\n\nStraight up chinese spyware",
            "This is actually so sweet and not embarrassing at all! It is great when fathers don’t shy away from doing ‘girls’ thing with their daughters",
            "You are the best kind of Dad ❤",
            "Bro so like, I don’t use TikTok so idk, but you can probably just search tiktok dances 2020 on YouTube.\n\nBut more importantly I just wanna say that this is one of the most adorable posts I’ve ever seen. I can tell your very sweet and an amazing father.",
            "[deleted]",
            "I can't answer your question but I need to tell you that you are a good father. Your daughter is very lucky. Have fun dancing!",
            "Adorable",
            "inb4 reddit hivemind",
            "how sweet :)",
            "I don’t have an answer for you.... I just want to say I think it’s awesome you’re not only downloading the app for them but your asking this question!!   You sound like a pretty cool dad to me.  You’re daughters a lucky girl.",
            "TikTok is just a porn app disguised as a social network. \nPlease don't let any children see anything on that app, in less than a few days you can find on your recommendations literal pornografic material, and even minors doing them. \nStay aware with that app",
            "You’re using Chinese Spyware",
            "How old is your daughter? Might help to know how simple the dances should be :)",
            "I really wish more dads were like you, this is so sweet",
            "i don’t use tiktok so i can’t help you there, but i would just like to say that this is so wholesome.",
            "I cant answer your question, but I can tell you that you're an awesome dad. I had a shitty, abusive upbringing, and still (in my 30's) have a rocky relationship with my dad. I have a son, and I do everything I can to teach him to be a good human. Being a dad is what I consider my most important role in life. All that being said, you sir, have my absolute deepest respect for being the type of dad that others should view as an example. Well done!\n\nEdit: spelling",
            "Well if you care about your data, then just look up something like TikTok dances 2020 on YouTube.",
            "This is so wholesome, you’re a great dad!!!",
            "THIS IS ADORABLE",
            "There’s nothing I love more than seeing good dads be good dads. Keep on killing it, our future depends on it!",
            "I know it's not answering the question but better not even try getting into Tiktok and sign your daughter up for actual proper dancing courses/clubs. Or look up some online outside TikTok.\n\nNot TikTok. Simly no.",
            "A parent that's attentive?? STONE HIM!\n\nSeriously though, love that you're doing this for your daughter. No one would make fun of you, a lot of people could use a parent like you.",
            "Yes! Look up the how to tik tok section, then the video should be titled something like “How to delete Tik Tok”. You should be good from there mate.",
            "I think it's freaking awesome that you're willing to not only do these dances, but ask about it in Reddit. You are an amazing father.",
            "You are such a good father!!",
            "Follow popular tik tok stars. Also, make sure you “like” videos that are tik tok dances or tik tok dance tutorials. Your “For You Page” is largely based on your likes and interactions.",
            "This is so fucking wholesome",
            "You go Dad, and take a second to appreciate the relationship you have where you're learning dances together. I always try to remember, \"Fathers be good to your daughters, for they will love as you do.\" \n\nBut yeah I got nothin for you on the dancing. Zero. Especially when you ask what's popular right now. Good luck with it.",
            "Don't learn the dances. Don't. Just don't. Child or parent, you will regret this.",
            "First of all, this is No Stupid Questions.\n\nWe're not gonna make fun of you for asking a question, any question, the only stupid question is one left unasked.\n\nSecondly, you can ask your daughter which ones in particular she likes, or simply sort by the most popular ones to be able to show your daughter ones she might not have found, while letting her show you ones you don't know of yet, which allows for entertaining and bonding experiences.\n\nYou fucking go dude. Make your kid happy, I desperately needed this wholesome shit, so thanks for that.",
            "You’re a good dad man. Maximum respect for this",
            "Emma chamberlain posts most dances on her channel too!",
            "This man is very brave posting this on Reddit considering the stereotypes but what really surprised me was how many  people came out to help him. I honestly came into the comments to see how this had become another episode of r/roastme but your wonderfully surprised me you guys.",
            "Thank you for doing this to try and have a better relationship with your kids. I just wish my parents would do the same.",
            "/r/dancetutorials",
            "If you do decide to scroll thru the for you page (fyp): to make the app more designed towards you you have to like posts that are content u want to see and hold down on posts and tap show me less of this ok posts u don’t want to see",
            "You can go on YouTube too to check out the dance trends. Just steer clear of the unnecessarily sexual ones. Also don't hate on him guys for those who are hating on him. \n\nYou're a good dad bless your heart",
            "Jason Nash is this you?",
            "The key to dance is confidence the way you carry yourself makes a difference",
            "Look up charli damelio, addison rae on tiktok.",
            "...ngl, I'm a bonafide zoomer and I've got no clue whatsoever lol. All this tiktok stuff is too confusing for me",
            "Youre the best dad in the world. Just letting you know.",
            "This is so cute 🥺🥺",
            "You are a great dad. Good on you for taking the time to help your daughter with her interests. I don’t know much about where to find these videos, but I’m sure you’ll get bunch of others who can help.",
            "Well this is holsome as all heck. What a Dad :Did\n\nNever forget that everyone had to find out somehow. You've got plenty of advice already, so I just came to give you the high five for braving the internet for your little one.",
            "What a wholesome topic. You’ll be a good dad to your daughter.",
            "Bold of you to ask about TikTok dances on reddit!",
            "This made my day oh my goodness",
            "I have nothing to offer you in terms of actual advice, but just wanted to say you're an amazing father for doing this for your daughter.",
            "I don't know much about TikTok, but if it's anything like the rest of the internet, please just say no if she tries to have her own account.\n\n\nIt is pretty much a guarantee that one of these days you will look at her account and see men your own age trying to message her.",
            "It might be a good idea to go through the explore page and/or look at the audio charts! The charts can give you an idea of the songs trending and you can get ahead of the trends even!",
            "Fuck the CCP. Learn that dance.",
            "Love this! Enjoy that time with her and do those fun dances! Hoping for a video update!",
            "This warms my heart <3",
            "Was in a bad mood and saw this question. It's like a cat gif in the intertubes... the more I want to scorn it, the more fuzzy cuteness it exudes...\n\nGreat, now I'm in a better mood...",
            "This is so wholesome though",
            "This is adorable. I don't have any advice but I wanted to share how proud I am of you. Anyone who says anything negative to you is a fool. \n\nI envy your daughter and wish my dad was even a fraction as loving and thoughtful.\n\nNice job. 💜",
            "Charli damelio (or however it's spelled)  \naddition rae  \nmaddi monroe",
            "Charli Damelio is like the biggest one right now she does dances all the time",
            "This is probably the sweetest and cutest thing I’ll read all day",
            "Wow your a good dad",
            "You are a great person for trying to make your teen daughter happy! But if your daughter is like your typical teenager (moody, etc) DON'T! You'd be made fun of, and ashamed of, since you'd like look a typical dad from r/fellowkids. But if she's a good kid? I recommend copying from this girl Charli D'Amelio but I'm not sure since I don't use Tiktok.",
            "Someone please give this person the \"Dad of the Year\" award. No, seriously, you are such a caring and understanding father, not all dads are willing to go this length just for a \"Tiktok dance.\" You even had the courage to ask the people of reddit for advice. It's such a small favor, but it really shows how much you love your daughter. I wish I had a father like you.",
            "This is so nice. I feel like this is the nicest thing but also I don’t know if it’s the stuff but like it’s so nice that you do that so",
            "Don’t give in",
            "You're a good dad man.",
            "WY are you asking REDDIT for tiktok advice?",
            ">but none of them actually have TikTok due to their age.\n\n...\n\nThis should tell you all you need to know OP...",
            "As a TikTok user, generally speaking Charli D'Amelio does all of the trendy dances.",
            "Please don’t.",
            "Oh man. You’re such a good dad. Keep it up dude.",
            "This is so wholesome!",
            "Yeah, I don't watch then myself but Charli and Dixie Damelio, Addison Rae,.",
            "No. Just get off it please.",
            "get off reddit and on china's database",
            "Love this.",
            "Damn, props to you as a father!",
            "I hate tik tok dancing those ppl swear they are stars it’s so vain and self absorbed",
            "This is just my very own opinion, but most of the Dances that are produced on TikTok are terrible, sorry if you disagree but that's just my opinion.",
            "Tiktok is malware/spyware. Do not expose your daughter to it.",
            "If you respected yourself as a father you wouldn’t encourage the use of tiktok",
            "I really needed to read something this wholesome.",
            "Awww I don't like tiktok but this is wholesome.",
            "I wish I could give you an award, so please accept my compliment: You’re a good dad.",
            "Oh my gosh, I love that you are doing this to help her out! It makes me feel all warm and happy :))",
            "You sir, are an excellent father",
            "Wow what an amazing father! You’re in the right place although this is no stupid question. I would recommend starting with YouTube. From there you can learn the dances & see the names of the accounts of the most popular dancers on the platform",
            "You’re the most amazing dad ever <3 <3",
            "This is honestly the sweetest thing I have read in a long while",
            "This is so wholesome and sweet. Thank you for posting this and giving me something to smile about today",
            "Wholesome af",
            "If you love your daughter you should keep her away from this trash not pushing her in.",
            "Yeah just delete TikTok because it's a steaming pile of shit.",
            "Uh no...stay far far away from Tiktok..they steal your data..and there's a ton of pedos on it...do you really want your daughter twerking?",
            "In my opinion, definitely not. These dances seem very dumb to me, as someone of the generation who does them.\n\nIf you want to and it helps you get closer to your daughter just look up stuff that's relevant to the year or even the month\n\nI just think it's unnecessary \n\nI could never do that shit into my camera",
            "This has to be the sweetest most adorable and wholesome thing I’ve seen in like forever and I think you’re an exceptional dad.",
            "Wholesome",
            "Stop this immediately.",
            "Hearts in the right place but I dont like this. You do you I guess",
            "Please don't use that cancer of an app. Find YouTube videos.",
            "You’re a good dad, I don’t particularly understand this whole dancing in front of a phone trend but I hope it all works well for you and brings you closer to your daughter!",
            "Cute! Say hello to your daughter from me! TikTok can be fun, but I’m so uncoordinated I can’t do ANY of the dances without looking like a waddling duck.",
            "If it’s not a problem, you should share your tiktok to the post so we can follow and hype you up when you do dances!",
            "this is the most wholesome thing I've read all day, props to you for being a great dad",
            "[deleted]",
            "AWWWWWWW",
            "What is a tiktok dancer?",
            "@thewaterchamp\n\nJK! For the love of god, do not show those to a child!",
            "I can't help you but I really admire this. I wish you luck.",
            "Unless you want her to be glued to a screen with her attention span decreasing exponentially then I'd advise you not to. \n\nThere have been many instances of people posting Momo and bloody suicide bloopers on it as well.",
            "You should avoid TikTok entirely.",
            "Nope don’t learn any tiktoks and don’t let your daughter spend crazy amounts of time on there. It’s social media so a couple hours on a not busy day naught be fine, but the algorithm is meant to keep teenagers on there for 6+ hours a day",
            "Get yourself and your daughter off tiktok and take your daughter fishing instead. Tiktok is not a good place.",
            "follow Charli D’Amelio. she is the most famous tiktoker and all she does is dances!",
            "Sorry I don’t use the app but I find this wholesome AF!",
            "There are a million other things you could teach your offspring that will actually benefit them in life but you chose tik tok...",
            "I’m so proud of you for asking this question. You’re obviously very anxious given you asked not to be made fun of, but I need to commend you for taking such an invested interest in your daughter and her interests. Good parenting right there. \n\nSorry that I don’t have any suggestions for tiktokkers but I hope you found some good ones.",
            "I know nothing about tick tock... however... congrats on being on of the best dads out there bro! Keep up the good work! 🧡",
            "and this is how the world is going to shit",
            "I haven’t seen anyone mention this yet...[STEEZY Studio](https://www.steezy.co) has TikTok dance tutorials amongst many other dance tutorials.  They offer a 1 week free trial.  $20 a month after that or $100 for the year.  \n\nMy boyfriend’s daughter loves to dance, so I was looking for something to help her develop her dancing skills as a birthday present.  Initially, I was only going to purchase one month for her after the trial, but I was impressed enough with the quality and features that I purchased the year subscription.  I definitely recommend checking it out.\n\nEdit:  Getting downvotes on my post.  I can understand how people are resistant to something that may sound like an infomercial, but I actually really like what I recommended.",
            "[deleted]",
            "My favorite dancers are @analisseworld and @jordan.natae! They post often, and i dont really follow and learn tik tok dances, but im pretty sure they do all of them! You’re doing great!",
            "Thank you for not letting her be on TikTok :-) You seem like a great dad.",
            "I’m just waiting for somebody to say nonce.",
            "Start with “Shuffle Dancing.”  They’re pretty basic and I think they're doable.”  Just look it up on youTube.  There are lots of good slow tutorials.  Once you become confident, you can make a TikTok with your daughter.  Have fun  :D",
            "This is so funny. This dude is laying the evidence so he's got an alibi for when his wife finds him following a bunch of 14 year old dancers on tiktok",
            "Just find really hot college girls on Instagram and do what they do.",
            "HI\r\n\r\nI hope you are doing well!!\r\n\r\nPlease follow my channel"
        ]
    }
]