[
    {
        "post_id": "k76mw8",
        "author": "SiibillamLaw",
        "title": "Americans, do you actually have to recite the pledge of allegiance, like in movies? Is it as culty as it looks?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/k76mw8/americans_do_you_actually_have_to_recite_the/",
        "score": 35152,
        "num_comments": 7392,
        "created_utc": 1607171257.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/k76mw8/americans_do_you_actually_have_to_recite_the/",
        "comments": [
            "The pledge and a moment of silence were standard in my school all the way through 12th grade. In elementary school pretty much everyone recited it and it probably did look culty but I didn’t notice. In high school fewer people recited the pledge but we would get detention for not standing up.",
            "I went to a small Christian school where not only did we pledge allegiance to the American flag every morning but to the Christian flag and the bible as well.",
            "Through elementary school and junior high we did.  So for us that's up through grade 8.  It calmed down in highschool, but that may depend on the area for other people.  Also I graduated in 2005, so it might be different now.",
            "You don't have to recite it. In some parts of America you would be looked down upon in school for not doing it but no one can force you. Supreme Court has ruled on the subject that compulsory pledge of allegiance is unconstitutional. Same with schools who want to require prayer in the morning.",
            "I live in the Bible Belt. They absolutely made us at the schools I went to. We had to stand with the hand over our heart and the teacher would sometimes come around to make sure we were saying it out loud. Hats had to be off, posture had to be straight. One of my classmates had told the teacher they weren't saying it due to personal reasons. Got in school suspension. This was public school too. \n\nThis was in the 90s. Never realized how messed up it was until I met folks who lived outside of the country who were like \"whoa dude wtf\".",
            "Yes, we said the pledge every day before school from kindergarten to 12th grade. Technically (legally) no one can make you say it, and some kids will sit in defiance. By 12th grade almost everyone just stands and no one really says it, they just go through the motions. In elementary school basically everyone says it. \n\nIn elementary school I never felt it was culty. They taught us a lot of good things about our country and I would think about the sacrifices made by soldiers and American heroes and I had pride and respect for the people who built America. \n\nIn middle school when I knew more history I started to realize it’s ridiculously culty and should not be done.",
            "Officially no, we're not required to say it. In practice, through pressure, manipulation, plain ignorance etc. yes, *some* areas do make kids actually say it. Bit of a sore spot for me in fact, because I tried to protest against saying it as a kid and was punished-- even though I wasn't supposed to be forced to say it, I was anyway. When you're a kid, it's easy to take advantage. Teacher tells you you have to, so you do it.\n\nEveryone saying \"no one forces you\" are not acknowledging the reality in many areas of the country. They're not *supposed* to make you say it, that doesn't mean they don't.\n\nI'd like to say that kind of pressure or manipulation tactics or just flatout inadherence to the law wouldn't fly today... but I know it does. I've since talked to some of my former teachers and they boasted about the tricks and loopholes they use in making kids say it.\n\nYes, it's absolutely 100% as culty as it looks.",
            "We did in elementary school, but in high school we just had morning announcements. I think it just varies by state/region/school district.",
            "And to make it more culty the controversial phrase \"under god\" was not added to the pledge of allegiance until 1954.\n\nhttps://www.washingtonpost.com/news/retropolis/wp/2018/06/14/the-gripping-sermon-that-got-under-god-added-to-the-pledge-of-allegiance-on-flag-day/",
            "This restaurant near me stops everything they're doing at 12pm noon every day, the employees all come out from the back, and everyone stands up and recites the national anthem. Weirdest fucking thing.",
            "Yes and yes. Unless you want to be the unspoken class weirdo. This isn't just in the Bible belt, I went to school in the Bronx in the 90s. No you weren't suspended or shot for not reciting it, it's expected just like standing for any national anthem. It never felt culty as kid, just corny but as an adult yeaaahhh seeing through the vail of all the propaganda is cause for cringe",
            "We don't *have* to do anything, it's specifically illegal to face any retribution for not doing it. Many a kid will sit defiantly during the pledge.\n\nYes, it is a thing that is done in U.S. schools - kindergarten through 12th grade - in the morning before the first period. Yes, it does feel a little culty looking back.\n\nOutside of that it's typically done at political rallies and sporting events, not really anywhere else.",
            "As an American who has pointed this out, it’s an expectation more than an obligation. We were made to do it every morning before school began and you would definitely be looked down upon for abstaining. Admitting to the fact that I, personally, consider it to be idol worship has resulted in my family telling me that I hate my country. It is just as culty and creepy as you think and this country’s idea of what “patriotism” looks like has become seriously skewed.",
            "When I was in school we recited it every day. It was just part of the routine; I didn’t even think about it. There were a couple of kids who didn’t recite it for religious reasons (no idea what they were); no big deal. \n\nNow at my kids’ school they do it once a week (well, pre-covid; now school is online). I told them not to bother saying the pledge unless they want to. \n\nIt is, to me, a completely inappropriate thing to ask kids to recite. I have to promise to be faithful to a piece of cloth, and my country, while invoking God? No thanks. That has no place in schools.",
            "No child can be forced to recite the pledge. In TX I send a letter to each of my kids’ teachers at the beginning of each school year reminding them my kids may choose to opt out of the pledge if they want. I personally ask my kids to not recite the Texas pledge they have here because I think that’s beyond silly to have a kid pledge themselves to a specific state.",
            "It’s worse than that. My school had the pledge of allegiance AND military propaganda that we had to watch every day for 15 minutes after lunch masked in some cutesy “teen news show”. But it was definitely military propaganda, there were about 3 commercial breaks in like a 15 minute piece with a “join the military it’s so amazing” ad in between each. 🤮\n\nFYI I grew up in Washington State, so not even a conservative state.\n\nEdited to add: I did not stand for the pledge of allegiance and gave the reason that I wasn’t American 😝🤷‍♀️(which was true). People did give me odd looks and sometimes made comments. I was never punished for it by teachers.",
            "You can't legally be forced, but many kids across the country still are. My mother is a teacher, and while she doesn't force her students, it's a required thing her school does every single day.       \n       \nAnd yes, the pledge is absolutely culty as hell.",
            "I grew up in Georgia and we recited it all the way through high school in the mornings. I can’t recall if there was anyone who explicitly got in trouble for not doing it, but I think the teachers wanted you to at least stand up for it if you didn’t want to say the words. Also similar to other commenters, it was coupled with a moment of silence (maybe around 30 seconds or so)\n\nYes 100% very culty but only if you think about it directly. In the moment it felt very normal and routine. Same as listening to the national anthem before sporting events",
            "In elementary school it was done over the intercom and you were expected to do it every day. We were young enough to follow along without question. No they can't force you.",
            "Nepali here. We must compulsoryly stand up for the national anthem in school",
            "You don't *HAVE* to, but most do. You can't be forced to.",
            "Back in the 80's when I was in elementary school we got in trouble for not participating in the pledge. I went to DoDs schools so I can't speak for everyone my age.",
            "When I was a child in 1960s Indiana, every morning in school we would all stand, face the flag, put our hands over our hearts, and recite the Pledge of Allegiance. I don't know how things work in schools these days.",
            "Theyre not alone in this. I had to do it too. Ok techmically i didnt have to but the peer pressure was real.\n\nCountries are dumb, humans are all the same and borders are violence.",
            "I am not American so I cannot answer your question but as someone who lives in Turkey I can talk about reciting the pledge. I think it is kind of cultish because you literally pledge to put the existence of the state above yourself. It feels a kind of nationalistic propoganda to be honest.   \nMoreover, it ends with this exclamation,\n\n>\"My existence shall be dedicated to the Turkish existence. How happy is the one who says \"I am a Turk!\"\n\nFor many years this did not feel off to me; however, I feel conflicted now for I am actually a Circassian. And even though my ancestors came to this region in 19th century (they were exiled from their homeland after the conquest of Russia), The Turk in the pledge had the meaning of the people of Turkey initially; however, many nationalist does not solely think like that.",
            "As a teacher none of my students usually want to, I think it's culty to make them, and it's a fight I'm just not willing to have. As long as they're quiet during announcements I don't care.",
            "Yes. Moreso frequently In the past than present, it’s slowly dying out. \n\nIt stopped all together around freshman year of high school for me, which was 2008/2009. But all throughout middle and elementary school for myself and my sister we had to recite the pledge of allegiance every morning before morning announcements.\n\nMy parents did it up until college, same as my grandparents and assumedly their parents as well.\n\nI’m from the Midwest part of USA.",
            "even more culty than u think it is",
            "I recite it out of respect but I leave out “under God”",
            "Only in elementary school, and maybe the odd political rally.",
            "Lol I’m 65 and when I was in school we had to stand   Hand over our heart and recite the pledge. Never even thought how culty it was until now! This was the Seattle area.",
            "We don’t have to. I live in Louisiana, but in a more liberal part. Lots of people sit down and nobody says anything. I usually stand and don’t say anything. A lot of people don’t want to do it, like me, but feel like they have to so that the conservatives in class don’t freak out.",
            "LoL, it is accurate. We don't find it weird. It really isn't until you start thinking about it. \n\nNo! Stop! Don't try to think about the EVENT!",
            "As a child of the 90’s, I grew up thinking it was absolutely mandatory. Wasn’t until after 9/11, and I was a senior, that I realized nobody could make me do it, so I stopped. It was my own protest, and I felt it was actually more patriotic to do so. I was harassed by another kid once, but the teacher was a Vietnam veteran and quickly explained to that kid what was what. \n\nMr. Stewart was a hero.",
            "It's exactly as culty as it looks. Nothing is creepier than 5 year olds who can't even read swearing loyalty to their government.",
            "The entire class will turn on you if you dont do it too,  everyone is brain washed.",
            "Yeah, it’s very naziesque",
            "It's prime brainwashing since you are a little kid.",
            "If you go to public schools, yes they pressure you and make it seem like you have to recite it. If you don't you get sent to the principle's office or something.\n\nPrivate schools are different. As far as I know not many of them do the pledge of allegiance. Mt private school was religious so once a week at chapel we recited the school's mission statement and a religious statement. Still just as cult-y as the pledge of allegiance though.",
            "I always wondered if this was just a US things or if other countries did this. I never saw it as cultish or inappropriate. It was just how you started the day.",
            "Yes and yes. I was reprimanded when I didnt want to stand in junior high.",
            "Don’t know what movies you watched but we did stand, place our right hand over our heart, and recite it. Is that cult like? I’ve always done it so it just seems normal.",
            "I actually got sent to the principals office for saying, “One Nation under science, with liberty and justice for all.” When you add that bit I actually enjoyed saying it, because I believe in the idea of a country where everyone can live freely in the way that makes them happiest, I also wish I lived in a country where justice was served when and where it is needed but that’s not the case, it’s just an ideal that we fail to hit.",
            "My senior year of high school They tried to force me to do it even though they new it was my first year in the U.S and held citizenships in other countries. Lol. I told them that I couldn’t do it as I am not willing to die or pledge my allegiance to a country run by a bunch of billionaires. I ended up just using the bathroom every day at the same time to not have to deal with that craziness. Also I don’t hate the U.S just to be clear. I do what is in my power to make my city better but the pledge of allegiance is a little to far for me.",
            "I grew up in louisiana... It was mandatory... They would suspend you for the day if you had the right teacher, and they would label it as a disrespect suspension... I was born in 1992 just so you can get a picture of how recent that was",
            "I’m in the western US and we don’t do it.",
            "Grew up in California. I recall reciting it in school probably up until 4th grade (private school) which would have been circa 1988. Honestly I don't even remember the words anymore.",
            "Its real. By law they can not force students to do the pledge, but Ive had quite a few teachers who made us",
            "Yeah, they'll try to force you into saying it.  They'll definitely turn their peer pressure up 100%, including shaming or threatening you after if you don't.  The religious fantatics will fully shout out \"under gawd\" as loud as they can for that part which was added in a fit of religious lunacy.\n\nYeah, it's totally as creepy as you would expect.",
            "I come from a military family and we lived on bases growing up. We not only had to recite the pledge of allegiance, but also were required to sing \"My Country Tis of Thee\" afterwards.",
            "Yes and yes. Had to recite it everyday of elementary school, but after that, no one really gave a shit about it. \n\nBeing an atheist, the \"under god\" part always made me uncomfortable as a kid, so I left it out.",
            "Yes. To be honest though my gripe is not with the pledge of allegiance itself, but the words “under god” which were added decades after the pledge was written during the height of the Cold War to distinguish us Americans from the communists hiding under the bed. \n\nThe separation of church and state is one of those things where America doesn’t match its propaganda and this small example has endlessly annoyed me. \n\nSo while I have no problem with the pledge itself as a daily ritual for schoolchildren, I do wish we’d go back to the original version.",
            "During WW2 a couple of Jehovahs Witness children were expelled from school.  They appealled and initially lost the Supreme Court decision which kicked off a wave of persecution and mob violence against Jehovahs Witnesses.  Some were castrated, tarred and feathered, beaten, hung, etc.  The Supreme Court overturned its decision.  Its a famous case... something like Goebitis vs school board or something.\n\nSo, no we don't have to salute the flag. \n\nAlso, the flag salute was written against by the founding fathers... and was written by a communist.\n\nHave a good day",
            "Back in 2015-2016 I went to a Trump rally. Not because I supported the terrorist, but because it’s important to hear what important people are saying. \n\nThere’s nothing more frightening than hearing 10000 people chanting the pledge of allegiance",
            "In Texas you also have to pledge to the Texas flag.",
            "My kid is in grade school. As we're doing distance learning right now I know that every morning they say the pledge. Then they do a \"mindful minute\" where they sit quietly and think about whatever topic it is that week. Ex: how can I be a better person, what are goals I want to set for myself, how can I work to achieve my goals.\n\nIt's a bit weird when you think about pledging your allegiance to a flag. We should be pledging allegiance to our people. But having grown up doing it it's not super weird in practice.",
            "I’m an American and I think it’s absolutely crazy that we have children stand up every morning and chant their allegiance to the country. I tell my kids that they absolutely do not have to do that.\n\nMost of the kids don’t even understand what they’re saying.",
            "For my social studies class in eighth grade we had to propose and present a “bill” and the class would vote and the teacher would act as the “president.”\n\nI decided to remove under god from the pledge of allegiance.\n\nHoooooo boy I did not expect the absolute vitriol from other kids that came from that. People were fucking outraged. Obviously no one had a sensible reason that it should be there, but they were relentless that I was dumb for suggesting it be gone.",
            "In Texas we had to do both US and Texas PoA"
        ]
    },
    {
        "post_id": "jdz90t",
        "author": "Joruto512",
        "title": "Why do we give children illusions about Santa etc on Christmas instead of telling them that you get your loved ones a gift? The latter seems more lovely and is actually the truth",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/jdz90t/why_do_we_give_children_illusions_about_santa_etc/",
        "score": 34813,
        "num_comments": 3386,
        "created_utc": 1603103649.0,
        "selftext": "Well title says it all. I jsut dont get it. \n\nIf i ever have kids why should i tell them such a lie? and not just be honest about what christmas is?  \nTo me getting and giving a present to a loved one / child is much better that \"hey some imaginary figure gave that to you\"..   \nEven saying that christmas is just about love and not gifting seems better.",
        "permalink": "/r/NoStupidQuestions/comments/jdz90t/why_do_we_give_children_illusions_about_santa_etc/",
        "comments": [
            "When I was a kid my parents would give me gifts from Santa as well as themselves, so it doesn't have to be one or the other. She would also write on other gifts from Frosty the Snowman, from Rudolph, and a bunch of other imaginary christmas characters. My mother even did this long after we stopped believing just for fun.",
            "I know when I was a kid my parents weren't well off at all and loved budgeting so whenever I got a toy or anything it would be something cheap and small. Every Christmas i would say \"Im asking Santa for this because I know it's too expensive\" And \"Santa\" would get at least one of the expenisive gifts and my parents would give me the smaller things. I think it was good so I never became more entitled and expected more from my parents. As some of the other posts said it made things magical because not only the lore of santa but it was the one time of year I could get a toy that I often saw the kids at school with. And once I realized Santa wasn't real it just made the gifts more special.",
            "I always thought it was all a way to get kids to behave. You didn't want to be put on a naughty list",
            "[removed]",
            "I used to think it was magical or just a bit of fun until I started teaching. Every year come January the kids would come in and start talking (sometimes bragging) about what Santa had given them. Sometimes Santa was extremely generous to certain children, others unfortunately not so much. You could see some of the other children who were \"good\" thinking to themselves \"why didn't I get as much as everyone else?\" It was actually a little heartbreaking.\n\nEdit- Santa seems to be a really emotional subject still for a lot of people. My original comment was made quite casually.  I should clarify that I'm not suggesting we cancel Christmas. The issue I have is that we generally feed kids this idea that there is a godlike figure who will pass judgement on how good or bad you are, but then doesn't even follow his own rules, because he gave your bully more gifts than he gave you. I am not in denial that shitty things still happen to good people either. It's a big hot topic in schools right now to help children be resilient and we do that whenever opportunities arise.  But as adults we are in control of how we explain the mythology of Santa and set up whatever traditions we want to follow. Let's just be mindful and show a little empathy while we do so. At our house Santa gives one modest gift and fills your stocking, everything else is from family and friends. I really don't get people's logic that the wound is already there, so what's the harm in a little sprinkle of salt. Trust me, kids know early on where they all sit in the pecking order, all year round. They don't need the added salt.",
            "I never really believed my parents about Santa (I think they made some slip-up really early that I picked up on) but I quite enjoyed buying into the fantasy anyway. It's a fun make-believe thing and I think actually lot of kids enjoy it even though they see through it. Most of what young kids do with their friends is pretending anyway.",
            "I was raised with no Santa. My mom did have to tell me other kids believed in him after I tried to let my best friend in on the secret. Anyway, my parents, the ever weird people that they are, and my aunt (also very weird) came up with a different magical Christmas deity, the Cosmic Christmas Jellyfish, when I was four. I'll explain the CCJ below because Santa probably would have been better. \n\nThe Cosmic Christmas Jellyfish (CCJ for short) live deep below the ocean and sometimes comes out and flies in the sky leaving a colorful goo in his wake that some people mistake for the Northern Lights. He is a giant, colorful, magical flying jellyfish. \nTo receive presents on Christmas you must do as follows:\n1. Clean your room \n2. Leave a pistachio offering out for him \n3. Be asleep. \nIf all of those things are done he will eat the pistachios and poop out your presents. \nIf they are not, however, he will rip you limb from limb, eviscerate you, and leave your guts strewn about your room to be discovered in the morning. \nI had a weird childhood",
            "I think the biggest problem with telling young people there's no Santa is because kids have no filter.  When everyone at school is talking about Santa, they'll blurt out that Santa isn't real, and they'll crush all their classmates.  \n\nI read this once, and I saved it.  If I have kids, I think I'd like to do this.\n\n[The Secret of Santa](https://redtri.com/i-m-the-mom-behind-the-secret-of-santa/)\n\n>In our family, we have a special way of transitioning the kids from receiving from Santa, to becoming a Santa. This way, the Santa construct is not a lie that gets discovered, but an unfolding series of good deeds and Christmas spirit.  \n>  \n>When they are 8 or 9—whenever you see that dawning suspicion that Santa may not be a material being— that means the child is ready.  \n>  \n>I take them out “for coffee.” We get a booth, order our drinks, and the following pronouncement is made:  \n>  \n>“You sure have grown an awful lot this year. Not only are you taller, but I can see that your heart has grown, too.” I point out 2-3 examples of empathetic behavior, consideration of people’s feelings, good deeds etc, the kid has done in the past year.  \n>  \n>“In fact, your heart has grown so much that I think you are ready to become a Santa Claus. You probably have noticed that most of the Santas you see are people dressed up like him. Some of your friends might have even told you that there is no Santa.  A lot of children think that, because they aren’t ready to BE a Santa yet, but YOU ARE.  \n>  \n>“Tell me the best things about Santa. What does Santa get for all of his trouble?\" We work our way from “cookies” to the good feeling of having done something for someone else. “Well, now YOU are ready to do your first job as a Santa!”  \n>  \n>Now for the fun part! Make sure you maintain the proper conspiratorial tone.  \n>  \n>We then have the child choose someone they know–a neighbor, usually. The child’s mission is to secretly, deviously, find out something that the person needs, and then provide it, wrap it, deliver it–and never, ever reveal to the target where it came from. Being a Santa isn’t about getting credit, you see. It’s about unselfish giving.  \n>  \n>My oldest chose the “witch lady” on the corner. She really was horrible–had a fence around the house and would never let the kids go in and get a stray ball or frisbee. She’d even yell at them to play quieter. He noticed that she came out every morning to get her paper in bare feet, so he decided she needed slippers.  \n>  \n>His next task was to go spy on her and decide how big her feet were. He hid in the bushes one Saturday, and decided she wore a medium, so we went and bought warm slippers. He wrapped them up, and tagged it “Merry Christmas from Santa.” After dinner, he slipped down to her house, and slid the package under her driveway gate.  \n>  \n>The next morning, we watched as she waddled out to get the paper, picked up the present, and went inside. My son could hardly contain his excitement, and couldn’t wait to see what would happen next. The next morning, as we drove off, there she was, out getting her paper–wearing the slippers. He was ecstatic. I had to remind him that NO ONE could ever know what he did, or he wouldn’t be a Santa.  \n>  \n>Over the years, he chose a good number of targets, always coming up with a unique present just for them. One year he chose the daughter of some friends of ours, who were going through some tough times. Christmas for them was looking pretty bleak. With the help of his father, he polished up his bike, put a new seat on it, and with her parents’ permission, placed it on their back porch. The look on her face when she saw the bike with a big bow on it was almost as good as the look on my son’s face.  \n>  \n>When it came time for Son #2 to join the ranks, my oldest came along, and helped with the induction speech. They are both excellent gifters, by the way, and never felt that they had been lied to—because, instead, they were let in on the Secret of Being a Santa.\n\nAs my siblings and I got older, and my older brother and I knew Santa wasn't real while one or both of my younger sisters still did, my mom used to say \"as long as there's a spirit of love in the world, there's a Santa Claus.\"  What this lady did with her kids seems to demonstrate that in spades.  I think she successfully transitioned from the magic of Santa, to the magic of gifting selflessly. and she did so in such a way that the kid isn't going to tell his classmates that Santa doesn't exist.  Because Santa does exist, just within all of us.",
            "My mom didn't raise us to believe in santa\n We knew it was her. We still did all the santa stuff (writing letters, leaving out cookies and milk, etc) though just for fun.",
            "[deleted]",
            "“Santa’s watching” is a good excuse to get your kids to behave for like four months.  It also just makes the day more magical and fun.",
            "Historically speaking, the original Santa was a man who gave to the poor and expected nothing in return. That's what Santa is supposed to be and it's supposed to teach children to be selfless and give even if there's no incentive",
            "I will tell my son about father Christmas to have some magic/wonder and I will also give him gifts from family and tell him it's family because of the reasons you mentioned.\n\nChristmas can be full of magic and wonder and love.",
            "[deleted]",
            "I used to tell my son when he was little that Santa Claus was the spirit of giving. Not a real person, in other words. A symbol.",
            "I’m sorry, what is this about Santa being a lie?",
            "I look at it this way: they've got their entire life to become cynical husks. Let them believe in magic for a while.\n\nThat said, the big tip that my parents used and that I use on my kids: Make sure that the best gifts come from the parental units and the stuff Santa gets them is just run of the mill stuff. Kids won't care but it does help prevent the \"why did Santa get me a gold plated Xbox while Timmy in class got a stick with a bell on it?\" type of questions",
            "At the risk of being to sappy, I think Santa Claus is a breath of fresh air for adults and a wonderful way to give your children something magical to believe in.",
            "I never told my kids Santa was a real person, but that he was a character that adults like to pretend to be, the same as kids pretending to be super heroes, princesses, dogs, dinosaurs, etc. Part of the character's personality is giving gifts, being generous, and appreciating what he has.\n\nI don't understand people who think the only magic of Christmas is Santa. My kids love Christmas, even knowing Santa is just a character. The trees, lights, other decorations, music, time with family they usually don't get to see, the baking, the parties, the (sometimes) snow, and yes, the presents all contribute to their love of the holiday.",
            "Susan: “All right,\" said Susan. \"I'm not stupid. You're saying humans need... fantasies to make life bearable.\"\n\nDeath: REALLY? AS IF IT WAS SOME KIND OF PINK PILL? NO. HUMANS NEED FANTASY TO BE HUMAN. TO BE THE PLACE WHERE THE FALLING ANGEL MEETS THE RISING APE.\n\nSusan: \"Tooth fairies? Hogfathers? Little—\"\n\nDeath: YES. AS PRACTICE. YOU HAVE TO START OUT LEARNING TO BELIEVE THE LITTLE LIES.\n\nSusan: \"So we can believe the big ones?\"\n\nDeath: YES. JUSTICE. MERCY. DUTY. THAT SORT OF THING.\n\nSusan: \"They're not the same at all!\"\n\nDeath: YOU THINK SO? THEN TAKE THE UNIVERSE AND GRIND IT DOWN TO THE FINEST POWDER AND SIEVE IT THROUGH THE FINEST SIEVE AND THEN SHOW ME ONE ATOM OF JUSTICE, ONE MOLECULE OF MERCY. AND YET — Death waved a hand. AND YET YOU ACT AS IF THERE IS SOME IDEAL ORDER IN THE WORLD, AS IF THERE IS SOME...SOME RIGHTNESS IN THE UNIVERSE BY WHICH IT MAY BE JUDGED.\n\nSusan: \"Yes, but people have got to believe that, or what's the point—\"\n\nDeath: MY POINT EXACTLY.\n\n~ Terry Pratchett, *Hogfather*",
            "Look, I’m sure this will get buried and no one will appreciate the thought.  I choose to write “from Santa” to every gift I give my kids. \nI want my kids to appreciate a gift as it is. A gift. And them not to give me thanks for it. I want them to know the feeling of a gift that’s thankless. And that’s the true gift of giving. \nI give my gifts to my kids, not that they will thank me, or even thank Santa.\nI want my kids to feel loved, unconditionally.\nAnd that is why when I think about it, giving gifts from Santa is actually a little bit selfish of me. But I’ll be darned if my kids don’t wake up happy every Xmas knowing that they are loved, with no one to thank for it. Because thankless love is in itself beautiful.\nTLDR ; I don’t want a thank you from someone I give a gift too. The enjoyment they get from the gift is the true thankfulness. And I wouldn’t rob that from anyone",
            "I've never heard of anyone getting fucked up by the whole Santa thing. I've also never talked to anyone who's parents never did Santa with their kids, so I'd wonder if the kid would feel left out. But Santa is not the only childhood myth that goes around, there's also things like the tooth fairy and the sandman, I think reaching the age where your critical thinking skills are developed enough to question these myths are a part of coming to age. \n\nAs a side note, kids would probably love wrapping gifts. It's a shame that part is hidden from them.",
            "I don't understand why some people take such issue with it. My parents told me there was a Santa and I didn't grow up bitter about it. As a kid I didn't care either way if he was real or not, I just wanted presents. Plus going along with it was fun and just gave Christmas a fantasy element that made it feel more enjoyable.",
            "Tradition according to my family. \n\nI remember being told two things at a young age:\n\n- Magic isn't real.\n\n- Santa is magic.\n\n5 year old me figured it out, and was furious that I was lied to.",
            "My parents let Santa go on for waaaay too long and when I found out i was really upset. Looking back it was dumb to be upset but at the time my little 11 year old brain was like\n\n\n\"You lied to me why did you lie to me you're not supposed to lie to me don't lie to me\"\n\n\nSince then I much preferred understanding how much my family paid attention to what I like and what they could get me to express their love. I don't necessarily plan on having kids but if I end up having kids I'd prefer to skip the santa thing",
            "Because it is fun to believe in magic.",
            "If little kids knew that their parents bought them all these fantastic presents, they would bug them all the time to buy more.",
            "Moral thing. \n\nGrandma has to get you a gift and being nice to just her will potentially secure a better gift. Santa has no such obligation and judges your entire character - including those who are only assholes in private.",
            "It's not a binary thing, you should be doing both. \n\nWhimsical shit is a lot of fun to do with kids. It honestly is usually just as fun for you, because it viscerally reminds you of the enjoyment and awe you felt as a child (which is so understandably rare as an adult - we're all jaded, especially us redditors).",
            "Doing the Santa Claus thing when they are really small is like the one, single fun thing about the holidays. You will not want to deprive yourself of that.",
            "It teaches the kids that you can believe something with all your heart and still be wrong.",
            "Creative, out of norm thinking and belief has been shown to positively and significantly impact a child’s cognitive development amongst other benefits. But, given a parent and society doesn’t deprive them of all other fictional play and thoughts, I do think claiming this one in the name of teaching the gift of giving and sharing, is quite alright! (As long as the lesson doesn’t focus on materialistic value). So I certainly see your point OP! \n\nWhen it comes to why, it may have begun as a way to lift spirits, I’m not certain, but probably many can agree it was boosted for monetary reasons, as to why it continued after the initial push to make it a buying holiday I can only suspect it’s because it was also drilled into our heads by marketing that kids SHOULD believe. And now it probably just goes on because many have been conditioned to think this is the correct and healthy alternative.",
            "My father (Black) was extremely clear that a fat white man did not buy the gifts!",
            "I never told my kids there was a Santa and was always up front that I purchased the gifts, but other kids believed in Santa. I went further to explain that its one the worlds largest game of pretend and that we shouldn't ruin the game for other kids. My in laws hated that I \"ruined Christmas\", but the kids really didn't care at all.",
            "Are children not told both? You give and receive gifts from you’re loved ones and if you’re good Santa comes to give you a little bonus?\n\nThe world is so shitty, I think it’s ok to give kids a little magic to believe in. They don’t have to have a head start on becoming a jaded Reddit user like the rest of us.",
            "Because it’s magical and fun. That’s what childhood is about.",
            "Quick mention in the 2k comments: santa clause was largely built as part of a coca-cola marketing campaign in the 1910s and 20s. They pulled from other folklore. And built consumer santa we all know and love today.",
            "I think it's just to let their creativity roam free and take away from the \"responsibility\" and \"task-y\" aspect of Christmas",
            "Being atheist we still enjoy the bit of fantasy and excitement. The problem we have is “why do I tell my kids a lie about this but nothing else”. But then you see your daughters eyes light up thinking about Christmas morning. \n\nAs you age you get more joy from knowing you’ve given someone a gift. When you are little it’s exciting to think it’s magic. \n\nYes we celebrate Christmas but mostly as a “winter holiday”. No reason everyone else should have all the fun.",
            "Think Christmas is a time where you have the option to live in a more magical world (as a child) and it revolves around Santa.",
            "We do both. Most gifts come from family and friends. They're permitted to ask Santa for a few things, but there are restrictions (i.e. no live animals, no electronics).",
            "To me it's just magical.  It gives the whole season a special feeling, thinking that there's literal magic coming in a few weeks to make you happy with gifts that you'd want/like.  Then that turns into appreciation for your loved ones as you get older and realize it's not actual magic, just magic we give to others for a bit with gift giving.  We weren't rich, I was the youngest of 4, so my family rarely ever got more than a couple gifts per kid, but that never, ever turned into a \"why did your family get more than me\" thing, which seems to be the concern of many. I just thought it was cool either way.  There was just an understanding that Santa didn't/couldn't give you literally everything you want, just a small selection. I was more than okay with that.",
            "Santa is like other mythical creatures like fairies, unicorns, mermaids etc. We are not a religious household, so we dont really have a lot of 'magic' or 'mystery' in our day to day lives but having these magical beings allows for a huge amount of imaginative play and story telling. Plus in a country with little 'culture' (Australia) its nice to have something everyone comes together to enjoy. Santa is a massive cultural icon in the western world and IMO our world needs a bit of magic and pretend play. Santa makes me happy, he makes my kids happy and our house happy. The time will come when the kids figure out santa is make believe, probably when they figure out fairies and unicorns are not real, but the joy and laughter they do bring whilst the kiddies are little is priceless.",
            "Its about magic...at least it was for me. My grandma told me that Santa, the Tooth Fairy and all the rest are magical and I completely believed her. If anyone questioned Santa's abilities, I confidently answered \"magic\". It made my world feel really...i dk, happy. Magic was real, i may not be able to use it, but its there. I dont remember discovering Santa wasn't real, but i didn't feel betrayed or lied to, it just felt like a childhood fantasy I got too old for. I never forgot what believing felt like tho, and I can't wait to share that magic with my own kids someday. \n\nIs it so wrong to give them something to believe in?",
            "I think you can do both",
            "Christmas with Santa is so magical for little kids.  It's fun and harmless.\n\nI can't speak for everybody but I know plenty of people do what we do.  Santa gets the kids their main gifts.  Everything else (which is a ton in our case) is from family.  And my kids still shop for their siblings and parents.  They fight with each other like crazy 364 days a year, but they love putting thought into each others' presents.  Even when my oldest stopped believing, it's fun to watch her keep it up for the sake of her siblings.\n\nIn other words, you can keep the magic of Santa while still instilling a love of giving and togetherness.",
            "[deleted]",
            "My mother (who is a very outspoken Caribbean lady) never lied to me about Santa. For as long as I remember all my presents stated either “from mom” or “from dad”. When I asked her about it later she responded “Did Santa work 50+ hour weeks to pay for all these damn gifts for you?!? If not, why should he get all the credit?!?” Very straight forward approach, but I always appreciated the honesty. I tried not to ruin it for the other kids though.",
            "I think it mattered less when Christmas Presents where things that magically appeared in a stocking left by a fire & included small treats things like an orange, nuts & socks.  It was started in a time when kids were taught about God ie a magic man in the sky & Christmas celebrated like that all tied into Christianity more.  It was God that was all seeing & St Nick would reward you not Santa.   I mean if you believe a Magic sky man will take you to heaven, teaching your kids a magic sky man with reindeer will bring you toys isn't that much weirder.",
            "I understand your point to a degree but for me the Santa Clause thing was magical and those Christmases are pretty precious in my memory. I mean, you stop believing pretty young, I don’t think kids that age even have a genuine capacity to understand the value of a gift from a loved one the way you’re describing. They have the rest of their years to grasp that concept, though, and only a few to believe in magic. I stand with Santa.",
            "We start out teaching kids to believe the [little lies](https://www.goodreads.com/work/quotes/583655-hogfather)",
            "Wait, he isn't real?????",
            "I love the magic of Christmas, but I wish I had never went with Santa and that stupid elf.  One of mine is 14, so he helps with the elf now, but the younger one.  It's just exhausting.  I want to tell him, but hubs is on the fence.  Let them be children as long as they can.  blah blah blah.  I totally want credit.",
            "It was pretty annoying getting gifts, and wanting to say thanks for them, but hearing “we didn’t get you that, *santa* did.” Like ok, guess I’ll pray to santa?\n\nAlso having to sit on some random old guy’s lap for a family picture was creepy.",
            "I don’t get it either. I don’t do Santa with my kids.",
            "To hold over their heads occasionally to incite good behavior, duh. Christians have been doing that since the 1st century.",
            "Idk.. all I know was that young me thought Santa was a creep. A guy watching me all the time and then sneaking into my house? I was not buying this after all the stranger danger talks my parents had with me",
            "I mean... This is the only time in someone's life where you can help them imagine something amazing. It's a bad ass thing not to know fantasy doesn't exist and at some point... it's gone and all you have is logic and facts.",
            "All I'm saying is move the n Infront of the a you get Satan that's a little clear cut and disturbing enough to stay away from it.",
            "Tradition",
            "You will get it when you have kids, especially when they get to 2 or 3 years old, the whole spirit of christmas helps them with imagination and gives them a good feeling, its also good for the parents a lot of the time as its exciting to see them waiting and opening presents. Not everything in life needs to be logical or based on your own view of things. Its also a social thing that they are involved in with their peers. I know a few people whos parents didnt do the christmas thing as they were against the religious connection or whatever, but that was making it about them, not the kids. None of them are happier, besides santa started in modern turkey, greece and Romania areas, so thats as diverse as you can get",
            "My dad never let me believe in Santa because he was afraid I'd think he was lying about Jesus too. \n\nSo there I was, in grade school, desperately trying to tell my peers that Santa was just the devil trying to distract them from \"the true meaning of the season.\"\n\nSorry Dad, I'm agnostic.",
            "At this point, santa is how companies force all parents (poor or rich) to spend money for their children",
            "It's an intelligence test. See how long it takes them to figure it out.",
            "Because in the west we live in a predominantly judeo Christian anglosphere that historically recognised Saint Nicholas as part of the celebrations of the Christian holy day as interpreted by the biblical account of christ (as opposed to the other abrahamic religions).\n\nEver since the enlightenment and the subsequent \"death of god\" phenomenon, the festival of \"christ's mas\" has gradually faded to little more than lip service to the original cultural purpose. Meanwhile, the increasing collective shift away from theological idealism and towards a materialist rational empiricism, along with the widespread adoption of a heavily neo liberal capitalist zeitgeist underpinned by a post modern form of pseudo-religious worship in brands and consumerism;\n\nThe black booted, red and white suited, big bearded, white haired fat old caucasian man we know as Santa Clause is actually a seasonal brand copyrighted by CocaCola, and the festival as it stands has been co-opted as a mass marketing campaign for businesses to exploit.\n\nThis is generally maintained by furthering the collection of brand symbols, themes and logos as associated with the spectre of what was once a religious festival, channelled through the cultural fabric of yearly seasonal festivities and commodified as the metric shit heap of christmas specific tack and ciche merchandise that sits in an attic for 364 days a year.\n\nAlong with this is the consistent drive, in main part by the increasingly aggressive marketing, to buy as much as possible in some post modern expression of materialist worship, as we express what was once our genuine focus on interpersonal appreciation and common good will, by seeing how much stuff we can give to other people.\n\nThis cultural modus is kept alive like all other religious ideologies, through fable, and characters of fable. Well known to be most effective if indoctrination begins as young as possible.\n\nSo we tell children about santa claus. We do it because its what's done at this time of year in this part of the world. People do the things that other people do because we're social creatures, then through that, the vast corporate interests at the fulcrum of our materialist paradigm get to vicariously feed in to, and off of, our collective desire to fit in.",
            "Oh here comes the \"I hate Santa\" Reddit brigade.",
            "can confirm, it’s definitely much more wholesome and makes you more aware of the time and thoughts you need to give your family member. My parents never told me a thing about Santa, they just said it was a figure to represent presents. As a result, not only did i used to help them pick the gifts for my other family members, but also to wrap them and make little cards and notes for them. \n\nthe feeling of joy of seeing your cousins, grandparents and aunts enjoy the gifts you picked and decorated for them is indescribable. As a kid with no real saying in the world, it’s a sense of pride and happiness. Plus I also used to value more the time they took for me and my parents, instead of thinking: “Oh, a bearded man got into our house and altruistically left us something“\n\nBut i think this worked for us because in my family, we don’t sleep and open presents the next morning. We make a toast at 12, eat dinner at 1:00 am and stay until 3-4 am opening presents, so it would have been difficult to make me believe someone left it under the tree while we were eating lol",
            "I know that people r saying like its to make Santa the bad guy instead of the parent when u have to tell them they're being bad and won't get gifts but there must be a way to communicate to children why its not ok they're doing what they're doing in a way that makes sense. Or maybe not I dont have kids so I dont know but I have noticed kids prefer being spoken to like adults instead of idiots",
            "Ya know, I'm not sure. I do agree with giving to people in need/showing your appreciation for others but [overall](https://www.youtube.com/watch?v=Ucm8ptHVQ3w) Christmas is just a materialism party. \n\nWe spend our time a resources on all the wrong things and these decisions are leading our world to destruction.",
            "Because tradition is a vile sickness that has infested society for centuries or whatever",
            "I’m not sure what my parents’ intent was but the life lesson I took away from it was that even the people who are supposed to love you the most can lie to your face for years for their own enjoyment.\n\nI chose not to do that to my kids.",
            "I recommend that everyone here go and watch Sky1's \"Hogfather\".  It's on Netflix.\n\nIt's an adaptation of a novel from the late, great Sir Terry Pratchett that discusses tradition, belief, humanity, and all the \"little lies\" we train ourselves on in order to believe the big ones.  All done through the guise of inimitable, dry British humour.\n\nIf you want, you can just watch the numerous clips of the important bits on YouTube.  But once you do, you'll likely wish you had just watched the whole thing anyway.",
            "The latter is exactly what my parents taught my brother and I growing up (well, alongside a strong dose of \"Jesus is the reason for the season\" stuff).  I never felt like I missed out and honestly hold a bit of contempt for the idea of Santa since it enforces a \"good people get better things\" narrative that simply isn't true.",
            "Because it's not really about the joy of receiving a present on Christmas day, it's about the fear of not receiving one if you're poorly behaved the other 364 days of the year, and associating that fear with someone other than the parents. \"We won't buy you any presents if you're naughty\" provokes ill-feelings directed at the parents, \"the magical North Pole asshole who judges you with his God-like omniscience won't bring you presents\" redirects those ill-feelings at someone they can't do anything about.",
            "So we can blame someone else when we cant afford a gift.  Not everyone can  .....  never mind",
            "My kid was terrified of Santa. The thought of a strange man coming into his home in the middle of the night while everyone was sleeping was just too much; it didn't matter that he was bringing gifts, my son though he was creepy. Same with the Easter bunny. And we had to leave the tooth in the kitchen for the tooth fairy because he thought she was going to steal his toys. I lived with my parents for a few years and they were the ones that kept pushing the idea of Santa, etc. on him to 'keep the magic of Christmas'. I think he was 7 when I finally told him none of it existed and that the gifts were actually from me and my parents. He was so relieved. But then we had to have the whole 'other kids think he's real, so just play along at school' talk.",
            "I don't have kids yet, but I totally feel this. My question is, would this make you some kind of asshole if you just tell your kid the truth, and they tell all their friends at school, ruining it for everyone else?",
            "I may get downvotes for this...\n\nIt's because we love the lie.   Not saying this is bad; the stories are ingrained with us from youth, and we may have magical memories connected with them as we grow up.   When we're adults we see the stories reflected in society and culture.   Then when we're around kids, it's easy to perpetuate the myths.   We have learned to love the lie.",
            "Someone said once that they set out a smaller gift that's labeled \"from santa\" and then the rest of them are from the parents/whoever gave them.",
            "Mostly because of tradition.",
            "all my relatives were assholes, santa was a better reason to be good",
            "Of course we teach our kids to be \"grateful\" for every present they receive...but what if they don't like the present Santa gave them? And the kids voice their displeasure? The kid thinks \"Santa has unlimited resources unlike mom and dad, so the 'being grateful' rule does not count for gifts from Santa!'",
            "Does nobody remember Saint Nicholas?",
            "Cos children don’t give a shit about loved ones and gratitude. But a magic guy with a beard who comes from the North Pole and gives them presents every year is much more exiting",
            "the disappointment of learning santa isn’t real sets them up for adult life",
            "Santa has two beginnings: a retail juggernaut made up by companies wanting to sell cheap crap and a control mechanism to children.\n\nYou can see what happened to the former, as it turned to consumerism, but Santa's role today is geared toward 100% controlling of children's behavior.\n\nWorse, this message is repeated time and time again, especially in children's TV shows, that professionals state it's a form of child abuse. Worse when products also enforce this mechanism, such as the \"Elf on a Shelf\" \"toy\" which promotes 24 hour surveillance on children to behave.\n\nIt's disgusting parents continue to do this, but I fear it's due to the stupidity of how parents forget what it was like to be young and think it's \"cute\" to do it to their own children.\n\nI still remember the day my little sister was told Santa wasn't real and she was depressed for days after the news and I vowed I would never allow my kids to go through this shit.",
            "It's likely to increase sales come holiday time. Much easier to ask for it all if it's coming free from some fat stranger.",
            "I told my daughter the story of Saint Nick. We never admitted to a Santa clause. She knew where her presents came from and she grew up just fine. The truth is better than the deceit",
            "In my school it always led to amusing lunchroom situations where one Muslim or Jewish kid spills the beans and half the kids start crying until a teacher comes in and says the truth teller was lying and that Santa was real",
            "“Santa, the tooth fairy, the Easter bunny - yeah that’s all made up”\n\n“What about Jesus?”\n\n“........you wanna play Minecraft?”",
            "I decided not to do santa with my kids for two reasons. 1. Many who are poor might only get necessities as presents. So while other kids get new games and toys, they got clothes and toothpaste. Maybe one or two smaller things. It just makes some kids feel inferior\n\n2. I still remember when some kid told me santa wasn't real. It shatters a child's world and basically tells a child their parent was lying to them. It may be fun, but to me, it  just seems better to tell them the truth. Plus, then they can feel like they know a secret none of the other kids do.\n\nBut, traditions generally stay strong, and people associate their childhood with Santa and Christmas and want their kids to have the same experience.",
            "so the children can be conditioned to accept bigger lies in the future by the likes of politicians and other so called leaders..",
            "Tradition is weird and many times goes unquestioned.",
            "I dont care about santa because breaking and entering sounds weird",
            "as someone who grew up Jewish, I always knew Santa Claus didn't exist.  I just sort of always thought about it as an atomic bomb I could drop at any moment on those christian children, just by uttering those four words.  I never did though.  I'm not that cruel.",
            "Keep in mind that I do not agree with it, and if I have children I will not tell them Santa is real etc:\nI think it is for keeping magic and fantasy in the childrens mind a little longer.",
            "We tell our kids the truth from the get. It’s fun to imagine a jolly fellow came to give you presents, imagination isn’t just for little kids. So let’s bake cookies, read the night before Christmas, and get ready for Christmas morning. But make no mistake.. we purchased your presents.\n\n& No one is breaking into the house. Ever.",
            "Moychen-dising",
            "Disclaimer: none of this is intended to start discussion about religion, I'm just discussing what my parents told us and how they successfully approached us. It could be applied to anyone.\n\nMy parents are pretty open early on with us in life that Santa was a fun thing to pretend about Santa (partly because of our religious beliefs being the key part of the holiday) but also that it was much more important to learn about giving to others.\n\nI feel like all you need to do as a parent is emphasize early and often that even though it's okay to have fun with the Santa thing that is much more important to find joy in giving.\n\nI think what happened so many times is that parents get nervous about bringing something like that up because they don't want to steal the magic of Christmas from their kids. All the while they let culture get into their kids head that Christmas is all about what they get.\n\nLike my parents explained, and again it was pertinent to our religious beliefs, but they basically told us that Santa represented God wanting to bless us.\n\nAnd they would tell us that basically we can be Santa two people in need and learn to give during the holidays.\n\nIt's a nice way early on a sort of telling your kids that Santa is not necessarily real, but also emphasizing that what we should learn from Santa is that giving somebody a gift give them a lot of joy and so the Santa games should make us want to give to others.\n\nKids can have just as much fun if they feel like they get to be Santa to somebody else.",
            "This is the beauty about being a human that can make their own choices and decisions .",
            "I grew up Jewish, so no Santa. Our kid believes in Santa now, and he does second tier stuff. When she's old enough, I'm gonna tell her she gets to be Santa, and that Santa is all the goodness and generosity in the world personified.",
            "I have 2 kids, some presents are from Santa some are from me and mom. The big ones are from me and mom, the mittens, socks, small toys are from Santa. It’s for 2 reasons. One when he goes to school and some kids that may have gotten less than he did, it’s not bc Santa doesn’t like that person as much. It’s because, bringing me to my next point, it’s because mom and I work jobs to make money so we can buy toys. Trying to teach a little value of money while we’re at it.",
            "It IS a bit annoying to spend all that money, just to give the credit to some mythical fat dude. Kiddo all like \"woah, Santa got me a Playstation! That bum dad just got me clothes and shit...\"",
            "Santa is just a collective game we’ve played for centuries. I bet you don’t even know the rest reasons we put up Christmas trees or decorate them with ornaments. These rituals go back and disappear into time. There’s nothing wrong with telling kids their gifts come from Santa. And when there old enough to figure it out then you telll them about the Santa game and how they’ll get to play it with their kids some day .",
            "Its just a way to trick kids into behaving but by making a 3rd party to blame. If ur good Santa will give u a present but if ur bad youll get nothing! That way the kid wont bother mom and dad for a gift but someone else they dont see. Pretty clever but kids hardly ever listen so idk",
            "My SO and I could not bear the burden of lying consistently over a period of years so we didnt do it.  We still played along with the Santa *thing* but we just didnt go out of our way to make up a big story about it.",
            "It's just a nice little story. It's nice to have a bit of magic in your childhood.",
            "Yeah I’m gonna tell my kids all about Santa but they’re also gonna know what imagination and fairy tales are. Like someone else has mentioned in another comment, it was always a bit shit for me growing up if I wanted the new scooter or whatever it was that year and didn’t get it, but my friend did. Just made me feel like Santa was saying I’d been bad that year."
        ]
    },
    {
        "post_id": "taysid",
        "author": "Spare_Anybody3897",
        "title": "If gas got too high and electric cars are expensive what’s stopping me from using a horse and carriage?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/taysid/if_gas_got_too_high_and_electric_cars_are/",
        "score": 34793,
        "num_comments": 4703,
        "created_utc": 1646919337.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/taysid/if_gas_got_too_high_and_electric_cars_are/",
        "comments": [
            "Probably the cost of keeping and caring for a horse",
            "Horses aren't exactly cheap to feed and stable though unless you already live on a farm with appropriate facilities.",
            "How about a bicycle you call ‘horse’",
            "1) Speed and distance. A horse carrying the weight of the carriage, passengers and any luggage is not travelling very far, very quickly.\n\n2) The outright cost of a horse, carriage and stable is going to be as much as some cars. Upkeep, particularly vet bills, for the horse is going to dwarf the cost of gas. \n\nEDIT: 3) Maintenance. Caring for a horse properly involves hours of dedication every day. You can’t just park it in your driveway and forget about it until your next journey.",
            "Amish folks live it every day. They can accept rides but a fellow and his family I know use the horse and buggy most of the time.\n\nThis is Berks and Lancaster County in PA. There is no road they can't use. Stores like Wal-Mart have sheds for them to tie their horses and trash cans and shovels for horse shit.\n\nThey were against lights on their buggies due to not wanting to stick out but state gvnmt passed laws requiring them and recently they have come to embrace them.  You think it's scary in a car with all the idiots on the road the Amish in their small buggies have 18 wheelers flying by inches from them and their horses. \n\nEdit: Minimum speed limits are the exception to road use. Don't think that there are any 45 mph horses.",
            "The money and work it takes maintaining the horse alone probably doesn't outweigh how much faster and relatively more practical it is to just have a car.",
            "I am a horse owner, so let me give you a realistic idea of what it costs: \n\nHorse that is trained enough not to kill you: $5000-$50,000\nFeed per a month: $500+ depending on where you live, what dietary needs it has, increased water bill (and they drink a lot of water)\nBoarding: $300-$1000 a month. How are you going to get there? Now you're looking at a barn and acreage to keep it at home. $$$ Now you need a small tractor, dumpster for all the feed bags and manure, fencing (which will put you back $5000 alone for a 100' by 100' space)\nHay: $12-$15 a bale. 1 bale lasts about 2 days. \nFarrier: $70-$170 every six weeks. \nVet: hope it doesn't get sick or hurt. $100 minimum if you call out a vet.\nInsurance (yep.): $400 a year for basic. \nHarness:$1200\nCarriage: $10,000 (I've seen them for less.. rarely)\nDon't want to deal with hooking them up?:\nSaddle: $2000 that is good quality. \nHeadstall/bit: $100 or more\nNeeds a bit of refresh on its training: $900 per month (most places are a minimum of 30 days). \nEnjoyment you'll get out of having a horse: priceless. \n\nNot to get too deep here, but our costs are increasing too. Fuel goes up, hay prices go up. \n\nLong story short, buy the BMW. You'll save money.",
            "You’d have to look into the laws for the particular city you live in, but assuming it’s legal where you are and you have the space to keep a horse, there’s nothing stopping you.",
            "[removed]",
            "If you hate popping a tire on a pothole, just wait til you hit one on a horse and buggy. Now you've got a massive broken wagon wheel and a horse with a broken leg. Your mechanic shows up with a rifle and now you'll need a new engine.",
            "An electric bike is probably a better bet overall.",
            "Well. When oil/gas goes up. So does the cost of electricity. Therefore all modern modes of transportation are going up.\n\nFertilizer is going up. Seeds are going up. So even a horse and buggy will keep costing more.",
            "if you have a stable, and you're okay with the cleanup",
            "Horses are more expensive then a gallon of gas or an electric car. It costs a horse and buggy about 5 times more to travel a mile down the road then it does a car. Do you know how expensive horse vets, horse trainers, horse food and boarding a horse is? And you’ll need all those things to be able to continue to use a horse and buggy as transportation",
            "[deleted]",
            "You have no idea how expensive horses are, lmao",
            "Nothing.....go for it......",
            "If gas prices are hurting your wallet wait until you see how much a horse costs.",
            "Have people just not heard about bicycles",
            "Look at the Amish. Stick a \"show moving vehicle\" sign on the back, stay off the interstate, and you're legal. As others have said, horses are expensive, whether you use them or not.",
            "Go price hay.  That’s what’s stopping you.  Not to mention, the horse still eats whether you are riding it or not.  You also will not enjoy the aroma of your garage…lol",
            "That money you spend on gas? Quadruple it to pay for food, meds, horseshoes, and tack.",
            "[deleted]",
            "[deleted]",
            "If you want to deal with the maintenence, go ahead.",
            "Just get a bike. Less upkeep",
            "We got married in St. Augustine, Florida and went on a horse carriage ride. We were followed, recorded and harassed by PETA the whole time. They kept screaming that we were supporting horse abuse. 🐎 🐴 🎠 🏇",
            "Parking.",
            "Well for starters, you can’t park a horse over night on the side of a street.",
            "Horses probably cost more than a car, gas and maintenance in the long run. Vet fees, food, housing, medical expenses, training, equipment, a buggy like what the Amish ride cost as much as a car already, repair on that buggy, etc. \n\nAlso you can't just ride a horse on the road unless you local government allows it and that usually means horse and wagon, not horseback riding. Horseback riding is usually only legal on trails around cities and suburbs.",
            "Peta",
            "It being illegal on most roads to start.....You'd need to always have those poop hammocks because you can't leave shit anywhere. You'd need food for them constantly, as well as some way to hook them up so nobody steals them. There's a whole other list of issues with it as well, just got these off the top of my head",
            "I live in India and its fairly common to see. Like i would definitely see a horse carriage/ camel carriage couple times a week. That's also bcz in Hindu wedding horse is kind of a big deal . So nothing's stopping you but horses are probably expensive, live space to live which judging by someone can't afford gas won't be affording a proper living space for a horse along with good food.",
            "might as well get a bicycle, they eat less hay and don't shit as much.",
            "Legal? Probably nothing depending on local laws. Financial? It’s not going to be cheaper.",
            "Probably nothing but if you've got enough money to afford a horse and the care it requires, gas and electricity prices likely are no issue for you.",
            "Horses are expensive, so buy a bike instead",
            "A lot more expensive.",
            "Not much. The Amish around here do it all the time.\n\nHorses are ludicrously expensive to keep, however.  Not just in money, but in time & space as well.  They're not like your car that sits unused & untouched in the garage all week if you don't use it, and is ready to go at an instant's notice when you need it.\n\nYour carriage has to be very specifically made, also.  I don't know all the regulations but I'm sure they pertain to size, weight capacity, & markings.  Note that turn signals are optional.  Oh, and the whole arrangement doesn't work very well at night.  It's not like you can just mount a floodlight on top.  The horse is going to have its own ideas.  Or it'll just stumble & break a leg.\n\nLastly... where are you going to park the thing when you get where you're going?",
            "Just use bike, electric bike or scooter? Costs less to purchase and maintain and electricity charging prices are close to nothing.",
            "The cost of a horse, and taking care of it",
            "Dysentery.",
            "You must be Amish to unlock this vehicle.",
            "Minimum speed limits on interstates and highways",
            "Go live near Amish and menonite territory. It's not out the ordinary",
            "Assuming you got space for both and can care for a horse...nothing",
            "Amish have done it for years, they don’t suffer when we have power outages either. But please take very good care of your horse.",
            "Horses are expensive to buy and maintain",
            "Dear horse owner,\n\nWe have been trying to reach you in regards to your horse insurance.",
            "Bro just buy a bike",
            "A year ago round bales were $40. My herd of 7 goes through a bale every 6 days. \n\n\nThis year they are $120. \n\n\nSo... I gave 7 horses in a 15acre field. This is my monthly horse budget right now(4 of them are not paid for by me fyi. So my personal contribution is about 1/3) \n\n\n\nFor reference: \n\n2 thoroughbreds in competition work \n\n3 large ponies (fat on air)\n\n1 rehabbing tb not being ridden \n\n1 31yo Morgan in retirement. \n\n\nHay: $600\n\nGrain and supplements( this also includes some hoof and skin topicals) : $700\n\nFarrier: 470\n\nVet (harder to calculate, but typically it evens out to around $200 a month) \n\n\nSo close to $2k a month rn. \n\nNow adjust it a bit because they stop eating hay from late April->November here, and I can cut back quite a bit on grain in the summer. The grass is really nice where I live. So 2k for 5 months. And 1200 for 7. \n\n\n\nNow the more you work and ride any one of the horses the more you then need to add custom fitted tack so they don't get hurt (think of it as tennis shoes that fit for a runner). And more vet work. Joint injections, adequan, glucosamine, bodywork (massage and like PT for horses), etc. \n\n\nAlso:\n\nMortgage on 20acre farm commuting 1hr drive to work because thats the closest we could find an affordable farm \nSo commuter car, annnnd,\n\nDiesel truck \n\nHorse trailer\n\nTractor plus mower attachment for big field\n\nLime treatments for field every other year\n\nI do it cheaper than most people I know and all of my horses look fabulous 100% of the time. I'm very proud of the life I give them. But believe me... cars are cheaper.",
            "Ignoring the huge cost, time commitment, and responsibility of owning a horse, If your lifestyle is such that riding a horse anywhere you need to go appears to be practical replacement for a car, I think what you’re looking for is a bicycle.",
            "The cost of taking care of a horse, the space needed to properly care for a horse, the base cost of the actual horse, cost of a carriage, maintaining the horse and carriage",
            "The more viable question is: What‘s stopping you from using a bike? And the answer would be: because streets and cities were built for cars exclusively!",
            "Nothing, other than the expenses required to maintain a horse and carriage. There's no laws against it.",
            "I mean, Amish guys got this shit figured out pretty well.",
            "I saw a wood burning steam bike on youtube today thatI think is a realistic option",
            "You don’t own a horse and carriage would be my first guess.",
            "Nothing.. but maybe go for a bike?",
            "Horses aren't cheap"
        ]
    },
    {
        "post_id": "i912jf",
        "author": "Schmickschmutt",
        "title": "Why do people always ask where we go after death but no one ever asks where we were before we were born and had a conciousness?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/i912jf/why_do_people_always_ask_where_we_go_after_death/",
        "score": 34577,
        "num_comments": 2091,
        "created_utc": 1597329568.0,
        "selftext": "Isn't the answer to the afterlife literally the same as the \"beforelife\"?\n\n\nWhy would it be different?",
        "permalink": "/r/NoStupidQuestions/comments/i912jf/why_do_people_always_ask_where_we_go_after_death/",
        "comments": [
            "It’s easier to accept that we can be created but much harder to accept that one day we won’t exist.",
            "Not an answer per se, but in (some) Jewish tradition pre-born souls, having grown on the Tree of Life, wait in the Guf for their time to be born.   \nAnd, of course, people who believe in reincarnation don't really have a before or after, they have betweens.",
            "Well I've already been born but last time I checked I hadn't died yet",
            "because death is more of a concern than the other",
            "[deleted]",
            "Yes, I believe it is. I had this revelation too and it totally killed my death anxiety. It used to worry me sick, but imagining the time before you were born is not as scary as imagining what happens when you die. I came from it, so I know I'll be safe when I return. I did not have a care or worry before I was born, so I won't have a care or worry after I die.",
            "Imagine if someone told you that at age 1 they burned your arm with a hot poker.  You might be upset, but ultimately this needn't concern you anymore, it's in the past.  Now what if they told you they are about to burn you with a hot poker tomorrow.  I'd be very concerned, that sounds painful.  Current me has to worry about future me's problems and gets to ignore past me's, as long as they can be left in the past.",
            "Alan Watts had a lot to say about this. He reckoned it was the same place. And knowing that frees you from the fear of death that humans cling to so much.",
            "This is a question attempting to logically extrapolate a human concern that was built on emotion.\n\nThe emotion is fear and the driver is death. Death, of course, is a natural fear to any living being. Evolution clearly believes that this is a worthy trait for genetic propagation. \n\nThere is no fear driving the question of what happens before we are alive, so humans see it as a question of far less importance. Furthermore, with less emotional stakes involved, there is less drive to distort the answer.\n\nI'm willing to bet that a higher percent of people are willing to give a scientific answer to \"what happens before you're born\" vs \"what happens after you die\".\n\nOf course, the answer to the former is:\n\n\"The delicate balance of systems necessary to generate your specific consciousness have yet to be created, and so you don't exist.\"\n\nAnd the answer to the later is:\n\n\"The delicate balance of systems necessary to generate your specific consciousness have broken down to the point where 'you' are unable to be restored, and so you no longer exist.\"",
            "I told this to a 10 year old just a couple days ago. Hr was asking about something that happen in early 2000s and I said \"you weren't here yet so you wont remember it.\" He then said \"where was i.\" I quickly thought holy shi I never really thought about that and looked at him and replied \"dead I guess.\" The look of horror on his face. Hahah",
            "\"Picture a wave. In the ocean. You can see it, measure it, its height, the way the sunlight refracts when it passes through. And it's there. And you can see it, you know what it is. It's a wave.\n\nAnd then it crashes in the shore and it's gone. But the water is still there. The wave was just a different way for the water to be, for a little while. You know it's one conception of death for Buddhists: the wave returns to the ocean, where it came from and where it's supposed to be.\"  \n\n\n\\-Chidi from The Good Place talking about a Buddhist view on mortality",
            "I for one believe the afterlife is exactly the same as before life. IMO for  something to transcend time it would have to do it for all time, past and present. You are either eternal or you are not. Being born into existence and then living forever seems weird to me.",
            "[deleted]",
            "because we are not time travellers. It's more logical to think about what may happen to you rather then think about what happened before you existed.",
            "This question has baffled me for a while now. Without wondering what's before or after (our personal experience, if we could be there to witness it), I'm interested in the thing from another point of view - how is life created? Cells grow exponentially and the physical aspect of creatures growing is obvious, but what exactly brings the life into the chunks of meat that we animals are?\n\nDeath is a lot easier to grasp. There is life, which then ceases to exist, nothing is forever, yada yada. But new life? Like I said, the physical aspect is easy, we transform and utilize various resources (such as energy) to create the shell, but where does the consciousness come from?\n\nIt sure is possible that our consciousness is literally just a fine tuned mixture of electricity and genetic programming (which is supported by the theories that there's no free will, all our impulses etc are hard coded into our dna). Who knows, maybe we really are just biological computers and creating life is just putting some electricity into that computer to get the 1s and 0s flowing. So, maybe life never really comes from anywhere special, nor does it go anywhere special. It would just be another manifestation of physics.",
            "Dads balls",
            "You have no memory of existing before you were born, nothing to form an attachment to, nothing to miss. If there are theological arguments for existing before you were born, they don't really matter to people because we can't relate to that stuff. You have no drive to believe in life before conception. \n\nBut after existing for 70 or 80 years, after acquiring all sorts of experience and memories and connections that you desperately don't want to lose, the thought of having to lose it all forever and go back to not existing is just too hard to bear. So there's a strong drive to believe in a life after death that somehow preserves all the good things about living and removes all the bad things about living. And, of course, there's a strong drive to believe in a life after death that punishes those who deserve punishment and rewards those who deserve reward.\n\n*That's* why people always ask where we go after death but no one\\* ever asks where we were before we were born and had a consciousness.\n\n\\* It's not strictly *no one.* There are people who believe in existence before conception. But, yeah, most people I know never give a thought to the possibility of life before conception.",
            "I've seen this question quite a bit actually. It's just not a topic of existential dread because it already happened and is behind us. \n\nAnswers to the question vary. Reincarnation is the most popular one. Some religions, like Mormonism, have a whole mythology around this question. Some people believe you're created on the spot at conception, which leads to some problematic issues like how are genetic defects corrected in heaven, etc.",
            "for me, its because the time before birth was finite, but the time after death will be infinite. \n\nthere’s a fantastic video on youtube that touches on this subject. its called “optimistic nihilism” by the channel Kurzgesagt. Everyone should go watch that video. (Honestly if you havent watched any Kurzgesagt videos, you’re missing out)\n\nEdit: correction, the time before birth (probably) wasn’t finite. but it had an end, meanwhile time after death doesn’t have an end.",
            "Maybe the light we see when we die is actually us being born",
            "Careful, you might summon a Mormon missionary.",
            "Plenty of people and Eastern philosophy has a lot of literature on this",
            "Catholic theology is the foundation for most of western norms, and the teaching of the Church is that life begins at conception. In addition, the separation of body and spirit is seen as a undesirable state, so pre-birth souls would be a form of unjustified punishment",
            "[deleted]",
            "I think in the Bible God said that He knew us before we were in the womb.",
            "My religion believes in a pre existence where we lived with God before we were born",
            "The main thing here is questioning consciousness and what it is, with many speculating toward a definition but the fact is we simply do not know concretely.\n\nQuestioning death vs pre-life is a result of trying to predict the inevitable future. Most people don’t question where their consciousness was because they are already alive, here, in the present. Death is in the future and ticking ever so closely.\n\nIt’s like wanting to know about a past meteorite that wiped out several species vs the one that will wipe us out next week. The latter is a bit more important.",
            "I used to be afraid of death until I realised that we were all basically the equivalent of dead for the infinity of time before being born. I guess people are just afraid of letting go of this short space of time we're given.",
            "Because the asker is only ever approaching one of those two \"places\". They're more worried about where they're going, not where they've been. Unless the asker is Benjamin Button I guess then idk man",
            "We humans can't comprehend what was before because our knowledge started by us learning cause and effect. I sometimes think about maybe the Universe has always existed, it was never created because it was always there but us as humans can't wrap our head around that, that is why the BigBang is still a theory.",
            "Plato thought that every soul existed already and we simply kept falling to the earth as an imperfect form, until one day, as we grew wise and virtuous, we could enter back to the universal form of the soul.\n\n(I don't really remember it very well, so anyone here is free to call me an idiot if they wish)",
            "These two things are the same to me. That's pretty much how I cope with my mortality. I'm not scared of death at all. Death is just not being alive and I've been not alive before. And it was bliss. Eternally. Death isn't the weird or scary part. This little burst of energy and experiences we call life... To me that's the scary part.",
            "Meh my parents (Muslim) just told me I was in heaven before I was born when I asked them. Didn’t buy it. Ugh it’s all so weird. It never clicked for me. None of it. \n\nSo now I’m atheist and I don’t worry about afterlife :) I live my life and don’t treat it like something I have to complete to achieve the reward of heaven.",
            "When my son was about 2-3 yrs old he told me me about his family “before us” there was a fire in a store when he died. Then he was in a room and chose my husband and I to be his new mom and dad. He always repeated the same story until he pretty much forgot about it by 4. Made me think about the before life.",
            "I try to find justification in my seizures. Just hear me out. \n\nDuring a seizure there is an absence of everything. You dont know you exist, you dont know there is life. You dont know you have ever loved or where rich or poor or if you did good deeds or if you had problems with your neighbor. You know nothing. There is straight pure NOTHING. Then you \" wake up\". The coming too moment when you wake up and your conciousness comes to and you start remembering. \n\nBefore birth we were nothing. We were in the nothing stage of a seizure.  Not even thought of. Once created and born, we observed with our baby eyes and our brains the world around us. We live our life. Then we are no more. We go back to our nothingness.\n\nThen again who knows for sure what really happens.",
            "Many religions subscribe to the premise of reincarnation in the sense that life is ever continuing in an ongoing cycle.  \n\nBut I am intrigued by a quote by Vladimir Nabokov:\n\"The cradle rocks above an abyss, and common sense tells us that our existence is but a brief crack of light between two eternities of darkness\". \n\nIts a very nihilistic approach to life, but it seems to make sense to me.",
            "'cause \"In my dads balls\", doesn't sound flattering or magical",
            "People ask both things, but that doesn't mean they necessarily go about it with the right understanding of what they're asking about.\n\nThere are a bunch of interrelated topics you could check out:\n\nhttps://plato.stanford.edu/entries/afterlife/\n\nhttps://plato.stanford.edu/entries/death/\n\nhttps://plato.stanford.edu/entries/death-definition/\n\nhttps://plato.stanford.edu/entries/life/",
            "But you don’t remember being one, or two, or much of anything before you maybe started school either. I don’t remember being born. I will be conscious and aware as I die. That’s why it’s much scarier. You imperceptibly fade into life and you abruptly cut out of it.",
            "There are plenty of people out there interested in past lives and such. I know a guy who did a \"past life regression\" sort of thing where they put you under hypnosis and use leading questions to try to get you to remember previous lives.\n\nThose sorts of belief systems aren't common, and are often trampled on by Christian religions, so you don't hear about them often.",
            "I mean, all coincious life could be the result of a single extradimensional supercoinciousness. Read The Egg by Andy Weir, it's super interessting. It's also been adapted into multiple different short films, which Are also great.\nIt's not a theory as much as it is a fictious pondering on our existance and the meaning of life.",
            "If you want to get the feeling of pure death and chaos, think about this: Someday the universe is gonna end, and everything that exists will end. What will happen to us then? It is really terrific thinking about it.",
            "I've always had a guess that what we do now or are interested in doing as work/ hobby/ talents are things that we enjoyed in our past life, that can somewhat define us as we are today. \nPerhaps that could be why there are child prodigies in music etc.\nI've brought this similar idea up to people in years past and they've said things like when youre born you cry to forget the past life you had.",
            "Try to remember before you were born. That's what's it's gonna be like when you die. Back to the nothingness we came from. FeelsBadMan",
            "Ashes to ashes. Dust to dust. \n\nOur consciousness is nothing more than neurons communicating with each other via electrical impulses. If that stops, it’s over. Simple.",
            "Reincarnation babey",
            "this is why i like the idea of reincarnation, it explains both",
            "I like how philosophical this thread has gotten",
            "I have no idea and as with most people, the thought of not existing, having a consciousness is terrifying. \n\nAs such, I respectfully will retreat from this subreddit before I fall into that dark rabbit hole. \n\nI do however, wish everyone a peaceful and fulfilling life.",
            "Nor question why we are where we are right now and why we are all here but not here together ?",
            "“I had been dead for billions and billions of years before I was born, and had not suffered the slightest inconvenience from it.”\n-Twain",
            "Check out the pod cast mysterious universe. They talk about this exact question in a few episodes.",
            "Pretty sure we talked about this in philosophy at university. My take on it was, you didn’t exist before you were born...so why would you think about it. But right now we do exist and so death is far far scarier. The class then went off on some tangent about ..do we really exist..and I questioned why I was doing a philosophy degree.",
            "Because people are scared of death. They're scared of the ending of their lives.\n\nThey're not scared of 'before their lives'.\n\nThis is pretty much the basis of all religion. You won't die, you will live on. Believe in what I preach and you will live beyond the grave",
            "Probably a Chinese peasant girl in 540 AD",
            "Well half of us was in our dad's reproductive system and the other in our mom's. And when you think about it ,the cells we were made off were made off our grandparent's and great grand parents and so on. We've been in a lot of places.",
            "I remember Christopher Hitchens said something like “I dont worry about dying, because when Im dead I wont know it, just like I never knew I wasn’t born”",
            "This is like asking: where was the fire before you struck the match? And where does the fire go, once it burns out?\nHuman consciousness is like that fire: it is an energy that is generated and exists, until it ceases to exist.",
            "Because if you knew anything about philosophy and basic principles of nature, you'd be aware of Parmenides' words: \"whatever is is, and what is not cannot be\".\n\nThis means that before being an embryo in your mother's womb, you weren't. You can think of a part of you as being your dad's semen but that would be a stretch, because it wasn't *you*. Thus, you weren't anywhere because, in fact, you weren't at all. It would be then dumb asking were would a unicorn with wings be, because it doesn't exist, so there's nowhere it can be. \n\nWhen you die, instead, you are something that begins to not be anymore, at least as long as our minds can perceive. And this is totally different and brings our minds to ask ourselves where we go when we die  – and for me, we don't really go anywhere. This is my own speculation though.",
            "Imo it’s completely illogical to ask what you were doing before you were born. We have a clear understanding of how humans are created. This isn’t Scientology where souls are waiting to find a human body. In fact it would be nice if religions would stop making baseless claims about afterlives and reincarnation. They’ve muddied the waters so much it’s near impossible to talk about these things logically.",
            "Because way too many people refuse to believe that nothing happens after we die just like nothing happened before we were born. We simply didn't exist at either extreme. I guess that scares people for some reason so they created religion and shit",
            "Probably they are the same place, but death sounds more interesting than the \"void\" or \"the nothing\"",
            "Wouldn't they be roughly the same place?",
            "Nobody wants to admit they are one in the same.",
            "Because \"The Hoober-Bloob Highway\" already answered that",
            "The difference for me is that the \"beforelife\" only makes sense in the context that it ended. From my perspective, it seems like an instant and then poof, I'm here. Same reason I don't fear being knocked unconscious. It seems like a tiny blip and then I'm back again. But I have no context for what it's like when there is no \"back again\" and that's the part that scares me.",
            "Nobody knows one way or the other. It shouldn’t matter to how you live your life and interact with others.",
            "Reminds me of a quote I heard regarding the afterlife once:\n\n\"One should not be concerned with death. When we are here, death is not. When death is here, we are not. The only thing that man should fear is *dying* itself, for one may not know the means by which this will occur. However, the state of oneself after death should be no more concern to you than thinking about what your day will be like on the following day before you fall asleep.\"\n\nOr something like that.",
            "I guess it doesnt really matter what was before, but after we're born and have been alive the idea of not existing is concerning for people.",
            "You were a machine for making noise and shitting yourself when you started life.\n\nWho cares where you came from?",
            "To be fair, some do ask such a question. Those that believe in reincarnation or past lives, for example. Much like an afterlife, there's no evidence for any of this either, but that doesn't stop people for believing. \n\nPersonally, even if it was true it serves absolutely NO purpose in my mind. After all, if you have no memory of your past lives, then it does you no good in any real sense. It provides no comfort, it provides no mechanism to learn from your past lives mistakes, nor any hope for your future.",
            "Hint: it's the same place",
            "Nobody cares what the weather was like 8 years ago but we all care what the weather is going to be like tomorrow.",
            "Because it’s one in the same.",
            "\"They're the same picture.\"",
            "As a member of the church of Jesus Christ of Latter-Day saints (mormon) we believe before earth we had a premortal life where we all existed with God, our Heavenly Father. It was in this period of time where we all chose to come to earth, gain a body, and experience the pains of mortality and the accelerated growth and maturity that it offers. We believe that during the Premortal life that we could make choices but had very limited progression due to our Inexperience.",
            "Is anyone else scared of dying in a \"bad way\"? like getting shot in the head so that your consciousness gets destroyed and fragmented so that it echoes into eternity with eternal pain? Like I am not scared of death by lack of oxygen to the brain cells and eventual loss of consiousness, A similair loss of consciousness has happened to most of us a lot of times; I conclude it would just be the same as previously experienced but permanent. But in contrast; actual physical damage to the brain, it scares me a lot, will it cause pain and destruction of my conscious that will last forever? 😵😭😥",
            "Same place I believe strongly in reincarnation",
            "Good question!  I have actually thought of it and it makes me think of that robin willimas movie ‘what dreams may come’.",
            "I believe that when we die, we awaken with a whole new consciousness. Not necessarily in a reincarnation sense, but just a completely new consciousness with a whole new set of circumstances. So right now we are living the prebirth of our next iteration.",
            "Interestingly, there are plenty of people who have considered this. Ask a Mormon some time, they have *really* considered this. Not saying it makes sense, but they did.",
            "I remembered that my father would always say that before I was born I was living in the tip of a grass.",
            "I think it’s because it’s harder to think about what was before than what comes after life",
            "Right now we’re in the during times. Before COVID was before times. I’m waiting for the after times.",
            "Reincarnation is based on before and after life though. \n\nBut I get what you’re saying. \n\nI think its because birth isn’t something we can comprehend experiencing again...it just sort of doesn’t make much sense. \n\nWhile death on the other hand is something we know we will experience once, and no has ever been back from it. (Unless you count the reincarnation thing.)\n\nSo it’s something we know is coming so obviously we are more curious about it. \n\nAlso it’s scary.",
            "Because people think our actions affect where we go in the afterlife. The beforelife must then be something different because there was no sorting mechanism. Maybe it would have been like limbo or something. \n\nNot what I believe, just another perspective I imagined.",
            "Holy shit I was just thinking about this today for the first time (like it’s not something I always think about) and of course I see it here. Must be the Baader-Meinhof phenomenon",
            "I don't know ... it blows my mind though that there are a finite number of atoms in the universe and I think we are all just different atoms making up different objects at different times, so that's kind of my answer but I'm no scientist",
            "You're not the only one",
            "It is the same. When people talk about an afterlife they really mean \"why can't I live longer?\" It's a step towards accepting that their consciousness will be gone but not really. When you ask what happens before then people are already thinking \"nothing\" but they don't want to because that is truly accepting the idea of having no consciousness.",
            "I've always questioned both. That's the reason i don't believe in the after life if there's no before life why would there be an after life?",
            "It's because we already went through it, so it's basically unimportant. After death on the other hand... we know nothing about and it'll inevitable happen to us sooner or later.",
            "Despite the fact that we don't understand nothingness, thinking about before life is a blunt reminder that it exists, and makes it seem more probable that there's nothing after life. Hovewer, is best to have hope and try to ignore the proof that indicates emptiness, since trying to understand it is absolutely impossible and will only make you feel awful and completly unable to live your life, like a horrible lovecraftian horror. Now if you'll excuse me, I'll go back to the terrible thoughts spirals that have kept me awake until 3 am for the last few days.\nHave a nice day! :D",
            "Because most people don't give a shit about philosophical questions unless they can 'answer' them in a way that makes them feel better about themselves.",
            "Actually, in my church—the church of Jesus Christ of Latter-Day Saints—we believe in a pre-mortal existence. That’s the short answer, but if you want a more detailed explanation, I’ll happily give one.",
            "Whoa.",
            "Correct me if I’m wrong, but past lives are talked about frequently",
            "I believe it's a simple answer. How about a fathers' balls? :)",
            "Because no one wants to admit they were lounging in their dad's nutsack.",
            "My mom and dad had sexual intercourse, this fertilizing an egg which eventually turned into a fetus. Before I was born I was nothing",
            "Because whatever it was, been there, done that.",
            "The soul gets created when the man busts his nut and god waves his magic wand.",
            "It’s the same place. I think you know that. Everyone knows that deep inside.",
            "Because its easier to believe we can't stop existing, than it is we never existed at all.",
            "Well thanks. I hadn't been broken yet today. Was getting worried.",
            "Because it's not about where you've been, it's about where you're going",
            "It's weird. If given the choice, I would be more afraid to be born than to die.",
            "Muslims believe that prior to being born in this world, all human beings were formerly born in a different world. The state of human beings at the time of that initial birth is referred to as “Aalam-e-Arwah. The actual definition of Aalam-e-Arwah is the time (also called “Ahad Alast” by the Quran) spent by humans in another world before coming down to this earth.\n\nWhen humans come down to this earth, they are born with a body and their nafs which is called soul. When humans die and leave this world, their physical body stays here in the soil and soul is taken out. This is also a kind of Aalam-e-Arwah but Quran generally uses a different term for that stay of soul and calls it “Barzakh” meaning it is a time when there is no “body” but just the “soul”.",
            "It’s just chemicals, hormones, and electrical pulses bro\n\nNothing exists prior or after accept the depression of it all",
            "Well our brains only start to work during pregnancy so that when we are born, before there is no real question where we was since we didn't exist in any way, and we can define ourselves because our brains works, from scientific point of view we have answer to that question, only if you want to argue that there is something before we are born it's mostly assumptions and for most people it doesn't matter but our Afterlife is far more important for people, that's why no one asks",
            "I have always said that when we die we go wherever we were before we were born",
            "Whenever something bad happens to me, I regularly say something like, \"This is probably because I was a jerk in a past life.\"\n\nPretty sure moments like that are us contemplating our \"before life.\"",
            "This question is actually one of the most important questions we talk about in the religion I belong to. I'm constantly amazed at how many religious individuals believe in life after death but not life before birth.",
            "Because it removes religion from reality.  If you go back to the same place as you started from then what is the point of religion at all?",
            "Because I know where I was, I was in my dads nutsack. And before that I was probably a pile of mashed potatoes or glass of orange juice that he drank.",
            "Our souls are born in the womb.",
            "In certain cultures like Buddhism and Hinduism probably, there's the concept of reincarnation and the cycle of births, or being reincarnated until salvation (moksha) is achieved. I haven't read what determines the circumstances into which we're reborn but it has some connotation to cumulative karma.",
            "Because it's equally stupid. You never existed before being conceived and you will cease to exist after dying. People have to stop seeing that as something sad, like a childish point of view of death, you were nothing before, now you exist, then it ends and all the parts of you vanish into the universe.\nLike dust in the wind, ashes on the ground, rotten fertilizer into the earth.",
            "No one? We must have never met. Thats all that matters to me bro. If we can figure that out we might know where we are heading next",
            "To me they're one in the same and is my answer when someone asks me what I think happens when we go.\n\nThere was nothing before your life and there will be nothing after. That's why life is so important. Because it's here for a flash and then it's gone in the greater scope of things. \n\nThe seconds and minutes feel insignificant during the journey, but at the end of the road you'll be looking back at every moment. Cherishing the seconds you have left and rejoicing in ones you've spent. Don't waste them. Don't regret them.",
            "Why is OP presenting a question literally every child ask their parents as a question \"no-one ever asks?\""
        ]
    },
    {
        "post_id": "o42k1d",
        "author": "None",
        "title": "Why don’t we federally tie the minimum wage to inflation? That way, the labor force won’t have to worry as much about being to underpaid to afford to live going forward.",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/o42k1d/why_dont_we_federally_tie_the_minimum_wage_to/",
        "score": 34439,
        "num_comments": 2913,
        "created_utc": 1624184105.0,
        "selftext": "Edit:  im toast.  Reddit never disappoints me. I’ve learned a lot from you all today and I’m sorry, but I just can’t keep up.",
        "permalink": "/r/NoStupidQuestions/comments/o42k1d/why_dont_we_federally_tie_the_minimum_wage_to/",
        "comments": [
            "That’s what many countries do. It’s called wage indexation.",
            "Technically, it should be tied to COLA (Cost of Living Adjustment).  But to answer the question, yes it should be adjusted each year.  The political influence of those to want to keep salaries low is what is preventing that.",
            "The problem is that the cost of living is vastly different depending on where you live. \n\nIf we take the US, [look at housing costs by state](https://www.experian.com/blogs/ask-experian/research/median-rental-rates-for-an-apartment-by-state/). \n\nThere’s a wide range. \n\nThat’s the main issue with a FEDERAL minimum wage. It might be sensible for some areas, but not others. Even if you divide it by state, there’s still a wide variety. Miami is far more expensive than, say, the panhandle of Florida.",
            "Because inflation in general isn't very useful in this context. Geographically, cost of living varies wildly, and doesn't increase uniformly. \n\nIt would probably be better than nothing in general, but you'd easily have areas in which cost of living doesn't increase at the same rate of inflation, so the minimum wage increase would eventually price out small businesses, and you'd have areas where the cost of living increases much faster than inflation, so the minimum wage increase still wouldn't alleviate any problems there.",
            "Because big corporations and rich people have too much political power in the US, and it benefits them to not do this since they want to be able to pay their workers as little as possible and increase profit.",
            "Because they have let it go for so long that the jump would be too large for businesses.\n\nThey have talked about it but just getting it to a liveable wage right now isn't even passing. There's no way corporations would ever let that pass. They would never have the power to change it after a logical solution made it fair to the workers.",
            "$3.35 minimum wage in 1987 i!s worth $7.94 today.\n\nMinimum wage in my state is $9.00\n\nFederal is $7.25\n\nI believe 30 states have minimum above federal rates.  \n\nAs each state has differing costs of living, unemployment, and inflation, a one size fits all solution is hard to gage.\n\nI agree a solution is needed.",
            "Because that would require logic, and we don't do that here.",
            "Inflation is a very coarse measurement of people's financial needs. Just because inflation goes up doesn't necessarily mean everyone's purchasing power goes down by the same amount.",
            "The Republicans don’t want it because they don’t want minimum wage to go up, and the Democrats don’t want it because they lose the issue and can’t run on it anymore. \n\nThere are exceptions in each party, of course. But the sad truth is that minimum wage earners vote in very low numbers. A group that votes in high numbers, like Social Security recipients, get the automatic adjustments because the process of raising it becomes a political minefield.",
            "Because you don’t control your government, rich people do.",
            "Wouldn’t it be $33 an hour?",
            "I think the one major problem we would run into is businesses being able to catch up with it. I’m in the Seattle area where our minimum wage was about $9.25 (give or take) and SeaTac and Seattle voted to make their minimum wage $15. Within a few months some businesses had to close because they couldn’t keep up or work out the new minimum wage with their profit margin. \n\nI’m all for increasing but I think doing it slowly instead of all at once would be a better way to go. Work out a schedule to increase it yearly and allow businesses to adjust and make the appropriate moves to maintain that pay grade. Helps keep businesses open and people employed.",
            "Because raising the minimum wage is popular. If I were a political party, why would I solve this problem once instead of getting the flood of support whenever I want to raise the minimum wage again in the future?",
            "Take it a step further than that: tie politician salaries to minimum wage at some fixed multiple. Then ask if they'd like to tie minimum wage to inflation.",
            "Some economies do this actually, however most markets are self regulate and adjust relatively quickly when inflation happens in other places or along the supply chain. Employers usually don't adjust wages to the inflation because the market usually shifts back to equilibrium pretty often in most cases. Shifting wages because of inflation would only really be saving pennies or can be accrued in an end of a year bonus or commission of some sorts. The only positions I might consider to be adjusted to inflation would be public or federal employees since those jobs typically adjust/react fairly slowly to changes in the market economy.",
            "Cuz the US and many people in it hate poor people and want them to stay poor. Hell, some of them ARE the poor people themselves.",
            "A radical idea: Abolish the federal minimum wage, as cost of living is drastically different depending on where you live. And instead you incentive strong unions and let the unions and employers negotiate the minimum wage for each branch/company. \n\nIt works quite well here in Sweden, for example a newly employed worker at McDonald's makes a minimum of $15/h between 0600-2000 weekdays and another $2,50/h after that or during weekends. A Big Mac costs roughly $4 at the moment. And for my two bedroom apartment in a medium city cost me $813 monthly including utilities, internet and parking.\n\nThis is because McDonald's is negotiating salary against the union for all restaurant and hotell workers and need to meat their minimum wage.",
            "Well there are rational arguments against this. Raising the minimum wage does put tremendous pressure on companies to raise prices. Take for example a company currently paying $7.50 for 500 employees. If each employee works 36 hours a week that would cost the company $135,000 a week or about $7 million a year. However if this wage was say $15 an hour the company would have to pay double that at 14 million. If the company doesn’t have those funds (a lot don’t) they will be forced to raise prices. Keep in mind these companies also have investors they’re trying to please. This creates more inflation and a continuing cycle of higher wages, higher prices. \n\nNow the government also has to worry about a couple other things, one of them is the fact that a lot of people put their savings into these companies, that includes 55 percent of adults in America which have investments in the stock market. If these companies have slimmer margins and or have to take on debt that could potentially destroy peoples life savings. So it’s not simply a “government sucks” issue.",
            "That might make sense for the states to do, but federally, the minimum wage is just a floor for states that don't set their own, and they tend to be the states with the lowest cost of living. Any national minimum wages cannot be a reasonable amount for all 50 states.  The US is too large and too varied for that to work.  Each state is the size of most countries, don't forget.",
            "[deleted]",
            "Because\n\nRepublicans",
            "For one doing this will cause the price of exports to go up, something on which all countries depend under modern world capitalism. The price of a good is determined first by the cost of human labor required to produce it, then by supply and demand.  \n\nAlthough tying wages to internal inflation may ensure the purchasing power of locally produced goods, it puts the nation state economy at a disadvantage, because other countries that aren't doing that can produce the same good cheaper.  This is why the first job of all countries is to lower the standard of living of their inhabitants to ensure market competitiveness on the global market.\n\nAll seemingly egalitarian national policies are either designed to temporarily stave off unrest, more or less, or are the result of a temporary response to some extraordinary condition like economic collapse or war. \n\nThese are just a few of the reasons why in an era of unprecedented technological innovation and productivity that capitalism is failing the needs of humanity and our productive power must be put under democratic control.",
            "Because, Republicans",
            "It's been attempted a few times. Conservatives will pretty much fight to the death to stop that from happening. And there's more than a few Democrats in that category as well.",
            "If you say that to people who can make that happen, they suddenly go deaf.",
            "I say tie it to the consumer price index. That adjusts for inflation and adjusts for regional costs.",
            "Won’t work, they will just rig how inflation is calculated.",
            "Because this country runs off expolting the poor. The crimal justice system, medical pay systems all function to basically fuck over the poor/middle class to further increase the wealth of the top 3%. \n\nIn sort because rich people wanna stay rich and have as much separating them from who they view as less then people, who are poor middle class and basically the ones earning all the money for them.",
            "Because no one is going to hire someone to work the tills at McDonalds for $40 an hour. They’ll just invest into machines or fire a bunch of people who aren’t 100% needed. In the UK since the last minimum wage increase I haven’t dealt with a single cashier at shops or fast food places.",
            "couldn't this lead to run away inflation? \nwages go up = companies increase the price of goods = cost of living go up = more inflation = more wages and the cycle continues? \n\nhow would one solve this conundrum? can mayyyy be price control certain things but you can't everything because it eventually becomes too challenging and slow to do that.",
            "[deleted]",
            "There is a constant divide in the wings I like to refer to as 'labor v management'. The right wing believes in trickle down economics. The left wing has seen this to be untrue a number of times as evidenced by how the gaps in class distinction widen at an alarming rate. The left wing promotes a minimum wage becoming a living wage, increasing union strength etc. It believes in narrowing the gaps in class distinction by building the economy f/ the bottom up. Every one will be better off but the people at the top not as much as trickle down.\n\nMy personal opinion, that I have long-contended is for the minimum wage to fall in a range based on company profit.\n\nI'm also disgusted by how some millionaire company magnates are too cheap to pay living wages so their employees qualify for the taxpayer dole of gov assistance. In essence, they get us to subsidize their greed.\n\nBut, we're unlikely to see any major changes w/ the GOP working for the elite.\n\n\"“YOU ALL JUST GOT A LOT RICHER,” TRUMP TELLS FRIENDS AT MAR-A-LAGO AFTER SIGNING TAX OVERHAUL\"",
            "One issue not brought up is that setting a federal standard at a flat value isn't logical.\n\nThe cost of living varies place to place, as well as average income, and even the value of the dollar.\n\nIf you wanted it federalized, you'd need some formula for calculating it for each area.\n\n$15 an hour won't get you nearly as far in New York as it would in rural Idaho.",
            "Several states do this with their state minimum wage.",
            "Big corps would have a lot of incentive to be against inflationary practices then. I don't see a downside.",
            "They'll just start taking more and more factors out of the inflation equation",
            "Do you actually want know if there is any negative of raising the minimum wage, or do you want some leftist to say some of their favorite \nwords:\n\n „corporation….. rich people…… businesses……capitalism….bad………but Government good! Also 🥰Scandinavia🥰“\n\nIf you want an actual argumentation on the downsides of raising minimum wage, go on r/goldandblack it was already argued plenty of times.",
            "I don’t enjoy saying this but you need to go research COLA’s ( cost of living adjustments), they were part of the driver’s of stagflation in the US during the 70’s. They are part of the problem, not part of the solution",
            "Imagine thinking the government would do something that helps poor people",
            "If people earned decent wage THE power  to choose and tell bosses to go \"suck oranges\" would be on the worker side. Keep them poor and desperate.",
            "I asked a similar question about two and a half years ago.\n\nI typed up a long breakdown of options that I thought would help. This will be a much shortened version. First I argued that a 15.00 an hour minimum wage was stupid and short sighted. Not for the reasons some would think. I am not some pure capitalist who looks down on those less fortunate, or buy into the myth that people should not deserve a living wage. There are realities though that are undeniable. In my State I can buy a nice house (even now) for under 120k dollars including land. You can rent an entire house for 400.00-700.00 in a decent neighborhood. Moderate to low taxation, plenty of employment, and I live in one of the best cost of living areas in the country. 9.00 an hour here is close to 18.00 in the coast. Paying someone here 15.00 an hour would put them in equivalent spending value to 25.00-30.00 in many places. This creates all sorts of issues on the backend and in other places. It’s also not fair to people on the coast as in many places 15.00 an hour isn’t close to being a living wage, and out here it’s far more than enough. Average countrywide the math comes to 11.00 an hour for the equivalent to when it first started. But places in the Midwest heavily skew the average. By trying to fix this there are a litany of potential issues including inflationary reaction. No, it hasn’t been seen everywhere where it’s happened but when you balance the entire market with it… most experts agree it will have some effect. My idea for a solution was why not have computer modeling, and what not (every major intra-state employer already has these systems in place) for a regional cost of living calculator. Minimum wage should be automatically adjusted year in and year our based on a formulation including inflation and cost of living calculations. This would stop companies from gaming the system, reduce inflation, and ensure parity in purchasing power coast to coast or as close as it could ever be. Then places like Seattle where you should make 18.00 an hour to get by, and places like Indiana aren’t having such disparities in adjusted PP.",
            "Your solution is the obvious solution to everyone who believes in the minimum wage.\n\nHowever, the people who *don't* want to raise the minimum wage *really* don't want it to go up forever without a herculean legislative effort to put the brakes on it if their worries pan out, and it's hard enough to get a non-indexed increase to pass without them.",
            "Brazil, you just want to come to Brazil, we already have it here",
            "First we need everyone to agree on what to track so you know what the actual inflation is.",
            "Because the debate going on right now isn't a debate about what the minimum wage should be. It's a debate about whether or not we should have a minimum wage.\n\nSmall government conservatives have been relitigating that issue since Reagan. The argument isn't \"what amount does a person need to live on\" anymore, it's \"what can the market support\". Which is a fundamentally different question and presupposes a $0 minimum wage.",
            "Because politician’s salaries aren’t tied to the worker’s salary. Why would they give a shit about you?",
            "It always should have been this.",
            "It's actually a catch 22 situation. If wages increase on average, we also get increased disposable income and higher consumer demand, which, you guessed it, also raises inflation. If wages were tied to inflation then you could have a runaway situation where inflation exponentially increases (hyperinflation) and devalues the entire currency/economy, which wouldn't be beneficial to anyone.",
            "This is such a great idea, and I would love to see it happen.\n\nFederal and municipal jobs have pay scales that follow this format as far as I know.  I have interviewed for several positions like this, and have seen the wage range is much higher higher for certain positions there, then for the same position in the non-municipal world.\n\nCorporations have a class of useless wealth parasites that require exceptional returns on investment year after year, so they pay politicians to block any attempts to increase wages, because their bonuses are on the line.  They also pay heads of media to push lies that trick the uninformed into voting for shills that will continue to block all and any attempts on wealth re-distribution.  Trickle down theory indeed...",
            "Because the federal government should get out of the business of regulating things that impact people at the local level.  Should the minimum wage be the same in NYC as it is in the middle of Wyoming?  Nope.  How about areas of the country where inflation rates are different?  Nope.",
            "One of the biggest issues with indexation, is that it fails to account for amount variance. Simple example;\n\nSomeone earning per year\n$100k. vs\n$50k.\n\nIndex both 5% flatly & now you have;\n\n$105k.\n$52.5k.\n\nSo already there's disparity. And while scaled taxation may address some of this, those on higher incomes typically seek to reduce their tax through legal means. Meaning taxpayers bare the burden of this cost, hurting government income. \n\nSo if you're already on minimum wage, the cost of living may go up by the same % but it may still end up being more than any increase in wages by the same %.",
            "This is exactly the right take, sadly enough most US politicians are in the pockets of every industry you could think of and they don't like fair wages.",
            "That’s what most places do",
            "Because we need the minimum wage to be unlivable so we can threaten people in to complying at slightly better paid jobs.",
            "Because this is literally a mechanism of enriching themselves by stealing from working people and assuming we don’t notice.",
            "I can’t believe nobody mentioned the textbook answer.\nA small rate of inflation allows businesses more flexibility on their wages and, at least in theory, this should lead to smaller unemployment.\nImagine you are making $10/h and there is 2% inflation rate. This means the business will have a revenue about 2% larger. If business is going good, the business should raise wages. However if business is going bad, the business will not raise wages. This is psychologically more acceptable for the worker. \nIf there were no inflation and business is bad, the worker would severely object to reducing his/her wage. But inflation makes you lose your wage “without noticing” and the business can control its budget better.\nI’m not making this up. It’s macroeconomics 101.\n\n(Of course economists are pro-business)",
            "So, interestingly enough, the government DOES do this for military/government employees. For example, military gets anywhere between 1.5-2.5% a year, which is based on inflation. That increase also applies to folks on a military/government pension. It gets really political when the government “forces” this same paradigm on the private sector. With it becoming increasingly more accessible to have people telework, say from India for example, the “concern” is that companies will ship those jobs out of the country. There are certainly ways to make that less viable, but that is one of the many arguments. \n\nThat being said, not everything CAN be outsourced and even then, people should be able to live with dignity if they are willing and able to work a full work week.",
            "It would work if the people at the top took less pay rather than raise prices to pay for the higher minimum wages.  The pay cuts at the top aren't going to happen though.  That lack of sharing and redistribution is really the problem.",
            "20% make 6 figures or more. Average nationwide calculated level of comfort (basically living without worrying about money) is around $125,000 annually. Median household income is about $57,000.\n\nMinimum wage at $7.25 an hour is about $15,000. Federal levels define poverty as $12,880 for an individual.\n\nCalling for $15 an hour is $31,200 annually. Most independent studies say this is about where people's basic needs start being met on average across the nation.\n\nSee the problem is the numbers are cooked. Tying inflation to minimum wage wouldn't have helped because inflation would have been defined however they wanted to define it to keep wages low. They don't want people to live comfortably.",
            "Lobbyists. \"Why is 'X' shitty, and hurts the working class while giving the wealthy billions?\" Lobbyists.",
            "Because 1/3 of this country holds the rest of the country hostage.",
            "See in the us if you are not in the 1% you really do not matter.",
            "Tie it to government officials pensions as well. Minimum wage should be the exact amount needed in retirement…",
            "Why do we need a federal minimum wage at all? Once upon a time is was necessary, but no more. States should handle that because the cost of living differs from state to state, depending on which political party is in charge of that state. In republican run Texas for example,35-40k/year is a good living wage. In liberal democrat California, if you're making 60k or less, you're below the poverty level. Buy a house in liberal California for a cool million dollars. That same house in Texas would cost maybe 300K THAT is why a federal minimum wage is no longer a good idea.",
            "That's how it's done in Australia",
            "Because the rich don't care about anyone below them .",
            "Wages are regional in nature and indexed to the local economy.  People in NY City earn much more that people doing the same work in Hinesville, GA.  But the cost of living in NY is significantly higher. \nTrying to have the government manage wages centrally in a Country as large and diverse as ours is folly.  \nWhat I love about the USA is that if not happy with the current cituation in one place, we can move to another, work hard, and one can succeed.",
            "Why not tie it to the average cost of living?  It's not always in keeping with inflation.",
            "because then inflation doesn’t work. what would real estate agents do then?",
            "Interesting.",
            "The rich want to get richer.",
            "Because business doesn’t want to pay fair wage, they want what ever than can get away with.",
            "That's what Washington State does now. \n\nThe real answer to your question is \"they don't want to do that because rich people would have to pay people more and be less rich as a result and that's 'bad'\"\n\nIf you ask me we should tie minimum wage to congressional salary. They want a raise? Okay, they give everyone else a raise too.",
            "Every broke person has a great idea on how to help everyone until they start making money.",
            "The rich running the show would have to want the wage slaves to be paid fairly first.",
            "BuT wHaT aBoUt ThE sHaReHoLdErS?",
            "Inflation isn't the right metric to tie it to. Cost of living changes independently of inflation and US inflation is actually pretty low.",
            "Two thousand comments, and ctrl-F isn't finding \"Oregon\", so here goes.  \n[https://www.oregon.gov/boli/workers/Pages/minimum-wage-schedule.aspx](https://www.oregon.gov/boli/workers/Pages/minimum-wage-schedule.aspx)  \n\n\nOregon did this.  After 2023, their minimum wage just tracks inflation.  They also have slightly different rates for \"in the only bigger city\" vs \"in a county that has a city\" vs \"fully rural county\".",
            "The problem is that wages are an input into inflation. Increasing wages puts upward pressure on prices. So tying wages to inflation means as prices go up, wages would go up, which would in turn push inflation higher. It’s a self reinforcing cycle that would lead to a negative overall consequence as inflation gets out of hand.",
            "The academic argument against that is that it could lead to an inflation spiral, where wages rise from inflation, but that wage increase fuels further inflation.\n\nHowever, many countries have tied their minimum wages to inflation and it works.",
            "Let’s say everyone gets a raise or minimum UBI. Now costs will rise for all businesses that employ labor and there will be more money in the economy. That will result in all prices rising to take that money off the table causing inflation.\n\nIn other words, a national COLA (Cost Of Living Allowance) only works if you are an export oriented, producer economy like China or Germany, rather than a consumer economy like the  US.",
            "Because that would make sense",
            "In 1981 when I started working the minimum wage was $3.35/hr. Indexed by inflation it would be only $10.11/hour. That's still not a living wage for a single person.",
            "Because the laws are written to benefit the rich",
            "Good luck passing that \"socialist\" \"commie\" idea. But yes its a common thing in countries who value the well being of thiwr citizens.",
            "I’m gonna try my best to break down supply and demand graphs as simply as possible.  \n\nThink of a graph and an X, one line is supply of workers and the other is demand for workers.  The market price of labor(wage) has a point where the demand and supply intersect. This is known as the market equilibrium point.  Setting a point on the graph where the wage must be above this point distorts the equilibrium price as it is not the equilibrium point(the equilibrium point fluctuates).  \n\nNow let’s say that the market experiences a disturbance of some sort.  Elon Musk declares that working as a janitor is lame and now there are less janitors as a bunch quit.  If the minimum wage is above the need for janitors, we will see employers be unable to effectively hire new janitors.  This will cause a recession. \n\nMy proposal? Abolish minimum wage.",
            "We need to tie it to a basket of groceries, gas, clothing, education and housing.  \n\n“Inflation” as reported is lacking in relevance, to put it mildly.",
            "That would require a proactive government that gives a shit its constituents.",
            "Because conservatives would bring back slavery if we let them.",
            "They funniest part is that I went through the first twenty years of life thinking that's how it worked",
            "I moved from Australia to the US some years ago. Interesting comparison:\n\nAustralia:\n\n- Minimum wage indexed to inflation\n\n- Tax brackets are static (thus have to be manually adjusted every now and again by the government)\n\nUSA:\n\n- Minimum wage is static.\n\n- Tax brackets get adjusted every year by the IRS in line with inflation.",
            "[deleted]",
            "In the US, the government releases something called a CPI, consumer price index.  Problem is that this is completely bullshit.  It doesn’t account for housing, medical, or education, which have been highly affected by inflation!  \nThere’s an inherent conflict of interest here.  The government, being extremely in debt, doesn’t want inflation to be high because it affects their bottom line.  Social security does receive a COLA adjustment periodically, if they report inflation measurements that are actual, they’re gonna owe a lot more money!  It’s a rigged system really.  Most people aren’t really paying attention.",
            "Republicans/Conservatives/Capitalists design it so it can’t be done that way.",
            "Wouldn’t that cause more inflation?",
            "Because that would require the country not be run by rich autocrats who rely on that inflation to ensure you receive less and less pay each year",
            "You’re thinking about wages wrong. A wage is just the price of your labor. Like all prices it it subject to supply and demand. The supply of people capable who can perform surgery is low compared to the demand for those positions. Therefore the price (wage) is very high. When you talk about the lowest wages, these are possible because 1) there is a huge supply of low skilled workers and 2) there are people willing to take the wages. If you increase the minimum you are allowed to pay someone, you price many people out of the market because companies can hire better skilled employees. Remember a wage is an agreement that one party says, I’ll pay you x to do this job. Anyone can take it or leave it. It’s just that there’s so many people willing to take x and even less than x that companies can pay lower and lower - someone will still take it. If I put out an ad that said, I’ll pay $1 an hour for someone to come take out my trash, should that be illegal because it’s below some arbitrary minimum amount I’m allowed to pay someone for their labor? Or are people free to see my ad and say no way, my labor is worth more than that, and hold out for a higher paying job? There should be no minimum wage, and the market sets the price (wages).",
            "That is how it was originally conceived. Alas, greedy corporate types got involved.",
            "Politicians on both sides profit & get reelected by fighting over this every couple of years.",
            "Its because the gov doesnt care about us",
            "Should be tied to overall productivity (perhaps measured by gdp growth?) In addition to inflation.",
            "There was a news report on indexing minimum wage to the cost of living increase. I think in short congress wants to use it as a bargaining chip."
        ]
    },
    {
        "post_id": "l9bjdm",
        "author": "VinceDC",
        "title": "Does anyone else get a momentary whiff of a scent that you can't identify but it reminds you of your childhood?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/l9bjdm/does_anyone_else_get_a_momentary_whiff_of_a_scent/",
        "score": 34384,
        "num_comments": 1718,
        "created_utc": 1612096754.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/l9bjdm/does_anyone_else_get_a_momentary_whiff_of_a_scent/",
        "comments": [
            "Yes! Sometimes a smell can make me feel kinda emotional and nostalgic, even though I can't place why",
            "There is a smell of certain powder or perfume that reminds me of sleeping in my granny's bed as a young child and waking up earlier than her and waiting for her to get up, and I'd just be lying there. \n\nThere is a smell that reminds me of my other grandmas Michigan lakehouse, it's a cold smell, very woody and organic. \n\nThere is a smell that reminds me of my elementary school cafeteria. \n\nThere are many distinguishable but unidentifiable smells...the kind of smelly smells that smell...smelly.\n\nEdit: LOOK ROCK. I WON AN AWARD!(S) Oh my gosh you guys THANK YOU. Really made my day. I appreciate everything.",
            "Often. Smells can trigger memories I’d long (30+yrs) forgotten about.",
            "[Why Do Smells Trigger Strong Memories?](https://www.livescience.com/why-smells-trigger-memories.html)",
            "Every once in a while I smell a smell or get a craving and I am suddenly sunbathing on my great grandmother's lawn as a kid  with a glass of iced tea. I've never identified what triggers it but it's nice.",
            "I'd make a candle out of it\nIf I ever found it\nTry to sell it, never sell out of it\nI'd probably only sell one\n\n-TOP",
            "Yeah. Gymnasiums sometimes have a scent that reminds me of my time in gymnastics. It's weird but not every gym has that very specific smell and I can never pinpoint exactly what smell it is. I just know that it is only in gyms.",
            "Yes. Totally weird, but there is something in the Margarita mix at my favorite Mexican restaurant that reminds me of a green velvet box I had as a child. I kept what I called my science kit in the box, but I think the box had once held some sort of powder (as in a cosmetic item, a body powder that was scented) before it was given to me.\n\nAnyway, the Margaritas are great at that place and I get to revisit the smell from childhood.",
            "*Marcel Proust has entered the chat*",
            "There’s this light perfume scent I smell sometimes, I can’t explain when/where I smell it because it always comes about in the most random ways - when I’m walking down the street, in a restaurant, at the shops, in a waiting room... but it always reminds me of being in kindergarten.",
            "Bf he died, my grandpa had a clay bricks factory. Clay in so large amounts has a very specific sent before and after being in the \"oven\". Recently I drove through a place that had one of those factories and the smell just brought so many memories of being with my grandpa at his factory surrounded by clay.",
            "Story time: So my ex girlfriend used to wear this vanilla perfume when we first met. Unfortunately, they stopped making it and she ran out of it. But one day we were walking in the mall together and someone passed by smelling exactly like it. So here I am looking like a puppy sniffing around the mall to try to find out where it was coming from while my partner looks at me crazy. Even now I enjoy the scent of vanilla.",
            "There’s a Five Guys in a strip mall near me that has a lot of pine trees around it. On a late summer’s day, the parking lot has this scent of pine sap, asphalt and fryer oil that reminds me of summer camp over 40 years ago.",
            "Yes yes yes!!! Certain scents of laundry detergent and fabric softener vividly being back memories of middle and high school.",
            "Pretty often. I think “mmm, smells like nostalgia.” It’s amazing that the sense of smell has that effect.",
            "Yes. Remember Pogs? So you remember slammers then too, right? Well I had this scented slammer that smelled super good and unique, but not like anything I had ever smelled before(or smelled since). I can distinctly remember the smell, and I would 100% know if I smelled it again, but still have NO IDEA what that specific scent is.",
            "Proust famously wrote 7 book because he smelled a cake from his youth.",
            "Chlorine pools",
            "[deleted]",
            "/r/DAE",
            "I grew up on a dairy farm. The smell of fresh cut hay does it for me. Also the smell.of cow shit.",
            "Proust write all about this.",
            "There is a cleaning product that reminds me of being in preschool",
            "I definitely have a long list that bring up memories up to 30 years ago:\n\n* Cucumber melon from bath and body works. So popular in high school and with one girl I dated \n* Some perfume I can't recall the name of\n* Rice-A-Roni - sometimes I can imitate this smell by squeezing and rubbing my nose. No idea \n* That plastic stuff in small metal tubes that you put on the end of a tiny straw and blow in to to make semi-permanent bubbles. This one brings up strong memories of childhood",
            "crayon",
            "Yeah, the smell of cat piss reminds me of my mum's house when I was 5-7",
            "There is a smell that reminds me of nursery, being 3 years old. But I can't pinpoint what it is.",
            "Madeleines",
            "I get the smell of my Grandmas Wind Song perfume and the smell of my grandpas Swisher Sweets cigars. Whenever I get a whiff of them I just imagine that they are visiting me from the otherside, checking up on me. It's funny because I had never told my ex about the smells. but one day he was in the bedroom and he had me come in there and he asked, Do you smell sweet cigars? I just casually said \"Thats my grandpa visiting\" he looked at me funny and said no one is here! I explained that my grandpa had passed away years ago but occasionally I get a whiff of his cigars and of my grandmas perfume. He looked a little freaked out and said, Like they are ghosts? I said yep, when ever I smell those scents I just imagine they are here checking up on me. It's not only me that smells in in my family, mu mom and my sister both smell them too. It's actually quite comforting to me to think that they are reaching out and checking on me.",
            "There was once a smell that I occasionally encountered but could never identify that distinctly brought back my babysitter’s house from when I was in 1st grade. Fast forward to college - turns out it was bong water.",
            "Yes! Sometimes I smell something and my brain immediately goes to my childhood days. And sometimes it reminds me of a specific grade in school and I would feel like I need to take my school bus the next morning or finish my homework now. Lol idk, I am just rambling now. But yes I totally get that feeling very often.",
            "Have this memory of my childhood preschool. It's a whiff of bleach but also the smell of corn cooking? It's both those things but more. I've never encountered that exact smell again. It doesn't sound great, but it seems clean and warm in my memories.\n\nWhen i was in college the library had a 5 story storage area for the older books called the stacks. It was creepy as hell, straight out of the 50s in vibe, but I loved it because of the books and their scent. When I open an older book I get that scent... and I think the stacks in turn remonded me of my grandparents house and their collection of encyclopedias from the 50s and 60s, and the Foxfire books.",
            "Yes I’ve been getting these ‘momentary whiffs’ ever since I was young, an overwhelming sense of euphoria and nostalgia.  I was recently diagnosed with epilepsy and was told by the neurologist that these are “mini seizures” and to be careful with them. If any of you are experiencing these a lot and they make you lightheaded and dizzy, please get checked out",
            "Yes I get this a lot, some times also accompanied by a strong feeling of home sickness (something I normally don't have). Just a gut wrenching feeling of wanting something back without knowing what it is.",
            "Hot concrete as the rain starts to hit it.",
            "“Sometimes a certain smell will\nTake me back to when I was young.\nHow come I'm never able to identify\nWhere it's coming from?\n\nI'd make a candle out of it,\nIf I ever found it.\nTry to sell it, never sell out of it\nI'd probably only sell one.\nIt'd be to my brother, cause we have the same nose,\nSame clothes, home grown\nThe stone's throw from a creek we used to roam.\nBut it would remind us of when\nNothing really mattered,\nOut of student loans and tree house homes\nWe all would take the latter.\nMy name's Blurryface and I care what you think”\n\nTwenty One Pilots- Stressed Out",
            "Yes. It's making me really nostalgic and i miss my family even more. I haven't seen my family in over a year. I especially miss my grandma. Thankfully I have my parents and sister close and see them almost daily but i miss the town i grew up in and the rest of the family. We were very close growing up. The town has gone to shit but there are some things that are very specific to it and there are a lot of memories. I'm planning a covid safe trip there soon if the weather holds.\nEdit: a word",
            "Yes! For just that short amount of time everything doesn't matter, feel totally safe, infinite happiness and then reality slaps me in the face...",
            "Several scents, yes. But it rarely triggers a super specific memory.",
            "why has this sub become r/DAE?  aka Does Anyone Else subreddit",
            "Jesus when did this sub become r/DAE? These types of posts aren’t even real questions - just people looking for validation. Mods have failed miserably.",
            "I get something similar, but it's with taste.  I get a fleeting memory of something that tastes so good, and it only stays for a second.  Then I cannot remember what the flavor was, and it's depressing.",
            "Both me and my sister distinctly remember the smell of our mother's deodorant from when we were very u young. We even know the brand. One whiff of that and I'm 5 again. It's rather lovely. I don't think she's used it for decades.",
            "No. Well, not *me*, anyways. There are familiar smells, sure, like the “green” of the vegetable and fruits section of a super market, but if i recognize a smell i recognize a smell. \n\nMaybe it also has to do with the fact i have my nose clogged often, hence ruining my ability to smell, and have since childhood. Less smells smelled, less smells i can recognize, i guess.",
            "[deleted]",
            "Yup. It’s second hand smoke. Takes me back.",
            "I’m sorry to sound like a debbie downer, and i dont mean to discount the point of this sub, but considering the olfactory senses are linked to memory i doubt there isn’t a single human who hasn’t experienced this.\n\nI do believe the point of this post was to probably hear other’s stories who experience similar things. Maybe this question would have been better suited to r/DAE",
            "No, literally nobody else has a nose except you. They post it on /r/DoesAnybodyElse instead of making shitposts here.",
            "Yes all the time.  A trip through the mall will do it.  Sometimes ill catch a wif of school smell too.  Or something that reminds me of my grandparents.",
            "I used to get very carsick and airsick as a kid, often to the point of throwing up. At the same time, my mom loved to always chew a specific flavor of mint chewing gum whenever she was with us in the car, and it had a very distinct smell. Two decades later and that smell will still make me nauseous when it hits me and I generally just can’t stand chewing gum.",
            "Stepping outside in spring after it rains. The smell takes me back to like grade 3. It’s crazy",
            "The smell of \"the morning\" takes me back to the days i used to rush to get to high school on time",
            "The perfume that my teacher wore on my first schoolday is quite a strong memory for me. Thats been 20+ years ago, and I've since smelled it in the crowd only a few times. But I'm always surprised how it instantly brings me back there. I so wish I could find out what the smell is exactly..",
            "Certain screen printed shirts will always bring me back to being smol in the 80’s",
            "Yes, my Grandpa died when I was 14 but as a kid we lived with him and my Grandma. After he passed my Grandma rented the house out to someone we knew and I remember going back and realizing his smell was gone. I've been searching for it since.",
            "Yes my grandpa used to smoke cigars and drank hard coffee. So I used to sleep under his desk in the carpet. He doesn’t smoke anymore but still cigar and coffee is the smell of my safety place.",
            "yes absolutely! I was smelling candles in a candle store... bath and body works I think. and this one scent gave me the instant nostalgia of when I was 4 years old, waking up in my ninja turtlw pj's and walking outside to sit with my mom on the front porch. I had to buy it and have been buying it ever since. the scent is called Midnight Blue Citrus. I recommend it! 😁",
            "This has happened with scents that reminded me of my elementary school's cafeteria and library.",
            "Peanut butter sandwich inside of a lunch box reminds me of kindergarten at my private school. I had a peanut butter and banana sandwich every. Single. Day. when I was in kindergarten and I made one for lunch at work a week ago and when I got a whiff of my sandwich plus the plasticky vinyl smell of the lunch box it transported me back. I’m very fond of it",
            "My dad always smelled wonderful, no matter what cologne he wore and he always smelled the same. He once poured all of the different bottles he had, that just had a little bit left, together in one bottle and he still smelled great.  I was in Walmart one day, a few years after my dad passed away and smelled my dad in one of the aisles.  I spent a least a minute in that spot, just soaking up the scent and when it was gone, I wondered the aisles trying to find it again.  If anyone noticed me “sniffing” my way through the grocery aisles they probably thought I was crazy.",
            "All the time! One time in particular that sticks out:\nI (30/F) was about 18/19 and driving my mom’s car home after work one night and the tire blew. It was dark and scary and I had no phone at the time. I started crying and freaking out because I was alone and it was 10/11 at night. I suddenly smelled something different, and it reminded me of my grandma who passed when I was around 10. I immediately calmed down and stood outside the car, hoping somebody would see me. A sweet couple stopped and helped me, saying I reminded them of their daughter so they couldn’t stand to leave me on the side of the road. They let me use their cell phone to call my mom and took me home. I stayed on the phone with my mom the whole time.",
            "A few years ago I was smelling a new line of lotions at the store. I picked up one, a chai blend, and I was instantly hit with a scent memory of someone that I loved/loved me. It was overwhelming. I lost my grandparents and great aunts when I was very young, so it could be any of them, I have no specific person to connect the scent to, but every time I use it I feel loved.",
            "Just that smell you get when you run water over a frozen ice tray. No matter what kind of fridge, or what is inside it, that smell has stayed the same for almost seventy years. air and water; beats me what it is...",
            "It took me some time to identify it but now I know what it is I pick up on it immediately. Cow manure. Strange, I know, but it reminds me of summers spent up in the Northern Adirondacks.",
            "Spaghetti Os. Makes me ill",
            "I have a set of coasters that I got from my grandmother who died when I was sooo little, I always kept them together in their case and so now whenever I smell them it’s like she’s next to me haha.... this counts right? Lmao",
            "I've always wondered what mine would be. I can't smell and I don't have any memories of ever smelling something before, but I've heard plenty of friends bring up nostalgic smells - like grandmas house or something else more obscure. It must be nice to smell something that makes you remember pleasant times.",
            "Every other comment seems to be answering a slightly different question. They're all assuming that you have actually smelled a thing, and it reminds you of something.\n\nHowever, you didn't specify that you were actually exposed to a scent for this to happen.\n\nHave you had covid? Parosmia (altered sense of smell) and phantosmia (smells that just appear in your brain without you actually smelling anything) are both reported as post Covid side effects.",
            "There is some wild plant that gives off a smell, that isn’t from childhood, but I LOVE it. It’s not a flower (as far as I can tell) and I just have no idea. I live in iowa and I think it’s in low lying land like ditches or drainage areas.  (at least that’s where I think it was in college when I smelled it). But sometimes I’ll just be outside and I’ll smell it and I’ll just wander around like a weirdo smelling the air trying to find it’s source.",
            "Smells are used to trigger memories.\n\nThey say, if you were chewing gum while studying, chew the same when taking the exam",
            "The smell of barbisol shaveing cream and the smell of coffee first thing when I wake up both remind me of my great uncle who passed back in 2004 who was like a father to me.",
            "Yes. I’ve figured out what one of these many scents is caused by, but many still elude me. I’ve scoured every earthly archive of information on the smell of a kindergarten playground, and I have concluded that my school was unsafe and it was actually carbon monoxide leaking from under the playground.",
            "My great Nanny Bet, smells of Elizabeth gardens (I think) gave powder and my nan found on eof them a few years ago and I was instantly transported back to standing on my Nanny Bet's bed and her dressing me in her long pearls for a Christmas party.\nFound that same compact in my nans things when she passed during th first lockdown, next to my nans own powder and the smells made me cry..",
            "Yeah. I was at a friend's house, it smelled exactly like my grandma's house. It didn't click for a minute but as soon as I walked in I remember my heart sank!! Stale cigarette smoke, like what it smells like when it's deep in the furniture and the walls, mixed with coffee and food cooking, and a little bit of her perfume. I can almost smell it right now just typing this. \n\nSounds gross but it's not to me. It's just, her smell.",
            "Tresemme hairspray and vanilla fields perfume takes me back to watching my mom do her hair and makeup",
            "Driving through my old home town, I can smell something very familiar on the breeze.  Couldn't place it, but it's my smell.",
            "Yeah the dude from twenty one pilots gets that. The blurry faced one.",
            "Pencil sharpeneings.",
            "Sometimes I smell colors from all those magic markers.",
            "Okay, hear me out, but the smell of a used lunchbox. Like, even my work lunchbox at 25 years old would smell like my school lunchbox at 8 years old. I can’t pinpoint what it smells like exactly, but when you smell it, you know.",
            "Whoa! Yeah I randomly smell my pre-school cafeteria. It takes me back when I would smash all peas...",
            "Theres a 21 Pilots song about this",
            "There is some cleaning smell they used in kindergarten. Idk what it is but I remember the smell. I’ve smelled it seldom in other places.",
            "The olfactory bulb (smell identifier) in the brain is adjacent to the hippocampus (memory maker) and the amygdala (emotional memory maker). Therefore,  emotions become associated with scent and that is why certain smells trigger memory.",
            "Old buildings- it’s like a combination of old books, churches, libraries, museums. Wood, paper, I don’t know what else but sometimes I’ll catch it and reminds me of the old library building I’d ride my bike to during summers and school holidays.",
            "I was showing a house and walked into a bedroom that smelled exactly like my late grandmother’s perfume/fragrance/soap. I was almost knocked over because it was identical. The bedroom belonged to an older woman and made me miss my grandmother dearly.",
            "It's simply your own personal Fragrant Time Machine. A Snot Tub Time Machine, if you will.",
            "One day, a year or two ago, I took a dump and it smelled exactly like the bathroom after my dad was done with it when I was a kid. It made me get a little misty eyed because my dad died 16 years ago and I really miss him.\n\nAnyway, that's how my shit made me cry.",
            "Tangentially on topic . . . there's a scene in Fast Times at Ridgemont High where a teacher hands out a mimeographed page, and the students pick them up in unison and sniff them. That's a joke kids today won't get, and that makes me sad.\n\nOh, and I occasionally catch a whiff of Chantilly, and suddenly I'm flying a kite with a high school girlfriend on as blustery March day in 1981.",
            "My great grandma lived in a small apartment complex and the vents from the laundry room vented out towards the front door of the complex and now when I walk by some laundry mats I'm reminded of her.\n\nVHS tapes have a certain smell especially when they get warm, that reminds me of my brother because we used to swap out VHS tapes to rewatch our favorite spots of movies.\n\nThe N64 has an odor too that reminds me of a group of friends.",
            "New carpet = kindergarten",
            "Honeysuckle. Couldn’t for the life of me figure it out until I remembered we had a honeysuckle bush in the backyard of the house I grew up in.",
            "The smell of the Natural History Museum. It literally as not changed in 40 years. I have no idea what the source of it is, but it also smells like my elementary school library. It’s a sort of “fresh band aids” scent. Instant nostalgia.",
            "I swear I smell scents that aren’t even there which still triggers memories. It’s odd.",
            "There's a perfume that a nurse wow when I had surgery (1992/12yo). I don't smell it often, but when I do it makes me physically ill\n\nBoxwood bushes reminds me of my grandmother's house. It's one of my fave smells",
            "Yes, and it is very common. Smell is the most direct sense that accesses memory.",
            "Sometimes I gets whiffs that remind of simpler times, or ex girlfriends, I hate those ones",
            "I can't say quite why, but this scent reminds me of when I walked in on my uncle raping his daughter . . .",
            "Sometimes a certain smell would take me back to when I was young\nHow come I’m never able to identify where it’s coming from?\nI’d make a candle out of it if I ever found it\nTry to sell it, never sell, out of it, I’d probably only sell one\n\n\nBut seriously? Yeah. Honestly couldn’t describe it but the smell of something at home..... I think it has to do with our clothes washing formula.",
            "I actually have a strange connection with this. When I was younger I had a concussion that put me in ICU for 4 days. I had severe bleeding down the hemisphere of my brain and I was basically immobile for 2 weeks. I did recover and over time I stopped having headaches and double vision, but I never regained my sense of smell. According to my neurologist the nerves were more than likely severed. But here is the wild part, I get phantom scents stuck in my nose daily. I \"smell\" things that are just memories. For instance, today I've been \"smelling\" my aunt's house which smelled like mothballs and Crisco. It isn't a bad smell necessarily, but I do have memories of bad scents and Jesus H. W. Christ is it awful. I have had days of only smelling dog shit or a funeral home. I can't even drink water without feeling like its in my mouth. Its ridiculous. Anyways, thanks for reading this incoherent rambling, mess.",
            "r/doesanybodyelse This sub really doesn’t have actual questions anymore, just people wanting other people to relate to them for upvotes",
            "Yes, but its doesn't remind me of my childhood (since I'm a child). It for some weird reason gives me motivation to keep writing like I did 3 years ago.",
            "r/twentyonepilots ?",
            "Seriously? You know everybody has this happen!",
            "My grandmother's kitchen had a distinctive smell.  Several years later I discovered it was onions.",
            "Nosetalgia",
            "No, nobody else does this /s",
            "Sometimes a certain smell will take me back to when I was young",
            "You mean farts?",
            " Sometimes a certain smell will  \nTake me back to when I was young  \nHow come I'm never able to identify  \nWhere it's coming from?  \nI'd make a candle out of it  \nIf I ever found it  \nTry to sell it, never sell out of it  \nI'd probably only sell one",
            "I told my mother and uncle that my grandparents house smelled so unique and yet somehow familiar growing up, and how I use to enjoy and missed the odd smell. Unbeknownst to me, they then told me my grandfather had a severe flatulence problem in his later years which caused the house to smell like that. I then realized I just missed smelling my grandpa’s farts.",
            "Sometimes a certain smell will\nTake me back to when I was young\nHow come I'm never able to identify\nWhere it's coming from?",
            "Grew up in a very religious household so I didnt know what Marijuana was until my 20s. Always asked my mom why my friend's house had a different potpourri smell and why couldn't we get that? Especially in the bathrooms. They must have some special air freshener we didn't buy. Smelled really good.",
            "\"Sometimes a certain smell will  \nTake me back to when I was young  \nHow come I'm never able to identify  \nWhere it's coming from?  \nI'd make a candle out of it  \nIf I ever found it\n\nTry to sell it, never sell out of it  \nI'd probably only sell one  \nIt'd be to my brother, cause we have the same nose  \nSame clothes, home grown  \nThe stone's throw from a creek we used to roam\"   \n\\-Stressed Out (Twenty One Pilots)",
            "No. You’re literally the only person this has ever happened to. Even though it’s very common knowledge that everyone experiences this",
            "I swear to God so many posts on Reddit's seem like aliens trying to figure out the basic understanding of humans. This is such a widespread concept, literally everybody has this happened to them regularly. Why even ask the question?",
            "No offense but you might be at risk of a stroke.",
            "what kind of fucking question is this, it's like \"does anyone else have a memory, and do you remember things when you look at other things\" like what? Yes? That's how human bodies work????",
            "I'd make a candle out of it if I ever found it, try to sell it never sell out of it, I'd probably only sell one...",
            "That’s poop.",
            "Perhaps you’re around someone who needs to bathe?",
            "mamas pussy",
            "It's called your mom's pussy. That shit always brings me back.",
            "Shoutout 21 pilots",
            "I had that a few years back then i realized not too long ago it was cum so i stopped thinking about it",
            "Ah yeah, KY and chloroform.",
            "\"Praustian Experience\", when a smell unlocks a memory.",
            "I experience this a lot",
            "Yep, my memaw used a certain kind of perfume. Some older ladies still wear it and it reminds me of her.",
            "Cat pee and dog ass",
            "I was walking by a room in a primary school as I was passing by too go home and I either walked by a classroom or a janitors closet but I caught a wiff if some sort of cleaning product and It just reminded me of pre school",
            "The roadkill skunk smell, reminds me of playing with my playmobile on a hot summer day.",
            "Yes, sometimes just a scent on a breeze will send me down that rabbit-hole.",
            "Every time I smell curry I am reminded of my childhood neighbors. Always brings a smile to my face.",
            "Yesterday a coworker said something about poodles and I smelled the grooming powder my grandpa’s poodle always smelled like when she came back from a cut. In fact, she always smelled like that. I can’t remember a time when she didn’t smell like a fresh old lady. I think she lived to be almost 20, but grandpa and sookie have both been gone for a long long time now. I miss Papa Bud and his ancient dog!",
            "Not necessarily from my childhood, but the smell of incense instantly transports me back to my trip to Japan in 2010.",
            "Ate some expired chicken and it reminded me of a snack I used to eat",
            "When that happens, I start feeling really relaxed and fall into a surreal state.",
            "Yes, except of my fucking ex boyfriend I fucking hate him, Christ I miss him",
            "Yes. I can remember smells often.\n\nI'm also provoked of smells when looking at people faces or listening to music every now and then. My brain is weird. 😛",
            "According to Gil Grissom in the early 2000s, smell is the most power sense when it comes to memory.",
            "That happens to me and I can usually identify it within 5sec and working at a Walmart it reminds me of my dad and our old houses and I ki da get a flashback to when I originally smelled rhe scent.",
            "God all the time.. This is going to turn into a long nostalgia story, but my out-of-state grandma was a piano and organ teacher and had this huge finished basement with her piano, a little electric organ, and all her music, and she had this ginormous vanilla scented candle that she never burned (it was about as big around as a DVD and about 2 feet tall).  The smell of vanilla mixed with the smell of old paper from the piles of decades old sheet music she kept will hit me sometimes and take me back to my childhood.  She and her husband would drive over in an RV and stay with us for a week or so, then I'd ride back to her house with them for another couple weeks with her and my grandpa (they were divorced and both remarried but lived in the same town so they'd pass me off while I was in town), then my family would fly in and visit for a while, then I'd fly home with them.",
            "Weed",
            "Not my childhood but of people who I used to be close with.",
            "I’ve always liked to think that’s it’s a spirit from the other side trying to make contact",
            "It's weird but my elementary school media center had a distinct smell that I could recognize any time",
            "Some smells remind me of going outside at my grandmother’s house when I was little. Another or my great aunts house. Just memories on memories on memories. I’m a nostalgic person so they make me so happy.",
            "I work in a warehouse, and this happens to me all of the time. Some scents trigger memories I may never have recovered otherwise.",
            "There are scents from the 1980’s that I can remember but will never get to smell again.  \n\n1) print shops \n\n2) diesel exhaust \n\n3) scented crayola markers\n\n4) watercolor paint smells different now\n\n5) some giant red Xmas candle of unknown provenance that lasted a decade",
            "Muffins",
            "I get this with smells really often but also with certain ‚feelings‘ or other sensory experiences for example a gentle cool breeze on a hot autumn day (Australian) can remind me of particular days in my childhood or bring back nostalgia.",
            "Yes! Sometimes I can identify it. I had a lot of scented toys as a kid. Sometimes I'll smell something that will smell like one of my childhood friend's houses. (Does everyone else remember their friends' houses having specific smells? )",
            "Whenever i smell bleach or floor polish I'm reminded of school trips to the swimming pool (indoors in winter here in Canada) and the floor polish reminds me of one from an early elementary school too. Instant time machine. So trippy.....",
            "OKG YESS",
            "Unfortunately I don’t sniff N64s and PlayStations anymore. Had to kick that habit, it was ruining my life",
            "yep that's normal",
            "Christmas tree decoration smell. Takes me back to my childhood",
            "Moldy basements and cheap perfume",
            "Yep, it's this specific scented Glad kitchen trash bags, of all things lol. Still have no idea what \"flavor\" it is but my mom used them in our kitchen trash can. Now everytime (which is admittedly not often) I come across that smell in the wild, it really makes me feel like nostalgic or something.",
            "The smell of rain on grass, and the smell of of a warm breeze during a sunset in summer where it feels like the air is tinted with sugar, reminds me of Bulgaria and Florida for some reason, even though the times I have witnessed the scent at the same frequency",
            "Yeah especially perfume will remind me of women I've come across in the past",
            "I remember a Tinkerbell perfume I wore when I was a kid. I'm not sure if it exists anymore. I have smelled it a few times, passing people, or walking through a crowd.",
            "There is a smell that reminds me of elementary school. There was a powder soap in the restrooms. When I smell whatever odor that is, I am transported back to the halls of my school. And that was almost 50 years ago!",
            "I started working at a preschool and there was activex in the toilet that I used in MY preschool as a child. Imagine the moment..",
            "This is slightly off topic but doesn’t anyone remember how the old plastic Disney VHS cases smelled when they were brand new. It’s a smell I haven’t smelled in ages and would love to smell again.",
            "My family would do ‘BOO” bags at Halloween and try to be secretive about it. Until my nephews started smelling the bags and figuring out right away whose house they came from. ‘This smells like Uncle Gus’s house!’",
            "Marcel Proust, “remember ace of things past”\n\nA smell invokes memories of his childhood, then he writes like 9 volumes about it.",
            "Massively. My long term memory is pretty terrible but every now and then I’ll smell something and it will just transport me back. \n\nI smelled something that absolutely reminded me of the smell of our school corridors in secondary school.",
            "Yes! There’s one scent that I have no idea what it comes from but it reminds me of my childhood. I don’t know what to call what it smells like other than “blue”",
            "Lilac and hyacinth candles make me think of my grandmother's house at Easter because she always has her house filled with spring flowers at that time. \n\nDamn I can't wait to get out of this pandemic so I can visit her again.",
            "I actually found a candle that smells exactly like opening the chest of drawers my sister and I had in our bedroom that had previously belonged to our dad. Needless to say I purchased it. \n\nIt’s a very pretty pink and marketed as a floral scent but when I had my boyfriend smelled it he said it was rather masculine haha, I suppose he’s right though!",
            "yes, often! smell and memory are very connected!",
            "Most memorable ones for me: a smell that reminds me of my first secondary school crush and another that reminds me of my dad coming back from the airport.",
            "Try smelling a crayon... thank me later for the ride",
            "Certain plastics remind if old toys but I can never remember which toy",
            "I grew up on a farm, so anytime I get a whiff of diesel here in the city it takes me right back!",
            "Yeah now and again. Of all our senses, smell is most linked to memory.",
            "Yes, and I really like when that happens :)",
            "Do you mean an absolutely random, pungent smell out of nowhere that you have never smelled from any real object? I experience this sometimes, always reminds me of my childhood, not fully sure why. I think it's because my brain doesn't know what to associate it to, so it just kinda associates it to a time.\n\nEverybody else in this thread is talking about smells that they CAN identify. From your question, I think we experience the same thing.",
            "Frequently",
            "Why did it get removed?",
            "Unfortunately the smell of burning trash reminds me of childhood trauma. One whiff and I’m right back there.",
            "The smell of hockey. The smell of the ice, popcorn, beer, some sweat, and probably a handful of other things. That smell.",
            "You know that barbershop smell? That's my favorite. Idk if it's powder, I'm pretty sure it's aftershave? Anyhow, easily one of my favorite smells. Reminds me of my grandparents. My grandpa would smell like it and my grandma would cut my hair. Neither of them are with me, but, whenever I get a whiff of that smell, memories follow.",
            "The smell of water hose and plastic pool sends my brain into a time warp of summers long gone and summers future",
            "Going to Germany as a kid, there was this one smell. I can't name it or describe it but it brings back memories. In the hotels, the restaurants and such. Came back to Canada, we bought a brand new 2004 Jetta and there was that smell! IN THE CAR! Memories flooded my brain.",
            "Yeah, I'm not even sure what it was, maybe an air freshener or perfume or something, but it reminded me of visiting a childhood friend. Haven't smelled it in a while though... not sure if it's just that rare or if I forgot what it was and it no longer reminds me of my friend!",
            "Rain on asphalt. Reminds me of elementary school recess.",
            "The smell of walking into a shed or the vapor comin off a freshley opened freezer. \n\nTheres also one that reminds me of the sentist office where they had to break a tooth out but didnt numb me just strapped me down with a velcro blanket. So the smell freaks me out pretty bad",
            "The oil on wooden powerline poles... the back woods of Louisiana Swampland.",
            "The part of your brain that helps with memory, the hippocampus, is located next to the part that processes smells. This is why smells are strong memory triggers, or so it's thought.",
            "Crocus flower- anytime I smell that I'm transported back to my parents garden in spring and the fish are swimming in the pond, the pump pleasantly vibrating (noise-wise).",
            "I recently met a first cousin once removed (my grandmother was her mom's sister), and her house smells exactly like my grandmother's did. My grandmother passed away over 20 years ago when I was 10, and I haven't smelled that smell since until going to my cousin's.  I have no idea what the smell is even after 'recognizing' it from and trying to figure out what I was smelling at her house.",
            "Yeah, there's this smell in November that reminds me of when I was little. I don't know what it is but it always starts in the first week of November. Also, summer has a particular smell.",
            "Slightly musty, slight rose perfume, the smell of my great aunts guest room. Makes me think of how much we loved her and my great uncle.",
            "before i ever smoked weed my mom always smelled like her perfume & something i couldn't place my finger on. i figured it out when i got to college",
            "My parents smoked pot growing up (not in front of me) and sometimes I catch a whiff of my own stash and it smells like I’m five again digging through my parents drawers for Christmas presents.",
            "The smell of band-aids. I could smell it now.",
            "Marcel Proust wrote an early account of this phenomenon, and a book was written about his account and a few other pioneering scientific accounts (before there was even a \"science\" for the things they were talking about), called Proust Was A Neuroscientist. For Proust, it was the smell of madelaine cookies bringing back memories that made him remark upon the connection between smell and memory.  \n\nVery good read. You might enjoy it.",
            "I’ve got something similar. Whenever I smell oil pastilles, it takes me back to first grade. It’s like it just turns on a certain mindset and you feel like it was yesterday.",
            "There is a smell that reminds me of the PE mats at school",
            "My wife and I used to visit Ulverston in the Lake District, firstly for the Christmas markets that are really great, and also as it's the birthplace of Stan Laurel.  It's a beautiful town, with cobbled streets, and lovely, helpful people, and some great pubs and eateries to round it off\n\nWhen I walked around, I always felt secure and safe, and it was maybe the third trip that I realised it was the smell of the coal fires, the smoke from the chimneys, and it was taking me back to my childhood, and when I walked the streets in my hometown as a young child...",
            "I had one one time that was hard for me to identify. I knew that there were some wonderful childhood experiences attached to it. I finally figured it out. It was the smell of model engine two-stroke fuel burning.",
            "In pre-school, my mom had packed a lunch for me that contained peanut butter and jelly sandwiches. After our lunch (“snack”) period, we obviously are told to wash up. I went the the bathroom and smelled soap that was very pleasant, and it was the only time I can recall smelling that particular soap the time.\n\nFast-forward to middle school: I asked to use the restroom. It was, without mistake, the EXACT same scent. I was instantly filled with happiness and also craved peanut butter and jelly sandwiches.\n\nI currently still hold my love for PB&J. If I had smelled that sent even mildly intermittently, I would not feel the same way. Strange how the mind works.",
            "i used to have a really specific dream that left a plastic taste in my mouth, and whenever i remember that taste it makes me cringe a little bit",
            "I assume it's some sort of carpet glue or some other industrial application to buildings... Sometimes when I walk through a certain hall at work (industrial hallway), it reminds me the the military training buildings that I would stand watch in all night.",
            "Growing up my Dad’s house always had this scent whenever I would visit. I never knew what it was, just that whenever I was walking on the street and would get a whiff, I was reminded of him. \nI grew up and found out that my fond childhood scent was indeed marijuana.",
            "Sort of.. every christmas stores get flooded with that cinnamon/pine smell.. but there's one version of it that is sweeter than the others and it's the way my grandmas house smelled all the time, but I can never find the exact scent.",
            "Yes! Also there is a lyric from circa survive \" this building smells so familiar... I had thought this scent was lost\" I always think of that when I have this feeling",
            "I grew up visiting family in a small town in the mountains of the Dominican Republic and my parents retired there when I went to college. Every once in a while I’ll walk somewhere and the air will smell like it does there and it makes me extremely homesick.",
            "That smell of summer. I dont know what it is exactly but that smell on hot summer days is like a kick right into my backyard growing up. I can almost reach out and touch those memories",
            "I occasionally smell something that instantly takes me back to my grandparents neighborhood in Florida (their winter vacation home) and then it's gone. I almost think you don't actually smell those things but it's somehow your brain just playing tricks on you.",
            "Yes",
            "This is why (from what I've heard), your sense of smell is the strongest to stimulate a memory.",
            "Lol for me it was the smell of burning resin. I never understood what that smell was in the garage when my step dad was out there. Now I know he never had good weed.",
            "Yep. For me it’s that distinct smell of laughing gas..\n\nI grew up refusing for dentists to fill my cavities (because a shot in the gums—novocaine—to a 5 year old is basically the equivalence to dying), so I had many dentist appointments where I tried to let them fill it, and my parents tricking me into going to the appointments, are quite ingrained in my brain. And refusing filling cavities only created bigger & more cavities, so I kept having to go back. I think I had around 12 cavities when they said that it was enough (that I need to stop ‘playing around’ and let them do it) and started to hold me down.. so yep, still remember that smell, and I get a random whiff of it maybe once a year.. kinda strange.",
            "There’s a certain scent I get once in a while that always reminds me of the smell of He-Man toys from when I was young."
        ]
    },
    {
        "post_id": "llqbfv",
        "author": "Unique-Interaction-8",
        "title": "I've sucked my own dick and have been having back pain since and want to visit a chiropractor but I'm afraid of being embarrassed if I say the reason of my back pains, what do I say if I visit one?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/llqbfv/ive_sucked_my_own_dick_and_have_been_having_back/",
        "score": 34351,
        "num_comments": 2931,
        "created_utc": 1613552939.0,
        "selftext": "I don't know if this question counts as a medical advice question, but I really want to know what to say, I'm 14 and have to go with my parents, my parents will be there, what do I say?\n\nEDIT: you guys are fucking hilarious, this is now the top post on hot, has 2k upvotes, and i have more upvotes on this throwaway account than my real one, you all are pieces of shit and i love you, thanks for all the real advice though.",
        "permalink": "/r/NoStupidQuestions/comments/llqbfv/ive_sucked_my_own_dick_and_have_been_having_back/",
        "comments": [
            "Say 'I bounced during a stretch.' The reasons and precise positioning don't need to be mentioned. They'll picture you trying to touch your fingers/palms to the floor.",
            "Don't worry. It's only dentists that can tell if you've sucked a dick recently.",
            "Just say you overstretched trying to get your phone, that fell under your bed, while still being on the bed",
            "Tell them you tried to put your leg behind your head because you saw someone do it online or something. \n\nAlso that is pretty impressive. And hillarious.",
            "Doing crunches\n\nEDIT: How does it feel to suck your own dick?\n\nEDIT EDIT: Guys I got it, it's not worth it, sheesh",
            "[removed]",
            "You must either insanely flexible or hung like a horse.",
            "Tell them you were trying something (Yoga for an example, exercises) or whatever.. but thats only if they asked..\n\nalthough if there is an actual serious problem, I don’t think you would even need to tell them the reason of how it happened. There will run tests on you via machines or whatnot and figure the location of the pain themselves. They don’t care about the reason of the pain happening, They are there to help you solve the pain out.\n\nAnd to make you more comfortable, they seen a lot LOT LOT more worse cases and they will see a lot more in the future so yours is like super silly to them to the point of them not giving a tiny damn.\n\nEDIT: I thought he was going to see a doctor.",
            "[deleted]",
            "Tell them that you spent 3 hours sucking some dude's dick.",
            "That’s how my cousin Walter died.",
            "Well done man a great achievement",
            "[deleted]",
            "See a physiotherapist. Your back is too precious to trust to a chiropractor. No need to say anything other than where it's hurting. It may well be partially caused by the amount of time you sit at a computer or playing games, or your posture. Just let the physio work their magic, and make sure you do the exercises you get given.",
            "have i mentioned my parents are muslim, and are strict as fuck?",
            "God I love reddit.",
            "Yoga excuse, obviously. Either that or you had to pull a splinter out of your dick because your hands were on fire.",
            "Sir, this is a Wendy's.",
            "\"I thought my back felt a little weird so I looked up some stretches online, but I think I overdid it\"\n\nAlso, don't take my advice as any medical advice, but generally lying on the floor can help with back problems and back pain, just make sure your neck is supported.",
            "OP is 14 and his parents can look at his medical records anytime they want you don’t get a lot of privacy as a kid. Depending what position you were in look up some Pilates and yoga poses thru Google find one close to whatever contortion you were in and go with that. That way they will know what part of your back or neck to look at but most doctors have heard way way worse.",
            "One thing you could say is, that you were trying to get more flexible and kinda over did it.  \nYou know that motion you do when stretching when trying to match your finger tips with your toes? Just say you went over board with it and tried to grab your feet.",
            "Due to the gross mismanagement of this website by the admins in the wake of the API changes, I have decided to leave the site. In preparation, I have used a tool called Power Delete Suite to overwrite all my comments.",
            "I know it's /nostupidquestions, but I'm gonna give you a big brain answer. \n\nCouldn't you just say you were stretching by touching your toes and instead of listening to your limits, you broke them and instead fucked up your back?",
            "Do not go to a chiropractor. They're quacks.",
            "If you really want to avoid odd looks I think something like you dropped your phone and tried to grab it before it hit the floor sounds less suspicious than suddenly deciding to do stretches/yoga/whatever.",
            "What exactly you were doing doesn’t matter. You arched yourself that put your head near you crotch. I’d venture to say if we all were self aware we do that every day: dropped my keys and bent over to pick it up. Bending over to tie shoes instead of kneeling. As you get older you’ll find that one quick movement can throw out your back if you’re prone to it... if I was in your shoes I’d say I was messing around with weights and did a stiff leg deadlifts wrong. Seems like it would create the same injury. \nAnd so you know there are many safer ways to masturbate I wouldn’t do that again. A lot beyond a strained back could happen.",
            "I'm sorry, but I've never laughed this hard at a reddit post in my fucking life. I'll take the ban. I just had to say it. \n\nMy advice is to just tell the doctor what happened. Doctor patient confidentiality. The best way to ensure accurate medical care is being honest with your doctor. You publicly told the internet without shame, so why not tell your doctor in private?",
            "Just tell them that you suck.",
            "Lmao sorry. I can just picture your parents walking in on you when your in full dung beetle position.",
            "I think you are overthinking it. Where ever you go, doctor, chiropractor, physiotherapist, they don’t have to know what caused the pain in full detail if you really don’t want to tell. If you shrug and say you don’t know exactly, they probably won’t ask you much further but will just move on to find out what causes the pain in this moment and how to solve it. \n\nI would personally go for reading, or being on my phone for a long time or for: “It’s a bit embarrassing, was trying to pop a zit in my neck.” Good luck.",
            "Tell them you were trying to do a somersault...\n\nInto your own mouth.",
            "Firstly can i just say you must be flexible af or your dick is huge because even if i wanted to it would be impossible for me to suck my own dick lol. Also I've never laughed harder at a post.\n\nBut honestly plenty of excuses. You mentioned your muslim so you were praying and your back starts hurting. You were bending down to pick up something etc. Anything that involves having to bend down works as an excuse. Yoga could be one for example.",
            "Don't visit a chiropractor. They do not have medical qualifications and often cause more harm than good:\n\nhttps://en.m.wikipedia.org/wiki/Chiropractic_controversy_and_criticism",
            "What the actual bloody fuck is this post? \n\nI would award you but I'm broke as hell.",
            "Yoga.\n\nAnd chiropractors are witch doctors, go to an chiropractic orthopedists or orthopedic surgeon.",
            "This was a traumatizing read for me",
            "I didn't realize it was even possible",
            "just say you were trying to SMELL your dick instead",
            "What the fuck is wrong everyone in the comments? How has no one asked what sucking your own dick is like?",
            "You tried to roll over and do a front flip in your bed. But you got stuck rolling midway on your back for a little while until you could get yourself off",
            "He's done it....he's the messiah!!!",
            "You know there's this little thing called lying. Or did you just want Reddit to know you could suck your own dick?",
            "Don’t go to a chiropractor go to an actual orthopedic doctor. \n\nThere might be chiropractors out there who aren’t total quacks but it’s hard to separate the wheat from the chaff. Too many believe in the magical power of “subluxation” (a completely evidence-free idea) I.e. “adjusting” your spine for everything from leg pain to the common cold. They are not MDs, they do not hold medical degrees. \n\nMuch of chiropractic care operates with a great deal of the placebo effect. Obviously plenty of people feel better after seeing one, but for my money I’ll take someone who went to medical school.",
            "I think at this point you need to just say the truth and report back here so we can get their reaction.",
            "Dude that's an achievement, you should be bragging instead.",
            "Sorry, i laughed my ass off, just be honest with a Doctor, not a chiropractor",
            "Just tell them the truth. Like the rest of Reddit, they won’t believe you anyway.",
            "Quit bragging.",
            "Please, for the love of shits and giggles, please ask this question on /r/askmen.",
            "They're not likely to ask. They'll ask where your pain in and try to assist you. Just say working out, but not sure what did it if they ask.",
            "Just lie and say you were sucking on someone else's dick.",
            "Say your back hurts, and maybe stop sucking your own dick",
            "If you’re embarrassed, ask for your parents to leave the room (if you can) and tell the truth. They won’t care; they’ve heard worse.",
            "how dafuq did you manage to do that??",
            "Dude, you could be totally honest and more than likely they are not going to give 2 fucks about the reason you're in there.  In fact, they'll probably think it's hilarious and you'll be a sort of like a celebrity to them.\n\nBut coming from someone who does visit a chiropractor regularly I can personally say that they are more concerned with healing and correcting your back than knowing why you're there.  As long as you show up on time and have money to pay for your visits then they will like you and treat you the same as any other patient.\n\nThey're not going to turn you down for coming in for something embarrassing. You think proctologists turn down a patient because they got something weird stuck up their butt? No, that's pretty much their entire job is removing embarrassing things from butts.  Really, these people just want to help.\n\nBut personally I think at this point making the decision to NOT get treatment would be the stupid thing to do.",
            "Just own it, the chiropractor will definitely suck their own dick so it won't be an issue.",
            "Just say theres no particular reason. It just began to hurt.",
            "Just tell them the truth. Nothing good ever comes from lying to a medical professional.",
            "Repost to /r/diwhy ?",
            "Tell them u were doing yoga (plow pose)",
            "Tell them you were trying to take a lug nut off a rim and it was seized. I had the same injury same way. Thats what I said",
            "https://youtu.be/e9wzX1Jc73I"
        ]
    },
    {
        "post_id": "qoxlkz",
        "author": "EsUnTiro",
        "title": "What does it mean when someone works a “925”?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/qoxlkz/what_does_it_mean_when_someone_works_a_925/",
        "score": 34340,
        "num_comments": 2387,
        "created_utc": 1636318496.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/qoxlkz/what_does_it_mean_when_someone_works_a_925/",
        "comments": [
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "They mean they work 9am to 5pm or a standard 8 hour work day.",
            "It’s “9-5” or “9 to 5” not “925” which means a job that keeps standard business hours in the USA, 9AM to 5PM.\n\n\nEdit: Woke up to about 700 comments, no idea why this particular comment got so controversially popular. Let me address the most common - \n\nYes, I have a job I’m a biologist. Thanks.\n\nYes, I specifically mentioned the USA. Imagine that. I’m American and I chose not to assume things about countries cultures I’m not certain of. If I had and I was wrong, I’d be getting shit about being a stupid American rather than ethnocentric (which is the correct terminology, not egocentric, you’re welcome come back any time for some assistance). No winning with you asshats. \n\n\n\nYes I realize that strict 9-5 schedules are largely outdated. That was not the question, however. I did, however, answer the question. Which was “what is a 925”.\n\nI, too, find the subreddit /r/boneappletea amusing. Hadn’t heard of the “Florida ceiling” one. Cracked me up. Thanks for that. \n\n\n( ͡~ ͜ʖ ͡°)",
            "[removed]",
            "Okay. I’m sorry but this is the cutest, most wholesome thing I’ve read all day.\n\nIt’s a shift. 9am to 5pm.",
            "Not \"2\" but \"to\" means working from 9 to 5",
            "[removed]",
            "925 is sterling silver. You’re thinking 9 to 5… that’s an average job.",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[deleted]",
            "So most office jobs in the US are 9 to 5, meaning they start at 9am and end at 5pm.",
            "[removed]",
            "9am to 5pm work hours",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "“9 to 5 job”…A basic work schedule consisting of an 8-hour work day that starts at 9 am and ends at 5 pm.",
            "Much the same as when you buy something \"241\".",
            "You know who you should ask? \n\n\nDolly Parton",
            "[removed]",
            "I thought this might be like the Chinese 996 which is 9am to 9pm 6 days a week.",
            "M-F 9am to 5pm",
            "[removed]",
            "It's not so dumb tbh. 9-to-5 is something that exists overly much in English, or maybe it's American expression? In my country I never heard expression like that, it's only thru using American media that I've learned about it, as an adult. It doesn't help that language had to give same pronunciation to two and to!\n\nThough it could be joke question too, given OP posts memes and it's 8 years old account. It's basic enough expression in English after all.",
            "[removed]",
            "(っ•́ ∀ •̀)˘̩っ...  A 9am to 5pm shift. Refers to working an 8 hour shift, the standard way to make a livin' in the US. At five days a week, that's 40 hours- any less could be barely getting by",
            "This has gotta be a troll",
            "🤣🤣🤣🤣 they work from 9am-5pm in general just a regular 8 hour shift nothing special but nothing less👍",
            "Or as it’s called these days a 929 and Saturday with no benefits",
            "It means you have to wake up too early to beat traffic, and br stuck in traffic for too long when you get off.",
            "You get up every morning from your alarm clock's warning\nTake the 8:15 into the city\nThere's a whistle up above and people pushin', people shovin'\nAnd the girls who try to look pretty\nAnd if your train's on time, you can get to work by nine\nAnd start your slaving job to get your pay\nIf you ever get annoyed, look at me I'm self-employed\nI love to work at nothing all day\n\nAnd I'll be taking care of business (every day)\nTaking care of business (every way)\nI've been taking care of business (it's all mine)\nTaking care of business and working overtime, work out\n\nIf it were easy as fishin' you could be a musician\nIf you could make sounds loud or mellow\nGet a second-hand guitar, chances are you'll go far\nIf you get in with the right bunch of fellows\nPeople see you having fun just a-lying in the sun\nTell them that you like it this way\nIt's the work that we avoid, and we're all self-employed\nWe love to work at nothing all day\n\nAnd we be taking care of business (every day)\nTaking care of business (every way)\nWe be been taking care of business (it's all mine)\nTaking care of business and working overtime\n\nMercy\nWhoo\nAll right\n\nTake good care of my business\nWhen I'm away, every day\nWhoo\n\nThey get up every morning from their alarm clock's warning\nTake the 8:15 into the city\nThere's a whistle up above and people pushin', people shovin'\nAnd the girls who try to look pretty\nAnd if your train's on time, you can get to work by nine\nAnd start your slaving job to get your pay\nIf you ever get annoyed, look at me I'm self-employed\nI love to work at nothing all day\n\nAnd I be taking care of business (every day)\nTaking care of business (every way)\nI've been taking care of business (it's all mine)\nTaking care of business and working overtime, take care\n\nTakin' care of business, whoo\nTakin' care of business\nTakin' care of business\nTakin' care of business\nTakin' care of business (every day)\nTakin' care of business (every way)\nTakin' care of business (it's all mine)\nTakin' care of business and working overtime, whoo\n\nTakin' care of business\nTakin' care of business\nWe be takin' care of business\nWe be takin' care of business\nTakin' care of business\nTakin' care of business\nTakin' care of business",
            "Once upon a time Americans worked 8 hour weekdays from 9am to 5pm.",
            "[removed]",
            "A regular 8 hour job",
            "9 to 5 \n\n9am to 5pm",
            "9-5 is a myth now. More like 8 to 5 or if you're unlucky, 8 to 6.",
            "Means a day job and is 9am to 5pm",
            "I find this funny having grown up in 925 California, but yeah. 9am to 5pm bud. Just a very standard forty hour work week salary schedule.",
            "[removed]",
            "And here I am working 727s.",
            "They start work around 9 and end at around 5. It is typically referred to a traditional office job",
            "\"9 to 5\" typically means you work a standard shift during normal working hours.  It isn't specifically 9-5.  My shift is 7-3:30.  But it's a time most people are working (roughly centered around noon) Monday through Friday.  I think it also typically implies office work.\n\nThis is in comparison to say someone who works at a grocery store, who might work:\n\n* Only 3-4 shifts per week\n* 6-7 shifts per week\n* Less than 8 hours per shift\n* More than 8 hours per shift\n* Hours during the early morning, evening, or night",
            "It means working 9 to 5....\n\nWhat a way to make a living",
            "[removed]",
            "Did anyone post that Dolly Parton song, 9 to 5?",
            "It means they work 9am to 5pm",
            "It’s the same as 25 or 624!",
            "Answer: It's 9 to 5 which is probably where the confusion comes in. Basically means an office job that's 40 hours a week that starts in the morning. It doesn't have to be exactly those hours. For example, my job is 8-4:30 and considered a 9 to 5 job.\n\nAlso as a side note, if you're asking because a content creator said something irresponsible and stupid like don't settle for a 9-5, ignore them. They're clueless. You can make an incredible living with amazing benefits doing something you love with a 9 to 5 job.",
            "such an innocent question that netted him over 30k karma haha",
            "[removed]"
        ]
    },
    {
        "post_id": "mgn56n",
        "author": "None",
        "title": "Is there a name for the phenomena of intentionally avoiding a product because of how aggressively it’s advertised?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/mgn56n/is_there_a_name_for_the_phenomena_of/",
        "score": 34191,
        "num_comments": 2766,
        "created_utc": 1617130439.0,
        "selftext": "I know I’m not the only person that does this, but if I see ads for something seemingly every time I turn around, especially if the ad is annoying I’ll go out of my way to avoid buying the product because I’m sick of seeing it everywhere and I’m not going to give a red cent to nagging advertisers, what do you call this?",
        "permalink": "/r/NoStupidQuestions/comments/mgn56n/is_there_a_name_for_the_phenomena_of/",
        "comments": [
            "I want to say Advertiser Fatigue.",
            "Spite",
            "Idk what’s it’s called but for me it’s Raid: Shadow Legends",
            "Nordvpnite syndrom",
            "[removed]",
            "I absolutely go out of my way to avoid over-advertised shit. I even downvote the ads on Reddit, does it make a difference? Nope. Does it make me feel better? Hell yeah!\n\nEdit:\n\nI'll gladly pay for services that are proven to work (youtube red), I haven't found an ad blocker that works on multiple platforms that meets my criteria yet.\n\n\nBenign advertising in a magazine or pamphlet is one thing, but 60 second ads on freaking youtube or full-screen spreads on allergy medicine on a website are cancerous. They make you wait to skip or design that fucking x so damn small that you \"accidentally\" click on the ad anyway, it's fucking disingenuous and crooked. They're grooming children to get used to buying shit they don't need so when they become adults it'll be second-nature.\n\n\nSure, ads make the company money, but maybe, just maybe, if your company *lives* off of ad revenue then maybe it shouldn't survive. Ads used to be about companies providing a service to solve a problem *and here's where to find us, etc.*, not anymore, now it's every youtube video (including first aid videos for fuck's sake), every shopping site, convenience app, etc. This is turning into *Idiocracy* levels of advertising. Brought to you by Carl's Junior...\n\n\nI don't mind companies making profit in the same way that I don't mind fighters making money off uppercuts and roundhouse kicks, but at least with fighting you can't use weighted gloves, certain attacks, and there's a goddamned referee to determine what rules to follow and when enough is enough, these fuck's have free reign.",
            "[removed]",
            "It's the same energy as when you're scrolling through tiktok and one starts with 'wait don't scroll until you watch' and I'm just like fuck you bye and have zero interest in finding out what they thought was so important.",
            "Yeah, it’s called spite \n\nI have a little note on my phone’s notes app called ‘these motherfuckers’ with companies who I see invasive ads for and I hate",
            "[removed]",
            "[removed]",
            "I will never forgive Charmin for forcing me to listen to songs about asswipes whenever I tune in to the radio. It's to the point where every time I see those technicolor bears I go ballistic",
            "The stupid “he went to Jared’s” commercials permanently cemented my decision to never go to Jared’s, ever. I like “spite” for the answer to your question.",
            "\"Overselling\" or \"oversold\" should cover it.",
            "[removed]",
            "I would call it \"Aggratising.\"\n\n\n\nEither as Aggressive + Advertising or as Aggravating + Advertising.  Either works.",
            "Fuck off raid shadow legends",
            "Every clean butthole bidet ad on here makes me want to go to bed bath and beyond and shit in the display bidets.",
            "Well now I'm not gunna-itis",
            "There's a London mayor candidate called Brian Rose and I have no idea who he is or what his policies are, I wouldn't ever vote for him just because of how many adverts of his I'm being spammed with on YouTube.",
            "1-877-KARS-4-KIDS\nK - A - R - S  cars for kids\n1-877-KARS-4-KIDS\nDonate your car today\n\n\"I never even thought about not donating my car until I heard that song\" - Titus Andromedon",
            "I won't switch to GEICO because it seems like an enormous amount of my premium would be allocated to their omnipresent advertisements.  I don't want so much of my money going to that.  I want my money going to coverage, should that be needed.  That's the whole point of insurance.",
            "There's *gotta* be a term of art for this.\n\nThere's just no way in hell the advertising industry isn't aware that once an advertisement reaches a certain level of ubiquity/obnoxiousness it starts driving potential customers away (e.g., I don't care if they're any good, I will never buy a pair of Raycons (ubiquity) and I would sooner drive my car off a cliff than donate it to \"Kars 4 Kids\" (obnoxiousness)). I'd be willing to bet there's been much ink spilled regarding how advertisers can get as close as possible to this threshold without crossing it. (I'm imagining a graph with advertising quantity on the x axis and advertising effectiveness on the y axis, the y value steadily increasing as x increases, and then all of a sudden dropping off a cliff).\n\nAnyway, I do the exact same thing. I like to think of myself as a relatively informed consumer, but I'll still catch myself, before I do my research, kinda knee-jerk \"defaulting\" to a brand I've seen in advertisements (say what you will about marketing fucks, the shit works)... but if I feel like I've been \"bombarded\" with your ads, I will go out of my way to avoid your product.\n\nSimilarly, if you send me one of those \"we noticed you were browsing this particular item on our site for 10 seconds, you should come back and buy it\" emails (looking at you Home Depot), fuck you very much. Does anybody know what these are called (I'm not talking about abandoned cart emails)? What kind of inbred sociopath ever thought those were a good idea? (Though I guess they must work on some people, right?). There's a very, *very*, special place in Hell for whoever came up with this sales tactic, and a slightly lesser (but still special) place in Hell for whoever uses it. Send me one of those and I will do my best to *never* buy anything from you again (sadly in the case of Home Depot this isn't 100% practical), and at the very least I'll buy that particular product (if I was going to do so at all) somewhere else.",
            "Anti-tisement. I just made it up, but i think it'll work.\n\nEdit: added hyphen to make sure dyslexics don't think I'm a nazi",
            "Idk, but would you like to try YouTube Premium free for a month?",
            "It’s called the YouTube premium phenomenon",
            "Fuck Those Spamming Assholes ...ism?",
            "Grammarly",
            "Voting with your pocketbook?",
            "I wouldn't buy an extended warranty now if a crackhead built my car.",
            "liberty liberty libertyyyyyyyyyyyyy",
            "spite",
            "Head On! Apply Directly to Forehead!",
            "Yeah, I call it Liberty Mutual go fuck yourself.\nFucking Emu\nFucking Wet Teddy Bear Guy\nNone of it's funny\nI will never buy any product from them",
            "I get so many anti vaping ads I'm gonna start fucking vaping",
            "The Bloomberg effect.",
            "Answer: I'm a marketing student who's dissertation touched on this so can give a bit of background. Here's a slightly edited version of an except from my undergrad dissertation. I apologise for the shitiness of my writing, English is my first language, I'm just a moron.\n\nTLD at the bottom.\n\nWhen you have an over-abundance of advertising bombarding the consumer, much of the content is filtered out or resisted (Rumbo, 2002). Academics have offered a variety of reasons for the phenomenon, and so they require an analysis to determine relevance to online media. Mangleberg & Bristol (1998) posit the socialisation model and that advertising resistance is learned through peer influence and parents. Ha (1996) offers three dimensions of advertising clutter that affect resistance that all require individual analysis: quantity, competitiveness and intrusiveness.\n\nQuantity has been researched extensively by many academics over the past few decades, the vast majority of studies come to the same conclusion: that in the modern age of advertising, consumers are increasingly bombarded with an overabundance of advertising material. So much in fact that consumers are simply not able to process all of it, thus leading to much material being subconsciously filtered out. Also known as overload theory; the effects of the sheer volume of advertising messages directed at consumers has been debated by many academics (Malhotra et al, 1982) (Edmunds & Morris, 2000) (Eppler & Mengis, 2004) (Lee & Lee, 2004). Most agree that an increase in information available leads to better choices, however there has also been some evidence to suggest that an increase in brands may lead to poorer choices. The latter has been further augmented with parallel studies into consumer attention. Known as selective attention theory, Smith & Buchholz (1991) suggest that consumers have limited mental capacity to expend on focussing attention and so will not pay attention to advertisements as they are not seen as relevant, thus, should adverts wish to gain consumer focus, they must stand out as more relevant or important than other adverts. The nature of quantity therefore is somewhat paradoxical for the consumer. The more your own advert is shown, the increased likelihood of consumer attention and therefore retention, however the more adverts trying to achieve this, the harder it is to stand out resulting in less retention. This was later complemented by Ha & McCann, (2008) who demonstrated that increased quantity of adverts leads to consumers forgetting a higher percentage of adverts (recall/retention) and the poorer attitude of consumers towards the media platform. (Riebe & Dawes, 2006).\n\nSince the advent and subsequent exponential uptake of the internet intrusiveness has also been studied in greater detail (Li et al, 2002) (Cho & Cheon, 2004). Li et al defined intrusiveness thus:\n\nIntrusiveness is a perception or psychological consequence that occurs when an audience's cognitive processes are interrupted. Therefore, ads within programming or editorial units are not themselves intrusive, but rather, the ads must be perceived as interrupting the goals of the viewers to be considered intrusive.\n\nThey also found that intrusiveness led to irritation and negative feelings towards the advertisement. This could indicate that the advertisement was not processed by consumers cognitively and that consumers indulge in ad-voidance behaviours as described by Elliot and Speck (1998).\n\nCompetitiveness was defined by Ha & McCann (2008) as the degree of similarity between advertised products and advertising messages in a pod or group. Competitiveness does not appear to have been taken up by the academic world in the same way as quantity and intrusiveness, however it does have some basis within perceptual grouping theory (Pomerantz 1981), where items that are perceived to be similar are grouped together subconsciously and no single item stand outs to the consumer. For example, if you have a magazine with many adverts for watches then it is unlikely you will remember a single watch brand, however if you have a magazine with a single watch advert, a single jeans advert and a single suit advert you are more likely to remember each individual brand.\n\nTl:dryeah, advertising resistance has been heavily studied by academia. Deliberately avoiding a specific advert is known as ad-voidance, we do it subconsciously primarily because adverts intrude on what we were doing, however we can also do it consciously because a particular advert has annoyed us.  \n\n\nEdit: dunno about anyone else but the term ad-voidance amuses me. So Punny",
            "Raid shadow legends sponsored this post",
            "I immediately thought of Grubhub",
            "Legal gambling. So tired of the commercials",
            "Boycott",
            "Oh, I also do this with bad adverts. Doesn't make sense? Fuck your brand! Actor puts emphasis on wrong word in their one line? Your brand is dead to me. Think you're being clever? Fuck you, your brand and the marketing hack you rode in on. Say the product name more than twice? I've fucking deleted it from my mind already. \n\nI am very full of spite and rage about advertising.",
            "YouTube premium",
            "Not really an answer, but I fucking hate those creepy Charmin bears, inspecting eachother's asses like it's a normal thing to do.",
            "It is called psychological reactance. The concept was developed by Dr. Jack Brehm to describe a response to anything that threatens freedom of choice. This also explains why we want to walk on the grass when we see a 'keep off the grass' sign or buy impulse items at the checkout aisle in the grocery store. Basically, aggressive ads make it clear that we are being manipulated to buy something against our will, which evokes reactance and a motive to act against the source. Or, of course, I could be totally wrong about that!",
            "Ad nauseam?",
            "I don't know but I like to approach the issue HEAD ON APPLY IT DIRECTLY TO THE FOREHEAD HEADON APPLY IT DIRECTLY TO THE FOREHEAD HEADON",
            "When referring to TV/film/books, [TVTropes calls it \"Hype Aversion\"](https://tvtropes.org/pmwiki/pmwiki.php/Main/HypeAversion); the more people talk something up as being \"the best ever\", the less you want to watch it or read it. I suffer from this quite a bit.",
            "Me never goin youtube premium, no matter how often they ask!\n\nNEVER!!!",
            "Dr. Squatch cold-pressed natural soap for men",
            "I don't trust products that have a huge emphasis on advertisement, like Raycons or Raid Shadow Legends, cause they usually suck ass\n\nI call it the \"you could have spent the advertisement money on improving the fucking product you're trying to sell me, you dimwits\" phenomena",
            "Some time ago, I was watching Netflix on my PlayStation on the account of my gf. When i started my profile, there was a large image of promoting the Witcher. I was not interested so I checked for something else to watch. This happened again for a few days.\n\nThen, they stepped their game up and showed me trailers which consisted of clips. I chose something different to watch that day, like I said, I was not interested in watching the Witcher. This happened again for a few days.\n\nThen one day when I logged in, something new was happening. Instead of the normal interface, there was an image promoting the Witcher, covering my whole screen. I pressed circle to exit and checked for something else to watch.\n\nAfter a week or so, I started Netflix again. And I swear to god the Witcher episode one just started playing. Without me choosing to play it, that actually happened. I turned the app off, deleted it from my PS and to this day never watched something on Netflix again. And I never will.",
            "I 100% do this. My partner and I work in the advertising world, and all we do is judge ads in public. See a good creative one? We are instant consumers. See bad ones? And we ban them forever. \n\nAlthough, it sucks when we work on a brief for a long time and eventually get sold on our ideas or simply seep in them long enough that we want buy the product. So much for being critical consumers lol.",
            "Super Satiation?\n\nFucking MANSCAPED...can't escape this company on youtube. Their ads used to be cute, but now it's just so annoying.",
            "ToYoTaThOn!!!",
            "Discovery+ drives me crazy.  I might’ve considered it but the ads are constant.",
            "Paradoxical Advertising Response. Too much advertising can put you above PAR.",
            "YouTube Premium this post is for you",
            "I need the name for when someone recommends you something so passionately it just makes you want *nothing* to the ever do with it ever.",
            "I've just called it over advertising, happened to me with the show This is Us, back when it was first coming out in Australia, they had an ad for it on every single fucking commercial break in the summer cricket. And seeing how my dad has to religiously watch that 24/7 I heard that fucking 7 years song at least 10 times a day.",
            "The Head-On Theory.  You apply it directly to the forehead.",
            "I can't stand any product that ends in -ly. Womply? Quibly? You can fuckly right offly",
            "Reactance.\n\n\"Reactance – the motivation to regain a freedom after it has been lost or threatened – leads people to resist the social influence of others.  \\[...\\]  In general, people are convinced that they possess certain freedoms to engage in so-called free behaviors. Yet there are times when they cannot, or at least feel that they cannot, do so. Being persuaded to buy a specific product in the grocery store, being forced to pay tuition fees, being prohibited from using a mobile phone in school, and being instructed to perform work for the boss are all examples of threats to the freedom to act as desired, and this is where reactance comes into play. Reactance is an unpleasant motivational arousal that emerges when people experience a threat to or loss of their free behaviors. It serves as a motivator to restore one’s freedom. \"\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4675534/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4675534/)",
            "Ad fatigue is the term in the industry",
            "I don’t know, but can tell you that anyone who says “He went to Jared’s”, damn sure isn’t talking about me.",
            "[Hype Aversion ](https://tvtropes.org/pmwiki/pmwiki.php/Main/HypeAversion)",
            "I hate the radio commercials for Kars 4 Kids on SiriusXM. As in stabbing my radio button to change the channel or turn it off quickly. Any jingle that turns into an earworm makes me crazy.",
            "HEAD ON!! APPLY DIRECTLY TO THE FOREHEAD!!\n\nHEAD ON!! APPLY DIRECTLY TO THE FOREHEAD!!",
            "I dunno, but the venal psychopaths of r/marketing will defend the practice, claiming any brand awareness is still brand awareness. It’s insane over there.",
            "Common sense.\n\nEspecially for household items and daily needs. \n\nA company that doesn't do advertising can offer products of the same quality much cheaper.\n\nIf you ever buy something that is advertised you just pay upkeep for beeing manipulated.",
            "I don't know, but if there isn't one currently could I suggest \"The Grammarly Effect\"?\n\nIt's like the Streisand or Mandela effects, but for this exact phenomenon",
            "I'm still mad about how over-advertised orange is the new black was when it first came out",
            "I give negative feedback on products/services solely because they keep asking me for feedbacks.",
            "I feel that, I will never buy those Dr Sasquatch soaps they fucking shove that shit down my throat whenever I try to watch the youtube",
            "I am exactly the same way. Also, avoid all things Kardasian for the same reason.",
            "Atheism.",
            "Docker's once ran an ad campaign with an annoying song, capped by an ad which ended with \"Buy our pants or we'll keep playing this song.\"\n\nI don't know the word you're looking for, but I have sworn never to buy their pants, and I encourage you to also boycott their pants for all eternity. It's not like there aren't other pants.",
            "I even mute my phone when an unskippable ad hits Soundcloud or Youtube. I hope their data mining shows them my phone at 0 volume.",
            "It'll be a cold day in hell before i ever use Nord vpn.",
            "It's called common sense",
            "HEAD ON",
            "Head on syndrome.",
            "[deleted]",
            "I always click on the ads so they have to pay for my click but then don’t buy the thing. I’m a busy working mom obsessed w not wasting time but somehow this just makes me feel like i have some control.",
            "LIBERTY, LIBERTY, LIBERTY!",
            "There should be a word for this so they can teach it to marketing students and leave people the fuck alone",
            "Me when i see the youtube premium ad 100 times a day",
            "[deleted]",
            "If i see a facebook ad for something that is just some rebranded banggood gizmo, ill look up the real price and post it on their ad. (which has a link to their special web site with jacked up price) sometimes they block me which saves me some work.",
            "liberty liberty liberty....liberty"
        ]
    },
    {
        "post_id": "pq88wk",
        "author": "Brainpry",
        "title": "Because of a tik toc trend, my sons school closed all the bathrooms. Is this legal?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/pq88wk/because_of_a_tik_toc_trend_my_sons_school_closed/",
        "score": 33917,
        "num_comments": 4507,
        "created_utc": 1631911021.0,
        "selftext": "My son just texted me saying he had to poop, really bad and that all the bathrooms were locked. I didn’t believe him, but when I called the school he was telling the truth. After arguing for a while, they were willing to let him use a restroom in the office, with administrators around him. My son is a good kid, has a 4.0, and is in 2 honor classes. I need to know if this is legal, and what I can do about this?",
        "permalink": "/r/NoStupidQuestions/comments/pq88wk/because_of_a_tik_toc_trend_my_sons_school_closed/",
        "comments": [
            "Lots of schools are doing this.\n\nThey cannot deny students the ability to use the bathroom, but they can do exactly what they are doing.\n\nIt's not even a new thing to do. I was in high school in the late 90s, and my high school locked every bathroom except the one next to administration because kids wouldn't stop smoking in them.",
            "As some one who has bad IBS-D this would be my biggest fear. Legitimately wouldn’t have gone to school…",
            "I’m so glad I’m not in school right now. Between social media and covid this would be a living nightmare for me.",
            "Schools can legally close bathrooms down TEMPORARILY if they cite that it is for student safety or repairs.",
            "School janitor here!! We've locked all of our restrooms after catching someone pulling this crap. Now all 7-8 grade bathrooms are locked, when a kid needs to use them, I'm called on the radio to unlock and stand guard outside while the student uses the restroom. One student at a time. Then it's checked for damage, and I'm sent on my way... During the recesses, the restrooms are open with about 143 yard duty aides, the principal, and the vice principal watching guard.\n\nThe kid who got caught... I've had to walk him around during the recesses making sure he picks up trash and rakes bark.\n\nTotal waste of manpower, but what're you gonna do?? As soon as the bathrooms were locked we had to put locks on the water spickets, because those suddenly became the target of destruction.\n\nSmh.",
            "When I was in middle school, the principal ordered all restrooms to be closed except during lunchtime, because two kids were caught smoking in them. This was really bad for me because I had very heavy periods. One day I bled through my pants because I couldn't find a janitor to unlock the restroom. My dad complained to the school board that it should be illegal to close restrooms, and they told him it was within the principal's right to do so. But a nice teacher did give me special access to their restroom after that.",
            "I work at a junior high. We had a whole staff meeting addressing this trend. It’s called devious lick. Basically a rebranding of theft as cool. Plus they post the evidence of their theft on tik tok. Brilliant.",
            "My old high school (years years back) used to close some bathrooms due to kids smoking cigarettes and weed, using them as a fight rings, selling drugs. But they never closed all of them, at most I would have to walk to the other side of the building and pray I made it in time.\n\nKids are so fucking stupid, they always ruin it for the other decent kids.",
            "My school is thinking about closing one of our bathrooms (our only one for junior high) and making us go to the office bathroom where all the supervisors and teachers are bc of the “devious lick” trend that was done making our 60+ old janitor cry.",
            "What kind of tik toc trend would warrant closing of the school bathrooms if I may ask? When I was a kid someone got stabbed because of pokemon cards and they didn't even close the bathroom, just banned pokemon.",
            "I don't have an answer but the highschool I work at today has 1 functioning toilet left. They want to keep it open of course, so the caretaker was told to take out any paper towel after the last cleaning (minor vandalism).\n\nIt should also be noted, not trying to offend anyone, but any kid can be **that** kid. Grades don't always reflect attitude, and every parent wants to think that their kid does not have big faults.",
            "They did this because students are stealing from the bathroom\n\n\nToilets, urinals,doors,sinks,soap dispensers  etc idk how they expect students to go all day with no bathroom though.....\n\n\nThis new trend on tiktok is students \"hitting devious licks\" which is literally just stealing.\n\n\nSorry your son was treated like that",
            "A lot of schools have done the same due to people posting devious licks content on social media.    Unfortunately there might not be any legal consequences.",
            "My school is starting to do this, but they haven't completely shut down the restrooms. They made it so that only one gender bathroom is open at each location (We have like 6 different bathrooms of varying quality around the school). My school is structured so that the math and science classrooms are one one side of campus and the english and history classrooms are one the other side with everything else in between. If you're a girl on the english and history side of campus, you might have to walk all the way to the math and science side of campus to use the restroom and vice versa. It also changes every day. I'm guessing this is so they can more easily monitor the restrooms without having to make everyone find a security person or janitor to open the restroom for them, but really all it does is make us walk more.\n\nI hate this stupid trend of kids going around and fucking up all of the school facilities. \n3 classrooms were close for cleaning for 3 days after kids broke in and sprayed everything with a fire extinguisher (one of those was a computer lab/the robotics club which I'm a part of and I would have been so pissed if they had broken our robot). \nOne teacher got all of her stuff stolen from her classroom (not just personal belongings but most of the stuff in her classroom) and she was completely destroyed since she was already having an extremely hard week.\nthe hand sanitizer dispensers in the classrooms are getting stolen and so are the water bottle refilling stations. \nThere's probably more that I haven't even heard about yet. At this rate students won't even be allowed on campus after school outside extracurriculars like we're some kind of elementary school. Oh yeah, I forgot to mention I'm a high schooler.\n\nSorry, I needed to get this rant out there because I'm so tired of this\n\nedit: grammar.",
            "Wtf does your kid having a 4.0 GPA have to do with access to a toilet? The stupid kids have to shit too.",
            "I keep seeing people talking about the TikTok bathroom trend. I'm old. What do these idiot kid keep doing that's shutting down bathrooms?",
            "Teacher here. Kids jacked up a few of our bathrooms so most of them were locked today.",
            "In addition to locking bathrooms my kids' school is offering $40 cash rewards + fastfood bought by principal at lunch break to turn in students videos etc of theft and vandalism. \n\nI imagine there could be some drawbacks for \"snitching.\" Told my kids to just mind their own unless something threatening safety etc.",
            "Tik Tok is definitely toxic.",
            "I would think they should be able to allow a student to use a restroom on request, with a quick inspection afterwards. But you'd have to check the laws in your jurisdiction to see what schools are required to provide.",
            "Maybe the next tic toc trend will be taking shits in front of locked school bathroom doors.",
            "Just want to chime in to say that kids without 4.0s deserve to shit too…",
            "He(or another student) is going to take a shit on the floor and think it’s funny. \n\nSource: I was once a teenage boy",
            "Teacher here. This is a thing.",
            "Kids are literally removing toilets from the restrooms. I don’t know how the fuck they’re doing it, but this is what schools have to resort to in today’s climate. If they let your kid use a restroom, then I very much doubt they did anything illegal. Kids need to stop vandalizing schools.",
            "How sad, all suffers for the few.",
            "Where I live in MA, the Department of Elementary and Secondary Education requires [by law](https://www.doe.mass.edu/lawsregs/603cmr18.html?section=04) that \"day schools shall provide and maintain one toilet and sink for every fourteen students\". So yes, here that would be explicitly illegal. Not a lawyer, but that's what it says, yeah? Personally I don't see why it would be different anywhere else.",
            "Dumb asswipe kids ruined it for everyone else. Hope the TikTok was worth it, because you've managed to somehow make school more miserable for your classmates",
            "They’re doing it because stupid kids keep stealing toilets and shit.. it’s probably legal. Blame the dumbass kids. I don’t know why they wouldn’t just put porta potties outside though.. not like they’re gonna steal that 😂\n\nNothing about your kid changes the reason the school did it though, and I have no clue why you’d think it would.",
            "Unrelated, but I like how you mentioned your son has 4.0 gpa and is in 2 honor classes when it was unnecessary lol. I suppose its just normal dad stuff to brag about their kids if they are smart.",
            "I JUST LOOKED IT UP. \n\nIS THAT WHY PEOPLE HAVE BEEN CLOGGING EVERY FUCKING TOILET IN THE RESTROOM HERE?????",
            "Tiktok is a fucking disease.",
            "I don't think the 4.0 GPA and 2 honors classes is relevant information here lmao",
            "I understand that they wanna avoid destruction of property, but trapping kids in a building for 8 hours and not letting them use the bathroom? That's absurd.",
            "While this is a legal question towards the school, I seriously hope that the kids that are engaging in such wanton property destruction and theft aren't just being forgiven with \"kids will be kids\" and \"this is all peer pressure.\"  If they are causing that much damage and stealing shit from teachers, and are stupid enough to post videos incriminating themselves, then they should be arrested and prosecuted.",
            "They would have to let them use a faculty/single person restroom and someone check it afterwards due to the incredibly stupid shit some kids are doing on TikTok. Is it legal? Im not sure but it’s probably not ILLEGAL and they’ll use that excuse.",
            "My god dude it’s getting so annoying. Fuck tik\nTok it’s so annoying",
            "Posting his gpa like it matters 😂",
            "wtf? Tik tok is fucking cancer.",
            "What's the trend? Peeing and pooping all over the bathroom?",
            "I actually don’t blame the schools to much. This is the dumbest trend on TikTok and the damage in some of the videos is ridiculous. You wouldn’t be able to use the washrooms anyway with the amount of damage. So much money to fix these bathrooms up",
            "As someone who always had utis and kidney infections this infuriates me! Someone could die from holding in their urine :(",
            "At my daughter's H.S someone stole a soap dispenser. In the school administrators minds, this means the kids should do longer have soap. During a PANDEMIC! I told my kid to take pics on Monday for proof, but I am about to go nuclear! I don't care if they limit bathroom use or make people be accompanied to use the bathroom, but you don't keep the bathrooms open but just take away the soap!",
            "Man the US public education system is like little jails for little jail people to learn to become better prisoners and things.",
            "dumbass devious licks",
            "I am so sick of Tick Tocks shit…",
            "Everyone deserves to use the restroom no matter their grades. This is awful. And parents should pay attention to their kids' Tik Tok accounts and ban them from social media when they ~~pull pranks~~ commit crimes.",
            "Pretty sure it's illegal to deny a child the right to the restroom in a school.\nIt's mostly a power move for the teacher to grant permission.",
            "Man shotgun approaches like this are dangerous. Faculty should probably use their manpower to catch the trouble makers. Because in all honesty if all of the sudden I’m not allowed to use the restroom even though I did nothing wrong, I would want to vandalize in retribution lol. Lock the bathroom? Alright I’ll just shit in the water fountain.",
            "No at least where I live it isn't. A few years ago students were being denied bathroom breaks during class and urinary infections started happening  forcing the schools to redact class bathroom break restrictions.\n\nAny place that you would be for over certain amount of time is required to have bathrooms of some kind. \n\nThis is a lawsuit waiting to happen. No one can hold a bladder for 8 hours with out discomfort or medical repercussions. Especially children. Ask the school how they plan to remedy this immediately and if their answer is \" not going to\" then let them know you will be searching for a lawyer regarding basic human rights concerning minors. Many lawyers offer free consultations so you won't be out any money if where you are allows lack of bathroom use for whatever reason.\n\nEdit to add, make sure the school is actually denying use of bathrooms or if it's like those places where you just have to get a key or code to enter.  Of he just needs to ask for a key then ....well then ask for a key.",
            "The problem is not TikTok but the toxic narcissistic culture of the United States"
        ]
    }
]