[
    {
        "post_id": "qonpbp",
        "author": "YouThinkYouCanBanMe",
        "title": "Are NFTs like beanie babies where it's something that a large collective of people have decided it has value and scarcity but actually it doesnt?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/qonpbp/are_nfts_like_beanie_babies_where_its_something/",
        "score": 15611,
        "num_comments": 2024,
        "created_utc": 1636288733.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/qonpbp/are_nfts_like_beanie_babies_where_its_something/",
        "comments": [
            "It’s financial musical chairs, everyone knows it’s bullshit but maybe you can get in and not be the sucker holding the bag when the music stops",
            "an NFT is like someone giving you the receipt that says that a beanie baby attached to that receipt exists.",
            "No...\n\nBecause at the end of the day is you bought a beenie baby you have a beanie baby, but if you buy an NFT all you have is a certificate.",
            "[deleted]",
            "Unrelated, but why didn't Beanie Babies blow up in value and never really went anywhere? I figured they'd have collector value, given it's a physical item and there are many different variations. Not to mention some can be quite old.",
            "Not an NTF, but similiar to Beanie Babies... Coca Cola themed items, bottles, etc. Especially special edition/holiday bottles.\n\nWhen I was little my dad was convinced Weebles would be worth a lot in the future. I remember we had tons of those, not sure if people still collect them or not though.\n\nEdit: Pokemon and Yu Gi-Oh cards",
            "An NFT is a non fungible token. It is a crypto currency. \n\nTo define non fungible let’s define fungible. A fungible currency is one in which each unit of currency is the same. For example I have $1 you have $1 if we trade dollars we both have $1 and for all intents and purposes they are the same. Similarly with Bitcoin. If I trade you one of my bitcoins for one of your bitcoins they are both the same thing. \n\nA non fungible is when you have two things that are not the same. For example you and I both have a dog. But if I trade your dog for mine Then the trade isn’t the same my dog is MY dog and is not equivalent to your dog. \n\nNow let’s talk NFTs as they stand today. They are often used as proof of ownership of a digital good. Often art is the common example, in which you buy the original of a piece of digital art and the NFT is proof of ownership. While art and money laundering and rich getting richer is a cynical but valid take. However the notion of a digital certificate that is completely unique is definitely very useful from a tracking perspective be it for ownership of property, or other large assets. Having an open source digital repository of ownership could be great for accountability and tracking. Again authenticity is more typical in luxury items so one could use the NFT and associated meta data to have a transparent history of the goods over time eg this Rolex was shipped from the facotry, to a store in NY and now it is in your name as the buyer. \n\nAnother potential use case is in gaming to combat duplicate items. Given NFTs limited supply and unique nature. NFTs May solve that by giving custom or rare items NFT status. \n\nNow while NFTs May not be the best answer in all these use cases it is still an emerging technology that has some quirks to be worked out. I think of nothing else it is another tool in developers tool box when it comes to solving problems. Just like how a hammer might be able to fasten two board together we also have screws, joints, and rivets.\n\nEdit:\n\nAn additional thought in relation to NFTs re: digital goods. \n\nOften when you buy a digital product eg a video game on steam, or a song on iTunes you do not own the item. You are buying a license to play the song through the provider. This means if the service vanishes tomorrow so do your rights and support for the game. Your rights are at the mercy of Steam, Apple, Google etc. however if every time you bought a digital product you received an NFT you would actually be the legal, traceable owner of the product. This would intrinsically give you more rights over the product thanks to you now being the owner. This would then (region depending) give you certain entitlements in relation to longevity, and support for the product. \n\nAgain NFTs definitely are not the only way to solve this problem or any other problem I mentioned but as stated before it is another tool in the toolbox which may suit in the right circumstance. \n\nI have worked with NFTs, Crypto and smart contracts in the past and would be happy to add to this or answer any questions.",
            "Unlike gold, or beanie babies, NFT's have no intrinsic value.  There's nothing you can \"do\" with them, other than launder your crypto, which is the primary reason they exist.",
            "NFTs are an attempt at digital scarcity.  Raises questions about art and ownership in the digital world.  It also cuts out the middleman between the artist and the art consumer/collector.  At the moment NFT mostly seem to be used for visual art, but the technology doesn't have to be limited there.  NFTs could be applied to a variety of digital assets like music, video games, movies.  An artist can directly sell their art to the consumer and profits off of future transaction of their art if traded again.",
            "NFTs are like the email receipt that you own that Beanie Baby you bought but your kid took it to daycare and it got thrown into the toy box and all the kids play with it, but you still have the receipt stating you're the owner of the beanie baby.",
            "For now? Yes. In the near future? Not so much.\n\nThink about this: When you buy a video game these days, you are usually doing so without a physical disk. You are simply paying for a digital license, and that license is held and administered by the merchant (Steam, Sony, etc). You used to own a physical copy of the game on a disc or cartridge that you could play any time as long as you have the proper hardware. You could sell that game when you were done or if you decided it wasn't for you. \n\nSo if, today, a video game license were to be distributed as an NFT, how would you \"owning\" a game on Microsoft or Sony's servers be any different than an NFT? Outside of one license being held on an immutable public ledger and the other by a single party that has financial interest in maintaining absolute control.\n\nNFT also opens the door to reselling digital assets. If you play a game and finish it, you could resell it. Not only that, but NFTs provide a method to cycle royalties to the creator on the sale of used games. This has been a locked-off market to the real creators until now.\n\nNFTs can also represent in-game items. In MMOs like WoW, there have been vibrant in-game marketplaces and economies for YEARS now. Gold farming, full account sales, flipping items, people have been making real FIAT money for digital goods for a long time now. The only difference now is that, instead of these balances being held on a private server, they are held in the blockchain, providing a public method to certify provenance in perpetuity.\n\nThis is just one market where NFTs stand to change the way the market operates as a whole. Think about the other places where having an immutable public ledger that can certify ownership would be useful. Stock in a company could be issued as NFTs, for one. There is so much that happens behind closed doors in our financial securities system, and blockchain stands to bring all that into the daylight.\n\nNFT is an exciting technology but it is incredibly young. People are just confused about what it is. Speculative investment in NFT is a fool's game right now in my opinion; this aspect is absolutely Beanie Baby-esque, but that doesn't mean that the underlying technology is without merit.",
            "Well, if value isn’t decided by what most people will pay for it, what is it decided on then? My phone might *actually* be worth $50 but I bought it for $700, everyone else who bought it also bought it for $700, so it has a value of $700",
            "We are literally making shit up to waste our money on.",
            "Kind of like high-end art. The people who buy it and to an extent the action platform dictate the price. They really have no intrinsic value, at least beanie babies can claim material cost as a base level.",
            "We arbitrarily assign value to everything.",
            "Yes but that’s basically how the economy works. Money has value because people think it has value. NFTs will have value as long as there are people who think they have value",
            "Big difference is that beanie babies were made by one company, whereas NFT can be made by anyone. There isn’t one guy that can just decide how many NFTs get made one day.",
            "NFTs are GROSSLY misrepresented in their potential right now.\n\nPeople are going wild over these silly pictures that artists are whipping up.\n\nWhat the real potential taps into is digital trading cards that have actual scarcity. In game tradeable items that ONLY you own. And the list goes on from there.\n\nEven aside from recreation, think of property ownership. You can “tokenize” your assets. Think of cars or real estate. Instead of having a paper deed or title, you can own the NFT which holds all the ownership and registration details. Passing ownership along to someone else is as simple as “giving” the token to someone else.\n\nWe are just hardly, BARELY, scraping the surface of the potential for NFTs",
            "NFTs are complicated. \n\nRight now, yes, they're basically all beanie babies - in fact, probably worth less than beanie babies, as they don't even have a physical footprint. They're a bonafide scam. \n\nThe *real* big thing about NFTs is their potential, not their current use - NFTs could allow resale of digital games and assets as if they were physical ones, and could even send a bonus back to the original devs/artists upon trading. It'd be a big step forward for a few entertainment industries and would help cut down on the amount of abusive publishers and labels out there by allowing more ease of access to revenue from sales.\n\n...probably not gonna be a thing for a few more years though, so for now, yes, your understanding is basically correct. Stay away from NFTs.",
            "Nfts are stupid",
            "They are like if beanie babies were attached to planet destroying machines.  NFTs and cryptocurrencies consume more electricity than entire countries.\n\nhttps://www.wired.com/story/nfts-hot-effect-earth-climate/",
            "It's just like art. Just another way for rich people to launder money.",
            "Pretty much. That's not actually as big a problem as people think though. \n\nWhat gives a dollar bill value? The paper? The ink? The little strip inside? It's the collective agreement and use of it around the country and world. That's it. Because it's used and we say X dollars buys Y product, it retains that value. Exactly the same thing just more credibility and adoption. \n\nIt goes further though. What about debt? Why is that something we pay? Is that business or bank or person benefitting today from money we owe later? No, not really. It becomes an imaginary branching stack. 5 people owe 50k to a business, that business can spend 250k now and have that debt to a supplier. Which goes on to buy the things that keep them operating, accruing more debt. So where's the original money? Is Amazon operating off the billions we're buying today for things they'll do in a year? Kinda. But yes it goes even further. What if we don't pay? Say you go broke and declare bankruptcy and you don't owe that anymore. Does Amazon get hurt? No of course not. Not because of scale (that's a mental trap argued by some in finance). They don't just absorb your disappearing debt, if it's significant they'll get it from passing it onto their taxes in the form of tax breaks. So where does THAT come from then? The government just doesn't take those taxes and either prints more money (which has no source, just literally increasing the supply until the amount is offset by the new amount in existence) or it increases the government debt. So where does that come from? Last one I promise. It borrows from future GDP. So if we produce 20 trillion in a given year you say \"well 2 trillion of 2028 belongs to 2021 now\" and write it up as a debt. \n\nIt's completely imaginary. How do you determine future GDP that hasn't happened? You just make it up based on prior performance. So in 2028 do we cut our budget by 2 trillion to get square? Of course not. We borrow from 2035. And what happens if we just say we're not going to pay ourselves back and that debt is gone? Nothing. It'll hurt the value of the dollar (or strengthen it depending on your economic view) because we say it does, but not any tangible reason. \n\nSo why that wall of text if we're talking NFTs? Because beanie babies, crypto, and dollars are all as valuable as we agree they are. Bitcoin could be 5 million per coin, it could cost 40 trillion dollars to buy a loaf of bread. And nothing is created, no service administered, no tangible asset used or destroyed to say a coin is worth 5 million or anything. \n\nMoney is imaginary so that we aren't trading cows for shoes anymore. It simplifies exchanges but with no gold standard all you can rely on is GDP and that's made up based on the value of the dollar it influences. Closed loop that we just make up as we go. \n\nSo if you think NFTs will get wide enough adoption to be valuable, knock yourself out. I personally think we're decades from that when alternate forms of dollars still haven't caught on. People think pretending there's a finite resource makes it valuable. But why not slap millions of unique codes on a given NFT? Then your Spongebob NFT is exactly like mine.  And if enough of that happens all you've done is redesign the dollar. Closed loop. \n\nI know you weren't looking for all that but it explains anything claiming to be a new way to buy or sell or invest. It will always come back to the same ideas. \n\nAnd that's my post-scarcity 101 lesson. Anyone interested in more should NOT try to argue with me about using up nickel or trees or whatever because that's skipping ahead a few steps and is still in the closed loop. There's places to discuss the finer details but this isn't it.",
            "I don’t want to say Yes, for fear of being murdered.  But yes.",
            "A NFT is a non-fungible token that has been verified on a blockchain. It’s basically metadata that says \n\n1. what the asset is\n2. Who owns it.",
            "You can touch beanie babies. NFTs are when you pretend that you own something virtual, and that only one of those exists despite the screenshot button.",
            "NFT art absolutely.",
            "Your understanding is exactly the correct answer",
            "So will NFTs be used for contracts like DocuSign?",
            "Remember that \"artwork\" of the banana duct taped to a wall that was sold for like a few 100k? And then someone ate the banana but the \"art\" wasnt ruined cause it wasnt the specific banana taped to the wall that was the \"art\", but the idea someone had of taping a banana to a wall that was sold so the art itself would last even if the banana was eated or spoiled and had to be replaced",
            "No, because beanie babies are actually real",
            "Honestly it's even more stupid than that",
            "Basically, except with beanie babies, at least you get something that actually tangibly exists and which you can keep for yourself. With an NFT, you get . . . nothing.",
            "It is even worse, with the Beanie Baby you actually have the item, with an NFT you just have a receipt... and it is the exact same as the dozens, hundreds, or even thousands of other receipts.",
            "Stephen Diehl has a [good explanation of NFT's](https://threadreaderapp.com/thread/1445795667826208770.html) where he compares them to star registries.",
            "I think that nft’s are more like pogs. I can’t really explain why. Pogs we’re different than trading cards but they were everywhere. Like you could get fast food restaurant pogs or simpsons pogs or characters from movies. They were advertising and just innocent collectibles. \n\nIt’s weird. Bernie babies were just one company selling themed stuffed animals kinda like POP figures. Trading cards tend to be athletes or pop culture. \n\nBut.. Pogs were like this open faucet that anyone could take water from.",
            "I have no interest in NFT art but NFT’s as a whole are very cool\nKeys, deeds, ID’s, licenses are some of the more interesting applications.",
            "I love that there's currently 11.1k comments, but the flair is still \"Unanswered\".",
            "No. At least you could actually own a beanie baby. You can “own” any NFT you want by taking a screenshot and never paying a dime.",
            "Fwiw, this is what I said about Bitcoin in 2012 when someone suggested that I buy a few hundred dollar’s worth …",
            "Yes. Big yes. But although this may seem (and be) stupid, all currency is valued solely by people’s belief that it has value. NFTs are just a little more abstract.",
            "Well, you say a large collective of people, but in reality it’s a small vocal crowd on Twitter and a couple subreddits, most people don’t know what an NFT is",
            "closer to buying a star.\n\nIt's not yours, you can't ever have it, nothing stops other people from having it, and all you get is a blip in a database someplace. It's a scam.",
            "It's a way to launder money",
            "Yes. Basically it's a system to scam folks or to launder money. Anyone buying for any other reason is a moron.",
            "Yes. And we've reached the point where the general public is raising this question a lot. When that reaches critical mass and the crypto-skeptics outnumber the crypto-bros the party will be over. The speculators will move on the the next thing leaving the last of the suckers holding the bag.\n\nYou don't want to be one of the last suckers.",
            "They make absolutely no sense. Then again crypto makes no sense either. And yet here we are.",
            "Technically this applies to absolutely everything.",
            "NFTs are a scam to get the general public used to and more accepting of the idea of cryptocurrency and blockchain in general, which are also scams. Never, ever, EVER trust anyone pushing any form of blockchain based technology.\n\nIf someone is pushing cryptocurrency or NFTs to you it most likely means that they are an early adopter looking to cash out at your expense. Or they've bought into the BS and would like you to become a fellow future bag holder. Or they're just a moron. Those three categories cover 100% of all cases.",
            "Everything of evonomic value follows that logic. US dollars, stock ownership, it doesnt matter. The only thing that gives things economic value is us collectively saying, \"This has value and this is what that value is.\"",
            "Yes and no. This is a product of super low interest rates and the US being a wash with money. So speculative capital has  to find a place to go.  I’m not saying what the Fed and US government did was wrong. What I am saying is this is a knock on effect of their policy.",
            "Yes.",
            "No a beanie baby has literally ∞ more value than any NFT.",
            "I mostly just think they're a money laundering scheme.",
            "If you buy it from another person.... Who is you. For 600k.... Then you lose nothing but get to say you lost 600k. \n\nFor example you can create a company that hides the fact its you.",
            "It’s like digital money laundering. People have moved on from money laundering physical art to digital",
            "NFTs are just like beanie babies. They have no real world value to 99% of society. They are also, like most block chain related things right now, a largely speculative market, which will inevitably burst",
            "Worse. Since you don't own the product.",
            "Its closer to those \"deeds\" to stars or land on the moon. There is some record of your \"owning it\" or \"naming it\" but it is absolutely not enforceable and practically means nothing.",
            "Having an NFT is like having a certificate saying it’s yours but that’s about it \n\nIt’s like having your name on a park bench, yeah its cool that it’s got your name on it but you can’t take it home with you",
            "At least with beanie babies you owned something physical. NFTs are 100% a scam.  Like buying property on the moon, or a star.",
            "Just like with art it's a 21st century way to display wealth. Sort of like spending 60 grand on a Mercedes and paying 5k every time you need a new headlight. You're not really going any faster or getting more reliability but everyone sure as shit knows you're rich enough to set a pile of money on fire for no reason.",
            "It's even worse because there's no beanie baby...",
            "Only if every time you traded the beanie baby, the original creator got a cut off the transaction.  Its royalties for art and it has a lot of potential going forward.  Say you but a fully functional delorean nft.  That’s neat right? You can move it around with your finger and lift the doors.  Not imagine your great grand children log into their virtual reality social media platform and Beyoncé’s great grand child wants to buy your delorean to use in the virtual world for 70 septillion dollars because she hung too great grandpas dumbass 100 dollars purchase a century ago.  My point is it’s unique, it’s traceable, and it doesn’t fall apart and collect fecal matter and dead skin over the years",
            "I have sort of come to the conclusion that they are like private number plates (I believe the American term is Vanity Plate). They cost money, they do nothing, they look really cool to a small amount of people but they make you look like a douche to 99% of the population.",
            "I have an NFT of a bridge to sell you",
            "It's as if you bought a beanie baby, but you only kept the receipt. Then you went home and typed a code found within the receipt to watch a live feed of a box that's holding the beanie baby",
            "An NFT is a speculative asset in which you think that another person will buy the thing at a higher price. Whether it’s really worth anything, what is (a common response) is debatable. \n\nIMO it provides no actual worth, you cannot hold the product, like in traditional media, since it’s a digital format and anyone can have access to it to print it, there’s really no scarcity as in gold or even bit coin. \n\nIMO I think it’s another grift, easy money if you can convince rich idiots and rich boomers to buy a GIF for 69 million. What sucks is how much electricity the block chain techs to verify your purchase, probably a real net negative on actual worth.",
            "NFTs have a place in our future society but shitty pixel art scams are not it",
            "Blockchain tech is good, but NFTs are just scams for idiots and people trying to make quick money. They treat it like a stock. It will fail eventually. It has no reason to even exist, once the hype is gone people will forget about 250k jpegs",
            "Nope. It's like that, *squared.*\n\nSuppose Alice is a member of the Beanie Baby Collective, and owns the beanie baby with the serial number 12345. (IDK if they actually have serial numbers; I just need a way of uniquely identifying them for the purposes of this explanation.)\n\nAn NFT is like if *another* collective of people took a piece of paper and wrote on it, \"This piece of paper represents beanie baby number 12345,\" and then sold you that piece of paper. But you're only buying the paper; Alice still owns the actual beanie baby.\n\n(Oh, and this NFT collective demands that the piece of paper only ever be resold through their particular payment processor, which has a ritual of starting a forest fire with every transaction.)\n\nNFTs are a bit less ridiculous if the thing they represent is digital to begin with. In that case, they would be the equivalent of if a video game crowdfunding campaign auctioned off the position of \"Our Biggest Supporter of All,\" which comes with a prominent shout-out in the game's credits. They're not selling any of the intellectual property rights to the game; they're selling something symbolic, associated with the game, that they artificially created for the sole purpose of allowing someone to have the bragging rights that come with the exclusivity of having it.",
            "yup, basically. except you dont even get a tiny cool plush to hug or throw against a wall",
            "I dabble in crypto, and started hearing whisperings and rumors of NFTs. Cryptos I understand. It's an imaginary currency that a community prescribes value based on supply and demand. Not unlike the dollar. I can wrap my head around that.\n\nBut when I asked someone to explain NFT's to me, I get them different explanations depending on who I am asking. Nobody knows.",
            "Aren't all material things like this? The only reason why singed copies of The Beatles first press records are worth anything is because people say they're worth something.\nIf every single person on the planet agreed they were worth $2.56, they would only sell for $2.56 or less.",
            "they're more like pogs",
            "Yes",
            "Probably",
            "an nft is just an erc token with a supply of 1. can be valuable, but the applications in defi are so far limited, so yeah mostly beanie babies for now",
            "You accidentally put the word “are” before a factual statement",
            "Yes pretty much exactly",
            "What makes someone with a wallet of 100 Bitcoin a Millionaire? Because they can sell it. If I own an NFT of a meme, and another person wants it, it’s worth money. I own the actual meme photo. I don’t quite think it’s like a painting, because that was physical and real. But what is real? We all live in 0 and 1’s. I think a lot of people got stupid rich, and NFTs might be a thing for a bit. If nothing else but a hobby.",
            "Isn’t everything a collective agreement weather it’s valuable or not?",
            "The concept is great but the current implementation completely sucks.",
            "No, because beanie babies are woefully inefficient at laundering money. \n\nAlso, NFTs will pave the way for profitable, and universal virtual goods. \n\nCompanies are already pricing their NFT VR goods.",
            "People buy Funko pops and say NFTs have no value. It's a rabbit hole I'm enjoying, hopefully people go all the way down and realise 95% of the stuff we spend money on has no value and we can stop mindlessly consuming. At least NFTs aren't going to end up in a future wasteland of plastic waste.",
            "Get ready for GameFi to come out soon :)",
            "Thats actually anything of value, its all a construct.",
            "\"it's something that a large collective of people have decided it has value and scarcity but actually it doesnt?\" - that's not just beanie babies; that's true of a lot of commodities, like diamonds or gold or home loans",
            "When the world becomes like ready player one. Nft's are gonna be your items in the  digital world.",
            "There are different types of NFTs. Some, you just own that image. It could be 1 out of hundreds or 1 out of thousands (commonly max out st 10,000). They all have \"serial numbers\" that are logged on the public license blockchain. That can't be changed which is how one knows its authentic. What gives it value? The same thing that gives anything else in the world value, supply and demand. Why is the mona lisa valuable? Everyone has come to the agreement that it is a beautiful piece of artwork and there is only one if it. The same of any art.\n\nThe comparison to beanie babies or star registries are mott because it is apples and oranges. There is no possible way to know your star is only registered to you and not thousands of others. An NFT is a one of a kind owned by a single person, and there is proof. Many NFTs will end up like beanie babies in the long run, because not all will be valuable, but there were no beanie babies that were just one copy of. There was no reoccurring income to be made by them. \n\nThere are other NFTs that are images, but in addition to whatever value is had by owning the image, the owner of the image can earn a percentage of the fees made by the sales of all of the NFTs in that collection. When an NFT is resold, a percentage goes to the original maker of the NFT. Some collections offer a percentage of the resale fees back to the NFT owners. Now that creates a passive income by owning it. How much? It depends on what is written in to the contract and the resale value. That in itself can give the NFT a higher value.\n\nThis is just the beginning, what else could you do with an NFT? You can create a document showing ownership of anything that is not changeable since it is permanent logged in a public blockchain. It will be possible to have property deeds, auto titles, medical records, anything you would have ownership records for. It will be cheaper, easier to validate authenticity, and tamper proof. \n\nImagine playing fortnight or another game like it. Playing long enough to gain weapons, skins, or any other upgrades. You, as the player, can now turn around and sell those items to others. The game would get a small cut of every sale, but the majority of ownership is in the players hands.\n\nThe future is about ownership. You making money off of your own data, not Facebook. Musicians, artists, making money off of their product, not apple/google/Spotify or whoever else sells their product and takes a huge cut. \n\nI'm glad there are so many naysayers and people who just have no idea what they are talking about, it tells me there is more time to collect more NFTs so I can sell them to everyone once they realize the value.",
            "Yes. But collectibles have lasted a hell of a long time on the same principle. Why is a Spiderman No. 1 valuable? Or a Gutenberg bible? As long as the underlying NFT is relevant, it will be valuable. But most of these NFTs will be worthless.",
            "It's a new and creative way for the wealthy to avoid paying taxes and for criminals to launder money",
            "It’s just a new money laundering system.",
            "MLM for zoomers",
            "NFTs follow the same demand and supply pattern like any other market. Some collections are very well known or have a huge demand, especially sports collectibles. TopShot and Rario cards are among the best I believe.",
            "[deleted]",
            "As with crypto nothing here makes sense to me",
            "Hate to break it to you man but if people believe it has value, it does\nNothing really has value unless people believe it does.",
            "Yup. Cryptocurrency too. It’s all fake and worthless.",
            "Like sneakers, supreme & Basketball cards.",
            "[deleted]",
            "Nothing man-made has value unless a collective of people decide it has value. I own a couple of old band t-shirts that I learned I could sell for like $150. The right person will pay something for anything.",
            "The technology for NFTs is.. Interesting, at leats. Could be great for security and integrity and so on.\n\nBut the NFT market, yes, it's like a Beanie Babies thing. Nothing says they have no value, but also, nothing says what value they actually have. Value is not a set price, but it's measured by what people are willing to pay for them. If only one people in the worls is willing to pay and offer five bucks for one of thos monkeys, yes, it has a value of five bucks. If ten people are willing to pay a million for it and the transaction is ended, yes, that monkey can be worth one million, but only if found by someone interested. \n\nSo, there's that.\n\nNFT market yes, it's moving a lot, but a lot of it it's between the same closed group of ultrarich moving it on to appear that the market has any value and try to grasp some investors.",
            "A thing is worth what someone else is willing to pay for it.",
            "No it's like Bitcoin\n\nwhere it's something that a large collective of people have decided it has value and scarcity but actually it doesnt.",
            "NFTs actually have real-world uses which have *nothing* to do with making dumb jpeg collectables.",
            "If you find yourself saying “wait, that doesn’t make any sense” about NFT’s, then you’ve accurately understood NFT’s",
            "But with added money laundering",
            "Yes. Kinda like crypto currency.",
            "Isn’t it common knowledge that these are just a vehicle for money laundering?",
            "Isn't that the basis of our economy?",
            "Aren't they bad for the environment too?",
            "NFTs are pointless and are basically trading cards verifiable with ownership tied to the biggest buzzword of the decade. There is nothing tangible actually owned, you can literally just screen shot whatever the NFT is.",
            "Oofff wait till you learn about the US dollar.",
            "Money is fungible, which means that it’s interchangeable. If I swapped your $10 bill for another $10 bill, you wouldn’t care because the money is indistinguishable. $10 is $10.\n\nHowever, non-fungible tokens(NFT) are cryptographically distinct. Any digital document, from a picture or text file to a program, can be converted into an NFT, which acts as an immutable, absolute receipt of ownership. No one can copy the receipt and use their copy to make a claim. It’s non-fungible. Only you have it. You can trade it, though, if you want to exchange ownership.\n\nHowever, having a receipt of ownership on the blockchain is not legally binding. No government or company recognizes your claim. Buying an NFT is the equivalent of buying a star from a random company. You don’t actually own the star and if NASA representatives decided to investigate it, you couldn’t charge them with trespassing.\n\nNFTs might have a practical application. Some countries or major companies may adopt it as an alternative to their copyright system. Others may issue their home ownership contracts or wills as NFTs to ensure they cannot be modified by unscrupulous parties.\n\nIt’s also possible to create decentralized brokerages for stocks or trading contracts. The blockchain that powers most NFTs is Euthereum and it can be programmed to act in certain ways. For instance, if a company issued its stocks as NFTs, hypothetically, it’s possible that these contracts could automatically extract dividends from the issuing company’s reserves.\n\nOwnership is  not useful without means of enforcement. NFTs have no application without wide acceptance from corporations and governments.\n\nNot to mention, compared to conventional means of electronic ownership, the block chain uses hundreds of thousands times more energy per transaction. It’s not environmentally friendly at all"
        ]
    },
    {
        "post_id": "gph1hc",
        "author": "ButtPoltergeist",
        "title": "Do chameleons know they can do that, or do they just walk around thinking everyone else is a Mr. Magoo motherfucker?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/gph1hc/do_chameleons_know_they_can_do_that_or_do_they/",
        "score": 15601,
        "num_comments": 350,
        "created_utc": 1590284252.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/gph1hc/do_chameleons_know_they_can_do_that_or_do_they/",
        "comments": [
            "Considering that color changing is their primary method of communicating emotions and intent, I'd say yes.",
            "Hey... Chameleon owner here.\n\nChameleons change shade and vibrancy, the majority don't change total colour. (Lighter if a predator/prey is below to blend better with the sky. Darker if the predator/prey is above, to blend better with the ground).\n\nAlso they become much more vibrant when they are happy/flirtatious. And paler when they are unhappy. Very dark when they are angry, and they are grumpy mfers\n\nBut if you're thinking about eyes... If you look at a chameleon with both eyes, they will consider you a threat. Chameleons see everything. They can see in more colours than humans can. And the way they \"lock on\" to prey is to point both of their independently-seeing eyes onto it. And they do not have the capacity in their short life to recognise other creatures cannot independently move their eyes.\n\nTherefore, we are most certainly considered threats when we look directly at them. Hope this answered your question",
            "[removed]",
            "Your post made me want to see if someone made a \"what does a chameleon see\" simulator (didn't find one, so disappointed), and instead i found that researchers made a game \"designed to frustrate\" chameleons haha. \n https://www.cnet.com/news/computer-game-for-chameleons-tests-their-telescopic-eyes/\n\nScientists are so kooky :)",
            "[removed]",
            "It's marked as answered, but honestly, I don't think it was. A lot of valuable joke comments but nothing getting to whether chameleons possess the intellectual ability to contemplate self awareness. I don't know the answer to that, but clicked hoping to find out.\n\nI think this is worth an askscience or eli5 or something. This doesn't feel like a stupid question, and I feel like you are getting stupider answers than the question.",
            "[removed]",
            "Does a chameleon look at the color before they change or can they sense it or whatever\nLike can a blind chameleon do it?",
            "Big question: if a chameleon dies while “color shifted,” would it remain the color or go pale like other species?",
            "They change colour mostly based on mood they cant take in their surroundings and blend in it's a common misconception",
            "IIRC the colour changing is actually more for expressing emotion than deliberate camouflage.\nCuttlefish blow chameleons out of the water when it comes to changing colour for stealth.",
            "[deleted]",
            "I am a chameleon and yes we are aware.",
            "I was under the impression that humans are one of the few animals capable of rational thought and therefore the understanding of self identity. I'd assume chameleons don't spend a lot of time thinking about how they're different from other animals, but rather just reacting to their surroundings.",
            "How lovely to know what that means",
            "/r/titlegore",
            "I read this as Charmeleon not chameleons. I was really confused for a secound.",
            "I think their camouflage is part of their defense thingy.",
            "Wasn't  Mr. Magoo partially blind? Or had very poor eye sight? I don't get the title.",
            "[removed]",
            "[deleted]",
            "SHAMELLYOHNE"
        ]
    },
    {
        "post_id": "f182x2",
        "author": "marcopadda1",
        "title": "Why aren’t we taught laws?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/f182x2/why_arent_we_taught_laws/",
        "score": 15602,
        "num_comments": 707,
        "created_utc": 1581251730.0,
        "selftext": "I feel like we are just expected to know every single law there is without being taught any in school.  There are rules and regulations that we live by but we are supposed to teach ourselves them by looking them up or reading about them?",
        "permalink": "/r/NoStupidQuestions/comments/f182x2/why_arent_we_taught_laws/",
        "comments": [
            "you're right.... Some laws are common sense, but not all of them. At least leave 1 or 2 hours in...a schoolyear really, just to talk about them and learn more about the laws and how they work.\n\nEdit: thanks for all the great responses! didn't think people were actually gonna give a response, so thanks for all the idea's and info!",
            "I had a class in high school called “you and the law” that did just that and also covered what to do if you find yourself in trouble. Is that not common?",
            "[deleted]",
            "Probably because a lot of laws and regulations won't apply to you so it's pointless to teach you. There are town halls and city halls that you are suppose to check to learn about ther laws and regulations of certain things when you want to fi those things.",
            "While the other comments here are correct, no one expects you to be a lawyer out of school. I think the spirit of your question makes a lot of sense. \n\nWe should be taught basic laws that we as citizens will need, and really most basic laws like family law, business laws, tax law, property laws probably could be covered pretty well. Again not in lawyerly detail but well enough for you to be an educated citizen. \n\nMy guess is most schools simply don't have the mandate to do it or the expertise to try.",
            "I don't know about you, but I learned a lot in the mandatory civics class in school.",
            "Local, state/provincial, national? Because that is a LOT of laws, and most of them are very specific and situational. I've worked with local building codes; it's a veritable library to reference (and it's just building structures), and most people will not care as long as the building doesn't fall down.\n\nThe average person can get away with the basic \"don't kill, don't steal, follow instructions\". Driver's  education covers a lot of specific ones. \n\nEven if they are taught, the retention might fail. I bought a house; I have no idea how to buy/sell one and just got my hand held by my lawyer and realtor, who do these things regularly. I could learn, but how often does the average person buy or sell their home?\n\nAnd laws change. There's always an exception and people always argue stuff in court. There are compassionate circumstances, grandfather clauses, people with enough money to flaunt everything.",
            "Which laws? There are so many of them, and most won't ever apply to you, so it makes more sense to look them up when you actually need them. \n\nThere are housing rules and regulations, various business-related laws, stuff about constructing roads and building restaurants... Which ones would apply to you, a teenager?",
            "Absolutely, law and ethics (along with driving a car how to balance accounts and conflict resolution) should be a requirement in high school. These are essential life skills and we would all benefit if they were formally taught in school.",
            "The mitochondria is the power house of the cell",
            "Great point. We should be taught a framework of important laws especially constitutional law as well as local laws.",
            "Idk in Germany we usually have a Economy and Law class in highschool. You have to buy the civil law book for it.",
            "In Ireland it's because the education system was designed by the Catholic church to develop priests. And it hasn't had a good rethink in 100 years.",
            "Because then we would be able to demand our rights from the government or our bosses in our workplaces.",
            "A lot of the most important ones/ones with the most severe consequences are pretty obvious like don’t harm other people or their property (murder, assault, arson, robbery, etc). People are hopefully raised being taught those are bad things. Kids are later taught traffic regulations as they learn to drive but most traffic offenses have rather minor consequences (you get a ticket if you speed). I think after those two categories, you have laws that you learn as part of your profession and then there’s new laws that get publicized as they come about - pirating music over the Internet wasnt a thing when I was little but as it became an issue, people facing legal trouble for it made the news all the time.",
            "You were! When you learn to drive, when you are taught how to cross the street, when someone teaches you how to buy things at a store or get along with classmates. \n\nMost laws are based on simple morality - “don’t take your brother’s toys” is the same principle as not taking some dude’s wallet or his car if he leaves the keys in. The laws that are most relevant to daily life are taught to you as a kid in basic rules about how to get along. \n\nComplex stuff like constitutional and labour law ... that’s advanced education stuff. You’re on your own there.",
            "Why were you not taught them at home?  School isn't the only place you can learn things.  Parents have an obligation to teach their children how to behave in a civilized society, and laws are part of that.",
            "Laws, taxes, regulations, covenants, codes of conduct... All are required to be learned by the participant. It would take your entire educational career to be taught them to a level where you could use the information... Better to get an expert in each field to guide and advise you, CPAs, attorneys, and industry regulators.",
            "I think basic criminal justice should be a mandatory part of curriculum.",
            "If you live in the US, it's because the education system is a flaming piece of garbage",
            "[deleted]",
            "Same as why aren't we taught to do taxes",
            "Fun fact: I’m about to graduate from law school and still don’t know every law because you honestly don’t need to know all of them.  However, it’s probably a good idea not to:\n\n1) hurt anyone intentionally or knowingly\n\n2) intentionally screw someone over\n\n3) break the promises you agreed not to break in some writing you signed. \n\n4) distribute drugs to people.",
            "It helps to understand a bit about the law generally and legal education. There are, broadly speaking two types of law: statutes which are passed by the legislature and common law, or \"judge made\" law. Statutes are what you think of when you think of a law. Your representatives in government write these laws, go through the democratic process of passing them, then they go into effect. Common law, on the other hand, develops over time through application. A judge gets a case that nobody has ever had to contend with in their jurisdiction. The judge has to make a decision that seems to fit within existing law, and subsequent judges build on that. It's the law of precedent. \n\nLaw students don't actually learn \"laws,\" at least not really. It'd be impractical, as laws change all the time and there are tons of them. Lawyers are trained to understand concepts and principles in various branches of law. We don't read statutes, but we read court opinions where laws are applied and interpreted. We learn how different areas of the law work and build skills to handle actual statutory laws we come in contact with in practice. Take criminal law, for instance. We learn about the requisite mens rea elements for different crimes, distinctions between types of murder, types of affirmative defenses, among other things. We do this so that when we read a statute for a certain state criminal law, we have the building blocks to work with and understand it. \n\nWe're also taught that laws exist as a way to codify social norms. The idea is most people would agree certain things should be legal / illegal, and law puts that into effect.",
            "Because if everybody knew how asinine and onerous our legal system is, we would immediately revolt and remove our government.",
            "There are more laws than any one person can know. Which I think should be illegal.",
            "Like, taxes for example. Nobody has ever educated me about what to do about taxes. Yet I know I'll be in huge trouble if I ignore it.",
            "Lol, even the cops don't know the law.\n\nThat's why there are so many settlements with non-disclosure agreements.",
            "Big brother wants to keep us dumb enough to not know the law so we cannot use it to protect ourselves",
            "because mitochondria is the powerhouse of the cell",
            "3 words: Prison industrial complex",
            "Without knowing laws you can get by just fine by showing respect to everyone and paying your bills. I have traveled to many foreign countries and of course I couldn't know all their laws but got by just fine by doing the above.\n\nOf course for things that require licensing, like driving etc, you will need to learn the traffic laws for example.",
            "[deleted]",
            "I was taught throughout 7-12th grade.",
            "There are SO MANY laws and it’s all very gray. I’m taking business law atm and just pertaining to business there’s a shit ton to look at. Lawyers specialize in all kinds of different law as we have so many regulations. \n\nI’d think if we were to introduce laws into the school curriculum planning who would teach it and what books to use for a younger crowd would be hard and expensive.",
            "Where I live we're taught constitutional law and then much later, laws related to our college course.\n\nEG: I'm a communications student, so we get a Comm. Media Laws and Ethics class.",
            "I just want an AI that instructs me on how to stay out of any courtroom for my entire life, for any given situation.",
            "Your parents are supposed to teach you. And teachers did teach us about laws that would affect us at the time, like jaywalking and riding your bike with a helmet. Your parents should teach you other laws that might actually be relevant to you if they want to keep you safe and make sure you don't wind up in jail.",
            "Seems like a parents job to teach right and wrong. Idk, maybe that’s just me.",
            "I was taught the laws and I went public school. Did y’all not take civics, American government, and/or state government?",
            "wait you guys dont have civics class for this?",
            "Lawyer need clients",
            "What's amazing is some are just not accessible to the public.\n\nAs I recall, there is a big book on driving and road standards / laws/ regulations, but it's not openly available online. You can be cited for violating any of that, or use it in your defense if some road wasn't up to standard and it would invalidate any offense you're accused of. So even if you try to be proactive and learn if something you did or want to do is technically legal or not, it can cost you.\n\nNot sure about availability at university law libraries, if you could walk in and take a gander at it or not.",
            "Or your rights? Tbh they teach you almost nothing you can use till uni",
            "Because theres too much to teach. Go to law school",
            "Yeah that’s a really good point. Like insider trading. If someone legitimately never heard you can’t trade on insider advice (and what EXACTLY is insider advice anyway?) and they do it and get put in jail is it their fault- they didn’t know so how is it fair to punish them?\n\nThat’s just one example but it illustrates the point well enough",
            "I'm curious OP. Is there something you didn't know that you think you should've known?",
            "Well we do take an entire semester learning the laws of the road in driver's education. Then we have to pass an examination to prove that we understand the laws before we are allowed to get on the road. But laws get extremely complicated beyond that and people even go to get law degrees which take about 8 years of schooling to fully understand (undergrad plus law school). I don't think it's very reasonable to make sure everyone takes this much schooling when they don't use it all the time. That's why we have people provide the service of knowing all the laws. Similar to how we have a representative democracy in the US. We can't expect every citizen to read and vote every single law that comes to. We have people whose full time jobs are dedicated to reading and making those decisions for us.",
            "Because it's useless as they're greatly different from each country. Surely economics are different as well but given the economic world now it's mostly stable and standardized among most , or in large economic groups, while politics or laws are so marginally apart it would be a waste, almost like teaching dead useless scaling units like Farenheit*, Miles, pounds, feet, etc",
            "Here's a law few people seem to know until they run into trouble and get arrested for it: It's illegal to carry prescription medication on you unless it's in its original bottle. So if you carry a few ADHD pills in a little keychain pill holder, that's illegal, and people have sometimes been arrested for it.\n\nThe more controlled the substance, the more likely you are to get into trouble over this. See it in the /r/legaladvice forum at least a few times a year.",
            "Well, you do have parents that are supposed to reach you the main ones.",
            "They do teach them in law school.",
            "You didn’t have a law class available in high school? We did. It was basic constitutional and criminal law, so it was basically a civics course. \n\nThe thing is that law is *complicated*. That’s why we have lawyers. Generally, if you just don’t be a dick, you can get by without getting in trouble. You’re not supposed to look them up yourself. You’re supposed to ask a lawyer if something comes up. Just like if you have financial issues you call an accountant. \n\nBecause law can vary wildly not just between stated and counties but between even cities, there’s no way to standardize a high school course to teach about law. And considering that if you’re not a lawyer and you’re wrong or give bad legal advice, the consequences are dire. So no, you don’t want a high school teacher teaching you law. \n\nTl;dr: you’re expected to ask a lawyer, not memorize your state’s legal code.",
            "There is over 70,000 pages worth of laws.",
            "Most people when they think of laws, only think about landing in jail for breaking a major one. However, the vast majority of laws are about protection, not punishment. There are many laws protecting children, animals, employees, patients, renters, buyers, builders, etc. Just about every aspect of adult life has laws that are there to protect people but only if they know what they are so they can speak up (or represent someone incapable of doing so themselves) when they are being broken. And I for one wish I had been taught these when I was in high school.",
            "Law student here. My opinion on the issue is that there is no law that you shouldn’t already know! Most laws people think of tend to be criminal liabilities, to which most of you should already know; no murder, no disturbing your neighbours, no fraud etc\n\nThe more obscure laws that you might come in contact with— say: property law is so complicated a few hours in a year (as some people I see suggest) is impossible to teach. Furthermore, if you don’t have fault or was just in a bad situation, you either won’t be charged or your case could become new case law. \n\nA counter point here maybe that someone could threaten to charge you anyway.\n\nInstead I think it’s maybe more important to teach proper rights and *how* the judicial system works so people know what to do when they do encounter it. What’s a bail and what’s custody? These aren’t laws though! Specific laws or even how laws work won’t help the laymen! The legal logic used to justify certain laws are just too much trouble and not worth everyone’s time.\n\n\nI’m open to debating about this though!",
            "If they did, then the school to prison pipeline would not work.",
            "It's kind of like saying why aren't we taught words.  Sure when you're a kid, adults may have explicitly shown you flash cards or hold spelling bees, etc.  But you just pick up words here and there building your vocabulary as you read and learn your language.  \n\nThere's already limited resources and time as it is learning the fundamentals in public schools.  Math, literature, science, history, etc.  I'm not sure specifically learning about laws should be a priority.  Maybe as an elective option.  But it's not really essential core knowledge to have.\n\nTeaching someone the technical laws would be like instead of teaching somehow how to fish, you teach them all the minute details of the activity but never taking them out to just fish.\n\nWe should teach people more important skills like critical thinking, how to research information for yourself, stuff that allows people to help themselves.  Teaching people about how to learn about laws is more important than simply teaching those laws to students.  Because it's not like laws are static and don't change ever.",
            "You don't need to learn the laws specifically, but lessons on statutory interpretation and understanding the application of case law should be mandatory for all students in common law countries.  \n\nIt baffles me that schools teach you esoteric science before touching on how the system we live operates.",
            "Because they are diffrent from county to county and they change too much. Instead of teaching laws they are supposed to teach us how to be informed about laws. That's what govt class is for but too much time is spent on how lobbying works.",
            "Because nobody really cares? Public school systems.. Look into campaign promises by those running for office in the education sector, or their views on the issue. I plan on teaching my children the law, as I understand and interpret it. My parents know little about the law, and I would assume it is the same as a doctor or a mechanic not teaching you everything about what they do. It would just be bad for business.",
            "In sixth grade we were taught all about the government, from federal down to local, and as part of that we had to research our local laws, think of a law we would want to implement that currently isn’t on the books, and write out a paper about it to send to our representatives. Then we turned our papers in, everyone got a “letter back from our representative” (teacher) saying how they loved our idea but they needed our help writing the bill to take to the House of Representatives. It was one of the first like 5 pages assignments we had to do as middle schoolers, and was absolute torture at the time but I’m grateful now for it. If I remember correctly a number of  kids wanted to make it illegal for schools to have it where only certain grades are allowed to get snack bar privileges and it should be open to all grade levels (at the time only 7th and 8th grades were allowed)",
            "A lot of US systems are horrible for modern standards. Education included.",
            "There really needs to be a class about understanding the law in general. How to find out and navigate your way around what they mean. Then also what to do if you find yourself in trouble, whether you've broken the law or you're looking to charge/sue someone. You could always call a lawyer, but having a basic idea of what's going on is a damn good start.",
            "The better question is:  Why are laws effected by who is in political power?  Shouldn't both parties be beholden to laws as written?  If we want change the laws must change first right?  we cannot illegally enact change?",
            "If people were taught the laws, then who would go to jail?\nThere's no money in that. - Beurocrats",
            "Because there is too many of them, they become obsolete and introduced new ones all the time as well as there is a lot of niche applications to certain laws.\n\nBut yes I think there should be a mandatory school course that isn't graded but is just essentially about useful things in life. Ie how to write job applications, common laws that aren't exactly common sense, googlefu, first aid, critical thinking and so on. Ie life skills.",
            "Because they dont want an informed public who know the laws!",
            "That's a really good question. Is there a sub for asking good questions? This should be there.\n\nAnd _why_ aren't we taught how to do taxes? What the heck was with that?",
            "I think teaching morals, safety, and common sense for the most part covers all laws you would need to know.\n\nLike knowing you should cross at crosswalks and look both ways before crossing and stuff covers stuff like jaywalking. Things like don't steal, kill, etc covers the most important laws, and you don't really need to teach kids the exceptions to the rule (except for things like defending yourself is okay but escalating is not). Teaching honesty will have you do things like not lie about your income to the IRS. Etc etc. Obviously that's not 'really' taught in schools, but parents are kind of expected to teach their kids right from wrong, and the most important values tend to be reinforced in things like religion and many forms of media. Which is probably why many superheroes have a very strong 'do not kill' rule and things like that.",
            "Because the job of a school is to train you for a job, not teach you life.",
            "Laws are written in a very technical way that aren't the best to go through. There's also a lot of them. A lot of them cover specific instances of things others are more general. It's not really reasonable to expect to learn all the laws unless you go into law.\n\nFor example I watched a video on YouTube about someone taking about cops pulling people over for no reason. He pulled out the driving code. It's a book a couple inches thick. That's just laws for driving on roads in that state. Learning them all wouldn't be a simple job.",
            "Because we’re expected to get in trouble to finance the police state.",
            "Did you guys know it’s illegal to collect rainwater?",
            "Another question I have : Why do I have to PAY for a book of my local laws?? I've searched EVERYWHERE online and we've even emailed local sheriffs and the only thing we can find that's sure fire our laws is a book we've gotta pay for. Like I'm sorry but if I can't see these laws for free you damn sure can't hold it against me if I didn't know. $40 is pretty steep for something like that.",
            "The problem also is when we do know.the law and its on our side .My friend just passed he had a roommate. My friend died without a will. Well under Ohio Law his mother who is next of kin is his property owner and she had gone to an attorney and gotten this paperwork done .Well 2 weeks later the roommate cleaned the hous eout of his jewelry clothes and his roommates previous boyfriends things included and family pictures while he and his friends were doing this the family showed up and the police let the go take the shit and go Also some shit was mine I had left there He took that to and refused to give me it.",
            "We should also be taught about finances, budgeting and taxes. These should be compulsory subjects.",
            "Because its more important to learn that lava underground is called magma",
            "Because you have teachers not lawyers.\n\nAlso, that'll make it easier for people to learn ways around the law as well.",
            "Eat your drugs\nStay out of school \nSay no to vegetables. \n💕",
            "Cheeky answer: in the US ignorance of the law is no excuse. Yeah you could take a civics class or something, but if they can arrest or fine you for not knowing a law then why would they make it a point to teach it to you. It's not profitable for them. Like, in the county I grew up in there were really weird laws, like you can't carry ice-cream in your pocket downtown on Sundays. Like, what kinda shit is that?",
            "Because frankly, if you're a decent human being and have just an ounce of common sense, it shouldn't be neccesary. The most important ones we're taught in our upbringing anyways.",
            "Well if they brought Civics back to the curriculum, students might learn how the 2nd amendment protects the 1st amendment. And of course, we can’t have any of that...",
            "Google: school-to-prison pipeline",
            "Ask your parents why you weren’t taught laws, schools can’t carry the entire burden.",
            "Because our law system is designed to be so complicated that you wouldn't know if you're breaking the law or not.",
            "Most laws are common sense",
            "Most laws are common sense. The ones that aren't, will be teached in school, hopefully by your parents, or naturally while growing up and spending time in various groups.",
            "There are so many laws nowadays anyone can be a criminal if the government wants to make you one. Lawyers and judges even lawmakers dont know every federal state and local law. If a prosecutor wants to he can comb though the books and find just about anyone breaking some law or another.its ridiculous!",
            "That won't benefit the state at all. I feel like they made these laws just for people to break them. Shit, you even have to pay them money if you brake any law. It's free money for them. The world isn't as pretty as they teach us in school about it.",
            "Because school isn’t a place to teach people",
            "In my high school civics class we had a cop come in and teach us basic laws.",
            "My high school had a law class.",
            "We are during driving school",
            "Then the lawyers would be out of a job",
            "Too many, they are common sense, they are constantly changing... but yet \"ignorance of the law is no excuse\".",
            "At grade 11 you can take a social studies 12 class called law in my district, it’s really new I think but the option is there.",
            "most laws are gonna be based on some degree of common sense",
            "I wish i was tought this and basic food skills. As a tall white man growing up in america I felt like all the media was telling me to consume as much as I can and if not Im failing. Some learn the hard way.",
            "You want us to hate school even more?",
            "Because most laws one would need to know are common sense, and any other laws the government wants people to know (for example, the laws on distracted driving) are more effectively taught through public education campaigns which are much more memorable (eg. A highway sign telling you the penalty for distracted driving), can be targeted more efficiently (only put the signs on roads where drivers will see them, cheaper than paying teachers to educate everyone regardless of whether they drive or not), and can utilize psychological/marketing \"tricks\" to engage people with the message (scary commercials about distracted driving).",
            "We are. It starts with things like \"look both ways before crossing the street\" and \"put that back, Marco, we're not paying for that!\"  In other words, as each need arises.",
            "\"Mitochondria is powerhouse of a cell\"\n\n...and that's all we have for today!\n\nBut really in my opinion - nations and lobbying rich folk simply benefit (financially) from poor peasants not knowing much in the way how the law works. That's how Capitalism works everybody!\n\nplus a lot of people like me hate that school try to squeeze every bit of unneeded knowledge into a kid. Adding thing that is such complex and hard to comprehend as Law into a long list  school subjects that they have to learn every week would annoy heck ton of kids and people stating that schools are already throwing too much into kid's head",
            "Well, in one sense, it’s beneficial to rich people and the government because while they can pay people to know laws for them (lawyers, accountants, etc), poor have to do a lot of guesswork and/or time-consuming research. This leaves poor people far more likely to end up paying fines they can’t afford or going to prison, which overall benefits the rich and the government.",
            "We had a Civics class that covered the constitution and some basic laws. Going past that might be unreasonable considering that most laws cover specific scenarios which may never apply to you and, at least in the US, they can vary for each state, county or city.",
            "because people would realise how f\\*cked up our laws are. they might rebell..hmm..not good..let's not teach them, it's also too long, they won't look it up anyways",
            "\nIgnorantia juris non excusat - \"Ignorance of the law excuses not\" \n\nI think it is bullshit when it applies to ridiculous laws that are passed for the sole purpose of generating revenue from fines.",
            "Just like we should be taught about taxes, the cost of living, budgeting and anything along those lines really.",
            "I know I’ve spent more of my adult life figuring out what “x” is. I’ve also encountered the everyday need to describe clouds and rock formations. The biggest thing I encounter in my out of school life is how properly spike a volley ball. \n\nI jest, you are 100% right. There is a wide variety of things they should have taught us rather then some of the things shoved down our throats. \n\nI was lucky enough to still have home economics and my senior year one semester of economics. Hardly sufficient for the real world but it was something. \n\nI think the problem the powers that decide is that kids don’t care about that kind of stuff. But what they don’t take into account is most of us didn’t care about anything we were being taught. It’s the ignorance of children. They know we will eventually need this stuff, they should just push the important stuff. They stuff most if not all of us WILL need. Not to say we didn’t need forms of math or science because some of us went into that field, but everyone of us needed economics, home economics, civil law, etc.",
            "My high school and a lot of others I knew of had constitutional law classes available as a history class.",
            "It would be impossible for a single human being to memorize all the laws. There’s just to many.",
            "I learn laws in school. The subject is called politics",
            "Because then there would’t be any prisons. Wardens, guards all over the country would be out of jobs... you monster.",
            "I mean if you just live your life with the goal of not being a douchecanoe then you'll probably avoid breaking the law 99% of the time and the remaining 1% of laws that you might break are stupid and unnecessary anyway.",
            "If I was taught laws when I was a kid I’d have turned in my parents or neighbors for something illegal, not knowing the ripple effect of consequences.",
            "América is so weird man. Here in Uruguay we learn in high school all about our politics system and how laws are passed. Some basic laws and the tools to be able to understand basic law.",
            "Ignorance of a law is not a defense either. I learned this when climbing a rock face in a park. I got a ticket and let them know I had no idea it was illegal. I was told that didn't matter.",
            "Yes. You are expected to look them up and read about them.",
            "Because laws change constantly, and your teachers dont know them either.",
            "Lawyer need clients",
            "wait what? you were never taught laws?? where do you live? USA I take it?",
            "Because that's what being a lawyer is",
            "I've always thought that it was an underhanded system where if you didn't learn from somewhere, it was free grounds to bust you on it.  \n\nBecause of that BS I've made one of my life lessons: *\"You don't know, what you don't know - Everyone learns something for the first time.\"*",
            "If you learn civics you know how the government works and what laws exist, which means you cant be told its broken and that certain politicians can fix it even though their policies are the ones that will break it. In other words a certain party in the US wants to keep people ignorant to what actually gets passed and what goes on in government so they can keep their power.",
            "how will the 'justice' system get their payments? Unsneaky ways aren't enough",
            "I’m taking a class called intro to law right now... I didn’t realize that wasn’t a common thing",
            "I find that it more difficult to break a law than it is to abide by them. Since most of our laws are based on common sense and morality, then it should suffice to teach/encourage morality than to fill a child's head with legislative mumbo-jumbo.",
            "Ô",
            "There should at least be a reliable website for researching it. I have found a couple that will tell you regulations as they're written on the book, but as other commenters have mentioned, that's not the whole story. Also, if you have a question about a specific action, it can be nearly impossible to know where to look in the mountain of laws. A google search only yields a bunch of armchair lawyers with conflicting statements. I've even called the police, who have repeatedly said \"if you're not sure if it's legal or not, just don't do it\" which is infuriating. The people enforcing these laws don't even know the laws. How is this acceptable?",
            "It is illegal to carry a salmon suspiciously",
            "Most are pretty easy to avoid",
            "much easier to control ignorance",
            "This is actually a really good question.",
            "Nah sorry calculus",
            "Also, laws vary between cities, counties and states. So, if you move your past schooling may not matter for your current location.",
            "I think education system in many countries is a relict from the past and doesn't teach things necessary in life. Taxes, laws, household, economics, job search, office/job etiquette, all this is \"the parents should teach the kid this\" but the trick is the parents don't know either, nobody taught them. All we really need to know we google, attend specialised courses, or hire a specialist for the tiniest thing.",
            "Also how to act when getting pulled over/arrested/sued/divorced/audited/fired/job applicationing",
            "To lazy to read through the comments to see if this has been mentioned.  \nPart of the reason behind this is that the \"laws\" are too complex and wordy. There is no law that just says   \"killing someone is murder.\" It'll say something like \"murder is 1) ... or 2) ... or 3) ... or 4) ..., unless... or ... in which case...\"\nIt's necessary to be this way because it is the only way to prevent loopholes. Every base must be covered,  in very clear, laid out terms. Those terms are defined,  given conditions, exclusions, etc. Laws are also still up for interpretation,  adjustment, and also require knowing any precedence for the application of the law. \nIf you look up a picture of the budget that the U.S. president sends to Congress every year,  you'll get an idea of the ridiculous amount that the term \"the law\" actually encompasses.  You could study the law for literally your entire life and you wouldn't know the whole law. \nMost of the law is a ridiculous,  overbearing, unnecessary weight on society.",
            "Can you give an example of a law that wouldn't be obvious?\n\nObviously some things with setting up a business (which is what business school and/or lawyers are for) or jaywalking (which isn't instinctual, but also doesn't really have repercussions).",
            "Basically if you’re anywhere besides private property in the USA you are responsible for knowing local and federal laws. That’s why police can arrest you for breaking them. Your parents just kinda signed the terms and agreements when they got your birth certificate\n\nEdit - this is what I was told in military police school so if I’m wrong it’s because we ate to many crayons as marines",
            "They covered it in civics class.",
            "I think by and large most laws you need to know are common sense things... No stealing, no killing, if it's dubious behavior it's probably bad.  Other than that driving laws are probably the other category that aren't necessarily taught in school but you're required to pass in order to get a license.  Unfortunately they don't seem to ever really test you again unless you move states, when in reality a renewal once every couple years should probably require passing a test as well as passing an exam with an observer.\n\nMain problem with that idea of course is that not every can afford to take time off work to go do their renewals that frequently.",
            "I would like to know the same",
            "I don’t know where from, but my high school here in the US had a class called Law Education that you had to take to graduate. They taught us all about laws and the legal system.",
            "And taxes while were on the subject. I’m  expected to start filing your own taxes the second you get a job after  high school I don’t remember the tax law class...",
            "A few reasons:\n\n1. Most are common sense, so for the average person it’s not going to change their actions.\n\n2. There are far too many for any one person to know the whole thing, even for a single country.\n\n3. Most laws will never apply to you, they’re mostly against companies.\n\n4. There’s nothing “standard”, the laws that a person in LA live under are very different from those that St. Louis people live under.\n\n5. If everyone knew the laws, there would be riots tomorrow.\n\nThis leads to the interesting statistic that the average citizen breaks 7 laws every day.  Usually, the law enforcement officials don’t care, but piss them off enough and they will.",
            "Because a policeman's biggest power is that you don't know your own rights. As soon as you display to a policeman you know the law, they lose. I'd say at least 90% of cases are solved from people snitching on themselves talking to pigs when they don't have to. Know the law. Know your rights. Protect yourself. ACAB",
            "There are a fuck of a lot of them, some of them are very specific.\n\n\nAlso, if you knew all the laws, you might realise that a bunch of them are unjust.",
            "In high school (20 years ago....) there is this Civics (I think that's the name) class and it was the most interesting class to me. Not only that it did teach us about some laws, US history, current state issues, we did a lot of exercise about being a lawyer in a court room. We split into 2 teams and setup a scenario of a court proceeding and ask each others question.\n\nLearned a lot from that class and I missed it.",
            "I only thought of this the other day as well, you're just expected to go out into the world and know them all straight away",
            "\"I was never taught what laws there are.\n\n**I was never taught what laws there are!!**\"",
            "There's an obscene amount of laws to know.   \n\n\nLawyers don't  have all the laws memorized---AFAIK, they go research court cases, rulings, etc., regarding laws and grey areas (if it's not the run of the mill you sold meth or beat someone up) to help build defenses or prosecutions.",
            "The real kicker is the law enforcement and criminal justice system ASSUMES everyone knows the law.",
            "You aren’t supposed to know them; if you did then you wouldn’t break them, and if you didn’t break them then the police wouldn’t have a means of funding.",
            "In my mind it’s because laws don’t make something right. We should be taught what’s right not what whoever is in power defines as right.",
            "Because most laws exist to give those with power the option of arresting and imprisoning you. You’re not meant to know them all because there is no way to follow them all.",
            "Because they cant arrest/detain you if you know the laws and your rights. It's almost like the continued defunding of education is purely meant to keep the masses undereducated so they're easier to control...",
            "Not sure I it helps but I’ve always been told the reason we’re not educated on almost any of our laws is bc it’s easier to arrest you and put you in jail if you don’t know what ur doing is illegal and since state governments and private prisons get paid by the amount of prisoners it’s more lucrative to keep the masses uneducated",
            "Public law has nothing to do with us. Theres a private and public side.\n\n [difference between public and private](https://www.blogtalkradio.com/thevalleyofdrybones/2014/05/29/difference-between-public-and-private-w-yusef-el)",
            "Because then you wouldn’t unknowingly break little ones, which then you couldn’t be fined.",
            "Nearly every high school has american government as a requirement to graduate.  At 17 you're more focused on Stacy's tits and weekends parties than penal codes.",
            "I am currently taking a law class in high school.",
            "In the typical American public school system, legislation  and the law, and its legal system will never be a well represented or robust part of the curriculum until it's part if the standardized test system. \nThe administrators of the typical public school district operate in their own self interest. Their career performance is based on the perfomance of students on standardized tests.\nThey end up, in effect, saying \"if it doesn't benefit me, why teach it? \"",
            "Realistically,  cops aren't even taught most laws.",
            "Laws are ever changing and some are common knowledge so schools feel like you don’t have to.",
            "Omg ty for bringing up this topic. When I was younger a law was passed that if a police officer is on the side of the road with emergency lights on you must change lanes away when passing or slow to 20mph below the speed limit. A few weeks after the law was passed I  was given a citation/ticket. I just paid it and moved on. But this is only one example of abuse by our justice system and the police. In Texas at least. Not sure of the law in other states or countries.",
            "Omg ty for bringing up this topic. When I was younger a law was passed that if a police officer is on the side of the road with emergency lights on you must change lanes away when passing or slow to 20mph below the speed limit. A few weeks after the law was passed I  was given a citation/ticket. I just paid it and moved on. But this is only one example of abuse by our justice system and the police. In Texas at least. Not sure of the law in other states or countries.",
            "Like the jaywalking one!",
            "Because it’s common sense",
            "One of my biggest bugbears is traffic Law, at minimum if you redo your rego yearly, you should get a note saying what laws have changed in the last 12 months and to look them up",
            "Wish I’d known about laws regarding beastiality  before that trip to the zoo.",
            "It's easy to raise a generation of lawbreakers that will increase prison revenue if you never teach them the law",
            "It is in Aus",
            "It's easy to raise a generation of lawbreakers that will increase prison revenue if you never teach them the law",
            "You are definitely taught some laws in school. At least you should be. Others are picked up along the way. But it would be impossible to know every single law, lawyers go through law school and even they don't know all of the laws. Them there's the issue of various local and state laws that change from one jurisdiction to the next. Again, that would be impossible to teach them all.\n\nSo instead you learn basic categories of law. Don't take from others without permission, don't hurt other people, don't drive dangerously, things like that. Generally if you kniw those things then you aren't going to find yourself in much trouble.",
            "Ever heard the phrase \"ignorance of the law is no excuse\"?\n\nThat's why. You're not taught laws so that you will eventually and inevitably break laws, be told you have no excuse for it, and then be sent to jail as part of the for-profit prison network.\n\nThe one important thing to understand about the so-called \"justice\" system is that none of it actually exists for any kind of justice; it is all nothing more than profit generation for the government. The same government that jails you and educates, intentionally won't teach you about things it can jail you for. It's not a flaw in the system, it's a feature in a flawed system.",
            "I volunteer  with an organization that teaches “ at risk” kids the law. We go to schools and juvenile centers teaching people their rights, kids are always surprised what they are and aren’t allowed to do. Police are never happy about our program because it makes their jobs harder, knowledge is power and high schools really need a basics law class that covers constitutional rights, how to obtain a lawyer, labor and tax laws.",
            "Schools r stupid",
            "It's expensive to hire qualified personnel to do so",
            "Moreover why aren't chops taught laws??",
            "Because then governments couldn't exploit those laws to steal money from their own citizens.",
            "...\n\n\n\n\n\"... Getting knowledge in jail; like a blessing in disguise.\"",
            "People are easier to control when they don’t know their own rights.",
            "To create a legal system that benefits those with money and disadvantages those without.\n\nHow else are you going to create a gilded society?",
            "Because no matter how much your teachers wanted to teach them the school system didn't have time for them to be taught. Although sometimes you have the random teacher who will try to fit them in some how. ;~;",
            "This is actually a very good question. We should have been taught laws in school. At least the basics! How stupid! Lol.",
            "You're right. This is a good idea.\n\nI would argue that most laws basically boil down to \"don't be an idiot, and don't be an ass,\" but as others have mentioned there are some that aren't exactly intuitive.\n\nI suppose part of the problem is that laws vary by region. Different states have different laws, some cities have their own specific bylaws. I suppose states/cities could start making pamphlets they give to new residents that outlines any laws that are specific to where this person now lives?",
            "Not sure how effective it'd be. I just finished a semester of law school and I've yet to learn a new law",
            "Same with anatomy, physiology, diseases and their treatments...",
            "I don't know if it's an state or country thing but I was taught laws, how to operate as a witness, and how to operate as a juror.",
            "Civic's class anyone?",
            "It is systematically made that way. The police that arrest us for breaking the law are not even that in tune with then.",
            "Because legal codes are complicated and their are a lot of people/institutions that turn a profit on the general public’s ignorance.",
            "Idk... some people may disagree with me but I’ve never been taught the laws and yet I’ve remained a non-criminal. Because all laws essentially boil down to the big 3:\n\n• Don’t hurt anyone\n\n• Don’t kill anyone\n\n• Don’t steal \n\nAnd then I’ve always just gone through this simple step: If I vaguely feel like what I’m about to do might infringe those things, I’ll look it up. Granted *sometimes* I’ve risked it. \n\nWhat really confuses me about discussions of the laws is that... it’s not difficult to not do bad things. Just don’t hurt anyone in anyway and you should be fine.",
            "In a nut shell. There are just plain. Too dam many",
            "Connecticut taught laws in school.",
            "Because we’re too busy learning about things that most people don’t need, like trigonometry.",
            "I mean, there are a lot of laws, regardless of where you live. But the system should at least be explained in highschool. I'm currently learning about law and the system in school, but a lot of people don't get that knowledge which could be very important later in life to avoid confusion.",
            "That is such a good question! I feel like with this, it’s taught by like family. Because it’s kind of like morals right? Like I learned about speeding because my mom got tickets. Like things like that I feel like has been taught in the home...? I dont know, just an idea. Plus like each state is different.",
            "We're also not taught financial literacy, auto maintenance, resumé writing, or (speaking personally) how to cook. We *were* taught French, a language whose speakers mostly speak English, Spanish or German with the same problem, Calculus, ancient history, studying dirt (this is geography for some reason?), advanced chemistry, obscure physics, and literature.\n\nNow I know I'm inviting all the people who are missing my point who will come in saying \"But <pet subject> is so important!! Society is so *enriched* when people learn things they use for jut the exams and then never again for some dubious reason!!\" But you can't possibly argue that your pet subject is more important than things that aren't taught that >99.9% of all people *need* to learn to survive, so get out of here with those arguments.\n\nSo why is all this like this?\n\nYour fallacy here is that you think school is for educating. If it educates, it does so secondarily. Primarily, the problem schools are trying to fix is, \"Almost all the parents are working during the day and the kids need a space to be supervised during that time.\" That's the primary problem schools are trying to fix, as long as they've done *that*, just wasted your time, then they're succeeding. Education, especially during your teenage years, is auxiliary. Not that important. If it was, then school would be designed very, very differently.\n\nThe good news might be that this is changing and education could be at the forefront of schools, but this is changing very, very slowly.",
            "We'd probably realize how stupid a lot of them are.",
            "Yes this is very weird. You always hear about your state legislation passing a record number of bills this year. How the hell are we expected to find out about all of them. \n\nSure the big once show up on the news and most of them many not apply to you. But there is no telling how many new laws you are breaking or laws that are removed.",
            "It's a good question. It's important to know about speed limits, privacy laws, business laws, but above all these things, consider the laws that govern human behavior. Where can you find such a book of laws? What is the oldest, preserved record of laws governing a civilization? The Law of Moses. Read the first 5 books of the Bible and see if you find anything else like it on planet earth. There's nothing even close. And keep in mind this law was given to govern an independent nation that was to serve as a blueprint for any other civilization that wanted to thrive. \n\nThe Jews have been around for thousands of years, even with thousands of years being scattered and not having a homeland. But they are back and it's all written in that law. An incredible read at a minimum.",
            "International, national, state, county, township city, or neighborhood association laws....See what’s I’m doing here?",
            "If you paid attention in high school, you were likely taught at the very least constitutional law, and the origin of common law. There are so many laws that it makes it impossible to go over all of them in lower level schooling.",
            "its about control. cant defend yourself/chalange others if you dont know the laws.",
            "There is a documentary about Aaron Schwartz and all the events surrounding his investigation leading up to his suicide. \n\nIt touches on a lot of what he did to make privatized information public. They have a section about laws specifically and how he aided in e-heists to copy all everything and give it to everyone. \n\nVery good watch. It is called The Internet's Own Boy.",
            "Laws change from town to town, state to state, country to country. It’d impossible to do a great job teaching laws/codes because of that. Besides the fact the material is so dry and lengthy, and might require a high level education to interpret, and even then legal precedent may make an educated person’s interpretation useless. I agree there should be at least a high school course explaining the different types of laws and where to find them",
            "Laws change. A lot are common sense anyway. Not all, though",
            "When in doubt, look it up. Most honest mistakes are used as teaching moments when good cops are involved. As far as local laws regarding, say, what you are allowed to do to your house without a permit can be found on a website or with a phone call. When in doubt, find out to avoid a fine. The ones I find hard to keep up with are the different sizes, limits, and cleaning laws with regards to fish. I spear fish and if I dont recognize a fish I just leave it alone until I look it up and see if I’m allowed to take it. Again, when in doubt, find out before you inadvertently break the law.",
            "It's annoying too. I'm sick of the fake laws people make up such as \"it's illegal to put recycling in the normal garbage\".\n\nAlso, the punishments and actual enforcement would be nice to be taught too.",
            "Funny how ignorance of the law is no excuse, yet the law isn't taught unless you plan on becoming a lawyer. Glad they teach the bill of rights and the other amendments despite not being too memorable. It might be a subtle way for government to have more control over its citizens or we're still stupid as a country that we don't think things through enough. Only laws I remember being taught were from the D.A.R.E. program which in of its self was a colossal failure as was prohibition.",
            "I have never thought of this i dont have an answer as to why...but now its got me thinking. And im upset i don't understand why",
            "Because it is not normal to have shit and stupid laws for a 1st world country! Ohh shit that is right you are not one",
            "So we can break them and be forced to pay fines which is revenue",
            "My civics class in middle school was really informative. It taught us about the constitution, the government, our fundamental rights, how to be properly informed, the importance of one’s voice, etc. While we didn’t learn about laws specifically, it was definitely very impactful and useful!",
            "For me personally I learned a lot of the laws when I took AP US Government in High School, but this may just be because I had a really good teacher",
            "School big dumb but fun anyway",
            "I kind of feel like I was, or at least the framework.\n\nWe had two Civics classes that focused largely on the US Constitution and the legal system.  That was the springboard for numerous class discussions regarding laws.",
            "I am in the 8th grade they are doing now no one pays attention tho",
            "Because they want to make money off you breaking the law.",
            "Laws are based off of assumed axioms in the social marketplace.  If one understands that killing someone is wrong, you can understand that manslaughter and murder are different circumstances, and ruling bodies tend to regulate and define order into the minutiae.  \n\nTherefore law has a natural place in society, and is only defined because it needs to be, given the circumstances that take place in our lives.  When you want to understand a house, you don't spend your time researching the nails in the wall, you stand out in the street and look at the big picture.  If you want to understand an animal, you don't spend time with each individual hair follicle, you start at the head of the beast.\n\nAlthough law and order from any organization or even person can incorporate facts, it is ultimately based on assumptions of a communal perspective or social consciousness.",
            "You do learn laws in social studies/civics. My school in Canada had like a half year topic on law. Covered everything from how to talk to a cop, what to do when arrested, and what your rights are. Also covered lawmaking, parliament, and how the court system works.",
            "Cause the more laws that people are caught breaking the more the system banks",
            "The usual reason is that it's something the parents are meant to teach. What does that mean in actual practice? It means that certain groups of people receive less education in regard to law and consequence. What group of people has statistically less time for parenting, due to single parent households or due to heavy work schedules? The poor do, of course. What group of people also most heavily commits crimes? The poor do, as well. Now, let's follow the money. Who makes money off of a situation like this? The people who own prisons. And who has the money to lobby for harsher punishments to \"crack down on crime,\" and to lobby *against* improvements in education? The people who run the prison-industrial complex.\n\nIn short, there's few high school legal classes because it's more profitable to put poor people in prison than it is to teach them.",
            "When I first got arrested... I was given a fine and classes to do. I figured if I didnt do them they would go away or something. I got re-arrested two years later for not doing anything about my first arrest. Clearly learned the hard way.",
            "Too many, you really want school to teach that it is illegal to ride a bicycle in a public pool in california?",
            "that's what social science and civics classes are supposed to be.\n\nteaching you the actual laws won't do any good because as a lot of people have said, laws change over time and there are a lot of different nuances to them that it will be difficult to implement.\n\ninstead, what social science and civics classes are supposed to do is expand on the idea of \"laws\" and teach kids what society is in the first place, how it's supposed to function, why things are the way they are. basically the how's and why's of actual laws.\n\nthat way, kids don't need to learn the actual laws, just how society is supposed to work.",
            "I did a project on how people who aren't educated on their rights and the laws are pressured into false confessions. There are several cases of teenagers unaware of their right to remain silent or have a parent/ lawyer in the room. Police are actually taught how to put pressure on during interrogation and prey on insecurities and weaknesses. Makes people vulnerable to false confessions, but it's also kind of needed to get confessions from the right people. Kinda a messed up world we love in where you're forced to confess no matter what though. It takes confidence, a proper education in the matter, and straight up skill/ money to survive the justice system in place.",
            "Ive had a civics class where you memorize American history and get a basic idea of how the government works. Still no laws or basic citizen rights though beyond like, guns, a search warrent, and voting...",
            "Done on purpose.   Educated folks teach thier kids the laws.  Meant to keep people down",
            "People benefit from the public making mistakes. Think of how much money they make in court fees, citations, etc from you now knowing that the fuck you're doing.",
            "That’s actually a really good question! We are really only taught driving laws in drivers ed but never civil laws.",
            "Less knowledge about laws = more susceptible to law enforcement making up BS",
            "Ya!",
            "My guess is that it's just easier to fuck over a blind populace than an erudite one. Our lack of education on the subject in tandem with dense laws filled to the brim with legalese makes it harder for the proles to get into the politics of our own legal system; a legal system that in a sane democracy we SHOULD be involved in.",
            "I think if they did, the law schools can't charge them high amounts...  \n\n\nBut definitely they should teach some common laws and some maybe not so common laws especially pertaining to government officials and what they can and can't do and how to get rid of them... After all, they serve the public's interest and as soon as they stop putting public interest first, they should be removed.",
            "I was arrested for a curfew violation when I was 14 because I rode my bike to Safeway to get a soda at like 10:15 PM. Curfew was 10pm and I had no idea.",
            "Our prisons are a business and you are the product. Ignorance makes good people for the court systems. The system does not give a fuck about you or I for the most part all they care about is the money generated in the process.",
            "You're taught for your potential utility to others, not for your own benefit",
            "It’s usually taught by parents...",
            "We aren't taught them so we don't fucking roast the cops when they pull us over for no reason",
            "I actually remember walking by someone who was talking to a couple of cops and asking a simple question about knife laws. The question was simply about carrying butterfly knives. \n\nThe two cops looked at each other, shrugged, and actually suggested to the dude that he goes to city hall and ask the question there since they had no idea.\n\nWhy would city hall know? Why don't they know?\n\nSimply put, we aren't taught laws, and cops don't seem to be either.",
            "While we're at it, how about making ethics part of the standard curriculum?",
            "Most laws are common sense. Usually the things people go to prison for are things you KNOW are shady/wrong. The only exception are white collar crimes and most of those cases actually involve the State and defense arguing if any law was actually broken.",
            "I know in Australia ( or at least Victoria) we get taught laws. It’s a whole topic in citizenship",
            "I think the government mostly expects us to use our common sense for most of the laws and then research / hire legal representatives to deal with the less common knowledge laws.",
            "To be fair, government makes a lot of money on the philosophy that \"ignorance is no defense\".",
            "My class has a law class for the highest grade... lmao",
            "In my country, they do. They teach us some basic laws in school in social science.",
            "Really no point when everything is officer's discretion. You could be the 50th person he sees speeding today and decided to pull you over after seeing a tattoo or something",
            "At least once we get into school education we have at least one hour a week for this. Mostly it’s about your rights and general laws when it comes to working, holidays, job times and all of that. \n\nI messed up our first test because most of the laws we were required to learn only applied to people below the age of 18. I’m not gonna learn about laws that don’t apply to me ever again!",
            "At least in America, there are so many different laws that absolutely nobody knows how many there are, much less have the time to teach the 300+ variations of the laws that they do know. At any point in time you could be arrested for breaking some dumbass law that's been on the books for 200 years, all it would take is some jackass deciding to look into the shit, find the law and get you arrested.  Obviously nobody is taking that time to do that or else we'd all be in jail but doesn't change the fact that it could happen",
            "Why are we. 🥴",
            "Same reason we aren't taught taxes or how the world works at all.",
            "Chris Rock said it best and worst at the same time- \"put the laws in the Nelly video\"",
            "Teachers are significantly cheaper than lawyers.",
            "Because there are so many you should look a certain topic up before taking action on the matter. For instance if u want to start a restaurant, u look up that specific law theme. If u want to plant marijuana, then u look up those and so on. But I agree, there is enough room for \"Civic laws\" in school to be taught.",
            "Why aren't we taught taxes? Why aren't we taught things that will actually help us adult better??",
            "I think it might have to do with us more learning practical knowledge instead of applied knowledge.",
            "*Don't Stay In School.*",
            "So what you mean to tell me is.... The American education system *isn't* the best one in the biz? Honestly a lot of the U.S. educational system could use some work. My teacher just got pissed off at being teased two weeks into the semester and dumped an entire lab on us because we joked about his materials not working. Then he messaged us and said that the materials were actually faulty and so we all got an A+. God can we just have competent people running our country?",
            "Instead of forcing someone into bullshit ass electives such as an art class or orther bullshit why not give everyone a law class ?",
            "They have schools for that, actually.",
            "I agree, why don't we learn the employee-rights. Everything I learned everything from my coworkers or customers (!).",
            "Because like many government agencies have stated. It's easier, cheaper, and more efficient to go after poor and uninformed. \n\nBut also just like many other things, schools are machines, they have benchmarks and quotas they have to meet. They will teach your geometry but screw your taxes.",
            "I agree with this. A lot of laws aren't common sense. Don't get me wrong, lots of them are - but lots AREN'T.   \n It's like they just expect your parents to tell you, and there's no safeguards in place if they can't/don't.",
            "Cause they want you to fail. Money money money",
            "Because if everyone knew the laws then the people in power would have a greater chance of being held responsible when they break said laws. Easier to control non educated folks, like me.",
            "https://cash4clickz.com/dashboard/invite.php?invite=Bcoffelt2020",
            "Police like arresting people",
            "I had Economy & Law class in \"high school\".",
            "I remember pappa picking some flower he tought was nice, turned out it was rare and protected. \nI feel it would be plenty hard to teach and make kids remember all these small things."
        ]
    },
    {
        "post_id": "hhm1bl",
        "author": "mattrocking",
        "title": "Does anyone else feel guilty for not being outside on a sunny day?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/hhm1bl/does_anyone_else_feel_guilty_for_not_being/",
        "score": 15600,
        "num_comments": 900,
        "created_utc": 1593376977.0,
        "selftext": "I live at the beach. I went down to the water for about 2 hours. Now I’m back home in ac. I have this feeling of guilt when I look outside at how nice it is. I should be out there because it’s only nice for such a short period of the year. But at the same time I probably should not get any more sun, and honestly it’s just too hot. \nAnyone else?",
        "permalink": "/r/NoStupidQuestions/comments/hhm1bl/does_anyone_else_feel_guilty_for_not_being/",
        "comments": [
            "Not anymore. I grew up in New England and when I lived there then I'd have said yes. Now I live in LA where it's a nice sunny day almost every day. It honestly gets so old and boring. I love it when it gets cloudy, like now with the daily \"June gloom\", or it's super special when it rains.",
            "Yes! Because people make a big deal about “wasting good weather”. I mean right now I don’t feel that way as much because of what’s going on, but generally I feel embarrassed and guilty.",
            "Sometimes, but I've worked so hard all week,  I just want to be lazy.  Going to the lake takes effort. Sand, towels, chairs, lotion, sigh.  Good thing the lake's only 7 or 8 minutes away from my house!  There'll be other days. So long as I don't die before then.",
            "Me Me me me\nLike I feel it’s a sin to waste a sunny day inside- even if I have to work I feel like I should be soaking up or working out in the sun",
            "Nope. I love in Vegas, it's currently 102 with strong wind. It's miserable outside.",
            "A hot summer day is pure misery. I prefer to go outside in the fall/winter",
            "I do feel guilty, because I remember how often I think “I can’t wait until nicer weather!” In the winter (I live in New England). \n\nWith the virus and working from home, I feel even more guilty than ever before. When I’m at work and it’s a nice day, I’d always get annoyed that I couldn’t go out and enjoy it. Now I have the opportunity to actually go outside on nice days, but I still end up sitting in the house instead because there’s very little to do and no one to do anything with. But that said...”outside” for me just means doing anything at all that involves leaving the house, even if it’s just to go to another air conditioned building like the grocery store, a restaurant, or a shop. The humidity makes it uncomfortable to stand outside unless at a pool/beach, but I certainly feel guilty staying in my house vs. doing anything that involves getting dressed and leaving my neighborhood. \n\nIt’s painfully ironic. I’ve spent years at work wishing I could have a summer break like I did in school, and now that I essentially have that chance (well, I’m still working, but not in the office at least), I’m wasting it. Be careful what you wish for, I guess.",
            "[deleted]",
            "Yeah. Been living in Hawaii for 4 years and sometimes I wish the weather would be shit because I am just tired. Pretty spoiled I know, but shit you can only hike so many miles a week untill you are just smoked.",
            "the sun is a murderer.",
            "I thought I was the only one who felt guilty about this! But i love the AC and no sun burns lol",
            "Yes, when I lived in the Pacific Northwest. \n\nNow I live in Texas and I happily stay inside for every sunny day, enjoying the wonderful invention that is air conditioning.",
            "All the time. I'm in the UK so it's a rare opportunity when it's sunny, but it's always on a day I cba to do anything and I wake up late and feel guilty about wasting the day",
            "I have ALWAYS had this problem.\n\nIts even wayyy worse when i have a shit ton of energy that day. Like i ACTUALLY FEEL like doing a lot.\n\nId rate those the worst days in my life. An absolute beautiful day when im young with energy that ill never get back in my life.\n\nI need more friends.",
            "[deleted]",
            "Dude, I wrote a whole effing post the other day about this stuff",
            "Definitely like a feeling of missing out that I don't act on",
            "outside time is before 11am and after 7pm",
            "There's nice and then there's oppressive. Michigan we're looking at 90s all week long. No where in the State are you more than 3 miles from water so that heat instantly becomes humid. So you're sweltering but sweat does not take heat away.\n\nYou can't enjoy the day so you make the most of early morning and late evening when it's cooler.",
            "At least you live at a place where it might be desirable to go outside on a sunny day. Minnesota has it scorching hot, humid, and rainy for most of the summer",
            "Not at all. The only reason I would be out on a sunny day is if I were to go fishing but this weather in particular where it reaches 95 and feels like 100 it's a no no for me. So I rather stay in and Netflix and chill.",
            "Its 104°F today it was 110° yesterday.  Fuck the sun.",
            "Not at all, I live by my own expectations, I want to go outside when it’s raining, that’s my true solace",
            "Not necessarily...\nActually it's the opposite for me i like cloudy days with a bit of rain and slow winds a lot more..i always get the urge to get out and have a walk during that weather.",
            "I used to feel this way until someone told me \n\n“There will be more nice says, this isn’t the last one there will ever be. Do what you feel like doing when you feel like doing it.” \n\nAnd it just kind of clicked.",
            "My wife and I bought a trailer and lot at a nice trailer park for the summers. Her family has been there for 40+ years and it's gorgeous. Beautiful lake, great trails and lots of kids around for my kids to interact with.\n\nI'm a roofer. I'm on the roof anywhere between 30-70 hours a week, depending on the weather. When the weekend comes, I just want to sit inside, watch a movie, play cards/boardgames or video games. \n\nLots of people give me shit for not \"enjoying\" the beautiful sunny weather and taking advantage of it.\n\nBitch I enjoy that shit all week long, unlike you who sits inside all week waiting for the weekend. If I want to crank the AC and literally do nothing all weekend, that's totally fine. \n\nAll in all, you do you. Don't let guilt make you be outside just because it nice out. Live life how you want.",
            "Not in the slightest, inside playing video games > just about anything you could do outside",
            "Introvert + love of video games... so no, not once lol. I don’t mind every once in a while but generally speaking  it’s never mattered to me. In fact, I prefer the opposite, a nice rainy day inside or a thunderstorm (not a crazy violent storm or anything) is what really does it for me.",
            "No. Fuck the sun. It's evil. It causes nothing but harm and pain lol.",
            "Yes, I do. I noticed it serves as motivation for me to do something productive. (assuming I don't just lie on my bad with a big frown because I am melting)\n\nThink about it this way:\n\nGaming is like being on the beach but less healthy, you have fun but not learning anything. (and that assumes you like having fun on the beach, if you don't, don't force it, sardinians hate water)\n\nLearning at home something is like learning something on the beach but with an unlimited storage of knowledge called internet.",
            "I'm always outside when its hot and sunny so there's nothing fir for to feel guilty about",
            "I'm not a sun lover at the best of times, so no.",
            "Yes and now my head is burnt.",
            "Considering it's all desert and is still mostly 90-100 degrees 8 months out of the year. Not really. Arizona is such a desolate state and there's not much to do. I WILL go hiking in the woods in areas that are 2 hours away. I guess the feeling is more about my landscape, if I lived in the woods or near a creek then maybe. But where I live, i hate the landscape",
            "I can’t say that, it’s sunny 300 days a year here in my town in West Texas.",
            "Fuck the outdoors. Gimme a dark dive bar with a jukebox and AC all day, everyday.",
            "We are mid winter here (NZ) 11.52 am. It has been raining hard over the last few days. The sun is out with alight northerly breeze and blue sky. Unfortunately I work inside so me jealous of anyone who is enjoying the day out there. But hey, happy day.",
            "lol this gets asked all the time on this sub",
            "Yes, our parents made us this way.",
            "It makes me SO guilty. I live in Michigan where it’s snowy/cold from like November to April, so I feel horrifying guilt when I have a lazy indoor day during the summer. Especially because it’s so beautiful here.",
            "Yes. I live in a state with hard, long winters. Anytime I miss the chance to get out and enjoy warm, sunny days, I feel like I’ve wasted something rare and important.",
            "If you live where I do on the beach, it’s fkn hot outside. You’re either in the water or in the AC",
            "Yes.  For me it stems from my parents always wanting us to go out and play in the summer.  Michigan is mostly poor weather, so summer is our only chance. \n\nI was never a fan of outside environments, as my hobbies are video games and reading.  \n\nHowever, hearing about it for years has given me a compulsion to go out on sunny days.  It's only when it's rainy or bad weather that I feel relaxed enough to be myself and stay inside.",
            "Yes, even more so because I work in a retailer that is located in a basement with no windows. It makes me miss working in a place that actually had windows. \n\nEvery break, I go outside, regardless the weather. I feel like less of a vampire lol.",
            "Nice day pressure is real",
            "My excuse is that I’m avoiding skin cancer. I also prefer breezy cloudy weather and the occasional run through the rain. I hate sunny days.",
            "It’s too hot. Running is best in cool weather",
            "lmao i get the exact opposite. I love when it storms because it gives me an excuse to sit inside and not feel guilty abt wasting good weather bcuz i can’t go outside anyway.",
            "I live in Bali, I always feel guilty.",
            "Yes! I'll literally go out in my backyard and sit on my phone because I feel guilty for sitting in the house. Then I'll start sweating and the bugs start fucking with me so I'll go back in. I have a little garden that I tend to and I have to mow my grass every week, but there's only so much I can find to do outside.",
            "Yes it makes me feel restless and guilty and I’m glad that it’s not just me. Thanks for you post",
            "I don’t know man, some days definitely. But i live in tennessee, and while the weather can be famously variable, it’s also usually pretty sunny and average most of the time. If i let myself feel guilty every time i stayed in on a sunny day my life would suck lol",
            "That bitch always burning my ginger ass. Fuck the sun. I'll be rolling over in my grave when that bitch goes up.",
            "nah fuck the sun me & that motherfucker got beef",
            "Nope I am a extreme introvert any day inside is a win for me",
            "This is why I love rainy/stormy days. No guilt for not going outside.",
            "Sunny does not equal good weather. Only morons with no job and people that can’t form their own opinion think so. You sweat like shit, insects everywhere and u get skin cancer. “Good weather”...",
            "i have the same but sorta opposite problem. i absolutely loove overcast weather. today it was nice, cool, and overcast and i thought about going for a walk. the most i did was go to subway and then straight home. i feel a little guilty for wasting a perfectly good cloudy day.",
            "I live in Phoenix so I get sad if I don't go outside on a cloudy/rainy day because it's like walking into a oven on a sunny day.",
            "This fucking subreddit nowdays. This was for actual STUPID QUESTIONS, not for these \"does anyone else feel this really normal relateable thing I also feel?\" gg kids smh.",
            "I do because I live in Canada and we only experience this for a few months a year.",
            "No cause I burn super easily and I dont like putting on sunscreen",
            "I hate outside, graphics are good but the npcs are lame",
            "In northeast Ohio, sunny days are precious.   It's cloudy all winter and for much of spring and fall.  I really feel like I'm missing out on a part if life if I stay cooped up on nice days.",
            "My mom makes me feel so guilty because she think that in summer, if you're not outside 24h you're wasting good weather. But where I live we have snow like 5 months per year so I kinda understand but sometimes I just wanna stay inside",
            "Hell no, fuck the sun lol",
            "Yes! All my basic bitch friends be like, \"it's gorgeous outside! you should be outside getting sunshine and fresh air!\"\n\nUm, I can stay inside with my windows open, thank you very much. There is a reason I look 20 years younger than all my sunshine-loving friends.\n\nDon't let anyone guilt trip you.",
            "Nope.",
            "I always wanted to live near the sea.",
            "HELLLL NO, Its 115 outside where I live. It sucks",
            "Yes, but I was just outside for an hour playing Pokémon go and It was way too hot for that",
            "I used to live\nOn a beach and totally\nTook it for granted, miss it everyday. Now I have to really push myself to get outside to enjoy what I have here, even if it isn’t the beach. But when I go back to visit I am constantly outside and give in to every guilty feeling so I don’t squander it again. Not judging you for going inside, at least you went out for a bit.",
            "Same! I’m close to seaside heights but I’m too corona paranoid to go.",
            "Never. When I golfed I took every chance I had to play. Now I play call of duty. Never been happier.",
            "Nah.. Because reminicing about it 4 months from now would bum me out, besides, I am not required to spend time outside if i can’t be arsed to do so.. I have neither a gun to my head, nor recess..",
            "I lived on the beach for about 2 years.  I swam in the ocean about 5 times and would chill at the beach for an hour or two every other day.  I definatly knew I was taking it for granted and wasn't too move back.  But I'd probably do the same thing again.",
            "Yes but only because I caught shit for it as a kid. It's not really a big deal. Personally, I dislike hot and sunny.",
            "I don’t really like going out when it’s sunny because it’s incredibly hot and I’m just so uncomfortable. But I will fuck with a cloudy day or rainy weather.",
            "Sunny days, no. Comfortable, non-humid days, yes.",
            "No. But I'm in Arizona so it's understood that outside is Hell.",
            "I'm in Brisbane,\n and due to Covid, working from home. I'm at my desk working but I can see my yard where the lawn is bathed in sunlight. I'd love to be out there (or anywhere but at my desk). I don't feel guilty for not being out there but would maybe feel guilty about my job if I was!",
            "it really be the worst feeling to finally start being more active and outgoing only to have reality tell you that was a bad idea...",
            "out of 365 days a year you'll get a few to a hundred of them with good weather. What matters is what you want to do, not doing something because the weather says so.",
            "Yes, people living in tropical countries",
            "Completely. Having spent my life on the UK I have seriously had to work on getting out of this mentality now that I live in Australia - I’d never have a quiet day at home! But it’s still there, for sure.",
            "Not when I’ve got things to do. Music doesn’t make itself and no one promotes me but me. However, I’m hitting a bar tonight for a few peaceful drinks. First trip to one since second week of March.",
            "Not even an iota (atleast for me). As long as I get my internet; food; and electricity, I can live my life inside forever.",
            "YES",
            "Definitely with the guilt always. How dare I not appreciate good weather for being outdoors?! Sometimes all you can do in your best. Sometimes your best is staying in doors focusing on what you want.",
            "I was just thinking about this today! Since it’s cold 9/12 months of the year where I live I feel like I have to take advantage of every nice day. I’ll even designate the colder/rainy/cloudy days to get house work done so I can go outside on nice days.",
            "I grew up in a desert, so no... sunny weather has always been stay inside weather for me even though I also live at the beach now.",
            "Yeah, it's definitely because of my mom.",
            "Nope. Enjoying all the engineering and technology that goes into keeping my ass cool on a hot day. \n\nEnjoying the fuck out of it.",
            "Not at all. Born at the beach and I never understood why so many people want to spend all day there. It's nice to take a walk when its cooler and the suns going down but its so noisy, crowded (great for covid huh? /s) and dirty honestly. In general I like to go outside when its not so bright, during the evenings, but when it's hot and sunny I go back inside not long after going out and regretting going out in the first place. I will stay all day inside if I can. Maybe I'm just used to the dark. The sun is a giant bright ball of death to me.",
            "Naw. The sun is a deadly laser.",
            "No but I do use the rain as an excuse to stay inside. I'm in cali though the weather is more often sunny than rainy.",
            "oh my gosh yes every time it's beautiful out I feel guilty not being outside. This has led to me doing active outdoorsy stuff on days when I'm super tired and/or have other things to do lol",
            "I work midnights so it’s not guilt. Disappointment yes, but not guilty.",
            "Personally, I hate when it’s sunny. I want to keep my windows and blinds closed up but I don’t because it irritates my wife. I love going outside when it’s cold and cloudy or rainy, but when the sun is shining the last place I want to be is outside. It’s too hot, it’s too bright, and I want to be comfortable. \n\n\nI live in southern California, for reference.",
            "people are always wrong  \n\n\nsunny days are overrated",
            "Na. In Florida a sunny day could mean heat stroke.",
            "Yeah.  Only if I haven't been outside",
            "I’ve lived in Jacksonville for almost a year. I’ve been to the beach maybe 5 times? It’s totally fine. I mean, I do like to be outside when it’s nice out and I do feel guilty when I’m not outside on a beautiful day, but I think everyone does that and feels the same way. It is important to get outside as much as you can, but dude, if you don’t feel like it, who cares? I’ve spent days locked inside reading or playing video games on beautiful days before. It’s all good.",
            "I do! Good weather makes urban exploration easier",
            "Hell yes",
            "You say it's nice only a few months a year I'll guess your either on the north east coast or Oregon Washington (if you're in the US. \n\n\n\nYes, you suck, get out there and enjoy the weather. I can't so you have to.\n\n\n\nLol, just kidding. Enjoy what you want. I've lived in coastal communities and tourist towns. It's funny what we can take for granted. Most think, \"that's a vacation spot\", if you live there it's home. It's like if you live near a ski resort, do you really want to be out there with all the tourists on a holiday weekend? No matter how good the snow is? I don't.",
            "Oh, you mean *play video games with the window open* weather?",
            "I worked from home even before Corona and often I’d just go outside and look at the trees or watch some birds for a bit and then go back in.",
            "No. Covid.",
            "Yes and no. Yes, because it feels like such a waste. Our lives are short and I feel the need to enjoy it while I can.\n\nNo, because live in a homogenous suburb in a very red state with a predatory police presence and Ive had too many unpleasant encounters on a walk to enjoy a sunny day in the neighborhood.\n\nI hope to move out of state soon lol",
            "Dude, I live in FL and most of my north friends think I spend my days on the beach. It’s rainstorms every day. Appreciate the weather from inside.",
            "I call it “sun pressure” and I refuse to feel obligated to do anything just because the weather is nice.",
            "If you’re having fun staying inside it doesn’t matter.",
            "No lol sunny days are only worth it in winter, leaving your house when it's +30°C shouldn't be a thing. Why did our ancestors stop moving towards the north smh literally brain dead",
            "Yes...especially because I live in Chicago so there is a very narrow window of days where it’s actually enjoyable to spend the day outside.",
            "If you're not comfortable outside, it's not nice. \"Nice\" is subjective. \n\nPersonally I think it's nice outside when it's cloudy or mildly rainy. I don't want to get soaked, but I don't do well in hot weather or direct sunlight and a little bit of rain doesn't bother me.",
            "I live in UK so we don't get a lot of sunny days, except lately it's been really lovely. Though I rarely go outside these days. I often gaze out the window at the blue sky and just appreciate it as much as I can!",
            "It's the opposite for me, CA is always sunny so not being out when things are cloudy and cold is like a sim for me",
            "Your free time is your free time. Enjoy none, some, or all of the warm weather. There's no FOMO in the game of Outside.",
            "Nope.",
            "Living in western Washington the good weather is always wasted because we barely get enough",
            "Worst is NFL Sunday’s when it’s a gorgeous fall day....",
            "It's not sunny if the blinds stay closed.",
            "I love the sun. I love by the beach and have 2 young children. But man is it a pain going out sometimes. The rainy days give me a somewhat excuse to let them watch tv in the ac",
            "#NOPE",
            "Yes. I do. People always say how crappy it is in the cloudy rain. No way! I absolutely LOVE cloudy rainy windy days. Dont like the sun much, but people bash it in your head to love the \"summer sun\". F that. I wait for dusk then I'm comfortable leaving home. Besides work I limit the daytime.",
            "Omg yes. Where I am it’s only warm for like 3-4 months a year (& too hot for a good portion of that) so every nice day that I “waste” I feel so guilty. Then I count up the rest of my life expectancy and realize the days really are finite and feel even worse.",
            "Yes!  Worse so now because I have kids and I feel like we should go outside and play.  Thankfully, it's freaking humid out these days so it's a perfect excuse to stay inside and watch Netflix or play video games all day.",
            "Damn do you people just look for shit to feel guilty and miserable about?",
            "no way, hot sunny weather is the actual worst",
            "I definitely feel this way but, also work in the hot sun every single day. Some days I just want to lay on my couch and only go outside to walk my dog.",
            "Nope! I avoid sunny weather like the plague, haha. I feel guiltier if I 'waste' a cloudy day, because those are the few days I can be outside without overheating. (I don't sweat, so no temp regulation when it gets warm.)",
            "I live in a similar case aswell. I live by a river so when its a nice breeze and the sun is setting the sky really looks beautiful. I am a huge gamer myself so I spend tons of time inside. I would sometimes guilt trip myself into going outside but then I realized, there is no need to guilt myself. Everything is great in moderation so just think about that the more time you spend inside, the better it will feel when you finally go outside. :)",
            "Also for waking up late on a nice day",
            "yes, unfortunately. i've been feeling this 'put down' feeling for not going outside every single summer. makes me feel like im missing out on something or wasting my life away? recently been like: where would i even go in summers like this b/c i live in the concrete jungle of a damn city",
            "I live in CA and yes. But with the SIP, it's not as bad. I feel like I have an excuse for being a couch porato.",
            "Yes, so much.  And like you, ill even spend some time outside (usually an hour or so for a run) but i look outside, especially on beautiful evenings, and feel bad that im sitting inside. \n\nWhen its really hot out, my excuse is its too hot. Where i live its very humid too, so you walk outside and start dripping sweat if youre moving or not. \n\nI think i feel especially bad because if im inside, im usually watching tv like a bum.",
            "It's near a hundred degrees outside and over 80% humidity.  Hell no.  Air conditioning is man's triumph over nature, and I'm not going to cast it by the wayside.  That said, I am making use of *dry* days to go do shit.",
            "YES. Mostly because I live in Canada and summer is limited",
            "No. Going out in this heat is miserable. It's only natural to want to stay out of it.",
            "No",
            "I'm super pale and burn if I look at a lamp too long, so no, I don't feel bad. Lol",
            "Not really.",
            "As an Icelander who rarely got to experience anything more than 20 celcius until I came to Norway, big time. Even here the good weather only really lasts from late May to like mid August so I got a month and a half left until it starts to cool down and get dark and wet and shitty again so I really should try and get out even just for like 30 minutes a day or something.",
            "I actually started running in the morning just for this reason.\n\n\nI fucking hate running in the morning, but fuck I don’t wanna feel like I wasted a day.",
            "I’m an indoor person, yet I always feel guilty whenever I’m not outside when the weather is good. I always feel like I have a chance and I’m not using it.",
            "No, texas is too hot in the summer for thst bullshit.",
            "I worked outside in 92 degree weather most of the day\nOn my\nProperty . I am getting one hell of a farmers tan",
            "If it's hot enough for me to sweat by standing, then no cause I ain't dealing with the swamp. But any other time absolutely I feel like I could be getting so much done!",
            "I work the night shift 6 days a week. Saturday is my only day off. I sleep until 5pm and then I’ll sit and play ps4 until midnight. I feel no guilt whatsoever.",
            "Nah, I hate summer. On a sunny cold day however I would like to be outside, but dont necessarily feel guilty",
            "Naw, I live in SD and there are plenty of sunny days.",
            "tbh I think that's where my love for rain originated from. At first it was probably bc it made me feel less guilty for staying home playing video games.",
            "Nope. I prefer to keep my fatass inside. Unfortunately I'm walking my fatass off so I spend a few hours everyday walking. Can't wait until I get to a healthy weight and can start staying indoors again as much as possible. Then again I think I've become addicted to walking. I was bummed when I couldn't walk this winter because it wasn't safe. I should probably get a treadmill so I can keep up the exercise and stay inside.",
            "You know that comic where the guy shuts the shades because the sun is causing a glare on his monitor. That's me. No guilt!",
            "Ya its been pretty good weather in Denver and I am going crazy cuz I don’t know what to do and don’t have anyone to do it with. Moving alone is weird.",
            "Yes!!!!!!! I always feel this way. My son is 5 and hates the heat!!  As do I! Obviously we get our fair share of good/sunny weather, outside time and vitamin D, but sometimes it's nice to stay in with the AC and just relax and hang with my little best friend. Im a single mom and my son is autistic. So that makes things a little harder (sensory issues etc.). I get shit from my parents all the time . They don't get it! I tell them all the fucking time to STFU!! As I'm still trying to recover from my fucked up childhood. So leave us tf alone lol but.we live in the same town. I refuse to let them make me feel guilty or like a bad mother bc my son doesn't enjoy the beach like other children. Here's a big FUCK YOU TO BOTH MY PARENTS!! They are not the ones who have to handle the meltdowns and tears and fears and sensory issues and this or that. Ughhhhhhhhh. \n\nDo whatever the fuck makes you happy! This is for everyone who took the time to read this. Seriously! Fuck everyone's opinions and judgements. Live life for you and don't let people make you feel guilty or less than! **Especially your own freaking parents...\n\nSorry I got off topic. Obviously my parents piss me off and this is one of our biggest arguments. Mind your business, he's MY CHILD.",
            "Oh. My. Gosh. This is the thing I have felt my entire life. But I think it partially stems from living in a place that mostly winter. So the 30 nice days a year we have are a big deal.",
            "No, I work outside, I enjoy the A/C.",
            "No way, I’m happy when I’m not outside during sunny days lol. I can’t stand the heat or strong sunshine. If I could choose I would live my entire life in the winter or fall.\n\nEdit: except during the night I guess: as long as it’s not too warm I do like a clear sky during the night.",
            "Why? Here it burns my skin, and i don't want that",
            "Hell no. I love the winter and cool fall days. WV summers are muggy and you can't breathe. Add asthma and medications into that.",
            "Naw, I live in a tropical country where beach season is all year round. It's nothing special when you have it all the time.",
            "No. I really don’t. \n\nJust cuz it’s hot and sunny doesn’t mean you have to go out in it. Sometimes you gotta sit round binging Hell’s Kitchen eating ice cream and loving it",
            "Asthma and allergies... I feel better inside and I can see",
            "I live in florida so basically every day is sunny. If i felt guilty about it then i would always be guilty.",
            "I do feel guilty considering I live in Colorado and the last couple of years we’ve only had a couple of good months. It’s cold from October all the way to March/ April. Especially if your more of the active type",
            "Only in fall through spring. The summer is hell where I live. We have triple digit temperatures and very high humidity.",
            "Yes but in here we got humid sunny weather you legit have hard time breathing when its 25c+ but i absolutely love it",
            "I work outside. So uh, no",
            "When you live in Arizona, not really. 😄😄😒😒",
            "Lol.. yes. I love when it’s raining or snowing so I don’t feel obligated leaving the house. My wife is the complete opposite.",
            "Yes. Always. We only gonna get so many nice days, it really is a shame to waste em. Even working outside for 10 hours I still feel lile I should be outside when I'm home, if its bearable. Also I get a second wind just after dark. I think its cus mentally I'm not required to make hay if the suns not shining, so I can fuck off with out feeling guilty.",
            "I have sooo much guilt about this, even when it’s unbearably hot or ive already been outside all day",
            "No. I have a 2 year old and still dont. Especially with what is going on right now. No way in hell you need to be outside for shots and giggles else it might end up being your last day.",
            "Yes",
            "I don’t consider anything 85+F to be good weather. It’s too hot and uncomfortable. I would much rather be inside in the AC as well.",
            "Nope! I used to, though!\n\nMy white parents are both circulating through the dermatologist’s office with frightening frequency to get developing face, scalp, and arm skin cancers removed courtesy of their kind and generous days of doing midday yard work in the 70s and 80s to keep the house looking nice. (God bless them for that.)\n\nI’m staying out of the sun as much as possible between 10am-3pm and supplementing my sunlight deficiency with high doses of Vitamin D. No problem going out before 10am and after 3pm, though.",
            "Literally never.\n\na) I don't really like being outdoors.   \nb) I *especially* don't like sunny days.  Give me cool, overcast days any day.   \nc) Who would I even owe that guilt to?  The weather?  The sun?  Me of future and past on days that aren't like that?",
            "Nope. I'll enjoy my day how I damn well please.",
            "Only if I'm on vacation somewhere nice or if it's the middle of winter. At home in the summer it's usually too hot and muggy to enjoy being outside in the sunshine.",
            "It's actually a major source of depression for people that move to a tropical paradise.",
            "I do because it makes me feel like I wasted a good day to do fun stuff like hiking, canoeing, gardening, etc. But typically it's because I work so it's not like I can anyway.",
            "I live in Miami where there are like 300+ sunny days per year, and I still feel bad when I look out of my office window and see sunshine. So I step outside for 5 minutes, catch fire, melt and then crawl back into the AC so that I may continue to live.",
            "Not if it’s hot",
            "NO.",
            "Here in California it almost never rains. Can't say I feel bad when I stay inside!",
            "I live in Florida. On a good day, sunny is uncomfortable. Today it was downright hazardous.",
            "Kind of, yeah. On the other hand, I got through a couple of lessons in a Fusion 360 course, straightened the house a lot and binge watched a season and a half of a new show.\n\nI've always found it unnatural to relax, but I'm working on it.",
            "Nope! My ancestors spent thousands of years perfecting the art of the indoors, and it would be disgraceful to throw away that legacy.",
            "I live in Hawaii, and definitely yes.",
            "I live in south Florida and when I walk out for like one minute I’m already drenched in a gross sticky sweat from the heat and added humidity. I don’t feel guilty cause it literally sucks so much",
            "I find the summer heat too much on a sunny a day so I rather stay inside. I don't even go for runs in the heat.  I am also not very used to heat outside of saunas. \n\nA cloudy day however I will probably take my reading or gaming outside. Fishing is also most preferred with a light breeze and slightly cloudy imo. I am not really fishing to get fish, I just like the serenity. \n\nWinter is different though... there isn't really any sunny days then.",
            "Not for me personally. I like to look at weather and pretty much everything like there will always be more of it another day, so don’t feel guilty for missing a good day.",
            "Nope. Fuck what other people think about me and my hobbies.",
            "I feel this too, some days I care but most of the time I feel happy regardless... If you had fun it doesn’t matter what you do. Also too much Sun exposure is bad; 2 hours on the beach is like a whole week.",
            "You're inside on a sunny day!?!?!",
            "I live in minnesota so whenever we have good days in the summer I feel they are wasted if I dont go out. We have a good 5 months of winter or colder weather.. if not 6 so a good 95 day makes me feel wonderful.",
            "Humidity absolutely destroys me.",
            "I live in Phoenix, I have no quilt staying inside during summer",
            "Gamer here. My answer is no.",
            "Yes, but 1) my skin is highly reactive to sun, turning bright red and hot quickly, and takes about 30 minutes back inside for it to calm down. 2) It’s frickin’ humid out there and I feel like I need a shower just walking to my car sometimes. 3) Mosquitoes live out there and they LOVE me. That feeling is NOT mutual. \n\nSo, I’m good.",
            "I doubt many redditors will answer yes to this. I hate sunny days, personally. They make me so sleepy.",
            "Nope. Being outdoors has never been my thing. I don’t get it at all.",
            "I do. Especially at the end of summer.   And worse than that when the pool is about to close for the summer and I know my kids will be a year older and maybe want nothing to do with me next year it almost makes me physically ill to think about not getting every last second of time with them.  \n\nI miss tons of sports on tv during the year because I simply cannot bring myself to watch from the couch if it’s remotely nice outside.",
            "all the goddamn time",
            "I work third shift. Fuck that wasting good weather crap! On a bright sunny day I close my blackout curtains so I can sleep.",
            "Yesss!!! Like today. I went outside to throw trash out. Was super nice and kinda cool (around 6:30). Remembered I needed oil change. Got tools, changed into old clothes. Opened hood, got items I needed…and it started to rain. \n\nNow I feel guilty for not going outside earlier, not enjoying the outdoors, AND not doing the oil change.",
            "no",
            "Nope. I think I have reverse Seasonal Affective Disorder.\n\nI live for gloomy overcast days.",
            "I guess it depends where you live. In the UK for example, you’d probably be lynched for not enjoying a sunny day as we have so few of them, but tbf you see people with their tops off like it’s the height of summer in anything above 15 degrees.",
            "Florida here. I'll be going outside in October, and not a minute sooner.",
            "I feel guilty too.  Only because of social conditioning, you must be outside in good weather.  Why?  all it has given me is so many moles and freckles.  I have had so many removed and have to get my skin checked every year.   The silly thing about it is that I am not an outdoorsy person.  I prefer to say inside in hot weather. Happier to go out in cold weather but not for long.",
            "I never feel guilty about not being in the sun because it will toast me to a crisp in 30 minutes or less.",
            "I only feel guilty about it in the winter, and wish I’d gone outside more when the weather was nice.",
            "I have't been able to afford a trip to the beach since 1999",
            "With my complexion?!",
            "Nope I was an outdoors guide for 3 years so I've seen pretty much every sunny day of those 3 years. So now I appreciate staying inside from time to time.",
            "Absolutely not. Live your  life however you want as long as it doesn’t hurt others. No reason to be guilty about that.",
            "I like dark, rainy days where I'm almost invisible!",
            "I will soon, but not right now. I work outside 40 hours a week",
            "Yes at times but i usually just go for a walk or out with a friend to fix it then its back to the  inside",
            "Not when it’s humid as fuck.",
            "I have massive FOMO because my wife is an extreme homebody and I don't wanna do stuff alone without her, I'd rather she come with me to enjoy this weather. :-(",
            "Well, I tried to get the most from my day at the beach, forgot.to put sunscreen on my belly and now I can't fucking touch it and have the stupidest tan ever.",
            "Nope. Allergic to the sun,",
            "remember to invest in a good way. https://www.boredpanda.com/past-young-people-look-older/?utm_source=google&utm_medium=organic&utm_campaign=organic",
            "Hell no not with this corona bs better safe than sorry.",
            "It’s so hot and humid right now where I live that it makes me curse when I step outside the door. Eff that!",
            "Slightly different,\n\nBut on days before I go back to work and the Sunday Scarries set in, i internally struggle with whether I will regret staying in or going out more. Like if I go out and do stuff, I'll be upset that I wasted my last 'lounging' day before work; but if I stay in, I'll wish I'd taken the opportunity to go out.",
            "I honestly take it for granted in SoCal where we usually have 300 days of sunshine a year. I love cloudy weather so usually I prefer cloudy weather but I have wanted some good sunshine days.",
            "I lived in Hawaii for 15 years. When it's sunny all the time you get over it after a while.",
            "All the time! Ugh. Living in California, it’s the bane of my existence. Born in the summer, but it’s my least fav season. LOL. My fav season is fall - more chill, a bit less sun going into October/November. I get more done when it’s not sunny.",
            "I couldn't care less about what the weather is doing. I'm staying inside.",
            "Im from Australia we have good sunny weather 70% of the time. Im outside for like maybe 20% of that time. It doesnt really matter its what makes you happy",
            "Yes yes yes 100%",
            "If you enjoy spending 2 hours outside, then spend 2 hours outside! As long as you’re enjoying your time inside and outside, you shouldn’t have to worry about how much time you’re spending doing anything. It’s quality over quantity",
            "Nope. Went outside for an hour or so today to do some grill maintenance, and was sweating buckets through the whole thing. When I finished I cleaned up, put my tools away, went inside, and sat in the dark with the A/C on full blast. I regret nothing... except for going outside.",
            "Yes its sunny here and it makes my depression worse :/",
            "Yes",
            "This is my whole life",
            "I feel the same!",
            "No. Not really",
            "If the outdoors were so amazing humans would not have spent their entire history perfecting climate controlled shelters.\n\nSure nature is pretty but it comes at a cost. Heat. Cold. Wetness. Bugs. Etc.",
            "I live in North Dakota and this is such a real thing because our weather sucks the majority of the year. I feel like every day of summer I should be out enjoying it, but it’s not possible. I’m already feeling guilty about tomorrow because my plan is to get inside stuff done. My kids also would live outside if I let them.",
            "Yar, I call it Sun Pressure",
            "I do sometimes but also do whatever makes you happy not what makes others happy!",
            "I don’t, but I feel that way about rain, if it’s raining, I gotta go outside",
            "Yes I do!!",
            "Yes I do!!",
            "Nope, not anymore.  I live in a place where it's almost always sunny & I'm 6 miles from the beach.  I go to the beach maybe 10 times a year, if that.  I used to feel ashamed & then someone said, \"If you lived in Orlando would you go to Disney every week?\"  And of course not.  The sun & beach are always there so I can go whenever I want.",
            "Um. There hasn't not been a sunny day with 90+ degrees for the last few months. So no.",
            "I felt like this today and ended getting my car stuck in mud. Shoulda just stayed inside and played video games",
            "This belongs on r/DAE",
            "Nope. I am extremely sensitive to heat and have a mild sun allergy. Sometimes I wish I had things to do to make me wanna go outside, but right now that's not the case. In fact, I have blackout curtains on my bedroom window. (And yes, I do have depression lol)",
            "All the damn time",
            "I live on a subtropical island with some of the world's best scuba and temperatures in the 80s and 90s for about 8 months of the year.\n\nI spend those 8 months indoors. I do not feel guilty about this. I strongly dislike the heat, and the sights aren't worth it.",
            "No, because the sun rises every morning and sets every evening.  Why should I feel guilty when I've got a guarantee I'll get the opportunity again countless times in short order?",
            "It’s 102 out right now fuck no I’m not guilty for staying inside on a summer",
            "Nope. I live in Texas and when I step outside I'm immediately drenched in sweat from the 98% humidity. Id rather sit inside in the ac and play animal crossing. But I also hate warm weather, ill take a cold rainy day over anything.",
            "Fuck no",
            "Extremely",
            "No. I'm drinking beer on my balcony and replying to your Reddit post at the same time!\n\n\n\n*technology*",
            "Fuck that, a sunny day is a hot day.",
            "Sometimes, but then I realize if I stay inside I’m not being bombarded with radiation so...",
            "r/gaming",
            "NO! I only go to the beach when it rains, besides as a plus there is nobody else so nude all the way!!!",
            "This is true only for the morning. After that the sun is deadly laser that burn everything. 30-40 °C is not a joke.",
            "Yes and it’s why I like a rainy day here and there",
            "I feel guilty for not being outside on a nice day. If it's too hot, it's not a nice day. Heat/humidity is a killer, just like freezing temps.",
            "No. i look at reddit all day even if it's sunny.",
            "To soothe the guilt I watch 3-6 hours of Law & Order each night",
            "No but that's mostly cause I live in Florida and a sunny day outside just means it's hot enough to kill you",
            "Yeah, but nothing beats staying inside with the A/C blasting on a hot and sunny day.",
            "I struggle with this every year! Your average person experiences winter blues, but I end up slightly depressed in the summer because I put so much pressure on myself to appreciate the sunny days to its fullest extent.",
            "All of human history has been one long, ongoing attempt to create shelter and protection from the elements. I feel like it would be completely disrespectful to generations of my ancestors to go out there when I have ac, internet, and unlimited cold water in here.",
            "Also, how can you possibly improve your Destiny 2 ranking if the sun glare is on the TV screen? Darkness exists for a reason, and it's for your accomplishments, not your appearance.",
            "This isn't a new thing, interesting!",
            "Oh man, people talk about how nice it is in NC all the time. If I go out to do yard work in the day I am dripping in sweat, sunburned, and COVERED in mosquito bites. I know it must suck to live somewhere where the weather isn't that temperate but there's still so much to have to deal with when going outside here.",
            "I'm happiest when it's cloudy, that way there's no expectation of going out, staying out and 'enjoying' the sun. If I don't go out, I'm 'wasting' the beautiful weather. I think it's from spending part of my childhood in rainy England.",
            "Depends on how drunk I am",
            "I do sometimes. It helps to have a big window looking out at the blue skies, instead of being in a dark room.\n\nBut I live in Queensland where it's \"Beautiful one day, perfect the next\" so there's always tomorrow.",
            "haha nope i like being a cave dweller",
            "I used to regret not going out on fridays and saturday’s but i gained no valuable skills from staying in. So i’d day go out and have fun. Time flies",
            "Not at all! I love being inspired any and every day. Weather means nothing to me, personally. If it’s raining and I want to go outside, I’ll go outside. Same thing applies to the sun; if it’s sunny it doesn’t mean I have to go out and enjoy it. I can see it just fine from my room :)",
            "I feel guilty when I waste not going outside on a rainy day, it's very depented on where you live.",
            "If it makes you feel better, you are doing your part staying in for quarantine, I’ve seen many lose their life to corona even when they were healthy. Take care",
            "I live on the shore and since I moved here I feel way less bad about not being outside on a “beautiful day”\n\nI’ll go outside when I feel like it damn it",
            "Not when it's 95+ degrees outside.",
            "nope",
            "Nah kinda hate the sun since my eyes are pretty sensitive to it. If anything I’d feel bad about missing out on a cool cloudy day",
            "Can confirm this is a BOLC class then?",
            "Where i live is basically winter from oct- april. Spring lasts about 6 seconds then its hot as the devils nutsack until late sept/ early oct and we are lucky to get a few weeks of proper fall without it being solid rain until snowing. \n\nIts too fuckin hot in the sun. I take the kid out in the morning or evening. Fuck that sun.",
            "I was born and raised in Tucson where it can reach 118 in July. I do not have a good relationship with the sun, even after moving to the PNW. I’m the one who prefers to hike in the rain. I like a nice sunny day from time to time, but I’ve had my share of sunshine in my lifetime. I still feel guilty staying home on a sunny day, but I think that’s because I worry about what other people will think of me “wasting” my day.",
            "I feel this way! But I try to make it positive. I use it as motivation to get out and run. I also find just sitting on my front porch reading scratches the itch too. I try to limit my use of my PC during the day in summer. Forces me to make plans outside to keep busy!",
            "Yep. I'm off work right now and have to force myself to get outside. It's mostly out of laziness. I don't feel like getting dressed or going out. I'll do everything I need to do in doors. I also have shitty neighbours across the street. It seems every time I want to enjoy my balcony, they're outside smoking and just stare at me.\n\nI also don't do well in hot weather. Anything above 22C and I'm miserable. Weather like today is perfect where I am.",
            "To be honest, i hate sunny weather. It makes me feel how my depressed friends have described depression. The sun and I have been mortal enemies for a long time. \n\nOvercast days, like the clouds look black and it isn't raining, but the street lights are on at noon. Those are the best fucking days in the world. Even lightly sprinkling is fine.",
            "this is why summer depression is worse imo, gloomy weather making it socially and internally acceptable to barricade myself in my bed vs being told to go outside to enjoy the sun.\nit's too bright and hot, i feel pressured to be less lugubrious and forcefully cheery, can't wear comfortable dont-look-at-me uniform aka sweatpants and hoodies and people won't leave you alone.\n\ni also get this for sleeping till noon/late afternoon, i know i wasted an entire day and should have used sunlight hours but here we are",
            "I've been getting sunburnt cause my job",
            "I feel this way for evenings/nights. When I can sit outside. Listen to some songs and watch the stars. And I try to do this everyday without fail.\n\nI just love space so much. Beautiful and terrifying. But beautiful.",
            "Been a graduate student with a busy schedule for years. Live in a place where winters are short and it’s generally sunny and warm outside. Always felt bad about not getting to be outside much. But now that I know how much sun can hurt your skin and how you’ve to be so careful and have sunscreen on all the time (I don’t even think to put any on), I feel like long work hours inside might have been a blessing in some way.",
            "Yes. I think we all feel guilty for not taking advantage of the beautiful things around us. I live in Colorado and while I hike and do all sorts of outdoor activities, I’m still like, “man, I need to get up to the mountains more. They’re right there. Why am I not doing that more?” But I also have the thought of “man. I should really go to the coast and go sailing.” But it’s easier for me to dismiss that one, because I have a family and responsibilities to take care of. I can’t just leave and spend a bunch of money without planning or thinking about it to get to the coast. Meanwhile, it’s a 10 minute drive to the mountains, so why the hell am I not taking advantage of that more often?",
            "lol no.",
            "35 years old is not a kid.",
            "I feel guilty when its raining and I'm inside",
            "I only feel that way if it's a season I like. During the spring and fall I'll feel bad if I don't take the time to enjoy walks with my dog. I love hearing the crunching leaves, smelling the crisp or floral air. \n\nSummertime is way too hot, and I don't have the money for more sunscreen just so I can be outside.",
            "Yes. Which is partly why i don't do my homework until late at night.",
            "This, combined with my untreated ADHD causing intense executive functioning on weekends, actually made me incredibly depressed lmao. I'm trying not to feel that way anymore.",
            "nah i live in an area with good weather 95% of the time i actually prefer bad weather",
            "I just get pissed that there is now a glare on my television.",
            "This was me today. I drove my van to  twin lakes on friday and stayed there, then woke up to Lake Dillon this afternoon spent a couple hours at the marina just watching a movie or two in the van while it was perfect outside. Debated if I should go sit at the docks or by the lake, but wanted to sit in the van for a while.",
            "Nah I feel no guilt at all",
            "Not really. For me it's exactly the opposite; I hate it when it's sunny, mostly cause due to my skin condition, extreme sweating and severe itching.",
            "Nope , I hate hot sunny weather , I feel bad for wasting the cooler days",
            "If only my bosses would agree with that",
            "Lol no. Sun is awful. It's hot, sweaty, hard to see, damages your skin, causes cancer, etc. I would feel more guilty not going out in the rain. I cringe when someone says \"the weather is nice today!\" when I can't see a single cloud.",
            "I feel guilty if i sleep through a storm",
            "As an Australian, lol no. They're all sunny days. Literally the opposite, if there's a drizzly grey day I'm like \"shit, should have went hiking or something\". It's rare to be able to stand outside not in the shade.",
            "Whenever i sleep in past 9 i feel like a failure.  It actually gives me extreme anxiety when I'm not up early and productive,  with intense feelings of guilt.  It absolutely ruins my day. And it gets to the point where it feels like im not able to leave my house at all.",
            "*stares at hot oppressive tropical sun*",
            "This is completely me. I sleep in till very late, and literally hate myself for wasting a nice day. I live in Canada and I waited so long for summer, but all I do is sleep in and I feel so guilty :(",
            "Combien ça coute 6 vole",
            "Not really right now as the average high has been 104 to 108 degrees.",
            "Yes! All the time, and especially now since I have a three month old.",
            "Nope. I hate the sun. It's hot and sweaty and it gets everywhere.",
            "You went out for two hours! That’s a solid endeavor.\n\nI’ve definitely felt guilty about staying in on a “nice day”. I think it would be different if I had a private yard to enjoy the day. I want to have personal space so I’d be lounging in a comfortable setting. But, that’s a major luxury that I don’t have access to at the moment so instead I reframe and find the gratitude that I have shelter from the outside world. Being outdoors 24/7 isn’t ideal for most so, I try to appreciate the apt with good air con. Also, I tell myself “Nice weather will be there. Weather itself isn’t going anywhere.” I also love and appreciate rainy or cloudy days, feel less guilty about it because “Oh, the sun isn’t even out.”",
            "Not if you have no idea it’s a sunny day because you slept through it",
            "No, fuck the sun. My eyes are very light sensitive and if it’s too sunny I literally can’t see out there."
        ]
    },
    {
        "post_id": "b0slpb",
        "author": "None",
        "title": "If I kept water in my mouth for 8 weeks what would happen to it?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/b0slpb/if_i_kept_water_in_my_mouth_for_8_weeks_what/",
        "score": 15589,
        "num_comments": 606,
        "created_utc": 1552517493.0,
        "selftext": "Like I breathe through my nose the whole time\n\nI’m really high\n\nEdit: holy shit 24 hours later I had no idea I posted this lmao, thank you for all the very informative answers. Definitely learned something x",
        "permalink": "/r/NoStupidQuestions/comments/b0slpb/if_i_kept_water_in_my_mouth_for_8_weeks_what/",
        "comments": [
            "Oh man, it would smell SO BAD. Bacteria would multiply in there like crazy, because you wouldn't be cleaning it or eating/drinking anything to flush the bacteria out. If morning breath is 8 hours of uninhibited bacterial growth, imagine your breath after 1,344 hours of that. ",
            "So I just did it for 10 minutes. 0/10 would not recommend. I put about 1 sip in my mouth and after 10 minutes I had to swallow 3 times. \nJaw hurts. Was nice until it got warm though. ",
            "[deleted]",
            "Bacterial infection from stagnant water. And you'd be REALLY hungry.\nI assume you'd have iv for this lol or you die from dehydration. ",
            " Probably just get warm, become a mixture of water and saliva. Good luck not swallowing for 8 weeks though.",
            "In fifth grade one time just before the school day was over I decided to see how long I could go without swallowing. So I just didn't swallow. 30 minutes to an hour later (can't remember exactly) it was time to get on the bus home. My mouth had filled with spit completely. My cheeks were wiggling and trembling from the sheer amount of spit. There was so much spit I didn't know how to dispose of it all. On the bus I decided to just let it go. I made a massive puddle of pure spit just in front of my seat. I feel bad for never saying anything. I bet the guy who cleaned that up was like, \"What the fuck.\"\n\nProbably something like this would happen to you. ",
            "I bet you’d prolly die of starvation ",
            "[removed]",
            "Since you're not drinking anything else unless you're hooked up to an IV, I'd give it 3 days before  it was all or mostly absorbed into your blood through the walls of your mouth.",
            "This is a really interesting question.       \nI think it would just get all slimey, and gooey.",
            "How high? ",
            "You could answer this yourself probably in just a few minutes. For the same reason you can't hold your pee forever, you won't be able to avoid swallowing in a shot time either.",
            "You habe wet mouth then",
            "You would fall asleep and potentially aspirate it, or drool it out.",
            "I think over time it would just get absorbed by your mouth. If, this didn't happen you would need to eat at some point. If for some reason you didn't need to eat then it would get mixed with loads of spit and basically just become mostly saliva. If somehow none of this happened, I guess it could get some mouldy or something. From experience I know that gone off water doesn't taste different but it stinks really bad so I would suggest you don't try this",
            "I imagine your body would absorb it. ",
            "You’d probably die of starvation ",
            "Some weird ass shit pops up on NoStupidQuestions late at night.  You know what though? I like it! ",
            "Day three. You are thirsty as fuck. You aint gonna make it 8 weeks. ",
            "Yo OP I envy and admire your high but change your question to one week",
            "it would probably absorb into your body over time and just become saliva.\n\njust try doing it for 2 hours it just seems to disappear the longer it sits",
            "You would create life in your mouth. *no pun intended* ",
            "Everyone trying to be clever with answers like, \"You would die of starvation\" or other similar answers are really annoying. I mean, no shit. \n\nI think they mean, in this hypothetical scenario, ignoring obvious side effects of actually having to physically hold water in their mouth for 8 weeks, what would actually happen to the water i.e. would it absorb, etc.",
            "I thought this was posted on r/jokes lol ",
            "S p l a s h",
            "Who else read the comment about that guy who kept it in his mouth the whole day at school???",
            "You will die since you won't be able to eat.",
            "/r/waterniggas ",
            "The bacteria would be on the verge of developing mathematics and engineering.",
            "The water would absorb into your body over time, so you'd be fine...\nExcept, that you would die of starvation as you would have gone without eating for 8 weeks.",
            "follow up question: would it even last 8 weeks? let’s say not even a to y bit spills out while your sleeping at all and in general none is lost by falling out of your moth, wouldn’t it all be absorbed by then? ",
            "I watched an OCD help story on youtube and one of the guys had an ocd that made him scared of admitting to crimes that he didn't commit. He would hold water in his mouth for hours while catching trains and in public because he knew if the water was still there\nhe hadn't said anything. He said he had to stop doing it because it was rotting all his teeth away. ",
            "You get to join us at r/waterniggas",
            "You'd die of dehydration, and it would spill out when you fall over. Then it would do what normal spilled water would do.",
            "Your mouth or the water?",
            "hmm... I guess it would become like, proper hot. Your mouth might get an infection? I dunno, man. Good question. ",
            "You would starve to death \n\nYou would die of thirst\n\nIf you swallowed it, you would probably get immensely ill or die because of all the bacteria built up into it\n\nIt would have a warm and slimy feel from mixing with your saliva \n\nYour jaw would ache and your urge to swallow it would drive you mad",
            "You would die of thirst.\n\nAlso, your mouth would probably drie up after only a couple hours.",
            "Am also high can someone answer this with science please?",
            "How do you eat with your mouth filled with water? ",
            "You'd ironically die of dehydration after ~3 days, unless you learn to drink through you nose",
            "Your saliva would fill your mouth that much in 8 weeks anyway. You’d be leaking stank ass swamp-mouth water for weeks! ",
            "My question to OP is: why this time frame of 8 weeks? How come not less or more weeks?",
            "Wouldn’t it just get absorbed by your body? Some of the skin in your mouth is REALLY thin and I think 8 weeks would do it",
            "You'd eventually swallow when dehydrated (you won't be able to stop it, your body will just be like I NEED THAT NOW) or your mouth would just absorb the water when you become dehydrated.",
            "It would pool in your throat after you died of thirst",
            "$100 says that it tastes horrific.\n\nBut really it would just become its own little ecosystem. Not really something you want in your mouth. You'd probably also get a bunch of diseases, since in the warm wet water it will replicate a fuckton.",
            "Trying to tackle those pasties?  Your best bet is to make yourself salivate with a small piece of lemon or an unripe berry or something like that.  Water washes the saliva out of your mouth and it ends up feeling dry again soon after.",
            "This question just made me sub to this subreddit. ",
            "It will evaporate...",
            "Have you ever smelled \"fire suppressant system water\"?\n\nIf you've ever seen a video of fire systems being triggered and the water that bursts from the ceiling is straight up black, know that it smells LIKE D E A T H. It is life ruiningly disgusting. \n\nThat, but in your mouth. ",
            "Your teeth would disintegrate.",
            "After a while wouldn't the bacteria die due to lack of oxygen? This assumes you keep your mouth closed the whole time.",
            "Wouldn’t it absorb since your tissue is porous?",
            "I know I'm late, but my friend and I have been trying to do this all class period. It's so hard.",
            "this right here is why i reddit",
            "You would gain superpowers dude. Try it. ",
            "I have this weird condition where I accumulate saliva during my sleep and I don't swallow it (have to wake up often at night to spit it out in the trash next to my bed), essentially it's the worst smell possible because of bacteria and everything. I should seek medical help for this... ",
            "In in school and I’m trying this it’s been about 3 minutes and my mouth is getting tired and the water is getting warm. Will update when I decide to spit the water out. \n\nEdit: it’s currently been 25 minutes. I still have the water in my mouth and I have switched classes. I don’t know how much longer I can keep this up.\n\nEdit: ok it’s been 30 minutes I can’t keep going. I’m spitting the water out now.ew. Please don’t try this. ",
            "I reckon you wouldn't be able to keep it in that long as you would produce so much saliva. ",
            "You would die of hunger.",
            "P",
            "I had a 7th grade student keep water in her mouth for our entire class period after lunch. Until they laughed and spit it all over the place. 40 minutes and it was already nasty - and mostly saliva. ",
            "I'm no water physicist, if there is such a thing, but I imagine it would be a might bit brackish. ",
            "If I had water in my mouth when I clicked on this it would currently be all over my phone and you'd have ruined my experiment. ",
            "Has anyone pointed out the fact that the water would just be absorbed by your oral mucosa??",
            "green algae would grow inside your mouth  ;)",
            "I can't remember what it was called but I watched a documentary about people with extreme anxiety and one of the people featured was a guy who was constantly anxious he would spontaneously confess to crimes he hadn't committed when in a public place. His solution to this problem was to hold water in his mouth while out in public. He stopped doing it because his dentist told him it was rotting his teeth (he had pretty bad teeth), so yeah i wouldn't advise anyone to do this regularly. ",
            "How long does it take to starve to death? Cause 8 weeks might be long enough to just flat out kill you unless you cram some food in there.",
            "Goodluck sleeping with water in your mouth",
            "If you wont swallow for 8 weeks? Your cheeks would become enormous. Your mouth produces about a liter of spit a day, so 8 weeks is about ±56 liters of spit. Its like you have a tiny person in your mouth. If you do decide to do this experiment, please stand on a bridge and spit it all out in somebodies neck.",
            "I once held a tomato in my mouth for over 4 hours to see what would happen. \nNothing happened, but my jaw ached.",
            "I'd imagine your mouth would eventually just absorb all the water in that time. especially if you're not getting liquid any other way, your body would start to get dehydrated and just start sucking up anything it can through the flesh. Not sure how good the tissue in your mouth is at doing that but I know that skin is pretty good at absorbing liquid, especially when dry. ",
            "How will you eat?",
            "You'd die of starvation.",
            "You would die of hunger.",
            "You would die from dehydration...",
            "I doubt you would last more then 24 hours. Your mouth would relax when you started to fall asleep and the water would escape. Either down your throat or out your mouth. ",
            "That water would be worth a whole lot of money son ",
            "The cells in your mouth would degrade as a result of hypotension.",
            "Can't say anything about weeks but I did it for a few minutes and when I swallowed it, it felt like a lot of saliva",
            "Probably drown after you passed out from exhaustion due to having to stay awake for 8 weeks.",
            "Hahahaha I read the title and I was like \"woahhhhhh\" but then I read that you were high and I was like \"ah, same\"",
            "Here at man grown mangrove farms we are revolutionizing mouth to mouth fruits and veggies. On our small half acre farm we have up to 30 human mouths with water where we grow our crop for up to 8 weeks at a time. We use no GMO or antibiotics in our mouths. We are currently looking for large mouth individuals to begin our watermelon harvest. Farm to table? Meh.. let us give you mouth to mouth.",
            "you wouldnt be able to breathe",
            "Imagine not brushing your teeth for 2 months",
            "Why 8 weeks? How much water? Does it start out hot or cold? How would you eat or drink? I would imagine we'll before the 8th week you would be so thirsty you cm would swallow it.",
            "Your mouth will fill up with saliva you haven't swallowed in a matter of minutes. Plus, the water too.",
            "You would starve, for starters",
            "It would side fountain out your mouth in a climactic exit on your way to the other world because you'd die barricading the entrance of your body with the very substance needed to stay alive\n\nAssuming you're not the type to launch h2O up your ass with a hose to stay hydrated through this stunt\n\nSide question; Are you stupid or something?",
            "You would die unless you were taking food and water through an IV/feeding tube.",
            "Assuming you're getting nutrients via feeding tube. I wonder if the bacteria in your mouth would make a poisonous fluid? ",
            "If your goal was to keep the water in your mouth, you would likely die of malnutrition.\n\nAs a rule of thumb, three minutes without air, three days without water, and three weeks without food. These three things separately will kill you.",
            "I'm really high lol",
            "Somewhat related, but I knew a guy who once fell asleep with some milk in his mouth. No idea how that happens. He claims that it sat there in his mouth all night - also not sure how that happens. Anyway, his story is that in the morning, he was peeling HUGE chunks of skin out of his mouth because the milk like...dissolved? ...the tissue.",
            "Dude you would die of thirst in about 1-2 weeks.",
            "If you physically could, it would simply rot. The warmth of your mouth and obviously the moisture of the water is a good environment for microbial growth. By the end of the 8 weeks, the water would probably change color over how rotten it’s gotten. ",
            "You die. ",
            "your mucus membranes would absorb all of it eventually and youd be back to your regular mouth",
            "You would die. 8 weeks without food or water. Nice.",
            "I once watched a tv show about people with OCD and one guy was so obsessed with accidentally confessing to crimes he used to walk around with water in his mouth all day and he had to stop because it dissolved his teeth. Don't know how long it took though. He also chained himself to his bed at night so he couldn't kill people in his sleep. People.",
            "\"learning\" \"discussion\" ",
            "I mean you also need to drink at some point too. 8 weeks is long you can survive without food.",
            "This is what this sub is for, good post OP",
            "Haha love how this is a question asked when high and everybody answering with serious theories.",
            "4.20k upvotes rn",
            "How are you going to keep water in for 8 weeks? Cement your lips shut or sew them? what about your throat? Gotta put some putty down there and let it dry and harden before you pour water in.",
            "Think of drinking polluted water.",
            "TIL... Thanks guys ",
            "You’ll die of thirst ",
            "You would die of dehydration ",
            "It would ferment",
            "Only one way to find out.",
            "Have you seen Jurassic \nPark?",
            "It just eventually gets absorbed through your mouth, actually a way to make your water last longer if you're ever stranded somewhere",
            "I love when people really make the sub title work hard. ",
            "It would be a living swamp in your mouth.",
            "It would gradually turn into spit.",
            "You would have a mouthful of 8 week water",
            "I thought we keep water in our month all the time",
            "When you finally open your mouth a a glob of slime would fall out, look up at you and say.\"Mama\"?",
            "I want some of what you're having. ",
            "Challenge accepted....",
            "DOOO IIITTT",
            "Fuck i used to not swallow my saliva for the whole class and spit it out in one giant spit, why the fuck did i even do that?  ",
            "A cesspool of bacteria ",
            "Im gonna try it",
            "The real answer is: You can't. You'd eventually swallow it and even if you somehow didn't, your body would end up absorbing it. Also, like others have said: It would be disgusting.",
            "It would turn to spit!",
            "Well, you reminded me that I have some pot somewhere in my dresser. ",
            "If you were filled with nutrients while this would happen, the water would just absorb into you.",
            "The water wouldn't last 8 weeks because you would swallow it over time in the same way you swallow your saliva(unconsciously). Also it is impossible because you would have to sleep. So even if you taped your mouth shut you would still swallow it or aspirate it into your lungs.",
            "Probably mix with your saliva and turn to a gel.\n\nSource: This happened after like 20 minuted when I tried this as a kid. ",
            "Your body would absorb it. Nothing would happen but absorption. It would probably be gone in less than half a day",
            "You'd probably have a surplus of saliva along with your water so your mouth would be bursting.",
            "Youd die",
            "Your poor, poor facial muscles...",
            "You'd probably die from not eating or drinking anything else. ",
            "What if you kept semen in your mouth for 9 months. How big would the baby be?",
            "I believe all the water would get absorbed in the mouth after that amount of time. If you've ever seen professional athletes take a sip of water and then spit it out, it's because the water is still being absorbed by the mouth and they don't want to take in excess water because that'll cause cramps. Having your mouth absorb the water prevents dehydration and cramps from too much intake of water. ",
            "You would die of dehydration ",
            "Hate to break it to you . You will starve",
            "You’d die from starvation",
            "Wouldn't you die of thirst?",
            "You will die , how will you drink water or eat food ??? Especially sleeping good luck with that ",
            ">I'm really high\n\nYea we got that buddy\n\n&#x200B;",
            "How would you sleep without drowning?",
            "You would get pneumonia and die",
            "I don't have a good answer, I just had to say I love this question😂",
            "I kept water in my mouth for an entire recess in grade school (~35 minutes). It seemed to be entirely saliva by the end. The teacher made me swallow when j got back to class. It was gross. ",
            "You would swallow it or drool it out, in your sleep",
            "As soon as you fell asleep, you'd choke on it and spit it out",
            "I use coconut oil as a mouth cleaner. I swirl it around for 20-30 minutes at a time like 3 or 4 times a week. ",
            "You’d probably die from not eating food",
            "[removed]",
            "The water would be pulled into the cells of your mouth, then into your blood over a few hours at the most. This is the same thing as what happens when you drink water, just in your mouth instead of your stomach and intestines."
        ]
    },
    {
        "post_id": "impt7v",
        "author": "altyaccounty222",
        "title": "Why is it when you’re up late at night you suddenly have the urge to do everything and fix up your life?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/impt7v/why_is_it_when_youre_up_late_at_night_you/",
        "score": 15576,
        "num_comments": 434,
        "created_utc": 1599258660.0,
        "selftext": "For me personally, I’m a athlete and if I’m up late for some reason I have the urge to go work out and plan for months ahead of time and I have to motivation to get super fit and all this stuff but come morning, I’m past it and just going about my life. Anyone know why that is?\n\n\nEdit: yes I know everyone hates this even I do. but for real thanks for all the answers, the stories, and advice! <3 \nI’ve never had anything really blow up like this and get so many responses thank you guys!!!",
        "permalink": "/r/NoStupidQuestions/comments/impt7v/why_is_it_when_youre_up_late_at_night_you/",
        "comments": [
            "I saw this post and immediately thought “Oh yeah that’s me” and started reading.. but then I was quite surprised by all of the answers echoing the same thing about the mind knowing it’s not possible to go workout or start working on that art project or taking a class.  And I’m like wtf?  I **do** all those things in the night, in fact it’s the only time I do any of those things.\n\nI’m very much a night owl, and I regularly workout late at night.  I do all of my best work of any kind late at night.  Anything I’m trying to learn, I learn between the hours of 11pm and 6am.  \n\nI find peace when no one else is awake to bother me.  It’s the only time I can really be alone with my thoughts, unbothered by a subconscious awareness in the back of my mind that I have to be ready to socialize or talk to someone at any given moment.\n\nSo while what is being said makes sense in theory and Im sure in reality for a lot of people, some of us get that same motivation and drive at night and **act on it**, and in some cases like mine, build our entire schedules around it!\n\nGranted, I’m ADHD as fuck, so in my case it’s likely an adaptive behavior optimizing for time that I can most easily access my hyper-focus zone uninterrupted.  But I encourage all of you try to actually acting on your late night motivational spurt as well!! You never know!  It may be because your mind is relaxed and allowing itself to fully be in the moment of what you’re doing!",
            "[deleted]",
            "Well I think because then you have peace and quiet. Also this is the time after it is possible to do anything about your provlems, making it very easy to make plans.",
            "Because deep down inside you know that there's no way you can accomplish those things in the middle of the night, so you tell yourself your going to do these things, but you've already given yourself a reason for why these things can't be done immediately (it's late at night). So you don't feel too bad about not doing these things right away and instead say you'll do them tomorrow. But then tomorrow comes and all your everyday responsibilities keep you from accomplishing all the things that seem easy when your laying in bed.",
            "[deleted]",
            "I think if we stay jp really late, our bodies might think there is a crisis and so give us a brain chemistry kick and second wind to deal with whatever is going on. Also, slerp deprivation can lower inhibitions the way alcohol can, which might make it seem lime anything is possible.",
            "That's part of living with anxiety. I know I can fall asleep at the computer or while watching a movie. Soon as my head hits the pillow. Wide awake and thinking of all the things I need to do the following day.",
            "Because it’s quiet",
            "You're not alone when it comes to this, I tend to do the same thing from time to time as well. In my personal experience, it's because it is easier to tell yourself that you'll want to accomplish the things you have planned as it being late at night you don't have actual responsibility to do it right away. \n\nI also tell myself that so I wouldn't feel so alone in a way & it's comforting to believe in yourself. Also it leaves a sort of melancholic feeling but here's hoping it becomes a reality.",
            "This behavior ought to have a clear and concise description because it's too homogenous between different people although sharing a very similar list of traits. This happens to me a lot, it is kind of a very specific kind of procrastination, like for example I'm with some lady friend about to go to bed and suddenly I start cleaning and arranging everything. Sometimes I think I do it to enjoy the wait of the thing but I really don't understand what happens in my brain.\n\nSeems nice and awkward at the same time to read this from someone else, like people get out of my head please.",
            "I think its a manic episode lol. I get those too usually at 3am. You feel incredibly energetic at the moment but then you realize your being highly optimistic and slightly unrealistic.",
            "You have less distractions, that's why.",
            "Your mind is the thing that convinces you that you’re not good enough (or not worth enough) to live a happy life. Once your mind is tired, it’s much easier to see through the fog.",
            "What sports do you do?",
            "I'm going to talk out of my ass here for a minute so bear with me. I read recently that Adenosine is the chemical responsible for triggering sleep. It builds up over the course of the day. Adenosine- triphosphate (ATP) is the chemical that sends \"energy\" and building block material to the muscles. Creatine is a psuedo \"ATP- mimicking\" replacement chemical... anyways, i think Adenosine might have properties that act in the way you're describing.. perhaps in addition to making us sleepy, it stimulates the need to \"get shit done\"? Something worth asking a doctor. Now you've gotten me curious.",
            "Sometimes for me, it is because at 9 I began winding down with TV, and after two hours of TV I am rested and then when I putter around getting ready for bed at  11:30, that activity is enough stimulation to launch my brain again.\n\nLately if I am going to bed at midnight but want to use a movie to relax, I do a bit of activity mid-movie: stretching, sit-ups, and bedtime routine, especially face-washing which is a bit of a waker-upper activity. When the movie ends I can roll directly into bed.",
            "Usually right before bed I get thoughts like “I’m going to really start working out and eating healthier from now on” or go on more hikes. Then the next day I fall back into old habits without even thinking.",
            "The real answer:  \n\n\nThe anxious part of your brain turns off at night when youre tired to prepare you for sleep. Its hard to sleep when youre worried. With that off and worries not clouding your judgment anymore you see clearer and feel more empowered.",
            "I do this too. My life is a mess.",
            "I think it's because during the day you have responsibilities and jobs to do but during the night when you're meant to be sleeping you don't as you aren't meant to wake up for another 7 or so hours so you feel free.",
            "If I make that choice early in the day, I either have to do it right away or I’m just procrastinating it more. \n\nIt’s easier to think about late at night because there is no expectation that I’ll actually follow through on any of it today, and it’s much less intimidating to imagine doing things tomorrow.",
            "For me it's a sure sign of being over-tired. \n\nThose fix-it-all thoughts are my cue to drop-it-all and go to bed. Staying up and pushing through leads me on a fuck up cycle. \n\nI'm 35 and it's taken 20 years to figure out that when I feel invincible at stupid o'clock, it's time to try to sleep.",
            "I've read it's because the brain is more relaxed when tired and we don't over thing stuff. Especially people with depression feel late at night better because the brain is \"to tired to care\"",
            "Cause at night you let your mind at rest , there is no rush of thoughts for trivial things.\n\nI usually think same when i go for morning walks without music. Letting your buried thoughts come up as you finally being free.",
            "This usually happens to me when I am not progressing well in my daily tasks for many days straight. During the day, I feel that I still have time in the rest of the day to get done with whatever I had planned, but it's after 12 AM that I get the feeling that I have successfully wasted yet another day. And the introspection starts. \n\nI then get very hyper, wish to do everything at once, try to do one, realize it's too late and my productivity is low due to sleepiness, and then I go to bed putting reminders of the decisions I have just made. More often than not, I just delete those reminders the next day.",
            "It’s the ultimate “I’ll do it later” moment.",
            "You're probably a night owl.\n\nMy girlfriend finds it easier (most times) to do her course work in the evening than during the day.\n\nA lot of the time I find the mornings of work a reallll dragggg. When 5 o'clock goes past I don't really have an issue working and doing stuff as the evening approaches.",
            "This articles sums it up pretty well: https://creativesomething.net/post/54997033332/why-youre-more-creative-at-night-and-how-to basically it has to do with how the brain starts preparing for sleep.",
            "I honestly think it's because it's almost a type of Procrastination. You're motivated to do it because you only have to do it tomorrow.",
            "For me, thats whwn im drunk (like now) and thinking about all the wronf choices ive made. \n\nCheers.",
            "This describes my mindset between the hours of 12am to 4am perfectly.",
            "Not 100% sure but I think it’s kinda like if you pull an all nighter at 6 am you feel great and energetic but come 10 am you’re falling asleep as soon as you sit down. I think it’s some kind of “second wind” of sorts, like your brain thinks because you’re awake it needs to stay awake.",
            "I think it's because all the stuff in the day makes you want to work more. But when you wake up you haven't got any motivation to jump right in and work",
            "As someone who doesn't suffer from this but gets my best days when I plan them the night before why are you unable to make a list of tasks you could compete on the next day even if you don't come through on them.  The thinking time is when you break down everything into minutiae when you aren't crippled by any anxiety and the action time you can just go through the list and catch yourself from overthinking anything because you've done the thinking in thinking time.",
            "Bruh straight up me tonight. I'm not an athlete and I don't want to work out but it's nearly midnight and I have such a strong urge to mow the yard and clean the house and get rid of garbage......but I can't. And I know when I wake up tomorrow I'm not going to want to do any of it.",
            "The only urge I have when I am up late at night is the urge to lay in the fetal position and ugly cry like Kim Kardashian.\n\nDifferent strokes for different folks, I suppose. 🤷🏻‍♀️",
            "I know the feeling. That sudden burst of productivity and clear thinking and processing of thoughts. I read somewhere that the sudden burst of productivity is because the brain is supposed to be repairing itself while you’re asleep during those times. There’s a term for it. I think it’s considered a fallacy or something because while you think you’re being productive, your actually harming your brain repair during this time. I lost the article where I read it though",
            "Copying an old comment of mine on a similar post:\n\nI've heard people say in the past that it's because when thinking about these things at night, you're making plans for \"future you\" that don't need to be acted upon immediately. It's convenient to say that you'll do X, Y, and Z in the morning because it doesn't require any immediate action, instead you can lay in bed and think about how productive you'll be at a later time.\n\nTry shifting your goal from \"tomorrow I will...\" to \"tonight I will...\" and see if that changes anything. That way, you remove the buffer of 8 (or 7, or 6.....or 5...) hours of sleep.",
            "Pick a time when you have a spare hour or two, and are not sleepy at all.\n\nGo get in bed, turn off the lights and shut the shades.\n\nMake sure anything entertaining or distracting is outside the room or at least off.  No phone, no book, no tv.\n\nJust lay there.\n\nWon't be long before your mind starts to wander and think about random crap. Pretty soon you'll be thinking about all the stuff you need to get done, or messed up, or daydreaming about things you want to do but maybe can't for whatever reason.\n\nIf that happens, then the night time stuff is just the inability to quiet your mind. Seems like most are either like us and can't just not think about stuff, or they can go relatively blank and think about unimportant stuff that doesn't cause any anxiety or the feel that you should be accomplishing something.\n\nPeople either live with this, or practice focussing thought, or learn how to truly meditate.\n\nI personally do one of two things...\n\nI focus on an object that's in a black space just floating there. Often an old school sword like from Camelot. Look at the details, truly see it. Nothing about the time it's from, only a visual.\n\nOther thing I do is tap my finger gently in rhythm the speed of my mind and count the taps. Then when it seems mundane and synced I slow the taps. Still counting. Keep slowing... Then I normally just wake up when an animal makes some noise...\n\nI've considered meditation, never tried, zero clue if I could do it. I had a very active mind. Great for getting complex crap done, crap for sleeping or relaxing...",
            "The top answer is not correct. This has to do with how the reward system works inside the brain. The brain knows you won't have the motivation, gives you the motivation then does not punish you for failure.... well not until later.",
            "For me personally I was unemployed for a time and I let my sleep schedule get away from me BUT, I still experienced this! The difference was that while I had peace and quiet at night, I could focus and lock on to all of the things I wanted to do because I knew that there was no other distraction that could possibly come up in the middle of the night and keep me from achieving my short term goals.\n\n\nI was able to make plans anywhere from a few hours to a few months away and 85% of the time I followed through on those goals. I still procrastinated on some things because maybe YouTube stole a few hours of my life, but even then I was learning things related to my field of interest which is the field in which I am now employed and I get to practice some of those skills I learned. So even then it wasn't wasted time, but it was time I had already alotted for something else.\n\n\nI say if you can actually spare the time and you're well within a sleep schedule that works for your regular life, chase those goals! Just don't forget to get some sleep.\n\n\nAs to WHY this happens... Like I said before, I think it must be the dark and quiet. Less light bouncing off of things that could be distracting. Most noises are silent or are simply \"white noise\" which I feel allows you to focus better. Then usually at night many people have a tendency to let their brains run away with random thoughts, but the setting is just right to allow you to focus. So maybe, you latch on to a random thought. Maybe since there's nothing else interesting going on, you focus on it and begin to work that thought out in your head.\n\n\nAn example of one of my random thought processes late at night... \n\n\n\"Yeah I could build that shelf... I got my measuring tape right here. I know what I want to put on that shelf so it need to be 36 inches long, 8 inches wide, probably an inch to 2 inch thick shelf. I just gotta order the brackets on amazon... Already got the screws in that tub. There's my stud finder. Pencil to mark the walls. I know I want the lower shelf to be about 48 inches from the ground. The two shelves have to be separated by 16 inches to fit everything I want up there. They're going to be on this wall across from that window and....\"\n\n\nNext thing I know I've bought the brackets, measured everything, pre-marked all the places to cut the wood and screw in everything, and then I move onto the next thing because I had to wait for the brackets and can't do anything else at the moment.\n\n\n\nSo with all that being said maybe there is something to the sense of knowing you can't complete a project so you are more motivated to do it. If that's the case though, allow that energy to be put to good use and allow yourself (if time and sleep allows) to get all the prep work done for various projects/tasks and then whenever you are able to finally finish those projects there's next to nothing left to do because you've already done all the prep work!",
            "Some people are just more energized at nighttime 🤷🏼‍♀️ \n\nI’ve always been a night person. I remember staying up (for what seemed like wayyy) past my bedtime at like 7yrs old - It’s just my natural rhythm. I *wish* I was a morning person; I’m jealous of morning people because socially, that’s the way more acceptable option 😂\n\n\nhttps://www.brainfacts.org/thinking-sensing-and-behaving/sleep/2019/are-people-really-morning-larks-or-night-owls-101419",
            "I don’t experience this. I know it’s common though. Instead I usually get the urge in the morning, on days that I have work. Cause I don’t wanna go to work so I think of ways to better my life. Still not really working out though lol",
            "That is one of few moments of peace where you truly have time to reflect rather than follow your daily routine",
            "You meditate before sleep. Try meditating In the day; Meditating changes lives.",
            "For me it's because of the sense that everyone else in the world is asleep - like I have a lead on my competition so to speak. It only makes sense of you don't think about it too hard.",
            "Your wheels are spinning. Action and inspiration are decoupled. It's a side effect of living according to an impersonal external structure that doesn't suit your needs. The thoughts that are popping up are what you would be spending time on during the day within a different structure, perhaps even if you were left to your own devices. \n\nI'm not saying reject all external structure and authority, but this is a signal that you need to take charge of your routine. Since you're an athlete I would be willing to bet you've lost the structure that made you train day after day. Perhaps a transition into a different sport or a different coach, or starting college and no longer being involved in highly competitive team sports. It sounds like the latter to me. Like you no longer have a coach deciding when and how you train. It was someone else's job to think about it, now you're noticing that you're getting out of shape. You need to let someone be in charge and provide structure, it can either be yourself or someone else.",
            "The walls of denial are down, & the plains of hope are sown.",
            "I think OP was asking for someone to give a scientific explanation as to why the \"gears\" in people's brains work faster than they do during the day.",
            "The late night motivation is the reason I tend to do a lot of work at night to the detriment of my sleep schedule.",
            "I usually get that urge on Sunday night when I know I have to be up early Monday but I slept in a bit so I'm not at tired as I should be.  Rather than lying in bed all night thinking or playing on my phone, I've decided to start cleaning and getting ready for the next day - set out and outfit etc.  Waking up to a clean room is especially satisfying.  Sometimes I'll end up staying up extra late because I'm caught in the zone.  Honestly I'd rather be tired because I was doing something productive at 3 am rather than playing on my phone.  Mondays suck anyways.",
            "[deleted]",
            "Because you’re not distracted.",
            "I'm very curious what the answer is. If you get a good one let me know (besides you want to do it because you know you don't have to late at night because that is a horrible and untrue answer I usually use that motivation to do stuff and I've only heard it as unsupported speculation on this post). I saw some people say its could be related to ADHD here which idk is true but if it helps I do have ADHD. Otherwise best answer I was seeing was it maybe related to ATP but given my very limited biology knowledge I doubt that's the case. ATP (adenosine Tri-Phosohate) is just the basic energy of most living things and I don't think there's any reason that you would have more at night ramping you up but I could be wrong.",
            "I feel the same when I'm in the bathroom.",
            "Idk why I get the hungriest and full of life lmaoo",
            "You too, huh?",
            "Your brain is the most creative when you’re tired. It allows you to focus on one thing with minimal to no distractions.",
            "Fml. Here’s me, 12:40 am, can’t shut my damn brain off.",
            "I think it’s cause at night before bed there aren’t as many distractions and it becomes more clear on what you’ve been putting off.",
            "Apparently there are growth hormones that get released late at night, meant to help you recover from the day and organise your mind. When you're awake during that time instead of asleep, you use those hormones as an extra source of energy for whatever you're doing (or not doing yet).\n\nThis is why you can feel so energetic and ready to take on the world, and all the responsibilities that come with it. Also why when you get to a certain time at night it becomes harder to sleep, and why you can crash really hard afterwards.",
            "I disagree with the concept that it's because you know you can't do anything. I get that spark of motivation in the middle of the night all the time, and I capitalize on it often. I've actually sort of had to base my life around being able to spend all night working if I get that spark randomly. Most of the best songs I've ever made came from me getting a jolt of inspiration while trying to sleep, jumping out of bed, grinding all night, and then passing out for the rest of the day when I'm finally done. \n\nPeople used to have me convinced that I got that motivation because I was just procrastinating for school the next day or something, but then I realized that I was just different and sometimes I do my best work on my own schedule.",
            "For me, I think it's more of a \"fear of missing out\" if I go to sleep.",
            "Because your body figures no one is dumb enough to starve yourself of sleep on purpose/just for fun.  \n\n\nSo once you cross the threshold  past a normal sleep time your body stops sending you time to sleep signals and starts sending you okay let's go fight this threat signals.\n\nIn terms of evolutionary time the only reason humans were would deprive themselves of sleep was war or some other very serious threat",
            "My therapist calls it “the best of both worlds.” You are implicitly putting things off in to the future while enjoying the satisfaction of completing things. This approach obviously makes it nearly impossible to actually accomplish the things you wish to.",
            "It's the quiet time alone, it's like meditation. It gives you introspection, retrospection, and makes you feel secure, grounded. There's a safety in the night, you know no one expects anything of you, so there's the freedom of knowing you can steal a few hours to do as you please without interruption...",
            "You get:\n\n- The satisfaction of \"knowing you're going to do something\" / accomplishment\n- While also knowing you're allowed to *not* do it immediately, i.e. justified procrastination",
            "This is why I always work out in the evenings, that’s always when I’m most motivated.",
            "You notice that you didn't do shit and just wasted another day.\n\n You get an existential crisis, realising your life flies by, so you panic at night and try to make up for it by doing everything at once.",
            "I’m pretty sure this is everyone ever",
            "I've been reading through the comments and I'm impressed nobody has mention someting scientific or fact-proven since this seems to be a common trait among very different people.",
            "My kids are asleep at 9. So that 9pm-3am is practically a whole shift. I reorganized cabinets and whatnot late last night. I regret it because I am so tired but it’s the only peaceful time to get those types of projects done.",
            "It's less motivated, for me. As in, I just think about everything I should be doing and need to do and feel so overwhelmed I curl into the fetal position and cry myself to sleep 🤷",
            "[https://youtu.be/glgPZmSwC4M](https://youtu.be/glgPZmSwC4M)\n\nFor all of us saying \"this is me!\" let me introduce me to your new theme song",
            "I think it’s the lack of distractions. Life seems good when you have this and that to quiet ur mind but late at night there’s no one, nothing, just you and your thoughts. It brings attention to the actuality of ur life",
            "You know when they tell you when struggling with a hard problem or decision to “sleep on it” (some folks like to use a walk in the woods)?\n\nYour unconscious mind has probably been mulling it over. And during and after the sleep cycle your unconscious mind might have more access to your conscious mind: it’s not fighting with day-to-day activities.\n\nSome find similar issues during meditation. \n\nBut this is mostly anecdotal.",
            "Yes I do the same thing I’m an athlete too and if I’m up late doing hw I’m a Friday I’ll stay up and do other stuff too when I’m done.",
            "I wrote an essay for my English class at midnight just because I got the urge to one night. It's weird, and if anyone actually has the reason for this, I would love to hear it.",
            "yeah, that's me, I think I've narrowed it down to your brain knowing its low commitment, since it's not like your actually going to do anything.",
            "It will go away after a while",
            "I think that's why they call them dreams :)",
            "I think it's because we feel that we did not \"seize\" the day. That everything we did during the day was not enough, and so now before ending the day, our mind checks to see if we did everything that could be done during the day before hitting the hay. I'm that way anyway (rhymes not intended). I think one solution is to manage your time by planning your weekly or even daily activities. That way, our mind has an easier time evaluating whether or not we truly did the things we needed for that day. If it turns out the answer is no, then it's still easier to evaluate if it was worth it. I say this but I actually haven't done this lol.",
            "Bourbon?",
            "This happens to me way too much, and my theory is that I spend all this time building up productive and successful momentum throughout the day that I end myself on such a high note, expecting myself to get carry the momentum to the next day after some sleep. Problem is, sleep is a double edged sword, it probably does some rearranging of neurochemicals that nullifies all that motivation I had before and resets my brain. Useful if I’m falling asleep depressed, not for when I fall asleep motivated.",
            "Because you havnt had enough alcohol to numb it, obviously.",
            "I think it might partially be because there’s nothing to take care of when you’re laying there in bed. You’ve consigned yourself to relax over everything else. Essentially you’ve cleared off your mental workbench and now you’re free to think of what you really want. Nobody endeavors to make the beans at Taco Bell. But laying there in the dark, free from the days stressors, you can machinate your plan to be a music producer, power lifter, professional painter, etc.",
            "The real question is how to translate that motivation and actually follow thru the next day?",
            "I remember that stage.  There was hope then....",
            "I don't know but I do this and in my case I think it's because everything around me calms down and gives me a moment to see things clearly. Basically the never ending distractions that are every day life fade away leaving you with the serenity you need to understand your position in life.",
            "me rn lol",
            "I think that's the only time when one contemplates life, while in the morning we barely have time to think about such things because of various distractions.",
            "Because you're in a position where you don't actually *have* to. It's easier to fantasize about things than to be on your feet, putting effort into them.",
            "The funny thing is that it's night time at my place and I had this exact question and was gonna search. Pop. Open reddit and I see this. lol",
            "Other people are right about the “not able to do anything about it now” theory, but I also think its because you truly do want the things you think of but you have too many distractions during the daytime to dwell on what you want. Meditation can help with that for some people.",
            "For me personally, it happens due to a delayed sleep phase disorder. My body has a longer circadian rhythm than the average person and thus my brain is more productive in the evening than in the daytime. I tend to do my best planning and creative thinking between 10p-2a, and often I will work out in the late hours instead of the daytime. \n\nFor anyone interested: [link](https://en.wikipedia.org/wiki/Delayed_sleep_phase_disorder)\n\nIt could be a lot of things that have already been mentioned in this thread, but for me it’s almost always simply because my brain is wanting to be awake and gogogo at times when the regular world is trying to sleep.",
            "I used to just think of it as being the absolute last thing to do, as in you have to do it now or not do it at all. I always lie to myself and say I'll take a break for 30 minutes then do it, but then 1 A.M. rolls around and I'm on the way to the 24 hour super market to buy milk.",
            "So I see a lot of comments about not being able to actually do the things at night, so in turn you’re more motivated. I can understand this and probably feel this way sometimes.\n\nHowever, I’ve been a night owl since I was a wee lad and I’ve always found myself more productive at night. For me, it’s due to the fact that there is no pressure to be productive at that time. Working out is also great late at night because you’re not surrounded by anybody.",
            "It's Net-time\n\nWe do things at night because the pressure has been nearly 100% alleviated. Day-time is associated with productivity. Getting anything done past 10pm is considered bonus. \n\nLazy isnt a real thing. We don't do things out of fear/avoidance of pain/not doing it well/not measuring up. \n\nWhen it's late at night you've just placed the \"container\" around the thing and have said to it: this time isn't real, so anything I get done is a win. And paradoxically you do the thing.\n\nOur minds defeat us all the time; creating containers to reduce the stakes of something will increase productivity. \n\nNight time is just the concept of net-time...its all bonus which makes it actually safe to get things done in this time frame.\n\nI am most depressed in the morning when the pressure of the day is highest.",
            "I’m taking a course right now on learning how to learn. Our brain in a focused state heavily relies on neural pathways we already have established well. This means that it works well in cases we already know how to do things, but in cases where we need to have new perspective or creativity it actually could hinder our thought processes.\n\nIn comes the second state, called diffused. If you were to think of it as pinball, focused would be much closer bumpers while diffused is much more spaced for free movement. You achieve diffused when you kind of just let your mind wander, or exercise, or do something you could kind of veg out on. \n\nEver have something come to you Or click when you aren’t trying? That’s due to this. I believe that maybe what you are experiencing like many others allows for situations of non focused states where you create ideas that are clear to what you need to do with yourself. The issue is that you don’t have these thoughts cemented into long term memory, so if you have good ideas, start writing them down in the moment so you can work on making them a reality.",
            "Do you workout primarly in the late afternoons or evenings? That might be affecting your sleep",
            "I get story ideas late at night that I have to jot down so I don’t forget them.\n\nMostly, if I’m reading at night, it’s normal for me to stay up until 4 or 5 reading. “Just one more chapter.”",
            "I'm not an athlete, but I usually get extreme creative peaks, and I started a weight loss journey because of it. I'm now 30/50 pounds down! Late nights FTW!",
            "For me it's because it's quiet. I dont have to worry about outside stressors, like FedEx showing up or neighbors stopping by. I dont have to worry about cooking meals or picking kids up from school. No one talks to me or asks me to do things. I can focus on cleaning or fixing my life without any interruption. Also, I'm a night owl. I find it very hard to have motivation during the day when I'm sleepy and busy, but nighttime is my time to shine. I feel awake and energized. To be fair though, I also work a lot of night shifts so I'm used to being productive at night.",
            "I dont I just have the urge to masterbait",
            "I’m ADHD and experience hyperfocus, I can’t control it or anything, it just happens randomly and for random things. But I’ve noticed that it does happen more often at night - the wee hours of the morning more than during the day. Sometimes I stay up attempting to create a new organization method for work only to never look at it again, or I’ll find some interesting topic and cram as much info about it as possible into my head only to forget 90% of it by morning until some random piece of it pops up during some random, unrelated convo. I just thought it was strictly a weird hyperfocus thing. I will look more into this, interesting.",
            "Really wish I hadn't read his thread. Now all my late night planning means nothing ,,, ahhh I had my life planned out!",
            "In my opinion, this is our brain fooling us by giving us a hit of 'instant-gratification'. When we're about to go to bed ou just about done with our day, we start planning for the coming days and make x number of plans on how to improve ourselves. As different as these plans may be, there's one thing common to all of them - they can only be done come morning. Take, for example, I decide I'm going to wake up early, study for 4 hours straight and clean the house until it's spotless. Now I personally feel good because I've made so many plans and now I can go to bed in peace, which is what our brain wants. For us to be able to sleep peacefully *right now.*\n\nHowever, come morning, the transient goal of being happy until we fall asleep is finished and so the brain goes into its normal routine of everyday life. \n\nAll the motivation we had, was just so we could be at peace for a couple of minutes and fall asleep sooner. It served it's purpose so it went away.\n\nTo tackle this, whenever I'm hit with a surge of motivation late at night and I wanna make plans, I ensure to include *at least one thing* that can be done *right now.* Example, if I make plans to wake up early and study, I set my table just how I wanna see it in the morning with the correct books and pens on the table, a bottle of water at the side and I set an alarm for 10 minutes before I wanna wake up. Doing so can help to shift the urgency of the task as now instead of the tasks beginning in the morning after I wake up, they've already begun the night before and I'm simply gonna continue it in the morning.\n\nIt's all in the perspective.",
            "I thought it was just me and i have bpd hahah.",
            "Oddly enough, I legitimately will go do things in the middle of the night. I used to frequently work out , study, etc. at 1 am. I don’t now due to my schedule, but my circadian rhythm seems geared towards nocturnal productivity.",
            "I do a lot of stuff late at night and into the early hours of the morning. I don't like being watched when I do certain things, like clean, organize or workout. It gives me more privacy that way. (Some people are ridiculously anal about anything you do not being done properly, so have anxiety with such things.)\n\nEven if you can't do specific things until \"regular hours,\" you can at least plan everything out as far as if you need to call a number, have paperwork, etc. Junk like that. Makes it much easier for me personally when I have to deal with people again. I feel more at ease because my past self prepared me.\n\nIt could also simply be feeling more relaxed and content for you, so you feel positive about tackling everything.",
            "Oh man I literally just went through this last night - I’ve been trying to study for an exam for the past month and just couldn’t get to it.\n\nLast night I just got into it and went from midnight to 7 am studying and practicing my exam lol. On the plus side, I did really well on my practice exams and the material sunk in",
            "I absolutely love staying up late listening to a podcast and cleaning out the junk drawer. I don't need to know why.",
            "I just write all my ideas down, and read it in the morning, that way I “satisfy” the thought while hopefully actually trying to implement the change I want. Cause if I want it at 3 am, and the idea is still good for me, I’ll do it.\n\nAs an athlete too I actually started doing a push up routine and an routine pretty much every day since COVID started this same way. Looking back I’m very glad",
            "This happens to me with skateboarding all the time, all night i’m like “yeah I’m gonna go here and try this trick on that part” and then the morning rolls around and I can’t get myself out of the house",
            "Because of your personality, literally\nThere are people that are the reverse, its genetics",
            "For me, its manic depressive bipolar disorder.",
            "Can’t sleep and have to wake up in 4 hrs. Still want to get my work done and school work done and study for school.",
            "Happened to me a lot when I smoked weed. That's why I prefer alcohol now.",
            "the pleasure centers of your brain are dumb.  you release the happy chemicals just thinking / planning stuff.  kinda makes sense.. you want to make sure that your brain simulations lead you to good experiences / scenarios and not into bad ones.",
            "Because there's nothing else to do.",
            "To everyone saying its because you know you can't do it - that is just not the case. \n\nSource: I do the things. \n\nI often get the urge to do what op described. I'll sit and clean things, or fix stuff, or work on projects, or grind in a video game. Anything that is a task I can complete. This includes nightly work outs. \n\nI get all of my motivation at night. I think this is much more likely to so with circadian rhythms, and being the time your mind finds its peak productive state.",
            "Just my own anecdote here but I flipped my sleep schedule upside down trying to catch that high of creativity and it didnt work, i was/am still just as lazy as when I was awake in the day",
            "I read something a few days ago about it, Chinese call it “報復性熬夜” aka 'revenge bedtime procrastination' - a phenomenon in which people who don’t have much control over their daytime life refuse to sleep early in order to regain some sense of freedom during late night hours.\n\nDidn't know how to explain it before but this certainly hits the nail on the head.\n\nEdit: Chinese not Japanese.",
            "I do the same thing but when it comes to learning , but that’s just because I’m a night person ... I get more done at night.",
            "This is exactly me and I feel like I’m stuck in a limbo. I rarely do anything I intended to do the next day.",
            "That's only happened to me after a night of LSD.",
            "This was the premise for Jerry McGuire",
            "During the day, you are more able to resist what your body and brain are telling you with distractions. At night, you no longer have those distractions, so those suppressed emotions and thoughts can come to the foreground now and finally have your attention.",
            "Watching like the night is slowly dying make you feel that so do you.",
            "What time were you born? Perhaps you are most motivated at that time of day",
            "Most of the time during the day people tend to do different stuff(music, work, tv, socialise, playing games etc etc) that stops you from hearing your inner voice. This is easier to hear when u decide to do nothing. Like meditation and for most people before they go to sleep. People love doing shit that makes them unhappy in the longterm for a quick rush of bliss.",
            "I think it is because we dont often sit in our own thoughts alone. When you are going to sleep you actually allow yourself some time to analyze things. This is just my idea anyways",
            "Its all those late night beach body infomercials.",
            "When it's late at night, your mind is finally free from all the distractiona of the day. You can finally think about what's been on your mind when your couldn't earlier.",
            "I think it has something to do with self awareness, because at day you can't really rethink everything you do but at night you can and then comes the realization of what you actually can get out of life.",
            "Or, it's 5:00 a.m. or 6:00 a.m. and you get up to go to the bathroom and are awake.  Suddenly, you want to start doing all the things you put off doing.    If I stay up at 6:00 a.m. I fade in a couple of hours and drag through the rest of the day. Go back to bed, if I can go back to sleep and sleep, later, I don't want to get up.",
            "Because the time is gone and you realize you've wasted the day.",
            "Tires brain think funny",
            "Probably already been stated, but I think of this time of day as a reflective period and I’ll use it to map my next day for how I want to be, things I want to get done, things I want to work on within myself, things to work on outside of myself (relationships with friends, family, etc.)",
            "I posted a similar question and just got down voted with 1 comment (that was helpful) but I feel like this every single night then come morning I just hate myself because I have no motivation to do anything.",
            "In the middle of the night (when you’re supposed to be asleep) your body releases bursts of energy meant to be used to repair any damage in your body. If you’re awake, you get a sudden rush of energy, which people use to study, workout, plan their lives, etc. This is nice, but now your body can’t do its repairs. Get enough sleep folks. (Energy hursts can also contribute to insomnia if your circadian rhythm is off)",
            "no i just feel like dying",
            "Because you have the time and space to realize you are a total loser.",
            "It's because your biological clock would have you normally operate later on in the day and into the evening but we live in a society where you have to wake up early or you're considered lazy.",
            "Yes! Because I’m a night person.",
            "My theory is that you sort of suppress all that stuff during the day in favor of more immediately pertinent things then once all of those things are out of the way the future starts coming to mind...happens to me all the damn time...very frustrating",
            "Same.",
            "Put the pipe down.\n\nSorry,\nCouldn't resist\n\nEither could you?",
            "For me personally it's because i fell like i could be ahead of everyone else if i start doing something late at night while they're all asleep",
            "Musician here, I absolutely can not work in the day anymore. Seems a lot of em are like that though.",
            "It's because you know you can't do anything at 3am",
            "Maybe you feel guilt from staying up so late, so you're looking for compromises. 'Ooh if i'm productive then it isn't as naughty'",
            "There’s no sense of obligation to do jack shit at night. The mind can wander and there’s no pressure to actually do shit.\n\nNight: Man I could bang 20 women a day.\n\nDay: Omg a girl is walking my way eww cooties\n\nNight: I’m gonna make 100k a year working 90 hour weeks \n\nDay: It’s 11:30, 5 more minutes won’t hurt.",
            "Because you are finally relaxed and have a moment to think, unlike during the day when you area relentlessly going from one thing to another",
            "Being a night owl is awesome. There have been nights where I literally couldn't stop coding or writing and I had to force myself to sleep. It's the peace and quiet I really like. Plus I don't have to deal with the bullshit that comes with the day like socially and whatnot. 2:35 AM for me and I'm still writing :)",
            "*reads title*\n\n*reads explanations*\n\nHa! Tell that to me *who spent 6 hours into the night trying to make r/Ahrism as nice as possible for it’s public opening only to have like 8 people join once I woke up* ;-;",
            "nice awards whoring",
            "Read It Fully to Get My Point\n\nHave you ever noticed that all animals or to some extent are made up with same design...a head then neck, then come torso plugged with hands and legs and reproductive organ as well as execratory system both are at same place...which is some where lower side if we look from top to bottom. Try to notice one more thing, Animals usually tends to have a HORIZONTAL SPINE while humans have VERTICAL SPINE and lastly one thing that...head is on upside of the spine and excretion and reproductive place is on lower side.\n\nWhat I wanted to say by this thing is...there is somewhat a force...a pull up force which pulls the energy in the body upwards. The pull...you can refer to the fact that human beings evolved much better than other animals in terms of Intelligence and other things...so...this upward pull of the energy is what you can say makes us to long for more... get up there...to reach higher.\n\nNow coming specifically to your question, This is due to MOON, yes. Let me tell you one more amazing fact, people in jails or in asylums tends to go mad at full moon...wait wait...they don't go mad just for no reason. See, the real thing is...When the moon comes up say on a full moon, the very nature of who you are, increases. It's not being just mad...if you are loving, you will become more loving...etc etc...whatever kind...whatever the quality...it gets enhanced.  At night there is up search of energy which pushes us like this.\n\nFirst answer on Reddit...upvote if you liked.\n\nYou can check the facts on Internet.",
            "If this is a regular occurrence for youx you may want to look into \"mania\" for people with bipolar disorder.",
            "Because you're a superhuman who has tremendous energy and incredible stamina, idk what the hell you're taking about lolz",
            "[deleted]"
        ]
    },
    {
        "post_id": "arxyxf",
        "author": "None",
        "title": "If you walked outside bare-assed on a cold day, could you \"see\" your farts like you see your breath?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/arxyxf/if_you_walked_outside_bareassed_on_a_cold_day/",
        "score": 15569,
        "num_comments": 471,
        "created_utc": 1550501606.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/arxyxf/if_you_walked_outside_bareassed_on_a_cold_day/",
        "comments": [
            "Back when I didn't have heat in my house a few winters ago and it was cold enough to see your breath inside I tried this. It did not work.",
            "[No](https://www.sandiegoreader.com/news/2001/jan/17/why-cant-i-see-my-farts/), there is not enough moisture in a fart to make it seen..",
            "[removed]",
            "[removed]",
            "what about a 'queef' during sex? ",
            "[removed]",
            "I thought about this when I travelled to Switzerland recently. I was stood at the top of a mountain, and wondered if I farted, someone would see it. It was -15 degrees C, so I was just wondering. (and yes, I farted on the top of a mountain.)",
            "Not sure about farting, but I've seen steam rising from my piss on a very cold night. I even took a video of it, but it was a Snapchat story and stupid me didn't save it.",
            "I feel this one would be easily answered through experimentation. All you need is a cold day, a close and equally curiously minded friend, and a big old pot of chili. ",
            "[removed]",
            "[removed]",
            "You can see horse farts in really cold weather.",
            "[removed]",
            "The german children's show \"Sendung mit der Maus\" covered this topic once a long time ago. They said no",
            "No, but if you put a little flour in your ass then fart it goes poof!",
            "Where are Jaime & Adam when ya need em!???? I do remember that farts don’t show up on a thermal cam. RIP MythBusters (and don’t come at me w/that science channel new hosts shit)",
            "[deleted]",
            "No.\nAlthough the two smell exactly the same, there isn't enough moisture in your farts to be seen like your breath. ",
            "To the people who say no, why doesn’t it work?",
            "[removed]",
            "Yes, it happened to me at work on a very cold day. Through jeans.\n\nAMA.",
            "They show up on infrared.\nhttps://i.pinimg.com/originals/04/6e/1f/046e1f30c3bdc997f8d4227dcd95a687.gif [](/twiright) ",
            "When the polar vortex happened, I saw a post with a picture of the back of pants of people who were outside. There was a little white circle where they farted so my verdict is it's probable.",
            "I think the reason you can see your breath is because when you exhale a small amount of saliva comes out also and it turns into ice/frost ",
            "You can see cows farts, I've seen them before ",
            "No, but the irrational fear of it happening has a name...\n\nFriaflatulaphobia",
            "I do not know, however during the polar vortex run Chicago if you farted outside there would be butt icicles/ butt frost around the *ahem* exit point. There were several news articles about it. ",
            "I've seen plenty of foggy cow farts in my day",
            "Well I saw a horse fart a little puff of steam, but only that one time. It must have just been a particularly high moisture fart.",
            "only if it was a reeeally wet fart. not kidding. when you see your breath it’s condensed water droplets.",
            "[removed]",
            "Your farts are gas and hopefully have very little water content. ",
            "I cold days, I see steam rise from the horses' breathe but no steam when they fart in my face as I'm brushing thier tails.",
            "When my neighbor's dog takes a dump it steams for a couple of minutes.",
            "I remember one winter I was walking the dogs when suddenly nature called, I took a huge shit in the woods and couldn't help but admire it in all its steaming glory.",
            "This kind of worked for me. However it was in sub zero conditions and liquid shits into a foot of powder. So not really a fart. But close Enough",
            "It's best to do it a Misti place and you will definitely see it. You'll feel like you are seeing the matrix and you will waste lots of water.",
            "Yes",
            "It can be visible and you can be clothed.",
            "No",
            "Coming from a Canadian. Yes.\nIt gets so cold some days you can see the steam smoke from just your hands ",
            "Yes.\n\nSource: have large dog",
            "I've seen a fart through Jeans at -38F in MN, so it depends on the moisture in the air and the temperature.",
            "You can see the heat if it's cold enough",
            "If it was -160ish Celcius, the methane from your fart would condense in the air and probably have the same effect as condensing water from breath.",
            "Yes. ",
            "Depends how wet it was",
            "I farted the other day and the plume came througj my trousers, so I would say that's a resounding yes.",
            "Your farts freeze up on the back of your trouser's on a really cold day, so be careful",
            "On the flip side, I've seen thermal images captured of people farting and it looks like a gas cloud, though I feel like that's bullshit. Can anyone else confirm?",
            "There is a German kids science series, I watched a lot as a kid, called \"Sendung mit der Maus\", they actually tried that and it doesn't work cause the air is not wet enough.",
            "I used to worry about this while I waited for the bus in the early mornings, when my arse would be most active. The invention of the mobile phone camera has eased my worries considerably, as the countless videos in my memories of my arse can attest to.",
            "They tried it on a german TV show a while back, but you can't see it, because it's too \"dry\", meaning the fart won't condensate in cold weather.",
            "My husband and I have seen our boofer’s farts. We call them Boof Poofs. So yes. ",
            "This question. Lol. ",
            "I would say no. The difference is that when you see your breath, you have water vapor condensing into liquid water and ice in the air, much in the same way you see clouds.  With a fart, there is not enough water in a fart for it to condense in the air.  It's a mixture of Carbon Dioxide, Nitrogen, Hydrogen Sulfide and a few other things, including airborne fecal bacteria, but even those combined wouldn't condense. ",
            "No, your dick will steam when you pee tho, experienced it first hand",
            "No, your dick will steam when you pee tho, experienced it first hand",
            "[You can on infrared](https://m.youtube.com/watch?v=07POT7kNBg4)",
            "I don't think you could see it, maybe with a pair of mirrors or something",
            "[removed]",
            "Yes because they are warm 😂"
        ]
    },
    {
        "post_id": "81p2fq",
        "author": "None",
        "title": "According to NowThis, Blank Panther (the movie) is very diverse with 90% of the cast being African or African American. Doesn't that make the movie the opposite of diverse?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/81p2fq/according_to_nowthis_blank_panther_the_movie_is/",
        "score": 15564,
        "num_comments": 847,
        "created_utc": 1520069398.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/81p2fq/according_to_nowthis_blank_panther_the_movie_is/",
        "comments": [
            "Fast 7 (I guess the majority of the FatF films) are 10 times more diverse than all the MCU movies combined.",
            "Diverse in terms of Hollywood movies perhaps, not within the single movie.\n\nOr maybe they count all the stagehands and prop people and camera people along with the cast, and there's a nice, even spread of races?",
            "In the context of high budget movies presumably, not itself alone.\n\n**EDIT**: I'm appending my response to another comment cause I don't really know the whole context of the original question and was piecing it together. And now that my comments at the top I'd like to avoid the same reply :\\^P\n\n>Hmm, maybe it's more a case of trying to justify buzzwords that aren't entirely applicable than anything else. It's a movie with a cast that is generally underrepresented in the grand scheme of hollywood compared to actual demographics.\n\n>I think people are trying to defend what they think is a good choice but doing so by focusing on the wrong aspect of it, or getting caught up in the word choice. Not technically diverse in and of itself but a nice move towards a more diverse whole.\n\n>(also i dont actually know much about black panther (havent actually seen it yet lol) so sorry if this isnt entirely applicable to it)\n",
            "The term \"diverse\" has evolved from meaning a collection of different people, to \"minorities\". I've seen companies owned entirely by women called \"100% diverse\" and obviously a movie of 90% black people is being called \"diverse\". It's a miscommunication because the term means something entirely different to people on the street and to critics and reviewers. ",
            "It makes sense if you assume “diverse” means “not white”. \n\nI can’t imagine anyone screaming that there aren’t enough white people in Black Panther but people were irrationally wounded about Dunkirk, [a movie about Brit and French soldiers](https://www.theguardian.com/commentisfree/2017/aug/01/indian-african-dunkirk-history-whitewash-attitudes), having a white cast. \n\nWhite dudes in tech are labeled [non-diverse](http://www.businessinsider.com/white-men-now-being-called-non-diverse-2016-5) for example. \n\nWe live in weird times and we really need to stop obsessing on skin color. ",
            "As a African American who once dated a Congolese woman I can tell you that Africans and African-Americans are not the same at all! We have totally different cultures and perspectives ",
            "So much drivel just to avoid saying that diverse has become code for non-white, non-male in neo-liberal culture. People have become so empty headed they think everything is a corporate box-ticking evaluation. Better break out the buzzwords! \n\nBesides that this is a weird fixation on a word. \n\nA good movie though. And it's awesome to have some different ideas and faces leading a movie out of Hollywood.",
            "Haven't seen the movie, but these people were listed as the actors in the movie.\n\nChadwick Boseman - African American\n\nMichael B. Jordan - African American\n\nLupita Nyong'o - Kenyan-Mexican\n\nDanai Gurira - Zimbabwe (Born in America but moved back at age 5)\n\nForest Whitaker - African American\n\nDaniel Kaluuya - British born to Ugandan parents\n\nAngela Bassett - African American\n\nWinston Duke - Trinidadian\n\nFlorence Kasumba - Ugandan\n\nSterling K. Brown - African American\n\nLetitia Wright - Guyanese born British\n\nJohn Kani - South African\n\nAtandwa Kani - South African\n\nSydelle Noel - African American\n\nIsaach de Bankolé - Ivorian (Ivory coast)\n\nAndy Serkis - British\n\nMartin Freeman - British\n\nSeems pretty diverse to me, unless you're an idiot and count diversity simply in terms of skincolor.",
            "It does, but they don't mean diverse, they mean not predominantly white, they just use the word diverse because it has a good connotation, despite being incorrect",
            "As a movie it is not very diverse, it’s unique place in American films makes it very diverse. ",
            "[deleted]",
            "Whats blank panther?",
            "[deleted]",
            "It breaks the stereotypical trope of the “token black character” in a film full of whites, which I think is important. ",
            "Essentially \"diverse\" in Hollywood just means not white",
            "The black panther movie tries to show multiple tribes from Africa (all the wakanda tribes). In America it shows also a \"different kind of blackness\" with a lot of the \"black culture\" being described to the viewer.\n\nIt has a lot set on the US and a also a big part in China, which adds up to the diversity.\nOn top of that, the only 2 big white characters were not made to be \"the evil\" as one of them is not a big deal within the evil side in the movie and the other ends up being a good friend to the hero.\n\nAlthough the hero is a man, the women there take a big role and you feel like he couldn't be man he is without them.\n\nAlthough the movie is all black you don't get a feel of a \"black movie\" mainly because the storyline deviates so much from the ghettos, drugs and stereotypical black neighborhoods.\nThis not conventional storyline makes the movie feel white because we are used to these movies being all white.\n\n\nEverything I've just said joins together with the marvel movies, Hollywood history and current events to make the viewer feel like he's watching a diverse yet modern superhero movie.",
            "Diverse just means not white. ",
            "This is a good point.\n\nPeople with extreme viewpoints love to use racial “privilege” as an excuse to preclude whites which is a form racism. Think about things like: black(native, hispanic) history dates and events, channels and campus “safe spaces”; all of which are prime examples of extremism. Don’t agree; too bad because it’s about how (you) make (me) feel, that’s the “standard” right? That type of mentality is really getting out of hand and should be stopped. \n\nCan you imagine the backlash at: the white pride tv channel, white broadcast network or areas guaranteed free of people of color on a campus? How’d that work again? \n\nTrue equality is accomplished by hiring the best candidates, admitting the best students and using talent no matter what creed etc. There should be zero preferences given because that is racism, just a flavor maybe not widely acknowledged yet. \n\nWas there a great movie with the majority non-white actors? Great, let’s all enjoy it. Did they suppress white actors that perhaps were more talented to get “diversity”? Then that’s a whole different thing. Sometimes you have to hire a certain ethnic background because it’s hard for a Mexican to play a black fella and vv. However, when you preclude greater intelligence, harder work, or better qualifications, to accomplish some extremist driven agenda then that’s wrong.\n\n\n\n",
            "You can actually read about it in interviews and behind the scenes, they pulled from a wide variety of countries and cultures and done with a great deal of respect for them. \"African\" isn't just one ethnicity. ",
            "People use diverse to mean “no white men” instead of “a group of different people”. So it is actually the opposite of diverse. But diverse sounds better ",
            "No. Africa is the world's second largest continent, with nearly 50 countries and hundreds of distinct cultures, few of which receive any mainstream representation.",
            "Yes it does",
            "Diverse in the context of an all-white hegemony of Hollywood ",
            "diversity is relative - relative to range and scale of what we're considering",
            "Pan african diaspora, africans from all over the world and a variety of tribes\n\nnot all black people are the same ",
            "The word \"diversity\" as liberals use it is just a codeword for \"fewer white men\". It has absolutely nothing whatsoever to do with the usual definition.\n\nUse of such coded language is very common in politics.",
            "I think by definition it is not diverse. So you’re right.",
            "I don't totally disagree, but they are probably looking at this movie compared to every other movie as a whole.  ",
            "Diversity is encouraged because groups typically go underrepresented.  When I think about it, it is descriptive when you're talking about a 50/50 cast in a movie where racial homogeneity just makes no sense.\n\nDiversity is a dumb term, I think, when talking about Black Panther.  One reason the movie is exceptional is because it is a successful pop culture movie that is extensively casted with black people (I don't say African-American because they're not all American, like Lupita Nyong'o).  That's not diverse by definition, but it is a good thing.  I think because diversity is desirable, people just accidentally use it as a synonym for \"good\", even though, as your question illustrates, the words don't mean the same thing.",
            "Diverse means not having white people.",
            "Yes.\n\nCurrently the qualifications for \"diversity\" are simply as few white people as possible. None is ideal. ",
            "The most important thing to understand is the broader context. Black Panther is an mainstream blockbuster movie. Most blockbuster movies are made by white people, and cast mostly white people, so having more black people than white people increases the diversity of the medium of film as a whole. Look at the MCU, Iron man, Thor, Captain America, Black Widow, Hawkeye, Bruce Banner, Ant Man, Spider Man, Doctor Strange, Quicksilver, and Scarlet Witch are all white, and their supporting casts are mostly white. Having most of the cast of Black Panther be black doesn't come near overwhelming that.\n\nThe second thing to understand is that Africa is not a nation, it is an enormous continent with a diversity of cultures. Black Europeans, black Americans, and black Africans come from very different cultures, in addition to the diversity of culture within those continents.",
            "[removed]",
            "what about all the films in africa that dont have white people in them?",
            "Africa is not a country though. Having a cast predominantly from Africa isn't the same as having a cast predominantly from Kenya. That would be like us saying X movie isn't diverse because the cast is mostly from North America.\n\nIf you're just talking about the color of people's skin as a factor of diversity then in comparison to nearly all Hollywood films the movie has a very diverse take. Consider that almost every lead role and nearly every Blockbuster released in Hollywood goes to light skinned male and female actors not to mention supporting roles and extras. \n\nIt's normal for people to see a movie based in places heavily populated with minorities to be cast with almost all white male/female extras.\n\nGranted there are some exceptions, the general consensus among people of color is that they are seldom represented in Hollywood, and when they are it's often in a negative viewpoint.",
            "I feel like you're drastically underestimating how many different nations and cultures are in Africa. It's not one place, it's a ton of places.\n\nEdit:  and while I'm on the subject, the cast is really not as African as you're making them out to be.  What they are is mostly black. \n\nChadwick Boseman, Michael B Jordan, Angela Bassett, Forest Whitaker... They're American. \n\nLupita Nyogo is Kenyan Mexican.\n\nFlorence Kasumba is Ugandan German.\n\nMartin Freeman, Andy Serkis, and Daniel Kaluuya are English.\n\nIf you just saw black people and think that isn't diverse, then your idea of diversity is not a great one. ",
            "No. Because \"diverse\" in modern Newspeak means \"not white\". \n\nPerfestly consistent, comrade!",
            "Consider the fact that a film with 90 percent Caucasian and 10 percent of a minority would get a pass from the media as diverse. Sooooo... ",
            "Please clarify /u/pocketknifeMT I meant it is different than 90% of movies. Diverse.",
            "Africa is a very diverse continent. There are Nigerians, Egyptians, Rwandans, Ghanians, Ethiopians etc.",
            "Technically, yes that makes the movie the opposite of diverse. However, every movie gets +1 diversity points for every black person in the movie. It’s basically in the Bible. So, if you add all the diversity points up, yes this movie is the most diverse thing since Timbuktu.",
            "Yes",
            "The answer is yes.",
            "That 10% diversity. Better than most Hollywood movies that are 98% white and the one minority character has like 3 lines.",
            "Diverse can also mean differing from the norm.  It certainly is differing from the norm.\n\nActually, if 90% of the cast is black it's still probably more diverse than most movies with more than 90% of the cast being white.",
            "Yes, as long as there aren’t many white people in it, that means it’s very diverse.",
            "[removed]",
            "So many closet racists in this thread and the amount of upvotes for them scares me.\n\nEdit: Or maybe they are (chose to be) ignorant of the matter.",
            "Not really Africans have been found to be the most genetically diverse population.\n\n[Sauce ](http://www.washingtonpost.com/wp-dyn/content/article/2009/04/30/AR2009043002485.html) \n\n",
            "Depends on how you look at it.\n\nBlack Panther, having a mostly African or African-American cast, is not diverse at all. However, if you go into specifics, many of the cast members and/or their ancestors come from different regions of Africa (for example, Zimbabwe and Uganda), so it is very diverse. However, by that logic, a film with mostly white people could also be very diverse, since some may be English, Irish, Italian, French, etc.\n\nThe other way to look at it is not to look at the diversity within the movie itself, but in the Hollywood industry as a whole. In that case, since the cast is mostly consisted of “minorities”, it can be considered diverse. Again though, that means a movie such as The Godfather, with a largely Italian/Italian-American cast, could also be considered a diverse movie, since Italians technically are also “minorities”, although not usually considered minorities (although historically they have been).\n\n**TL;DR**: It’s not really diverse within the movie itself, but it can be if you look at specifics. Within the Hollywood industry, it is diverse, but so are a lot of other movies that might not normally be considered diverse.",
            "I mean they are from a lot of different countries with very different cultural backgrounds. Backgrounds as in they grew up under different circumstances in different cultures not their great great great great grandparents came from a place with a certain culture and today they still \"celebrate\" that culture by bastardizing it. ",
            "It’s diverse in the context of American society which is predominantly white. Whites make more money, have more opportunities, have better legal outcomes, have more access to education and democracy... I mean I could go on and on here... bit the point is this: Black Panther is diverse because in the context that Hollywood isn’t and American society isn’t.",
            "di·verse\ndəˈvərs,dīˈvərs/Submit\nadjective\nshowing a great deal of variety; very different\n\nClarify please ",
            "Yes, but white guilt will hide that fact. "
        ]
    },
    {
        "post_id": "pkaqqx",
        "author": "myc123",
        "title": "If I blew up the sun what crime would i be charged with?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/pkaqqx/if_i_blew_up_the_sun_what_crime_would_i_be/",
        "score": 15562,
        "num_comments": 3534,
        "created_utc": 1631108466.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/pkaqqx/if_i_blew_up_the_sun_what_crime_would_i_be/",
        "comments": [
            "Billions of counts of murder I assume",
            "Destruction of ancient relics",
            "It’s kind of an unwritten etiquette that we don’t do that. There’s not really a law against it, it would just be highly frowned upon.",
            "You would not be charged with any crime because everyone would be dead including you.",
            "At best it’s interference with a police investigation (all of them on earth) at worst it’s mass extinction of the human race",
            "You'd be charged with treasun",
            "8 billion counts of third degree murder\n\nHave fun in jail for a trillion years",
            "You would be charged with filicide because you killed your sun.",
            "The universe would give you a death sentence",
            "Mass murder and genocide of all and everyone of homo sapien kind.\n\nYou’d also be charged with animal cruelty and slaughter of livestock, as well as National and international terrorism. Oh yeah, and possible international deforestation and negligent violation of most NASA and NOAA laws and regulations against abuse to the atmosphere, ozone layer, and ocean.\n\nOf course everyone would be dead and there’s more crimes to be placed upon your corpse but still",
            "Indecent explosure",
            "Nothing, explosion radius and expansion of the sun would cook the entire planet within minutes, there'd be no time.",
            "Depends. One possibility is \"destruction common heritage of mankind\"\n\nCommon heritage of mankind are both manmade and natural objects which are considered the propertity of whole humanity. And are therefore protected by international  treaties. \n\nAntartica, seabed and the moon are these. This will most likely include the sun especially when other aliens show up.\n\nSo yeah. Altough your destruction of heritage of mankind will mostlikely be literal.\n\nOther possible charges is omnicide. Death of everything.\n\nAnd since there are no laws in space, \"since their enforcement is near impossible at the moment\" I think someone will just shoot you.",
            "If humanity had off world colonies or stations and could hold you accountable you would be up for genocide, treason, terrorism, environmental destruction and maybe a few more things? Destruction of property?",
            "Tax evasion and racketeering. No way a criminal mastermind with the funds to explode a celestial body has been paying taxes or earning legitimate income. Blow up the Sun and you'd find yourself squarley on the radar of the IRS until a few minutes later when the earth freezes and all life dies.",
            "Maybe crimes against humanity",
            "Intergalactic terrorism",
            "You will probably just get fined, since it’s obviously a light crime.",
            "The sun is literally a self sustaining explosion. This is like asking what would happen if you turned on a lightbulb that was already on.\n\nEdit: Fine, fine, the charge is astrocide.",
            "Idk about crime, but that would be a huge dick move bruh",
            "Arsun",
            "Criminal damage and ruining everyone's weekend!",
            "Sunslaughter.\n\nA-Sol-t.\n\nDisturbing the pace.  Of the Earth's revolution.\n\nSunny gone-dering?\n\nIndecent explosure.\n\nMurder in the 5,778,000th degree Fahrenheit.\n\nSummercide.",
            "*flicks through law books*\n\nNope. Nothing. It's legal, so go nuts.",
            "Murder diddly urder of the sun god ra",
            "I don't think there'd be anyone left to charge you. my man.",
            "None you'd die soon after, having gotten away with it for the rest of your life. Which would only last a few minutes..",
            "Solicide?",
            "Not a damn thing",
            "If we get to the point of being a galactic scale (more than one solar system) and weapons like that were available there would most likely be some sort of crime that the other colonies would charge you with",
            "I don’t think it’s illegal to blow up the sun",
            "Violations of the General Agreement on Appropriate Uses of Solar Demolition charges. Operating superheavy space machinery without a licence. Acts contrary to the Celestial Mandate of Greed. Destruction of a Class 50 Protected Habitat.\n\nAnd various offenses under the space-scaping acts. You can just rearrange solar systems like that, think of the ambiance of the galactic branch!",
            "Probably just a warning, its a light offense.",
            "Safe to say you would not be viewed in a good light",
            "You along with everyone else would be dead.  So no charges since we would be extinct",
            "Nothing since there wouldn't be anyone to charge you.",
            "Mass Con Fusion ?",
            "Probably like harassment or something",
            "no charges when there is noone left to charge you.",
            "How does one even blow up what is already just a giant ball of fire? Asking for a friend",
            "Me: *reads title*\n\nMe: *Taps and immediately scrolls to see all the creative comments*",
            "7+ billion counts of rape, 'cause you done fucked us all!",
            "Assuming there was a defacto court set up on the ISS for specifically this situation you would be charged with crimes against humanity",
            "Death",
            "mass genocide",
            "Let’s say property damage, murder and animal cruelty for now.",
            "Elon please don’t",
            "Murder- probably genocide bc you would be killing an entire race of people.",
            "There wouldn’t be enough time for a trial.  The earth would literally freeze among other things.",
            "None. You and everything on the planet would be dead",
            "Intergalactic Terrorism",
            "Ummm. None? Because no one would be around at all, including you?",
            "You'd be committing mass genocide. But we'd all be dead so you couldn't be charged",
            "Waiting for the crazy responses from the flat earther community",
            "If you live in San Francisco, nothing.",
            "In 7-8 minutes it wouldn't matter anyways.... Wouldn't matter.... I'll see myself out",
            "Interior Minister, Taliban govt. Afghanistan.",
            "If the sun blew up then so would we so you would never be charged",
            "If you shot the sun with something, anything you wouldn't be alive to see it hit. That's if you could even hit it in the first place.",
            "I mean, the sun is a continuous explosion held together by its sheer mass.",
            "The charge of being criminally stupid lol. How tf are you going to blow up the sun?",
            "not giving me a high-five afterwards",
            "everyone would die, so no point really charging you with anything. you already gave your self the death sentence.",
            "Mass murder",
            "We have no laws to fit your crime",
            "Genocide. You just killed the entire human race.",
            "None, the second you did it there be no more laws, no more people to prosecute you, no more you. \n\nAlso ... since the sun is essentially an enormous sea of constant nuclear explosions already, I don't thing you could \"blow it up\" without making it bigger. It'd have to be more of a black hole type situation or that siphon thing they did in the micky mouse star wars movie ...",
            "I mean... 'Being torn apart limb from limb by the billions you condemned to die, all so they can experience catharsis one last time before all life as we know it comes to a frozen and lonely end' is kind of like being charged with a crime, I guess.",
            "There is only one way to find out.",
            "Destruction of property. If people are in the building(s), probably more charges related to harming people. Then again, you'd also be hailed a hero by the masses for taking care of a shitty tabloid. It's really hard to decide.",
            "None, we would all be dead so there would be no one left to stand trial or pass verdict",
            "None no one would be around to charge you.",
            "Trolling",
            "None. Everyone would be dead.",
            "Don't do that, man. It will be cold af for years until I grew a new one.",
            "Your powers to blow up the sun would make you beyond the understanding of humans and the law probably.",
            "Nothing. Your feeble explosion will not harm the sun, which we couldn't noticeably impact if we threw the entire earth into it.",
            "Frankly I'd just be impressed you had the resources or ability to do so, I mean, that's one hell of an accomplishment.",
            "You wouldn’t",
            "Genocide, infanticide and suicide",
            "Sunnycide",
            "Nothing, as everyone would be dead",
            "Nice try alien terrorist",
            "Well, for about 7 minutes, you have the chance to be charged with Murder/Genocide of the Human species.",
            "I’m really surprised and somewhat disappointed that none of the top comments have even attempted to mention the fact that it’s beyond, beyond, literally impossible to do anything to the sun.\n\nYou can fit 1.3 MILLION earths inside the sun.\n\nLol at any human being even doing anything remotely damaging to the sun. It’s like as if a microscopic little virus cell said “what if I blow up a human being?”\n\nEdit: wait a minute",
            "vandalism at least",
            "Global genocide. Dont worry, you won't live to even see a pair of handcuffs, we'd all freeze to death in a matter of minutes.",
            "You wouldn't, everyone would just die",
            "Nothing because we all would be dead.",
            "None, because we all die from the subzero temps 8 minutes after you blew it up. 🤣🤣",
            "Hooliganism",
            "Lawyer here.  Setting aside the fact that everyone would be dead (as others have observed), I'm not aware of any law on the books in the United States that covers this precise scenario.  The closest thing that occurs to me is maybe weapons of mass destruction terrorism under [18 U.S.C. 2332a](https://www.law.cornell.edu/uscode/text/18/2332a).  The sun is arguably a [\"weapon that is designed to release radiation or radioactivity at a level dangerous to human life\"](https://www.law.cornell.edu/definitions/uscode.php?width=840&height=800&iframe=true&def_id=18-USC-2003303595-783258095&term_occur=999&term_src=title:18:part:I:chapter:113B:section:2332a) in this context, but that's a stretch.\n\nYou've raised a glaring omission in the legal system and Congress must act now to prevent the Taliban from blowing up the sun before it's too late.",
            "Suicide?",
            "Heliocide.",
            "Destruction of public property.",
            "Not doing it sooner",
            "Butters! How many times have we told you not to blow up the sun?\n\nTwo, ma'am.",
            "Obstruction of Solstice",
            "No point in charging you, the case would never see the light of day...",
            "It wouldn't matter, would it!",
            "::song from Outer Wilds starts playing::",
            "I mean you'd kill us all",
            "Daylight robbery.",
            "None... everyone would die.",
            "Omnicide?",
            "Nothing because all the prosecutors would be dead.",
            "Easy there Bezos.",
            "Well whatever it is, you’d be charged 8 minutes after you did it.",
            "None, we would all be dead",
            "Solarcide ?",
            "Probably none because everyone would die soon after. They'd be to panicked trying to figure out how to live with the planet cooling.",
            "Genocide of every different variety. Crimes against nature.",
            "You would be charge with nothing, as all living things on the earth would immediately cease to live.",
            "Decent inexposure",
            "I think everyone would be bummed out, and then die.",
            "Ar(sun)",
            "IF you did manage to blow up the sun you would get charged with 10,000th degree murder.",
            "Nothing about 8 minutes later everyone would die.",
            "Who tf is gonna charge you? Emperor Palpatine?",
            "You wouldn't be charged because the concept of law would no longer exist but you would be guilty of Omnicide.",
            "Assasanasun",
            "For being an F-ing idiot tbh the rest of the survivors would just kill you",
            "None, everyone would be dead.",
            "Indecent exposure",
            "Daylight robbery",
            "The sun is in international waters",
            "1 .Nothing, the earth would freeze in less then a day.\n2. Because how does anyone know you did it anyway.",
            "Mundicide, although nobody would be around to charge you with it posthumously",
            "None because who would be around to arrest you\n\nAlso, even if everyone lived somehow and nothing changed, none. It’s impossible so there are no laws around it.\n\nThis question really pushes the sub name.",
            "Genocide of literally every living things in this solar system",
            "According to galactic law, because no species in this system is registered you won't be up for any genocide charges. However, if investigated you will likely be charged for snuffing early sentient life which will likely lead to a restrictions on your free trade credit services for the amount of time sentience has existed in the system (usually calculated by the amount of time a planet has been light emitting). So you'd be looking at about 100 years on basic services with no access to most premium currencies. Just government issued necessity credits. You won't even get to keep the energy from the explosion. There pretty harsh about that sort of thing after Suề6.",
            "No charges, because everyone on earth would die in 8 minutes and 18 seconds if the sun blew up.",
            "We'd be dead",
            "Arsun",
            "No charges. The sun is not in the jurisdiction of any government on Earth.",
            "You'll never see the light of day",
            "Planetary genocide by means of solar detonation.",
            "Asunsination",
            "\"I felt a great disturbance in the Force, as if millions of voices suddenly cried out in terror and were suddenly silenced. I fear something terrible has happened.",
            "Galactic genocide. But you wouldn't be charged with anything because if you blew up the sun, you'd blow up earth.",
            "I mean that person who blew the sun up will have 8 min to hide",
            "Nothing because everyone would be dead.\n\nBut if anyone survived you'd be charged with various types of murder as applicable to the circumstances. And everyone would have a private civil right of action against you for ruining their enjoyment of the sun probably.",
            "Nothing we would all be dead",
            "Well, you wouldn't have to worry! You and everyone else you love would be dead within eight minutes, unless of course Elon Musk has an off-system colony that we don't know about.",
            "Death.\n\nEveryone would die before anything could happen.",
            "None, for who could possibly charge you?",
            "Daylight robbery",
            "Unless they can locate, capture and charge you in 8 minutes, nothing.",
            "Death Star 💫",
            "Really, NO stupid questions? \n\nOk once we answer this one I wanna know what would happen if I became a wizard and changed all the water in the world to cheese. Since humans are 70% water would our organs be able to handle the cheese? Would we be more yellow like the simpsons? Thanks I’ll take my answer off the air.",
            "In 8 minutes, we will drift into a frozen nothingness. So, I guess, uh, assault.",
            "None, we’d all die…",
            "Please don’t do that",
            "Questions like this are why we need to invest a lot in education and everyone should have access to it.",
            "Sounds uhm.. very specific. OP should we be worried??",
            "Breaking the laws of physics.",
            "You would be sentenced to 7 minutes of imprisonment.",
            "A whole fucking laundry list of charges.\n\n* Crimes Against Humanity.\n* Negligent Homicide\n* Destruction of Endangered Species\n* Destruction of Protected Sites\n* Destruction of Private Property\n* Breach of Environmental Protection Laws\n* Disruption of Government Functions\n\nList goes on and on.",
            "Daylight robbery. 😉😉",
            "You'd just be re-elected.",
            "Nothing as everyone would be obliterated, including you.",
            "Genocide, destruction of public property (4 trillion counts), destruction of private property (20 trillion counts), terrorist activity, illegal use of a destructive device, and because there are some nations that still have this law on the books, heresy and blasphemy."
        ]
    },
    {
        "post_id": "kjydtf",
        "author": "DJAnothaWun",
        "title": "Why do people keep calling me a \"filthy animal\" today?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/kjydtf/why_do_people_keep_calling_me_a_filthy_animal/",
        "score": 15547,
        "num_comments": 736,
        "created_utc": 1608899799.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/kjydtf/why_do_people_keep_calling_me_a_filthy_animal/",
        "comments": [
            "Its a reference to home alone. In the film there is a scene where he plays part of a film back where the words are 'keep the change,you filthy animal'\n\nEdit:got the reference wrong. I first put merry christmas instead of keep the change\n\nEdit 2: in number 2 merry christmas is used instead of keep the change. This has been kindly pointed out by my fellow redditors",
            "Today I learned there are 5 movies in the home alone line up with a 6th planned for 2021.",
            "\"Keep the change you filthy animal\"\n\nIt's a quote in a movie clip in the Home Alone movie. If you haven't watched it I highly recommend it.",
            "[deleted]",
            "Merry Christmas ya filthy animal! *sprays with Tommy gun* and a Happy New Year!",
            "Home alone reference you filthy animal... and a happy new year",
            "I’m so jealous that you get to watch it foe the first time! I saw it in theaters when I was about 10, and it was the best movie ever. Still is!! Enjoy!",
            "I've never watched 'Home Alone' but I think I get the gist of it. It looks like a lot of pratfalls and slapstick humor. I'm a 59 year old woman - should I bother watching it?",
            "Oh wow. I had no idea this was a thing. A friend of the family commented on one of our family Christmas photos \"Merry Christmas you filthy animals\" and I just thought it was kind of rude! Lol.",
            " \n\nIt is a reference to the very popular Christmas film, *Home Alone 2: Lost In New York*, which was released in 1992 and stars Macaulay Culkin as a young child who accidentally boards the wrong plane to New York City instead of Miami for his family's Christmas vacation. It is the sequel to the even more popular Christmas film, *Home Alone*, in which the same child is accidentally left at home when his family leaves for Paris over Christmas.\n\nThe line, \"Merry Christmas, ya filthy animal,\" comes from a parody film inside the *Home Alone* franchise. In the first film, the child, named Kevin, finds and watches an old black-and-white gangster film entitled *Angels with Filthy Souls*, a film that his mother would not let him watch because of its use of gun violence and language.\n\n*Angels* is not a real movie, but rather a film created for this film. The scene that is shown in *Home Alone* depicts a man that owes money to another man who appears to be the head of some sort of gang or mafia. The head man tells the other man the owes the money the he has to the count of ten before he shoots him. Well, he winds up shooting the man, and at the end, he says \"Keep the change, ya filthy animal.\" In *Home Alone 2*, Kevin finds the sequel to *Angels*, cleverly titled *Angels with Filthier Souls*, in which a similar scene is depicted with the same head man. This time, he shoots a woman, and at the end of the scene, he says \"Merry Christmas, ya filthy animal.\"",
            "Merry Christmas, ya filthy animal.",
            "Merry Christmas you filthy animal, and a happy new year.",
            "Because you didn’t keep the change, ya filthy animal.",
            "Now go watch Home Alone!! It’s an amazing Christmas movie.",
            "Are you a pizza delivery guy or burglar?",
            "Because you’re an uncultured swine",
            "Take my upvote you filthy animal.",
            "Man this made me laugh. Merry Christmas",
            "Assuming OP is still out of the loop, here's my attempt in brief.\n\n\"Merry Christmas, ya filthy animals!\" is a quote from Christmas classic film, Home Alone. I don't recall exactly where, but I believe it's said by Kevin McAllister to the 2 bumbling crooks during their break in attempt. \n\n(Side note, my mum's relatives are McAllisters, and I'm surprised none of them have named one of their sons Kevin.)",
            "Wow there are people who don’t know where this is from?!",
            "They want you to keep the change?",
            "It's from the movie *Angels with Filthy Souls* which is really just a short film made specifically for  the few lines Kevin plays to the pizza guy and the Wet Bandits in *Home Alone*. It's a quote from a film within a film",
            "Home alone",
            "Probably because they don't want their change.",
            "[Keep the change ya filthy animal!](https://youtu.be/-nHNHIDduH4)",
            "I am happy I know the answer to this",
            "Filthy animal",
            "I can see why this might be alarming if you didn’t get the reference.",
            "It’s from Home Alone.",
            "Are you perhaps a filthy animal?",
            "probably because you're a filthy animal lmaooo",
            "Home Alone reference.",
            "Imagine going through life never having seen Home Alone",
            "Cos of home alone and it is funny🤣🎄merry Christmas",
            "How old are you",
            "Merry Christmas, ya filthy animal.",
            "[removed]",
            "*brrrrrrrrrrrrrrrrrrrrrr* keep the change ya filthy animal",
            "Merry Christmas. I loved seeing this today. Thanks for the smile.",
            "They think you're a closet furry >:3",
            "Keep the change, ya filthy animal",
            "Google, dip shit",
            "Just watching home alone again as I saw this post, great memories",
            "https://youtu.be/Oa8d6yATO6o?t=127",
            "TIL: Some people I've said \"merry Christmas ya filthy animal\" to don't understand why I said it 😅",
            "You filthy animal",
            "Watching Home Alone is a Christmas tradition in Poland and when Polsat (tv channel) announced few years ago that there will be no Kevin that Christmas Eve, people kept protesting until the station changed their mind.",
            "Asking myself the same thing",
            "It's a home alone reference",
            "Answer: it's a reference to  home alone but it should be a reference to *This Podcast Will Kill You* which is fantastic and ends all of thier episodes in the Covid Era with \"and wash your hands you filthy animal,\" which itself is likely a reference to  home alone.",
            "You’re a pizza delivery guy and he wants you to keep the change.",
            "Did Mark Rober repopularize the quote for this year? I never heard anyone quote the Home Alone 2 line until  after I saw his new porch pirate trap video.",
            "#AND A HAPPY NEW YEAR, TOO!",
            "Keep the change ya filthy animal 😂",
            "And get your keister off my property? Must watch it again.",
            "Filthy animal",
            "Merry Christmas ya filthy animal!",
            "Merry Christmas ya filthy animal",
            "“Angels with filthier souls.”",
            "Home Alone!",
            "IN HOME ALONE MOVIE FGOODG",
            "I never knew it was from Home Alone (i've never seen it in english), i just know the line was used in a song i really like lol",
            "It’s a reference to home alone, speaking of which, I was surprised with the nerf guns and a watch that were used in the movie set of Home Alone 4, which is currently being filmed!",
            "As in \"Merry Christmas you filthy animal?\"\n\nIDK, but two things're for certain... keep the change and a Happy New Year.\n\nBut ye, like the top comment says, it's a Home Alone reference. Specifically the second movie.",
            " You should also keep the change",
            "Probably because you are one, you filthy animal.",
            "Home alone memw",
            "Tell me about it",
            "Hahahah. What an amazing question. You made me feel so old, you filthy animal!",
            "Merry Christmas ya filthy animal. And a happy New Year.",
            "...as if the movie isn’t playing on repeat in the background",
            "I tend to tell people \"shitters full\"",
            "Keep the chAnge!",
            "Google? Much faster than Reddit for a question like this",
            "Haha we just watched this tnite and felt the need to tell my daughter ‘to keep the pringles ya filthy animal’ she got the reference 🤣",
            "Ironically I'm watching home alone and browsing reddit when I came across this.",
            "I’ll give you to the count of ten to figure it out. \n1...\n2...\n10",
            "Do you deliver pizza, perchance?",
            "Because you refuse to bath....?",
            "Guess you never watched Home Alone huh?",
            "Does anyone know that old movie?",
            "Because you are a filthy animal",
            "Lmao. Watch Home Alone.",
            "Keep the change ya filthy animal lol",
            "Have you actually not seen Home Alone? I mean how have you avoided it even on tv?",
            "These answers make so much sense. \nI didn’t know that and was wondering it myself!",
            "You was smoochin with my sister that's why",
            "cuz of your internet search history",
            "Because of home alone?",
            "Are you a filthy animal?",
            "Huh, people call me that every day.",
            "Because you need to stop wallowing in the mud outside.",
            "Have you mostly been in Reddit's porn subreddits? That's the only place I've been seeing these references.\n\nThey're references to Home Alone. Not particularly funny IMO, but for whatever reason they've caught on this year.",
            "keep the change",
            "Omg this post made me die lmao Merry Christmas ya filthy animal!",
            "Merry Christmas you filthy animal. And a happy new year.",
            "Merry Christmas, you filthy animal!",
            "Go bathe, simple.",
            "Keep the change",
            "[deleted]",
            "[deleted]",
            "I'm confused. Is this your first year hearing this? The movie's been out forever. Or is this just the first time you've decided to ask?",
            "Are you a bad person?",
            "No offense but I'm guessing your a uncultured swine. It's a reference to a movie that's shown in home alone",
            "Because you were wearing your mask underneath your nose thats why.",
            "Did you cover yourself in your own feces?\n\nCuz covering yourself in your own feces will do that.",
            "Its a reference to one of the most overated films ever, home alone.\n\n\n\nEdit wow down votes lol its an opinion guys, not a dick, don't take it so hard.",
            "They",
            "Cos it is Christmas and they are wishing you a merry Christmas, you filthy animal!",
            "Cause you need to go home.",
            "Cus' you're a filthy animal. \n\nJust like me ❤️❤️\n\nMerry Christmas ❤️❤️",
            "Are you showering with soap?",
            "Probably because you’re dirty",
            "Lol",
            "Haha snap.. didn’t think anything of it til...",
            "I got Facebook banned for saying this the other day... Yes, you can hate me",
            "Ya no-good keister.",
            "Have you been bragging about having nasty sex with your wife again?",
            "U suck",
            "[deleted]"
        ]
    }
]