[
    {
        "post_id": "di2w0a",
        "author": "None",
        "title": "I recently stopped drinking Dr. Pepper and have been drinking only water for like 3 weeks now. I've noticed that I have lost weight and now feel much healthier, but now I'm crazy exhausted at all times, much more than usual. Could me cutting off sugary soda be the reason for this?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/di2w0a/i_recently_stopped_drinking_dr_pepper_and_have/",
        "score": 15018,
        "num_comments": 1001,
        "created_utc": 1571115260.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/di2w0a/i_recently_stopped_drinking_dr_pepper_and_have/",
        "comments": [
            "You will feel tired from the caffeine withdrawal.  But... that will eventually go.\n\nEdit:\nyes, it has caffeine.\nhttps://www.caffeineinformer.com/caffeine-content/dr-pepper\n\nWithdrawal can  also take long periods.\nhttps://americanaddictioncenters.org/withdrawal-timelines-treatments",
            "just keep doing what you’re doing.  you are in withdrawal stage from less caffeine and sugar\n\nit will pass.  push through it.  \n\ni mean it’s not like heroin withdrawal.  you will be ok\n\ndrink plenty of water and also try eating slightly more fruit and veggies than you typically do\n\nnot crazy amounts, just a little bit more fruit and veggies.  that should help.  good nutrition",
            "It could just be your sudden change in lifestyle that may be brining this exhaustion.",
            "Yes and the caffeine.",
            "Yeah, although caffeine takes only a very short time to run out of your system, your body will take weeks to readjust if your previous intake was high, as your post suggests it was. Ride it out and, since you're eating whatever you want, go for some big pasta dishes at night for example to stock up on carbohydrates that'll energise you for longer than a sharp, short caffeine/sugar boost like a coffee or chocolate.",
            "Try some green tea for light caffeination and antioxidants.",
            "[removed]",
            "If you drank a good amount of soda (as I currently do), you'll rack up hundreds of calories like no tomorrow. Make sure you replace those calories (unless you are trying to accomplish a calorie deficit). That may be a part of your exhaustion. IMO.",
            "Just a little caffeine withdrawl. I'd say expect some headaches too",
            "[deleted]",
            "Caffeine & sugar withdrawals are this; diluted real fruit juice helps curb the headaches/lethargy\nCongrats for cutting out soda!",
            "Drink some tea or eat an apple",
            "Caffeine withdrawal",
            "This is the usual effect of a caffeine withdrawal. Since sodas tend to have caffeine, this is natural for someone stopping. It will eventually stop.",
            "You’re going through sugar detox. \nCaffeine will be the first to knock you. Then the sugar withdrawal kicks in. Sugar is an addictive substance and alters your brain chemistry. \nThe stages of sugar withdrawal are like other hard drugs, you feel worse before you get better. \nYour body will come through it shortly.\nWell done on making a positive change to your lifestyle.",
            "Diabetic here (type 2). \n\nThe sugar withdrawal is probably not making you feel tired. The major effects sugar has on you blood is to cause massive swings in energy. When you eat pure sugar, like candy and soda, your body just puts that shit right in your bloodstream for use. It thinks you're giving it energy to use foe something like exercise. So you blood sugar goes up, but your muscles don't use enough of that sugar. And too much sugar in your blood for too long is bad for your body (if I remember correctly, it will damaged your arteries, but please correct me if I'm wrong, reddit).\n\nSo your body stores the sugar using insulin. The insulin enters your blood stream, binds to the sugar, and then stores that energy in fat.\n\nIf you eat things like bread or meat, the same process happens, but it takes long and you get less of a sugar spike. Which is good. Those types of foods eventually get made into sugar, but they need more digestion time. So it's like a slow-release pill of energy, instead of medicine. \n\nBut what goes up must comes down. High blood sugar spikes lead to big dips. You're kinda teaching your body to be wary of those massive spikes. And you're also building up a tolerance to the effectiveness of your natural insulin. \n\nBut when you start eating healthier and smoothing our those spikes, you get less blood sugar crashes. The best way to help this is to go for brisk walks immediately after eating a big meal. \n\nBut all of this is to say...getting out of these spiking cycles shouldn't give you less energy, but rather, should make things feel more even. More balanced. You get fewer highs and fewer lows. \n\nSo no, it's not the sugar causing your dips in energy anymore.",
            "Try having some tea or coffee to get the caffeine boost.",
            "One answer simply could be you are actually more dehydrated due to drinking less water overall. Chances are you dont drink as much water as you did soda because its not as nice. It can be hard to just drink water for the sake of it like you can with soda or juice. Maybe compare how much you drink in a day now compared to how much you drank from drinking other drinks.\n\nDehydration is a very common cause of energy loss and most people forget about this and jump straight to the energy rich foods as cause for concern.",
            "My guess is that your body is still adjusting from the sudden changes in your sugar intake from the Dr. P. I mean that was alot of activity demanded from your pancreas and now nothing, plus the caffeine stopping as well, but just keep it up! I knew a guy who drank Dr. Pepper with every meal and all day long and he gave it up too and not only did he lose over 20lbs he says he feels like a different person now...",
            "Hey I did this a while ago. I didn't feel anything when I switched so it might just be a you thing.\n\nBut in the meantime, welcome r/hydrohomie",
            "Caffeine withdrawals. Give it some time and eventually you’ll feel much better without having caffeine than you ever did with caffeine",
            "It's also worth noting that if you're losing weight then you should expect some of the same symptoms of people on a diet/cutting calories. Being tired could definitely be a symptom of the weight loss and could improve once you start to eat a bit more.",
            "Low blood pressure as you adjust",
            "How much of the stuff we're you drinking? What percentage of your daily calories came from Dr pepper? If by stopping drinking Dr pepper, you have considerable reduced your calorie intake then you will feel fatigued and if you are already in a healthy weight range then you should replace those calories with something else.",
            "Are you getting enough protien and complex carbs in your diet?",
            "Caffeine withdrawal is probably the reason. In the meantime, try tea? It's hot leaf water.",
            "Welcome to r/hydrohomies",
            "I’d say it’s your body clock trying to asses a new pattern",
            "You can watch the movie sugar land, you will better understand how the sugar affect you. \nReally interesting and funny !",
            "I don't know if you've heard about the book Sugar Blues by William Dufty...\nHe talks about the effects of sugar on the human body and will blow your head off. Explains the reasons what's going on with your body.",
            "I quit drinking around 2 or more liters of fizzy drink a day for new years, at first it was a killer to drink water as i didn't like the taste and i felt so ill for like a month but that stopped in the end. It took like half a year to not have to actively stop myself having a fizzy drink and forcing water,but now its pretty okay still love smelling them guilty pleasure",
            "I'm not a doctor but I would guess that you have an underlying issue that was masked by your heavy caffeine intake. Do you get enough deep sleep? Do you work out (even light work outs) regularly? Are you coping with stresses in a healthy way? When I switched from eating and drinking junk to eating lots of veggies and drinking only water or tea, I felt tired too. But I realized it was because the bad stuff (like a drug) was masking my tiredness due to lack of sleep, stress, and lack of work outs.",
            "O stopped drinking energy drinks, coffee, and soda at the start of 2018 and I just started taking equate caffeine pills. Went from a whole pill in the morning, and one at lunch, and now I'm down to a half of one in the morning. Caffeine makes the world go round...",
            "Prob cuz ur body depended on the sugar from doctor pepper to give you energy. Feeling tired a couple weeks is just ur body trying to tell you to drink Dr pepper. However, with enough time your body will adapt properly",
            "you just lost a lot of calories as well.. caffeine is part of it but you probably aren't eating enough anymore, unless you needed to lose weight anyway. in which case then just bear with the tiredness and start exercising",
            "It's withdraw symptoms. Dr. Pepper has loads of sugar in it and your body probably depended on the sugar overtime for energy. Your body just needs to adjust, it might take a bit, but it's totally normal.",
            "I drank a ton of pop back in the day. Three years ago O have switched to drinking black coffee. It's helped the caffeine withdrawls a lot, and I have also lost weight. Just don't go too crazy with the coffee too.",
            "https://i.kym-cdn.com/photos/images/original/001/471/227/dd0.png",
            "While the internet is a magical place if you're feeling out of order getting a checkup is a good idea. Your doc will be thrilled to help you with this. Good job!",
            "A drop in blood sugar levels makes a person sleepy.",
            "I just do a little bump everyday to give my self that extra little something",
            "Oof, your post and everyone's answers kinda scare me about feeling more tired as I already struggle from lack of energy. But they have given me the motivation to try and be more healthy and stop drinking energy drinks daily.",
            "Sugar and caffeine withdrawals.\n\nBest bet is to drink lots of black tea when coming off caffeine. Like crazy amounts of tea. It gives caffeine but tempered with tannins. It makes you feel calm but alert. That's how I got off a decade long coffee habit, now I enjoy coffee on the occasion.",
            "Yes, that is exactly the reason, along with the lack of caffeine. Your blood sugar is a lot lower than it used to be, so you feel sluggish.\n\nI went on the keto diet about 6 months ago and I used to drink a ton of soda and like 1-3 cups of coffee a day. After a month of just drinking seltzer and water a lost a bunch and my insulin stabilized (I'm not diabetic, just it was constantly high since I consumed a fuckload of sugar) I felt a lot better. I'm getting off of keto now, but I still feel fine, and am trying to stay away from all sugary beverages. If I want something sugary I go for something sweetened with sucralose ( coke zero or Pepsi 1) or stevia.\n\nOnce you are off it for a while and then go back to drinking a can of the regular stuff you notice that it's ridiculously sweet. I can barely drink a regular can of coke anymore.",
            "Are you still going to bed at the same time as when you were drinking the soda?  If you're used to going to bed pretty late that could have been a function of the caffeine keeping you awake later rather than your body's natural rhythm.  When I quit caffeine before I had to reset my internal clock by going to bed pretty early (sometimes 8pm) for a little while until I adjusted to the lack of caffeine.  Once my body adjusted, I figured out my natural bedtime (e.g. when I got tired enough to sleep) was around 9:30pm.",
            "Pro tip: A heroin addiction negates the effects of sugar/caffeine withdrawal.",
            "Both sugar and caffeine are addictive chemicals rhat use similar pathways in your brain as addictive drugs.  You are in withdrawal from both",
            "I have the same thing happening. I'm so tired all the time after cutting out pop and candy.",
            "The sudden decrease in caramel coloring might be making you feel bad.",
            "Substitute with beetroot juice",
            "I like using caffeine as a stimulant, it's been shown to improve memory in the short term so I try to have a cup of coffee before trying to learn things.    \n\n\nThat being said, it's also not good to be addicted to it, the withdrawals suck, so moderate and deliberate use is key.  It can bring benefits, but in excess it can make it so when you don't have it your system is slower and more tired than normal.    \n\n\nBalance is a good thing.",
            "Yes. The change from soda to water means you are \n\n1. Substituting a high calorie drink for a 0 calorie drink. Depending on how many sodas you drank per day can range 100-1000 calories that are filled with sugar and low nutrient ingredients. Your body will loose weight when in a caloric deficit. \n\n2. Your body's main porpoise is survival and when the body does not receive adequate water it stores it. Once you drink enough water per day the body will rid itself of the stored water which will reduce puffiness and bloating. Water weight does not equal fat so when you say you are loosing weight its a combination of water weight and fat from now consuming less calories per day. In time your body will regulate and you will stick to a specific weight unless your start changing your food diet as well. \n\n3. Unless you were drinking caffeine free soda, the soda you were drinking is a mixture of caffeine and sugar. Sugar is a simple carbohydrate that when consumed is turned into glycogen quicker and used for energy which is why added sugar is not good for most diets. \n\n4: In terms of caffeine [here is a vide explaining its effects.](https://www.youtube.com/watch?v=vpeE6dQQ_j4)",
            "YES!",
            "Just out of curiosity, how much dr pepper would you say you drank?",
            "Aside from the possible caffeine withdrawal, you might be running into a calorie deficit. Especially because you mentioned that you lost weight. Might wanna look into that. A minor deficit can be a good thing, depending on your goals, but a major deficit will leave you feeling more exhausted than usual.",
            "You are probably going through caffeine withdrawal. It should go away in a bit.",
            "Eat fruit, it helps with the withdrawal",
            "Yep, when I stopped drinking soda I lost 7 pounds immediately (which is a lot considering my starting weight and height). Replaced it with coffee (no cream/sugar). Not great perfect but an improvement.",
            "Gratz on the weight loss. I gave up sugary drinks a couple of years back and never noticed a difference. I never drank much. Maybe a 12 Oz can a couple times a week. Sweet tea was the hardest to give up. Didn't lose an ounce from it but I feel better knowing that garbage isn't in my body. I drink water 90% of the time and black coffee and sometimes herbal teas fill the other 10%. \n\nI gave up snacky cakes (little Debbie ect) a couple of months ago. Had about 2 a day on average. Weight is still holding steady. I'm 5'11\" 260. My weight will fluctuate from 254-267 over a week's time. I've cut almost 1000 calories a day from my diet over the last few months and don't see any change in my clothes or the scale. Might as well go back to enjoying sweets :/",
            "add some healthy foods and stuff.",
            "Drink some sprite. Caffeine free and has less sugar than most sodas. The placebo effect helped me with my soda addiction.",
            "Sugar and caffine withdrawal will cause this.  However, it will go away in time.  Trust me, it gets better!",
            "It's mostly the caffeine withdrawal. You can switch to better alternatives, like green tea, yerbe mate, or coffee.",
            "Yes",
            "i think part of it might have to do with blood sugar as well.  do you feel energized after you eat?  or is it all caffeine related?",
            "If Dr.pepper is like coke, the problem is caffeine. You gey extremely dependent on caffeine (more than sugar I would say ?). Try just being like that for more days and it should go away, or jusy drink ☕ (don't recommend)",
            "Yeah, if you drink it enough! Most likely the exhaustion is sugar and caffeine withdrawal. Don't worry! You'll probably adjust. :)",
            "You can supplement that feeling with black coffee",
            "Both sugar and caffeine withdrawal.   Are u drinking tea or coffee ? Or diet sodas with caffeine still ?",
            "You are withdrawing from all that sugar.  I don’t know how many cans you wear drinking but I know if you take raw sugar and measure out the amount in on can of DP you would be shocked",
            "Congrats on switching to water. You’ll be feeling much better!!",
            "Cutting out sugar is no joke. It could take a month or even 2 to no longer feel the symptoms of sugar withdrawal.",
            "Not could, it is. Just don't give in, continue and the effecr will go away in time and you will feel good.",
            "Drink Fresh juice with smelt of justice 😏",
            "Buy over the counter caffeine pills and break them up into little bits. Try one",
            "Generally speaking, it takes the brain up to 4 months to correct dopamine and serotonin receptors so that your normal production of those chemicals will suffice in giving you the energy you used to get from caffeine.",
            "You're consuming less calories and less caffeine. Try taking up coffee with a low calorie sweetener to get that pep back. Congrats on the weight loss!",
            "Drink coffee with no sugar. This is a great addiction to have.\n\nSource:  Coffee addict",
            "You sound familiar, do you currently reside in Manchester, UK?",
            "Yes",
            "When you make a big change like that you need to eat better too or your boddy will not have the energy.\nYou should visis a nutricionist to ensure you are getting all the important stuff your boddy needs",
            "I keep reading this as someone telling their doctor, by the name of Pepper, that they stopped drinking.",
            "Yes...?",
            "It will be the caffeine but also the reduction in sugar.\n\nWhen you eat sugar your body responds by producing insulin which can be used as a form of energy for your body to use. Excessive consumption of sugar leads to lots of problem such as weight gain and type 2 diabetes. \n\nAt first when you reduce your sugar intake your body most likely will continue to produce more insulin than it needs at first. This can lead you feeling more tired and lethargic due to the absence of sugar that is used with the insulin produced. \n\nAfter a while your body will adapt to changes in your diet and you should feel better again even with the absence of caffeine.\n\nMy advice is do not consume more food if you are feeling tired. You need to let your body adapt to your current diet.",
            "I’ve cut caffeine out of my diet for about 3 weeks and I feel fine in all honesty. Just been drinking flavoured water, diet drinks with no caffeine and regular water.\n\nCarry on drinking water and a small dosage of caffeine doesn’t hurt, maybe going cold turkey caused immediate caffeine withdrawal symptoms?",
            "This is a good thing. Youre probably burning more calories throughout the day. Focus on your sleep schedule now! Youre one step closee to feeling H E A L T H Y B O I",
            "What would happen if I quit beer for 3 weeks?",
            "Yeah probably the caffeine. Do you drink coffee?",
            "Have some coffee when you feel super tired"
        ]
    },
    {
        "post_id": "12z90g3",
        "author": "bacon_bbh",
        "title": "Do men care if women wear the same top on a date?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/12z90g3/do_men_care_if_women_wear_the_same_top_on_a_date/",
        "score": 15002,
        "num_comments": 5374,
        "created_utc": 1682491328.0,
        "selftext": "Im going on a 3rd date with a guy and I want to wear the same top that I wore on my first date. Is this a bad thing..? Do men care about things like this?\n\n\n[DATE UPDATE] \nThanks for the replies yall can stop now. Turns out this dude didn’t even know this was a date and never had romantic feelings for me. I guess the last thing I should’ve worried about was the stupid top I was wearing. Fyi the top is a light gray off shoulder and I hate myself for stressing out about wearing it for the second time for this dude who couldn’t give 2 craps about me.\n\nTo answer the question, men don’t care. Wear whatever you want ladies and gents.",
        "permalink": "/r/NoStupidQuestions/comments/12z90g3/do_men_care_if_women_wear_the_same_top_on_a_date/",
        "comments": [
            "out of like 10 men i talked to about that subject only 1 cared, so just go for it",
            "[deleted]",
            "I can't speak for all men but I A) wouldn't care and 2) probably wouldn't notice at least right away.",
            "The only way I'm caring if you wear the same top again that soon is if one of the following has happened:\n\n1. It's an \"I'm with stupid -->\" shirt and you insist on it pointing to me the whole time.\n2. It has a giant stain on it that I caused and you're trying to make me feel worse about it than I already do.\n3. It's one of my tops and you're trying to remind me that you know where I live and can break in easily.",
            "It's fine. Men don't care.",
            "He won't notice. Unless it stand out in some way.",
            "Nobody cares about these things. You have a washing machine for a reason & if you feel comfortable in that top then wear it! X",
            "These are basically the possible reactions for me:\n\n* I didn't notice the top last time. Doesn't matter\n* I did notice it. Eh whatever, a top's a top.\n* Not only did I notice it, but I thought it looked cute. Yay, the return of the cute top!\n* I noticed it but didn't like how it looked. Whatever, people have different tastes.\n* I noticed it but didn't like how it looked, *and it bothers me*. This probably means I'm actually bothered by something else entirely I can't quite put my finger on, and I'm just latching on to the thing I can see.\n\nNotably absent from the list: I thought you were somebody I'd like to be in a relationship with, but your sartorial preferences made me change my mind.",
            "Seinfeld question",
            "At 50 years old, I am still amazed that women plan their outfits ahead of time. I used to decide what I would wear for a date when I got out of the shower.",
            "Not even a little.",
            "If it's your third date in two days, we might notice or care.\n\nLike, if you wore your blue t-shirt with the Captain America logo on it when we went hiking on Saturday morning, then changed shirts to wear a black top on Saturday night, and then we meet against on Sunday for lunch and you have your blue Captain America t-shirt again, I might notice that you're wearing it again. Hopefully you washed it?\n\nOtherwise, if days have passed between dates, not a big deal.\n\nIf the rule of etiquette is  that you can't repeat parts of your outfit that soon, a LOT of us guys are in trouble. \n\nLike, most of my shirts are very similar styles of gray, blue, or white, and if I have to go digging in the back because I'm not allowed to wear any of those until several dates have passed, I might need to go shopping.",
            "I feel pretty safe in saying that no straight man cares even a bit if his date wears the same thing more than once. There's a decent chance he won't even notice it, or at least will think you may have worn it before but won't be sure. Either way, he won't care about that.",
            "If guys don’t notice when you get your hair cut, you think they’ll notice you’ve worn the same top a couple of times?  In all seriousness though, no, most guys won’t care, if you think the guys liked what you wore on the first date, then wear it again, he’ll like it just as much the second time.",
            "As long as you've washed it :)",
            "I wouldn't. I'd even be happy if I caught it, and I could say somethiny like \"oh, you're wearing that beautiful top you brought to our first date\".\n\nAlthough I'm now wondering if that could be interpreted as snide, but in my head I would just be trying to show of that I can pay attention.",
            "Nope.  You look great to us whatever you're wearing.   \n\nSeriously.  we probably don't even notice...  it's not that we don't care...  it's just not what we're programmed for.",
            "I hope he cares more about you than what you wear",
            "If the outfit got you to the next date, it's a good one, wear it again.",
            "Only another woman would give you a hard time about wearing the same dress to two different events.  Most guys want you to wear your favourite clothes more often.  “Hey, remember that top you wore on our first and third date?  Can you wear that tonight when I introduce you to my friends?”",
            "From Dr. Obvious’ “Understanding men 101”-   \n*”…unless it’s stained, highly suggestive, or very revealing, a man will not notice remember about what you’re wearing. Ever.”*",
            "You could show up dressed as a lumberjack in a welding mask and most men won't care.",
            "It's a pretty good sorting method. \n\nIf he cares, he's not worth it.",
            "Well i don't care and I think it's the same with majority . We are happy you are ready to go on a 3rd date . It means the other dates were good",
            "If it’s low cut I can guarantee he won’t even notice.",
            "> Thanks for the replies yall can stop now. Turns out this dude didn’t even know this was a date and never had romantic feelings for me. I guess the last thing I should’ve worried about was the stupid top I was wearing. Fyi the top is a light gray off shoulder and I hate myself for stressing out about wearing it for the second time for this dude who couldn’t give 2 craps about me.\n\nI actually just had this happen to me, except it was after two months, not two dates. Lesson learned: set clear expectations up front",
            "I’m sorry the date didn’t go as planned",
            "Wear what makes you feel confident and comfortable. Men don’t usually care about that stuff.",
            "He won't remember. Men also don't remember shoes. For men, people don't have feeds and shoes.",
            "If you look hot in it, we don't give a fuck how many times you wear it.",
            "Chances are he will be wearing the same shirt",
            "Oh no! That edit lol\n\nSorry it turned out like that :(",
            "I'm confused. What happened to cause a mix up in what you thought was dates but he didn't?",
            ">Turns out this dude didn’t even know this was a date and never had romantic feelings for me.\n\nF",
            "He will probably think you look great in it, other than that nope guys don't care. Girls can be judgemental and bitchy about this stuff for some reason, but personally as a guy there is a 90% chance I would never realize it was the same one",
            "I don’t expect my dates to buy new clothes just to hang out with me, and your date probably doesn’t either. Just wear the things that you think look nice and that you feel good in.",
            "Men dont notice that. He would notice maybe if you wear it on all dates and its the 10th date but before that, if you dont mention it, he wont know.",
            "I agree with most of the comments that he won't care. Though a small caveat :in case he really dislikes the top to start with then he would be bothered seeing it again and again",
            "So what I’m taking from this is, boys mostly don’t care what girls wear?",
            "We don’t give a fucking shit really",
            "The only time men notice clothing is if it looks really good, looks really bad, or we get asked about it.\n\nIf this is a top you like and he ends up noticing, it's because it looks good on you.",
            "You're giving us a lot of credit even thinking we'd notice, much less care. If you like it then wear it.",
            "I would prefer if my date wore no top",
            "Sorry your date went poorly. Chin up, you'll catch someone 🙂",
            "I'm 24 hours late to this topic, now I just want to know how your non-date went.",
            "I know a couple of men who do care about how one dresses or that it’s not repeated often. I personally don’t care but to each their own.\n\nYou shouldn’t care about what he will think (negatively) before wearing something.",
            "In general, we don't. He possibly won't even notice.",
            "Lots of people will say he won't notice but he probably will. Especially if its a cute top you like/think he likes. Nothing wrong with wearing it again but dont expect it to he co pletly unnoticed",
            "I mean..do you not have more clothes?",
            "There are some men that will notice but very, very few that would ever care. Most of us, if we did notice, would just assume you wore it again because it’s one of your favorite tops. In your case, it seems like you’re confirming that to be true.",
            "Let me put it this way: it's not something of concern unless it becomes an issue of basic hygiene, where I would think \"I don't think she has any other clothes beyond this one set\". Otherwise, unless there's something really special about a piece of clothing, we don't notice or remember. My wife will sometimes go: \"Do you remember the dress I wore on our Xth date to XYZ?\" No. Fuck no. I do *not* remember.",
            "If he liked it he will like it again. :)",
            "This could work well in your favor. Will he notice? Maybe. Maybe not.  \n\nWill he care? Probably not at all, or at least, not likely. \n\nAnd if he does, he doesn’t care then that much for you. Because if he’s really interested, that is the last thing that he would be worried about. And if he cares, he’s pretty darn shallow.",
            "Like the meme says, only women care about this. Of course it's an overgeneralization but 99% sure he won't care.",
            "Jokes on you, he only has 3 pairs of pants",
            "I was once dating a girl for about 3 years. She dramatically changed her hair. It took me 3 days to notice. Wear the top again",
            "No.Not an issue at all. If you like it & you like wearing it,that’s all that matters.Your confidence is really all they see.\n\nAs a good male friend of mine would say…..”That shirt looks good on you but it would look even better flying across the room”\n\n(If this offends anyone I’m sorry but lighten up it’s just a joke.)",
            "I don't even remember what I wore yesterday, you'll be fine",
            "Most of us don’t give a damn what you wear unless it’s extremely goofy which might make us laugh or be creeped out, probably the first one and He probably won’t even mention it (or might even not notice!) \n\n Contrary to what women think, Men usually don’t judge your nails, shoes, hairstyle, makeup, fashion, etc. If it looks good then that’s ok as long as it’s clean. Just don’t be a bother to be with and we’re happy.",
            "Clothes are meant to be worn more than once.  \n\nIs it dirty? Have you washed it in between?",
            "This sounds like a cliche but if they do then they aren’t worth your time.\n\nIdeally I’m trying to get to really know someone by date 3 - I don’t give a shit about your wardrobe. If you’re comfortable and like it, that’s attractive.",
            "The only dude who is going to recognize you wore the same top twice is a dude that liked it the first time and is pleased to see it again.",
            "As long as you've cleaned it since the first date",
            "No. Wait. Women do?",
            "He either won't notice, or hell think \"oh boy that's my favorite sexy top of yours if only you had 5 of them so I could see you in it all the time\"",
            "The key to happiness is doing nothing with the intention to bring men joy. Wear whatever you want. Be whoever you want. Order whatever you want.",
            "We’re happy you’re going out with us.   Wear whatever you want.",
            "He likely won’t notice. \n\nIf he does notice, he’ll likely not care at all.",
            "This feels like a Seinfeld plot.",
            "Wait so... You were going to have a third date and the guy didn't think it was a date? What is happening here? I am so invested.",
            "Did you wash it between uses? If so it’s fine.\n\n. . .\n\nCome to think of it I don’t think guys are particularly picky over whether or not she washed it either.",
            "I would applaud you for being practical with your clothing choices. \n\nIf it looked good enough for a first date, it still looks good. \n\nHeck, men wear the same shirt all the time.",
            "I wear my lucky underpants on every date, so I don't see the issue.",
            "No, we do n ot care if you wear the same top again.\n\n&#x200B;\n\nSource:  am 50M.",
            "3rd date….don’t care because I’m hoping to take it off anyway.",
            "I can't speak for *all* men, but I think I can say with reasonable accuracy that the majority of straight men wouldn't give a fuck. I would probably not even notice. Wear whatever makes you comfortable and whatever makes you feel good in your own skin.\n\nFuck, I wear a jeans every day and I have like 4-5 identical shirts.",
            "Gonna be quite honest with you: I would definitely not notice anything, and I think most men don't. And if they do, they just don't really care. You're fine, as long as you washed your clothes since the last date.\n\nYou can test your date by asking him what he thinks about your 'new' dress. I bet he will 100% pull a bluff as I would have done as well. If he finds it absolutely amazing, he is either lying, because otherwise it would have been memorable, or he just doesn't care and has no opinion about the topic, but just bluffs to make you feel better.",
            "Not at all, where whatever makes you feel comfortable.",
            "I would notice, because I notice things like that. But I wouldn't care in the slightest.\n\nWe (guys) want to see you, not your clothes.",
            "No respectable man would give issue to such a thing.",
            "I think you have a bunch of simps in this thread on the \"he won't notice, men aren't interested in those things\" because they themselves would just be happy to get a date, and they would rather soothe you than tell you the truth. \n\nI would notice, I don't think I would hold it against you, but I would notice. Not all guys care if you're stylish, so it might not matter to them. And if it doesn't matter to you then I doubt you want a man who it would matter to. So do you, don't try and be something you're not, unless you're trying to improve yourself.",
            "Those who care usually date other men.",
            "No lol",
            "No",
            "My wardrobe concerns would be more along the lines of how you look and how good your clothes look on you. I don't think I'd necessarily remember that you wore it recently. And if I did, it'd again be how I think it looks. If it's a good top and I thought you looked good in it, I'd be happy you wore it again. \n\nWorrying about wearing the same clothes more than once is more of a women keeping women down thing. It's about class conflict more than anything.",
            "I can only speak for myself, but I wouldn't care and honestly almost certainly wouldn't remember what you wore multiple dates ago.",
            "Lol. I would not even notice :D",
            "I probably wouldn't even notice, if I I did then you know Im quite interested in you",
            "Care??? Most wont notice",
            "I'd be very surprised if anyone even noticed",
            "Never in my entire lift have I ever noticed that someone was wearing the same clothes 2 days in a row.",
            "Chances are good he will also wear the same shirt :D \nMen don't notice or if they do they don't care. Wear what you feel comfortable and pretty in!",
            "90% chance I wouldn't even notice",
            "No.",
            "No. Odds are I'm wearing a lot of the same clothes. If it's early in our relationship I might wash them between the dates too.",
            "No absolutely not even the men who care about fashion are not likely to look down on it. Guys wear the same tops all the time like I literally have 3 of the same shirt in different colours for multiple sets of shirts.\n\nI typically notice if a girl wears something new and I notice if she wears the same thing again but I very literally do not care if she wears the same outfit. I usually just assume it's her favourite or likes it.\n\nBut for the record I'm unusually observant most men I know wouldn't notice at all if you wore the same outfit three dates in a row.\n\nWomen are more likely to judge then the men. I mean would you judge a dude if he came to date 3 in the same shirt he had in date 1.",
            "If you like it and you feel comfortable and confident he honestly won’t care.",
            "We literally couldn't care less. It seems a self imposed limitation by the lovely lady kind. Just have at it!",
            "If you look good, feel comfortable and confident, and you like wearing it then wear the same damn top.\n\nWe really don’t care because we’re dating you not your wardrobe.",
            "No",
            "Of course not, don't be ridiculous",
            "Nope. I’m probably wearing the same top I wore to the first date as well. 😂",
            "Don’t care and likely won’t notice",
            "If you wore the same exact outfit for a month, we would be close enough after a month id ask why, I guess. But tons of people have fave articles of clothing!\n\nI'm sure you are more beautiful than you know, and wearing favorite clothes will make you happy and make it show!\n\nYou'll smile more, I would too. Chances aren't its the top that's noticed \n\nI promise you its you.",
            "DO YOU HAVE A FABRIC ON YOUR BODY..... THAT'S MORE THAN ENOUGH... 😐😑😐",
            "I actually prefer no top but I'll take what I can get from my wonderful wife.",
            "We care only what's inside the top and that it's jiggling.",
            "Men absolutely do not care about this!",
            "I'm 90% sure he won't even notice",
            "Nah, just tell him you're a set of triplets and the first two dates were the other two."
        ]
    },
    {
        "post_id": "7lxnr5",
        "author": "None",
        "title": "Why don't car companies ever make a throwback model, wouldn't an exact remake of say a 69 Corvette sell really well?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/7lxnr5/why_dont_car_companies_ever_make_a_throwback/",
        "score": 14999,
        "num_comments": 910,
        "created_utc": 1514151473.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/7lxnr5/why_dont_car_companies_ever_make_a_throwback/",
        "comments": [
            "It would not be possible to make an exact stylistic remake that meets modern safety and emissions standards. Just as one example: the \"A\" pillar is the name for the piece of metal that frames the windshield and attaches to the roof; [here's a picture showing the various roof pillars.](https://www.drivingtesttips.biz/wp-content/uploads/2016/09/car-pillars.jpg) \n\nAbout ten or fifteen years ago, the people who do safety testing on cars (IIHS, NHTSA) noticed that rollover accidents tended to result in more deaths and serious injuries. They found that this was happening because car roofs tended to deform and collapse in rollovers, smashing directly into the heads of the passengers. So, they came up with a standard for how strong a roof has to be, and implemented crash tests to evaluate this. Automakers realized pretty quickly that one of the easiest and cheapest ways to make a roof stronger is to make the \"A\" pillar a lot thicker. And that's why [modern cars have such thick \"A\" pillars compared to older cars.](http://payload.cargocollective.com/1/2/84448/1064602/pilla1%20copy%20copy.jpg)\n\nIf you want to drive a car that looks old but has modern features, there is hope: some people will restore old cars and replace the original parts with modern ones. This process is called resto-modding. Generally, people perform resto-modding with an eye to improving performance: using modern powertrains, modern suspensions, modern brakes, etc. A resto-modded classic car probably won't do any better in an actual crash, but your ability to avoid getting into a crash in the first place would be greatly improved vs. the original, un-modified car.",
            "A lot of the older designs would not pass modern safety regulations. There have been a few semi-throwback designs, though -- look at recent Mustang and Camaro.",
            "Kenworth Australia do this. They make limited editions of old models with modern technology but the old cabs, bonnets, air powered windows, badges, lights, etc.  \nhttps://i.imgur.com/qGA8A7C.jpg",
            "If they ever made a Volkswagen T1 Camper with less weight than the 60s version I would buy it immediately.",
            "One thing I haven’t seen mentioned about the aesthetic side of it, is that no one makes boxy cars with hard edges anymore because the drag it generates will ruin your gas mileage.\nIt sucks, I love the 80’s muscle car look and I drive a Ford Taurus that looks like a lumpy pillow. But I get why they do it.",
            "There’s the Mini Cooper and the Volkswagen Beetle throwback designs, they were hugely successful.",
            "[Here's](https://www.youtube.com/watch?v=joMK1WZjP7g) a great example of why it's not a good idea to make a throwback car. \n\nThis is a crash test of a 1959 Chevy Bel-Air and a 2009 Malibu.\n\n**tl;dr** They don't make 'em like they used to because a hell of a lot more people died in 'em. Not so many die now. Not a good idea to go back.",
            "Trying to recapture the old design with modern safety regulations just looks awful. Things like the thickness of the frame, for example. Take the PT Cruiser, it was meant to look like old trucks and just came out absolutely disgusting. ",
            "I’m wait late to this conversation, but yes, car design no longer starts in the art room. It starts in the wind tunnel. Efficiency is king. From there, safety regulations limit so much of creative design.",
            "all the new safety and pollution rules make it very hard to do, with the size of the car to the new motors, tires, and more.\n\nin the US it is possible to make an exact copy of older cars but is has to a limited number and that makes the price very high ",
            "[deleted]",
            "Was talking to my dad about old cars for hours last night. One thing he mentioned was that they actually sucked to drive compared to anything available today. The shittiest car on the lot today would drive better. Could be part of it.\n\nA lot of people restore old cars and put in more modern components to make them nicer. I want to do that ",
            "They wouldn't pass current crash tests, and the first person killed would engender a hellacious lawsuit.",
            "There'd be both a nostalgia factor and a hipster thing going on, these are positives.\n\nBut manufacturing processes have improved, newer cars are easier to make. This one's harder. Has to be reflected in the price (negative).\n\nAdditionally, it wouldn't pass various regulations. Both environmental and safety. Original '69 Corvettes are grandfathered in, or even given protected antique status, but a remake wouldn't get that. I don't think there are loopholes or tricks that would let it be street legal.\n\nEven if all these things could be circumvented somehow, Corvettes only sell about 3000 units per year anymore (I think). It's not alot, so your throwback would have to do many more than that to justify it. And without some sort of proof that it would sell say 25,000 units or 70,000 or whatever, no one would greenlight it. The American car companies are shit, coasting on made-in-the-USA chauvinism and borderline ignorance. They're \"too big to fail\".\n\nNever going to see anything clever or unexpected from them. Maybe a European car maker would go for it, but no one's exactly itching for the 1963 Fiat Berlina.",
            "The land rover defender is probably the best example of this being done.  And it looks skookum as frig.",
            "Auto design engineer, here.\n\nThere are a lot of people pointing out the safety and emissions standards that wouldn’t be met.  They are correct.  There are many regulations that wouldn’t be met and trying to make an old design meet those standard while not changing its looks would be overly difficult and expensive.\n\nWhat I haven’t seen mentioned is the ability to actually pump those old cars out.\n\nFor instance, doors are typically a sandwich in the there’s the outer “skin” (the outside metal you can touch), the “lining” (the inside cloth/plastic portion you can touch inside the car), and the door “panel” (the part inside the door that is the actual door).\n\nThe door panel is typically a complicated piece of stamped steel.  This requires a relatively large mold to be used.  Over time, those molds wear out - the corners/fillets/curves start to wear down and lose a bit of their shape.  As time/use goes on, that little bit of dimension changes stacks up and eventually, the door won’t go together anymore or even worse, it goes together but the door won’t close after 100 closes.\n\nSo keep in mind that there’s a lot of manufacturing pieces that would all have to be remade, carefully inspected and repaired.  Some may even need redesigned if old drawings can’t be found.  Drawings may even need to be converted to 3D models to be able to be used for current tooling systems.  Very expensive.\n\n“Tool” costs (costs associated with the tools needed to make parts) are spread out across all sold vehicles and for a car that was previously very popular (the kind of car you’d want to remake), those costs were spread out of many vehicles.  A remake would almost definitely sell the same or fewer units, meaning the tooling costs would be spread as thinly.  This means every vehicle very well could be significant more expensive (relative to its release year).\n\nThere’s also the issue of reliability.  Imagine buying a car that was doing well to hit 60k miles.  This will inevitably reflect poorly on your brand name.  Your “Goodwill” asset takes a hit.  Could try to make up for it in vehicle price but you’ve already had to set that price pretty high.\n\nSo you have safety, reliability, and other regulatory issues and that doesn’t include unforeseeable issues that are inevitable like not know that cigarette lighters of the time couldn’t handle phone chargers and when used, they set the electrical system on fire.\n\nIt’s a huge gamble, even if the seemingly impossible problems could be solved.  To top it off auto industry is very risk averse.  You’d be putting your career on the line to support that kind of plan.",
            "A lot of old designs simply do not meet modern safety standards. Then beyond that a lot of old models are not really that well optimised in wind tunnels either. \n\nThough there is still some throwbacks being made, but they are quite ugly imo. ",
            "In Mexico in the 80's they were still making brand new 57 Chevies.",
            "There have been several 'throwback' models including a modern version of the 50s Thunderbird, the Camaro is *still* a throwback model, the Mustang was until recently. Of course these cars are only influenced by the 'style' of the older models and share almost nothing with them mechanically.",
            "They already do. Challengers Mustangs, Fiat 500 and others are based on early models.",
            "I wish somebody would make the 1950 bathtub Nash.https://imgur.com/gkUssH4",
            "[deleted]",
            "It’s interesting that you say this, because ford is actually rereleasing the bronco in 2020. ",
            "An HD remaster of a car, nice",
            "[removed]",
            "In addition to the safety requirement issue that others have mentioned, there's also the problem of manufacturing. Automotive manufacturing assembly lines are very specifically designed to churn out an exact model of car hundreds of times a day. Nevermind the fact that the original tooling for most, if not all, old cars has probably been long scrapped or repurposed, it would take millions of dollars, possibly tens or even hundreds, to reconfigure an assembly line to make a car that may or may not even sell well.\n\nIt doesn't make sense from an engineering or business perspective.",
            "Follow up question: could a car company get past safety regulations if they notified their customers of the potential danger while sticking to emissions regulations with a newer engine?",
            "[Some companies](https://www.icon4x4.com/br) specialize in that sort of thing.\n\n",
            "You mean like the Volkswagen-bug-but-now-it-is-for-yuppies-instead-of-hippies?\n\nThat sentence I just said was stupid, but lots of people would take it at face value.  Cars get contextualized.  There's nothing inherently girly about a Miata, but you'll have to constantly deal with idiotic dudebros smirking at you.  There's nothing wrong with driving a BMW, but many will assume you're an inconsiderate driver.\n\nIt's safer for many companies to stick to the current templates with only slight tweaks so they don't get singled out.\n\nThis is tiresome.  Even the Mini Cooper and the Tesla vehicles are becoming more same-same.\n\nMe?  I'm riding the bus until they come out with a 69 Corvette.  Because?\n\n**69**\n\nehehehehe",
            "I know that there are small runs, as my parents purchased a 1955 (?) Ford Thunderbird  around 1980.  I think it was manufactured at the auto plant in Mahwah (?), NJ.  Sadly, while some were made, the company went under before my parents' was delivered.  I recall that hey lost their $5000 deposit.\n\n[Here is another company](http://www.regalroadsters.com) that seems to  the same in lower numbers.",
            "[removed]",
            "The Thunderbird throwback sucked. ",
            "Modern crash safety, emissions and fuel economy requirements are impossible to meet with older car designs. Their shapes aren't very crash friendly and the overall design isn't aerodynamic by today's standards.  \n\nCar makers have gotten around this by buying back old cars and restoring them to factory new condition. Nissan did this with their 240Z. Jaguar recently did this with their E-type. They tend to be much more expensive than buying an unrestored one because of the cost in labor of rebuilding everything essentially from scratch. It's not a profitable business venture for car companies. For example, a factory restored 69 Corvette would have to cost well into the six figures for it to make money for Chevrolet. You can just buy an original mint condition 69 Corvette for a lot less.",
            "Pedestrian and occupant safety",
            "Toyota Actually did it with the 70 Series Landcruiser, though it never came to NA (probably due to lack of demand and safety regulations). It's a 1980's design that was a bit modernized with some creature comforts and safety features along with obvious mechanical updates.\n\n[It's pretty fucking sweet and lives up to its legendary heritage](http://www.toyota.com.au/landcruiser-70/gallery)\n\nAlso I guess the Mercedes G-Wagen, Landrover Defender, and Jeep Wrangler should be mentioned because their design has changed very little over time.  And there are many boutique coach builder type companies that modernize old cars. ",
            "Guitar companies do pretty well selling reissues of vintage models. ",
            "Take a look at the fish-dog Ford Thunderbird remake and you’ll see why this should never be done, ever. ",
            "There's a new DeLorean being made with the same body and interior as the old one but with the performance of a modern day car.",
            "Jaguar is making an electric version of the 1968 E-type.\n\n\nhttp://media.jaguar.com/news/2017/09/jaguar-e-type-zero-most-beautiful-electric-car-world?q=&start=0&brand=jaguar\n\n",
            "With all the safety standards and fuel efficiency standards, it would be really hard to do, because that changes how cars have to be built. The 1968 Challenger and the modern challenger is as close as you can get them I'd imagine.",
            "you are describing the new challenger\n\nthats what it looks like when you recreate an old model as accurately as possible with modern regulations\n\nsource:  auto EE",
            "Safety standards. No crumple zones in old cars. They were real death traps. Beautiful death traps but death traps non the less. You’ll never get cars like those again. ",
            "Mustang\nCamaro\nFiat\nJaguar\nPT Cruiser\nBeetle\nMini \n\nAll have been \"reissued\"",
            "Although any explanation of legalities is valid, it's really because all manufacturing lines are somewhat similar to current standards of cars and parts.\n\nThey would literally have to build an older line which may not exist any longer or wouldnt be easy to program I to our new robots.",
            "In Germany you can drive cars with the security laws they had when building that car. Today you cannot build a car with such security standards as 60 years ago. It is against the law. At least here in Germany. ",
            "If it had modern safety features but looked like an old barracuda or something flashy like that with fins and cone lamps, chrome trim lines, curved windows etc. sure as shit I'd go for it. ",
            "After safty and emissions you wouldn't have a remake. It would be a completely different car. ",
            "All the tooling (stamps, molds, etc.) have been destroyed or sold off, mostly destroyed.  So they would basically be starting from scratch.  The tooling is incredibly large and only good for a finite number of parts so at the end of a model year they built new tooling and started a new body style.  Back then everyone saw cars being disposable so none of it was saved. In the 60s and 70s 100k miles on a car was unheard of, cars were regularly junked at 60k to 80k.",
            "Ask ralph nader.",
            "The truth is, the vast majority of old cars were terrible. Safety was god awful yes, but everything else was awful too. They were inefficient (and by that I mean they were both horrible on gas also had pretty poor performance for the amount of power they did have), they were loud (not just pleasant motor sounds mind you but squeaks and wind noise etc), and handled poorly (lots of play in the steering wheel, awful turning radii, etc). \n\nHave you ever driven a classic car? You feel like you're on the edge of death compared to modern cars. \n\nDon't get me wrong, there were many amazing cars and a million reasons to want to own or drive a classic. They capture a certain feeling of freedom and nostalgia and many are very beautiful. They also make you feel more connected to the road since they're so mechanically simple.  but most people who want a car that looks and feels like a classic can go buy or restore a classic. There isn't a mass market need. \n\nMost people want a car that's safe and quiet and good on gas. So if you take a classic mustang and make it safe and quiet and good on gas, once you add crumple zones and air bags and larger A-pillars and insulation and advanced modern engines with modern emissions systems and power steering and anti -lock brakes etc etc etc, it ends up looking something like a new mustang. Which, btw, sell like hot cakes.\n\nThere are some companies that do what you're suggesting though, in small quantities. VW only recently stopped making the original beetle in some countries. Land Rover only recently stopped making a Defender that was pretty close to the pure classic defenders. You can go buy a new delorean that looks just like the original delorean but it's now electric. \n\nMaybe most interesting and perhaps the best modern example as it relates to your point though, go check out [Singer Vehicle Design](http://www.singervehicledesign.com). They believe the original Porsche 911 was the perfect car. So they take original 70s 911 donor cars and add modern tech, engines, comfort and to some reduced degree, safety. Their cars are absolutely gorgeous, and retail accordingly ($300,000+)\n\n\n\n",
            " they tried with the thunderbird",
            "To reiterate other people's points, it's safety. Here's a video of a head on offset crash between a [1998 vs. 2015 Toyota Corolla](https://www.youtube.com/watch?v=_ttkVRwOtVE). Or a head on offset crash between the classic [2009 Malibu vs 1959 Bel Air](https://www.youtube.com/watch?v=fPF4fBGNK0U). And then there's [SAAB](https://www.youtube.com/watch?v=_9fw9nou_G8) (part of the excellent Top Gear Tribute to SAAB [Part 1](https://www.topgear.com/videos/jeremy-clarkson/tribute-saab-part-12-series-18-episode-5), and [Part 2](https://www.topgear.com/videos/jeremy-clarkson/tribute-saab-part-22-series-18-episode-5))",
            "Upvote if you would buy a 1999 Toyota Supra or a R34 Skyline ;) I know I sure would ",
            "Followup question, why doesn't regular cars are designed to be more stylish, trying to copy a luxury car, even if it is only the exterior?",
            "Aston Martin is doing it with a throwback DB4. Only 25 of them, unfortunately. ",
            "Because of regulations you wouldn’t be able too. ",
            "You should check out Singer Vehicle Design. ",
            "https://en.wikipedia.org/wiki/Retro-style_automobile",
            "Probably wouldnt meet safety guidelines. That being said I believe ford still makes kits for 60s mustangs. Not sure what all comes in the kit. I know it isnt complete but has basic components. ",
            "It wouldn't be legal ",
            "Equus Bass is about the closest thing ive seen to a throwback car. It is very well done unfortunately it costs around a million dollars. ",
            "VW has the right idea.\n\nhttp://newsroom.vw.com/vehicles/future-cars/official-the-vw-bus-is-back-and-its-electric/",
            "[the Dodge Challenger](https://i.imgur.com/bEPYVKV.jpg)",
            "ford did, a replica model 'a' on a pinto  chassis. looked good, but didn't sell very well. sigh\nchrysler tried the look of a 30s sedan, done poorley.\n",
            "Another idea is that they dont want to ruin the market of collectors with the real older models as those antiques would chance severely in price",
            "Fuel emissions",
            "No as it would more than likely degrade the price of the collectors editions that are already produced",
            "Government regulations. ",
            "I think that the comments I read have missed one important aspect of the answer, a major reason is that the tooling and knowledge of how to make those cars doesn't exist anymore.   \n  \nNow, I'm not saying that mystically like it's Damascus steel or whatever, but instead I mean that we still don't know exactly how they used to do it so we'd have to figure that out.  Add into that the extreme cost to train people to learn how to build them, and design the tooling and assembly line, and it just doesn't make economic sense.\n\nThis of course is in addition to the important and mandatory safety and emissions standards any new car has to follow as mentioned by the other commenters.",
            "Revology makes mid to late 60s Mustangs out of modern parts and they meet modern standards. \nhttps://revologycars.com/\nThey also cost around $150K",
            "Jaguar made 9 XKSS replicas",
            "The closest you can get is resto-mods. There was a guy who took a 67 mustang body and put an 07 mustang interior in it and it looked dope as hell. I've been posing the same question as you for a while, and I think that it may be possible to keep a lot of the design with new safety features, but it could have a \"new coke vs coke classic\" feeling and completely flop. It's something companies want to avoid. However, starting a resto-mod garage that specifies in taking old bodies and putting newer model interiors would have thousands of my dollars.",
            "In early 1997, Nissan(Datsun) re-released restored models of the 240z that they had been snatching up used all over. you could essentially buy a mint 1969(if in japanese market) 1970,1971,1972, 240z off the lot like it was just off the factory floor. They only finished a handful of them due to costs vs. sales, so they stopped which was a damn shame. It just goes to show that while it can work, the market has to be right. And as far as I can tell, this is the closest a popular car got to an actual re-release instead of just releasing a new model that looks Aesthetically similar to its predecessor. They took the exact same vehicles, \"improved\" them with regulatory nonsense and safety spiel, then pushed them into the void. The market just wasn't right. being a Z head then and being one now is a very different feeling I imagine because just in recent years has these cars value shot up like crazy. I being a proud owner of one of these original rust buckets wish they'd do this program again because I think sales would explode. But knowing Modern Nissan, they'd fuck it up. Have y'all even seen the Nissan Leaf? Looks like Boiled ass. Bring back Datsun, dammit.",
            "I just want a 1995 Toyota Camry. ",
            "Mustang 05 ",
            "[deleted]",
            "I'd like to see a 9th gen f150 remake. Or even a 89-92 ranger remake.",
            "Many do. \n\nThey're horrible cars wrapped in retro skins usually though,  such as the PT Cruiser remake. ",
            "aston martin recently remade about 25 track only DB4 lightweight\n\n\ncosts a lot",
            "I don't see it mentioned anywhere but this being done by some companies.\n\nJaguar released original VIN E-types recently. Mazda was going to release original VIN NA Miatas.\n",
            "So I'm guessing there's no Fiat 500 stateside then? \n\nIt's probably the only reason Fiat are still in business since they remade a modern version of it a few years back...",
            "Motorcycle companies do it. Nice example is a ducati gt1000 paul smart http://www.motorcycle-usa.com/photogallerys/04_Ducati_Paul_Smart.jpg?b4c607\n\nFew other examples, but suppose its easier to put a modern motorcycle engine in an old style looking frame and other parts. Lot less cost ",
            "Resto modding is the answer.",
            "You can buy restmod cars - older cars with modern things like engine parts, suspension, seats, electrics etc. You can get things from mustangs to jaguars, all sorts. ",
            "Setting up an entire hardware manufacturing line for one specific year of one specific vehicle would be brutal. ",
            "WTF , I guess you havent seen the dodge challenger ? \n\nSafety and emissions is the reason we could not do a exact reproduction, but dodge sure made the body look nostalgic  ",
            "Well other than safety and regulation not being met by older designs, the aerodynamics of older designs would give cars horrible MPG, manufactures want to have a high average fleet MPG. ",
            "Supra.",
            "I would love if they did special editions every once in a while. ",
            "To Op: What a lot of these car needs are misunderstanding is the phrasing of your question. You should have used the word style. Car designs have no soul, no character anymore. Every sedan looks roughly the same, there's little details that differ but the overall feel is monotonous.\n\n From what I've gathered an an outsider is this- the amount of luck, who you know, what degrees you have and how much you love cars, consider what type of person does that create. Then, to get to that level of influence on a major car company company? No amazing car designers, who happen to have a simple passion for cars are going to be chosen or taken seriously by any car company. Design and creativity, our souls and passions are dying while the rich and immoral continue to bloom into power, flourishing from the tilled soil of the 98%.",
            "My first car was a 1972 Dodge Dart Demon. I was hoping that the new Dart would be similar in style and have a Demon option; I would've bought 2",
            "Singer does that for Porsche. They're really expensive but they're really well made. I believe there was a car (not entirely sure about the name) called the Eagle Speedster that a is a remake of the Jaguar E-Type, yet again incredibly expensive. It does show that there is a market out there for this kind of idea, but it's still too expensive to be common, and is limited to luxury models for now. ",
            "If the old designs wouldn't meet modern standards, why are old cars still allowed on the roads?",
            "because all of reddit would be screaming \n\n\"REPOOOOOOSSST\"\n\nbut actually a good question.  Im going to read this thread and hopefully learn something today. updoot.",
            "I mean a modern dodge challenger follows this concept and they sell pretty good. I really wish more car companies would try to do this",
            "Besides the safety standards these were, in general, pieces of shit as cars: they handled poorly, braked poorly, and so on. Even if they were legal, nobody would buy them.",
            "Jeep [did this](https://hips.hearstapps.com/roa.h-cdn.co/assets/16/44/1478006833-jeep1.jpg) with the CJ...I believe it's called a CJ-12. Beautiful vehicle.  \n\nAlso, Land Rover has been producing the [Defender/Series](https://en.m.wikipedia.org/wiki/Land_Rover_Defender) since 1948 (last production in January 2016) essentially unchanged for 68 years minus a few changes from the Series I, II, IIA, and III to what is now known as the Defender. Aside from a few safety modifications, the only major changes between the years are engines (2.5 diesel, petrol, 200tdi, 300tdi, TD5, etc) and cosmetic changes to the interior dash (to name a few). If I remember correctly, one of the major contributions to ceasing production is because of the man hours put into making the Defender. Where newer model Range Rovers, Discovery's (LR3 and 4s), etc can be done quickly with machines that you see in most modern plants, the Defender was still given the same love and care...bolt by bolt...by individual line workers. So, the process was slighlty slower and a lot more costly due to the personnel hired.  \n\nThe US saw the Defender from 1994 to 1997 (NAS) but was taken off of the market specifically due to safety concerns as Land Rover didn't want to implement air bags and a few other regulations imposed by the US.  \n\nThese bad boys can go anywhere from $20k to $200k in the US depending on condition. I imported mine from the UK for $10k and even in it's current condition (a bit of rust, wiring issues, etc) I can probably get $25k for it. Truly magnificent vehicles. I love them.",
            "https://www.nhtsa.gov/sites/nhtsa.dot.gov/files/fmvss/Roof_Crush_Final_Rule.pdf"
        ]
    },
    {
        "post_id": "bs1y20",
        "author": "Spooder6",
        "title": "Do British people call Jay Z \"Jay Zed\"?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/bs1y20/do_british_people_call_jay_z_jay_zed/",
        "score": 15000,
        "num_comments": 1082,
        "created_utc": 1558612056.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/bs1y20/do_british_people_call_jay_z_jay_zed/",
        "comments": [
            "No but Radio 4 once referenced Fifty Cent and said \" or, as we call him at the BBC, Thirty Nine Pence\"",
            "No, unless we are joking. I think Peter Kay did a bit about it.",
            "No",
            "My buddy’s roommate here in Canada not only said “Jay Zed” but also “Zed Zed Top.” He also stood and took his hat off while at home when the national anthem played before baseball games on tv. Weird guy.",
            "Jay Z because it's his name. However first time I read his name I read it as Zed as I had not heard of him at that point.",
            "Yes. \n\nAlso we say 50pence.",
            "[removed]",
            "Only if they never heard of him before.",
            "[removed]",
            "That's like asking an American if we call it \"fish and fries\" when we order it in America. Nope, we still call it \"fish and chips.\"",
            "[removed]",
            "I call him Jason Zed - I haven’t been introduced so I’m keeping it formal.",
            "In Spain some people call him \"Yey Theta\".\n\nAnd U2 is \"Ooh dos\"\n\n&#x200B;\n\nI shit you not.",
            "No. Names are pronounced the way the name is. This applies to heaps of things. This applies to people in New Zealand as well as other places such as Australia, Canada and Ireland etc. basically anywhere other than America. If the name is pronounced a certain way then that’s how it is said. The “zed” thing only really applies when you’re talking about the alphabet or the letter itself",
            "[removed]",
            "No, but henceforth, I will.",
            "No we call him Jay S",
            "No, Zed's dead baby. Zed's dead.",
            "As a Canadian I will sometimes purposely annoy people by saying \"Dragonball Zed\" or \"TMZed\" or \"Zed Zed Top\"...  My young nephew was especially annoyed with me saying \"Dragonball Zed\".",
            "Just like that Brad Pitt movie - World War Zed.\n\n&#x200B;\n\nOr that rock group - Zed Zed Top.",
            "[removed]",
            "Canadian here. No. But we do call ZZ Top, Zed Zed Top",
            "no in that sense its a name and is therefore pronounced the same, you know, the wrong way",
            "My wife, an Australian, referred to him as Jay Zed, because she hadn't thought about before. She sees the letter Z as Zed regardless of origin, until she hears differently.",
            "Mr. Beyonce",
            "Waitwaitwaitwait, Americans pronounce the z as in Jay Z?\n\nI'm German and legitimately didn't know that. I was wondering why some z's are pronounced \"wrong\" though...",
            "I did before I knew it was supposed to be Zee",
            "Nope. But I will now. I think I like it",
            "Yes, but only to prove a point.",
            "Zed Leppelin",
            "What about Zed Zed Top?",
            "No we just respect that America is it's own country with it's own pronunciation. I mean you can travel 20 minutes down the road here and the people talk completely differently from each other. Own unique slang words and the lot...",
            "a segment of british people who live under a rock (older people and/or people who are unaware of pop culture) certainly do, but obviously not everyone",
            "We call him Jay \"Zee\", but we die a little inside every time.",
            "Only deliberately..",
            "From Canada, no, no we don't",
            "no. we most deffo dont. we call him Jay \"zeee\"",
            "[removed]",
            "People who learned the alphabet \"Z\" as \"Zed\" and \"Zee\" may call that way for fun. OR people who may not heard of him who learned the alphabet they way I mentioned.",
            "Skip here, it's a proper name so it's pronounced as such (Zee) just as a Hispanic name like Jose are pronounced as ho-zay and not jo-see",
            "And of course there's 50 pence",
            "It's a proper noun, so no. Although I might start.",
            "Nah.. Jay Zulu",
            "Yes.  We also all wear bowler hats in the bath.",
            "Canadian here. We pronounce it \"Jay Zee\" because not only is it a proper name, we've heard it pronounced on TV, radio, etc. so we know how it is pronounced. The same goes for Zee Zee Top.\n\nNames that we predominantly know from reading them are usually pronounced \"zed\". Car models are a good example. Nissan Three-hundred Zed Ex, Chevrolet Camaro Zed Twenty-eight, BMW Zed Four, etc. We know that they would be pronounced with \"zee\" in the US, but before things such as YouTube we would rarely have heard their names spoken that way. We mostly know their name from reading the letter \"Z\" on the car.\n\nIf we only knew Jay-Z's name from his album covers, we'd likely read it as \"Jay Zed\".",
            "I have a funny story about this! I was asking Siri to play SZA which is pronounced sizzah. And Siri said “now playing S zed A” I was like who the fuck is this?",
            "No",
            "No, but according to Stephen Merchant, Beyonce is know as Beyonce Z in UK.",
            "Not British, but around here they almost have their own separate uses. Like on its own - it's the letter Zee. Letter Zed sounds weird. But if you're spelling something phonetically you'd say Zed for Zulu. If you're having a nap, you're catching some Zee's. Catching Zeds sounds weird. But when reciting the alphabet ie. W-X-Y-Z you'd say Zed; Zee just sounds too elongated unless you're singing it in primary school. It's odd how one of them always sounds strange but the other feels natural.",
            "Dunno if you got the memo...  \n\n\nZed's dead, baby.  Zed's dead.  \n\n\n[https://www.youtube.com/watch?v=xVSJ8kyfMIE](https://www.youtube.com/watch?v=xVSJ8kyfMIE)",
            "No but in Canada we do",
            "No, but I will start doing so.",
            "I do sometimes to annoy my flatemate who is a fan of his.",
            "As a Canadian I definitely have heard and made a few bad jokes here, mostly ironically. That's about it.",
            "What about the band ZZ Top? ZedZed Top",
            "I do, but mainly just to annoy people.",
            "Yes, but only ironically.",
            "I mean, I’ve no idea who that is, but yes. I would.",
            "What about the \"rrr\" that seems to get added to the end of words ended with an a?  Like Chinarr, or Obamerr, what's up there?",
            "Why would they call him J zed?",
            "And how would the Frenchie-French say it?",
            "I always read it like that in my head but I don't say it out loud.",
            "Canadians say 'zed' too btw.",
            "Jay z isnt that popular here...",
            "No, names dont get translated in general, I'm pretty sure Germans still call the iPhone an iPhone instead of an iHandy (which is the translation)",
            "You guys can make fun of us for feet and pounds, but I'm standing by the US on \"zee\" vs \"zed\", mostly on the grounds that \"zed\" is a c-c-c-c-combo breaker. Bee, See, Dee, Eee, Gee...Zed...",
            "No",
            "No",
            "I always thought it was Jay Two",
            "A Z is an ounce",
            "Lol now I do",
            "I did till someone corrected me 😂",
            "Yeah I do sometimes to be funny, but everyone's aware that he pronounces his name \"zee\".",
            "Your mom maybe",
            "How high are you?",
            "no",
            "Yes, yes we do. How did you know??",
            "No. [One is his name, the other is not](https://www.youtube.com/watch?v=nqwx2XFb1fQ)",
            "There's a famous story in Iceland about a well known music journalist going into a record store when he was younger and asking for sultur slubb...\n\n&#x200B;\n\n&#x200B;\n\naka\n\n&#x200B;\n\n&#x200B;\n\n... Culture Club.",
            "No",
            "British people say zee and zed. Everyone says jay zee from my experience",
            "No but Spanish speakers say \"Yay Z\"",
            "No.",
            "Nah, I call him Jay Zeppelin.",
            "I'm French and have always pronounced it this way in my head since I've never heard it before, always read. I'm quite shocked that this isn't actually the case xD",
            "Thw one time I actually pronounce it as \"z\" opposed to \"zed\"",
            "Initially, there were those that did:\n\n[Evidence 1](https://youtu.be/1YmFaIewq8Y)\n\n[Evidence 2](https://youtu.be/g7KLgc9h778)\n\nThough, these were only those who didn't know the actual artist and just read it out.",
            "Will they now?",
            "Majority of the Indian people call it zed",
            "I did for about a week. We went to see Coldplay at Wembley Stadium and he was one of the warm up acts and none of us knew who he was back then... So we defaulted to \"Jay Zed\"",
            "no",
            "Yup"
        ]
    },
    {
        "post_id": "f3snms",
        "author": "moral_aphrodesiac",
        "title": "Why does making pain worse sometimes feel better? Common example: You’ve had a toothache all day so you push on it. It technically now hurts more but it’s also somehow a relief.",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/f3snms/why_does_making_pain_worse_sometimes_feel_better/",
        "score": 14995,
        "num_comments": 439,
        "created_utc": 1581689258.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/f3snms/why_does_making_pain_worse_sometimes_feel_better/",
        "comments": [
            "The nerves that sense pain and pressure are the same. Thus, when you push on your tooth, you are temporarily blocking some pain signals from reaching your brain.",
            "I've learned about the gate control effect. You gotta know that receptors in our body who send pain signals to our brain send their signal slower than so called mechanoreceptors. These receptors send signals of pressure on our skin to our brain. If you have a toothache and you push on it you send another signal to your brain which kinda overlays the pain signal (very simplified). This is also why we automatically put our hands on our forehead when heaving a headache, it has no healing effect, it just stimulates your mechanoreceptors.\n\nPlease correct me if im wrong, and sorry for any misspelling or false translation.",
            "[removed]",
            "Neurobiologist here, not a pain expert but I know some things about it - my best guess is that at some level in the pathways of the sensory nerve fibres to your brain, there is cross-inhibition between different types of sensory fibre so that when a signal from one is increased, it suppresses the signal from other nerve fibres transmitting from the same body region. This happens in the spinal cord when you scratch an itch (the pain signal suppresses further transmission of the fibres carrying the itch signal), which is what I'm basing this  idea on. Facial nerves don't synapse in the spinal cord though, so where exactly it occurs in this case I don't know since this isn't my area and that's probably more depth than necessary. In your example t would be the pressure suppressing the pain.\n\nThe other suggestion that it increases release of endogenous painkillers in the short term also sounds quite likely to me, and these two explanations aren't necessarily mutually exclusive :)",
            "[removed]",
            "In my understanding, which is not medical so take this with a few grains of salt, pushing on it and making it hurt more releases chemicals in your brain that help to reduce the pain. So when you release it, it hurts a little less for a little while, but in the end it still hurts after those chemicals wear off.\n\nBUT I AM NOT A DOCTOR. That's just my understanding.",
            "don't know, but you can overwhelm your pain receptors by rubbing the skin vigorously near a wound, or by causing a small amount of pain elsewhere in the body\n\nalso, if the pains been there a while, your pain receptors sort of tune it out a little so you'll get less painkillers? maybe\n\nsource: i do brain surgery instructoring",
            "I have degenerative disc disease and I am followed by a anesthesiologists.  The pain is non. stop. It only vary in intensity.  It will always be there so the goal is to try to somewhat managed the pain without medications ( because yeah, if I begin now to take those everyday now, what quantity would I need in 50 years from now to get the same effect)?\n\nOne of the important trick he gave me was this: make yourself loose the focal point of your pain and trick your brain into not knowing exactly where it's situated. This can be done with various techniques:\n\n\\-Lay on my back with a tennis ball placed directly underneath the painful zone (so yeah, basically, put pressure on it)\n\n\\-Connecting a TENS device to my back (basically giving me electrics chocs around the painful zone on my back).  ([Studies have proven](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3066716/) that a TENS unit can help to decrease or block pain signals travelling to the brain, providing users with the pain relief).  So basically, by giving more pain to a painful zone, you get relief.  And they are portable now so I can basically give myself a shocking treatment anytime, anywhere! Yahhhoooo!\n\nPS\n\nSorry if my English isn't grammatically perfect; It is not my first language ;-)",
            "I used to work in a kitchen as a dish washer, and we had a big Hobart Disheasher where we would put dishes through on trays. The dishes would come out at lime 120 degrees, hot as fuck, which wasnt too bad. But sometimes the machine was a little too hot, and it would burn if we held stuff for more than a few seconds. For some reason, whenever that happened, if I clapped my hands hard, the pain would subside and I could get back to work with no issue.",
            "This is why I always masturbate when I have a UTI  ¯\\_(ツ_/¯",
            "The spike in pain releases endorphins that reduce the pain￼",
            "Maybe increasing the pain for a moment helps ease the lesser pain of leaving it alone. Like, you press on it and it *really* hurts, but then you release it and it still somewhat hurts, but your brain's just thinking, \"Well, at least he stopped pressing on it so it doesn't hurt that bad anymore.\"",
            "I heard a saying \"why do I keep hitting my hand with a hammer? Because it feels so good when I stop\" I feel like it applies here",
            "I suspect that it is sending a different signal that shuts down the original, much like how sharply pressing a cross into a mosquito bite hurts, but also stops the itch. I also suspect that acute, sharp pain overrides dull, aching, chronic pain. (My mom used to joke that if you have a headache ask someone to stomp on your toe, and suddenly your head isn’t a problem.)\n\nI have sciatica and I have pounded on my thigh to relieve the pain. I’m pretty sure this is why TENS machines are used in pain management, to change the nerve pathways.\n\nAlso, thinking about this has made my everything hurt!",
            "I have always enjoyed having a hangnail in my big toe, it would hurt but at the same time I liked the feeling of pushing on it. Really weird..",
            "You ever get heartburn? I and a few people I know, especially my friends, who are male in particular, would punch there chest where it hurts or \"burns\" then the pain goes away shortly after, maybe having to do with the punch, or maybe not, but punching it is like, instinct or something, because I can't remember why or when I started doing this. It makes it hurt much worse, but like some here have said, trading a small, continuous pain with a more temporary larger pain can make the small pain seem much worse. \n\nBut like Ive said, the pain goes away shortly after. I don't know why, but I possibly know how? ^^^^^^^^\n\nAt leadt I can sort of maybe strangely relate to ya.",
            "Let me introduce you to [pain gate control theory.](https://en.m.wikipedia.org/wiki/Gate_control_theory)",
            "I think that most of the answers here that talk about pain receptors and our brain’s interpretations of pain are at least partially correct. \n\nIt may also be interesting to consider something called ‘benign masochism’. The following is from this bbc article (https://www.bbc.com/future/article/20151001-why-pain-feels-good). I think this could at least partially answer your question.\n\n\n“One theory to explain it is ‘benign masochism’ – seeking out pain while maintaining the awareness that it won’t cause serious damage. It’s something animals aren’t capable of doing.\n\nHot chillis can trigger pleasurable responses... eventually (Credit: Thinkstock)\nOne example is chilli. The active ingredient, capsaicin, is harmless. It hurts because it happens to bind to TRPV1, part of a family of temperature-sensitive receptors in our tongues which alert the body to potentially damaging heat or cold. Activating TRPV1 sends the brain the same signals as if the tongue was actually on fire.\n\n\nThe theory is also thought to explain why we seek out and enjoy other intrinsically unpleasant experiences, such as fear-inducing rollercoasters or sad movies. “If an animal took a rollercoaster it would be scared, and it would never go again.” says Rozin.\n\nThe link between sex and pain is not confined to the world of BDSM. One study, in which researchers used fMRI to visualise the brains of women as they stimulated themselves to climax, found that more than 30 areas of the brain were active, including those involved in pain. Another found that cancer survivors, who had nerves in their spinal cord cut to relieve chronic abdominal pain, lost the ability to have orgasms. If their pain returned, so did the orgasms. \n\nBarry Komisaruk from Rutgers University, who authored the imaging study, thinks there’s a fundamental link between pain and orgasm pathways. “Another observation is that the facial expressions during orgasm are often indistinguishable from those in pain,” he says.”",
            "Most comments here are true, but I also know that applying pain in any way in your body estimulates production of endorphin (that’s why some people cut themselves when they are depressed for example), so that’s a way to see it as well",
            "[deleted]",
            "If I had to guess, I’d say it’s a combination of factors. \n\nOthers have mentioned that pain signals release endorphins, which is true. I would also suggest the effect of relative deprivation, or to use another common phrase, “moving the goalposts.” The pain level was at a constant 6, then when you made it worse, it went up to an 8. To your normal state of 0 pain (hopefully), 6 is a lot. But to someone who’s just been at an 8, 6 is much better. \n\nSemi-related is gate control theory, which posits that the brain will deprioritize some sensory input in order to focus on another more serious input. “One pain can lessen another.”",
            "Story time.\n\nThis will sound insane, and people will probably say I'm full of shit.. but at one point I was suffering from some pretty miserable tooth pain, and nothing seemed to help. I remember having to get up at various points in the night because it somehow helped minimize the pain for a short period, but the pain would always come back full force when I would go to lay back down. Anyway, I remember laying in bed one night, and the only thing I could think of was the pain. No other thoughts were going through my head except \"ow, ow, ow, fuck, ow, I want to fucking rip my tooth out.\" etc. Now, I have a very vivid imagination, so much so that someone can just vaguely describe a graphic scene or accident and I will visualize the scene until I make myself sick. I will literally walk away from a conversation if I think someone is about to describe something awful. I don't have photographic memory, but I can picture things in my mind very vividly, it's just not tied to memory. So, I'm Iaying in bed and imagining my tooth, throbbing with pain, isolated from my mouth, almost like it's floating in space. I began to visualize that a small bandage was slowly being wrapped around the tooth, starting at the base and working its way up, like a tiny tooth mummy. Once I visualized the tooth being completely wrapped, I imagined a thumb being placed on the very top, so the bandage wouldn't unravel. As soon as I held the bandage on place with the thumb, the pain fucking stopped. It stopped for about 5 seconds until I had the thought \"no fucking way did I just remove the pain with my mind\" and immediately the pain came rushing back as soon as I lost the visualization. I kept trying, and could only make it happen about two more times, but only for a couple seconds each. It became increasingly tougher to get to the thumb portion of the process, as I kept on fucking up the wrapping part. Anyway, I'm pretty convinced that I literally blocked the pain through visualization. If anyone has a story like this, I'd love to hear it. If you think I'm lying, that's fine. But that shit happened, and I will always feel like I have an untapped superpower because of it.\n\nEdit: typo",
            "Our pleasure and pain centers in our brain are very close in proximity to each other.",
            "This method, pushing on it, or in some movies the character hurts himslef to take his mind off of a specific pain is because when you do so, you increase the pain threshold. It is a complex chemical reaction in the the brain but the synapses tend to require more neurotransmitters to open the ion gates thus creating a pain feeling. There is currently a study being held in the physiotherapy department about this matter. A massage hurts a bit but then all pain is gone.",
            "Something about Neuroplasticity. You bang your thigh against a doorknob and when you rub the spot on your thigh that made contact it helps the nerves around the area bypass the zone that is dealing with the pain",
            "The body senses pressure with higher priority than it senses pain, so pushing on it relieves the pain because your body is sensing the pressure instead.\n\nVery basic overview but that's basically it.",
            "Hello! I learned a bit about this in my psychology classes, it has to do with the concept of pain gating. This same concept is why we tend to grab injuries when they happen (like grabbing our foot if we’ve stubbed our toe). The second action sends a neural signal which cancels out the original pain signal. Thus, when you push on a toothache all you feel is the new pain; the original neural signal from the toothache no longer makes it to the brain. In short, the brain can generally only interpret one touch/pain signal at a time, so when there are multiple signals you only receive the most recent one. Hope this helps!",
            "It's like a new diffrent pain so your tolerance has reset itself",
            "yes I’ve been having a toothache the past two days, and push on purpose to feel pain, I don’t know why",
            "Not a doctor or anything but when I expect pain I handle it a lot better.",
            "I’d guess it has something to do with pain being the body essentially saying “Somethings wrong, please do something about it” and so actively doing something about it probably satisfies that feeling to a degree, even if what you’re doing doesn’t actually solve the issue",
            "I’d guess it has something to do with the pressure you’re putting on it by pushing it on it",
            "Hahaha. I hurt my finger yesterday and I can’t stop pressing on it to make it hurt. Makes zero sense lol.",
            "Can someone who knows more than I do on the subject of meditation talk to the connection between meditators and people with higher pain tolerances? I swear I've heard that before.",
            "Perhaps it's because you're tired of that type and grade of pain so when you change pain it kind of feels like a relief.",
            "Physiological explanations of pain are usually inferior to larger scale explanations because pain is not really a physical thing. Pain is an emergent process created in your brain by the interaction of sensation and your thoughts/beliefs and emotions. Pain does not equal damage, it is a danger alarm. Just because you cause more *sensation* by pressing on it, does not mean you are causing more *pain*. You may get relief because you are reminding yourself that the area feels stable and there is no immediate danger.",
            "My feet are super prone to cramping. I routinely intentionally make them cramp up when I first get into bed after a long day at work. Feels soooooooo good.",
            "Sensorial overload\n\nThe brain purposely ignores repeated stimuli as not to overload itself. Now I'm not 100% sure but for what I have read, something similar happens with the \"hit it harder\" or \"fight fire with fire\" . When you cause another spot of pain or in your example, make it stronger temporarily, the moment you stop pressing, the relief that comes feel better competitively to how it was initially, even when it's the same. Similar as training with weight for a while until you can't fell the extra weight, then removing such weight feels so good despite being just how you normally were before adding the weight.\n\nOne would say it's more of a fake sensation relativistic to the actual problem",
            "I don't know, but I understand this on a person level. Sometimes I get urges to pull out my teeth. Don't know how to bring this up to my doctor, though.",
            "Ooh, I’ve never thought about it before but you’re right. I do this all the time when I get mouth sores. Like I kind of put it between my teeth (if I can) until it becomes numb. Makes the pain go away temporarily.",
            "I think it might come from a psychological component. The pain you experience beforehand is constant and out of your control. When you inflict greater pain it’s greater than the previous sensation and you know that you created that sensation. The situation thus becomes under your control, so you feel relief from that.",
            "When you stop hurting yourself more, you hurt less, even though the original pain in still there.",
            "I too wonder I stub a toe and I bash my head on a wall and the pain goes away",
            "I'd say psychologically, the control you have over the pain may help. Also the fact that it's not a constant dull pain, which is sometimes worse (like a small drip can be more annoying than drowning).",
            "For anyone with retainers: When it’s been a while so you gotta force them on and you bite down and get that feeling ™ (Especially when you wake up during the night and bite down)",
            "*body part hurts when touched*\nMe:I'll do it again",
            "your body signals something is wrong/damaged through pain receptors/nerves. when you add pressure, it relieves your pain because you're over writing those pain signals by canceling it out with a new feeling. your nerves can only focus on one thing at a time",
            "I get obsessed with pressing on my sore muscles. It hurts so good.",
            "Maybe you overload your “pain receptors “ and they shut down for a little bit?",
            "When you bite on a canker sore",
            "Because pushing on it was worse than the level of pain before you touched it. Then you return to that level and you know it's not as bad as when you pushed on it.",
            "Ulcers. I do this to any ulcer.",
            "Ahh the nail cross in the mozzie bite",
            "Also works with music. Sad feelings? Listen to Bright Eyes. Makes feelings sadder, but better.",
            "Well your body realises natural pain killer when you push on a pain spot increasing pain. It basically goes o that spot hurts more it needs more",
            "I think OP secretly is plotting to have anal sex with me 😳😭",
            "There's a difference between something you control and something you don't control.",
            "Bruh I’ve had toothaches before and it’s almost orgasmic when I push into my tooth. \n\n\n🤤🤤",
            "Because sometimes fighting the pain makes it worse and embracing it helps us accept that we have it.",
            "Relief = pain getting reduced over time.",
            "wow this is a great question that I have wondered myself",
            "Dopamine brain chemicals and stuff lol",
            "I usually do it in the hopes of getting accustomed to the pain. It's a subconscious behavior though, I don't actually think it works and it never has.",
            "Endorphins",
            "When you get hurt and have the immediate instinct to place your hand over the injury, that provides a physical response from your body to begin pain management. I forget the name of the process, but this could be similar",
            "I'm not sure about making it worse.  But about 4 week's ago I had a flare up in my knee and could barely walk for a couple of weeks.  2 weeks ago, the pain was so intense it cause some pretty significant fatigue overall just from the pain. But from a couple days of that more intense pain, the pain went away after a 2 days of mostly sleeping",
            "I’m not 100% knowledgeable but I JUST looked this up yesterday.  Pain gate is the thing where you are hurting somewhere so you get hurt somewhere else to take your mind off it. Doesn’t have to be pain though",
            "Extra release of endorphins to compensate for the pain.",
            "I think it's partly because you can control it, and partly because it's different. \n\nI have sinus issues and sometimes one side of my nose will be completely plugged for hours, maybe while I'm in the car traveling so I can't do anything about it. It's such a relief to be able to lie on the opposite side so that the plugged up side is freed up. I know that's not really pain but it's similar.",
            "We released endorphins when dealing with pain like that. So it makes us feel good.",
            "I think pushing on toothache actually disperses the built up waste material below your tooth root, and that material is the cause of the nagging ache. That's why it will hurt less afterwards.",
            "I think the taking control aspect is a factor too. Pain you caused may feel less severe.",
            "I've heard that a different stimulus can \"distract\" you from the pain itself. It's also apparently why people shake their hands when they hurt their fingers or hop around on one foot when they stub their toe.",
            "When you have an itch, like a small burning wound, it helps (me) to massage the skin around the wound. I think it works like this. There are multiple nerves in that skin area. Massaging activates nerves in the same area, and takes precedence over the pain signals from the wound. \n\nYour brain can only process one pain at a time, in my experience. So by creating pain elsewhere you can take away the pain experience elsewhere.",
            "Scratching a mosquito bite!!",
            "The release of compounds that bind to your opiate receptors that dull the pain",
            "This is how my dad would fix my booboos as a kid.",
            "Self-Harm ;^{",
            "When I have a bruise, constantly apply pressure to it even though it hurts. It eventually either stops hurting or I've gotten used to it. The bruise to still there though.",
            "Is this why cutting makes my panic attack go away",
            "this will probably get buried but i do this when i get a burn, run as hot as water as you can stand for as long as you can stand and the burn will never hurt worse than that, maybe im just weird",
            "U sir r a physcopath. A tootheache??!?!?!?! I assume u never had an infection that started at and ate ur root. Bcuz u wldn have said what u jst did. I almost passed out jst thinking about that kind of pain.",
            "what kind of *satanist* pushes into a toothache?",
            "Kanker soars. Hurt but can’t stop pushing on it.",
            "misery loves company",
            "This isn't answering the question, but I love pushing on bruises. It's a 'hurt so good' type feeling.",
            "Hurts so good.",
            "No",
            "Monotony sucks, better to switch it up even if it hurts more.",
            "On a side note am I the only idiot who when they're in pain or sick will prod or poke the ares that hurts just to make sure I'm not faking it. Like idk why but I'm terrified each time I go to say carenow for them to say nah nothing wrong with you",
            "This might be slightly off-topic but I couldn't help wondering if hyperbaric chambers or deep scuba diving stimulate these mechano-receptors in ways that not only might temporary shadow pain but also produce a *high* or other related complete-at-ease sensation?",
            "Why tf I do this all the time since I have braces I always do that very wack",
            "Once in Atlantic City I had a bad toothache and we couldn't find any ibuprofen and late at night I was tapping my tooth and he said \"do you know why you're doing that?\" and I said \"what?\" and he said \"that, you're disrupting the pain signals like a monkey?\"",
            "If you stub your toe, you can punch a wall to hurt your fingers / wrist and the stubbed toe wont feel so bad anymore.",
            "When I have cluster migraine, hitting my head makes me feel better.",
            "Pushing can change the pain from acute to generalized",
            "I thought it was endorphins? The brain releases more the more trauma we incur? I might be wrong though:)",
            "Or like when you’re sad af and you just wanna listen to sad music in your room while it rains",
            "I always thought pushing it in hurt more than it regularly so it made it seem like it hurt less",
            "This makes me want to peel scabs.",
            "Because when the intense pain fades away you feel relief incrementally. So until your brain stops perceiving the additional pain, it feels better until you reach the original level of pain.",
            "I do it with canker sores. When I get one, I rub salt in it make it really hurt for a couple minutes. After that it doesn't hurt as much, it's like I overloaded my pain sensors and caused them to stop working for a while.",
            "Pain is perhaps relative similar to how we sense heat. A full ache could feel better after you experience something worse by pushing on it. Like the room feeling warm after taking a cold shower because you are now colder than the air.",
            "Masochism",
            "Cuz we're all masochists deep down.",
            "also i feel it’s like two negatives cancel out and make a positive, your tooth hurts so you make somewhere else hurt and it’s like you can’t feel both now",
            "Because we all have a little bit of masochist inside us",
            "gate control theory. same reason why your parents kissing on your boo-boo actually works! because science.",
            "I fuck with my gums hard! Like poke at them and such. So I feel that definitely.",
            "Pushing pains release button permanently stops muscle and joint movement pains fast and reases pain restricted movements. I discovered this in 1992 ... no drugs no sugery no living in hope ... just solid pain release every time. \n\nPushing or pressing on a painful area gets the brain to investigate it. It releases whatever it can ... mainly muscle ... thats it. \n\nTooth ache ... well thats usually damaged tooth causing abraision or infected gum or  gomophis (gum tooth joint). Pushing displaces by expanding the tissues but that fills up with more infection or resettles on the broken part of the tooth. \n\nWhat I discovered is that the brain can not directly get rid of infectionsn but can release cramped muscles due to injury and RSI. \n\nHope this helps ...",
            "Pain creates endorphins, no?  \n\n\nAnd might also be empowering on some level; you control your pain now.",
            "I always thought of it as a control thing. Humans like to have control by nature and when they are hurting they can't stop it, but they can make it worse so in doing that they get a feeling of relief because they have control of the pain in a sense.",
            "For me personally, sometimes I like to push the pain to see how much it can possibly hurt. Makes me feel better to know how bad it could be",
            "I wonder if the extra pain causes an endorphin dump possibly? Idk not a scientist",
            "Idk for me I feel a sense of relief when I make it hurt more then it hurts less (back to the original pain)",
            "I push my fingers into my eeeeeeeeyes",
            "I don't know for sure but I have this theory since a very long time ago. Basically when create another pain intentionally, you are going to focus on that more. So somehow you are tricking your brain to ignore about the original pain you felt by creating another pain.\n\nYou can try punching a wall (don't do it too hard LOL), then stretch your face to the max and you will notice pain on your hand doesn't feel as hurt as it should compared to if you just focusing on the pain on your hand.",
            "Because in the tooth example theres pressure on something. Over time that gets worse but the pain is \"lowered\" due to it being useless in search of a cure. If you push it to the right direction that hurt because you apply pressure somewhere else but thats released pretty quick so its just like an echo.",
            "I’ve never related more to something",
            "This is just the headache question rebranded",
            "Ever see Major Pain? You know that scene where someone's hurt and Major breaks one of the dudes fingers and says \"Bet you're not thinking about your leg anymore.\"",
            "When giving birth the pain you feel pushing the baby out of the vagina hurts unbelievable but also feels good. Hard to explain.",
            "It is the modest, microcosm of what we can affect directly to ourselves without a third party fee. A modest expression of a controlled act to feel, even negatively, a reaction within our own control, and measurable. Bleak? Yeah",
            "Maybe its our pain tolerance going up ?",
            "Theory at best but it could be due to sensitization to a noxious stimulus. Basically if a stimulus is innocuous you will habituate and see lessening effects. On the other end of things is sensitization, which says a noxious stimulus can make us more reactive.\n\nIt doesn't really line up though because in theory further pain would cause a stronger behavioural reaction after being sensitized.\n\nHmmmmmmm",
            "same thing if a paper cut hurts when in contact with water you will still touch it regardless if it hurts more or not; the fact that you're in control helps i guess",
            "Maybe giving yourself more pain makes the brain gives more of those chemicals which relief pain 🤷",
            "Maybe the more pain you cause, the more natural painkillers your body creates to give you a moment of feeling good or relief ?",
            "Life is it adventure filled with pain. The more pain you feel now the more relaxed you will feel later due to the absence of the level of pain.",
            "pues depende de cada persona como tomas las cos",
            "I live in pain. Every day of my life for 25 years. I use no meds. When my nerve pain is screaming I can touch(grab and squeeze) the area. The pain diminishes and suprisingly becomes manageable",
            "It's all mental."
        ]
    },
    {
        "post_id": "ruo56h",
        "author": "Red_Blast",
        "title": "Does anybody else have the habit of saving reddit posts for later but never actually checks them?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ruo56h/does_anybody_else_have_the_habit_of_saving_reddit/",
        "score": 14996,
        "num_comments": 636,
        "created_utc": 1641170222.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/ruo56h/does_anybody_else_have_the_habit_of_saving_reddit/",
        "comments": [
            "I wish you could sort your saved ones into categories or something to make it easier to find what you're looking for",
            "Feels like I just got called out… YES. All the time and never considered that I might be wasting my time in doing so. \n\nTruth is, I’ll likely continue to do this “just in case”.",
            "I just went back and found some long lost treasures",
            "I save funny/cute/inspirational posts to show my wife. Once I have a decent amount saved up, we cuddle in bed and laugh together as she goes through this curated view of Reddit.",
            "This post just reminded me to check them lmao",
            "Some day I will hire someone to categorize my saved posts for me",
            "I only upvote things I want to show my wife. Then every few weeks in bed we scroll through them. Cute animals, house remodel/architecture, food pictures, fun/interesting stats, and r/oddlysatisfying is definitely a favorite.",
            "I've been on reddit for 7 years, and until this moment I've never really realized that we can save posts. I must've seen the button before now, but never clicked it intentionally. Apparently I've clicked it accidentally on about 20 random posts.\n\nSo I'm in the minority here but for me, the answer to your question is no.",
            "Yes. I do this with instagram too",
            "I'm saving this post for later",
            "This is prob a bit sad but I check back through once a year on my cake day. Tbf It's awesome and worrying but mostly awesome",
            "Feels good to close the stupid extra window you know deep down you'll never read, tho.",
            "When no one has commented and I need to wait for a slew of comments so I can wade thru and discover the answer to life, I save those posts",
            "I current have 7700+ screen shots in my phone. I save so many reddit posts and keep thinking I'll get to it at some point. Idk why I'm like this. Please help!!",
            "No, I just save porn, I'm always checking back in.",
            "We used to call it \"Favorite and Forget.\"\n\nDoes this make me old?",
            "I used to. Then I forced myself to slowly go through all of them (about 90 posts over ~~3ish~~ 10 years, from what I remember) and act on each one. Delete it, bookmark it, or add it to my personal wiki.\n\nThen that motivated me to go through all my bookmarks (hundreds, years worth), touch every one, keep or trash, then provide better tags/categorization. \n\nI think I'm now happy with my digital world and I feel like it was very worth it, but it was a LOT of work and took me about a month.\n\nEdit: 10 years of saved posts?!",
            "All the time with crochet patterns",
            "What!? Other people do this too?",
            "I knew I wasn’t alone.",
            "My complaint is. There's no categorizing in saved post (or searchable saved posts)",
            "I save interesting/fun/cool posts to show my kid while we wait for the school bus. It’s our little morning thang and I love it.",
            "I have heaps of recipes saved maybe one day I will use one and cook",
            "i do that for videos that refuse to play when i don’t want to lose my place in the infinity scroll",
            "Yes.",
            "I've been saying for awhile that reddit should have a \"spring cleaning\" type of day for users to go through their saved posts. Finally go check out *that* post you saved and meant to go back to but never did.\n\nIf you're like me, it'll help with the clutter. Also think that we should be able to create sections/folders where we can specify which saved post goes where.\n\nIf it's something you want to go back to, add it to the \"save for another day\" folder. If it's a helpful guide, add it to the \"guide\" folder. If it's a top-tier, amazing post or comment you want to save forever, add it to your own personal \"best of\" folder.",
            "Hell yeah. Even my yt watch later list crossed 1000 videos.",
            "Shit! Thanks for reminding me!",
            "Yes. I just saved this post.",
            "Hey now, this is a personal attack",
            "Yup. Just thinking this to myself earlier as I saved another one.\nThere should be a counter of how many times a post/thread has been saved!",
            "All the goddamn time. It goes back years at this point.",
            "Ya I have like a whole recommended page full of it",
            "All the time, mate.",
            "At this point I’m too scared to see how many there are.",
            "worse! i take screenshots 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️",
            "This just reminded me of all the ones I have saved and not checked haha",
            "Thanks for the reminder. Let’s go see what gems I saved.",
            "Sooo many times …",
            "I like to save the ones that have to do with different activities and restaurants in my area then forget all about them.",
            "All the time tho I do check that r/whatsthatbook saves more often",
            "Saving this thread to read later.",
            "This is such a “hahaha, I do that” moment",
            "Yes! I also screenshot them, email them to myself. It's been helpful a lot of times, I tend to do them for money making things or writing tips.",
            "Don’t look at me 🤦🏾‍♀️",
            "reminder that reddit saves only up too 1000 posts :), if you save anything new the olds ones get deleted",
            "Yes, I believe it feeds into my online hoarding problem. I think I'll review them one day, but we all know that is a bold faced lie.",
            "Absolutely.  I alwasy have like 20 reddit tabs open.\n\nEDIT: Oh the save button.  Nah purposively usually only use saves as something of a card to use in arguments.  Or a list that I will look at later (best websites you didn't know you needed, stuff like that).",
            "This is basically me. \n\nI guess its some sort of low-key FOMO playing on me, a couple times I've tried to find a post I'd seen and it would take hours, sometimes I wouldn't even find it. Since then I started saving posts, even those that I don't really end up going back to.",
            "saving this for later",
            "I do it, AND I go back and check them.\n\n...but I save much more than I check, and what I'm looking for usually gets buried. I wish there was a better way to sort them",
            "I have a habit of thinking I saved them when I didn't.",
            "Yes. I *knew* I was gonna get caught.",
            "Meeee. Though given my hobbies and projects I do check back occasionally for a link I saved. But not as often as I probably should.",
            "I do the same thing with YouTube's Watch Later.",
            "Great recipe, gonna save it for Christmas… of 2019….  Oh look, it’s 2022.",
            "For the first time in my life for real I did check them yesterday 😂😂",
            "They will be helpful oneday",
            "I save videos that look interesting from the title because my phone sometimes refuses to play the video so I save them for when I'm finished scrolling.",
            "I think I have thousands of them now...",
            "I just saved this one for later, may go and read through the comments later, but probably not",
            "Don’t really have time to read through all the comments right now. Guess I’ll save this post and check it out tomorrow",
            "I just did that. I hope there was some reminder feature. Sometimes I even don’t save because I know I’ll forget.",
            "Man,  I feel seen. I do the same thing with bookmarks and tweets.",
            "I just the upvote to basically collect all the things I feel I may want to go back to later (like if it's some interesting discussion on a post or wallpapers, infographics, funny stuff, etc). Usually I'd only go back to share it with someone because of a relevant topic or joke or whatever.\n\nI reserve the save option for posts and comments about informative stuff like website links or useful info that I know I'll need in future (possibly in the next couple of months at least).",
            "i often save comments. with stuff like links, recommends for stuff i wanna check out, i never do in the end\n\n:(",
            "Same with watch later on youtube",
            "1792 at last count",
            "Yep, now this is one of them",
            "Saved",
            "The moment you realize that only backlog bigger than your Steam is the Reddit one.",
            "Yep!  Every once in a great while, I check out my 'saved' list, and it seems to me I hit the save button randomly, because 1/2 the shit on it makes no sense.",
            "Not never... just not yet..\n\n\nSTOP STARING!!",
            "I'm gonna save this for later",
            "I'll save this and get back to you",
            "Oh yeah, and YouTube videos, Facebook posts *(back when I was on the evil platform)*, tweets, wish lists, etc.",
            "You’re the only one, I promise you.",
            "just so you know it starts deleting the oldest saved posts once you hit 1000",
            "Mood",
            "\\*saves post for inspiration\\*\n\n\\*never actually looks at the post\\*",
            "YOU CAN SAVE POSTS FOR LATER?",
            "I have spent tons of resources for later referral. I was once going through my saved posts and I couldn't see anything of interest to me.\n\nI do save and reuse posts like nice wallpapers or videos that I want to share on other SM platforms.",
            "Yes yes yessss yesssss",
            "yea lol",
            "I check mine only if i search for something",
            "I know I’ve saved some really important stuff but I’ve only ever looked at my saved posts once",
            "Mostly this is done with links to video half an hour or longer.",
            "Any YouTube videos too.",
            "When I'm looking for a post I know I saved, I suddenly find all these others posts that I'd completely forgotten about lmao",
            "Yes I do this often 😂",
            "I just saved this one",
            "All the ones I saved, I just... saved... until I saw your post, I never even looked to see where they were saving to. Now I've found it and get to play: Now, Why Did I Save This Post?",
            "I check… twice a year",
            "Yes, and then when I do actually check them out, I'll get a nice burst of dopamine",
            "I started doing this a while ago, on every post that I think that'll be relevant in a conversation in the future (like about bodies on Mt. Everest).\n\nI've had too many conversations where some reddit I read earlier post would be relevant, but couldn't find the post again anymore",
            "It makes me feel productive like my time on reddit was ~worth~ it and I am ~too~ busy to look at these posts",
            "Sometimes I save them for the useful info that I might need in the future, but most of the time they are receipts to call people out when they make bold claims or bets on specific subs.",
            "I've been saving posts for my whole time on reddit but I don't even know where to view saved posts. Saved.",
            "I just saved this post",
            "Haha. I do that!",
            "8 years and counting",
            "I save copypastas i feel like i would probably use at some point but always forget i have them saved",
            "Oh God yes. I also do this with YouTube videos that I never watch.",
            "Save and forget is definitely a thing.",
            "Haha, yes!!!!",
            "Uh... I'll check how many I have saved, because I honestly have no idea...\n\nLet's see...\n\n27 pages of saved items stretching back 7 years.\n\n\n\n\nSo the answer to your question is yes, yes indeed.",
            "Lol I do this constantly. Typically when the post is a link to an article/paper/video that I find interesting but don’t feel like looking at in the moment for whatever reason",
            "Most of my saved posts are accidental.",
            "One day I'll check them :P",
            "Oh 100%",
            "I check them from time to time.  Having a saved tab is what keeps me from deleting this account.  I want to at times, but I've saved a lot and want to keep it.\n\nI also have some saved information that is there when the time is needed.",
            "How do you save a post for later?",
            "Books, tv shows, video games and saved Reddit posts - welcome to my backlog.  It’s like I’m saving it for being bedridden in a hospital or something",
            "I think people from r/LifeProTips do this frequently.",
            "Yup",
            "I feel personally attacked. But yes, yes I do.",
            "One day I'll get to it",
            "Yup. Not sure why. Guess I just like to have something to waste my time.",
            "Yep! 😂.",
            "Pretty much, although usually I just save the ones that I find interesting in my reading list to make PDFs of, then forget about them.",
            "I put it on my calendar sometimes to check it throughout the year.",
            "How do I save a post for later?",
            "Don't forget month down the line when you try and find it and can't.",
            "I save things that I know will make me laugh out feel good when I'm feeling sad. It's awesome, so many cute posts.",
            "I save stuff I really like. Just so if it comes to mind I can dig back for it or long interesting threads that I don't have time to read. I do open them when I am on the train later on.",
            "yes",
            "I saw I hit my 5 year mark on this forsaken website and I have never once looked back on a saved post. And yet I save anywhere from 5 to 10 daily. \n\nLike someone else said, I wish it was easier to review saved posts. Right now it’s a bit of an inconvenience. Also, if I’m honest, it’s the “new” factor of scrolling through a fresh feed rather than “stale” posts. The algorithm at work.",
            "No one ever. You are alone in that regard /s",
            "My feed is full of new posts, so my saved posts are an even better feed. I unsave after I  read them.",
            "I do this a lot with YouTube",
            "i’ll respond to this later",
            "I check every couple of years then lament the amount of \"deleted posts\" I have... but it's not like I remember what they were or valued them enough to care at the time either.",
            "Yes, I do this every day.",
            "Yup",
            "No I don't . \n\nHow to save posts by the way?",
            "Only when it comes to nsfw post do I save and check later",
            "I save cat pics to show my sister later",
            "I do it with porn but thats it unless uts very funny",
            "Can someone commit to posting this question every other month/months so that we are reminded to check?",
            "Pocket. Browser bookmarks. Saved stories on Newsblur. Saved posts on Facebook and Reddit\n\nIt’s all the same: digital clutter that I’ll never get back too.",
            "Yep, and now I'm going to go check all those /r/askhistorian threads",
            "I have HUNDREDS. Send help.",
            "Wait, that's what the post saving feature is for? I always used it as a \"Super Upvote\". I save posts that I think are too good for just an upvote.",
            "I save like every other post I come across",
            "People *don’t?*",
            "Guilty! I'll see myself out.",
            "Wait, I'm supposed to go back and check them?!",
            "You can save Reddit posts??",
            "I have saved some nice recipes they I di go back and check! Otherwise, yeah, I stays un-re-read lol",
            "I suffer from this both here on Reddit and Twitter.  And come to think of it on Quora too. \nI’m hoping that some day in there future, I’ll have some kind of AI bot that will be able to text-mine all my bookmarked content and either remind me of it at a contractually appropriate time and/or the bot will use it to have interesting conversations with me, etc",
            "Story of my life. I’ve now added “read saved Reddit posts” on my list of things to do when I have free time.",
            "I scroll through them when I'm stoned. It's a really odd sense of deja vu that I really enjoy. \n\nAnd occasionally I'll find a post I saved because I wanted to send it to someone, but forgot.",
            "I thought we all did/do.",
            "Yes. The beauty is when you remember there’s a saved posts area of Reddit and you find personal gold",
            "The day I finally go back to look at them is the day I will know everything",
            "I save funny posts so I have stuff to show when people start sharing memes.",
            "Always ..",
            "Yeah, I found some stuff from back when I first got reddit 2 and a half years ago, thanks for the reminder!",
            "I honest to god have no idea how to go back and look at them",
            "Don’t attack me like that.",
            "Time to go back to all those nsfw posts I saved because I was at work.",
            "That's it, I'm unsubscribing",
            "I have so much music saved up",
            "I come back to mine all the time. There was one in /r/makemesuffer that I forgot to save of a prostitute in Manchester and now I can’t find it lol. I was going to send it to my coworker",
            "\\*saved*",
            "I often browse on my phone so save videos that need sound until Im on my computer with headphone... i think ive browsed once or twice on my computer lol",
            "thanks dude, now i could check what i have saved",
            "How does one see a “list” of all he available subs?",
            "I save it to pocket with tags",
            "i open tabs! at some point i have 100tabs on my phone and then i go through them - mostly the long reads getd delayed to be read.",
            "I saved u/bubblewrap_bot s comment so I can go back and use it",
            "I save stuff all the time, but I must be pretty stupid because I can't find where get my saved posts.",
            "Yes, but I also have ADHD and that sort of stuff is pretty typical.\n\nhttps://youtu.be/ouZrZa5pLXk",
            "I saved them so I they don't lose them",
            "TIL you can save reddit posts for later",
            "I thought I was the only one. You’re like me...",
            "You can do that?",
            "r/ADHD",
            "Me",
            "its just a bad habit now, ive started this when i first found out reddit, wanted to show best ones to my wife every night. however, you can also see your \" liked\" posts, shit. so my saved tab is useless now, and ive been liking and saving every post for 8 years now :)",
            "Kind of. Seems like about once a year I find myself going through saved posts.\n\nThing is I usually save threads with the intent to read them that night, soooo.",
            "I would rather save a post and never read it, then frantically search for a post I think I saw and never find it.",
            "Hang on let me save this for later to check the replies",
            "Yeah I scroll through them every like 2 months or so. I usually save the funny posts, and occasionally some NSFW stuff lmao",
            "Quite the contrary, I have VERY few posts saved that I reference ALL the time.",
            "I remember saving a few over the years. Don't remember what they were and I have never looked through my saved posts.",
            "I never knew how to check them. I later noticed it was pretty easy to find it. I checked the saved posts and most of them were outdated memes from two years ago. But I regularly use the feature now though.",
            "Yes, and I regretfully remember saving a comment linking to a website which had a breakdown on how to fix small motors you would find in lawn mowers. I felt that it would be useful to read one day. This was in 2013.",
            "*Saves Post*",
            "[Saved]",
            "I do the same thing with Youtube and 'Watch Later'",
            "yep",
            "No, just YT videos.  I like 5, 10, 15, sometimes 20-30 minutes videos.  Sometimes I'll see what sounds like a great video, I see it's 55 minutes, I give it a click, seems great, and \"watch later.\"  And that's where great videos go to die. :(",
            "Not going to lie, I'm not even entirely sure how to access them since Reddit's most recent major layout update (desktop)",
            "I mainly save posts to then show them to someone but then I forget to do it",
            "I do it with 'valuable' youtube videos.",
            "I check them and I never actually saved what I came looking for… sigh",
            "Saving this post to check on later...",
            "Yes. In fact I'll do it with your post as well!\n\nSome day maybe I'll find the time to sit down and search through the thousands of saved posts.\n\nBut this day is not today",
            "Saves the reddit post, gets a screenshot, copies link and texts it to myself for future reference.",
            "Saved this but clicked to say brb",
            "I... just saved this.",
            "Yes I will check them when I have time. Lol",
            "I just did it a minute ago, the damn comments won't load and I'm interested on the replies",
            "I usually give my wife a short weekly recap of all the cuteness.",
            "I save all the relatable me_irl posts. To remind myself that im trash.",
            "Yeah. I know it's kinda dumb but I figure it's better than physical hoarding because it doesn't create dust.",
            "YES. whenever i save my posts, i think of me a few years later randomly remembering that i had a reddit account and revisiting it and finally looking at the saved posts",
            "Yes, just opened reddit and saved two posts that ill never look at again",
            "yeah I have this amazing LPT sitting in my bookmarks for a year\n\nhttps://www.reddit.com/r/LifeProTips/comments/ks8vh8/lpt_learn_about_manipulative_tactics_and_logical/",
            "I do save interesting posts and haven't once checked them out. I'm the same with You Tube videos I add to \"Watch later\". I'll add them and save them because they sound really interesting but I never get around to watching them-to the point where my list is maxed out. I have to remove some from this category just to add others. It's a problem!",
            "Yeh",
            "I am guilty of this. I just saved this post too :)",
            "I really like looking back at my saves and was sad to learn only the last thousand saved posts are retained.",
            "Yes",
            "Me! As a matter of fact I’m going to do it right now!",
            "Sometimes I’ll be somewhere and won’t be able to listen to audio or a video wont load and I’ll save it for later, then go back and wonder why tf it was saved",
            "I just made myself go through the saved ones and read/unsave like 5, but there are many left...",
            "I do, now I even upvote them",
            "Thanks for reminding me, \nI am gonna save this post!",
            "I save posts to award them when I get my free award. So I've to revisit that post after a week or so. Right now the waiting list is one month long.\n\nAfter awarding then I unsave knowing very well I'm never going to revisit. Besides it will be reposted in no time.",
            "YES, YES AND MORE YES",
            "I do save posts but I always check them:) That’s how you never miss updates. It’s very satisfying. Anytime an interesting story has the potential for updates, I save it. I check in about once a month and delete posts after catching up on updates. If there is no update, I’ll let it sit for awhile until it becomes clear they’re never coming back.",
            "*saves post*",
            "I was sooo close to doing it now....dammit",
            "Yes all the time!  That reminds me, I gotta go spend an hour to catch up on all of my saved posts.",
            "I’m in this post and I don’t like it",
            "All the time! I do it with the thought in mind that if I get into a debate with someone about any particular subject, I can go to my saved posts and pull out the one that disputes what they’re saying. Problem is I forget about the saved post.",
            "Yes, and I wish there was a way of organising them into folders or something because it's a mess",
            "I liked to save funny/interesting posts to share later with my long distance ex-boyfriend, now that I’m alone I still do it, don’t have anyone to share with it, but when I have free Reddit awards I come back and reward them",
            "yes other people do that /r/DoesAnybodyElse",
            "Yes, I also have 1000+ videos on my YouTube Watch Later playlist.",
            "aaaand saved!",
            "Saved!",
            "I'll save this thread and see how it progresses later.",
            "Yes. I’ll eventually read them. Better to save it and not read them, then to not save it and regret it not being able to read them.",
            "I save things, then go back to give them the free awards that Reddit gives you.",
            "Yes!!",
            "yes and i get a new account every year or so.... so much lost knwoledge",
            "I mainly use saving for hentai lmao",
            "Yes. I do the same in Youtube. I have got hundreds of vids in my watch later playlist currently",
            "I do that for r/askhistorians",
            "i have all the time just in case but never",
            "***saved***",
            "Uh, yeah. And don’t look at my ‘Watch later’ list on YouTube, please…",
            "Save porn you'll never have this problem again\n\n ( ͡ᵔ ͜ʖ͡ᵔ )",
            "I accidentally save, I noticed that I was saving posts and unsaved a bunch.",
            "so much. makes me wanna check but also i kinda wanna build up a collection now",
            "Yep",
            "Constantly, my saved posts are entirely recipes, porn, and threads I slowly work through six months later.",
            "Saved, I'll answer later.",
            "Saving this for when I check lol",
            "I had a habit at one time to save them, and later go through them and once I read them, to always unsave them. That way I just revisit them once.",
            "<saves post>",
            "The same for YouTube.. Tbh o dont find \"reddit posts\" worth my time lol.. It's just a clusterfuck of meme and toxicity and extreme liberalism nowadays",
            "Yes",
            "r/adhdmemes",
            "I mostly save the animal posts and quality shitposts. Sometimes even next level stuff",
            "I'm the kinda guy who has 52.952 pictures saved on my online backup. Also did you know reddit deletes saved posts after one thousand",
            "This post made me go back and look at my saved posts",
            "I have so many, I can't get to the bottom of the list without the app starting to bug out.",
            "Either that or not save the ones you try to show people later",
            "This post was directly below the one i just saved xD",
            "I always used it as a \"Favorites\" \n\nIf I actually do save it for later, it goes into my notepad.",
            "This is my daily habit. So yes, you are not alone. I save so many reddit videos, especially long drawn out ones, that I dont have the time to watch. I genuinely do want to go back and watch them since I save the ones that look interesting (especially political ones). However, I just never check them until like 3 months after I saved them not even remembering why they are there.",
            "All. The. Time.",
            "Nah, when I get the urge to save somethiung, thats when I go back to check what I forgot about. save feature is really cool when you see a post but dont have time to check it out because of work or whatever",
            "I use the desktop version - but on a iPad or phone.  Therefore- the Saved button is obstructed, I can’t click it.  Sometimes I can figure it out- but it’s not easy.",
            "I'm in this post and I don't like it",
            "I do save posts but mine are always cooking / baking recipes so I do occasionally go back and pick one at random to do the remove it from saved.",
            "Yes 🤣 I either take a screenshot or randomly put words so I can see my history on comments then see the post again",
            "I do, along with youtube videos I'm going to watch later. New years was close all tabs and clear internet history day so I can save this years tabs to never check out. If they're important I'll find them again",
            "How do you know me?",
            "Google Sheets\n\nURL (In Time Stamp)  \n\nTags",
            "Gonna save this post",
            "Lmao right under the askreddit post about candies.",
            "I do but on days when I find the front pages are all read or I'm kinda bored I go back through my saved posts and it feels if not entertaining that I'm in a way accomplishing something.\n\nSometimes I'll unsave/resave something to kick it back to the top of the list.",
            "uhhh yeah, right where this post is going",
            "I do this,but frequently when I go back to it, it's no longer saved. Does this happen to anyone else? Does anyone know how to fix this?",
            "Yes, and youtube videos",
            "Welcome to reddit .",
            "YES and I don't even know where to look to find them. I'm sure my stoned self has a ton of stupid shit saved.",
            "I literally just did this on the posts before this. I enjoy reading comments but when it’s a lot I want to move on so I’ll save them. Chances of coming back go to 0% once I’m past it.",
            "Don't have time to answer, gonna save it and check it later",
            "I just did",
            "Saving this for later",
            "So. Many.",
            "All the time. It also doesn't make it any easier to have multiple usernames.",
            "Today I saved like three comments and posts and thought “Why am I doing this? I’m never going to see this again.”",
            "The only ones I go back for are rpg battlemaps. Everything else I forget about within an hour.",
            "Yes. There’s a long podcast interview with John Mayer I’ve been sitting on for a couple years now. I’ll watch it one day tho",
            "Of course.  At this point it’s a Reddit cliche.\n\nThe popular comment is “Saving this post to never read it again”. Or something along those lines.\n\nTho I have actually gone back to a saved post when a relevant question or topic came up, more than a few times, so maybe I’m in the minority.",
            "Yes, but mainly because it gets too cumbersome to find specific saved posts. Been wishing for some organizational features in that section for years.",
            "Thanks for the reminder I'll do it now",
            "Absolutely lol",
            "All the time.",
            "Yup, you're not alone, I do it too 🤣",
            "I just checked, and my oldest saved post is 6 years old.",
            "I have done this so many times 😂",
            "OP, I feel like you are calling me out",
            "Non porn?",
            "I’ve been doing this for years lmao. There’s actually a website (https://redditmanager.com/) if you wish to export your saved posts/comments and read them.",
            "I usually save stuff on when on mobile then go back to listen to or check out the saved stuff on my laptop later... thanks for the reminder, its been a couple of weeks.",
            "Yes, I do this all the time, you never know when you're gonna open the saved stuff again.",
            "Oh so there’s a save feature here.",
            "I just saved this post",
            "If I actually want to save a post, I copy the content out to icloud notes and tag it / folder it.",
            "My partner doesn't have reddit so I use the save feature to show them everything I think they'd enjoy lol",
            "I just saved this in two places. Probably will never see it again. Sorry",
            "Saved",
            "It’s every day bro…",
            "Check them at the end of every month with all the previous months included.",
            "Every...fucking...time....",
            "First it was bookmarking things, then it was saving Facebook posts, now here I am saving Reddit posts…",
            "Nope. I don't know how to save lol",
            "I do this all the time with stories from nosleep",
            "I save interesting posts that I want to check out later and good porn I find. Often I'll feel horny, open my saved folder to bust a nut and find some old really interesting post and forget about the porn entirely",
            "Right next to my YouTube watch laters.",
            "Honestly it’s nsfw type stuff and when I do go back finally I will unsave them. But yea, they buildup",
            "Yes. And also Bookmarks. So... many.... bookmarks",
            "YES",
            "When at work or when I'm walking and checking reddit I don't have time for long ass posts or just rabbit holes. So I save them and forget about and sometimes when I lay in bed ill check saved and find a few hours to kill on the good shit saved over multiple days or weeks.",
            "I must have thousands",
            "I've had three r/hobbydrama tabs open, ready to read, for days now. Lol",
            "Yes!! For years and years. I think there is a max though as I haven't been able to go back more than 2 years of saved posts (the handful of times I actually checked)\n\nEdit: just checked - it's one year of data. Would love to know the first part I saved from '06",
            "I don’t even know how to save posts. 😁",
            "Already saved this post to chech later",
            "All the time.",
            "I sometimes do, but they are so many, and reddit is so buggy and unfriendly---",
            "All day every day",
            "Wait you can save Reddit posts? I’ve been doing this shit all wrong for too long",
            "uh huh",
            "Totally saved this post so I can maybe have a laugh in 2 years if I might check it",
            "Oh shit 😳",
            "I've been called out",
            "Yes",
            "I've had to make peace with the idea that my saves will probably continue to pile up and I will likely only check them once in a blue moon. Me being the lazy ADHD person that I am probably won't ever come to organise it."
        ]
    },
    {
        "post_id": "u1mc1u",
        "author": "None",
        "title": "[nsfw] Why is it that we can shit huge girthy logs of feces with no discomfort, but an average sized penis hurts like fuck?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/u1mc1u/nsfw_why_is_it_that_we_can_shit_huge_girthy_logs/",
        "score": 14985,
        "num_comments": 1709,
        "created_utc": 1649724288.0,
        "selftext": "To the commenter who was confused whether ai was talking about anal or vaginal sex, yes I'm referring to anal sex\n\nEDIT: thank you, my question has been answered! I would ask now that rather than repeatedly answering the post with the same general answers, you go down and contribute to the conversation. I'm getting tons of notifications that all say basically the same thing.\n\nEDIT II: this is my most upvoted post and now the first thing anyone sees when they open my profile. I wanna say that it's inaccurate, but frankly this post sums me up quite nicely.",
        "permalink": "/r/NoStupidQuestions/comments/u1mc1u/nsfw_why_is_it_that_we_can_shit_huge_girthy_logs/",
        "comments": [
            "Poop is usually much softer and malleable than it appears sitting in the toilet bowl.",
            "one of those is going out and assisted by the muscles designed to do that. \n\nThe other is not.",
            "Is no one else going to point out that there are also huge girthy logs of shit that do hurt like fuck?",
            "Well. Poop soft, dick not so much.",
            "Bro wtf you mean? Those big shits hurt lmao",
            "Why is it fun to eat food, but a nightmare when youre throwing it up... You're using something for the opposite of its purpose.",
            "You gotta relax",
            "You learned as a child to relax your muscles on the toilet, it's exactly the same during sex, once the muscles are relaxed there is less friction and injuries or pain.",
            "When you have a bowel movement, your pelvic floor and sphincter muscles relax automatically. It's a lot harder to consciously relax those muscles to allow something in, and painful stimulus tends to trigger muscle tension, making it even more difficult to relax. It takes practice and patience. And lube. Lots of lube.",
            "poop is squishy. dick is not.",
            "Let me get you in on some wisdom from the tribe of gays:\n\nIt really doesn't hurt like fuck once you get used to it. Which happens a lot sooner than you think (within the first session). And fun fact, your asshole is a muscle and muscles are literally designed to be adaptable and stretchy over time. If you train it enough on bigger and bigger stuff, there's almost no limit on the size of whatever you can fit. This is why fisting is possible (and even a thing) - after months/years of stretching your butt will just naturally be able accommodate stuff that gets that big. Now imagine the size of your average penis - it really doesn't take much time at all to get to the point where it feels pleasurable. Usually for most dudes, after about 10 minutes of working up and getting used to things you'll have it your average dick fully accommodated and there's no pain or feeling of being stretched too much.\n\nAlso, poop is soft. If you try using a very soft dildo you'll find it probably doesn't hurt that much either. Hard things are harder to get used to but even they will work.",
            "I like that slight pain feeling when it first goes in.",
            "The duality of men",
            "If anal \"hurts like fuck\" then one or both of you is doing something very wrong.",
            "i havent done anal (yet, would be open to try w the right person) but i also have ibs so i absolutely do have big shits that hurt my asshole fairly often 💀💀 the thing with anal though is to do it right you gotta use a lot of lube and take the time to stretch ur asshole out, like w fingers or a buttplug before u go slammin ur dick in there lmao. theres ways to make it easier and more enjoyable, but not every person is into giving or recieving anal so if it aint ur thing theres no shame in that either",
            "I dunno about you but my poops definitely were not as thick as an average dick before I regularly took stuff that size in my butt.  And pooping has never lacked discomfort, while taking dick is perfectly comfortable and pleasant (if done right).",
            "Gay man here. The answer is lube and going slow.",
            "I can't help flashing back to reverend jed and sister Cindy, the disco queen, saying it's like putting gas in the exhaust pipe of your car.",
            "Lol reading this while taking a truly massive shit. I'm talking about longer than a foot and an inch+ in diameter.",
            "Lol at \"hurts like fuck,\" not sure if you intended that. But yeah it's about the direction...your intestines naturally should be better at expelling things.",
            "I wouldn't say that taking huge shits never causes any discomfort....",
            "Y'all are doing it with no discomfort?",
            "if youre having pain with anal sex you need to use more lube and start with a finger until you are relaxed enough for a penis.",
            "It’s an out door.",
            "There's just so much wrong with this question!\n\nTry tickling yourself. Can't do it? That's because your brain knows what you're doing and blocks certain sensations.\n\nSame thing with the \"girthy logs\" (I highly recommend a new diet, btw). Your body and mind knows what's coming, and takes corrective action. That's sort of why some feel good when it's expelling.\n\nAs for the penis intake, your body has no idea what to expect, and thus, can't prepare for it. That said, if it's painful, you're doing something very wrong.\n\nAnal should be mildly uncomfortable initially, until you relax a few muscles, but if you're really feeling pain, you should stop immediately. You're either not using enough lube or your penetrator is an idiot who's trying to give you a blow job from the inside.\n\nIf you don't use proper lube, tearing can result. You do not want tearing. That's bad. That's very, very bad.\n\nThe last thing you want to experience in life is sepsis, where fecal bacteria enters your bloodstream, causing a chain reaction of internal infection.",
            "It's because there is a door on your booty hole and the door has a hinge and the hinge only flexes 225 degrees.  all the way out but only a bit in and so when you are pushing out the brown canoe, the door opens all the way up, but when you are coding for C++, if you get my meaning, the door doesn't open all the way and then its like, \"OUCH man, relax, you can have the top bunk.  No need to get all grabby\"",
            "i remember going to cedar point for the first time. I had to use the rest room to change into swim trunks. Went into the bathroom and saw the biggest log I've ever seen. I did not know it was humanely possible to pass such a rod. I shit you not, it had to have a circumference of at least 3-4 inches. The length of it was a solid 9 inches to a foot. The color was a dark heavy green. It was impressive and terrifying at the same time.\n\n&#x200B;\n\nI still suffer PTSD from it. How can a butthole open up to the size of a blue whale?",
            "“Better out than in, I always say”\n- Shrek",
            "It doesn’t if you lubricate it properly…",
            "OP has clearly never had to take off all articles of clothing while praying to gods they don’t believe in while sweatily pushing satans dildo out of their own ass. You come out the other side weak, confused but relieved that you survived such a tribulation. Not all survive. Not all.",
            "No discomfort? Then you haven’t shit yet, friend. You pooped. I don’t poop. I shit. This isn’t a brag, this is me crying for help. For someone to put me out of my misery. Every shit feels like my asshole is going to split open, living and breathing is a break just for me to return to the hellscape that is me emptying my bowels. I love Buffalo wings, everything I cook has chilli powder. I never used to but if it’s always pain every day then you may as well enjoy it going in.",
            "Because he’s not doing it right",
            "Your anus is an outbound port. Not a receiving port.",
            "I read someplace that the anus actually relaxes a bit when taking a crap as the body knows what is happening and the muscles there react accordingly.  In the same article a doctor said that if you are going to have anal sex, having it after pooping would be best as the muscles are still relaxed.",
            "Wait. Girls poop ?",
            "I suppose its like this....you can pet a porcupine from head to tail but if you go from tail to head its gonna hurt.",
            "When you poop, the muscles in your sphincter relaxes naturally.\n\nIf you are going to do anal, then do the proper preparations. Relax the anus by massage and gently working it so it becomes more and more relaxed. Then do whatever you do with it.\n\nThat is really all there is to it. It is a muscle just like any.\n\nIt isn't any different from trying to do a dead lift without warming up first. You are trying to stretch a muscle that is not in a condition where it wants to stretch",
            "Because one is designed to go out through the out door; one is trying to go in through the out door.\n\nThe anus wasn't built to be a revolving door.",
            "I always found the opposite 🤷🏻‍♂️",
            "Because you're not doing it right",
            "Poop goes *out*.\n\nPenis is softer than poop and goes in, out, in, out, in, out.",
            "It's not the size that causes the pain as much as it's the direction it's going. The sphincter behaves like a one-way valve. Forcing something to pass through it in the opposite direction causes it to instinctively contract, which results in painful pulling on the tissue and muscles. It takes practice to overcome the instinctive contraction, and relax the sphincter.",
            "I’m somehow in the opposite situation, bowel movements are insanely painful for me (IBS) but the other isn’t for some reason? I don’t wanna think about it too much lol",
            "I once passed out after a giant shit, it was level Shaq shit",
            "why would you shit out a dick",
            "i think the asshole evolved as an exit and not an entrance",
            "Preparation of your anus makes all the difference.\n\nYou also need more lube than you'd think, ideally applied on both sides of the door.\n\nThe body has two sphincters, and if most of the lube gets squeegeed-off by the \"butthole,\" very little will be left to lubricate the sensitive interior areas.",
            "In my bum bum?",
            "Lost the opportunity to say it's a pain in the ass",
            "Because poop is squishy, malleable, and is in a sense, lubed.\n\nAlso, because its COMING OUT, not going in lol.\n\nAnd let's all be real.... we all know that super big tree trunk of a shit as it comes out.... feels soooooo soooooo oooooooof. No homo ofc.",
            "Theory: most men just shove without patience. Doodoo don't just stick u at full speed!",
            "Wow, a lot of people here need to drink more water and eat more fiber.",
            "Yeah well try putting those huge girthy logs of feces inside your asshole instead of removing them out",
            "Sometimes the magnitude of a vector is  not as important as the direction.",
            "Exit not an entrance",
            "Because it is an exit not an entry point?",
            ">Why is it that we can shit huge girthy logs of feces with no discomfort\n\nTMI here, but it's a post about shit, so here it is. I cried the other day while taking a shit it hurt so bad. I had to stick my fingers in my vagina and push against my ass just to get it to come out. Even that didn't work well enough. Eventually, after about 45 minutes of manipulation, it worked. Felt like I was gonna die on the toilet. My ass was sore for days. Sometimes there is a fucking ton of discomfort.",
            "i didn't spend six months trying to convince you to take a shit when you didn't particularly want to.",
            "Ok I think I can tell you this one.   There are two sphincter rings of muscle inside your anus.\n\nThe one you see and consciously open is the outer one.  Then there’s about an inch or two of space that makes up a tiny ‘pouch’ and then another ring of muscle that generally stays closed all the time.\n\nWhen you have a log pending, it stimulates the inside of the inner ring of muscle with pressure as well as some gas pressure.\n\nThis stimulation gets your body ready to drop the deuce - your sphincter muscles get ready to relax and the inner sphincter starts to open.   This is the “oh shit I gotta shit” moment - now it’s all up to your ability to keep sphincter 2 closed with willpower to stop from shutting your pants.\n\nWith things coming the other way, none of this pre-stimulation happens to your muscles are not relaxed.   \n\nSo generally - if it’s hurting - you need to take more time to stimulate your body and relax it - slowly.\n\nALSO just fyi this is how your body knows if you have to shit or fart!  If there is no physical pressure in ‘the pouch’ then your body feels comfortable relaxing just a bit to relieve the gas pressure.  \nSometimes though - the fart is hiding a sneaky turd so watch out.",
            "Anal sex can feel amazing when done correctly. People saying it’s not natural are sitting right on the line of homophobia. There’s no “intended use” for any of our body parts. They’re our bodies, we choose how to use them. That being said, anal is a lot of work but it’s worth it to some of us. Most intense orgasms of my life have been from receiving anal.",
            "Anyone who’s ever had to survive on MREs knows this ain’t always true. 💩",
            "It's an exit chute not an entry chute.",
            "Lack of foreplay. You’re not relaxed at all.\n\nEdit: wow lots of uneducated people here LOL",
            "What do you consider an average sized penis?"
        ]
    },
    {
        "post_id": "ff9yfo",
        "author": "CrysisRequiem",
        "title": "Does anyone else get out of a movie at the theater thinking it was awesome, only to realize days or weeks later that it actually sucked?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ff9yfo/does_anyone_else_get_out_of_a_movie_at_the/",
        "score": 14980,
        "num_comments": 1013,
        "created_utc": 1583657142.0,
        "selftext": "This happened to me on two occasions, Alien vs. Predator and The Last Jedi",
        "permalink": "/r/NoStupidQuestions/comments/ff9yfo/does_anyone_else_get_out_of_a_movie_at_the/",
        "comments": [
            "Yeah. \n\nFor me the sheer movie theater just enhances the overall experience. The sound is better, the overall atmosphere, the image etc. I can enjoy the worst movies if there only is enough wham to the bass and the CGI looks great. \n\nSometimes this 'it's better on the big screen' effect wears off a few hours or days later with me realizing the plot was boring, the ending was bad and the actors were lame. oh well.",
            "Also, every band I see live is the best band ever.",
            "I often think the audiences at a stand up performance are stupid for laughing so hard at stupid jokes. I saw louis CK and found myself laughing at every utterance, as if for some strange reason his performance was better than any of his other performances. It definitely wasn't. Something about being there, empathy or something, you laugh at the bad ones. You laugh at everything. (I mean, he's talented, so that helps--but being there is a boost).",
            "Hype blindness. I loved the 1st Transformers film. I saw the trailer to the sequel and got super hyped. Went and saw it and loved it. Couldn't stop talking about it. My friend invited me to go see it a second time and I walked out. I refuse to see the other films, although I've heard good things about Bumblebee.\n\nEDIT: Just in case, my friend left with me and I paid him back.",
            "[deleted]",
            "Idk I feel like sometimes I can enjoy a film the first time and then have things pointed out to me that change how I feel about it but I also feel theres no shame in enjoying a bad film ya know",
            "I experienced this with *Prometheus*. Ridley Scott's direction and the visuals were really impressive as I was watching the movie, and I and my friend left the theatre feeling very \"wowed\".\n\nAt dinner afterwards, while talking about the film, we began to notice several major problems with the plotting and scripting. I realized that we weren't alone in our observations after reading other people's reactions on the Internet. It was a really, really badly written movie, and realizing that overshadowed any good memories I had from the theatre.\n\nI tried watching *Alien: Covenant* and could not enjoy that at all because this time I was primed to notice all the silly problems with the script.",
            "I used to feel this way a lot. I’d get done seeing a movie, loved it, and then would jump in the /r/movies discussion thread to see what other people thought... and a lot of the time other people *didn’t* like the movie I just really enjoyed. It started bumming me out a lot and changing my opinions and what I think I should and should not like. Was there something wrong with me? *Did* I like this movie? *Was* it good? It was almost like I started forming my opinion to what the general consensus was. \n\nEventually I just said screw it and stopped caring what others think. Since then I’ve been enjoying films (and media) a lot more. Sometimes I like movies that other people don’t and vice versa. And thats okay.",
            "Happened to me with some of the most recent Star Wars movies. Was like this is great! Thought more about them and saw the flaws in the story. But I still think they were okay movies that were still entertaining",
            "Happened to me with the Mummy remake with Tom Cruise.",
            "One of the greatest movie-going memories I have was watching a comedy in a sold out theater. It was awesome. Everyone was laughing so hard. We were a bunch of strangers having a great time together and we were united. Honestly, it was just a purely joyful experience. \n\nThe movie was American Pie 2.",
            "I usually forget I watched a movie 4 to 8 hours after the movie.",
            "[deleted]",
            "The Phantom Menace. If you didn’t live through it, it’s hard to explain the sheer hype that surrounded this movie. People lined up and camped out for WEEKS to see a new Star Wars movie. And when they saw it, it was a total “Emperor has no clothes” situation. It took the entire world at least a week to muster up the courage to look at each other and say “Wait, that wasn’t very good was it?”",
            "You were probably riding that good ol' theater high. I get the same high even if the movie is a chick flick. Everything is better on the big screen.",
            "This happened to me last night seeing The Way Back with Ben Affleck. Movie theatres are a great place to see movies. I know that sounds trite but think about it- no distractions, no phones, the sound is all encompassing, the leather seats go all the way back, its exciting because you've never seen it before. And that music, God damn when that music swells its so powerful. People cried around me, I cried. But as I was driving back i was thinking eh thats no different than a hundred sports movies Ive seen. Alcoholic coach, trials and tribulations, a heroes journey, team wins. Pretty cliche.\n\nYou can juxtaposition that movie with Only The Brave, the firefighter movie. Now that movie is unique and amazing. Holy Shit! I saw that in the theatres and when they showed the real guys that died, all early 20s guys with little kids, I cried so hard I had to pull my shirt up over my face.",
            "Star Wars: Episode I – The Phantom Menace here for me.\n\nTo be fair, I was a child, and even then after awhile I was like \"hey that pod racing scene was kinda dumb.\" Then everyone assumed I loved Star Wars, so they bought me toys and stuff. All I'd think at night staring at my dolls was that if Qui-Gon Jinn was such a good space samurai, why did he get cut in half so easily? \n\nI never got over this trauma.",
            "This was me with rise of skywalker",
            "Not specifically with movie theaters, I worked at one for years and years so I think I’m desensitized to the “movie theater magic.” But I’m very good at suspending my disbelief and just getting really into the movie, so I always watch movies two or more times to see how I actually feel about it, because I almost always enjoy it the first time.",
            "Yep. But I also think there’s value in movies that are fun AF the first time you see them, but fall apart the moment you start thinking too much about them. It’s about the experience you have when you see it— I think Rise of Skywalker is the best example I can think of. I had an absolute blast seeing that in theaters\n\nBut like....the movie isn’t that good, and the trilogy is nonsensical. Doesn’t mean I didn’t have a baller time when I saw it tho",
            "Sometimes when you're in a certain mental state the movie was great, sure it's trash, but for the moment you enjoyed the experience.\nOf course I'm covering up for the two weeks in Afghanistan that I thought a screener of green lantern I saw was a revolution in comic book movies.",
            "Most marvel movies. Fun spectacle in the theater. Terrible on repeat viewings.",
            "I experienced it with the Star Wars prequels, specifically The Phantom Menace. Thought it was amazing but really I was just ready for new Star Wars.\n\nI don’t hate TPM now, the only movie I hate now is AotC. TRoS I don’t hate, but I was very, VERY disappointed in it. I usually watch all of the Star Wars films 2-3 times while they’re in theaters but I saw TRoS once and felt like that was enough.",
            "Happen to me for Dolittle",
            "Suicide squad. Had been hyping it up in my head for ages before watching it.",
            "Cloverfield. Turns out if you watch that shit on a television, the shaky camera is unbearable.",
            "What sucks for me is when I already see through the bullcrap before leaving. It's worse when you're with others because you are pretty much forced to watch the shitty movie. And, while you watch it, you see your friends or girlfriend react positively and start to question your own perception. Then you walk out and slowly hear the other's make fun of the same points you had problems with a few hours later.",
            "theres a few exceptions to that though. For example, the new Lion King. It sucked on every possible medium. I went home and turned on Disney+ to watch all three original movies",
            "I realize this is super pedantic but: I hypothesize that no art can be objectively good or bad, and if that's true, then I don't think it's possible to \"realize\" a movie is bad, because a movie can only be good or bad subjectively, and if your first subjective experience was positive, then the movie *was* good for all intents and purposes. I'd even argue that if a movie was good the first time and bad the second, it's *still* good, and just falls into the category of \"movies that are good the first time\" or even \"movies that are good when you let them be good.\"",
            "I enjoyed The Phantom Menace when it came out. After the 3rd time I saw it I started discussing it with others and felt it was flawed.\n\nI don’t hate all of it but I don’t like much either. Jar Jar should have been smarter (less slapstick). He should have been the leader of an exiled tribe, willing to coexist with the humans. \n\nAnakin should have been older. Half his issue was that he was one of those “wise beyond his years” type mixed with “just a kid” innocence. It made his kid tendencies obnoxious when they came out (Yippee!).\n\nMidichlorians can fuck off. I have no fix for those except to kick them out. There should be a better Force potential test.",
            "Me with Venom.",
            "That's how I felt about The Last Jedi. The more I thought about it, the less I liked it.",
            "My husband and not just in the cinema. We deliberately watched crap films in our early days and he’d tell me I was wrong and the film was amazing. Then a week later, would tell me I was right, the film was utter poo.",
            "Endgame 100%",
            "Transformers. I loved 1 and 4 but the rest were shit.\nI enjoyed them because of my live toward transformers. 5th was seriously bad.\nBumblebee was great tho.",
            "Oh yeah. Jurassic World. And I saw it twice. And on the second viewing I was like, \"Oh wow this is stupid.\"\n\n&#x200B;\n\nEdit: \"Jurassic Park World\" isn't a thing. Though I'd be into it.",
            "No, but I get the opposite. I’m overly critical of a film when I first see it. But when the details get fuzzy in my mind, I realize how good it made me feel and can appreciate it more.",
            "Every Marvel movie. I don't think they suck, but after every Marvel movie I see in theaters I think its the best one yet. Just hype",
            "You saw the Playmobil movie didn't you",
            "this is often because the movie *was* good and the “fans” convinced you it was bad after.",
            "I have the opposite. I read reviews and spoilers sometimes before a movie if I'm not totally interested in it. Thinking it is going to suck, then after seeing it I end up really enjoying it",
            "Van Helsing. Saw it with some friends the night before it came out. The projector or something was off because the boom mic kept showing up in screen. We kept cracking jokes and having a blast. \n\nWent to see it with a different friend after telling him it was a great time.  Realized 10 minutes in that it was a horrible movie.",
            "I do this!! I finally realized I should watch movies twice to judge them properly.",
            "Star Wars prequels.",
            "I have the opposite reaction. I find the whole movie theater experience annoying. I despised Aquaman after seeing it in theaters but no it's actually kinda cool. It seems like it may be based on personal experience with the movie theater.",
            "Terminator Dark Fate, anyone?\n\n....anyone??",
            "a majority of MCU movies. Other than Infinity war, avengers, and Iron Man",
            "I seem to recall this being a described phenomenon regarding the release of Star Wars Episode 1",
            "Happens with a lot of marvel films for me. Not to say that they suck, only that I have significant problems with them.",
            "You could just be more easily influenced by outside opinions",
            "Yes. Man of Steel.",
            "Phantom Menace.",
            "Yeah. Few times. One I can think of off the top of my head was The Force Awakens. I left it think it was a great installment into the franchise. And then like a day or two later. I was like, hmmm that movie actually isn’t really that great tbf. It’s a rehash of the 4th film and it didn’t expand anything really. Honestly it’s my favorite of the sequel trilogy. But still. In general I feel like the sequel trilogy was pretty pointless and literally muddied the entire franchise.",
            "The last Jedi! I the second I started thinking about the story while I'm walking from the hall I started feel worse and worse about it!",
            "Star wars ep7 for me. Thought it was enjoyable. Got excited, went back and watched the original trilogy. Realized ep7 makes zero sense given how Ep6 ended and how out of tone it was and how much it just overall sucked and was a total cash grab just copying the episode 4 formula with slight differences. Wtf JJ.",
            "RISE OF SKYWALKER",
            "Funny how you mention The Last Jedi.\n\nI started thinking it sucked about 30 minutes after I left the theatre. But initially I thought it was good.\n\nWhat a disaster that trilogy was... couldn’t even stay awake for the last movie",
            "I actually liked Srar Wars episode 1 2 3 until the internet told me I should hate them",
            "Yes, the rise of skywalker and Star Wars episode 1. ThE CGI brain washes you.,",
            "Or conversely, does anyone else leave the movie thinking that sucked, only to realize days or weeks later that it was actually awesome?",
            "Yea I really enjoyed Sonic especially because my kids were there laughing with me. But ever since I left the theater I can't stop thinking about the tacky Olive Garden advertisements shoved in the movie.",
            "[deleted]",
            "It's been very rare for me but I left The Last Jedi salty, thinking wtf kind of nonsensical crap did I just watch??? The movie blows and I feel they they made up for it in the sequel, mostly anyways. I can get into the Star Wars lore but the ending of the Last Jedi is illogical and just does a full 360° turn to all the characters being back were they started. Aka someone could avoid this movie and not miss out much if anything.",
            "Avengers: Endgame",
            "Most recently it happened to me with Uncut Gems. I thought it was cool while watching it but then i realized the whole movie had no point, no explanations, no character, and it was all because people just couldn’t talk like humans but instead always had to fight and swear to each other",
            "You enjoyed the movie experience but not the movie..it happens.",
            "Avengers: Endgame",
            "The last Jedi is the only movie I can think of where it went from, “holy shit this is great” to “this is complete garbage I hate this” after maybe 3 or 4 days of thinking about, guess I was distracted by the bright lights. I do tend to either over or under appreciate movies during an initial viewing.",
            "Happened to me with Captain Marvel",
            "Avengers Endgame",
            "When I went to see Happy Death Day, I loved it at first. Thinking about it a few months later, I realized how truly moronic the motive was and how much better they could have done on that movie.",
            "I never hated it but John wick 3 is much worse the second viewing imo so yeah I do get this a bit",
            "I enjoy every movie I see in the theater because I was raised poor and every time we went to the movies it was a special experience that we enjoyed no matter what. I still take that same mindset into and out of the theater to this day.",
            "When the first Michael Bay Transformers movie came out I left the theater super excited, and absolutely loved it! Went home that weekend to visit my family, hyped them up to see this movie and took them out to see it. After the second viewing I realized I actually really hated it, and they all loved it.",
            "I felt that with the new justice league movie and the newest jarasic park movie",
            "BVS, Suice Squad, JL",
            "Yes. You never see a bad film. Until you rewatch it on TV two years later.",
            "My brother convinced me that Academy Award winner Suicide Squad was a good film.",
            "Yes. Granted it's not always a drastic change of impression but it tends to come down a little bit.\n\nI think just the sound in the size of the screen in the experience tends to heighten things.\n\nAlso if it's a movie I'm really anticipating my mind wanted to be really good so sometimes I have rose-colored glasses.\n\nMy most recent memory of this was mission impossible fallout. I left the theater thinking it was one of my favorite Mission impossible's but it was very forgettable and when I re-watched it I really didn't like it that much and felt like it was just meh.\n\nActually don't go to the movies much anymore. But when I do I try to go in with mediocre to low expectations of every movie so that I'm pleasantly surprised if it's good and not disappointed if it's not in my mind is not trying to make more out of it than it can be.",
            "Despicable me 3. Great on the big screen, complete tank at home",
            "I feel this is your subconscious trying to justify the cost of the event/item so it tricks you into thinking it's good but later on it stops feeding you that BS and you finally realize the truth.",
            "Yeah. After russian film \"Upward movement\". It's a film about Soviet sportsmen how are out of politics.",
            "Batman V Superman, for sure.\nLove DC heroes, told all my friends it wouldn’t suck.\nHype made it so real, got home and thought “...wait, that DID suck”",
            "This definitely happened to me with Super 8 and Oblivion.\nI watched both in cinemas and found them amazing. But when rewatching at home, they turned into mediocre, very clicheed american sci fi flics.",
            "The Dark Knight Rises",
            "Watched frozen 2. Thought it wasn’t terrible. Watched 1917 a while later. Decided frozen was utter and complete unoriginal shit.",
            "Billy Jack (I am old). \nShape of Water. \nRouge One. Only went for RIP Carrie, left inspired, then wondered why.",
            "Happened to me with the first Hobbit movie. Midnight in IMAX with a bunch of nerds. Great experience. \n\nThen I saw it on DVD and realized it was really, really bad.",
            "Sometimes",
            "This never happens to me. I often get really annoyed that Hollywood can have a 200 million dollar budget for a movie and it still ends up with no plot. I think people are really dazzled by explosions and special effects.",
            "Totally!",
            "Suicide Squad\n\nOne of the only r/pg rated movies i watched at the cinema, with a couple of now old friends. At that time, it felt pretty cool. 5 months later, hindsight hit me like a F\\*\\*KING truck",
            "When Ex Machina was in theaters I saw it with my boyfriend and absolutely hated it. Then some time later I stumble across it on a streaming service and give it a second look. Love the movie. And in fact that director has since become one of my favorites. Go figure",
            " The best way to avoid that is to just avoid the hype train leading up to it. I’ve been doing that for years and very rarely am I disappointed by a movie. It still happens cuz sometimes I just don’t like it but usually I know that coming right out of the theater",
            "I saw this and thought someone is thinking about star wars.  And i read the details and I was!",
            "Chappie",
            "Happens alot",
            "The opposite happens to me more often actually. For example midsommar was painfully boring and slow to watch. I thought it tried too hard to be unsettling or scary that it came off as corny. Then a few days later I appreciated it more\n\nSame with parasite. I thought it was pretty generic. And then the next day I kept thinking about the characters and how well done everything was",
            "I feel like if you got out of the movie enjoying it then it was a good movie and that is your true feeling.",
            "\nGB",
            "There must be a German word for this phenomenon.\n\nYes, absolutely, all the time. I often have to see films twice before can figure out if I actually like it, or whether I am simply being seduced by being in the cinema.",
            "Very much so. Usually I just think it was okay though, but occasionally I have been impressed by a movie, then down the line realise it sucked. I think it was Alfred Hitchcock who described it as something like \"the fridge test\", where you walk out of the film thinking it was great, then later that night when you're not thinking about it, you can't sleep, you go to get a snack, you open the fridge door and think \"That film was fucking stupid\". It was entertaining enough to keep you engaged while you watched it and stop you thinking too hard, but then when you aren't currently being wowed and apply some critical thinking you realise all its flaws",
            "I just got to see Inglorious Basterds in the theater for my birthday on Friday!!! It was wonderful. My friends and I were basically the only ones in the ginormous, old theater haha. I love that movie so freaking much and the theater experience made it exponentially more wonderful. \n\nSo, yes, I agree.",
            "Maybe you’re giving the opinion of the people on the internet way too much credit? I loved the last Jedi regardless of what most of reddit thinks. Liking something is subjective, there’s no correct way to feel.",
            "I watched Sucker Punch at the theatre and was thoroughly impressed with it, saw it on tv later that year and it \"Sucked\"/lacked a \"punch\"",
            "Midsommer. Watched and liked it and realized a day later it was a fucking mess.",
            "This post is making me think I’m weird because I hate (most) movies and when I’m in the movies like, “this is awful. I hate this.” And sometimes I’m bothered by everyone at the movies looking like they enjoyed it and I see why now",
            "I remember this happening with the movie Small Soldiers about the kids toys that are “alive”\n\nMy friend and I saw it and were instantly obsessed with it, thought it was incredible. We saw it again the next week and the magic was 100% gone. It was boring and badly made, we both completely went 180 on it",
            "I call it the after show adrenaline. As a movie reviewer I can shield myself from it but here’s a quick story about my friend .\nSo my friend,  after every damn movie says it was amazing, one time he walked out of Star Wars the rise of Skywalker ( and absolute dumpster fire of a movie), called me up and said “OMG THAT WAS BETTER THAN BLADE RUNNER 2049) which we had watched together a couple months before. I say no way, I watch it and end up mega disappointed",
            "You probably do think it was awesome, then you see everyone online saying it is bad and you let that affect your opinion of it. \n\nA lot of people said Sonic was good in the first couple days, and then suddenly everyone decided it was awful. Not because they actually thought it was awful, but because it is trendy to think it's awful.",
            "When my friends and I left Ready Player One, we were all saying that it was pretty good and a fun movie. By the time we finished walking back to the university campus we had all come to the conclusion that it was actually pretty bad. All in all it took about ten minutes",
            "Great experience, when that wears off your realize there wasn't much substance.",
            "I actually had a reverse experience with this. I left the theater after Thor: Ragnarok a bit mweh, watched it a few months later and loved it.",
            "This has happened to me a lot over the years.",
            "Possibly the best example of this ever recorded on tape:\n\nhttps://www.youtube.com/watch?v=XcXOryOXC40\n\nPatrice O'Neal is a legend, and he about-faces on Face/Off in about 60 seconds.",
            "Advanced screening of Green Lantern, ama.",
            "Not really, but then again I tend to watch stuff in the cinemas and if I like it I'll watch it again as much as I can (not at the cinemas, but online usually) so maybe I just keep myself hyped about the film untill I forget about it.\n\nThis happens to me with games though. When their released they're amazing but when I go back and play them at a later date? No me gusta...",
            "Happened to me watching Parasite. I agree with all the technical good stuff in it and I was entertained because I didn't know how the story would unfold, but I have no desire to watch it ever again.",
            "Is there anybody else that actually enjoyed the emoji movie, even for a day...? No...? Okay-",
            "This happened to me with The Dark Tower. I'm a huge Stephen King fan and I love Dark Tower to death, so just seeing it in that medium had me awestruck. Realized about a week later it was a huge waste of time. Needless to say, my days were short and my nights were unpleasant.",
            "This happened to me with Suicide Squad, and then I realized movies can be really bad, but also entertaining.",
            "Ad Astra .... Movie sounds awesome with mad good reviews then after watching it i wish i could have gotten my time or money back, commercials for it were also misleading..... Its been a few months an im still mad about it.",
            "Many, many people must have felt that way after The Phantom Menace because everyone I knew said amazing things about it and it got some great reviews when it came out. Then sometime after Episode 3 came out, it was nothing but hatred and vitriol towards the prequels. I think some of that hatred is deserved, but I think that most of it is just angry guys who need to take more frequent showers and get more sunlight. I definitely don't think Phantom Menace is as good as I thought it was immediately leaving the theater, but it's definitely not nearly as bad as people make it out to be.",
            "Riverdale",
            "It happens to me more often than I would like...",
            "Not really. What usually happens to me is I enjoy the movie in theaters then I go home and watch YouTube videos of other people's experience with the movie - doesn't change my opinion but it gives me perspective.\n\nThis happened with Venom. I saw it in theaters with my gf and we both thought it was a great movie with lots of humor. Come to find out everyone thinks it's the worst movie to have ever been put on the silver screen. Whatever. Sometimes it feels like people are to quick to hate.",
            "As far as TLJ goes, it was a great movie. Every scene was beautiful, the characters had arcs. It was great.\n\nBut it was a terrible Star Wars movie. It ignored the universe it was set in.\n\nI also enjoyed it in theaters, and when thinking about it, realized how bad it was.",
            "Yes I thought joker was captivating but on 2nd viewing I could barely get through it.",
            "I almost never go to the theater, so I make sure it's worth my money.",
            "I've gotten out of movies thinking they sucked, then find myself thinking about it weeks later.",
            "Yes. Suicide Squad.",
            "I walked out of only one movie and that was \"Adaptation\" (2002). No amount of audience or ambience could make it better. I wasn't the only one. I think its one of those love it or hate it movies.",
            "Sometimes depending on who I go with too the movie seems amazing because we are laughing and having a good time... then I start thinking about all the plot holes I glossed over in the moment 😂",
            "I remember that happening with Suicide Squad. I remember being so hyped for the movie after seeing some of my favorite DC characters and a great trailer. I was basically in a high that whole time, until my friend said as we were leaving, “Huh, not very good, was it?” I argued for about 2 minutes, but arguing requires that I think about what I watched.",
            "For some reason my friends and I all thought the 2015 fantastic 4 movie was great while we were walking out of the theater. Then a few days later we agreed it was the worst thing ever",
            "Yeah, ready player one anyone?",
            "I have to let some movies sit. I always leave the theatre discussing them (privately, I’m not a spoiler spiller) or thinking about them. Some movies improve with another viewing as well while others only really need one.",
            "Godzilla King of Monsters",
            "I’ve had this happen while talking about the movie with whomever I’m with on the walk out of our seats to the parking lot.",
            "TLK I knew was garbage right away.\n\nRise of Skywalker had for for a couple days though, before I started to think about it.",
            "It’s fucking completely opposite for me and it sucks",
            "Sure. Not necessarily from the extreme of \"best movie evar\" to \"worst piece of trash.\" But some movies I think work better on their initial viewing in a crowded theater than a re-watch weeks/months later by yourself.\n\nAnd sometimes that's okay, because moments like that are awesome, even if re-watchability is sacrificed.",
            "Yeah, fury Road is pretty shit if you watch it at home.",
            "Yes. People get the same feeling after and apple or Google keynotes. You feel super pumped about what they just announced and you want to preorder everything but a week later you realize it was just another keynote",
            "I’m very quick to judge my thoughts on a movie. The last one I watched in a theater was Uncut Gems. My dad and I both weren’t very taken with it and I’m pretty sure he was trying to muster the energy to see if I wanted to leave during it, which I probably would have said yes. The only reason I wanted to watch it because Adam Sandler is one of my most favorite actors.",
            "Yes! That happened to me with Dunkirk. I was like wow this is so good! And then my family was like wtf no it wasn’t. They didn’t even do anything! They just lost and waited around. I was like you know what? True.",
            "Highly recommend the we hate hate movies podcast, start with the Avp episode.",
            "I actually experience the opposite. I’ll be bored watching a movie in theaters, but eventually I realize the movie wasn’t that bad",
            "The Suicide Squad",
            "Suicide Squad.",
            "I went to see anchorman two with a date on a Tuesday afternoon where we were two of the six people watching the film. Had a great time, recommended the film to all my friends who liked the first one. It came out on Netflix a while later so we put it on and I realised how awful it actually was. We literally turned it off half way through.",
            "The Force Awakens in  a nutshell",
            "[This was basically the drive home with my wife and brother-in-law after seeing Jurassic World: Fallen Kingdom.](https://www.youtube.com/watch?v=a__4QgP4F-A)",
            "rise of Skywalker",
            "Iremember liking the mummy",
            "Yup",
            "Avatar",
            "Aliens vs predator was a masterpiece, your initial instinct was correct.",
            ">Alien vs. Predator and The Last Jedi\n\nF",
            "One word: Twilight. \n\nTo my defence, I was very young.",
            "Every new Star Wars movie (except rogue one. Best Star Wars movie still)",
            "I hang a lot of this has to do with sometimes people enjoy a movie but then see the other people on the internet like it and force their selves to change their views to go with the way",
            "Yeah, definitely. With The Rise of Skywalker, the less I think about it, the better it is.",
            "Movie theater is big, picture always to dark and sound to damn loud.  I believe verything always looks and sounds better on my home entertainment system.",
            "Yeah I've seen star wars",
            "This happened to me when watching the live action ninja turtles movie. I was blinded by nostalgia, then i realized it sucked",
            "Meh.  If I enjoyed it at the time, I enjoyed it, I don't like to over think happiness life is too short.",
            "How about the opposite? Beck on the 80’s I went to see “Airplane “. I thought it was the most moronic, stupid movie ever.I stormed out in the middle of the movie disgusted! Years later I watched the movie on T. V. I couldn’t  stop laughing!!!",
            "I saw alien vs predator when I was a kid and it was my first in the franchise so I remember it being awesome.",
            "That happened to me when I was really drunk and saw smash mouth at an art festival. I remember being all pumped up and wondering why other people weren’t excited, then I found out the next few days that they actually sucked.\n\nThey did the whole “if you guys don’t start making some noise we’re not gonna play” and no one made any noise😬",
            "This, with Terminator Genisys. I was a huge Terminator fan and was amped for a new chance to revive the franchise. But no, Genisys definitely was not that movie.",
            "Phantom Menace. I was in denial for a year before I was like, it wasn’t great.",
            "Loud speakers, and a huge screen can really sell a story, even if it kind of sucks.",
            "Happened with me during and after watching the GoT battle against the white walkers in the north. My god, what a shitty, not thought through nightmare.",
            "It happened with the last Jedi to me too. My dad and my sister were insisting it was bad and I ignored them",
            "You’re lucky, if I see a movie that sucks in the cinema, that just means I have to sit through a sucky movie. No amount of big screen magic can make it better. Like when I saw Sonic flossing a couple of weeks ago.",
            "You should’ve asked this in r/DoesAnybodyElse\n\nEdit: Spelling mistake",
            "The Rise of Skywalker is such a fast past rush with amazing cinematography and special effects that I enjoyed the movie while in theaters but by the time I drove 10 minutes home and processed the movie, I realized how weak and dumb most of the plot was.",
            "I get that with tv shows. I watched Brickleberry alone and laughed my arse off, so a few days later I showed a friend and we both thought it was bloody awful, I was ashamed to have wasted his time. Weird.",
            "I usually try to enjoy movies the first time I watch them in a theatre, even if I’m expecting them to be bad. I paid for the experience, I might as well enjoy it, although I will usually still pick up on whether it is really a good movie or not, and if I see it a second time I’ll usually make an effort to be more critical of it.",
            "I always tell my people an initial review, but tell them I'll let them know in 6 months when I rewatch it at home. I'm the movie buff so my friends gauge movies off my recommendation. Sometimes you love a movie and watch it again at home and its alright, like Force Awakens.  Then sometimes it's amazing in theaters then amazing the 2nd and 3rd time, like Joker. But it always needs that rewatch to be sure",
            "I think maybe you are too influenced by other people’s opinions. No insult, because it happens to us all. \n\nYou see something and like it, then people tell you all the reasons why you shouldn’t have, and they give convincing arguments. You start to see the flaws you hadn’t before. Honestly, it only people had this same malleability for important things like politics or religion, the world would be better.",
            "YES. Not in theaters but with bird box. After I watched it a second time with my friend, I realized how shitty it really is.",
            "How is this a thing? I've been to movies I've walked out of because they sucked and I've endured movies that sucked because I was on a date, but I've never seen a movie I liked and then later thought I had made a mistake and it sucked instead. Wtf",
            "The Rise of Skywalker",
            "This is why you should not trust reviews from people who see a movie on opening night, especially midnight. They are hyped about being the first and then getting attention on social media over it. They probably won't be critical.",
            "Both the Last Jedi and (kind of) the Rise Of Skywalker",
            "All of the new star wars trilogy (except tfa, I still love you)",
            "The Last Jedi",
            "What do you mean realize it sucked?\n\nLike your opinion changed or it wasn’t popular so you don’t like it anymore because it’s uncool?",
            "Avatar is THE answer here",
            "Star wars : rise of Skywalker. Had such a fun time watching it. Then each hour that passed after I left the cinema I found more and more plot holes and relised it was a fucking mess. Still watching you tube vids to make sense of it. And it still does t make sense.",
            "Endgame",
            "The opposite happened to me when I saw Gummo",
            "Like what you like🤷🏻‍♂️",
            "I enjoyed both AvP and Last Jedi. \n\nBut it happened to me with Rise of Skywalker. \n\nI really enjoyed it. But talking with a friend (who’s also seen it) I kept saying how it could have done without this. Or that could have been better. Or why bother with that part? I realised I liked the movie, except for every single part of it. \n\nBut the battles were cool!",
            "I’ve had this happen but reversed.",
            "Alien v Predator was a god damn cinematic masterpiece bestowed upon us by a higher power and I will fight anyone who says otherwise.",
            "How I felt watching the first mighty morphing power rangers in theaters.",
            "No you're just a spineless bitch who get easily affected by others' opinions",
            "Did you realize they were bad or did you judt hear other people saying they were bad and decided to agree even tho you actually liked them?"
        ]
    },
    {
        "post_id": "xi9x8v",
        "author": "West_Fig5711",
        "title": "How can I subtley clean my bed after an accident?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/xi9x8v/how_can_i_subtley_clean_my_bed_after_an_accident/",
        "score": 14978,
        "num_comments": 109,
        "created_utc": 1663588616.0,
        "selftext": "I'm 27 but I had an accident last night. I have some very controlling and difficult family members in my house ATM, so to go downstairs to use the washing machine would be extremely embarrassing right now and would, be a massive deal (which I don't want)\n\nI'm wondering if there is a way to do this without having to completely change my bed somehow?\n\nLike, could I somehow dry everything (but how?) And then use baking soda?\n\n.\n\nUpdate kinda: I believe this post is now locked\n\nSo I legitimately didn't realise how bad the situation was until you kind, wonderful members of the internet made me realise, so thank you for that. It was emotionally overwhelming to sort of realise the reality of the situation, I think on some level I knew, but must have been in denial or something. It has been one of the most emotionally difficult days of my life, and I just truly want to say thank you to each of you for being there. \n\nIn regards to the bed, right now, considering everything, the bed is the least of my worries. Emotionally I am exhausted, I am fragile and I need time to digest this situation. So, feel free to judge, but I have left it and I'm sleeping on it. When things are this bad, sleeping on a wet bed is the least of my concerns. I will sort the bed out tomorrow. I will do my best to respond asap. But for now, I need to sleep. \n\nThank you x",
        "permalink": "/r/NoStupidQuestions/comments/xi9x8v/how_can_i_subtley_clean_my_bed_after_an_accident/",
        "comments": [
            "Can you go down, get a drink, bring it back up, 'spill' it all over your bed. Hot chocolate or something milk-based that will definitely need a washing machine. Then you have an excuse?\n\nOr does the mattress need cleaning as well?\n\nEdit: someone else has said put a towel on the mattress, this is a good idea. And if you put a new one under the sheet, ideally on top of a plastic sheet, that will help with future accidents.\n\nAlso OP,  I'm hoping you can get support if you need it. If you are struggling with family members being unhelpful or abusive.",
            "As everyone else has said, doubling down on the mess would give you plausible deniability. Make some quality soup or something, craft dinner, pasta ragu, fettuccine Alfredo, whatever you got, and when you're almost done.... *Violently shakes plate over sheets*",
            "Double down.  Bring some sloppy food up to your room and “accidentally” spill it on your bed.  Then you have a plausible reason to go downstairs to the laundry.",
            "Mess it with something else, like sauce or ketchup or something",
            "Dish soap, a cup of water, a toothbrush, paper towel, a hair dryer and baking soda.\n\nDampen the sheet/quilt.  Use a very small amount of  dish soap, and scrub gently with the tooth brush.  Repeat the process until the liquid is fairly colorless and has no smell.  You can put some baking soda between the sheet and the mattress in case the mattress was soiled.\n\nIf you have a towel, lay it down on the wet part of your bed before pulling the covers up - sleep on the towel if need be.  Try to blow dry it first.\n\nYou can wash soiled clothes in the sink the same way and put them near an air vent or fan to dry them, or use a hair dryer.",
            "Can you get to a laundromat? Maybe stuff the sheet into a backpack and head out for the day?",
            "Are you being detained in ur room? Call the cops",
            "Throw up on it.",
            "Do you not normally do your own laundry?",
            "If you don’t clean the bedding, but only dry it, it will stink.  If you continue to sleep in the bed, you will smell like pee.  \n\nI had an accident in summer camp one year and was embarrassed to tell anyone.  It was only two weeks, but I was a very unpopular child that year. I was also struggling with depression, and didn’t brush my hair, so it fit.  \n\nI don’t understand the OPs situation, sounds like she needs to get some help from outside the family, but if that’s not possible, sleeping on the floor until the bedding is cleaned is the only way to avoid smelling like pee.",
            "Just start cleaning your room and say you’re just cleaning if they ask why you’re doing laundry",
            "This is not right\n\nYou are a 27 year old adult.\n\nAre you safe? Can you say what country/area you are in for people to post links to helplines for you?\n\nNo-one should feel like this in their own home, something is not right",
            "Dump a glass of juice or coffee on the sheets and haul them down like you are the creator of the universe. Screw these freaks.",
            "Why do they even need to know you had an accident?  Bedsheets and blankets need washing on a regular basis, it should not be at all out of the ordinary or unusual to simply wash your bedsheets.",
            "It's not weird to say \"my room was sweltering and I sweat all night\" and just wash your sheets, don't spill anything on them or do something bombastic\n\nOverall this is a very weird post, your situation isn't normal and your approach and nervousness to this isn't either, no judgement, but the observation that things aren't right with what's going on here",
            "sounds like you don’t want to bring your sheets out of your room under any circumstance. if that’s the case, hand wash with soap, sponge, and a towel. air dry with a a fan for something but that’ll take a couple days.",
            "Are they physically abusive or just demeaning?\n\nIf the latter, then I would take it down anyways and if they get pissed at you get pissed at them for being unreasonable.",
            "spill juice on the spot where you had the accident, and let them wash it saying you just spilled\n\nput a towel down on the mattress, should be dry after a day",
            "Can you sneak the sheets into the shower with you?",
            "Or bring a ton of things downstairs and act like it's laundry day",
            "You’re not gonna be able to properly clean. Cover the mess as best you can. And go get new sheets that look the same?. Then replace and discard the old ones. Since it’s impossible for you to do the laundry, this is probably your best option",
            "take some coffee or soup to your room and 'accidentally' spill it all over where the mess is? then offer to wash them or let them?",
            "If it’s blood, use peroxide.",
            "I used to get asked why I was using the bathroom at night.",
            "Not like [Spud](https://youtu.be/cMZmNG_DRJA)",
            "Say you accidentally spilt a drink on your bed because you got startled by a bug or something.",
            "It sounds like you can’t get the sheets out of your room to wash them, or bring anything into your room to spill on the sheets either. There’s no real way to clean them without the sheets leaving the room. \n\nCould you just cover up the sheets and sleep on top of a blanket for now? Say you were too hot to sleep under the sheets. In the morning, maybe then you could spill something on the sheets, or change them out for new sheets, or even just spray them with air freshener if you have any.",
            "You don't really need a reason like an accident to want to clean your bedding. Just say it was time for a wash. But make sure the wash machine is empty so there is no delay in your process.",
            "Can you take a laundry bag/hamper with other clothes down and mix your bedsheets in with the clothes? That way it just looks like you're doing regular laundry.",
            "Buy new sheets, throw those in with next laundry, or throw them away",
            "Unfortunately, there's really no way you can get icky stuff out of sheets without fully immersing them in water. The closest thing to a solution I've seen here is blot it well with paper towels and then use Febreeze. You can also sort of sponge them with wet paper towels before you blot in order to take away some of the stuff. The problem is that the smell and the stain will remain. Please get help.",
            "Take a plastic bin of some kind and empty.  Like one you would have for old clothes storage, video games, etc…empty it.  Keep going to get water to drink.  Dump it in the bin.  Your going to have to get some soap, I’d try for dawn dish soap.  Once you have enough water to fully submerge, add soap and put sheet in there.  Hand wash it, a hard brush would be better for stains.  Once somewhat cleaned, ring it out as much as you can.  Then try to hang it somewhere and get a fan or window to air dry.  Ring it out again.  Sleep on top of blanket and put it back on bed below blanket if you need to hide tonight.  Repeat process tomorrow until your satisfied.  Then spill something else on left over stain.\n\nCheck out r/sober etc if you need it.",
            "Say \"you confining me to my room like a child has made me piss the bed like a child. Fuck you I'm moving out\"",
            "Get loads of paper towels and cover the area then put something heavy over it to soak it up. Maybe even lay on top of it. Will take a while and won't get it completely dry but it will help. \n\nFor any smells, if you can go to the shops, get some febreeze. If not, find some perfume or deodorant spray to mask for now until you can do laundry again.",
            "If you have a cat, just say your cat threw up on your bed.",
            "Dude, you're almost 30 years old. You don't need a convincing excuse to do your fucking laundry. Just strip the sheets, fold them, and bring them down to the washer.  You aren't obligated to tell anyone why you are washing your sheets.",
            "You're already anonymous, why without what you mean by accident?",
            "It's like when you pee your bed so you spill a gallon water on it to hide the fact that you peed. Get some food that can be very messy and 'accidentally' spill them.",
            "Bring down two baskets, one of your clothes and one of your sheets.",
            "Hide the bedsheets somewhere in your room and throw them away when you can. If you can find a spare blanket, you can use that as a makeshift bedsheet. See if you can put new ones when they're asleep. Good luck",
            "Hey fam I like my sheets to smell fresh. /",
            "Can you spill milk on the bed and pretend that was the accident?",
            "I’m just confused on how a 27 year old is afraid, I say wait it out, use something to absorb it and gradually lightly clean with hand soap,",
            "Throw it in a black bag and buy new from the shop",
            "Was there a typo with your age, did you mean to put you were 17",
            "Buy new sheets if you can afford and just say the others were getting a little old or dingy",
            "Laundromat 🤷🏻‍♂️",
            "eh dont you ever wash your sheets? Should at least once a week...",
            "sometimes my cats vomit on my bed and when they do I just toss it out and buy another set of sheets for like $20.",
            "Throw them away and buy a new set?",
            "[removed]",
            "Just do your laundry. Put a fan blowing over the bed to dry the bed.",
            "[removed]",
            "Just sleep in it and keep adding to it. Eventually it will stink so horribly that someone passing by will notice it and rescue you."
        ]
    },
    {
        "post_id": "kgtgap",
        "author": "F0000r",
        "title": "If you lost your balls, and had someone else's testicles surgically implanted, would your children look more like you or the organ donors?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/kgtgap/if_you_lost_your_balls_and_had_someone_elses/",
        "score": 14968,
        "num_comments": 708,
        "created_utc": 1608468478.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/kgtgap/if_you_lost_your_balls_and_had_someone_elses/",
        "comments": [
            "I.e. can testicles be transplanted.\n\nhttps://www.webmd.com/men/news/20191209/man-receives-testicle-transplant-from-twin\n\nYeah, it is possible but the testicles still produce the donor's sperm.",
            "So if you had your factory-installed ball and had another ball transplanted, every pregnancy would be like a game of “whose sperm won this time?”",
            "This actually happened in 2018. \n\nIn 2018, a American vet that lost his junk as a result of an IED explosion in Afghanistan receive d the first full Penis and Scrotum transplant. They opted not to transplant the testicles because the sperm that would have been created would be genetically identical to the donor.\n\n[https://www.nbcnews.com/health/health-news/injured-veteran-gets-first-complete-penis-scrotum-transplant-n868436](https://www.nbcnews.com/health/health-news/injured-veteran-gets-first-complete-penis-scrotum-transplant-n868436)",
            "The children will genetically be those of the donor. They would bear no resemblance to the man who received the testicles.",
            "Fuck, I had to look this up. Really good question.\n\n[link](https://www.google.com/amp/s/www.theverge.com/platform/amp/2018/4/26/17286728/penis-scrotum-transplant-surgery-us-veteran-johns-hopkins-testicles-ethics)\n\nTl;Dr: if you have a testicular transplant, your body will only ever make sperm with the donor’s DNA, so the child would be biologically theirs. \n\nEdit: am dumb",
            "They would produce sperm from the donor, so they would likely look nothing like you.",
            "I could never jack off again cuz I can't have some other dudes nut on me. Ick",
            "Follow-up question: What happens when you get one testicle transplanted?",
            "Due to them being biologically the donors does the person who received the balls have a legal responsibility to the children produced?",
            "There was an episode of Tim and Eric’s Bedtime Stories about this.\n****Spoilers****\nA priest pushed for the balls to be removed from a young man in his congregation after a jerk off/plumbing mishap and later tricked this young man to have the priest’s balls implanted in him.  After the young man impregnated his new wife, the priest came and claimed his new son.",
            "A man in the US has become the first to receive a combined penis and scrotum transplant. The man, who wishes to remain anonymous, underwent the procedure on 26 March 2016, and appears to be recovering well. He is expected to be discharged from hospital this week.\n“Some war injuries are hidden,” says WP John Lee, who led the surgical team at Johns Hopkins Hospital, in Maryland. Their patient lost part of his penis along with his scrotum and lower abdominal wall as a result of an improvised explosive device blast in Afghanistan. In a 14-hour operation, the team connected 3 arteries, 4 veins and two nerves – which should provide the new tissue with an adequate blood supply and nerve sensation, the team say.\nThe man was also given an infusion of bone marrow from the same donor. This should help his immune system accept the new tissue, and limit the amount of immunosuppressant medication he will need to take in the future.\n\nAlthough the man’s testicles were also damaged, he did not receive testicular tissue from the donor. “We made a decision early in the programme to not transplant…tissue that generates sperm,” says Damon Cooney, one of the nine plastic surgeons on the team. The chance that genetic material from the donor could be passed to the recipient’s offspring would raise difficult ethical questions, he says.\n\nRead more: https://www.newscientist.com/article/2167136-war-veteran-gets-worlds-first-penis-and-scrotum-transplant/#ixzz6hC9GgMiK",
            "I remember asking kind of the same question. Then again, yours is better since you got upvotes. You can check this out: https://www.reddit.com/r/biology/comments/k15u4d/male_are_testicle_transplants_only_for_identical/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Imagine having a child with a man who doesn't tell you about his transplanted testicles, and you are faithful, but the baby pops out a completely different race.",
            "Takes a lot of balls to do that",
            "If the testicals are now implanted in your body, wouldn't you become the new owner of said DNA, making it your DNA?\n\nAre you now a Chimera?",
            "What if one ball is donated, and one is the original owner's testicle? Random baby?",
            "Asking for a friend right?",
            "Wait... so can you possibly transfer scrotum from one person to another and thus make DNA spreading of one man be timeless !??? Like some man can donate his scrotum which will be transferred again and again and this man will make a baby in 1000 years o_O?",
            "Looks like I can finally get black kids with a white woman. The first ones already look more like Jerome (a neighbour) so it would be epic if the other ones looked the same",
            "Imagine being the kid who grows up to find out their biological dad purely exists as a body part dangling under their Dad's crotch.",
            "From my two semesters in general biology (so take this with a grain of salt)\n\nSperm cells bud off from existing tissue. They copy their DNA from the reproductive organs (testicles) that they originated from. So if the cells came from another person (even if your body is providing the nutrients to those cells) they would have the DNA of the donors cells, not yours.\n\nEdit: to be clear, that means the kid would look like the donor. They would not be genetically related to you.",
            "Woah",
            "I think I saw someone ask about donated organs before. There was an answer that said that the organ had the donor’s dna still so not only would the immune system attack it, but the organ would age similar to the donor as opposed to the new host. \n\nSo I would assume the same could be said of testicles.",
            "So if i made someone pregnant, would i have to pay child support or the testicle donor?",
            "r/oddlyspecific",
            "Now you got me wondering how many people on maury had a transplant",
            "Y'know, this poses an interesting scenario where you could have kids after you're dead.",
            "Offspring memory is stored in the balls",
            "There is some new technology that allows you to create an egg or sperm from your own stem cell but it’s still very new\n\nSo it’s possible that you have no sex organs but still have hope of having kids of your own\n\nOh also you need MONEY as always",
            "Just replace 1 ball so you can play DNA Roulette. :P",
            "It will be the donors dna",
            "I think....that it would look like the organ donor",
            "Does this mean someone could make children forever given that his balls are transplanted to a living male?",
            "This explains why all my children have a different colored skin from mine..",
            "i saw this question and now i must know",
            "100 percent the donor. \n\nTesticles produce the donors sperm and that won't change regardless of whose blood upply is keeping the tissue alive.",
            "What if you had one testicle from one guy and another from another guy?",
            "Is it gay to ejaculate another man's sperm..? Please discuss.",
            "The organ is the machinery that makes them. You’re just hooking it up to power by transplanting it.",
            "Is it gay if the balls touch?",
            "The organ donor's, I would think. That's where the DNA is. Assuming this was even possible.",
            "It's been shown that people who have had marrow transplants end up having more of the donors DNA than their own. So quite plausible. As been mentioned many times it has raised the eyebrows of DNA being used as the basis of incarceration based on this but also what bone marrow plays I to the part of the body's cell replication.",
            "Would that also make them an orgasm donor?",
            "This is not a direct answer, but I had a vasectomy reversal after 26 years. The doctor told be that the body builds up a immune response to the sperm after a while basically destroying it as a foreign invader, so a reversal could be mechanically correct,but I may not a sperm count high enough because my body destroying the sperm. I now have two boys that look very much like me. The only sperm that wasn't attacked was the ones that were the closest to my DNA. My wife would like a daughter, but I would have to go on immune suppressants to get x chromosome sperm. Im not doing that during a pandemic.\n\nTLDR: for testicle transplants, you would have to be on immunosuppressive drugs to have children.",
            "Further question.. could you match up donors and switch the genitals of people who want to transition MtF and FtM? Could each person gain functioning preferred genitalia?",
            "TIL",
            "Vas deferens",
            "Jonathan Joestar be like",
            "The donor’s",
            "Wouldn’t the body eventually replace every cell in the donor testicles with host cells?",
            "Only replace one then its a lucky dip!",
            "Wait you can do that..\nAhh!!! How am I learning this know..\nWhat about height can I take someone else height ..\nThrough medical resources.",
            "Ask Giorno Giovanna.",
            "Why would someone donate their testicle!? \nOr \nDoctor's use dead people's testicle for implant? \nAsking for a friend.",
            "so all my dna is in my balls? intresting",
            "Shooting another man's goup is kinda sus ngl",
            "I love a good conversation about balls.",
            "Depends on how old your kids are when getting the surgery",
            "This reminds me of the Chicago testicle thiefs of the 1920's.",
            "Germline cells is stored in the balls.",
            "I heard like the human body over the course of seven years will have replaced all cells in the body.",
            "I do not have balls but would love to have some surgically implanted",
            "I thought it said \"if you lost your eyeballs\" and was picturing testicles replacing eyeballs o.O",
            "[deleted]",
            "JERR-Y! JERR-Y!",
            "I think this is the first time on here that I’ve said to myself “Holy Shit?!!!???”",
            "But is it considered cheating or not?",
            "Questions like these are the reason this subreddit exists! Bravo.",
            "[removed]",
            "According to an episode of QI, a humorous knowledge quiz frrom the BBC, about 100 years ago some doctor implianted *goat* testicles in quite a few men. Yeah, that should work well...\n\n*edit* I found the episode on YouTube: https://youtu.be/vmtGURH7N6M. starting at 6:00",
            ":O",
            "This is the best thing I have read on Reddit today.",
            "r/suspiciouslyspecific",
            "Damn this was a great post + comments",
            "How can the response to 2 almost identical posts be so different? https://www.reddit.com/r/NoStupidQuestions/comments/b84mcc/if_i_had_a_testicle_transplant_from_a_donor_of/?utm_medium=android_app&utm_source=share",
            "Going off of this, would the children be yours, or the donors?",
            "Idk why i thought the children in this scenario were already born",
            "Can we get an example grom someone in the comments?",
            "The organ donee of this was even possible (today).",
            "I would actually take the implants they offer with one exception, they would have to be made of Brass.",
            "My first born looks just like her mum, second born is unlucky enough to look just like me.\nWho knew: genetics.",
            "[deleted]",
            "If this even worked without autoimmune issues, the donor's.  The genes that make the sperm are all the donor's.  You don't make sperm with genetic coding from elsewhere in the body.  There would be some epigenetic changes from the shock of being in a hostile environment with different bio-chemistry, hormonal levels, and other factors from how that body has lived.",
            "A question I never knew needed answering",
            "TIL... holy crap",
            "Yes because, genetics",
            "Nether I don't leave any evidence,I don't even leave a body to be found when am done",
            "After this question, I feel like this sub can no longer exist.",
            "This is something I have never wondered but am now glad I know.",
            "Tornado",
            "This is a plot point in Batman Beyond. Spoilers below:\n\nTerry’s dad had a cloned copy of Batman’s reproductive system in him in order to make Terry into Batman’s son",
            "What if you had one of your balls and one of a donors balls? Then how will they look",
            "What happens if you only get one testicle implanted?",
            "If it's possible to donate testicles and both of someone's testicles are replaced then no doubt the sperm would contain the donor's DNA.",
            "Fun fact: testicles can be donated and transplanted without all the testing needed for other organ donations such as kidneys. Testicular (and eyeball)tissues are not rejected.  Unfortunately after a testicular transplant you would be producing the donors sperm.",
            "Well wouldn’t you produce sperm into the not your balls?",
            "This is super fucking dumb",
            "I'm going to have the bulls testicles transplanted so my son comes out with horns",
            "This is a great question. \n\nI think the Covidiot poster in another thread, whose balls now belong to me, would like to know the answer to this. :)",
            "Wouldn't r/askscience be a better place for this question?",
            "Where are my testicles, Summer.",
            "I'm a trans girl and my girlfriend doesn't want to be pregnant, I don't need mine anymore.",
            "If you lose your brain,  and get a brain transplant, will you be any smarter?  #nostupid questions, amirite?",
            "Men lose their balls all the time when they get married. The kids usually look like their friends...or the mailman."
        ]
    }
]