[
    {
        "post_id": "n7vqel",
        "author": "big_knoop",
        "title": "Does ching chong actually mean anything in chinese?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/n7vqel/does_ching_chong_actually_mean_anything_in_chinese/",
        "score": 14253,
        "num_comments": 816,
        "created_utc": 1620499639.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/n7vqel/does_ching_chong_actually_mean_anything_in_chinese/",
        "comments": [
            "In Cantonese, the closest word to ching Chong is 清倉 (cing1 cong 1), which means empty the warehouse or sold everything in your stock profolio.",
            "[deleted]",
            "The following words sound like \"Ching chong\" would be pronounced. Though to be clear, if they were written in pinyin, they are written as \"qing chang\"\n\n清偿 - to pay off a debt 情场 - the area of love 清唱 - to sing opera 清场 - to evacuate\n\nThose are the closest pronunciations. If you get more loose with pronunciations you get many more words. \"Ching\" could have pinyin spellings like \"qin\" \"jin\" or \"jing\". \"Chong\" could include \"zhang\" \"zhong\" or \"chong\".",
            "There is a city called Chongqing in China, pronounced “Chong Ching.” After I visited and came back home to the US, people definitely occasionally thought I was being offensive when talking about it.",
            "[removed]",
            "Well no, but there are phrases that can sound like ching chong if pronounced by someone who isnt used to pronouncing chinese",
            "If you heard it in Cantonese and in an investment setting, it would be 清倉, which means sell your entire portfolio. More of a joke tho.",
            "In mandarin, no.\nIt doesn’t even sound like Chinese to Chinese.",
            "One of the sentences I love to say in Chinese to people who make \"ching chong\" jokes is this:\n\n我常常去重庆去看长城. \n\nin pinyin:\n\nwo chang chang qu chong qing qu kan chang cheng ([google translate for pronounciation](https://translate.google.com/?sl=auto&tl=en&text=%E6%88%91%E5%B8%B8%E5%B8%B8%E5%8E%BB%E9%87%8D%E5%BA%86%E5%8E%BB%E7%9C%8B%E9%95%BF%E5%9F%8E&op=translate))\n\nit means \"I often go to Chongqing to see the Great Wall\". \n\nIs there a section of the Great Wall of China in Chongqing? No, there isn't. But racists don't know that.",
            "Chinese here, although I moved to Canada at 7, I've got a dictionary right next to me. Ching doesn't actually exist, it's **Qing,** which could mean the colour lime, cleanliness, or gentle. Chong means spray/wash, full/charge, or the sound of a waterfall.",
            "I don't know, but in Brazil when a product is a made-in-china low quality crap, we call it \"xing ling\" which apparently means \"Zero Stars\" in Mandarin.",
            "青葱qīngcōng means scallion!",
            "i speak chinese, and no, it doesn’t mean anything",
            "禽场 pronounced cheen chaung \n\npinyin =  Qín chǎng \n\nIt means Chicken Farm.",
            "No. Thats it.",
            "It means \"I'm a racist ding dong\" in English.",
            "I live in a city I. China named Chongqing (pronounced Chong Ching )",
            "Speaking of racist, are there people from an Asian background not offended by 'Ching Chong?'\nI come from an Arabic background and whenever a non-Arabic person generalises how Arabs speak I find it hilarious.\nBut I totally understand if people would find that offensive.",
            "The only ching I’ve ever known is my life is chinga tu madre. 😓",
            "nope! although, i only speak mandarin so that may not be the case for cantonese. however, judging by the comments, I'm assuming its a no for cantonese as well, or a stretch",
            "The replies in this post give me a headache as an Asian American lol",
            "Realistically, no. It’s a pejorative phrase based on how the Chinese language can sound to a non speaker. There ARE words in Chinese that are pronounced with sounds like ching/qing or chong/zhong but I can’t think of any phrases in Chinese that would put those two together back to back.",
            "Perhaps separately, but definitely not with the racist American intonation it is typically pronounced with.",
            "The way \"ching chong\" would be pronounced in English doesn't have a Chinese counterpart: The sounds just never appear in the language.\n\nThere are 2 \"ch\"s in Chinese, the light \"ch\" (almost like \"ts\"), and a heavier \"ch\", which is the one similar to the English \"ch\". Sounds that start with the heavy \"ch\" followed by an \"i\" sound never have an ending \"ng\", but they can have an \"n\" ending. Whereas \"chong\" words do exist, but the \"o\" vowel is pronounced more like the \"o\" in \"choke\" than the \"o\" in \"chong\".\n\nWe can compromise, and try using the lighter \"ch\", where in some places, people speaking casually do say it like a heavy \"ch\". In this case there are some phrases in Chinese that can sound like \"ching chong\". But Chinese is a tonal language, and tone is very important. Saying \"ching chong\" in an English accent won't really work.\n\nPossible han yu pin yin combinations: qing chong, qing cong.\n\nHowever if we are allowed to use an \"n\" ending for \"ching\" instead of ng, we can save the hard \"ch\" sounds.\n\nPossoble hanyu pin yin combinations: qun chong.",
            "It's just a racist stereotype I think",
            "Pretty sure it doesn't😄",
            "青虫 ＝ Qīngchóng = Caterpillar   \n\n\nQing is basically Ching lol",
            "In mandarin 清場Qing Chang which sounds like Ching Chong means clear the field.",
            "It can technically mean a lot of things, since hundreds of words can have the same pronunciation, and you would need intonation and context to determine a syllable's meaning.\n\nIn Mandarin, the closest valid pronunciation I can think of is \"qing chong\". I always joke that people who say it mean \"please insect\", or \"请虫\". Alternatively, \"clear insect\", or \"清虫\".",
            " I'm Asian but not Chinese but was called a ching chong many times. It's usually a derogatory term.",
            "This might be the best question I have even seen in this sub.",
            "No",
            "I had to come here and see the answers.  Pleasantly surprised.",
            "lol how does this question have 500 responses? It seems pretty straightforward",
            "请冲 (qing Chong) literally means “please flush“",
            "yes it roughly translates to i'm a dumbass mf that does not behave near asian people",
            "Jīn Cháng = often\n\nQin (down up accent) chàng = please sing\n\nQīng cháng = \"light long\" not an actual word or phrase\n\nJin (down up accent) zhāng = nervous",
            "The way racists pronounce it? No.",
            "Just commenting to apologize on behalf of all the idiots and jerks who treat Asians or anyone else unkindly. I’m so sorry. You and your culture are beautiful and you deserve respect. I’m so sorry for the horrible treatment you receive. \n\nI was raised with quite the opposite attitude. My mother was uneasy about me going out with a groups of friends once; the driver was a friend of a friend, so I didn’t know him. When she was introduced to him later, she laughed and said, “You didn’t tell me he’s Asian! I wouldn’t have worried at all!” She truly was biased toward anyone Asian. She adored every one she met. \n\nKeep shining.",
            "The Ching Dynasty (now written as Qing, but still pronounced Ching) controlled China when that was \"invented\". Chong is a common name, especially in the area of China where people immigrated from back then. The Ching were Manchu from Manchuria. That's why in the old days you'd hear words like Fu Manchu.\n\nThose bizarre ponytail but shaved head Chinese used to wear were actually some sort of subservience to the Ching emperor thing.",
            "I mean of the major cities in china is literally called “Chongqing” (pronounced chong ching), people always think i joke when i say that lol",
            "This is anecdotal, but I actually know a Cantonese person whose name in Chinese is “Ching Chong”. I think it was a combination of the parents’ surnames. Apparently their parents didn’t know it was a racial slur in English (they later moved to the English-speaking country where I live).",
            "Doesn’t qing mean something in mandarin? It’s kind of pronounced “Ching”",
            "You've asked a question at the back of the mind for many of us!",
            "the most accurate phrase would be 清虫, which means worms from qing dynasty. it is used when railway workers from china came to america to build railways while having their significant long braids during the qing dynasty.",
            "#BadFriends",
            "[Here's a great explanation.](https://youtu.be/zulEMWj3sVA)",
            "I work with a guy who’s last name is Ching Chong.",
            "Summary of comments that actually answered the question. \n\n&#x200B;\n\nIt can either mean Caterpillar or a type of Onion depending on the [pitch of the last syllable](https://en.wikipedia.org/wiki/Tone_(linguistics)). And there is a city named Chong Ching (Chongqing)",
            "No.",
            "青葱 (qingcong) is spring onion.",
            "No",
            "[deleted]",
            "In German we sometimes say Ching Chang Chong instead of Schere, Stein, Papier(Rock, paper, scissor) so I always assumed it meant exactly that, now because of this thread I know that it has no meaning but lmao wtf.",
            "This reminds me of a coworker of mine. I repeat this story often as an explanation I am less offended by words and more offended by intent. \n\nA coworker of mine always called me Chin even though that wasn’t remotely my name. I just chalk it up to us never being properly introduced and it never seemed important enough to me to embarrass him by correcting him. Shouldn’t it be good enough that this guy is acknowledging my presence at all?\n\nMonths later, I’m assigned to train him. I decide to be upfront and correct him (finally) when we officially meet. He still refuses to use my real name and continues to call me Chin - which slowly irritates me more and more. \n\nFinally he reveals “Be cool. It’s no big deal. where I come from, we call all you people chin!” And that was the last time I had to deal with him.",
            "I wonder if there’s an English equivalent to non-English speakers... like is there a stereotypical sound or word that ppl equate to English?",
            "When I was in first grade I was the only Chinese girl in my class and this one kid was making fun of me by saying “Ching chong” and I got super fed up so I told the teacher that the kid was calling me stupid in Chinese and got his ass in hella trouble.",
            "I mean, if you say the name \"Jiang Cheng\" really fast it sorta sounds like it.",
            "So does it actually mean anything? Or is it just another made up piece of racist language",
            "A teacher at my high school got suspended for asking an Asian kid that",
            "Love Reddit",
            "Tommy's brother?",
            "重庆 (Chongqing pronounced chong ching) is a major city",
            "I work for a Chinese family that claimed that they speak a dialect that only people in the southern Chinese countryside would understand. I’m not sure if they were fucking with me or not. I once heard my boss say “bing bong” in conversation with her husband. She wouldn’t tell me what it meant.",
            "Bing bong qiu  actually means table tennis ball.\n\n(qiu rhymes with show.)\n\nThat's about the best match I know.",
            "Now folks, since you're equipped with this knowledge.  You must realize that using this in a normal setting and then trying to explain to people \"what it really means\" doesn't make you less of an asshole.  Or racist.",
            "I remember me and my family were eating at a Chinese buffet and they had a Chinese student working there as a server. Her English was very good. We asked for some Tsingtao beers and she got all confused. She said they are actually called Changdow. It confused the hell out of me because you would think when using foreign letters to spell your product, you would actually sound it out and use the letters for their intended use.",
            "I love reddit",
            "I was born in HongKong and can read Chinese, what I wrote below is translated straight from Wikipedia by me.\nBack in 20th century,(1900-1999) Chinese and Asia kids gets insulted by white kids with a song.\nChing Chong, Chinaman(Ching Chong is referring to sound of hitting the rails)\nSitting on a rail\nAlong came a white man\nAnd chopped off his tail\nQing Dynasty's impression to Americans is stupid,dumb and behind, especially the little braid they have.\nConclusion: ChingChong is the sound of hitting rails. \nTook me 20 minutes for the translation, maybe some upvote yes?\nEdit: sorry for asking for upvote 3am me is stupid",
            "Someone has that tattooed on their ankle and thinks it has a totally wrong meaning.",
            "Follow up: is ching chong widely regarded as a racist generalization as it is in America?\n\nEdit(clarification): I meant to ask is it perceived the same way in China as it is in America as overtly or directly racist.",
            "Dunno, but Chongqing is a city so there's that.",
            "Doubt it but I'm not sure. I think it's more so some asshole term racist love to use",
            "heh i asked this a few years ago, its my most upvoted post",
            "No, it doesn’t mean anything",
            "I love how everyone in here needs god 😂",
            "Yes, it means \"great way to get beat up by an Asian person.\"",
            "No, ching isnt a word",
            "I had some friends back home with those names. Either first or last names. My first date's last name back home was literally Chong. \n\nAlso I don't understand what's offensive about the ching chong thing. We make fun of Americans our own way back home. Name calling is probably the least horrible thing I've endured throughout my life.",
            "/r/wordavalanches would have a lot of fun with these answers",
            "I've heard, please become.",
            "The chinese godfather whatever happened there",
            "[deleted]",
            "never knew I needed the answer to this either",
            "No, not in Mandarin at least. But Chong Ching (Chongqing 重庆) is the name of a large city in central China and literally means “celebrate again”",
            "I don’t speak Chinese but “ching chan” in Korean means compliment.\n\nOverall though, Korean sounds nothing like the stereotypes and neither does Chinese",
            "Another one that nobody mentioned yet,  also in cantonese which can easily be misheard by non-chinese speakers as ching chong is \"ching chall\" 清楚 which means clearly,  like to speak clearly.. or see something more clearly, or is it understandable?",
            "Ching chong china man milked a cow,\nChing chong chinaman didnt know how,\nching chong chinaman pulled the wrong tit,\nChing chong chinaman got covered in shit.\n\nthis is a song from uk schools circa mid 70,s- 80,s",
            "I’m fuckin ugly laughing on a public train right now thank you so much",
            "When people say things like that it usually means that they are an ignorant pos",
            "Now what would asian people use to racist sly refer to Caucasian language imitating?",
            "It could be a mispronunciation of \"Ching Cheong\", which is a legitimate Chinese name. https://en.wikipedia.org/wiki/Ching_Cheong",
            "It means someone is at the door",
            "Damn that’s hilarious. Bless you man",
            "White people love this question",
            "A lot of answers are proposing various two words phrases that have pinyin close to “Ching Chong.” But the nature of the Chinese language is that two one syllable english words will almost always have Chinese words that almost sound the same, and that same sounds could mean many different things, especially with different inflections not used in the English language. I really is not accurate to say “Ching Chong” means or came from any of those words because it absolutely didn’t, it’s just the west’s way of imitating sounds from a foreign language twisted to produce the most easily remembered, catchiest, and kind of derogatory sound possible.",
            "Ching Chong originally is mocking how Cantonese sounded, where back in the days where Cantonese is a majority representation of the Chinese population in the western world, yes even Wayne’s world utilized Cantonese as a major plot device representing the Asian community at the time. \n\nNot meaning to be a dick , but I think all those replies explaining what ching Chong could be in mandarin are pretty much irrelevant to the question."
        ]
    },
    {
        "post_id": "1bvnnno",
        "author": "A_Formal_Guy",
        "title": "All our girlfriends are Asian?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1bvnnno/all_our_girlfriends_are_asian/",
        "score": 14248,
        "num_comments": 2852,
        "created_utc": 1712238676.0,
        "selftext": "Hey everyone - I’ve been feeling paranoid about something recently and wanted to know if I’m overthinking it. I’m a white M and most of the friends I grew up with and went to high school are too, except 1. We’re still very close but moved all across the country for our jobs and life.\n\nRecently, we’ve decided to have a little reunion and bring our girlfriends, but I realized we have a not to subtle trend in that they are all Asian. There’s 5 girlfriends in total, they’ve never met each other. I don’t know how this happened, it’s just a coincidence as far as I know. We don’t have a pact or anything. \n\nMy question is, do we warn them? I don’t want them to be freaked out. I’d have to have my gf or one of my friends be uncomfortable, but I’m feeling stuck. Does anyone have any thoughts on how to handle it? Am I over thinking?",
        "permalink": "/r/NoStupidQuestions/comments/1bvnnno/all_our_girlfriends_are_asian/",
        "comments": [
            "[removed]",
            "[removed]",
            "If it gets weird, just get Asian boyfriends next time I guess?",
            "[deleted]",
            "[removed]",
            "Are you all engineers?  Women in engineering are much more likely to be Asian.",
            "Reverse-Uno it: Demand them to explain why they all picked white BFs.",
            "White guys with Asian girlfriends? *Impossible!*",
            "[deleted]",
            "I think it would be more weird if you bring it up….",
            "White guy Asian girl combo. Wow, never seen this one before. lmao",
            "I’m a white guy who lives in China, so my friend group looks like this (a few white women/Chinese guy pairs). One guy I work with sometimes tells people his wife is white before they meet her, because everyone assumes she’ll be Chinese.",
            "Are you guys Weezer?",
            "I know a White guy who went to a baptism for his Asian girlfriends friend. The whole dinner was made up of couples, all 12 couples were made up of a White guy and Asian lady. He didn't know what to think of it....",
            "FWIW like it or not they all know the trend. My wife is Chinese I am white. We both work in tech. If we are at a business event she usually walks into the room and says something to the effect of “look at all these white nerds with Asian girlfriends” with a smile on her face. We are both nerds.",
            "Bay Area / Seattle tech people be like",
            "I love how the conclusion of this story is that OP and all his friends are all nerds 😂 ",
            "\"Oh no, all our boyfriends are white.\"",
            "[I bet OP and his friends all look something like this guy:](https://newyorkcomedyclub.com/img/imagetest/jacobwilliams-jpeg-0dd00ce8-jacobwilliams-jpeg.jpg?1619718267)",
            "I’m gonna be real with you. This is probably going to make at least some of them feel fetishized. The fetishization of Asian women is still *very* real and very prominent, and even though it was an accident and probably due more to the pool of women you and your friends are exposed to, it may bring up some icky things for them. \n\nI don’t have advice, really, except maybe brush up on your language/vocabulary so that if it’s your girl who feels that way, you can talk with her about it in a respectful, validating way. (Searching women-related subs here for it to read about the personal experiences of Asian women may be a good place to start.)",
            "Do you all like anime?",
            "Lol - I'm a \"Data Engineer\" so not really an Engineer \\~ but I've found this to be pretty normal.  Before my fiancé I had only dated Asian women. It really just came down to chance, it wasn't planned or anything like that \\~ shit just happens.  \n\n\nI'd casually mention it. Definitely don't act uncomfortable about it, just tell her straight up.",
            "do y'all vacation in thailand?",
            "People say it’s because Asian women are in tech and white men too. I still don’t get why aren’t there the same amount of white females dating Asian men then? Let’s just be honest, white guys and Asian women fetishize each other and exclusively only prefer each other. You guys only meet potential partners at work? I don’t think so. ._.",
            "White nerd --> anime --> Asian fetish --> work in math/tech field --> mostly Asian females --> marriage\n\nIt's a simple pipeline, really.",
            "Just be like “we all got yellow fever in college and never found the cure”. \n\nDon’t do that. That was a joke.",
            "Why would they care? They all date white men. Your fine",
            "Boys over on r/aznidentity are NOT gonna like this one",
            "Where’s that Spiderman meme when I need it most",
            "I don’t believe in the nerdy Asian girl theory. I live in SoCal so quite a bit of Asian women white men couples and pretty much most if not all the woman are white washed to a degree and the complete opposite of an Asian female engineer.",
            "Whatever you do you should plan the meet-up at an Asian restaurant of some kind, but instead of a nice authentic sushi place or something go with PF Chang's. Also all the dudes should wear manga shirts and introduce your gfs as your \"waifus\", but only accidentally. Like \"and this is my waifu- uh...girlfriend\". And ask all the women to wear cat ears. \n\nThis is a joke. Do not do this. \n\nAs someone else has said, probably selection bias. You were surprised by it, so just be authentic. I'd probably mention it myself. In the same order that you discovered it. \"Hey sweetie, so I was talking to John and his gf Sasuke is Asian too. Well we were talking about how coincidental that was - turns out Mike and Jimmy also have Asian girlfriends. We have no idea how that happened, lol.\" Like just don't make a big deal out of it. But I think it will make it worse if you try to pretend like you didn't know.",
            "I minored in Asian studies and we talked about this a lot in school. Very common. It’s not just happenstance btw.",
            "In reverse,  how weird is it that all the Asian girlfriends are with white men?  It can go both ways.   It's not even that weird actually,  you are over thinking. I'd mention it to my girlfriend in a humorous way.   I don't think it's a big deal.   A little odd, but not much.",
            "Obviously you never mention it and act like it's really weird to bring up if any of them do\n\n\"Why are all of you with white men?\"",
            "It's going to be like that video where all the girlfriends dressed their men in the same dress shirt, and they came in one by one and laughed as they realized.",
            "Don’t bring it up. Bringing it up makes it weird and fetishizes it imo. Realistically, what would your gf even say, “boy, you and your friends have a thing for Asian woman.” And the response would be “I guess so.” Discussion ends there. I really think you’re over thinking here.",
            "Oxford study",
            "I'm expecting to read a r/TwoXChromosomes post by one of your gfs asking if this is a red flag right after the reunion.",
            "Not just staight guys lol. My bf is white and bi. His 2 other friends are straight. The two have Asian gfs and he has me, an asian boy…",
            "When I was first dating an Asian woman, we went to a party thrown by one of her friends. All the women there were Asian, all their boyfriends/husbands were white. While hanging outside with the men (none of whom I knew well), I said, “Hey, we should form a band and call ourselves The Rice Kings.” One guy laughed, the others just shuffled awkwardly.",
            "As an Asian man the likely hood of this happening with my Asian guy friends with white girlfriends is 1 in a million.",
            "Most smart white male engineers don’t always have social game. White girls often optimize for social game more than brain when meeting SO. Asian girls often optimize for brain. Also precious few white girls in engineering.\n\nSource: in tech\n\nEdit: also just 5 years ago, Caucasians didn’t really respect STEM career on the level of MD, lawyer, business. Now just a schmuck at FAANG brings home 330k a year in Seattle no income tax.",
            "White men and Asian women are the highest demographic of interracial dating in the major western world. \n\nI doubt they’ll be surprised",
            "I mean, are they all the same Asian? I’m an Asian woman and would be suspicious if they were ALL the same ethnicity as me.",
            "White men love Asian women. That’s it.",
            "Invasion",
            "You all have a type. These women all have a type. Just so happens stereotypes are built off truths lol.",
            "One of the gf's are breaking up after this meet up lmao! She's gonna think y'all in some Asian hunting cult ",
            "Are they all Chinese or like a mix of Japanese Korean Filipino Thai?",
            "The typical nerdy white guy that browses Reddit usually has an Asian fetish. When I call out my white buddy on his fetish, he claims to not have one. He just tells me dates only Asian girls bc they have good posture and are submissive. \n\nI dont know you tell me. Guys that don’t usually blend in well with society go to a culture they assume are more submissive.",
            "I'm going out on a limb here and guessing y'all weren't the sports stars of the school. If y'all are anime-loving, D&D, computer nerd types it just makes sense.",
            "I don't remember where I have seen this, but in terms of interracial dating I have seen somewhere that Asian women are the most likely demographic to date outside their race. If I remember correctly, second only to white men. I don't have the source on me at to back it up, but I know for sure that it is one of those statistics that definitely *feels* true in my experience. Could be a regional bias (I'm in the south) but your story seems like a pretty usual story to me. Idk if it's worth feeling weird about. You love who you love, right?",
            "This is why I moved away from Seattle. It was just too creepy.",
            "Well White Man-Asian Woman is one of the most common interracial couplings. \n\nI think it's hard to say an individual cases, but there definitely is a level of fetishization on both sides, sometimes subconscious.",
            "Oxford study",
            "Fetish meets fetish. Nothing new.",
            "Weebs?",
            "The age old white male/Asian female couple. It's like white on rice lol",
            "In my city I’ve seen more white men with Asian women than Asian men with Asian women. It’s shocking when you pay attention to it.",
            "I mean the girlfriends have all probably individually wondered if their boyfriends have yellow fever before anyway",
            "My white husband is in tech. I am Asian. \n\nAre you in tech? Are your friends in tech?\n\nI wouldn’t say WARN them per se, but tell your SO and she’ll probably think it’s hilarious. Then bring up the fact these Asian women also choose white men so there’s always that.",
            "Honestly I’m a black woman who’s dating a Chinese American guy in finance and I just prayyyyyy there’s no fetishization in the wmaf coupling. \n\nNGL a lot of this thread is straight up just weird.",
            "I just think this is a really sweet question and you’re a thoughtful person.",
            "My wife is korean.",
            "Honestly, I don't think it'll be weird unless you make it weird.\n\nSounds like the types of work y'all do and circles you run in tend to have a higher proportion of Asian women so it's not surprising that's who you ended up dating.",
            "White guys have big asian fever, especially the STEM ones",
            "Y'all like Asians. It is what it is. I'm surprised that, as friends, y'all have not discussed you preferences to each other. Unless y'all didn't know. lol As an Asian I can tell you that we know when you have a thing for Asians so more than likely your girlfriends are aware. Probably might be happy having other Asians around. Or they are Asians that don't get along. In that case this might not go well. lol But that's usually if they're from their various countries in Asia. I'm guessing they are all or mostly Westernized Asians, born or grew up in what ever western country you're in. Its fine. The only making it weird is you. lol",
            "Lest you all be accused of succumbing to yellow fever.",
            "Are you weebs?",
            "I wonder why we see so many asian women with white men and not other races?  \n\nIs it white men fetishizing them that prevents them from dating other races?  Are white men the only ones into anime that cause this fetish?\n\nHmm.  I really want to get to the bottom of why you mainly see asian women with asian or white men.",
            "As an Asian male, its up to you guys to have all 5 women fight in a ring swiss style to determine who is the best girl",
            "Are you from (northern) California?",
            "Talk to your gf about it? It's not like you planned it. You'll make more of a mess trying to be clever than just talking about it",
            "JBW",
            "AM here, married WF. I didn't tell my asian friends and family - I just let them come over and feel her skin and hair /s",
            "A lot of people raised good and very real points about Asian women too and that's for her to do some deep introspection about. Even myself I ponder this as I recognize the overarching pattern and societal dynamics for where I grew up and lived, which was mostly white, plus what opportunities and real talk, even privileged protections exist with being in close proximity to white people.\n\n\n\nSpeaking as an Asian American, there's no easy answer for you aside from maybe just showing your girlfriend \"hey, take a look at this situation, it's kinda unusual and I'd like to know what do you think about it?\" and try to go into this with the intent for both of you to grow as people in a cultural sense.\n\n\nBut also, I think you need to take a serious reflection about what it means to diversify your friend groups so that it's not all white guys. \n\n\nTo me that's just as much a flag for attention about how you could grow in a multicultural sense that doesn't keep you pigeonholed in the whole white male Asian female fetish trope dynamic.\n\n\nLike this whole situation and the likely shape of the conversations ahead wouldn't be as glaring if you showed up and you some male Black, Latine, Native, Arab, and Asian male friends were part of the group too.",
            "Well, Asia accounts for roughly 30% of the landmass of the world and an estimated population roughly 60% of the global population. That means just the population of Asian women is roughly 30% of the world population. \n\nRough numbers obviously but I honestly am not a little bit surprised to see 5 dudes who ended up with people that make up 1/3 of the total global population.",
            "My best friend from college and I are both with two Indians from the same city and he met his partner in a completely different state.  The world is funny :)",
            "Wear a shirt that says Colonizer when you meet up so they know you're the boss.",
            "I don’t think a warning is necessary. But you could point it out as a funny thing to your own gf. Maybe come prepared with a funny, positive joke that the group may enjoy. \n\nI’m in the Bay Area and in tech. It’s not an uncommon thing and I wouldn’t bat an eye at it. But might depend on where you are.",
            "[removed]",
            "I see it with my white guy friends all the time. They’re nerdy and socially awkward and have a hard time dating cute white or Latina girls, so they go for Asian girls who tend to be cuter or more feminine than any western girl they can get. These Asian girls usually aren’t hot enough to date successful and/or attractive Asian guys, so they give up and go for the nerdy socially awkward white guys. Both become each others’ types. \n\nI’m not saying this is always true but this seems to be the case for a majority from what I’ve seen and heard from both my white and Asian friends. Asian dudes have hella high beauty standards",
            "Lean into it. Only go out for Asian food. Make no mention of it.",
            "The nerdy white guy to asian woman pipeline is real.",
            "This actually reinforces the cliche that Asian women seek white Western men...  I said \"seek\", not \"like\"..",
            "just let it be. humans date humans"
        ]
    },
    {
        "post_id": "f5fxg4",
        "author": "Gmpeirce",
        "title": "Can you bring a foam finger into a court room?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/f5fxg4/can_you_bring_a_foam_finger_into_a_court_room/",
        "score": 14236,
        "num_comments": 551,
        "created_utc": 1581974508.0,
        "selftext": "I just wanna know.",
        "permalink": "/r/NoStupidQuestions/comments/f5fxg4/can_you_bring_a_foam_finger_into_a_court_room/",
        "comments": [
            "Most judges will have you removed for \"disruptive clothing\", which could even be as minor as a sports jersey.  A big foam finger surely isn't going to fly.",
            "Even if you technically could bring it into a courtroom, the judge could very much have you escorted out if you waved it around.",
            "Some courtrooms won't let you in if you don't meet its dress code so I doubt it.  But give it a shot and let us know how it goes.",
            "Up to the security rules of your local court",
            "LPT: if you want a judge to even consider giving you leniency or any sympathy, show up to court in AT LEAST dress pants and a tucked in button down/polo shirt. If you want to make him happy, add a tie and a jacket. Respect a courtroom the way you would if you were going to grandmas house for Sunday church, and you’d be surprised how far it goes. Yes your honor, no your honor, and every response directed at the judge should be followed by, “your honor”",
            "Judges dont play. I was in traffic court one day with a blind judge. He asked the man whose case went right before mine what he thought was so funny. Judge had an assistant who told him all about the defendants looks and demeanor. Apparently the guy was smiling and the judge or his assistant didn't like it. I was nervous but the judge was still thinking about the other guy and I slide right by.\n\nLeave the finger at home.",
            "[removed]",
            "I once got threatened with expulsion from a courtroom for leaning forward in my seat because my back hurt from sitting straight for 2 hours.\n\nI'm gonna say a foam finger is a hard no.",
            "I'm a court officer, the answer is no lol",
            "[removed]",
            "Depends on whether you're there to root for the home team or for the away team. Home team? Sure. Away team? Enjoy your contempt of court.",
            "I don't think I would, but it would be up to security. They may question you holding it up or waving it around in open court, making a bit of a scene, and not allow it. I've seen people locally get stopped at security and told their well-wishing posters had to go back to the car. Maybe call up there and ask if it would be allowed.",
            "So my local court house has a rule about hats and I wear a hat most of the time yet they never seem to care. I feel like it would depend on how good of a mood the judge was that day.",
            "A better question might be, \"How long can a judge keep me in jail for contempt because I was fooling around in their courtroom with a giant foam finger?\"",
            "I went to traffic court over expired inspection sticker. Dude showed up in shorts and and Kevin Durant OKC jersey.\n\nI showed up in an army uniform with no shame, I had like $50 in my account and couldn't afford the ticket. Got out of my ticket, it did not end well for the Durantula, pretty sure he got the full fine.",
            "Security will tell you yes or no but either way, you’ll have to go through security. I wouldn’t recommend it just because you’ll put courthouse security on alert for no reason.",
            "Remember the Judge is basically God while you’re in their court room. We’ve had judges send people home for not dressing appropriately for traffic court (in jeans and muscle T).  99.8% of judges don’t have a sense of humor.",
            "Yes, but it has to be [this one.](https://www.siliconera.com/wp-content/uploads/2013/10/objection_thumb.jpg)",
            "Is it evidence?",
            "You should do it especially if you're going to use it to point someone out.",
            "I wouldn't try it. I had to go to a city court once for a vehicle infraction and the person I was with brought a newspaper to read while waiting.  Before anything even started, the Judge came and told her that she would be in contempt of court if the paper wasn't put away.",
            "You can technically bring it, however you could be tossed out of court for a dozen reasons... and being tossed out is the best case scenario honestly.",
            "i got reprimanded for wearing a hat, so I'm guessing no.",
            "You'll get arrested for 80 days for contempt of court but then they'll only arrest you for one day and reddit will post the video and praise the judge for being an arbiter of justice because you only went to jail for one day",
            "Qif u get kicked out stand by the window",
            "Good luck getting that past security",
            "I watched a friend walk in dressed as a grandma, wig and everything. Took it off at the metal detector and put it back on before going in the court room. Lmao\nIt's not a foam finger, but damn.",
            "If it's evidence, technically yes?",
            "A court officer would almost certainly either not let you in or kick you out as soon as they saw it.",
            "without reading the replies.. its just disrespectful as fuck",
            "Only if it is surgically attached",
            "What if you decide to bring it, they allow it then the result does not favor the foam finger? Not stonks",
            "Depends. Is it evidence?",
            "Maybe, but it had better say \"JUSTICE!\" on it.",
            "D-FENCE! D-FENCE!\n\nNo seriously, defense attorney: he was already parked in his driveway when that cop breathalyzed him...",
            "I guess you could bring the foam finger if it was a murder weapon or something.",
            "\"For the love of God, take it off!!!\"",
            "Yes, it's recommended.",
            "Bring the finger and let us know all about it.",
            "A judge once continued my case because I didn't have my arm tattoo covered. It was the middle of July, I guess short sleeves was not an option.",
            "Make sure you yell something like \"GO DEFENSE TEAM! WE'RE NUMBER ONE!\" for added effect",
            "I've seen people report for jury duty wearing shirts like \"Only God can judge me\" (presumably to get out of jury duty)",
            "Depends on the size.",
            "no, no, no.  in any courtroom with a modicum of decorum you're not even allowed to make faces reacting to the case that you're listening to or talk to people next to you or hold up pictures of victims or any number of other things that would be distracting.  cute idea, though.  signed, a court reporter who wishes someone like you were in the gallery today!",
            "I'm just imagining someone in the audience in Judge Judy waving the finger around in the background while she's ripping the defendant's ass.",
            "[deleted]",
            "aside from all the dress code stuff and all, it might potentially raise security concerns as it could hide something inside. there's no way of being sure really so definitely no",
            "Almost certainly not",
            "What if you wear a shirt with a foam finger on it?",
            "You can actually bring two foam fingers into a court room and it will multiply the awesomeness by two. Three fingers ... x 3 ... four fingers .... x4 .... see a pattern ?",
            "Homer do as Homer does.",
            "first time I ever had a trending appear in my notifications for this sub. did not disappoint",
            "Only if you have judge Judy and the finger is from one of her sponsors",
            "r/suspiciouslyspecific?",
            "Now this is why I sub here.",
            "Cool you got court-side seats!",
            "If it's evidence, technically yes?",
            "I just wanna know WHY you wanna know.....",
            "That one lady wore her star trek uniform as a juror to the Clinton's whitewater hearing. It was in that documentary movie Trekkies",
            "I brought bronchitis into the jury room once. Well, technically many times over that week, but alas.",
            "yes and is recommended if you know before the judge name is Mr. Spike. That cases the cops use foam hats, bit larger than normal ones.",
            "[deleted]",
            "Uncle Jack?",
            "Farvas number one Farvas number one!!!!",
            "As piece of evidence, Yes.",
            "A giant one that says “she’s the real abuser”",
            "Of course you can! But then you'll be swiftly whisked away and if the judge is in a bad mood you get in trouble",
            "I guess it would depend on why you have the foam finger in court",
            "Is it evidence?",
            "So are you a big fan of the prosecutor or something",
            "I work at a juvenile courthouse and the judge would probably be okay with it if you were there to celebrate an adoption",
            "As someone who’s been in courtrooms, don’t do anything you even think MIGHT piss off the judge.",
            "Dafuq is a foam finger?",
            "What if you had Elon Musk funds and engineered a prosthetic hand with the foam finger so it was not removable? A boy can only dream",
            "Even if you got it in if you waved it even once they would escort you out or worst case hold you in contempt and you'd spend the night in county",
            "P Barnes says no.",
            "If it's evidence, then it would be allowed. Not someone wearing it though.",
            "Wear business attire if you want to impress the judge. You shouldn't have to but it's the way things are.",
            "I just died laughing I hope theres a video of this if you do it!",
            "It depends on the situation. Are you some kind of expert giving testimony and the foam finger is some kind of evidence or visual aid for something pertaining to the case? Probably fine. Are you on trial for murder? Probably not fine.",
            "Great question. 10/10",
            "What color?",
            "I tried this a few years back.\n\nI got told to turn around.",
            "This made me laugh. I hope someone tries and posts a video lol",
            "If you want to demonstrate what the pedi file did to you yes",
            "You probably could sneak one in, you also stand a good chance of spending the night in jail depending on the judge.",
            "I think you could probably be arrested for that, to be honest, if the judge wanted to make a point",
            "Try German stink bomz.",
            "Can you bring one in, yes. Just give us the story if u got to keep it.",
            "Yes why not",
            "Unlikely. It’s expressive conduct and a courtroom isn’t a public forum like a sidewalk, street or park.",
            "That foam looks like it's maybe an inch thick",
            "Tell us why you want to.",
            "\\#FreeBritney",
            "blockhead?",
            "You can get large hand gloves",
            "What's a foam finger?",
            "The ONLY instance might be adoption court as these are celebratory and usually lax in decorum.  You still shouldn't expect much though.",
            "oml",
            "There is no way to get a definitive answer as it is entirely at the discretion of the judge.  The odds one would allow are extraordinarily slim though.",
            "You could......if you want to spend time in jail. Best behavior should be practiced in courtrooms, judges do not tolerate anything less.",
            "I wanted to bring one so bad when my ex got sentenced.",
            "Uncle Jack!",
            "I doubt it. I don’t think you’d even make it through security.",
            "Legally yes",
            "You could get ejected for unjurysman-like conduct.",
            "Depends on the judge, you are in his house and will abide by his rules.",
            "You will be escorted out, but you could do it.",
            "I have no idea, but if nobody confirms you'll get in any sort of lasting trouble, do it and tell us what happens.",
            "That's going to depend on the court. Everyone can tell you that they wont have it or that they can't stop you but it seriously depends on the court and the day. If you're holding it up or using it in the courtroom, you'll most likely be warned sternly then asked to leave or removed. If you're considering this, I would sincerely recommend against it.",
            "Short answer, yes. Long answer, double yes.",
            "i assume it would depend on the judge?",
            "You can be held in contempt even if you don't have a case. You'll probably be asked to leave first, but if you don't comply expect a few days in county.\n\nI haven't been to court in ages but went recently. No hats, no chewing gum. The most basic of rules.\n\nThe judge is called a judge for a reason. He or she is law inside of that room. No due process, no questions asked. You can and will be detained if you disrespect their order."
        ]
    },
    {
        "post_id": "rlreso",
        "author": "DarthHarambe666",
        "title": "Is it normal to not wash your feet while in the shower?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/rlreso/is_it_normal_to_not_wash_your_feet_while_in_the/",
        "score": 14230,
        "num_comments": 3828,
        "created_utc": 1640130070.0,
        "selftext": "My wife thinks it’s gross that I don’t bend down to wash my feet when I shower. Now I’m kind of embarrassed to ask friends if they do. I always figured the soap from washing your body basically cleans them naturally.\n\nEDIT: Thanks for the awards and responses guys, but I guess my feet are officially horribly foul.\n\nEDIT 2: Dang this blew up, made it to the front page for having nasty feet. Btw, my feet don’t stink, and they’re not infected. Please don’t message me about it, I get it now…",
        "permalink": "/r/NoStupidQuestions/comments/rlreso/is_it_normal_to_not_wash_your_feet_while_in_the/",
        "comments": [
            "I wash them, but I don’t bend down to do it, I lift my foot up to do it, how do you wash under your feet if you don’t lift them up from the ground? Or do you do a whole yoga pose like bent down foot up? Hahah",
            "worked in orthopedic surgery and one of the surgeons was notorious for wrapping the patients' toes in sterile gauze before any procedure on the legs. The residents asked him why and he just looked at everyone and was like \"...people's feet are gross. When was the last time you all scrubbed between your toes?\" and we all just looked away and went back to prepping the patient.",
            "LPT: don’t read this post and then immediately ask your spouse “Hey, do you wash your feet when you’re in the shower?”",
            "I only wash my head, #trickledowntheory",
            "Just multitask and pee on them while you're cleaning your body.",
            "One of my massive fears is falling and dying in the shower, so i got a bathmat with little scrubby nubbins all over it so while i shuffle around in the shower i clean my tootsies without the balancing act.\n\nUpon popular request, my sweet scrubby nubbins: https://www.walmart.com/ip/Mainstays-Oval-Textured-Pebbles-Scrubber-Tub-Mat-Gray-13-58-x-27-4/54297011 . Also, it gets cleaned every Sunday for those concerned about hair, gunk, or people debris.",
            "I do wash my feet while in the shower, I don’t consider them clean just because they get wet.",
            "Make sure you always:\n1) wash your pits\n2) wash your feet\n3) wash your genitals\n4) wash your ass",
            "I scrub my toes \n\nI like to clip my nails if I have to after a shower because warm water softens my hard toenails",
            "Just get a foot scrubber that sticks to the bottom of your shower. They work great for those quick morning showers.",
            "It's common, but pretty gross.   I'd posit that 90% of people who complain of having sweaty feet all the time don't realize that it's because of bacterial and fungal colonies growing between their toes.",
            "Yeah it is.  But they did studies where like 80% of guys don't really wash their legs either most of the time.  So if you're getting the legs and just missing the feet, then you're probably still ahead in the game.",
            "[deleted]",
            "Yes! My dude, please learn to pull your feet up and clean between the toes during the shower. If you sweat down there, there’s bound to be bacteria and you need to wash it away to prevent stink or other less palatable things.\n\nETA: as a woman I was surprised how many men don’t know to do that, which is okay, just be open when people try to educate you. But yes, kinda gross if you don’t.",
            "[deleted]",
            "I sit on a bucket turned upside down and wash my feet and legs with either a back brush or a sudsy washcloth. I’m getting old and don’t want to fall in the shower.",
            "If your feet smell, they may not have to",
            "Ya’ll could just use one foot to clean the other foot (rubbing) at the bare minimum if you don’t want to bend down.",
            "For me it's one of the top 3 reasons to shower. You gotta wash those feet man. Been stuck in sweaty shoes all day. Get some special foot soap in the foot aisle at the drug store. I like the kind with pumice in it.\n\nGet in between those toes. Your feet are more important than you might think. There are lots of foot-related videos online that might be able to help you out.",
            "I used to think that! I was about 15, maybe, when my mum told me my feet were too smelly, and to go and wash them properly. I scrub them properly these days. \n\nI recommend using a shower pouffe, or a nice scrubby flannel, get rid of all that dead skin properly.",
            "I almost never wash them specifically",
            "I’m a girl and I also never wash my feet. My feet remain soft and don’t smell. So idk what’s up with all these other replies.",
            "There's a [doctor who teaches at Yale who pretty much doesn't shower at all](https://www.npr.org/sections/health-shots/2020/09/26/917019912/in-the-era-of-hygiene-clean-author-makes-the-case-for-showering-less). The thought is that we evolved with a skin microbiome and our hypercleanliness is disrupting that. \n\nHe distinguishes between general hygiene (such as handwashing) and cultural cleanliness rituals. (Other than the stuff like handwashing to avoid transmitting disease, he pretty much rinses off occasionally and that's it. The rest is up to his body regulating itself.)\n\nSo in that regard, it's probably fine not to wash your feet. He doesn't.\n\nI've seen other doctors specializing in skin care (i.e. literally dealing with disruption of the microbiome causing skin problems) who say to focus on your \"bits\" -- underarms and groin (and maybe feet) -- and not to worry about scrubbing everywhere else.",
            "It’s not simply letting soap touch your feet. You need to SCRUB the germs and dirt off your feet. That’s like having a dirty plate sitting out all day and then pouring soap over it and running water over it, thinking it’s clean. You have to scrub off the gunk.",
            "The trickle down effect may not work with the economy. But it's my go to foot cleaning solution in the shower.",
            "Doesn't matter what you think mate. WANT TO HAVE A EASY LIFE?  Just start washing your feet like she wants you to. Trust me on this m8",
            "Female here. I assumed it was normal not to! Once in a great while I actually have to specifically wash my feet because they’re that dirty (usually sandy from a beach run in the summer). Or if I mow the lawn in sneakers. Otherwise, I let gravity do the job. I’m with George Carlin on this one: only head/face, pits, and privates really NEED specific attention usually. Other than that, it’s just the water running off or as needed. I don’t have a foot odor problem, but maybe if I did I’d think differently.",
            "All the people here calling OP gross are actually the gross ones with stinky feet and mushrooms growing between their toes.",
            "There's some nasty mofos in this sub!",
            "Flipping through this thread thinking about how many folks oversoap, end up with dry skin/hair, and have to compensate for that with lotion. Big boost to the lotion industry though.\n\nMillions of years of evolution towards maintaining hairless skin defeated by readily available heated water and a few cultural norms.",
            "I’m with you, OP. If they’re visibly dirty or smell I wash them but otherwise the soap and water running down is enough. Actually was recommended by a doctor for me because of such dry skin below the knees as well.",
            "You know, I used to wonder the same thing. But washing your feet helps prevent fungus and odor. It's a must. ESPECIALLY if your job has you on your feet all day.",
            "If i wash my feet in the shower after a few days the skin starts cracking between my toes and i use oil of olay but then again I don't really have skin. It's just something that keeps my insides from oozing out. Prloblem skin all my life.",
            "Lol, you will probably both survive. I scrub my feet but I have issues with rough skin, it probably does not make any difference whatsoever, they are soaking in the water the whole time so they probably do not stink when clean.",
            "When you're 50+ ... have lost all the ... bendy ... you've ever had (and had very little flexibility even as a youngling) ....\n\nAnything that's below the knee that gets washed regularly is a bonus.\n\nI just kinda swish 'em around by kickin' in soapy water.\n\nMy own hands will never again touch my own feet from a standing shower. \n\n\n***\nBathtub ... or a bench seat in the shower are the only ways they ever get washed these days.\n\nDaily shower? \n\nNot a chance.\n\nThe farther in your past your 50th birthday was ... the more true this becomes for you.",
            "If it doesn't regularly smell, you're fine. End of discussion.",
            "I haven't done that for 62 years. Never a problem.",
            "I never wash my feet and I’m a girl. But I also never use body soap either, mostly because I have sensitive skin and the benefit never seemed worth it. The only time I smell is when I forgot the deodorant, but my body (and skin) seem relatively healthy and clean. My feet never ever smell either. Everyone’s body is different though.",
            "My tub doesn't drain well so my feet are marinading in soapy water for 5+ minutes. That's usually enough. I will wash them if they are visibly dirty like if I've been in flip flops outside. Other than that I'll wash them like... Once every ten showers",
            "I never wash my feet, apart from what they get from the shower trickle down.\n\nI think it might be a body chemistry thing.  I don't think my feet smell, and people I've lived with have confirmed it and been quite envious.  \"How come my feet smell and yours don't, and yet I wash mine so carefully?\".  Dunno.  It's just a thing.  Not complaining.",
            "Not washing them seems weird.\n\nYou should be scrubbing them to get the dead skin cells off.",
            "Ask your friends. If they agree, band together and make your wife feel like the one who is weird. If your friends don’t agree, tell them they’re inefficient at life and waste time in the shower. Throw soap on the ground and rub your feet back and forth. There problem solved. Yeah"
        ]
    },
    {
        "post_id": "e8uffn",
        "author": "jedi1josh",
        "title": "Why does ketchup with fried potatoes sound good, but ketchup with mashed potatoes sound weird?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/e8uffn/why_does_ketchup_with_fried_potatoes_sound_good/",
        "score": 14223,
        "num_comments": 1668,
        "created_utc": 1576002145.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/e8uffn/why_does_ketchup_with_fried_potatoes_sound_good/",
        "comments": [
            "[removed]",
            "Frying food changes the texture and the flavor of the food, compared to cooking by other means.\n\nI also put ketchup on my scrambled eggs, but would never do it on a sunny side up egg, for the same reasons.",
            "A Dutch friend introduced the idea of mayonnaise and French Fries to me. I tried it, and it isn’t too bad. I thought it “sounded” gross, though, until I remembered the ingredients in potato salad. Then my wife told me that during WW2, here in Vancouver, ketchup was very hard to get, so her mom, and many others, used mayo on their fries. Taste wins out over looks if you’re hungry enough.",
            "I have ketchup to my mashed tatoes all the time. I dont understand",
            "Where I live our hot dogs come with mashed potatoes and ketchup on top (and a shit ton of other things, but let's stop there) and it's pretty great.",
            "I don't think its weird, in my country it is standard to have mashed potatoes with sausages and ketchup\n\nAlso try cucumber with ketchup and thank me later",
            "A few years ago, a friend told me she always has Worcestershire Sauce on mashed potato. I thought that sounded odd, but tried it myself. Wow! Now I always eat it like that.",
            "yeah it's a texture thing. Also the flavor profile of fried potatoes is \"salty,\" while the flavor profile of mashed potatoes is \"creamy.\" Ketchup upsets that with some salty-sour notes.",
            "Because you have never had pâté chinois. That has to be eaten with ketchup, as is tradition.",
            "This post has the grossest comments ever.",
            "Because you’re not used to it. Mashed potatoes with ketchup is very common in my country, so next to no one think it’s weird.",
            "r/ketchuphate",
            "Heavy cream is one of the ingredients in mashed potatoes. Mixing heavy cream and ketchup just doesn’t sound like a good idea to me.",
            "Because you haven't tried ketchup on mashed potatoes..it's yummy!",
            "A huge portion of food pairing comes from texture or complementary flavors. Sweet and savory, crispy and smooth, etc. Crispy fries contrast with the smooth creamy ketchup, just like salt contrasts with chocolate or caramel. It introduces layers of flavor, and when done correctly, enhances the other taste. This also works on the opposite end of the spectrum - too many similar flavors added to one dish can cause an overload and make the dish taste terrible. For example garlic is savory and salty in its own flavor profile, so if you add a hefty portion of garlic to a dish that already calls for salt to add it's savory component, you're likely to make the dish taste TOO savory and ruin it. Garlic can replace salt and vice-versa in most recipes. Sugar can be used to sweeten a dish in place of another sweet component, like when you make tomato sauce some people will add sugar instead of letting the tomato cook down all day long to release more sugars, making the sauce less acidic.\n\n&#x200B;\n\nIn the case of your fries/ketchup example, it's a matter of texture. If you've never tried mashed potatoes with ketchup or whatever other sweet condiment you may pair with your main course (like the gravy from a pot roast or the browned drippings of a meatloaf) you're missing out. It TASTES just as good as a crispy french fry with ketchup, the only difference is the texture.",
            "Shepards pie with ketchup. Mmm.",
            "Ketchup sounds good with nothing. It's just gross, thick, red, sugary syrup.",
            "Swedish meatballs, mashed potatoes, pickled cucumber and lingonberries. Top it off with some ketchup and enjoy! MMMMM Yum",
            "ITT: Delicious, low-cost food hacks",
            "Both options sound good to me. But then I like ketchup on rice so I'm probably a savage.",
            "[deleted]",
            "It doesn’t",
            "Because you lack vision.",
            "[removed]",
            "That’s easy. Fries are oily and ketchup is oily so the oily mixed togoily doesn’t spoily the enjoyly of the mix. But mash goes with butter and that’s oily but you’d be an utter nutter to put butter on your fries. It’s a combo we don’t crave. So that’s a disappointing answer I just gave.",
            "It's not. I do that all the time, and I also add ketchup to my macaroni.",
            "They’re made differently. They have a different shape, texture, and flavor. For example, we all put gravy on our mashed potatoes, but only diabetics and Canadians will put gravy on french fries.",
            "I once saw a friend of mine (who is a ketchup junkie), put ketchup on Thanksgiving turkey and dressing. I thought that was pretty hardcore.",
            "I think it’s the frying that makes it sound good? And mashed  potatoes generally have cream and butter or some dairy at any rate, which sounds not great with ketchup.",
            "We put ketchup, mustard, and relish on hamburger, which is ground up steak, but not on steak. We have weird food customs.",
            "The acid in the ketchup cuts the grease from frying.",
            "Because the first part is a lie, the second half confirms the ugly, ugly reality of the situation.\n\n#MayonnaiseChangedMyLife",
            "It's definitely a texture thing.",
            "Mashed potatoes don't taste like French fries, so is it really that surprising that the condiments you add to them would be different? \n\nA lot of people put butter on mashed potatoes,  but to me, it sounds gross if you poured butter on your French fries.",
            "It doesn't actually sound weird.",
            "I personally love ketchup and mashed potatoes! Also cinnamon apple sauce mixed with mashed potatoes. \n\nSome weird shit I carried over from childhood!",
            "BUT IT'S DELICIOUS. \nI almost always mix tomato sauce through my mashed potatoes :)",
            "Ketchup and mashed potatoes are the shit",
            "Mashed potatoes and tomato sauce (ketchup) is a pretty standard combo in New Zealand",
            "It's a texture thing. Ketchup and mashed potatoes are both soft and kind of liquid, so its a weird, messy combo. Since french fries are more solid and crunchy for the most part, and have more of a distinct salty taste, the ketchup just works.",
            "You fry in oil, creating a greasy, fatty texture that the acid of ketchup pauds nicely with.",
            "The smoosh to crunch ratio is too floppy.",
            "I love ketchup with mashed potatoes!",
            "Its the crunch.",
            "Ketchup and mashed potatoes is fucking delicious\n\nSource: my 40 years of doing it.",
            "It doesn't, just try it you weak-willed American",
            "it doesn't if you're Irish enough",
            "Socialization\n\nfries with mayonnaise sounds disgusting to me but I'm not a European. We grew up eating things a certain way and those memories bring us comfort. Changing that unquestioned comfort is often seen as weird or confusing, we tend to negatively react to those changes on a visceral level.",
            "I would guess that it’s a texture thing. And, although they are both potatoes, fried potatoes and mashed potatoes really do taste completely different. But hey, taste is personal, if you want to put ketchup on your mashed potatoes, have a blast. I have a friend that puts mayonnaise on his anchovie pizza.",
            "The sweetness of ketchup goes good with crispy potatoes.  If you were to crisp up the mashed potatoes crust in the oven, and put some ketchup on it, that'd be good too.",
            "Texture?",
            "My grandma used to make pink mashed potatoes by mixing in ketchup. She died about 25 years ago. I'm going to make pink mashed potatoes tonight in her memory.",
            "Why does mashed potatoes and gravy sound good and fries with gravy also sounds good?",
            "id say its because of the different textures of the potatoes",
            "Here in Ireland ketchup with mashed potatoes is a delicacy"
        ]
    },
    {
        "post_id": "qz11dr",
        "author": "None",
        "title": "When a woman is swimming or in the bath, does her vagina fill up with water?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/qz11dr/when_a_woman_is_swimming_or_in_the_bath_does_her/",
        "score": 14218,
        "num_comments": 1771,
        "created_utc": 1637519118.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/qz11dr/when_a_woman_is_swimming_or_in_the_bath_does_her/",
        "comments": [
            "it’s like how it is with your ear- just being in water generally won’t make it fill up but if you move a certain way or like purposely try to get water in you definitely can get some inside",
            "It doesn't *fill up*, but sometimes a little bit gets inside. Or when you go down the water slide and hit the pool ass-first.",
            "Not all the time, but there has to be a specific movement to make it go up there. \n\nSource: When I was a kid, I used to purposely suck in bath water with my vagina bc I thought that was really fun…\n\n*EDIT: I’m high af and this is hilarious that this became my most upvoted comment. For those who want to try it themselves, idk how to explain it but if you know how to queef, then you know how to suck in bath water. Good luck!",
            "I'm dying laughing at all these responses. All of them. They're all hilarious and this topic is hilarious. \n\nIn all seriousness though, the answer is, it can. Depends on the person and the position. Normally not much will get in there unless there's some intent behind it, though. There's some variables that can make it more or less likely to happen, and that'll be different depending on the person. Swimming in a basic forward motion in a pool is unlikely to cause this to happen (though a small amount would be common enough). Jumping crotch first into the water might. Creating a suction with the vag in the bath will probably cause it to happen. There's tons of in-between variables that are both in and outside the person's control though, so don't take my explanation at hard fact lol. \nHope this answers your question!",
            "A very long time ago I danced at bachelor parties. This used to be one of the girls tricks. She would have a minimum tip to do it--I can't remember what it was but she was a top earner. She would set herself up on her back, fill her v up with bottled water and push it out like a baby whale. Fun little party trick. 😂",
            "Sometimes. When the water exits it is an odd sensation",
            "Yes.  This is what allows them to dart away like a squid if they feel threatened.",
            "Am I the only woman here that read this and thought “wtf no lmao” and was horrified to read the comments???? First of all how u got coochie suction game like that tf\n\nEdit: ok thank god I’m not alone I was stressin abt my anatomy for a minute lmao",
            "Nope, if there is a high force of water it can. Such as a fast water slide or jumping in from a height with legs open. Which can result in internal injuries.\n\nBut generally speaking, sat in the bath, no water goes in...(in my experience).",
            "Okay it seems that most women don't experience that, but when I do the breaststroke, some water enters in my vagina. \nNot in the bath though 😅",
            "It's not supposed to but I was on a tour in Mexico and we ziplined from some mountain to another one and then rappelled, ziplined, and watersided our way down. On the last slide, the guide said I didn't need a mat and water got in every. single. hole. I had been suffering from some illness (no travel insurance, no doctor, no diagnosis but it felt like strep throat) and having the ice cold river water pumped backwards through my sinuses actually felt nice. The forceful enema/impregnation, not so nice.\n\nSitting still or not moving a whole lot, the vagina is a self-sealed, contained unit. The labia can be parted and cleaned and it will still be sealed. If a little bit of water gets in, it's a self-cleaning unit as well. A woman never needs soap or scented products for her vagina ever. Your body creates the perfect PH and if it doesn't, you need a doctor, not a bottle of vagisil. I repeat, NEVER USE VAGASIL. Thanks for coming to my TED talk.",
            "As I know a lot of women can attest (myself included) you can force it in a bathtub if you want, and then go 💨💦 and push it all out",
            "Yes.\nAnd when fillled completely, the woman sinks. \nJust like a boat",
            "I see a lot of no’s but when I go swimming a little bit of water will come out if my vagina a few hours later. Nothing scary or unusual. Maybe it’s different for everyone but nothing to worry about. 😊",
            "Lots of people comparing vaginas to anuses, as if they’re the same thing…",
            "Yes.  That’s why we have boobies, to keep us from sinking.  That’s only if you forget to put in the plug though.",
            "Not really however if you do some activities they can force water inside and cause infections because vaginas are fussy",
            "If one is in bathtub, in a specific position then yes, some water will get in. I never gave it any thought until an ex girlfriend pointed it out like two years ago. Now, I can't unnotice it.",
            "There have been several cases where people jump off high dives or cliffs and die bc of water entering their body at a high rate of speed and rupturing their organs. You’re supposed to cross your ankles before impact and do not relax your core muscles.",
            "A lot of people say no, but I take baths often. Like several a week. Sometimes when I'm in there a long time, I'll get out and a bit of water will pour out.",
            "If I'm in the bath and move a certain way I can feel water kinda go up near there. Not like inside though, but enough that it feels weird.",
            "I was at a resort in Mexico with my partner and I had been playing around in the waves, jumping up and down and swimming in the waves. I got out, rinsed off, got dressed, and we walked up to the beachside restaurant and waited to be seated. \nThat is when the specific angle was reached that let loose about a cup of water straight onto the floor that was definitely seawater and not urine.",
            "*walks in, walks straight back out",
            "I mean it’s usually pretty closed up but if you sit a certain way or purposely open it up or like, squeeze it in with your pelvic floor muscles, then yeah I guess some gets in there",
            "Isn’t that why women are such faster swimmers? 🏊‍♀️ propulsion hahaha",
            "It’s how women are able to swim. They use their vaginas like ballast tanks",
            "We have flaps. Kinda like a sugar glider",
            "OP: The question you should be asking is whether that vagina is comfortable if water goes inside.\n\nHere are the facts: \n\nSwimming or having a bath doesn't fill a vagina with a lot of water, but it can be problematic for a vagina anyway.\n\nBe aware that water with chlorine from the pool/hot tub or bubbles in the bathtub *can* irritate the vagina and initiate a yeast infection. Also a woman wearing wet swimsuit bottoms for an afternoon can cause this problem.\n\nTo add, having sex in a shower, hot tub, spa or pool increases a woman's risk of having inflammation in her vagina that can lead to pain or a yeast infection. The water plus friction during sex will remove the lubrication that her body naturally has otherwise.\n\nHaving penetrative sex in water can lead to discomfort for her that lasts a week or two after that moment. Her pain and discomfort will prevent sex until she feels better.\n\nGet out of the water and find a better place to get it on.  \n\nSorry for the long answer but yes, water can enter a vagina but not fill it completely.",
            "After reading the replies I think this is definitely not a stupid question. \nWe men were sure that all those candles and bath salts were some sophisticated relaxing techniques. Turns out you ladies are playing whales' blowhole vag games.",
            "Ok, so imagine that the vagina is a tube. Like, the neck of an unfilled, untied balloon maybe.\n\nThe way it's usually positioned, it's kind of tipped up on itself. Like, if you tilted the balloon neck at an angle, so opening ring is pressed flat against the inside wall of the neck of the balloon. So you can touch the inside wall without reaching inside.\n\nIf you put that underwater, it's not going to fill up with water. It's basically sealed shut.\n\nAlso, unlike a balloon, the vagina is a really strong muscle, like a fist. It's not as definitive as a sphincter. But it's going to want to stay closed most of the time.",
            "Does your asshole fill up with water while swimming or taking a bath? No",
            "I came into this, as a woman, thinking no of course not. But apparently, some can??",
            "You are really pushing the validity of the title of this sub....",
            "Sometimes. Generally the pelvic floor muscles will keep it shut as they do most of the time. But one can actively relax them and even suck water in by pushing the muscles downwards and then tensing them back up.",
            "my first reaction was think \"does your penis' fill up when in the bath\"\n\nthen I realized that I had no idea despite being a cis male\n\nhalp",
            "It can if I suck it up there.  Then, I queef water. Feels good",
            "I shed a tear laughing at this question.  Thanks.",
            "Water does get inside yes. Which is why for girls and women it’s so important not to bathe in an unclean tub or in water that can cause problems . It stays up there and falls out throughout the day after for like an hour",
            "Yes, and if you force it out you can swim extra fast.",
            "I am picturing jet propulsion like a squid or jellyfish now…",
            "Yes, but vaginal belching AKA queefing helps to expel the water.",
            "This question is too innocent, it's almost precious.",
            "Absolutely! Then we can squeeze our boobs and the water shoots out. Super-soakers got nothing on the female. Lol",
            "Won’t fill up no, sometimes water does go in though. You can use your vaginal muscles to sort of, suck the water up and shoot it back out haha. But I’ve had it before where some gets sucked in then like an hour or so later when I cough it comes shooting out",
            "Lol this was asked already in this subreddit",
            "Man after reading all these comments, my brain is constantly doing that \"pornhub: WRITE THAT DOWN\" meme in my head",
            "Dude!  I just learned that sometimes they fart when sitting down and it goes in their vagina!  Mind blown.",
            "Related question I suppose.  If a woman is on her period, should she be concerned about swimming in the ocean?   Can that attract marine predators like sharks?",
            "Pre-child no. After-child it’s like a fucking swimming pool in there",
            "Sometimes when I get out of the bath, not necessarily right away either, I will feel up to around 1 tbsp of water just flow out at once. Its not the same in a pool of hot tub because you are not laying horizontally immersed in the water.",
            "It can go in with the right type of motion, (or force as many have pointed out) but it's not really just an open hole, more of a slit/opening that is usually kind of 'closed' in a manner of speaking it doesn't really have a muscle to close it like a butthole, but it's sort of held closed by the amount of skin in the area. So water can be sucked  or forced in, but it doesn't just fill up like an open tube.",
            "After reading a few comments, I'm sad to report that I have a standard issue vagina that unfortunately didn't come with this spray or fountain add on :(",
            "[deleted]",
            "Does your colon fill up with water?",
            "Oh sweetie… no",
            "I’ve done it for fun!",
            "Follow up Question: “How many cups of pussy do women have on average?”",
            "Nope, but dicks float.",
            "Bruh if dicks could soak in water we be having super soaker fights  ngl",
            "This is why we need better sex ed.",
            "We need better sex education in schools.",
            "Not exactly what it does do is when I'm heavily bleeding and go into a pool or bath it stops the bleeding",
            "Askreddit has the daily \"sexy people of reddit what sex did you sex and how much sex was it\" meanwhile NoStupidQuestions gets \"does your vagina fill up\"",
            "This sub is not a competition.",
            "Most of the time, the entry way to the vagina is closed via the labia majora. Now, movement etc can open the labia majora and water can get in between the folds, but it won't actually fill up the vagina canal. It's kinda like a sphincter, it's pretty closed at relax. That's why tampons don't just fly out.",
            "Yes. They use it for propulsion like a jelly fish",
            "Usually it doesn't, the vagina is pretty tightly closed to not allow this unless force is used or you move a way that opens it orrr you actively are trying to do it. Just like how women queef, you don't actively have air in there all the time unless the same happens. I don't know if this makes sense.",
            "What a post to be reading at 6am",
            "Does your asshole fill up with water?\n\nYou can get water inside, but you would have to open the vagina to let it get in, and even then only with certain angles. \n\nThe labia and hymen close the vagina opening, so no, water wouldn’t normally get in. But if you open up the labia and point your vagina upwards, move your muscles a bit, water can definitely get sucked in.",
            "It can if we pull the water in. A lot of it depends on muscle tone in the pelvic floor. If you’re really talented you can shoot it back out, too. Forbidden Fountain. Lol.",
            "This thread full of amazing women now makes me wonder if I can suck in water through my peepee",
            "Does your pee pee hole fill up with water?",
            "No. \n\nSide note: yk how when someone's vagina is up in the air and they spread their legs some air _can_ get in there? I guess if this same position was repeated under water there is a chance that some water gets in there. \n\nAltho this has never happened to me, and I have a vagina and I also do swim often. \n\nHaven't even happened when I would so rolls under water.\n\nBut it's not like everyone's vaginas are just like mine so I assume there is a possibility for a little water to get in there.\n\nIn which case it would be pushed back out right away as soon as any of the muscles in the surrounding areas are used."
        ]
    },
    {
        "post_id": "1521n5o",
        "author": "Mister_McGreg",
        "title": "Why do companies not understand that oversaturation of their ads makes people hate them?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/1521n5o/why_do_companies_not_understand_that/",
        "score": 14206,
        "num_comments": 1989,
        "created_utc": 1689599619.0,
        "selftext": "It happens often enough that my wife literally keeps a list of stuff we are boycotting because their ads are just too pervasive.\n\nCurrent example; we watch quite a bit of YouTube, and right now pretty much every unskippable ad is for Disney's new Haunted Mansion movie. Now, I initially had no interest in this movie, but if someone asked I'd have been all \"yeah, sure, let's go watch the dumb movie. I like Danny DeVito.\". After the last three days on youtube, I specifically will never ever see this movie simply out of spite.\n\nIt wouldn't be so bad if there was some variation, but if you make it every ad break and make it unskippable? No, fuck you, you've taken enough of my money simply through what I pay for internet every month, and I didn't even agree to you taking it.\n\n\nEdit: Apparently I am in the minority where aggressive advertising does not work. I assumed everyone was like me. I was wrong. \n\n\nShoutout to the guy who tried to call me out on using casual french. Desole vous decevoire. Not everybody learns french but canada estum comte as well 🤷🏻‍♂️",
        "permalink": "/r/NoStupidQuestions/comments/1521n5o/why_do_companies_not_understand_that/",
        "comments": [
            "I was in the advertising industry. They make so much money from advertising. I worked with infomercials and you'd be shocked how many people order that crap. I used to sell Sundays at 10:30 am on Fox's NYC affiliate WNYW with a clean lead in for $25,000 each and it was my easiest sale. That means they probably rake in a good 4 or 5 times that amount. The infomercial was that vibrating lap \"exerciser.\" Haha. I also sold overnight time periods for $50. That was the highest bid.",
            "If advertising was counterproductive, a company like Disney would definitely know it by now. They've been doing this for a while. \n\nFor every one person like you and your wife who will boycott the movie because it's advertised too much, there's probably a hundred who are still interested.",
            "Cause it doesn't. SOME people hate them but over-saturation doesn't exist in advertisement.\n\nThe goal is to put their product in the minds of people, so much so that people will just think about them no matter what. Even if it is negative, it's still in your head. That's the point.",
            "I hate Temu because of the ads. Also because they're a terrible company. But mostly the ads.",
            "[deleted]",
            "Advertising isn't done in a vacuum.  It's well researched and understood,  for the most part.   They know that the goal isn't to make you think \"I need to go to the store right now and buy this product!\" It is to make you remember this product when you're in the store looking at six similar products and feeling indecisive. \n\nThose annoying commercials that you get sick of seeing? Those are considered a great success among advertisers because you remember the brand",
            "They do it because it works. Unfortunately.",
            "Download adblocker called ublock origin. Works even with youtube ads and is free.",
            "While some folks will grow to hate something because of too many ads, for most people it just means its on the mind and they're aware of it, so when they seek out a product like the one advertised, the advertised product is likely the one they select.\n\nSo Disney's Haunted Mansion has a sickening amount of ads, and you yourself are being turned off and making a point to not go see it. But what if you have to babysit your little cousin and they want to go to the movie theatre - the only family film you're really aware of is Haunted Mansion. While you yourself may still resent the ads enough you look at your options and weigh them out, but most people are gonna go \"Oh, Haunted Mansion is in theatres right now, lets take my little cousin to that.\"",
            "[removed]",
            "It takes on average a person seeing an ad 7 to 8 times before that person buys.\n\nOversaturation may be a problem for a few people, but the vast majority of people will buy. \n\nI guarantee that Disney is making thousands, if not millions, on their YouTube ads alone for this movie. Even if it alienates a few people, it's well worth it for them.",
            "I might just be weird but this does happen to me. There was a 1 min unskippable ad of some detergent company on youtube. When I next went to the supermarket this same detergent was on discount(only about 1.5 dollars less tho), and I bought another brand just because I remembered that unskippable ad. Its probably just my petty ass tho",
            "Especially adverts which go out of their way to be annoying or cringeworthy. Show me one of those and it's a 100% guarantee that I'll never use or recommend your product.",
            "I pay for Premium which saves me more time. Like if I pay $20 to avoid 4 hours of ads a month it is worth it. For me.",
            "Why do so many people in this sub argue with everyone who answers their question?",
            "Officer: *You are without doubt the worst pirate I've ever heard of.*\n\nJack Sparrow: *But you have heard of me.*",
            "I'm with you on this one, OP. If an advert pisses me off sufficiently I will go out of my way to ensure I never, ever use their products",
            "Your assumption is YOUR. It doesn't apply to other people.\n\nWhen I wanted to start website, the first website I checked to buy domain name was GoDaddy because they spam their ads everywhere.\n\nIf you go out buying something, you will most probably buy thing that you are familiar with.\n\n&#x200B;\n\n>Current example; we watch quite a bit of YouTube, and right now pretty much every unskippable ad is for Disney's new Haunted Mansion movie. Now, I initially had no interest in this movie, but if someone asked I'd have been all \"yeah, sure, let's go watch the dumb movie. I like Danny DeVito.\". After the last three days on youtube, I specifically will never ever see this movie simply out of spite.\n\nYou said yourself you were never interested in the movie. So, it's highly likely you wouldn't have gone to see it anyway. Also, I never heard about this movie before so you give them free publicity. It's win-win for Disney.",
            "If that hatred was really long lasting, your wife wouldn't need to keep a list of the companies she boycotts. \n\nWhen I had Spotify without premium couple months ago, I swore that I won't ever give my money for those companies which had super annoying commercials and which I had to constantly listen, but guess what. I don't remember any of those adds or the companies anymore. That's what happens to most people. They're irritated for awhile, but they will forget it soon and then buy those products anyway if they need or want it.",
            "Maybe because, as Jack Sparrow said \"But you have heard of me.\".\n\nIn other words : better saturate the market and be known by the customers rather than being forgotten.",
            "Because on average, that's wrong. They do the ads like that because it works.",
            "I haven't been to Burger King since they started their new ads with people singing in monotone. Getting close to 2 years I think.",
            "Yeah, it's a funny quirk of how ads work.  The ad space is sold based on views.  There is no feedback to the product company that their ads are hated.  Separately the the marketing company has an AI that just looks for buzzwords.  If the buzzword appears in your communications (if you speak it often around Alexa or Google) it trends to the top, and they show you more ads for that term.  The AI does not care if you are speaking in anger because you hate a thing.  So it unintentionally feeds you more of what you hate.\n\nIn my case, I can't afford a house.  That is something I am very angry about, and I have said as much many times.  So the AI happily feeds me all sorts of ads for gutters and solar panels for homes, because it knows those are things that people who talk about houses might want.  This is like an eternal torment, constantly reminded me of things I cannot have.",
            "As much as you may be dissuaded, studies have proven that the excessive repetition works. It's the reason dial soap is so popular. That's the best example I could think of. It's weird psychology, stemming from the work of Bernays.",
            "Ads are so bad on some YouTube channels. WatchMojo is basically UnwatchableMojo now because of how frequently ads are displayed and it's usually two 15 second unskippable ones.",
            "but have you heard the ad is sponsored by raid hand over your wallet legends?",
            "Because advertising is a buckshot, not a precision shot. \n\nIt's about *large* numbers and compounding saturation. \n\nMore pervasive and numerous ads = more people see it (and discuss it) \n\nMore people see it = more people associate that brand/product with the existing need \n\nMore people think a brand/product is synonymous with the existing need = more people buy\n\nOld Spice doesn't need to convince you to buy their deodorant product - that's not what advertising/marketing is (anymore, at least). They just need to make sure that, whenever you think of \"men's deodorant,\" you think \"Old Spice.\"",
            "Because it works for them. Unfortunately most people are stupid and if bombarded enough with the same ads will eventually want said product.",
            "\"I'm Natasha, an underworld doctor. Feeling sick?\"  \n  \nNo. I'm not interested in your damn mobile game with anime waifus.",
            ">It wouldn't be so bad if there was some variation, but if you make it every ad break and make it unskippable? No, fuck you, you've taken enough of my money simply through what I pay for internet every month, and I didn't even agree to you taking it.\n\nI'm sorry, what?  How is Disney \"taking your money simply through what you pay for the internet\"?",
            "Peak internet: rando on Reddit professes to know more about marketing than all advertising experts in the world combined.",
            "I’m one those people who are able block their minds when they see the word “ads” or “promoted.” I had asked myself to recall the ad just seconds after the videos, and for the life of me I could not remember.",
            "Because it still pays off, hate them or not.\n\nYou may despise the product and talk loudly about how you hate it; at the same time, you plunk down your money for it.",
            "I don’t think I’ll ever go to Burger King again. I just can’t after WHOPPER WHOPPER WHOPPER WHOPPER",
            "Your entire post is an ad for Disney's new Haunted Mansion movie. So good job I guess.",
            "Yeah it's not about convincing you to buy their product right now. It's about reinforcing and legitimising their product so that later on when you are in the market for whatever it is, that thing is familiar to you, and stands out over some other option that you've never heard of.",
            "I have boycotted Tide for life because they had the worst Pandora commercial ever.  I was a life long customer. I even boycotted the entire company.",
            "I am the exact same way. Interrupt my video, music, movie, tv show, or whatever I’m doing? Especially if I have to see/hear the same ad over and over and over and over(looking at you, Pandora)? I automatically hate your product, your company, and everything your company has ever stood for. I get that it works on people, but if you’re constantly playing the same annoying ad over and over and interrupting what I’m trying to do, I will 100% never but your product. If I happen to he in the market for what you’re selling, I will specifically go find a different company to go buy it from. Stop shoving the same handful of annoying ads down my throat.",
            "If anything you should boycott Youtube then..?",
            "It happens to you but for the majority of people their existence is mandated by advertisements and social influence, because their brain is more or less flatlined and some influencer curated videos will rewire it to make them go places and spend money.",
            "I can gloss over ads pretty easily and the odd time I have sworn off a product for too many ads it has been forgotten about since there are so many products advertising as much as they can it requires dedication which I don't have to keep a list.    \n\n\nHowever just because I can gloss over ads does not mean they don't effect me.   It will likely ping my subconcious when I look at a list of movies and one I have seen ads for would likely stand out more, even if I couldn't remember the ad.\n\n&#x200B;\n\nI can't imagine many people keep a list but many people gloss over adverts these days and you want to get through to them.  Anyone who thinks they are immune to advertising is likely wrong.  They just aren't going directly off the advert but it is creating an association.",
            "HEAD ON, APPLY DIRECTLY TO THE FOREHEAD!\n\nHEAD ON, APPLY DIRECTLY TO THE FOREHEAD!\n\nHEAD ON, APPLY DIRECTLY TO THE FOREHEAD!",
            "AdBlock EZ",
            "Make a couple enemies to gain a following of friends",
            "Because it works. You're literally promoting Disney right now. Any advertisement is good advertisement.so they succeeded in getting in your head / getting you to talk about it",
            "You still go to YouTube and they still get that ad revenue 🤷‍♀️",
            "Ad blockers are your friend",
            "The marketing/advertising industry is massive and they have their methodology down to a science.  You don’t know better than them, despite how much you think you do.",
            "Well those ads got you to make a Reddit post about them, so I guess they worked",
            "Perhaps because you and others who agree with you (x amount of ads causes you to hate the product) only make up a small percentage of the audience the ad reaches. The remaining percentage, which is a profitable amount, go on to watch the movie.  So why would companies not continue this strategy, especially if they ran other tests and found this to be the most effective?",
            "Marketing major here. Mcdonald's did a test in a market when they stopped advertising like crazy. Sales dropped 30% in the first month. You think these major brands wouldn't need to advertise so much, but they do. There are lots of examples we learned about. Coca Cola too.",
            "I always though this way.\n\n\nEven if you hate it, you DO remember it and name recognition is what matters",
            "Why aren't you blocking them?",
            "Because more often than that, it works.",
            "The point of advertising isn't to make people immediately go out and buy it (though some do), it's to make their product the \"go-to\" option when you need something like that. Say, for example, you need a window replacing. Despite me not necessarily being likely to use them, I can tell you that that stupid advert with that weird fucking hobbit-like guy from Safestyle UK comes to my mind despite me having negative appreciation for shitty adverts. That's the point of it. For that purpose, saturation is good.",
            "When I worked in advertising a good \"click-through\" rate was something like 1%.  So if the ad is delivered 100 times, 1 person clicking intentionally (not clicking and then immediately going back) was decent.  I can't remember what the purchase rate was, but it was a fraction of 1%.  To get a good return on an ad, it needs to be delivered thousands of times, so it will get delivered thousands, and thousands, and thousands of times.  Usually many times to the same people to keep the idea of the product in your head.\n\nAs a married adult who has interests, I assume you also fall into multiple demographic categories they are targeting (adult, old enough for children/grandchildren, possibly at least a passing interest in either Disney or an actor in the movie, high enough income to have disposable money for movie tickets, etc).",
            "It is not the ad companies that dont understand, it is you who does not understand. Advertising is probably the most advanced statistical science there is. They adhere to advertising algorithms that will make them them most money.",
            "Yet here you are, advertising the movie on Reddit.",
            "They understand it well enough to use it deliberatly to make you mad. This way you're much much more likely to mention their name and why you hate them so more people hate on them. This is very effective and they earn more money this way.",
            "This message is brought to you by RAID: SHADOW LEGENDS!",
            "I feel this in my heart. It's like an act of defense for my autonomy. If something insists that it should have my time in such a fashion, it is the last thing I will allow. I feel strongly about this.",
            "I hate Geico with a passion now",
            "I absolutely hate this as well.  It could even be an item I am interested in the first time I see the add.  But when I'm scrolling through facebook, and I see the add for the umpteenth time that day.  I will change my mind and blacklist that item.",
            "Companies don’t buy ads. They hire companies that hire companies that hire companies that hire companies that, after many such iterations, buy ads. No-one at a company might even know that “Dave’s old-timey blog and fish ranker” exists, but some algorithm will fish out an ad from a giant pool of them and place it on the site.",
            "Makes me feel better knowing other people are as pathetic as I am when it comes to boycotting companies for their annoying ads.",
            "I'm the same the more i see an advert the less i'm likly to buy the item in it.",
            "even if we’re in the minority, i’m just as stubborn about advertising as you are. i absolutely refuse to watch/buy/consume whatever it is that’s getting pushed heavy onto me. only exception is if it’s something i was already independently looking for with no luck and then got it advertised to me but that almost never happens. the amount of big social media trends i purposely missed out on because i was annoyed that they were everywhere is stunning to people lol. i’m with ya OP: aggressive advertising is a turn off for me",
            "I feel the same way you do. If there’s unskippable ads, i don’t watch it. We still have directv for some ungodly reason and i won’t watch anything live. DVR or not at all! I never watch youtube and pay extra for ad free streaming services. I just hate ads so much.",
            "I love the AD's on my phone where they have found a way to max the volume while I was doing something at a reasonable volume and it's so loud my ears bleed.  That's the best!  Sure way to make me never purchase anything from you.",
            "Because it works. Math doesn't lie. If you show your ad to people enough times, they may end up actually watching the ad, and they may end up convinced the product is a good match for them.",
            "I totally agree with you, the more I see ads for a product or service, the more I dislike them and will actively avoid making a purchase.\n\nThe part I see is crazy, is they'll spam ads, for things you can't even buy locally, or things that 89% of people can't afford, like $69,000 trucks.",
            "easy, its a numbers game. the amount of people whom get baited and buy the shit the ads sell outnumber the ones annoyed enough to refuse or discontinue the product / service\n\ntldr: they do it cause it works",
            "Saturation advertising works.",
            "Tui; gambling; music from manufactured bands, rap or dance; Samsung flip phone, it’s a phone!! Mute button.",
            "They do it because it works. Your experience is not everyone else's. Have a little empathy.",
            "Oversaturation of ads is 100% the entire reason I use an adblocker and refuse to turn it off.",
            "I’m with you, OP. There are products and things that are so heavily advertised, I want to actively avoid them. I actually went looking for a new insurance company because the number of ads from my previous company pissed me off. I mentioned it to my friend who was watching with me and she said she hadn’t even noticed a commercial was on. I sort of envy her ability to tune commercials out but then I think they’d be working subconsciously.",
            "AKA.. Temu!!!!",
            "Because nobody does what you do, and it actually does work.",
            "Liberty liberty liberrrty.  Liberrtttyy",
            "Can't stand these blatant ads, either. Bet365, I'm looking right at you.",
            "I don't get it either. How does desperately shoving something in someone's face over and over again make you want to genuinely buy the product!?",
            "ha I'm not the only one anymore!!",
            "My rule is if I see a brand with a shit ton of advertising, their money is going to that and not the actual product/service. Pass",
            "I’m with you brother, anyone who says otherwise is gullible 🤣",
            "Agree.",
            "I definitely feel this way about some ads. Usually, though, I just stop engaging with whatever service is providing excessive ads. Get an ad blocker or buy whatever premium stops the ads.",
            "You don’t use an adblocker!?",
            "OP I’m going to throw this out there: don’t watch YouTube on your tv and put an adblocker on your web browser. I specifically go out of my way to ensure I don’t see ads. \n\nInstagram and FB is annoying as on my phone I can’t block their ads but I can using my computer. I pay for Reddit premium to never see ads here as I use my phone for most Reddit things.",
            "Just use an adblocker and declutter your life.",
            "Who said they don't understand? They probably just don't care.",
            "The more ads you see, the higher the chance it's nothing special. \n\nIf I see an ad, instant no buy.\nI might, however, find a competitor that's cheaper. One I haven't seen an ad for.",
            "if i see an ad too frequently, especially if it plays twice in one commercial break; i will boycott that product 100% of the time. the company decided to annoy me and insult my intelligence rather than just using the ad $ to make the product cheaper so i vote with my wallet and buy the competition instead. every time.",
            "This is how I feel about Temu. I've tried blocking them on all social media. It feels so invasive.",
            "Bud, you're thinking about the ad right now.\n\nWhen it isn't even being aired.\n\nThey gotcha.",
            "Branding works even if you hate it, you just need to recall/remember it.",
            "Hate is traffic. Traffic is $$$$$",
            "Billion dollar companies have done hundreds of cost benefit analyses to figure out the best ad techniques. They absolutely do work or said billion dollar companies wouldn't spend millions on ad campaigns.",
            "Because you guys are probably in the minority.\n\nI hate ads as well, but I'm too lazy to remember an ad or write it down. Unless it's REALLY obnoxious, meh.\n\nI found I actually don't mind ads too much if it's done well. Like on Disney+, the ads are like TV quality ads, and they somewhat pop-in when there's a lull in the action. Whereas youtube ads is like it pops in right in the middle of a sentence without warning and it's the cheap not even third rate commercials.",
            "I’m apparently in the minority with you, because good god. I hate that shit too. Even car commercials—I will, just out of spite, never get certain vehicles like a Subaru. But movie ads? Yeah, absolutely a huge nope for me. So many movies I might’ve seen but opted out specifically because of the ads.",
            "Use adblock and don't watch tv. The outside world doesn't affect me one bit. Ads suck, which is one of the reasons I'm one of the few people who don't watch tv anymore.\n\nAs for youtube, I don't use it, unless there's something I need, for which I got my ad blocker.",
            "And I avoid visiting your website if you have eleventeen popups and your 17 second video is preceded by 45 second of ads.",
            "squatch soap pissed me off so bad, they're not even short 5-10 second ads they're like a minute long and until I started blocking them specifically every ad was squatch soap. I know I'm not a fucking dish and telling me a thousand times won't change anything.",
            "Me and my friends have a rule. We stop using products that have unskippable adverts on YouTube. \n\n&#x200B;\n\nI dont care if its a compelling advert or an excellent product, if you make ads that can not be skipped and i am forced to watch them again and again, we will Never use that product in the future.",
            "I’m the same exact way, I hate the commercials that play during every single break or the commercials that play after every single song on the radio or the commercials that interrupt my YouTube videos. Chances are I wasn’t buying what they’re selling anyways but now I just outright hate them.",
            "Cars for Kids. (drop mic)",
            "I'm just like you, if you annoy me and stop me from doing what I'm trying to do, I will *never* use your product",
            "Bombast and Rexfinity must d*e*.\n\nThat is all.\n\n*Not literally, but you know what I mean.",
            "I, also, am so sick of ads it makes me wanna puke. I've said for years I'll never play raid shadow legends, simply *because* of it's super aggressive ad campaign. It's gotten to the point where I'll ignore any ad that comes on. Radio: change station or turn off. I won't watch any TV or movies unless it's on my pc, because my ad blockers stop the worst of them, and I ditched Hulu completely because their ads started getting through those ad blockers. I've just had enough.",
            "Don't believe the idiots. No, \"you hate the company but actually you remember the name so you're more likely to buy it\" doesn't make sense. In the 2016 election, Democrat ads made people _less_ likely to vote Democrat. Most advertising is based on shitty statistics, and simply doesn't work at all. Advertisers are idiotic out of touch salesmen - better at selling their _services_ than any products.",
            "Because some dumbass in marketing said, “OuR CoNsUmErS gOTtA sEe ThE aD 3 tImEs BeFoRe ThEy’Ll BuY aNyThInG…”",
            "Same here. I even block every single promoted post or ad with a page on twitter and FB when I can. I don't want the ads, I don't need the ads, I hate the ads. Advertising like crazy makes your brand an instant boycot 🤷‍♂️",
            "During my junior year of college, Charmin had a particularly annoying ad that played every day on my ride to/from work. It didn’t matter if I listened to the radio or Spotify-everywhere seemed to be advertising their toilet paper. After a particularly rough day at work the ad started playing when I turned on the radio, I finally snapped and proceeded to look up Charmin’s contact information. I sent them a lengthy email and utilized almost every persuasive tactic I could think of in a desperate attempt to convince them that this ad was making no one want to buy their product. I then proceeded to buy Spotify premium because I couldn’t take it anymore. Today, I’m a very loyal customer of Angel Soft toilet paper.",
            "This is an incredibly good point. Why are we paying money for someone else to give us an ad. That's like tipping the post man for junk mail.\n\nEmails are one thing. Same with non intrusive ads. But the whole reason ad blockers exist is because there are so many ads that we can't actually use Internet services now.\n\nThere needs to be laws for ads. No unskippable vids. In fact, no vids at all. You can play a vid when a link is clicked. None of those ads that are a huge square box that you can't click away that scrolls with you as you scroll down.\n\nGo back to when ads were just on one side bar and they took up like 10% of the screen.",
            "This post in itself is proof that ads work.",
            "Because the ads are targeted toward sheeple who believe the ads. And they work, as proved by companies getting richer and richer.",
            "everyone's shittin on u i think ur right. all cuz saturation is how advertisement /has/ worked doesn't mean that's how it /will/ work",
            "The Ad and marketing people know a lot more about how much this works than you do. \n\nYour experiences is not representative of the overall population",
            "they have the product living rent free in your head, looks like the advertising worked",
            "I didn't even know about the movie til you posted this so the ads worked.",
            "I mean, here we are, talking about a movie I haven't heard of. I'd say their marketing has worked tremendously well.",
            "Why do people not understand that companies have armies of professionals who analyze this stuff full time and they have a much better idea of what works than you do?\n\nYou *may* be right that it doesn’t work on you (although people are bad at knowing their own susceptibility to advertising). But if so, that means you’re atypical.",
            "Why do companies not understand that ~~oversaturation of~~ their ads makes people hate them?\n\nFIFY!",
            "bruh, the real world is gonna hit you like a ton of bricks. people LOVE advertising. have you seen times square?",
            "it doesn't. it has the opposite affect. its why Budweiser still spends a fortune on advertising and its ubiquitous with cheap beer.",
            "Just get YouTube Premium. That way, you don't have to see ads and you might not cry about shit like this.",
            "because it works on the majority of people. ever seen the average iq? i’m not trying to be disparaging but it’s closer to that of developmentally disabled persons than it is to what’s considered “smart.”",
            "I agree with you 100%",
            "I hate all ads. \nListening to a radio station, ads are coming up I switch to another station or turn the radio of/start listening to mp3.\nTelevision, ads are coming up, sound is turned off, switch to another channel, go to the loo or...\nAds on internet (Reddit), just scroll through. If you would asking me what have you seen? Answer would be: ?????\nAds and advertising industry is destroying the planet. \nIt should be forbidden completely, it's worse than harddrugs.",
            "I know this won’t get seen but… \nI am an advertiser’s worst nightmare. I would mute every time the TV went to commercial. We don’t even have DirectTv anymore. Mostly because it’s the same crap just reloaded on every channel. I almost never watched the alphabet channels. Now I’m force to watch ads on YouTube because I can’t get an ad blocker on a Tv. You can bet the bank I have as many ad blockers as I can get on my computer. I’ve even stopped watching some channels that started having ad content in the videos. Yes they need to make money but I don’t want it shoved in my face. I don’t want to waste my money on worthless crap that will fill up my house. I already have a hoarding problem with 4 generations of family stuff in my house. \nAmerica and the World need to stop using fast fashion and useless products that are designed to fail. We have one planet and we are killing it. This record breaking heat isn’t just a coincidence. Humans caused it.",
            "Who watches adds on YouTube???? User Firefox and Ublock Origin Addon!",
            "I despise when people text me three times without me responding and feel the same way about ads. Now I want NOTHING to do with you/your product.",
            "I am completely with you. There are films and products to this day I will not patronize after they saturated me 10 or 20 years ago.\n\nThe current product I will never patronize is Claritin. I am so tired of their “it’s the most wonderful time of the year“ ad that I will use anything else for the rest of my life.",
            "Because even if you hate them, you've still HEARD about them.\n\nThere is no bad PR. Companies learned this when they got shamed hard for their policies mainly in Africa. Marlboro for instance made a huge profit after people learned about them giving out free cigarettes to children to get them hooked and then hiked up the prices for those already poor and hooked. People were appalled but they gained reputation and are still a market leader when they should have died long ago. Same with companies like Nestle and other such huge companies.",
            "My kind of petty. I don’t know if I’ll ever need my cash now, but I’m not calling jg wentworth for it."
        ]
    },
    {
        "post_id": "d4jnbz",
        "author": "lamarcus35",
        "title": "How are some people able to understand a language, but they aren’t able to speak it?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/d4jnbz/how_are_some_people_able_to_understand_a_language/",
        "score": 14203,
        "num_comments": 926,
        "created_utc": 1568549519.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/d4jnbz/how_are_some_people_able_to_understand_a_language/",
        "comments": [
            "It's much easier to understand a properly constructed sentence than it is to build it from scratch. Rather like IKEA furniture, you know a chair when you see it, but it's a lot of work to build it when handed the box of parts.",
            "They're different skills. To understand a language, you only need to be able to think of what a word means when you hear it. To speak it, you need to be able to remember words and say them when needed",
            "For as long as I can remember, my parents would speak to me in Cantonese and I would reply in english. When I try to speak cantonese I apparently sound like a retarded child",
            "Have you ever gotten kind of ok at playing an instrument? You know the main chords a few tricks and some of the theory behind it, but ultimately you'd struggle to get through anything beyond a basic song.\n\nWhen you see someone more skilled on that same instrument, you understand what it is they're doing and how they're doing it without being capable of doing those things yourself.",
            "Listening in passive and speaking is active. You have to know much more about grammar, vocabulary, colloquialisms, etc. to be able to say anything rather than having a simple grasp of each to merely comprehend a language.\n\nI travel a lot, lived in a 3 different countries on the past 12 months. I'm \"good at languages\" in that I pick them up quickly but never stay long enough anywhere to be conversational (given that learning the local language isn't my focus).\n\nI've almost got it down to a formula and I can understand 10-20% of what is said after a couple weeks if I'm trying. Even then it takes me months to say the most basic things the proper way. By then I can understand the topic and different options in a conversation between native speakers even if I don't understand exactly what they're saying. Even if I was completely fluent I will never know the _perfect_ word for all situations",
            "I probably should have specified, I mean when people can fluently understand the language like a first language but can’t even string together a sentence.",
            "[deleted]",
            "Language has 4 broad skills: Reading, writing, understanding and speaking.\n\nAs incredible as it seems, there used to be people who were able to read and not to write and vice versa, also the first one being more common. The same happens with speaking and listening comprehension. Speech Produktion mainly happens in another part of the brain than speech procession, we call them Broca and Wernicke Areal. They're even located in opposite hemispheres of the brain.",
            "My boyfriend understands but doesn’t speak his parents language. \n\nHe says “it’s like a math problem. You can see it completed with the solution and understand it, and see the process in front of you. But starting with a problem and finding the solution yourself if much more difficult. You have to complete each step by yourself instead of using the cheat sheet.”",
            "Understanding is passive, while speaking and writing are active. Much easier to get on board with passive skills than active ones.\n\nAdditionally, if you have the vocab but limited grammar, you can often guess what things mean from context. If you have the grammar but limited vocab, you can often guess what things mean from context. But struggling with either of those components makes creating the structures you need very difficult. It's easier to mask gaps in one's understanding when listening/reading than when speaking/writing.",
            "Just spent 2 weeks in a Spanish-speaking country and this is exactly where I am with that language. I only know the basics of Spanish, but I know English and some French, so it's not hard to figure stuff out.\n\nFor example, I might have no idea how to say \"bottle of water\" in Spanish, but if I see the phrase \"botella de agua\", well, I know in French \"de\" means \"of\" so that's probably the same, \"agua\" sounds a lot like \"aqua\" so if the context makes sense it's probably water, and \"botella\" is close enough to \"bottle\" and that works as a quantity water might come in.",
            "Why can you recognize the Mona Lisa but not draw it?",
            "Personally I was always bad at speaking languages other than English due in part to embarrassment and anxiety. I didn't want to sound stupid to native speakers so I'd overthink... And sound more stupid in the process.",
            "I think it has to do with recognition being easier than recall. The same way a multiple choice test question is a little easier than fill in the blank. It's easier to choose the correct answer from a lineup than to come up with the same answer without a cue of some kind. This is why toddlers understand what you're saying before they are able to carry on a conversation and why I took several tries to just barely pass French even though in my first semester at it I felt like I understood it but somehow couldn't show I understood.",
            "Because for most people reading, writing and listening are much easier than speaking. That’s why language exams have four parts.",
            "If you speak a Romance language this will be pretty much the case, particularly between Spanish, Italian and Portuguese. As a Spanish speaker I can understand 70% of spoken Portuguese and 95% of written Portuguese, but I am sure as hell I can’t speak or write correctly in Portuguese. \n\nThese languages are close enough to be understood, but you will have to familiarise with an entire new set of rules to speak it or else you’ll end up speaking the very famous portuñol/portunhol variant.",
            "It's my actual problem. I Learned english in school, some time after I started watch youtube in english with subs, now i can watch TED talks and understand about 90-95% of info. I'm 29y.o.  My only teachers are youtube and videogames now. I never spoke with real english-speaking person and it takes time for me to choose words to express my thoughts. It's because of total lack of practice. I recognize many phrases and words but cant fluently combine them, because i have no such trained habit in my brain. All this years(about 12 years after school) I only read and listen to english speeches.\nThat's my 1-person view to the problem. Hope someone will find it useful. Greetings from Russia :)",
            "Coming from personal experience, the only way I can describe why is because it takes more brain power to think about the words I need to say in that language. I already like to plan out my sentences in English, but the added difficulty of trying to translate what I mean (plus the anxiety of getting it wrong) means I would be there forever trying to figure out the right words. But I've always been around the language, so I know the words and if I don't I can usually understand the context of the rest of the sentence to make my way through my response in English. Honestly though a big personal part of it is my anxieties, I suck at speaking my native tongue, I really don't want to completely fail at speaking what should be my second language.",
            "Mandatory boring teacher response: receptive language always develops first.",
            "My husband is Hispanic and everyone in his family is either bilingual or Spanish only. I understand it but sound like a goddamn idiot when I try to say more than basic phrases. So I just sit there and smile and nod like an idiot when anyone speaks to me. I find people fluent in 2+ languages fascinating.",
            "How can some people talk, but not write?\nIt's 2 different things connected by some common features.",
            "I can't remember the words until I hear them, man",
            "What helps me is context. When it’s about lunch time, and my Portuguese grandmother says something about lunch I’d assume she’s calling me to eat",
            "What a great question. I'm like a Star Wars character, people ask me questions and I answer in English. I'm better at reading, but bloody awful at saying anything fancier than 'please give me....' and virtually useless at writing.\n\nI think there must be some cues that are picked up on, such as body language, context etc, as well as memory being better at recognising things than recalling things. Sometimes I have conversations with the cleaning lady or cook and we are both speaking different languages. They get what I'm saying, to some extent, and I get what they are saying, to some extent. Random old folks in my neighbourhood too. Sometimes they'll say something I've never heard before, it's not magic. A sudden topic change is also jarring.",
            "My parents spoke to me in Czech I replied I English. \n\nHence/ergo/therefore I can understand pretty well but with no practice speaking I am almost unable to construct a complete sentence.",
            "The ear can pick up on the subtleties and differentiate things without too much work, but the tongue takes years of practice just to pronounce R differently.  Lots of languages have sounds that English doesn't bother with (Arabic and ع for example) and it feels unnatural to bend your tongue into that part of your mouth.  First few months of learning you probably won't be able to pronounce half the language's vocabulary.",
            "Understanding and speaking are done in different parts of the [brain](https://thebrain.mcgill.ca/flash/d/d_10/d_10_cr/d_10_cr_lan/d_10_cr_lan.html). You need to train for all of them.",
            "I'm too late to answer this, but your question has a pretty neat neurological answer. There are two separate well knows parts of the brain each responsible for different language skills. Wernicke's area in the brain is responsible for language perception/understanding, while broca's area is responsible for language production/motor. A person can actually lose the ability to use one or the other because of physical trauma to the area while not losing the other and develop either wernicke's aphasia or broca's aphasia. Additionally, children can grow up to have developmental problems in one area but not the other, and when a child has a hard time talking in early age they will test to see if it's a comprehension problem or a language production problem (or mutism or hearing problems or intellectual problems, etc, but never mind that). \nAlso, it's shown that people's first and second languages often physically utilize different parts of the brain. \n\nIn general, to get better at speaking a language, one must use it. Anxiety or just lack of people  to speak a language to can deter a person from practicing, presumably underdeveloping their Broca area for their secondary language. Usually being immersed in that language and forcing yourself to speak it will help you learn it fairly quickly.  As a personal example, my parents speak Russian and I understood it fully but had difficulty speaking it in childhood until I forced myself to only speak to them in Russian later on in life and now it's much easier nowadays (although my accent and grammar are probably never going to be perfect).",
            "Knowing what words mean independently is easier than putting words together correctly",
            "When speaking a certain language from a language group, Portuguese in my case, similar languages become easier to understand like Spanish, but I wouldn't be able to come up with a proper sentence",
            "I was in French immersion from k through 12. I never used French after school, so I forgot how to speak it fluently, but I can still understand most if it’s not to fast.",
            "One thing that I haven’t seen others mentioned is the importance of context in language acquisition. We use context and context relevant behavior to help us understand other people’s intentions, tone, and meaning, even in our own language. A lot of the “magic” of “understanding” a language without being able to speak it comes from this ability.",
            "I have three native languages, Italian (from my dad), French (from my mom and siblings) and English (from the places I've lived). I used to be able to speak Italian as a young child but seeing as I only had one person to talk to in that language, I quickly lost it. I still understand it, and when I visit my parents, dad will often be watching RAI or something and unless it's a show in Neapolitan or Sicilian or something I can still follow along.\n\nI can tell you it's far easier to look up in your brain a word you've heard before than to look for the Italian equivalent of whatever it is you want to say. In other words, I can easily remember what *barca* means but don't ask me to say a full sentence in proper Italian because half of the words I need to already remember by heart. The fact I speak French also helps with recognizing certain words.",
            "Maybe they haven't heard the language being spoken, or they haven't had the chance of speaking it often. Other cases are similar languages, give a Spanish speaker a text in Italian or Portuguese and they will understand 70% of it",
            "I used to speak German but when I started to learn English I lost a lot of German. It's hard to remember words but when I watch a German show I understand everything",
            "For me, it's because I used to know french from school, then stopped using it. Now when I see or hear french I have a general understanding of what is being said, but I haven't practiced *using it* for years so I can never speak in coherent sentences.",
            "In school, you mainly learn what words in a language mean, you rarely practice speaking the language as that has to be done 1 on 1. In a classroom that is basically impossible",
            "Prob been mentioned but surely to understand a sentence you need only understand key words like Car and Cost to work out they want to know how much a car costs. However to speak it you need to know many more words like ‘how much does that’ \n\nDoesnt seem like much but when you realise there are usually lots of versions of How, That, etc thats a lot more words.\n\nMight be wrong but thats my take on it",
            "I like this explanation best (For IT guys and such)  \nDude - Do you know how to write any programming langauges?  \nGuy - No.  \nDude - So you couldn't write anything is I asked you to.  \nGuy - Nope.  \nDude - But you could look at code and figure out what it is trying to do. Some easily, so you could eventually parse?   \nGuy - Yeah. I think so.  \n\nThat's how being able to understand a language, but not speak it works.  \n\nThe IKEA example i great, but it does not encompass how I understand certain languages, but can't speak them.  \n\nI do not know I am looking at a chair. But I can parse it together and understand it is meant to be a seat of some sort, with the occasional misunderstanding that it is a couch or a car seat. etc...",
            "Well, let's take a basic sentence (or series thereof I suppose) in English. Also, don't worry, you don't need to read every single point entirely and can skip to the summary at the bottom if you want.\n\n\"Oh hey, I just found it! I've been looking for that forever!\"\n\nYou have to know  \nA) Interjections (might not be the correct term, I'm a bit rusty on my terminology atm). \"oh\" and \"hey\" are just a specific way of denoting surprise, so it's pretty simple, and I think even a fairly new student to English could figure this out because they probably have a direct analogy in their own language.\n\nB) Pronouns. They could have used \"I\", sure, but also \"me\" \"mine\" \"we\" or \"our\". Depending on their native tongue it's possible any of those would make more sense to them to use in that sentence, because they could very well have a specific phrase that means \"I found it\" but uses, say, the first person plural, like \"we\".  \nC) Qualifying statements. Just isn't a super specific word, but in this case it refers to a specific time, but if a language student only learned it in the minimizing sense like you would use in an argument (\"I was just saying...\"), it might not be obvious that they can use it to indicate that something happened recently.   \nD) Found as a verb is pretty simple, but bear in mind not all language are inflected, so they might only have \"find\" and use other words to indicate past tense, or not use past tense at all! This means they have to choose from \"found\" \"find\" \"will find\" (<--- Native language dependent), so they might have to spend a bit thinking on it, but I also think this one would be taught fairly early to a student, so I'll give this one to them.\n\nE) Contractions. If they said \"I have been looking for this\" it sounds a little bit weird to us. It might seem simple, and like there's not that many of them, but to a non-native speaker it's not immediately obvious where to and not to use contractions, and if one even exists for that word combination they just used.\n\nF) Present perfect tense (might not be the right term, sorry). \"I have been\" indicates that the person was actively searching for something for an extended period of time, including up until very recently in the past or even the present, as of that sentence. This is not present in every language, and in one with just a past tense, for example, they might say \"I looked for that\" for example, which kind of means \"I looked for it at one point but then stopped for some reason\", which is a different meaning entirely, and to someone not used to English this could be a very confusing sentence.\n\nG) I think most languages will have an equivalent or analogue to \"that\", but not all languages use the same type of word. For example, in Swedish, I don't understand why they will say \"det är det bra\", or something to that effect, where they will use a word that suspiciously looks like \"that\" twice for no sane reason I can conclude. On the other hand, some languages will use a phrase, like \"it is\" and it basically means \"that is to say\" or they'll use just \"it\" for everything, so someone would specifically have to study how to say \"that\" in place of just repeating the name of the object in question.\n\nH) Forever is an exaggeration, obviously, but I think most people would understand that the speaker is not implying they are an immortal primordial god, but it's still something they might not think to say on their own without extensive study.\n\nI) Word order. Coming from another language, these words could go in any order. They have to specifically study probably about 5-10 hours minimum to understand the placement of each of these types of words in all of these previous entries. \n\n&#x200B;\n\n&#x200B;\n\nSo anyway, that's a lot of stuff even from two very simple sentences. Each of these would take many many hours of dedicated practice to understand, but many times that to learn to say because there's probably two or three different possibilities at least for each word in this sentence, meaning it probably takes three to four times the time to learn to use these properly in a sentence, and take out almost any of them and the sentence will either lose meaning or sound unnatural. \n\nAlso, there's context clues for understanding a sentence, too. If somebody heard \"found it\" and a bunch of other stuff they didn't understand but the person looks happy, the listener can figure out that they're qualifying that statement with a bunch of adornments, and still get most of the meaning of the sentence. If you speak the sentence you have to fully understand every single part of your statement. This makes the gap between speaking and understanding even longer.",
            "My dad is in this predicament.growing up un texas,he understands Spanish pretty well. But he doesn't know how to speak it for the most part. And he doesn't try to because he doesn't want to mispronounce something and make a fool of himself or possibly offend anyone. Not sure how well he knows it these days though. He was around it all the time 20+years ago when he worked in factories with mostly Mexican Americans.\n\nMy friend who's Mexican-American can understand Spanish really well.but she almost never spoke it since she was born in and raised in the states. She's fairly out of practice since moving from California to New York State. About 5 or 6 years ago. But she'd definitely be better at it than my dad if she tried speaking it lmao. \n\nBasically for both of them, it's due to a lack of trying or practicing regularly. Also,I believe neither of them no the full intricacy of the language. It's probably that they understand it in a broken way and just get the gist of it. Think of a foreigner speaking very poor, broken English but you still understand what they're trying to say due to key words and basic context clues. I think that's the basis of understanding a language you cant speak.",
            "There’s no one part of the brain in charge of language. The wernicke’s area is in charge of understanding speech while the Broca’s area is in charge of production of speech. Understanding a language vs speaking a language are essentially two different skills.",
            "There's also certain sounds in foreign languages that our mouths aren't used to making. For example, in German you have to be able to \"roll your R's\". I can not do that. My mouth simply doesn't know how to make that sound. Not that I can understand German either, but even if I learned the language, I would still \"have an accent/ sound funny\" because I'm not able to make those sounds with my mouth. \n\nTo put it another way, some languages have essentially the same alphabet as us but each letter is pronounced differently than in English. And my mouth is hella English and totes not up for the challenge.",
            "The same way you can mouth every lyric to a song as it plays, but be completely unable to sing it alone.",
            "Undeveloped Broca's area (speaking) \n\nDeveloped Wernicke's area (hearing)",
            "I'm currently learning German and while I can understand what someone is saying, I am unable to form proper sentences in order to hold a conversation.\n\nBasically, it's all about context. If I hear \"Kitchen\", \"Dirty\", \"Clean\"  I'm able to piece what the other person is saying together and understand what they're saying.\n\nIf I were to try and describe an issue in German, It would take me a very long time to form the right sentences before anyone could understand me. \n\nSo yes, I can understand a language, but am unable to \"speak\" it.",
            "Because Anime",
            "some people just learn a language by learning to read it and haven't/never got round to the speech part.\n\n&#x200B;\n\nAlso because speech and text are different, think about in your native language how good you are at speaking/expressing youself v how much you can understand. would like to point out that not everybody is a wordsmith in their native language, so when they learn a new language they aren't suddenly going to become great in the second+ language, it's probably going to be even harder, espcially than with someone who is just good with words.",
            "As someone who understands Italian, but can't speak it, I've always explained it this way.\n\nI don't remember the words on my own, but I recognize them.\n\nSo if you asked how to say apple, I wouldn't be able to tell you. But I could tell you what it meant if someone asked for a 'mela'.",
            "If I asked you to name every state in the country, could you do it? (Maybe you could but lets just acknowledge most people can't).\n\nBut if I told you the name of a state, could you confirm whether or not that is indeed a state? You probably could. I could list every state and you would probably notice immediately if I made a mistake.\n\nIt's a lot easier to convert words into meaning than the other way around. Words only have a few meanings, but your thoughts have a lot of associated possible words.",
            "I can understand Spanish at a native proficiency level. I can speak what I call, cave man Spanish. It is my down fall.",
            "It requires more thinking to speak it than it is to understand. I work cashier and I get a lot of Spanish speaking customers and I can’t communicate back to them but from my three years of Spanish I know enough of what they’re saying to help. I just reply in English usually and they tend to get it",
            "My native language is English. I speak French fluently and okay-ish Spanish. When I started university I took an Italian class and to  determine what level class you took, you had to do a quick online test, a multiple choice thing where the result was instant.\n\nI'd never done Italian before, but with my mixed knowledge of Spanish and French, I managed to get a grade on the test that would have put me in the equivalent of a third year Italian class. \n\nI ended up taking two semesters and dropping it because I couldn't string a sentence together, ironically because whenever I would try to speak Italian, Spanish would come out.",
            "I imagine the same way I can understand what math is I just cant actually do it.",
            "I was trained at my job (prep cook) by an older columbian lady who spoke not a word of english. I cant speak spanish past like hola. However i was never trained as good as i was by her, somehow what she was saying would just click in my head even though we couldnt even communicate",
            "Listening and speaking actually happen in two different parts if your brain. We don't have a \"language center\".\n\nListening requires a functioning auditory system, and interpretation parts.\nActually vocalizing/speaking requires those parts, PLUS the motor part to coordinate the movements of the mouth and vocal cords.\n\nThis is partially why \"mutes\" (sorry if there is a better term that i should be using, I just don't know it) can understand when people speak, but don't do it themselves.\n\nOr Why I understand far more Spanish than I can speak. I often get this jist of convo without knowing all the words - you can't really flip that to the speaking side of things: you either know the words/conjugation/etc or you don't.",
            "Some people have something called  Aphasia.  They understand language but are unable to speak.",
            "Growing up (and even still) my father would speak to me in Arabic and I’d respond back in English, and my mother would speak to me in English. Since almost 100% of the time I’d be speaking only English I never learned proper sentence structure and grammar of Arabic, so now when I try to speak it I try to translate what I want to say literally, using English grammar and sentence structure which is completely different in Arabic so everything ends up coming out all jumbled up like Arabic word soup. My fiancé tells me I need to keep English out of my mind when I try to speak Arabic but it’s not easy. And ask anyone who speaks Arabic, they’ll tell you how complicated it is. It’s not an easy language. There are so many different rules and things that we just don’t have in English, like different forms of words and different sentence structure, different grammar etc. I understand it almost perfectly, I just can’t speak it.",
            "Recognition and production use completely different, unconnected parts of our language centers. That's why programs like Pimsleur tell you to repeat the things you're learning aloud - it's not enough to simply listen.",
            "Put it this way \n\nHow are you able to watch a film but not remember every line of dialogue?",
            "Good question.",
            "It's like instantly knowing the song but not being able to reoeat tbe melody on demand.",
            "In my case i just end up very self conscious. I grew up with my parents speaking Russian, and i have a very clear idea of what russian sounds like in my head. In my head i can more or less create a reasonable sentence. However when i try to say it it always comes out wrong, different form what im used to. I already can't make certain sounds that are used in the language specifically the rolling R. Ultimately i just end up flubbing over my words and getting worse and worse. Once i start messing up the words then grammer follows then i start forgetting basic vocabulary. This makes me want to not speak the language so over the years it just gets worse and worse as i forget things.",
            "Conjugation, mostly. It's more difficult with languages that have 7-8 tenses.",
            "I know two girls whose first language is Portuguese and they said since Spanish is so similar they can listen and break down the words and figure out what they mean but they can’t speak it.",
            "To understand a sentence from another language, you only need to understand a few key words from the sentence said to understand the meaning of the sentence. \nA good example and one that is close to home is Scandinavia. I’m Danish and understand Norwegian and Swedish both spoken and written and so would almost every dane. However if I were to speak Norwegian or Swedish, I wouldn’t know where to start. I would be able to make sentences that would be understood but not correct sentences in any way.",
            "You know when a word is on the tip of your tongue? As soon as you hear it you know what it means but it's a struggle to remember it in the first place? Imagine every other word of a sentence was like that.  You understand them when you hear them, but you can't think of them quickly enough to construct a sentence and say it before the conversation has moved way on.  Incidentally, writing is fine too because you can take however long you need to think of the words.",
            "There are three reasons.\n\n1. You can’t formulate complex grammar but can understand it in context\n2. You can’t remember vocabulary but you can translate into English because they’re either relatively similar or you’re reminded of the meaning upon hearing it\n3. The language has complex tonal patterns which make it difficult to say but you’re still able to understand it\n\nSource: bilingual",
            "I’m getting my masters in Linguistics! I have the answer! So we have a saying in linguistics and language acquisition that reception precedes production. We understand language because we are problem solvers and have developed translation skills and in some cases, a certain amount of fluency, but there are numerous things that can slow our speaking abilities. For starters, there are the Broca and Vernicke ideas that have some contesting, but are somewhat still “acceptable.” Essentially, the part of your brain that processes languages is not the same part that speaks it. So one skill will be developed. \n\nAdditionally we have Selinker’s Interlanguage hypothesis that states that language learners get stuck and fossilized in their language development in order to speak faster and more efficiently, which can prevent proper growth after some time. \n\nThere’s also the idea that speaking involves a great deal more quick action working memory of the language that has far more to do with proper fluency than simply being able to quickly translate in our heads. \n\ntl;dr- we don’t actually know the answer for sure, but the closest we’ve got is that they’re two different but related processes and skill sets.",
            "I'm one of us, I speak \"context.\"\n\n\nMine manifests in a fairly straightforward manner, I rarely fully engage in conversation because background noise usually drowns out immediate sounds.\n\n\nSo people speak with emotions and gestures. Also, in a situation there are only so many possible questions.\n\n\nSo you note visual tells and stress level and intonation. Because you have to engage at this level in most places with lots of background noise the language doesn't matter, you're observing and reacting.\n\n\nBut yeah, you \"grok\" what words in a language you don't speak mean, kind of blows your mind as it happens",
            "Because long story short, that’s how language acquisition works. You understand before you can produce. \n\nA great example of this are infants and toddlers. They understand 2-3 step commands far sooner than they can speak 2-3 word sentences.",
            "Taking Chinese as an example: I could look at a string of characters and get a good idea of what they're talking about. There's zip to tell me exactly how everything is pronounced.\n\nI also lack the language skills to \"creatively\" build a sentence: my sentences are limited to \\[noun\\] \\[verb\\] \\[noun\\], possibly with adjectives. If I'm feeling particularly confident, I also know the words \"because\" and \"therefore\", which makes me sound like I know more than I'm letting on.",
            "I can hear and understand,  but I lack the experience and skill to pronounce the words or to put them in the right order.",
            " I took Spanish in high school and took almost enough credits for a \"minor\" in French in college. I married a woman from France.\n\nI learned \"formal\" French, (it was for an International Business major) and picked up some slang from my wife and the classes.\n\nMy French ex-wife spoke perfect textbook English when I met her, but since I'm from the Southern US, she had trouble understanding me and especially my family. \n\nThis was 30yrs ago. Written French, (books, magazines, instruction manuals, etc?) No problem, for the most part. Order food, buy tickets, sure, no problem. Speak to people on the street? Ok, I get most of what they are saying but really at the end of the day I can't carry on a day-to-day \"real world\" conversation in French.\n\nSo, I can read \"formal\" French, get the jist of most conversations, but to actually speak to a native in the sense of meeting someone in the street, it's more of a \"where is the library\" French one kind of convo.",
            "Receptive language skills develop before expressive. It's also why babies can understand and respond appropriately to simple statements and requests  (\"no,\" \"stop,\" etc.) well before they can speak.",
            "Lack of deep knowledge and practice.\n\nI learned Dutch for years, 2x more than English.\n\nI never practiced Dutch, never spoke it regularly, never used it, but I do use English almost every day.\n\nSome people say that you need to think in the foreign language when you speak it if you want to be fluent enough, and somehow I find myself in that description: When I speak English, I think in English.\n\nBut for Dutch, I forgot quite a lot of vocabulary and grammar rules, so when I try to think in Dutch in order to speak Dutch, at some point a forgotten word or grammar rule makes my mind stutter, then pause, and then it switches to English\n\nStill, my knowledge of Dutch is more than enough to understand the vast majority of what I hear or read.",
            "Well idk about other people but i had alot of trauma growing up and refused to speek spanish but i did learn it so i can understand it just fine but i cant speek spanish.",
            "I understand alot of Spanish. However I can't speak much of it. I took Spanish for 6 years. Alot of it was lost for me when I didn't speak it for a while but I can understand enough to get by.",
            "I’m Hispanic and my first words were Spanish but since I was born in the states my parents wanted my siblings and i to fit in so we worked more on English. I’m 22 now and can barely speak Spanish but I understand it fluently. My parents speak to me in Spanish and I speak to them in English and there’s rarely a time where there’s confusion in what we mean. I’m not really sure how we ended up this way as I used to be able to speak more Spanish, but it works for us",
            "Some prople have limits",
            "Just like multiple choice is easier than fill in the blank.",
            "Yes, after an accident i had a severe case of aphasia could understand everything but impossible to form/write a word.",
            "Grammar. I understand Italian and Spanish really well, and my vocabulary is good, but when speaking, my brain has to try to remember how to parse the verb tense and voice, and match the gender of the adjective to the noun.",
            "So, listening to a language only requires that you know the words. Your brain can understand them.\n\nSpeaking a language requires that you know the words, AND know how to form them, AND have the muscle memory to do it flawlessly. Speaking is mostly muscle memory and to not have that memory makes it so much more difficult.",
            "Also if you speak a language and another language is similar you might understand it without being able to speak it.\nFor example im half Brazilian so I can speak Portuguese and if people speak Spanish I can usually understand what they say due to a lot of similarities of words and tone but I can't speak a word of Spanish.",
            "While I can perfectly chat with people online in English, it's much harder to pronounce the words correctly. That's why people have accents, even if the English in my head is flawless my mouth won't follow.",
            "Word association. You may just understand one word that's also paired with a gesture and you instantly know what they are saying. It's like charades.",
            "I can speak french, english and german. I have no problem understanding people from the Netherlands because their language is just a \"mixture\" of everything. It goes like: Ah this word is kinda french and means that and this word is kinda like german, i get what it means even tho it has a slightly different meaning in german (snelheid sounds like schnellheit [being fast?] but the german word for snelheid is actually Geschwindigkeit [speed]). It only works ond way because i cant think of, well, which word i would use if I were to talk",
            "It's like I remember the words when it is spoken to me, then I lose it.",
            "Recognize vs. Recall. It’s like the difference between a multiple choice and fill-in-the-blank test",
            "I\"m kinda weird in that I can understand and read French from a person but I wouldn't be able to speak French back to them so I just answer in English.",
            "Yeah, my mother language is Italian, but I can understand Sardinian accent, whice is classified language. \nTalking tho, I just cant",
            "I speak 4 languages fluently (English, French, Spanish & Farsi), but I have been trying to learn Italian, and I can understand most of it but cannot speak it yet with any confidence. It's weird...I can *hear* it, but I can't reply accurately. Very frustrating. 😎",
            "It has to do with how you’ve been exposed to the language, I think. I can understand Spanish, but I can’t speak it. This is because I haven’t taken Spanish classes or anything that would give me instructions on how to string the words together in the right order, but I live in a city with a high Spanish-speaking population and I’ve picked up enough vocabulary over the years to get the gist of what’s being said.",
            "Two different parts of the brain entirely!\n\nAlso different muscle groups, but that's probably not quite as important.\n\n\\[Wernicke's Area\\](([https://en.wikipedia.org/wiki/Wernicke's\\_area](https://en.wikipedia.org/wiki/Wernicke's_area))) is linked to speech comprehension, while \\[Broca's Area\\]([https://en.wikipedia.org/wiki/Broca%27s\\_area](https://en.wikipedia.org/wiki/Broca%27s_area)) is linked with actually creating speech. \n\nBoth of these areas do work together, but you do have to actually engage a part of the brain in order to learn to use it.",
            "I understand my parents perfectly when they speak our mother tongue but when I try to speak it I sound like I've been away for the past 10 years haha. I suppose it's like those memories you don't remember having without an external trigger",
            "Ok, a freshman here. I speak decent Spanish. The thing is with any language is there's conjugation which means you change the word for it to make sense with the pronoun. An example is \"I am\" turns into \"She is\", \"You are\" etc. It doesn't make sense to say \"you am\" or \"she am\" so you conjugate the words. When I first started taking Spanish, I knew what they meant when they said \"Tu eres\" (you are) but I didn't know how to conjugate it myself. Hope this helped.",
            "As someone who understands Spanish but can't speak it, I wondered about this too. The way it was explained to me is that you're like a toddler learning a language ie you understand what you're being told but you can't get out more than a few coherent words.",
            "Yes, for example i do understand most of Portugese and Catalan, but i do not know how to build a sentence (correctly) in any of those languages.",
            "Context clues?\n\n\"What the- Pam! What did he say?” “What do you think he said, dicknuts? Pay attention to the frickin context.” “Well sorry I don’t have your language nerd skills. Hang on…Pambit.” “Wrong X-Man, dumbass!” \n\n\"Context: They're reloading!\"\n\nArcher- the Papal Chase",
            "I actually find it’s vise versa when learning sign language in my experience. I can sign most anything at this point but ask me what this other person is signing and I’ll usually have no clue.",
            "can't remember any of the fucking grammar",
            "Weird as shit, whenever my grandparents speak in Portugese I can get the gist of what they are saying without understanding a single word.",
            "As someone who has first hand experience with this, I just suck at the grammar. I know what the words mean, I don't know how to form them into sentences.",
            "I'm fluent in Spanish and can understand Italian but can't speak it. In this case it's just that the two languages are similar.",
            "That's me. I understand Mandarin, Cantonese and Tamil but I can't speak them. Not sure why, but I'm trying to nail them one by one.",
            "You recognize words quicker than you can remember them.",
            "I know just enough Spanish that I can get the gist of a basic sentence. I can pick up on keywords, but I can't form many sentences longer than a few words.",
            "In fact, you can try it yourself!\n\nGo to a website like https://kana.pro and learn to read the first two or three rows of Japanese hiragana.\n\nIt’s surprisingly easy. It’d take you 10-15 minutes tops to learn how to read them well enough to get reasonable accuracy.\n\nNow try *writing* in Japanese, using the characters you already know how to read. It’s way harder, isn’t it? Same idea applies to understanding and speaking.",
            "For me at least there are very few words in Spanish or French I know off the top of my head. But if reading or listening, I can make out words that are similar to English or foreign words I know to get the jist of the conversation. \n\nI also initially learned French in high school/college so I can translate a few words from Spanish to French, then English. But I could never really get a hang of the grammar in either language.",
            "my mother was taught french by a man with a Texan accent, the result is she has all the pronunciation wrong but she understands it",
            "Growing up around that language but never trying to speak it. It’s a weird ass feeling to understand every word but u can’t talk yourself.",
            "I can easily understand written French and Italian, and I can speak at a 4/10 level of French, but can’t string together a single sentence in Italian.",
            "I had a long train trip once and used side by side articles and their translations to \"learn to read\" Russian text enough to understand about 1/3 directly and the rest by context (it was technical writing - I cannot read Russian poetry, for example), but am hopeless at writing, speaking, or understanding by ear a single sentence. \n\nIt is easier to deduce by inference than to construct by inference.",
            "Hey something I have experience with! Growing up my grandparents spoke German to me. Sometimes a mix of English and German (think starting in one language and finishing in another). Since my grandparents spoke very good English, I almost always would answer them in English. My parents spoke English exclusively at home. \n\nI could understand German really well and started taking German for my foreign language requirement and always struggled with speaking German fluently. I could pronounce all the words perfectly, read quite well but couldn't seem to make my brain work fast enough to respond in German.",
            "Passive vs. active skills\n\nMy cousins grew up speaking English as they live in the US, but both of their parents are Israeli so they understand Hebrew, but don't speak it (in the last few years they started speaking Hebrew too when they come to Israel, but it's obvious that they aren't native speakers, despite their high level of understanding)\n\nThink about music, for example. You can listen to and recognize lots of songs, but you probably can't sing/play them at all/as well as you don't do that as often\n\nComing back to languages, I'm learning Dutch now, and in a lot of cases I recognize a word that's similar to English or a phrase that makes sense to me. That's great for reading, and to some extent listening too (the office skills), but I can't always recall these words when writing or speaking (the active skills) as I haven't seen them a lot",
            "In the opposite way. I can speak more Greek then I can read, and I can’t write it at all. Most of my learning growing up was verbal based.",
            "I just returned from a Spanish speaking country. I was impressed with my ability to understand what was being said to me. Sometimes they had to slow down or say it twice but I was getting it. When it came to speaking, I had to think about what I was going to say before I said it, and even then sometimes I couldn’t figure out how to conjugate even when I knew the word I needed. It would take a lot more practice for me to be fluent. Side note: I can read Spanish even more easily than I can understand it being spoken to me. Edit- should have said it was the first time I had ever been in any situation where I was the one who didn’t speak the language. I had no idea how much Spanish I had retained from college and a few weeks of practicing on Babbel and Duolingo.",
            "If you understand a few words it's easier to build an understanding based on the context clues and the tone of voice used. It's difficult to speak back if you only understand a few words and not the proper grammar and mechanics needed to construct a sentence in that language.",
            "Constructing your own sentences is significantly harder than listening and understanding. \n\nFor example, \"would you mind taking this book up to your sister's bedroom please?\" - if you didn't understand every word, but managed to understand \"book sister's bedroom\" and realized it was a question based on the inflection, you've understood enough to know what was said. You probably also understood \"please\" so you know something was being requested of you. But in order to make the same request yourself you need to understand all the grammar rules and such. \n\nMy parents spoke Welsh, but never taught it to us. I could pretty fluently understand them (it fell apart if there was a large family gathering and they were getting excited, talking too quickly, etc, but I could understand 1:1 conversations). The odd thing really is that if you asked me what the Welsh word was for a particular English one I couldn't come up with it as I'd never practiced or needed that skill, but could usually translate a lot of words from Welsh to English. It's kind of like not being able to remember someone's name, but if someone says the name you remember exactly who they mean and you know if it's right or not for the person you were thinking of.",
            "I understand lots of Spanish because my dad speaks it and my community has a lot of Spanish speakers. I’ve heard it for thousands of hours but I’ve produced Spanish for the purposes of communication during one trip to Latin America and some Spanglish in occasion to interact at a store or the flea market. Far, far less.\n\nI know what words mean but it takes SOOO long to conjure them in my brain, consider the person I am talking to and context to choose a verb tense, second guess myself, restate in my head to make sure it’s the right word. It’s so hard!\n\nBut my dad can tell me to go lock the gate in Spanish or bring him some water or whatever and I know what he’s saying immediately and I didn’t have to conjugate, just listen.",
            "What might be a factor, is the factor of similarity of some languages. For example Dutch reads a lot like German, so I as a German understand a Dutch Person probably easier than a person from Spain",
            "A lot of it has to do with context clues.  If we're talking about the rainy weather, and I'm telling a story where I say, \"Good thing I had an umbrella in my purse; otherwise I would have gotten wet!\" You may never have heard the word for umbrella or wet before, but you can guess based on context.  \n\nYou might have also struggled to put that sentence together yourself if you didn't know how to conjugate the phrase, \"would have gotten\", which is a tricky tense, even though you could recognize the worlds and glean the meaning.  Unfortunately, in an effort to understand what's being said in real time, our brain doesn't have a great capacity to derive the grammar for its own use without a lot of repetition or deliberate practice.\n\nIt's kind of like the difference between hearing someone explain a complex scientific process and being able to explain it yourself.  One just requires you to follow along while the other requires you to truly understand all the mechanisms involved.\n\nThe other reason why someone might understand but not be able to speak is being fluent in a similar language.  I can kind of understand Italian because I speak Spanish, and the words sound similar enough, but I don't actually know any Italian.",
            "Happens if the languages are similar. For example I speak Serbian, Russian and Czech, so I can understand Ukrainian or Macedonian (my dad's language too) but cannot speak it",
            "My dog reacts to his name and “walk” or “car ride”, but still failed when I enrolled him in ESL classes. Lazy thing doesn’t want to do homework I guess.",
            "It’s like tests.\n\nWhen you see the answer your brain lights up with familiarity “I know that!”\n\nBut when you need to write down the answer on the lines, sometimes you just can’t.\n\nIt’s the same with understanding and speaking. Understanding is just recognising words and deciphering them.\n\nBut to speak it you need to actively recall the vocabulary for what you want to say.",
            "I lived in Holland for 4 years when I was very young. I was fluent in Dutch growing up but can no longer speak it. But in a weird way I can still understand what’s going on in a conversation. I think I can pick up a few words and understand the structure of what is being said. I wouldn’t be able to translate it word for word but get the general gist of what is being said. \n\nOne of my old jobs the boss and his wife were Dutch and I always knew what they were arguing about or when they were talking about me. \n\nIt’s like a weird sixth sense and I’m sure I could pick up Dutch again quite quickly if I tried.",
            "I think it’s a matter of exposure, like having to actually use the language day to day. For instance I’m from Poland, and have cousins born in the US who don’t speak a word of Polish even though their parents can speak Polish to them and they understand. But since they never actually lived there or needed to speak the language, they can’t. Personally I had the same experience with Russian. I was at the point where I could watch TV in Russian and read articles and understand, but speaking was a huge obstacle. It’s hard to describe but it felt like more of a confidence issue, because I’ve never been in a situation where I had to have a spoken conversation with someone in Russian. Only now after picking up the language again and studying every day I’ve started getting more confident, but speaking is still my weakness even though I’m able to write down what I’d like to say, it’s just harder for me to do on the spot.",
            "I have about 25% fluency when reading languages with heavy Latin roots, because in school we had to learn roots for our long weekly words list. Can I speak any besides English? Hell no. Can I understand them being spoken? Again, no. But on paper it's a lot easier to comprehend because only my established mental pronunciation is in play, and I can take longer than the partial seconds one would normally need to reply in",
            "This is so true for me. I can pretty much understand almost all of arabic but I can't speak it for shit. Or atleast its broken arabic full of grammatical mistakes.",
            "I’m learning Russian and I understand more than I can say. I seem to understand a word for some time before I become comfortable using it myself.",
            "Human minds are pretty awesome at connecting words and meaning, almost like if you're looking at random things and your brain automatically take different spots and try to form to a person face. This explains how people see faces in Picasso paintings and such. Much like the brain, once you know couple of words, or similar meaning to your language, you can pair them and understand whole sentence. Speaking or writing are words building skill, extremely hard to do. Hence people speaking's skill usually the latest to master when learning a language. Too much construction, too much details. Such as gender for the \"the\" on many languages. Like I'm Vietnamese learning German. In listening, I simply ignore them and take whatever other words into account. In speaking or writing, that's the hardest stuff I have to work on, and I usually screw up.",
            "My understanding is your accessing different parts of your brain. When you hear/read a language you are basically referencing as opposed to when speaking/writing you are creating.\n\nThere's about a 90% chance I'm wrong but there is still a slight chance I actually read it in a Malcom gladwell type book.",
            "How do dogs understand your commands but they can't speak those same words?",
            "I understand Farsi and Spanish entirely, but I am shit at speaking it back. It's a exposure vs practice thing, homie.",
            "Besides everything that was said here, for me it is also about anxiety! Having to say the words out loud and be judged inhibits my learning",
            "I speak Spanish. I understand Portuguese, Italian, and I can read French because they're so similar to Spanish. I don't know anything about the grammar or the sentence structures, so I can't speak/write.",
            "I took German in high school so I can understand it pretty well. If I am reading a written text, or sometimes even listening to a song or something, I can mostly understand it. However, I can't construct a sentence well. There are so many tiny little rules that come up depending on whether you are speaking, writing, what gender the word is, and what tense all changes the entire sentence.",
            "I can understand German and Spanish at a kindergartener level, but cannot speak them for the life of me.",
            "Sometimes two languages are really similar so if you know one you can understand words in the other.\nOther times you learn the language and then forget how to speak but you can still understand when others speak it",
            "I can speak okay in a language, but I can barely read it nor understand what people are saying to me.",
            "[Here is a great answer from another sub on that topic](https://reddit.com/r/askscience/comments/aso35b/_/egvnmv1/?context=1)",
            "Context is key.",
            "It's hard to understand how to move your mouth to make certain sounds unless you were taught it originally, like a common example I can think of is the L sound",
            "This is why sign languages exist, my mate.",
            "If it's a similar language to one you speak, you can understand it by only knowing some of the words in a sentence using context clues. The same goes for if you're only moderately okay in a language, you can pick up the general meaning of what's being said to you with context clues. Some people can understand languages they can't speak simply because they aren't capable of making the sounds required for the language. For example, I knew a guy who could understand German perfectly, but he had a very heavy southern drawl and a lisp, so he couldn't speak it at all",
            "As a Spanish speaker I usually understand what a Portuguese speaker is trying to say, but since I don’t actually know Portuguese I couldn’t write in the proper grammatical structure, or since sometimes words are different or have different meanings, I wouldn’t write or talk in it",
            "I understand more Spanish than I can speak. It's a mix of not knowing the proper order, and not wanting to mispronounce words. I'm mostly just scared of offending people with my horrible Spanish. So I sit, listen and try to learn how it's all said and done.",
            "Same way its easier to read and understand a foreign language (that you've learned) than it is to write it. Or heck, easier to read your own language than write it sometimes! Not everyone can write eloquently, but once you know how to read you can pretty much understand any written sentence.\n\nAs an aside, my husband and I are like this with French: my aural understanding is quite poor (I can read pretty fluently, but my aural processing isn't great even in English. ASD ftw 😉) but I can speak French very well; David can understand pretty much anything said to him, but can't really speak a proper sentence back. So By Our Powers Combined we make like one whole relatively fluent person 😄 He'll tell me what the person said and I'll answer them, or I'll ask someone something and he'll tell me the answer.",
            "This is actually me. When I was born my parents only spoke spanish to me. (They speak both english and spanish perfectly) Once I started going to school I had to learn english. So my folks started talking to me in english. Over the years I learned more english and stopped speaking spanish as much. It got to the point now where I barely know how to speak spanish but I understand it pretty good.\n\nIve thought about this very thing and the answer I came up with is: Im able to pick up most of the words in a sentence and givin the context of what we are talking about Im basically able to understand what someone is saying in spanish. \n\nSo im understanding like 75% of what they say and Im able to figure out the rest.",
            "i can understand phonetic but can't speak jt",
            "I don’t think it’s like “I understand every word perfectly but can’t speak it.” If you can pick out just 1 or 2 words from a sentence and pick up on their body language I can be easy to know what someone is saying.",
            "As someone who has/does this; I chalk it up for my dysgraphia.\n\nMuch like dyslexia where things get jumbled, instead of visually it's more mental. Like say in dyslexia you see the letters of words or numbers in an equation mixed up; while in dysgraphia it is more of you have it set up in your head perfectly, but when come to physically produce it like writing it—in this case speak it—it comes out jumbled.\n\nFor me, I have to take my time with things (and replies) just so there's perfect clarity. As if I just go right off the cuff, it'll probably riddled with mistakes and minor errors.",
            "I don't know if I'm using the grammar properly in my second language, but I trust someone else when they do, and I know enough words to understand them.",
            "The same reason you can sometimes not think of a word, or wouldn't be able to formulate a sentence in your own language like someone else can, but still understand it, once it is uttered.",
            "To me it’s the opposite, I have a slow processing ability, so in languages such as german I struggle with the high speed pace and I often look at the body language for clues. \n\nMeanwhile in my head I’m able to form sentences at exactly my pace to form a response. On all my german test ever, my speaking test grades are higher than my listening tests.",
            "I have been a singer for a while, and grew up in New Mexico.  Because if it’s similarities to Spanish, and me learning operas, I can read and understand italian pretty easily.  However I’m not quick enough to be able to respond in Italian.  I get mixed up and even if I know how to say the sentence, it comes out in English.",
            "i can understand tagalog really well, but mostly through context. if i don’t know exactly what one word means i can put it together based on the other words i did understand.\n\nbut i wouldnt be able to do the same when i’m speaking it",
            "Big part of it is the difference between active and passive vocabularies, you can only fluidly recall a fraction of the words you actually know",
            "I had to teach myself Limburgish, as my parents didn't. I'm still not perfect at it, but I've been able to understand it since I've been able to understand Dutch (which I speak natively).\n\nThere were many people in my childhood who spoke it, but they also speak Dutch, so there never was a reason for me to learn how to speak it, but I did need to learn to understand it.",
            "This is me on Reddit, i usually don't coment bc is a little hard but I understand almost everything",
            "If it makes you feel better,  i can speak French way better than i can understand it being spoken. \n\nI've never once used a word i don't know,  but French people are constantly doing that shit.",
            "I grew up in a Chinese and other dialect but learnt English growing up. I can understand Chinese and some of the other dialects but I can barely speak it or write it",
            "Sign language",
            "I'm from The Netherlands, and I have an English teacher from Brazil. She does understand Dutch but will almost always respond in English.",
            "You know when you're trying to think if a word, but can't remember it, but then someone tells you that word? It's kind of like that.\n\nAlso, when you don't know a word, but you figure it out from context.",
            "Important parts of speaking and understanding language happen in different parts of the brain. An area called Wernicke's area is implicated in understanding language. If it's damaged you can still speak but you can't understand others. On the other hand an area called Broca's area is involved in producing speech; if it's damaged you can still understand other people speaking but you can't speak yourself. \n\nhttps://en.m.wikipedia.org/wiki/Receptive_aphasia\nhttps://en.m.wikipedia.org/wiki/Expressive_aphasia",
            "I've understood Kannada, a regional language in India, by listening to my friends speak it and by watching movies and trying to understand the context in which the words were used. I can also read and write the same language, very little though. But I can't speak it because I've never had the practice and I don't know all the words, don't know the nuances of grammar that changes while speaking. So basically, all listening and a little bit reading but no speaking practice.",
            "I've watched enough Sabado Gigante while stoned to pick up basic Spanish. A buddy of mine watched Kurosawa movies so much he could understand most Samurai flicks without subtitles.",
            "I can understand Kannad language because i studied in Banglore for 4 years but i dont know how to speak lol except few words",
            "Because I live out of my home country, I can understand more of the language than I can speak. I think it's because I'm used to hearing the same phrases over and over but I've never learned the responses to them.",
            "I am new to the Russian language. If someone told me \"I eat apples\" in russian, I would understand them. However, I am shit at emulating the nuances of russian, and am hopeless in writing it down. If somebody asked me to say \"I eat apples\" in russian, it would sound like \"aeh, yeast ya blah kah\" like, I know how to spell хорошо, кофе, нет, етс, but I don't know much else. But I do fucking love \"Не не\"",
            "In some cases people are able to understand other languages because they're very similar to their native language but they don't know the words and grammar of the other languages so they can't speak them. \n\nFor example I can understand italian because it's very similar to romanian (my native language) but I can't speak it .When I was little my godparents (who live in Italy) used to visit my family and bring their children with them. The children grew up in Italy so they didn't speak romanian but we would play together all the time and understand each other perfectly,each speaking  their own language.",
            "Step 1. learn a language. \nStep 2. Stop speaking language. \nStep 3. Understand it but forget how to speak it. \n\nI’m on the Benjamin button plan for Spanish and I am like a 10 year old on the understand part, and 2 as a speaker.",
            "Because you don't need to understand every word or know the grammer to understand something. But to speak it, you do have to know these.",
            "This is me. I can understand Spanish, but my speaking of it needs improvement. Speaking is basically remembering words in order to speak it. Understanding it is remembering what the word means instead of needing to say it out loud. My grandma speaks Spanish to me and understand what she is saying, though when it comes to speaking, I have trouble of course.",
            "They have a speech impediment.",
            "it's the same as whatever your native language is. You may know what a word means when you hear it, but you may have a hard time thinking of the word in conversation. Imagine this, but on a much larger scale, and you basically have the issue of comprehension and speaking.",
            "As a Portuguese I can understand most of a conversation between two Spaniards and can fully understand Latin American Spanish. I absolutely butcher the language if I try to speak it (I can get a message across, but not well). This must be common with other very similar languages.\n\nAnother case, I can perfectly understand a conversation between two french (some struggles with North African and Canadian french) but cannot speak it nowadays. Again, a close enough language to my own, but here the cause is I learned the language and stopped using it. Without practice I cant make a proper sentence or remember the right words to save my life, but that's already done it's no challenge.\n\nMaybe anecdotal examples, but I'd imagine a lot of people in similar situations will have analogue experiences.",
            "I think of it like \"knowing how to use a computer\" and \"being able to code .\"",
            "I understand German.\n\nBut the grammar rules, especially those of gender and case, are way too complex for me to ever get right.",
            "For me, French is easy to understand because even if i dont understand a word properly, I can use the context around it in order to figure out what was meant. But when I talk in French forming sentences requires a greater understanding of the french language than I currently have, especially when it comes to how certain grammar works in french. If I spoke french by directly translating into English, it would sound broken much the same way English sounds coming from someone who doesnt speak it. They have the general idea, but not quite",
            "I'm bilingual and I have a lot of people *tell* me they understand English/Spanish, but don't speak it and almost invariably they can barely understand it. People seriously overestimate their language proficiency, and saying you understand it but don't speak it is a good way to dodge an awkward conversation.\n\nPeople also say that in general it's easier to understand an already constructed sentence than to construct one yourself -- I'm not fully convinced of that and I think it applies mostly when people are in the absolute beginner phase of language learning. Once you have down the basics, it can be easier to speak than understand; those talking to you could be using any of the hundreds of thousands of words that you don't know, but  you know what you know. In other words, you can talk about anything you've learned to talk about without dealing with the intricacies/vocab/irregularities that pop up when a native speaker talks to you.",
            "I can understand when my parents talk in patois but I cant speak like that without sounding like a white girl from the valley",
            "Also, quite literally, comprehension and speech occur in different parts of the brain. One can take off without the other.",
            "So my parents are immigrants, and I spoke their language until I was about 5 or so - the time I started school in the US. At that point I started speaking almost exclusively in english the vast majority of the time, always with my father, and most of the time with my mother. I never learned to read or write my parents language.\n\nNow, I understand what they're saying perfectly well. However, when I speak it, its understandable, but the grammar and syntax is off. I think its because I think in english and then I have to take the time to basically translate it as I'm saying it. And I'm struggling to combine the grammatical rules of each language.",
            "Basically life, simple as that",
            "On a personal note I was able to undressed the sounds before I could articulate the sounds that made sense to others.   therefore it took a long time.",
            "Also if we take the biological route, the area that understands language and the area that forms it are separate. There's instances where people have brain damage and can understand what others are saying but can't speak what they're thinking because of how their brain was harmed",
            "I am one of those people. My mom always made fun of me/publicly humiliated me when I spoke mandarin or Taiwanese. I learned not to use the skill. I think if I practiced, I probably could learn to relatively easily but I’m too anxious to start.",
            "I can read German, Spanish, and Latin, but I can’t speak them. There are roots that I know, so I have a vague understanding of what’s happening, but I don’t know all the words, and the sentence structure is different in English, so I might not be able to form the words I do know into proper sentences.",
            "Many people who are semi-fluent are also embarrassed to speak the language because of their accent or bad grammar etc, so they don't practice and never have a chance to become more fluent.\n\nMy family speaks many other languages for reasons such as my dad's family moving around a lot when he was a kid. I know one of these languages but the other I would only hear on rare occassions. The second most common language my family speaks (besides English), I only understand roughly, and can't really form sentences in with confidence.",
            "Those are not called people, they are called as dogs",
            "As a hypothetical, I could say I'll meet you at the train station later today.  You understand broken english and interpret 'meet' 'train station' 'today' and hear a host of other words you don't understand.  You fill in the gaps based on the context of the situation to gather what they mean, in reverse you try to say you'll meet them at the train station but instead you just end up saying 'you me train station' because although you understand today and meet you can't recall them without hearing them first to jog your memory.",
            "It's not that we cant speak it. We r just too scared to try cuz we dont wanna sound like a total idiot and embarrass ourselves",
            "I think you can first try to understand that it's not entirely true that people who are \"**able to understand a language, but aren’t able to speak it\"** can definitely speak some select words, but cannot form a definite sentence with proper sentence construction. In most languages (I cannot speak for all, as I am not a professional in world linguistics, but insofar as among the languages I do speak this is the case:) there is a sentence construction much like in English with the Noun-Linking Verb-predicate relationship. People who cannot speak but understand a language does not have the proficiency to understand the intricacies and nuances of a language's sentence construction. In learning a new language, one often learns words first before moving on to proper sentences. Perhaps these people who are able to understand, but not speak a language are simply in the transition between learning new words and learning a sentence form (or perhaps they simply do not have the time or patience to learn beyond simple words as it is often good enough to convey simple ideas \\[Consider a non-English speaker making a purchase in a grocery. It is much easier for him to approach the counter and simply utter \"Water\" rather than \"I would like to buy water\". The sentence \"I would like to buy water\" may seem trivial to a native speaker, but it may be difficult for a non-English speaker to differentiate the use of \"would\" versus \"will\" or \"like\" versus \"love\". In the latter case it is technically correct, but colloquially it is not commonly used in that manner. This is another consideration that a non-English speaker has to think about. With all this in mind it is simply much easier for one who is not versed with a language to simply used basic words rather than full sentences which perhaps leads them to refrain from using the language altogether.\\])\n\nFurthermore, it's more of simply knowing some key words in a sentence that brings about a speculated idea rather than a truly cohesive idea. For example if I were to say \"Horse house\" the proper noun for this would be a horse stable, but since you understand that I am pertaining to the living area of the animal horse then you can approximate the idea I'm trying to convey.\n\nIt goes beyond this also, for languages such as Chinese where some characters change meanings entirely based on what characters that proceed or precede them some ideas can be taken from context clues in that sense. Take the word  办公室. Imagine if you did not know the first character in the word. I inform you that the second character means work, and the last character means area/room or space. You could possibly surmise that this word probably means a \"work-place\" or simply the office.\n\nThis is my personal anecdote on how I learned to speak a language from a person who simply understands, so perhaps this is not the case for everyone.",
            "You're around them long enough that you adapt to what they are saying. As someone has already said, its easier to understand a language then it is to speak it.",
            "I feel like if you can read the language you can speak it",
            "It is MUCH easier to read a language than to speak it. For example, written words in French, Spanish and Italian look similar in many instances but they may be pronounced very differently because of the language “rules”.\n\nHere is how I rank understanding a language, from easiest to hardest:\n\nReading it is easiest.\n\nWriting is second easiest. \n\nSpeaking it is third. (Although you are probably making mistakes, it can be understood)\n\nHearing it and understanding is hardest, particularly at full speed. \n\n Also, with reading, you can go over it a few times. And with listening, you can miss one key word and the whole sentence loses meaning or has a different meaning.",
            "I can do this with Spanish, mostly because I know some of the words and am able to fill in the blanks with what it means logically with context, but reversing that is impossible simply because I don't have enough knowledge to fill in the blanks myself.",
            "I am American and studied French for many years. I have a reading comprehension of it but can’t listen to anyone speak it. I have to see the words. That was my biggest flaw in studies. Reading and writing I got high marks but not verbal comprehension. I haven’t studied in a long time so I’m sure I could not do it at the level I once did but I can skim writings in French and get the overall gist of it.",
            "Ok it’s different for me I grew up in south of Italy where they speak both Italian and Neapolitan (which is considered almost another language as some Italians don’t understand it (growing up I would constantly hear “I’ll tell you in Neapolitan so the Italians don’t understand”  I left when I was  8-9 and even though I can understand nearly everything and the some words that I can get out They sound fluent but for the life of me I can’t get the words out of my mouth to make a structured sentence.\nI promise one day I will move back for a while and practice until it comes out naturally.\nI also speak other languages that I have now forgotten to speak out of not practicing and although I understand everything, trying to get the words out of my mouth to string a sentence together is like trying to put my mind into overdrive.\nThen I get the thing where I have a few drinks and it all comes flooding back but that just might be me being drunk and talking shit thinking that I’m making sense which I’m probably using all the languages I know just to string a sentence together",
            "The human brain is wired to recognise and organise pattern. People can read languages they don't speak and, subconsciously, will automatically compare similarities to words in a language they \"do\" speak.\n\nIt's like when people who are supposedly under demonic possession... One of the \"symptoms\" the Catholic Church says must be present before an exorcism can be authorised is the ability to speak a language unknown to the person. 9/10 times that language will be Latin... And it's because the person's brain will subconsciously store phrases and words without the minds recollection... Catholics hear a lot of Latin phrases in church and study so without even knowing it are storing them up to regurgitate. But if you tried to have an actual conversation with them in Latin they wouldn't be able to engage.",
            "Contextual cues.\n\nImagine if someone is describing you a flat they want to rent. You understand the text as something like\n\nIt is 50 sqm, has a bedroom, a living room, a small kitchen, and a bathroom. Unfortunately, the fsljfldsfkdsj is not separate but is in the same room as the shower and the sink. \n\nEven if you don't KNOW that word and thus wouldn't be able to produce in a conversation, you can kinda guess it is a toilet.",
            "The same way you can understand different accents but not speak with them.",
            "This is also a great topic in computational complexity... There are alot of Problems(NP)  for which u can easily verify the solution to be correct if you have one but its hard to find a solution from scratch unlike for  problems in P",
            "Understanding requires less knowledge of the language than speaking. Imagine you knew the following words in portuguese:\n\nTu: you\n\nFalar: to speak\n\nFazer: to do\n\nAnd were trying to ask \"Do you speak Portuguese?\" Your first instinct as a native English speaker would probably be \"Fazer Tu Falar Português?\" Which roughly translates to something like \"Make you speak Portuguese?\".\n\nThe correct way would have been simple enough for you to understand, but would have required knowledge of how the phrase should be structured and the verb conjugated, which was done by the person you're listening to.\n\nBTW, the correct way is \"Tu falas português?\", It would be easier to hear \"falas\" and realize it means speak than to remember the correct way to say you speak.",
            "Sometimes there are familiar-enough words that you can hear them and figure out the meaning, especially if you have familiarity with related languages, but not be sure how to form them yourself.\n\nLike, if you know Spanish, you can probably figure out a lot of Italian.",
            "Same way you can understand musical notes in a song and how they make you feel but you can't play an instrument or sing.",
            "My girlfriend can understand Spanish, but can't pronounce the r's, j's, d's, or t's properly.\n\nSo she can't speak it.\n\nAlso, Mexican is mostly slang. Nobody speaks actual Spanish in Mexico",
            "It's easy to pick up on words you're familiar with and get some context from that. For example, I am Croatian and I understand Russian to a certain degree, but I can't really speak it since I don't know any of the \"rules\" I need to construct a sentence.",
            "As someone that's actually like this heres my analogy.  It's like the song give it away by RHCP.  You know the song when you hear it, you get the fist of the words, you can say some of it, by god forbid if someone asks you to recite it word for word.",
            "Just gonna day right now, I’m taking American Sign Language, and it is way harder to understand the hand signs than it is to actually sign them yourself.",
            "It’s kind of like knowing a song but not being able to sing it",
            "Funnily enough, I’m the opposite. I can speak most languages much better than I can understand them. Usually because when I’m listening, if they’re not going super slowly, I just pick out some words and have to extrapolate. However, I find making my own sentence up easier because as long as I know the words I need, you basically just fit them in the correct slots to form a reasonable sentence. Even if it’s not perfect, they’ll usually get the point. \n\nI can have decent convos in Spanish but for Japanese I can only speak it and understand the most basic sentences like “who are you” and “where are you from”. And French is a complete wash for me both ways tbh",
            "Because understanding and producing language are served by two different brain areas (wernicke’s and broca’s area respectively). Therefore, one could work better than the other if the person doesn’t bother practicing speaking the language for example.",
            "Comprehending speech and speaking are literally two different parts of the brain.",
            "well you see that is me. My whole family speaks Spanish. The problem is i cant think fast enough to conjugate.  you have to know past, present and future. You also have to know if your speaking about a girl, boy, group, formal and so on.  So when someone asks me \" where did your mom go ?\". I have to conjugate the word \"leave\" to \"left\" and make sure its formal. Due to that, all the thinking becomes over whelming with more complex questions. In addition i know lots of vocab, but anything i don't  know i fill in the blanks depending on tone and what was already said / actions and facial expressions. Also i know basic words such as what, where, how in Spanish so i already get a grasp of whats going on.",
            "You know, everytime I try to speak english (because i'm mexican) I feel like scatman Joe.",
            "I can read, write Arabic but can't understand it.  I guess I understand what your question is but I can't explain it.",
            "Well, I don't know, but also as someone who speaks Spanish and French I can really easily understand Portuguese and Italian. Is it because they all come from Latin? They're all romance tongues so I guess they have something in common",
            "So i was born in East Ukraine and moved to Germany at a young age. My mother always spoke Russian to me but I slowly started only replying in German because she understood me either way. Now I don't really speak Russian because I'm not used to it but I still understand most things pretty well.",
            "Read the [Scots Wikipedia page](https://sco.m.wikipedia.org/wiki/Main_Page) and you'll get what it's like to be able to understand a language but not speak it.\n\n>Brazil's Naitional Institute for Space Resairch annoonces that it haes detectit mair nor 39,000 wildfires in the Amazon rainforest syne Januar.\n\n>At least 80 fowk are killt an 160 ithers injured in a bombin at a waddin in Kabul, Afghanistan.\n\n>Aw 233 fowk on buird Ural Airlines Flicht 178 (aircraft picturt) survive a crash follaein bird strikes in baith ingines o an Airbus A321.",
            "I find this question interesting as well. I find myself in this predicament all the time. I was born into a Spanish-speaking family, but since we live in the U.S., my first language was English. Growing up, I was not encouraged much to speak Spanish, but my family would constantly speak Spanish to each other. After years of this, you start catching on to what certain words mean. Sometimes a  joke would be said in Spanish, and I would laugh at it, even though I wouldn't be able to tell you exactly what the joke was. Now as I grow up, I'm practicing more and more to speak the language. The problem is, I'm a little shy and embarrassed to speak the language to other people! But I still practice, whether it's singing a Spanish song or talking to myself in Spanish.",
            "So, I don't know as fact but I have a couple of guesses. \n\n1 - if your native language is English, then understanding a lot of European languages will be easier for you because the English language is a mush of a lot of them. \n\n2 - if you stand and really look at people having conversations, look at their body language too. Body language, in a lot of ways, is universal. I work retail and our company is global and very popular among Chinese people. I don't speak a word of Chinese at all, but yet, I've been able to have a 'conversation' with a Lady who didn't speak a word of English and got her the items she needed. You just kinda, 'get' each other, if that makes sense? Like some evolutionary thing going back to when we were all cave people but grunted in different languages or some shit so we figured out a universal way of communicating if necessary. Plus, we can all tell when a person is sad, angry, happy etc etc with our faces and expressions rather than spoken language.",
            "I have that with French, I took the language class in high school and we didn't have a very good teacher, but she would speak exclusively in French most days when we got to a higher-level class. So I can understand more French than I can speak or write.",
            "I can read and understand almost 90% of Reddit, but I would understand less than 10% if spoken. I have difficulties writing and I'm unable to speak fluently even the simplest sentences.",
            "Well I come from a fully friend family except that my mother was predominantly English spoken despite being raised by French parents she preferred English, especially when she moved to Ontario from her tiny hometown in New Brunswick (we’re Canadian) my mom sent me to English public school where French classes are very... useless basically. I learned the bare basics of what was supposed to be my native language. When I was very young I could speak French decently well because my dad, paternal grandparents, aunts & uncles and cousins all spoke it to me, however when I was six or seven my parents separated and I saw my French family members less and less. Eventually I just forgot how to speak French almost entirely. I can read it and understand when my family speaks it to me by picking out words I semi-recognize, but beyond that I don’t know French. I can’t build the sentences in order to speak it. If a French family member speaks to me in French I’ll process it for a minute before responding in English, it makes for a very slow-going and mildly uncomfortable conversation, but I manage. I don’t speak French, but I can sort of understand it.",
            "I can speak basic sign language and have an okay vocabulary but I have always struggled with my comprehension of it. My situation is backwards but I can see the opposite effect",
            "It’s like a multiple choice test. When you have a limited understanding of a topic you will figure the right answers out and past the test. But if the test was changed and you had to construct the answers you’d fail because of your limited knowledge.",
            "I took 4 french classes in undergrad, I can still understand quite a bit but could not write a proper sentence if I tried. It’s easier to understand because when you hear someone speak a language they use proper grammar, intonation, sentence structure. But when you try to write it you don’t know the language the way a native speaker would, so you can’t really write it properly.",
            "My Spanish teacher was just explaining this the other day. She was saying that productive skills are different from interpretive skills. I can understand Hindi perfectly but my speaking of it isn't the greatest.",
            "They're different skills and also in my case, I hear Spanish semi regularly and know a few key words. With the words I know, I'm able to understand the general idea of what the person is saying (especially if they use facial expressions and hand gestures)\n\nAlso im pretty bad at the pronunciation and grammar and don't know nearly enough to speak complete sentences.",
            "Pronouncing word is hard lol especially without dumb accents... im Italian, can write (mostly) , understand , joke in English and so on, but when I speak ... mamma mia!\nReading English has taught me well but one need to speak constantly too...",
            "I speak Portuguese, and I can understand Spanish. The languages are structured similarly enough that I can read and understand almost anything in Spanish, given that the person is speaking clearly and actually enunciating their words. If I don't understand something, I can pick it out based on be the context in the conversation. \nWhen I speak Spanish, I have to be careful not to be using words that are only Portuguese. \nTldr: speaking is much more active role than listening",
            "It’s pretty common, I understand Spanish but speak it like a 5 year old, mainly due to lack of practice and trying to translate from English since sentence structure is different plus when I don’t know a word I just freeze up and switch to English",
            "I know for me, I used to be able to speak German to some extent, but since learning Russian, if I try to speak German I'll only get a few words in before reverting to Russian",
            "     its like, you know how the words are pronounced, but you have absolutely no idea to form a sentence. Im able to understand tygrinia ( language of eritrea), but not able to speak it. When you learn a language, you have to know the letters, words, and how to put them together. Some people only know words of the language but dont know anything else",
            "Babies understand what you're saying before they're able to speak too.",
            "Ez, I'm shy.",
            "I used to be able to speak French because of high school classes, but I went abroad and learned Tagalog and some Mandarin. Now I can understand some French but whenever I speak it it comes out as a jumble of all three. \n\nIf you want to keep your 2nd language while learning a 3rd, use your 2nd to learn your 3rd.",
            "cognates, my friend.",
            "It's like when you're in math class and the teacher is explaining how to do a new equation or whatever. They explain it and it seems so clear and obvious how they explain it. Yes, I understand perfectly. That's not hard at all. Then you get the worksheet to do what you just learned and your mind blanks. You remember bits and peices, but doing the full procedure now seems impossible. \n\nThat's how it is with language. It's easier to listen to a second language (third, fourth, or what have you) and decipher what they're talking about than to try and put the words together in a grammatically correct cohesive sentence yourself.",
            "Speaking words and understanding words are 2 different part of the brain aswell. You need to train both to be able to do both.",
            "Mute. I HAVE NOT SPOKEN!",
            "I can understand a langauge but cannot speak it. Its Tamil for me. I cannot remember the words for what I want to say but I'll know what a word is when I hear it. It's also hard because I cannot think in Tamil. I speak three languages including English and I can think in all of them which helps with the grammar and the sentence forming.",
            "You ever have one of those tests in school where while you're studying, you glance at something and you're like yeah I totally understand that! Then on the test when you have to actually write an answer yourself you're like uuuuuuuuuuhh shit? Yeah, it's like that.",
            "I can somewhat read Spanish, I can understand the gist of what people are saying, but I can only construct very rudimentary sentences. \n\nI took Spanish about a decade ago, but when I tried to practice with those fluent, I was teased, so I never again spoke it. However, I retained enough knowledge that I can gleam what I need from instruction manuals, gossiping coworkers, and anyone who doesn’t speak English. In turn, I can speak or write kindergarten level Spanish back to relay whatever info I have to if necessary."
        ]
    },
    {
        "post_id": "arm7j6",
        "author": "None",
        "title": "How can 30 second ads for mobile games get away with showing content not only absent from the game, but stolen directly from another game in many cases?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/arm7j6/how_can_30_second_ads_for_mobile_games_get_away/",
        "score": 14200,
        "num_comments": 332,
        "created_utc": 1550421689.0,
        "selftext": "Even if you ignore parts of ads that clearly show game play or other assets from a different game, doesn't showing game play that literally is not present in the game being advertised constitute blatant false advertising?  Is there some loophole for free games or something? ",
        "permalink": "/r/NoStupidQuestions/comments/arm7j6/how_can_30_second_ads_for_mobile_games_get_away/",
        "comments": [
            "The game company is most likely based in a different country, one who wouldnt care one way or another about the copyright and false advertising abuse.",
            "I've seen Idle Heroes and Hustle Castle as the two main offenders for this. From everything I can tell, neither of them remotely represent their games in their advertisements. \n\nAll I can guess is that nobody has successfully sued them for false advertising yet, probably due to some jurisdictional issues.",
            "Reminds of when a mobile game took a cutscene from For Honor, made it look worse, and uploaded it as an ad",
            "They often use GTA V too",
            "I hate how they will have 3D stuff or whatever and then be for a 2d game",
            "I once saw a crappy and generic iOS zombie related game straight up steal the COD Black Ops 3 Zombies Chronicles DLC trailer and then just slap their own logo at the end.  ",
            "Yeah I have seen that mainly for Langrisser, they showed ads with covers from popular anime songs it was really cringe and has nothing to do with the game...\n\nOne reason is probably they try to grab as many people as they can from their target audience, if I look at the pr of most mobile games I dont think the marketing teams has given it much thought about the actual excution",
            "Best example is Last Shelter. I've seen so many videos of \"gameplay\", I believe it must be the one game to unite all games. But I do not dare. ",
            "Because Google doesn't give a shit. They automate whatever they can and usually those automations don't work particularly well. Judging by the quality of the play store and my own experiences as an Android dev dealing with Google, they ban more legitimate apps for false positives than actual rule violations. So all the work of identifying stolen content is put on the rights holder. As soon as you report one, 10 new clones will pop up. That is if your reports are actually acted upon at all... If you're not a huge corporate client of Google with your own account manager you can forget ever having them remove one of the clones, let alone speak with a human in customer support. ",
            "One time I saw a mobile zombies game ad that had footage that was STRAIGHT ripped off from call of duty black ops.\n\nI have the same question as you do",
            "I just saw 3 different ads for last shelter survival. One looked like fallout shelter, one looked like a defense grid style tower defense game, and one looked like a clash of clans base builder type game. I've also seen several other games show these character customizers with skimpy elves that you can customize the breast size of but if you download the game there isn't even a character customizer anywhere. I refuse to download the games simply because of the sleazy advertisements.",
            "They even go as far as to getting Arnold Schwarzenegger to act in an advertisement. ",
            "[removed]",
            "It reminds me when children play mobile (kid) games and get porn advertisements. ",
            "Probably because consumer protection laws have not at all kept up with things, and it's in nobody but the government's best interest to regulate these ads. They'll do it as long as they can get away with it. Any system like that will eventually be gamed and abused to the fullest extent possible, and that's seemingly what's going on here.",
            "what i guess is happening is that either the companies that make the games aren't in a jurisdiction with strict advertising law. or, outsource the advertising to an agency that has that benefit. alternatively the game producers themselves are mostly unaware of how bad the ads are, as they outsource marketing wholesale, not just making the ads. ",
            "That's how mafia works",
            ">game play or other assets from a different game\n\nDoes this really happen? I know they show gameplay that doesn't represent their game, but do they actually steal that footage from other games? That seems next-level.",
            "It's amazing someone can report a youtube video and it's taken down right away but if it's an ad, pump the brakes boys.",
            "Even if they were based in the U.S., in order to have a lawsuit case against them you'd have to show that you received damages based on their false advertising. If the game is free, it's unlikely you could prove damages. The more likely thing would be the company that owns the other game(s) would sue them for copyright infringement.",
            "The asian ARPG mobile games are always good. One of those fake ads showed Diablo 3 gameplay, another one Path of Exile gameplay, because we all know phone games have 10 Keybinds right?",
            "Those companies base themselves in places where the legal system either does not care at all, or cares very little and is hard to navigate.\n\nYour next question is probably \"won't the ad providers filter them?\" Unfortunately not. There are ad providers that do, but those providers also have other rules, like where/when you can place ads, what content can be in the ads and what layout they can have (ever noticed the really shitty ones with a big X in the corner? Places right under, but a bit higher, then the X to close the ad? If you hit that bigger X, it counts as a click to the ad)\n\nThe issue is that these ads don't go with those ad providers, they go for the other ones, the ones also based in countries that make it hard to stop their blatant copyright infringement. They don't care, they pay out to anyone who requests ads and they take money from anyone who offers it. They work through bulk, not through quality, so they end up being the providers many app developers go with because otherwise they'd have to deal with pesky rules like \"ad must not interupt gameplay\"",
            "First content owners need to be made aware of who is doing it ",
            "Mobile games are garbage now. They just make a quick buck and shut them down when the lawsuits come rolling in ",
            "I think sometimes there’s a small disclaimer that says something like , “advertisement does not represent actually gameplay”. I feel like i’ve seen those disclaimers before. ",
            "That makes to much sense for youtube.  Slow down",
            "Also the mobile ads who have streamers up in the corner and it looks like they are playing it but they aren’t ",
            "the way most online advertising works is you upload a video, and pay to have those ads served. the video can be whatever you want. it would be impossible for google or whoever to verify every ad is legitimately representing what they sell. so as long as it's not something like porn or snuff, it's going to get served as long as you pay. it's pretty much up to the users and whatever companies they're stealing from to report and get those kind of ads taken down.",
            "Don't even get me started on the ads for Hustle Castle! In the ads it depicts a battle royale game with guns, when it is really a castle-managing Simulator type game, kinda like Fallout Shelter, and there are no guns, cars or good combat.",
            "GTA 5 Mobile! Play now!\n\n\nFuck YT ads man",
            "Why do all games show rendered videos and movie type crap rather than showing the actual gameplay? \n\nHalf the time I have no idea what type of game it even is, because they never show the HUD and gameplay footage in ads.",
            "Red Alert Command in Conquer seems to be the click bait of choice lately... If that's really the case why wouldn't US companies just clone the game (C&C) and change graphics? ",
            "Ya, I see ads all the time where it steals gameplay directly from a bigger game like clash of clans (just an ex.) And then the game doesnt even look like that",
            "Usually it comes down to jurisdiction.  Example, if you are not Chinese and a Chinese dev is stealing your intellectual property to shill their bullshit mobile game, you'll never get a judgment against them in a Chinese court and you'll never enforce a judgment against them that comes from a foreign court.  Ultimately its up the the folks that host the storefronts (apple store, google play store, steam, etc) to curate their marketplaces and weed out the shovelware, the scams, the blatant copies, etc, and none of them seem interested in doing that.",
            "You've accidentally stumbled upon a portion of the underlying causes for the current U.S.-China relations.",
            "If you look at the bottom of the screen, the small print says \"not actual gameplay footage\" and now there's the opposite too on a few games that're happy to showcase the graphics and such saying \"trailer made from in-engine footage\" ",
            "No one litigates them and ad companies have 0 liability.",
            "I don't know about video games but copyright is a huge issue for artists. ... in the only US options are private litigation. Expensive, and the bad guys know that. Free wheeling theft with little consequence.",
            "honestly I have no clue. there is/was a mobile version of rainbow six siege and they quite LITERALLY stole the characters, maps, abilities, weapons and more straight from the game.",
            "I just assume that all the ads are fake now so I don't get disappointed ",
            "Another thing that I’m sure isn’t illegal but it is very annoying is ads that are 30 seconds but have games after the initial ad and you can’t exit and they don’t have a timer.",
            "That \"GTA V mobile\" ad with Franklin in a Cop suit made me ask myself the same thing ",
            "Every mobile \"pokemon\" game ever",
            "im afraid that this is the dawn of a new era, where corporations just dont have to be honest, or even remotely accountable for their advertising, claims, or products. asbestos is actually making a giant comeback. next people will be told to think smoking cures lung cancer.",
            "I once saw an ad that was just the fucking pokemon anime intro. The game wasn’t pokemon nor anime it was just some ad filled rip off",
            "That's how Mafia works. ",
            "I saw a crappy game (Car Bumper.io) use GTA V footage before.",
            "Basically mobile gaming on the whole is the fucking wild west. There's a dude in Vietnam who copied our app exactly, then added a bunch of Marvel skins. Despite reporting it, it's still in existence and probably earning him a living wage.",
            "China.",
            "Nobody gives a shit. I mean they literally rip off each other's games with impunity. ",
            "I can't help with filtering the terrible ads you're seeing, but if you're willing to block the ads, there's an open source tool called blokada that works very well. I got sick of the sketchy ads and attempted hijacks of web pages and installed blokada. The only (potential) downside I've seen is that when you Google search for products, the Google ads at the top can't be clicked. \n\nGood luck! \n\nhttps://github.com/blokadaorg/blokada",
            "Seen the same thing a lot for Homescapes, Gardenscapes, and Township. They all use the same little preview but the game is nothing like it. ",
            "There are so many games that get released on a daily basis it would be impossible for anyone to keep up with them. What I want to know is how it’s aloud in the ad space for them to put on fake “X’s” on the ad so you cannot close them until the real one appears 31-33 seconds later.",
            "Never forget the one that was an “in depth strategy rts game” but it just used videos from YouTube of total war games.",
            "Civilization fans be like",
            "If I see a game advertised on my phone I assume it’s a scam. ",
            "I think this is part of how the world works now and it's tough! When outlets were fewer and advertisers were limited to fixed places such as the TV in the ad-break, in newspapers and magazines, and on billboards, their advert would always be there to be checked. Now I have the impression the fleeting nature of ads as they move across the internet has lead to more monkeying around. This also applies, more seriously, to political campaigning where a party can use Facebook etc's targeting methods to focus on a vulnerable, perhaps easy to manipulate, group of voters with misleading ads that disappear into the aether as soon as they are viewed. It's unlikely somebody will hold them to account.",
            "R/shittymobilegameads",
            "There’s no regulation on mobile ads. It’s a free for all and there are no consequences if they lie",
            "Because that's how Mafia works",
            "[removed]",
            "Most ads are just as bullshit and misleading, you just see it with games because you know them really well.",
            "Have always wondered this. ",
            "Because thats how mafia works",
            "[removed]",
            "I know right! It pisses me off to see these mobile games steal footage form total war or mount and blade warband",
            "China.",
            "Because that's how mafia works. ",
            "A better question is: why are you clicking on ads? And why are you playing games that produce ads like that?  ",
            "Ark of war steals r/dreadnought gameplay",
            "Because it's probably Chinese, and what do Chinese people care for patents etc",
            "Probably the same reason that fragrance commercials can show people surfing, kissing, and doing fancy things. Advertisements can get away with imparting a sentiment. They aren’t restricted to being a documentary of the precise details of their product. \n\nIs it shitty? Personally, I think so. But that’s advertising; it’s not just with games.\n\nThere’s a line with anything, though, and if you purchased a game that you believe was falsely advertised, and that the advertising led you to buy the game, you can sue https://www.classlawgroup.com/consumer-protection/false-advertising/laws/",
            "There's one ad that's really playing with fire. It uses the music from the desert levels in Mario Bros for the DS. ",
            "Huh",
            "Ikr ive literally seen Pokémon be advertised for some stupid mobile game",
            "What got me was the ads I saw last year for Saiyan Legends that used snippets of Megadeth and Metallica songs. ",
            "Recently I got an ad for a Minecraft clone and it was just the video with pandas, the official Minecraft one",
            "Pi-hole",
            "I once had a car bumper game ad and it used the car bumping mini game from gtaV. The thing was it was stolen from someones YouTube video and u could see a bit of his webcam which they tried to cut out but couldn't cut out fully because it would've ruined the ad.",
            "Call of War using Napoleon Total War... ",
            "I hate when they use stronghold games to addvertise their shitty games like war and order",
            "I keep seeing some zombie game called Last Shelter: Survival or something which is just a blatant ripoff of Fallout Shelter",
            "Well the games are free, so they aren’t making money directly from purchasing the game",
            "I've seen so many mobile strategy games use age of empires 2 screen shots...",
            "I remmember a srick fighting game that basicly use a Youtube clip and stick it as their add. It show dtick figure using ability fighting while ingame you litereally just float around doing nothing",
            "I saw an advert that was clearly Cossacks 2. So clear that I can say it was Cossacks 2 and yet the game wasn’t Cossacks 2 at all! It was shit. ",
            "Lack of giving a fuck by advertising companies. Google AdWords for example cares more about you not showing adds about weed than openly sponsoring hate groups, violence, fraud, ECT. \n\n(I think the weed changed in the last few years, but you get the idea)",
            "This is how mafia works",
            "The most angering thing I have seen is a screenshot from Mount and Blade: Warband\n\nNo edits at all, no mods, they didn't remove ANY HUD or reticle, they didn't even put text on the image!",
            "No, it’s false advertising, unless it is a free game, then I believe its legal as your not paying for it. If it’s straight from another game then it could be copyrighted.",
            "depends on what's stolen, are you speaking of assets, then yes that's an issue.  Game play mechanics, that's not copyrightable...",
            "That’s how mafia works",
            "Theres one called Mon Research that literally uses the titles for Pokemon Sun and Moon in their ads, as well as using pokemon from the games before cutting over to their own OCs.\n\nIn countrys like Japan and China copyright law is basically nonexistent, so they can develop there and then push to the global app store.",
            "Many times it’s not the developer directly, but a shady affiliate looking to make a quick buck. They don’t care if the ads get banned, they’ll get paid for their installs anyway. \n\nAs a developer for a legitimate online product, keeping affiliates honest is one of the harder things to do. They often go to great lengths to make sure the company they’re an affiliate for never sees their shady ads. ",
            "While im here has anyone downloaded tacticool and does it do ad scam crap",
            "That how mafia works.",
            "that's how mafia works",
            "guys use blockada its a good app  "
        ]
    },
    {
        "post_id": "p63p39",
        "author": "psylentt",
        "title": "Is it wrong to not want to date people with kids?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/p63p39/is_it_wrong_to_not_want_to_date_people_with_kids/",
        "score": 14190,
        "num_comments": 2382,
        "created_utc": 1629206597.0,
        "selftext": "** I think it's interesting most people here are assuming I am a man. 🧐 **\n\nI got told I was wrong and selfish for not wanting to date someone with kids. \n\nI personally don't want kids and feel that eventually, especially if marriage occurs, those kids become part of your life. At some point, you become a parental figure in their life.\n\nEdit: For a little more context, this has happened to me a few times. If you have kids, put that in your dating profile! I was talking to someone and found out through IG that they have kids. They went off on me and said I was selfish and wrong. I have dated with men with kids, even ones who promise there is no drama, there always is. I think it's a huge responsibility to date someone with kids and if it ends up serious, it's a responsibility I don't want!\n\nEdit2: I am a woman. I think people just assume a woman wants kids and I'm selfish for not. So some men with kids think it's selfish of me or there is something wrong with me because I'm supposed to want and be around kids.\n\n\nEdit3: I asked because it has happened multiple times! I'm like am I the asshole? 🙄🧐\n\nEdit4: I'm 33. I'm pretty firm on this stance of no kids.\n\nEdit5: Wow, I didn't expect all the answers. Again, I understand it's preference, I was just shocked that this is NOT the only time I have run into this! Appreciate the responses and verification I'm not being ridiculous.",
        "permalink": "/r/NoStupidQuestions/comments/p63p39/is_it_wrong_to_not_want_to_date_people_with_kids/",
        "comments": [
            "It's very understandable, in my opinion. If you don't want to date someone with kids, then don't do it.",
            "Not at all.\n\nDate who you want to date.",
            "Personally, I have found that when someone is pushing me to do something, they have a vested interest in me doing that. They are calling you selfish because they are being selfish.\n\nEdit: Wow, my response really resonated with people. Thank you for the likes and awards!",
            "What’s really selfish is dating someone with kids knowing you don’t like/want kids, and staying.\n\nEdit: clarification, I’m not just seeing it from one side. People hide their kids until they start dating, and people seek out parents when they know they don’t desire to be parents at all, I’m saying either being with someone or being the parent with someone who you KNOW doesn’t want kids, or more kids, or just don’t want to be parents is unfair to the child. Every kid deserves to feel wanted and loved by parent/parents.",
            "No, it’s not wrong.. I’m a father who has his son staying with him 3 times a week. He’s always my priority, even though I have plenty time for a significant other..\n\nI’d much prefer that someone understood that having a partner (me) with a child would be an issue (for them) from the outset.. It would avoid much heartache in the long run…",
            "You’re allowed to have whatever dating preferences you like. \n\nI actually think it’d be wrong to date a parent unless that was something you genuinely wanted. I see it as pretty unfair when people get into relationships with parents and try to act like the kids are somehow separate from that. Kids deserve not to feel like unwanted third wheels in their own homes.",
            "Who told you that? To hell with them! Stand your ground. You have your provisions and you stand by them. I too won't date anyone that's a mom. I did that once. When you do that, you will be involved with the father. Suppose you bond with the kid and then shit goes bad and you want to break up? Now you're breaking two hearts. Forget it. Don't worry about what people say. You're NOT being selfish.",
            "It's more wrong to set unrealistic expectations I feel, a lot kinder in the long run to stick to your boundaries than to try and push them aside only to get whiplash later",
            "No I think it's good that you realise that. You'd hurt those kids if you dated someone with kids but don't want anything to do with them. Also it's your life, you get to make the choices you want.",
            "Most good single parents wouldn't want to date anyone who didn't want children, and would respect a person who told them up front instead of letting things progress any further. There is nothing wrong with not wanting to date someone who has children! Anyone who told you you were selfish or an asshole for that is wrong.",
            "The subject of kids should be like any other facet of a potential relationship.  If it's part of the package that comes with the relationship and it's a deal breaker, then so be it.  I don't want kids.  I don't want to take care of kids.  I don't want to spend extended time around kids.  I tried to date a girl with kids and explicitly told her all this.  She said it wouldn't be a problem and I shouldn't worry.  One day she left me at her house with her 2 daughters while she went grocery shopping WITHOUT SAYING ANYTHING TO ME.  They expected me to entertain them.  That's exactly what I didn't want to happen.  It didn't work out.  Oh well, moving on...",
            ">I got told I was wrong and selfish for not wanting to date someone with kids.\n\nDon't take any more relationship advice from this person.",
            "You can literally not date someone because they like mayo, is easy as that, you don't want? You don't do it",
            "Some people are down for it, some aren’t, but you should never feel ashamed for declining a relationship due to the person having a child. Sure, it’s sad that that’s the one boundary keeping you apart, but if you know that’s not what you want in life, don’t settle for it. I never wanted a child because I didn’t want to deal with being pregnant or the infant screeching stage. But I met a girl who had a child and I decided to take the leap anyway and see what happened, as I’ve never dated someone with a child, and I thought it could be a new experience for me, at the least. A year and a half later, I now have a 4 year old daughter I didn’t have to birth myself that I can teach and watch grow up without having to deal with the infant stage. There’s someone for everyone. Go for what you want in life, don’t let others make you feel bad about it.",
            "I mean not having a kid or wanting a kid is your right to choose, thus not committing to a relationship that comes with a kid is reasonable.",
            "I have kids. I don't think that's selfish at all. If you're looking to date and not get instant family, just add water, then pick someone with no kids. Simple as that.",
            "Would probably be more selfish to date someone who has kids when you aren’t interested in having them.",
            "I'm a woman, age 57. I never wanted and never had kids. I'm happy.\n\nThere is no way that staying child-free is selfish. Whoever told you that is not your friend and who definitely isn't trustworthy.",
            "Agreed. As a single father, I wouldn’t date anyone who doesn’t want kids. She would resent them.",
            "You know what you want, or in this case what you don’t want: children as a big responsibility so if you don’t want any (whether yours or through a previous pregnancy) then ignore those crazy comments and just date who fits your lifestyle.",
            "It is absolutely not wrong. I felt the same way when my first marriage ended.  My daughter was in college, and I found a LOT of single men my age were just looking for a mom for their kids. I knew I would be a bad stepmom, so I avoided those men, whenever possible. \n\nDon't let anyone talk you into, or guilt you into something you don't want to do.",
            "If a person is looking for a serious relationship, then they *really* need to put that in their profile.\n\nOtherwise they're just playing games and have no right to complain if it puts someone off.\n\nI've seen quite a few people deliberately post that the kid in the picture is or is not theirs, because this is actually, you know, *kinda important*.\n\nAnd yes, I would argue that already having a kid decreases your match pool by a larger amount than it attracts. So some people leave it out, perhaps hoping that it will be ok that they left out this large part of their life.",
            "I have kids and I would not want to date anyone who wasn’t comfortable with them being in the picture. Please don’t listen to whoever told you that. You’re making a choice for yourself that best fits your plan, people who don’t understand or agree for whatever reason may call it selfish, but I think it’s sensible. I don’t date people with kids under a certain age because mine are older and I don’t want a snot-nosed two year old running around. I’m past that stage and grateful for it.",
            "No? What is that question? If you don't want to date someone with kids, then you obviously don't have to.",
            "Those men are having trouble finding women who will pick up the extra housework for them. \n\nIf a man calls you selfish for having boundaries about what you want in life then like, bullet dodged. He would have found another way to be a problem later.",
            "It's not wrong. Anyone who tells you otherwise is full of shit.",
            "As someone who is also child free, though not dating, I’d be willing to bet that you hear this a lot. People are generally very rude about the choice not to have kids. Of course it isn’t wrong. But I imagine you’ll hear it for quite awhile. Just like we listen to parents constantly complain about their children.",
            "If you don’t want to date someone with children, then don’t. It would be selfish to date someone with a child/children and then to dislike the child/children, causing stress on all fronts of the relationships.\n\nYou know yourself better than anyone else. Sounds to me like you have your head on straight.\n\nFrom personal experience: Even if you like the children and the person, definitely do some research before jumping into anything. Blended families are rough.",
            "Mom here. I’m married, but I would never find it odd or “wrong” if I didn’t want to be dated or pursued specifically because I have a child.",
            "It is fine - be honest and if that is a deal breaker then no dating moms or dads.",
            "Not wrong at all. \n\nKids are a *major*, and *permanent* lifestyle choice. It's completely reasonable for that to be a deal breaker for you. \n\n> I personally don't want kids and feel that eventually, especially if marriage occurs, those kids become part of your life. At some point, you become a parental figure in their life.\n\nYES. I've met parents who say, \"I'm not looking for a stepparent for my kid\", or \"he has a mum\", etc. Fact is, if a parent gets into a serious relationship, the partner is going to become a parental *figure*. Whether by design or not, that's just what happens. \n\nYou're not selfish. Parents need to accept they're a package deal now, and you're perfectly entitled to not want that package, just like having any other dealbreaker. And they should definitely put it on their profile, I agree.",
            "It's only wrong to date kids, and adults who don't consent to dating you.",
            "Its not wrong, its not selfish. Kids are overrated, especially if they are not yours.",
            "I dumped a guy I loved because he has two children and it’s just not the life I want. I wouldn’t be involved but they’re expensive",
            "Not at all.  When you get into a serious relationship with someone you need to accept the baggage they bring.  Kids are a big part of that baggage.",
            "There is absolutely nothing wrong with that.",
            "No. Your allowed to have preferences.",
            "You’re not selfish, OP. I’ve also been in your shoes (dated guys who had kids and didn’t disclose that info immediately) and I’m a 30F who does not want kids. Children are a huge part of their parents lives, and hiding that from another person you’re looking to date without discussing that fact up front is pretty manipulative. Not only would you have to deal with the kids, chances are you’d be dealing with the ex as well. If that’s not your cup of tea, it’s not your cup of tea. Respect to you for knowing what you want and sticking to your guns.",
            "Im a woman. Didn't want to date a man with children - although here they usually don't live with him and are over only every other weekend. Still I didn't want to deal with children every other weekend, didn't want to see some of his money go to his former family (I mean, yes, I want it to be that way, but I don't wanna be with somebody whose paycheck is shared with somebody else. It's limiting opportunities, which - if I want us both to make them - I have to compensate. So indirectly, I pay for his former family) and I also didn't want to plan our life together with some space for other children. It's just a hassle since I'm no fan of children anyway.\n\nSo on the contrary. If I don't want to engage with children, it's only fair if I don't date somebody with strings attached. It's fair for the person and the children plus for my mental health. I mean, what's the alternative? Being a shitty person trying to ignore the children or push them out? Nah.",
            "We live in a society really weird about women who don't want to be surrounded by kids, so expect some weirdness from that side.\nBut imo, no, you are not wrong, if you don't want that responsibility, it's wrong to take it just because \"\"you should\"\", you may eventually be a maternal figure for that kid and it's not fair for any of you. \n\nYou can date whoever you want and not date them for whatever reason you think it's right. But other people can think that you are selfish for it if they see it that way. In choosing a partner usually there are not \"correct\" or \"wrong\" reasons",
            "Nothing wrong with that. I would not date someone with kids either. I personally think it puts more pressure on you.",
            "Those men are angry because they're being babies about rejected..  and since they're acting like immature children themselves you obviously shouldn't date them.\n\nI have kids, I love kids, and it's totally reasonable and healthy for you to decide not to date people with kids! \nBeing childfree is a valid choice, and it doesn't make sense for you to enter into a relationship where kids will (rightfully, eventually) be a big part of it if things progress.",
            "No. Absolutely not. I don’t personally want kids, and I don’t want to waste my time or theirs.",
            "Kids are annoying",
            "No, kids are a huge commitment even when people say 'Im not expecting you to be the other parent'. I would never date someone with kids unless the kids were adults",
            "You can have way more specified demands and it's still not selfish. It's your life, not dating someone can't be selfish. You don't owe your life to them! If you are rather alone and wait for a better fit, that's more than your right.\n\nThis goes on to those who have unrealistic goals too. If a 5 will only date a 9+, that's their right. The person is only wrong if they start arguing that everyone else is a problem that they are alone. As long as anyone is happy with their own situation, no one else should have a say on the topic.",
            "No.  If you’re not interested in children, it’s more responsible to keep out of their lives than it is to insert yourself as an apathetic role model.",
            "No",
            "Of course not. You don't date out of obligation. There's perhaps no choice more your own business than who you choose to date.",
            "Why would a parent want to date someone that doesn't like their kids? That makes no sense. The only time I've ever seen someone date someone else who hated kids, she completely abandoned her kids for him, leaving them at her mother's and just never talking to them again. The relationship lasted about 3 years until he got her pregnant. She thought for sure he would change his mind now that it was his. He told her he wanted her to get an abortion because not only did he not want kids but she wasn't a very good mother since she abandoned her other 2 kids. I wish I could have been there to see her face. Anyways, she had the kid and he left her way before then. Completely moved to another state and she's not been able to find him for years. \n\nIt would take a very terrible parent to get with someone who doesn't want children.",
            "I got 3 kids and there is nothing wrong with not wanting to date some who doesn’t have kids. In fact if more people were up front about it would have saved me some heartache. Too many folks don’t want to say “sorry but kids aren’t for me” instead I dated an asshole who wanted me to always find a sitter and wasn’t very kid friendly when I couldn’t get sitter or didn’t want to find a sitter.",
            "i dont think it's wrong perse.\n\ndating someone with kids means they'd always put their kids first priority and you second.\n\nits like dating a celebrity who will never have time for you.\n\nso, as long as you are upfront about not dating anyone with kids, i personally see nothing wrong with it.  if they withheld any details that they have kids in the first place though? it's a dealbreaker imo. not because she has kids, but because she was dishonest about whether she had them or not",
            "is it wrong to be a human with preferences? may as well just be born a robot. if you think that's bad, imagine not wanting to date at all.",
            "There is nothing wrong with not wanting to date someone who has kids. There is nothing selfish about it. I think it would be more selfish to pursue a relationship with someone who has kids knowing you don't want kids. \n\nI am a divorced mom of two, and for now I am fine not dating. However, when I am ready to get back into it, I plan on being up front about it. Why wouldn't you? Go ahead and save everyone the trouble and be up front at the beginning.",
            "I have made it my rule,  as a parent myself with teenage/adult children, I will only date others with the same situation... those with adult/teenage children.\n\n  I adore kids, yet, I do not want to have young children as a part of my dating life.  I find that as much as I may adore the child/children, I'm selfish now.  I want time and spontaneous moments with my partner,  not scheduled moments between responsibilities of parenting younger children that I cannot participate or have any say in the parenting.  Especially when things don't work out, then you've fallen in love with those kids AND your partner, and then they, along with your partner, are now absent from your life.\n\nIt's heartbreaking. \n\n\nI say these things as a 46 year old woman as well, with this exact experience under my belt. So take this with a grain of salt.  Plus, I am looking forward to grand babies maybe soon.  I want some time in between that stage I am inow,  without having to arrange my life again around softball games, and cleaning cheerios out of my backseat... been there and done that and am now too fat for the T-shirt. \n\nIf you don't want to date someone with children, create that boundary,  and stick to it.  You're not being selfish or wrong, you are being considerate to yourself, and your potential partner.",
            "Not only do those kids become a part of your life, but if you stay with the parent, THEIR kids (grandkids, which often require a lot of grandparent babysitting these days) will be a part of your life.",
            "People who get mad because you dont want to date people with kids are actually mad that their dating pool is considerably smaller. And if it was no big deal like they want you to believe they would have no problem putting that in their profiles.\n\nYou dont need a \"valid\" reason not to date someone.",
            "My friend, r/childfree is for you as is this post",
            "I thought i was in another subreddit and was gonna say \"not the asshole\"\n\nThere's nothing wrong with not dating someone with kids. in my late 20s I kept matching with women with a kid or two. All very nice people that I had a lot in common with, but there was no chance of a future because I simply do not want children for a laundry list of reasons.",
            "Yes it's wrong. Sorry, but you have to want to date people with kids and you will be forced to or I will call the police.",
            "if you don't want kids, that means by proxy you don't want _someone else's_ kids. \n\nHow is this hard for anyone to understand??",
            "I once had a guy hide the fact that he had a kid from me… I was only 21/22 at the time, and he was 28. Went on a few dates and one day I saw in his car that he had a car seat, which is when he confessed he had a son. Told the guy I wasn’t interested in dating someone with kids because I literally just do not want them (and I was really young??) and he went OFF on me.\n\nKids are part of a lifestyle. It’s not a small dealbreaker like, I dunno, not liking pizza or something. You are literally dating a person as well as potentially becoming a parent figure for their kid. Don’t let anybody tell you that it’s selfish for cutting out that part of your dating pool. You’re allowed to not want to date people that conflict with what you want in life.",
            "I'm the same way as a guy, same age too. People with kids in their 30s vs people without kids in their 30s is a huge difference in life, everything from priorities to time and to-some-extent maturity. But most importantly, life experience is vastly different, which can be a monkey wrench no matter what the difference in life experience is.",
            "As a women as well, when I find out someone has kids I immediately lose interest and kindly cut ties. Dating or not, I even find being friends with people who have kids at my age kind of a put off.",
            "If you are interested in a long term relationship, but uninterested in children, it is probably better for the everyone involved for you to pursue someone without children.\n\nChildren are wonderful, but there is no way for you to avoid becoming effectively a parent to them. If you aren't ready for that, I wouldn't do it.\n\nIt will at minimum create incredible friction when he/she constantly needs small things from you like leaving work early to pick them up because they are sick from school or they cancel a date at the last minute because they have strep and you never wanted any of that.",
            "You might like r/childfree",
            "It's very right if you don't want kids. That's a hard boundary. Don't be afraid to enforce it and tell all the clearly miserable parents who want you to be miserable too to shove it.\n\nAlso, head over to r/childfree to find others like you. You're so not alone in this. There's a whole community!",
            "Why should you have to date a man who is becoming a woman if you aren't into that? Or a obese person when you live a fit lifestyle? Or a short person when you are taller?\n\nIts all the same thing, we have preferences, and no one is entitled to make you date outside of them.",
            "As a woman with kids if you aren't ready to be an active part of those gets life you are doing the right thing avoiding men with kids. Also I have almost never seen a situation where a childfree woman's decision to stay at a distance from the kids is really respected as the woman you often end up doing a lot of his parenting for him....",
            "Some of these comments are more than yikes.",
            "Hell no. I fucking hate kids. Thats a solid deal breaker.",
            "Welcome to the world of personal preference",
            "You should never date someone with kids if you dont want kids. And you should never date someone who does want kids if you dont want kids.\n\nI will say though that single mothers get a bad rep IMO and get kicked to the kerb far too often when they have more to offer than a kid on the hip from a failed relationship.",
            "You're not selfish. If you don't want to have kids, you don't date people who have kids. It's normal.",
            "As a divorced father of three wonderful kids @45yo, I tell you you are doing the right choice. If you don't feel like having kids and also like managing them, even if from another relation, don't do it. It's your life and your choice. Kids are demanding, more then people like to say. I respect your choice. Ignore other people judgement. They are probably envious ;)",
            "No, if someone have kids and you are not confortable with that it's not selfish, it's a boundary. I wouldn't date someone with kids neither.",
            "Your life, your choice.  It's called being honest and responsible.",
            "No, I think it is understandable. I am happily married but if something tragic were to happen I wouldn't want to date anyone that didn't want to deal with kids. It is a lot of responsibility to join someone who already has a family. If it was someone interested in you that said you're selfish it sounds to me like they were just angry that they were in a situation that prevented y'all from dating. Oh well, if you're direct with them they should grow up and move on.",
            "The person who told you this is completely ignorant. No, it is not wrong. Kids are a lot of work. They are always going to be around. This is a justified preference.",
            "I dated a man with 2 kids. 6 months after we got married his ex dropped off his 2 children plus 2 more from other men. I got 12 hours notice and she never came back. I was 21 with 4 children. That was more than I could handle so never had any of my own. Life has a funny way of driving your car! Knowledge is power. It is your right to have all available information before entering into a relationship.",
            "I’m sick of people judging others for their preferences. You do what makes YOU happy. Fuck everyone else",
            "Women who doesn't want kids here. I also rarely date people with kids because I dont even want to be a step mom (I dont want my own kids, why would I want someone else's?) Whenever people ask me why I dont want kids, I unashamedly tell them its because I'm selfish with my life, time and money. \n\nI love kids, love being an auntie to my family and friends children, love spending time with them and then love going home without them. There is nothing wrong with this.",
            "Keep dodging those bullets, in my opinion.  If they can't even be honest about something as significant as that, then there's no limit to what deception they are capable of.\n\nMen get it from women in the same situation - it's hard to date as a single parent, because eligible single people aren't looking for a premade family, and there's nothing wrong with that.",
            "Nope, not at all.  I don't, never have and never will.",
            "I'm about your age and while not entirely opposed to the idea of kids, I'm not ready for that responsibility and don't really want to date someone with that responsibility. I've heard the same bullshit about how \"selfish\" I am... but I don't see it.",
            "My friend was talking to someone for a month or so and then found out through Instagram he recently had a newborn. She was not looking to date anyone with kids. \n\nHe didn't have the decency to be upfront about it so she ghosted him. Then he texted her a few weeks later asking why she stopped talking to him. She said he wasn't honest about being a parent. Had she known, she wouldn't have talked to him.\n\nHe knew what he was doing. He knew if he mentioned he had a kid, his dating pool would potentially be smaller.",
            "Kids. Are. The. WORST.\n\nMy partner and I don't want them, either. Never have. Sounds like you are more sane and realistic than most people.\n\nParents are always like ”I was *toooootally* like you before having them, but then something just changed. Ya know? Now my life isn't compete without them.”\n\nNo, Kathy/Darrell, your stupid lying ass always wanted kids and always thought they were ”special little gifts” from some magical omnipotent being. It has been brainwashed into you, and now you have to lie to yourself to keep your sanity.\n\nNext moment they're annoyed AF by their devil spawn doing some stupid shit that drives them bonkers. ”They're just so precious.”\n\nSure, bud. Sure.",
            "Fuck no, especially if they’re below 30. They can be single it’s their problem they got knocked up at such a young age",
            "I think it is wrong and selfish for people with kids to expect others to be okay with it and even be a parent to those kids that aren't theirs. Like yes, some people out there won't have an issue in sharing your heavy responsibility. But do not expect everyone to be like that. It will lead single parents to disappointment. Everyone has preferences. Is it homophobic for a straight woman to no longer want to date or find attraction to a man who has sexually transitioned to a woman? Hell no it isn't! It is preferences. We have no issue with with having kids. Just remember that they are yours. Not everyone wants kids or wants to date people with them because not everyone can handle to burden of children. If you date someone with kids then you will definitely have to share that burden. It is selfish for single parents to expect everyone to be fine with it. They should put it on their dating profiles.\n\nI read a post yesterday about a person who walked out mid date after the woman disclosed she has a kid. Why? Because it wasn't for him. If he had known, then he wouldn't have continued chatting. They were talking for a couple of weeks before so she should have definitely told him then before arranging a date to save the embarrassment. She also purposefully kept that information secret because she knew it is a big deal breaker for most people. \nSingle parents, please do NOT withhold this kind of information. Some people will not agree to a date if they know this information. Some people will walk out on dates after having this information sprung on them. Do the right thing and be completely honest and transparent from the start. Don't call others selfish for not wanting to be around children or not wanting to help raise YOUR children. Go in grace and be thankful that you aren't going on a date with someone that dislikes kids.",
            "Of course not. They have their own lives, you may want to start a family and not join one.",
            "You can date whoever you want, and not wanting to date someone with dependants is absolutely reasonable. There’s a significant lifestyle difference. \n\nI’m also a woman. I do want kids some day, but I wouldn’t date anyone with kids (back when I was single) because:\n\n a) I wanted to travel, go to bars and on dates, and I believed that someone with kids would have commitments that would take them away from that lifestyle. Having a kids takes the spontaneity out of life.\n\nb) if there are kids, then there’s likely an ex in the picture. I don’t want to be dealing with my partners ex on a regular basis. \n\nc) If I’m in a serious relationship with someone, I want to be their most important person. You don’t get that with people with kids- their kids are their number 1 priority. I think I’d get jealous.\n\nd) we’re just in different places in life\n\nIt’s not wrong to not wanna date someone with kids. It’s actually one of the most sensible reason to not want to date someone. Anyone who tells you otherwise is a single parent who feels judged abs dejected. Tough titties to them.",
            "Totally reasonable. As a single mum I wouldn't want to bother with someone who would find my daughter a problem, and I wouldn't want my ex bringing a woman who doesn't like kids into my daughter's life. Being clear about your preferences is a win-win for everyone.",
            "Even if it is selfish, be selfish, fuck other people and their bad choices.",
            "Me personally i refuse to date someone with kids, because 1 - i don't want to be second to someone else's rugrat... 2nd i don't like kids, but and 3rdly....if i have them by accident from \"too much fun with the woman\" 😉 I will only raise my dna, my bloodline, my responsibility. I refuse to raise another mans kid. My blood or gtfo.",
            "I wouldn't date anyone with kids because most parents fucking suck as people.",
            "# r/CHILDFREE",
            "NTA. Whoever told you you're \"selfish\" is an idiot. \n\nPeople tend to forget that HAVING a baby is selfish, while bringing up a child is very unselfish. The contradiction catches out a lot of people.",
            "I think you would enjoy the r/childfree community. We often talk about how we prefer not to date someone with kids and then struggles we encounter. There is nothing wrong with not wanting to be responsible for kids, especially somebody else's. We all want different things in live and have different goals, and for a lot of us, kids are not a part of any of those.",
            "Find your people at r/childfree",
            "Definitely not the asshole. I (32f) also do not want kids and never had. I would 1000% avoid entering into or leave a current relationship if the partner revealed they had kids or wanted kids. It is not wrong or selfish to not want to date someone with kids. I have dealt with loads of similar comments from people in my life regarding my decision to not have or want kids and it never ends. Very common for non-child-wanting women to be shamed for it. Even by close family members. I've just learned to ignore comments like those.\n\n\"you're going to regret it when you're older\" If I regret anything it'll be my tattoos...but probably not those either.\n\n\"you'll change your mind\"  Maybe you'll change your mind and be saddled with kids for the rest of your life in regret. If I change my mind, I'll just adopt.\n\n\"soon it's going to be too late\" Good. I literally, cant wait to not have periods anymore.",
            "You’re definitely fine. (Says me, who is quite annoyed that my friend is dating someone with a kid who is now at all our social gatherings….)",
            "No. Not everyone enjoys picking up a game from another person's save.",
            "Why should you take care of someone else's kid if you don't want to? You didn't nut in her",
            "No.",
            "Of course not.",
            "They are not you and you like what you like period.",
            "No it’s not wrong. If that’s not what you want then that’s perfectly ok. It’s a difficult situation to put yourself into a ready made family. Especially if the other parent is still around. You do what is right for you.",
            "Nope",
            "Absolutely not. As a single dad, while she's older now, when she was little I'd rather not be getting feelings for someone only to find out it wasn't going to work because them and my kid weren't a good fit for each other.",
            "Not at all. When you’re with someone they’re kids come with. No one should ever guilt you into that.",
            "It’s perfectly reasonable for you to not want that. It’s honestly responsible of you. Being a parent is hard and there are no days off from it. It would only hurt you, your partner, and more importantly that child who had no choice.",
            "Nah",
            "of course not",
            "You can date whoever you want, lol, there is no limit to what filters you can have. Nothing is wrong when you are just choosing who you want to spend your life with (while single, obviously).",
            "nope. Not at all. Can't believe this is even an argument.",
            "No. You have preferences, just like they do.",
            "Only the people with kids seem to have a problem with this standard. I have zero interest in dating anyone with kids less than 20 years  had a couple of people insinuate that it was wrong somehow or I might find someone so great that I would overlook the kids somehow. \n\nWhy would I want to date someone who is going to put me second at best?  Or divide their attention?",
            "Hell no. I do not want to be a parent or step parent, ever.  I am the result of a 2nd marriage for both my parents. My older brother was pretty much screwed over by our mother's selfish choices and I want no part of that in another person's life.",
            "Nah.  You  don't have to answer to anyone about what you want or don't want in a potential partner.  If you don't want kids as part of the deal, then that's absolutely fine.",
            "Absolutely not selfish. It’s a personal preference. Don’t let others shame you. I’d rather someone be honest with me.",
            "Not at all buddy.  It's your life and you need to live it your way.",
            "yeah, I said the same thing to my wife after our daughter was born.",
            "no, u also don’t owe anyone anything while dating. The only time preferences are weird are when they’re racial! It’s perfectly fine to not want to date someone with kids, plus it would be extra headache on your end if you guys become more than dating",
            "I wouldn't... And i have kids...",
            "It is not selfish and wrong to create the life you want for yourself. It sounds like this guy is looking for a woman to push off his parental responsibilities off on.",
            "lol. Nah. I have 2 kids, and I'm single. I wouldn't want to date someone who saw that as a problem. You do you, champ.",
            "Real bummer coming from a single weekend dad who hasn’t had as an easy a time moving onto better relationships. But its reality. Oh well.",
            "Not selfish. \n\nYou do you. \n\nIf you want 0 kids then you want 0 kids.",
            "It is not wrong. Kids are hard. Step kids are harder. If you know you don’t want to end up with kids, then wouldn’t it be wrong to date someone with kids?",
            "Kids aren’t for everyone. I personally don’t want kids because I couldn’t bear the extra stress of thinking about what could possibly go wrong in their lives and whatnot. And selfishly, I want to travel, and having kids just wouldn’t allow that.\n\nLive life the way that *you* want to, not how everyone else says that you should.",
            "Not at all. In fact, you can not want to date anyone for any reason at all and it’s perfectly okay!",
            "No. This is totally fine. It's a much better thing to do that saying I really like this person. But they have kids that I HAVE to deal with. If you don't want to be part of kids lives and are okay with not being part of their parents life either. Than I say don't do it. It'll build the wrong relationship with both parties.",
            "No, I don't even want kids myself so it's just a total dealbreaker for me, always.",
            "Being a parent isn’t just the fact that they have kids. It’s an entire lifestyle that is extremely different from the lifestyle of people who don’t have/don’t want kids. It’s the same as a fitness freak who hikes daily and someone who hates exercise and chills at home. Why would one want to date the other? Completely different lifestyles and probably different values as well",
            "I don't think it's wrong at all! Having kids or even being in a child's life as a parent figure is a HUGE commitment. I applaud you for knowing your mind and sticking to it.",
            "No, it's pretty dumb to impose your beliefs on other about who they prefer to date so screw whoever's been telling you you're selfish. \n\nWhat I will say is that keep in mind that more than 50% of the people you might match with already have 1-3 kids of their own already. Most men might not live with them and most women will. Honesty is the best policy, most of the time I'll be looking at someone on a dating app that I matched with and think oh they might be great and the more I delve further into them they have a kid they didn't say anything about in the profile. Personally I am the same and that part bothers me because then 1 or more dates in when they feel comfortable with you then they might tell you about their kids and you're just left there feeling like you've been led on after a bombshell like that. \nI have no doubt some people can be step-fathers and mothers and love it but it's dumb to expect everyone to be onboard with that especially if they don't want kids. Nothing selfish about it, just honest.",
            "It’s perfectly fine not to want to be a parent, but please don’t expect people to put their kids in their dating profile.\n\nPeople already run the risk enough with creeps after trying to vet them- there’s no need to increase the chances by announcing to millions of stranger that you have kids.",
            "HEY!  Single dad here... and there's nothing wrong with you not being interested in dating me due to my kids.  They receive the majority of my non-working time and I don't have enough spare time to provide the kind of active social life as a non-parent could.\n\nI'm not totally daft or self-centered to think that you need to change your expectations on my behalf.  If you want a big chunk of your partner's time, and have that time not involve kids running around, then you *shouldn't* be interested in dating someone who gives more of their time to their kids than to you...",
            "Sounds like the person who told you that was projecting their own insecurities on to you. Life pro tip: you don't need to care.",
            "Not wrong at all.  People need to stop being so damn hypocritical.",
            "Nope, kids will 10000% be apart of your life if you are with someone with kids. Unless that person has given custody to the other SO and refuses to apart of their life. Your totally fine not wanting kids. They aren't for Everyone",
            "No, it's completely OK. Better to not date them than to make them choose or not like the kids.",
            "Honestly, I think you know this better than 1000 random strangers on the internet. You know whether your reason is a good one, or whether deep down it is a selfish one; if you say it’s a good reason, it’s a good reason, and nobody else gets to judge.\n\nReading through your edits, I would just like to add one detail: “It is a truth universally acknowledged that a man in possession of a decent dating profile must behave like an asshole once he gets rejected.” Seriously, especially on some of the dating apps, there are a lot of guys with very fragile egos.",
            "Thanks for asking this. I’ve been told the same.",
            "I am a man and totally agree and understand you. I will never date a single mother.",
            "I'm the 1000 comment. Your welcome. \nAnswer in no",
            "Kids are higher priority. So you are secondary. Would u like to be secondary in a relationship, no way.",
            "No.  I had a similar conversation with a friend.  Dating someone with children means you will always be second (or third or fourth…) in the heart of that person.  There’s nothing wrong with that either.  However, especially if you’re young, you can both be the same age, but the person with children will see and experience the world differently than you.  It’s just natural.\n\nNow, if you don’t mind or feel threatened by the children, it can be very rewarding; and there are many single parents who would really love to have an adult to share their lives with and show their children the love they deserve.  But there’s nothing wrong with feeling the way you do.  Anyone who says otherwise is being a jerk.",
            "Sorry that people have tried to make you feel bad about this. It's not the right choice for you and that's all that matters. No is a complete sentence and you don't owe anyone an explanation.",
            "You're totally fine to not want kids, and in the same vein; it's absolutely fine not wanting to bear any responsibility for anyone else's kids. I have kids, and wouldn't want to date someone else with kids. Honestly I dont want to date at all, but still. We all have our own responsibilities, goals, dreams, etc.. And kids, your own or otherwise, can seriously impede reaching them.\n\nHaving kids is a *personal* choice.",
            "No, you're not selfish. I am a newly single 35 year old woman with a 15 and a half year old son and if someone didn't want to date me because I have a child that is their prerogative. It's not selfish, it's your personal preference. You should choose what direction your life goes in and if someone calls you selfish for that then honestly, fuck em! Who are they or anyone else to tell you who you should be open to dating or not.",
            "It’s your life.  Yes would only advise don’t be destructive or hurtful, but be as picky and selective as you want.",
            "The same way you wouldn't want to date me, it's ok to not to date anyone else based on your own criteria. Nothing wrong here",
            "Almost all young single people don't want to date someone with kids. Every time it comes up, guys talk about single moms like the worst possible option lol.\n\nSeems harsh to me, but I'm a married dad. I like a good milf.",
            "Nta. Is it ok to have preferences when choosing a partner? Yes.",
            "You can date whoever the fuck you want",
            "My dude. You can date whoever the fuck you want.\n\nIgnore all gatekeepers.",
            "No. \n\n/thread\n\nI'm a 27 year old father with a 4 year old son.",
            "Fuck all that other advice, here's the real shit:\n\nIt's OK to be \"wrong\" and \"selfish\" if that's really you.\n\nOwn it.",
            "Nope-- it's good policy.",
            "My own kids drive me fucking nuts. No way do I want to deal with someone else's on top of them. Definitely not wrong.",
            "HELL FUCKING NO!!",
            "There's a million and one reasons to not want to date someone, they can be small and petty, or huge and big commitments.\n\nIs it selfish? Perhaps.\n\nIs it wrong? Hell no, you're mature enough to know for that one reason, it will put a dampener on things.\n\nWhen it comes down to not wanting to date someone with kids, that's completely understandable because that's a (or at least it should be....) huge part of their life and will be for many years.\n\nTo expect someone to come along into a family in that way and refuse to become a fully functioning family unit is awful and a lot worse than just being a single parent, especially if you have no intentions of having kids anyway.\n\nJust be thankful you dodged a bullet because even if they didn't have kids, their inability to accept that is a red flag.\n\nBad enough when it's something petty like glasses or hair colour, but kids are a huge commitment to become a part of. Sure you aren't blood related, but if all goes well you will end up as a parent....sure, you won't be the final say in their lives, but you'll still become a part of their lives and to suggest otherwise is making a tricky situation into a messed up situation.",
            "It’s perfectly acceptable, I broke up 3 relationships before I met my husband because they didn’t take me seriously, thought I just wasn’t ready or would come around at some point. I was very upfront, even on the first date, when you are getting to know each other, “do you have any kids?” “No, I’ve never wanted children.” Point blank, if you want kids, have them, if you don’t, don’t.",
            "No its not wrong or selfish or anything at all. If you dont want kids then you have all the right to be with someone who doesn't have children.",
            "You can pick any reason you want to not date someone",
            "Kids are a real commitment, and it shouldnt be taken lightly as the non-parent. It’s not wrong to not want to make that commitment.",
            "As a 33 year old guy, who really has no interest in having kids in the next 5 years, I get called immature. Like sorry for putting my desire to travel and see the world before I get arthritis above my apparent social obligation to procreate.\n\nPeople are weird, do your own thing and ignore the haters.",
            "Nope! You 100% should be comfortable with who you date! This was my hard stop. You be you!",
            "It's fine. That's a deal breaker for you. Will everyone agree? No, but that just means they're not the right person for you.\n\nI mean, I have a kid. I still totally get it.",
            "Nope.if you don't like kids you aren't doing anyone a favor dating single parents.",
            "I have a kid and wouldn't blame someone for not wanting to date me. Kids require attention and understanding. If you arent their parent you just won't have the ability to understand what they need like their parent does. It will feel like you are second fiddle because you are.",
            "How is it \"selfish\" to not want to date someone that has a lifestyle you couldn't get on board with ?",
            "Nah. U do u boo.",
            "You should carry no guilt about this whatsoever!  One time during a phone call with a future blind date guy who I hadn’t met yet  I asked if he was a felon, he said yes, and I said I’m sorry I just can’t date you.  He got really pissed at me, and I said would you have rather me not tell you and you waste your time and probably money you would have spent on me during the date?  He said no, I asked then why are you upset with that and asked do you really want to go out with a girl who has an issue with dating felons? and I said I just gave you the respect that any man deserves, honesty. It’s okay to be a felon, I just don’t want to date a felon.   Wouldn’t you want to date someone who doesn’t have issues? He told me he saw my point, then hung up.  I’m okay with being the asshole, you should be too.   You never know what life holds in the future.   I also wouldn’t date guys with long hair or guys that would put their hair in a really short ponytails.",
            "no. I see these kinds of questions all the time on subs like this one.\n\n**it’s perfectly okay to want or not want to date someone based on anything going on in your or their lives.** \n\nwe all need to do what’s best for ourselves in the long run.",
            "You can date whoever the hell you want to date",
            "I think it shows a solid understanding that if you date someone who is a halfway decent parent, the kids are part of the package when things get serious. And if someone has kids but purposefully has no part in their life or is willing to cut them off for a romantic relationship, that should be a massive red flag anyway.",
            "You are not forced into dating anyone you don't want to. Anyone who says otherwise can fuck right off.",
            "Fuck, I don't want to have my own kids, let alone raise someone else's.",
            "I dated a few  woman in the past with kids, it was never a no no but sometimes it comes with some baggage, often there's an ex & some left over fighting or bitterness about money or child sharing arrangements...sometimes it felt like I was stuck in the end a couples relationship & I just wanted something simpler, I ended up marrying someone with no kids, & we were not being able to have any....you just don't know what life throws up.\n\nI actually found the kids a lot of fun, I got on with them better than some of the mothers, one in  particular is a grown man now & still pops in to say hello every now & again.",
            "It is THEIR baggage, not yours!!!\n\nYou are not wrong. Why should you pick up the tab for their screw up?",
            "I have 1 toddler and 1 on the way and I don’t think it’s wrong. I’d rather someone be transparent with me from the beginning. It would save a lot of heartache.",
            "Nope. You get to define what you want and not wanting kids is part of that. In any form. I’m also a 33 year old woman who doesn’t want kids. I recently married a guy with a 9 year old son that he has half the time. But the kid is a literal angel and the coparenting relationship with his ex wife is really healthy.  If those things were different I’m not sure I would have signed on.",
            "No, you can never be in the wrong for not wanting to date someone, for any reason. Period. If you don't want to date them, then don't date them.",
            "That's called preference. I mean I wouldn't date anyone who doesn't have good hygiene, and no one has the right to dictate me on that",
            "I will never date a man with children again. When I was in my mid 30's I met a man with 2 lovely kids who I got on with really well but I didn't realise I was being pulled into a very toxic situation between him & his ex wife. He turned out to be an abusive narcissist & I was very lucky to get away from him. The kids made it difficult to leave as I had a strong bond with them- he used them to gain my trust & pull me in. I was in that relationship for less than a year but have spent 5 yrs in therapy and i am still paying for that mistake with low self esteem & social anxiety.\n\nI know that's an extreme situation but I do think it's good to be aware of what you may be walking into. As we get older you will be eliminating a big chunk of the dating pool if you cut people with kids out so if you do, make sure to have strong boundaries. I think it's a red flag or at least not wise to meet the kids for a good while (6 months?) - I would talk about this, if they're keen for you too meet soon I would say not until you have a good feel for the person youre dating. I would take note of the relationship they have with the other parent, how do they talk about them - it may not be their fault the relationship is difficult but if they bad mouth them and talk ugly about them that's a red flag for me. Be careful not to be used as ammunition against the ex partner- keep out of things & have strong boundaries here too.",
            "Not really.  Dating someone with kids is almost always agreeing to a more complicated relationship with more than 1 other person.",
            "I think it’s more than fair to not want to date someone for ANY reason. It’s your life and your relationship, nobody else’s opinion should matter. Which I guess negates this comment but it’s true nonetheless",
            "I *probably* wouldn't have a problem dating someone with teenage kids (kids you can leave home alone for a day or two) \n\nI wouldn't date someone with small kids, I want to go on weekend trips together\n\nBut I am 21, so people my age don't really have teenage kids...",
            "You’re by no means obligated to date anyone? If you see a potential issue with their lifestyle, you’re allowed to not date them, especially if you’re dating with intention. I’ve found that step parents who became step parents without really wanting to usually tend to harbor a bit of hostility usually unintentionally, and that’s never fair to a child. So if anything, choosing to avoid this isn’t selfish it’s selfless.",
            "Fuck the bs, it’s more than enough humans on the planet and your not obligated to add or sanction others existence. You do you hun",
            "Of course it’s not wrong to have that preference, and fuck anyone that says otherwise. Fuck anyone that keeps legit criteria like that a secret for too long as well.",
            "Hey it completely makes sense, don't worry people with common sense are on your side.",
            "I have seen through friends and family issues at times when one dates a person that has kids, like u said that person becomes a parental figure.  Point being make sure u and the significant other are on same page with co parenting if u are living under same roof. I see way to often where the kids come for example on the weekend and go crazy where if something is said or done by the boyfriend/girlfriend the mom may not agree with you disciplining or correcting them when they are in the wrong.  Even though they are not ur kids, dont plan on having kids... that can cause arguments between two people when one is in that environment.",
            "No",
            "Depends on the age of the kids. I'd be happier to date a man with teenagers upwards because I know they'll be doing their own thing than a man with a toddler. More because I want some attention and (most of the time) young kids are attention sucking snotty gremlins.",
            "No, I think that is completely fine.",
            "I don't care if your preference is not dating anyone with five toes on each foot - it's still your preference, and preferences aren't wrong. How you go about it can definitely be rude, though, but that doesn't seem to be the main issue here.",
            "No, you do what you want.",
            "No. You have your preferences. Period.",
            "I am 34 and married, I don’t want children - we don’t want children! It is very reasonable, to not want to date someone with children. When I first started dating my husband, he said he could never date someone that had a kid. It wasn’t so much the responsibility of caring for a child but not wanting to have doubts on whether the woman he would be potentially dating had feelings still for the kids father. Children are a big responsibility and it’s okay to want that in your life.",
            "I don’t want kids and won’t date someone with kids. Thought having an adult kid would be ok, but now I am stuck with a grandkid and an adult that I can’t get rid of even tho I am not the biggest fan of them",
            "People have kids for selfish reasons in the first place so to hell with em",
            "It's pretty simple if you see it from their perspective. They thought they had it all. Decided to have kids in some cases to early. It didn't work out. They are single now, feel entitled to a relationship. They already bring baggage so they don't want someone else with kids. Now they're pissed of nobody without baggage wants them.",
            "I don’t think there is anything wrong with it, especially you don’t want kids! If you want to be in a committed relationship, you would have to commit to the kids as well.\n\nI want kids someday, but I’m not mature enough for something like that now. I’m not ready for that kind of commitment.",
            "You’re allowed to have whatever dealbreakers you want. \n\nAlso, you’ll have to come to terms with the fact that the child’s mother will likely always have some sort of presence in the man’s life, so keep that in mind.",
            "Of course not. It's vital to be honest with yourself before you get into something like that.",
            "I have kids and I think it’s your choice. No hard feelings.",
            "No, its better to say up front what you're looking for. Saves precious time and possibly heartache.",
            "Why the fuck would that be selfish? You're not obligated to date *anyone.*",
            "Do what makes you happy as long as it doesn't harm others. Being true to your own interests will make your life and the lives of others easier on the long run as you wont be pretending to be into something for the sake of other's, and wasting both of your time. So long story short nah your fine to not be into it lol",
            "No.",
            "No. Who the fuck says so?",
            "Of course it's not wrong. Anyone who tries to guilt you into feeling otherwise is someone you don't need in your life if you can help it.\n\nBesides... you said it yourself. You're firm on not wanting kids. You've made your mind up. And you need someone who will understand and respect that and share that stance, because it's a pretty damn important stance to share. It's not \"Well, I normally don't date people with long hair,\" or \"We both hate washing the dishes, but *one* of us has to.\" Kids are a huge investment of time, money, and energy. Nobody should *expect* everyone to want to make that investment.\n\nAlso, that guy calling *you* selfish because *he* wasn't up-front about having kids and you had to find out through other means... to hell with him. He has some nerve.",
            "It's okay to not date anyone for any reason",
            "Pretty selfish to mislead potential partners about a huge part of your life. Letting someone know early on that you have kids is very different to introducing you to the kids early.\n\nIt’s manipulative and weird to hide something g like that.",
            "No you don't. And you don't need an excuse. I'm a childfree woman and I'm not dating someone with children. No you're not selfish. Don't listen to anyone who tries to convince you that you are.",
            "Not only is it understandable, it’s *responsible.*  I caught some shit for that when I was younger and still single, but I am a man.  It’s not that I wouldn’t be respectful, or interject, or be put upon or whatever.  At that period in my life I wouldn’t have had shit to offer them except kind of being a bad influence.  Like, I smoked cigarettes, I’m a pothead, do you want me getting stoned in front of your kids all day, because I’m gonna be getting stoned all day.  I don’t know how to care for a child at all, I’m ADD’d to the gills, I can barely keep my own appointments and shit, do you really want me ever in charge of keeping theirs?  I was having trouble getting my own coursework done for college, you think I’m going to be able to help them with shit?  Nah, it’s for the best for everyone, that’s why you’re right to be straightforward about that.",
            "Anyone who tells you that your selfish is just self inflated. We ALL date people for our own reasons. Everyone finds themselves unable to date someone. \n\nIf we said yes to every person who asked us out that would be ridiculous. The people judging you for not wanting to date someone with kids have not dated people for more petty reasons than kids. We all have.\n\nI say, all power to you.",
            "Nah, you're all good. It's not selfish, it's your life and you should live it as you see fit.\n\nSingle parents who complain about this are so self involved. It's almost like a survival or defence mechanism or something - like they need to affirm the choices they made (which they are potentially now questioning given they are single...)",
            "It is understandable. Additionally, dating anyone who hides an important part of their life from you is a losing proposition.",
            "I always had a \"no women with kids\" rule, then I met my partner. She had a 4yr old when we met. Best decision ever to break my rule. Both of them have made my life so much better. Wouldnt be without her and dreading the start of empty nest syndrome when she heads out into the world in a couple of years.",
            "Everyone has preferences. You  cannot blame yourself if you don't get aroused by or don't find the look of trans-persons, black or fat people beautiful. You may find that certain personalities or people with certain life styles suit you better. You cannot force yourself to be attracted to someone you are clearly not attracted to. Desire is unconscious. What you can control is how you treat people.\n\nP.S.: (I'm assuming that you are heterosexual here because it's most common) Would you think that it's wrong that you only date people of other gender?",
            "The person who told you that BS probably has no life.\nDo you know how much BS people have talked in my face?\nI probably could not fit it into just one book.\nIt would be the size of a set of encyclopedias because I would add illustrations and full color flow charts.\nDating is a personal choice that you make for yourself.\nWhoever told you that garbage is probably like the town gossip.",
            "No. It isn't wrong. You're not selfish. I don't date people in the military. Why? I have my reasons. You don't want to date someone with kids? Don't. That's not wrong and it's not selfish.",
            "No I get it 100%, as someone without kids I shouldn't have to ruin my life catering to your kids when I was smart enough to not have any.\n\nIt's like they want you to suffer in their misery",
            "Join us over at r/childfree. It's very okay to be childfree and want to date others who are childfree as well! Being childfree is the opposite of being selfish. Just look at the [environmental impact alone](https://www.sciencemag.org/sites/default/files/styles/inline__450w__no_aspect/public/greenhouse_DRUPAL_copyedited-01.png?itok=LpKE5fZe)!",
            "Absolutely not surprised everyone assumed you were a man at first, probably the only reason they responded in the first place. Reddit is so toxic between genders.",
            "[removed]",
            "Who wants to be player two in a already loaded save",
            "I have a kid and was not interested in someone with kids..i dont want the baby mama drama that comes with them. Everyone has their own preferences and there is nothing wrong with it.",
            "r/childfree welcome's you and your clean hands",
            "absolutely why would you want to raise another mans child?",
            "Kids are fucking awful. And they make any relationship awful. I don’t understand why anyone would want to deal with that shit.",
            "I mean besides climate terrorism, not having kids is the single biggest thing you can do to hinder the progress of climate change.",
            "Hey it's your life, you pave your own road that you wanna walk in, what's wrong with that?  Everyone else can just go fuck themselves.  Go live your life girl.  Same with people who fall in love and get married, only to realize you married her whole damn family apparently."
        ]
    }
]