[
    {
        "post_id": "e3qwvg",
        "author": "lil_kibble",
        "title": "How do I get rid of a real hand grenade?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/e3qwvg/how_do_i_get_rid_of_a_real_hand_grenade/",
        "score": 13958,
        "num_comments": 1514,
        "created_utc": 1575089610.0,
        "selftext": "My late grandfather had what appears to be a hang grenade from the Korean war in his house. Knowing Pop-pop, I'm honestly not surprised. The pin is still inside and there's no hole in the bottom (it would have the bottom drilled out if the gunpowder or whatever was taken out). I've considered pulling the pin and chucking it in the woods or in the creek out in his backyard but the age of the device makes me afraid that it might misfire or something and go off in my hand and I kinda still need that. I thought about calling the authorities but it would be really embarrassing if they came to get it with a whole team and everything and it turned out to be a dud. I honestly have no clue what to do about and I'm just hoping reddit can help. Thanks.",
        "permalink": "/r/NoStupidQuestions/comments/e3qwvg/how_do_i_get_rid_of_a_real_hand_grenade/",
        "comments": [
            "The police and bomb squad won’t mind. They’ll probably kind of enjoy it.",
            "They won’t be embarrassed if it turns out to be a dud they will be relieved. Do not attempt to handle this yourself it is not worth the risk.",
            "If it goes off in your hand, then losing your hand is the least of your worries. A grenade going off that close has a strong chance of flat out killing you. It could be a dud, or you could die. Even if it works perfectly, you could throw it wrong and die. It's much too risky to mess around with it yourself. Call the police. They can get experts who know what they're doing.",
            ">throwing a grenade \n\nI mean, there's a reason everyone's veteran pop-pop can barely hear shit, has ringing, and they've got shrapnel all over em.",
            ">I've considered pulling the pin and chucking it in the woods or in the creek out in his backyard\n\nDon't.\n\nIn fact, don't even move it. If you haven't touched or moved it yet, don't. Some kinds of explosives become unstable over time and can be set off by vibrations. (In Germany and France they occasionally have old shells, buried in the ground, spontaneously going off.)\n\nEven if this were a brand new grenade in perfect working order, you should not goof around with it on your own. High explosives make a very loud noise and can damage your hearing; and if it's a fragmentation grenade, you might be surprised how far it can spread dangerous shrapnel.\n\n>and go off in my hand and I kinda still need that.\n\nIf it goes off in your hand, you'll be missing a lot more than just your hand.\n\n>I thought about calling the authorities but it would be really embarrassing if they came to get it with a whole team and everything and it turned out to be a dud.\n\nCall them anyway. They'd rather find a dud grenade than have to scrape bits of you off the walls of your living room.\n\nBe careful what you tell them. Don't say 'Hi police, I have a grenade!', because then you'll sound like you're calling in a bomb threat. Say something like: 'I was going through some of my grandfather's stuff and found an object that may be a live explosive, I'd like a professional to handle it. It's at [address]. I'll meet you outside.' They'll tell you the usual stuff about not touching it and evacuating any other people from the area.",
            "[removed]",
            "Just call the local number for the police. Much cheaper than hand replacement.",
            "[deleted]",
            "[deleted]",
            "Call your local authorities, they will call an Explosive Ordnance Disposal team to come pick it up. Don’t be embarrassed, it’s what they’re paid to do. I would also recommend you stop fiddling with it, it very well may be live and very functional. \n\nSource: Retired EOD tech. \n\nThey’re obligated to leave as soon as you call it in and it may be several hours on the road for them so if I were you I would wait until Monday morning when they’re all sober.",
            "[deleted]",
            "A few years ago there were a lot of cops outside my house. They said that they had found some explosives and were going to detonate them in the park opposite my house, and that I should stay inside my house. But they were just hiding behind their vehicles, so I decided to photograph the explosion. I set my camera to take 30 second exposures. After a long time there was a little piddling explosion like a box of matches burning, and there was a little hole on the cricket field.",
            "The local bomb squad will be absolutely thrilled to come out and play with their toys, even for a dud. Seriously they love it.",
            "Do. Not. Touch. It. Call the police, please. They’ll take care of it, it’s their job.",
            "The police will dispose of it for you.",
            "Here’s a good story: when I was in middle school or maybe freshman year, I told my friends about a grenade that my dad had. He always told me it was real and from his dad/the war, and he kept it super high up hidden away and all that. Once I told my friends about it, it was like an obsession, they constantly wanted to see it and we were all fascinated by it. Eventually I relented and I showed them where it was one day when my parents were at work. We were circled around it all arguing about if it was real or not. My one friend was strangely silent and just intently staring at it the whole time. My parents lived on a 10 acre property in the desert so there weren’t many neighbors or anything. Suddenly, the silent friend says “fuck it,” and he grabs the grenade, pulls the pin, and just chucks it into the sagebrush. For a split second, we all shit our pants, we were like running and diving behind shit and hiding, screaming and yelling. Adrenaline pumping we are all covering our ears just waiting. And waiting. And waiting. After what seemed like ages we slowly came out of our hiding spots like “wtf?” And that’s how I found out my dad was a master troll",
            "Call the policy immediately could be a dud, could not be a dud. You feelin'  lucky?",
            "OP,  I had this exact thing happen to me,  get it to the police.  Call them, don’t drive it to them like I did.\n\nAfter some questioning I was let go without issue.\n\nBetter safe than handless",
            "Back at my old base we used to receive call requests like this all the time. Local police would receive a call, then call our base if they couldn’t handle it themselves (99% of the time they couldn’t). Ordinance found in a shed or back yard were the most common.\n\nDO NOT TOUCH IT. Best to hang out outside away from wherever it’s sitting. Contact your local police’s non-emergency number. Explain to them what it is, the situation and a detailed description without handling it. They’ll send someone out to get eyes-on then coordinate with either a civilian or military EOD team to come retrieve it for you. Please keep in mind that it may not be quickly, as most military teams are off today they’ll have to call their folks in, get their equipment and travel. My base’s team were responsible for 3 states in the Midwest. It could take several hours. Don’t worry about having to call people in on their time off, this is their job. They’d rather sacrifice their time off than knowing someone got severely injured or killed from something they could’ve prevented.",
            "Your hand (and your life) is more important than embarrassement",
            "There's one answer and one answer only:  \n\nCall The Police\n\nI mean, you could potentially sacrifice a limb for karma but you run the risk of that limb being a really important one ifyouknowwhatimean",
            "Just call the police and explain to them. It's not worth the risk.",
            "[removed]",
            "Call the police, it is definitely a reasonable suspicion.  They will not get angry at you either way.  It's literally their job to do this stuff.",
            "Ok so what you do is remove the entire description and just say \"Time sensitive\"",
            "If it looks real, call the police.",
            "Listen, call the police. The amount of post in r/whatisthisthing that are labeled Bonn’s or explosives or grenades is a lot that they have a dedicated bot and like a bunch of former EOD military dudes that all say put it down, don’t touch, call police.\n\nYou call the non emergency line, say hey my grandfather was a Korean War vet, he’s dead now, I found he has a grenade, it’s not painted blue (training grenade), it’s not drilled out on the bottom.\n\nIf it goes off in your hand you WILL die at that range. Cops will come to the scene horrified at your death which isn’t as good as them coming over and seeing a dud or live grenade. \n\nPlease just call them OP",
            "Please don't touch it or try to use it. I agree to call the police and let them detonate the explosive",
            "u/lil_kibble, Any news OP?",
            "Call the bomb squad like advised and make pics OP.",
            "[removed]",
            "As the old saying goes: \"Better safe than sorry\". The authorities would much rather spend all that time to find out it was a dud than to clean up what's left of you after it goes off accidentally.",
            "I want an update on this one lol",
            "Call the cops mate, not worth accidentally losing a hand or dying from it",
            "It's not embarrassing at all to ask for help in such a situation. I guess that the only safe way to get rid of that thing is detonate it under controlled conditions. And if it doesn't blow up who would have known? No one would blame you for doing the safe thing. it happens in Europe too that you dig up something from world war II. People call the police.",
            "Police was made for shit like this man, call em",
            "[removed]",
            "Never undermine the riskiness of a situation like this just because you think that calling the cops might be \"embarassing\" if it turns out to be fake, call the police, be safe and be practical, your safety and your life should take top priority in situations like thise.",
            "Don't throw it in a creek. Mark Rober did an excellent video about what happens when a grenade is thrown in water. It kills a lot of the fish.\n\n[https://youtu.be/W4DnuQOtA8E](https://youtu.be/W4DnuQOtA8E)\n\nI would just call the police.",
            "Is it the holy hand grenade of Antioch? Yes? Then chuck it at the nearest killer rabbit. If not, call the cops.",
            "Assuming you haven't blown yourself up yet, allow me to borrow from /r/whatisthisthing's Automod:\n\n.-\n\nYour post contains words that indicate you may possibly be in possession of [unexploded ordnance (UXO)](https://en.wikipedia.org/wiki/Unexploded_ordnance).\n\nIf you're unsure, the first thing to do is **LEAVE IT ALONE.** Do not shake it, attempt to open it, or disturb it at all.\n\nNext step would be to **CONTACT THE PROPER AUTHORITIES.** If you're unsure who that is, call your local police or emergency number for instructions.\n\nPlease followup with an outcome regarding what was done with the object.\n\n.-\n\nNow that that's out of the way...\n\n\n> I've considered pulling the pin and chucking it in the woods or in the creek out in his backyard\n\nFirst off, take your head, OUT OF YOUR ASS, and use common sense. Put the damn thing down ***GENTLY***, walk away, ***and call the fucking police.***\n\n>but it would be really embarrassing if they came to get it with a whole team and everything and it turned out to be a dud.\n\nAnd it would be less embarrasing to blow yourself up? ***Call the fucking police.***\n\nThey would much rather blow up a movie prop then have a dumbass blow himself up.",
            "Bro call the police lmao",
            "Call the police and they’ll have the bomb squad come out and handle it for you. It’s the safest route. Either a local bomb squad or military is really the only options for this.",
            "Call the police non-emergency line and explain the situation to them. Even if it’s a dud, they’d rather you call than not.",
            "When we were kids my friends found one when doing a yard sell at their grandmas. Police sent the bomb squad out and exploded it in sand. It was cool and we all got in the mess paper.  It was actually two brothers and when one first found it he hot potatoes it to the other one.  Not the brightest.",
            "CALL THE AUTHORITIES YOU CAN NEVER BE TOO CAREFUL WITH THIS STUFF",
            "This happened to my family! Call the non emergency police department line and they will send people out to retrieve it. Apparently it happens quite often",
            "read it as \"From the korean war....knowing K-pop\"  \n\nEither way, **you** do not handle this, it will not \"go off in your hand\", it will spread fatal shrapnel up to 25 Meters away, you included.  What you do is leave it exactly where it is and **call the goddamn bomb squad**.\n\nOr else you may end up like [this loser](https://i.imgur.com/J1lBjZA.jpg)",
            "**Absolutely** call the police.  **Now!**  If it's 3am where you are call them immediately amyway.  No one will be anything but relieved if its a dud.  You aren't EOD trained, no one expects you to know if it's live.  Don't handle the damn thing.  Explosives get less stable as they age.  Anything could set it off now.",
            "How much do you know about explosives?\nHow much does your local/county/state bomb squad know about explosives?\n\nCall the local PD and tell them you found what you think is a live grenade from your grandfather's stuff. They will tell you what to do from there (do not touch it, move all people and pets as far away as possible).\n\nIf they decide to detonate it on site, stream it live for internet points.",
            "What ever you do, don't BRING it to the police. They'll probably be pretty mad if you walk in, Grenade in hand.",
            "It's way better to be a little embarrassed (which you shouldn't be) than to loose a freakin arm. Call the bomb squad.",
            "Navy EOD Tech here, \n\nIf you call 911 they will dispatch the local bomb squad who most likely will call the nearest military bomb squad to come and take possession of the grenade. No need to worry about getting in trouble, these situations happen all the time.",
            "I found a firecracker. A big one. An M-80. Maybe 3/4 inch across, 2 inches long. In Arizona all fireworks are illegal. I was about 1/2 block away from the fire dept so I went there to turn it in. I told them what I found. They asked where it was. It was in my shirt pocket. They freaked and ran me outside, as I  brought \"explosives\" into the building. They called the police. Police told me to take to their office, stay outside, call them and someone would come out. I did. An officer came out. Duck walking. Holding a mailing envelope in her out stretched arms. Asked if I was the one with the explosives. I said I was. I took the firecracker out of my shirt pocket and showed her. She instructed me to carefully place it in the envelope. One of those with air bubbles inside. Explosive rated I guess. She said either I was the most highly trained person she ever met, or the dumbest. I was playing with these when I was 8-10 years old. I have had training with explosives. Where the m-80 can blow off fingers, it is a long way from being  \"high explosives\". Use care when you turn it in. Some overly excited person in charge might freak and send out an air strike.",
            "Not even kidding, this happened to me. We called the RCMP, and they sent over an officer to verify it, then evacuated us, and sent in the bomb squad. They took it away and blew it up. Fun fact, we’d had it on the windowsill in the kitchen and thought it was a dud for days.",
            "Call the local police department and explain what's going on. Don't worry, the only person who is breaking the law is your grandfather and I doubt he's gonna care if they arrest him at this point...\n\nThe cops will call in your local bomb squad who will come and completely overreact, acting like it's a nuclear bomb instead of a hand grenade. They'll use the opportunity as training, which is something you really want your local bomb squad to have plenty of.",
            "Actually had this exact situation happen.  We were cleaning out my late grandfather's shed on a Saturday and found an old grenade.  We called the police, and they sent over someone from the bomb squad.  Dude rolled up in shorts, a t-shirt and a backpack.  Pulled out a roll of duct tape, taped down the lever, and tossed it in his backpack.  Then casually strolled away and told us to have a nice day.",
            "My house is on fire but it's a small fire, I don't want to call the fire department and have them laugh at me for it being such a small fire. What do I do?\n\nTrust me these guys live for these moments, dud or not they will love it. If nothing else it's great training.",
            "**STOP. STOP RIGHT NOW.** Stop moving, stop thinking, stop analyzing, and for shit's sake ***stop plotting***. Right now, gather whomever is in the house and go to the curb of your front yard. Dial 911, and tell them this: \"I may have discovered unexploded ordnance in my home. It was in grandpa's stuff. I'm going to feel humiliated if I'm wrong, but I don't want to take the chance.\"",
            "Call the bomb squad....but if you have your heart set on ignighting it in a very, very unpopulated area you could secure it into place and use a long rope to pull the pin out...but don't do that, call the bomb squad, they should understand, old pop-pop being a war vet.",
            "Don’t struggle with the decision.  Call local police.  But first make dam certain any and all firearms in the home are legal and stored correctly.  Definitely do not pull the pin.  It will make handling that much more dangerous if it misfires and needs to be rendered safe.",
            "There should be a lever on the side of the grenade. It’s a redundant safety. When you grip the grenade, you hold that lever down. Even if you pull the pin, so long as that lever is being held down, nothing will happen. However, without the pin, as soon as you throw it (and are thus no longer holding the lever down) the lever will pop off and the fuse will start. It will explode 3-5 seconds after the lever pops off. If you decide to do that make sure there’s a barrier between you and the grenade no matter how far away you throw it, just to be safe. It probably has shrapnel in it which will be sprayed in every direction from the blast. Oh, and cover your ears. The boom is going to be MUCH louder than you think, if you’ve never heard a grenade explode. \n\nJust explaining how grenades work for your own peace of mind, so it’s not such a mystery to you. The unknown can be scary. I’m a U.S. Marine if you’re wondering how I know about grenades. \n\nAll that being said, I recommend notifying the authorities and letting them handle it if you don’t want to keep it. It’s not like their normal day doesn’t consist of far more boring things than that, and they’ll know exactly how to safely dispose of it.",
            ">I thought about calling the authorities but it would be really embarrassing if they came to get it with a whole team and everything and it turned out to be a dud.\n\nThey won't care.",
            "Call the cops. Like 50 will show up.",
            "Perhaps you could contact a museum? A Korean War artifact could be worth some money, plus they could help you dispose of it.",
            "Just call non-emergency and explain the situation, just uhhh don’t be holding it when they arrive :D",
            "I have a deactivated one.  We had the hell scared out of us when we found it.  My dad grabbed it and unscrewed the top of it, and was like \"see it's empty.\" Yours could be too. It was a fairly common souvenir apparently.   Mine was in a small tin/cardboard sleeve marked frag also.",
            "Dude you're lucky! Call the fire department. They're trained for danger. Cops are trained for threats.\n\nTell them you've got an old grenade your grandpa left behind, pin-in safe-in-box and you want their help disposing of it. \n\nIf you're lucky they'll take you with to a fire training facility which are by function blast proof (fires make some pretty serious pressure differentials). Tie a string to the pin and pull it from a safe distance.",
            "> it might misfire or something and go off in my hand and I kinda still need that.\n\nDo you though?",
            "Give it to the police, let them know before hand the situation by phone and tell them the same you told us",
            "I might suggest doing some more research on the grenade. The book of armaments is a good read. Chapter 2 verses 9-21 is the section on grenades IIRC.",
            "That thing is a weapon that was engineered to cause an explosion that would deal as much direct and collateral damage as possible to personnel and equipment. Not enemy personnel or enemy equipment, just personnel, and just equipment. It doesn't discriminate. It is an extremely dangerous hazard and can easily kill many, even outside of its local blast. Call the authorities and have the bomb squad come pick it up. Definitely do not remove the pin and chuck it anywhere.",
            "Sell it to some freaky looking teenagers",
            "Seriously, I wouldn't even risk it. I wouldn't care about embarrassment. I'd call the police non-emergency line and ask them to send a guy from their bomb squad over. He can then answer your question from the perspective of someone who actually knows what they're talking about.  \n  \nIf you go to handle it, it is real, and it goes off. You'll be killed instantly. Grenades have a kill radius of up to 30 yards in all directions. Unless your arms are 31 yards long, you could be RIP.",
            "They will just be happy if it is a dud because then it will be safe for them also.",
            "Yea just call the police. I wouldn’t pull the pin. It may be unstable and might not go off immediately. Then you’ll have to call the police anyway and on top of that.. explain why you pulled the pin, and threw it. I don’t think they’ll be happy about that.",
            "Okay well, *don't* throw it into the woods, that sounds ridiculous.\n\n\nYou're better off being embarrassed by a dud than dead",
            "I've actually been in this situation before (thanks grandpa). I called the police and like 4 hours later a UXO team showed up and took the old MKII Pineapple from us and put it into their special trailer. They said that at the end of the week, they'd detonate it at a quarry with whatever else they had stocked up at the time from other calls and home visits throughout the month.\n\nEveryone was safe and everything was uneventful. The way it should be!\n\nAlso, /r/EOD always has good advice. All the mods there are active or prior technicians.",
            "The last time I checked a little embarrassment never killed anyone. Not sure about ego though",
            "Call the police and tell them what you have and how you came by it. Your being a good citizen, and acting responsible.",
            "You have a highly explosive weapon and your first thought is to... ask the internet?",
            "[I think I found your answer.](https://imgur.com/a/KgJKKwA)",
            "Gotta say, throwing a grenade is pretty exhilarating. But that one’s a definite no-go. Don’t trust it.",
            "You wanna risk blowing your arm off just so you don't risk embarrassment by doing what you're supposed to do and call the authorities? Are you 12?",
            "Just call the police. If it's inert, they'll know for sure. If it's not, they'll have somewhere to go with it.",
            "Head over to /r/whatisthisthing and search for unexploded ordinance posts. The auto bot replies with helpful procedure information.",
            "What would you rather risk:\nLosing a hand, and possibly your life...\nOr a little embarrassment from the police over a completely legitimate call?\n\nI don’t understand how this is even a question.",
            "Hi, your story is an incredible one and two, even if it's embarrassing to call the police for a fake grenade or something like that, I advise you to do it because otherwise you might one day have a bad surprise.\n\nI hope I helped you.\n\ngoodbye",
            "4chan flashbacks",
            "Found a grenade in my grandfathers attic. Something he probably had from WW2. Call 911 (or the non-emergencies line) and they’ll take it from you and do a controlled demolition of it. It’s nice to watch.",
            "Pop into a local Police station (assuming there is one) and talk to them about it. If it's not convenient I'm sure you can call them.\n\nDon't attempt to handle it yourself, and if you do go to the station DO NOT bring it with you.",
            "Re-evaluate: do you really need your hand?",
            "please don’t be embarrassed; it’s a grenade. just like with a gun, assume it’s dangerous. call law enforcement & let them worry instead!",
            "Explosives safety engineer here.. my recommendation would be to leave it exactly where it is and call explosives disposal now. Do not handle it any more. Without further knowledge of the store itself I couldn't say how dangerous it is likely to be, but it may have the potential to go off at any time for pretty much no reason. Older explosives can become highly sensitized and changes in temperature from the heating switching on or shock from handling are potentially enough to start the reaction with some explosives.. It could also potentially misfire and go off immediately if you were to pull the pin.",
            "Yeah, alot of people are saying to call the authortiies, and I agree. They'll probably commend you for being responsible about it. Please update us on what happens!",
            "This is the point where you get the fuck out of whatever building that grenade is in and call the police so they can roll out the bomb squad. You're sitting on what can either just be a dud or an early grave.",
            "Just call the authorities. Attempting to dispose of a 60 plus year old hand held explosive device would at best create a bang, at worse, earn you a darwin award. \n\nCall the authorities. Tell them what you told reddit. Let trained professionals deal with it.",
            "Wide open field.\n\n\nVise to hold grenade.  \n\n\nLong string attached to pin. \n\n\n\nEnjoy.",
            "Reasonable question. Short-ish story is that this house has changed hands 5 times in 30 years and the garage’s “wood corner” (lots of 2x4s, plywood, wire, etc) was probably never fully emptied. Some previous owner was a collector or foraged a nearby (historic) arty range and stashed it in the corner; successive wood placed there obscured it. To clarify, there is absolutely no way to identify it as safe so this person is alive because of dumb luck.\n\nA year into owning the house, I finally used enough wood to reveal it but assumed it was a rusted bottle jack for another couple months until I got close enough to ID it as a 75mm artillery shell (just the “warhead,” not the casing). I know it was fired because the brass band was grooved, meaning it had engaged barrel rifling. The timing “cap” was pristine, though, which suggests it had been replaced for a collection piece.\n\nCalled the cops; they came just to confirm it was worthy of the bomb squad’s attention, and the tech eventually arrived to x-ray it. Caused a big stir in the neighborhood but all participants thought it was cool. By the end, we had like 8 cop cars here and a handful or neighbors because it was the only exciting thing going on in a relatively small town.\n\nThe tech confirmed it was safe (he said it was solid metal) but didn’t offer it back; I didn’t ask for it. Because it wasn’t clearly defused, I’d never feel comfortable having it around or selling it. Besides, I’m in the “shedding possessions” phase of my life and that’d mess up my mojo—I have no connection to it. They “disposed” of it, purportedly through detonation but it is most likely on some PO’s desk or was sold on eBay. I’m good with that.",
            ">\tI thought about calling the authorities but it would be really embarrassing if they came to get it with a whole team and everything and it turned out to be a dud.\n\nYou need to call the police. You might feel embarrassed but it’s a lot better than feeling stupid if something happens. And honestly there is no reason to feel embarrassed. Safety is always the best route and even if it ends up being a dud the practice is good for the police.",
            "Donate to a museum! They’ll probably know and have the resources for making sure it doesn’t go off.",
            "Call either the non emergency number for your police department, or call the dispatch number. Both are easily Googled, and it's not for emergencies. Call and tell them that you have an old hand grenade, you don't know if it's real or a dud, and could they please come remove it. They won't send the blazing calvary, they'll just come check it. And if it's obviously real, then they'll call the professionals and they'll pack it into a safe box and take it away.",
            "Just call the police or sheriff, they are equipped to handle it.  Risking being embarrassed if it isn't a real grenade or a dud isn't near as bad as getting hurt or hurting someone else.",
            "Call the police you imbecile.",
            "Just to add to what everyone else said here. When you call the cops about it if you are not white you might want to have your white buddy make the call.",
            "Last year a guy close to me found what he tought to be a water heater in his field. He dug and pulled it out with a tractor and bought it home. Apparently he realized mid digging that its a fucking WW2 plane bomb.",
            "Absolutely no question. Police will praise you for doing the right thing. You get caught outside the house with that it's terrorism charges. No matter your intention",
            "definitely don't throw it. With age probably won't go off right away and will probably just sit there where I could go off randomly if someone stepped on it. I would bring it to the authorities and see if it can't be disarmed.",
            "When your so stupid you don't call the police but instead go Reddit for advice.",
            "Call the non-emergency police. They don't care if it's a dud. It's a weapon. Its parts are just as dangerous to public safety as its explosive potential due to their use in bomb making. They'll be happy to have it off the streets.",
            "Connect two long pieces of string to both the pin and the spoon and cover it with a sheet of metal, bricks, cinder blocks, rocks. Or just partially bury it and hide behind a tree like a hundred feet back in the woods and you should be fine. If it doesn’t go off then anonymously call the police and make sure you don’t have finger prints on anything.",
            "Take it to an army base and put it in an amnesty box.",
            "just pull the pin and throw it u coward.  life is all about risks.",
            "Afraid to call the police to dispose of an explosive in your house  because it might be a dud is about the dumbest thing I ever heard. Bet you feel real stupid when it blows up around someone and kills them because you didn't dispose of a military grade explosive in your house. \n\nI'd look stupid a million times to get that out of my life. New grenade is dumb enough to keep around. An old one that could miss fire just out of old age is idiotic.",
            "Kick it back at whoever threw it at you. But hurry, you only have a few seconds!",
            "Just please don't pull the pin. What will likely happen, as with most old ordnance, is it won't explode when you prime it, but instead explode whenever the hell it feels like it. It's highly unlikely to go off in your hand, rather once you throw it it will sit there until some unlucky person moves it or steps on it.\n\nEdit: If you want to see a cool explosion it's likely EOD will come and detonate it for you on site.",
            "if you want to be smart and responsible call the authorities.\n\nif you want to be cool and rad rig up some sort of string system where you can pull the pin and release the lever from a safe distance",
            "Lodge that excitable rock in a tree branch. Spoon(handle lookin thing) facing out. Tie a 50' line to the pin. MAX the line taut. Take cover. Pull. It's anticlimactic. But shrapnel is shrapnel",
            "Whatever you do be sure to record it and upload the video to r/whatcouldgowrong\nor r/holdmybeer.\n\nCheers mate!",
            "Duct tape it to a tree, attach long string to pin, pull from afar. I’M KIDDING. DON’T DO THIS.",
            "Call the authorities no matter how \"embarrasing\" it is. My dad's uncle lost an arm and had his face disfigured by a ww2 grenade while he thought it was a dud. Do not risk getting killed.",
            "2 options: call police/bombsquad, they will be more than happy to help because if you die they will still have to come and than it will be a whole lot worse. \n\nOr put it somewhere where it cant easily move, put a really long rope on the pin, walk really far away and pull the rope untill you either have the pin or hear a exsplosion. Problem with this is that if it doesnt go off that someone has to check. You could also make a giant slingshot aimed at a lake, put a rope on the pin, fire the grenade away and at somepoint when its flying away the pin will be pulled out by the rope.",
            "Call your police station. They have protocols for this very issue guaranteed",
            "Get long string,tie a knot on the pin hold the string and drop it somewhere. With the string youll be far enough or covered. Itll be save and youll have a blast"
        ]
    },
    {
        "post_id": "e1b8fg",
        "author": "Taco_Bell_CEO",
        "title": "Why are words like \"Frenchman\" and \"Irishman\" fine, but \"Chinaman\" is offensive?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/e1b8fg/why_are_words_like_frenchman_and_irishman_fine/",
        "score": 13917,
        "num_comments": 1419,
        "created_utc": 1574658814.0,
        "selftext": "I'm assuming it's more about the history of the word than anything, but I don't know why they're different and I'd like to.",
        "permalink": "/r/NoStupidQuestions/comments/e1b8fg/why_are_words_like_frenchman_and_irishman_fine/",
        "comments": [
            "A big part of it is that people would call literally anybody from Asia a chinaman. It was basically synonymous with oriental. Also the French called themselves Frenchmen and the Irish called themselves Irishmen, but the Chinese didn't come up with chinamen.\n\nEdit: Look up \"Orientalism\" if you're curious as to why people don't like being called oriental\n\nEdit 2: The Frenchmen in France weren't calling Chinese people Chinamen either, I think it's safe to assume OP is asking about Anglophones. French Anglophones (like Americans of French decent) do call themselves Frenchmen.",
            "It's not about the meaning of the word, but the historical connotations and how it has been used in the past. When a seemingly normal word is used with contempt, it takes on negative meanings. \n\nAlso, it was used to refer to other Asians (I think mostly Japanese people?) which enforced stereotypes that all Asians were \"the same\".",
            "Its partially grammar based because the equivalent of \"Irishman\" would actually be \"Chineseman\".  A person from Ireland is Irish and a person from China is Chinese.  When you say \"Chinaman\" you are making the subject of the adjective the country and not the person.  By getting it wrong, you're dehumanizing the person you're talking about and its disrespectful.\n\nThis is also how you can pinpoint bigots on the internet. They'll always refer to the group that they hate as a thing instead of a person, choosing objective rather than personal nouns (eg \"blacks\" instead of \"black *people*\" or \"females\" instead of \"*women*\" or even dropping in a preposition to turn an adjective into a noun \"he is a gay\" instead of \"he *is gay*\").",
            "I’ve told this story here before but for anyone that missed it:\n\nI had a coworker who used to call me Chin. I am not Chin. When it was a once in a while thing, I ignored the slight - it was nice being acknowledged. One day I was supposed to train him. Now he’s calling me Chin 3-5 times a day. Now I correct him. “It’s not Chin. It’s Checker.”\nHe says “Dude, relax. Where I come from we call all you guys Chin!”  Needless to say he didn’t get trained by me that day or any other.",
            "what i find interesting is those words aren't exactly the same, *French*man not Franceman, *Irish*man not Irelandman, they use denonmyns (i think that's the word). when you use the wrong word it sounds off \n\nChinaman instead of Chineseman, just sounds like incorrect English, like it's meant to be an insult,",
            "Because Frenchman and Irishman are not the same as Franceman and Irelandman.  He's a \"Chinese man\" is totally fine.",
            "yes, historically negative connotations",
            "Interesting fact, in cricket there is a way to bowl the ball which is called Chinaman, because most probably it was first used by someone whose origin was from China.",
            "The way I like to think of is that if it's a person whose culture was probably affected by colonialism, you best be goddamn careful to use the terminology they request of you.",
            "Because that’s not the demonym. It’s Chinese. Also because of the association with the image of a “Chinaman” being an offensive racial stereotype.",
            "Maybe cuz it's a stupid word if it followed the format it would be \"Chinesemen\"",
            "A person from France is Frenchman not Franceman. A person from Ireland is Irishman not Irelandman. So why should a person from China be called a Chinaman? Chinese man sounds better right?",
            "Shouldn't it be Franceman and Englandman?  Nobody is offended by Chineseman",
            "It's kind of a few things\n\nFirst, mostly the people from China are usually referred to as Chinese not chinamen so there's that.\n\nThe context of words is more important than the word itself in my opinion. Most of the time chinaman is used in a bigoted context whereas that's not the case for frenchman. I have mixed feelings about Irish an, because that (at least in the UK) was kind of used like that for a long time.\n\nPeople often use chinaman to describe anyone from East Asia, whether they're Chinese, Japanese, Korean, etc. This is a racist position and therefore offensive.",
            "i know someone who’s last name is frenchman, so maybe irishman can be a last name too?",
            "I have no actual facts to back this up but this is just from me pondering the question. French and Irish are not the name of the country like China is. It would seem pretty silly to call a Frenchman a \"Franceman\" or an Irishmen an \"irelandman\". In that same argument saying \"Chinesemen\" doesn't sound near as derogatory as chinaman.",
            "French and Irish are adjectives. China is a noun.",
            "Because it's suppose to be \"Chineseman\".  You don't call them \"Franceman\" or \"Irelandman\" do you?",
            "Dude, Chinaman is not the preferred nomenclature - Asian American, please.",
            "I don't speak Chinese, but I was told that the word  'chinese' is used mostly by westerners.         There is one part of that area that used to be ruled by the Emporer Chin or Qin, so his kingdom was called 'The Chin Dynasty'        When westerners came they just called the whole country Chin, and that became China.\nWhat they really call their country translates as 'The Middle Kingdom'.        So, 'Chinaman' was offensive because not all of them come from the land of Chin.",
            "Any word tied to the horrors of colonialism becomes offensive when the west started actually trying to call all the people they conquered a name they're OK oriental for example means same thing as eadterner and out of context could be used like westerner but with the context of modern history it's a term that brings back a time of death rape and a complete lack of control of freedom for millions of people.",
            "Because language, connotations, and humans are all infinitely complex and stupid at the same time.",
            "We do say Chinese man, and that’s not offensive. China man is offensive because of the history associated with it.",
            "Because the plural is Tiananmen and nothing happened then",
            "Its all in how the comment is framed. If its in a positive context it is fine. Chinaman is rarely in a positive frame. Its like how many Jewish people call themselves Jews, but its also used as a derogatory term by some groups.",
            "With the exception of explicitly bad words, no word is inherently offensive, but rather it becomes offensive in the way it is used and the message that is implied by it through history. For example, the N word would be a perfectly valid way of referring to black people, for Latin for black would be \"nigreos\", and as such many romance languages have a similar word for black, so it would be an appropriate way for referring to them, however after the whole slavery shebang and it becoming synonymous with inferior, less than human, and so on, it became offensive to be used in common day.",
            "In my city there is a hill called chinaman’s hill, named after the event of rolling immigrant Chinese gold miners down the hill in barrels when they were new to the country :/",
            "Really it’s as simple an answer as: Because it was/still is used offensively.\n\nIt *shouldn’t* be offensive, but unfortunately racist people are a thing.\n\nAlso, as others have said it is sometimes used as a way to describe Asian people in general, as well as just “Chinese”, which can be a racist’s go to country to describe any Asian person.",
            "this questions already been answered, but for more on this you should check out this video by CGP Grey on the name \"American Indian\" vs \"Native American\" which goes into a bit of the history and philosophy about the language surrounding what we call a group of people: [https://www.youtube.com/watch?v=kh88fVP2FWQ](https://www.youtube.com/watch?v=kh88fVP2FWQ)\n\nTLDW: in general, call a group of people what they want to be called, if your culture comes up with a term for them - whether its meant to be a xenophobic slur or an inoffensive politically correct term - don't expect them to adopt the term as intended.  Call them what they want to be called.",
            "Because 'French' and 'Irish' are adjectives.\n\n'Chinese man' is not offensive.",
            "Perhaps because it's been used negatively, but also its Frenchman not franceman, irishman not Ireland an, so to follow form Chinaman would be Chineseman. Whether this still have the negative connotations is down to the people affected surely?",
            "Same reason as any word used by a race to put down another race, like the n-word.",
            "it only works in english, as far as I am aware. \n\nlike, the speciffic offense is just linked to omething the americans or the british did, or thought , and now, it's ruined for the whole world. \n\nAs an example, take my native german. we have so many foreign rules, and concepts, and special cases, where the average dude does not even know why and how, that we instinctively go, okay, foreigners will make mistakes , just roll with it if you can even roughly tell what they mean. After all, you can't demand that they know perfect german instantly. \n\nNow, I have been called \"Hey, Deutsch man\" , or a variant, so often that some friends begin treating it as my name. It's even to the point where I planned to dress up as deutsch man for halloween, wearing a cape with the german flag, and an emergency bandoleer with weisswurst and beercans crossed over my chest. And it's f*cking fine. You are the only one who'se primary distinguishing characteristic is that he is foreign, you wear that shit with pride. To the japanese, I am deutsch -san. To the turks, I am Deutsch-lan, ect. \n\nNow, what I picked up with that is that when we use a compound word to refer to a different origin, many languages treat it the same as if you would say to an american with a strong texas accent \"Hey texas..... \". We do not know you, we want to refer to you, we don't know your name, so bam, the first exotic  thing about you. \n\nLike, when a french guy sees an asian guy, and he wants to contact him, for example, to warn him about something, it seems perfectly acceptable to pick the most obvious thing to catch your attention (he's looking mighty asian), specify it (china), go for the french term (chinois) and go, \"Eh, chinois! \", with the same gusto that an american would go, \"eyyyy, detroit\".",
            "If it’s any consolation, in my language, Igbo, people from other countries are literally “Country person”\n\nErgo,\n\nBritish people - Ndi Beke\n\n\nChinese people - Ndi Chinko\n\n\nCanadian people - Ndi Kanada\n\nAnd so on.",
            "It's mostly because people would say Ch+ng Ch+ng Chinaman.",
            "Chinese man is ok. You aren’t saying Franceman or Irelandman, why would you say Chinaman?",
            "\"I'm not a Chinaman. I'm China, man.\"",
            "In this context it should be chinese men. The two european examples are adjectives, but you would never say \"im gonna go to the market for some China Food\" right?",
            "We don't say franceman or Irelandman... Maybe try chineseman and maybe that might be less offensive...",
            "\"Chinese-man\" probably wouldn't be offensive. \nWhile \"Chinaman\" is, and \"Franceman\" and \"Irelandman\" just don't sound right.",
            "Because \"ch***man\" was used as a slur long enough and widely enough, that at this point it's impossible to use that word without that context coming along for the ride.\n\nFranceman, frenchman, irelandman, and irishman were not used as slurs longly or widely enough for that to be the case.",
            "Explaining racism to white people...nothing new here.",
            "It’s because white vs any other race. You can say whatever to white people but not the same to the other",
            "Wouldn't it be \"Chineseman\" in the first place?",
            "Brian buddy, where ya been? The term is Asian-American! \n   \nI know you are     \n         \nNo intending to be,    \n      \n[But calling me Oriental - offensive to me!](https://youtu.be/tbud8rLejLM)",
            "Because most of us who are told that are not Chinese. And it’s always said in a rude tone",
            "Because we ruined it with offensive use and tone. It is now a racist thing to say. Once upon a time \"colored\" was just a word too. But we used it against people in a demonstrably rude way, and now we aren't allowed.",
            "I feel like a major difference is that China is a the country... French is the language and Irish is the language..\n\nChina being Chinaman \n\nFrance (French) would be Franceman (I feel like if you called someone a Franceman, you might get look at as if you are being ~~a little bit racist or prejudice in this regard as well~~. at the least, Ignorant)\n\nIreland (Irish) would be Irelandman (Same as above, for Irelandman.  You aren't going to be looked at favorably.)\n\nOr conversely,\n\nChina would be to Chineseman \n\nFrance would be Frenchman\n\nIreland would be Irishman",
            "Chinaman, Injun, N-word - are all offensive because of the connotation, or the way it was used as a derogatory term to coerce such a person into doing something. I used to take offense at the way people pronounce Detroit. But then, it really depends on your upbringing. And I'm from Detroit!",
            "`they opt to be called` ~~ChingChong~~  `Chinese`",
            "White",
            "I'd like to remind everyone that Nissin makes a noodle flavor they market as \"Oriental Flavor\"\n\nOh, and that \"Orient\" literally is just Latin for \"East\"",
            "Once a phrase is used to dehumanize, it becomes a slur.  If you care about getting along with people who don't look like you, then you'll accept these social nuances as simply having decent manners.\n\nIt really shouldn't feel like a burden to refer to people in a respectful manner.",
            "Why is \"people of color\" fine, but \"colored people\" is  offensive? Even \"black\" is taken offinsively by some people nowadays.",
            "Chineseman would be the logical reference in your statement....not Chinaman. So yes I understand how Chinaman is offensive as it is mimicking the broken style of English that was used in Hollywood to take the piss out of people from China and how it was perceived they would talk.",
            "Think of it this way: what if instead of \"Irishman\" and \"Frenchman\", it was \"Irelandman\" and \"Franceman\"? And everyone from Europe was labeled a \"Franceman\"?",
            "Chinaman is the same as Franceman, Irelandman and Englandman. We don’t use any of them. Chinese man would be acceptable for a man from China.",
            "Historical context maybe? It’s like trying to make sense of why blackface is offense but not whiteface and ignore minstrel shows and the like.",
            "Franceman Irelandman",
            "Because people from France are Frenchmen, people from Ireland, are Irishmen. But people from China aren't Chinamen... They're Mandarin or Cantonese. Also it was used for all Asians even if you weren't from mainland China.",
            "Actually these are all incorrect. It's pussies, leprechaun and Chinaman!",
            "I am confused as to why anybody from the Americas is not always considered an American...",
            "Because it’s used derogatorily, Redditman.",
            "What about floridaman?",
            "Probably the same reason national women's day gets so much more attention than national men's day",
            "huh i had no idea it was offensive i say it all the time",
            "Co-co-co-coooonteeeeexttt",
            "Because its derogatory.  In the U.S. the Chinese were subjugated and severely mistreated and like the N word is fuelled by hate and bigotry.",
            "What? That would be like calling a frenchman a \"franceman\" or \"irelandman\". It would be \"Chinese man\". That is literally what you call a Chinese person who happens to be male.",
            "Was wondering the same thing, if you do a French accent it’s fine but if you do a Chinese accent it’s offensive, wtf?",
            "Because we don't call people Franceman and Irelandman, and it is not offensive to call a man from China a chinese man.  Even without the historical context of the word, your own analogy provides the explanation you are looking for.",
            "Because it would be \"chineseman\". You don't say \"Franceman\" or \"Irelandman\".",
            "To quote a philosopher of our times:\n\n\"A lot of words are not bad words, but some people start using them a lot to hurt other people and then they become bad and become hard to use.\"",
            "Because Irish and French are normally white. Same reason why you can use slang terms like Canucks for Canadians or Russkies for Russians, but if you say just about any slang term for a non white person, many people will call you racist.",
            "Proper terms are French, Irish, Chinese....people....",
            "[removed]"
        ]
    },
    {
        "post_id": "idbs7a",
        "author": "None",
        "title": "If places like Arizona and Las Vegas are so hot and uninhabitable without air conditioning, and don't have any valuable natural resources, then why do we even bother settling cities there?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/idbs7a/if_places_like_arizona_and_las_vegas_are_so_hot/",
        "score": 13920,
        "num_comments": 929,
        "created_utc": 1597935379.0,
        "selftext": "Those places don't have any natural resources, have very little water, and pumping the billions of gallons from the ground might not be the best solution, as we have never pumped out that much over the past 100 years. \n\n[https://www.nbcnews.com/storyline/california-drought/californians-pump-groundwater-land-sinks-aquifers-shrink-n145466](https://www.nbcnews.com/storyline/california-drought/californians-pump-groundwater-land-sinks-aquifers-shrink-n145466)\n\nOther than \"muh, cheap land\", the amount of power it takes to keep a place cold, and the amount of money it costs to transport food and water, it isn't worth it in my opinion.",
        "permalink": "/r/NoStupidQuestions/comments/idbs7a/if_places_like_arizona_and_las_vegas_are_so_hot/",
        "comments": [
            "The cities in such areas usually had enough water for sustainable farming when first settled. Then they just happened to outgrown their water supplies for some reasons.\n\nIn case of Las Vegas it's because of the vicinity to Paradise City where people made gambling legal. So Las Vegas grew a lot because of gambling. But originally it had fertile, farmable land.",
            "Los Angeles started to take off when the rail line to the much better port in San Diego was wiped out by a typhoon.  The Los Angeles basin had a thriving citrus industry up until the early 60's, when air pollution cut into the crop yields.  Otherwise, LA draws water from far northern California and the Colorado River.  It probably shouldn't have been built there.",
            "Cities usually grow in places organically. Often it is because of trade routes - I don't know the history of those cities, but I would bet they were stopping points along the railroad or highway connecting California to the east coast.\n\nEdit: a quick search finds that Las Vegas was founded because it was a lush green oasis in the desert that Mexicans, Mormons and gold prospectors stopped at, and then boomed in population when the railroad was built through it.",
            "I can't speak for Nevada, but Arizona has plentiful natural resources. Or we did when people settled here, at least. Some of these resources are on our state seal: copper, cattle, citrus, cotton, and climate. The \"five C's\" of Arizona, as they're called. \n\nMost cities were originally farming or mining towns; there are many (many!) farms and mines still active all over the state. AZ has (or had) gold, silver, copper, quartz, salt, granite, lead, gravel, coal, even uranium. People love our dirt, too! We have really good dirt, lol.\n\nAlso, Arizona is a *huge* state - we literally have six different biomes! The top part of the state is not desert, but forest, and there's skiing in the winter. You should come check us out sometime, there's lots to do and to see. Just don't visit in the summer!",
            "Contrary to your line of questioning, Phoenix exists because of its resources. The natives here lived along the Salt, and Gila rivers. Which, at the time were un-dammed and perennial flowing rivers. After they left, and the western settlers came, they found a system of canals that had been built by the natives and utilized them for their own agricultural needs. The land was/is fertile here and good for farming. The Phoenix basin has always been habitable and great for farming and mining of certain minerals at the time, but the settlement got larger and eventually grew into the unsustainably monstrous metropolitan area we have now. \n\nAs for the rest of Arizona, the state is very rugged for sure, however there is no shortage of resources vital to modern life. Copper, silver, gold, uranium, lead, and zinc are plenty here and mining of these materials is still huge business here. \n\nSure AZ is damn hot. But it is far from uninhabitable/useless. \n\nAs for Vegas: It shouldn't exist. Thank Bugsy Siegel and his criminal empire for that little monument to man's arrogance.\n\nEdit: I feel I have been unclear about the natives mentioned here. A couple comments have come up basically questioning my phrasing that they \"left.\" Some kinda scoffed and some said they were forced onto reservations. The natives im referring to were the Hohokam people. They inhabited the salt river basin for centuries and did indeed leave sometime in the 1300's, well before any of the events of the western expansion. Those people were not forced onto reservations and I am not trying to whitewash their story in any way. It is unclear why they disappeared and abandoned their settlememts. But as I mentioned in another comment, there are claims to Hohokam lineage by the modern O'odham people.  I hope I cleared things up a bit. If I'm off, please correct me.",
            "A lot of those desert cities used to have a lot more water than they currently do. Tucson was founded on a river, which is now dry (there have been efforts to revitalize sections of it). When the cities were founded, it wasn't as hot as it is now, and even now, it's only really bad for about 3 or 4 months out of the year, which a lot of people see as a reasonable tradeoff (like the cold months in the north). The lack of humidity also feels good for people with certain health conditions like arthritis.\n\nThere are natural resources. Copper mining was a huge industry in Arizona for many years. The conditions of the area also make it valuable for the optics industry (telescopes), for military operations, and for long-term airplane & other vehicle storage (lack of corrosive elements, stable ground).",
            "In contrast, minnesota is too cold and uninhabitable without heat so why live here too?",
            "Not to mention suck water from the Colorado river.\n\nPeople like the winter weather and at some point they just exist. Yes it boggles the mind - but without some dramatic change people won’t be moving away from them (a ton of people are still moving to Arizona).",
            "People settled here because they could easily cook an egg without fire.",
            "Because in Vegas we can get a $11.99 prime rib & lobster. Where else can you get that?",
            "[deleted]",
            "[deleted]",
            "Who told you that Arizona doesn’t have any valuable resources?",
            "\" the amount of power it takes to keep a place cold, and the amount of  money it costs to transport food and water, it isn't worth it in my  opinion. \"  \n\n\nFYI, the amount of power it takes to cool a place is significantly less than it takes to heat a place. You can cool a building by \\~5 BTUs using just 1 BTU of energy. You need to use 1 unit of energy to heat a building by 1 unit of energy. And that's just for AC, you can do even better using a swamp cooler, which can only be used in dry climates.   \n\n\nAs for the money to transport food, the majority of food that is imported from Mexico arrives via truck through the port of Nogales in southern Arizona and passes right through Tucson. It is cheaper to transport it there than anywhere else in the US. If you go to the grocery store there, you will see cheaper prices than where you live, I almost guarantee it.",
            "In Nevada, most of the towns and city were first formed because of steam railroads. Back in the day, a steam train could only go so far without getting water to make steam.  Any place that had a spring, river or easy well would form a town. As cars took off they built highways next to the rails and over time ripped out most of the rails. Now most of the places in Nevada either support mines nearby or are dying. \n\nFun Fact: Las Vegas means The Meadows in Spanish and there used to be a spring just off the strip until it was pumped to much.",
            "The amount of homeless people living in arizona and las Vegas without air conditioning shows that its not uninhabitable. Also, the amount of sunlight we have in arizona alone shows that arizona has viable natural resources. Solar energy is a viable resource.",
            "Phoenix and Vegas have relatively few natural disasters compared to other parts of the country, large auto insurance companies, for instance, have to shut down days of operation in the southeast due to hurricanes and power outages, not an issue in Phoenix, so the jobs are there and the people come with",
            "If places like the entire north are unliveable without a heater half of the year, why even bother living there?\n\nFor half the year in Arizona, you need ac, shorts, a big bottle of water, sunglasses sunscreen and maybe a hat.  \n\nFor half the year in the north, you need salt trucks, an entire winter wardrobe, ice scrapers, salt, salt trucks, snow shovels, shoveled sidewalks, home heaters, oh and if you stay outside too long, you'll lose fingers and possibly die.\n\nThe south west gets spring, summer, hot summer, fall, and then spring again.\n\nYou get spring, muggy ass \"summer,\" a month of fall, and a 6 month winter.",
            "Hi,Arizona resident here!Where I live,agriculture is an extremely vital part of the economy here and fields take up about a fourth of the entire space of the town I live in.Thousands upon thousands of tons of lettuce,for example,are harvested here every year and make their way to places like Canada,Europe,Asia,etc.The soil here is extremely fertile as well and along with the sunny weather,it proves to be excellent for planting vegetables.When a business like this appears somewhere,it is normal for a community to build up around it as well like the one I live in right now.",
            "I'm from Louisiana and my question is, why the fuck would anyone settle in that festering swamp bowl sitting below sea level in some places right in the path of hurricanes? Bunch of backwoods savages down there. \nEdit: literally the poop shute of America.",
            ">  **don't have any** **valuable natural resources** \n\nCopper?  Gold?  Silver?  Other minerals?  Also, if they were uninhabitable without air conditioning, then how did people inhabit those areas before?\n\nTake Bisbee, AZ for example.  By all accounts, there isn't much there.  But there was a big copper mine that attracted people to it.  After the mining was done, do you think people would just pick up and leave?  No, they stayed.  There is no reason for them to leave now.",
            "Both Arizona and California have abundant natural resources. And California has plentiful water supplies (they also use a lot of water as the number 1 producer of agriculture in the US). \n\nArizona: copper (1st in the US), Gold, silver, lead, gravel stone, clay, pumice, coal, petroleum, uranium, salt, livestock, cotton, melons, winter lettuce, dates, wheat, citrus fruits\n\nCalifornia: water (enough to irrigate  8,000,000 acres of land as well as sustaining its cities). California produces more food than any other state. And that land is irrigated with California water. Seafood (number 2 in the us), timber and wood products (number 2 in the us), silver, manganese, copper, tungsten, uranium (ca produces 10% of US total minerals), petroleum, natural gas, boron, cement, sand & gravel, iodine, salt, and potash.",
            "The idea that Arizona doesn't have natural resources is completely wrong and ignorant in that a basic Google search would have told you otherwise.  \n\nArizona's economy was 'originally' based on the 5 Cs: copper, cattle, cotton, citrus, climate. In addition, Arizona has multiple other mineral resources. Gold (e.g. the most Dutchman gold mine legend) and uranium (e.g. the controversial plan to mine uranium outside the grand canyon).\n\nWhile it is a desert state there are multiple large water sources that early in the setting of the state provided abundant water for inhabitants and farming. That provided a reason to settle the state, and from there things snowballed and evolved. \n\nAdditionally, a significant portion of the state is not Phoenix and has rather mild summers--to the point of not regularly having air conditioning in homes and businesses. \n\nThough Arizona has grown dramatically, it (or parts of it, I can't remember) uses less water now than decades last when the population was a fraction of current due to more efficient use.",
            "Something non-obvious that I haven't seen mentioned yet is that due to low humidity, the temperature difference between shade and sunlight can be significant. Sweat evaporates quickly, which cools you much more effectively than it would in, say, Texas. This doesn't occur to people from more humid climates, where if it's hot, it's hot everywhere.\n\nIt can be 105F out and I'll be perfectly comfortable in the shade. Add a light breeze or a ceiling fan and it can be downright pleasant. Just gotta stay hydrated.",
            "LA was once a very prosperous agricultural area.\n\nLas Vegas only exists because gambling is legal in NV, and it was a convenient spot to put casinos that catered to the population of LA.",
            "Well the whole \"cheap land\" thing is going away now because of the over-paid bay-area cali folks buying up properties here with their half a million \"low income\" salaries and working from their new purchased properties...plural.\n\nEdit: I'm born and raised here and am forced to rent my entire life because of the cost of housing rising and the lack of pay to keep up. I can't afford a 2k mortgage. Now I'm starting to look at the water situation more closely and the type of people moving here and how the local governments cater to them and I just can't contain my frustration anymore. Coupled with the last couple weeks of record heat, I can't even fucking sleep anymore without risking my A/C overheating or just failing. I'm more than likely going to move out of state or out of country.\n\nFuck this city. It needs to just die out",
            "Arizona is (or was) actually very rich with things like copper and silver. Several towns were established to mine all the precious goodies up. Some spots have now been mined dry and there's a bunch of old mining towns that are now dying, though others are still very active. I think some other towns were founded as just like a stop on the way to the west coast.",
            "I live in AZ and its just really cheap to live here and nobody makes shit so we're all just stuck.\n\n \n\nAnd yes it does get up to 110-120 but it's also 0% humidity. Shade actually works here. I feel for everyone who lives in 90 degree weather with just a bucket of humidity. Many people have health problems and prefer the dry climate these places provide. \n\n \n \n \nTbh tho i hate it here and would do anything to live in a place like Oregon or Colorado but being lower middle class means you never leave, esp during times like now",
            "Any time I've driven from Utah to Arizona I always have the same thought. Phoenix must have been settled by people who were like, well we're too tired to go back, but we better stop before it gets any worse.",
            "I'd just like to say that there is a common misconception that all of Arizona is hot and really just serves as a testament to humanity's arrogance.\n\nThat isn't the case, though.  The valley is hot in the summer - for sure... and even down south in the Tucson area it can be quite intolerable for most people.  The further north you go, though, the cooler the temperatures are.  In Flagstaff and around the Grand Canyon area temperatures are rather moderate and it even snows.  \n\nSomething else people tend to overlook is acclimation.  Just as people who live in Alaska or Siberia develop thicker skin and blood vessels deeper in their bodies to better maintain body temperature and survive in the cold, the body adapts to the heat, as well.  The skin becomes thinner and blood vessels move more toward the surface to allow for the more rapid dissipation of heat to maintain a safe body temperature.  It takes a little time though - a year or two before you're really used to the weather.\n\nOnce you're adjusted, you'll find it's very uncomfortable to be in different places.  For example, I'm from Ohio and have lived in Phoenix for ten years.  If I go home, the humidity makes it all but impossible for me to breathe.  I feel soggy, uncomfortable, and like the air is so very thick.  Here in Phoenix, though, I have no issue spending a few hours outside in 100+ degree weather - because it's something my body (and mind) is used to.\n\nThere are also a wide variety of food sources to be found in the desert.  Citrus and pomegranate grows readily here, as do various edible cacti.  In addition, there are, of course, a variety of edible animals and insects which live naturally in the area.\n\nWith regard to other natural resources, Arizona was once a destination for copper mining.  We even have a handful of ghost towns which were once functional copper mines.  We're also known for some other resources (cotton, cattle...).  \n\nOur state isn't all bad... actually, it's quite nice.  And honestly, the people you'll meet out and about are some of the nicest people you could ask for.  That might be our greatest resource of all.",
            "I've lived in AZ for most of my life. I've gotten use to the heat, for the most part.  \nIts also just cheap as shit. \nThe real answer is because of the resources back in the day.",
            "For Phoenix and the Salt River Valley in general, the land is agriculturally productive as long as you irrigate. There used to be a Native American civilization that lived in the area that were able to build a large system of canals; many of the paths they used are used today for modern canals. So, when settlers arrived to the area, they were able get good yields from crops provided that they irrigated. Some of the first federally managed dams that were built were built to serve these farmers. In return, the valley provided crops for export including off season vegetables.\n\nOutside the Valley and within the region, Phoenix supported mining operations. This included massive copper mining.\n\nAfter World War II, the region started seeing growth in manufacturing, specifically in electronics manufacturing. Given the local supply of raw materials and cheap electricity, companies like Motorola and Intel moved in and created factories to pump out electronics. Aviation companies like McDonnell-Douglas also moved in to take advantage of the low corrosive environment and clear days to conduct aviation testing.\n\nTourism was always part of the economy, especially winter tourism where people could walk around in a t-shirt in January. This picked up as flying became cheaper. Also, retirees used the area as a winter getaway, switching between there are their homes up north since it was cheap to buy a house down there.\n\nAs for air conditioning being a power draw, how many places around the world would be uninhabitable if you couldn't heat buildings? Heating takes up a lot of power too. The only difference is that heating can be done through other means than electricity.",
            "Phoenix was an agricultural area for millenia, farmed by the Hohokam and white settlers. The Salt and Gila Rivers, along with being in USDA zone 9+ made the area conductive for year-round agriculture, which most places in America cannot do. \n\nUS soldiers trained there during WWII and many decided to stay after the war. Phoenix is paradise for 8 months out of the year, and the invention of air conditioning sealed the deal for exponential population growth. \n\nNowadays, summer in Phoenix is like winter in most parts of the country. People stay inside much of the time until the weather becomes more bearable, and THAT is when the area shines.\n\nWater issues weren't a problem until recently. The water table used to be fairly high and if farmers used more cover crops to prevent evaporation and would do more dryland farming, there wouldn't be any reason to worry as that's where the vast majority of the water goes. Gilbert is refilling their aquifer at the riparian preserve and outside SW Arizona, the state is pretty mild. A lot of lush, cool areas with a lot of access to almost unlimited water.",
            "Arizona is known for the 5 C's.\n\nCopper \nCattle \nCotton \nCitrus \nClimate \n\nPlus there's several old silver mines around Tombstone, AZ.\n\nThe Colorado River supplies water and creates electricity through several dams.",
            "Global warming, bruh. People are waiting for the coast line to move inland so they could have the sweet sweet beach getaway. /s\n\nCities are where they are needed and as you said - there is air conditioning, so it's not like we don't have a solution to make the place more bearable. If we didn't inhabit the places that are \"too hot\" we would be left with maybe a half the size USA...",
            "I live in Arizona, and it is hot in most places but up near flagstaff and Prescott it is actually bearable. Also, you get used to the heat like people in New York get used to the cold.",
            "Not sure about you, but Las Vegas can stay right the fuck where it is.",
            "Oil, gold and the magic of moving to “The Untamed West” back in the 1800s",
            "I feel this post might come out of retrospect of the recent 130°F record high of Death Valley, with Las Vegas at the time reaching 113. Most of what you're saying here is just factually untrue.\n\nNevada had more gold than California, and still had enough silver to be call \"The Silver State\". The Colorado River (used to) supplies enough water for the inhabitants living next to it. There are several exports for each state down there, not just including gambling and \"muh, cheap land\" (which would probably be cheaper in the midwest).\n\nRight now, we're experiencing heavy drought from, you guessed it, global warming and the lack of preemptive forest fire prevention. The Colorado River is about halfway down from where it used to be and California is on fire all the time. These cities aren't just popping up and developing, they've been here for hundreds of years now. We can't just pick up the millions of people in these situations that we caused and say \"Go buy yourself a nice house in Ohio or whatever, it's too hot were you live\".\n\nInstead of blaming victims of these horrible circumstances and saying \"Why do you live there?\", you should ask how to prevent these things from happening. Nevada and Arizona have large open plains that could be fitted with solar panels to prevent CO2 emissions. Agricultural departments could set controlled burns in forest to prevent the buildup of dead leaves that start huge, uncontrollable fires.\n\nInstead of blaming people for their situations, help them",
            "Pre-damming deserts were not so arid.  Most of the cities in these areas were settled along gold rush routes..  12 hours by horse? Set up camp.  \n\n1000s of travelers stopping in the same place?  Set up shop.\n\nSet up shop?  May as well live here.  Boom, village>town>city>uninhabitable urban wasteland",
            "I think when many of these towns were settled, it was by miners. Mining towns grew up around the mines and many of them continued after the mine was played out.",
            "The West was thought to be great for new farming land, which is why it was initially settled. And it was, for a long while. It’s hot and dry, but there was water enough to maintain farms and things. Add to this that there were a lot of mineable minerals and untapped oil deposits out West as well, and it became a very enticing place to settle.\n\nThe way farming was conducted was what really destroyed a lot of what *used* to be farmland. Farmers planted the same crops over and over again, didn’t use the land during off seasons, and never planted what are called “placeholder” crops. Placeholder crops are planted and grown to be tilled back into the soil, to add organic material and nutrients back into the land. Considering that never happened, the nutrients and organic material that was there already ran out and broke down, respectively. This led to lots of dust, which led to dust storms, which led to lots of farmland that wasn’t yet ruined to *get* ruined.\n\nAnd eventually, the mines ran out. Settlers had effectively drained the land of all its precious and useful minerals in the area (gold, coal, and other high-value minerals), and there was nothing left but tunnels.\n\nA lot of the largest deposits of oil, too, were eventually fully tapped out, and became obsolete.\n\nBut because we were in the West for those reasons, and people had already picked up and moved out there, there was no point in picking up and going back. So folks settled down for good, and created some real cities and towns that weren’t necessarily tied to farming or mining. Other industries found their way out there, and we eventually built up places like Vegas, where there are hubs of human activity in the middle of what’s now mostly barren plains and desert.",
            "Many of them started out with water and arable land, but as they got more and more settled, outgrew their supply, and also, climate change turned \"it's hot but it's a dry heat\" weather into \"it's ungodly hot out there and has been for months.\"   \n\nMeanwhile, I'd ask the same question about settlers in North Dakota and North Minnesota.  It's not fit for human habitation, so why did people settle there?",
            "Because humans will go out of their way to do the illogical, implausible, or occasionally the straight-up impossible just to spite nature.",
            "This is a great question my friend. Been in Vegas my whole life, and it's a great city for 8 months of the year. For 4 months the heat is pretty shit. The location is good, bordering 4 nice states with beautiful state parks and services. Living cost is strange. Housing is cheap but food can be on the higher side. Gas is above avg but wages are typically higher with a low min wage. You can get anywhere in the city in 30 minutes the roads are amazing compared to other places ive been, no natural disasters.",
            "Because they are amazing 8 months out of the year while everyone else suffers snow, rain, cold, and grey weather. And the air is blessedly dry. Plus as far as industry goes, we are getting further and further from farming. Businesses can pretty much set up shop anywhere.",
            "I would strongly recommend reading The Ripple Effect: The Fate of Fresh Water in the Twenty-First Century by Alex Prud'homme. Cities like Las Vegas and Los Angeles simply should not exist as they are not sustainable. The history of both cities is very tragic.",
            "To add to what ppl are saying about las vegas. The artificial lake here has enough water to sustain the city as is. The porblem is that the water is shared with southern California and Arizona. There is also no way to change that as the last time Nevada and Arizona tried to lobby for greater water rights California just used their congressional numbers and influence to shut it down.",
            "\"While Phoenix is regarded as a new city, it was built on the ruins of an ancient civilization. Canals were the cornerstone that allowed the Hohokam people to transform the Salt River Valley into a fertile oasis for more than a millennium.\n\nTheir canals harnessed the river and grew enough crops to support a population of about 50,000 people, archaeologists estimate. For reasons that remain a mystery, the Hohokam disappeared around the year 1450. But their legacy of desert fortitude lives on in the canals.\"",
            "I was there for a week and am ashamed of how much energy I consumed and plastic wasted just from getting water and keeping the place cool. I cant imagine the large scale waste of the hotel industry as well",
            "Managed correctly, irrigation networks can be highly efficient means of growing all sorts of things in relatively arid environments. Some of the more desert like US states still manage to grow a lot of almonds, agave, cotton, lettuce and melons to name the crops involved in the largest commercial operations. \n\nSomething else you said stuck out to me though:\n\n>Those places don’t have natural resources\n\nArizona, Nevada and other states in the American West *do* have a fair amount of natural resources, namely mineral resources. The first thing that probably comes to your mind is gold, and there was certainly a gold rush which fuelled exploration of those parts of the US back in the day. The most important one for Arizona is definitely copper though. \n\nThere are also coal seams all over the place, and then there are mineral resources which we don’t extract metals from, but use directly as building materials.\n\nAll in all, there are resources of gold, silver, lead, gravel stone, clay, pumice, coal, petroleum, uranium, and salt in the likes of Arizona/Nevada. Permits and leases are issued to prospectors and companies to get at all these, regulated by some minerals resources arm of the relevant state department. Make no mistake, mining is big business. Of everything that humans use - if we can’t grow it, we gotta mine it.",
            "Idk you noticed or not but it’s ironic question checking at the community name. \n1. Fun city\n2. Gambling\n3. Adult entertainment \n4. Beautiful tan\n5. Not near school, college, hospital",
            "We do not get significant weather events. As a lifelong resident of southern AZ I look around most of the rest of the country and think \"how do people live there?\" I don't have to put up with hurricanes, tornados, earthquakes, floods or bomb cyclones or insert any other potentially home destroying thing. My grandparents live in the same exact brick house their parents lived in and have never had to renovate let alone rebuild. I can't imagine living somewhere my house could just be gone cause of weather. I will gladly deal with hot all year. I burnt myself on my seatbelt buckle today and that is the most severe weather event I will ever have to cope with.",
            "I'm confused, is Las Vegas a state or did you just compare Arizona to a city?\n\nArizona has a mountainous region that gets...Wait for it...  Snow?!!  IN THE DESERT? Yuuup, snow.  Which melts and turns into water, which flows down hill cause gravity, and brings water down to the lower elevated areas.  Where native Indians before European Genocidalists calling themselves Americans slaughtered almost all of them, built aquaducts that carry the water for hundreds of miles that modern day technology struggles to emulate.\n\nWe have a variety of minerals, copper, silver, gold, albeit a lot of it got mined, and I'm willing to bet somewhere there's oil.  The land is surprisingly good for agriculture (corn especially) and short of the fact it's a bipolar state that goes from 100-and-kill-me to freezing temperatures across the year, isn't so bad.  It's a dry heat...And a dry cold...Except during monsoon season where it's a humid heat...Crawling with bugs...  And scorpions and snakes and spiders including one of the deadliest spiders in the world, the Brown Recluse Spider.\n\n...WHY THE HELL DO PEOPLE LIVE IN THESE PLACES?!",
            "Humans are a lot hardier than you think. Try to imagine the original 13 colonies trying to get through -30F winters.",
            "You forgot LA.",
            "One of the economic staples in Arizona is copper.  Tons of mines in the desert. There is a lot natural resources.",
            "In addition to other reasons in this thread, in the case of Las Vegas, consider the regulation created scarcity of unnatural resources like blackjack tables.",
            "I know in Northern Nevada, North of Vegas, there is mining up there.",
            "Unrelated to answering the question: But I'm from the horrid humid heatpit that is Florida and I honestly want to see what it's like in a dry-heat place (deserts are so beautiful to me). \n\nCan anybody fill me in on what it's like there and how it'd compare to Florida?",
            "If all people took the \"habitable, pleasant, resource-rich\" strategy to settlement, we'd be a country full of Los Angeleses.",
            "Where do you draw the line? I live in a hot place but it really only sucks in the summer. It’s awesome any time else. You think i wanna drive in snow?",
            "New Orleans is below sea level and prone to flooding...",
            "I think one of the draws was for people who were allergic to grass and plants like that. But, then they go and plant grass in their yards.   \n\nI think everyone is looking for the El Dorando gold and that's why they moved there.",
            "It didn't used to be as hot as it is now",
            "Because IT'S VEGAS BABY !!",
            "Lol like LA?",
            "I'll take the dry heat of the desert over the humid heat of the southern areas anytime.",
            "Nevada I know is due to Lake Mead.\n\nArizona is not just desert, but the southern part is. It is rich in copper and cows, that’s all I know. We also got a fatty amount crops, to be honest. And the climate was never as bad as it’s been now. Due to the pollution and crowding and global warming (I think, right?) we’ve slowly began to get more hot and hot. We also run solely on Lake Mead and some other water sources here and there, such as groundwater. Within the next 20 years I’m more than certain Southern Arizona might become uninhabitable due to heat and lack of water. Or at the very least we’ll have to ration water (no grass lawns:( ) \n\nAs for northern AZ, it’s actualy pretty habitable. From even places like Scottsdale, or Prescott, anything north of that is pretty nice. Lush in trees, grass, and seasons!",
            "Also the no resources part isn't true, Arizona has gold, copper and other valuable metals",
            "Idk you ever built a base in a desert zone in minecraft?",
            "They actually have a lot of farm land in those areas. the growing season is like 300 days long or something because it never or hardly ever freezes",
            "Many of us relocate to Arizona so we can have the same weather for 10 months of the year. I dealt with -50 degrees Fahrenheit my last winter before moving south.",
            "There are crazy minerals natural gas and oil in the ground out west. I predict in the future places like these will be a hub for solar energy as well. \n\nAnswer is there’s always something that makes money in places like these. Is it sustainable? Probably not.",
            "I’ve always wondered how did people deal before AC was invented?",
            "I just don't understand how anyone tolerates the heat there",
            "Those area had enough resources to support a small population, which probably was before. Then something happens to cause a population boom but at the same time technology advanced and supported the population growth. So we get a large city that seems like it shouldn't exist there if we think of it as a huge city from its creation. Vegas was a small town then mobsters introduced gambling which became a major cash income for the area despite it being in the middle of nowhere. By the time it became a huge tourist hub there was the technology and infrastructure around to support the population. Hoover Dam, AC, transportation infrastructure, etc. The only reason Vegas is still a city is because of tourism and gambling if you took it away there's no purpose to supporting a city there as there's no other industry there to justify it and it would not exist. \nOther cities that appeared to be far from resources and the middle of nowhere is either because it was a rail road town. It was a stop for trains resupply, drop off people like miners if there was gold and other things around. It's also a place people could lodge for the night and find prostitutes. Those railroad towns grew with the times and eventually diversified out of that industry to survive long after those initial industries aren't as massive anymore. \nOther cities were just trading outposts for fur, livestock and crops that also grew with technology.",
            "I watched a documentary about what would happen to the earth if people were suddenly gone and without pools to create humity, and without a shit-ton of unnatural black asphalt to attract the sun, and without the unnatural abundance of unnecessary trees being planted where trees shouldn't be planted producing oxygen, Phoenix is naturally a temperature around 75°. Humans have caused the unnatural heat to the southern states. Also, I was born and raised there. My whole family too. My grandmother used to tell me stories about how it wasn't *always* so fucking hot there.",
            "I would assume when most of these places were settled water usage was less and ac wasn’t a thing so it was just settling somewhere hot.",
            "Some years back I once saw a \"futurism\" video that was made in the 1950s and it was about building suburban homes in Arizona. A 1950s housewife was in the kitchen (because of course she was) doing normal 1950s housewife stuff and then the camera panned to the window and it's a friggin desert and the narrator is talking about why build in an inhospitable place like this and his answer to himself was literally \"because we can\" and he goes into a spiel about how great man is at taming the wilderness and bending it to his will with this great technology of air conditioning. Every once in a while I try to find that video again and haven't had luck.",
            "Holy shit it is 43 Celsius in Phoenix right now. How the hell do you people do it? Next Friday is apparently going to get to 46!",
            "There was metal to be mined",
            "Because it’s hot.  Old people retire there",
            "If you notice, right after the Gold Rush silver came around, those who were in California and had gotten nothing out of the Gold Rush went to different places. Those who went to Nevada hit the Silver jackpot.  It became a big, rich town, and Vegas was the result. Now Arizona us different, idk about that.",
            "Somewhat like Regina Canada... Make no sense. Not even a natural waterway. Flat tundra. Basically a bunch of settlers just gave up on crossing Canada and boom, you've got Regina.",
            "I live in Tucson, AZ.  I don't have AC in my house.  Just a swamp cooler which doesn't work for shit this time of year.  I don't use the AC in my car.  It's not that bad.  I'll take 110f here over 90f in the midwest any day.  A lot of the water consumed in AZ comes from the Colorado River.  Why not do some research into cooling costs in the Southwest vs. heating costs in the Northeast or Midwest (That lake effect is no joke in Illinois)?  And while you're doing that, don't forget to factor in increased costs for snow / ice related delays to commerce logistics and even traffic delays as well.  Last but not least - I wear my flip flops 365, Son.",
            "And compare that with places like India where the temp can get to 45C (113 fahrenheit) and people dont have AC and they live in crowded apartments.",
            "It got so hot in Phoenix last year that planes could not physically fly. Say what you want, but that’s fucked up.",
            "[deleted]",
            "Yeah Nevada sucks. Don’t come here.",
            "Im from Australia. I've wondered why we haven't expanded into the desert since they've done that in america but the reason is probably because we don't have a high population and also that we don't have enough arable land to support a higher population where some cities  will be in the outback.",
            "Because there are 7.8 billion people on this planet and there’s no where else to go",
            "Its really pretty",
            "There are many reasons cities/towns exist.\n\n1. Natural resources (Good fishing, mining, farming, etc.)\n2. Geography, travel (Access to multiple methods of transportation, such as having access to multiple waterways)\n3. Geography, defensibility (Natural barriers making forts advantageous)\n4. Availability of land (Places with no natural resources can still make for good wind farms, solar farms, data centers, etc.)\n5. \"Pit stops\" (Places that evolved from places travelers stopped at while traveling)\n\nAnd many more. Natural resources aren't the only reason cities exist.",
            "The extreme heat is for 2 months. The rest of the year the weather is great. Way better than a place like Manhattan where the summers is 90s + 80% humidity and then the winter is extremely cold because of the wind.\n\nI personally love the desert. It is not the picture posted nor just endless miles of sand. It it teaming with life, valleys, mesas, springs, caves and so on. There is something special about the desert for me.",
            "all of these places have gambling and prostitution.almost anywhere else all that will be illegal at these places,however,its a roaring buisness.\n\nits due these facilities that they make money there.they earn 10 times (like,as in literal 10 times )the amount of money that they put in maybe even more.\n\nyou'd say but what about the nature and ground water table?\n\nthe truth is,businessmen are stupid.like literal stupid.all they care about is money.if anything is available cheap,no matter if it harms nature or not,they will get to it and sell it at a higher price.\n\nirony being that we cannot get rid of them even if we want to since it would cripple the economy",
            "Bsically, it used to be good for some specific situation and/ or for a small population, but but people ruin it all by breeding. The parents might have chosen to live there, but the kids didnt.",
            "Arizona is actually a huge mining state with tons of minerals and extreme weather. This combination of intense heat and extremely dense soils actually creates the perfect testing grounds for mining equipment. They send them to Arizona to break them so they won't break anywhere else.",
            "I remember from a documentary or something on TV that one of the main reasons Las Vegas is so dry now is because a lot of the natural spring water from aquifers that used to exist there was used to water the lawns when Las Vegas was starting to boom.\n\nAlso having water fountains and other big water displays was a sign of wealth.\n\nIf you want to read more about the history and statistics of water usage in Las Vegas, I found a governmental pdf that actually describes what happened really well: [https://pubs.usgs.gov/circ/circ1182/pdf/08LasVegas.pdf](https://pubs.usgs.gov/circ/circ1182/pdf/08LasVegas.pdf)",
            "Not related to your topic of harsh places but some trivia: a lot of coastal villages developed at the head of tide. In American history, early transportation was mostly by boat so there was a practical limit as to how far a boat could easily make it up a coastal river or estuary. If you look at a map Augusta, Maine looks inland but it is actually at the head of tide on the Kennebec River.\n\nInteresting question, thanks for bringing the topic up.",
            "I don’t have much to add other than fuck your opinion, Phoenix is worth it",
            "As an Arizonan we don’t have much other than copper, cotton, and citrus, most people are either wealthy or poor here, but we do get almost perfect weather during the winter and a bunch of old people from up north come down but summer is unbearable.",
            "Because land was cheap so greedy land developers bought it and were good at selling homes to people, and enough dummies fell for it",
            "The Hoover Dam is a natural resource.",
            "We’re going to need to dump all the trumpers somewhere when this is all over. What better place than a lifeless sandbox?",
            "This has been a great thread. Lots of good discussion. Can anyone suggest other r/ that discuss history and/or environmental issues? \n\nIf anyone is reading this comment...Anyone?",
            "Nevada is one of the largest producers in the world of gold, silver and lithium. There’s a LOT of precious resources here, especially considering those are all base components of major technology. You barely have to travel an hour north of Vegas to see the lithium brine pools everywhere.",
            "This doesn't quite asnwer your question, but there's actually a lot of videos of people creating fruit forests in phoenix, AZ and other dry parts of the US. Although AZ and other american states are known for their naturally hot and dry climate, a lot of what makes living in phoenix or LA unviable or unbearable is caused by the heat island effect from the metro areas having practically no vegetation. To come back to fruit forests, in a lot of those videos people boast about how much more consistent the temperature is within their plot of land, because it is. Trees help keep things cooler during the day, and also help keep nights warmer to a certain extent.",
            "Arizona is or was rich in copper",
            "Same could be said for SoCal. They stole all their water from Owens valley and the Colorado River. That much population in the desert is unsustainable",
            "I can't really speak for Las Vegas, but if I remember correctly Arizona is known for their 3 C's.\nCooper\nCotton\nCitrus",
            "I think that about most of the US. Too many tornados, wildfires, republicans, and deserts for my liking.",
            "Las Vegas has a very valuable natural resource - water. Unfortunately for them, the water will run out soon",
            "There are a lot of natural resources, primarily metal ores, in the region.  Combine it with some water, and a bit of transportation routes, it had what it takes to grow.n",
            "\"Muh cheap land\" is probably a bigger reason than you'd think. No resources, super hot, less pleasant than other places. Very little competition for housing means cost of living is low. Low cost of living means low cost of labor. Low cost of labor attracts factories.\n\nNow, you've got a fab city.\n\nAnd without knowing for sure, I wouldn't be surprised if Vegas is in the desert because the remoteness allowed people to do shit that used to be super illegal when the city was founded.",
            "“Bobby, that city is a testament to mans ignorance” \n\n-Hank Hill",
            "Writing from the mouth of the Mississippi, as the convergence of two simultaneous hurricanes sends the temperatures from the mid 90s to the cool, sweet mid 70s (add 10-15 degrees for the humidity), this place is almost unbearable without a fan. We've got plenty of water (we could do with a bit less, or a bit more dirt) and you don't need AC but you really, really need a breeze. If you can't get one, you sweat profusely, stay in the shade, drink lots of cold liquids, and wear very light clothing if you can. We live here because it's the mouth of the Mississippi, the gateway to the Great Plains which are the breadbasket of the nation. Crops and raw materials for export flow down the river, oil, fertilizer, and imported goods push up. The river ties together the whole of what was once New France, up from where its muddy plume reaches out like a beckoning hand toward the fantastically lucrative sugar islands of the Caribbean, past the port of New Orleans to Baton Rouge, up through St. Louis to Chicago to Detroit, then on to Toronto, Montreal, and Quebec until it reaches the Atlantic Ocean and ties right back to France, a giant loop of commerce, culture, and history where people from Maine and Nova Scotia to the Gulf Coast share language and traditions. There's been a city here for three hundred years now and, if the water doesn't rise too high, the storms don't blow too hard the river doesn't switch channels then there'll probably be one for another 300 simply because if you want to go up the river you have to switch from an ocean going ship to a river boat somewhere and this is the closest place with the deepest water.\n\nThe music, food, and culture are unlike anywhere else in the U.S., but that's more of a perk than a reason.",
            "Why have cities in the midwest and northeast if you have to depend on heat during the winter. Why inhabit florida with all of the hurricanes. Califorinia with the earthquakes. Wyoming cuz....its Wyoming.",
            "\"Muh cheap Land\" is as good a reason as any with housing cost becoming insane, someone will always be willing to buy cheaper/remoter/less hospitable land and make do.\n\nKinda one of the reasons you have the America you know in the first place.",
            "A while ago, I worked for a national brand that opened a new distribution center near Vegas. This was their 8th center in the country and all the locals laughed when the handbook described what radio station work closures would be announced on for bad weather. The new bosses from out of state seriously expected to have up to 10 days each winter where the warehouse would be closed because people couldn't get to work based on their experience in other areas of the country. 15+ years later, they've never had a weather shutdown at this site, and my understanding is the company has moved more distribution to originate from the Vegas site because it's so much more reliable with freight coming in from So Cal ports.",
            "mony",
            "Las vegas means oasis",
            "Cuz people are dumb",
            "Most of these cities today have extremely efficient water recycling systems. I wouldn’t want to live there but they aren’t as wasteful as it seems.",
            "Copper.",
            "low living costs, isolation alot of reasons",
            "Much of the growth in these places is due to \"snowbirds\" . I lived in the Phoenix valley back in the 90s. Every winter about 1-1.5million part time residents would return from colder climates to enjoy the warm winter's. Summer is as hard to handle in Phoenix as winter is for Chicago. Natural resources can be purchased and brought to the valleys. It's nice to live in a time when we can manipulate our environment.",
            "The cost of living here in AZ is cheap af. Couldn't quite swing living in SoCal.",
            "It does have one very underutilized natural resource. Thousands of acres of flat empty land with optimal sun exposure. Theoretically you could have enough solar farms for our southwestern states to power the entire continental US.",
            "Arizona has slot of valuable resources in it. Tons of mineral sources, and only about half of the state is hot desert. The other half is a pine forest",
            "There are around 7.3 billion people on this planet and people need housing. Among other reasons",
            ">muh, cheap land\n\nthink you summed it up",
            "It isn't worth it, no, but until the actual cost is taken into consideration and more decisions made, it's possible. The real problem is that the system we have doesn't punish people in that sense. But this is gross everywhere. I live in a cold climate and the amount of people who heat their homes so they can live like it's summer in the dead of winter is too high too.",
            "I'm literally moving to Phoenix next week 🥵",
            "*cries in Winnipeg*",
            "we have tourist attraction as a resource",
            "During times like the gold rush or when the government was pushing people to move there, people just settled and stayed but you can find a lot of empty ghost towns from the gold rush and other stuff",
            "Hoover Dam provides a ton of resources to Las Vegas and cost of living here is affordable compared to other big cities",
            "There is one weird factor I learned from the book  *How We Got to Now*  by Steven Johnson.\n\nBasically around XX century there was a man named Frederic Tudor. He lived near cold lake in England and had an idea: what if I sold an ice from it? After years and years of failures he finally managed to create completely artificial need of cold ice among large groups of people. His business that came from nothing was literally bustling, as he was sending ships full of ice worldwide.\n\nHis \"invention\", the idea of selling ice helped people from developing hot regions A LOT. They were finally able to store huge amounts of food without it starting to rot, and they were able to keep themselves at least a bit colder with late night drink with some ice.\n\nOf course it's not the whole story, but it's seriously very interesting and niche factor that helped those people make it!",
            "A lot of people have covered the historical choices and developments that led to cities evolving in hot places. \n\nBut also remember that the difficulty we confront there is often a choice of architecture and layout/planning of the City. (which again,. is often extremely expensive or time-consuming to change after the city has grown up and expanded using traditional building methods).\n\nBut it is very possible to build homes and buildings in hot/dry areas,. and build them in such a way to integrate nicely with the hot/dry climate. You can build underground (or multiple floors underground) or design buildings in such a way to prioritize Solar and different types of evaporative cooling or etc.",
            "Noob has never heard of Petra",
            "Because no state taxes and cost of living is less. \n\nHowever, keep in mind, the city isn’t like most and it’s main employer is MGM Resorts. Everything is centered around Casino money. Which in times of recessions, this city is one of the hardest hit. \n\n#nativenevadan",
            "Yep.. I just wanna see vars open by October 🎃🔮",
            "Some of us just like the desert lmao",
            "Phoenix AZ boomed particularly because of it's potential in the software/server storage industry. What's the worst weather you can get? Dust and occasional rain are the only natural disasters, making Phoenix an ideal area to store delicate electronics without risk.",
            "Arizona has many natural resources.  Arizona is know for its valuable metal mining, how cattle flourish in Arizona, as well as how well citrus and cotton grow in Arizona.\n\nIrrigation and population has lead the rivers to be dry, but there is plenty of water, to the point where water has been sold to other states.\n\nArizona is the 6th largest state in the US.  There’s more to it than Phoenix.\n\nAs for Climate, Arizona gets snow in winter months.  About half of the state is really hot for a few months.  The rest of the year, the climate is great, and that’s why we get some many people that spend October to April here.",
            "Along with the other reasons people have pointed out, Arizona can also be a haven for people who suffer from extreme allergies, due to the dry air and lack of natural deciduous forests.",
            "HVAC is one of the most impactful human inventions of all time. We can survive in pretty much any climate on Earth thanks to it.",
            "Because if i told you a human can't look to the left while sticking his tounge out you would most probably try it.",
            "Wagon must of lost a wheel or they lost ambition",
            "I live in Arizona and I question why every single day. I was brought here as a child and I wish my mother would have settled on somewhere less miserable. \n\nI bet the first settlers of this god forsaken place probably stumbled upon it in winter time, not knowing the hot sweaty hell it would become.",
            "Cobra Skulls -- Cobra Skullifornia was practically written for this reddit post. \n\nhttps://youtu.be/tdxvbLXPDDs",
            "Ask Nestle why....",
            "Gold, silver.",
            "Along with all the other answers these are ideal stopping points on your way to cali-for-ni-ay. With modern cars you can get enough mileage to maybe make it through the desert.",
            "I was going to ask why people live in NY where the weather always sucks when you can live in places like San Diego...",
            "Arizona has copper and Nevada has silver. Ph-E-O-nix and Las Vegas were both built up back when those things were in much greater demand. Now they just sort of sustain themselves through network effects.",
            "Cause 'merica",
            "Vegas and Arizona are getaway regions for people from Southern California. Also, their peak seasons are during colder months.",
            "I live in Vegas and have always thought this. thanks for asking such a brave question lol",
            "Arizona's Salt River Project actually provides more water than most States I think. Having lived in several States all varying in climate I can also say Arizona's weather is the best. I actually would view cold places as uninhabitable lol it's all preference.",
            "Cheap land and the need of an oasis in desert is why they mob moved in with casinos.",
            "MAFIA",
            "They are a monument to man's arrogance",
            "We need space. Try fitting these people somewhere else",
            "Nevada is known for its silver it was one of the biggest silver mining states in the country. Also quicksilver. And Arizona had the largest copper deposits in the country.",
            "Easy you can buy these arid land for cheap. Add some water and sell them back with a huge profit.",
            "Arizona has the 5 Cs.",
            "Lol. Florida FTW",
            "Because no one would live in Australia and that is one of the best places to live."
        ]
    },
    {
        "post_id": "15ghlj4",
        "author": "Cute_Bandicoot2042",
        "title": "Recently doubled my salary after living paycheck to paycheck for years - what do I even do with all this money?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/15ghlj4/recently_doubled_my_salary_after_living_paycheck/",
        "score": 13922,
        "num_comments": 6468,
        "created_utc": 1691002971.0,
        "selftext": "My masters degree finally started kicking in, hooray!  Besides obvious things like paying off bills, getting a better car, investing, and saving, what are some things I should buy?  I've basically been paycheck to paycheck so long I don't even know what to do with it all.  We went from \"getting by\" to having thousands extra every month, so it's been kind of a shock.\n\nMostly just looking for some ideas for nice/fun/practical things which I can do or buy for the home, things that would be a way to upgrade my life and how I live, that sort of thing.",
        "permalink": "/r/NoStupidQuestions/comments/15ghlj4/recently_doubled_my_salary_after_living_paycheck/",
        "comments": [
            "I don't have any advice on what fun things to do, I'm just dropping in to urge you to be careful. Getting too comfortable living above your needs is an easy way to end up back paycheck-to-paycheck.",
            "Build an emergency fund of 4-6 months worth of savings to cover yourself on rainy days, but this falls under 'savings'.\n\nMaybe save some money for vacations or trips to make memories. I don't think materialism will make you happy in the long run.",
            "If you don’t have a great mattress, get one immediately. Even if you ultimately order a bed-in-a-box, go to a store and test a bunch out so you can make an informed decision. Sleep is your friend.",
            "Pro tip, don't waste your money on an expensive car, invest in your home (in my country, your primary home only counts 25% towards net worth, therefor less wealth tax).",
            "When was the last time you bought yourself new underwear?\n\nMight sound silly, but if they are getting old, it can feel like a big difference lol. Same with clothing, and I don't mean anything fancy, just some newer clothes.\n\nDefinitely focus on saving though and building the nest egg / rainy day fund.",
            "Get your medical, vision, and dental all in check. Possibly a dietician and physical trainer if you’re drowning in money. Your body will thank you later.",
            "Live on 3/4 of your salary and save up a quarter of it the first two years.",
            "Any health problems that you have put off cause you didn’t have the money to see specialists?\n\nGet those dental X-rays done, see that physical therapist, maybe see someone about that weird spot on your arm. Having plenty of money means you can take better care of your health",
            "Keep putting it away.\n\nYou're looking to spend it because it's there.\n\nDo you have at least 6 full months of expenses?\n\nDo you have an emergency fund aside from that?\n\nDo you have an IRA you're dumping into? A 401k?\n\nSmall upgrades outside of that, to things that you use now and will, that's a thing. Like, do you like coffee? How do you make it? Going from a $30 drip maker to a $90 one will enhance your life. If you buy Sbux lattes or cappucinos, go get a Nespresso and a milk foamer and save money WHILE upgrading your life, you know?\n\nAlso, find charities you believe in.\n\nIs there a small animal rescue near you? An animal hospital or vet that has a fund for people who can't afford treatment? Do you do Donors Choose? Kiva (you'll get the $$ back there but it'll do good while you can spare holding on to it)? NARAL?",
            "If you're in the US looking into opening a Roth IRA.",
            "Do some math and make a budget to figure out how much you actually need on a monthly bases, including a good amount of spending money. Have the rest automatically deposited in a savings account to avoid excessive lifestyle inflation. \nAs for something fun to buy with more money- good groceries. Nice cheese or fresh herbs just for a regular dinner.",
            "Practical in my opinion is always the first, best options for gifts or even treat yourself moments.\n\n1) Get a good bed. I mean like really research, shop around, test in person a good bed. A good mattress is a life changing thing.\n\n2) Update/Upgrade any kitchen appliances. As in a microwave, toast oven, air fryer, blender. All those things. It’s nice to have them ready to go when you want to cook at home. \n\n3) Update/Upgrade your living room set. A comfy couch or armchair is just as invaluable as a good bed. It’s nice to come home to have your own space just the way you want it.\n\nThere’s a bunch of other things you could get right now that ultimately pay off in the short term but will not last very long. My first moves was upgrading my quality of life at home when I moved into my first studio. It made a world of difference after being a completely broke ass college student.",
            "Start by paying off any debts you have.\n\nThen fix anything that's broken. You have no idea how depressing broken stuff is until you replace/fix it.\n\nI know it isn't sexy, but it's a good idea to buy stuff like canned food and household items that keep in bulk, if you have room for it. You have no idea how lucky I felt when the pandemic kicked in and we'd just bought a huge bale of toilet paper from Costco and didn't run out.\n\nAvoid buying physical objects that will clutter your space until you have time to really think through whether you need them.",
            "Peel off new money and save it invest it NOW before you get used to it coming in.  Make it something that is automatic so you never see the money.  Do this every time you get a raise, it adds up over time.",
            "Congratulations on earning your what you are worth.  That is something that is very difficult to do.  Majority of people continue to live paycheck to paycheck and don’t have much left over.\n\nWhat ever you do, be sure to live below your means. Save your money.  It would be good if you had at least six months of your salary saved for a “rainy day fund”—in case some emergency occurred, you have funds to take care of things.  Start saving for your retirement.  You are never too young or old to start putting money away for that.  Another commenter stated that you should consult a financial advisor.  That is a great piece of advice.  They can help you look at your finances and set up goals that you can work towards, such as big vacations or a house.  If you do go look for one, don’t go to some Joe Schmoe.  Go to a reputable financial institution to get one.",
            "If you're in the US - get into the habit of actually going to the doctor/hospital when you need to.\n\nI got very used to avoiding doctors because of the bills, and am now playing catch-up on problems that could have been caught earlier.\n\nSame with the dentist.",
            "Save money. You can never go wrong with saving money. If you just have to do something, maybe work on your wardrobe and redecorating your house. Save up for a nice vacation or even start a small service/business to make more money. Jmho",
            "Treat yourself a tiny amount and just save. Go for those impulse buys every so often. But just save honestly.",
            "Keep saving. You don't have to use up your new money. When the excitement wears off and you can think more clearly about priorities, enjoy. If you must buy something now, make sure you can pay it off right now. \n\nSome items for your home:\n\n* A small, separate refrigerator for beverages; or an extra fridge/freezer in another area\n* Tankless water heater\n* Lawn service\n* Fix everything that needs to be fixed\n* Extra electrical outlets\n\nFor you personally:\n\n* Travel!\n* Class or activity you've been meaning to check out\n* Good shoes\n* donate regularly to a charity of your choice for 6 months",
            "r/personalfinance has some great info.  [https://i.imgur.com/lSoUQr2.png](https://i.imgur.com/lSoUQr2.png)  the flowchart here is a great place to start.\n\nThen head over to r/fire and start thinking about retiring ASAP!",
            "Brother man invest in some hobbies. With the extra money the only issue should be how much time you have. And it’s good to have something to look forward to other than work haha",
            "Lifestyle inflation is a thing and it will kick you in the ass if you let it get out of control. Put away around at least 6 months worth of expenses before you start balling out.",
            "Still live like you're poor. If you have any debt, start paying it off. Save, save, save. There are even just money market accounts out there at 4 to 5 percent interest with zero risk. If you want more risk/reward put a small portion of your money into the stock market.\n\nThe fun thing you can do is not live paycheck to paycheck. You can have medical insurance and a functioning car. You can start saving for a home and retirement. \n\nThere will be opportunities for vacations, nights out, dinner with friends, etc but if you start living it up you'll be back to having no money. \n\nIt's really easy to spend money.",
            "1. Put away an emergency fund of 4-6 months of living expenses. If you have a car you may want to keep an account for that, loaded with a few thousand dollars.\n\n\n\n2. Setup a retirement account that will withdraw from your chequing account automatically, you will not miss this money now and you will thank yourself later, especially if you can put away upwards of $1k per month and you're fairly young.\n\n\n\n\n3. Setup automatic withdrawals of whatever amount you feel comfortable with for things you are saving up for. You can have multiple accounts for various things, like vacations, hobby equipment, etc. You can adjust the amounts going to these accounts in priority order.\n\n\n\n4. After all this money is out, make sure you have enough left over to eat and manage bills comfortably. A lot of people use extra money as a crutch when they are too lazy or tired to cook, clean, etc. And burn THOUSANDS of dollars getting takeout and drinks when they could otherwise own a home.\n\n\n\n\n5. You can make a budget and check how much you're spending on everything. There's plenty of resources online for this, but for me, putting as much as I can away as soon as my paycheck comes in forces me to stretch what I have leftover, and I make better choices when I have to think about how to make $500 last the next 2 weeks. I'm not stressed, I have money if I really need it, but I'm paying my future self first and I can live on the minimum in the meantime",
            "As others have said, save a good chunk of it to have a solid emergency fund/retirement accounts maxed out.  Once that is done, if you have major home upgrades or repairs (what shape is your HVAC, roof, etc in?), go there.  Then once those are taken care of, take yourself of a nice vacation to someplace you’ve always wanted to go.  It’s very possible to have an emergency fund, a good house, kids if you want them, and one or two reasonable vacations a year if you’re deliberate about your spending and saving.",
            "Boring answer:\n\n1st - “rainy day” fund. Put away 6-12 months of expenses and learn to budget when you’re not forced to be frugal\n\n2nd - pay down any debts, credit cards etc (learn how your credit score is calculated good credit can change your life bad credit can ruin it)\n\n3rd - if you job offers a pension contribution max it out. Otherwise invest in a mutual fund ideally via a tax advantages account Roth IRA (USA), ISA/LISA (U.K.) etc \n\n4th - start looking now at the next step in your career and working towards that. Get experience in those desirable areas or projects etc. keep your resume updated with anything note worthy (it’s easy to forget all the stuff you do)\n\nOh and start to apply to that next step when you estimate you’re about a year or two away from being ready.",
            "If you don't have it already, savings. As a former paycheck to paycheck fellow, first thing I did was build up my savings. That way, a small disaster won't push the reset button on my life. I can afford a cheap but reasonable replacement car if mine dies, or cover rent and living expenses for a good while if I suddenly have to find a new job. That is a life changer.\n\nOnce that's out of the way, look around your home. Do you have that one pan that sucks, but it gets you by? Replace it with a quality one. Do this for anything you've skimped on before. Clothes, towels, sheets, to name a few. Start identifying bigger items you might want to upgrade, like your microwave or washer.\n\nAlso, if it fits your budget, give yourself an allowance. Personally, I was so stressed about money that I never allowed myself little things, like going out to dinner, unless it was a special occasion. It's a different world when you can go to dinner because it's Tuesday and no other reason.\n\nYou'll figure out how to handle it, I've no doubt, and wish you continued success!",
            "Get a high yield savings account and put 10% away every paycheck. More, if you feel comfortable. Savings is exactly what you should do, but to ensure it's with a high yield savings account, you'll gain more interest than putting it in a regular savings account.",
            "You can make some fun purchases, but one of the most important things you can do for your future self is begin to think about your retirement strategy.\n\nThere's not only one place to look, but /r/personalfinance has common advice and books like:\n\n* [A Walk Down Wall Street](https://www.amazon.com/Random-Walk-Down-Wall-Street/dp/0393330338)\n* [Bogleheads](https://www.amazon.com/Bogleheads-Guide-Retirement-Planning/dp/0470919019)\n* [The Only Investment Guide You'll Ever Need](https://www.amazon.com/Only-\nInvestment-Guide-Youll-Ever/dp/0544781937)\n\nare commonly recommended.  Even if you don't take action now, it's something to start thinking about.",
            "My advice is start a big savings account, and then down the line you’ll be set up forever. Not to mention you can dig into it to treat yourself (with a trip or whatever) whenever you want",
            "Honestly… forget the material stuff and travel! You can buy a better car, sofa, tv, etc but traveling creates memories you’ll never forget.  Don’t wait until you are 70+ to visit Europe, do it now.",
            "Be humble.",
            "Honestly, if you have to ask Reddit what to spend your money on you probably shouldn’t be spending your money on anything. I’m not saying not to enjoy yourself, but don’t spend it just because you have it.",
            "don’t change anything.  save until you have 10k emergency fund. until then you shouldn’t ask anything about using it",
            "My 2 cents? Anything to do with your health that you've been putting off.    \n\nDental checkups and cavities. Physiotherapy for aches you've always brushed off. Gym membership to get fit. Food subscription boxes to eat healthier and yummier. Therapy for sensitive topics you don't want to have nag your mind any longer.\n\nYou are always an investment.",
            "Definitely invest in your retirement & save money! Can never go wrong with having money for the future.",
            "Maybe work on getting your electricity bill down. Get a heat pump water heater, a wood burning stove, more efficient windows (if you need them), a mini split system, etc. A generator with a proper generator inlet to your house is really cool. Solar is an option as well, as long as you don't use a company that overcharges (a lot of installers in my area are preying on financially ignorant people). Make your house resilient. If you can use your money to save money and increase the value of your home, it's a win-win.\n\nI've kept on \"leveling-up\" over the years and just wish that I would have stayed in a smaller house with smaller bills. Be content with what you have and treat the things you own as investments.\n\nMaybe sign up with something like Mint so you can watch your investments trend up over the years. There's something to be said about owning a huge chunk of money instead of a bunch of depreciable assets.",
            "Get yourself a pair of nice headphones and listen to some music like you never have before",
            "Two chicks at the same time.",
            "Save a large percentage",
            "Squirrel some of it away, you have a chance to build up a decent “oh shit” fund.",
            "Nice job! Save for a house. Renting is a cycle few get out of these days.",
            "Don't spend more just because you're earning more.  That's the trap of lifestyle creep.  The way to get ahead is to keep your expenses low & save and invest as much as possible, as soon as possible.  That would significantly upgrade your life in a few years.  \n\n\nWhat you could do is put aside a reasonable vacation budget and go travel, or try some cool new memorable experiences.",
            "Invest in your retirement. Real estate or an index fund. Don't trust the government for your retirement. I have invested $200.00 a week in my retirement fund for almost the last 20 years. I rase sheep, goats, hearding dogs and live stock gaurdians. I make almost $60k a year after expense. Currently, I am an OTR truck driver that averages 80 to 90k a year. Thanks to the Lord almighty. If I was no longer able to physically be a truck driver, I could live comfortably at home and still make money till I couldn't. I could sell everything and not have to worry about money until I died.",
            "Save for retirement. It will be here before you realize",
            "Don't change much and save your money. Start to grow it in the stock market. The biggest mistake people make when they get a raise is they find a way to pick up a new monthly bill. Save it.",
            "save, you may not have that job one day.",
            "First I hope none of your irl acquaintances know your Reddit username. Second I'd say you should invest in property",
            "Hookers and blow.",
            "1. Get roughly $500 in emergency fund\n2. Pay off your bills\n3. Increase emergency fund to roughly six months of expenses (food, utilities, rent/mortgage, transportation costs)\n4. Buy house then pay off as fast as possible \n5. If you have kids save for their education \n6. Save for retirement with an eye towards eventually having enough passive income to fully and safely retire \n7. Give to charities. Help others get where you are.",
            "Save save save!  And invest in your retirement plan!",
            "Give yourself a general checkup - see a dentist and check if there are issues developing that can be fixed before they become an emergency, go check your eyesight and see if you need glasses, go get basic lab work done to see that you are in as good a state of health as you can be.\n\nThese are thing that are often neglected when money is tight, and with changes developing slowly it is easy to just get used to problems like degrading eyesight and minor health issues that can develop into major health issues if they aren't checked.",
            "1. Save up an emergency fund\n2. Pay off all your debts\n3. Make sure your vehicle is good for a few more years.\n4. Save up a down payment and buy a house.",
            "Put it in the bank. Shit happens. Your car might break, something else might come up. It's nice to have an emergency fund for emergencies.",
            "Go to r/personalfinance",
            "I would save it.  Each couple needs a few million if we end up in a retirement home that runs $4-7K monthly for 10-20+ years.  I personally buy cars with cash and drive a basic car.  We do however spend any extra money on travel and experiences, once bills are paid, we’ve put X into savings, X into account for emergencies on house or car and X into a fun account that we have.  Fun account is used for travel, weekend activities, etc.  We always have 6 months savings in our account on top of the above, should one of us loose a job.",
            "Strippers and blow",
            "Get yourself a financial advisor.",
            "Save most of it, use some of it to travel.",
            "Invest it. All of your extra after a small lifestyle upgrade. A good option is a Roth IRA, don’t touch it until you retire.",
            "Plan for retirement so you can retire as early as possible.  If you buy a car get an economically sound one that won't be a money pit later.  Buy a used Strat and learn guitar.\n\nCongrats!",
            "Save your money. Buy an IRA lol",
            "Put it away until you have 20k.\nEverything after 20k should be invested.\n\nLive way under your means.\nThe money will stop coming some day and you need to be ready for that.",
            "You can always save and invest more, and you should.",
            "Retirement fund.",
            "Max out 401k/IRA and dump the remaining on a brokerage account in broad market index funds (VTSAX, VOO). Set and forget. Keep maybe a little bit of it to do a little fun thing once in a while. Do that every month. Avoid lifestyle creep.",
            "After taxes?",
            "Have you tried coke? I heard it’s an expensive hobby. Or donate to charities that you feel are important, might i suggest the Shriners hospital it give free medical to children. You could also join the Shriners.",
            "A nice set of bed sheets and pillowcases. Worth it.",
            "Keep living like that until the end of the year. Set 50% of your extra income into a savings account, the other 50% into a separate account. Buy yourself something nice for christmas with one half. Then look over your budget in January, make a plan to expand some of things. That way you have savings, you can treat yourself and you can start the year with a proper budget in 2024.\n\nIt's 4 Months of living pay check to paycheck, it's easy and you have something to look forward to and a small cushion.",
            "I am 38 and I wish I could go back in time and tell my to save WAY more money than I did. Now I'm like a dragon. I will guard my hoarde jealously just so that I can look at it and feel safe and content.",
            "When my degree started laying off, I spent the next few years catching up on things i couldn’t do before. Lots of dentist appointments trying to make up. Finally got car insurance. Bought tires. It’s was a long run of that then I got to start saving and going on vacations and fun stuff",
            "The very first thing you should do with that money is build the emergency fund for a rainy day. By rainy day I mean things you can't see coming, like an economic downturn, crazy medical bills, etc. Obviously have some fun, but the priority should be that fund. You don't NEED to buy anything with it for the sake of buying something. That would be a huge mistake.",
            "Get a little part of this money and save for travelling abroad, and another little part save for buying a house. Both are very important: having your place, where you can live if you run out of money and not depending if the owner wanna let you live there, and also making memories and expanding your horizons",
            "A really good mattress. Sleep is important.",
            "Congrats dude, I’m one and a half semesters away from finishing my Master’s and hope to find myself in a similar situation.\n\nAlso my advice:\nTravel",
            "You live the same and invest the rest",
            "Save up... Because that doubling is going to eventually feel like halving.",
            "What masters degree doubled ur income?",
            "Good rule of thumb for things that are worth spending premium money on is “things that separate you from the ground.” Mattress. Shoes/boots. If you spend a lot of time at a desk or a monitor, a really good desk chair (and you can get really expensive ones for a fraction of the sale price by buying refurbished ones from wholesale places). You get the idea.",
            "I would suggest maxing out your 401k",
            "Start putting some of it into an investment account or IRA before you get used to spending it.  There is this urge to accumulate stuff that you have wanted, but I found that I didn't need half of what I wanted.  You will thank yourself when you get older and want to stop working.",
            "Make a budget, see what your expense amount is and what your income is after all expenses. \n\nFor savings, I would take your monthly expenses and multiply it by 7-12. Put away extra money until you reach that point. Gives you a safety net if the worst were to happen and you can’t work/lose your job.\n\nAfter that idk, save for a house or better living accommodations?",
            "A nice bed. Temperpedic or something",
            "Invest it!! Look into dollar cost averaging. Dollar cost average into a broad S&P 500 index fund and you’ll get basically a share of corporate America’s profits.",
            "Invest everything above your past pay. Maybe keep 10% fuck around money.\n\nInvest can include starting a business.",
            "Live comfortably, not in excess. Put the rest in index funds and ignore them until retirement. Theres nothing else you \"should\" do or buy. It's up to you.",
            "If your car runs fine, don’t buy a new/better one. If it’s constantly in the shop then yeah maybe get one but not a brand new one, don’t get a monthly payment if you can pay in cash too!",
            "Get out of (pay down) debt, build an emergency fund (of a minimum of 6 months), fund a long term (tax deferred) retirement account. Always live below your means. Remember “a borrower is slave to the lender”. Fortunes can change at the twinkling of an eye. Someone said “life is a hike”, be prepared.",
            "First of all, congrats!  I'm sure it's very nice not having to live paycheck to paycheck.  As an older person I can tell you this - If I were you I'd play it by ear and save your money.  Keep your bank account big because you never know what expensive emergency could come up with a car or your home that isn't covered under insurance.  It's always nice to have some extra money in your bank account.  Just because you have it doesn't mean you need to spend it.  Maybe you can save enough to take a nice trip at a location you've been wanting to visit but couldn't afford it.  Pay cash and don't charge anything.  Also, when the urge comes to change the decor in your home you'll have the money to do that as well.  Like I said before, enjoy your ever-increasing bank account and enjoy having that money and spend it wisely.  You did say you wanted to invest and that's another thing I was going to suggest but in the market we're in now I'd get a financial advisor and invest in low-risk interests for now until the market gets a little stronger.  In the last 2 years a lot of people have lost a lot of their financial portfolio due to the horrible stock market, me being one of them!!  My financial advisor moved my money to low-risk interests until the market gets stronger.  I'm not making as much money but I'm not losing as much, either.  Good luck to you and congrats again!  👍",
            "You keep living the way you've been living. Seriously. You use the extra money to pay off your debts if you have any. Don't get a new car unless your old one is a money pit that constantly needs expensive fixes. Put aside some money for savings for a rainy day; for emergencies. Start a savings account for a downpayment on a house if you are renting. Find a good financial advisor and invest the rest of the money. The income from these investments (that you constantly feed with any excess income) is your \"fun money.\" It won't be much at first, and that is good. Eventually it will be a good chunk of cash (and occasionally will dip when the market sees hardship).\n\nMany people make the mistake of spending all their \"extra\" money on fun things right away. All this does is put you right back to living paycheck to paycheck as you get used to a sudden increase in your standard of living. Before you know it, you will feel that noose of \"not enough\" tightening around your neck again. Instead, save and invest as much as possible, and don't treat it as \"extra\" income until it is a profit of your investment.",
            "“You get a house with a 25 year roof, an indestructible Jap-economy shitbox, you put the rest into the system at three to five percent to pay your taxes and that's your base, get me? That's your fortress of fucking solitude.”",
            "Make sure you are contributing at least 10% of your salary to a 401K, IRA or other retirement plan, a bigger percentage if you can.  When you reach 60 years old, you may be able to retire. After setting up a retirement account, put money away for fun vacations, a new car, guitars or whatever.  You'll never regret saving money, but you might regret buying a lot of expensive booze and hookers---well maybe not the hookers.",
            "I would buy better quality/healthier foods and a gym membership. That’s something worth investing money in",
            "Start an emergency fund. Put 5% of your paycheck in there until you get enough to cover you bills for six months. DO NOT TOUCH THIS unless there is a true emergency. Set up another account with 5% for big items you want to buy. Make sure you are contributing to a retirement account also. Do this so you can get used to living below your means. You should only use credit for a house. It might seem like everyone else is have fun buying cloths, phones, cars and eating at expensive restaurants but if truth be known they are sweating the debt. Save yourself that headache.",
            "Nicer food 😋",
            "Housekeeper. Just a couple hours a week but it’s a game changer.",
            "Living paycheck to paycheck prepared you to live within your means so when you make more money you’ll be able to save more money instead of blowing it all away",
            "Save it and continue to live the same way for 2 more years. Then upgrade a bit",
            "Get a bidet. Take occasional vacations. And hire someone to clean your house.",
            "A good bed, and some high thread count sheets. You're welcome.",
            "If the movies have taught us anything about having money, hookers and blow are fun ways to spend it.",
            "1) Healthy food\n\n2) A good bed\n\n3) Fitness equipment\n\n4) Treat yourself to a VIP experience once in a while\n\n5) It's fun to walk into a store and think you can buy whatever you want, but it's even more fun to walk into a store and think, \"God, I don't need anything in here to make me happy.\"",
            "try to stay with your current lifestyle, don't buy better car, try to stick with it\n\nif you upgrade everything right away, several months later you could end up living paycheck to paycheck again\n\npersonally i would celebrate and doing one time thing, go to nice restaurant, took short vacation\n\nbut for something longer like car payment, i would try to avoid it first\n\ninvest on low-risk investments",
            "Pay my vet bill tomorrow. I’m fucked.",
            "start going to the doctor and taking your health seriously.  start saving for a new car, or a newer used one when your current one dies.  start putting good money away for retirement.  start saving up so you can move into a house.  \n\nand then you'll be back to living like you dont have extra money anymore.\n\nand for real kicks, try reading up on what basic investing is like.  it's taken me....oh wow, almost 2 years now, but i finally have a good handle on it.",
            "Open a Fidelity account and put as much extra money as you can each month in an S&P 500 mutual fund. Wake up 30 years later with a massive retirement nest egg.",
            "Fully fund all retirement savings options. IRA 401k etc. Put six months of living expenses in an easily accessed account. Then put at least half of what your windfall comes to in some other kind of insured account, make conservative investments with more. Think about being able to retire early and travel extensively. Donate a hefty amount to your favorite cause. Adopt me. J/K!",
            "The very first thing you should do is set a budget. Even though you know you want to save, you need to have clear numbers based on when and how much you want to retire with etc.\n\nYou should also ask yourself if you actually need a better car. If the one you have works, drive it into the ground or at least until you can build up enough cash to buy a better one or put down a hefty down payment.\n\nDon't needlessly start tacking on debt now that you're making more money.",
            "Invest ETFs",
            "OK, I already see red flags >.>\n\n\"Paycheck to paycheck\" .... Followed by \"what to do?\" After salary raise to double.\n\nFirst, it would be good to sit down, calculate mandatory expenses vs. Income, see what amount is left, take part of the amount to raise your standard of living (better food, entertainment, etc.) to enjoy your better income but not overspend. Take the rest and use it to build a personal fund for whatever purposes. (Best is to spread between ready to access cash for emergency and cash invested each moth into some stocks or stuff like that => anti-inflation measures)\n\nThere, hope it helps ;)",
            "Buy yourself a secured future. Start saving for retirement!",
            "I experienced something similar. Recently got a promotion and the money is great. However I am older, and a bit more worn than I thought, I have a physically demanding job. But my point is, that you remember living paycheck to paycheck, and need to keep that in mind. A few years of hard work saving the extra money could put you in a financial positive where you could retire early. What better way to spend money than to spend time not at work? We all seem to be programmed that you need to put in so much time at a job to make your life as comfortable as possible, but I think the idea is to make your money work for you. My suggestion is get a cheap apartment, sell everything and use public transportation. Forget what anyone says about social status because nobody really matters but yourself and where your life ends up. Rice and beans, live like a monk on bare minimum. Put all of your money except for the basics into income generation. Rent, and purchase nothing unless it is bringing you an income. Now that you have an income larger than you can deal with, use it to increase your cash flow with less time working for it. This is the general idea of what the american dream was supposed to be like, getting ahead of inflation, getting life insurance, planning for the future of unknown outcomes. What better way to live paycheck to paycheck than writing your own, money in the bank every month and you don't have to work for anyone.",
            "get a good bed and a robot vacuum. build the ultimate relaxation center for when you don't have to work",
            "Get to zero debt and invest most of it to get sweet dividends/compound interest…max your 401k plus extra and max Roth IRA for every family member you can and max HSA if you got one…so when something catastrophic happens, you will be set. Once you get 3mil saved, then blow the rest on hookers and coke.",
            "Save for retirement. Don’t be foolish with money. But.. treat yourself!! \n\nGet a nice mattress. Take a vacation. Then save for retirement",
            "Invest it. Put it to work. Don’t spend it or “save” it in a bank account",
            "Take 70% of the extra money... invest half and put half in savings. Give the other 30% to me.",
            "Plan strategically for your retirement, so you can do it comfortably and on your own terms, while still enjoying your present life",
            "If you neglected going to a good dentist, I strongly urge you to do so. People who live paycheck to paycheck often amass \"medical\" debt of untreated/unnoticed conditions. It took me a yearsworth of extra income to fix me (including fixing some problems that I was told were \"untreatable\" by cheaper doctors), and another yearsworth to fix my partner.",
            "I'm sure I'm repeating a lot of people here but just save it all, as in all of it.  Max out any tax-free retirements options you have first (e.g. Roth IRA), throw a bunch in an index fund (e.g. a 500 index fund of the 500 most successful companies at Fidelity or Vanguard) and then as your savings accumulate, begin putting some in individual stocks or specialty indexes, if you save up enough real estate is always an extremely good long-term option (with some smart choices of course), and set aside some for home purchase/improvements and personal use (vacations, transportation, etc.).",
            "Start saving to buy a house",
            "save it, car problems, house problems, medical problems, vacations, electronic enjoyments. good to always have a backup fund.",
            "Why not save and invest? Doing so would be good for when you retire.\n\nBut other than that, time to upgrade your devices, replace broken appliances, buy insurance, fix up your house, etc.",
            "Living paycheck to paycheck, you know the stress of it. I would first ensure you have 6 months worth of savings before deciding to start changing your lifestyle. In this economy, I’m not sure how many jobs are considered safe",
            "Assets, buy assets. Make smart moves so that your money can make you more money and set you up for the long hall.",
            "Be careful of lifestyle creep or you’ll be right back to living paycheck to paycheck. Save save save!",
            "Head over to r/personalfinance.  Great place to ask this question and get very informative answers.  Congratulations!",
            "Save it zippy, in this economy there are no guarantees.......",
            "You’re asking how to go back to living paycheck to paycheck",
            "Don't go over to r/wallstreetbets\n\n\nbut do get an investment advisor",
            "A good mattress and bed!",
            "Save. Travel. Live. Enjoy your life.",
            "My advice is to try and live FRUGALLY but NOT CHEAPLY. \n\nExample\n\nFrugal: Buy a dependable car with good reviews and pay a reasonable (not too low) a price to get it. Put good tires on it that'll last more than a season and do the recommended maintenance (oil changes etc). \n\nCheap: Buying the cheapest beater car that'll last a few months to a year requiring you to buy another car or pump a shit ton into massive maintenance. \n\nWhen you're living pay check to pay check, you'll often need to make MAJOR compromises to make it to the next pay check. That means buying crap that doesn't last or doesn't work well.\n\nNow that you have a more stable income, you can plan long term and also, you can spend a bit more now to save yourself problems in the future. \n\nAllow yourself to be comfortable, money is a valuable tool and can make your life a lot easier, but if you're not careful, you'll just end up back at the pay check to pay check life.",
            "A house? Congrats on the pay rise!",
            "Have debts? A mortgage? Pay them off so you aren't paying interest on them.",
            "Invest your money, so you can retire early",
            "Never begrudge the things that separate you from the ground: bed, shoes, clothes,......",
            "Maybe you can take a portion of the excess to help others? Like donating to especially worthy causes such as children's hospitals, etc.",
            "Save",
            "Invest. Real estate property is always the best because most of the time they appreciate in value and can be a source of passive income.",
            "Roth IRA. Start putting like 10-20% away and also just start a diversified savings.",
            "After building a 4-6 month emergency fund, start working on any health stuff you put off. \n\nAs an example, detailed dental care is one that many people (at least in the US) put off due to expense, but it can absolutely have a huge impact on overall health. Get everyone in to see a great dentist. \n\nDo the same thing with any other health concerns. Go in and have them seen, even if they're small.",
            "Try to avoid getting a new car for as long as possible unless your current car is falling tf apart. If it still runs good and gets you from A to B: ride it til the wheels fall off and save in the meantime for a down payment on a newer used car.",
            "Congrats! One piece of advice I read is to start buying in bulk when you can afford to.  I really never realized how much I save until I started doing this.   I not only buy food and TP, but office supplies too.",
            "Get a financial advisor.",
            "Like a few comments have said get a nice savings amount before you start to spend more but one thing I started to buy was nicer socks and insoles for my shoes because I'm on my feet for 6+ hours a day.\nThen I got convenient stuff for my day to day a better coffee machine, couch, TV, ect but the one thing I spent way more than I thought I would on is a really nice bed.",
            "I don't want to sound like an asshole, but doubling your salary from paycheck to paycheck and saying \"all this money\" feels like a dangerous game. Be careful, because that's really not far away from paycheck to paycheck.",
            "A new bed!! Will do wonders after all those stressful years to have some extra good sleep.",
            "In this exact order:\n\nTAKE A REASONABLE VACATION \n\nPay off every single debt you have (excluding housing)\n\n3-6 month completely funded emergency fund. Account for EVERYTHING, like subscription services, eating out, etc. \n\nThrow 50% of your raise into a Roth 401k with an employer match if available, if not, a traditional 401k works as well. If that’s also not an option, a Roth IRA. \n\nUse another 40% of your increase to pay off/save up for a house \n\nUse the remaking 10% increase for lifestyle creep/leisure activities/products\n\nRetire a millionaire by never going back into debt.",
            "Max out your 401k, build up money in an HSA if you have one. Pre-tax stuff will save you money come tax season. \n\nI’ve always saved 10% post tax (auto transfer set up to occur on days I get paid) that goes into a savings account. Bonuses/extra money go immediately to savings acct",
            "Invest in education or self development. Do Not upgrade your life style yet, otherwise you will be still living pay check by pay check.",
            "Save that shit up til you find a super fun hobby. And then go wild on it when you get one down.",
            "Let me get around $3.50",
            "Suffering from success",
            "Be careful for spending creep.   When you go from a salary of 30k to 100k, you find a way to spend the excess without fully increasing fulfillment by that amount.  A nicer car increases insurance, a nicer condo increases HOA fees and these all add up.   Try to lead the lifestyle you have been living (while upgrading or treating yourself if deemed worthy).  The excess salary can be saved in a low cost index fund or similar retirement vehicle.   You will thank yourself in the future.",
            "Make mini savings accounts to cover maintenance costs for expensive items like cars, or a new fridge ($10k for a good one near me), or house reno account. Filling these each a little at a time, you could give yourself nice surprises on all sorts of different fronts in the future",
            "My motto is always to invest in experiences versus material things. Has never led me astray. I always feel happy.",
            "Enjoy the fact you earn more money and can treat yourself on things you couldn't before. But don't 'inflate' your lifestyle so much that you're living paycheck to paycheck again in a few years from now..",
            "Better food for yourself! Paycheck to paycheck I’d guess you were skimping a bit, but now you can get some things that taste better with an added bonus that it’ll make you feel a lot healthier too!",
            "Get a fursuit, just because",
            "Know a guy who is exceptionally diligent with his budget and very financially savvy.  Dude has 75k in the bank. because of this.\n\n&#x200B;\n\nBlending his experiences with my own. My advice is dont change your lifestyle right away and not drastically. Once you start spending money on new things you start HAVING to spend more money on those things. E.g. New car new maintenance. New subscriptions, better phones etc. It adds up.\n\nStart off by investing in things that allow you to be more efficient with your spending that you can really take advantage of all that new income in wiser ways and build good habits now.  Take appliances that make cooking and home maintenance easier and cheaper.  Have Buy tools for the vehicle that you couldnt get before, or invest in repairs and maintenance you'd been putting off.\n\nOnce you get the basics out of the way, start seriously looking at getting a house. Get a downpayment together and get on that one asap. A mortgage adds to networth, rent subtracts from it. Already have one? Consider the viability of investing in a second one. Could you make more from rent then you would pay in a second mortgage? Are you in a city that has a reasonable or high demand for air bnb? You could use it as an air bnb.\n\nWhen you get more income, you quickly adjust to the little luxuries and life improvements it enables. Soon they will start to feel like necessities and the flexibility you have now will start to wane. Start futureproofing yourself now. \n\nMe and my friend both went through the same situation (at different times mind you) I went after the nice/fun/practical things right out the gate. Now i feel like im living paycheck to paycheck again (at a higher standard of living granted) while my friend has bought, lived in, and sold 2 houses, has 75k in the bank and zero debt, in the same amount of time. And his quality of livng is about 2 steps higher than my own.  Be fiscally responsible and conservative now, and you can have all the nice fun practical things you want later without even thinking about it.",
            "Save up for some assets. DO NOT UP YOUR LIVING EXPENSES TO THE POINT WHERE YOU'RE EVEN CLOSE TO LIVING PAYCHECK TO PAYCHECK WITH YOUR NEW INCOME. money does not always solve the problem, and in some cases it makes the problem worse. If you are comfortable with your living conditions then leave it that way even though you're making more. Save and invest that extra money into things that will earn you more money, like renting out a second house to someone else (I don't really have more examples but you can probably find some on Google). If you do it right then it shouldn't be that hard to retire early, just don't give in too much to the temptation of spending all that you can.",
            "I had a similar event.  Though mine was more got a pay raise and finally paid off all debt.  While I dont seem to have as much money as you do, the first thing I did was get a new bed.  Sometimes just taking a look around and replacing furniture.   I saved some mlney every month, some for travel and some for nieces/nephews  (I have 6 and want to give to all equally when they graduate high school).\n\nThis may sound silly, but if you enjoy baking or cooking, upgrade your kitchen.  Get a Kitchenaide stand mixer.  Get some GREAT quality pots and pans and a sharp knife set.  Good quality fresh ingredients are only half the equation.   They dont mean much if you are prepping and cutting them with the Equivalent of a rock."
        ]
    },
    {
        "post_id": "i3z1a1",
        "author": "theIHK",
        "title": "Why are groups of animals called random things in English?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/i3z1a1/why_are_groups_of_animals_called_random_things_in/",
        "score": 13916,
        "num_comments": 618,
        "created_utc": 1596602922.0,
        "selftext": "A group of crows is a murder.\n\nA group of frogs is an army.\n\nA group of pandas is an embarrassment.\n\nWhat's the reason for that?",
        "permalink": "/r/NoStupidQuestions/comments/i3z1a1/why_are_groups_of_animals_called_random_things_in/",
        "comments": [
            ">What’s the reason for that?\n\nEnglish naming traditions for collective animal groups have their roots in [terms of venery](https://en.m.wikipedia.org/wiki/Collective_noun#Terms_of_venery) which date back to the middle ages. Those terms were complicated by design to show that a wealthy or noble man had the leisure to learn such things for hunting.\n\n🐸 Go Frog Army! 🐸",
            "[removed]",
            "In addition to the earlier answers, a woman called Juliana Berners wrote a book about hunting and used a lot of funny names for referring to animal groups and then people started to actually use some of them.\n\n>Many of the group names can be traced back to The Book of Saint Albans, published in 1486, about angling, hawking, and hunting. The book is attributed to Juliana Berners who gave animal groups imaginative yet oddly appropriate names. Berners, who had an intimate knowledge of wildlife, may not have intended these names to be taken seriously, but they were repeated through the ages and are now commonly used.\n\n[https://www.dictionary.com/e/strange-animal-groups-listicle/](https://www.dictionary.com/e/strange-animal-groups-listicle/)\n\nEDIT: typo",
            "These words are called \"collective nouns\" and are found in many languages. As for why we use them in English, according to [Wikipedia](https://en.wikipedia.org/wiki/Collective_noun):   \n\"The tradition of using \"terms of venery\" or \"nouns of assembly\", collective nouns that are specific to certain kinds of animals, stems from an English hunting tradition of the Late Middle Ages. \"",
            "[removed]",
            "MinuteEarth has a good video on this topic. Something about the noun they use is chosen to elicit the type of feeling you would get in the presence of a group of these animals. Not sure if it’s true but it’s an interesting point that makes sense to me.\n\nhttps://youtu.be/0rkrGwI4rZA",
            "It's literally a meme that has become so widespread we forgot it was a meme. Most were made up, they're from a very old book:\n\nhttps://en.m.wikipedia.org/wiki/Book_of_Saint_Albans",
            "[removed]",
            "[removed]",
            "One of my favorite \"nouns of collection\" is the one Click and Clack  made up for  a group of folks who repair cars:  \n\nA shrug of mechanics",
            "[removed]",
            "[removed]",
            "How many of these are etymologically derived from traditions? Because I consider it highly unlikely that a baron from the 14th century came up with an “embarrassment of pandas” or a “coalition of cheetahs”. It sounds more like an “ignominy of hippies” tried to think of the lamest terms possible.",
            "[removed]",
            "For the most part, it was high society goofing off and naming them to one-up each other.",
            "[removed]",
            "I guess it's just traditional. My favourite one though is from Qi when they decided the collective noun for Morris dancers should be an arse of Morris dancers.",
            "[removed]",
            "Why have the Wildebeasts not got a better name thn a 'herd'? They deserve it for their epic migrations and battling the crocodiles",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]"
        ]
    },
    {
        "post_id": "f4uamc",
        "author": "Goodkall",
        "title": "How do all these mobile games get away with false advertising? I've never seen a game ad that correctly portrayed the actual gameplay.",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/f4uamc/how_do_all_these_mobile_games_get_away_with_false/",
        "score": 13908,
        "num_comments": 431,
        "created_utc": 1581875973.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/f4uamc/how_do_all_these_mobile_games_get_away_with_false/",
        "comments": [
            "[deleted]",
            "Yeah, I have downloaded several games that seemed interesting but turned out to be a bejeweled clone.",
            "When a game is developed in Shenzhen, produced in Amsterdam, and financed by a holding company in the Cayman Islands whose legal owner for tax purposes is a jack russell terrier, it becomes pretty hard to enforce false advertising laws in a proactive way.\n\nAll we can realistically do is deal with legal issues and complaints as they come up.",
            "I worked at one of the largest studios that does this.\n\nThe simple answer is that the marketing department doesn't give a fuck. They think as long as they get clicks/eyes/installs they've done their job.\n\nIt drove all us product/game/dev people crazy.\n\nAt that point the company is so big and you don't have any product/game/dev people in leadership and the company is being run by lawyers marketing and finance people who don't give a shit about or understand games in any way.",
            "Most of the ones I see are the solve a puzzle using one of 3 options type and all of them say does not represent real gameplay. \n\nTbh it’s just letting me put my skills learnt from YouTube’s 5 second skip timer to use",
            "It's probably too hard to keep tabs on the pure amount of garbage advertisements. I bet they're made by ai (that would explain why they don't seem like they could've possibly been made by a human with their broken English and nonsensical clusterfuck imagery) and they can just pump as many out as they want.",
            "A poor review will go along way",
            "[deleted]",
            "One time I saw a castle builder game show screenshots of \"gameplay\" from AoE2",
            "I work for a mobile game studio and it's simply because actual gameplay ads don't really get clicks. Ridiculous ones do unfortunately",
            "Alot of the time games outsource heir advertisement to firms dedicated to mobile advertising. Said firms then take what little assets they have from the game, and don't bother doing any research on what the game is actually about.",
            "[deleted]",
            "I've seen a game ad floating around for designing your house and landscaping etc. It's literally a video of someone building on the Sims 4. Like...what?",
            "You see ads for mobile games on Facebook all the time. The ad shows gameplay from a console or PC game that has nothing to do with the game the ad is for. I have no idea how they get away with it. There was an ad for a zombie mobile game that they used gameplay from Call of Duty Zombies. It's totally false advertising.",
            "That really pisses me off.  I think I'm going to delete games I have that do this.  I mean, wtf?",
            "King of Avalon looks nothing like it's ads .. And another \"Free\" game that costs a fortune to compete in.. 3 years playing but new people can pass me just pour in the $$",
            "This is a good question. I hate mobile ads \"OmG i MaDe It To LeVeL 1\"",
            "It's purely harvesting your info. I've came across games like that a couple times. Read some ratings before downloading.",
            "Yeah I find it baffling how there's never legal action.\n\nI've seen so many ads where there's this cool new game and it's quite literally just Skyrim with some character models modded in.\n\nLike I can see those are Skyrim assets, who tf are you fooling?",
            "Home/garden/fish/rakescapes are the worst for this. They advertise a game which looks pretty interesting, then you download it and it's a completely different, but actually pretty good match 3 game. This is the one that annoys me most because at the heart of it, they've done one of the best freemium match 3s.if they advertised the game on its actual pluses they'd do well. I'd say lots have downloaded it based on the ads and said wtf. It adds a pointless narrative to candy crush but never forces you to spend real money to progress.\n\nMy other half isn't a console/pc gamer anymore and loves it so we play together. I grew up on bejeweled so it scratches an itch for me.\nBut then I see the ads and I feel dirty.",
            "The podcast ‘Reply All’ answered this in their most recent episode.",
            "mobile legends goes as far as to show inaccurate gameplay in the intro after you've already downloaded the game. same with arena of valor... actually much worst for aov. They're fun tho. and even if the ads and videos are inaccurate, the genre and description are.   \nKinda like cinematics in spiderman games, that show stuff in the scenes that you can't do in normal gameplay.",
            "I dont even understand why they do this. The games they portray where you have to like pull levers in the right order and stuff seem like actually fun games, but knowing it isnt real gameplay, it makes me absolutely not want to download their actual game. I just dont understand how this is good for business. Its literally driving me away.",
            "INSTAGRAM ADS. ALL OF THEM.",
            "Nothing new. Check out the various game ads that ran back in the late 1970s and 1980s, such as for the Atari 2600. For that era, the graphics shown in the ad often had little to no relation to the game at all.\n\nIt's comical looking back at those old ads. What's even more crazy is the prices of games, when adjusted for inflation, often exceeded $100. Not justifying false or misleading advertising, but rather it's nothing new. In my view, was far worse back in the early days.\n\nAs the old adage goes, buyer beware. The internet greatly helps avoid surprises. Many review sites, videos, etc out there. Plus, many on-line gaming platforms have decent refund policies.",
            "r/replyallpodcast\n\nEdit: for correct subreddit name",
            "I just assumed false advertising isnt a real thing people get in trouble for\n\n\nI mean, maybe it is, but if you look at any sale sign, you can catch the way its worded to sound better than it is, which is dishonest. I giess i dont know where the line is between false advertising and \"you shoulda known\".",
            "I was just thinking this a little bit ago. So many games that look fun in the ads and then suck ass when you actually play them",
            "I saw a game use God of War 2018 footage. I'm still confused how they got away with that YouTube ad.",
            "My two favorite genres of mobile game ads are \"You can have a harem and raise an army of children! It's not sexist; we have a version where you can be a woman too! (But actually this is a waiting game involving sending a tiny army to war and then watching them die because there's no actual gameplay aspect to that portion, even though it's the primary method of progression)\" and \"You're a teenage girl who has just lost your virginity. You are now a vampire and also pregnant. (To be fair this one is only slightly exaggerated, and only in the case of a few versions of this game genre.)\"",
            "it's a shame because usually what's being advertised actually looks fun to play and would in turn actually make them profit",
            "There are some GREAT games out there for mobile that don’t do excessive advertising. Vainglory, as an example, does no advertising yet has been the best mobile game I’ve ever played. It’s a shame that the player base is dwindling because of that though...",
            "Because they prey on children for most of their revenue.",
            "I once saw a mobile ad on YouTube, they simply took an Age of Empire 2 Screenshot",
            "I too heard the reply all episode.",
            "Plenty of non-mobile games do that as well.",
            "Money laundering",
            "I wonder the same thing with food. When you buy a fast food and the menu shows a delicious burger and you end up getting a sad burger that looks like it lived in a gulag for 10 years. Or drinks that say “1g sugar!” And on the back “1g sugar, 35g sucralose, cornstarch”",
            "Mobile games are shit from the get-go, i don't think anyone expects anything from them.",
            "I hate the same ads with that knight and orc, you are probably talking about the same one, aren't you?\n\nHowever, most ads are misleading in a way. Does you deodorant really make girls like you? And does that product contain really 40% less salt? 40% less from what?\n\nFirst World problems, be happy to have them.",
            "Loop holes brah",
            "tv adds did that all the time. I don't know if they still do, since i haven't watched tv in almost a decade",
            "Are there any games out there that look like and play like those on the fake ads? Please recommend some.",
            "I asked the same question when it came to clash of clans! The ad looked cool, and in the end, it looked totally different! I expected it to be a multiplayer game like wizard101 type and all. Then again, it was pretty fun as well.",
            "Have you seen the ad for ET?",
            "This post brought to you by ***RAID SHADOW LEGENDS***\n\n*\\*Fakes playing game on phone\\**",
            "Can we all just band together and burn down the VooDoo HQ or something? Every one of there games are advertised like this, then not only underperform, but are generally loaded with ads, are focused around spending money or watching ads for rewards,  and extremely low-effort copies of already existing games. That, or they're not even games, but just oddly satisfying simulators.",
            "I saw an ad about a week back for some random Mobile game but it was just God of War 2018 gameplay. I don't know how that even made it to being an ad.",
            "*cries in marvel strike force",
            "[deleted]",
            "This video by Jarvis Johnson goes into advertisements and how fucked up they actually are. He’s also very funny.\n\n\nhttps://youtu.be/UILRhsEim3U",
            "They’re making playable ads now so you can taste the gameplay before downloading it.",
            "It would be nice if the big 3 (Amazon,  Google and Apple) actually vetted the apps they put in their stores and pulled apps that aren't what they say they are. \n\n\nA Better Business Bureau for apps...",
            "i saw an ad for Crowd City and was interested, but it was listed under a different name. i went to look for it and it was a completely different game. but thankfully, the game i was actually looking for was in the recommendations. Crowd City is actually really fun and addictive btw i recommend it.",
            "I play a game where the ads all showed versions of something that's 1% of what you do, at most, and honestly seems a bit contrived. I guess that's enough? But the actual game is fun! An ad showing the real game would probably work just fine.",
            "People in general aren't as bright as they want to believe. That's how. That's how vast majority of politicians get elected too, BTW",
            "What can I say... that’s how mafia works.",
            "Has anyone officially complained? It's probably just as simple as that.",
            "Homescaoes is the worst at this shit",
            "Same way are military says\" were the few the proud!\".",
            "This post showed up right after an inaccurate mobile game ad on my feed",
            "If cinematic trailers were considered false advertising then all games would be guilty (exaggeration but you get the idea). There’s a plethora of high profile, AAA games (some even considered classics) that have cinematic trailers. Because that’s what these mobile game trailers are, “cinematics.” The Witcher 3 had a cinematic reveal trailer, for instance.",
            "It's interesting reading the responses and seeing that this is normal in some places. To answer from a UK perspective, when games are advertised on TV it says 'not actual gameplay' at the bottom of the screen, and things like 'steps removed, sequences shortened' for some things.",
            "I’ve seen a few ads which start with a clip of a hydraulic press about to crush something, then before impact cuts to their shitty game",
            "It's always been like this..\nTry googling old C64 game cassettes or maybe cinematic intro to old pc games like Warcraft2 or Command And Conquer",
            "Like rAiD ShAdOW LeDGeNDs",
            "There are no laws that cover this yet and even if there were the Chinese companies would ignore them.",
            "Really? Never?",
            "That's why I downloaded archero. The ad looked awesome. Gameplay was completely different. Still like it, but totally different than the ad.",
            "the story of the mcdonalds burger lol",
            "tbh it must be kinda sad as a game maker to acknowledge that ur actual game it shit, so u have to make fake gameplay ads to get ppl downloading it.",
            "I have a different question, why don't those game development teams don't create the good looking games in the ad, but instead create a shit game",
            "Most of the time they flash up tiny little writing somewhere that says \"Not actual gameplay\".",
            "I like the ads where they control movement with the digital thumbstick, when I see that I instantly dislike the game because I hate phone games like that.\n\nBut one time I decided to try one anyways, no fucking thumbstick to be seen ingame. I was like 'that's fucking stupid, why would you showcase that and not actually have it ingame'.",
            "\"RAID SHADOW LEGENDS IS THEEEE MOOOST AAAAAMMMMMBITIOUS RPG PROJECT OF 2019!!!!\" LOOOOOL",
            "The mobile platform is decades behind all of the other platforms. Do not support it and warn your kids, give them **ANY OTHER PLATFORM** to play on.",
            "Oh that reminds me, I drunkenly downloaded some shitty game the other night. I should see if it's worth having.",
            "They took a page out of Ubisoft, and put it to the extreme.",
            "You ever seen blizzard trailers?",
            "My question is why doesn’t one gaming company take the best features of each game and fake ad and really make the best mobile gaming game out there ?",
            "Because laws don’t “exist”. Laws only matter insofar as someone with the power to enforce them and the time and will to do so.",
            "How?",
            "China",
            "There is still a lack of ad controlling on the internet. So it's something which will come with time.",
            "Or how about Candy Crush? Rip off of an existing game and then suing it out of business.",
            "A lot of ads I’ve seen are actual other (pc) single player game play-throughs. ‘They’ take a game that looks versatile and decent but ‘show-case’ some 2-bit crap.",
            "Theey are just showing you what it would be if they were capable of making it how they envisioned. Like a five year old saying they drew a picture of their family but it's just a few lines and misshapen things on the paper, colored in with lacking colors. The description doesn't match the product. Not really but it was funny to me. They get away with it and that's why they do it.",
            "Puffery is perfectly legal although I think it needs to go away as a type of fraud.",
            ">I've never seen a game ad that correctly portrayed the actual gameplay.\n\nI feel so sorry for you",
            "I don't know but I love it.. Some of them are hilarious and one of the only things that brightens my day.",
            "Reply all has a recent episode on this. Turns out people still play the game even if they have been deceived by the advertising.",
            "That's how mafia works.",
            "Honestly this should stop and the fact thst they are everywhere is also annoying \nI have to say that episode is one of those games where the advertisements are different from the game",
            "I saw an ad for war and order or some dumb game and the ad was literally just Stronghold 2 gameplay",
            "It's all in the wording of the discription. Anyone can tell the truth but lie at the same time",
            "Because the game industry is rotten to the core.",
            "The same way Dior gets away with making you think their perfume will make you feel like Charlize Theron.",
            "They somehow get away with advertising gambling apps targeted at teenagers. That’s what really makes me sick. These ads don’t even say “win”, they say “earn extra money”.",
            "Because of reasons people have stated. But also  (in Europe at least) because these games are free thus the consumer was not lead a stray monetarily. \n\nIn Europe and Australia for what Ive heard, have very pro consumer laws. If the game costs something and was leading people to think its something else then no matter what some little texts say (not actual gameplay or what ever) its false advertisement or intentional misleading advertisement.\n\nNow the thing is, enough people need to get sue or make a class action  law suite (or what ever that thing is) for the company to even care. Its easier to just refund some players that actually stand up for them selves. Amd this is ofc in the case when the game costs money up front. If the game is free then the users dont really have a say on the matter as they havet paid for any product or service that the company provides \"out of their own generosity\".",
            "Yesssss u understAnd I fEel blEsseD :]",
            "False advertising isn’t illegal, who ever said it was? Almost every ad online is misleading (I worked in marketing as a copywriter, it’s all b.s.)",
            "Those games are free, right? Maybe you should ask for your money back.",
            "I was so disappointed when the first dragon age game came out. The trailers and everything were amazing it looks so bad ass. But then the actual game was such ass.",
            "How do Asian food retailers get away with serving food that looks nothing like the pictures?",
            "Children.",
            "It's simple: idiots.",
            "Because people keep throwing their money away on stupid shit. We whine about being paid so little but pre-order/play shit that we know isn't a guaranteed satisfaction whether it's based off of the company's history of practice or the upfront steep price for the amount of time you're spending with it.",
            "Mobile games aren’t the only ones who do this. How many console games will you see a huge cinematic crisp hd lifelike trailer then you get the game and there’s no cutscenes and it’s 3d zoomed x.30%? Diablo I’m lookin at you.",
            "[deleted]",
            "don't game on the mobile. there is **NOT ANY SINGLE REAL GAME ON MOBILE PERIOD.**",
            "Check out my game, Enigmata Stellar War!"
        ]
    },
    {
        "post_id": "euk1gu",
        "author": "Dark_Potato_Wolf",
        "title": "Why can't I sensor political content from my Reddit as I do with NSFW content?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/euk1gu/why_cant_i_sensor_political_content_from_my/",
        "score": 13896,
        "num_comments": 726,
        "created_utc": 1580106172.0,
        "selftext": "I come to this website to relax and laugh.  I am not a political person and don't like seeing political content.  Could Reddit prevent this with a toggle switch in settings?  Would Reddit ever add something like that?\n\nI'd be happy to never again see politics on my reddit.",
        "permalink": "/r/NoStupidQuestions/comments/euk1gu/why_cant_i_sensor_political_content_from_my/",
        "comments": [
            "With NSFW posts, they are all clearly marked as being NSFW, so it's really easy to filter that stuff out. No one really tags all political posts, but if you want there are ways to filter out subreddits from your feed as well as keywords that may get most of the political stuff out:\n\nThere are a few different ways to filter out content you see on reddit:\n\n#**Option 1**: Filtering from /r/all (Works on mobile and desktop) \n-\nReddit allows you to filter out posts from specific subreddits in /r/all, however it's not easy to find. Subreddits can be added to your filter by going to the *desktop* website https://old.reddit.com/r/all/ and the filter will be near the top of the right sidebar. \n\nNote that you can only make changes to the filter from the old.reddit.com domain, however the actual filter is tied to your account, and will also filter out posts on the mobile app or on the redesigned desktop site. Also note that this filter **only applies to /r/all**, it will not work for /r/popular. There is no natively supported filter for /r/popular. \n\n#**Option 2**: Filtering from the desktop site\n-\nIf you want to filter more than just /r/all from the desktop site, you can using the browser extention [Reddit Enhancement Suite](https://redditenhancementsuite.com \"also /r/Enhancement\"). RES allows you to set site-wide filters based on subreddits, users, domains, flairs, and basically anything else. Filters set through RES will not carry over into the mobile app. If you do browse reddit on desktop, I would highly recommend RES even if you don't need to filter things, as it comes with a plethora of other great features as well. \n\n#**Option 3**: Filtering on mobile using a 3rd party app\n-\nWhile reddit's official mobile app does not support filtering, many of the 3rd party apps available on your respective app store do. There are actually a lot of great features that 3rd party apps have that the official one doesn't, so I would definitely recommend checking them out. There are a lot of great 3rd party apps out there, and everyone has different tastes, so I would recommend trying out a few of the high rated apps, and see which one you like the most before sticking with it. Here are some 3rd party apps that I know of that support filtering, although I'm sure many others do as well: \n\n* ~~Reddit is Fun~~ rif is fun for Reddit\n* Relay for Reddit\n* Now for Reddit\n* Sync for Reddit",
            "Sensor =/= censor",
            "Because life isn't this simple: ask 1000 people what's political and get 1000 kinda different answers.",
            "I think the “Apollo for Reddit” app has a keyword blocker on it in the settings. So you basically would type in “Donald Trump” or “Bernie Sanders” and it blocks all posts that have those words in it. You’d need to add a ton of keywords but it works.",
            "Reddit tried to prevent it already. The reason for subreddits was that all the technical (programming etc.) content was driving away new users and when other users came, all the political content got very annoying. \n\n/r/programming was founded February 2006, /r/politics in August 2007.",
            "Dont want NSFW OR political?  Why be on reddit? (Jk)",
            "What subreddits are you subscribed to?\n\nThere are tons that are not political. You just have to be more choosy. \n\nPut what you like in your feed and you'll never have to see any political stuff.",
            "Now if only you could separate NSFW porn from NSFW everything else...",
            "Don’t go to r/all. You should be able to already do this based on the subs you subscribe to",
            "Because *everything* is political.\n\nThat video of the cop playing basketball with the poor kid?\nIt reinforces the idea that cops are good and necessary and beneficial to a community.  \nPolitical.\n\nThat picture of a cute dog?\nIt normalises the idea of having pets, literally owning an animal.  \nPolitical.\n\n\n\nRegardless of your opinion on these things, you *have* an opinion, shaped by your own experiences and the media you consume.\n\n\nGenerally, things we think of as \"political\" are things that agree with the status quo.\nLike cute doggos. It's normal for cute dogs to be pets, so we don't think of it as political.\n\n\nThis is true for many things.\n\nWould you consider wedding photos political?\n\nWhat about gay wedding photos?\n\nMany people would say the first is not political, while the second is.\n\n\nBecause the first is the status quo, while the second is not.\n\n\n\nReinforcing the status quo *is* political.",
            "[removed]",
            "I would like to never see imsorryjon or close ups of spiders posts again but they pop up from time to time on popular",
            "In simple terms:\n\nNSFW is much easier to define.\n\nPolitical content on the other hand...well, anything can be political with the right perspective.\n\nIt’s simply impractical to create a way to truly filter out all political content so they just don’t do it.\n\nJust filter out subs that are too political for you.",
            "[removed]",
            "[removed]",
            "Use an app and filter key words like republican, Trump, Democrat, Senate, etc. Easy peasy.",
            "I have always wanted a feature on Reddit where I can sensor any posts with certain words like \"literally, \"obsessed\", \"Trump\", \"racist\", \"hunt\",  and \"animal cruelty\".",
            "[removed]",
            "I bet you don't care about politics *at all*",
            "Holy fuck no one noticed... ? ? ?\n\nDo we want to sensor it or censor it?",
            "What’s political content? You can stop posts from r/Politics and r/The_Donald from showing up, but you can’t eliminate random posts that get political becasue everything is political, even not caring about politics.",
            "In order for reddit to do what you’re asking all political content on every sub would have to be marked so the “sensor” knows what to filter. Which is basically impossible considering politics come up in every sub and what is or isn’t political is very subjective. Idk just unsub from super policial subs and filter your r/all?",
            "I guess a big trouble is that politics gets intertwined with basically everything in one way or another so posts that may not be overtly ‘political’ can end up turning that way in the comments.\n\nIt would be pretty frustrating to regularly come across politics in a post not tagged as such.",
            "I wish i could do this as well.\n\nI dont want to see a facebook mom on T\\_D posting a photo shopped image of bernie sanders getting raped by donald trump.\n\nI also dont want crappy \"OMG DONALD SUPPORTERS SUPPORT (insert crazy opinion like stomping on babys that no one believes) KILL DONALD!",
            "Reddit Enhancement Suite dude. Never see a Poem For Your Sprog, Pewdiepiesubmission or other unwanted stuff again.",
            "I get your sentiment but I think you should approach it with a different mindset. Nobody likes politics, nobody wants to hear everyone else’s bias, but being informed is your civic duty. \n\n“Not being into politics” shouldn’t be a thing; it affects you and everyone around you (unless you aren’t in the US, then never mind).",
            "[deleted]",
            "Because we’re already tired of political bullshit and we just want pictures of funny dogs and derpy kittens.\n\nEdit: just realizing I misunderstood this last night. So, comment is basically the opposite of OP’s question. That’s my bad, but it’s still true, so leaving it for now 🙃",
            "I wish I was privileged enough to “not be a political person”.",
            "Step one to understanding censorship is to first spell the word right.",
            "Good luck. Everything's political.",
            "It'd make all of the admins' astroturfing efforts go to waste, they don't want that.",
            "If we're making these sorts of changes, can I put in a request to screen out all US basketball, baseball etc? I really don't care if they're trending, they're of no interest whatsoever.",
            "Honestly, this, please.\n\nI scroll down the main page, and all I see is trump, american news and foreign elections. I'm not even subscribed to any news subreddits.\n\nWhat's worse, sometimes political stuff shows in r/pics or completely unrelated subs and it just ruins my mood. \n\nNot to mention 90% of the posts are about the US. What am I to do with that information? I'm in Europe...",
            "Just filter out the following\n\npolitics\nnews\nworldnews\npoliticalhumor\n\nDo that and you‘re mostly free.",
            "I wish there was an option if we voted 100 posts of a particular subreddit and downvoted at least 90% of them they'd be filtered from /r/all automatically.",
            "Heh.  Such a shame that the old ways of the Internet are forgotten.  I miss Usenet/nntp and kill/score files.",
            "Or at least block specific subreddits that ALWAYS show up when scrolling by All.\n\nI'm looking at you, r/politics.",
            "I wish we could block certain subreddits as well. There’s a medical one that pops up from time to time and it’s absolutely disgusting.",
            "Will you not be able to do that just by choosing your subscriptions and if you come across something political you just pass the post without reading it?",
            "Would this post be censored?",
            "You should be able to block subreddits, just as you can block users",
            "shit is annoying I agree. \n\nThe \"best of\" section is absolute garbage",
            "I just unsubbed from r/science because I love science but it was really just leftist political points that I didn't necessarily always disagree with but just got so tired of seeing. Fucking pricks.",
            "If you don't like politics don't look at political subs",
            "I'd also like to suppress sports and dogs. And memes.",
            "some people's entire existence is a matter of political debate. saying you're not political is an admission that you're lucky enough to be able to pretend those issues don't affect you. be glad you can ignore politics sometimes and you won't need to hide it.",
            "Because reddit posts don't have various tags for their topic. No, they probably won't. Just don't look at subs with political content.",
            "According to this thread you are priviliged if you don't want to see politics everyday. Holy shit what the fuck happened to you people? How do you even function in your daily life? Lmao.",
            "I honestly don't see much politics in my feed. You are possibly following the wrong subs. \n\nThere's always going to be political comments on posts which seem irrelevant to politics, but I skim past them if I'm not in the mood.",
            "Use filters ya dummy",
            "Ahh. Yes.  Living in an echo chamber is always a great idea. You do you. Truth is everyone is political by nature. Some lack self awareness and choose to ignore or avoid opinions, ideas, even debates that would pose a threat to their current mindset. Giving people access to sensor \"political\" information just for the sake of convenience is a terrible idea. No matter how little someone is interested in participating in society there will always be someone else with the power to manipulate society affecting everyone else. So you look dammit. No one *likes* politics. It is a necessary evil that keeps us in check while working together towards the common goal of progressing as a species.",
            "You can’t because everything is political. I believe it is your moral duty to participate somewhat and use your vote for good, and not be passive in the face on injustice.",
            "[removed]",
            "People need to tag NSFW content, because it could actually cost people’s jobs or cause other serious repercussions.\n\nYou seeing political content annoys you, but that’s about it.\nSo the chance of everybody tagging posts with “Political” just so that you don’t have to scroll past them is... quite slim to say the least.",
            "Just unsubscribe from political or news subreddits.",
            "Lol... what an american post.... no wonder we have the lowest voter turnout in the western world....",
            "being a non political person is not a virtue.",
            "[deleted]",
            "There would be nothing left",
            "yeah and some of us wish we could censor our feeds from silly grammatical errors",
            "I use desktop apps to filter out all Pokemon posts. But doesn't work on mobile. You could do the same thing",
            "I had the exact same problem. I stopped going to popular page and only view the page from my subscribed subreddits. 0 politics. So much happier now!",
            "Because 1984 is now.",
            "Am I missing something? Just don't subscribe to any political subreddits, and you won't see any political stuff. If you keep seeing political content on a sub you're subscribed to, just unsubscribe from it. \n\n I'm not trying to be rude or anything but im really failing to see the problem here. Reddit only shows you content from subreddits you've CHOSEN to see.",
            "Add sport to that list today. Fucking hell.",
            "I'm so fed up with political posts honestly",
            "Amen men. I don’t wanna see Bernie Sanders ads every 5 god damn minutes. Should absolutely be an option",
            "While we're at it can we do this for cats too? I don't hate cats, it's just not what I come to Reddit for.",
            "Because they pay to put it everywhere",
            "It's a good point tbh since this site is just an American propaganda machine",
            "[deleted]",
            "Please don't vote then.",
            "people are dying, man. at least try. blissful ignorance is an unhealthy and selfish way to live your life.",
            "How can people say \"hey I'm not a political person\". \n\nDo you live under a rock? How dumb can people be?",
            "Your existence and the fact that you have access to Reddit is policital. Get over it maybe. Can you really not handle a news headline?",
            "Being able to ignore the politics that affects all of our lives is a privilege that none of us deserve.",
            "You can do this fairly easily by setting up a custom feed. \n\nIt’s a tab next to your Communities tab.",
            "Politics is subjective. Theres a clear line between what is NSFW and what is safe. But is being allowed to wear slippers in school political? It involves a government subsidiary restriction freedom of expression?",
            "You’ve gotta cut out whole subs. It’s not easy but I’ve pretty much done it, not 100% but at least 90% gone. \n\nI’ve got a politics multi just in case I’m feeling too good about my day or something.",
            "NSFW posts are self tagged or reported as NSFW after they are posted. Nobody cares that much about political content",
            "I use RES and Rif to block subs I don't like. Improved my reddit experience",
            "get the reddit enhancement suite and you should be able to make keyword filters and/or filters for whole subreddits.",
            ".",
            "Mods never added that",
            "How do you filter out all NSFW posts?",
            "It's much easier to discern what SFW is compared to what's Political.",
            "Commenting so I remember to come back and read the instructions on how to do this.",
            "Every single post on the internet is essentially \"political\" if you look at it from a certain angle.",
            "I'm the same way, I don't subscribe to any subs with news or politics. It's too depressing",
            "I don't think you can *sensor* anything",
            "Even when i uncheck politics in the news tab, half the shit is politics...",
            "Maybe if you tried to censor it ?",
            "Here’s a Reddit feed from eight years ago. \n\n[Maybe this will help](https://www.reddit.com/r/help/comments/nj99s/is_there_anyway_i_can_block_a_subreddit_completely/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "Just follow the right subs and don’t go on news. I never see politics on reddit.",
            "what's political for one community is normalcy for others",
            "You can stop reading it",
            "i want to do the same thing with sports\n\nI use RES on my PC and spend a lot of my time filtering subs i don't want",
            "Amen",
            "I'm assuming you have already done the obvious thing and unsubscribed from all political subreddits before posting here. Can you show me an example of a political post from a non-political sub you're subscribed to?",
            "sensor",
            "I want to be able to filter out some subs for the main page, getting a bit sick and tired seeing those medical stuff that is clearly nsfw but isn't marked that.",
            "I use Now For Reddit app and have unsubscribed/filtered out every political and news sub I see.",
            "They to make it so politics isn't allowed at all unless a post is marked political or a subreddit is dedicated to the subject. I'm tried of saying I have better things to do than worry about politics and then get called a fascist for it 🙄",
            "He just wants to grill, for gods sake.",
            "This is why I don't go on Twitter any more. Even though I don't follow any political people the people I follow do and I keep seeing they liked something.",
            "I'd have to be ALL political content if you censored ANY",
            "[removed]",
            "I’ve got no problem with your desire to come to reddit just to relax, and wanting a way to turn off certain content, but “Not a political person” generally implies that you’re fortunate enough to not have to care.  There are many who don’t have the privilege to not be political. Appreciate that fact if you’d prefer to be apathetic, but be careful about isolating yourself from knowledge that politics have a life/death impact on many people who can’t afford to tune it all out. \n\nWhich is not to say we’re not all entitled to a reprieve when we want it. But to say you’re not a political person sounds like you’re looking for a permanent reprieve and that’s a slap in the face to everyone who is suffering because of decisions made in the political arena, even if you’re one of them yourself.",
            "[removed]",
            "Here’s a idea: don’t be in any political subreddits",
            "I don’t have an answer for you, but I just wanted to say I feel this times 100. I like how on YouTube, I can do “-aword” and it filters out all of the videos that have anything to do with that word. I wish Reddit had a similar feature where you could go to your settings, type in some keywords, and it filters out all the posts with that word in it. That would be amazing.",
            "I haven’t read every comment. But my suggestion would be to unsubscribe from any political subreddits. From there stay off popular. I enjoy Reddit so much more since I have culled my list of things I don’t want to see.",
            "Because life is politics. Everything around you is the result of politics.",
            "Please define political.\n\nIs a picture of a gay wedding for you political?",
            "The vast majority of political posts that make it into your hot feed come from a small number of users. Block those users and it will decline dramatically.",
            "This would be great.",
            "[removed]",
            "[deleted]",
            "Because it's a lot easier to say what is and isn't NSFW than it is to say what is and isn't political. \n\nLike yes, politicians and people discussing political policy is politics.\n\nIs it political to talk about politicians in any sense? If I talk about Mitch McConnell having a barbecue, potentially with other politicians, is that politics?\n\nPlus then there's things that some people consider politics that are just controversial issues. Gun control, letting people have/keep basic human rights, should companies be able to turn people away solely for thier own personal biases, what constitutes hate speech, etc.\n\nAnd on another note, it's just hard to never ever discuss something that effects people's daily lives. It's a step down from trying not to mention the weather.\n\ntl;dr: there's no clear consensus on where the line to draw for \"This is politics\" lies, and it's super hard to just not discuss it period since it effects so much of our lives.\n\nedit: also the people saying \"everything is political\" are mostly right. I don't think it's *literally* correct but a lot of things you could probably choose as \"apolitical\" actually have the politics of the people who created it built in. Even things for young children, since \"Treat people kindly\" becomes political if you ever have to decide how \"nice\" you need to treat people, and for some extremists even the definition of \"people\" comes up for question, sadly.",
            "Admins want to push their politics on you. If you can stop political stuff, how are they going push Bernie spam and climate alarmism down your throat? \n\nI wish there was a feature though.",
            "As a British geezer:\n\nDAE TRUMP BAD BERNIE GOOD\n\nNO",
            "Let's stick our heads in the sand and not get informed, yea!",
            "Because literally everything is political. If it's not political to you, it's your politics.",
            "\"I'm not a political person\" you mean you're in the vast majority so it doesn't affect you negatively, so you don't care. Yeah okay.",
            "This is one of the best posts ever.  How do we get rid of this constant barrage?  Count me IN.",
            "[deleted]",
            "Yeah, I honestly don't get why Americans can't leave their politics at their front door. NO ONE cares about your internal political drivel. Just tell us the eventual outcome (or not). \n\nDo they not understand the rest of the World openly laughs at US politics? I seriously wonder."
        ]
    },
    {
        "post_id": "k0sjtx",
        "author": "qualityiscorrupt",
        "title": "Do phone screens rotate in space?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/k0sjtx/do_phone_screens_rotate_in_space/",
        "score": 13885,
        "num_comments": 317,
        "created_utc": 1606312423.0,
        "selftext": "Like if you put your phone in landscape mode in space, it wouldn't recognize that, right? Or does it keep rotating continously?\n\nAnd like what's the science behind rotation recognition in phones?",
        "permalink": "/r/NoStupidQuestions/comments/k0sjtx/do_phone_screens_rotate_in_space/",
        "comments": [
            "Please follow rule 1.  All top level replies (i.e. replies to OP) must be answers to the question.",
            "They would not work in the same way they work on earth, and you would find it difficult to force it to change orientation.\n\n[Article on how they work electronically](https://www.livescience.com/40102-accelerometers.html#:~:text=An%20accelerometer%20is%20an%20electromechanical,or%20speed%20divided%20by%20time.)\n\n[Video on how they work and are made](https://www.youtube.com/watch?v=KZVgKu6v808). The first half is probably what you're interested in.\n\nFrom the article:\n\n>dynamic accelerometer measures gravitational pull to determine the angle at which a device is tilted with respect to the Earth. By sensing the amount of acceleration, users analyze how the device is moving.\n\nThe basic accelerometer only measures along a single axis (forwards and backwards), but two or three of these can be combined for 2D and 3D sensing. Phones use 3D accelerometers because it's a marginal cost difference from 1D and 2D but allows for many more features and app compatibilities.\n\nOn Earth, whichever axis is oriented vertically will read the force of gravity as +/- 1 G (as seen in video animation). That direction must be \"down\".\n\nIn orbit where a person or object would experience zero G, all three axes would read 0, and the device would not know which direction is \"down\", and would not rotate itself based on its orientation.\n\nYou could possibly \"fake\" it by imparting an acceleration on the phone (by moving it or spinning yourself around), but I have suspicions that this would not be effective enough to make the device switch orientations. Accelerometers are very sensitive, so it would detect a change, but it may not be enough to convince the phone to change. \n\nFrom a design perspective, a device shouldn't \"overreact\" to minor acceleration changes like movements because it would be frustrating for users. Which is probably why when I spent a few minutes spinning around with my phone in different orientations it refused to rotate the screen. I couldn't impart a regular 1G of acceleration in any direction, so my phone wouldn't rotate the screen.\n\nIf we want to understand the code a bit better, we can turn the phone to landscape, and then set it flat on a table. Notice that it does not revert to portrait when flat. This tells me that it \"latches\" in place. It'll only change again if it's tilted back in the upwards direction. That means if you were to go up to space in portrait mode, there'd be no way to force it into landscape by tilting, and if you went up in landscape, it would similarly have trouble switching back to portrait (unless you force it there portrait-lock option). This is sort of a pain in the ass for frequent space-flyers.\n\nConsidering that 99.9999997% of smartphone users are currently not in space (a google search told me that there are 2.71B smartphone users, another told me there are 7 people in space right now, so I did the math), and there's probably no 5G reception up there either, it makes sense that smartphone manufacturers would design for users in a 1G environment rather than 0G.\n\nSome hard drives (particularly in laptops) use an accelerometer for free-fall detection. It detects that momentary apparent weightlessness of a free-fall, and stops the drive from performing read/write actions. The disk is spinning at extreme speeds with the head extremely close to the disk. [This forum post](https://superuser.com/questions/474609/are-there-any-disadvantages-of-having-a-free-fall-sensor-on-a-hard-disk-drive) describes it as a jumbo jet flying a few feet off the ground. A hard impact during a read/write can destroy the drive.\n\nThe same forum post also claims that free-fall detectors in a hard drive have ruined an experiment in zero G before due to disabling itself (not necessarily on a space station, but perhaps in a parabolic flight experiment). This would be further indication that accelerometers don't function well in zero G environments. I bet that NASA, ESA, etc. if bringing a hard drive to space use the ones without free-fall detection.",
            "Wait... do you ever feel like youre upside down in space?",
            "This is one of those things I’ve never thought of and the answers are very interesting. Was this something that just popped into your head? I’m more interested in that rather the actual answers people have given to your question lol.",
            "[This thread answers how it works for the iPads they have on the ISS  at least.](https://space.stackexchange.com/questions/21493/how-do-ipads-on-the-iss-know-which-way-is-up-for-their-users)\n\n>The onboard iPads are configured with the mute switch acting as the rotation lock. Should a crew member want to change the screen orientation, they toggle the mute switch and then jerk the iPad to impart a force that will change the orientation. They then reactivate the rotation lock.\n\nSo they remain in place, but small motion does register, potentially rotates continuously.",
            "In addition to the other replies, there's a whole TBBT trope about space gyroscopes and how they come up with a new design. Earth gyroscopes are designed to work with gravity, so in space, other designs are required.",
            "They work by detecting the direction of gravity.\n\nIncidentally, gravity and acceleration are the same, so in space you could fool the phone into thinking gravity is \"that way\" by yanking it fairly hard the other way.\n\nYou would probably want to lock the rotation when in space.\n\nBTW am I the only one who thinks phones should have a physical \"rotate screen\" button and the accelerometer-based approach is clumsy and unwieldy?",
            "[removed]",
            "Would a phone even work in space? 🤔",
            "[removed]",
            "[Here](https://www.quora.com/How-does-an-iPad-pick-its-orientation-on-ISS-in-microgravity-Does-it-still-turn-in-regards-to-its-orientation-when-it%E2%80%99s-unlocked-If-yes-then-how-Or-do-astronauts-just-keep-it-locked-in-one-mode-so-it-doesn%E2%80%99t-go-berserk/answer/Robert-Frost-1) is a Quora answer by NASA engineer Robert Frost. \n\nTo save you a click, they have it set up so the \"mute switch\" on their iPads toggles screen rotation on and off. If they want to change the rotation, the astronaut hits the toggle, gives the device a \"jerk\", and then hits the toggle again.\n\nGravity is just an acceleration! Most devices don't know the difference :)",
            "Just make an app that rotates the screen according to the front camera orientation to the user's face or head.\n\n\nProblem solved.",
            "Gravity!   In zero G you would have to apply lateral acceleration to get it to rotate to landscape.",
            "I'm not gonna be able to answer better than the top comment, but I will add that somewhere (can't remember where sorry) I saw that astronauts that want to flip the orientation of the phone just kinda shake it in that direction.",
            "This is the kind of important knowledge we need!",
            "Such devices usually use Micromachined-Electro-Mechanical-System (MEMS) gyroscopes, also known as vibrating structure gyroscopes. The gyro consists of small masses held by tiny oscillating silicon springs, each mass-spring system representing a plane. If the plane rotates (the device is rotated via yaw, pitch, or roll) a Coriolis force puts a stress on the system, changing the capacitance of a sensor. That change is measured and is deemed proportional to the rate of rotation.\n\nAll of that, in principle, works just fine in microgravity, but because the sensors are not space hardened, reliability can become an issue.\n\nHowever, since the orientation chosen by the inhabitants of the spacecraft varies, there isn't a consistent up/down direction as there is on Earth. That makes the orientation changes of the display annoying, so the mute switch is used to inhibit auto screen rotation.\n\nIf the crew want to change the orientation of the screen, they flip the mute switch, jerk the iPad to force the screen to rotate, and then activate the mute switch, again.",
            "Even though there's no \"gravity\" in space, there are still stimuli that could effect the electronics. Inertia, for example, is still a force in space. So is a sudden stop. These may still register, though very weakly. Also, the sun has it's own force on all objects, as does the moon. Remember, all of our ventures into space, have NOT been static (except on the surface of the moon). All missions need to be moving to maintain enough centrifugal force to keep them from being pulled back to earth, or other heavenly bodies.",
            "No",
            "Maybe. Often my phone seems to react more about my head position rather than how much i incline it as sometimes in bed it doesn't change positions unles i do some effort to raise my body and head a little, but it does have some sensors too to notice their position, but those would not work in space.",
            "Your phone uses a gyroscope which utilizes gravity so no it wouldn't really work that well in space",
            "No because Gyroscopes work due to gravitational forces and since there is no up/down in space it can’t sense direction properly.",
            "According to Robert Frost, Flight Controller at NASA:\n\nThe onboard iPads are configured with the mute switch acting as the rotation lock. Should a crew member want to change the screen orientation, they toggle the mute switch and then jerk the iPad to impart a force that will change the orientation. They then reactivate the rotation lock.",
            "Answering from the software point of view, if the sensors are not able to detect any change in orientation, there will be no automatic orientation changes. Your phone would stay in the orientation it was in unless you did a manual orientation change or an apps forces orientation. You can experience this effect at least in android by turning off auto-rotate. You will see that some apps force an orientation or prefer an orientation at startup.",
            "What an awesome question. And I’m guessing they probably don’t. Or not very reliably anyways.",
            "Huh. You piqued some curiosity I didn't even know I had.",
            "edit: ignore this post\n\nSomething people like to forget:  orbit, or any point in space far enough from a planet/star/other massive body is considered \"microgravity\", not zero-G.  If the sensor is accurate enough, the software in a phone could be modified to detect this acceleration.  The standard software in a phone will look for a steady 8-10 m/s^2 , so it wouldn't work in space, but the gravity of earth is still detectable in orbit, the vehicle just travels sideways fast enough that the gravity it \"feels\" keeps it in orbit rather than crashing it to the surface",
            "No",
            "Ring Laser Gyroscopes detect movement and inertia in a zero-G environment. They're used in space stuff all the time. You could theoretically build a very large, very expensive phone that would properly transition between portrait and landscape mode in any gravitational environment.",
            "You would not be also able to open selfie camera on the phones that have the motorized hidden selfie camera. (probably)\n\nThose phones have mechanism that when it detects phone is falling it quickly retract the camera to avoid damage. \n\nThe lack of acceleration, which is experienced by the phone in space in microgravity, is the same as when you drop your phone during the fall. So when you are in space, your phone would think it's constantly falling. And most likely never allow you to open selfie camera.\n\nBummer for the space face times with family.",
            "Most phones use accelerometers, which would totally work in space, but some phones use G sensors which wouldnt work.",
            "Short answer: no because it uses the accelerometer which senses all acceleration including gravity",
            "It Will spin as soon as you shake it",
            "[removed]",
            "No",
            "you could probably just lock your screen so that it’s always in one direction unless you make it be in a different one",
            "Nice try flat earther, no.  It's the earth that will rotate.",
            "There's a gyroscope in there",
            "auto-rotate is the first thing I disable on a new phone.",
            "Gyroscope go brrrrrrrrrr",
            "You realize you need gravity for a gyroscope to work properly. Right?",
            "Yeah no thanks I’m just gonna lock mine when I get up there",
            "the pressure from the vacuum of space would probably destroy it but if you somehow got it to not commit die then it most likely wouldnt rotate because its based off of your location on earth",
            "And would it be inverted if we somehow teleported to the other side of the earth?",
            "It would work just like here on earth because alll smartphones have gyroscopes",
            "You would rotate it and then lock it.",
            "They’d probably boil and freeze and generally not work in space",
            "[removed]",
            "I know it use to be mercury switches that used gravity and mercury to make connections in an electronic compartment in old phones, i don't know if this technology had changed or just streamlined ... but I'm guessing that no, they wouldn't work in space, due to thre lack of gravity.\n\nEdit: did a little homework, turns or that nowadays cell phones use accelerometers to determine orientation so i have absolutely no idea how that would function in a zero gravity environment or if that would even affect it at all.",
            "I think that they would just rotate whenever they feel like it. So they either don't spin or they are cosplaying beyblades.",
            "There are two things that modern phones do that are so annoying. Vertical video recording and automatic screen rotation. The only time I find vertical video recording useful is on xhamster. Automatic screen rotation is useless about 99.999% of the time.",
            "Your device rotation is set and 'artificial', gravity or no gravity makes matters no. You can even lock your device rotation, so...."
        ]
    },
    {
        "post_id": "ozqw6y",
        "author": "BlahBlahBlahXD8",
        "title": "Do people staying multiple days at the hospital masterbate?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ozqw6y/do_people_staying_multiple_days_at_the_hospital/",
        "score": 13875,
        "num_comments": 1860,
        "created_utc": 1628332181.0,
        "selftext": "Do people staying a few weeks in a hospital bed masterbate? If so, how much privacy are they entitled to?",
        "permalink": "/r/NoStupidQuestions/comments/ozqw6y/do_people_staying_multiple_days_at_the_hospital/",
        "comments": [
            "I was in the hospital for close to 3 weeks. I never really felt like masturbating. I normally do often but I think that because I was so sick I didn't. I also had a heart monitor on me 24/7 due to being in for heart failure so if my heart rate suddenly went up I would have had a nurse checking on me right away like the one time the wires on my heart monitor failed and I had a nurse running in my room thinking I had flat lined.",
            "A note from my mum who is a nurse;\n\nIf you're on a heart monitor, don't masturbate, you will find that you quickly have an audience when 5 nurses and drs burst into your room thinking you're in cardiac distress.\nApparently it happens more than you'd think, and it's always embarrassing for everyone haha",
            "Some do, for sure.  Depends how sick they are.  There aren’t too many people in ICU who feel like wanking.",
            "Recently spent five weeks in the hospital after emergency back surgery. The kind where you might not walk again. Took 2 weeks to get my first erection post surgery, was happy beyond belief. My wife assumed I was masturbating the whole time but there were to many people around. By the beginning of week five I was getting restless and rubbed one out at midnight after last bed check. Took less than 2 minutes and I felt like I was 12 again.",
            "My little brother died of cancer in 2017, and he spent months in hospital.\n\nI remember him telling me he tried to masturbate with his catheter in, and because of the medicine he was on, it “wasn’t working” \n\nAt one point his testicles (because of the medicine) had swollen to the size of a basketball. He pulled back his covers and he was like “fuckin’ check these out”. He laughed about it.\n\nEdit/ My Dad actually showed me a photo of my brothers nuts lol, then when I saw my brother again next time I asked to see. They’ve both passed away since then so, it’s a funny memory all of us laughing before things started getting serious\n\nEdit 2/ Thanks for all the messages guys, but I’m gonna stop responding now because the bad memories are starting to come up again and I’m getting sad.",
            "More often it’s the ones coming in for observational tests. People being admitted due to illness are often not feeling up to it. \n\nThe classical examples are teenagers/young adults coming in for 24hr ECG monitoring. They get going in the middle of the night; which either raises their heart rate significantly, or, if the movement interferes with the electrodes, gives their heart tracing the appearance of someone about to arrest. \n\nThis heart tracing is shown on the nurses monitor outside, so they rush in thinking they might have to start CPR etc, only to find… that. \n\nThe other cohort are usually old men (and sometimes women) who either don’t care, get off on it, or have some kind of brain injury leading to disinhibition. I’ve had them masturbate while I’m standing at the end of the bed. That’s a bit grim.",
            "Oh absolutely.\n\nAll staff are required to knock and announce themselves before entering and rooms are required to have privacy curtains but usually if you're in bad enough shape to be admitted, you're probably not going to be in the mood to masturbate but it does happen in the more ambulatory/rehab units.\n\nAlso nursing homes are absolute fuck shacks for old people and if they don't regularly hook up, they're wacking it constantly.",
            "Heavily pregnant and in preterm labor, I was admitted to the antepartum unit at the hospital for preterm labor. I was extremely horny (yay hormones!) but wasn’t allowed even an orgasm because it could efface my already wimpy cervix more. I fought the incredible urge to rub one out for almost a MONTH. Then during a nap I had a sex dream and woke up in the middle of the most mind bending O! Then the nurses rushed in with medicine to stop my contractions because the tocometer (measures uterine contractions) went crazy. I didn’t mean to orgasm, but I was totally embarrassed on the off-chance they knew what happened 🤦🏻‍♀️",
            "As a nurse that works in the hospital, I can confirm that patients who stay long term not only masturbate, but I had one female patient running a prostitution job out of her room! She wasn’t breaking the visitor rule but she told us to come back later for her meds while the guy was under her covers!",
            "I did, in the shower. Be sure not to lean on the assistance button.",
            "Yeah, In the bathroom",
            "Sooooo... I was at a mental hospital for roughly 6 months .\n\nThe answer is yes",
            "I'm usually too sick to want to. Having a lot of needles and tubes stuck in you is unpleasant and distracting. I once had a port in my *neck* and you better believe I wasn't going to do anything to cause me to move my head too much like a strong orgasm might. \n\nDoctors and nurses may knock or ask to come in, but some of them do the \"mom entry\" and knock on their way in. Or sometimes the door is a sliding glass panel, like the door to your patio, so it isn't amenable to knocking.\n\nIf you have an IV, there is a long needle embedded in your elbow area or in the back of your hand and sometimes it is your dominant hand. I'm not jiggling that around thanks.\n\nEdit: In an IV, they use a needle to place a thin plastic tube in your vein that the solution flows through, but if you think that you don't feel it, you would be incorrect.",
            "I've told this story before, but spent week in the hospital 6 years ago for a pulmonary embolism. They had me hooked up to heart monitors. After a few days I started to get real horny. To make things worse my wife was sending nudes and every single nurse I had were gorgeous. When I thought I was in the clear, I started going at it. Right as I was about to finish, the nurse rushed in (she had to know) and asked if I was OK. All disheveled, I said I'm fine. Here it is, my blood pressure shot up to 145 and they were worried something was wrong with my heart. Worst part is, they kept me for an extra day to make sure I was OK. Most expensive fap ever.",
            "Nah, I just ask for the head nurse",
            "Absolutely. Common enough when people have telemetry (heart monitor on) that we have a name for our because it creates a particular artifact appearance. \"This patient had a bout of wackacardia at 7pm\"",
            "I recently had a pretty serious suicide attempt and spent two weeks in the surgical ward and two weeks in the psych ward. It was a public hospital so I didn't have my own room in either but I'd masturbate in the bathrooms once or twice a week. I'm sure the staff are used to it happening.\n\nI also once had sex with another psych patient in a hospital bathroom. I'm sure that also happens somewhat often.",
            "In all open vulnerable honesty I have. About 5 years ago I got injured on the job, thought I was fine. A couple days later that injury on my finger got so swollen I was pulling an ET. Eventually that led to me being in a hospital stay for several days on a wonderful IV concoction, an elevated right arm in a brace, and on one night leading to the operation, doses of morphine. \n\nWhen the pain had its down moments (yay morphine) I definitely rubbed a couple out. I just used my left instead of my right. It was good practice really, because it was going to be a while before righty would be back in action again.",
            "Yup, saw a man straight up watching porn on his phone and jerking it on a day shift",
            "I've had a month long stay in the hostpital a couple of times as a teenager and yeah. I was lucky enough that some weeks I had a private room or a shared room that I was alone in. But yeah as a 14 and then 17 year old I had to get those urges out.",
            "Doctor here. I recently had a lady admitted for acute pancreatitis. She kept having 10/10 pain when based on my experience, exam, and objective data she should have been much better. Her boyfriend visited frequently…. \n\nHer urinalysis on admission was normal. \n\nHer urinalysis on day 7 of admission had many sperm detected. \n\nDischarged her the same day of the UA result.",
            "Yes.\n\nSource: am doctor. sigh.",
            "Yes. Yes they do. Unfortunately I’ve seen it with my own eyes on night shift.",
            "[deleted]",
            "great question. Im sensing a business opportunity.",
            "Guess that depends on whether you have a catheter installed or not.",
            "So I was in hospital for 10 days due to meningitis when I was 19. The first week I was just in and out of consciousness and just not well enough. I knew I was getting better when I felt the urge. And yeah I did the deed.",
            "Americans use their tears from the thought of the medical debt, sad then horny- a tale as old as time",
            "Nurse here: yes they do. But it's just the men. I've never caught a woman masturbating but I've caight so many men........ also, don't do it while wearing any sort of vital signs monitoring devices. Your heart rate will spike. We will come running. It's VERY AWKWARD.",
            "Sometimes I go to hospitals just to masterbate.",
            "Yes, but I usually wait until I've finished my rounds.",
            "The hospital is probably one of the few places I haven't done anything sexual, but I've never been in a hospital for more than a few days",
            "I was in for severe blood loss. After a few blood transfusions I felt fine but they kept me in for 8 days for further treatment and to monitor for ongoing blood loss. I had no issue, every bed had curtains that closed all the way around. I’m also a woman so I was able to be virtually silent.",
            "I was in the hospital after a motorcycle crash, both arms messed up. When they would give me a sponge bath I would get an erection. One say the nurse asked if I wanted her to take care of my \"little problem\". I looked around, sure why not? Whack! She smacked it with the back of her hand and it went right down. Never had a problem again.",
            "When I was in the hospital for 1 month I didn't but I got plenty of wet dreams",
            "Wherever people are you can safely assume masterbation is, too.",
            "According to the nurse in my family “Honey, people staying a couple of hours at the hospital masterbate.” 😬 she does work in the bad part of town though",
            "How can people jerk off in a hospital? I would embarrassed just for thinking it",
            "If your body is in such a terrible state you have to stay multiple days in the hospital having a wank isnt high on your priority list. \n\nAnd even if you want to masterbate most forms of painkillers deaden yours senses just enough that betwen them and whatever your afliction is you just cant get yourself off without spending a ridiculous amount of time in the attempt, if you can at all",
            "I did.",
            "I have been at the hospital for a month, and it was at first curing my low level of immunology and then waiting for my hormons to be optimal. I was bored and it was this one thing that made me temporary happy, so I did, multiple times. Usually I was scared for nurses or other patients to catch me tho",
            "I have been in hospital over night a few times, once or twice the alcohol ward.\n\nMore than once I have seen people get heroin delivery's, even cocaine. If you are doing cocaine in a hospital, you surely would go to the toilet to jack off.",
            "When I was in the hospital for 7 days, I was in so much pain and drugs that the thought never even crossed my mind.  \n\nThe idea of just getting out of bed to pee was painful.",
            "Having spent nearly a month, definitely.\n\nOne time where I spent 3 days I didnt but lemme tell you how fucking boring it gets",
            "I'm currently in the hospital and personally, I do.\n\nJust don't do it when hooked up to heart monitors.",
            "Had quadruple bypass. Couldn't do anything but try to walk for over a week. Got reasonably mobile after a couple weeks in cardiac recovery unit. Celebrated by hobbling to the bathroom and rubbing one out. Didn't even occur to me that the nurse checking on me definitely knew i cranked one out. Oh well, no regrets. I survived to wank another day.",
            "I masturbated my gf on a chair next to my hospital bed. I was in the hospital for penis problems.",
            "I found a way to discreetly masturbate in jail, in a dorm setting with 29 other inmates, while serving a 10 day sentence. I’d say those that need to, do.",
            "Psych patients will make eye contact and furiously masturbate like a chimp on epinephrine.\n\nEdit: I should note that they do this to establish dominance.",
            "I jerked off reading this about a hospital",
            "The only time I’ve spent a week at a hospital was because I was having my baby. So hell tf no I did not masterbate.",
            "Last time I was in hospital, February, for a month, on my own in a bed. No fam/friends around. I was given the old terminal one/ two. We'll make you as comfortable as we can. Have you met our palliative team? They're fabulous! No. In the aftermath I tried a lot but to no success. Sexual energy has always been important and always there for me. I loved my energy!. Just even as a comfort. My body is too busy dieing, my mind is pissed, I would give anything to feel pleasure. Fuck this.",
            "When I go for a flu shot I just rub one out why not",
            "yes",
            "People fuck in the hospital. Not even kidding had one lady of the night taking clients that her pimp boyfriend set up outside of the room. We had to call security and the woman was immediately discharged.",
            "I wonder how the hospital deals with vices like nicotine or alcohol? If someone who is a daily user of nicotine or alcohol (even if in relative moderation) would feel a bit uncomfortable and possibly have withdrawal symptoms if they go 3-4 days without partaking.",
            "What about astronauts? They are in a small, sealed environment for months on end so they must need a quick tug now and then.",
            "I used to work in a sleep lab. Wondered what was going on with my female patient’s ECG readings. Looked at the video and turned on the sound and you could hear her vibrator going. Have seen numerous men masterbating too. Seriously people, you can’t stop for ONE night? ( this is after being explicitly told that they’re on camera at all times!)",
            "Not sure about masturbation but I was close friends with a couple who the husband was a pastor of a church. The guy got in a major car accident and was in the hospital for 6 weeks. Next month his wife was pregnant and they bashfully confirmed they did it in a hospital bed lmfao",
            "Spontaneous lung collapse when I was a teenager and spent time in the ICU. Would get washed by nurses every other day and they would not tend to my privates but instead would put the wash cloth on them and leave for a few minutes. One wonderful day a candy striper (giving my age away) was assigned the task and didn’t hesitate to wash where no one else would.  She looked at me, smiled, and did the deed after I got an erection. I was moved out of ICU soon after and never saw her again.",
            "Had sex their. Had an asthma attack and the hospital left me in the waiting room for five hours. By the time they gave a damn to admit me, my lungs had to be basically inflated with helium and oxygen. Couldn’t talk, couldn’t have visitors for more than an hour a day, scary as hell. After a few days, things began to repair themselves and I got back to basically normal. My boyfriend, a new relationship at the time, had spent days terrified I was going to die. So he brought me my favorite snacks and painted my fingernails and we had some very sneaky hospital sex. We’ve been married seven years and I keep my asthma better controlled.",
            "My friend was immobilized in bed with an upper leg fracture. He had tractions and rods. His gf would visit and stay some nights at the hospital. He spent about a year until full recovery. At about the same time he was learning how to walk without crutches which was month 11, his gf gave birth to their first born. Go figure.",
            "I did it once after my second open heart surgery. I was recovering and had been in hospital for 3 or so weeks already, so I said fuck it and started fapping.",
            "Op currently in hospital bed want to wank it",
            "My late boyfriend spent two straight months in the hospital once. He had his own room. We absolutely had sex in there. Looking back on it, the nurses definitely knew, considering he was hooked up to a heart monitor, etc. But I stayed there with him the full two months, so they obviously knew what was up and didn’t interrupt lol. Good times.",
            "Haha one of the weirder questions I've seen on here but I guess if you are in the mood and have the privacy, then go for gold",
            "I was in the hospital for weeks and never masturbated but did have sex.",
            "Depends on the person and their specific situation. \n\nIt absolutely happens, no doubt about it.",
            "I did",
            "I once stayed for a week in a run down Eadtern European hospital. I didn’t rub one out tho",
            "I did.",
            "Two years ago I had to stay in hospital for 3 weeks. While feeling sick I did not feel like at all, but during my last week, as I was feeling better I wanted to, however it is really hard, as doctora were coming in quite a lot as well as relatives. So, in my case, I did not",
            "I was in the hospital for about three weeks a few years ago. I was sick enough I had no sex drive, but I did hit a point partway through where I was like \"huh, I haven't gotten off in weeks, maybe I should try\" so I waited until late at night, after the nurse did a routine check on me so I knew I'd have time, and jerked off as quietly as possible to see if I still could get off. I was pretty bored of being in the hospital at this point so even with no sex drive, I just wanted to see what would happen, just to break me out of the same boring cycle a little bit. I got off but it was a pretty mediocre experience and I didn't do it again until I got out.",
            "Yes.\n\nSauce: Had a colostomy a few months back, tugged one out on the fourth day of my five-day stay. It was very much needed by that point!",
            "Hospital peace officer here. \n\nVery short answer? Quite often yes.\n\nLonger answer: it depends on the patient, why they're there, and the hospital, or even the specific room. For example some of our rooms have four beds with a single shared washroom and the door to every room is generally left open throughout the night for observation purposes.Some people are too shy about the lack of privacy. On the absolute opposite end we've had people on 24/7 observation for suicide risk who will masturbate while locking eyes with their security guard. \n\nI've had people try to shack up in a hospital while I had them under observation. So yes. People 100% masterbate in the hospital. Assuming that the reason they are there doesn't prevent it.",
            "I've been in hospital for long stays quite a few times. I can safely say that I've never even been remotely horny. Most of the time I've had a catheter which is uncomfortable af, or an ABG which is pretty painful. That's not even counting the lack of privacy ...\n\nEdit: actually, I remember one time, precovid I was in a hospital room with one other lady. She was nice to me but a total trashpile in every other way (she was dating the man who sexually abused her 12yo daughter, and she shamelessly told me this one night before turning over to sleep). Her boyfriend/ bag of scum came to visit her one day. I was talking to my husband on ft so I closed my curtain. All the while, I could hear them whispering. Eventually, they disappeared for a while. Turns out they were fucking in the bathroom.",
            "People who do, what do you do with the cum",
            "Used to work a cardiac floor pre-Covid as an RN. Never had any “suspicious” tachycardias from people masturbating. But depending on how sick your were and why you were on my floor, if a patient would have just asked me to take off his heart monitor for “15 minutes of privacy” I totally would have accommodated that 🤷‍♂️",
            "I stayed in the hospital for a week then a low-security mental health facility for 4 weeks. Jerked it in the shower in the hospital and in bed after 9, as they wouldn’t bother you unless you needed medication.",
            "The longer I stay in one spot, the chances of me masturbating begin to increase exponentially over time.",
            "Sometimes and the healthcare providers know, often because we can hear, and it's incredibly uncomfortable. And as other people have said, please don't do it if you are connected to telemetry.",
            "I have no clue. I have occasionally jerked off at places where I shouldn't, so I don't know-embarrassing memories associated with this question. \n\nBut I'm glad you've asked this because I've been wondering where to ask questions of similar sexual natures. Just couldn't recall where to ask. (Maybe there's someplace more specific, for sex and masturbation? I've got a lot of bizarre OCD-like thoughts about this stuff. Might try talking to someone IRL instead but it could be really awkward.)\n\nI really don't understand how people can say masturbation is a sin when it's essentially unavoidable. I think sometimes it just happens, and it's best not to make a big deal out of it, and to try to make it easily cleaned up. Even if you try not to jerk off, you will do it and have sexual thoughts eventually. Heck I've had far fewer invasive sexual thoughts since jerking off quasi-regularly, so that should be a good thing from God's perspective, you would think. (And I've had at least one or two really odd dreams that I'm thinking were incepted into me by others, as they felt really different from my usual dreams; so am I at fault for those?)",
            "I did when I recently had my appendix out, maybe not my proudest fap but I used to collect ‘jack spots’ so it didn’t seem weird. It started when I tried to nut off the edge of the Grand Canyon (it didn’t get that far) then I did the bathrooms at the Hoover dam, and a bunch of other popular destinations",
            "Nurse here.  \n\nYepp! And some get more creative with it than others.  \n\n\nPrivacy in the room? As much privacy as you want to have, without it interfering with the actual.. You know.. Reason youre there. If youre in a double, triple or quad bed room then youre shit out of luck.  \n\nOr, make sure you clean up afterwards if you use the bathroom for funny buisnes.",
            "[deleted]",
            "mastUrbate*",
            "Dude, everybody masturbates everywhere, all the time.",
            "Oh, yes. \n\nFor context, I got COVID and had some 77% lung infection. My lungs couldn't take the load of even me sitting up from laying on the bed. It was terrible. I had no thought of even trying to go for it in the first 2/3 phase of my sickness. Also I didn't wanna risk me having issues due to obvious heavy breathing and nurse coming in saying \"do you need some help there? ;)\" \n\nThe later 1/3 of my stay in hospital, I went for an adventure and boy, I am so proud. I did get momentary headache though and my Oxygen level (SpO2) was 80ish. Still, totally worth it.",
            "Not if you get circumcised",
            "I was in the Hospital because of a testicle torsion. Twas very.very.very painful, and they couldn't tell me if my left mating buddy would survive.\nHe didn't, and after the amputation I got a little bit nervous. I've got the relief few days later when I took my dick out for an.... Inspection. It was the most painful rub I ever had, and felt fucked up (in a nice way), it was like a pump that had a bit of leftover water. \n\nI'd give it a 8/10, but still not recommended.",
            "I did when i had my catheter taken out (a very traumatizing experience) and when i turned my head....to my horror, there was my mother.\n\nso...embarrassed",
            "Not if they've lost use of both arms",
            "I’m so glad I can finally contribute!\n\nI was just discharged from the hospital after a 7 day stay in which I was treated by a cocktail of antibiotics after surgery.  By day 4 I had given into my urges and just had to masturbate.  Unfortunately, I was unaware that I had began to suffer from a yeast infection as a result of the antibiotics which caused me to have the most painful orgasm of life.\n\nSo to answer the question… yes, but not everybody should.",
            "Trick is to do it in the shower.  Had a heart palpation thing going on and had to spend a few days in the hospital.  If you can get to the shower, do it there because most likely they won't come in."
        ]
    },
    {
        "post_id": "d0e1yf",
        "author": "doge_ex_machina",
        "title": "Can I get in legal trouble for hiring a sky writer to draw a penis in the sky?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/d0e1yf/can_i_get_in_legal_trouble_for_hiring_a_sky/",
        "score": 13864,
        "num_comments": 659,
        "created_utc": 1567760040.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/d0e1yf/can_i_get_in_legal_trouble_for_hiring_a_sky/",
        "comments": [
            "Well I know the navy doesn’t like it when their aviators do it. \n\nhttps://www.navytimes.com/news/your-navy/2019/05/14/the-navys-probe-into-sky-penis/",
            "So as a general rule, if you do something you probably shouldn't in public without a specific crime on the books, they can still get you for 'disturbing the peace.'\n\nSo the answer is that you could, but you wouldn't necessarily.",
            "That's so worth finding out by trying....",
            "I was hiking out in the dunes one sunny day at Sleeping Bear and stopped to rest and enjoy the scenery. I was at the top of one dune looking across a bowl a quarter mile wide at the side of another huge hill.  \nI had been gazing for a couple of minutes before I realized that someone had drawn in the sand, across the side of the opposite dune, a penis at least a hundred yards long and 30 yards wide, scrote included.  \nIt was a mighty impressive effort for a temporary work of art.",
            "[A NAVY pilot did it](https://www.washingtonpost.com/news/checkpoint/wp/2017/11/17/a-navy-pilot-drew-a-penis-in-the-sky-its-not-the-first-time-something-like-this-has-been-investigated/)",
            "As long as sky writing is legal in your area, I'd assume it'd be fine. Check first though!",
            "Just say you told the guy to draw a palm tree. They can't prove the sky writer didn't suck.",
            "Nothing specifically banning it. But depending on where you are I suspect they *could* use some kind of public order offence, or \"outraging public decency\" law. You'd be talking a fine or a visit from the police at worst. Think of the angle they could use: \"there was a school playground that the plane flew over. Why did you display a huge penis in full view of several hundred children under the age of 10?\".",
            "[removed]",
            "It really depends where you are.\n\nSome countries have laws against obscenities and you might have to pay a fine or worse.\n\nIn Europe / US it should be OK, but maybe a lawyer can give a proper answer.",
            "Potentially. The federal government maintains that obscenity is [not protected by the first amendment](https://www.justice.gov/criminal-ceos/obscenity) and there are [federal anti-obscenity laws](https://www.justice.gov/criminal-ceos/citizens-guide-us-federal-law-obscenity).\n\nNow, a penis isn't necessarily obscene, and skywriting probably doesn't fit the exact letter of any of the anti-obscenity laws (does skywriting count as \"transferring obscene material\"...?), buuuut even though a good lawyer could probably get you off, that doesn't mean they wouldn't arrest you and let you rot in jail for a while as they determined exactly which laws they thought you had broken and whether or not to press charges.\n\nAnd that's just at the federal level. Local jurisdictions often have anti-obscenity laws of their own, so depending upon where you do this, there are potentially any number of clear-as-crystal laws you could be violating.",
            "Will they do it? That's the question,  and how did a 12 yr old make enough to higher a sky writer?\n\nSo many unanswered questions.",
            "Probably fine, but it would be a dick move... \n\nsorry.",
            "A penis in the sky is feasable. Need good weather and a good pilot/aircraft .",
            "It is a form of art, and nudity in being expressed through the medium of sky writing technically is an artform.\n\nWheres your kickstarter.",
            "I painted a big orange splooging penis on a pothole and it got fixed so there’s that.",
            "I would say no but I imagine it would be hard (pun intended) to find a company that would do it and if anybody would get in trouble it would be them. Now that I think of it, I think I remember reading that an Air Force pilot got in trouble for doing it I’ll have to check.\n\nEdit: https://www.google.com/amp/s/amp.usatoday.com/amp/1289523001",
            "If anyone is gonna get in trouble it’s the pilot. I say go for it",
            "There is no FAA regulation against drawing a sky penis. IANAL but I say say with almost absolute certainty that your local authorities don't have one either, because it never occurred to anyone that someone might actually do that. Those military guys who got in trouble for it were probably dinged for \"conduct unbecoming of an officer\" because before those guys did it, no one ever realized that someone might. Sometimes being on the cutting edge of society has its advantages. Please post pics/youtube of your sky penis when you've had it drawn.",
            "I guess that it depends on where you live. In Denmark we had bare breasts in an add on busses in Copenhagen a while ago so I think you have to do more than draw a penis in the sky to get in trouble her at least.\n\nLink is NSFW depending on where you live ;)\nhttps://res.cloudinary.com/fleetnation/image/private/c_fit,w_1120/g_south,l_text:style_gothic2:%C2%A9%20Francis%20Joseph%20Dean,o_20,y_10/g_center,l_watermark4,o_25,y_50/v1437492048/jfksgnvlritbcgickqvl.jpg",
            "Correct me if I'm wrong, but I don't think a drawing of a penis is inherently offensive, moreless illegal.",
            "I am thinking if a legit skywriting company is willing to do it then it is likely legal. I can't imagine they would agree to write something illegal. You can't do something illegal and get away with it by saying \"he hired me\".",
            "I think they would charge you for disturbing the peace",
            "thats a hard one!",
            "Nobody would do it, it violates the Skywriter's Code.",
            "If I were you I would put some money aside just in case you need to pay a fine, which I guess is the max penalty they can give u",
            "Only one way to find out!",
            "Just ask the Navy they will do it for free.",
            "[The US Air Force did it so I don't see why not](https://www.usatoday.com/story/news/nation/2019/05/30/air-force-pilots-draw-accidental-penis-sky/1289523001/)",
            "It's more a question of whether the pilot or business will agree to do it than anything else. Reputation is important to businesses and people that do that kind of thing.",
            "You can get away with making one if your in the military. It's happened before.",
            "This is why aliens avoid us",
            "Bruh go for it and post updates",
            "Isn’t this like hiring an assassin. \n\nLike you technically paid for it. But they did it.",
            "If you do (get in any kind of trouble) than Jesus Christ, what kind of country do we live in? \n\nIt’s a harmless joke!",
            "Fun fact: recently there were two Navy pilots that did just that and it was fuuuucking hilarious to read the transcript. Look up the “Sky Penis”.",
            "Definitely in the \"try it and find out\" category.\nSome things are worth a fine",
            "If you can afford the skywriting why do you care about a fine?",
            "The Navy drew a penis in the sky over Washington state. Maybe they’d do it again for free for you.",
            "In Vancouver? Probably not. \n\nIn Iran....",
            "Just do it and take one for the team. You could be the first. When you look back on your life, would you rather say I could of, or I did. You would be a LEGEND sad the guy who got arrested for getting a giant penis drawn.",
            "Solid question!",
            "Sounds like a great idea.  We should start a ulule/kickstarter/kiss kiss bank campaign to find-out",
            "I’m not an expert by any means, but as it would be a privately contracted service and you do have some protections under the first amendment for freedom of speech, you are not speaking profanity in public (a misdemeanor in Virginia, but rarely enforced) and, depending on the contract, the skywriter may not be able to divulge your information, you might be OK.\n\nI would go over that contract with a lawyer if you’re truly concerned or actually gonna do it. My opinion is not law, however, it would be a lot less offensive than a lot of things that are protected under free speech, i.e a swastika.",
            "The air force will do it for free.",
            "Don’t forget the ball hairs though. That’s the most important part.",
            "Sky graffiti?",
            "I don't think so",
            "Why not get your penis to draw a sky writer?\n\nSaves you money",
            "i dont know but if you, or anyone else tries it- i need pictures.",
            "Hiring?  \nThese guys went and did it themselves.  \n\"It was supposed to disappear after a few minutes.\"\n\nhttps://www.navytimes.com/news/your-navy/2019/05/14/the-navys-probe-into-sky-penis/",
            "A few guys did it in the Air Force once. Shouldn't be too bad. Also, send  pics.",
            "New Air Force tactic confirmed.",
            "if anything the sky writer would get into trouble. it's up to them to approve/decline work.",
            "If it's a US Navy aircraft then yes",
            "Somebody did it with their [flight plan](https://www.google.com/amp/s/gizmodo.com/bored-pilot-writes-im-bored-and-draws-two-dicks-in-the-1832754055/amp)",
            "US Navy will do it for you",
            "You shouldn't. Nothing wrong with a temporal phallus.",
            "There was a case recently when some air force pilots got in trouble for doing this while out on maneuvers.\n\nI bet you could get in trouble if someone raised a big enough stink about it. When there are no explicit rules about a thing popular sentiment usually takes its place.",
            "Probably not. The sky writer on the other hand...",
            "If they tried to you could claim it a form of expression and therefore protected under the 1st amendment",
            "You should write your marriage proposal inside your sky penis.",
            "If you do it where nobody else is really around then you'll probably be fine. Over a city you might get in trouble.",
            "Lol",
            "Y’all hiring?",
            "Depends on what you mean by \"trouble,\" but someone could definitely sue you over it.",
            "why is the answer removed?",
            "Did they look? if so by law there gay and legally can't touch you or it's sexual assault",
            "The Sky Writer is liable, so just ask them?",
            "Depends on how realistic it is? 🤔",
            "We will watch your career with great interest.",
            "This is the quality of post I sub’d here for. \n\nNow I need to know!",
            "I mean a navy pilot got in trouble just for purposefully flying a dick shape so...",
            "please do",
            "OP is the type of person I'd like to be friends with.",
            "I think it depends on how long the banner is.",
            "You have entirely too much free money on your hands",
            "Depends on the size",
            "I think you'd have a hard time finding someone willing to do it",
            "No, but only if you send me a video recording of this",
            "They would first have to prove it actually isn't a drawing of Diglett, your favorite pokemon.",
            "Only one way to find out",
            "Check this out.\n\nhttps://youtu.be/nMoK11P4w6Y",
            "I mean... It only looks like a penis from two viewing angles: below the drawing and above the drawing. I'd just argue that whatever it resembles was a coincidence.",
            "It’s a bicep and forearm. Great logo",
            "I too would like to know the answer to this",
            "Just explain to the authorities that the pilot was meant to draw a submarine. If they get smart and ask why your sub has a giant set of balls, just play dumb and agree saying , “ god only knows ! How he managed to Cock that up is beyond me “.",
            "That's why it's gotta be mildly penis so you can deny it's a penis and then they cant do anything... probably",
            "Didn’t a Navy pilot get in trouble for this and his CO had to apologize to a city?",
            "Nope. The only thing I can find relating to obscenity is in Chapter 11 of the Human Factors Guide for Aviation Maintenance, in which it says \"Omit obscenities, off-color humor, or sexual language from interactions. Completely avoid dirty\rjokes. In fact, eliminate any inappropriate discussion of sex related topics, such as sexual problems\ror experiences.\"\n\n\nAnd here's the only federal laws on obscenity.\nhttps://www.justice.gov/criminal-ceos/citizens-guide-us-federal-law-obscenity\n \n\nOf course, double check with ur state but there's nothing saying you can't.",
            "Probably just a misdemeanor for public disturbance",
            "Oh yeah its all coming together",
            "That's a big maybe",
            "Only if you don't use a condom.",
            "We'll, only if you're part of the patriarchy..",
            "Have you seen the video where Conan O Brien is playing Mario Kart with Seth Rogen and Zac Efron? Well they draw penises in their faces if they lose the race, but in television you’re not allowed to show dicks so there’s certain shapes that look like dicks but aren’t really dicks. Maybe that same rule apply in those cases.",
            "What crime could they even charge you with?",
            "Somebody in the military did this in Washington state recently. I'm too lazy to look it up, but I think they did get in legal trouble!",
            "This is tagged as education and it definitely is",
            "Mr beast is that you?",
            "Nah.",
            "If unsure, this might be of help. Migrating to the land of the madlads isn't exactly that bad.  \n[https://www.thedrive.com/news/26584/flight-instructor-draws-pair-of-penises-writes-im-bored-in-sky-over-australia](https://www.thedrive.com/news/26584/flight-instructor-draws-pair-of-penises-writes-im-bored-in-sky-over-australia)",
            "I often think ‘can you get into trouble for...’ thoughts, and I’ve learned that generally if you need to to ask, chances are you will.",
            "Look up local obscenity laws.",
            "Since when is it illegal to draw a penis anywhere?\n\nIt’s never slowed me down",
            "Oddly enough, this has kind of happened before and two marines received administrative punishments (though not specified) for doing this.\n\nhttps://www.marinecorpstimes.com/news/your-marine-corps/2018/11/06/two-marine-pilots-grounded-pending-investigation-into-sky-penis-flight-pattern/",
            "Flacid no, erect yes. Erect penises are threatening.",
            "No, but they can.",
            "I hope not",
            "We all need a sky penis",
            "I’ll do it for a Big Mac and a pilot’s license.",
            "I suppose you can if you're in the Navy:  \n\n\n [https://www.theguardian.com/us-news/2017/nov/18/penis-in-the-sky-us-navy-pilots-grounded-over-obscene-drawing](https://www.theguardian.com/us-news/2017/nov/18/penis-in-the-sky-us-navy-pilots-grounded-over-obscene-drawing)",
            "https://mashable.com/2015/03/13/flight-radar-penis/",
            "Why would you? Mission control drew a penis on Mars using  a rover.",
            "(S)LPT: get enough people involved that it’s not worth arresting all of you",
            "It's just a giant eggplant.   Not sure why it looks like a penis.  The vines do look like veins, and the gush from the top just looks like he messed up drawing the stems.",
            "Just do an eggplant instead",
            "Wouldnt it be the pilot that gets in trouble?",
            "Even if you could get in trouble, you wouldn't get in trouble for hiring someone. The person who flew the plane would.",
            "The question I didn't know I needed answered",
            "Maybe. A guy drew an imaginary penis in the sky, but it wasn't visible to the human eye, you needed to track his flight plan. It went viral. I haven't heard of anyone visibly leaving a penis, but I wouldn't advise it. If you do though, please tell me!",
            "Sir please draw a cylinder and half the Olympic symbol...its a beer campaign",
            "If you can afford a sky writer you can afford a lawyer that will destroy any court that tried to charge you.  Do it.",
            "You're not going to get photorealistic with sky writing, so you'd probably be OK",
            "Not a lawyer, but it'd be really hard to draw a good penis and one that would be undeniably a penis. A banner with a picture of a real penis would probably be considered indecent, but a big 8==D in the air hardly even looks like the real thing and you'd definitely be able to fight it in court if you even got a ticket.",
            "I doubt you’d get in trouble but you’d probably have a hard time getting someone to do it. Their business would probably catch all the shit.",
            "Please film it if you do.",
            "Please film it if you do.",
            "Please film it if you do.",
            "it would be the sky writer who's responsibility it is to know that.",
            "it would be the sky writer who's responsibility it is to know that.",
            "An airforce pilot did it but he got in trouble with his superior command",
            "An airforce pilot did it but he got in trouble with his superior command",
            "A military pilot did this a few years ago",
            "My only reference is that one time we made a huge sand penis on a beach in Florida. They just asked us to destroy it. Therefore my guess is that authorities could grant you a warning as to not do it again. Then if do it, as other people have mentioned, you could possibly be charged for disturbing the peace.",
            "A military pilot did this a few years ago",
            "A pilot did this a few years ago",
            "The navy did it back in May! \nhttps://www.google.com/amp/s/www.vice.com/amp/en_us/article/bj9vvm/balls-are-complete-how-a-navy-jet-crew-drew-a-massive-penis-in-the-sky",
            "The navy did it back in May! \n\nhttps://www.google.com/amp/s/www.vice.com/amp/en_us/article/bj9vvm/balls-are-complete-how-a-navy-jet-crew-drew-a-massive-penis-in-the-sky",
            "Why can't I comment?",
            "My only reference is that one time we made a huge sand penis on a beach in Florida. They just asked us to destroy it. Therefore my guess is that authorities could grant you a warning as to not do it again. Then if do it, as other people have mentioned, you could possibly be charged for disturbing the peace.",
            "My only reference is that one time we made a huge sand penis on a beach in Florida. They just asked us to destroy it. Therefore my guess is that authorities could grant you a warning as to not do it again. Then if do it, as other people have mentioned, you could possibly be charged for disturbing the peace.",
            "Am I reading this right you want to sky write a cock setting aside the total waste of money do you not think it says something about yourself",
            "Am I reading this right you want to sky write a cock setting aside the total waste of money do you not think it says something about yourself",
            "Am I reading this right you want to sky write a cock setting aside the total waste of money do you not think it says something about yourself",
            "The navy did it back in May! \n\nhttps://i.imgur.com/L1Y7YgP.jpg",
            "The navy did it back in May! \n\nhttps://www.navytimes.com/news/your-navy/2019/05/14/the-navys-probe-into-sky-penis/",
            "Nothings illegal if it’s anonymous",
            ">~~Can~~ ***May I*** get in legal trouble for hiring a sky writer to draw a penis in the sky",
            "Can you get in trouble for hiring someone to kill someone?",
            "I'm assuming this is the US. If it falls under the category of \"obscene\" then it's illegal to broadcast (the reason why you don't see nudity in public ads).\n\nWhether you actually get charged or not is a different question.",
            "Do it if you can or not",
            "You could also get sued. Stupid I know. But there are people who know people, they'll find you and sue. \n\nPlease don't though.",
            "When the last Avengers movie came out I wondered if someone had a sky writer draw a spoiler for the movie in the sky would they get in trouble?",
            "I high school I got a hold of one of those car pens you write \"happy birthday Johnny\" or whatever on peoples windows.  I used it to draw giant penises on my friends cars in the school parking lot at lunch break. About 30 min into my last class of the day a police officer called me out of class escorted me to the office. He xplained how those penises could of been seen by little kids and considered indecent exposure or something in that realm. Scared the shit out me, which I think was the whole idea. So yeah be careful, exposing a penis of any kind, sky writing or otherwise, can be considered a crime.",
            "How could it be proven? It’s going to disappear in 10 seconds.",
            "I've seen worse at protests... Those holding signs get away with it.",
            "Big cartoon looking cowboy hat should be okay.",
            "Johnson: [Noticing Dr. Evil's spaceship on radar] Colonel, you better have a look at this radar.\nColonel: What is it, son?\nJohnson: I don't know, sir, but it looks like a giant--\nJet Pilot: Dick.\nDick: Yeah?\nJet Pilot: Take a look out of starboard.\nDick: Oh my God, it looks like a huge--\nBird-Watching Woman: Pecker.\nBird-Watching Man: [raising binoculars] Ooh, Where?\nBird-Watching Woman: Wait, that's not a woodpecker, it looks like someone's--\nArmy Sergeant: Privates! We have reports of an unidentified flying object. It has a long, smooth shaft, complete with--\nBaseball Umpire: Two balls.\n[looking up from game]\nBaseball Umpire: What is that. It looks just like an enormous--\nChinese Teacher: Wang, pay attention!\nWang: I was distracted by that giant flying--\nMusician: Willie.\nWillie Nelson: Yeah?\nMusician: What's that?\nWillie Nelson: [squints] Well, that looks like a giant--\nColonel: Johnson?!\nJohnson: Yes, sir?\nColonel: Get on the horn to British Intelligence and let them know about this.\nLater, as Dr. Evil is escaping: Basil: Did we get Dr. Evil?\nJohnson: No, sir. He got away in that rocket that looks like a huge--\nSchoolteacher: Penis. The male reproductive organ. Otherwise known as tallywhacker, schlong or--\nDad: Weiner? Any of you kids want another weiner?\nSon: Dad? What's that? points at rocket\nDad: I don't know, son, but it's got great big--\nPeanut seller: Nuts! Hot salty nuts! Who wants some-- Lord Almighty!\nWoman: That looks just like my husband's--\nRingmaster: One-eyed monster! Step right up and see the One-Eyed Monster!\nOne-eyed Monster: jumps out and scares crowd, then points to the rocket Hey, what's that? It looks like a big--\nfemale Fan: Woody! Woody Harrelson? Can I have an autograph?\nWoody Harrelson: Sure thing. [Sees rocket] Oh my lord.\nFemale fan: It's big!\nWoody: Nah, I've seen bigger, it's--\nDr. Evil: (To Mini-Me) Just a little prick. It's a flu shot. You've been in the coldness of space.",
            "I don’t think you should but there’s these shitty people that make up rules and shit. Needless to say I think a kickstarter for legal fees for ‘man who drew penis in sky’ would probs meet its quota haha",
            "Depends. Are you doing it over a Florida Beach? Then, you're good.",
            "Maybe try r/Legaladvice?",
            "What you do is get them to draw the image first before turning it into a rocketship.",
            "do it under the guise of 'art' and it will be fine ;)",
            "Didn’t G4 tv do the sky dong 8==o once",
            "Skip the middle man and just sky dive naked over a city!",
            "If so, I think the skywriting company would let you know.",
            "Public indecency or a lewdness law. Faa or fcc might have something to say too",
            "Just do it.",
            "Oh God I hope not...",
            "No if you write something that \"accidentally\" draws a penis. See gavin belson signature for a clever example.",
            "The skywriter is the person drawing it. If it's illegal they should know, or at least take the time to find out, before accepting the job. The responsibility would, most likely, fall on them if it is illegal.",
            "Hmmm. Well I’m not entirely sure, so I think you should try it and see what happens! Thanks you for your sacrifice.",
            "This happened a couple years in Oregon, the pilot got into trouble for sure.",
            "TIL the answer is a solid \"maybe\"",
            "This day and age? Nah.",
            "How much extra do they charge for the balls?",
            "here is some legal precedent\n\nhttps://www.newsweek.com/navy-officers-viral-sky-penis-1425405",
            "It's say the sky writer would. Responsibility would fall on them not to \"be obscene\" kind of thing.\n\nYou could ask them to write\n\n**C=8** though!",
            "I’m not a lawyer (yet) but when I am I would happily defend your constitutional right to draw a penis in the sky.\n\nWhich you’d probably need because of various interpretations of what constitutes “obscenity”.",
            "OP I explored this idea a couple years ago but none of the skywriters would respond to my request for a quote.",
            "Lol how can a penis be offensive... I don’t get it.",
            "But why???"
        ]
    }
]