[
    {
        "post_id": "ipdpv3",
        "author": "HNK-von-herringen",
        "title": "Why does this sub have and allow so many \"Does anybody else\" posts even though there is a distinct subreddit specifically for those questions(/r/DoesAnybodyElse)",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ipdpv3/why_does_this_sub_have_and_allow_so_many_does/",
        "score": 13734,
        "num_comments": 521,
        "created_utc": 1599649085.0,
        "selftext": "Basically title. I've visited this sub every so often and a lot of questions are usually in the DAE format. I understand the concept of this sub being no limitations on questions, but sometimes it just feels like a DoesAnybodyElse lite when reading posts here.",
        "permalink": "/r/NoStupidQuestions/comments/ipdpv3/why_does_this_sub_have_and_allow_so_many_does/",
        "comments": [
            "[deleted]",
            "r/DoesAnybodyElse",
            "it is up to the mods here.",
            "I don't get DAE questions at all, doesn't matter which sub.\n\n8 billion people on earth, but sure, you're the only one who enjoys tomatoes with nutella, Jeffrey.",
            "Does anyone else think they belong on the does anyone else sub-reddit?",
            "Mods don't care.",
            "Either:\n\n1. Not knowing about r/DAE. I had no clue it existed until someone linked it here one time. \n\n2. Karma whoring. A popular post here can get many thousands of upvotes. A popular post on r/DAE usually gets at most 90-150.",
            "Sort by new and you'll see a lot fewer of those - they just happen to get a lot more upvotes than most questions.",
            "It's because as subs get bigger, they get stupider and worse without tougher moderation",
            "It’s *Does anybody else* know why this sub allows...",
            "It's usually because DAE posters don't know the best place to post or they want to post to a bigger audience (2,000k vs 41k).  Mods likely think it's better to be more inclusive which is in the spirit of the sub.  You'll notice that the DAE subreddit (among others) is located in the sidebar.",
            "[deleted]",
            "[deleted]",
            "Those should be auto deleted with Auto Mod sending a link to DAE",
            "If this had been another does anyone else post I probably would have unsubbed. Because obviously out of 7 billion people they are the only ones to have ever experienced that.",
            "I’m pretty sure you know the answer to this one but I’ll give it anyway.\n\nr/DoesAnybodyElse is a dead sub. I have never once in my 4 years on Reddit seen it on the front page, whereas r/NoStupidQuestions is on the front page daily. r/DoesAnybodyElse has over a million users, true, but only 400 are currently active- whereas this sub has nearly 2 million users and **8,000 are currently active**.\n\nMost people who use Reddit are no longer here to find their “niche community”. Reddit isn’t as much like 4Chan or any niche social medias anymore; it’s become much bigger than that. \n\nPeople will post a picture of a woodpecker to r/pics or r/NatureIsFuckingLit rather than r/birds, or r/birdlovers, or even r/woodpeckers because r/pics or r/NatureIsFuckingLit are super popular subs that both have a lot of exposure on the front page.\n\nUsers are starting to flock to Reddit for its front page and anonymity rather than its ability to offer niche, specific communities, and they have been for quite a while.",
            "Does anyone else agree with this post. In all seriousness, those post confuse me because I feel like people think they are the only person that does a specific action",
            "Because it generates that sweet, sweet karma",
            "I had asked this same question and the mods removed it, but people are tired of the DAE questions. It ruins this sub.",
            "I have a real answer: the Reddit effect. Once a subreddit gets past a certain community size, it just because a conglomerate of all the other main subreddits, reposting all the same posts and ideas. \nIt’s really unfortunate but I think the reason why this happens is because the people that actually care about the subreddits niche is outnumbered by lurkers and other people that really don’t know what they are talking about. I think this is similar to what happens when Americans are exposed to a controversy in a country that they have never even thought about, and then they give their solution without having any real context.\nI don’t have a good solution for limiting communities but I don’t think that you should be allowed to contribute just because you have an account",
            "This subreddit is r/NoStupidQuestions so people who are outgoing, confident, and fearless may post something on \"does anyone ever\" while this subreddit is for the same kind of questions (at times) BUT in a \"JuDgMeNT FrEe ZoNe\" and by bullying people for posting DAE questions, you are marginalizing the subscriber base and making a mockery out of the spirit of the community because of a minor inconvenience resolved with the slight swipe of your thumb.",
            "Is knowing all the existing subreddits an unspoken rule?",
            "It is a combination of three things:\n\n1. Lazy mods. \n\n2. Posters have discovered that an easy way to reap cheap karma is to post a relatable experience in the form of a question, and that the mods aren't going to do anything about it. \n\n3. The fact that Reddit now is comprised largely of teenagers. Seriously, scan down the front page and look at what kind of things get posted and upvoted. I don't think it overstates things to say that you see the site in a whole new light once you realize that.",
            "Most people here have hit the “posters don’t know” portion pretty good.  I also think it’s because the DAE sub is kind of shitty.  If you go to r/Doesanybodyelse and sort by new, most of the posts have few to no comments on them.  The new posts on NSQ get much more attention.  I’m not saying that’s necessarily always a valid reason to bring the posts here instead, but it is at least understandable.",
            "Got my post removed for asking this. The sub is just dae. It was a genuine question: why is every top post r/dae? But apparently that's not a stupid question",
            "Maybe,  because THERE'S NO SUCH THING AS A STUPID QUESTION.",
            "Personally, I think it's a little ridiculous to have to go a different sub for every different kind of question I have. If you have a problem and actually get annoyed with someone asking a perfectly normal question that happens to have \"does anybody else\" in the question...\n\nYou need to get a life and move on.",
            "Thanks for the feedback. We've seen it before, and it's been discussed a number of times among the mods.\n\nPlease be aware at the moment there is no rule against DAE (nor are there immediate plans for one) and posts that fall into that category are allowed unless they break some other rule. We regularly remove repeats, rants, complaints, etc. that are all disguised as \"DAE\" posts.\n\nKids or people basically asking \"am I weird if...?\" is perfectly suitable for this sub and its founding mission and as you can see some of them generated a ton of interest, upvotes, and discussion.\n\nNSQ tries to be as free-form as we can be and not restrict except where we have to in order to stay compliant with Reddit's rules or to stop threads from turning into rediquette-breaking flame-fests in the comments. Many of the questions asked here could technically go in any other sub. If the question doesn't appeal to you, downvote it or hide it and it won't bother you any further.\n\nThanks.",
            "Yeah I totally agree that those questions don't really belong here: I even asked mods to add that subreddit to the \"related subreddits\" list (which they did, thanks), but it didn't really help.",
            "Does anybody else get tired of questions that start with “does anybody else”",
            "I never even knew that subreddit existed. I don’t know if I’ve ever posted on here, but I’m going to assume it’s the same for a lot of people who have posted on here; they just didn’t know it was a thing.",
            "Occam's razor: they just don't know. Could be for many reasons.",
            "Does anyone else not know of its existence",
            "Because I've never heard of that one.  I am probably not alone.",
            "I have a question - how do people find something if they don’t know it exists in the first place? I assume a lot of these posters just don’t know that sub exists.",
            "Honest answer? I didn't know about that sub until this post.",
            "Didn't know this sub exist thanks!",
            "Seriously.  I just scroll past as soon as I see those magic words.",
            "Jeez yes I despise those posts because the answer is always yes. I guarantee whatever weird thing you think you do, at least a few other people in the world do it or they do something even more strange.",
            "For easy karma.",
            "“Does anyone ever...” \n\n**YES.  THE ANSWER IS ALWAYS YES, AND IF NOT THEM, THEN “A FRIEND OF MINE” or “NOT ME BUT MY BROTHER/SISTER/UNCLE/GOLDFISH”**",
            "Also it's less so that this sub is about actual dumb questions, and more about funny questions. I've asked a few dumb questions that I genuinely was interested in getting answers. But I got downvotes instead lol",
            "I hate any question that starts with that. It makes it seem like OP thinks they are special. A better way to ask a question is \"Who else\" since that sounds more inclusive than \"Am I the only one\" or \"Does anyone else\"",
            "I’ve always wondered that too. \n\nI realized r/doesanybodyelse is just not as popular and active as this subreddit tbh. You probably have a better chance of getting responses and upvotes here instead of DAE",
            "[deleted]",
            "Some things are appropriate for multiple subs. A picture of a cat could go in r/Aww or r/Cat among probably ten other subs it could go in. I think the moderators understand that. \nSome people are new to Reddit, and don’t have all the subs memorized. The moderators probably understand that to some extent as well. I’ve been here for a while, and still don’t have anywhere close to all the subs memorized. What is with some Reddit users expecting everyone to have all subs memorized, all abbreviations memorized, etc and reprimanding them if they don’t? I had someone bitching at me the other day because I didn’t know was /s meant. Not saying that is what you are doing, it is pretty clear you are just asking a question. But your question got me thinking. So, not directing that at you.",
            "Does anyone else ask this question?",
            "Is anyone else a multi celled organism?",
            "I remember I tried to post one of those questions here years ago because I didn't know about that sub but my post was removed automatically and I was redirected there. I'm not sure why they're going through now.",
            "Why isn't there a \"no stupid answers\" sub? \n\nI just want to give horrible answers but this doesn't seem like the place.\n\nHasn't stopped me in this case...",
            "[deleted]",
            "Is this a does anybody else question about does anybody else?",
            "It’s pretty simple: because those types of questions are a popular part of this sub. \n\nUltimately the goal of any popular sub is to have as many members as possible. Not allowing “does anybody else” questions would reduce the popularity of the sub.",
            "The sub is called no stupid questions so you should be worried about stupid questions lmao",
            "Are you saying that some of the questions in this thread are stupid?",
            "\"does anybody else know 'does any body else questions' belong on r/doesanybodybodyelse?\"",
            "Because I didn't know r/DoesAnybodyElse existed.",
            "[deleted]",
            "I get really annoyed by these, along with questions that would take 5 seconds to google. \n\nThat said, the name of the sub itself basically invites any question without judgement, so....",
            "Ah I made a post addressing that like a week ago, but I guess I phrased it badly and the mods took it down",
            "i've had this EXACT same thought but I haven't posted about it. the sub is flooded with \"does anyone else\" questions that are really easy applicable to everyone",
            "And they always get so much attention too. 20 awards, 10,000 upvotes, 300 comments.",
            "Shouldn't this be on /r/askreddit?",
            "couldnt agree with you more",
            "probably because when looking up subreddits people think of specific titles like NoStupidQuestions and not things like DoesAnybodyElse",
            "\"Does anybody else [insert something most people do] or is it just me?\"\n\nYeah. You're the only one in all of the world that does that.",
            "DAE get really annoyed with all of the DAE questions?",
            "Why does the sub allow scientific questions when there are subs for that? Or political questions when there's subs for that? Etc.",
            "I posted one here before and realized my mistake later, though it didn’t get any traction so I’m glad about that",
            "I suspect some of it is people not knowing that more specific subreddits like in your example actually exist. Loads of times I’ll need to find something and completely miss the mark on where my question landed.\n\nThe solution has been to google my query with “Reddit” at the end for similar results and usually I’ll discover the appropriate subreddit but that takes effort doesn’t it?",
            "Ancillary to that are the “am I the only one” questions. How could anyone think that they are the only one about something?",
            "Lol I didn’t know of the anybody else subreddit",
            "Um... Maybe these people just didn't hear about the subreddit...   What's when you post the tag r/whateverpagethepostappliesto....",
            "Mods are lazy",
            "I tried to ask a DAE question and was auto deleted.",
            "This sub is literally just a karma farm for new and low karma accounts. Almost every question is very much stupid.",
            "Genuinely did not know this. Does anybody else want to go to r/DoesAnybodyElse and write their does anybody else questions there?",
            "Does anybody else get sick of these \"does anybody else\" posts?",
            "lol, id say the same thing with r/askreddit. every other post on that sub that gets popular is sexual for some reason... there's r/askredditafterdark for that stuff.",
            "Sound like the mods need to do some work in better clarifying what is and isn't allowed.",
            "Because this sub’s submission form doesn’t suggest that. \n\nMods, it would probably be a good idea to suggest alternate subs for the common question classes. That one, plus /r/amitheasshooe and /r/whydopeople.",
            "There's so many subreddits that there's no way anybody could possibly be aware of them all, and a lot of them overlap anyway.",
            "Or “is it normal to [insert normal thing here]”",
            "This is more popular. I've never seen that sub on r/all",
            "/r/aspergers is infamous for having those posts. It's why I left the sub",
            "They're feeling insecure about themselves and they ask the questioning subreddit they know",
            "I fucking hate DAE posts. It’s as if people are so insecure they need internet strangers to confirm they also feel and act the same way at times.",
            "Far as I'm concerned DAE posts are the lowest quality crap someone can post.",
            "This subreddit might follow the meta of subs that get too popular: Shitposts disguised as \"Genuine\" posts to farm Karma eventually override most of the content of the sub. It's a shame, really. I hope the mods react to it.",
            "Hej are huor duo stäng min plat form",
            "Well one reason is because r/DoesAnybodyElse only allows quirky quirks, it's one of their rules. Meaning not just rhetorical or other types of questions that people post here. \n\nThe 2nd reason is not everybody knows about it. Every time one of those is posted here, I let OP know that there's a sub for that (if it's a quirk) and they thank me because they didn't know about it",
            "One word: Karma",
            "Lets make a pact fellas, next time somebody asks a DAE type just answer in \"yes\" and \"no\". No lengthy stories.",
            "Does anybody else wonder why this sub has and allows so many \"Does anybody else\" posts even though there is a distinct subreddit for those questions(/r/,DoesAnybodyElse)?",
            "Guess it's easy for those to be upvoted.",
            "Karma.",
            "Because they’re apparently not stupid questions /s\n\nBut for real, it’s because they’re meant to be more so conversation starters than actual questions; they’re rhetorical. The OP isn’t looking for yes/no answers, they want people to say “OMG me too, I thought I was the only one. One time when I blah blah blah.”",
            "DAE Give a flying fuck?",
            "I personally think r/DAE is a better Sub.",
            "Because they get points.",
            "Mainly because you don’t know what you don’t know. I found this sub by chance and I’m sure for many it was the same, so I don’t think people are aware of other subreddits. They think this is the best place to post that stuff and don’t even bother looking another subreddit.",
            "Do n E 1 else think that DAE questions are dumb? I sure as hell do. Like, no motherfucker, this very common thing is something only you do.",
            "Does anyone else think this guy is right?",
            "Is it less popular than this one? Maybe it’s so they get heard more",
            "Because nobody responds there and far fewer people go there.",
            "I contacted the mods once because I had the same question, they just said it didn’t violate the rules",
            "Oh, I just posted a question here two weeks ago that started with \"Does anybody else\" but I didn't know that such a sub existed. Thank you for this information!",
            "I agree, but I think people don’t know about the DAE subs. I had someone suggest it to me when I asked a question like that on a different question sub, and since then I’ve been using it. But it’s probable that people just haven’t heard of it",
            "It sounds like you're under the impression that every post on reddit belongs in one subreddit and one subreddit only.  That simply isn't true.  There's a lot of overlap to be had between every sub.",
            "YES, just look at the top posts of this week. So many questions that should've been posted in /r/DoesAnybodyElse",
            "I’ve had this exact question sitting in my drafts for almost a month. I’m sick of it too. If I wanted to see DAE questions I would go to the subreddit dedicated to them.\nPlenty of other subreddits have banned specific content because there are other subreddits that cater to that exact kind of content. It’s not unheard of to do that. I wish they would do that here.",
            "Does anyone else get annoyed by DAE questions on this sub?",
            "It's always something so obviously done by almost everyone. \"Does anyone else hate going to bed with dirty feet?\"",
            "This sub is meant to be more open and accessible - an easy place to ask questions.\n\nMost other subreddits have a strict set of rules which can yeild more constantly good and varied content, but also make it difficult to post in, especially if you're new.\n\nThis sub isn't meant to produce a feed of well curated questions, it's meant to be a place where someone can actually post a question without worrying if they're in the right sub. So a few too many DAE questions isn't really a problem.",
            "Dos anyone else not know this?",
            "Apparently most of the community likes these posts because there is no other way they get upvoted to the top. That's how it should be. The community should decide what content is pushed in a sub to as large a degree as possible.",
            "Did not know that existed",
            "Technically they’re stupid questions because they could go to the DAE sub but don’t.",
            "Because people post in subs based on their popularity of attention, not any thing else. People arn't interested in a topic unless it garners attention.",
            "Truly...\nLiterally everyone else.",
            "I honestly had no idea that sub existed, so if I were to want to ask a DAE question I'd probably turn to a community that I'd seen questions like that on before",
            "I feel that this subreddit collects a lot of people with anxiety, and DAE questions are amoung some of the questions that a lot of people wonder. There's definitely a lot of subs that seem to attract more anxious people than others. Probably because the subreddit promises not to judge people based on what they ask. I personally never even knew that r/DoesAnybodyElse existed until this post. I may be wrong in my assumption that whatever you ask here won't be judged as a stupid question. Even if there is a better fit for questions elsewhere, it shouldn't matter that they're being asked here, per the nature of this subreddit.",
            "Does anybody else not follow rules when posting on subreddits? asking for a friend",
            "I'm on the edge of leaving this sub because of the vast amount of DAE questions. There's a reason I'm not subbed to r/doesanyoneelse\n\n&#x200B;\n\nThis sub has become very r/askreddit with the obvious karma farmers. I like the genuine and odd questions that get asked here but they're becoming lost and don't make it to the front page anymore because this sub is becoming less and less a question and answer sub, it's just a \"relatable\" sub now.\n\n&#x200B;\n\nYes, you could sort by \"new\" and have a better chance to see more genuine questions but it's frustrating to have to do that when this could all be solved by one pinned post or just one added rule. I mean this post has 7k upvotes, when I messaged the mods about this last week I was told that it's one of the most common complaints.. why isn't anything being done?",
            "Because they are questions. And on this sub no question is bad.",
            "this is really funny that this got so many upvotes because i posted the same damn thing a few months ago and everyone got pissed at me",
            "Shit.. this question is a rewording of a question asked a few days ago. Does anybody else think some people just jack other peoples questions because they really wanna pump up their karma?",
            "Apparently when you say \"No stupid questions\" you actually mean \"some questions are definitely stupid\".",
            "Does anyone else also hate r/unpopularopinion because it's usually full of common opinions?",
            "I'm just going to start down voting these, if enough of us do it they're learn",
            "There are no questions more stupid than the ones that start with \"Does anyone else...?\"",
            "Did you haphazardly post a DAE not like DAE post.....",
            "Did anybody else get his point? ;)",
            "Or even the alternative r/amitheonlyone",
            "Is the way in which the question is asked really matter?",
            "I didn't know about it\n\nAlso this subs name implies anything is okay",
            "People are terrible and reddit is full of children.",
            "Because they give tons of karma, \n\n-someone who has posted one just for the karma",
            "It's the way that subs go when they get too large. Without heavy moderation, when subs cross a certain threshold of popularity the quality suffers in favor of lowest common denominator. Once people find out how to karma whore on a sub by tailoring the post in such a way that it's guaranteed the most upvotes for the lowest amount of effort, people abuse the fuck out of that. \n\nThe ONLY large sub I can think of whose quality hasn't suffered is /r/AskHistorians and only because they have a heavy handed mod team. They'll even ban you if your username is offensive.",
            "Who gives a shit?",
            "Pretty simple, lazy mods.",
            "Does anybody else just discovered this sub reddit? Haha!",
            "I think it's because the DAE sub kind of died and this one has more activity.",
            "Do you know what the title of *this* sub is?",
            "Because some posts can fit in several subreddit.",
            "Answer\n\nCause mods gay",
            "Who is real",
            "Is it not because they all go straight to hot cos everyone upvoted them. I'm sure there are much more proper questions sorting by new",
            "Iv never seen that thread on the homepage but always see this page. Maybe people just don't know about it. 🤔",
            "You should've started this post with \"does anybody else\"",
            "Have you considered the possibility that they might not know that sub exists?",
            "Can’t call it r/nostupidquestions and then ban certain types of questions..",
            "I'd knock it for the quality of the questions for sure but not the format. DAE's can be a subset of stupid questions; it'd be like asking \"Why are there so many baseball posts in r/sports when there's a distinct subreddit for baseball (r/baseball)?\"",
            "Thank you!",
            "daenerys targaryen also fuck dnd",
            "I dunno\nAlthough I understand the criticism here, on the other hand, those \"does anybody else\" questions fit quite well into the no stupid questions category.",
            "r/amitheonlyone too (not as big)",
            "I dont like them too but with the name of the sub, we cant really do something about that right? Maybe a flair for those?",
            "I don’t get why it’s even a rule if mods never planned to enforce it. \n\nI’m indifferent but I don’t make the rules of this sub so it’s like, mods wtf?",
            "May be they don't know that subreddit even exists. It's not so popular...",
            "If your question starts with DAE the answer is most likely yes everyone does.",
            "Because people like karma even though it has no real value.",
            "I guess we dont judge here",
            "YES THANK YOU HOLY SHIT, one of my posts has been removed here before for asking one of those questions.",
            "Mods love upvotes and sub popularity yum yum",
            "DAE dislike when people ask DAE questions?",
            "The only answer i have is... It’s no stupid questions",
            "I just downvote questions that don't belong, and move on.",
            "I didn’t know that!! Thanks man!",
            "How did I not know about that subreddit?! You're a beautiful human being. And you make a good point",
            "I'm pretty sure it's against the rules but they don't get taken down for some reason.",
            "Does anyone else hate those posts?",
            "Does anybody else not care?",
            "Along with \"Am I the only one who ______\" insert quirky yet relatable trait that makes everyone who upvotes feel unique and special about themselves.",
            "I was wondering if anyone else wondered this.",
            "Am I the only one who thought DAE is Department of Atomic Energy? Never occurred to me it also means \"Does Anybody Else\"",
            "I am guilty of posting a question like that but it belongs here I'm pretty sure",
            "And some people are dicks when you ask a stupid question too",
            "Didn't know it existed",
            "At least some of them I like to believe to be genuine. There's a lot of things that we do that we take for granted that we don't know is normal, especially if it's pointed out by a friend that does it differently and makes us self conscious about it. Asking is it's normal is a way to get validation and deal with that self conscious feeling. The answer might always be \"Yes, other people do it too\" but even if logically you can assume that, you don't *know* it for sure, that little bit of illogical doubt in the back of your mind that maybe there's a chance there isn't.\n\nThe frequency of them being so highly voted is bothersome though.",
            "does anybody else think this?",
            "I’m sick of those questions in general. Whenever I read one of those posts all I can think is “no, you are the only person on this entire planet that does that. Congrats.”",
            "I have not heard of the subreddit until now.",
            "This isn’t a rant page sir and or madam",
            "Yeah this is a problem. I didn't even know that sub existed. So that's why I always ask DAE questions in r/tooafraidtoask. Not here though. This is sub is usually for the \"Can I die if I drink old wine\" type of silly questions that can be googled in an instant",
            "This is the only sub I know where I can ask a question and expect a genuine answer without being judged on sone stupid semantics like forgetting a question mark. Don’t take it away.",
            "Why are there so many stupid questions on this sub that is specifically named in such a way that bans them?",
            "Not that I ever have, but I totally would because I had no idea that other sub existed",
            "I think, DAE sub exists just because humans want to feel relatable to things/people. And everybody connects to it. I see so many DAE posts on my feed all the time and its annoying sometimes.",
            "Been fighting this for a while!   \n\nhttps://www.reddit.com/r/NoStupidQuestions/comments/b0mmkb/meta_can_we_ban_does_anyone_else_type_questions   \n\n\n\nKeep the pressure up and hopefully things will change.",
            "I prefer questions that r not googleable.\n\nPpl asking - DAE feel like they r falling in a dream? Is this normal.\n\nBruh, google that shit. U will get a much better explanation for those.. than asking here, where ppl will just say - yeah me too, haha.\n\nKarma farm smh..",
            "Because this sub is for anyone to ask questions without being judged on how stupid that question is",
            "For the same reason that you’re allowed to post this question here despite there being a different subreddit called r/Questions that you could have posted in. If a post is relevant to a subreddit’s name, nobody is going to filter it according to your particular preferences.",
            "Because it's a question and we don't discriminate against questions!",
            "I mean i get that you should use the right sub for the right question, but this one is called no stupid questions so isn't this really the place?\n\nMaybe I'm missing something or I'm just a bit too new to reddit but I'd have thought the people on this sub would be a bit more understanding/accommodating of stupid questions, correct sub or not"
        ]
    },
    {
        "post_id": "9kwlur",
        "author": "None",
        "title": "Will people call the 2020's \"the 20's\"? Or is that only reserved for the 1920's? I really think we need to discuss this.",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/9kwlur/will_people_call_the_2020s_the_20s_or_is_that/",
        "score": 13705,
        "num_comments": 1068,
        "created_utc": 1538529403.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/9kwlur/will_people_call_the_2020s_the_20s_or_is_that/",
        "comments": [
            "It will likely become the twenties and the 1920s will become the 1920s.",
            "[deleted]",
            "I dont even know what we're calling this one right now",
            "I haven't known what to call anything since the 90s.  ",
            "Whatever we call the decade (almost certainly the twenties,) expect a lot of stupid \"2020 Vision\" and \"2020 Hindsight\" references starting about a year from now.",
            "Did people of the 1920s call 1820s the 20s?🤔🤔",
            "I always thought we called the 1920’s the “Nineteen-Dicketies” because the Kaiser had stolen the word for twenty.",
            "We will finally have a decade with a name!!!! \nBeen waiting since 1999 for this!",
            "1920s were the roaring 20s. 2020s will be the boring 20s.",
            "'20s\n\n(Note the apostrophe placement)",
            "\"2020s\" has a nice alliteration to it. I could see people calling it that",
            "I think we’ll start calling it the 1920s and eventually in 100 years start calling it the 1990s so we can refer to the more recent 90s more easily",
            "I can't believe the guys who invented the date did not forsee this problem. ",
            "This is disturbing me a lot. I always think about it.",
            "I think about this about twice a week",
            "I wonder if people have been asking this question every 100 years for the the past few millennia. ",
            "wow this question makes me feel old",
            "I think it will become \"the twenties\" by the 2040s or so, when people can no longer call it \"this decade\" or \"last decade\". Before that point, there really isn't much need to come up with a specific name for it.  And I'm pretty sure that people used to call the 1890s \"the nineties\", before they decided to re-use that term for the 1990s. So the same thing will probably happen again.",
            "If you call it the 1920s today \"the 20s\", you probably still will for the rest of your life. But our generations kids or grand kids will mean 2020s when they say it. \n\nWhat's weird to think is that our for generations grand kids, the 90s is going to be some futuristic sounding thing instead of the retro vibe it is for us. Just like the year 2000 was for us (if you're old enough that is!)",
            "Wasn’t it technically the “roaring” 20’s? ",
            "Idk just say like 2020 like the vision thing roles off the tongue ",
            "I feel like we still haven't decided what we're calling any period after the 90's yet. At least I'm not really sure what I'd call the last nearly 20 years. ",
            "The roaring 20s. It will probably be more like the Great Depression.",
            "This is actually something I was thinking about earlier. I feel like we’ll end up having to call every decade now by the beginning year, ex: 2020s or 2030s, not the 20s or 30s. But that’s just a theory ",
            "Addendum: Why haven't we worked out a definitive term for the decades before the 1920s? I feel like that would give us a much needed framework to apply to our own recent 18 years. I really feel like those decades will need explaining, so we might want to settle on a term right now.",
            "I think we will say the “20/20’s (twenty-twenty’s). That’s what I’ll say anyway....",
            "We’re in The Teens right now. It’s weird. ",
            "I think I was reading a Lovecraft story, and he referred to the 80s. He was talking about 1880. \n\nI think this is a cyclical thing.",
            "00's = aughts\n\n20's = twenties\n\n\nSo I propose we combine the two and call them **The Twaughts**.",
            "Maybe we should wait until the 2030’s before we decide. After all, hindsight is...\n\nI’ll see myself out.",
            "[deleted]",
            "Do people ask this question every century? ",
            "Go ask people what they did last time we had this problem ;)  lol jks.  Pretty sure though that context will help. Like of we mention how slow the internet was in the 20s we will know it was the 2020s we are talking about. A question about the new invention of the automobile will be a 1920s issue..",
            "Similar to how 1820s are referred to as 1820s and 1920s are referred to as the 20s now.\n\nThe 1920s will be referred to as the 1920s while the 2020s will be referred to as the 20s in a couple of decades.\n\nI think people just use it to refer to the most recent one. Once we’re a little bit past it.",
            "reddit in 1918: \"will people call the 1920's \"the 20's\" or is that reserved for the 1820's?",
            "We will call them the the \"20's\" and the 1920's \"the 1920's\" just like how we don't call the 1820's \"the 20's\", we call them the \"1820's\".",
            "Context clues",
            "They'll call it the 20s, but to be honest we haven't been that far into modern history to where we call things the 90s 80s 20s to really have to worry about that yet. I feel like that's going to be more of an issue if we make it to 2500 as a race.\n\n But I always found it interesting that we don't refer to the 2000s as the 00s but as the 2000s. I guess it's harder to say like you would just say the o o 's  or the zero zeros ... Or the thousands... when I think about... it but which thousands?? ",
            "In 2020, wouldn't we just call 2020 \"now\"",
            "We should separate them into the \"ol' twenties\" and \"nu' twenties\" ",
            "Ones the roaring 20s and ones the boring 20s",
            "**Apostrophes and plural forms**\n\n\nThe general rule is that you should **not** use an apostrophe to form the plurals of nouns, abbreviations, or dates made up of numbers: instead, just add \"-s\". For example:\n\n\n- MP MPs (e.g. Local MPs are divided on this issue.)\n\n- 1990 1990s (e.g. The situation was different in the 1990s.)\n\n\nIt's very important to remember this grammatical rule.\n\n\nThere is *one* case in which it is acceptable to use an apostrophe to form a plural, purely for the sake of clarity:\n\n\nYou can use an apostrophe to show the plurals of *single* letters or *single* numbers:\n\n- I've dotted the i's and crossed the t's.\n- Find all the p's in appear.\n- Find all the number 7’s.\n\nThese are the **only** cases in which it is generally considered acceptable to use an apostrophe to form plurals: remember that an apostrophe should **never** be used to form the plural of ordinary nouns, names, abbreviations, or numerical dates.\n\n",
            "They will be the twenty twenties until I die, because the twenties are when my grandma was a flapper.  Thenceforth they may become the 20's but flappers will have lived in the 19 20's. ",
            "It'll be the Dank 20s because weed will finally be legalized nationwide.",
            "Zapp: Then this chase is over. Kif, set course for the nearest XM repair facility. Meanwhile, we shall sing top hits from the '80s.\n\nKif: Which '80s, sir?\n\nZapp: For me, there are only one '80s. Smell like I sound. I'm lost and I'm found. And I'm hungry like the wolf.",
            "The Twaught Twaughts. ",
            "I'm aggregating what I've seen here, and doing a bit of googling, the only years we reference with such simple shorthand as \"the 20s\" are within 100 years. This is likely simply because they are distant enough to have gone through the filter as a whole, roughly 5-10 years minimum, and gained a certain personality. Much like how the 20s are mostly thought of as a big party after The Great War, and the 30s can be considered loosely as a hangover after the party, at least in allied countries. We can assign these attributes through the lens of history with the help of those that lived then, which conveniently leads me to my next point, which is human life span.\n\nThe 100 year limitation on these familiar terms, while likely a point of convenience so we literally don't have to ask \"which one\", is also where our actual, living familiarity ends, and the dust seems to mostly settle, historically and archeologically speaking. We have a fairly firm idea of their personality, and the interpretation can't much be altered by eyewitness accounts or publishings from those who lived then, as the vast, VAST majority of them have died or been rendered inert by age. Minor revelations can be made, but after the ~100 years of familiarity pass, we start calling them by their full year number. \n\nThis is just me aggregating the impressions and information I have and throwing in my two cents, so obviously don't give anything I've said too much credit, but I found the subject an interesting thought",
            "I think people from the 2020 generation will be called the visionaries.",
            "It will become the roaring 20s, the good old days before Gov controlled all porn",
            "According to Excel spreadsheet, it's gonna be generation AA",
            "My grandmother who is now 92 told me when she was a little girl, her Nan used to refer to the 1880's as 'the 80's'...",
            "I've heard the phrase \"New Twenties\" being thrown around before.",
            "I have wondered this for years now! 😂 glad I’m not the only one!",
            "44.95 squared!",
            "This is a valid question... ",
            "Twenty deuce ?",
            "In Downton Abby, the Dowager Countess recalls a party in Russia back in the '80's.  ",
            "We could call it the two twenties.",
            "I'm already referring to it as the 20s.",
            "Idk dude but I can’t wait for those 2020 glasses",
            "We should call it the tutu's",
            "I could see the term \"The New 20's\" catching on.  The Roaring 20's but for the 2020's",
            "Fascinating ",
            "Probably \"The 20's Part II: Electric Roaring Bungaloo\"",
            "Whatever we decide, I just hope the 2020’s bring us more reboots and superhero movies. They’re great. ",
            "As long as it's not called the Nuclear Winter 20's at this point I'm cool with whatever",
            "Related: one of my teachers calls 2000-2009 the noughties which I reliably chuckle at for some reason. ",
            "This thread makes me sad.\n\nIt's '20s, not 20's.",
            "[We should bring back flappers and the Charleston. Then we can still call it the 20s.](https://www.youtube.com/watch?v=7neA1I9K71c)",
            "Guess I'll call it the \"old 20s\"",
            "Dunno, I don't have 2020 vision",
            "To me they will always be the 20s.\n\nUnless we reach the two century age.. it will always be the 20s, 30s, 40s, etc\n\nAt least my two cents",
            "In 1918 someone asked this exact question because it was an 1800s thing.\n\n1920s were the roaring 20s. I expect ours to be the whimpering 20s.",
            "I'm sure looking back in hindsight it'll be 2020",
            "I hope we just call it the 20s. Makes it so much easier, I really hate that here in the UK you have people calling the previous decade the naughties. \n\nWhy can’t it be the 2000s, then the 10s and then the 20s. ",
            "The double 10s",
            "It’s all fun and games till the flexpipe falls off the truck. Some innocent driver is going to hit it and cause a huge crash. ",
            "Of course they will. What else would they be called? ",
            "I would like to think that we are advanced enough as a species to just call them the twenty twenties and make constant jokes about how everything is looking good.",
            "I’m callin it the 20’s that’s all I know",
            "How is \" the 420's\" not top comment yet?",
            "They'll call it 2020. ",
            "It will be called the 20s ",
            "Yea lets get this sorted ASAP",
            "as long as we bring back jazz idc",
            "Given how nostalgic everyone is about everything today, I'm sure they'll be called the 20s as well, as a direct callback to the 1920s too. ",
            "‘20’s squared is the obvious answer here",
            "Are we calling these the tens or 2000-2009 the Ots?\n\n[not saying this sarcastically, I just had to ask this to myself too lol]",
            "Probably end up calling it the \"New 20's\" or something like that. \n\nOf course, once we're in the 30's, it's not like a lot of people will be talking about the 1920's or the 1820's...",
            "I already think it's weird that people are calling 2000-2010 the 00's. And I'm only 22, I'm scared.",
            "Here we go again, 1820s are still pissed from losing their title.\n",
            "The \"new\" 20's",
            "Are we not going to take advanatage of being able to call them the 20 twin twins?",
            "the twent twents",
            "We should call it The Gay '20s.",
            "asking the real questions",
            "I'm sure the 1820s were also called the 20s once upon a time",
            "The 1920's will be the Roaring 20's which is what it is already called occasionally. The 2020's will be called the Whoring 20's. ",
            "I mean what happened to the 1820s? They became the “1820s” it’ll just become the “1920s”",
            "Do we call it the teens now?\n\nDoes anyone call last decade the “oughts”?",
            "Do you think of the 1820s when people say the 20s now?",
            "damn this is insane, I had this as a shower thought yesterday! ",
            "They will call it The Greatest Recession if we don't do something about this huge bubble of a housing market.",
            "It will be the depressing 20’s. ",
            "Only after, as we're experiencing it'll be the \"oh my god it's all so shit please make it stop's\"",
            "More importantly are we going to refer to the 2010s as “the tens”?",
            "I'm sure we could called it the 2020s.  Sounds cool.",
            "don't forget the 1520's too guys",
            "Technically there's two 90s. \n\nI think saying \"the twenty twenties\" will be too fun to pass up.",
            "We should have a roaring 1920's dress up party in 2020.",
            "Well what happened when it hit 1920 and there where people asking this same question about 1820",
            "I get the feeling after we hit the year 3000 the 1900s will be the same as the 1800s is now, and years like the 2020s and 2080s will just be called the 20s and 80s respectively.",
            "it will be the 20s. soon people will refer to all last century stuff by 19.\n\n\n20s 30s etc will mean 2020, 2030... \n\n1920, 1930 etc.",
            "I don't have an answer, but I vote that we just call the 1920's what the people in the 1920's called the 1820's. "
        ]
    },
    {
        "post_id": "ud2ijh",
        "author": "mrmonster459",
        "title": "As a kid, I used to hear \"If you think teachers suck, just wait till you have a boss\" all the time. I'm 25 and never had a boss who'd even make my top 5 worst middle/high school teachers. Have I been lucky, or is that expression a load of bs?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ud2ijh/as_a_kid_i_used_to_hear_if_you_think_teachers/",
        "score": 13699,
        "num_comments": 1159,
        "created_utc": 1651062865.0,
        "selftext": "I'm 25, been working since I was 19, and yet despite hearing that phrase repeatedly during my school years, I've never had a boss who would even come close to being as bad as my worst middle and high school teachers.\n\nWhat gives? Have I just been very lucky, or is that phrase part of the \"Lies adults tell kids\" club?",
        "permalink": "/r/NoStupidQuestions/comments/ud2ijh/as_a_kid_i_used_to_hear_if_you_think_teachers/",
        "comments": [
            "[deleted]",
            "I've had good bosses and I've had bad ones.\n\nThe good ones just leave me alone and trust me to do my job, and in return I improve myself make it so that I can be relied on. \n\nThe bad ones yelled at me, micromanaged me, tried to make themselves lord of my schedule, and set me up to fail so that they can look good.\n\nI know this doesn't directly answer your question, just telling you it's going to be a mixed bag.",
            "Idk my teachers were largely fine and yet my bosses have been quite shit.",
            "The real sucky people are the adults who used a false equivalence to imply that you should expect and accept that those who have power over you get to abuse you.",
            "Yeah, this is another one of those tropes that teachers give you. The next level, whatever that is, will be soooo much harder, so you'd better stop complaining because you have it easy now.\n\nBoth teachers and bosses can be shitty. And maybe a shitty teacher is worse because it's an adult being awful to a child who has no choice about being there.",
            "You have one boss, you had 15 teachers each year.   \n\n\nYour worst teacher was probably worse than your boss.   \nYour best teacher was probably better than your boss.",
            "“If you think I’m bad, just wait” is used almost exclusively by terrible and usually abusive people.",
            "I had a boss that was manipulative, gaslight (gaslit?), and a narcissist. It was pretty bad. Never had a teacher like that. But I've also had bosses better than some of my teachers. Really, just like anything else, there's always shitty people out there.",
            "[deleted]",
            "If you have a bad boss, at least you can quit.",
            "Kinda depends on what type of work you do.  If your job is pointless and easily replaceable, your boss probably sucks.",
            "You are blessed.  I am 50 -and I have had my share of asshole bosses.  From the \"I am a manager\" attitude, to the ones that are threatened because you are more talented than them.  What it has taught me is that bad bosses are only temporary - and if you ride it out, they will be gone.  Same thing goes with bad teachers - pacify them to get you thru the school year.  It is temporary........ learn from it to help you be better suited in the real world.",
            "The power differences and differences in maturity make those two kinds of relationships drastically different. Those two roles also have very different responsibilities and expectations for your own conduct. Teachers just like saying things to make you obey, eg permanent record, you'll need cursive, college will be worse, in reality this is a person trying to have authority over a group of children, and that the personality they have will drastically shape how they accomplish this. I've had several teachers that I would even call friends, and others that I could say very unkind things about. The expression is indeed, bs.",
            "I've had bosses that were straight up verbally abusive, I've had bosses so incompetent I've had to do their job, I've had bosses try to assault me. I think you've been pretty lucky.",
            "Bosses can fire you, teachers can't. If you need the job, that can be a problem. \n\nAlso, kids can go through their parents to potentially get a teacher fired if they're unhappy with the teacher. You can't do that so much with bosses. Yeah, there's some recourse for workers, but it seems like it's simpler with teachers.\n\nI've had good bosses and bad bosses and good teachers and bad teachers, but it's usually been easier to deal with a bad teacher than a bad boss.",
            "My teachers were always cool. I’ve had bosses who are giant douchebags. I’d say give it some time lol",
            "Yeah, children talking about their struggles and people who are mistreating them are often underemphasized or treated like they're exaggerating or not important. Person listening might be thinking \"well my school year sucked but not that much so they're exaggerating\"",
            "It really depends. For some context as an older person, both bosses and teachers used to be far worse. My teachers straight up abused and bullied kids, stuff which would *never* be allowed nowadays in most areas. \n\nSimilarly, bosses used to be allowed to do all kinds of fucked up shit to employees, half of the time it was barely even legal but they did it anyways. I had one boss when I worked at a bar who was much, much more scary than any teacher I ever had in terms of verbal intimidation. I had another boss who ran a place like a factory overseer and overworked his employees constantly and would threaten to fire them for the slightest things. I had another boss who slept with all of his female employees, presumably a quid pro quo situation with them. Basic corruption and abuse like that used to be very, very commonplace with workplaces, and now is not anywhere near as common. By and large, people follow the rules, with a few exceptions. \n\nIts possible your teachers grew up that era and that is what they are thinking.",
            "Adults keep telling children that school is so much better than adult life, having a job and so on.\n\nWhat you mentioned is part of that.\n\nI strongly disagree. Teachers might or might not be better or worse than some bosses, YMMV, but the situation is completely different. Usually a teacher has much more power over you, and a larger possible impact on your future.",
            "I’ve had a shitty boss before. Micromanaged the fk out of me. We butted heads so much and he didn’t have empathy or manners. Definitely way worse than having a shitty teacher. You don’t need to spend all 8 hours w/ your teacher.",
            "You're fucking lucky.\n\nMy teachers were nice people.\n\nCollege professors were a mixed bag, some were nice, others didnt give a fuck because tenure.",
            "No, it just shows how shitty high school is.",
            "You’re lucky. All my bosses but one have been way worse than any teacher.",
            "I've not had bosses worse than teachers but I have easily had five Co-workers worse than any teacher I ever had by FAR.",
            "You were unlucky with teachers but lucky with bosses. Not all bosses are terrible and not even the majority, or the world wouldn't function really. But they aren't uncommon either and if you have had more than 4 or 5 jobs I'd be surprised that you haven't encountered a bad boss yet. \n\n.\n\nBit off topic, but this reminded me of my early teachers telling us how we would need cursive for all our English assignments and papers in the future and all through HS and college and such. Except by the time I hit 4th grade, that was the last year they taught cursive to the younger kids (learn it in 2nd grade here) and then they stopped requiring it for assignments or anything. I never needed it once in HS - although it has caused a few issues at times in my adult life since I can hardly read it and can't write it at all cept for my name.",
            "I worked at a restaurant for a little while and the boss was awful. I quit but ended up working there again about 6 months later and the new boss was an absolute legend. So in my experience it doesn’t even depend on the industry or place, it just depends on the person.",
            "sounds like an excuse teachers may have used to continue being shitty. \n\nand before i get roasted, teachers and educators should be paid better but there definitely bad teachers who do not belong in schools teaching youth.",
            "Anyone saying, \"Yeah i'm a piece of shit, but there are worse people!\" Are fully aware that they're a piece of shit and use it as an excuse to continue the behavior. \n\nBut on the other hand you are also decently lucky for having decent bosses. Bit of column A, bit of column B.",
            "I was blessed with (mostly) good teachers and good bosses.\n\nBut I'd much rather deal with a teacher than a boss at a manufacturing facility. If I f-ed up my school work, the only one I hurt was myself. If I f-ed up my work when I worked in manufacturing, I'd hurt myself plus my co-workers,  my boss and employer, and potentially even the ultimate customer of the product.",
            "That or maybe by lowering your expectations of bosses, they've passed with flying colours. But in general teachers are more strict with absolute authority while bosses know that employees have a general idea of what is legal and what isn't.",
            "35 here and I've been working since I was 14.\n\nI can't remember any really bad bosses I've had.  I can think of several bad teachers/professors",
            "Idk, I’ve had bosses that treat me like a child.",
            "like in elementary when the teachers are like, you think this is tough, wait till your in highschool",
            "All lies.  If a boss treated me half as badly as some teachers did I'd be quitting on the spot.",
            "Ultimately, a boss needs his workers and will try and cater to them within reason. A teacher doesn’t need their students and generally doesn’t value their input because they’re just kids.",
            "I don’t recall mean or rude teachers but I do recall teachers who play favorites and that’s in the real world too (jobs).",
            "It was total BS, up there with threats of being things on your permanent record and classroom group projects being good practice for working with people in the workplace. \n\nAlso for many (most?) professions, school hours + homework > regular work hours, so for me that one has been bullshit too. (RIP medical workers though)",
            "I too have had really great bosses and I dropped out of high school so I think that says a lot about the education system.  \n\n\nWhen I went back to school to get my degree, I had amazing teachers there tho.",
            "You've been lucky as an adult. When you're a boss with employees you have legitimate power over people with consequences like their livelihood that you are in control of. There are a lot of people who power trip with that power. In school there isn't much \"actual\" power a teacher has over a student besides sending them home, which is usually something they want anyways.",
            "I've never had a co-worker or boss call me a nickname, but I sure had teachers who argued with me that it my name was jizzy, not jizzlevania. \n   \nIt's sounds like adults around you were minimizing your experience to excuse shitty behavior. Anytime I heard the comparison between school and work, it was how school work was easier adult work. No recess, sometimes still have homework...",
            "Case by case. Extra downsides in the case of teachers is that they’re an adult and you’re a child so it is even more cruel as children don’t understand why some people are just assholes. As well as the fact that you have less choice when it comes to a shitty teacher. You can get stuck with that class and not have much say as a kid. As an adult you have the option to quit your job and find a new one though it can be a hassle.",
            "My manager at my first job was awful. She only scheduled my coworker for one day a week, 2 hour shift, because that was the minimum required and she was trying to get him to quit. Why was she trying to get him to quit? Because she didn't like him, but had no actual reason to fire him.",
            "I think that's a bit lucky tbh. Sure a bad teacher can mess with your future prospects, but a bad boss can put your life in danger or steal from you and a boss can have more control over u than any individual teacher.",
            "Uh, you're lucky as fuck.  Shit, I've had bosses that I could have easily landed in _prison_ if I hadn't been so afraid of them",
            "Both teachers and bosses can be absolute shit. Equally possible.",
            "Everything they told you is wrong about everything.\n\nEmbrace the world with your own perspective because the people who raised you are obviously incorrect about everything.",
            "I would say teachers exercise more direct control of you than bosses do. There is a more nuanced dynamic between a boss and employee but the power a teacher wields is (or at least seems to a child) more absolute.",
            "I never knew what to believe when I was in school. I had the now memed situation throughout high school of our teachers telling us “things will be harder in university.” Or “university professors won’t put up with this.” Meanwhile I had university professors sending emails at 1am to cancel class because “it’s supposed to be a nice day, go outside and get some sun.” Lol. I think it’s a combination of teachers exaggerating  and you just being older and being able to cope with more bs than maybe you realize.",
            "I'd say OP has probably been lucky, BUT that the suffering that comes with a bad boss is usually worse than with a teacher because usually you have that teacher for just one year, whereas you can be stuck with a lame boss for a lot longer.",
            "If that expression came from teachers, it's probably because they were dealing with their own administrators, and it's pretty much a given that school administrators are just awful.",
            "Teachers are bosses. They are the same. The only difference is that you have like 15 teachers per year (some may repeat the next, some are new though). While you only have one boss per job. \n\nIf youre lucky you get the chill teacher, who instead became a boss. If youre unlucky you get the asshole teacher who instead became a boss. At school you have so many teachers that they are bound to have all kinds of them as teachers. \n\nThe only real difference is that teachers have to stay in limits bc your parents may complain, but bosses can do wht they want, bc you need food, which means you need money, which means you dont wanna lose the job by complaining about your boss to anyone where it has meaning to complain. Which makes bosses tend to be a little worse. Not a lot tho",
            "People love to devalue negative feelings of kids. Also a common phrase is „you’re to young to be that broken“ like world is always and constantly shiny as long you’re under 18. 🤷‍♀️\n\nDunno what those people are thinking. It’s definitely possible that your toughest years are before you get adult.",
            "You're lucky. I had a few bad teachers, but they never ver asked me to do something illegal or not pay me my salary. I had about 10 rotten bosses, and go so fed up with them I started my own business.",
            "People like to exaggerate.",
            "I've had good teachers and bad teachers, good bosses and bad bosses.\n\nThe main difference is when I had a bad boss, I could quit. No such luck with a bad public school teacher.",
            "You've been lucky",
            "I have had some horrible bosses",
            "You’ve been lucky",
            "I'd say you're lucky, I literally had to quit my last job because my boss was harrasing me",
            "Who knows, we never hear about the ok or good boss but there are multiple subreddits for shitty bosses, we don't have all the data and never will.\n\nFor me I've never had a bad boss, most were normal people just making sure shit doesn't happen, plus I kept my head down and did no more no less.",
            "Bro tell me bout ur teachers",
            "You've been extremely lucky.",
            "Y'all are acting like teachers can't be abusive in a way that profoundly messes with you. I had a disgusting amount of teachers that hit on me when I was underage. And I'm not even one of the ones who was sexually assaulted. I'm not saying bosses don't do that but don't dismiss the childhood experiences of people because you think your bosses have been worse.",
            "My grade 7 teacher was this ancient Chinese lady who was more of a drill sergeant than a teacher. My favourite memory is this one time, actually quick backstory when she logged into the school computer her login was the first letter of her first name, first letter of her middle name, and then her last name. This spelled Atchoo. Well once my friend had a cold and kept sneezing and we were teasing him and fake sneezing and she came over and yelled (in an old chinese lady accent) ARE YOU MAKING FUN OF ME!!?????? As she thought we were making fun of her login name. Another time she made me call my mom on the school phone in front of the whole class and tell on myself for disrupting class. My mom was like um okay? I remember on the first day of school she lectured us on the appropriate way to write our names and date on each paper like in a specific way and place and for the entire year you would lose marks if you didn’t have like a right side underlined name or whatever it was. Man good times",
            "If a boss hates you he fires you or you quit. When a teacher hates you your chance of going to college hangs in the balance. \n\nI had a teacher who routinely lost my and another student's assignments. We started taking pictures of us turning them into the tray. Suddenly no more missing assignments.",
            "I completely agree with you- got my first job at 15, am now close to 30. I have never had a boss worse than my worst 5 high school teachers. I have worked at swim pools, in education systems, in fast food, calling people on behalf of different fund-raisers, office environments and university admin. I have had bosses who were either lazy, or at least a little incompetent- but never any that were absolutely shit at their jobs or that I regretted working for. I have had teachers yell at me, impose arbitrary punishments for stupid things (I once got a detention because my notes made it look like I wasn't enjoying the class. I wasn't- bit I was getting great grades). I have had a teach explain to my mum that, \"I would like to say that there is an animosity between us, but I think it is more that your son often looks bored in my class and I really don't like that\". \n\nI will also say I don't think I ever had a single teacher that was better than any of my best 3 bosses for day to day working. I may not always be this lucky, but almost 15 years into working amdnI completely agree- my average boss is way better than my average teacher, my worst boss is still way better than my worst teachers, and my best teachers wouldn't even make my top 3 bosses. Luckily school is much shorter than the average career, and I get to spend more time working with the better end of things.",
            "I hate when grown ups do that to kids. \"HAHA u little spoiled brat wait until you grow up and life will be a complete hell to you!!11\"              \n\nUsually comes from grown ups that hate their own life.",
            "I've never had a boss try to groom me before. Some were creeps but not like my old English teacher.",
            "I had two bosses that would make that list, but one of them was Sir Jeffey Beez himself so I think that's an unfair comparison😅. That expression is mostly bullshit, though, I feel.",
            "Teachers can be incredibly controlling, and some of them are on a power high",
            "While there’s certainly plenty of really bad bosses out there, I think a lot of it has do with peoples work ethic or lack there of.  \n\nSo many people only want to do the bare minimum at work and then when they get in trouble at work, it’s automatically because “my boss is a hard ass”.    Not always, sometimes they're just expecting you to do the job you’re there to do.",
            "Some of the biggest assholes I've met in life were professors. My bosses are chill but not all are.",
            "Some high school teachers are just out there to crush your dreams and make you as miserable as possible because they have tenure. Bosses that are too bad won't keep as many employees as a good boss (though bad bosses still exist ofc). It's the same thing as when teachers are like \"You think this is acceptable? Your teachers won't be so lenient in college. College is way worse than high school.\" and college turns out to be way more lax than high school.",
            "Bosses are (usually) a little nicer than teachers because adults have (a little) more power to push back against bullies and abusers.",
            "Man fuck teachers that let their god complex out on children. The fuck is wrong with these people",
            "When teachers say things like that, they are trying to prepare you for the worst case scenario.  Of course we know that there are lenient, kind, and compassionate bosses out there, but we want you to get used to disappointment and facing the consequences of your actions when you encounter people who will give zero fucks about you.  If the teacher has cross the line into abuse, it is reprehensible.  However, as a teacher myself, I've often used this line with kids when they try to get away with avoiding the consequences for their actions.  \n\nConsider the circumstances under which a teacher would have said that to you:\n\n1. begging for extension on a deadline\n2. Trying to get a higher grade than the one you earned\n3. Trying to avoid detention or punishment for being late or skipping class\n4. Avoiding punishment for disrupting class\n5. Trying to get out of doing a missing assignment\n\napply those to the working world and under a less than reasonable boss, you could be fired for those kinds of things.  Because your teachers held you to a higher standard, you don't try to do those things as much as an adult.",
            "Depends on your culture I guess. Teachers and bosses are products of their upbringing and environment. If teachers aren't getting help from their workplace and parents then I can imagine that their mood will worsen with time. But generally I don't think anyone goes into the job of teaching (at least 18 years and younger) with the intent of not doing a good job. Life may have happened on the way and changed them however. It's also a mentally draining profession that requires you really to take a break now and again. Not saying other jobs don't have that, many do, but this is a job where burnout has been researched.\n\nThe bosses...I mean they are as varied as people are. Unlike teachers or nurses or other professions that require a sense of nurturing you won't find a common ground between a random set of bosses (besides maybe being middle aged and male).",
            "Its safe to assume that everything they tell you in school is bs",
            "You've been lucky. \n\nPsychopaths tend to seek positions of authority. \n\nOf the worst people I've ever met the top of the list is former bosses (not all of them I've had good and neutral bosses too) and there are no teachers on the list, just one principal who loved football more than his students.",
            "What industries have you worked in? 😂 In my limited experience, bad bosses show up in lower paying jobs that have a corporate influence.",
            "You're only 25. You'll see.",
            ">I'm 25\n\nThere's your answer",
            "im sorry a teacher you have for 5 hours a week even the worst teacher is more bearable than a slightly sub-par boss you have to deal with 40 hours a week because it makes more of an impact on your life, also i think you look back as it was worse cause you had experienced less so it seems bigger",
            "They set your expectations very low",
            "one of my recent supervisors was arrested for bringing a pistol into work. He still works for us, thou is not allowed in the office, so far",
            "Go to r/antiwork and see how good you have it. The saying more relates to the droning of the rest of your life. You need to work to get paid to feed yourself and house yourself and your boss can make some ridiculous demands and if you want to get paid many times you need to suck it up and do it. I am far more micro managed working than I ever was in school.\n\nEdit: all I was trying to say is there are some down right terrible people to work for and you can see what people deal with at work at r/antiwork. Crazy stuff.",
            "No!!! Your just a misinformed individual that has no purpose to breath in our air.",
            "The people who say that are probably shitty bosses.",
            "Idk… I’ve never had a bad boss either but mostly because I left or didn’t take the job if they gave me a bad vibe. My first boss is one of my good friends.",
            "If someone says that it's probably to postpone your complaining.\nYou'll stop complaining since it's gonna be worse, but by the time you notice that was a load of bs, they're already out of your life so they don't have to bother anymore.\n\nit's an easy way of shutting someone up if they complain",
            "Almost everything teachers said was nonsense. Professors are laxer and more laid back too.",
            "Part of it is your superiors (teachers and bosses)...the other is you. You've probably (hopefully) matured between 15 and 25.",
            "There's a light at the end of the tunnel with a teacher.   You most likely won't have them for more than 10 months.   If you discover your boss is an asshole at a new job or after an internal transfer, it's not easy or wise to be switching and moving around.    \n\nI had a boss constantly give me crap about milking my broken foot.  Until I advised him I'd be happy to replicate the pain on him to see if he'd tolerate it.  He STF up PDQ about me milking it after that.  Also would speed walk when we were walking to a client meeting together while I was hobbling.  Prod me constantly to 'not' get sea sick on a company boat outing.  Even after a previous late night and a very seldom cigar the previous night,  I didn't have issues thankfully.  God forbid had I told him my previous night activities as he would have ramped it up.  Finally I told the company owner I was sick of the bs and was switched to another manager.\n\nThe only time I quit due to a boss was after three months at another company with a company lifer crappy boss.  Her boss and a new hire (who was great) couldn't put up with her either and left soon after.\n\nI've had some crappy teachers,  but crappy bosses are significantly worse.  When you have bills to pay, the stakes are much higher.\n\nEdit:  and for those commenting about bosses,  have you tried to find a job during a recession?  Jobs are easier to find nowadays.  I had a client who was also a manager.   I'd travel to his office and greet him 'Hi Ed' at the start of the work week.  'What the f*** do you want' was his response.  What a joy to be around.",
            "It's just teachers giving an excuse for how shitty they are and how done with their job they are.",
            "I have had way more teachers than bosses so by sheer volume both top 5 best teachers/bosses and bottom 5 worst teachers/bosses are all teachers. \n\nWorst I have had was the professor in uni who straight up hated teaching and sucked really hard at it. He was part of the reason why I dropped out when the opportunity showed itself. \n\nOverall I don't think it really matters, both are humans so if you end up getting a good or bad one is largely up to luck.",
            "Same I mean out of 7 bosses 1, has been bad so far. The rest have been super fun",
            "Too many variables. Perfectly feasible to have nothing but dickhead teachers, and nothing but wonderful bosses, but just as feasible to have the other way around.   \n\n\nUltimately, I think it comes down to unique personal experiences, and it's almost impossible to generalise with statements like this. Most people probably have had a mix, maybe some teachers they disliked, but maybe also some bosses.",
            "I've had worse teachers than I've had bad bosses, personally. And when it was teachers there was basically no recourse but to endure it as a kid. At least with a boss I can transfer, file complaints, change jobs, whatever. \n\nIn either case, though, the overwhelming majority of them have been fine. I've found the people you find who \"always\" have a bad boss and/or bad teachers are usually part of the problem themselves and typically equate discipline and work with punishment.",
            "i’ve never heard that expression",
            "I'd say hit and miss. I enjoyed all of my teachers, and I had a boss that was far worse than any teacher I'd ever had, who emotionally manipulated me into depression. I literally lost hair over it, in patches in the shower. That said, he was the exception, not the rule, and I was young and already in a vulnerable state not really understanding my worth.  I'd never allow that crap now, and it's cost me job opportunities because of it. I'm fine with that, because now I'll only let myself be in a positive environment where my worth is respected, and in short, I found a great job, feel successful, and my current boss is awesome.  \n\n\nWith over 8 billion people on the planet, you're going to hear people say teachers, and others say bosses. Others will say parents and others will say themselves. In the end, you just have to know your worth, and not put up with any of their shit, whomever tries to give it to you.",
            "I think teachers have shitty bosses.",
            "I have had the extreme end of shitty and good high school teachers, college profs and bosses.   I am really on the fence about which was worse overall.  I know of some people that bad teachers really messed up though it took a long time for them to get past it.   Bad people in your formative years probably have a bigger impact I suppose.",
            "What jobs have you had?",
            "Good teachers are very rare.  We need to appreciate them more.  If and when we find any.",
            "If my boss was ever as disrespectful as many of my teachers used to be, I’d walk out immediately.",
            "You've been lucky.  Only had a handful of bad teachers - have yet to have a good boss for more than a year.",
            "Your good boss compensate your bad teacher",
            "I think it just hits differently. \n\nAs a child there's not much you can do about a bad teacher.\n\nWith a boss you can start applying elsewhere, go to HR, or just quit.",
            "My teacher I have grown to realize just have it kind of rough and that they were not all THAT bad, but there is no excuse for my ex-boss sexually harassing barely legal teens.",
            "It all depends on the teacher/boss\n\nWhen I went to school, I got along with all teachers pretty well except for my math teacher (pretty much every students hated her except for the \"know it all\")\n\nI hated Spanish class at first but during the 2nd year I loved it, because my first year teacher got pregnant so a substitute teacher came (we loved her). A year later she got pregnant again and we had another substitute teacher, we loved her as well.",
            "You’ve been lucky as hell. Most of my bosses have been FAR worse than even my worst teachers",
            "It really depends on you. I know many people in your situation but I’ve always had bad bosses, or bosses that start out nice but end up to be just as bad as the previous one. (And it’s not just me: one of them turned his company into a right-wing misinformation outlet that has a following from neo-Nazis. Nobody saw that coming except for the boss’s son, who knew his dad better than the rest of us.)\n\nIt depends on how lucky you are. You’re 25. You still have the potential to have at least one horrible boss in the future.",
            "My mom used to tell me this all the time! I don't know if it's because I have only worked low level jobs, but I haven't had a boss that was nearly as bad as one of my teachers.",
            "Sorta lucky.  I've had some really shit bosses.  One would steal anyone's work and take credit. We handled that by only giving him hard copies of our work, never electronic. If he wanted to take credit he had to at least retype it all.  He had me write up the defense of a patent he wormed his way onto.  He wasn't competent enough to do it. Came in one day to yell at me for not work on what he yelled at me the day before for working on. Total shit show. HR even said they knew he was a problem when I quit.  I could go on and on.  I quit when I had figured out where to hide the body.  That was my clue to leave.\n\nAnother boss would immediately grab his cell phone and start yelling at people as soon as you brought an issue to his attention.  Never got the chance to point out that we have it resolved and I'm just FYI'ing him in case it comes up.  Stopped bring up things to him as it damaged my relationships with other departments.  I actually used it to get stuff done by other departments by saying \"I'm coming to you to let you this is going down, here is what we need done, and I'm talking to you now to avoid (PWE - Penis With Ears) from getting on the phone and yelling.\". I took another job in another department to get away.  But not before I brought it up to the big manager. Under a major reorg, all his people got taken away. Not a bad guy personally, just shit management skills.  Like really bad.\n\nAnother boss only knew how to manage using threats and intimidation.  It too me a good 6-8 months to figure out he was grossly incompetent.  He didn't know shit.  He knew when to say key words and tricky phrases about our department.  But he didn't actually KNOW what those meant or did.  So he had upper management buffaloed while we were constantly under the threat of \"we will have to look for someone else\".  Got the F out of there.  He caused 3 early retirements, and several of us to leave.  A total of about 75% of his department.\n\nDoesn't mean all bosses are bad. I've had some phenomenal bosses.  Which makes me have zero tolerance for bad bosses. Mediocre bosses I can work with.  Bad gets me to quit pretty quickly.  I just nope out of there. Life is too short to deal with that shit.",
            "I’ve literally had bosses scream at me for making a typo I a word document, never had a teacher do anything like that.",
            "Generally a boss is nicer to you because the power imbalance is (usually) not as great. With the teacher, you don’t have a choice but to go to the teacher’s class. If my boss is a dick , I’ll get a different job.",
            "It really varies on people’s experiences. Those people who said that expression likely had shitty bosses but less difficult teachers. You experience is really only comparative between the quality of the teachers and bosses you have in life",
            "I've been lucky and had pretty good bosses my career, but I had a few who were just awful.  A bad teacher can annoy you for an hour a day.  A bad boss can ruin your life for the entire time you work there.  The anxiety will bleed into every aspect of your life.\n\nAt 25, you just haven't encountered your first bad boss yet.  When you do, you'll know that this saying is more than true.",
            "I've had two very bad bosses so far. One.... I quit right away.  The other i stuck with it a few months because otherwise I liked the job.  But then.... I quit.\n\nI was fortunate to be tracked into advanced classes throughout school so I had ...mostly... better... teachers.  BUT.  The big really big difference?\n\nA child can't just Quit an abusive teacher.  Well adults don't always have that choice either, but they CAN start looking for another job, and know they will leave when they find one.\n\nSo you've been lucky to have good bosses so far BUT a Really bad boss will lose employees until the boss has no job.  This does Not necessarily happen with really poor teachers.",
            "Depends a lot on where you live and what industry you're in, in my experience. I've had some horrible bosses that ranked pretty much up there with horrible teachers. Doing things like contradictory instructions, getting off on making people cry, and changing pay records to make it look like labor law was followed when it wasn't.",
            "I haven't had that many shit teachers or bosses, but the shit teachers weren't audibly snoring consistently during class so I think my boss experiences have been worse.",
            "We grow a lot and change how we handle things and what we can handle. It might be tempting for a teacher to look at a kid complaining about homework and think \"that's nothing compared to how much work I have to do for my job\" forgetting that the child hasn't matured enough to handle those things. (and also probably forgetting that doing that one teacher's homework isn't the only thing on the child's plate). \n\nThere are shitty jobs and shitty teachers but you can't compare just on how much work is done. I've had 40 hour/wk jobs that were way shittier than my all-time-consuming years in the Navy, it had to do with the purpose and mutual respect which was missing in that particular workplace. (though heavily advertised)",
            "I think it's easy to find examples of both to justify both positions: assholes and good people exist in both positions and both are pretty common in both positions.\n\nWhat is absolutely absurd is people who say that college professors are hardasses compared to the lower grades: virtually all of my professors recognized that I knew I was paying for their class and was accepting of the fact that I'd either attend and do the work or fail. This is contrasted by even the good teachers in the lower grades where they were stuck teaching mostly kids that didn't want to be there and didn't understand why they had to learn the material. (The good ones could keep most kids attentive through positive means, but even then they had to care about making the kids care)",
            "As a teen I questioned and challenged. \nMost teachers hated it because they wanted us to behave like ants and fall in line. Others didn’t.\nThis prepared me to realize that you must question everything. Parents, school,work, etc. never accept things as they are. To me an inquisitive mind are the ones who hold the knowledge and can utilize it. The best companies are ran by people who do not accept things the way they are. Makers of Tesla (not Elon) didn’t. Elon musk (took Tesla to another level with a engineering team of course.) find people who encourage instead of discourage",
            "Same. My 6th grade teacher was a psychotic mess and has left me with a lot of lingering anger and anxiety. \n\nMy worst boss was simply vacillated between aloof and micro-manager. \n\nI’ll put it this way: I’ve never had a boss mock me in front of all my other coworkers for being rejected on Valentine’s Day.",
            "Probably just lucky. Some people just can’t handle being in a position of power/authority without it going to their heads.",
            "There are bad bosses, but the upside is you don't have to go to that job, there are others.  With teachers, you are stuck.  Often really shitty bosses don't last because they can't keep people.",
            "My worst boss was worse than my worst teacher, but I had the option of quitting that job, and there wasn't a damn thing I could do about my worst teacher.",
            "Everyone has different experiences. I was always told that the \"real world\" was going to be so much harder than high school and college. For me that was a load of horseshit. But that's because I was working at least part time, mostly full time during those times. Having only a full time job with no school is a fucking breeze compared to those days. And I guess I've been really lucky in that none of my teachers or bosses were ever degrading or angry people. Some  were definitely incompetent, but I've never had one that did anything malicious.",
            "You got lucky my guy",
            "You should read that as \"I'm too lazy and/or carrying too much resentment from my own trauma to actually bother doing anything about you being bullied by another adult.\"",
            "I hated how teachers would say that and be EXTREMELY strict because \"in the real world no one is gonna give you slack\" .....like okay sir I am struggling because a family member died and you're scolding me for not having an obituary as *proof* for the absence to be excused. My family was too poor to pay for the services, let alone put out an obituary but yeah sure go on about how I won't get given any support",
            "I guess it depends on each person's experience.\n\n I worked at UPS for 5 years and boy was it chocked full of terrible managers. I had a suit from the US yell at me for letting one of my employees use the washroom. I had my direct manager tell me to walk around the warehouse and scrape stickers off the ground. I was once told to climb on a moving conveyor belt 30 ft off the ground and break up some jammed boxes that were holding up the rest. Loaders falling behind? Yelled at for not helping. Helping loaders? Yelled at for creating a potential grievance situation with the union. Yelled at for not wearing dress pants---> buy new dress paints--->have new pants ruined by paint oozing from a broken box--->yelled at for having paint on my pants. Sure, I'll just buy more with that part-time salary. \n\nGood times.",
            "Your worst teacher makes your life hell for an hour each weekday, maybe for a year.\n\nYour worst boss makes your life hell for 8 hours a day until you find another job. Which you may not be able to.",
            "I worked for myself, but answered to clients. I am retired now. You find negative things wherever you go.",
            "You are extremely lucky. By 25 I'd been sexually assaulted by a boss, screamed at by a boss, lied to, gaslit, and fired for reporting child abuse. \n\nBad teachers exist, but they have much less power, and your day depends on them much less. And you don't depend on them to pay your rent and have food to eat.\n\nThat being said, I was a teacher, and a lot of teachers have a massive chip on their shoulder are are stuck in a high school mindset themselves.",
            "I'm lucky because I have great teachers. Teachers don't turn you into a slave because money is not their main concern, but your boss does.",
            "I had a weird opposite thing where high school teachers would talk about how hard college was going to be but college students said it wasn't going to be that bad. Knowing how out of touch the boomers were, I believed the college students.\n\n\nCollege was terrible and 90% of the teachers I had were on some sort of power trip. Graduated by the skin of my teeth and haven't looked back.",
            "Nope, you were either very unlucky as a kid, or very lucky as an adult..",
            "In my experience, lucky. But my teachers weren’t that bad. Most of my bosses werent either, but I’ve had a few horrible ones. The consequences are more serious with bosses (eg homelessness) and your parents can’t talk to the principal if they’re being unreasonable.",
            "I've had a bad mix of both, but the common factor with the bad ones was they were people who got off on bullying and power differences.",
            "You're just lucky...I currently work for a good person but I have worked for legitimate psychopaths in the past..people that think your work and personal life are interchangeable...who literally try and sabotage your life if you quit...be glad you're with reasonable people but always watch for monsters...they come in all forms",
            "I've had both bad teachers and bad bosses.  The latter has the power to fuck with your livelihood to a much greater extent.",
            "I've had teachers that were just not good at their job but never malicious. The secret is just to get the grade in that class and move on. There is no work around a boss who controls your very welfare with his or her feckless leadership.",
            "No, I guess you’ve been really unlucky with teachers or you were just an asswipe in school.\n\nI’ve had bad bosses. Just frustrated me all to fuck because I couldn’t understand how they became bosses.\n\nThe only sort of bad teacher I had was for a general business class in college",
            "Honestly I'd say lucky now because I had a manager that would micromanage me with every little thing I'd do when I knew exactly what I was doing he was extremely annoying fuck you Steven",
            "I think it's a statement about power. The teacher realistically can't do a lot to you, while a boss can basically ruin your entire life as an afterthought. Imo, though, the sort of people who use that sort of logic are all kinda indistinguishably equal in their shittiness, or at least I don't care enough to distinguish them.",
            "I guess I've had the opposite - I've had a lot of shitty teachers, but my bosses have all generally been pretty great. \n\nI dont stay at a job unless I enjoy working with my boss/manager. I guess that has something to do with it.",
            "It feels like categorizing wide groups of people based on anecdotal evidence. Not sure if it's lies adults tell kids or lies people tell in general.\n\nThat said, there's a couple of things to consider.\n\nFirstly, teacher is a profession where's boss is more like a position in organizational hierarchy, whole the profession could be different: a supervisor in construction, a manager at a bank, a VP, a manager in technology - your experience might greatly vary.\n\nSecondly, managers get selected from people who work as individual contributors. So supposedly they should be at least good at what they do and also be good people persons (not always, yes, I know). From this perspective, management track and teacher profession self-select different types of personality.\n\nI personally believe the market competition for talent forces businesses to evolve into places where managers are leaders, not stereotypical bosses from your quote. I don't see the similar forces pushing the selection of teachers, so the profession self selects.",
            "Management requires higher talent...\n\nTeaching just a degree",
            "It's BS.  Life after school is better.  I'm a middle aged guy and had this conversation with my daughter who is graduating high school this year.  No tests.  No homework.  You leave work for the day and you are done.  If your boss really sucks you can move on to another job.",
            "You've been lucky.",
            "Current boss is not great. Other than that all my bosses have been excellent",
            "Lucky now. Had like 2 actually crappy teachers. Would far prefer them to worst boss. \n\nMost teachers just had their quirks that seemed like a bigger deal at the time.",
            "I’ve had the same experience. I think the main difference is that teachers feel more entitled to be dicks bc kids are literally forced to be there. And the power dynamic of adult/child. If a boss disrespected me I’d simply find a new boss. \n\nAlso, most of my teachers were boomers/gen x. Most of my bosses have been millennials.",
            "I think the issue is there are legitimate bad teachers who are simply their for their paycheques and really do not care about the students. Your boss, while they fully can be a toxic dick, at least is paying you. \n\nI'd chalk your experience up to luck, but i hope you keep the streak as no one should have to hate whoever is the authority over them. That shit will weigh on you.\n\n \"Lies adults tell kids\" club? biggest contender is probably still:\n\n* \"your university professor won't give you extensions/accommodating\"; i swear my profs were the most accommodating people i have met in my life",
            "You've been lucky",
            "There's some pros and cons. I think if you have a bad boss it's worse than a bad teacher. In school unless there's something pretty intense going on I couldn't swap out a bad teacher, but at least I'd only have to deal with them for a specific timeframe. After my school year with them they just become inconsequential.\n\nWith a bad boss they either have to be bad in some specific ways that makes them not my boss anymore, or I have to deal with them until I get another job. I've had a pretty good run though, with one notable exception my bosses have been pretty easy to get along with. I had more bad teachers overall but it was because they didn't really care about me or students, they just wanted control over their classroom, so learning couldn't be done unless it was their way.",
            "In my opinion you've been very lucky.  The most my teachers were ever guilty of was being outdated and unwilling to meet students where they were at.\n\nBosses on the other hand have ranged from very good to psychotic narcissist (and everything in between).",
            "A bad boss can threaten your livelihood and is around for years, which greatly amplifies their impact on you. A bad teacher is at worst around for 9 months and worst case you get bad grades and some detentions.",
            "Teachers who i thought were bad, upon reflection, just seemed slightly stern. \n\nI have had really bad bosses though. One boss called me racial slurs behind my back. Another would you just be ultra demanding, threaten people, yell at people. One sabotaged work i did.",
            "be patient......you still have forty years still to work ,it´  ll happen",
            "lets leave it at this, there are people, in various positions of power, that are great and also some that suck. \n\nwhether thats teachers, supervisors, bosses, leaders, wanna-be leaders, politicians, etc. \n\nsome are great, and some are not so great. \n\npersonally, I think you should work with all of them to develop your own leadership style.",
            "In my experience, having a \"bad boss\" usually has very little to do with the authoritative figure, and much more to do with the subordinate's views on authority.\n\nGenerally speaking, people who have a \"bad boss\" usually have bad bosses everywhere they go -- which speaks more to their attitude towards authority than it does the performance of the manager/director.\n\nI'm not saying there aren't bad bosses -- I'm saying that in probably about half of cases, the person saying they have a bad boss probably thinks all bosses are bad.",
            "I think this post is a farce. What 25 year old actively thinks about comparing their managers to teachers they've had years prior?\n\nNow if the OP is high school kid who's only had a couple part-time jobs, I might buy it.",
            "I think it’s sort of a make your own destiny when it comes to bosses. Like certain bosses in certain industries / companies maybe nicer. You also technical can choose your boss to an extent by leaving your job or taking one you have good vibes about. \n\nThat being said I have never had a boss come as close to as evil, disrespecting, and cold as some of my teachers growing up and certain tenured professors were the worst. Perhaps I was a shit student (probably was) but I guess I matured and was worth respecting by the time I started my career.",
            "I've had some great bosses and I've had some shitty bosses. I've had some great teachers and some shitty teachers. In my experience, one group isn't any better than the other.",
            "Well one of my bosses tried to sleep with me and another would literally full on scream at me in front of everyone for making simple mistakes, so I’d say even my worst teachers were mild in comparison.",
            "Teachers, in my mind, are to prepare you for the worst. However, they are to be supportive people that see your struggles, help guide you, help you understand what they are trying to teach you. Sometimes teachers/bosses have the power complex, sometimes they don’t. But both should be molding you for the next level.",
            "My boss when I was an EMT for an ambulance company was far worse than my worst teaches.\n\nI had some not great teachers, but no horror stories, though.",
            "You can report your boss to their boss.\n\nTry and report a teacher and no one listens to you.\n\nI literally got detention because, and I quote, \"my posture gave the impression I wasn't paying attention.\"\n\nI would literally torture that teacher given half the chance for all the abuse she put me through such as:\n\n-Calling me obsessed because I liked a book.\n-Actively preventing me from socializing with other students by starting class early.\n-Stealing breakfast from other students.\n-Gossiping with other students about shit that didn't matter. One teacher edited one of my papers to have the N word in it. I showed the doc which hadn't been touched since before the assignment was turned in and was kicked out of the class for \"unruly behavior.\" Well my fatass English teacher proceeded to tell the entire class about it and make it look like it was true when it wasn't. \n\nThe amount of genuinely sadistic rage I have for this instructor could create an entire clan of school shooters. I have never met a boss with half the fucking blatantly abusive tendencies of this instructor.",
            "There’s always going to be good and bad people in the world. You take as much from either as you want. If you keep your bad teachers on your mind, of course your default thought of teachers would be negative…",
            "I've never had a shitty teacher or a shitty boss. I've been lucky with both I guess, but I'd wager there are many more shit bosses than shit teachers.",
            "I've had shitty teachers and shitty bosses. At least with a teacher you're done with then in 6-12 months. With a boss it could be much longer and stakes are typically higher once you have a family and need a paycheck.",
            "It's all relative.  I've heard all throughout school that certain teachers were terrible, yet I never had a problem with any of them.  A lot of it is attitude and just doing what is expected.  Most bosses/leaders just want to know htey can depend on you to do your part, and you'll stay off their radar.",
            "You been lucky.",
            "I have never had a boss as bad as one or two teachers/instructors across any school, including university. Load of shit to me/a scare tactic.",
            "I'm in the same boat, for the most part. Most of my bosses have been great, but I've had to deal with a couple who are just not good supervisors/leaders. I think how you position yourself and establish boundaries will play a much larger role in your relationships with your bosses than your relationships with teachers as a kid. If your boss texts you at 2AM and you reply willingly and understandingly, then by accepting your boss' behavior, you are setting yourself up to have that happen continuously and potentially get progressively worse. As a kid, unless it was absolutely unacceptable treatment, you just have to deal with it. As an adult, you do not.\n\nYou have the ability to establish a dynamic based on respect. If you have made that attempt and your boss still does not respect you, then unless you absolutely need the income and cannot get a job elsewhere, I would highly advise finding a different employer. Bad employer's certainly do exist, but in my experience, much of a bad manager's behavior impacts their direct reports most if the behavior is enabled. To be clear, a bad manager is not a reflection of the employees that work under them.\n\nAdditionally, there are some people who simply should not be working in a supervisory role. Those managers who try to abuse their power, treat employees like they are dirt, like making it rather difficult for employees to have a vacation request accepted while they go on vacation for 2+ weeks once a quarter, etc. These are the kind of people you do not want to work under. Find a new job (if possible), talk to your boss' boss, or do something to rectify that situation. Those people turn their best employees from A players to C players. At one point in time, your A players could and would do anything to ensure the organizations success, where now they do the bare minimum to not get fired while having minimal interaction with the organization. That is not what you want as a manager, and certainly not a situation you want to have to endure as an employee. If you find yourself in that situation, figure out something else. The stress just isn't worth it pals.",
            "Humans can be shit old young a teacher or your boss all the same maybe you got lucky or maybe you were a good person in adult life thats why you attract good people also",
            "Same i’ve never had a bad boss. Mr park, tom, and terry were all great bosses for my first 3 jobs. Makes me think people at r/antiwork are causing their own problems and crying foul",
            "In the past, yes, there were bosses that really sucked and their actions were considered 'normal'.\n\nHowever, 50+ years of employees suing their bosses for that shit has removed 90% of it.\n\nThese days it'll be rare to find a boss that bad and employees that have any self worth will simply quit and find a new job.",
            "Youve had good luck for 6 years. Lets see what the next 60 bring",
            "You're def lucky. You'd hate my passive aggressive, disrespectful boss.",
            "Dude, bad boss is way worse. You are extremely lucky, then again I guess you come from upper class and now have a posh job.\n\nLet us assume your teacher and your boss are the exact same grade of asshole.\n\nYou teacher:\n\n1. Has you 4-5 hours a week.\n1. Cannot affect your home or personal life.\n1. Cannot affect your life long term, except for you being a child and he can cause mental trauma if you dont have support from others. Most of your non-high-school grades dont matter a lot.\n\nYour boss:\n\n1. Has you 40 hours a week. Probably more, as bad bosses tend to overwork people.\n1. Can ruin your life financially. You depend on him to feed your family.\n1. Can ruin your self worth and mental well being way more than teachers can. He is with you 40+ hours  a week. He can torture you in ways a teacher can dream of. He can make your work difficult on purpose and then keep telling you how bad you are. Guess what, this is very common because incompetent bosses can end up doing this even if they dont want to be mean.\n1. Can have long term effect because he can give bad reviews to all your future employers.\n1. Bad bosses usually mean toxic work culture, which means your co-workers are also abusive.",
            "As others said, there are shit bosses, too.\n\nBut as an adult, you're not a hostage.  If they're bad enough, you find a way to change jobs.  \n\nBut remember, most school teachers are the ones who generally believe that school was the highlight of their lives.",
            "I can’t think of one instance as a kid I gave any teacher a reason not to absolutely lose their shit on me. I’ve had way worse managers than I ever did teachers.",
            "Sounds legit to me. 25 is not very old. The higher positions you get to in the workforce the more stress there can be and sometimes shitty, unreasonable bosses do have a tendency to rise to the top where no one really wants to speak out against them because they're too high up in the organization by that point and they're seen as \"important to the business\".\n\nWhereas a shitty boss at the lower levels has a lot of people overseeing them and monitoring them and if they're really terrible, people will just \"go over their head\" to their own boss to get them dealt with. So you may be insulated from some of these tyrants at the lower levels, or they may have already been eliminated from the organization or at least put in a non-managerial role.\n\nThere are definitely plenty of hostile, toxic, abusive bosses out there. Not as many as there once were, as tolerance for such behavior has reduced significantly in recent years/decades, but it's still definitely a problem that exists. If you've seen movies like \"Horrible Bosses\" or \"Office Space\" they're comedy and it's somewhat exaggerated for comic effect obviously, but it's comedy based on reality. Bosses can be that bad, they can actually be even worse in exceptional cases.\n\nAnd I think the worst bosses will absolutely be worse than the worst teachers, simply because bosses have even more power over you and your life, especially if you're relying on the paycheck to pay your bills.",
            "I've had some bad bosses,  but the difference is I'm able to tell them to kick rocks as I find other employment.  Can't really do that in primary school.",
            "So as a kid, most people don’t give you respect/think you are blowing things out of proportion. They are dismissive. Your boss? If they say/do the wrong thing, boom, gone, fired. Bosses have to follow stricter rules if you know the rules. Teachers actually get dictate them.",
            "What they are actually saying is that all of their non-teacher peers have shit bosses.\n\nI would look at the difference being that boomers and their predecessors were generally shit bosses. If you're 25, you're actually pretty lucky that you may go your whole life without a fucking boomer boss. Having dealt with them most of my life, I can tell you that boomers are the worst fucking bosses you've ever had in your life, worse than anything.",
            "I've had both shitty bosses and shitty teachers. It's interesting how they attack you differently. For my bosses, it's more professional and sneaky. When they yell at me it's not yelling but stern talking in a professional tone. They say it in a way to place all the blame on you making you hate yourself instead of them.  For teachers, it's more straight screaming in front of other students about how stupid I was.",
            "I think I’d probably frame this as, “If you think you have a bad teacher, wait till you have a bad boss.” Because you can have good and bad of both, and most of the time it’s the luck of the draw - but only one of them has control over your livelihood, and it’s not the teacher.",
            "I think part of it is probably the impression they have on your life. I've had bosses far shittier than my 5th grade teacher but they don't stick out as much, because I was 10 years old in 5th grade and it was much more shocking to me how shit people could be.",
            "My bosses have all been fine, it's my seniors at work that I work under that have been nightmarish"
        ]
    },
    {
        "post_id": "mjutam",
        "author": "None",
        "title": "Why do American school children get lunch at school?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/mjutam/why_do_american_school_children_get_lunch_at/",
        "score": 13693,
        "num_comments": 2382,
        "created_utc": 1617537165.0,
        "selftext": "I’ve been curious about this for a while. I live in a country in Europe and at my school we had to bring our own food to school. You also had different options: You could buy a sandwich at school, you could go outside and go to the store to buy some food or you could go back home to eat and come back when break is over.\n\nIs this just an American thing or do other countries do it too? Why so?\n\nEdit: Thank you all for your answers, I’m glad I now know how it works in different countries :D \n\n(I also generalised my entire country when I shouldn’t have. I’m only speaking about my own school and other schools I know. I’m sorry, my bad!)\n\nEdit 2: Also how long were your lunch breaks? Mine was 50 min, but in High School it could be as long as 2 hours when we had no class.\n\nEdit 3: There are so many answers and I would like to thank all of you for sharing your stories and answers :) very interesting to read !\n\nEdit 4: I live in Belgium. I grew up in The Netherlands. In middle school (Netherlands), I used to eat home. Most kids would always eat at home.\n\nAt my high schoolschool (Belgium), we had two breaks: One 15min break (a snack break) and one 50 min break (but this could be longer).\n\nIt was “the norm” for us to bring your own food to school or eat somewhere else (home or at a store). Our school did offer the option to order a sandwich (they didn’t even make it, they would just order it somewhere else). The sandwiches were usually around €3. \n\nI would only buy one if I forgot my food or didn’t have any time to make it though.\n\nThat’s why I’m surprised that other countries actually get (full) lunch at school or even hot meals. My school didn’t do that at all (and other schools I KNEW of, but it’s different all around Belgium!)",
        "permalink": "/r/NoStupidQuestions/comments/mjutam/why_do_american_school_children_get_lunch_at/",
        "comments": [
            "I was told that the school lunches were started after WW II. The US Army discovered many enlistees were malnourished. The government ordered the Department of Agriculture to begin providing food to schools to help those children who were malnourished.",
            "In the UK you get lunch at school too.  You can either have a school lunch or bring your own packed lunch.  At primary school, a few children who lived nearby went home for lunch, but at secondary school we weren't allowed out.\n\nLunchtime is usually about an hour, and less in some secondary schools, so it's not practical for most people to go home.",
            "Americans can eat the lunch provided by the school or they can bring their own lunch. And low income families can get free school lunches. It's a great way to make sure every kid can get at least one hot meal, regardless of their circumstances at home.",
            "Most kids can't walk home easily in American schools. It would've taken me like 90 minutes both ways plus time to eat.\n\nYou can bring or buy at school though. I used to bring until high school. Then for most of high school I bought unless I had leftovers.",
            "\\>Is this just an American thing or do other countries do it too? Why so?\n\nPretty common in Europe, at least in France and Belgium (even though in Belgium the option to bring a sandwich is possible)",
            "All schools in the U.S. have cafeterias. Some schools also allow students to leave campus to go out and eat. My school did not allow this.",
            "Where I'm from, a regional area of Australia, Tasmania, we actually had the option. It was the norm for parents to pack their kids lunches, and you'd eat your own food for lunch. But you could buy food at what was called the \"canteen\". Because I and many of my peers came from poor families, we rarely bought lunch. It was usually more of a treat on rare days. I can't say if it was like that elsewhere in Australia. \n\nI can imagine kids from financially well-off families in the big cities likely bought lunch everyday, but from the small rural school I went to packed lunches was the norm.",
            "Here in sweden we get free food at school.",
            "I am from Europe and we do it too. I believed that all European schools had this option for the students.",
            "Damn, imagine getting two whole hours for lunch. We just get 20 minutes and a charred piece of pizza",
            "It's very common in the UK for schools to have a canteen where the pupils can get their lunch. That's the normal way of doing it in my home country. Part of the reason is that helps kids from poor or neglectful households to get a warm meal every day.",
            "No paid school lunches or cafeterias where I’m from in Canada. They have free lunches (and breakfast) for disadvantaged kids, but no option to buy lunches. And I don’t think it’s even through the school, I think it’s usually separate charity programs. lunch breaks are 30 minutes.",
            "I'm from Finland - schools provide free lunches. I don't think I ever saw someone carry their own food from home. Leaving the school grounds was prohibited on lunch break up to grade 9 (15yo).",
            "We only get 20 mins to eat, so it has to be quick and that's the quickest option even if it's gross.",
            "AFAIK most schools have closed campuses, meaning students can't leave school grounds during the school day without a note to go get food nearby.  \n\nWhen I was in high school (mid/late 1970s), we had split sessions because there were too many students for the school.  I live in Tampa, FL, which was a big city even back then.  Grades 9-10 went from noon to 5 p.m.; grades 11-12 (last grades) were from 7 a.m. to noon.  We had an open campus because of that so a lot of kids went to McDonald's or the local deli.  \n\nI preferred to get a Cuban sandwich from school (they were authentic back then) and head to the beach after school when I was in the upper grades.",
            "In Sweden you get free lunch all through the school years. Usually there’s 1-2 courses and a vegetarian option to choose from. Lunch breaks are about 60 minutes. \n Why? I’m not sure. There are laws in place in terms of School being free and nothing that you need to do in School, field trips etc should have to cost Money. So free lunch is necessary.",
            "Also keep in mind America is a huge country and every state is ran a little bit differently in regards to what is an isn't available for food options.  Different districts within a state even different schools if public vs. private can have different times and rules in regards to lunch breaks.",
            "We used to get a little carton of milk at school when I was a kid",
            "I live in Finland and the food at schools are free.",
            "Kids must remain at school the entire day and are not permitted to leave without parental notice.\nAlso there is no public transit in most places and most schools are not in metropolitan areas near food places anyway.\nIt's not easy to walk places in America. Many roads have no sidewalks.\nKids just eat at school. Some eat whatever is provided and some parents pack a lunch for them.",
            "I have to pack my lunch for my kids in Australia. There is a canteen but I don’t know what they serve",
            "Municipalities in France have a pretty amazing school lunches though there is no national school lunch program. [https://karenlebillon.com/french-school-lunch-menus/](https://karenlebillon.com/french-school-lunch-menus/)",
            "[deleted]",
            "Lunchtime is pretty short in American schools, they can’t travel home or nearby to eat.",
            "Also, how is free lunch conceptually different from free healthcare? How hasn’t this been labeled as socialism?",
            "I live in Europe, too. (Luxembourg) \n\nIn primary school, we went home for lunch. In high school, we could get lunch at school.",
            "Are you dutch? A lot of schools in europe eat lunch at school.  I'm dutch and we do the same as you.",
            "I’m confused at why you are confused because what you stated and what you described are very different.  \n\nYou start by being confused that Americans buy lunch at school and say you had to bring your own food. But then you say there were different options - you could buy a sandwich at school or leave to buy food. That’s exactly how it is in a lot of the US, we can buy food, bring food, or leave and get food... just like you",
            "When I was old enough to drive I'd go home for lunch sometimes, but lunch time at my school was stupid short. So it wasn't very practical",
            "In Sweden lunch is free for all students so no one has to go without food a whole day. I thought this was true for all European countries. 🤷🏼‍♀️",
            "When I was at school in Australia I would bring a ‘lunch box’ that my Mum had prepared for me.\n\nThe other option was so called ‘lunch money’ that could be spent at the Canteen (basically a take away shop on school property).\n\nAs we got older we were given the option of leaving school property to fine food elsewhere.",
            "In Russia all pupils from 1-4 grades can get free lunches. Also some categories can get a free lunch twice a day: children from low-income families or with disabilities. Children with disabilities who study at home also get food",
            "In Sweden we get food in school that the government pays for via tax money. The school itself is ”free” too (I understand nothing is literally free but it comes from tax money). The reasoning behind it is (what I assume) that every child deserves to eat and education.",
            "in my EU country school also provides lunch",
            "The short answer is poverty. Kids typically pay for their school lunches, but there are systems in place to provide free lunch for students whose families can't afford the fee.\n\nIn suburban areas traveling home for lunch is impractical at best. Few students live within walking distance of the school, and in most families both parents work, so there's no one home to feed the child anyway. \n\nTraveling off campus for food is also impractical; places to buy food are widespread and usually placed on or near dangerous highways.\n\nPlus, with an on campus cafeteria schools can devote less time to lunch break, as there is no need to factor in traveling time. American schools usually allot 30 minutes for lunch-enough time to get in line, get your food, eat it and get back to class.",
            "FYI, Japan has school lunches as well, and they can be far superior to American school lunches: https://www.youtube.com/watch?v=fze5s1SlqB8",
            "Well, schools in the US often don't let kids go to stores or leave the school unsupervised. Unfortunately sometimes kids get grabbed up or walk into the street or just find a fucking crazy person. So the school doesn't want to deal with liability there. Hence food at school.",
            "What the other user said about WWII is neat. \n\nOne reason they stay open now is its a reliable way for kids in poverty or low income to have a meal.\n\nIn many areas we pay for the lunches. In our high school you could eat standard or pick à la carte which means we could pick options. Main line might be pizza or sandwich, veggie, fruit, and milk while à la carte line you could pay an extra $0.50  for a cookie or second milk or churro, what have you.\n\nLow income families can, instead of the $1.25 normal lunch pay a reduced price of $0.40  for the whole meal and if you had no money in the account they still had to give you something (usually PB&J w/ milk).\n\nThe neat thing is that schools are a reliable source for food **at all times** meaning that during the pandemic while schools were completely closed kids could still show up, walk in, and get lunch.\n\nFor some kids and some families a school lunch was the _only_ reliable full meal they could get if parents are struggling. It is law in our area (maybe state) that schools have to provide lunch some way some how.",
            "Your country does it too, you just haven’t done any research at all and instead came to the worst source of factual information, Reddit.",
            "“A place at the table” is a great documentary from 2012 about food insecurity in America, and how the education of school children are impacted by their inability to obtain food. Highly recommended.",
            "In Japan lunches are provided by the schools. No pizza rolls or hamburders though; only healthy well planned meals are provided. I have seen examples of the lunches provided in the US; may God help you.",
            "2 HOUR LUNCH BREAK?  our lunch break was 25 minutes,  and that includes time it took to walk from class to the cafeteria, grab your food, pay,  find a seat. then also include walking back to next class. \n\nusually had 15 mins to eat\n\nnortheast USA",
            "You definitely cannot leave school campus during school, that's a no no until at least like 12th year, unless it's a class trip and there's teachers chaperoning. \n\nSince many kids are either bussed or driven to school, stopping home midday is also not practical even if it was allowed. \n\nSchool meals are either brought or the parents pay the school to provide (or students bring money and pay)\n\nThe issue is when parents can't/don't provide either a brought lunch or a paid lunch, or are behind on paying. Those kids end up with no food.",
            "“You could buy a sandwich at school” so it’s not just American schools",
            "All the comments here really show you why you shoudn't generalize an entire country. The US is massive and every state is nearly as big as a Europrean country or bigger. \n\nIn my city, everyone got free breakfast and lunches, and we had 1 hour for lunch, and we could go off-campus if we wanted to as well.",
            "Because 90% of europe does it like that too",
            "Where I live, in the UK, all of the schools that I went to gave you the choice but I'm not sure about other countries.",
            "the lunchables cartel",
            "Well, in Portugal the schools have cafeterias that serve lunch but you can bring your lunch to school or leave school for lunch. I think in the US it's like that too. Pretty sure they can take their food to school. Not sure about them being able to leave school for lunch tho.",
            "It really depends on where you live (which specific school in the United States) as to whether all students at the school get breakfast/lunch for free at school. If enough children in a school live below a certain economic standard (the poverty level plus a bit extra), the entire school will qualify for free lunch. In many school only some kids get free (or reduced) meals.",
            "In Sweden we all get lunch in the school",
            "I think your country is the exception rather than the rule. In my country (France) we also have cafeterias.",
            "I was really lucky. (In Northeastern America—) we had an “open campus”, so you could leave to get lunch if you wanted, there was a line of food trucks outside every day around lunch, you could bring food, and the school also provided lunch in the cafeteria. I don’t know a single person who bought school lunch after middle school, but the option was always there.",
            "Not sure if this is common all over or if it was just my school, but we literally weren't allowed to leave the campus at lunchtime. A few seniors would sneak out or bribe the receptionist to let them leave but the rule was that we had to either bring our food or buy it from the school cafeteria.",
            "I see a lot of answers here about lunch breaks of 30 min or more, meanwhile at every school I’ve been to we had 10 min breaks after every 50 min.\n\nYou had to either bring food, go to the store in the school yard or risk to run out of time to get food at an outside store and eat it when the next break comes.\n\nWhen we were little we did have some type of bread and milk everyday, but they got scarcer the more we advanced in grades. By high school I don’t even think we got any.\n\nAnd of course, can’t say all this without including the country: Romania",
            "I'm assuming it's because of all the taxes we get taken out of every paycheck. It's a public program to feed those whose families don't make much money. It's mostly in public schools. \n\nI did have to pay for lunch once I moved out of my parents house when I was a senior in High school but there were vendors in the school, If I was to pay for food might as well get something I liked. Their food is alright but I wasn't going to pay for that out of my pocket. I rather get a slice of good pizza than the school cafeteria junk.",
            "American teacher here. Ive worked at schools in low income areas where students get breakfast, lunch and after school “snack” which was actually a full meal. The thinking was we didn’t want hunger to cause kids to be unable to focus on their lessons. The negative side to that is I witnessed soooo much waste. For example, In order to keep our grants, every student had to take a breakfast plate. We had so many students just toss the food in the trash they would station food workers to intercept unopened milk cartons to reuse during lunch. Also because of the curriculum demands and size of the schools, some lunches are very short. The middle school where I worked we had to fit 1000 students in a two hour lunch window ( mandated by the district) so lunches were only 25 min. In high school we had 45 min (one class period). In the 1980s we could leave and come back but now (in most districts in my state) students are not allowed to leave for lunches (truancy issues). Also due to non compete rules vending machines must be shut off during lunches.\nI hoped that gives you some more insight.",
            "In the US, you can bring your own lunch or buy it at school. Your parents can also come and take you out to lunch but that’s super rare because lunch is usually only ~30 minutes long and it’s not worth it.",
            "It's efficient. We want folks educated, the kids need food to better learn, so we need to provide food. It's not perfect but it's better than it used to be.",
            "Bringing lunch is allowed, but yeah school will also feed us. It’s beneficial too, I knew some people where school was their only sure meal every day.",
            "I grew up in a very rural area. Going home for lunch would mean kids walking 15-20 miles to get home. Talk about working up an appetite!",
            "The US is over 250 million people in very different regions with absolutely no central or standardized curriculum or rules across all states. Lunch times and whether they cost vary within the same city, let alone state. There is no accurate answer to those questions other than it depends. \n\n&#x200B;\n\nSome reasons for feeding children at schools were mainly the kids were hungry, many not sent food. Alternatively, offering to watch and feed the kids a few hours a day was a way to get families educated who did not always see the value in it, same reason they are out summers to work fields. \n\n(For context I was educated in 8 schools across 5 states, also a private and homeschool, studied education in college, studied abroad, studied education law, TA-ed tutored professionally, and work with schools as an educational nonprofit director.)",
            "Europe is so small it sounds. When I was in my elementary, middle, and high schools it would have been a half hour walk both ways to get food from somewhere else. And a solid third or half brought their own lunch.",
            "I’ve always thought kids should just bring their own, but have like premade sandwiches and drinks and such available in the cafeteria for any kids who forget their lunch. The reason kids can’t go home for lunch is that most kids live several miles away from their school and there is no safe place to walk (no sidewalks, etc). Plus, they only get about 30 minutes for lunchbreak.",
            "in italy we eat lunch provided by the school during elementary and middle school. so no, it's not a european thing.",
            "High school teacher here. This blends together all of my most-hated things about the American school system. \n\nLimited time, transportation issues, and lack of trust of children. \n\n\nAmerican kids only have 20-30 minutes for lunch (or even less sometimes!). We push pure academics instead of social development (and then wonder why kids are unhappy!), so lunch times have become shorter and shorter to accommodate more academics instead of “free time”. Our communities are rarely walkable, and often schools are specifically set back from local businesses and neighborhoods where you could walk. Schools typically have sports fields and other things, (since we often lack community developments like that), and are set where there’s affordable space, typically not in a walkable area. Since people think public transportation is for “poor people”, there’s rarely bus stops near a school (in the rare communities that even have public transit). School busses take kids to and from school, but it would be a nightmare to try and transport kids to surrounding businesses at lunchtime. \n\nProbably most importantly, we draw a hard distinction between kids and adults. Kids are not to be trusted, and they cannot be unsupervised in regular society. The lack of public transit reinforces this idea, you can’t really go anywhere alone until you’re able to drive (16 years old in most areas) and have a car, and the adult world is unfamiliar and “dangerous” for kids. It’s incredibly rare to see adult-less children in any facet of adult life such as grocery stores (and then we wonder why they have trouble as adults). Because of this over-protective mindset, schools are responsible for the safety of students during school hours. Letting kids leave campus would be a HUGE liability for the school. I’ve seen schools get sued because a kid left campus without permission, got injured, and the parents blame the school for not doing enough to prevent the kid from leaving. Kids are kept track of an accounted for every minute of the day. My attendance record is a legal document that can be brought into a court case—-if I mark a kid present, I am legally responsible for their safety during that time period. \n\nThen we wonder why young people are always stressed and can’t function in the adult world.",
            "Schools give out lunches to make sure that every kid gets a lunch. Some kids' parents have to pay, some don't. It's based on income. I have gotten free lunches in the past and have had to pay for them too. It all depended on whether or not my dad had a job at the time. In grade school they even sent home sacks full of food for the kids that needed it.",
            "I’ve seen where a lot of people have talked about poverty being a part of it and also how you could bring your own if you want but placement of the school is another thing. For me for example school was an hour drive one way, so no way to go home for lunch for that. For going to a place there was no restaurants near the school so if I went to get food it be like jerky at a gas station or something. Lunch at school fixes both those issues.",
            "idk but it's my only source of food, and i get it for free",
            "It's because 11 million children are food insecure and they need food to learn. \n\nIsn't this self evident? Do you think hungry children are any good at all? Do you think they learn better when they don't have food or are you just so privileged you have never even heard of children starving? The question you should be asking is why doesn't your country care about starving children.",
            "Japanese elementary and middle schools usually provide lunch to all students. High schools you can usually either bring your own or purchase a school lunch. Definitely not just an American thing.",
            "In Scotland our school provided lunch but you had to use a ‘fuel zone’ card that you loaded money on to. I think lower income families were given lunch for free. You could also bring your own lunch, go to the shop for lunch or go home!",
            "In sweden you get it at school, and it is for free. All the way up to high school.",
            "Fuck me you guys have forever to eat. I think the most amount of time I had to eat was 22 minutes, and half of that was waiting in line for food",
            "We do it in Colombia too. It is necessary for you to be well nourished if you want to learn and many families can't afford a meal. \n\nEuropeans really live in a perfect little world.",
            "Hunger has a huge impact on learning ability. Kids are growing all the time, their bodies are starving for nutrition to grow and then we park them in a classroom and tell their brain to develop too. \n\nIf they forget their lunch at home or their parents don't pack one in a rush their entire day of learning is basically shot. Hungry kids will not learn because their brain doesn't have the energy to learn.\n\nFeeding kids ensures they have the ability to learn.",
            "It's not just the US. Grew up in a former Soviet republic and as far as I know every single school had a cafeteria. You could of course bring your own. Our lunch ladies were cranking up scrumptious rolls and pastries. Food was actually cooked from scratch, not everything was tasty, but some dishes were quite all right. Why? I assume practicality. My guess is kids were fed at school because of poverty in many homes. Feeding kids at school insured they had nutrition.",
            "How else do you bankrupt the children?",
            "Wait at what time yall get to go home",
            "I never had a free school lunch. I'm in America and a hot lunch always cost money.",
            "Tell us your country!",
            "Wait European schools don’t lock kids in with padlocked steel gates? Are you gonna tell me they don’t use those horrible industrial revolution break time bells for recess either? Or sing some oddly religious, almost dystopian pledge of allegiance in the mornings for no fucking reason?",
            "I grew up in France and the school lunch was the only option for lunch for all the students except for a very few that could go home for lunch but this was a tiny minority of the student body.  We were served a great hot meal consisting of a salad then an entree with a side, then dessert, then cheese.  We also had baguette bread available at the table.  I think it was a great system.",
            "We get a short amount of time for lunch, typically 30 minutes. Many kids pack a sandwich, etc from home but you can buy lunch from the lunch room if you want. It makes sense that if you have a ton of children who need to eat, you make lunch available at school. \n\nIt’s also serves as a subsidy for farmers, meaning the govt buys surplus to protect the market. There’s a reason why school lunch is essentially milk, chicken, bread and corn. \n\nAnd finally, a ton of American kids live in poverty and their parents either can’t or don’t take care of them. As many as half of American kids are eligible for free or reduced lunch due to living at or barely above poverty. School lunch is almost an extension of ‘food stamps’ for many low income families.",
            "some american schools offer lunch, some don't",
            "Many US kids are on food stamps and get free lunch at school...",
            "you guys dont get served lunch???? bruh this is news to me",
            "In Russia we got school lunches as well. They were almost like a home-made food, but made with much cheaper ingredients lol. Still kinda miss them",
            "Because they can't go home for it",
            "Probably a lot of kids would like never eat without it",
            "Schools in the USA get subsidized by the government for student attendance.  That includes money for breakfast and lunch. Simple answer.",
            "22 minute lunch breaks\n\n30% of public school students are from food insecure homes. Many of them get their only meal at school\n\nFather distance to travel between home and school. 30-45 minute commutes in high school are common in the states",
            "In Brazil we don't eat lunch at school simply because you chose to study in the morning or afternoon (it's only 4 hours a day), we have a breaktime of 20min where we can eat a snack provided by the school or by yourself",
            "No free meals for me when I was a kid, nor for my kids at their schools today. Varies by state and county it seems.",
            "In America we had a hot food line and a fast food line that serves burgers, pizza, fries, chicken fingers.  So very American.  \n\nYouTube Japanese school lunch.  Its very interesting how involved the kids are in serving the food.  It seems to teach very good values on community, tradition, and healthy eating.",
            "Australian here. Every school I've been to you can either bring your own lunch, or buy something from the canteen (we don't have full-on cafeterias like other countries). You're not allowed to leave school grounds without a parent or teacher (and even then, you need a parent to sign a permission slip), because when you're at school you're under their duty of care and they can get in trouble if you like, get hit by a car or something.\n\nOf course, that rule goes out the window when you're doing your final exams - at that point, iirc, you've already signed out, so you're technically not a student. So if you have long gaps between exams you can totally leave and come back. We all went to the corner store to get chips.",
            "In India you have approximately 25 minute lunch breaks. Mid day meals are provided to all school children in India especially those from the economically weaker sections and in government schools. You can of course take your own lunch.",
            "Some kids would starve otherwise- I think that is part of it. Low income qualify for free lunches. My kids go to private and there is no kitchen so we must pack lunches and before covid the school would order in pizza Fridays that you pay 5$ for it is optional of course.",
            "Because we go there from 8:15 or so all the way until 2-3pm. It's like a fucking work schedule, or at least how they imagined it would be. I hated it.",
            "public schools in my country also give lunch, you have to sign up for it tho, but every kid gets breakfast in the morning, and \"merienda\" in the afternoon, and that you don't need to sign up for",
            "Every school I went to as a kid, you had a choice. It was fairly inexpensive in elementary school but it was really gross food... so my parents typically packed me a lunch. I’m not sure how much it is now though, because my kids go to a Montessori school so they have to bring their own food. When I was in high school though, there were literal restaurants you could choose from , no one brought their lunch because it was exactly what any high school kid could want!",
            "30 min lunch. If they let kids leave school to buy lunch, over half won't come back lol. Only when your a senior in high school, they would let you get a pass to go out and buy lunch.",
            "Initially it was so kids would go to school instead of being forced to work. Eventually it just so kids from poor families didn’t starve",
            "I always packed my lunch cause I'm vegetarian but everyone else generally bought lunch there and had to pay for it with actual money... Nothing was free.",
            "In France, lunch is treated as a teaching opportunity. The students learn how to cook, how to wait tables, how to clean, and the children learn about different types of food and table manners. Their teachers sit with them. I think it's a win win win situation.",
            "50 minutes of lunch break?! I had like 25-30 minutes and 10 of those minutes would go in the line for washroom",
            "u/waterbuffalo750 mentioned it here as well, but a huge point is making sure that regardless of the kids home situation, they have access to at least one hot meal a day. \nPersonally, I grew up in a financially stable household but I still ate the school’s food because it took one more thing off my mother’s back in the morning. It’s a little thing but it’s a little less stress everyday for the parent. I will say though, the quality of the school’s food leaves a lot to be desired in the US (at least back then). I think most schools use Sodexo, Aramark or something similar. They go for cheap and simple foods, often not the healthiest choices. I highly recommend watching “Super Size Me” and its sequel. Although dated, a lot of those systems are still in place. \n[Shitty Clip but exactly what I was looking for...](https://youtu.be/y7f6hAwf9io)\n\n[Better Clip ](https://youtu.be/Mm0XvU5rOOs)",
            "I’m not sure about y’all but my lunch was only 30 minutes. Even if I was allowed to leave I couldn’t have even gotten to a restaurant and back in time, let alone eat.",
            "In Sweden we get lunch (for free) In a buffet like style.",
            "In Australia we could order food for lunch in the morning but it wasn't usually an every day thing. We could also buy from a limited menu if you didn't hand in a lunch order before class started. 95% of kids just brought lunch though. \n\n\nIt wasn't until year 11 & 12 that we started leaving school to get food. We weren't technically allowed to but no one would stop us.",
            "I attended American School and all the food was way better than the hotodgs and pizza and fishsticks that my parents exclusively ate. I would have been as big as a house otherwise",
            "Because not all Americans can afford food and the school/ government supplies them with one hot meal",
            "when I grew up in england we got free ;lunch there and it was magnificent"
        ]
    },
    {
        "post_id": "eb8zas",
        "author": "None",
        "title": "On film sets, what do hair stylists do with bald actors?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/eb8zas/on_film_sets_what_do_hair_stylists_do_with_bald/",
        "score": 13694,
        "num_comments": 372,
        "created_utc": 1576464381.0,
        "selftext": "I say this because Dwayne Johnson’s hair stylist was credited at the end of Jumanji 2, and I’ve been thinking about it for like, three hours. Do they like, shine their heads?",
        "permalink": "/r/NoStupidQuestions/comments/eb8zas/on_film_sets_what_do_hair_stylists_do_with_bald/",
        "comments": [
            "Bald heads can actually cause problems on set with glare, etc. Especially after getting sweaty. So makeup basically. The makeup artists on set know what they're doing.",
            "He is bald by choice because \"I'm not bald because I went bald. I'm bald because my hair is a cross between an afro and hair from a Lama's ball sac.\"\n\nSo shaving and glare control....",
            "I’m bald but still shave 3-5 times/week, if you don’t the baldness start showing after 1-2 days depending on your hair\n\nHe may have to shave twice a day. It takes 2 minutes so not that it makes sense to have someone just for that but still possible",
            "Bald heads still produce the oils that naturally go into hair, so they get extra shiny, as others said they will powder them a bit to reduce shine to non distracting levels but that’s the reason why they do it.",
            "He actually played the father, with hair, in that scene in the game where someone's parents were killed by the bad guy. :)",
            "Doesn't he have hair for a bit? As he plays his own dad?",
            "There's a funny bit Stan Lee did once describing someone powdering his forehead before an interview, and he goes on a rant saying \"who's going to say, 'honey, switch that off, his foreheads too shiny'\"",
            "Is Dwayne Johnson completely naturally bald? Maybe the hair stylist shaved his head (or whatever parts of it still grow hair)",
            "[removed]",
            "Bust out the olive oil and shine that chrome dome up",
            "Patrick Stewart had an onset hairdresser on TNG because his remaining hair grew so fast it caused continuity problems.",
            "Might be a bit of a stretch, but you could actually hit him up on Instagram and he might find your question funny enough to answer.",
            "Not a hair dresser, but a film actor - he would have been assigned a union hair dresser because it’s standard practice even if you’re bald. That person would make sure his scalp is ready to go when he comes to circus first thing in the morning, and then would follow him to set to tend to his needs between takes.\n\nHis hair dresser probably had shit all to do, but it’s still standard for all union actors to have one no matter what, so there you go.",
            "Maybe it wasn't the hair on his head.......",
            "DJ has an exceptionally bald head and his barber would shave him daily or every other to keep it that way. My guess is he also gives Dwayne hot towel shaves daily as well. The MUA will keep the shine under control (and his tan even) but his barber will keep his hair growth the same at all times unless otherwise specified in the script. \nGood question OP.",
            "<Spoiler>He had hair in one scene.</Spoiler>",
            "Not an actor, but a dude with a daily-shaved scalp. Having a smooth done can create all sorts of lighting problems for pictures and movies with all the lights. Every year, we take portraits at my school (I'm a teacher) and the photographer either has to turn off what is referred to the \"hair light\" or dab a little bit of powder onto my dome to absorb the light",
            "No stupid questions — you paid real money to see Jumanji 2?",
            "DJs hair stylist is the coolest woman you’ll ever meet. She keeps his head dry and obviously shaves down the tiny hairs he still has around his head (remember, no one short of having alopecia is completely bald).",
            "Even those who do \"go bald\" typically don't completely lose the ability to grow any hair whatsoever. Most bald men still have to shave regularly or else the hair grows out enough that the uneven coverage is visible.\n\nSource: my scalp",
            "Maybe they clean it with shoe polish",
            "Assuming they aren’t 100% bald they probably shave their heads and powder them so they don’t shine",
            "[removed]",
            "Every see the male hairstyles on Breaking Bad? They had their work cut out for them there",
            "Micheal Rosenbaum who played Lex Luther on Smallville had his head shined and freshly shaved daily.",
            "Eyebrows have hair too. Someone’s gotta style them.",
            "You have hair in places other than your head.",
            "I saw a live taping of AGT and between takes of Terry Crews doing his line there was a lady who wiped off his head and powdering it.\nSo for glares and stuff.",
            "And yet no one thought to cut the long stray hairs on Danny Devito’s head. As a fellow bald guy with the Statham buzz, I swear I’ll never let those long lone strays happen. I’ll get the strays lasered off  so they wont have a chance to blow solo in the wind. Maybe they stayed to go with the I don’t give a fuck age for that character, but it’s awful looking regardless of the age, and wreaks of the old man unkept look.",
            "Follow up: Are they responsible for wigs, or is that a different department?",
            "They keep it shaved for the most part, they also do makeup and work with any facial hair. They also work with multiple people not just the one they are credited for. \n\nAlso not sure if it’s their department but a lot of people have to wear these kinda shower caps and it’ll look like they are bald, they might have to work with those kinda things too, or it might be a props/makeup  department thing",
            "It is possible the hair stylist is one of Dwane’s personal stylist who goes with him to set as needed. The person may not be needed everyday since majority of the work is done by the make up artist. \nBut let’s say he needs a shave every other day, then the hair stylist would show up and does the shaving/maintenance/polish, etc the whole nine yards. This person, even though is from Dwane’s own team, may need to be paid by the movie pay roll while Dwane is on set. It’s very similar to actors who make the studios pay for their personal bodyguards/trainers/massage therapist/pet groomer or some other wild jobs. It’s all part of the actor’s package. “You want me then you’ve gotta pay my people and my snacks.”",
            "I assume that he has some hair that they remove so that he looks the same shot to shot.\n\nHair stylists are in charge of maintaining the continuity of the hair style and have reference photos for that.  \n\nHe probably does not spend that much time with the hair stylists.",
            "Simple answer: He had a wig on when it showed a flashback to him as his father.",
            "[Probably this](https://youtu.be/j9_i32JoscI?t=26), I imagine",
            "bruh you actually read the credits",
            "Duh... they shave them to keep their hairline in continuity!",
            "[deleted]",
            "God bless you.",
            "Homer, did you polish your head in the shine-o-ball-o?",
            "More like they apply the makeup that keeps a bald head from being shiny. Or they consult with the lighting people so that they can go for the makeup that gives the proper amount of shiny to a bald head.\n\nThey probably do a lot more than one would think",
            "Do you think he does the shaving himself? Then there is the glare factor. Then the same for the face.",
            "They just fuck them",
            "Spit n polish",
            "In a flash back he plays his dad and he has hair.",
            "Maybe it wasn't the hair on his head that got styled",
            "Prolly to shave his head / beard",
            "I spy a Sun \n    No it's just Dwayne Johnson",
            "They have other hair than the stuff on their heads.",
            "Sculpting",
            "I do film stuff. If you want Vin Diesel to do publicity you have to pay £500 per day for his hair stylist. Not a joke.",
            "Thank you for the awards, guys, lmao!",
            "Massage the scalp",
            "Have a nice conversation",
            "Touch their head and make a wish",
            "Keeps his joy-department tight.",
            "Smauel L. Jackson ia completely bald, but you wouldn't know from his movies.",
            "😂😂😂 thanks op",
            "They polish the noggin.",
            "Nothing?  Tf do you think.",
            "yeah i think the same  and i think because they do shine there heads",
            "Someone gotta shave that dome.",
            "crediting his hair stylist was probably a joke. i work in the film industry. hair stylists are hired to work on all the talent and a bald head that is problematic would be handled by a makeup artist to matte it down.",
            "High five?",
            "Probably the opposite of shine.. they keep it matte finish",
            "They apply make up to the scalp to avoid shine that would catch the lights and be distracting much as they would on the face. If someone shaves their head rather than being bald from old-age there is also an issue with consistency. Films are not shot in order but need to appear to be so an actor cannot look different between scenes that might have been filmed at completely different times then put in order. If there is some re-growth of stubble that will need to be removed or covered so as not to make the shots look out of sequence.",
            "Shine Kirirshima shine",
            "On most of the sets I work on, a bald actor is dealt with my the DP, usually through use of a polarization filter to cut out glare.",
            "You mean Jumanji 3?",
            "Sunscreen",
            "If no makeup, then we can use the head as a bounce board.",
            "MY EYES!",
            "I can tell you for a fact....wigs.",
            "She’s bald!",
            "Was it like a bowling ball!",
            "Make it shine?",
            "https://www.reddit.com/r/peopleofwalmart/comments/ebktpu/sharp%C3%A9_toup%C3%A9/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&utm_term=link",
            "I cant imagine anything more humiliating than having a stylist do your bald head",
            "Full lacevwigs and got2beglued.",
            "There was a flashback where Dwayne Johnson was in a crappy beard/mustache/afro too",
            "https://ciptmoney.xyz/7478209081098/",
            "Dwayne isn't bald, he shaves his head. Also, bald people do have hair on their heads, it's just very fine and spaced out. Hair stylists will shave these down during film production then makeup artists will take the shine off the scalp",
            "Yes",
            "Wax on. Wax off",
            "[removed]",
            "Shaved is a hairdo.",
            "Wax on. Wax off",
            "I have a mostly full head of hair but I identify as bald.\nWhen I am on set (I live in PA and have never been in a movie) I have a whole team available to manage my head."
        ]
    },
    {
        "post_id": "cl5lcq",
        "author": "DrAweshume",
        "title": "If the sun blinked out of existence for .1 of a second would we be able to realise that it happened? Would earth flicker dark or would there be enough light that we would never know?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/cl5lcq/if_the_sun_blinked_out_of_existence_for_1_of_a/",
        "score": 13683,
        "num_comments": 892,
        "created_utc": 1564759688.0,
        "selftext": "Question as above. Zero hidden meaning, just me being dumb.\n\nEdit: just want to say thank you for such an overwhelming response from everyone. What started off as the worlds silliest thought has blossomed into me learning so much about our sun and how it affects us.",
        "permalink": "/r/NoStupidQuestions/comments/cl5lcq/if_the_sun_blinked_out_of_existence_for_1_of_a/",
        "comments": [
            "There would be a noticeable but very brief flicker. Most people would assume they imagined it, although there would be clear evidence that it actually did happen from video cameras and recordings from scientific instruments.",
            "Sure we'd realize it happened, as, yes, the light would flicker.",
            "What if it wasn't just light but also the sun's gravity?  The slightest interruption would alter the planet's orbit.",
            "Light takes a few seconds to cross the width of the sun: https://www.wolframalpha.com/input/?i=width+of+the+sun+%2F+speed+of+light\n\nSo... we wouldn't see it TOTALLY flicker on and off, right? Because the light from the \"back end\" of the sun (I mean the part farther from us, like the edge of the disk instead of the center of the disk) would still be coming. Overall the light would just dip in intensity a bit, then return to normal. Or am I wrong on this?\n\nEDIT: https://i.imgur.com/A7tnaMn.png\n\nMore details and my attempt at an actual calculation here: https://old.reddit.com/r/NoStupidQuestions/comments/cl5lcq/if_the_sun_blinked_out_of_existence_for_1_of_a/evtldy6/ Bottom line is, the light from the poles of the sun is (I think) delayed by about ~2.3 seconds in comparison to the center.\n\n> So once Earth notices it's no longer receiving light from the center of the sun (direct path), it will STILL have light that came from the edges. 2.326 seconds later, it will stop receiving light from the edges. But by that time, since the sun was only gone for 0.1 second, the light from the center has already come back.\n\n----\n\nBut, scientific instruments would probably detect the \"dip\". I guarantee there's hundreds of precisely-tuned instruments, some on Earth and some on satellites, watching the sun's intensity. A massive decrease in intensity like that, recorded by all the devices and occurring over the whole surface of the sun, would be wild",
            "If all of the matter that makes up the sun were to wink out of existence for a fraction of a second you would be left with a dense gas of photons that would begin expanding at the speed of light. These photons usually take thousands of years to reach the surface of the sun but they can now accomplish the same feat in a matter of seconds. This would greatly increase the amount of light being radiated from where the sun used to be. People on earth would experience an extremely bright flash of light that could potentially cause severe injuries especially for people operating dangerous machinery.",
            "[removed]",
            "flat earthers would use it as “evidence” that the earth is flat and that the sun is a hologram that glitched out.",
            "I assume it's be just like \"Huh? What was that\" and then a lot of people hoping they weren't going blind",
            "A new subreddit would be born of people who took photos at that exact moment. Every submission would be a completely blacked out photo.",
            "While I’m sure the explanation has already been covered, if you like crazy hypothetical questions like this one there’s a book called What If by Randall Munroe that covers these kinds of things (with cartoons which is a plus). I believe he’s a retired NASA physicist, so he’s got some seemingly credible input on these crazy questions!",
            "I'm very interested to see if anyone comes in with scientific data to respond to this.  I am thinking that if we are only talking .1 of a second it would end up being more of a \"Huh?  Did the lights just flicker?\" type of reaction for anyone in the daylight zone at the time.  Could be completely wrong on this, but I don't think that amount of time would be enough to cause any significant issue to the planet other than confusing people.",
            "As far as light goes, yep, we would notice a momentary flicker, but .1 second would feel more like a glitch in the Matrix than anything significant.  \n\nAs far as the more substantial impacts it could have on Earth (or not) that are being debated below, [A quick google turned up this as I kept pondering this question today](https://www.popsci.com/node/204957/)\n\nTL;DR from the article is that it would take a week for the surface temp of the Earth to plummet below zero (F) and it would keep dropping for a long long time.  Humans, through extreme means and plans, could survive for decades or centuries.  If the sun simply clicked off for .1 second, we would not be running a risk for any permanent drop in temperature and may not really even notice any change in temps at that moment.\n\nEarth's rotation around the sun is roughly 30km per second, so .1 second of no gravitational pull from the sun does not leave much time for Earth to spin out into the galaxy.  Any spinning further away from the sun in that .1 second timeframe would still leave us comfortably in the Goldilocks zone to sustain life and we may not even notice any detectable change in climate/temperature.",
            "Everyone on earth, except like 3 people, would forget The Beatles. And Coca Cola.",
            "I think the real question here is what it would do to planetary orbit. because the premise is the sun blinking out of existence not just ceasing to give light.",
            "It happens every time you sneeze. We thought you knew about it.",
            "What the....",
            "Would our eyes even have the FPS to notice?",
            "Well I'm dumb as a box of rocks but I like to watch a lot of videos on YouTube while stoned so here goes. I think it takes about 8 minutes for light from the sun to reach the Earth so when it initially happens we would not notice a thing. And you're probably right it would happen so fast that maybe there would just be enough light that we would not even notice the lack of light. But I'm not sure how that lack of gravity    .1 seconds would affect us since the Earth and Moon and other planets and their moons are all moving incredibly fast and that little bit of loss of gravity might just be enough to not necessarily send planets ejecting out into the void but can really have some serious repercussions.",
            "I assume that there would be delay, considering how long it takes light to get to the earth, but if a camera was pointing to the sun you could get proof, but everyone would just think it’s edited. Also only half of the world would even notice considering the sun only shines half the world at once",
            "Its blinking out of existence though its not just a light bulb turning off for a second. We are orbiting the sun so it depends on if it being gone for that period of time would alter our orbit in any way. I don't have the answer for that but if it DID alter our orbit id assume there'd be some consequences.",
            "Any sensors focused on the sun would go crazy, that's a ton of energy just vanishing and then reappearing.",
            "I think the much more prevalent thing here would not be the lack of light for .1 seconds, but the fact that the earth suddenly loses its orbit with the sun for .1 seconds as well as every other planet, if it blinks out of existence. It wouldn't be huge but it would change our orbit somewhat depending on where it happens.",
            "What if it happened every minute? Would the earths temperature drop?",
            "Scientists would have an absolute field day.  Imagine gravity from the sun stopping while we have so much monitoring equipment going at any one time.\n\nI'd also wonder how much impact that would have to orbits.  It seems minor, but we travel 3 km in 0.1 seconds.  That could slightly change many things.  For all plants.",
            "A lot of people would miss it because they blinked when it happened.",
            "More importantly than the light is the gravity. We would go farther from the sun by about 3 kilometers in that amount of time. Might help with global warming could also make our orbit more elliptical. I would love to see a full mathematical analysis of the exact effects",
            "you said blinked out of existince that means we're all going to die vsauce made a video about it.",
            "Not if it happened at night.",
            "Follow-up question, would the revolution of the solar system be effected significantly by 1 second of it having no gravitational center?",
            "I’m not a scientist to take this with a mountain of salt, but only thing I think what happened is I am almost unnoticeable flicker of light.  We would lose all the heat energy from the sun for.1 seconds, but given the insulating properties of the atmosphere and of the earth itself, it would be completely unnoticeable.",
            "Seems like no. Maybe if the sun was flat, but it being round means parts of the sun are closer to us, and some are further. So all of the light doesn't arrive evenly. Seems like .1 second wouldn't be noticeable.",
            "I think maybe a lot of people would be blinking while it happened, but that's interesting to think about.",
            "Taking a dump. So I wouldn't notice.",
            "I'm not sure how far , but we would notice it in the future. It takes a while for the light to get to us, and the \"no light\" to get to us. Honestly I dont know how it would affect us but we would notice it in the future.",
            "IMO, if sun truly went out of existence, even for that short a period, the gravitational pull holding the Earth in place would also vanish. That would change Earth's orbit, which could have huge impact depending upon Earth's original location, when the Sun disappears. Flicker of light would be least of the interesting situation. In fact, the whole solar system could change unpredictably.",
            "The fact that the gravity of the sun disappeared for 0.1 second is enough to throw the solar system out of wack with orbits. Maybe a planets orbit gets changed. Maybe a planet flys off. Maybe an asteroid changes orbit to collide with earth in the future.",
            "What if we all blink when it happened?",
            "Once me and my friend were running during practice a few weeks ago and everything flickered and we both just looked at each other like bruh. No one else seemed affected",
            "Earth's orbit would permanently change very slightly. You can calculate by how much. It's not much. The loss of light for 100ms would make almost no difference.\n\nYou wouldn't be able to see moon at all for that time either.",
            "What you are thinking about is the light essentially diffusing through many different mediums and holding some capacity to buffer out the momentary flicker. This is rational for something like a sound wave that travels slowly enough that echos from our environment can smooth out a fast fluctuation of a wave. So if you were playing a tone in a area with buildings and solid surfaces, you would not be as likely to notice the pause.\n\nPicture being  in a field with a sound source far off and to the side is a big brick wall that forms a 90° angle between you and the sounds source. You're 343 meters away from the sound source and the brick wall is 188 meters away from both you and the sound source at a 90° angle. If the sound source were to be generating a single tone and then were to stop for 0.1 of a second, you would not hear the tone cease. With sound traveling at 343m/s, in that 0.1s the 34.3 meter wave gap would be filled with the echo bouncing off the brick wall and then when the echoed tone pauses the sound source tone has already reached you. You would notice it in this situation but add more reflective surfaces all around you at different distances and increase the amplitude and you probably wouldn't. \n\nLight is sooo much faster than sound. Lights travels 300,000,000 m/s (3 million meters a second). In that momentary 0.1 pause in light, the gap would wrap around the Earth 7.5 times. So in the above scenario a 0.1 second light pulse would be almost immeasurably similar to the reflected pulse off the wall(from the environment). So if the source of light goes out and you don't have aglow pigment you're probably not far enough for any reflections to buffer out the pause. \n\nOf course you can match the luminosity and build some type of Dyson sphere that essentially makes the light travel a distance as to delay it 0.1s. So if there's a pause the reflection fills the gap and then the direct source resumes before the reflection pauses.  \n\nThe simple answer is you'd know. It'd be like it being night and suddenly day for a tenth of a second.",
            "By removing the sun, and as a result its gravitational effects upon other objects in the solar system, then rather than continuing to accelerate around a circular path, they will instead continue to travel in a straight line at a constant speed instead.\n\nThis might not seem like much, initially, but as every planet, comet, asteroid and spec of dust in orbit around the solar system would move independently of each other, their orbital paths would change once the sun resumed normal service.\n\n\nSome objects would travel closer to others, and others would travel further away. This would result in many objects finding themselves in unstable orbits where the slight increase in gravity between them could give them a slight kick, which over time could lead to objects being ejected from the solar system entirely, or tugged out of their orbits and into other objects and planets.\n\nOn a larger scale, the removal of the sun would also remove its protective magnetic field from around our solar system. This field, known as the heliosheath, protects us from a lot of radiation and particles from outside our solar system by deflecting them away from us.\n\nBy removing the heliosheath for a second, we'd be allowing all of this radiation into our solar system. Even at the speed of light, this radiation wouldn't travel far, after all it takes around 8 minutes for light to reach us from the sun, and the outer limits of our heliosphere appear to be around 84 times further away, but once restored, the suns magnetic field would be far less able to safely deflect all of that radiation away from us, and much more radiation could potentially reach us.\n\n\nThis radiation would lead to some very interesting aurora in the atmosphere, and the interaction with Earths own magnetic field could cause problems for orbiting satellites and ground based electrical grids, much like solar flares do today.",
            "The suns gravitational pull would cease to exist for that moment and the planets would spin off into oblivion!",
            "We would be flung into space people, fuck light lol",
            "Yes we would notice, unless it happened at night /s",
            "I looked only briefly, but I did not find the correct answer - I apologize of it is hidden down there and I am just repeating. If the while Sun blinked at once, at its location (not due to a barrier between us and it), it would look very unexpectedly. Due to finite light speed, the center of the disc, which is the closest point to us would blink first and then we would see an expanding ring of darkness - first broader and slower, later narrow and fast. The radius of the Sun is roughly 2.5 light seconds, so in first approximation that is jow long it would take. At any moment, for a 0.1 s blink only 4 per cent of the disc would be dark and a 4 per cent dip in solar brightness is not visually noticeable. The ring of darkness would however be just about wide enough to be visible through a dark protective glass without a telescope.\n\nIf you wonder how the hell does something like that happen in the nature and why we don't see it, it's just because the premise is unphysical. An object will never undergo changes faster than the light time to cross it - the changes would have to be pre-planned across the object, which the nature kinda doesn't do. We do, however, observe weird effects of light propagation in astrophysical sources, especially if yhe geometry is favourable (something moving almost but jot quite towards us at high fractions of light speed).\n\nSource: am astrophysicist, do deal specifically with stuff that moves very fast.",
            "Not just that, but earth’s orbit, temperature, and relationship to nearby planets would also slightly change.  I’m not convinced that an event like this wouldn’t be catastrophic.",
            "I read this like a vsauce intro",
            "I cant help but feel even for .1seconds it would still cause catastrophic events to happen",
            "Guess I am late but I ***THINK*** that, since the sun is so far away, it would take some days, hours, I don't really know how much; for that absence of light to reach Earth. But quite probably, it could be detected with the current astronomical technology before it reaches the Earth (NASA is very dope) and it is very likely that it would be notified to the population. So people in the lucky sunny side of the world would gather in the outside like people do when we have an eclipse. People, will most certainly not see shit, but they will all go on twitter or facebook or stuff like \"da mos majical momen o mai lif\". And then they will go home, have dinner and that's that.",
            "I want you to read and think about what you said, then ask yourself if you know how the sun works.",
            "I'm pretty sure that the gravitational dip, though relatively brief, would displace the earth, relative to everything in its orbit, enough to kill all our satellite functionality.",
            "There would be a small, but detectable, disturbance in the Force.",
            "Even if we couldn’t see it, probably ligo will detect the gravitational waves from it",
            "Humans would certainly not notice directly. \n\nThis is because we wouldn’t even see it fully go out. We would see it dim and then brighten again. \n\nBecause the Sun is so massive, light from the poles of the sun take an extra 2 seconds to get to us compared to light coming from the part of the Sun closest to us. \n\nSo when the sun blinks out of existence, 8 minutes later if you were looking directly at the Sun with a scientific instrument you’d see the light dim starring from the spot closest to us, and over the following 2 seconds see that spread like a very very thin ring to the edge of the Sun and then it would be back to normal. \n\nWith the Naked eye though, you wouldn’t see much at all. It’s so damn bright you miiiiiight notice a slight dimming; but not by a lot. \n\nAt the same time when the “flicker” happens, Earth will briefly not be in the Sun’s gravity well. It will travel about 2 miles outside its regular orbit and then go right back to orbiting as it was. It might add a couple microseconds to the average year. \n\nThe effects on the rest of the solar system would be pretty minimal. Certainly it wouldn’t make anything interesting happen in our human lifetimes. \n\nSo yeah, bottom line, that machine you found that makes the Sun blink out of existence for 0.1 seconds every time you push a button, you can go ahead and push that button once. It’ll be fine. Just please don’t mash it.",
            "Oh yessss we would, the earth orbit would suddenly change hurtling thousands of miles out in a tangent before again being brought back, perhaps enough to launch a few things into the atmosphere at enormous speeds for an extremely short duration but hurtling yes. This would be a very nice thing to investigate actually.....",
            "We would never know. Wanna know why? We’d all die.",
            "Would take about 8 mins for us to even notice it.",
            "Actually, the earth would not flicker dark. IIRC light takes 7 minutes (this timeframe might be totally wrong) to reach the earth, meaning that even if the sun was gone forever, there would still be the same amount of light as before the sun disappeared for 7 minutes. Probably, nothing would happen.",
            "The earth would flicker 8 minutes after it happened.",
            "My guess is that it would be like reverse lightning",
            "We'd notice because the sun has a huge effect on magnetic fields and other sources of energy around the world, I think a blip would definitely cause some sort of hiccup in the system.",
            "Blinked out?  Umm... the effects on gravity would cause a galactic crisis.",
            "[deleted]",
            "We would literally all die from the immense cold that would follow. As space no long has the sun to heat anything and the temperature would go down millions of degrees freezing us all",
            "Yes, we would notice. If you were outside, or anywhere lit by natural sunlight, you'd see it flicker dark for a moment- you'd probably think it was an airplane passing in front of the Sun, but after checking with everybody else's observations it would become clear that something larger had happened.\n\nScientific instruments would pick it up as well. We have satellites constantly monitoring the Sun, and even gravitational wave detectors that would spot a sudden 'ripple' in spacetime.",
            "There’s be a very brief flicker that most people would miss since they were blinking. Light from the sun takes like 8 minutes but there’d still be a gap between when it started and when it stopped.",
            "Are we talking about all solar emissions?  The sun's EM emissions create some flux in our own magnetic field.  The sudden loss of those magnetic emissions would cause our magnetic field to warp, then warp back to it's original shape.  The sudden flux would probably pop a lot of breakers/fuses, and maybe even permanently damage many integrated circuits.",
            "Yes, but it would happen about 8 minutes later",
            "The replies are getting complicated for me to understand!  \n\n if we can join frames per second when viewing videos and the brain sees continuous movement. What if that .1 of a second was between frames would we not see the flicker? I'll close the door on my way out!",
            "For that 0.1 second all things in orbit around the sun would fly off into space in a line tangent to their orbit trajectory. \n\nIt might cause a recoil effect when the sun blinks back into existence that may make orbits more eccentric.",
            "We'd probably just see a brief dimming of the light, depending on how much we notice 0.1s of anything. That part of it would be like a single frame in a TV signal. If it's nighttime where you are, then you wouldn't even notice that much.\n\nWhat we'd really notice would be the shift in gravity that happened at the same time. If the sun blinked out of existence, its mass would disappear too. The planets would continue to move forward, but wouldn't have the sun's gravity to pull them down into elliptical orbits. About 0.1s later, the sun would be back and we'd go back to orbiting it from our new position slightly further away than before. If gravity moves at the same speed as light, then we'd notice both effects at about the same time (~8 min after it happened).\n\nNobody's ever turned gravity off and back on before, so I don't know if the Earth would experience it as a sudden jerk or a gradual pull. I can't say for certain what that would feel like at a human scale. It would probably depend on where you are on the planet, and we'd still be feeling the Earth's gravity much more strongly.",
            "Would it mess with the gravitational pull keeping the planets in orbit?",
            "How long does the sun's rays take to get here? Because it might be visible again before the rays even reached us",
            "The Moon would also flicker about 2.5 seconds later, and the outer planets would also flicker much later",
            "Funny story though, we'd see the flickering with a 7 minutes delay since that's about the time it takes for light to go from the Sun to Earth",
            "so, not that it just went dark, but blinked out, can we ask if it would affect the planets or any other shit?",
            "The sudden changes in gravity would be more apocalyptic than the loss of light",
            "Other than the light, what about the effects of gravity? Would we be thrown wildly out of orbit?",
            "I have no answer but it's a really good question.",
            "You can notice the difference between 30 pictures a second and 60 pictures a second. Everyone oout in the sun would notice it for sure.",
            "I'd assume 9min later the sunlight would flicker and people would realize it after a bit.",
            "People are talking a lot about the light, but if gravity from the sun went away for .1 seconds:\nAssuming the sun is pretty much stationary (not wobbling like is actually does as the planets in the solar system orbit around), its disappearance would make the Earth move on a straight line for .1 seconds (like when you spin a rock over your head on a string and let go of the string, and catch it .1 seconds later) and after that it would curve again. Except if the sun appears at the same exact spot, the Earth would now be a little further, so instead of the force being perpendicular to Earth's motion, it is now at a bit more of an angle. So the Earth's would make a motion of wobbling sideways on its orbit, which would be kinda cool and definitely detectable.",
            "Also would our orbit be affected?",
            "Forget visual, what about the temperature?! Would the complete absence of our planet's heat source for that small of a moment have an effect?",
            "nice question deer",
            "What if we were blinking at that exact moment?",
            "There would be a noticeable effect on the orbital periods of planets local to the sun.\n\nEdit: I can't personally explain that effect, but I believe someone can.",
            "Well I'm not a physicist but I feel like the bigger impact would be on the earth's(and other celestial bodies) orbit around the sun. Like, would we go hurtling towards the next nearest massive object and then back again once the sun comes back",
            "No, because we're all either looking at a screen either on the shitter (at work) or in a chair (at work).  Windows are a myth.",
            "Pretty sure we’d skew off our current orbit entirely.",
            "Would we all freeze to death in the moment?",
            "I think v sauce did a video on this.",
            "We would lose .1 second worth of solar energy that day.  But it would be dissipated, so even that would be hardly noticed.",
            "Remember it takes 8 mins for light to get to Earth",
            "It would also effect the earths orbit measurably, but probably not the tides.",
            "Would its gravity stopping for that long leave any noticable change?",
            "Think of light as a waterfall, you cut off the water theres going to be a gap in the waterfall from where you cut off the water. So yes, we would see the flicker because there would be a gap in the light traveling from the sun.",
            "We regularly experience short periods darkness all the time, in the form of blinking. I really doubt there would be a mass panic since people would just go back to whatevrr they were doing. Scientists would be very curious and be analysing satellite data to see what exactly happened",
            "Wouldn’t that affect the gravity of the solar system",
            "It would take 8 minutes for us to notice",
            "For .1 seconds the entire solar system would rearrange itself with Jupiter as the sun, basically everything would stop falling sunward and would start falling jupiterward, or shoot outward.\n\nHow far would we get off of our current courses? I have no idea, but it should be noticeable when the day and night cycle changes by a few minutes.",
            "We would notice a flicker after 8 minutes",
            "This man is planning to steal the sun and switch it with a fake one, like in Indiana Jones.",
            "We'd probably think we've all gone crazy",
            "Gravitational waves would do  number on you.",
            "What would happen to the earth as a result of a gravitational absence of 0.1 seconds?   I.e if the sun actually disappeared for 0.1 seconds?",
            "Sun light is scattered in the atmosphere, so there wouldn't be 0.1 s of darkness but more like 1 sec of a slightly dimmer sun. I don't think humans would notice it without precision instruments.",
            "Would the moon flicker?",
            "Vsauce has a vid on something similar to this https://youtu.be/rltpH6ck2Kc",
            "I imagine it would be like when lights flicker in your home or work and it just feels like a weird blink",
            "What would there be, if any, gravitational effects of this?",
            "Well, the opposite end of Earth's orbit would rise a bit.",
            "This is not really answering your question, but think about the fact that if the sun stopped giving light it would take 8 mins and 20 secs to actually notice",
            "It would take about 4 minutes for whatever happens for us to percieve it. Assuming we can.",
            "Isnt that how frogs see far away stars",
            "I bet we would notice, but we wouldn't even know until like 7 minutes after it flickered.",
            "When I was in 5th grade I honestly though this happened – it was just a plane flying in the direct path of the sun though, lol. It was like a mini eclipse.",
            "My guess is that the biggest impact would be the gravitational fallout. The solar system is a very delicate/unique balance and while I don't know how to calculate this, I'm guessing the lack of central gravity for that long would be pretty rough.",
            "Can someone do the math of how much our orbit would change?  We would also lose gravitational pull for 0.1 seconds.  So we would briefly move in a line tangent to our current orbit.\n\nWhat would happen then?",
            "The crazy thing is that if this had actually happened at some point millions of years ago we’d have no way to know.",
            "Wouldn't it take a while to reach us?  I'm not a a scientologist",
            "The diameter of the sun is 4.643 light seconds. So if the whole sun blinked out instantaneously, and blinked back in after 1 second, we would still reeive light emitted from the middle of the sun. If the sun blinking were to propagate at the speed of light towards Earth, we would see the sun blink even though it was never entirely gone.",
            "All light travels at the same exact speed. There wouldn’t be “enough” light to stop you from noticing.",
            "I was interested, I scrolled. I found some answers that said we would experience a flicker of darkness, some that said we would see the sun get a little dimmer for a split second, and some that said the sun would get extremely bright.\n\nCan someone qualified please answer the question, I want to know the actual answer.",
            "Lol all I know is it would take us about 8.5 minutes to notice.",
            "I would be more worried about our orbit. The sun didn't just stop putting out light; the sun stopped existing. No gravity from the sun.",
            "What about the earths orbit? For that one instant of time the primary gravitational body of the solar system is nonexistent. How would that affect not only earths orbit but the solar system as a whole?",
            "If you mean, \"what if the sun went dark\" I believe this has been answered very thoroughly in earlier comments. Especially [this one](https://www.reddit.com/r/NoStupidQuestions/comments/cl5lcq/if_the_sun_blinked_out_of_existence_for_1_of_a/evt42vh/).\n\nBut if the Sun stopped existing entirely, even for .1 seconds, more noticable might be the gravitational wave that would wash over the Earth. I image we'd see some powerful tidal forces across the planet surface, possibly triggering earquakes from a sudden forced shift in the continental plates, and who knows what else. This was a thought provoking question and there was some really great responses. Thanks for sharing!",
            "Makes me think what would happen if also it didn't travel the distance it should have in that .1 sec if that would have any effect on the solar system?",
            "Sudden loss and re-emergence of sun’s gravity would cause a tsunami like ripple through the solar system and cause untold shit to us on earth.",
            "Would our rotation around the sun be affected ? Would our year be longer? Or worse, get longer every year from there on out ?",
            "We’d either not notice at all or think we blinked.",
            "Is that enough time for the planet to freeze?",
            "The Earth is moving through space at 67,000 Miles Per Hour in a circular path around the sun. IF the sun disappeared for 0.1 seconds, and reappeared ... The gravity ripple would be noticable and may even cause seismic events on Earth because the Earth would temporarily (for 0.1 seconds) no longer be going in a circular path, before being jolted back on that circular path when the sun reappears !",
            "Out of existence? Wouldn’t everything freeze?",
            "I think it happens when the electric light does the same, its weird when it happens, its like you blinked but youre sure you didnt because blinking doesnt delete all the light, so it must be the light blinking for a split of second, you know it was but you wonder.",
            "The case for solar power would be completely out lol",
            "People would just think it was a glitch in The Matrix",
            "It'd take about (i think, don't quote me, please.) seven minutes after the initial flicker for life on earth to notice the sun shutting off. It'd certainly be noticeable but, like all of the other comments that indicate it on this post, it'd be incredibly brief. You'd probably think it was just your eyes playing tricks on you or it was like an optical illusion or something to that effect. You'd only really notice it for a very brief split second. Just like if it were to disappear for a half of a second, you'd probably just think \"woah. That was weird.\"",
            "Well we wouldn’t see it flicker for a long time after it actually flickered because the light would have to travel to earth",
            "I'd be actually far more concerned about the gravitational effect to earth's rotation",
            "How did this go from the sun blinking for .1 of a second to migraines and things like that?",
            "I'm high af and this got me mind fucked",
            "Blame Mr. Burns."
        ]
    },
    {
        "post_id": "f62bhw",
        "author": "1fuzzybird",
        "title": "Why do sometimes I have to poop really bad and then I don’t- almost like my body sucked it back in?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/f62bhw/why_do_sometimes_i_have_to_poop_really_bad_and/",
        "score": 13679,
        "num_comments": 677,
        "created_utc": 1582073646.0,
        "selftext": "No- seriously. Like sometimes I’ll have to poop really bad and then If I hold it for a little bit it’s almost like my body does a silent *shloop* and sucks it back in out of my poop chamber hole. It’s like Mario, shimmying down a green pipe, pokin his head back out and going back in.\n\nEdit: Thanks for the Silver kind stranger!",
        "permalink": "/r/NoStupidQuestions/comments/f62bhw/why_do_sometimes_i_have_to_poop_really_bad_and/",
        "comments": [
            "Source: I’m a medical student.\nThe sensation to have a bowel movement results from stool moving from the terminal (sigmoid) colon into the rectum (essentially a poop pouch). We only have real sensation of the area around the anus, which tells you it’s time to go poop as stool collects in the rectum.\nWhen you don’t poop after this initial feeling, there is a fascinating occurrence of reverse peristalsis within the rectum which is independently regulated by the enteric nervous system. This is your body’s way of helping you not poop when it’s a bad time. \n\nThere’s also a cool way that the rectum “samples” the consistency of the stool in it, which allows you to discern whether you are about to let out a fart, or you need to run to the bathroom.\n\nEdit: Fell asleep and this blew up, thanks for the gold kind stranger! I’ll try to reply to answer additional questions in a bit.\n\nEdit 2: impressed with the general interest and “shitty” questions. Here is a wiki on the sampling reflex I mentioned, also termed the rectoanal inhibitory reflex. https://en.m.wikipedia.org/wiki/Rectoanal_inhibitory_reflex",
            "You missed your poop window. If you deny it too often you'll end up constipated.",
            "What happens with defecation is, if you move past your ideal pooping window your body essentially is like \"well if I can't shit now I guess I'll take the turd back up for a bit to prevent further discomfort.\" This process results in the body reabsorbing a lot of the water in a turd, so if you repeatedly avoid bowel movements, you will need to first crap out a very dehydrated, hard, uncomfortable, pebbly turd- on top of all the other crud your waste system has generated in the time you've been holding your BM in.\n\n&#x200B;\n\nTLDR: Don't avoid shitting.",
            "The only helpful thing Dr. Oz ever said was about this very topic. \nBasically your body does, “suck it back in” by re-absorbing the water. \nThe point is to get to a toilet and poop as soon as you are able. \nThere really is a window of time when it’s easiest and thus healthiest for your system. \nPoop in public bathrooms people! It’s liberating!!",
            "Water... your poop sort of has an optimal water balance.  Too much and you have diarrhea, too little and you're constipated.  If you hold in a poo your body will essentially draw the water out. The urgency might pass but more likely you'll get constipated.  Laxatives like miralax, or the like, are osmotics... they draw water into your bowel to help flush out what's in there. You should try to use the bathroom when you have the opportunity,  it's much healthier and minimizes complications like hemorrhoids.  Also drink plenty of water and eat your fiber to make things easier. \n\nSource: did homecare for a dying relative... know more about bowel care than I care to.",
            "Never pass up a good opportunity! Now that I’m old I don’t trust a fart and I never know when it’s time to go…Things that old people don’t talk about",
            "I'm upset no one has answered this.",
            "Don't have the answer for you sorry. Now it may have already been addressed somewhere here and clarified as a different thing altogether, but is this in any way similar to how when you are hungry for so long that you can get to a point where your body goes 'alright fuck it, I'm not hungry' at which point it can then be difficult to make yourself eat something? \n\nDo our bodies try tell us things that if we ignore for so long it kinda goes 'well fuck you then you can't eat/poop/whatever'?",
            "Because your body does suck it back up!  It's the same sphincter that unfortunately swallows up sex toys past the point of no return! (Like it has to be surgically removed!)  I follow a pathologist on Instagram! That's how I learned the answer to this",
            "The poop fairy takes it",
            "Never had this problem. I have an entirely opposite problem. I don't know I have to poop until it is jamming its way out of my butthole. \n\n&#x200B;\n\nI get no warning, and barely have enough time to make it to the bathroom, let alone grab my wet wipes and make a toilet paper nest.",
            "I once had a fever/cold mix of a sickness and my body just never told me to poop for like 4 days. Then it did. Rip asshole",
            "Can I ask a simi-related question?\n\nWhy do I have such ungodly huge poops after having a child? It was a c section and ever since then my poops have been twice or thrice bigger than ever before. Is that normal? Will it fix itself, do I need meds, or am I stuck having huge poops indefinitely? Seems to be big regardless of how much I eat or what I eat.",
            "Purchase a squatty potty. You’ll thank me.",
            "That means you waited too long and it has already started going the opposite way back up your body until it eventually enters the throat and leaves the mouth instead",
            "Never resist the call to stool.\n\nDo not strain when you evacuate your bowels.\n\n^(Shit you learn working as porter/orderly/dogsbody in a hospital.)",
            "I always say that when you have to poop and it goes away it’s your poop going out for a cigarette and he says ‘you find a toilet and your phone I’ll be back in 3 minutes’",
            "You have a second sphincter a few inches up your butthole. Your butthole is the first outside sphincter. It's kind of like there's a butthole inside of your butthole that closes to pinch your shit off. Then you squeeze your tummy and your other outside butthole opens up when it feels poop on the inside door.",
            "I asked a similar question about peeing on here. The answer was that supposedly in our evolutionary chain, animals who could not stop the need to release fluids for other necessities, like fleeing a predator, were weeded out over time and could not reproduce, so the likelihood is that evolutionary pressure caused your body to develop the ability to decide, nah, maybe not right now.",
            "I'm on the toilet at work after 4 hours of being the only one here and having to shit. Now I can't squeeze it out! Oh well, at least it's on company time. Guess I'll just continue reading some reddit until the mood strikes me again.",
            "If you really think that your poop has been sucked back up into your body, you’re full of shit. Fix that.",
            "Ohhh! Ghost poop strikes again!",
            "aw shit, you really had to ruin it with \"Edit: Thanks for the Silver kind stranger!\"",
            "I do this sometimes and also with pee.",
            "Your body’s still hungry.",
            "This is why I reddit.",
            "Dude I read this so awkwardly but smiling..",
            "Constipation is a bitch, Xanax and Subutex, I get this a lot\n\nGet a nice laxative, really clear it out",
            "You could be constipated. Try eating more fruit and or more fiber.",
            "My daughter (8) calls it the magic wizard who “poofs” her poop feeling away. Idk but it works for me.",
            "I'll be honest, what the fuck.",
            "Sometimes I wipe, and I wipe, and I wipe, and I wipe, and I wipe. Still Poop. It's like I'm wiping a marker.",
            "I heard once it's like if you are close to your comfortable area such as your home the urge to poop or pee intensifies as you are relaxed and know you can re leave your self in a safe area, where there are no threats.  I think it goes back to our neanderthal ancestors.",
            "I once had to poop real bad after school but got distracted and held it in for an hour. Then when I went, nothing was able to come out and I ended up being constipated for three days",
            "You're not eating enough fiber",
            "For me, personally, it’s because I can’t poop anywhere but at home. If I’m at work, or anywhere honestly, I’ll feel like I have to go but can’t. When I’m 5 minutes from home the urge hits and I go as soon as I walk in the door. I guess the comment where someone said if you don’t feel comfortable or safe you can’t go explains it.",
            "Social media says fuck you.",
            "Isn’t this feeling where the term “a turtle head poking out” comes from? It comes out then goes back in and then back out and then goes back in etc...",
            "S H L O O P",
            "Holy shit I was litteraly about to ask this",
            "Reading this while I’m pooping",
            "Oh my god that’s exactly what I am feeling rn sitting on a toilet",
            "mmm. dont like that *anal*ogy. ^(ill get my coat...)\n\nBut in all seriousness, I think it might be some sort of fucked-up constipation. Take some laxatives or drink something or get some liquids into your body. And fiber. Fiber helps stuff pass.",
            "I love your question, I love your description, I love your seriousness, literally laughed out loud, I hope you get a real answer",
            "Well I don’t think I had an answer to your post, my suggestion would be don’t fuck with your window of not having to think about poop all the time!",
            "What a shit post!",
            "The turtle.",
            "I have had all this..never went to the hospital. I just either eventually got it out or dug it out..I still have issues til this day but I try to take alot of powdered fiber and drink coffee every morning and I stay somewhat regular, but even if I don't go for 1 day, I feel like my poop just is sooo big and won't come out of my butt like it used to. I feel like it is so hard to poop these days..I'm 41 and I remember the awesome days of when I was 21 , when Poops were ...ahem..easy..what I wouldn't give for the 1 min shit",
            "Your body forgot that it was hungry",
            "Bartenders don’t play GTA?",
            "Wow no one really knows",
            "I know someone better had commented \"the poop shoot\"",
            "I rest my case",
            "She's referenced, but not a bad post.",
            ">It’s like Mario, shimmying down a green pipe, pokin his head back out and going back in.\n\nNext time when I play Mario this topic is going to po~~o~~p up in my brain..",
            "Eat more fiber my friend",
            "The writers don’t count while taxing",
            "You missed your poop window...",
            "I notice this when I'm under a lot of stress; first time was as I was about to shoot a rifle for a score in the Army. \nMy prostate will swell up just before. As soon as I start shooting it goes away.",
            "Is this another one of those Bloomberg research post?",
            "From now on and forever I'm going to say \"poop chamber hole\".",
            "source: I'm a professional Mario Bros player and I can tell that Mario has never poked his head out to go back in afterwards. You either have superpowers or you've never playes Mario in your life",
            "and then deal with the smash competitive community.",
            "Gas",
            "It's the spice melaaange",
            "Reading this while sitting on the commode, trying to poop coz i wanted, but can't :/",
            "Is this ability learned? I need it.",
            "What *you* don’t DM",
            "Yea because then they might actually be possible",
            "I’m a female and only have a somewhat (non-scientific) female answer. I don’t know what gender you are, and I won’t ask, but if you’re female (or have a uterus) and it’s “that time of the month,” you will have cramps that are either shit cramps or uterus cramps. So one moment you could really have to shit, and the next it disappears off the face of the earth.",
            "Пиздец",
            "Excellent! Thank you kindly.",
            "I get this quite a lot, like I'll need a poo - finish what im doing first. Go to the toilet, sit down and then its magically gone.",
            "You are riding the waves of peristalsis my friend!  Rhythmic contractions of the bowel that push a food bolus through the meat tube from your food masher to your pooper!",
            "The term scaring the shit out of you doesn’t mean you pooped yourself it means that your poop went back up into you to come out another day..",
            "Praying this morning that this happens while I wait outside for the Social Security Administration to open.",
            "Even though it appears that 5 years old are the majorly of people who replied, you still didn’t get your answer, so you should try asking on r/ELI5  (explain like I’m 5):)",
            "E¾0",
            "    0wdgďd",
            "Basically because that's exactly what happened.  If you don't poop soon enough your body tries to invoke reverse peristalsis and move the shit back to help you out.",
            "I don’t believe you.",
            "Eat better",
            "You took to long.",
            "The real question is why a grown adult just used the word “poop”",
            "This is a great question; I’m glad you asked it.",
            "There’s a bunch of bacteria inside your asshole that eat shit if it has a low enough amount of nutrients.",
            "Who else is reading this while pooping?",
            "Same.",
            "You're not a true rounded adult until you've tried to hold it and FAILED! It becomes a test of cunning,  deceit and creativity. In the WORST possible situations.",
            "r/brandnewsentence",
            "Because it's kind of your body actually does suck it in...\n\nSome times when. It is held.foo long basically it will love back up. Obviously can be an issue as it can become impacted, overly dried etc.",
            "Poop usually gets \"sucked back in\" due to sudden loud noises, perhaps you were in an unfamiliar washroom and heard a loud fart, this could have done it , were people in   the washroom talking? This can have a negative effect on weaker men causing the \"clench effect\" be mindful of this as rose buds can be easily pinched before you are ready to squeeze off a full loaf.",
            "Also, pro tip; when you feel like you're gonna have the runs, just try to keep it in and hold off until later. It should come out more solid after it's had time to compact.",
            "reading this while taking a dump",
            "When your body does that it is a trial teaser for the pooping process.",
            "I almost shit myself while in the movie theatre. So idk :/",
            "ABSORB"
        ]
    },
    {
        "post_id": "ht864a",
        "author": "-Guardsman-",
        "title": "The Statue of Liberty was a gift from France to the United States. Why do countries no longer give each other such gifts?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/ht864a/the_statue_of_liberty_was_a_gift_from_france_to/",
        "score": 13681,
        "num_comments": 1024,
        "created_utc": 1595035638.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/ht864a/the_statue_of_liberty_was_a_gift_from_france_to/",
        "comments": [
            "[deleted]",
            "The last thing in recent memory was the russian 911 memorial.",
            "Most modern countries give out a ton of aid, but it's usually military or straight money.\n\nhttps://en.wikipedia.org/wiki/United_States_foreign_aid#:~:text=In%20fiscal%20year%202017%20(October,which%20USAID%20Implemented%3A%20%2420.55%20billion.",
            "Canada and the Netherlands have a special relationship resulting from actions during WW2. Canada still receives an enormous amount of tulips as a yearly tradition.",
            "France felt a particular closeness to the United States since their help was so crucial to the US winning its independence.",
            "If you’re looking for a more recent equivalent, every year Norway provides the UK with the huge Christmas tree that stands in the center of London as thanks for Britains help during WW2.\n\nhttps://en.m.wikipedia.org/wiki/Trafalgar_Square_Christmas_tree",
            "Can you imagine the unholy shitstorm that would fall if a country put millions of taxpayer dollars towards a largely symbolic gesture of friendship to another nation in 2020? People would lose their minds.",
            "Norway tried to give a mountain to Finland recently, but our constitution prohibited it.\n\n[Link from BBC](https://www.bbc.com/news/world-europe-37662811)\n\nThe city of Oslo also gifts the x-mas tree on trafalgar square every year.",
            "I believe the Netherlands send some huge amount of tulips to Canada each year since WW2.",
            "I suspect It has a lot to do with taxpayers having more influence over which expenses are acceptable. There would be backlash against such extravagant gifts these days (in most developed countries, anyway). That's why Governments usually disguise major gifts and favors as different kinds of aid.",
            "Didn’t Obama give the queen an iPod?",
            "It still happens to some extent. It's not the same, but China's panda diplomacy does feel kind of similar. Emmanuel Macron, the president of France also likes to give countries actual gifts. I think China got a horse from the presidential guard and the UK got an old piece of art about the battle of Hastings.",
            "Country leaders still exchange gifts all the time.  \n\n[https://www.theatlantic.com/politics/archive/2016/02/the-unusual-gifts-given-to-presidents/462831/](https://www.theatlantic.com/politics/archive/2016/02/the-unusual-gifts-given-to-presidents/462831/) \n\nThe risk is to give an underwhelming gift, offending the receiver AND their country.",
            "The Netherlands sends 10,000 tulips to Canada every year as thanks for sheltering the Dutch royal family during WW2. \n\nFun sidenote, we also briefly ceded a hospital to the Netherlands so that a Dutch princess being born there could retain her Dutch citizenship.",
            "Not exactly current, but Japan gifted a concert hall in the Kennedy Center in DC.",
            "In the London we get a Christmas tree every year from Norway",
            "[deleted]",
            "China gave Denmark to pandas last year",
            "Norway gives the UK a Christmas tree every year that is put up in Trafalgar square",
            "They do. India recently built a dam in Afghanistan. They named it India- Afghanistan friendship dam.\n\n[link](https://en.wikipedia.org/wiki/Afghan-India_Friendship_Dam)",
            "Norway gives a Christmas tree to London every year. It goes up in Trafalgar Square. They have done it for years and probably will carry on for a long time.\n\nIt's not a big gift, but it still must cost enough to cut and ship a 45 foot tree every year",
            "This sounds like a great question for r/askhistorians for more depth",
            "Regarding “abstract gifts” India financed and built Afghanistan’s post-war parliament and this was hailed as India’s “symbolic gift of democracy” to Afghanistan :) \n\nhttps://ariananews.af/ghani-modi-open-afghan-new-parliament-built-by-india-in-kabul\n\nhttp://www.dawn.com/news/1227669",
            "In terms of scale, a similar problem with gifts comes to mind: say someone gives you a great marble statue. Fantastic gift, but where are you going to put it? In those days land wasn't in nearly as high demand as it is now, and we've pretty much seized up the limit on usable land - we aren't getting more anytime soon.\n\nYou get given a great big monument, where will you put it? It can't just *go somewhere* either, it typically needs a place to be at and a decent area around it to separate it off from everything else and allow people to see it. Think about DC, if you've been there, or feel like looking at a map: plenty of the monuments there have lots of extra open space or accompanying features.\n\nIf we were to be given another Statue of Liberty, I don't know where the hell it could even go that would be a deserving spot for it *and* isn't taken up by something else. Sure, you could throw it into Montana or something, but it's sort of spitting in the face of the gift-giving country to not give it a worthy place.\n\nIt's why, today, most countries simply give aid. It's essentially a gift but instead of something for the spectacle, it's something for the practical, which is much better in today's times - we already have enough monuments and the like.",
            "Now they 'invest' in each other",
            "Have you met the USA recently?",
            "Though not as grand as the Statue of Liberty, Norway has gifted England the Christmas tree at Trafalgar Square every year since 1947 to show gratitude foe the help thwy gave the Norwegian Royal Family during the 2nd World War.",
            "We have a park with gifts from twin cities on the side of the river in Cluj, Romania. I think gifts are still happening.",
            "Better question would be why did they in the first place?",
            "We do it V.I.A embassies and stuff, sponsoring exhibitions of our music/culture and stuff. China (fuckers) owns like all the pandas and loans them out to people, as an example.",
            "Not to this scale, but this still does happen all the time.",
            "Because they end up fighting about the gifts afterwards hahah",
            "Think of the US, that's why.",
            "People would bitch about it nowadays",
            "Actually, in the Netherlands we still send about 10.000 tulips each year to Canada for protecting our royal family in world war 2! \n[It’s called the Canadian tulip festival!](https://en.m.wikipedia.org/wiki/Canadian_Tulip_Festival)",
            "Only think that comes to mind is the Christmas Tree from Norway in Trafalgar Square, London.",
            "Here in the UK, Norway sends us a massive Christmas tree every year as a thank you for helping Norway during WWII. It always gets displayed in Trafalgar Square.",
            "It’s a Trojan horse. They just never managed to get out of it...",
            "Where I live in Canada we give Boston a huge Christmas tree each year in thanks for all the help they offered us with a disastrous explosion over a hundred years ago",
            "As an American who who has a lot of distaste for what my country does in a regular basis, I am quite proud that we still have such love for the statue.  It is essentially a symbol of our nation, and a representation of the long-standing friendship we have shared with France.  Our alliance was essentially forged in blood.  France played an integral role in helping our revolution be successful.  Generations later, who was there to save the French from the German flames? That old friend who never forgot the favor, saying, \"We got you, fam.\"\n\nAmerica has devolved into a political and social wasteland... but those past acts are still not easily forgotten.\n\nMost people I know are quite proud to say the statue was gift from france. It's an interesting fact, and it makes it more special... because it isn't just another vanity we built to display how awesome 'murica is... It's a thoughtful gesture from another nation who clearly put a lot of thought into it, and that's a lot more meaningful than something we put up to inflate our own ego.",
            "Nova Scotia (Canada) gives a giant Christmas tree to Boston every year.",
            "Some countries do. The Netherlands sends Canada tens of thousands of tulip bulbs every year as a thank you for things Canada did for their people during WW2. We plant them and have a festival every year.\n\n[Canadian Tulip Festival](https://en.m.wikipedia.org/wiki/Canadian_Tulip_Festival)",
            "Actually it was a gift from France to Egypt. Egypt didnt want it. It's a hand-me-down.",
            "After WWII, Japan offered 53 bonsai trees to the US as a peace offering. One of the trees was 400 years old and was passed down through many generations of a Japanese family who constantly pruned and cared for it. It wasnt until the early 2000’s that Japan told us it had actually survived 2 miles away from The Hiroshima nuclear bomb, adding to its historical value. It survived by being sheltered behind a stone wall. Its still alive today on display in Washington DC’s national Arboretum. They believe the tree holds 400 years of memories in its rings. The monks believe that when we light wood on fire, the light from the flames are the memories of ancient sunlight.",
            "I €ou£dn’t gue$$ wh¥.",
            "The funny thing was that America didnt even want the statue of liberty..",
            "China still lend us Pandas!",
            "The US gave Democracy to Iraq and Afghanistan. \n\nDoes that count?",
            "The gifts are now monetary and largely hidden from public view.",
            "America keeps gifting other countries \"freedom and liberty\"",
            "They do, the US just isn't involved in gift receiving recently since our \"gift\" is typically a platoon of soldiers coming in to secure cheap oil reserves.",
            "What do you mean? America has been gifting bombs for decades now!",
            "When you become the asshole of the world...do you justify gifts?",
            "The US gives various Middle Eastern countries the gift of cruise missiles on the reg.",
            "They all give cash instead.  Everyone loves a gift card.",
            "I would appreciate when we (i live in germany) gift some giant wooden Horses to out Neighbor countries",
            "Y'all. Christmas trees, tulips, and cattle are not \"such gifts.\"",
            "Greeks also gave a nice gift to Troy.",
            "China gave the whole world a gift! /s",
            "They do... Russia gave us a really sweet Tear Drop memorial after 9/11\n\nhttps://en.m.wikipedia.org/wiki/To_the_Struggle_Against_World_Terrorism",
            "I think we can all agree that we have each shared this wonderful virus that is currently making our lives miserable. Still gifting but they're just terrible gifts, that's all",
            "America still gives everyone the finger.\n\nYA I SAID IT!",
            "You may never read this OP, but I believe most monuments are never revealed to us. But you’re right major massive monuments are few and far between. Here’s a cool one from Russia to the US that I always try to remember.\n\n\nhttps://en.wikipedia.org/wiki/To_the_Struggle_Against_World_Terrorism",
            "US sends every power in the world billions on tax payers money every month just so the USD isnt crashing as fast as it is.",
            "Every year Nova Scotia gifts Boston it’s Christmas tree, as a thank you for the aid provided after the Halifax explosion in 1917.",
            "This whole comment section is wholesome and wonderful! Tribes giving away cows, Norway gifting the UK trees, and so much more!",
            "We're past that era in the Civ: Real World expansion",
            "We got a clock from Switzerland in Quebec City (Canada) in 2014 for our 400th birthday (a few years late, took 6 years to build).\n\nIf I recall correctly, it took about 11 000 hours to plan and assemble the 5 000+ pieces.\n\nhttps://www.ville.quebec.qc.ca/en/apropos/portrait/attraits/hotel-de-ville/horloge_jura.aspx",
            "Because the US no longer deserve gifts :))",
            "France should take it back and we can have it back when start behaving",
            "A large piece of steel from the World Trade Center was gifted to Gander, Newfoundland, CA for their aid to stranded planes on September 11, 2001.  It is on display at the airport in Gander. [https://www.cbc.ca/news/canada/newfoundland-labrador/gander-september-9-11-ceremonies-1.3757380](https://www.cbc.ca/news/canada/newfoundland-labrador/gander-september-9-11-ceremonies-1.3757380)",
            "China gifted the world covid",
            "Well for the United States it’s because we’re the asshole that they’re forced to be friends with now out of fear instead of actual friends.",
            "France also helped us win independence, why France so nice?",
            "I feel like I heard somewhere that Norway gave Finland a mountain.",
            "*I put this as a reply to the OP in one of the comment threads, but I'm putting it as it's own reply for visibility.*\n\n\nYour assumption is incorrect here. The reality is, this really wasn't ever a thing that countries usually did. There were gifts for sure, but on much, much smaller scales. One of the most famous being gifts of elephants (and other \"exotic\" animals) way back in the day when an elephant was considered almost mythical back in Europe.\n\nIf you remove the Statue of Liberty from the history of gift giving, there aren't a lot of notably large non-monetary gifts given between nations.\n\nI'll give you a few things to read so that you can realize that the Statue of Liberty is a huge outlier and an anomaly when it comes to gift giving between nations.\n\n* https://www.thefactsite.com/oddest-gifts-exchanged/\n* https://visual.ly/community/Infographics/travel/gifts-given-between-countries-weird-and-wonderful\n* https://www.telegraph.co.uk/travel/news/bizarre-gifts-shared-between-nations/\n* https://www.reddit.com/r/AskHistorians/comments/10k6l3/what_are_some_of_the_most_famous_gifts_one/\n\nAbsolutely nothing else compares. Not even close.",
            "Where are we gonna put new stuff? We already have too much crap. We need to set up a garage sale or something.",
            "Because everyone hates each other.",
            "We gave america Hugh Laurie and John Oliver.",
            "Well, The Statue of Liberty was a big FU to Britain. It's kind of a Masonic thing. Real hush hush. Secret chamber stuff. Unfortunately, today's world is boring thanks to globalization. We all know these countries are just pretending to like each other. It's enough to make you sick. Now we get no gifts nor to we experience the wonderful gift of giving. If we give one country a gift we have to give every country a gift. BLEH.\n\nRemeber when your history teacher told you poor Napoleon had tummy aches? I do. If I saw that B@st@rd today I'd kick him in the crotch",
            "Norway tried to give a mountain to Finland for their birthday. However, due to the Norwegian constitution, this was actually prevented. Article 1 of the _Kongeriket Norges Grunnlov_ (the Constitution of the Kingdom of Norway): \n\n> **Original Norwegian:**  \nKongeriket Norge er et fritt, selvstendig, **udelelig og uavhendelig** rike. Dets regjeringsform er innskrenket og arvelig monarkisk.\n\n> **English translation:**  \n_The Kingdom of Norway is a free, independent, **indivisible and inalienable** realm. Its form of government is a limited and hereditary monarchy._\n\n>  ​\n\n> ^(Emphasis mine, unofficial English translation sourced from )^[Lovdata](https://lovdata.no/dokument/NLE/lov/1814-05-17?q=grunnloven).\n\nThus, as per the constitution, the Norwegian government **cannot** just \"give away\" territory under any circumstances. You're straight-up just not permitted to do it, because the \"realm\" (that is, the land and dominion of the nation) is considered incapable of being legitimately divided.",
            "China just gave the world a gift",
            "[deleted]",
            "Some trivia: the copper ore used for the SoL was mined in Norway, near Haugesund. There is a tiny replica standing at the now flooded mine.",
            "Russia gave Trump to US. more of Trojan Horse, that one...",
            "$$$$$$",
            "Giving financial gifts is more practical.",
            "India gifted Afghanistan with Parliament.",
            "Inb4 it was a failed trojan horse attempt",
            "I still think it’s funny that Costa Rica got “The bridge of friendship\" from Taiwan, but years later when China offered to build a stadium it all went down the drain :P",
            "The  SoL is actually hollow & they  recently found a buncha skeletons inside it wearing French battle attire (Thought they were sneaky DIDNT they?)",
            "It is common to give small gifts like a sword or a vase on diplomatic trips.  In the US we have ethics rules on what can be accepted so most of this ends up in government storage somewhere.",
            "Usually gifts are physically smaller, and presented to the leader of the nation rather than the nation itself. All U.S. presidents in recent history have received gifts from other nations I believe. You can look up what the gifts were",
            "They do, in the form of nuclear warheads",
            "I know Australia also got a nice sculpture from... somewhere... in response to the big fires about 10 years ago. They still happen but maybe not as obvious.",
            "Modern countries give money to each other\n\nBut I agree something like that would be much cooler than just money",
            "So none get offended...",
            "They still do. Russia sent the Tear monument after 9/11.",
            "Well I think in some ways the gift giving process still occurs between different countries.\n\nFor example China gives pandas to the zoos of different countries in what is known as “Panda Diplomacy”",
            "Norway gives GB a giant Christmas tree every year as thanks our efforts during WW2. Its erected in Trafalgar Square and Is truly a great spectacle and a wonderful gesture course.",
            "Britain gave Australia a tall ship to celebrate the bicentenary in 1988. No idea what it cost to build but a 44m tall ship wouldn't be cheap.",
            "The Boulder Dushanbe Tea House was a gift from Mayor Maksud Ikramov of Dushanbe to the city of Boulder, Colorado.[1] - https://en.m.wikipedia.org/wiki/Dushanbe_Tea_House",
            "I think the attitude back in the day was more of a \"oh thank you so much for helping, it was greatly appreciated\" now it's more of a \"yeah, you'd better help\"",
            "Stonks lol",
            "France spent $12 billion on foreign aid last year. The US spent $40 billion. It's a statue. We got enough of them.",
            "Because they're fucking capitalists",
            "Suppose it's all about financial aid.",
            "They do actually. One or two years ago China gifted Trier (Germany) a Karl Marx statue. It's his birthplace.",
            "I mean. I remember Norway gave or is giving a mountain on their border to Finland by moving the border. The mountain immediately became/becomes Finland's tallest mountain but I think it wasn't/isn't even in Norway's top 200.\n\nI'm playing with the tenses because it was on an episode of qi as something that was going to happen and I don't know how recent the information is.",
            "Norway tried to give Finland a mountain (or rather the peak of a mountain) for Finland’s 100 year Independence anniversary but failed",
            "[removed]",
            "I think a yearly  secret Santa between nations would be good. Have a budget cap so everyone gets something nice but not too expensive like a shrubbery.",
            "Riot games returned korean artifact to us couple of years ago.",
            "Countries give little gifts to their allies all the time. However they're nothing like the Statue of Liberty. \n\nActually not too long ago, President Macron of France gifted a tree sapling from Belleau Wood to President Trump that was planted at the White House. Belleau Wood was the site of a fierce battle between US and German soldiers in WW1 France. This battle earned the US infantry and US Marines in particular a fierce reputation amongst the European powers.",
            "Norway still gives England a Christmas tree every year for their help during ww2",
            "I haven't live that long to give a straight answer. But we can find out what happened when they did give it to us. We help them and all of Europe and I would say the world in the Second World War. No other country has ever showing gratitude on such scale that I know of. And what did we do? We ended up calling them pussies. That would dissuade me from giving anything else ever. Also, calling the French pussies or our perception of them as weak is completely wrong. The French gave all they could in both world wars. They suffered massive losses and were already war-weary by the time the Second World War came about. In the second world war America stayed out for as long as possible. We tried to remain neutral until we absolutely couldn't anymore and I would argue that it doesn't display the best morals for what was going on at the time. Now, since war is a business these days we fight them as Americans for corporate interests. I would argue World War II was the last time we joined a cause honorably and without profiteering or imperialism in mind.",
            "Norway gives us (the uk) a Christmas tree every year, however, last year it wasn't \"good enough\" and we moaned about how shit the tree looked..",
            "I heard something about Norway giving Finland some mountains for its 100th birthday",
            "I mean. Not true. America gave a gift of freedom to everyone in need, especially those who never needed it to begin with. I guess they are paying back for that statue...",
            "The US gives out “freedom” to Middle Eastern countries every decade or so. Does that count?",
            "The Netherlands give Canada a shit ton of tulips every year for help during WW2",
            "we gifted Japan something special in the 1940s",
            "China gave the whole world a disease. Does it damn near every year almost. So thoughtful they are",
            "I guess nobody feels any country's deserved one in a while.",
            "What do you mean? Trump just got a desk full of beans. Look how happy he was."
        ]
    },
    {
        "post_id": "akgbn5",
        "author": "Chris-Jean-Alice",
        "title": "Does anyone else really hate hearing or saying their own name?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/akgbn5/does_anyone_else_really_hate_hearing_or_saying/",
        "score": 13666,
        "num_comments": 1566,
        "created_utc": 1548626167.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/akgbn5/does_anyone_else_really_hate_hearing_or_saying/",
        "comments": [
            "It was weird... I almost had an identity crisis.  My husband would always say something like,”babe” and my kids call me mom.  So when I’d actually hear my name it’d be like,”huh? Me?”.  I don’t mind it, sometimes it feels odd... I don’t know how to put my finger on it.  ",
            "I don't hate it, I just don't really feel like it's me.\n\nEDIT: Well, I did not expect this to become my top comment. For those who recommended me to change it, there is a slight issue with that: the name I do feel like it's me is actually just a different language version of my own name.",
            "I hate saying it. But I also don’t like using other people’s names when I talk to them either. I’ve addressed every teacher as “Professor” (in high school I just didn’t talk to the teachers). Not sure wtf that’s about but using someone’s name when I’m talking to them feels so awkward. I only use other people’s names when they aren’t present in a third-person sense (like: “I was talking to Jack the other day” or whatever).",
            "[deleted]",
            "Yes, I do. I don't know why other than I don't think it's a very nice sounding name.",
            "Yea, that's why i changed it",
            "Yes. Pablo. Sounds weird to say it. ",
            "This is the opposite of what Dale Carnegie says... “A person's name is to that person, the sweetest, most important sound in any language.”",
            "Saying my full first name sounds weird to me, as if I'm being told off or something.",
            "Yes, it automatically pulls me out of concentration, so i cant do shit while people are saying my name like\n\n\"Hey ShitfaceMcboogerball\"\n\n*flips table*\n\n\"WHAT THE FUCK DO YOU WANT YOU COCK GOBBLING CUNT\"",
            "I absolutely do, have for years and years- the only time I’m ever called by my legal name is at formal appointments, school, or work.\n\nHave hated it since I was a child, mostly because it’s tied to so many bad memories and such. Finally bit the bullet and began the process for my name change, I have my court hearing on the 5th to get it approved (pending a final step)... there’s no words to express how excited I am to finally be separated from that name.",
            "[deleted]",
            "I hate hearing my own voice played back in recordings.  ",
            "I do not like hearing it during sex, it sounds weird. ",
            "[deleted]",
            "I’m in HS and every time. EVERY single time a teacher has ever yelled “QUIET!” To the class. I always have to look over and make sure they aren’t screaming my name, Wyatt.",
            "I HATE saying and hearing my name it make me cringe. I usually just go by a nick name.",
            "My full name is Ekaterina. I'm Russian but I live in America now, and ever since I moved here I started hating my name. So many people cannot pronounce it, and I dont blame them its not their fault but it just gets so annoying. Everybody calls me by my nickname, Katya, and even that teachers get wrong all the time. Its always something that sound like \"catcha\" or \"ketchup\" but never Katya. I even went by Katie for a while. ",
            "Yes. My name is Donald soooo it’s been a rough few years.",
            "[deleted]",
            "[deleted]",
            "I hate it when people use my name repeatedly in a conversation. Feels fake and like they’re trying to pull a fast one. Ironically I was on the phone with someone recently who had mistreated and enraged me and I found myself using his name repeatedly. ",
            "I use to have a nickname when I was a kid, and now I wish I kept it. I wanted to feel grown up so I started going by my full name, but I'm thinking about going back. ",
            "A lot of people call me by my artist name which is interesting to see who does and doesn’t.",
            "My wife does.  Whenever I use her name in conversation such as, \"Wifesname, (rest of sentence)\", she takes it as though I'm talking-down to her.  She also almost never speaks my name to get my attention, which is strange.  Instead, she'll get within speaking distance and make eye contact while talking.  \n\nMaybe it's a Korean thing, but it's not something I have noticed with other Korean people. \n\nEdit:\nTo be clear, she also doesn't address me as \"husband\" or anything.  In direct English conversation, it's like the person she's speaking to doesn't have a name or title.  She avoids using proper nouns, and generally avoids using personal pronouns to open a conversation.  \n\nHowever, she normally uses personal nouns and titles when speaking Korean.",
            "Maybe I’m a narcissist but I’ve always loved my name. Lemmie. Lol. It’s a weird name but my parents are also sort of weird ",
            "I bet Tikki tikki tembo no sa rembo chari bari ruchi pip peri pembo hated hearing his own name. He wouldn’t have died too early had he not gotten that name. Poor bloke. What a [sad story.](https://www.google.com/amp/s/www.urbandictionary.com/define.php%3Fterm%3Dtikki-tikki-tembo-no-sa-rembo-chari-bari-ruchi-pit-peri-pembo%26amp%3Dtrue) ",
            "hated my name when i was a kid. Teachers, other Kids, well literally everybody asked and still asks me if it s my real name and how to spell it.\n\nHave to add that i m from Germany, we had pretty strict rules about what names were allowed, but they Open up!",
            "my birth name was produced by using the first two letters of my dad’s name and combining it with the last two letters of my mom’s name. I’ve been transitioning female to male for about 3 yrs now and hearing my birthname sinks my heart faster than anything. I don’t associate with my birthdad, but I have close bonds with my mom’s side of the family.",
            "Yes. I hate my name, my voice, pictures of me, etc. I try to keep myself out of as much as possible and keep people from knowing my name because depression and anxiety mostly (depression moreso than anything)",
            "I used to hate my name, hated when people said it to refer to me. Then I realized I'm trans, and I love my new name",
            "My name is personal, it's reserved for people that know me. I have serious issues when customers call me by my name or when people I'm only acquainted with use my full name. ",
            "I always wondered if others felt this way, i personally love my name but for some reason get this little rush of anxiety when i hear people say it. Maybe its because it has so many syllables, 4, instead of only 1 or 2. And i loathe every nickname i have had because of it. The only one i ever liked was Vic.",
            "I used to hate my name a ton, but it turned out that I was just a transgender woman. Ever since I changed my name to fit with who I am, I've loved it a lot.",
            "I’m trans, hearing my dead name is fucking terrible, hearing my preferred name makes me feel kinda nice.",
            "Its not that I hate being called by my name, I just have a preferred nickname depending on the status of the relationship.\nIf we're not that close, I don't want to hear you using my nickname.",
            "I did. Years later I realized I was transgender and hated how feminine it was, and changed to a neutral name.",
            "I hate hearing my own name, though some days I’ll keep thinking I heard it, then I look around and realize either no-one said anything at all or said something entirely different. \n\nI also hate saying people’s names; including my own. My mom was gonna name me Trevor then changed to Ryan because “oh, so many people recommended it!”. Nice job standing your ground Mom, I prefer the name Trevor anyways! Ryan, according to her (haven’t heard this anywhere else) ended up being the most common boy name that year.",
            "Yes which is why I changed it. No longer have a mini heart attack when hearing it.",
            "When ever I hear my last name I cringe and my adrenaline gets fired up as the hate engine prepares for ignition. Thanks Army. It's a serious teeth grit, stress inducing, cortisol spiking, beta adrenergic response. But only when I hear only my last name. Not my first. Not my first and last together. Only my last. ",
            "I absolutely despise hearing my birth name. Love my nickname though ",
            "/r/DoesAnybodyElse",
            "I hate mine. No reason, just that everybody calls me by my nickname and when I hear my actual name it feels very serious",
            "Fucking hate it cause it's the same name as a Disney character and everyone is like \"Oh, like _________?\"\nNo, fuck off. \nGot so much crap in elementary school. Still hate it. Gonna change it when I pick one I like. ",
            "I like my name but the only thing I hate about it is when people ask how I prefer it pronounced, wether it’s Fly-ing or Fl-ying and I don’t really have a preference because I answer to both, so I tell them “whatever rolls off your tongue better” but some people insist and to those I just tell them to go with a shorter nickname like Fly or Flyi which is fine as well. \n\nDon’t get me started on the last name though most people I meet pronounce it Chihu-ahua except for other Spanish speakers who most times will pronounce it correctly. \n\nOther then that I don’t really hate it in fact I’m kinda proud of it.",
            "I don’t know if I necessarily hate it but I always cringe when I hear my own name out loud for some reason ",
            "I have an unusual name and you inevitably go through the same routine when you meet someone: you say it, they say it, you repeat it correctly, they ask you to spell it, you spell it, they mispronounce it, then ask if it is a family name — it’s not so you have to tell the story ... it’s just exhausting.  I’m jealous of people named Ann. ",
            "I'm trans and I really hate any instance of my deadname being used.",
            "I work retail and have to wear a nametag. I HATE customers saying my name. They don't know me and usually treat employees as less than human...it feels icky when they use my name.",
            "I really hate using other people's names. I'm allright hearing my own, unless people the 'you're in trouble' voice",
            "Yes.  I have a really weird name and guarantee 100% I'll have to repeat myself at least once when introducing myself to someone.  I just go by a similar but more recognisable name now.",
            "My name is Ariel... I'm a guy. Yes, very much so. ",
            "I always kind of mumble my name, I don't know why, but it always causes me to have to repeat it to people at coffee shops etc. ",
            "Yes, I feel like it sounds weird when I hear it. Other people with my name when I know someone's calling them don't sound weird to me though.",
            "I actually like people saying my name. As weird as it sounds I kinda like the “attention” behind it. Idk I just like knowing that I’m on peoples minds lol",
            "Kind of. I'm from the Southeastern US. In general I have a \"TV accent\". I sound like people on television. But for some stupid reason I say my name so freaking weird when I introduce myself. It's one of those names that could be a different name with the addition of a letter, so people call me the wrong name frequently due to my own accent.",
            "I go by a nickname and I don’t hate when I hear that, but I hate the sound of my real name so much that when someone says it, it literally sends chills down me and I shiver so yeah I’d say I despise my real name. Actually now that I think about it I don’t really like hearing my nickname either so",
            "My name is Lydia and when I'm asked it like at sbux, for some reason I say uh before like I'm thinking and I usually get the name Alidia called out when my drink is ready -__-\n\nI can't even say my name right to even hate it.",
            "Depends on the context really, but what I do hate is that my name sounds like a lot of common words so I mishear them as my name pretty often.",
            "Not really but every time somebody says backup I think they’re calling my name. (My name is Beckham)",
            "The short form of my name is dead to me.\n\nI used it years ago, when I lived another life in another city.  Now hearing it just makes me sad.\n\nI'm not that person anymore.",
            "Yes. I hear so many people tell me that they love my name, they think it's pretty or cute or whatever.\n\nTo me it sounds childish. I always feel like I'm mispronouncing my name when I introduce myself too, like it just sounds wrong.",
            "yeah, it’s a word and it’s really annoying to have the same three puns made over and over every time someone learns it.... but i don’t know what i’d change it to.... so i guess i’m stuck with this lol",
            "I hate saying my name, but I sure love hearing other people say it, especially if they pronounce it correctly.",
            "I used to hate being called Andy (and still do) so I used to disregard Andrew all together and called myself Jim. I’m happy to have grown out of that phase. ",
            "I hate saying it, but I quite like hearing it, it's a really weird confliction",
            "Nope",
            "No, Chris.  Can't say I do. However I have the kind of name that I think I hear all the time, like in a crowd or something.",
            "I bet ur a Larry ",
            "I really don't like my current name. It's John. Plain old john. It gets really old to hear people saying johnathan and johnny. I never use that name online because there are many better names I would prefer to use. My reddit account is not an example of a good choice of name, though it was the same username I had on wizard101 when I was a lot younger.",
            "It's anxiety. I have it and can confirm.",
            "I love my name and allllll the nicknames people come up with for me. Maggie has lots of iterations :)",
            "I don’t usually hear my name unless my boyfriend and I are fighting, so yes, I hate hearing my name. ",
            "I do, I just don’t like it. I would like to go by my middle name but I’m kind of afraid to do so",
            "Yes i thought i was the only one",
            "I'm dating a girl with the same name as me, so it's basically been like immersion therapy for this.",
            "/r/egg_irl",
            "So...... I lisp a little on the sound 'ru' in the word run. And my name is pronounced 'run' 'jun' and when somebody ask my name, I usually say my nickname because i have difficulty pronouncing my name. I hate pronouncing my own goddamn name.",
            "[deleted]",
            "Yes. Whenever I hear my name I feel like I’m going to get scolded or someone is trying to sell me something ",
            "It’s weird because I don’t like it when others say my name or if I say it either. My dad named a cup his “Jamie cup” because I bought it for him and he always asks me for it by that name “do you know where the Jamie cup is?” I heavily sigh and ask him if he’s looking for the coffee cup.\n\nIronically, I don’t have a problem saying my name if it’s for someone else.",
            "Yes, I DESPISE being called by my first name, and very strongly prefer my middle name. Unfortunately I used to have a lot of issues speaking up, so people I've known for years got used to using my first name. Now that I've started being a little more adamant about the name I prefer, there are still a good amount of old friends/acquaintances who still use my first name, but thankfully anyone new I've met within the past 2~3 years uses my middle name.",
            "99% of the people I know say my name 100% incorrectly. The older ones have been calling me the wrong name for my entire life. It's extremely awkward, because I hate answering to a name that's not mine, but it's so incredibly weird to say to someone out of nowhere, \"By the way, the name you think is my name is not my name. That's right, your whole life is a lie!\" My mom once spoke on my behalf without my knowledge or consent, and told someone that I \"prefer to be called X\" (terrible way to phrase it, but whatever). It was absolutely the worst, because when I came back into the room, they said to me, \"your mother tells us you've changed your name.\"    \n\nSo, now I hate introducing myself, because any time I say my own name, there always seems to be someone else nearby who thinks my name is [wrong name].\n\nAs a kid, I also hated answering my mom's landline (yup, they still had those when I was a kid), because if the caller asked who they were speaking to, I wouldn't want to say my real name, because they wouldn't know who I was talking about, but I wasn't going to say the other name either, because it wasn't my name and it wasn't what I called myself ever. So I would just say, \"It's [my mom]'s daughter.\" And then if they went, \"Ohh, hello [wrong name]!\" I wouldn't have to say my name, but I'd dread someone saying, \"Oh, X's daughter, what's your name again?\"    \n\nIf you're wondering how the hell I got into this unrealistic predicament, it happened because as a kid I was too timid to correct people who called me the wrong name. So more and more people just called me that name, and introduced me to everyone else by that name, until eventually the whole world thought that was my name.      \n\nNow I'm a legitimate adult with a healthy enough self-esteem to correct people, and it's too late.    \n\nI  t ' s    t  o  o     l  a  t  e.",
            "I'm late.. but I hate saying my own name. However, I love hearing other people say my name and I don't know why. ",
            "Yeah Longrod VonHugendong doesn’t roll off the tongue quite well",
            "Depends on who says it. \n\nSomeone who routinely judges me, puts me down, and makes me feel bad about myself? I don't want to hear them say it. \n\nThe girl at my work who is probably closer to me than my family? Her saying it makes me happy. ",
            "Yes.",
            "I don't really hate my name, I just find it weird when I say it.",
            "No, I have a unique name so I get a little song in my head when I hear it unexpectedly like in a show or movie",
            "I hate it when people say my full name, and I hate saying my own name. ",
            "I sometimes worry that I'm mispronouncing my own last name. It's not common, and I learned it from my parents, who have regional accents. Maybe they're fucking it up. I'd have no way to know.",
            "I don't like saying my own name because I don't enunciate it properly so it always takes two or three tries before people get it right and it's entirely my fault. I like my name though",
            "I don’t hate it but I hate when parents name their kids with the same name and yell their name in public when I’m standing right next to them. I’ve almost asked what they wanted a few times. ",
            "There’s research that says the best sound for a person to hear is that of their name. Which is why they encourage people to say the names of their significant other on first dates. I work with an older guy who happens to have autism and he says my name at least 3 times in EACH sentence and I’ve grown to love it! It means me feel acknowledged, heard, and just like the person talking to me is very invested in the convo. I’m making it a point to start using people’s names more in conversations. ",
            "I just kinda cringe whenever someone says my name. I dunno, maybe a little embarrassed, maybe I don't feel like a (my name). If it's my parents, it's okay. If a game has text where they use your name in dialogue, I always change it to a different name because it's weird. Maybe it's because I got used to ignoring my name at school because there were so many people with the same name. But whatever it is, I know I like introducing myself as the nickname my friends gave me, it feels more 'me'.",
            "No, actually i find hoboslayer to be an entertaining name to be heard.",
            "I don't hate my name but I can't call my husband by his name. Hes usually just babe so if I use his real name it makes me feel like hes in trouble lol ",
            "My name was just fine when I was younger but it’s not one of those names that age well as you get older. It’s cringy to hear my name now that I’m staring middle age in the face when it’s more suitable for a 5 year old \n\n",
            "My name is Christian, and I live in a Christian community. You get used to hearing your own name ten thousand times a day.",
            "I don't mind hearing it, unless it's in a context relating to a performance or stand up routine, but in that case it just makes my stomach churn and sounds wrong, like they accidentally said my name instead of someone else's.\n\nI definitely hate saying my own name, but I don't know why and never considered it much until I saw this post.",
            "I’ve always really hated my name but it turned out I’m trans so I’m assuming that was it. My birth name is exceedingly feminine and made me feel like garbage but now I can appreciate it from a distance, it’s pretty it’s just really not me. ",
            "My name is like the 4th most common name in Middle East! When arriving to the USA they fucked my name up even more.\n\nNow I hate it more than anything else. But won't change first name, maybe I might switch my last name :)",
            "I chose a new name for myself. My old name was not me, it was one given to me, and I am not obligated to go by it. Eventually I will get it legally changed. I feel so much better, having a name of my own that fits me. ",
            "I always disliked my name and my friends started calling me a more gender neutral version of my middle name. \nEventually i realised i am trans nonbinary and have since changed my first name to a full version of the middle name nickname. Took a while for my parents to accept it but the other day they brought me a surprise cake with my new full name on it to celebrate my legal name change 😊\n\nEven if i may change my mind on how i identify one day, i know that my new name feels so much more like me than my original name ever did, and i dont cringe at telling people it.",
            "I've had a bad history with my name (haha) because my parents abused me... So it doesn't feel like it's mine. ",
            "I hate my name. It's a very Muslim sounding name and I was raised by extremists. I'm not even a practicing Muslim anymore.",
            "I don't like my first and last name. Hearing my super-common first name is white noise and I don't respond to it in a crowd. Family and friends use my nicknames. Strangers call me ma'am. Business people use my last name because there's already 4 of my name working there.\n\nI just dislike my last name in general. Very common, but some smartass always has a \"hur hur are you related to this random person with the same last name?\" No. I'm slightly less common than Smith, GFY. If I had a dollar for every time I've heard that crap, I'd be golfing with the 1%.",
            "Kind of related, a reasonably famous person died recently and they shared my name. I tell you it's really weird to hear your name on the news. Especially when death is concerned.",
            "Justin. It sounds so infantile or childish to me - obviously adults have the damn name, I'm 33, but it sounds like something you call a kid, not an adult.\n\nI hate it. Yes. And if your name is Justin I hate I too! ",
            "Abso-fuckin-lutely.  \n\n\nNow, granted, I am a trans woman, so that sounds like duh obviously.  But like-even before I was anywhere remotely questioning that stuff, I hated my name.    \n\n\nJonathan.  \n\n\nI don't think I've ever had a class where there wasn't at least one other jon or john, jonathan, johnathon or whatever.  I've always joked that if you yell for jon in any given room, you'll have at least 8 dudes asking \"me?\" It's so common and generic I hate it. I'll go by my middle name if there's ever a class where I know there are other jons in there.  But then I'm not a fan of doing that because it's also my dad's middle name, that he regularly goes by.  \n\n\nBut the bow on top of that: my last name too.  \n\n\nJonathan Carter.  \n\n\nFrom mars. The year that movie came out do you know how badly I wanted to change my name?  Even aside from that-I've had people ask if that was a fake name, accused of giving a fake john doe name.  a friend said \"it sounds like a generic white male protag of a shitty Hunger Games knockoff\"  \n\n\nEven before any gender stuff I wanted my name changed. Any nicknames given I latch onto wanting them to stick.  When I started competitively playing games, and made bunches and bunches of friends from that; I introduce my self as Klaww.  \"oh no, my name's X, whats your real name?\" sorry, it's klaww. ",
            "I hate it because it's not my name, I'm a closeted trans woman so it's really distressing for me.",
            "My legal first name was used to make some stupid point, so I'm generally not that fond of it.",
            "Is your name abcd?",
            "Used to, then I made up a name I liked and legally changed my name to that. ",
            "My name means love in my native language. To this day I have to listen to the same corny jokes, even from adults. And school was so much fun. One good thing is I've recently moved to a different country and no one knows what my name means here, it's like I'm finally free of it.",
            "Server here👋🏾 my name is Kiswana .  Literally sounds exactly how it's spelled (kiss-wanna).  I love my name , what I hate is having to explain how to pronounce it to my guests during peak restaurant hours. It's rather annoying and gets old when I'm in the weeds.  The thing I hate most is the whole heeeyyyy you know what would be realllly cool ?? Like if it was the other way around ehhhh ehhhh you know like wanna Kiss or something. I usually respond with a blank face like yeah sooo have we decided on entrees or should I come back? And don't get me started on the elderly old patrons who every once in a while call me iguana. ",
            "First name is Alpha so I'm the envy of a lot of people lol",
            "I have an unusual name (Miles) so when I hear it said in the context of a name (not miles per hour) I always think it's me.",
            "No ",
            "I physically cringe every time I hear my name. It means I have to interact with people",
            "Sounds like youre living with a lot of undeserved shame about yourself.",
            "Yeah especially during sex",
            "I hate saying my name. Saying the word \"Sean\" just sounds wrong to me ",
            "I like my name, but I don't like my first and middle said together. It was only said when my mom felt the need to strike fear into me, and my grandfather says my middle \"Like the French Male version\" of it. (His words, not mine) I hate it...",
            "I love my name! And I’m actually kinda thankful my mom named me Jordan.",
            "I just hate that I can’t go a day without meeting another person with my same name, “Mike”. Like I work with another one, my mom dates a guy with the name, I was in a fraternity with 3 others. It gets annoying quick. Maybe I’ll revert back to Michael? Hmmm",
            "I don't mind hearing my own name, but for some reason I really don't like to say it. It feels like when you say the same word over and over again until it has no meaning. Only I don't have to repeat it like that, it's just naturally weird for me.",
            "I have a love/hate relationship with my name. My name is made up of both my mother's maiden name and my grandmother's (father's side). My grandmother's maiden name is my first name, and my mother's is my middle name, which I go by. Confused already? \n\nIt is an uncommon name. There are others with my name, but we are few and far between. Whenever I am at a fast food place or have to give my name to someone over the phone, I immediately say it as loud as I can without being obnoxious (so they hear me), and spell it for them. People still get it wrong. It's mainly the last letter, which is an \"R\", that people mistake for an \"N\", so I really stress the \"R\". It takes people a few attempts to pronounce it correctly, even more to remember it. It is frustrating because it is a part of my identity and my family's legacy, but I feel like people unconsciously judge me because of it since it isn't a \"John\" kind of normal name. Also it is super awkward when people try to get it right, but keep failing and I keep repeating it to them like we don't speak the same language or something. \n\nI am American (White male), and my name sounds like someone who died in the Civil War, fighting for the Confederacy.  It's so clunky and full of odd letter combinations it feels like my letters are falling down a flight of stairs every time I say my full name. Ugh! I have thought about legally changing it, but I am the last male born with my father's last(maiden?)name so, there's that to contend with. \n\nIt is exhausting having to correct people with my name in casual conversation. People look at me like I'm an asshole when I do this, so most of the time I just let them mispronounce it just so I don't have to deal with it. \n\nHaving a unique name is kind of cool, and when people finally understand it, they are like \"OMG WHUT A KEWL NAME!\" But for me, the cons out weigh the pros quite a bit. \n\nMy last name is both funny and sad. I got made fun of for it in school. ",
            "Other people with the same name I dont mind saying. But when someone asks me my name I feel so weird and uncomfortable saying it. ",
            "I’m either Mom or Babe & I go by my middle name at work. So when I hear my first name (Priska) I actually like it. I get all fuzzy inside when my hubby calls me Pris.",
            "r/egg_irl",
            "Yes, only because my name is also the name of a very famous city so I hear it constantly and think people are talking to me. ",
            "[deleted]",
            "YAS.",
            "Only when whispered. ",
            "Yes. Because generally when people call you by ur name they don't know you well or like you enough to call U by a pet name etc",
            "Yea because my name means penis to british people",
            "[deleted]",
            "why because it sounds bad or do you associate it with something bad."
        ]
    },
    {
        "post_id": "15hta6s",
        "author": "No_Blackberry_7907",
        "title": "Why do I mentally feel 21 when I am 33 (male)?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/15hta6s/why_do_i_mentally_feel_21_when_i_am_33_male/",
        "score": 13659,
        "num_comments": 4461,
        "created_utc": 1691134508.0,
        "selftext": "I am married, employed and have a 4-year old daughter as well. Though my body is no longer what it was 10 years ago, I still imagine it as 21 when I got out of college. Do other men feel the same?",
        "permalink": "/r/NoStupidQuestions/comments/15hta6s/why_do_i_mentally_feel_21_when_i_am_33_male/",
        "comments": [
            "You know what's really going to bake your noodle?  When you still feel 25 but you see a 58 year old face in the mirror.",
            "that never goes away",
            "I feel like I'm mentally stuck in 18 yo. It's scary when other people younger than me look up to me to hope some kind of adult guidance... like bruh, I'm probably has less experience than y'all here",
            "Go spend time with some 21 year olds. You’ll quickly figure out that they are much more childish than you think. \n\nPersonally I’m quite glad I am not 21 anymore. No one takes you serious, you got no money, you understand very little of the world. \n\nEmbrace your age. As a society we worship youth, which is ridiculous. Start looking up to experience instead of naivety.",
            "This is common. Ask any person over 80 what they feel like inside. \n\nMy suggestion is to examine what in your life you feel like you missed out on. You’re well into adulthood. Maybe you’re just noticing that now? Or maybe you thought it would feel differently to be married and have a kid? Sometimes it is a shock to reach a certain age only to discover that a lot of people are not truly  “grown-ups” either, not on the inside. Everyone is just making shit up as they go.",
            "You DO feel 33.. it's just that feeling 33 doesn't feel like you thought it would.. you've never been 33 before so you have no idea what it actually feels like to be 33",
            "Anyone who experiences doubt still feels like a kid on occasion. It's normal, no one is 100% at everything, even as adults, and the people who believe they are are deluded and will lead to problems.",
            "You always feel like that. I'm 40, worked professional jobs with CEO's  all corporate people.   I've always felt like that being at corporate meetings talking to all these people thinking I feel like I don't belong cuz in my head I feel like I'm a 20 year old kid in school still but they all probably feel the same way.  I always thought being in a higher position I would feel older more in charge of everything but mentally I still feel like I'm 20 and in college.  After a hard day of work with professionals in meetings I go home and play video games lol",
            "At 68, cancer, MS, COPD, asbestosis, shuffle when I get out of bed in the morning, still working, still making mistakes, saying dumb things I regret, look like that old man on the Muppets in the opera gallery.  My second wife, after 25 years still thinks I'm a player. Shoot, been screwing with a limp pecker for so long I can row a boat with a rope. Yep, my mind still thinks I'm 21.",
            "I'm turning 35 in a couple of days, and facing the fact that i'm likely (best case scenario) approaching my half-way point is depressing as fuck.   \n\n\nI still feel mentally in my early 20s and still connect the best with the 20-something folks at work. Am intelligent and professional, but inside am just a big kid that looks forward to getting home to do some gaming just like I did 20 years ago. Urgh.",
            "As a kid, you long to be an adult because you look up to them and think they have it all figured out.\n\nAs an adult, you realize that the majority of adults do not have it all figured out and most people are just winging it.",
            "We form most of our permanent identity and self-concept around that age, so most people feel that way to some extent.\n\nSource: my therapist when I asked a similar question.",
            "Embrace it. If you can hold down a real life (whatever that means to you, in your case a family and job) then whatever. Shit I'm 40, integral in my 9-5 position, breadwinner for my home, sole maintainer of our property, and I dj raves like twice a month because it's fun.. People that tell you to grow up can fuck all the way off.",
            "What does it mean to feel mentally 33? Turns out it isn't really different to 21.",
            "Dude, I'm 57 and the 14 year old boy staring out into the mirror is very disappointed with me.",
            "Welcome to my world. I'm 56 physically but still 21 mentally. That never goes away.",
            "My kid says I’m an 8 year old in an old man’s body.\n\nIdk, I just like to have fun and be happy",
            "You’re coming to the realization that all adults still have their kid brains. How much they let it show varies from person to person.",
            "It's not just a male thing.",
            "My father told me that mentally he feels yoing and then has to wonder who that old man in the mirror is.",
            "It probably because ur healthy. Some people have conditions ya know and live in pain. You dont. Probably not much has changed, ur only 33 lol ur not an old man.",
            "I'm 54 and still feel that way. I feel more comfortable with my 22 year old son and his friends than I do with my friends sometimes.",
            "40s - feel like 16 most of the time, unless its partying, doing most stuff...then I'm 60ish lol  \n\n\nOne thing never changed for me though - when i see boobs its 100% the same happy reaction every time :D",
            "Everyone feels like this",
            "Hang out with some 21 year old males and listen to the dumb shut they say. You may have matured more then you know",
            "Dude I'm 30 and I feel 18.\n\nMy dad is 65, he feels 18.\n\nIt never changes. We're all just winging it bro.",
            "i'm 13 and in many ways behave and see myself as 3",
            "I am also 33 male, and I feel about 25. But I play video games and hang out with people around their mid 20's so I learn to act like them too",
            "when i was 25 i wondered the same and i asked a 35ish year old, and he told me he still feels like this. So i asked a 45yr old and got the same reply. I ended up asking 50 and 60 plussers as well, with the same result. So it never goes away.",
            "Tldr: because mentally the difference between being 21 and 33 is not as big as you thought it was when you were 21.\n\nPeople physically age as the years go by, of course, and for younger people the differences in appearance make the 'older generations' something _different_ from themselves. It's hard to imagine that someone that looks clearly different is still essentially the same person that they have always been. (Nb 'younger' and 'older' relatively speaking, of course.)\n\nIf someone is 22, it's easy for them to look at being 32 as being just as far off into the future as 12 is into the past. But that's not true. Life experience matters, but people don't change in same way they used to as teenagers.\n\nSomething that blew my mind was reading the book 'Other Minds' (ostensibly about octopuses, but covering lots of things). In it, the author made the point that there's nothing intrinsically biologically necessary about growing (physically) old. We tend to think of age as being the body literally just wearing out through use, but that's not why the body ages. For any animal that reproduces at age x, any random mutation that affects that animal before age x to the point of reducing its chance of reproducing also reduces the chance of that mutation being passed on. If a mutation kills an animal before age x, then the mutation won't be passed on. \n\nBut _any_mutation that only affects the animal after age x, will be passed on to its offspring. Those mutations will tend to spread, without anything to keep them in check. And more mutations will likewise develop, and more. Mutations including serious disorders, as well as things like aging skin, or greying hair. If those mutations hadn't occurred, people might still have the bodies they had in their twenties, even into their nineties or beyond. I'm curious how people would see 'old age' if that were the case.",
            "at one point honestly when i was 18 for some time i felt like much older mentally. like a proper grandpa. than remembered i was actually 18. this REALLY put into perspective for me it all.\n\nold is a mindset.  \n\n\nall the people even the youngest you know, that just got born. they ll get to those ages eventually so why stress about it. might as well try to be the one who handled it the best.",
            "I'm 74 and I still feel 21.  \n\nExcept for the aches and when I look in the mirror...",
            "I still feel like a teenager. I have two children, yet somehow feel like I'm not supposed to tell people that because, hello, I'm a teen mom... That's not something to be proud of. \n\nBut no, I'm 35 lol",
            "Youll hit 40 and everything will play catch up reeeeeal fast",
            "I'm the same age as you OP, and I do not feel that way. Go hang out around some 20 somethings and I think you'll realize you definitely don't feel 21 anymore.   \n   \nPersonally, talking to anyone under about 27 is exhausting. You don't realize how drastically different your life is until you talk to some people that really don't have their shit together and are interested in doing a bunch of stuff that you lost interest in years ago.    \n   \n> Though my body is no longer what it was 10 years ago   \n   \nGo to the gym. My body is better than it was 10 years ago.",
            "Bro I'm 44 with a career, a family, a house and buy all other accounts; I am a functioning adult. \n\nIt's all an act. I do what I'm supposed to when I'm supposed to do it but in my heart of hearts I'm still a kid.\n\nOn the other side of the coin, I feel like I'm in my 20s until I talk to a 20-year-old and then I'm like nope,  I'm in my 40s and the 90s weren't 10 years ago.\n\nAlso my knees/ back/ etc. I saw it somewhere where it's like. I feel like I'm 20 years old again and my knees are like the fuck you are.\n\nTime is a human construct. Nothing means anything. Go find your joy.",
            "I’m nearly 39f and honestly still feel like I’m 16. My body on the other hand, that feels like it’s 100",
            "I felt 19 until i hit 61, and suddenly had trouble putting on my underwear. Shoulda kept doing yoga. Lol",
            "Women too. Not just men. You always feel the same.",
            "Think it applies to women as well. I thought when I became 30 I was supposed to feel 30 but I still feel so young.",
            "Not just men.",
            "I'm 43 and I've been on the tom brady plan. I mountain biked my whole life but after mellowing out a lot after high school, i started to get back in to it more seriously around 2001. Every year I set it up more and more. Compared to where I was in the mid 2000s, and especially where I was in the mid 90s, I'm an absolute animal. Some day I suppose I physically won't be able to keep getting better but that day is not here yet. \n\nAnd when it comes to just over all physical \"feel\", I've long since cut out all sugary beverages out of my diet and that alone changes everything. As a teen I used to drag my ass around the house. Without the sugar, now I can run around all the time. I never feel sick randomly, I highly recommend ditching all sugar drinks. \n\nI've also been lucky that I've had no real joint issues or anything like that. Any MTB injuries I get still heal pretty quick. So all in all yes I feel like I'm 21, except when I was 21 I felt like I was 31. But when I was 31 I felt like I was 24. \n\nIf we're forgetting the physical and only talking about mentally... I've had a few setbacks in life and they've kind of left me stuck in the same place I was when I was 21, which is very discouraging. So mentally I feel like I'm still 21 but in ways I wish I didn't.",
            "I'm 49, my kids (!) are 23 and 19. In my head I'm early 20s at the most. I just wish the rest of me was too....",
            "In the past, there were significant cultural milestones that signaled a transition in behavior to how we conceive “older” people to be. For many reasons, we don’t actually see or perform that transition anymore. We don’t generally have multigenerational homes. We can’t really buy a house. It never really feels secure - everything from economy, to politics, to increased mental health issues, to global warming all keep us in that state of unsureness. And most of us didn’t have a model for what a patriarch should really look like - we either saw our grandparents and the disconnect our parents had with them, the abusive side of the toxic elements of it, or both. Gen X for the most part rejected those kinds of boxes. In a sense, there isn’t a way to feel older anymore because we don’t know what that looks like; we’ve just seen some rare cultural artifacts of people ‘acting’ older. It was a social construct, and it’s mostly extinct.",
            "33 here, still feel like a little kid talking to other adults...",
            "This is just what 33 feels like, you just have no prior experience with being 33 to reference :)",
            "Totally normal. I turned 60 last month and I still feel like a 15 year old sometimes!",
            "You ARE an age - it's a fact. You don't feel an age. \n\nI'm twice your age and still feel 17.",
            "53 and as immature as my grandkids. I just spend way more on my video games and toys!!",
            "I'm 41 and feel 22-25. Definitely does not go away for better or worse",
            "Female, 43…I will forever feel 21. I’ve realized that’s the age I somehow will always feel. Mentally I suppose, because my body does feel 43. Thank goodness I’m not alone.",
            "My first moments of realizing kids saw me as a full fledged adult were so funny and sad all at the same time, because I still feel like a kid. I watched  a little girl knocked over utensils when running in the grocery store. I saw her turn on her heel to run away without picking it up. We made eye contact and she sullenly turned around to go pick it all up. I was so shocked I didn’t think to go and help her.",
            "Most other people feel that way.",
            "35 year old man checking in making sure we’re all still 20! ❤️",
            "I'm 41 I still feel the same.... Just make better decisions I feel like but I still feel 21",
            "Nobody knows what they're doing, everyone is making it up as they go along. The people who seem to really have their shit together? They're just really good at pretending, or are stupid enough to not have a critical thought in their brain and think they really do have it all figured out. They don't. No one does.",
            "Feeling like an age is like fitting into a stereotype more than another tied to a stat of yourself. I think many people agree that you can Also feel like multiple ages at once. \n\nTo know Why 21, i think you need to do soulsearching yourself as to what you associate to one age. Like when i was 13 i felt like 30 because I thought about the big things in life and werent interested in social trends. But looking back i feel like i was that age because now its more of a defining characteristic of 13 to me to deny feeling a lot of angst.",
            "One of the secrets of our world is that no one 'feels' like an adult. At our core we're still all those children growing up and not quite knowing what's going on.",
            "that's pretty good.  I feel 12 and I'm in my 40's.",
            "dude im 36 and feel like im 18 still.  no kids. no gf. never married.  high school senior till i die (minus the drug issues)",
            "That’s around the time your brain stops cooking so since it isn’t really changing too much you don’t feel older. Your body on the other hand…",
            "I only feel like that until I meet actual 20 year olds. They are children.",
            "I asked this to my dad one time, and he just looked at me straight in the eye and laughed \"It never changes\" \n\nI'm 26 and I still feel like a high schooler, but too lazy to feel the wave of emotions I felt back then lol",
            "Every adult is a teenager who has no idea what just happened.",
            "48 and I still watch cartoons and video game. Gotta have play in your life.  \n\n\nI \\*never\\* want to feel my age, despite my knees' best efforts. I feel sad for some older neighbours I have in their 60s who act in their 60s. Literal get-off-my-lawn is the highlight of their day.",
            "30’s the new 20",
            "Your soul is immortal.\n\nYour body is not.",
            "I felt that way until I hit 35 and then I felt 50. All smooth going til that check engine light comes on.",
            "I live a similar way. Have a 6 year old. Honestly it makes life fun. I don’t take anything too seriously and enjoy being the fun dad for all the kids.",
            "It doesn’t change, I’m 58 and still that way",
            "When you’re young you think you’ll feel different when you’re older.  The reality is you always feel the same inside, but your body starts to betray you and you wonder how the hell you can wake up with a calf cramp.",
            "My mom turned 68 last month, she always says she still feels like she’s in her 20s mentally",
            "I am 70 and am still 18 in my mind, even though I know I am not.",
            "Yes, I feel this way too. Also, I feel like I'm supposed to act a certain way bc I'm in my 30's and married but it's, odd, I feel just like I used to in my 20's. It's like your brain doesn't age the same way your body does.",
            "I'm 32 and feel the same way. Every now and then, I look in the mirror, see all the grey hairs forming, and get depressed for a moment, thinking my body is starting to give up on me. But I'm also not going to waste time and money dying it all the time.",
            "There are no rules on how a certain age should act and feel. It’s a social construct and people made it up for some stupid reason",
            "Wait until you are 60.",
            "39, feel 25, look 33 (according to others opinions). I think a lot of us are like this.",
            "[removed]",
            "30 yo woman. Feels like I’m in my late teens/early twenties mentally. I can organize my thoughts properly before I talk, but my internal monologue is still “haha big thought go brr”",
            "I’m 35 I absolutely feel my age, I also prefer my 30s to my 20s. I think a lot of men in particular are emotionally stunted by being taught to shut off their feelings which are a critical component to learning about yourself and growing up. Some women are stuck trying to stay innocent which hampers your ability to explore yourself. Additionally if anyone is stuck in depression it can be hard to feel like you can grow because the thought of anything seems exhausting. If you feel mentally much younger than you are get some assistance and find a therapist, you have so much of yourself left to discover.",
            "Was out camping with my mom, she said she still feels 35, l told her she has to be at least 40, because I'm 37.  Lol. We we talking how it's only when we stop and think of our children's ages that we feel our age",
            "My grandfather is 91 or 92. He says that when he's sitting down, he feels about 25 years old. It's only when he goes to get up that he feels the extra decades of wear and tear.",
            "I'm 48 and keep thinking I'm 25 until I look in the mirror lol",
            "Im 52 and still feel young mentally",
            "My personal theory is that you don't get order, you get more experience.\n\nBetween 18 to 20sh your mind gets to its final versión, and then, life hits you, you just learn what works and what does not.\n\nThat is why as you grow order life seems to go faster, because each second you live is a smaller part of your whole life",
            "Dont worry the older you get the younger you feel, im 56 and feel 11, lost and confused!!",
            "I'm in my late 30s. I don't look it and I don't feel it. You got life and fire in you. EMBRACE AND ENJOY IT. Most people my age look and feel old af to me man :/",
            "Had a talk with my dad about this not too long ago. He said you basically feel like a teenager forever, you just learn how to do adult things at the same time. Teenager you was YOU, you just have to add in responsibility",
            "My grandma just passed away in March. One of the things she told me before she passed was that she still felt like an 18 year old girl mentally, but that her body didn’t match :)",
            "Small secret for you, you never feel the age that you actually are past the age of 25 or so.",
            "Me 73M\n\nI look around at all the old funny looking people, then go oh shit I am too!!",
            "Getting old sucks",
            "I’m almost 70 but I feel (mentally, not physically) like I’m in my 40s.",
            "*So here I am*\n\n*Growing older all the time*\n\n*Looking older all the time*\n\n*Feeling younger in my mind*",
            "For Father's Day I tried to get drunk with my friends and play video games. A few drinks in I sent a text to my wife asking her to call my name loud enough for my friends to hear on the mic. She called out my name so i told my friends, \"brb wife needs me.\"\n\nI went to bed.",
            "Absolutely. I’m 32 and I still feel like I’m 13.",
            "I'm 18 but sometimes feel like I'm 12",
            "This is totally normal!",
            "Shit im 20 and feel like ive been going through a mid-life crisis for the past 3 years😂",
            "Everyone feels this way.  Wait til you’re 50 and still feel 30.  It’s disorienting",
            "32 year old female. I feel like a child….. when I’m sick I still wish someone would take care of me all day and be there for my every demand",
            "Same reason that l'm a 63 year old grandma who feels 17 inside her head.",
            "I look at people who I graduated with and think “wow you look 40” but then again I think wait do I? Then I realize I’m 35 going on 36… shit we are not 25 anymore lol",
            "I’m 40, but I’ve been 25 in my head for 25 years.",
            "About to be 41 and trust me you will feel the same in 8 years mentally but physically you’ll be like fuck most of that shit",
            "Yea I see pictures from ten years ago and think fuck I’m old… like where has the last ten years gone?",
            "Just hang around some actual 19-21 year-olds.  You'll start feeling your age.",
            "I feel the same at times being 25 feeling 16",
            "Happens to women too.",
            "I thought this is normal? I am 40 but I feel like I am 25 everyday.",
            "I'm 39. For almost 20 years, I've felt much younger than I really am. I finally feel about right.",
            "I recently went back to school for a career change in my early 40s.  I was more immature than many 18 year old classmates at times.",
            "Yes. It’s a good thing. Means you are still “young”. Just be a good father and husband and you are all good player",
            "Because you can’t accept the fact that you are slowly aging to reach a point where you are old and decrepit. It’s to your benefit. Because if you thought hey I’m now 33 and not 21, you would start to realize things you used to be able to do and can no longer do. Then you would start thinking you are old, when in fact you are still capable of doing everything you could ten years ago. And until you’re over 85, that’s how it will be. 21 was also the last birthday that felt like it meant something, now it’s just trying to forget what the number is because the numbers don’t mean anything anymore, except that you are getting older. Go out and do a hobby from your youth, I promise you won’t break a hip. Stop wasting your time worrying about age and deal with health conditions when they arise. Be happy for living this long, not everyone does. Now again, go do a hobby from your youth, like biking or basketball or soccer, etc and stfu",
            "Dude I'm 30 too, married, with a kid, and still feel young af.",
            "Your brain stops developing around 25 so your mental state stays that way. I’m not a doctor I just play one on Reddit.",
            "We’re all faking it man. Evolution needs you to feel strong, hopeful and confident enough to procreate. It wants you to remain in that reproductive state. After that it doesn’t matter. It doesn’t need you once you spread your DNA. Your body is free to deteriorate. Evolution is done with you and so mentally it doesn’t ever move beyond that moment of feeling young and in your prime because it isn’t necessary to keep the species going.",
            "62 this year and I pretty much feel the same as I always did. Still think of myself as basically in my early 20s, but a whole lot smarter.\n\nThey say that you never feel yourself growing older, but the cops keep getting younger. Same with dental surgeons I guess. I swear the kid was like 12 and his assistant was maybe 14. How the hell does this work? Haha\n\nThe other thing I notice is how dumb people have gotten. They don't seem to know anything about anything useful. I thought I was pretty smart in my 20s. Delusion seems to work in all directions.",
            "Whats worse is being 25, feeling 19, and having that age group wanna be best friends with you. \n\nI love those kids, but i often would feel gross if i hung out with them too much at work (fast food where we hired a lot of youngins).\n\noff my chest, it sucks to feel attracted with some and feel disgusted with yourself. its not fun",
            "65 and still feel 30 in my heart. Now oif the rest of the body would just go along with that idea...",
            "Same reason I feel 33 but I’m 60 lol",
            "Others have said the same, but that won’t change.\n\nYou’ll reflect when you sprain your ankle and it takes a week longer to heal than when you were 25. At 30+ it’s a week for each day you had before 30 to recover. It sucks.\n\n“Shit, maybe I am old.”\n\nBreak or bruise anything but your ribs and you can stretch the ignorance for longer. If you get fat that exacerbates things.",
            "Ohh 100% 33M I feel like a 21 year old. \n\nStill broke, single, no savings, shit job, partying and raving all the time. I’m the same person.",
            "It’s a blessing. \n\nI heard this somewhere: \n\n“No matter the age, always be a kid.”",
            "   I have a little plaque on my wall which aptly sums it up. It says, \"Growing old is mandatory. Growing up is not.\" Live long and prosper folks.",
            "I was legit having this thought today. I travel a lot for work and deal with some high dollar contracts. I often wonder who the fuck handed me a company credit card and allowed me to go negotiate on the companies behalf!",
            "Adults are just Giant Children -- and that's just fine.",
            "I've been doing this for years.  When someone ask my age or we are in conversation and age comes up, I tell them, \"I'm 26 with 21 years experience.\"  So yeah, im 47, and every birthday, I gain another year of experience as a 26 year old lol.  Crazy thing is I physically feel 26, body still looks mid 20s, and I  sometimes feel my maturity level is around 26..bad thing is, females that are into me range in average from 21-35..females my age or close are not into me at all",
            "The first 50 years of a boy's life are the hardest.😂",
            "I'm a 56 yr old senior mechanical engineer, and in a business setting, conduct myself as a professional.  Otherwise, i still have the same goofy sense of humor as I did as a college student.  Physically, people age.  Mentally and emotionally, you mature as you age but retain that which is core to your being, making you the unique individual that you are",
            "Mate I'm in my 40s but I'm still 19",
            "Completely normal."
        ]
    }
]