[
    {
        "post_id": "t5fxl7",
        "author": "koalamarket",
        "title": "Is this something “normal” that a lot of guys do at bachelor parties?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/t5fxl7/is_this_something_normal_that_a_lot_of_guys_do_at/",
        "score": 13516,
        "num_comments": 1852,
        "created_utc": 1646271713.0,
        "selftext": "My mom found out from an old friend today that my dad fucked at least 3 other women at his bachelor party. They’re divorced now so that’s why the friend was honest. I think it’s extremely immature and shows that you don’t truly love who you’re marrying and it made me really sad to hear. Either way i don’t think it makes a difference for how i feel about it, but is this common? I know strippers are very common at bachelor parties although i don’t agree with that concept either. But having sex with multiple women right before you get married is way over the line imo. Thoughts?",
        "permalink": "/r/NoStupidQuestions/comments/t5fxl7/is_this_something_normal_that_a_lot_of_guys_do_at/",
        "comments": [
            "That is not normal, no.",
            "We just played smash bros and got wasted at my bachelor party, shit was lit",
            "Yeah that's super lame. I feel sad for your mom. I would never cheat on my wife, not when we were engaged or dating before that. Very not cool.",
            "So he cheated on his fiance? That's mega asshole behavior.",
            "The idea of the bachelor party being \"one last night of freedom\" is an old trope that some people use(d) as an excuse.  The reality is banging someone else is cheating on your girlfriend regardless of if a wedding is planned so it's not like you were free before.  Most people know this and don't cheat, but some selfish people (man or woman) use it as an excuse to act out.  \n\nA guy named Drex has shared on podcasts stories of women who look to get a bull, a train/gang bang, or other sexual service as a \"last hurrah\" before marriage.  A story in particular on Bill Burr's podcast tells of a guy whose laaady banged the bartender of the bachelorette party in the bed they were to be newly weds in the next night.  Dude found out ten years later after they ran into the bartender and the laaady acted weird (and tried to deny it at first).\n\nSome people are just selfish, and I choose to believe most people recognize this as shitty behavior.",
            "I wouldn't even say strippers a very common, it's usually just a rowdy night out getting drunk and having a friendly laugh at the bachelors expense.  \nOne I went to even had the best man have us sign a piece of paper (just symbolic, it was only a piece of paper) that we wouldn't let the groom do anything he would regret on his wedding day, if you know what I mean.  \nSome people are just shitty people and I think they're just looking for a reason to cheat, and claiming it's \"traditional\" during a bachelor party is just their way to excuse it.  those people usually find other reasons too, like maybe new years, and their birthday, or when they are travelling etc.  \nYou can't trust those people in my opinion.",
            "It's not normal behaviour, it's cheating",
            "[removed]",
            "For mine we rented a lake house and just drank, hung out, cooked great food and did dumb shit. I just wanted a weekend with the guys and it was awesome. \n\nThere are certainly people who want something more exciting than what I asked for. I don't think cheating on your fiancé is \"normal\" but there are some couples where those boundaries are a little more flexible.",
            "I know a few women who did the same on their hen parties. People can be shit! Chances are these people banged a few others behind their SOs back before/after as well.",
            "Sounds like a “I just need to get it out of my system” kind of thing.\n\nSpoiler - it doesn’t work its way out.",
            "The best one I ever went to was beer, golf, then more beer followed during a late game of poker. No women of any kind.",
            "No, it's not.\n\nBachelor party is to get together with your friends and have a good time doing things the bachelor enjoys. That shouldn't involve the bachelor cheating on their SO. If that's their idea of fun, probably shouldn't do the whole marriage thing unless it's an open relationship kind of deal.\n\nAlso on the strippers thing, I've been to about 11-12 bachelor parties including my own and only two involved strippers. One involved strippers because a couple of the guys wanted them, but the groom and most people didn't care all that much for it. Another was because we were in New Orleans where one of the streets has a ton so we figured we would check it out once. All others I've been, we basically all just hung out with each other, played games, did some kind of activity like paintball and just got drunk hanging out. Maybe it's my friends, but think the stripper thing gets overplayed a bit.",
            "I dont think thats normal at all. Kinda shows why it didnt work out.",
            "As a former Vegas casino host for over a decade, I assure you it’s extremely common, at least in the US. But I wouldn’t say it’s “normal” and definitely not healthy.",
            "Cheating on your fiance, not normal.\n\nTelling your kid how their dad fucked three women at a bachelor party, also not normal.",
            "That is called cheating.",
            "Not normal. It depends on who you get with. \n\nGood people don't do that. Infact some people don't even have rippers at their bachelor party. Just good times with their friends.",
            "Depends on what you mean by \"common\".  Common enough that it's a bit of a cliche story, one you might see in a movie?  Yes.  Common enough that any reasonable person finds it remotely acceptable?  No.",
            "The last bachelor party I went to we played D&D and got hammered it was a blast. No one fucked anyone.",
            "It's not normal. When a friend of mine had his bachelor party we went canoeing. Another I heard about had a LOTR themed treasure hunt.\n\nI think the whole strippers and cheating during your bachelor party comes from a time where people felt obligated to get married in a timely manner, so many didn't wait to find the right partner. They just settled for anyone and knowing they didn't love their fiancee and wouldn't enjoy their marriage, they enjoyed themselves on their \"last day of freedom\". One's spouse used to be referred to as \"the old ball and chain\" in that generation too.",
            "Unfortunately I used to work as a barmaid in a strip club and heard a lot of people brag about how they had a prostitute lined up for the stag later. Like it was not uncommon.\n\nGo to a strip club, get the stag horney and drunk then throw him at a prostitute at the end of the night. Even plotting to do it so the brides family WHO ARE ON THE STAG DO don't know what's happening.\n\nThe worst one for me is the stag who shagged the girl next to him on the plane to Ibiza while his pregnant fiancé was at home. Watching all his friends high fiving etc made me feel sick and so sad for his (now ex) fiancé. \n\nWhat makes it easier is for some women being the 'last shag for a stag' is a turn on and it's like a sense of pride for the stag to have one last one before the being tied down.\n\nJust the whole thing is stupid.",
            "I didn't have a bachelor party but if I didn't, I certainly wouldn't have cheated on my fiancee. Cause that's what that is. It's cheating.",
            "It happens, but they don’t need to try fool themselves. It wasn’t “just tradition,” and they didn’t get “caught up in the moment.” \n\nYou didn’t just cheat on your girlfriend. You cheated on your fiancé. And as close as it is to the big day, I consider it cheating on your wife, the woman who will probably be the mother of your children one day. \n\nThose garbage human being-level behavior.",
            "My husband went out with his buddies to his favorite restaurant and then went and took a blacksmith course and made a knife. Just something he enjoyed with his best buddies!",
            "For my bachelor party, my groomsmen and I ate weed brownies and went to the zoo. We spent a loooooong time at the Chimp exhibit.",
            "Not cool unless the soon to be married couple have agreed to this.",
            "As a waiter I have worked bachelor and bachelorette parties and oddly enough I have seen more 'cheating' behaviour and strippers at bachelorette parties by far. So yes I think it is actually fairly common but I don't think it's gender neutral. I would say it's more who you're friends with/what the group thinks is acceptable. Like my friends would all call me out if I banged a girl the night before marriage. That's fucked.",
            "This is common but it's not because of the bachelor party, it's because he is a cheater. \n\nSource: We ended up at a strip club during my bachelor party, my grooms men kept me in the vip room the entire time. I made it through without banging a bunch of stripers.",
            "Some strippers perhaps. Some lap dances maybe. Banging three sex workers at your bachelor party, is usually frowned upon, not to mention very expensive",
            "No. Sure, some people will do it, but it is absolutely not normal (or accepted by most people). For my buddy's bachelor party, we just went to a friend's place, had pizza, drinks, and played poker. In fairness, I would say it was tamer than normal, but actually cheating during the party is not",
            "In \"the old days\" it was supposedly normal, though not at all common, and might still exist today but is even less common. It's a subculture ideal - certain people think it's a right of passage, for before a virgin has one partner for life or sucks at sex the first time - but no, most people don't do that.",
            "Sorry to hear your dad treated your mother poorly, that's not normal and it isn't right.",
            "Women do it too, it's not just men. But yea, if you fuck a bunch of people literally right before you're married then you have absolutely no reason to complain for a failed marriage.",
            "Definitely not fucking normal.",
            "OP, I think you knew the answer to this before you posted it.",
            "No it's cheating. His friends are complacent in this as well.",
            "Not normal behavior. That’s asshole behavior.",
            "Cringe. Bachelor party is for spending time with your bros who you won't be able to see as often.",
            "Male on second marriage and been to NUMEROUS bachelor parties, multiple included strip clubs including my first marriage bachelor party.\n\nNormal average experience for me:\nStrippers and lap dances. \nLots of shit talking about what youd like to be doing with the strippers. \nToo much alcohol, getting sick.\n\nSeen some borderline/inappropriate touching and one situation where two women came and hung out with our group one of which attempted to sleep with the groom. He seemed to consider (I think because Of the peer pressure) ultimately passed on it.\n\nNEVER at any of these bachelor parties did the groom actually have sexual relations with another women. \n\nHaving sex with at least THREE WOMEN is oddly impressive but also fucking gross for a guy about to get married.\n\nImagine a bride getting a train ran on her at the bachelorette party\n\nHorribly selfish, gross behavior.",
            "This trope was always strange to me. All I want for mine this fall is to have a few beers, have a good meal and go to a baseball game or something. No strippers or hookers though, what the fuck!?",
            "What kind of \"love\" is that? That's the most faux love ever.",
            "Not normal at all. Most bachelor parties are pretty tame nowadays; that's all from a bunch of age groups all over the country. The whole go super crazy at your bachelor party seems like a myth mostly perpetuated by the media.",
            "So, I’m a woman who met my husband 21 years ago, married 16. This is how it should go if there’s a stripper. Any other female entertainment (further sex work) is a very bad idea and if provided, the best man should be sacked immediately. \n\nMy beloved likes large ladies—and I mean 3-6x, not 1x. I’m in his range so do not feel threatened. His best man found a quite fluffy stripper on Craigslist and rented out a neighborhood bar. She performed, the dudes drank. Then he came home to me super excited to tell me that his way shy best friend had arranged this. \n\nThat’s what partnership looks like. You want to share, not hide. \n\nIn my experience, most folks have moved on from the whole ‘ball and chain’ concept and have embraced partnership. \n\nIf you can’t enjoy, vicariously, your intended’s night? That is not the person for you.",
            "I think people are upvoting the wild stories because they're fun to read instead of upvoting the best answers to the OP's question:\n\nOP'S QUESTION: \"Is this something “normal” that a lot of guys do at bachelor parties?\"\n\nTHE REAL ANSWER:  No, it is not.  The only kind of person who would do something like that is someone who shouldn't be getting married in the first place.",
            "I've never understood the entire thing around bachelor/bachelorette parties.  One last \"fling\" to have fun before you are tied down?  If that's your mentality, don't fucking get married in the first place.",
            "Literal asshole, I don’t get cheating on your soon to be wife before you get married? Like……what is the actual point in getting married? there is seriously no logic behind it😑",
            "Never understood why people consider bachelor/bachelorette parties to be the “last time you can be with someone else.” Like, you’re still dating/engaged to this person, it’s still cheating.",
            "Not normal whatsoever",
            "Your moms old friend isn’t much of a friend if they knew he fucked 3 other bitches and didn’t say shit.",
            "At my bachelor party we spent the weekend at a lake house boating, playing paintball, and playing video games on a huge projector outside. Wasn’t a woman on the property the whole time and it was fantastic.",
            "Bachelor parties involves redbull, monster drinks, playing Halo, puking on to your homies and waking up in the dog kennel. Not cheating on your fiance.",
            "Tf?\n\nBut since everyone is sharing their bachelor party stories:\n\nSo I'm brand new in the army, still in training. I use a 4-day weekend to fly home, without leave, from Florida to Arizona. My flight gets cancelled, so I stay a night longer in Florida before finally flying out. Flight I do catch gets turned around once from Dallas because of a storm, sent to college town to refuel. Second attempt, turned around again from Dallas because of the same storm, sent to baton rouge. Third times a charm and I make it. Obv missed my connecting flight to Phoenix AZ. Get the next available flight, but only to Tucson, 2 hours south of Phoenix. Send it.\n\nSo I arrive in Tucson at about midnight, get picked up and brought 2 hours north to Phoenix, to then start my bachelor party at 2 am. On. My. Wedding. Day.\n\nSo we (older bro and close friends) drank at a crowded club, went back to our hotel, talked and BS-ed a ton, I brought MREs (military rations) and we ate that gobshite and passed out. For about 5 hours and woke to get ready for the wedding. It was great and worked out perfectly.\n\nSo long story short OP that's called cheating. Fuck-em.",
            "No. Not normal at all. A strip club or something? Sure. But that's hands off. Cheating on your fiancée/partner? That's not cool under any circumstances.\n\nI've been to a number of bachelor parties and the most risque it ever got was a strip show. Anything beyond that would have invited serious questions from the friends of the couple.",
            "It is a tall tale.\n\n3?  At least?\n\nFirst of all.  His friends probably had him shit faced by noon.\nSecond of all.... it just sounds implausible.\n\nI would file it in the \" yeah sure\" bin.",
            "The last day of freedom he had was the day before he first became her boyfriend.",
            "Holy Jesus. Yeah, no, far, far, far from the norm.\n\nStrippers are common, yes, as are strip *clubs* (I'm like you, I disagree with this stuff happening at bachelor parties as well - except of course if the bride-to-be is cool with it), but actually cheating on your fiancée? No, that's not normal. So sorry you and your mum had to find out about this.",
            "We call that the ole Mario Lopez.",
            "I’ve heard of one person (like friend of a friend type thing) doing that with one person. It was a stripper I think and he had sex with her in front of everyone else. I couldn’t believe it.",
            "As a side note, never hire a stripper for your friends bachelor/ette unless they have specifically requested it. It’s bad taste otherwise.",
            "that's boomer-level mentality there.  \n\n\nThe most common thing in the west is a stripper at most.  and you kinda see how media shows that in tv shows and movies with bachelor parties being wild. and others being more going out to a cabin.",
            "Nope, not normal.  My bachelor party consisted of rock climbing, jet skiing, and going to a bar.  Its upstairs supposed to be guys hanging out celebrating the commitment their friend is about to make, its not supposed to be an excuse for cheating on your fiance.",
            "Paint ball, white water rafting, cabin rentals, motor bikes, talking about getting strippers and then passing out with a hamburger on a pull out sofa.",
            "Not normal. Lap dance sure but not actual fucking.",
            "Never happened in any of the bachelor parties I have been to or have even heard of. I do not associate myself with assholes though so maybe that is the reason.",
            "I played fuckin Warhammer and got high as fuck. Stripper shit is lame. Cheating is for pieces of shit.",
            "Not normal at all.\n\nEven strippers are a bit much for bachelor parties these days.  Friends offered to take me to a strip club for my bachelor party.  I declined and we went skeet shooting and then to a piano bar.   Five years later another friend in that group got married.  We offered him the strip club, he wanted the casino instead.\n\nIt’s not that married men never go to strip clubs...but for that to be where someone’s head is at hours before they get married?  Yikes.",
            "My bachelor party starts in one hour. My best friend and I are going deep sea fishing Ave then coming back and having dinner with our ladies before bed. So no sex at mine.",
            "While it seems completely crazy to my worldview  there are people who actually think \"It's not cheating if it's on my bachelor party\". As someone pointed out, they think it's their last chance of \"fun\" before marrying and being in a family with responsibilities.\n\nThere are many questions we may ask on that subject, such as:\n\n- If you think you'll never have fun again, or that marriage is a prison, why are you marrying in the first place? Isn't it possible to have fun with your spouse?\n\n- If you love and respect your partner, and truly believe in fidellity, why is this day any different than others? Why is any behavior excused in a bachelor party but not on other days? Do your values suddenly don't matter?\n\n- Is contact with strippers, drugs and prostitutes really the best way to start a marriage? What makes you think you will only desire those things once and never again think about it?\n\nOne of the reasons there are so many divorces is that people marry without knowing why, without the principles and commitments that hold a marriage together. They just do it because they like spending time with someone and think they'll be in love forever. \n\nI'm recently married and my bachelor party had my closest friends pulling pranks, playing games, eating, talking, laughing, making me eat hot pepper and playing table RPG (what a nerd, right?). It was amazingly fun!\n\nWe also prayed and thanked God for my marriage, and I thanked them for their friendship and their company throughout many years. It was a place of fun, friendship and celebration, but involved nothing I can't do again here in my house. I had fun with fun, I have fun every day with my wife, and I know there will be tough times, but I hope to get through it all at her side and with their support. To me, this is the way (mandatory mandalorian reference)",
            "Son? Is this you? I found out 2 years ago that my ex husband slept with someone the night before we got married. Even after all these years it hurt. More so I think that others knew and never said anything. I’m sorry for your Mom and for you that you know this.",
            "No. My bachelor party was us playing video games. Our generation doesn’t seem to have the whole “OH THE OLD BALL N CHAIN” act that boomers lean into. ‘",
            "If it happens at the bachelor(ette) party, it will likely happen again.",
            "We went to a retro game shop, ate chicken wings and played PS2 Dance Dance Revolution for my friends bachelor party. 2021 btw",
            "Nope not at all! My uncle fucked a prostitute at his and he tried to do the same for my parents wedding and my dad didn’t want that so my mom canceled his bachelor party and then set it up at his favourite restaurant so that my uncle couldn’t do anything last second. The thing is though is that my aunt has no clue, to my knowledge, and they are still married to this day.",
            "As a guy, I believe that any guy who messes around with other women (including strippers) while in a relationship is a piece of shit. A bachelor party is not a day off of being loyal to your partner. If I found out my fiancée sucked some male strippers dick at her bachelorette party, we’d be done.",
            "I have not heard anything like that from any of my friends about bachelor parties, or observed at the bachelor parties I went to.  Unless that had been explicitly discussed with the bride-to-be I think that's a big step over the line.",
            "if the partner is OK with it, its fine. if not, its not fine. Its a personal choice for them.",
            "You guys celebrate bachelors?\n\nBut no, he's an asshole",
            "No that's just cheating. Much different than the stripper thing. I don't particularly care one way or another about strippers at bachelor parties, personally I wouldn't choose to have them but it's not really cheating. But sleeping with other women is.",
            "That's really immature irresponsible behavior. Probably why they broke up.",
            "None of the bachelor parties I've ever been to did something like that happen. Only 2 of them had a strip club involved. Pretty much all of them were just a party doing stuff they loved to do. Cabin rentals, mine was at a ski resort.. lots of drinking and drugs but never anything cheating",
            "No it’s not common, but I’d also question who you’re hearing it from. Could very likely be bullshit",
            "Your best man arranging for a stripper giving you (and usually others at the party) a lap dance is one thing, having intercourse is totally another. It’s wrong on every level, and I am a very socially liberal person.",
            "Normal? Nah. It's not super rare, but most guys don't do this.\n\n\ntbh the whole stripper thing is stupid too.",
            "I think it’s more common than guys will admit. I also think it’s a really trashy thing that speaks really badly of the guy. I actually had opportunity at my bachelor and the girls were shocked that I turned them down.",
            "I would not say it's \"normal\" but definitely happens",
            "And here I am thinking a bachelor party was suppose to be tame… \n\njeez the comments are depressing",
            "It all depends on their relation ship. Id say no. But i have friends that she blew a guy on her trip and he fingered escorts. And that was fine. But they have a very relaxed trusting almost open relationship",
            "Honestly yes it’s common tbh I don’t even want a bachelor party because of this fact",
            "There are HUGE generational differences in the answers to this question. Strippers and debauchery were pretty common at bachelor parties up until the 2000's.",
            "Went to one recently and no we did not fornicate with women. We did go to a strip club, I sat in the corner with the other “married men” and drank my drink.",
            "I do think that times have changed somewhat and while it was definitely incredibly normal to go to a strip club or hire a stripper and potentially make out with and maybe sleep with someone, that’s now not widely accepted as ok. Not to say it never happens, but I think it was more common 20/30 years ago.",
            "I've been to a dozen bachelor parties, they can get wild. \n\n the closest to cheating I've ever seen is a stripper Lapdance with tits in the face. And he was almost passed out drunk, someone else paid for it.",
            "I've been to a few bachelor parties(maybe a half dozen), including two of my own.  Only one had a stripper, and the bachelor did have sex with said stripper, and that was over 20 years ago when I was a teenager and an older coworker invited me.  I didn't really know any better, had never been in a real relationship at that point, and know that it's pretty shitty now.  I don't know what happened to them.  \n\nNeither of my bachelor parties (15 and 5 years ago) had strippers.  Was just guys playing video games and eating terrible food.  The most common activity I've done for a bachelor party(been to 6-10) is go to a baseball game\n\nSo I'd say that no it's not normal, but it does happen, or at least it happened 20+ years ago at that one bachelor party I went to.  None of my contemporary friends have had a bachelor party that would even been considered risque in such a fashion",
            "I've never been to a bachelor party, but I'm pretty sure that would be universally frowned upon. From my understanding, the craziest bachelor and bachelorette parties are supposed to get are like a lap dance, maybe grab a tit or the chick rubs a dudes abs or something. \n\nI'm pretty sure fucking three people is an absolute no go for most reasonable, level headed people.",
            "No. It isn't. For Assholes it is.",
            "No, cheating is not normal. Strippers shouldn’t be normal either, but that’s a controversial topic.\n\nWhen I (woman) got married, my two bridesmaids threw me a bachelorette party. We did an escape room and then went home for pizza and Lord of the Rings. I did my nails for the wedding. No guys, no strippers, because I 1) love and respect my now-husband and refuse to cheat on him and 2) honestly just don’t _want_ to be with anyone else or see another person in a sexual way. He’s the only one I want. (He didn’t have a bachelor party because he didn’t care, but if he did he made it clear he did not want strippers.)",
            "No, that is not \"normal\".",
            "Gawd why is it always “all men”. Cheating is not inherent to only men",
            "I don't agree with it. Wonder though if he would be ok if she fucked three male prostitutes or strippers on her bachelorettes? Goes around, comes around. Dont like double standards.",
            "It definitely seems like it's something that's pushed a lot at that kind of bachelor's party",
            "That's 100% not okay and not normal. Your father sounds like a sexual deviant of sorts who doesn't really love your mother.\n\n*Fucking other women* at the bachelor party?! They're strippers. You're aren't even supposed to touch them, just look.\n\nAsk him if he had been fine if your mother had been groping 3 guys' dicks at a bachelorette party. Of course not, right? Well it's the same shit to me. Unless I receive some kind of approval from my woman, I am not even going to lay a finger on another woman in a sexual way. That's just cheating.",
            "I knew a guy who boasted to a room full of other guys that on the day of his wedding while his soon to be wife was doing the last of her prep before the ceremony he was in the bathrooms having sex with 1 of her bridesmaids... Piece of shit",
            "Assuming from context that they were in a committed relationship before the party and before getting married. If so that's disgusting and definitely not normal.\n\nThe 'last night of freedom' tradition where people fuck and get it out of their system is from a time when arranged marriages were more common, so the two people aren't in a committed relationship until they are actually married. Unfaithful people will kid themselves that it's right for traditonal/standard western ceremonies too.",
            "Feeling like marriage is the end of your life and like you “have to” live it out until then just makes someone a shitty, sad person IMO.",
            "Not common, just an excuse for shitty guys to cheat before marriage. Quick way to give STIs to your spouse too…",
            "Lmao i've been to at least 4 bachelor parties.. None of the bachelors slept with anyone, other than their buddies accidentally when they both pass out from a 24hr bender on a couch or something.",
            "Some people buy into the stupid \"last night of freedom\" bullshit and think it gives them carte blanche to do whatever they want. Those people are assholes.",
            "Strippers are common in the movies... Not in most real life bachelor parties",
            "No that’s not a normal thing.",
            "I hope to hell that’s not normal. I did not because you don’t have to be married for it to be cheating",
            "Weddings are full of weird sexual energy at the party.\n\nIf the groom is one of the guys who is flirting with the women, he shouldn't be getting married.\n\nCheating is not normal and that type of shit should not be normalized",
            "My husband has a lot of friends getting married lately, from what I understand their Stag Parties are basically just massive amounts of food, drinks and some kinda raffle thing. Sometimes video games too. They usually just have it at one of the guys houses. They don’t do the stripper thing, it’s just not something they want to do. Most of these guys are happily married and wouldn’t want to deal with the repercussions of how that would affect their relationships. And none of them can keep a secret to save their lives so I know it’s not a cover lol\n\nThe type and quality of the guy getting married and his friends is important to pay attention to. I don’t think it’s normal to want to cheat on your significant other, especially someone you’re committed to marrying and if you feel the need to then it’s kinda a red flag that you’re not ready to get married.",
            "Holy shit, I was \"kidnapped\" and we drove at a strip club and saw some tits, but NO WAY I would have done anything, one day before my MARRIAGE! That's insanely abnormal.",
            "My husband's friend asked me if he could hire a stripper for the bachelor party. I said sure, if I was invited. The friend was cheating on his wife at every opportunity and he didn't ask me that for my husband's benefit. He was the only person who wanted a stripper. \n\nMy husband says he's never been to a strip club and isn't interested. I used to work in strip clubs and breastuarants, and they're shitty places to be. Strip clubs are depressing as hell, IMO.",
            "Yeah that's not normal. That's a really clear and obvious sign of a marriage that's going to inevitably fail and he didn't give a shit. The whole point of having strippers/dancers at a bachelor party is to make the groom uncomfortable and uneasy because he genuinely cares about his wife. If he's running off with a girl the night before he gets married then that says a lot about him.",
            "That's just being an asshole. I ain't married, but as far as I know all my dad did at his bachelor party was get drunk with his friends, play music, and probably break some furniture.",
            "[deleted]",
            "it seems to be a hollywood movie thing. maybe tons of people think it's normal since it happens so often in the movies.",
            "If your partner isn't involved, then it's cheating.",
            "Not normal. I'm trying to imagine a situation where my friends would not get super pissed off at me if I did that to my fiance anyway. Some people are just shitty people.",
            "If it's any consolation I'd wager your mom cheated at some point too. So many people act like they're saints in these threads but people cheat as a rule not an exception.",
            "Way more normal than it should be. Just means you're not mature enough for a major commitment",
            "I’ll start with strippers are NOT very common at bachelor parties. They are very common on TV, which is a different thing.\n\nAt my best friend’s we got drunk and played board games. At mine we went out to a casino and played the cheapest blackjack table available for a bit then went back to the hotel for video games (and more drinking).\n\nIt’s way silly tradition of “one last night” of fun with your friends. What that looks like to you says a lot about you. The only thing I would guess is mostly in common is drinking. Almost all will involve drinking",
            "No it’s not, that guy is a scumbag.",
            "Exactly the reason I didn't have a bachelor party. Didn't want to have the image of my future FIL going to the \"Champagne Room\" with \"Diamond\" seared into my brain.",
            "plot twist: it was three of his bros dressed as women he fucked",
            "It's only normal if the person is an asshole I guess, otherwise it's really shitty.",
            "I've been to a few. Strip club was novel, but I'm not interested in that scene (I don't see the appeal)\n\nAnother one was a day of sailing, where people generally dont get shitfaced on a boat, and an evening show of Cirque du SoleiE, which was awesome. Walking around the city and bar hopping after was boring and expensive. Slept on a boathouse with a leaking roof during a huge thunderstorm.\n\nI had to double dip that weekend and immediately drive 120 miles to another bachelor party, hungover, soaking wet, where they were playing beer pong and having a great time.\n\nMy partner wasn't very happy when I showed up on Sunday.",
            "Yeah that’s not normal. Every bachelor party I’ve gone to is usually a bunch of dudes going camping and getting fucked up and laughing all night. No women allowed lmao",
            "I played paintball and then had a nice dinner with my friends for my bachelor party....this is not normal",
            "No that's not normal. At my bachelor party we went out to dinner and fishing and then some buddies said it had to include a strip club. It was loud and not for me or my brother so we both went and fell asleep at a picnic table outside until the driver came to take us home because it was like 2am while the rest of them were doing body shots, getting wasted, and blowing their cash. \n\nGuys that feel the need to fuck other women right before are shitty little boys who have no business committing like that.",
            "We had lunch, played airsoft, went Karting, then went out for some drinks. Even in my inebriated state it never crossed my mind that I wanted to do anything with another woman, I was looking forward to going home and curling up next to soon to be wife. Never understood the mentality of having strippers and cheating when you’re about to marry someone.",
            "I'm 41 years old here, so I'm going to have a way different slant than most people here on this. About 20 years ago, this was not only common it was a trope. You saw this on TV, and movies, it glamorized the hooker/stripper bachelor party idea. On top of that most 18-30 year old guys that got married 20 years ago, well we were all kinda stupid. Guys just mirrored their bachelor parties based on what they saw on TV or movies. That same group of shitty guys well now bachelor parties are golf weekends, going to the horse racing track, traveling.  \n  \nThe change is huge, one all the guys that use to do this shit were shamed and it totally crushed this whole idea. It was normal at one point but we are well past it. It is a product of boomer mentality on what a bachelor party should be, not what it is.  \n  \nBasically long story short it use to be normal, then our entire gender woke the hell up. Yeah there are still shitty people out here doing that stuff, but for the most part it is a tradition that is kinda dead now.  \n  \nYou see it in other industries as well, strip clubs are not nearly as popular as they were, and going to vegas with the boys does not happen nearly as much anymore. And if you do vegas it ain't like the 90s and 2000s anymore.",
            "My bachelor party was a week long kayaking and camping trip where all I did was tell my homies how excited I was to marry my wife. The whole \"last hurrah\" thing is a clear sign to me that someone isn't ready for marriage, or has a real fucked up view of it.",
            "This is not the way",
            "Jesus Christ.\n\nCall me a romantic, but when I imagine my bachelor party, I imagine myself thinking about how much I love the person I am about to marry.\n\nThat said, when I imagine getting into my own F35b Marine Corps variant next generation jet fighter, I sometimes wonder if I’m too unrealistic in my imagined scenarios…",
            "It’s not exactly UNcommon. I don’t really like the idea myself either, but it isn’t unheard of",
            "It's your bachelor party, the night before your wedding.  If your mind is on anyone else but your wife to be, that's a problem.  Strippers at bechelor parties shouldn't even be a thing.  A husband to be should be focused on having a good time with his friends to unwind the tension and stress that builds up leading to the wedding (originally the whole point of the bachelor party) as well as excited, maybe even nervous, for tomorrow thinking about his bride to be.\n\nIt should never be an excuse for \"one more night of freedom\" because if you already asked her to marry you, you already committed to her.  Heck, that would be inexcusable even if you were only dating.  If you are gonna commit, commit.  And if you truly love her, you wouldn't do that stuff.\n\ntldr; No, that isn't normal and is quite dastardly.",
            "I think once upon a time this may have been “normal” but that would have been pre-civil women’s liberation era. The concept was always “well, after tonight you’re stuck with one CAT for the rest of your life,” so the guy could see some CAT or maybe even do some CAT if he was so inclined… but that was in an era where women were mostly seen as accessories to your American Dream TM, not a person with feelings that you need to love and respect. \n\nThe day before my wedding the “religious officiator” and my wife were hammering on the idea that we go to a strip club. I was very much opposed because, as much as I thought that strip clubs were funny and novel, I didn’t want that in proximity to my wedding because I saw it as sacred. Needless to say my now ex-wife ended up sleeping with her teacher, so she could advance her career, and they’re married and sleeping with other people, so I was obviously the only one who was taking that seriously.\n\nDon’t sleep with people before your wedding, don’t get married unless your wedding is an important sacred day to you. Seriously, if that person you’re marrying isn’t your best friend, and they don’t treat you like you’re the most important person in their life now and forever? Don’t do it.",
            "This is what happens when people don't call out these dumbass rom-coms enough. They stride into a relationship thinking they should do all the dumb shit they saw in the films. Just finished binge watching Friends and some of the romantic tropes in there has me questioning how anyone in the 90s ever go into a relationship, if shit like that was common.",
            "I'll say something that either will get buried or downvoted lol\n\nNo, most men do not do this. Most men know a few guys who probably do this - we all know who they are, they are usually the assholes of any major group. We know they are red flag guys. Some women though can't see the red flags for whatever reason. I'm not saying the guys out of these group are good or boyfriend material. I'm just saying all men know from a distance if a guy is that red flag.\n\n\nSame answer for when women ask if guys hang out with men who catcall. Most times we don't because these guys are also assholes to other dudes. It's red flags all along. Sure there are a few exceptions like being way too young, though that doesn't mean it's just a phase and they will likely grow up to be asses anyway. \n\n\n\nAnd it's not worth to be friend with those people because they never bring anything meaningful to the table other than asymmetrical teasing (like a bully), secondhand embarrassment, funnelling of conversation topics to the macho stereotype and other issues.",
            "I don’t think the 3 women from his bachelor party were the issue, it’s probably all the other women he fucked during the marriage. He probably even fucked a bridesmaid at the wedding.",
            "I played laser tag at the largest laser tag arena in the US. Then we played card games. Was super dope.",
            "At my bachelor party there were no girls whatsoever, and we all got drunk at a farm house in the middle of nowhere. A bunch of the guys were \"city boys\" and wanted to go cow to tipping. Next morning I had to go around finding them passed out in the field. But no, I would never use the night, right before committing myself to someone as an excuse to cheat on them. That being said, I obviously know men and women who have but I made it obvious what I think about that behavior.",
            "I didn’t like the idea of celebrating my impending marriage without my fiancé, so we rented out a room at our local bar and invited all of our friends. We hung out, played darts and pool, listened to music, and had a grand time. \n\nBoth my fiancé and I got pretty toasty, so no sexy time. She did, however, attempt to pull the comforter on the bed higher up our chest (it was kinda chilly). Her hand slipped, and she inadvertently punched me in the eye. It hurt, but it was also funny AF because of how bad she felt over what was clearly an accident. I had to comfort her more than she comforted me!\n\nSo, yeah… I had a black eye for our wedding because my wife punched me. I’ve never let her live that down. 😊",
            "Was my bachelor party a four day blackout fest? You betcha. Did my friends force me to go a strip club? Yup. Did some of my SINGLE friends hook up with women while we were there? I’d be mad if they didn’t. Did I even touch another woman, let alone fuck one? Or did my friends pressure me to? No because I WASN’T FUCKING SINGLE\n\nNo, that’s not a normal, healthy thing to do at your own bachelor party.",
            "The way I heard it best is that there’s two types of men in the world:\n1 guy will consider himself a one girl guy once he’s in a relationship.\nThe other guy is only a one girl guy once he gets married.\nSo these two types of guys make very different decisions based on these POVs",
            "No it's not _normal_ but keep in mind that getting married can be a very daunting stressful step for some.  \n\nPeople have been known to get a bit crazy and do impulsive or out of character things just before they commit.  \nI've known a couple of people who have (for some it had nothing to do with sex, but still.)  \n\nSo do keep it in mind and consider that it was extraordinary circumstances in a way.  (I realise that for some people it isn't but everybody is different) when considering how this information impacts how you view your father.",
            "Love is one thing, sex is another.",
            "The first bachelor party I ever went to the groom was given permission by the bride to bang the stripper. All I know is he went into a private room with her, don’t know if he actually went through with it. He’s one of the most decent people I’ve met so I wouldn’t be surprised to find out he did nothing but just let his friends think he did.",
            "Friends took me to a strip club. Paid for me to get a lap dance in the back room from an anirexic girl. Told her to stop and we just talked for 5 minutes. Turns out she has 3 kids. Tough times.",
            "We rented a cabin, raced go carts, and got ice cream at my bachelor party.  My friend’s wife said it sounded like an 8 year olds birthday party.",
            "Strippers are normal. Hookers are NOT",
            "My husband skipped his own bachelor party because he was offered overtime at work and he wanted to help with last minute wedding expenses.",
            "For my “bachelor party” I went on a surf trip with a couple good friends. We drank beers, fished, surfed our brains out. If you are marrying a guy who wants his last hurrah to involve hookers and blow, he’s a frat Chad dipshit. Reconsider your life.",
            "My bachelor party was my best friends, my father, and my soon to be father-in-law. We spent all day out on a pontoon, riding jet skis and drinking at Crab Island. \n\nAfter a quick nap at sundown, we went out to a strip club. We ran into a bachelorette party so it was kind of perfect. The bride to be and I chilled and talked about how much we love our soon to be spouses and the excitement of marriage. My friends and her friends all partied together. My father-in-law was on a mission to buy me lap dances from the least desirable dancers. \n\nIt was a lot of fun. If I had ANY desire to mess around with another woman I would NEVER have gotten married.",
            "That's cheating.",
            "Immature? That's straight up lowlife behavior.",
            "If dudes think this is what bachelor's partying is for they are scum",
            "We’re going to a cabin in the woods to do shrooms and play DND.\n\nHonestly I think even going to a strip club is kind of scummy but to each their own.",
            "Shit even strippers are a rarity, if anything it’s about hanging with the homies all night long before having the wife take most the free time from now on.",
            "I've been to so many bachelor parties that I've lost count, and (as far as I'm aware) nobody has ever fucked anyone. \n\nThey usually involve a strip club, but even those haven't been crazy. Most of the time it's just a bunch of dudes paying to get the bachelor into an embarrassing situation (getting spanked, or his belt around his neck so he can be walked like a dog) on stage. \n\nI think my favorite was starting the day off playing paintball, then some drinking, then a hockey game, then more drinking. Actually, that might have been two different ones I just combined in my head, I have no idea.",
            "This is kind of a stereotype but I know I would never feel comfortable at anyone’s bachelor party with stuff like this going on",
            "No, not normal at all.",
            "Definitely not normal in the slightest and shows absolute disrespect for the person you're marrying.",
            "No its not, he’s a PoS and i feel bad for your mum. \n\nHis friends suck too because clearly they knew and didnt tell her.",
            "Dude here. Been to many. Not normal. But 1 friend got a midget stripper for the bachelor as a gag. She had him lay on the ground and puts cucumber in his mouth and she fucked the cucumber. Craziest shit I've heard about a bachelor party.",
            "The whole \"last time of freedom\" thing they tend to call these bachelor parties always ticked me off as dumb and insensitive.\n\nIf people really treat such parties like this, rather than as a nice gathering with friends before entering a serious relationship that will demand more attention out of them, then **WHY bother marrying**?\n\nIf they want the freedom to screw whoever they want then why even bother **being** in a relationship?\n\nPeople are really stupid and greedy ತ_ʖತ🤌",
            "I went to a comedy club and watched standup comedy. That story is not normal. Other friends had axe throwing and golfing. They were all a terrific fun time.",
            "I don't think its normal to fuck 3 of them. I would say it's not unusual to hear but it's not by any means normal. Most just get a lap dance and maybe some titties rubbed in their face. I just hung out with friends playing video games and drinking",
            "God this brings back a strange memory from my childhood. I was about eight years old, and my uncle (who was one of those stereotypical wealthy, privileged wild guys) was marrying a woman who came from a very humble background and was very religious. How they ended up together, I have no idea, unless maybe she was marrying him for his money but I digress. It was the rehearsal dinner at this lavish hotel, and on the table in front of each plate was a tiny box that I was told not to open until someone told me it was time. All at once, the lights went out and the room was plunged into darkness. The adult beside me was whispering, open the box now! There’s a mask inside! Put it on! So I did. And a few moments later, the lights came back on and everyone in the room other than the bride to be was staring at her in a pig mask. “Oh! I want one!” She cried out joyfully, laughing, but her joy was to be short lived. My uncle was part of the volunteer fire department, and suddenly, in through the side door his fellow volunteers came rushing in, uniformed, also wearing pig masks, pushing a stretcher. They loaded my uncle on, and I’ll never forget the smug, satisfied grin on his face as he folded his hands on his chest and they rushed him out. My would-be aunt was bewildered, hysterical, throwing a fit, asking everyone what on earth that was. No one would tell her. Come to find out, it was all a very elaborate plan my uncle and his friends orchestrated with everyone else and especially his buddies so that he could be spirited away to a high end strip club and eventually to a hotel with loads of prostitutes and drugs for his bachelor party. This was done at the last minute, the night before the wedding, because she’d thrown a fit and refused to marry him if he had a bachelor party…but with the wedding taking place the next day, she was less likely to call it off due to all the pressure on her. She threatened to call it off, but went through with it. It wasn’t a very happy day, but she married him anyway. They are still together, oddly enough, but yeah. That happened.",
            "I think the furthest you should go is maybe a lap dance from a stripper. But fucking another girl? Nah",
            "I’m not proud of it but I had a threesome at my bachelor party. I told my wife about it and we got over it together but I apologized so much for it. Me being honest saved my marriage. Like I said, I’m not proud of it but it happened",
            "No not at all, it's a stupid idea and only for pieces of shit really. Why that rumor goes around I don't know.",
            "No. It’s not. \n\nHonestly strippers are becoming less common as well. Or at least that’s what I’ve heard. \n\nAs for me, I got way too drunk too fast and my friends dragged me home around 10:30pm. Called my fiancé “tits” when I got him, gave my nephew a dope slap and passed out on my bed.",
            "Yes, this is normal.  I banged 5 hookers and did blow all night at mine.",
            "We made steaks and veggies over a fire at my parents for my bachelor party. Some nice whiskey and beers is all I wanted.",
            "No dude, who has sex with her bachelor party strippers or whatever?  That shits not normal at all"
        ]
    },
    {
        "post_id": "9ieycp",
        "author": "LYING_ABOUT_IDENTITY",
        "title": "Would it be beastiality if you had sex with a human person, while their every move is being controlled by a rat under their hat?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/9ieycp/would_it_be_beastiality_if_you_had_sex_with_a/",
        "score": 13516,
        "num_comments": 607,
        "created_utc": 1537762574.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/9ieycp/would_it_be_beastiality_if_you_had_sex_with_a/",
        "comments": [
            "I don't think so, but, if the person has zero control over their own desire or actions then its more like a weird rat assisted rape lol ",
            "No. ^^^^I ^^^^am ^^^^concerned ",
            "Instead of definitions, which are abstract and can be changed on a whim, I am going to answer this from an ethical perspective; is having sex in the manner you described ethically wrong in the manner that bestiality is wrong? \n\nThere are two primary reasons that the practice of bestiality is considered wrong/taboo. The first being the inability of the animal to provide meaningful consent to the sexual act, and the second being the possibility of producing a non-viable (or worse, viable) hybrid. \n\nFor the first issue, for the rat to be controlling the person, and assuming that it controlled the person enough that the person gave consent, then this is obviously a fantasy animal, with at least human levels of cognition, and thus, capability to consent. So the so you are not immoral for taking advantage of the animal. However, it is possible that the human host is not able to consent, depending on the nature of the control. If the person is being completely controlled against their will, then while you might not have ethically committed bestiality with the rat, you did rape the human, especially if you know that their actions are being controlled. \n\nThe second potential problem with bestiality, the possibility of creating a half-human hybrid is cut and dry. No, that is not a problem, since the parts of each of you that are copulating are purely human. ",
            "That's kind of a philosophical question. Follow up: If you had sex with a  realistic robot which was otherwise indistinguishable from a human, did you actually have sex or was it masturbation?",
            "If the rat in question is a sentient Disney rat, then I'd say it doesn't count as bestiality.",
            "[removed]",
            "[removed]",
            "No, but it would be rape, as a mind controlled person obviously cannot consent.",
            "Tap-that-touille ",
            "No, because you're having sex with a person whom is controlled by a rat, not the rat itself, in spite of its motivations if it were making a person do this.\n\nIn the same way, you are not having sex with a spirit or demon if you had sex with a possessed person.\n\nIn both cases I'd argue that this constitutes rape, however, with the controlling power being the perpetrator,\n\n(I love this subreddit)",
            "I'm pretty sure bestiality is technically anything you do that is beastly. Fucking a rat would be pretty beastly, but fucking someone who is fucking like a rat would fuck is kind of a grey area.",
            "Depends on if you know the rat is there or not, I'd say",
            "A depiction of this will be the top post on r/rule34 tomorrow ",
            "Would it be human sex if you had sex with a rat, whilst their every move is being controlled by a human?",
            "[removed]",
            "Possible answers:\n\n1.) You are touching the human while they are not in control of themselves. You are raping the human. The rat is analogous to drugs or alcohol. Since it's not legally a being capable of consent, you are either using the rat to rape them, or you don't realize the rat is there, and this is a tragic misunderstanding. (IANAL I have no idea how the law applies if the person gives explicit and unambiguous enthusiastic consent, but then it later turns out they were definitely out of their mind). In this case, since you're not touching the rat, it's no more participating In the sex than a dog that jumps up on the bed is.\n\n---\n\nHowever, if the rat *is* legally recognized as a sentient being, there'd have to be a distinct category for \"inter species sex between sentient beings\" since AFAIK Bestiality is specifically a crime because animals are not capable of consent, so if the rat *can* unambiguously  consent, it wouldn't qualify\n\nIf this is true, possibilities include:\n\n---\n\n2.) You and the rat are both violating the human's autonomy. You are both conspiring to rape the human.\n\n3.) You believe you are sleeping with a consenting human adult. The rat is raping you both by deception and coercion respectively.\n\n4.) The human fully consents to the sex, you all know what's going, and this is basically some sort of kinky bondage thing. \n - if the other human is unable to give a safe word, or withdraw consent at any point, then it's very dangerous, but as long as they don't actually end up trying to use the safe word it's just dangerous and unhealthy, but AFAIK, not technically illegal.\n - if, however, the human is able to use a safe word(IDK, maybe the rat Isn't controlling their mouth), then it would be just a kinky threesome, which is perfectly legal.",
            "r/somestupidquestions",
            "Depends if you know and what you’re in it for.\n\nIf you think it’s just normal hooman sex, it’s definitely not.\n\nIf you know about the rat, there are a couple descending choices:\n\n- You don’t care about the rat controlling the person because it’s your body and their body, human on human.\n\n- It’s bestiality because it’s your individual having sex with this rat’s individual controlling the body, mind on mind/spirit on spirit.\n\n- If you, not kinkshaming, wanted to have sex *because* it’s a rat controlling them, then it’s definitely bestiality.\n\nI think that covers the basic four scenarios of Rattattattatoilli Romping",
            "[removed]",
            "What the fuck lol ",
            "why would you ask such a cursed question",
            "Get your dick out of my ratatouille.",
            "Found Ted Cruz’s Reddit account",
            "*bestiality",
            "r/jesuschristreddit ^yes ^I ^know ^that ^this ^is ^a ^Ratatouille ^reference",
            "Not bestiality. The human is who you're having sex with and is therefore more relevant to any ethical question. My followup question is whether it's rape. In Ratatouille, the human is in full control of his speech and partially in control of his movements. In this situation, the human must be able to express, verbally or otherwise, his or her own thoughts, or else you don't have consent.",
            "No, but it might be rape if they didn't clearly consent to the rat taking control of them.\n\nAlso, I have some follow-up questions.................",
            "No, but it might be rape",
            "That’s... enough internet for today",
            "Asking for a friend ",
            "I think if an animal is involved in the sex then it's bestiallity.",
            "I think it's only beastiality if you fuck the rat itself, not an avatar being used by the rat. However, it is definitely some kind of rape, seeing as the human meat puppet isn't aware of what's going on.",
            "Where do you buy your weed from? That’s what I really want to know.",
            "Are you that woman from ratatouille?",
            "This. This is why I use reddit. ",
            "Was Being John Malkovich rape?",
            "No, but my research shows that if you try to have sex with a rat that is being controlled by a human holding its legs it will be... awkward.",
            "Yes, you are absolutely allowed to fuck Alfredo Linguini from Ratatouille under all circumstances as he is not a rat. As that is what I can only assume to be your actual question.",
            "I think we had very different viewing experiences watching the film Ratatouille ",
            "Did you have sex with the rat? No. \n\nTherefore not bestiality. \n\nDepending on whether the human gave consent or not to this situation, or whether the rat is being harmed in any way, this could still be morally fucked though lol. \n\nAlso, what the fuck. ",
            "What the actual fuck? I mean, no stupid q's, but how does this even qualify? Why?",
            "Wat",
            "This is the sort of question I subscribed to this sub for",
            "Sounds rapey",
            "Are scientists getting bored?",
            "This ain't it chief",
            "Not unless the rat was getting sensory feedback and you knew in advance.\n\nOtherwise rape, slavery, fraud and such come in to play.",
            "I'm pretty sure if you unknowingly had sex with a rat, than that rat raped you. ",
            "Question of the century right here. I don't think it's beastiality... but you could make a case that it's rape, since the human has no agency in the situation.",
            "Ahhhhh the old Ratatouille switcherooie ",
            "Ratatouille 2: Eletric Boogaloo",
            "Whut?",
            "No. Thats why my case got dismissed. ",
            "WHAT DID YOU DO?!",
            "Ratatouille XXX parody",
            "Is this a Ratatouille reference?",
            "Jesus first linguine didn’t know how to cook now he doesn’t know how to fuck? How can collette ever go for that.  ",
            "Thinking about Ratatoiulle?",
            "I dont think so. Also why would you need to know this",
            "Wot",
            "Really testing the theory that \"no question is stupid\" ",
            "Dude, what’s wrong with you?",
            "That’s enough Internet for one day. ",
            "I think you inadvertently created a new fetish",
            "WTF bro lol",
            "This is the greatest question ever asked.  ",
            "Please stop, i can only get so erect",
            "The real questions this sub was made for",
            "No, but it miiiiiiight be rape.",
            "Asking for a friend...",
            "What version of Ratatouille were you watching?",
            "My mind is fucked.\n\nI'll never look at Ratatouille again. ",
            "What",
            "Ratatoulie?",
            "Congratulations, you are now a doctor of philosophy!",
            "Let me guess... Your asking for a friend? ",
            "Yes.\n\nSource: Done it.\n\nWas it good?: It was spectacular.\n\nAny other questions?",
            "No.\n\nIt might be statutory rape though.",
            "Watching some Ratatouille porn, and you got worried you just jerked it to some beastiality on a technicality, huh?\n\nWell have no fear. That's not beastiality. \n\nBut it might be rape depending on whether the person being controlled by the rat was consenting. ",
            "I think this sub should be closed down.",
            "Is this the dark side of Reddit",
            "Clearly this rat has some sort of human-level intelligence, so... _no?_",
            "I think you are going to a dark place when you watch ratatouille",
            "Ah. The ol' French Rudder.\n\nI would say yes.",
            "No you aint fucking the rat. You fucking a human controlled by a rat. At worst its rape but it aint beastiality",
            "Only if the rat can enjoy it.",
            "Yes",
            "It wouldn't be bestiality but it definitely violates the laws of consent",
            "The flesh counts, not the sentiment ",
            "Not beastiality, but would it be consensual? What if the human doesn't want to do it for example. If he wants is and is controlled by the rat, like cooking in Ratatouille, I don't see the problem. ",
            "Are you aware there is a rat under the other person's hat controlling them or not? If not, no. If yes, maybe??? If your thrilled that the rat is controlling the person and it gets you excited then you could be entering bestiality territory (sort of anyways). But if that isn't the case and you are aware that a rat is controlling the other person I'm pretty sure it just makes you a rapist with a rat accomplice.",
            "Animal husbandry is controlled by humans and we don't consider that bestiality, even when the human has a uhhh \"direct hand\" in the process.",
            "No need for the rat we are animals so it’s beastialiy either way ",
            "Nope. If the little control sticks had force feedback, then kinda yea it would be. If there was a mechanical genital stimulator as part of the controls, or if nerve impulses were shared directly from the human body to the rat brain or body somehow, then absolutely it's beastiality. The human body is basically just a meat condom, it's more than that if it's an extension of the rat's brain, it's part of the rat.",
            "What about a sentient bee?\n\n*Ya like jazz?*",
            "It would not be beastiality, as you are not having sex with an animal. However, you would not have the consent of the (unconscious?) person who you *are* having sex with, so it would still be problematic. The rat would not be having sex with you, either, even though it is controlling the body you are having sex with. Instead, the rat is manipulating the body and watching. Not to severely dampen the mood, but you could compare it to sex slavery in the porn industry, where someone (the rat) is coercing someone (the person wearing the hat) to have sex with someone else (the third person). In real life, this coercion might come from verbal directions rather than pulling hairs in a hat, but ultimately the position and role of the rat and the porn producer is the same—they both dictate the actions of someone as that person has sex with another person, meanwhile taking the position of an observer in the interaction.\n\nThat said, I don’t think the movie Ratatouille was nearly that problematic, nor would I draw those comparisons when talking about the movie. I only mentioned that comparison to help explain why the situation was not beastiality.",
            "Only if you knew the Rat was in the driver's seat and engaged regardless... in the sense that you were both psychologically fulfilled by the act, the Rat and you in sharing each other's experience of the sex act despite the use of a human, the person would be aware of the rats involvement and still sexually faccilited by orgasm despite the involvement of an animal. Normally we define bestiality as sexual involvement with an animal, I think although a human is involved they have engaged in the sex act with full awareness of the main contributors being the Rat, we have reached the crescendo I imagine, it sort of starts that proposition does the intermixing of an animal and our psychologies for mutual sexual fulfillment connote bestiality my imagining is that the psychological awareness and fulfilment does make such a proposition correct.",
            "No. \n\nIt would be rape though.",
            "/r/MorbidQuestions",
            "I think not. Because if I had sex with a rat controlled by a human I would not call that human sex, it will be  really fucking weird.",
            "Asking for a friend?",
            "#Rata-MeToo-uille!",
            "I wouldn't consider it to be that, but I'd probably say it was rape if the person being controlled didn't consent to it.",
            "“Asking for a friend”",
            "No, but it would be considered the rape of a human ",
            "Only if you fucked then doggy style",
            "Im pretty sure its beastiality if you do it with a animal.",
            "OP's username checks out",
            "I think that's under mind control. ",
            "You aren't, but the rat is. ",
            "Ratacoochie",
            "/r/enoughinternet",
            "No. If it were a human under a hat controlling an ape's moves, that would be beastiality. But if you're body is actually with another human, no. ",
            "I love this sub.",
            "That describes Trump being controlled by Putin.",
            "No, but it would probably be necrophilia.",
            "Why is this under ‘discussion’ and ‘learning’ when it should be under ‘holy shit woke’",
            "Let me answer this by reversing the question: If you had sex with a sheep whilst its every move was being controlled by a human, would it still be bestiality?: Yes. Bestiality is the act of intercourse with the body of a non-human animal, not the mind of one.",
            "It's definitely bestiality when 30% of our crop yields are due to plants useing honey bees to have sex with each other.  30% of the food you eat is made possible by beastiality...who's hungry?",
            "Ratatouille. Rat rat toolie",
            "Did you see the rebecca sugar cartoon",
            "No “stupid” questions",
            "A rat is involved in the act in a direct and sexual manner, so yes.",
            "Why, it's no more bestiality than the sex I get from women I woo into having sex with me after manipulating them with my berries is having sex with myself!",
            "No. It would be rape. Technically.",
            "Is this related to rebecca sugar's comic? Also no. It's not bestiality when you have sex with someone with tapeworms because you're not shoving your dick in that worm. I feel like this is the same concept",
            "Might be necrophilia more than bestiality.",
            "Is using a natural condom the same as having sex with a sheep?",
            "“*Asking for a friend*”",
            "This is more like r/shittyaskscience ",
            "You know i always used to wonder this with harry potter. Is it bestiality if you have sex with a animagus in animal form?",
            "what point are you trying to prove",
            "Here's a better question: Would it be child abuse if you had sex with an adult whose mind is reduced to that of a child for medical reasons such as injury?\n\nThat's why the threshold should be \"capability of informed consent\" and \"balance of power\"\n\nAnimals are not capable of informed consent. ",
            "r/shittyaskreddit",
            "Is it a hot rat tho",
            "If a dog held on a leash by a human is getting fucked by another dog, it's not bestiality, so no I don't think so",
            "https://www.youtube.com/watch?v=u0I4s_07DuA",
            "No, that would be...something you should invite me to",
            "r/askingforafriend",
            "New record, It’s 9:37am and I’ve had enough internet for the day. ",
            "No,  I'd consider that to be  more like rape. ",
            "Nope.  You're still having sex with a human, it doesn't matter if its being controlled by an animal.",
            "Is this.... about ratatouille....",
            "/r/onestupidquestion",
            "I feel bestiality wouldn't be a super accurate term in general if you were doing things with another human intelligence sentient individual like a talking rat. ",
            "Physically it wouldn't, like Punching a man in a bear costume, You wouldn't be punching a bear, you would be punching the ma\u000en.  \n\n\nPhysically it wouldn't, like Punching a man in a bear costume, You wouldn't be punching a bear, you would be punching the man.  \n",
            "Excuse me, Wtf.",
            "How high are you?  Hahahaha, keep living your best life, friend.",
            "Sexatouille",
            "Rapeatouille",
            "Oh like that one picture rebbeca sugar drew?",
            "This might be my favorite question ever.",
            "No, I think it's not, because you don't have any attraction to the rat, just the human. I'm just going to go ahead and take this Ratatouille DVD away from you for a while...",
            "Are you ok?",
            "Wasn't this a Robot chicken sketch? ",
            "Only on odd numbered days of the calendar.",
            "Okay, maybe there are stupid questions",
            "You think funny.",
            "No, because you’re not fucking the animal itself. Duuuhhhhhh ^../s",
            "Come on guys, this is serious!",
            "If you can successfully argue in court that it was not beastiality when you were doing the neighborhood cat that was mind controlled by another human being, yes. ",
            "*Excuse me*\n\n**What the fuck?**",
            "You'd think he'd let that chef guy manage on his own for that bit. ",
            "This question was generated be an anthropological AI",
            "Now that’s some research I’m interested in! Where do I sign up?",
            "This sounds like fun!",
            "Depends if he's French",
            "Note to self, never have sex with anyone wearing a hat.\n",
            "As long as you aren’t getting done in by Remi then I think it’s not beastiality ",
            "Thats a good question.\n\n&#x200B;",
            "Huh?",
            "If you are a rat, yes.",
            "Not this shit again, MOM get off the internet!",
            "Bruh.... Wtf? ",
            "Well, if we're talking the movie I think we are, we then have to re-evaluate the concept of what bestiality even is. We already know that the appearance and physical unit are anthropoidal, so if the personality is anthropoidal as well then I'd imagine the answer is no.\n\nIf we aren't talking about Ratatouille then it's sort of the equivalent of if a rat pressed a button for food and it was connected to a vibrator in your undergarments, would it be bestiality to get a rat to make you cum at all? That one I'm not too sure of",
            "Beastiality? No. \n\nRape? Yes, unless the controlled human consented to the entire thing ahead of time.",
            "lol the new ratatouille movie is gonna be SoOoOoOoOoOoOoOoOoO wicked",
            "Are you planning on doing something?",
            "I love how this question is tagged with \"learning\" ",
            "this is actually a really good question but also i hate it ",
            "/r/rule34 shit for Ratatouille in the making, folks.\n\nIn all honesty, I guess it wouldn't be considered beastiality since you aren't having sex with the rat itself. Beastiality comes into play when there is direct carnal contact with an animal.",
            "No. Is it necrophilia if you fuck a corpse controlled like a marionette by a minor?",
            "Username checks out",
            "Have you been watching Ratatouille porn too?",
            "ⁿᶦᶜᵉ ᵗʳʸ ᶜᵒˡᵉᵗᵗᵉ",
            "RATABOOTY",
            "The plot for Ratatouille 2.",
            "This is a reference to Ratatouille, but this could actually happen! There is a flatworm called the green banded broodsac that has the ability to infiltrate a host's brain and control it. They usually can be found mind controlling snails, but there's no evidence they \\*couldn't\\* control a human. You read more about that worm \\[here\\]([http://awesci.com/the-mind-controlling-green-banded-broodsac/](http://awesci.com/the-mind-controlling-green-banded-broodsac/))\n\n&#x200B;\n\nAs for the ethics of bestiality, I dunno. I guess not?",
            "Lol wut",
            "Only if you forget to say “no homo”",
            "Asking for a friend.",
            "How can I delete someone else's post?",
            "Ratatouille 2 confirmed?",
            "Ahhhh the age-old question. Guys I actually wrote my college thesis on this exact question.  While scholars are basically split on the issue, the most convincing arguments point to “no,” it is not beastiality.",
            "Too much Internet for the day ",
            "Well, let me ask you a similar question: If that same rat was making the person prepare delicious meals in a Parisian restaurant, who would be the chef, the human, or the rat? ",
            "I fucking love this sub",
            "Ratatouille 2 seems amazing",
            "You need to quit smoking",
            "how high are you",
            "Do you know the rat is in control? Like in Ghost? ",
            "This is probably the most interesting question I've ever seen.",
            "Is this a Ratatouille porn parody? ",
            "wow i hate everything about this post. This is the worst thing ive ever heard in the most fantastic way",
            "Hwat?",
            "I knew it had been too long without rule34 Ratatouille",
            "Asking the real questions ",
            "Almost afraid to ask, does Rule 34 apply? And I mean today. Obviously it will in a week as someone reading the post found their kink, and the internet does its thing. ",
            "No, put the crack down sir.",
            "I feel like you watched Ratatouille recently.\n\nBut to answer your question, no, cause the thing you're having sex with is still a human. ",
            "No",
            "the ratoutoullie 2 synopsis looks great",
            "r/kinkyRatatouille",
            "Asking the real questions.",
            "Nah go for it pal",
            "Vicarious Beastiality\nBeastiality by proxy ",
            "Can we substitute the rat with a gerbil? ",
            "No, because you're still having sex with another human. Just like how it doesn't somehow become not bestiality if you have sex with an animal while a human controls it's movements (probably just holding it down)\n\ngee i wonder what movie OP just watched",
            "After scrolling across this like 900 times ⬆️",
            "If you need to ask that question, you've don't something very wrong.",
            "Now im thinking of that cooking movie now",
            "Rape by ratmote control",
            "Depends- is the rat a full-on feral earth rat, or does it have human intelligence and social culture like the rats in Ratatouille? \n\nIf the latter, then you’re still having sex with a being, if the former, you’re having sex with an animal.",
            "That’s enough internet for one day ",
            "What?",
            "r/oddlyspecific"
        ]
    },
    {
        "post_id": "md6f92",
        "author": "Tmbgkc",
        "title": "If \"endorphins\" are produced by exercise, and they are the body's own \"opiods\", why do I feel so terrible EVERY SINGLE TIME I exercise?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/md6f92/if_endorphins_are_produced_by_exercise_and_they/",
        "score": 13499,
        "num_comments": 935,
        "created_utc": 1616700900.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/md6f92/if_endorphins_are_produced_by_exercise_and_they/",
        "comments": [
            "You may be pushing yourself too hard. When I tried to get back into running I did what would have been an easy three mile run when I was in shape and felt weak and nauseous the rest of the day. Now I'm working my way up to running a mile at a stretch and feel much better.",
            "There's a lot of possible reasons here. It's hard to know without any further details because I don't really know what you're experiencing.\n\nWhat kind of terrible do you mean? Are you exhausted? Stressed out? Depressed? In physical pain?\n\nWhen are you feeling that? At the start of exercise, in the middle, towards the end, after you finish, the next day?\n\nWhat kind of exercise are you doing? for how long, how often? Is it literally all kinds of exercise that make you feel this, from a brisk walk upward? Or are you doing something intense? \n\nI'm not a doctor or anything btw, just someone who knows some stuff about biology and managed to develop a more active lifestyle over the past few years of my life. This is just the basic information I'd need to give you a real answer to try and help you out best.\n\nEdit: the quickest answer I can give is that any intense exercise usually feels tough at the time even when you're used to it, and when you're not used to it the feeling of it being difficult overpowers any good feelings it might already be generating. Usually it feels best afterwards though, as endorphins operate on a relatively slow timescale (minutes-hours) and maybe even get released more post-exercise than during (emphasis on the maybe - I don't actually know exactly how they work in this context without looking it up). In any case, I usually feel the post-exercise 'glow' best once I've finished, stretched, showered and eaten and those steps are pretty important after any moderate to high intensity exercise, I think they contribute to the . In general, it's always tough when you're starting out a new type of exercise whether you're already very fit or not. It gets easier. But I can hopefully answer you a bit more specifically with more details :)",
            "Ya know, I've had that same question my WHOLE life. Turns out I had a big hole in my heart. Got it repaired, and life is different now! It's worth talking this over with a doctor if that's an option.",
            "[deleted]",
            "People just say shit without actually understanding it. \n\nAn endogenous opioid doesn't necessarily make you subjectively feel good, and I just saw a study recently that said the mood effects associated with excercise aren't even mediated by the opioid system. \n\n\nI can't find the study but here's Johns Hopkins on the topic: https://www.hopkinsmedicine.org/health/wellness-and-prevention/the-truth-behind-runners-high-and-other-mental-benefits-of-running",
            "Same, OP, same. I don't know why, but I'm right there with you. So few people even believe me! Like the one person on here who thinks it's cause you're sore. *facepalm* Like no dude, I'm fine with being sore. That's NOT the problem.",
            "OMG I’m the same! And no one seems to believe me. If I have a bunch of stuff I have to get done on a particular day, there’s no way I can exercise, because after exercise I’m...done. Utterly exhausted. Sleepy, low energy, unfocused. And I’m talking about just a 40 minute walk or something. \n\nPeople keep telling me to find something I like, but I’ve tried, walking, kickboxing, cardio machines, etc. weightlifting was better, but not great. The only one that is bearable is swimming, and even that is draining.\n\nEveryone thinks I’m crazy, or lazy, or just being difficult.",
            "I've never felt good during or after exercise either. I still do it because it's good for me, but I plan for feeling terrible after",
            "[deleted]",
            "Just think how terrible you'd feel *without* the endorphins!",
            "I always feel like I have the flu after exercise.",
            "I used to run and cry all the time, I was trying to beat the depression but my elevated heart rate gave me anxiety and weird repressed memories would come out almost every time. I don’t run anymore because of health issues, but I do miss the rush.",
            "I feel like some of these answers are giving you advice on how to make your exercise time better. I think you are asking why doesn’t your body release the endorphins you constantly hear about. Exercising has always left me feeling terrible no matter what shape I’m in or what type. A physical therapist told me it has a lot to do with sweating. Those who sweat are more likely to feel good during and afterward. I don’t sweat like a normal person. This leads to your body overheating and swelling which counteracts any of those positive feelings. Made sense to me.",
            "It's a continuous thing. You don't see the effects immediately.",
            "I have a heart condition and exercise, mild exercise, makes me very tired and I fall asleep. I will pass out if I exercise too hard.",
            "Terrible how? There is a adjustment period if you are new. When I first started to become serious i felt like hell. Tired, achy, tight and immobile. After a while I'd finish a big workout and feel alive.\n\nDiet also plays a major role",
            "That 'runner's high' is genetic bullshit for most people. Exercise is tough. It gets a little better every day though.",
            "\"Maybe you're doing it too hard\" \"maybe you need to build up tolerance\" \"there's probably some period you enjoy though, right?\" No, people in the comments, I do not. I feel shitty at the beginning, I feel shitty in the middle, and I feel shitty at the end. This was just as true when my legs were pure muscle as it is now when they're pure flab.",
            "Some people have something called [Exercise Intolerance](https://en.wikipedia.org/wiki/Exercise_intolerance) that makes them feel sick after physical exertion.",
            "Trainer at a boxing gym here. Here is an overall tip:\n\n\n\nExercise should be seen as a celebration of what you can do, not a punishment for what you ate. \n\nSo how do we get there?\n\n\nApproach exercise with an attitude of exploration and find something you really enjoy. Any activity that allows you to move your body in space is valid. Walking, dancing, yoga. Some people are motivated by being a member of a team, and gravitate to basketball or other team sports. Some like solitude and choose running or other activities done alone. Some are motivated by the honing of skills, and ju jitsu or other martial arts are attractive. There are an infinite number of reasons to be attracted to any activity, and an infinite number of ways to make any activity \"exercise\".\n\nThe best exercise routine is the one you can't wait to do, so keep exploring until you find an activity you love. It's out there, no question. \n\nOnce you've found one, (and BTW it's ok if it changes constantly) the activity itself will motivate you to push yourself. Start slowly.  Low effort over time is much more effective than \"heroic\" effort sporadically. You don't take all your medicine at once. The body gets better at handling strain, and you will begin to feel much better over time.",
            "I almost always feel like shit after a boring excrrsice. That' was true even when I was in shape, although to a lesser degree. Even less if it si fun, which is rare, but still not really positive. I do feel better in general if I do it regularly.\n\nI think it depends on a person, like every other chemical.\n\nDiazepam calms me down, no effeft on sleep. Some people are knocked out by it.\n\nZolpidem makes me sleep and feel groggy in the morning. Some people are woken up by it (this also happened to me twice so I get it, it seemed exactly the opposite of what it usually did.\n\nTHC usually makes me wanna do interesting mental things (no matter the strain), but rarely calms me down. Some people experience the opposite ratio.",
            "This happens to me. Not new to exercise, I know what I’m doing, but more often than not I’ll show up feeling fine and leave feeling weepy and pissed off. There’s no question to me that it’s a chemical thing, because my trainer and gym are great and even though I loathe how it all makes my body feel, that “ugh this heavy weight sucks” feeling is not enough to cause such a negative mental reaction. (I’m sure it doesn’t help, though.)\n\nThat said, I deal with depression and am on an antidepressant, and I’m sure there’s some cocktail with my own body chemistry that’s causing the problem. If I go lighter on myself it’s better (and running vs strength & conditioning is better), but that’s a tough tightrope to walk when you’re a naturally competitive person who likes to push herself.",
            "[deleted]",
            "The runners high is a lie that people have to tell themselves.",
            "Even afterwards? I get a sort of high from it, although it is not fun at the time",
            "Same. I get headaches whenever I do any kind of cardio.",
            "For me, dehydration.  I chug water now and feel way better.",
            "Probably because your muscles haven't been conditioned for it yet. When you get sore or achy after exercise it's because you are building muscle, which literally requires muscles to tear (microscopically) in order to reform stronger tissue. Once your muscles have built up a bit it's easier to recognize the good feelings that come with exercise because the initial soreness isn't prominent. If you've been experiencing this for months you are probably doing a workout that isn't right for your body and should as your gyms trainer (if they have one) or even your doctor or a physical therapist what exercises you should be doing instead. Also, performing the right exercise wrong can have really bad side effects, so always make sure you understand the machine before using it. Good luck!",
            "Sounds like your post workout care isn't very good. If you don't stay hydrated, eat healthy and enough, and sleep enough working out will just burn out your body\n\n\"You can't out work a bad diet\"\n\nSleep is just as important as well as staying active to keep the muscles from stiffening up. Full body stretching every day and targeting recent muscle groups that got worked out really let's the tension out and releases the endorphins",
            "Could you define how you feel terrible? I think I could help you out since I work in nutrition and have a bachelors in health. \n\nIs it just aches? is it pain? just overal mood being poor?",
            "How long have you been working out?",
            "Maybe you're pushing yourself too hard. Try just doing 20 minutes of cardio a day at 140-150bpm. Its just enough to get the endorphins for me",
            "How long have you been working out ? Are you just lifting weights or are you doing cardio too ? Because you need to do both , at least in my experience.",
            "What exercise are you doing, and how much of it?\n\nHave you tried doing a kind of exercise that isn't too strenuous, and/or one you enjoy doing?",
            "I get endorphins when I do outdoor activity all day. It has to be a combination of prolonged, moderate cardio and sunlight. I don’t get crap from doing squats in a gym.",
            "I usually feel great after the fact, never during",
            "What kind of exercise?\n\nI hate endurance exercise like running etc. I love lifting heavy things and putting them back down. Days where my program has less reps are more weight are the most enjoyable",
            "Because the brain is complex. Exercise isn’t the only thing that produces endorphins, and endorphins are not the only thing produced when you exercise. Endorphins are a neurotransmitter. They have an association with opioid use but, it does matter *where* in the brain neurotransmitters are, and what networks they’re associated with.\n\nIt’s sort of like saying “money buys bread, and bread is food for people to eat. So why is the guy at the electronics store not eating what he purchased?” Economics is more complicated than that, as is neuroscience.",
            "You have to do the exercise that’s right for you. I can run for days and nothing.. just feel like crap. Swim for an hour and I rule the world and feel great!! Switch up what you do until you find something that you find yourself wanting to do, and it doesn’t have to be traditional exercise, rock climbing, paddle boarding, rowing, join a team whatever, if you enjoy the activity that has you exerting yourself the endorphins will follow 💪🏻",
            "It was like this for me, and then I learned I have aerobic-induced asthma! Got an inhaler and now life is a bit better.",
            "I bicycle... 40 minutes a day? And then recently this week I did a few multiple-hour rides with a lotta hills. I used to box, too, and that was WORK\n\nI don't feel better after.\n\nI don't feel stronger.\n\nI don't feel anything but tired and cranky.\n\nSOMETIMES if I push myself insanely hard I get the \"second wind\" that people always talk about\n\nI have never once enjoyed exercise.",
            "While I’m here.... does anyone else get genuinely sad af when working out?",
            "When you are more consistent with your workouts, you won't feel the soreness as often, and at least with me, I wake up and get more energy after my workout then I had going into it.",
            "Maybe because you’re so used to bad endorphins that the good ones are just so good they hurt. Just like how water tastes like heavenly sex, but when my roommate drinks it he gags because he also downs 2 liters of soda per day.",
            "Try out different types of exercise. Some people like running, other people prefer weightlifting, and others might feel best when they’re doing moderate swimming. Also, a team sport or fun activity might be a lot more enjoyable with the added benefit of exercise. You can also try out these exercises at different intensities. \n\nSome ideas: kickboxing, cycling, ultimate frisbee, rock climbing, dance, soccer, basketball",
            "While exercise does trigger the release of endorphins, it also damages your muscles and burns energy. Perhaps you don't exercise that frequently, and your body is not used to that result, so your body's response to that damage, irrelevant of the endorphins released, is to tell you \"Hey, I feel like shit! We shouldn't do whatever the hell that was again!\" This can be dealt with by exercising regularly. The more you experience something, the more desensitized you will become as your body learns \"Hey, this thing I hate isn't as bad as I thought. It sucks, but it's not as bad as I thought,\" and the exhaustion and burning from exercise will fade to tolerable levels.\n\nIt could be that your brain doesn't like you, or that chemically something's up that's causing these chemicals to behave incorrecctly when interacting with your receptors. Maybe the exercises you perform don't trigger sufficient release of the happy chemicals, maybe your medication doesn't like the happy chemicals, maybe something you ate or somethin going on in your life is looking at the happy chemicals and whacking them in the face with a shovel!",
            "DO SOMETHING YOU ENJOY. \n\nI used to do classes.\n\nOr run with a group.\n\nI tried working out alone.\n\nI tried fucking zumba.\n\nThen I took a boxing class.\n\nThen I joined a boxing gym.\n\nTurns out...hitting people makes me so ducking happy. \n\nI do cardio for conditioning but I spend most of my time training. \n\nI love it so damn much.\n\nMove the way your body wants you to move. \n\nEnjoy.",
            "Because you don't want to work out. You have to WANT IT!",
            "1. Age 2. Working out too hard. 3. The activity doesn't hit your endorphin g-spot. 4. Medications like Adderall and Ritalin can interfere with endorphin production, as well as most antidepressants - they effectively jam intense pain and pleasure signals.\n\nCardio is necessary but it doesn't trigger runner's high for all. My endorphins flow during weight training and I feel great; cardio? Meh. Do something different every time and find out what triggers yours. When you find it, do more of it.\n\n.",
            "Endorphins, short for exogenous Morphines, get released because of a whole host of things, like eating good food, laughing, sex and yes, exercise.\n\nOn of the purposes they serve is to down-regulate pain sensitivity, but seeing as they are a relatively weak opioid and preferentially only bind to one receptor they aren't best at doing so.\n\nIf you're exercising and you feel like shit, remember that while there most certainly are some endorphins flowing through your veins right there and then, there are a lot of factors (e.g. Being out of breath, sore muscles, etc.) that they cannot overrule, they're not Morphine after all.",
            "At least you are not alone. I have felt this way my whole life, and have been a fairly active person. I ran cross-country in high school, and got in shape enough that I was pretty decent (still remember my personal best time: 18:56 for a 3-mile dirt track with plenty of hills, basically a 6:20 mile pacing maintained for 3 miles), but I never experienced any sort of runners high like others speak of. It was always a chore, pushing myself the whole way, and I just felt tired afterword (but was better than dealing with P.E. classes and I at least felt some satisfaction in my performance).",
            "I don't think I've ever had an exercise endorphin. I do the exercise and tell myself positive things throughout - how lucky I am that my body can do this (however minimal), I'm lapping everyone on the couch, it's not raining, my lungs feel like shit but they're happy even if I'm not, etc. I feel accomplishment and virtue having done it, but this is overshadowed a million-fold by sheer relief. \n\nMusic never quite cut it for me. It was better than nothing, by podcasts are the way forward for me. Or the radio. I need chat. I did half marathons about 10 years ago before podcasts were invented/I'd heard of them, and two hours of running was just barely more than miserable. Now I'm 'happy' with 30-60 mins running with chat in my ear.",
            "I agree. I don't like exercise at all, and it's something I do because I have to for my body, not because I like it. \n\nYes, sometimes my body feels good when I realise I've built up tolerance or fitness - but it's an observational good, not an emotional good or an endorphin rush. It's not something I enjoy. Sometimes I feel good after yoga (especially with extended shavasana), but mostly I just feel full and tired. I will never join a gym because I don't get the joy out of it. \n\nI don't think it's an issue. Some people feel that rush and seek to convince everyone else that it is the only way your body is going to react to working out. I walk to work, I practise yoga, and I sometimes dance to music in my room. It's enough.",
            "You might just not like it. I feel good when I lift weights. But if I went for a run I would quit after like 10 mins cuz I hate it. Walk for 4 hours with no break in a random city in the world? Do it all the time (pre goddamn covid) and love it! Walk on a treadmill for 30 mins with no break and no iPad? No fucking way.",
            "If you exercise to the point that you are seriously out of breath, or basically to where your cells are anarobically producing energy, meaning cellular respiration without oxygen, then they are also producing lactic acid. Lactic acid is basically responsible for the soreness you feel after exercise. \n\nTry more sustained, light exercize to where your heart rate is up a bit, but you aren't out of breath. \n\nI will sometimes aim to keep my heart rate at about 115 BPM. This is barely exercise, and it takes effort to no let my heart rate get much higher than that, but if I sustain it long enough I will definitely break a sweat and burn calories because I am starving by the time I'm done. \n\n&#x200B;\n\nIf I understand correctly, lower intensity exercise is also better for burning fat, even though you go through calories at a slower pace.",
            "Because after enough exercise your blood sugar falls and this makes you tired and sleepy.",
            "You might eat like shit too. If your body is running on fried nuggets or something then it’s just not gonna do well. Like pouring propane into the tank of a car. \n\nPut supreme in ur belly 😤💯",
            "I'm in this camp too. Exercise never feels good. Never has and I've tried all kinds, strength training, running, yoga, pilates, biking, hiit, etc. Honestly, if they weren't so darn sincere, I'd think the people who say they love it were lying or delusional. \n\nThen I saw some studies like [this one](https://hscnews.usc.edu/hate-exercise-it-could-be-genetic) come out a few years ago. Turns out there are people out there like us who just never enjoy exercise. \n\nStrangely, that helped. Now I've finally managed to create an exercise habit that is minimally unpleasant and I'm okay with that. I'm no longer searching for the \"right\" kind of exercise because I don't have one. \n\nGood luck to you.",
            "Because you only do it once every six years",
            "I don’t know. I lift weights, rock climb, and swim. It’s all pretty great and addicting. With rock climbing, it’s so addicting most of us wind up getting an injury from overdoing it. Find a form of exercise that is fun and gets you pumped. If you put me on the cardio machine I would think I hate exercise, but actually I’m pretty addicted to fitness, just needed to find the right type for me.",
            "Because you’re a fat fuck like me",
            "Stretch before and after, eat well before (but not right before), don't push yourself too hard, If the man with six fingers on his left hand ask you to spot him leave the gym immediately, stay hydrated and keep in mind that you're doing this for youself, nobody is looking at you (except six fingers guy, he's always looking).",
            "I don't think it affects everybody the same way because I never enjoy working out but I still do like four to five days a week and I've done so for around 15 years.\n\nmildly sucks every time but I feel proud of myself and I look great and that's enough to keep doing it for me.",
            "I think it highly depends on what you do.\n\nFor example, running or lifting in a gym, anything where I can't turn off my head, is a nightmare. And I feel even worse afterwars.\n\nThough I remember running quite a few times just because I was drunk and didn't care and wanted to get home earlier and the weather was ok. So drunk running?\n\nOn the other hand, I can walk 50 km with heavy bag on a mountain, go climbing (artificial wall is good enough), or maybe some martial arts, that works, because I can focus mind on something.",
            "Depends on what you are specifically feeling terrible about. But in general the most common complaint of burning feelings and pain comes from lactic acid, which is a byproduct of anaerobic cellular respiration. Or in short it is when your body produces the energy to use your muscles when it doesn't have enough enough oxygen. It's also the more inefficient process for making energy vs when oxygen is present, which is why you in general don't hurt when you do normal day to day activities.\n\nAs you work out you improve your body's efficiency in getting oxygen, producing energy, and dealing with lactic acid. Which is part of the reason it sucks more at th e beginning then in the long term.",
            "Build up slow, reach the \"high\", cool down.  Don't go bonkers too fast or you'll get hurt.\n\nSource: a state university education",
            "Yeah you should not be feeling terrible every single time. At first yes, then your body starts to love it - it's in our physiological nature to enjoy movement. We are hardwired moving machines. Either you're severely out of shape, you might have underlying health issues or this is a mind over matter thing - you're just telling yourself you feel terrible.",
            "You don't do it often enough, or you are doing things incorrectly.",
            "Lactic acid",
            "[deleted]",
            "“It never stops being hard, you just get used to it being hard.”\n\nThat’s the best fitness advice I’ve ever gotten. The endorphins etc are not a “high” you get during activity but an overall sense of well-being and energy that permeates your life and a feeling of power knowing you have the capability to do things others can’t.",
            "The terrible feeling is a consequence of not exercising and will get worse the less exercise you do.\n\n\nTake this analogy. Tidying the house makes you feel amazing and it make life so much easier. You'll find that if you tidy often, you'll feel great\n\n\n HOWEVER, if you haven't tidied for the last 10 years, then tidying will be hard and time consuming and involve lots of difficult decisions. You might be tempted to declare that tidying makes you feel like shit, but it's the lack of tidying that has made it like that. Tidy everyday at it becomes a 5 minute task with rewarding sense of accomplishment EVERYDAY. NICE FEELINGS EVERYDAY",
            "I also feel terrible every time I exercise, but I’ve been playing RingFit for a couple of weeks now and I legit can’t have enough of it... except of course at some point I have to stop. It’s not an incredibly tough workout, but it’s been making me feel really good and it improved my mood tons. So maybe you just don’t like the kind of workout you’re doing? Like maybe weighs aren’t your thing and running is more rewarding? Dunno, try doing different things until you find something that makes you want to do it again the next day. Also, you don’t need to spend hours exercising. 20 minutes/day should be enough.",
            "It takes a certain fitness level to hit the endorphin rush. You have to work up to being fit enough to run/bike long enough. Which kinda sucks. But when it finally hits, oh God. Changed my life, I'm a cardio guy now and used to be fat my entire life. Now a normal weight. \n\nMy best advice is start slow and remember, if you ran even .01 of a km/mile today, you lapped everybody on the couch :)",
            "1. depends on the person whether you endorphins give you high. on some it might make a huge effect and the total opposite on you\n2. maybe you're unused to it. \n3. lactic acid. \n4. trauma. you hurt yourself somewhere maybe, could have happened with exercise as well.\n5. not a proper heat up and stretch session may turn your training into a nightmare.",
            "not enough exercise, push through the discomfort to find the high",
            "For me, at least, during workout sucks. But once I've finished, I feel great, sometimes euphoric. The best I've felt after a workout was yoga.",
            "This will be long but I will try to help.\n\nYou mostly feel terrible at first because you've spent too long conditioning your body to a sedentary lifestyle.\n\nBut it doesnt take too long to adapt to working out. If you continue to suffer unbearably after 2 weeks, there may be other things preventing you from being able to properly cope.\n\nAll exercise breaks the body down on a cellular level. To an extent, the imnediete damage can be lessened by conditioning yourself to the work being performed and regularly eating a variety of natural foods - fruits, vegetables, meat. \n\nContrary to what's been authoritatively preached in the past, saturated fats and natural sources of cholesterol are crucial for cellular repair, especially after intense exercise. \n\nDepriving oneself of these 2 things in attempts to \"lose weight\" (drop body fat%) is the most counterproductive thing people trying to get into shape can do. If doing this, your recovery periods will last unusually long and will be painful and miserable for you. A lot of \"fitness failures\" occur at this time because the person experiences chronic feelings of hunger despite loading up on \"healthy, whole grain\" blah blah blah CRAP aka **empty processed carbs** while avoiding what their body truly needs. These carbs will be used to replenish some of the depleted muscle/liver glycogen stores that were used during the person's workout, but because there's so many of them in the blood, as a form of protection, the body immedietely converts most of them into fat, no matter how much that person has just killed themself working out. This will lead to body fat % increasing all while feeling like crap during your attempts at getting fit. Most people give up after experiencing such negative results.\n\nYou need natural dietary cholesterol and saturated fat to drop body fat in a healthy manner. Yes, you need the the stuff they say is \"bad\"; its \"bad\" because they say it causes heart disease, and they're not 100% wrong. But this statistical analysis-derived health advice does not apply to non-sedentary individuals. Any doctor will tell you this. \n\nCarbs (technically, excess sugar in your bloodstream) is the real culprit of most forms of heart disease. The bad \"cholesterol\" that kills people in heart disease, is from their own dead, decaying cells that fell victim to the effects of excess blood sugar. Its not from eating steak, eggs, or liver. It's just that people who get heart disease usually dont discriminate too much when choosing what to eat. They typically eat the most palatable foods they have regular access to, which is why time tested favorites like fatty red meat or buttery omelettes, etc etc get a bad rap, in statistical analysis at least.\n\n\nYou should eat fat-rich sources of meat like salmon with real butter, broiled prime cuts of beef or baked chicken thighs, etc etc about an hour or so after working out, EVERY TIME you work out. Fresh vegetables (that you have to cook yourself- you needn't eat them raw, but do eat them with some form of natural fat, like real butter) are important too for the numerous forms of natural antioxidants and trace elements that function in repair/recovery mechanisms that they have to offer. Just eat until you're full. Not stuffed, but satiated. You can (and should) eat again if you're experiencing intense food cravings a half hour or more after finishing this meal. (THIS is a good time to eat a bowl of cereal - you're body is saying \"hey, theres enough fat and fiber in your guts right now to support the slow release of any carbs you feed me - which would be a great, non-harmful way to replenish all that glycogen you used up during your workout today!). \n\nWhat I mean to say is, you dont want to completely cut out carbs. Stick to natural sources like potatoes, home made bread isnt bad in moderation, even a bowl of mini wheats isnt THAT terrible, but always be mindful to limit carb intake and learn to avoid refined sugar (I know I said miniwheats... nobody's perfect lol) as much as possible unless you're eating fresh fruit. And always view sugary beverages as the poisonous swill they are. \n\n\nIt's going to take a few months to the better part of a year of sticking to a \"exercise + eat well + rest and sleep well\" routine before you'll actually begin to experience these habitual workouts more like daily meals... or even, dare I say, a drug of choice 😳\n\nIt really does feel that way eventually, hence why people can experience exercise addiction. And although a small endorphin release accompanies adrenalin during exercise to make the damage being done to the body conveniently imperceptible at the time, it's not endorphins that exercise addicts (or opioid addicts for that matter) crave... its dopamine, which gets released in unnaturally large amounts and processed in unnatural ways when people abuse addictive drugs, but gets released and processed in a perfectly healthy, natural manner by achieving challenging goals we set for ourselves that in some way improve our living conditions. Dopamine enables us to develop healthy habits just as much as it drives us to develop unhealthy ones. \n\nBy the time you get habituated to your workout routines, you will have become more sensitive to dopamine because increased bloodflow and better overall health will increase the number of dopamine receptors on the cells in your forebrain, and accordingly, you'll be able to enjoy and look forward to the little dopamine kick that successfully getting through these routines will provide. There are other, more complex mechanisms that come into play here, but the idea remains the same - exercising is great, self-reinforcing way to get \"high\" that avoids all the negatives of resorting to drug use to make oneself feel better.",
            "You're not working out hard enough. You have to break through the wall. Idk how else to describe it.",
            "Because you're out of shape it's pretty obvious.",
            "because you probably ate like %\\^&%\\^ and there is more to \"feeling\" good than simple exercise. You have to feed your body the right nutrients before you can even contemplate a healthy workout.",
            "With cardio (sweaty hard-breathing exercises) there's a boundary you have to work past. The first minute or two, or even 5, if it feels terrible slow down and work more gently. At a certain point your body burns through its short term energy and starts burning other energy stores, and at this point you will start to feel much better and will be able to maintain the pace for quite a good while.",
            "If you have no tolerance and do too many opiates at once you'll feel like shit too.",
            "Because you probably lack natural testosterone, stop using reddit and get out more and meet some ladies and actually push yourself and go out biking and running you will feel great and get with pretty cool chicks if you talk to them. \n\nExercise feels great when you remove the fake worthless shit from your life and enjoy being with people and being who you truly are.\n\nLifestyle change takes actual lifestyle changes, not just going to the gym for an hour a day.",
            "Because if you didn't produce endorphins you would feel worse. I don't get this idea that a good run, or exercising can make you feel like you're high or whatever, because that certainly isn't the case. I do feel a sense of pride, or a job well done from exercising, but I'm sure that very minor endorphin boost is just the body's natural way of keeping you from feeling like absolute shit for working out.",
            "[deleted]",
            "Bc that's bullshit",
            "I use mindcover matter technique. Every time i endure pain- i apply a broad smile to my face. That, and knowing that it's just pain. Nothing serious. Temporary stuff. And, at 63, thankful for my strength and great health. Be happy for any gym time you have - it might help you dodgecthe hospital or nursing home when you're ancient.",
            "\"Psychologist Isabel Clark says people get angrier at the gym because working-out mimics the body's stress responses. The heart rate rises, adrenaline courses through the body and breathing becomes shallow – all symptoms of the 'fight or flight' response. \" [https://www.counselling-directory.org.uk/blog/2012/10/17/gym-rage-working-out-makes-anger-worse#:\\~:text=Psychologist%20Isabel%20Clark%20says%20people,'fight%20or%20flight](https://www.counselling-directory.org.uk/blog/2012/10/17/gym-rage-working-out-makes-anger-worse#:~:text=Psychologist%20Isabel%20Clark%20says%20people,'fight%20or%20flight)'%20response.\n\n&#x200B;\n\nFitness hangover is a real thing. \n\n[https://metro.co.uk/2019/08/14/feel-rough-after-a-workout-it-could-be-a-fitness-hangover-10562378/](https://metro.co.uk/2019/08/14/feel-rough-after-a-workout-it-could-be-a-fitness-hangover-10562378/)\n\n  \nExercise ups your anxiety levels. \n\n[https://3steplifestyle.com/2016/08/25/exercise-making-depression-anxiety-worse-doctors-dont-tell/](https://3steplifestyle.com/2016/08/25/exercise-making-depression-anxiety-worse-doctors-dont-tell/)",
            "Youre probably not in good shape at the moment and you need to keep pushing even if the endorphins aren't kicking in.",
            "Because opiates are terrible for you lol",
            "Bc you're in horrible shape",
            "Because you are tired. What people don't realize is need to be in shape to enjoy exercise. It will pass as you progress. Even though I always played sports when I first started to do strength and conditioning I was nauseous after training for months(almost a year), I even threw up a couple times. Eat light, don't drink too much water and you'll be fine.",
            "Drink more water and eat less gluten. You'll wake up feeling energized.",
            "Because you’re doing it wrong? When I go to the gym I always have this „highness“ afterwards, feels like I have hit a joint one or two times",
            "Because you're a weak bitch?",
            "You sound like a whiny bitch. Have a better attitude and you will feel better",
            "So there are days when I go to the gym and work on a smaller group of muscles. While they may be pleasing to my eyes in the mirror, I don't get the same rush I get after crushing a new deadlift personal best or being able to grind out an extra rep when my goal was 8 with squats. It's not that my body feels great but it's more of a psychological thing for me at the time during the session and shortly thereafter. \n\nI still dislike running because I don't get the same effect that I will in the gym but I'm working on hating it less now that the weather is starting to become less of a factor by simply just getting out and doing something my body isn't as conditioned to do. Will I learn to love running? Probably not but the first run is always going to suck more than the 50th and my body will adapt over time and maybe drop a few feel good brain chemicals after I finish.",
            "Do you feel terrible while exercising or after exercising? Also, what is the exercise?",
            "They're not actually similar at all, overall. But I understand why you'd ask this.",
            "They're not actually similar at all, overall. But I understand why you'd ask this.\n\nAre LSD and serotonin in any way comparable, just because they hit some of the same receptors?",
            "I always feel great AFTER I exercise, which makes me wonder why it’s so hard to motivate myself to do it in the first place.",
            "I don't feel terrible unless I over do it way too much when it's been too long. I feel fantastic when I do a little bit more than I'm used to. And in the moment, I feel like superman when I really push it but feel absolutely awful and regret it and hurt to high heaven afterwards. \n\nIf you're feeling that bad with normal exercise, there might be something else going on.",
            "You might be pushing too hard, you might not be pushing hard enough. I don't always feel good but 90% of the time after lifting weights I feel invincible. But it took awhile for me to know where I was at, what my training was ect.\n\nI started running in December and that's 50/50 whether or not I feel buzzing afterwards. I ran my furthest last week, I did 5 miles (which is good for me). I was knackered, my chest was on fire, my calves hurt like hell. But once I had stopped and caught my breathe I felt so good. Three days later I do a half arsed 2 miles and felt nothing.",
            "You have to get to a certain threshold to get those sweet, sweet endorphins. I’m sure it’s different for everyone, but I only get them when I work out especially hard for a long, uninterrupted duration. It’s a great feeling that I’ve only ever had like, a dozen times.",
            "When I first started working out as a freshman in high school for football, I felt like complete shit. My body wasn’t used to any type of physical activity. I had the worst shin splits, my head hurt, my body felt like blowing up. It takes a while for people to start getting that “runners high”. Just think about your goals (short term and realistic) and then over time you’ll start feeling the goodness after working out.",
            "Honestly I feel fine afterwards. One of my favorite things to do is go to work all day where I’m walking around for 9 hours then do a 1 hour weight lifting workout followed by a 5k run around the neighborhood. Wrap up the night with a wank and im guaranteed to have the best sleep of my life",
            "I associate exercise endorphins with how it feels AFTERWARDS rather than during. I felt like shit every step of my 5 mile run today but felt high as a kite for the rest of the day.",
            "I used to jog a mile every few days and even though I would feel a bit better after running I would still feel better just sitting in my room playing vidya",
            "Please consult a doctor",
            "Are you new to it? Once you get into the routine you’ll feel it"
        ]
    },
    {
        "post_id": "9h8aob",
        "author": "hereforthebamb",
        "title": "How to ruin my brother’s livestream?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/9h8aob/how_to_ruin_my_brothers_livestream/",
        "score": 13497,
        "num_comments": 1560,
        "created_utc": 1537385829.0,
        "selftext": "Hey everybody,\n\nHere’s something for you: my brother (in middle school) is constantly live-streaming to his two or so viewers. As a bonus, he tries to be a soundcloud rapper. \n\nJust now he let the dog shit in the house (he was supposed to be watching her), pretended his B.B. gun was a glock and shot at some rabbits outside, punched a wall, and is now blasting some rather trash rap. He says today is his 24 hour livestream. \n\nIt’s my one day off this week and I am desperate to read some of my book and do some yoga. How can I end this bullshit? \n\n\n\nUpdate: I ended up unplugging the WiFi and hiding his charging cable. Turns out he was using WiFi, so this was pretty affective. I made him come with me to the local park, though he screamed like a massive cunt. Brought a ball and we played football.\n\nI’d like to thank everyone for there mostly legal suggestions, can’t say reddit isn’t creative. Especially the people who talked me out of any malicious actions and suggested more kind things I could do. Though I’d like to snip internet cables or have one of you lovely people hack him, I think it’s better to keep his music/videos for later embarrassment. \n\nAlso, since 50% of you suggested whipping my dick out I’d just like it to be known that I’m a girl, and therefore have no massive wang to swing around",
        "permalink": "/r/NoStupidQuestions/comments/9h8aob/how_to_ruin_my_brothers_livestream/",
        "comments": [
            "Report him to twitch for showing a gun on stream and he will be banned",
            "Keep calling him so he can’t livestream.",
            "Cut the internet.",
            "Take his charger.",
            "[removed]",
            "[removed]",
            "Go to the setting page of your router and block all his devices from accesing internet",
            "If he livestreams on Twitch, he might be underage. I think the minimum age for streaming is 14, correct me if I'm wrong.",
            "Get him to a therapist.",
            "Turn the power off at the breaker board.",
            "One-up his ass!\n\n* Play louder music\n* Shit in his room\n* Fire said BB gun into the room (maybe at his stuff)\n* Punch a wall on camera\n* Put a rabbit in his room",
            "Find some way to robodial his number 10 million times.  ",
            "[deleted]",
            "Where are your parents?",
            "[removed]",
            "[removed]",
            "Report his account constantly.",
            "https://github.com/wethegreenpeople/TextBomb/releases\n\nI made this Android app that texts people on a certain interval whatever message you want. Set it up to send him a few thousand messages every few seconds and you should bother his phone enough.\n\nWarning: setting your limit to 0 seconds may cause issues on both phones",
            "Since he gets internet from his phone your best bet might be leaving and finding a peaceful spot away from the house. Sorry, I know that’s not what you wanted to hear. Or you could ask him to be a little quieter!",
            "Call his phone company and pretend ur him and say you want to report his phone as lost/stolen and wish to immediately cut the service ;) \n\nThey’ll probably ask you for his number, date of birth, account password and sensitive info like that \n\n",
            "Cover ur fAce and show up naked on his livestream to get it banned. ",
            "[deleted]",
            "[deleted]",
            "Pick up dog shit. Put it in a bag. Say \"I have something for you\". Give him the dog shit.\n\nUnscrew the router from the wall, although if he's using data that won't work.\n\nThe age limit to stream on twitch is probably 13 or so, it he's younger than that you could probably go on and report him.\n\nBlast eurodance music really loud.",
            "Please don't ask for or encourage OP to share his or her brother's live stream or social media links so people can all go over there and harass or mess with, flood, etc. \n\nhttps://www.reddithelp.com/en/categories/reddit-101/rules-reporting/account-and-community-restrictions/what-are-rules\n\nThis is exactly what their rules ask us all not to do and will get both you and the subreddit in trouble. ",
            "Go on stream and tell him to do his shit\n\nIf that doesn’t work, do the fortnite dance in the background, no one likes that dance\n\n",
            "Considering your family dynamics, your brother may be using this activity as a coping strategy. Simply removing it without replacing it with anything positive and supportive could be all the more damaging to him and you in the long run. ",
            "[deleted]",
            "Take his phone while he’s away from it and hide it.",
            "I don't mean to be that guy but the people commenting here are giving you good answers for what you want but vengeance isn't going to fix anything... What the kid needs is two parents and by the sound of it he needed them 9 years ago. Short of running the house yourself or rewinding time. Rather than try and further the conflict between the two of you I would try and avoid it. Remove yourself from the home situation as much as possible. You can't help him but you can prevent yourself from getting hurt more. ",
            "If your phones are connected and he has an iPhone go to find my iPhone and click lost mode and make up a random (long ass) passcode, he won’t be able to open up his phone!",
            "Post his private streaming key on twitter, without context. That’ll sure ruin it! (If you can’t get that, get the stream and post it everywhere you can. On street signs, Twitter, Instagram, Facebook, become a door-by-door salesman and tell everyone to ruin it) what I’m saying is\n\n#give us the stream",
            "get his credit card and donate money to himself. taxes will eat him up while he thinks hes making money",
            "This sounds terrible, but shout the n word as loud as you can (such that it can be heard on his stream) like 5-10 times. Immediately after that report his stream and he will get banned pretty fast",
            "1.  Enter his room\n\n2.  Take his phone\n\n3. run\n\n4. remove SIM card\n\n5. return phone, unplug router downstairs\n\n6. No service, no wifi. \n\n7. lock door.\n\nALTERNATE: \n\n1. Acquire **loud** speaker\n\n2. Blast classical and blues into his room.  Tell him it's your 24 hour livestream. Livestream his reaction if necessary. ",
            "Twitch bans accounts for nudity so you could print out a picture of some titties and show it on his stream... then make your own account and report him",
            "Came into this thread ready to call you an asshole but wow I sympathise with you. Your brother sounds pretty troubled. ",
            "One-up him by going viral with a livestream of all the ways you attempt to stop his livestream. The internet loves meta shit.",
            "Before you do anything  record him looking like a dumbass. Itll be good for when he starts dating/getting older to embarress him sufficiently. Download some of his soundcloud stuff on an mp3 or ipod for safekeeping you have a golden opportunity here.",
            "Try very loudly streaming him outside his door. He will probably get very unnerved by the sound of his own voice. That or play very annoying music (i vote aqua-barbie girl on repeat) ",
            "[deleted]",
            "Start watching porn very loud so his stream can pick it up lol",
            "\nI spent a lot of time picking on and teasing my brother when we were younger and I regret a lot of it. Maybe try to do something with him for his livestream or talk him into doing something else less obnoxious with you on your day off? ",
            "Walk in and embarrass him. Maybe “Hey, mom wants to know if you need any more pull-ups?” Or you could always dress up with some friends and fake swat him (no weapons or anything, just scare him)",
            "If he streams off his phone just keep calling him on a private number? If you have a number he won't recognise you can even get apps that automatically send text messages.",
            "Get some Nutella and when he’s live-streaming barge in yelling about the dog shitting in the house and proceed to rub the Nutella on his face.\n\nAll his friends will make fun of “lil shitface” until he learns a lesson.",
            "Take the harddrive out of his computer. You won't have to deal with learning how to change technical settings and stuff. You can do this while he's in the shower or pooping. Just be sure the PC is powered off, first. \n\nYou can put it back in the next time he's showering or pooping. Again, while powered off. He might get confused then frustrated after a few times. \n\nYou can disable his microphone and speakers in sound settings. He can stream, but it'll only be video and no sound. \n\nYou can also go into Programs is his Windows settings and uninstall Chrome to set him back. More frustrations. \n\nIf you want to be more evil: create a new gmail address on your own, then reinstall chrome on his PC and login with that account. When he tries to open his sites again, he'll likely put in his passwords and save them. On your PC, you can login to that same new account and access the newly saved sites with the passwords saved and do good sibling work. Things like messing with his twitch account. \n\n",
            "Twitch? Does he use a camera? Walk in nude. \n\nGo report his channel. \n\nNo camera? Yell racial slurs near his Mic. \n\nThen report his channel. \n\nYouTube? Play copyrighted music, show nudity - report ",
            "If he has a comment section just be a dickhead in it.",
            "Take out his sim card. Cut it in half. ",
            "Be the good older brother, act mature and don’t humiliate him. I believe it’d be awesome if you take him outside and spend the day together. He will definitely not be glad in the beginning and you’ll certainly need to force his ass outside, but you both will enjoy some quality time. Think about it, would you prefer to be remembered as a supportive big bro or a vengeful jerk? You can be the one who help him get through the most difficult age and build a great relationship with him.",
            "Hosepipe. Hook up to a faucet, get into his bedroom, soak the fuck out of his phone.  Boom, no more livestream. You win. Failing that, steal his phone, flush it in the toilet.\n\n",
            "throw the breaker that controls power to his room\n\nor the whole house",
            "Put oil on his camera lens. Or Nutella",
            "Get a friend of your's that he doesn't know to dress up like a burglar and bust into his room mid-stream. ",
            "Tape down a can of deodorant so it’s permanently spraying and throw it in there. Then cut the internet.",
            "Scream KAMIKAZE and slapped him the face with like a pie or a piece of bologna. If you have a bag of white bread that would probably work even better.",
            "Follow him around and vacuum, use a leaf blower, or play Nickleback. All three are terrible and should drive him nuts.",
            "If you want to be a massive dick: Put his phone number on different websites  and tell people to call",
            "Watch his steam and humiliate him from his 2-3 viewers. Using a fake account, of course.",
            "If you want to put a stop to his nonsense, unplug your router. Pick up said router. Put it in your room. Demand he correctly answer your riddle to retrieve it. Purposely devise an impossible riddle that seems possible enough to stump him for hours. Profit.\n\nIf you want to make him never stream again, wait until he's an hour or so in. Go to his room and bang on the door as loud as you can. Loudly and clearly let him know that you got the jizz stains out of his socks but he really needs to find better ways to clean up after himself, you're getting worried about the rate and frequency of his masturbation sessions.\n\nGood luck out there. ",
            "It all depends. If your the older brother. Go in and clobber him. If your the older sister. Go and embarrass the shit out of him. He's trying to be a gangster ? Come in there hot with \"Oh my god foo foo (or any embarrassing nickname you can think of) these cupcakes you baked for grandma are amazing!\"  \"Hey you little shit mom brought your hemmeroid cream it's in the bathroom. \" \"Nicole's sister Stacy just called she said the poem to sent Nicole was fucking awful\" you ha e to get creative.    \n  \nSource : was annoying brother to two older sisters. ",
            "Yell some weird shit. An example might be:\n\n> \"WHAT DID YOU DO, (NAME)? A NAIL CLIPPING FELL OUT OF MY NOSE!",
            "1. Go to /b/ on 4chan\n\n2. Post \"hey check out my livestream\" with a link\n\n3. ???\n\n4. Profit",
            "what’s his stream? we could be toxic as fuck on it ",
            "show up on his stream with your shirt off. ",
            "Was anything you tried effective ?\n\nYou say he is using his phone data to stream, do you mean he is tethering from his computer and utilizing the phone data plan or actually using his phone to livestream ? \n\nDid you already post a link to the stream here? I am sure a lot of redditors are very creative and can cut this off rather quickly. Good luck ",
            "Let him start and play barbie girl on repeat as loud as possible and as close as possible. ",
            "Give him a fake adoption certificate saying he was adopted",
            "Try to help him get better would be a good start. It'll either ruin his day or he'll actually get better. Win win",
            "Post his stream link here and I think Reddit calling his rapping horrible and that he should stop streaming would be fun",
            "[removed]",
            "Well, turn off the internet, or you can always throttle the Internet with Netflix. If you really want to get on his nerves, find the loudest speakers you can and blast classical music ",
            "Take the router, change the password on the wifi.  Long term, talk to your parent, tell them that your brother is neglecting stuff he needs to do and get parental software on the computer so he can’t go on live-streaming websites at certain times of the day",
            "Shoot him with the bb gun so he knows how that feels. ",
            "Captain here : Simple minds get simple solutions... Just wait until he begins his live stream and then show boobs or naked part of your body, proceed to report for nudity, insta ban succeeded... Flies away. ",
            "Where the f are your parents lmao ",
            "Throw water on him",
            "Record every last minute of his stream and download all his soundcloud songs. Bring it up as much as you can in like 3 years to embarass the shit out of him.",
            "Go into his chat and shit talk him?",
            "Hide all the phone chargers in the house.",
            "Recreate that Irish vine about not flushing the toilet",
            "I don't know what age he is though check the ToS of whatever live steam service he's using.\n\nIf he's underage then report his stream. You could probably report him anyway for shooting his BB gun at Rabbits. \n\nWon't fix the problem right away though with any luck you could get his account suspended or even banned. ",
            "Go to a website called 10 minute email and constantly make accounts that report his stream ",
            "I'm just going to say, shooting at a rabbit is a huge red flag, along with punching a wall and this selfish attitude, keep and eye on these characteristics.\n\nAs for the stream, I would just bother the mess out of him while he's trying to do w/e he does and when her gets mad, tell him quit his shit.",
            "Change the wifi password and when it goes down tell him you can't figure it out. Then take him out somewhere with you. Spend some time with him one on one. Do something fun together other than video games. Have a conversation...about anything positive. Listen to him. Come back home with him. Do your own thing.",
            "I feel like this needs to be said; the best method is usually to show love and compassion. Sit down with your brother and have a civil discussion about your grievances.\n\nOr just cut the internet. That works too.\n\nAnd as a fellow reader I feel obligated to recommend Brandon Sanderson. He has some of the best fantasy novels if you're interested.",
            "6 hours into the live stream, have you found a solution? ",
            "Horrible way to do it, but it would ban him is to put porn on his screen",
            "At first I downvoted the post, but after reading it I upvoted. whatever happens I hope the stream is ruined. Poor rabbits :(",
            "Take his phone, turn airdrop receiving on, and spam the FUCK out of his phone four minutes and twenty seconds into the stream ",
            "This is a bit late for you OP, but for future reference;\n\nIf he's that young, he's likely on a family plan with one of your parents for his phone.\n\nThis will include parental control settings for his account. Which usually includes a data cap, or even better, an hours of access control.\n\nIf you know your parents usual passwords for shit like this, it's pretty trivial to login to their website, enable the controls and either turn off the access for a few hours, or drop his monthly data allowance within a shared plan to 0. That would cut him off. Then you can just cut the WiFi and he's screwed.",
            "Is he on wifi? Log into the router and go to its QoS settings, putting his phone at a very low max upload limit. It'll be really frustrating because he won't be able to stream above like 144p, and even then it'll stutter",
            "He sounds like the worst kind of teenager.",
            "I don’t like this question at all\n\nYou need to teach him how to handle the livestream as well as other life tasks, not just ruin it straight up.\n\nRead a book under a tree, do some yoga where he isn’t.",
            "Start blaring the opposite of rap, country music. I mean put on some rubber ducky convoy twanger music. Play it as loud as possible. If need be put the speakers facing the walls of his room. Better yet find that video where someone is playing with those squeaky dog toys and making sounds like somebody is having sex and play that. I bet if you look hard enough you'll find something. ",
            "Loudly play copyrighted music in the background every time he streams, or as often as you can, for as long as you can. This way, he'll be DMCA'd.",
            "Send us the link end it will end before he can start.",
            "Turn off WiFi",
            "Throttle his devices and select programs to a trickle, e.g. via router or something like Netlimiter. Block or redirect a few choice sites, e.g. with the hosts file. Autohotkey some bizarre keyboard behaviour, e.g. sometimes an important key doesn't work as expected - I recommend 's'. Use the Stylebot browser extension to subtly alter certain aspects of sites he frequents. Whitelist some ad providers. Change how these things occur via automation, with a bitta randomness, e.g. with Task Scheduler and batch files. Not sure about the effectiveness but you could try patchwork aluminium foil-ing the other side of the wi-fi facing wall to make a mess of his reception. You could also talk to him about his behaviour and try to bring him some understanding.",
            "Disconnect the internet?\n\nWhen I need the internet to mysteriously go down I unplug the phone line from the wall socket. My kids just see the flashing lights on the router and believe me when I tell them the problem is not at our end.",
            "Just act super cute with him, walk into the room calling him your honey and offer him some cookies and milk while treating him like a 2 year old. Do this once every half hour and there will be nothing left of his ego.\n\n&#x200B;\n\nOr like other said, just cut the damn internet",
            "If he is just randomly shooting rabbits for no reason you need to tell somebody about that. I would take his BB gun. That's sick.",
            "Do some fortnite dance in the background and when he looks over, alt+f4 him",
            "You need a EMP device",
            "There's always taking the dog's shit and throwing it at him, then yell at him and tell him to watch the damn dog. Lock your door of course so he can't retaliate. He sounds like a slob. If he's leaving anything around the house, throw it at him while he's trying to stream and tell him to pick up his damn shit. I used to do that to my brothers and they'd quit doing it for awhile.\n\nThere's always the ole shaving cream in the palm and smacking him with it unexpectedly, lol.",
            "1. Dress up like your mom.\n2. Bust in on him during his stream and yell at him in your best mom voice.\n3. ????\n4. Profit.",
            "Turn on quality of service in your router settings, and throttle his connection to the internet, to dial up speeds.",
            "[deleted]"
        ]
    },
    {
        "post_id": "lq1nes",
        "author": "None",
        "title": "Is the upvote arrow orange or red?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/lq1nes/is_the_upvote_arrow_orange_or_red/",
        "score": 13483,
        "num_comments": 576,
        "created_utc": 1614032272.0,
        "selftext": "Everybody keeps saying it's red and purple/blue, but I see orange and purple/blue.\n\nEDIT: I didn't think this was done to farm upvotes, it was a genuine question. I thought I'd only get a few posts here, jesus christ.",
        "permalink": "/r/NoStupidQuestions/comments/lq1nes/is_the_upvote_arrow_orange_or_red/",
        "comments": [
            "I'm colorblind. I thought it was green until recently.",
            "Neither/both. It's [orangered](https://www.colorhexa.com/ff4500) (or red-orange).\n\nEdit: I'm as confused as OP for why this blew up.",
            "It's orangered.",
            "Reddit has called it orangered: [https://www.reddit.com/r/OutOfTheLoop/comments/2jne44/what\\_was\\_the\\_great\\_orangeredperiwinkle\\_clash\\_of/](https://www.reddit.com/r/OutOfTheLoop/comments/2jne44/what_was_the_great_orangeredperiwinkle_clash_of/)",
            "It’s white with a grey outline.",
            "I thought it was because when you hover over the upvote button it is clearly red. Once you click it though, it's orange.",
            "Orange-red. The RGB value of it (on old Reddit at least) is 255,73,0 which is pretty close to the RGB value of [orange-red](https://imgur.com/lK82LcR). \n\nIt's basically the same color as the [Reddit Logo](https://imgur.com/lBuMe8b) and no one claims that THAT is red",
            "There's no point in discussing this unless you come up with a solid definition of the colours red and orange.",
            "Dude it’s orange. Put it next to something that’s really red and compare.",
            "[removed]",
            "Since orange is a mixture of red and yellow, there are two types of orange: reddish-orange and yellowish-orange, depending on the proportions of the mixed colors. The same goes for any secondary color. I'd say it's a reddish-orange.",
            "After upvoting, the button is #FF4500, which is to say 100% Red, 27% Green and 0% Blue. [encycolorpedia.com](https://encycolorpedia.com/ff4500) calls this Orangered.\n\nWhen hovering over the button (without having previously upvoted), it's #CC3700, which is 80% Red, 21.5% Green and 0% Blue. [encycolorpedia.com](https://encycolorpedia.com/cc3700) doesn't name this color, but it's really just Orangered adjusted to be 20% darker.\n\nIn RGB mixing, \"Orange\" is usually a lot of red (first 2 hex digits), a moderate amount of green  (middle 2 hex digits) and little/no blue (last 2 hex digits). Hex digits range from 0 to F (which would be 15 in base-10). Double-hex digits range from 00 to FF (which would be 255 in base-10). By using 6 hex digits, there are 2^(24) , or slightly over 16 million color combinations that can be described this way.",
            "It is orange, exactly as the reddit logo",
            "It's orange and I will die on this hill",
            "If we're getting technical, I would say it is orange. It's a red-orange.",
            "Orange  \ndisclaimer, I use old reddit.",
            "When it's a foot away from my face it's orange and when it's 4\" away it's red.",
            "I see orange and purple",
            "Well the down vote on your obvious karma farming post is definitely blue",
            "Blue on this post.",
            "Similarly, are tennis balls green or yellow?",
            "i see purple not blue",
            "uhh.. blue?",
            "*Rorange*",
            "It is red orange. Someone found and posted the color code for it.",
            "It's red orange or tangerine",
            "Red orange is a color. It’s that",
            "It can be pinned down to a number color but it will depend on the abilities of your display as to what you see. Also your opinion of what 'red' is.",
            "I would say tangerine.",
            "Its red however the red contains elements of yellow but not enough to classify it as orange",
            "It’s red/purple for me",
            "I’m guessing people downvoted then upvoted, and now here you are.",
            "The fact that the noble team Orangered has gone unremembered is very disappointing",
            "I wanna thank the people that downvoted this. Usually these posts get a sickening upvote ratio, like 90%+. Faith in redditors slightly restored.",
            "🧡 🍊 orange",
            "Not sure, but the down vote arrow is definitely blue",
            "I'm gonna quit reddit.\n\nIt's just as bad as Facebook. Lol",
            ">this was done to farm upvotes\n\nWhat's the point of farming upvotes? Ego boost?",
            "Is much more orange than red, like the reddit logo itself",
            "It's orednge",
            "It is red,  you need to see an eye doctor if you see it as a different color.",
            "Red is what I see.",
            "Orange-red and periwinkle \n\n\n*know your damn reddit history, whippersnappers*",
            "To me, they are orange and purple.\n\nHow many people have I offended with this statement?",
            "I believe they technically call it orangered (as per the great orangered/Periwinkle war of 2013).",
            "Officially, the upvote is Orangered and the downvote is Periwinkle.",
            "It's orange to me.",
            "It's gray on my mobile app",
            "Ya'll know it's grey right?",
            "Its orange.\n\nEveryone says tail lights are red too, but when they light up at night they are also orange.",
            "Color is a little subjective. There is a definite value in digital terms (already done in the comments), but it is like saying what’s more yellow, a stick of butter or a school bus, would you say butter is really kind of white and a school bus is a bright kinda orange? No they’re both fucking yellow. At the paint store, one might be called cereal milk and the other one golden sun, but when we describe them to people, we would say familiarly like butter yellow or school bus yellow, people generally know what we mean. The up arrow is red, it’s literally mostly red with slight green that browns it slightly, as red and green are complementary. The blue down arrow is blue, like cornflower blue. It’s offset by red and green to close but not equal amounts, and how that pales it and also mutes the blue so it’s close to a grayish lavender, but still closer to blue, but not blue like uh, the sky or a mailbox or the ocean, except the mailbox, tends to change color anyway, but people know what color a blue sky is and maybe what the ocean looks like, and they are all blue but not the same color blue. \n\nI mean maybe look at some paint chips or something and how many interpretations of the same color there are.",
            "[removed]",
            "Why u wanna start this shit again?",
            "Yeah, it definitely seems like a murky orange. \"Burnt orange\" to be exact. Also not to pour gas on the flames but the downvote arrow looks kinda lilac to me ;)",
            "It's grey until you click it",
            "Colors sometimes look different when surrounded by other colors, in certain contexts the red may be more prominent and in another context the orange could stand out.",
            "Lol it’s orange and purple to me.",
            "I see orange",
            "🍊",
            "orange/purple",
            "Looks like a very red orange to me",
            "rorange :3",
            "Is the downvote button Blue or Purple?",
            "Red orange",
            "Orange",
            "[removed]",
            "OrAngE rEd fuck no that shits orange",
            "Red has a hue of 0, orange has a hue of 30, the upvote is 16. It's technically closer to orange, but you could say it's either way.",
            "it's the opposite of Periwinkle.",
            "Red",
            "Red",
            "Vermilion.  Halfway between red and orange",
            "It's grey",
            "This is that damn dress all over again.",
            "The downvote is purple apparently.",
            "The war was almost 10 years ago, i need to get off this website.",
            "That’s one way to upvote farm lol",
            "Farming upvotes i see",
            "Aaaaand everybody here just upvoted to be reminded. Well played my man.",
            "I know what color the down vote arrow is",
            "Cyan",
            "oh god here we go again...\n\nin all seriousness tho its neither, or technically both",
            "I see what you did here. Easy karma!",
            "Red",
            "I know what color the downvote button is",
            "its definitely red",
            "It’s black. The un-upvote arrow is orange-red",
            "The upvote indicator is orange the button is black, like the pause button",
            "There is no spoon",
            "[deleted]",
            "I don’t fucking know, I’m colorblind",
            "Yes.",
            "Yes",
            "NO!",
            "I see what you did here..",
            "There’s no color for me. Is there supposed to be?",
            "It's actually a white H.  (can't unsee)",
            "Isn't it white or gray",
            "Scarlet",
            "SHUT THE FUCK UP",
            "People are saying it's orangered but realistically to the eye it really does look orange, definitely not what people with good color vision would call red.",
            "O",
            "Now that u ask i can't really tell",
            "its grey",
            "Downvote is definitely blue, I can confirm.",
            "Yes",
            "if you just want my opinion, now how it really is, then i see it as orange...",
            "https://enchroma.com/pages/color-blind-test",
            "Who the frig cares",
            "I fell right into your trap lol",
            "Yes, it is.",
            "Blue",
            "I see what you did here...",
            "yellow.",
            "Remember Team Orangered vs. Team Periwinkle Blue",
            "Red orange? You can mix colors, its not illegal.",
            "I’m color blind",
            "I see scarlet and purple😳",
            "Really just... Screenshot, go to ms paint, paste, use the eyedropper to sample the color, create a square save it, drag it to Google images, see what comes out.\n\nI did that with the dress too.\n\nSubjective perception, different screen technologies, ambient light, night mode, blue light filters and different type of eyes, as well as varying opinions on where one color begins and another ends which tries to fit 16 million colors into maybe less than a 100 colors defined to a person (unless they studied art colors dyes paints for whatever reason)\n\nOr decide for yourself it doesn't matter in the slightest",
            "Yes",
            "Yes.",
            "It's this a secret karma farm? I love it.",
            "Yep",
            "Stop this 2 year old argument please.\nWe heard it all in 2019",
            "It's grey",
            "It’s ok, I’m sure it could be either or 🤷🏽‍♀️ I have a pair of pants that I personally think are green but everyone else says they’re tan. We all see things differently and that’s alright 😃",
            "Mines clear",
            "It’s the same color as the Dreamcast logo, the US got.",
            "It's called REDdit for a reason 🤣",
            "It is whatever you want it to be.",
            "it's gray",
            "Also am I the only one who thinks that they changed the colour on the NSFW tag?",
            "Green-black",
            "Mines blue.",
            "Everything I see is covered in innumerable tiny points of constantly changing colour.",
            "Yes",
            "ITS FUCKING GREY! END OF CONVERSATION",
            "It's a mixture of *Red Dit* and *Betty White*",
            "Scarlet",
            "Portland orange?",
            "Someone is experiencing the Mandela effect...",
            "Yes",
            "Yes",
            "It's grey",
            "Is grey. Am dog.",
            "Blue",
            "Yes",
            "Looks Orange and Lilac to me !!",
            "Neither, it's black",
            "Take your upvote. Tis green. Also I mix up green and orange.",
            "I see purple and dead people!!🤪",
            "In Australia, my upvote is blue.  Very strange, I know",
            "Idk because i clicked the blue arrow",
            "It's whatever color is reddit logo",
            "Idk man but the down vote is def blue, just checked for ya! ;)",
            "Yes.",
            "Check out the up button on r/dogecoin 😉",
            "What it’s orange. The colour of lava",
            "shut up",
            "Upvoted this just to see. Very clever. Also it’s red.",
            "Hahaha good try, it actually worked :/",
            "i see what you did there OP",
            "Upvoted to confirm scarlett red",
            "It is neither because the upvote arrow dosen't really exist. It's just a bit of code on your display.",
            "Not sure, but the downvote is blue. Check it on my post!",
            "As a designer who has that curse of an eye that can literally see the difference in very similar colors, its orange, just open an youtube tab and a reddit one and you can clearly see it, sure its an orange more to the red side but red is the purest color (if its either lighter or darker it has another name, if it goes to the pink side or to the yellow side and starts to be a whole different color) while orange as a range of shades.",
            "Well played",
            "Got me",
            "Yes",
            "Orange is a stupid colour, I say red.",
            "yes",
            "Reddish orange.",
            "Orange and purple",
            "Orange",
            "Depends on what you use to view Reddit.",
            "Orange, with some red hues.",
            "Vermillion",
            "It looks more red-orange to me, more red than orange,  However if you say it's orange-red, more orange than red I guess you have it.",
            "Definitely red when you hover, but then changes to bleeding rectum after you click",
            "o  r  a  n  g  e",
            "I would say orange, but wont correct it if someone said red, it is close enough colors that it doesnt really matter",
            "It's a red orange which is a shade between orange and red",
            "It's orange for me, and some art by reddit, for example the too many server requests one, shows Snoo getting crushed by a pile of orange upvotes.",
            "Both.",
            "Officially, the upvote is \"orangered\" and the downvote is \"periwinkle\"",
            "orange",
            "Blood orange",
            "downvote is blue, upvote is orange. also it might depend on if ur on night mode or not",
            "redorange",
            "Orange",
            "I feel like it’s 50/50 now but it used to be orange and it should be orange",
            "It’s definitely orange",
            "It’s a dark orange. Or [vermillion](https://www.thepinkbride.com/wp-content/uploads/2016/11/Shades-of-Orange-Wedding-Meanings-dark-deep-bright-and-orange-shades.jpg)",
            "Red orange / indigo [+]",
            "Orange for sure.",
            "I call it Kyoto temple orange.",
            "Where’s the gif of the guy saying “it’s blood orange” or whatever?\n\nEdit: [found it](https://giphy.com/gifs/christopher-palu-blood-orange-tumblr-is-trolling-us-vIglTBwkTpyMM)",
            "It depends on if your a man or woman. Woman see more of a color spectrum then men, so technically it is both.\n[article](https://www.bibalex.org/SCIplanet/en/Article/Details.aspx?id=10304)\n[article 2](https://www.nationalgeographic.com/culture/article/120907-men-women-see-differently-science-health-vision-sex)",
            "it depends on wether you have upvoted it already or not, try it.",
            "Orange",
            "orange",
            "It’s both, but it’s more orange than it is red.\n\nSource: My feelings and biased opinions",
            "Orange, clearly.",
            "A rusty red for me.",
            "My Gs it’s orange and purple",
            "Orang",
            "I've always thought of it as orange, myself.",
            "Seems more orange to me",
            "O-red-nge",
            "Orangered and periwinkle.",
            "orange for sure. it’s the same color as the logo",
            "it's orange",
            "I say it's orange, thought it's not too far from being red honestly.",
            "Red red-orange.\n\n600 nm wavelength is my guess, but I also have my blue light filter on all the time, so it might be more orange than that.\n\nLooks mostly red to me.",
            "Fun fact, women perceive colors of red better than men. But I think its more of an orange than a red, but still reddish. So an orange-red.",
            "How I see it: orange-ish red is impossible. Any red that is modified with orange becomes orange. Therefore, the definitive answer is reddish-orange.",
            "Orange-red.  But between orange and red, it does lean closer to orange, based on rgb/cymk.  But it’s very close to the direct middle between them.",
            "It’s red-orange. Or orange-red.",
            "Red-Orange, like Scarlet.",
            "To quote the Apollo 11 space crew, “IT’S ORANGE”.",
            "Orange purple",
            "Orange",
            "It's orangerer",
            "It's blood orange",
            "Orange",
            "Red",
            "Orange purple",
            "It's orange. Its name may be orangered but that's still orange. Any red that has any amount of yellow in it is orange, it can't be both red and orange.",
            "when you are upvoting from the inbox (pc) it is more orange than red but when you upvote from post, it is differrent",
            "I'm with you. It is very orangey.",
            "I only use mobile and the upvote is orage and downvote is purpleish.",
            "Looks like a redish orange to me. A tad closer to red.",
            "orange",
            "It's just orange. Red orange is a descriptor, not a color. It's more orangey than reddish. If you want to make up names for each specific wavelength then fine, call it Springtime Rust or Redorange like a paint chip to paint your house, but if we are considering the basic colors, then it's orange and not red.",
            "Orange for me",
            "tawny",
            "For me, up is an orange-red and down is a blue.",
            "i see red and very pale blue.",
            "Red",
            "It's orange and purple for me.",
            "Orange",
            "without getting too technical to the average person its colour would be considered orange.",
            "Rorenge",
            "It's a reddish orange. It's both honestly.",
            "It looks red on my device with a slight hint of orange.",
            "Not orange enough to be orange, not red enough to be red either lol",
            "Orange\n\nI turned off my comfort view which lowered the blue-filter and it looks more red, but still orange. Same as the icon.",
            "They are officially /r/orangered and /r/periwinkle.\n\nThere was [a war over this](https://www.reddit.com/r/OutOfTheLoop/comments/2jne44/what_was_the_great_orangeredperiwinkle_clash_of/).",
            "Rorange",
            "Simple answer - it depends on the settings of the screen you're using.\n\nOn the normal colour gamut on my phone, the arrow is *very* clearly orange. If I switch to \"super-vivid\" mode, the arrow is red.",
            "Not long ago there was a war about this on the meme pages, it lasted a couple weeks. \n\nIt ended with someone posting a colour chart showing what colour it was and basically it’s in between red and orange and the downvote is in between purple and blue.",
            "It's orange",
            "If you search up the code for the color online (I think it's like ff5843 or something like that) it reveals the color is literally \"Orange Red\"",
            "I've always seen it as orange",
            "I see orange/blue",
            "*whispers* orange-redish & blue are the brand identity colors.",
            "It looks orange to moi",
            "It’s orange just like the reddit app is it not? That’s the only colour that would make sense anyway why would it be red?",
            "A dark orange maybe blood orange",
            "I think the color is called tomato. At least in my language.",
            "For me it's bright orange but very close to red. Someone who is color blind would have issues",
            "it's orange and purple not blue",
            "I see orange",
            "It’s orange",
            "Both, depending on the display you are using, and the brightness, nighttime settings(mobile), contrast adjustment and so on the color may appear much different. \n\nExcluding the possibility of a user being color blind, the color should arguably be all over a spectrum or red and orange."
        ]
    },
    {
        "post_id": "as8s7j",
        "author": "None",
        "title": "Is there discipline or area of knowledge where there is nothing left to learn?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/as8s7j/is_there_discipline_or_area_of_knowledge_where/",
        "score": 13485,
        "num_comments": 1589,
        "created_utc": 1550570342.0,
        "selftext": "EDIT: wow this blew up, thanks for my first gold and silver! I'm glad everyone was able to have such intresting discussions and I certainly learned some new things. ",
        "permalink": "/r/NoStupidQuestions/comments/as8s7j/is_there_discipline_or_area_of_knowledge_where/",
        "comments": [
            "Tic-Tac-Toe strategies ",
            "Any game that is mathematically \"solved\".\n\nThat specifically means that a) there is a distinct set of best options, and b) we know how to get there.\n\nChess isn't solved, even though computers can play chess better than humans, because noone in the world has the power to program every possibility of a chess game into a computer.\n\nConnect 4? We know every possible combination, which ones have you win and what the fastest way to get there is.\n\nUnless you then make a variation on the game and expand the domain to include more, we have functionally complete knowledge of the game and it's strategies.",
            "[Kinematics](https://en.wikipedia.org/wiki/Kinematics), maybe? My granddad was a kinematician, and he used to say that the discipline reached its peak in the 1600s.",
            "Would a Rubik's cube count?",
            "[deleted]",
            "Maybe you heard but, around 1900's , a physicist has announced that all of physics has been discovered, all what remains is more precise measurements, only for a bunch of bad bois to uncover quantum mechanics, also ruin what we know about gravity and generally the way forces work, and to this day we don't know how do they work, or how to link quantum mechanics to classical mechanics.\nAs a physics major, i don't have enough knowledge yet to say that for sure, but depending on my understanding of the best current 2 ways of describing the universe - which are super string theory and simulation hypothesis - , both of them suggest that there are boundaries to how far we can go with our knowledge as human beings.\nIf you need more details about why do these ways limit our knowledge, i will be happy to complete talking.",
            "[deleted]",
            "Bionicle lore is complete. So is lord of the rings, etc... Fandoms, if that really counts.",
            "Please watch [Can We Reach The End Of Science? by Exurb1a.](https://youtu.be/RxP7mz86PHo) I promise you the 5 minutes would be worth it.",
            "This is a bit of a paradox...\n\nI'm sure there are subjects where the \"what-to-do\" has been mastered, but I don't believe there can ever be an end to the knowledge of \"how-to-do\".\n\nBut, if I show u a different way to get to the same sum, are you really learning something new? ",
            "Speedrunning the original Super Mario Bros. ",
            "[removed]",
            "That’s a very paradoxical quandary: how do you prove you know all there is to know when you might not know what you don’t know?",
            "This is a bit tricky. Some disciplines are pretty mature in the sense that the tools of the discipline are quite robust and unchanging, like Statistics or Math in general.  That isn't to say that people are not doing new things within those disciplines, like developing new ways to study them, maybe through Artificial Intelligence, meta-analysis or computerized approaches. Material sciences stall waiting for new materials and breakthroughs all the time. Fields like Nanotechnology and AI are screaming forward. \n\nI guess the short answer is No. Disciplines might slow down but take off again when someone figures out a new direction for them or new tools become available from another field.  ",
            "Astrology. There was never anything to learn to begin with...",
            "The alphabet",
            "Accounting. Mostly because it's a field that's there to describe other stuff rather than to explain why. \n\nMy accounting prof in college put it this way:\n\n\"I never got my PhD, because all accounting PhDs are are just waiting until GAAP changes a bit and then looking at the stock market to see if anything happened.\"\n\nWith that said, in my opinion, you're doing yourself a huge disservice by not taking multiple accounting classes in your lifetime, it's so useful. ",
            "The surest thing in any field of study is that as soon as you think you have it all figured out, somebody comes along with a new discovery that blows it all up.",
            "never studied it myself, but maybe Latin? ",
            "it depends on how broad or narrow your scope is.\n\nOne of my English professors mentioned to me in passing that he thinks some novels are now exhausted in terms of interesting scholarship -- i.e. that there's literally nothing unique left to discuss about, e.g., *The Great Gatsby*\n\nI'm not totally convinced that's correct, but it's plausible",
            "[removed]",
            "Since we can take pictures of earth from space, we are pretty much done mapping the Earth above water.  Below water not so much.\n\nIf I want to really say \"yeah we know this for sure\" we can just look at the highway system in North America.  There's nothing left to learn about where all our roads are.\n",
            "Any IB kid look at this and instantly think tok?",
            "Bowling",
            "Underwater basket weaving",
            "Ctrl. F: \"Astrology.\"\n\nEverything of value to be learned from Astrology was sucked out and incorporated into Astronomy *centuries* ago.\n\nAnd yet people are still banging on about rising signs and birth charts and compatibility options and Planet Pogo in ascendant, as if they're actually *calculating something.*  \n\nSweetie-darling, all possible calculations have already been done, all possible experiments have already been carried out.  There is really nothing there.  ",
            "Finite Group Theory is pretty much done and dusted.\n\nAll the simple groups (basically analogous to prime numbers in that they are the basic building blocks of all groups) have been classified.\n\n\nhttps://en.m.wikipedia.org/wiki/Classification_of_finite_simple_groups",
            "Mathematics in general has some areas that are considered closed. Besides simple games as others have mentioned (simple in the sense we can list all possibilities or we can at least effectively describe and evaluate them), there is for example linear algebra. To name an important and quite vast part of mathematics.\n\nA short anecdote from my first year at university. After about 2/3 of every semester the university evaluates lectures. Every student gets a questionnaire with questions like \"I learn a lot\" and you get to grade from 1 to 5 where 1 means not at all and 5 means a lot.\nOur linear algebra professor asked us to grade the question \"the professor refers to current research\" with a 5 because the he got in trouble with the responsible faculty for the evaluation and had to explain that there is no research to refer to.",
            "A lot of Track & Field experts suggest that we are nearing the limit to how fast a human can run the 100-meter dash.",
            "I have heard that there are no great secrets in leather working. ",
            "Cartography?",
            "I guess in specific mediums of art we have nothing left to learn, but that doesn't mean that everything's been done.",
            "Euclidean Plane Geometry",
            "Alchemy?",
            "Depends on how you define learn.\n\nAs far as electrical engineering goes, we haven't gotten any new equations since maxwell, really.  We're constantly improving the way we numerically solve those equations or searching for new ways to twist them into something useful or finding new materials that work well for our purpose or building things at higher and higher frequencies or new applications, all of which are there to learn and understand and are really cool, but it doesn't look like there's anything that would fundamentally change the way we understand how charge flows.  ",
            "[deleted]",
            "Super Mario Bros speedruns",
            "the area inside your mom's vagina.",
            "If the movie Hidden Figures has taught us anything, we should never adopt the attitude that any field of study has been exhausted.  What's your objective in even entertaining this thought?  Not that you shouldn't ask questions but this seems antithetical to expanding knowledge and understanding of our existence. ",
            "Yea it’s called solved sciences. Control theory, arithmetic, calculus, and linear algebra are generally considered solved fields of math. There just aren’t any open questions. ",
            "Psychology. Because anyone who does even 6 months of study knows *everything*",
            "plenty of other responses are saying similar but the answer is extremely simple: things involving set numbers and math.\n\nedit: how do you people sincerely not fucking understand what is being said? set numbers are set numbers, and any equation that alters them will always have the same result, otherwise is not the same equation.",
            "Noughts and crosses",
            "Alchemy: it doesn't work\n\n",
            "Cartography?",
            "There are some questions in mathematics about how many of certain types of mathematical objects exist that have been completely solved. A notable one is the [enumeration of the finite sporadic simple groups.](https://en.wikipedia.org/wiki/Sporadic_group)\n\nOf course, that doesn't mean that all the possible *applications* of such solutions are already known.",
            "I heard in r/math that Euclidean Geometry has basically been closed down, since there isn't anything more to learn",
            "The alphabet. ",
            "No. Let's take something that most people would think is completely covered. Simple, basic arithmetic. But even that includes things like prime numbers and pattern-recognition. Oops, that stuff is still being explored!\n\nOne of the awesome things about humanity is our capacity to find new questions.",
            "All sciences can be boiled down to math, and we have not yet \"solved\" math. It really depends how narrowly you define area of knowledge but the broader you go the answer is unequivocally no.",
            "Cowboy bebop , goddamit makes me cry ",
            "Checkers. Checkers is considered \"solved.\"",
            "The roundness of the earth and that vaccines are effective and absolutely do not cause autism!!",
            "Physics, except for those pesky ovens. But don’t worry, we’ll figure that out soon, and it totally won’t open up all of 20th and 21st century physics...\n\n-many people in the late 1800s\n\n\nExcept for very, very narrow fields of study, there is always more to learn; and even then, the likelihood that a mistake was made or a better model can be made is very high.",
            "The problem is that Tic-Tac-Toe is really just one aspect of Game Theory, generally. As far as a discipline as a whole, how about cartography? We don't really need to make maps anymore. ",
            "Don't know if it's true, but a Math teacher once said that there's nothing else to be discovered in pure Calculous. "
        ]
    },
    {
        "post_id": "w9fhik",
        "author": "inthenameoflord",
        "title": "How are guys at nude beaches not erect ?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/w9fhik/how_are_guys_at_nude_beaches_not_erect/",
        "score": 13489,
        "num_comments": 2560,
        "created_utc": 1658930282.0,
        "selftext": "Well i have seen photos and videos of nude beaches and guys are mostly what i have seen are flaccid and not erect in front of all the naked ladies . How is it possible ?",
        "permalink": "/r/NoStupidQuestions/comments/w9fhik/how_are_guys_at_nude_beaches_not_erect/",
        "comments": [
            "Even if you’re around attractive people at a nude beach, one can only maintain an erection for so long, and once your brain registers that hanging out with naked people and being naked for sexual activity are two different things, the erection goes away.",
            "Imagine going to Walmart. Imagine seeing those people naked. No boner",
            "Nudity does not always equal arousal. :)",
            "They're not particularly horny at that point ~~and those who are leave. It's bad form to be erect at a nudist area.~~\n\nEdit: several people have corrected me that erections happen and are usually ignored by everyone.",
            "Theres not much to be erect by. No friction from the pants, and sure maybe theres a beautiful nude woman over there, but theres also 10 old naked dudes around, and im not trying to check anybody out. Im just enjoying the beach and sunning my ass",
            "Can’t speak for everyone, but I’m in no way horny when at nude beaches. I don’t sexualize the people there.",
            "Because nude beaches aren't meant for arousal or sexual activities. Its meant to be for both male/female to interact freely, free of sex. I'm not saying ''beach porn/sex'' isn't common, but real nude beaches forbids that kind of acts.",
            "Also; is a woman in a bikini that much less titillating than a nude one?",
            "As someone who's been to many a nude beach, it's only titillating *at first*. It's exciting and unfamiliar and it's very likely that you'll start to get hard as you're undressing and taking everything in...but that fades quickly. And sure, every now and then someone hot might walk past you, but unless you're at a point in your life where any exposure to someone attractive gets you instantly hard, your body adjusts to the social dynamics fairly easily.\n\nThat being said, as a gay man, you can always just head to the bushes with whoever you're checking out so you can both get rid of the erections together.",
            "People at nude beaches aren’t 15 year old boys.\n\n\nEdit: this is not how I intended my comment to sound.\n\nEdit2: Thanks for the awards! I am glad I brought everyone some amusement.",
            "If you maintain a rock hard erection for hours just because there are naked people around, you are either 13 years old or in the wrong line of work.",
            "Sexual arousal is related to sexual perception to the environment. It's a nude beach, not an orgy, no no sexual arousal.",
            "Most men can witness a naked woman without getting an erection.",
            "This sounds like a question asked by a teenager lol your little buddy gets a lot less rowdy with time and experience.",
            "I'd imagine it just becomes an ordinary thing as some point. For example, hanging out with your S.O. while naked isn't always sexual, sometimes you just want to cuddle and relax. Not to mention if a guy did get hard at a nude beach I imagine he might get reported and asked to take care of it privately or just leave.",
            "Grown men don’t get erections from just seeing a naked woman. Typically takes a little loving to get a rise.",
            "If you are at a nude beach and get a boner you will not walk around with it. If it happens you cover it up maybe with a towel and wait till it’s over.",
            "Definitely not a 15yr old posting this one lol",
            "Desexualize it. I go to enjoy being naked myself, not to be perverted and voyeuristic.\n\nIf you do get a boner, you lay down on your belly and sunbathe your backside.",
            "Just seeing a naked woman isn't going to make a person get a boner",
            "Lived in Germany for a while.  Public nudity isn't considered sexual.",
            "Seems like the consensus is \n\nGood form: go to nude beach, feel possible erection, be decent and cover up/bounce\n\nPoor form: go to nude beach, oogle women, get hard and just let it fly",
            "It's for the same reason you don't see it in naked African and South American tribes.  When naked is the norm it means nothing.  \n\n\nQuick note to all the body shamers in this thread, fuck you.",
            "The times I have been to muse beaches, the men I saw were in an age group that they would need pharmaceutical intervention to achieve an erection",
            "It’s not about sexuality",
            "Because it’s easy to see people naked without being hard",
            "I’ve been in two gangbangs flaccid as whiskey dick on a church service Easter Sunday. We move in mysterious ways",
            "Nudists don't view nudity as inherently sexual",
            "Because contrary to what people think, men aren’t deranged animals that go insane at the sight of a naked woman.",
            "It's almost like the people that normalize going to nude beaches 1) mind their business and 2) view bodies/nudity/people as human and not sexual objects 24/7.",
            "Guy here. . You don't go to a nude beach to check out babes.  You usually do it to be naked and swim around. Nothing particularly sexual about it. Kind of just national geographic style nudity",
            "Because we men are not dogs, but humans who have acquired a certain control over our instincts. For the same reason we do not rape any attractive woman who is fertile.",
            "You can't keep an erection for a super long time generally. Even after a few hours they recommend you go see a doctor.\n\nI think it's just biologically impossible in most cases to keep an erection that long, unless something is medically wrong with you.",
            "Bodies aren't inherently sexual, it's more circumstantial. Only in the US have I seen people ask questions like this. If a woman was breastfeeding in a park and you accidentally caught a glimpse, would that turn you on?",
            "This post was written by a 12 yr old",
            "Nudity does not equal sex.",
            "Being nude is not inherently sexual.",
            "Nudity isn't sexual.",
            "For some people nudity equals sex. For others, it does not. \n\nWhen I went through medical training, it got to the point that doing a delivery or say, a colposcopy, I didn’t even register the nudity. It’s like seeing an elbow. There’s no “arousal” response. No titillation. It’s just a vulva, half the people you meet have one. \n\nI still like seeing my wife naked because a) she’s hot and b) we have a sexual relationship.  \n\nContext matters.",
            "*ITS SHRINKAGE JERRY!!!!!*",
            "How old are you?",
            "Even porn stars need viagra. On the beach there are way more people. And most of them don’t look like porn stars.",
            "Nude ≠ horniness",
            "There’s a big difference between walking around boobies and sexy fun time boobies. When you can understand the difference grasshopper, then you may go.",
            "Go with your friends, all nude. You'll have hard time getting hard (lol) even if a lady walks up to you and strikes a conversation. \n\nThat being said, I just went once. Partly because I saw many a sausages and mine was smaller than most. Just doesn't do well for your confidence lmao. And partly because most people were older folks and even though there were younger people, it's just not a place where people hit on each other. You'd have more action in a bar or a club.",
            "I worked at a nudist resort for 11 years. Not saying it never happened, but practically nobody ever had an erection just from being around other naked folks. For a lot of people nudity is a form of self expression and not sexualized.",
            "I was told by a woman I dated that if men got erect, it was expected that they would walk into the water to cover themselves until their erection subsided.",
            "The media has us conditioned to associate nudity with sex, but the reality is that the vulnerability actually makes interactions more respectful and genuine. I love nude beaches for the inclusiveness of all body types and orientations.",
            "I was on a nude beach yesterday with my family. It's not sexy. Yeah, there are tits and a bit of bush, but I guess I've seen a few and they don't really trigger boner switchblade snap. On top of which, the reality of nude beaches isn't that everyone's a supermodel, some are bigger, smaller, saggy or older. They get sand in their cracks like everyone. It's not a porno, it's a long-distance sandy softcore soap at best.",
            "This is the type of question asked when you’re too young to understand the reality that is a nude beach.",
            "Because when you're used to being around nude people (like you would if you were the type of person going to a nude beach), you stop seeing nudity as inherently sexual.",
            "Self control.",
            "It is really tiring walking on all fours for very long and my knuckles get skinned up, nude or otherwise. I myself prefer waking erect most of the time.",
            "Um because they aren't there to stare at the ladies. That is possible you know.",
            "I challenge you to go to a nude beach and maintain that hard on for the entire duration of your beach day.\n\nIn all seriousness, the mind and body are pretty good at getting acclimated to situations and settings.\n\nAfter a while your dick figures out that a nude body in an extended nonsexual context, just isn’t that interesting.",
            "The more you're exposed to nudity, the less you sexualize the bodies in that specific context. Boner can happen sometimes, yeah, but not that often. On top of that, you're exposed too, it's a social dynamic.\n\nAnyway, it's all about the context. At first yes, it's unfamilliar, exciting and weird but at some point your brain is just \"yeah, boobs again...what's new?\".\n\nSame goes with people living in a warm areas near some beaches. They're pretty used to see people wearing the bare minimum and won't really react to it anymore  but put some women with a tiny bathing suit in the streets of New York, pretty sure people will have an extremly different reaction to it.",
            "I don’t understand why some people think nudity equates to sexuality or feeling aroused. I’m gay and have been in plenty of mens locker rooms. Not once have I gotten a boner. I’m there to wash the stank off, not get off. It’s a mindset thing. With that said, boners happen. If it happens, the accepted thing to do at nudist beaches is to cover it up until it goes away and not make a big deal out of it. DO NOT walk around proudly letting it flop all over the place. You will be considered a perv by almost everyone there.",
            "Because they are not 14? The fuck is wrong with you if you cant see skin without getting hard",
            "For me to have an erection, a woman needs to be doing something seductive like touching herself or something, specially if her eyes are locked into mine while doing so - there has to be something that triggers it. If they’re just being humans and doing what they would normally do while clothed at a beach, then I would assume nothing would happen. \n\nI would say the only way men would get uncontrollable erections just by looking at nude women is if they’ve been super sheltered and have extremely limited exposure to women in general.",
            "Nude beaches usually very quickly teach you that nudity is not inherently sexual. :)",
            "I went to a nude beach in San Diego and I'm surprised at how many people think it's a sexual experience. There aren't very many visitors, mind you, most people are afraid to be nude public. It's pretty quiet so I just enjoyed the soothing water on my full, natural body, that's what nude beaches are for",
            "Because nudity isn’t inherently sexual. It’s just … nudity. The most natural thing there is. \n\nAnd for all the Americans saying that “it’s just old people,” I’ve been to several beaches in Europe and young people also go nude. It’s not a problem there either since, again, nudity is not (or at least shouldn’t be) sexual. The “it’s just old people” crowd are implying that if the beach was full of Instagram models nude, they would be pitching tents left and right. Even in Europe, where there were many Instagram-like models, there weren’t people having hard-ons everywhere",
            "When you get older you can control your erections just a little better.",
            "I had been to a nudist swimming pool area two or three times a decade ago. We went there with my girlfriend at the time.\n\nThe weird thing is I had similar thoughts before going there. I was afraid that I will get aroused when I will see girlfriend or other women naked. But, when I was there it was like a total transformation. Like a switch in my mind.\n\nI had no issues whatsoever, and I even talked to some other ladies there. It felt completely normal to be naked, no one was staring and everyone was kind of discrete. After a few minutes you tend to forget that you and other people are naked and you see simply other people enjoying the sun or the water like you do.\n\nI guess nudity is a social construct. What we perceive today as nudity is different from what people in the 1920 perceived as \"nude\" or \"sexy\", and definitely different from what people from other cultures believe. As soon as you enter a group of people who don't care about your private parts, you stop caring as well. This becomes the new \"normal\". 🤔",
            "Cuz not all nudity is sexual",
            "I spent a lot of time at various naturist establishment while growing up. I don’t find nudity by its self arousing - it has to be in context.  I think this is typical for naturists.  It might take a while to acclimatise to this when you start trying naturism, but it will come fairly quickly.  It’s kind of difficult to explain, but you don’t really notice people are not wearing clothes - it’s  just the normal state.",
            "Because people who go to them, and live in/go to nudist colonies have a different mindset about it. They aren't going there to get laid. In fact if you show up as that type of person, treating it like a meat market, you'll be shunned or just outright kicked out eventually.  \nThe majority of people there just literally want the freedom of not wearing clothes. It's not a sexual event. Plus when you do something like that regularly you stop really noticing that nobody is wearing clothing. It's just a day at the beach.",
            "Most people who use nudist beaches are naturalists, so they don't get aroused by seeing naked body.",
            "People at nudist beaches/resorts etc are not necessarily there for sexual reasons. Being a nudist is a lifestyle that people choose to be connected to nature and not live life restricted etc. it’s not always about sexuality. :)",
            "I did swim team in high school and my friends were like why don’t you get boners with all the girls in swimsuits around? And I was like uhh…it’s just sports? \n\nContext matters unless you are just a walking boner or something.",
            "Because nudity is not inherently sexual",
            "Context.",
            " I think most of the nudist do it because they legitimately feel more comfortable without clothes. I think for most its not about sex",
            "I like the female body, but I get erect in a sexual context, in a nudist beach another body is beautiful, but not sexual.",
            "Have you seen some of the specimens at a nudist beach? They would make my erection go waaaaay down too!!",
            "You'd probably be flaccid too if you have ever been to a nude beach.",
            "Nudity isn’t inherently sexual.",
            "It's less sexual than you think it will be.",
            "Nudity does not equal sex.  Ive been to many nude beaches, full of people my age (youngish) and it’s just not arousing.  It’s freeing.",
            "Nudity isn't inherently sexual, that's why.",
            "Cuz it’s not a sexual situation………",
            "context.  we don't consider nudity, in and of itself, sexual.",
            "A quote from my 85 year old grandma, \"When you're young,you try not to let people see you naked, but when you're old, people try not to see you naked\"",
            "Nude beaches are not about being horny and fucking. They're about being free to be in your natural state",
            "Because not all nudity is sexual.",
            "Because you should be there for the feeling of personal freedom not to get hard to naked people.",
            "I'm a promiscuous gay guy who's getting into his 30's, so by all accounts not old and very much still have a high libido. In theory, you'd think it'd be really easy for me to get erect at bad times.\n\nBut believe it or not, the more you're used to being nude, and the less \"teenager/young 20's\" you are, the less that things like being naked or sex in general become a big deal. When it's not a big deal to see nudity because you've seen (and experienced) plenty of it, you just don't get hard at nude beaches. Why would you? You're not there to have sex, you know what a vagina/dick looks like... so you don't get hard. Sex is a lot more than just seeing boobs or dick. When you're young though you don't really have that perspective, and if you've spent your whole life being covered up even a glancing peek of someone nude can get you going. Its tantalizing, it's forbidden... it's exciting.\n\nI've seen too much dick in my time for it to ever get me horny by itself. Both in being casually nude around friends or strangers, and because I've had lots of sex. A dick isn't very exciting alone, but it can be if theres the right intention and a sexual atmosphere. A nude beach (or japanese spa, or wherever) is not that at all.",
            "because not everyone is a coomer and most nude spaces arent sexualized",
            "Hard to say",
            "If you normalize nudity, it can be desexualized to a point where you don't immediately get turned on by seeing it.\n\nCo-ed bathhouses are nice.",
            "It's not hard.",
            "it's a matter of not looking at nudity from a sexual lens, and more as your body's natural state",
            "Spent the winter at a nudist RV resort in Southern Cali. Lot's of old people yes, but for some reason, it is the new hip thing to do for younger people. On weekends the place would fill up with 20 and 30 yr olds all strutting around and playing volleyball, or swimming, etc. Once you seen a boob or 6, it is pretty easy to just not get turned on by it. Honestly I think a gal in a low cut swimsuit is way sexier.",
            "Once you've see 100 boobs in a day, they kinda lose the mystique that our society has forced upon them. \n\nThey're just normal parts of the body.",
            "I dont agree with a lot of the answers. Reasons like 'they cant' or theyre shy. \n\nIts because nudists dont see nudity as sexual. Thats why nudists get away with being around naked children and having magazines of them nude and their children nude. Its not a sexual act. \n\nIts a mindset of this is nature and there is nothing wrong with it.",
            "Boners do happen in nudist communities and they are politely ignored. It's kind of shitty that people keep saying \"they're not people you want to see nude!\"\n\nNudists come in all shapes and sizes. Also you become just... inured to it. After so many dicks tits and ass it becomes as normal as clothes.",
            "When everyone is naked, nobody is",
            "Sexy is only sexy when it’s sexy.",
            "I have been to only 2 nude beaches. From my limited experience the ratio of young, attractive to old, saggy. Was skewed when compared to my prior expectations. I had no trouble maintaining my composure.",
            "The top-voted answers kind of have the wrong end of the stick. It's not really about the attractiveness of the people there.\n\nThe main thing you need to understand is that not all nudity is inherently sexual. This is a difficult concept for many people (particularly Americans, it seems). When you go to a nude beach, yes it's a strange situation at first and many first-timers do get erections, but the novelty wears off quite quickly and it's no different to being around people in bathing suits.\n\nHonestly, just try it if you can. You can start off by just going nude at home for a full day (if that's feasible), then maybe find a beach you can go to.",
            "It takes about two seconds of everyone being naked for the novelty to wear off.",
            "Have you ever seen a nude beach?  They are typically populated by the exact people that you don't want to be seeing naked.",
            "If you're not erect in a normal beach, you probably won't be in a nude beach either.",
            "My experience is obviously quite limited to my area but I definitely feel like most of the naturalists I've met are not very boner inducing",
            "Seriously - how hard could it be?",
            "Where I live Amish buggies are a common sight on the road, especially on Sunday morning.  To me they're nothing special, just a common occurrence. I notice them enough to not hit them but other than that I don't spend much time thinking about them.   But to you maybe, being from an area that might not have any Amish l, these are something new and exciting and interesting.\n\nThe same is true with nudity, if you see it all the time, it's no big deal.",
            "Because we aren't 13. Enjoy it while it lasts, kiddo",
            "Lol. You never been to a nude beach.  99.6% are not erection worthy.",
            "I hear that the people you see there don't usually elicit that type of response.",
            "maturity",
            "How can girls at nude beaches not just be constantly wet? I don’t get it.",
            "There’s a huge difference between nudity and sex.  \n\nDisconnect the first from the second in your mind and you’re 90% of the way there.  The rest is just focus.",
            "Just out of interest, how old are you OP, and are you male or female?",
            "You obviously haven't seen the types of people that go to nude beaches. Let's just say, nobody wants to see them naked.",
            "It takes a bit more that just seeing someone naked to get hard. \n\nYou gotta flick it, smack it around and twist it while blowing on it with a kazoo. Dont tell anyone i told you the secret combo.",
            "At some point you are older than 14.",
            "Difference between maturity of the body and that of mind",
            "Naked bodies aren’t inherently sexual. Sexual situations are sexual because the people taking part are into it. Looking at nude people minding their own business and getting turned on is kinda messed up. \n\nIt’s interesting to think about what is sexual and how having nudity and sex be somehow tied together is a little weird and does certainly make controlling peoples bodies a thing. At the same time its such a ”normal” thing that people tend not to think about it. Don’t mean to sound like an ass but I’d hate to be a woman in a culture where every little thing I do with my body, or the amount of clothes I wear, would be interpreted by strangers as some kind of sexual communication or ”permission” to get freaky. \n\nSource: I’m Finnish and go to sauna naked with the other sex a lot. And it is definitely not a place where you’d accidentally get erect for seeing somebody nude and sweaty. Its quite far from it. \n\nTLDR; Nudity is cool an relaxed. Sex stuff is quite different and involves communication and consent.",
            "Real answer : because the brain aknowledge ms the social setting \n\nFunnier answer : because people at nude beaches aren’t attractive at all",
            "Because they arnt 11 years old and just hit puberty",
            "Before you go, you wrap it in a coat and smack it with a hammer.",
            "How do gay guys not get erect in the locker room? It's not a sexy context.",
            "Pretty difficult to get hard when you're already stressed about people seeing you naked. You're likely to get at least a little hard though, just try to change what you're thinking about and bury it in the sand.",
            "Because it's not sexual",
            "Most practically, sexual activity at a nude beach is extremely discouraged both legally and socially. So people may find themselves restraining from looking too much at others to avoid being that one dude with an erection lol\n\nBut also It’s just not the point of a nude beach and most people go there with that understanding. If you don’t have that sort of understanding then I feel like you may not find yourself comfortable going to the nude beach!\n\nI went to a nude beach a friend and my crush when I was 22. I was very romantically and sexually interested in them, but that is again, not the object of enjoyment. The enjoyment of a nude beach comes from being nude in public for probably one of the handful of times in your life and experiencing that freedom, and sharing that time with people who are also basking in that feeling.\n\nMy crush and I went there with that understanding so we both had no problem.\n\nIf you go there with the intent of looking at as many naked bodies as possible because of some urge, then yes, you may get hard lol"
        ]
    },
    {
        "post_id": "m4jfdc",
        "author": "Mapuches_on_Fire",
        "title": "Is there a list of all companies that run 20+ minute ads on YouTube so I can be sure I never buy from them?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/m4jfdc/is_there_a_list_of_all_companies_that_run_20/",
        "score": 13474,
        "num_comments": 637,
        "created_utc": 1615681406.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/m4jfdc/is_there_a_list_of_all_companies_that_run_20/",
        "comments": [
            "there is a program, i dont know the name., which autoclicks adds so you can go on and do what you want, it also states that if enough people use it the effect on advertisers statistics become meaningless, hence decreasing their validity and preference in readvertising",
            "[removed]",
            "I got the entire Lego movie as an ad when the second one came out lmao",
            "I'm not sure if there is, but even if there were, it wouldn't do much good. Nowadays, companies are more akin to Russian nesting dolls than anything. Everyone owns someone else and it all trickles up to the same 8 or 10 giants. And we're not talking Amazon and Apple, we're talking the giants that most people don't mention, like Sinclair, or P&G. \n\nIf you want to avoid a single company, you'll have to avoid dozens of products, because if you don't, there's a good chance you'll be paying the people that own the people you were originally trying to avoid paying. \n\nCompanies looked at the Sherman Anti-Trust Act and said \"Well, it says we can't own all of *one* thing, but it doesn't say we can't own *some* of everything, so we'll do that.\"",
            "Life Tip: when an ad pops up there’s a little “(i)” in the corner, when you click on that it brings up a tab where you can click “Not Interested”. Click it and close it. It skips the ad, if there’s two ads it skips both of them. Some ads this might not work but 90% of the time it saves you time, I do it faster than ads where you can skip in 5 seconds",
            "Turned the smart TV on to a show for my kid. A few minutes later, she wanders in, no longer interested in her current favourite program.\n\nI kid you not: a *four. hour. tourism commercial.*\n\nI'm on board with whatever is blocking that and the 45-minute yoga ad during kids shows.",
            "Youtube has ads?\n\nedit: /s, because uBlock Origin",
            "[deleted]",
            "I personally make a point to keep from finding out what product or company ads are for on youtube. It doesn't always work- but it's a game that i play with myself. I try to focus my hearing on something else- I make sure not to see any logos that are on the screen (fairly easy, being visually impaired) and skip ads as quickly as possible.   \nI'll even occasionally just close a tab if I find that the video has too many ads, and refuse to watch it. I'm pretty stubborn about it, and unless it's a video that I REALLY want to see, I'll find it elsewhere. If it's a content creator that I actually want to support I will suffer through the ads, but still try not to have the advertisements forced on me.",
            "Why the hell do you not have adblockers installed? They're free. I get no YouTube ads, or elsewhere. Start with [uBlock Origin.](https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm?hl=en)",
            "It's the badly made ads that start off 100x louder than the dam video your watching and either blow your ear drums out or make you jump out of your skin , I am looking at you Ebay ...\n\nI admit i do have a list of companies that have offended me with online advertising , usually totally inappropriately placed popups that take up half the dam screen.\nTheir intended advertising has the opposite effect they can now sod off.",
            "I have NEVER seen a 20 minute ad.",
            "No, because you dont need to be a company to ran an ad on a yt video, ive caught hour long, music videos, weird buried videos...and usually the ads that appear on in are from what you search on google.",
            "ITT: people discover adblockers",
            "Why do people watch Ads? On the desktop use an adblocker or something like YouTube Enhancer.\n\nOn an Android phone use a browser that supports using an adblocker or even better use Vanced. \n\nApparently, there are ways to block ads on iPhone but I can't speak to that.",
            "Don't know about this, but I did manage to get rid of all the ads on my Facebook page by reporting every single one. I suppose an ad blocker would have been a lot less effort... But I'm still smug about it",
            "Are there really 20+ minute ads on youtube?  And can't you get out of an ad by refreshing the page?",
            "Is this a US thing? Longest I've seen in Aus is 3 minutes, but those are very rare and skipped after the five second wait",
            "adblock",
            "On that note...\n\n###I HOPE HUEL FAILS.",
            "With this browser called Brave, I get no youtube ads at all.",
            "If it's long just skip it, it doesn't matter how long an ad is after 30 seconds, it could be 1 minute, it could be 20, it's all the same after 30 seconds.\n\nPart of the reason for these long ads is that they are just made as a normal youtube video and then use the \"promote video\" function.",
            "Never see ads on YouTube. It's not hard to live in this same world.",
            "[deleted]",
            "I have never seen a video longer than 30 seconds that wasn't skippable after 5. I think the real issue is the unskippable 15/20 second ads. Doesn't sound as bad, but there is much more of them and it all adds up.",
            "U block origin works on YouTube. \n\nIf you're on mobile, then use youtube vanced. Can't download it through the app store, but I promise it's safe. Do some googling on your own to confirm, since I'm an internet stranger, but it's a game changer.",
            "If i have to watch an ad before I read an article on your site or watch an ad before a YouTube video that's longer than the video itself,  I'm just not gonna do it , do intrusive ads work for anything?",
            "You can always use adblock or something like that on browsers, on android Youtube vanced is a thing and it works amazing(I love listening music to youtube more than spotify honestly)",
            "I dunno, let’s pour a glass of Remy Martin and ask the most interesting man in the world to see if he can sweat through this Gold’s gym workout.",
            "I had no idea they had ads that long. I’ve had YouTube premium for a few years. I heard the ads had gotten worse but damn.",
            "I know Im the only person on earth who uses it but **YouTube Premium**.",
            "I can not emphasize enough:\n\nGet a Indian YouTube premium account. If you share it it'll be 60ct/month!\n\nIf that's too much install youtube vanced on Android.",
            "?\n\nWhy? You can skip them after 5 seconds",
            "I once watched the entire first episode ad from a TV show, I dont even know man",
            "Roman is one.",
            "I bet someone in advertising read this and it just gave them the idea to start creating ‘shell companies’ for ads",
            "Yh I make it my mission if a certain ad annoys me to either not buy from that company or leave bad reviews where ever I can. I know its petty but fuck them I want to watch 1 3min vid and have to deal with 20 ads. Also if you use android install vanced youtube",
            "I actually wish this goes viral like that other time and we severely damage the value of these companies' stocks",
            "they want to make it similar to television with the unskippable ad block which is usually longer than the film itself. What they don't recognize thought, there is a reason why we use the internet INSTEAD of a tv.",
            "I can’t even watch a YouTube video anymore because of all THESE FUCKING ADs if I go to another \nvideo then go back to one I watch I get the same 2 Fucking ads AND DURING THE VIDEO I HAVE TO LIKE KEEP GOING BACK TO O WHERE I WAS I MEAN YOUTUBE IS A SHITHOLE WITH FUCKING ADS FUCK FUCK FUCK FUCK FUCKING ADS CONTACH THAT BITCH TELL THEM TO STOP FUCKINGS UGHH FUCK ADS",
            "I've seen 2hr24min ads 😭",
            "Use YouTube Vanced for mobile",
            "I’d be happy if Grammarly ads would fuck the fuck off",
            "There's one where a guy dances and lip-sings in front of his Iron Man gear, and I can't figure out what the hell it is. It's not even an ad; who funds it?",
            "YouTube vanced is the way to go. No ads and ability to turn your screen off while listening.",
            "It's Android only, but YouTube Vanced blocks all ads. Just make sure to get it via xda forums.... lots of fakes out there.",
            "What the hell there are 20 min ads running on YouTube?",
            "I'll give you a better list: ALL companies. They would ALL like to be able to run long ads all the time. It's not a company's fault for wanting to promote, it's YouTube's fault for allowing that much promotion to interfere with your enjoyment of their service. Take it up with YouTube (er... Google.... err..... Alphabet)",
            "There are 20mins ads....",
            "how the fuck did you ever find 20 minute ads on youtube?",
            "cant you just use an adblocker? I havnt seen an ad online in years. I use Ublock origin in my web browser and PiHole for network wide blocking",
            "I actually don't mind those, YT let's you skip it after 5 - 30 seconds if you're interested, but sometimes if a product seems cool I watch for some additional time. Usually if they invest time to make an ad that long (considering they probably know the statistical odds of people watching the entire thing are low) then they probably believe in their product.",
            "My business has a 20 second ad on YouTube, but it’s my understanding that you only have to watch 2 seconds of it before being able to skip it.",
            "You can just skip them lol",
            "I swear it takes less time to install an ad-blocker than to make a post like this.\n\n- PC browser: uBlock Origin\n- Android: YouTube Vanced (for youtube), Blokada (for other apps)\n- other platforms: AdGuard DNS (with varying degrees of success)\n\nAlso there's SponsorBlock (a browser extension, also included in YouTube Vanced) that skips the \"RaIdsHadOWleGeNDs\" parts in videos automatically.",
            "But you can skip after 5 seconds right? So what's the problem",
            "Just download youtube vanced. Totally add free youtube.",
            "I dont understand why youd care how long it is when you can just skip it anyway ?",
            "There’s always a skip option...",
            "Just support YouTube and buy YouTube premium so they don’t have to rely on 20+ minute ads",
            "YouTube has ads?",
            "On a related note.\n\nHas anyone else noticed that the unskippable ads are gradually getting longer and longer?",
            "It's the year of our lord 2021. With all the adblocking technology out there, if you're still seeing ads it's your own damn fault.",
            "youtube premium = zero ads.   I forget what it's like to see a ad on a video.",
            "ah yes, I'd like to punish companies for advertising their product. Shame on them for attempting to make money by selling a good or service that is valuable!",
            "You would go out of your way to not buy from a company that advertises? We all hate ads but skipping and blocking is not that big of a deal. Those ads also make YouTube free so.",
            "As long as the skip function is the same what’s the difference between a 20 minute ad and a 30 second ad?",
            "Holy shiet dude, just move on and find something else better to do in your life.",
            "You do realize that the ads are how Youtube provides their service for free. They have to pay all their expenses and personnel so they have to make money somehow. I'm not saying it's right to have long ads. I'm just saying that you can't expect all the people working for Youtube to do it for nothing just so you don't have to watch ads.",
            "There's ads on youtube? Lol, premium for life",
            "Don’t watch YouTube.  It is the landfill of media.",
            "But why should you even care? There's no ad that you have to watch longer than 15 or 30 seconds, and that's why they have these long ads for people who are interested in watching the whole thing. I actually did a few times continue watching what I thought was interesting.",
            "Youtube is the only responsible party here. Stop watching or block ads.",
            "Or pay for YouTube premium and never get ads? Lmao",
            "Nothing is free… would you rather give up your money or your time? A few seconds of ad watching is annoying to me, but not as annoying as someone watching my content and not paying for it.",
            "I pay YouTube 12 bucks a month, they don’t bother me with ads. Simples.",
            "Reddit has an obsession with hating ads and this question is just fishing for that circle jerk lol\n\nSmh",
            "Just use adblock you morons.",
            "In my entire time on YouTube I have never gotten an ad longer than 30 seconds that cannot be skipped. Why don’t you just skip the ad? Or better yet just get an ad blocker? \n\nIs running a long ad really that offensive to you that you would even occupy your time thinking about which companies not to buy from in protest? \n\n*Yeah Nikes are made by underpaid Vietnamese children, but I would never buy a Purple brand mattress because they run long ads on YouTube*\n\nJust ignore it for fucks sake",
            "Why does anyone care? I skip them after five seconds just like any other add. No time lost.",
            "Great idea. Let's ruin the free access with ads model so we can pay for access instead. So much better and it keeps those creepy poor people off the net as well. Win win for me!!",
            "Do not buy that disgusting dr squatch soap. wtf kinda ads are thoses?",
            "Well I have no idea on the actual question, but a combination of streaming videos with vlc on mobile and ublock origin is my preferred method to never see anything",
            "There is, but it's on Google servers you don't have access to.",
            "I saw a full show being run as an ad. It was 1hr+",
            "I saw one that was an hour-long documentary. Who on earth is going to watch that?",
            "It's a thing. It's called a video sales letter. Doesn't work on everyone but the people who get pulled in will usually spend quite a lot.",
            "V-Shred is best",
            "The fact that YouTube doesn't support Pale Moon is weird.\n\nThese modern browsers are actively trying to fuck any form of competition from arising.",
            "AdBlocker is good extension. I forgot what these ads look like.",
            "Ad skipper app",
            "2 words.  Ad Blocker.",
            "Is there a way I can set my preferences so that I get shorter, unskipable ads?  I like to use Youtube to stream music",
            "\"What are ads? *Ublock origin.*\" is the new \"I don't even *own* a television and lemme tell you about my veganism.\"",
            "I remember one time i got a 10hour ad on YouTube dont remember what it was but it was weird",
            "People brag about adblock and vanced. I just spend the 10 bucks monthly. Vanced doesn't work on my mobile for some reason anytime I've installed it.",
            "Why not just use the brave browser?",
            "20 minute ads are better than 30 second ads because they can always be skipped after 5seconds. Some ads 30sec and under will play the entire thing.",
            "Use brave browser. It works removing ads. And you can choose if you want own ads they pay you. If not. Then just choose no ads. \nWorks on Android and windows. But not 100 percent on ios",
            "I wouldn’t know. I haven’t seen any ads in years thanks to ad blockers.\n\nuBlock Origin, PiHole, AdGuard (iPhone)",
            "You know you don't have to sit through the whole ad right?",
            "Haha i have that feeling too. Like if I have any inkling I might be interested, I just remind myself I’m seeing that ad on a video for hockey cards or whatever that I’m dumb for watching in the first place.",
            "Just scroll to the end of the YT video then hit replay. There are no ads on your \"second\" viewing.",
            "Youtube Vanced. You're welcome.",
            "Not sure but i just found a 20 minute ad for pokemon",
            "Why does it matter tho? It doesn’t matter if an ad is 1 minute or 2 hours, you can skip it within 5 seconds either way.",
            "Thing is some are like not quite businesses are private entities trying to sell you some weird shit- the best you could do for those people is like Dislike their instagram posts and.. not join their wonky Pyramid schemes",
            "On of the polish cities did that, kraków i think.",
            "Download uBlock Origin and stop getting cucked by YouTube ads.\n\n\"Ohhh but how will I support my creator?!\" sub to their fucking patreon.",
            "You can skip these though?"
        ]
    },
    {
        "post_id": "dsuczo",
        "author": "noijonas",
        "title": "I'm getting strange texts from my boyfriend, but he didn't send them. I don't know how this is possible?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/dsuczo/im_getting_strange_texts_from_my_boyfriend_but_he/",
        "score": 13481,
        "num_comments": 1480,
        "created_utc": 1573111752.0,
        "selftext": "So, I have an iPhone (7), use SMS-only (no iMessage), and my boyfriend has an iPhone (6) with SMS-only as well.\n\nI got 3 messages so far from his number, but it's mundane things like \"it's not that i don't want to go, i just have no energy\" and \"I have no energy to shower even though i have to go soon\".\n\nThese texts are not appearing on his phone, and he was right next to me all evening.\n\nThe only answers I'm getting are number-spoofers, but these texts aren't suspicious or asking anything of me. Nor are they showing any signs of a prank whatsoever. \n\nWhat could possibly be going on?\n\nEDIT: [Apparently, texts from Feb 14th are being resent everywhere.](https://92moose.fm/get-a-strange-text-message-early-this-morning-youre-not-alone/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) Thank you all for the answers!",
        "permalink": "/r/NoStupidQuestions/comments/dsuczo/im_getting_strange_texts_from_my_boyfriend_but_he/",
        "comments": [
            "...This is getting weird. Yours is the third post I've seen today describing this same issue.\n\nhttps://www.reddit.com/r/NoStupidQuestions/comments/dsuam1/why_did_my_phone_send_a_text_without_me_knowing/\n\nhttps://www.reddit.com/r/RBI/comments/dstwlp/someone_texted_my_wife_using_my_phone_number_the/\n\nCould some phone carrier be screwing up and sending texts to the wrong phones somehow?",
            "Reading from other comments it seems that the plot is thickened",
            "[deleted]",
            "i got a text from my boyfriend at 2am (he’s usually definitely asleep by this point) and it said “he isn’t actually human”  so that kinda scared the shit out of me",
            "[deleted]",
            "Aren't the phone companies currently implementing that new rcs sms standard? Maybe something is going haywire in the implementation.",
            "Maybe it’s reusing old message you or him have sent to people maybe.",
            "I received a text at 2 am today from my best friends boyfriend, I texted her and asked if she was texting off his phone. She replied confused and checked his phone. Her boyfriend was dead asleep, and the text sent didn’t show up on his phone. It was a simple “omg” followed by a few laughing emojis, so it may be a repeated message from past conversations like others have speculated but it was definitely weird.",
            "What cell provider are you with OP? If you don't mind me asking.",
            "Judging by other comments I've reached the only rational conclusion; The singularity is upon us!",
            "Seeing as how people are mentioning years-old messages being sent, it's probably just the NSA surveillance apparatus leaking.",
            "Paralel universes perhaps.",
            "I too had the same issue. I'm on Google Fi (which is either Sprint or T-Mobile) and one of the people it randomly texted was on Sprint. I received a message back from that number too. It seems like it was a very old text, like from 2 years ago. They also show up in my SMS history on my billing statement.\n\nEdit: miss read my provider history. Only the incoming ones show on the statement. Not the outgoing ones.",
            "Interesting.. my husband got a text from me at 1am and another at 3am this morning while we were both asleep. I searched my messages, and it was something I had sent him back in February!\n\nThis feels like a major privacy concern.",
            "You should share this with the people from Reply All podcast. They have this series ehere they investigate weird internet related stuff, exactly like this, called Super Tech Support. A really cool one was about the voice of a woman that was heard when the AC was turned on. \n \nThey specifically request to be contacted via email: \nreplyall@gimletmedia.com. \n\nAnd check [this thread](\nhttps://www.reddit.com/r/gimlet/comments/75s60v/what_are_the_best_super_tech_support_episodes_of/) out for discussion on other cases.",
            "Could it be that someone else got a double number- someone has the same number as your bf somehow and you're getting their texts? What happens if you answer them?",
            "[deleted]",
            "This thread is goddam wild!! Just curious— is everything happening with the US? I’m going to guess yes based on the carriers... T-mobile ATT and Verizon",
            "This honestly reads as a r/nosleep thread, but it seems real\n\n&#x200B;\n\nof course, those are too, of course",
            "Sounds like the beginning of Midsommar 😳",
            "I was talking to a girl online during that time. I sent her a message and she never responded. A few days later I sent her another asking why she never responded and she said that she never received anything and thought that I was ignoring her. We never spoke again.\n\n\nLast night she received that message and responded back with huh ? I was confused and though that maybe my phone was hacked or spoofed. We’ve been talking and now we are going on a date Sunday afternoon.",
            "Yo the new episode of Black Mirror sounds really good",
            "This happened to my parents at 2 in the morning when they were asleep. My dad asked if she was ready and my mom said yes. None of us have any idea what is going on",
            "Is no one considering some form of test cyberattack?",
            "WHAT THE FUCK. I woke up to a fucking text from an old friend saying \"I'm in you're room\" at 2 fucking am. Not cool...\n\nEdit: this was an old text from when we were playing hide and seek. I moved school to TAFE 7 months ago and haven't spoken to him since and all of a sudden I get this text.",
            "WHY IS NO-ONE IN THIS THREAD SAYING WHAT PROVIDER THEY'RE WITH",
            "Had this happen today toom my boss yelled at me for texting him at 4am but I didn't",
            "My boyfriend texted me \"Hi\" when he was dead asleep next to me lol, I'm glad to see I'm not the only one this spooked",
            "This is weird because a friend got a text last night from a friend of ours that died over the summer. All it said was “are u in your room?” He called the number back immediately and it was disconnected. It freaked him the fuck out. \n\nWe think it’s a text that the friend sent but didn’t actually go through until last night.",
            "I literally came here to ask this. Got an old text from my husband this morning at 5:15. Thing is I remember getting it when he sent it last year too..",
            "My wife got a text from \"me\" at 1 in the morning. It said let's leave the reservation it's only 3 minutes from our hotel. We don't have reservations or a hotel. It was a long night.",
            "This is a side effect of the incursion- for the next 13 months or so you may receive texts and other communications from future and/or alternate versions of yourself. These issues are rare and may or may not subside over time.",
            "I have never been so scared reading a Reddit post in my entire life. What the fuck is going on...",
            "This happened to me too. Didn’t even think to see if it happened to others. Weird",
            "Maybe the companies network has been compromised...",
            "Why do they all seem to be from everyone's significant other or parents?  I got one from my mom last night at 4 am and she got one from me.  They were both from Valentine's Day.",
            "Feb 14th texts? No wonder I’m not getting any. Hahah",
            "Literally just happened between me and my brother in law. Not the same message but same situation.",
            "This is reported to be affecting multiple different carriers as the cross carrier messaging system was updated last night. Most likely in preparation for RCS which is the next messaging protocol after SMS and MMS. \n\nIt does seem that most texts were originally sent on February 14th 2019 (Valentines day) and received this morning between 1AM and 6AM.",
            "Just also asking why NOT use iMessage? It’s encrypted end to end and is safer than SMS",
            "[deleted]",
            "[deleted]",
            "I just found out that my ex recieved \"you can sleepover tonight\" talk about a bit wooooops",
            "[deleted]",
            "Phone carrier still have your message from February 14 save in their files..",
            "Since this is reddit:\nHe is definitely cheating and you should break up with him right now. Also take his cat.",
            "We've been having an issue in my area with recipients not receiving texts. My husband's texts were not received at all by anyone the other day, pissing off his boss who thought he was not responding to him and making me an hour late picking him up because I never got his texts saying he was done (boss situation was cleared up by showing his phone). At my work, my boss wasn't receiving texts I sent her either. I wonder if they're just going to random people instead.\n\nEdited to add we use AT&T",
            "Thought this was r/nosleep",
            "I had the same thing happen between me and my fiance. He got a message sent to him from my number and I didn't send it. I have Tmobile and he has Verizon. Very freaked out seeing this happen to a lot of other people. 🙃",
            "This happened to my boyfriend and I last night. He has TMobile and I have Verizon, and we each got an unexplained text from each other, one around 2am and one around 5am.",
            "[deleted]",
            "just think of those who got a text from someone who died recently...",
            "I can confirm that for some of us, it was an old message arriving that never was received in the first place. I sent someone a message almost a year ago. They never replied. It hurt my feelings at the time because it wasn't the kind of thing to ignore but also wasn't a big enough deal to bring it up. Then they finally got that message at like 4am last night.",
            "My phone carrier messed up once and got 15y/o me's text confused with a middle aged cobbler. Eventually the issue just resolved itself but it was very inconvenient having to tell people sorry please text the same number again and hope it goes right this time!",
            "What is going on? I thought it was weird that my “coworker” texted me at 330 this morning.",
            "I'm experiencing this as well. Quite the shit stirrer this morning with my gf. \"Why are you headed to work at 3 am\"....Wut",
            "Last night my girlfriend was in our bedroom and I was playing Xbox and I got a text from her that said \" happy Valentine's day babe, have a great day gaming\"",
            "I work for a carrier. It might be very old messages that suddenly got thru.",
            "Last week, my family member was trying to see if she could call me on her new phone while we were in the same room, and my deceased grandma’s number showed up on the screen (nobody was on the other end). My family member’s call was directed to my cousin instead. I double checked the contact info, and my grandma’s number was correct. I have T-Mobile.",
            "The network is gaining consciousness.",
            "Skynet is waking up.",
            "I had this happen to me and my bf this morning. We each got a random message from each other, they sounded like things we would have texted at some point - might have been old texts. Sent at 2ish and 4ish am when we were both asleep next to each other. Spooky...",
            "r/glitch_in_the_matrix",
            "It's happening on valentine's day. No wonder I haven't seen anything....",
            "Got a text from my aunt saying 'I need to push it hard' last night.",
            "Hackers testing in advance of the election. Just a thought and I'm not a conspiracy theorist.",
            "OP, what is yours and your boyfriends cell service provider?",
            "Are you on Verizon?  I had this happen to me two weeks ago.  It resent a couple of random texts from years ago to a couple of contacts.  No idea how or why...",
            "This happened to me this morning! A text i sent literally almost a year ago that apparently never got delivered got randomly sent around 4:00 EST this morning",
            "I got a text at 2am central time that said \"Jasmine Portillo\" from someone out of the blue that I havent spoke to in months.",
            "Two of my cubicle neighbors have had this exact same thing happen to them, they received messages from people they know but those people never sent them. All just in the last 24 hours. Both on Verizon.",
            "i thought this was r/nosleep for a sec",
            "I was reading out of curiosity because it's a weird thing happening outside r/nosleep when suddenly I realised that something similar happened to me a few days ago in the middle of the day.\nMy aunt swears I called her. I didn't, and there is no log of me calling her on my phone. But there is on hers.\n\nEdit: I live in Europe. My aunt has xiaomi while I, have a huawei.",
            "My phone once revived a text from a 3 digits number (first weird thing) dated from 1970 (uuuh... yes ? Time traveler ?) So either his phone is fucked up or has been hacked or this is paranormal (if you're into that theory of course)...\n\nThis is obviously only my opinion I'm not an expert at all :)",
            "My boyfriend and I just woke up. I have a text from HIM at 1:44am  saying \"hahaha\", and he has one from ME at 2:15am that's just \"😂😂\". We went to bed at 12 and were both asleep. Glad its happening to other people because I was SPOOKED.",
            "I guess the more concerning part is that these companies are keeping logs of our texts where they can still access old messages like that...",
            "Got one from my ex this morning. Really awkward conversation",
            "My mom just messaged me out of the blue and said \"Oh it's okay!! Valentines day?\" so I scrolled up to Feb 14th in my message history and that day I sent her \"Happy Valentines day! Sorry I forgot to call over the weekend I've been really busy with things lately\" so I guess that's what got resent.\n\nLess weird now that everyone knows what it was but also pretty concerning that a glitch can just resend a million peoples texts from 9 months ago..",
            "The phones are conscious, this is the beginning of the AI takeover",
            "I got a text at 4am from a lyft driver I rode with on Feb. 14th stating my ride was leaving soon. Thought my account had been hacked until I saw no recent ride or payment info. Looking back at my text history with lyft (it's pretty short) I got texts from the driver at 2:40pm and 3:12pm on Feb. 14th. It's weird that this text (intended to be sent sometime around 2:45 probably) never sent until this morning. For sure thought my lyft account got hacked.",
            "I have heard of people getting messages that was intended for someone else, but this is another level.\n\nBut I do recall my old phone would sometimes bundle together several numbers that I didnt have saved. Double check the sender of the individual message (press and hold it -> details).",
            "Is it possible that the number switched in his contact on your phone? My dad ran into the same issue in a group text with my family, where his iphone had switched my mom's contact in his phone to his number, so whenever my mom sent a text, to my dad it looked like he sent it. \n\nIf it's still the right number, then maybe your cell provider had a lapse and messages got misplaced like other commenters have suggested.",
            "This just happened to my wife!!! Her mom got a text from her at 2am that she obviously did not send",
            "Bro I got a text from my mom saying our dog was ok????? Like what? She never sent anything like it before.",
            "Damn this happened to me this morning as well. Weirdly though, it was my friends old number that he no longer has. I got it around 1 am this morning.",
            "this happened to my also. I woke up to a random text from my ex that I got at 4 a.m and my best friend texted me \"what?\". I hadn't texted my friend so she told me she got a random text from me at like 6 a.m, but it didn't show up in my messages....also saw someone tweet about something similar. my ex definitely didn't text me on purpose because it said something like \"my day went good 😊😊😊\" and it was 4 a.m",
            "Same. Got two this morning from my wife. She's on Verizon with a Apple. Im on Google Fi with a pixel. Two txt from here but they were ones from months back.",
            "Are the messages written in the style that he would usually write to you? If so, it's likely a text he sent in the past that failed to send and something has triggered it being sent now.  \n\n\nIf it's not likely originally from him, then I got nothing.",
            "I'm on T-Mobile and got a message from my Girlfriend, who was sleeping next to me saying her car was fixed. Nothing has been wrong with her car...",
            "I just woke up to the same thing this morning.  I have two random ass messages from two of my friends that make no sense.",
            "Idk if someone has already said this, but it looks like someone has the same number as him. The same thing happened with my dad and his new phone.",
            "I (android) have received two texts from my husband (iphone) this morning that he did not send.  One was worded in such a way that it is something I am sure he sent to me in the past, but he did not resend it now.  The other was just \"yes\"",
            "This just happened to my coworker with her son's number. Apparently, shit is fucked up on a massive level. I've just been using alternatives to text if someone isnt getting my messages the ksdt few days.",
            "Tin foil hat time :\n\nThey're sending out random texts to multiple phone numbers to teach AI how to respond to almost anything",
            "The other side has finally hacked into our phones to  communicate with us. r/creepy",
            "This just happened to me with my ex girlfriend?",
            "I got a phone call from 'myself' twice yesterday",
            "I know you said that you don't have iMessage running, but I wonder if by chance is this iMessage on the other users end?  I don't know, I'm just spitballing here.\n\n&#x200B;\n\nIf so, this has been happening with my wife and I via Apple iMessage.  T-Mobile representatives said that this is a known problem with iMessage (when we disable iMessage and use only SMS, we can't seem to replicate the problem), and we had a conference (us at T-Mobile shop) with Apple, and Apple is denying it (so far).\n\n&#x200B;\n\nThe biggest problem is that a **very young** girl is receiving my wife's and my conversations, and we only figured it out after she responded and along the way I managed to get our phone number, call her, and straight-up ask her about the iMessages that she's erroneously receiving.",
            "I got into a huge argument with my partner this morning over the same issue. I recieved a text from him a 5:15 saying \"Heyyyyyy U\" His phone didn't have any sent messages. I thought he was texting someone else and accidentally text me.",
            "Well, this is just weird. Today at 5 a.m. I got a phone call that just rang once without a number showing (unknown caller). The only person I know who is hiding it's caller ID is my grandmother. I asked her if she called me today at 5 a.m. and she didn't. But, she also received a phone call by an unknown caller at 5 a.m. who just rang once. Also my brother and father received the same weird calls at the exact same time.",
            "My wife and her coworker had something similar happen today. At 5 am her coworker got a message from her talking about specials and my wife got a message about getting it. Neither of the messages sgow on the \"senders\" phone. Her coworker has an iphone but my wife has an LG stylo 5.",
            "I thought this was a r/nosleep post or something lol. Sure as heck sounded like one.",
            "I got weird texts from my ex-GF last night asking if I wanted her to wake up her husband so we could talk. I was so confused! Now it makes a lot more sense.",
            "Ok found out what is happening.\n\nThis morning my friend who has iPhone like me sent me a strange text and I responded with ? \n\nHe sent me a screenshot and sometime around 3am my phone sent him a text that I did not send \n\nI search my messages for the message he received and it was something I sent him back in February 2019.\n\nFor some reason iphones are sending old messages we sent awhile ago now.",
            "I was texting my gf last night and her messages would not send until much later. I started getting texts from her that she had sent 2-3 hours prior, so it's definetly not an isolated incident",
            "My boyfriend got two texts from me at 2am last night that said:\n\n\"Where are you?\" \"??\"\n\nWe were both sleeping and I don't have those texts on my phone. \n\nSorry - no idea what's going on either, but at least you know you're not alone lol",
            "Someone random sent me a text saying that I called them, but I never did. He showed proof and everything, it was my exact number. So weird.",
            "I compiled ten or so similar reports [here](https://www.reddit.com/r/RBI/comments/dszzuo/mysteriously_early_this_morning_scores_of_people/?ref=share&ref_source=link)",
            "Why sms only on the iPhone?",
            "Shit my neighbors phone just did this. I got a message about her kid this morning.",
            "Dang, what a plot twist. Boyfriend didn't want to go out on Valentine's day, oof.",
            "there is an issue with cellphone carriers i called tmobile",
            "Cue the NoSleep writers to come up with a story based on this scenario.",
            "Although this problem happening to a lot of people is inconvenient, I would also say it is very comedic.",
            "I woke up to a text from my boyfriend and he didn't send it either. I sent a screen shot and he sent one back with the text not there. \n\nHe later saw a Facebook post stating the same thing.......? \n\nHe has an old Samsung and I have a new Samsung",
            "This happened to me last night! \n\nMint Mobile/OnePlus 6T to another carrier (not sure which)/ iPhone 7?\n\nHe sent me a screenshot saying I said \"amggh\" at 1:36am but I have him clocked saying \"*looks down\" at 1:09am. Neither were awake, and neither have records of sending those messages. The weird thing is that those are both things we'd say so I wonder if it's a spoof or just an old message that never sent",
            "Omg this is why my boss texted me to meet her in the parking garage at 1:00 this morning!! I thought it was an assassination attempt!!",
            "Idk but my daughter has an iPhone and got a text from me at 3am this morning that just said \"K\". I absolutely NEVER just text one letter and even checked all the way back to October 1st...not one single \"K\" in my phone.",
            "This happened to me this morning, my girlfriend and I each had texts from each other that we thought we didnt send, i searched my text archive and they were old texts that never got delivered from months ago just now getting delivered.",
            "Sounds like your iphone is telling you your boyfriend needs more energy.",
            "... when I saw your post i felt I had to take a moment to comment,\n\nA couple years back when both my girlfriend and I had iPhones, we were texting and I got a message from her asking what color my car was.\n\nObviously thought that was strange because she's been in my car a ton of times, so I just ignored it.\n\nOver the next 10 or so minutes we continued texting but then I asked her why she asked what color my car was.\n\nShe texted back but she didn't know what I was talking about.\n\nThen I got a text from her asking again, what color my car was.\n\nI took a screenshot and text it to her, and she called me, saying \"I didn't send those texts\" and texted me a screenshot of her side of the conversation which showed that she was telling the truth.\n\nHonestly, it seemed to me like someone had hacked into our conversation.\n\nI wondered if maybe it was someone who was near me, and was trying to figure out the location of the phone that they had hacked into by the color of the car parked out front of the house.\n\nThis is all just wild supposition on my part, but just thought I'd take a moment and relate the story to you, OP, I could be way off base here, but it does seem that it is possible to hack into text message conversations.",
            ">\nEDIT: [Apparently, texts from Feb 14th are being resent everywhere.](https://92moose.fm/get-a-strange-text-message-early-this-morning-youre-not-alone/?utm_source=share&utm_medium=ios_app&utm_name=iossmf) Thank you all for the answers!\n\nCurious that they stored those messages for so long...",
            "Yep, its been happening for the last few weeks with my girlfriend",
            "https://www.popularmechanics.com/technology/a29726341/texts-delayed-random/",
            "Woah thought this was r/nosleep for a moment there!\n\nThat's creepy as hell by the way.",
            "my boyfriend texted me \"hahahha.. woooooo! not preggo baby!!!\" at 3:30 am.. as you can imagine, I was driving myself crazy all fuckin day looking for a logical explanation before unleashing the latina fury.. holy fuck. the internet just saved his life.",
            "I received some texts today that were obviously not meant for me from people I don't know. So my guess is something screwy is going on with some carriers. I'm on T-Mobile BTW.",
            "So what are the odds at least one person is gonna get arrested for violating a no-contact order?",
            "You're obviously receiving texts from your boyfriend in a different dimension.\nAlternate you is probably pissed she hasn't gotten any replies to her messages.",
            "You know what sucks....It I received about 6 texts messages from my ex.... all talking about how he wanted to make spaghetti and he didn’t want me to be sad.  (Feb 14th he wanted to make dinner as our romantic day together)\n\nI haven’t seen him or spoken to him since he broke up with me in March. \n\nWhen I texted him about it he called me crazy and to fuck off.\n\nThis was a cruel joke world.  I have wished that he would text me for months...\n\nPlease 2019 be fucking over.",
            "Holy shit I seriously got my  provider involved in an investigation this morning because of a text my daughter's mother said she received from me and they didn't know about this. Wow this made my day.",
            "That was a ride",
            "Why would iPhone users, especially a couple, *not* use iMessage? It’s one of the main reasons to even use an Apple device.",
            "Maybe this,  which is old messages from Valentine's day. \nhttps://m.slashdot.org/story/363142",
            "I'm on an android with Koodo and my boyfriend got 3 old texts from me in the middle of the night while we were asleep early this morning.",
            "Yooooo  so no shit a buddy messaged me this morning and his BF and two other friends are getting txt messages from his phone but he's not sending them but it's a similar scenario they are getting messages like \" okay sounds cool\" or \" I just want you to know I find you beautiful\" one friend who got one this morning from him just recently got another and it \" I value love and friendship over most material things\" haha so at least it's nice things haha",
            "I have t-mobile (iphone 8) and my boyfriend has verizon (samsung galaxy forgot what model) and this happened to us last night! We were Skyping and he was playing video games so I knew he didn’t type it, and then he received a text from me that I was able to track back to February of this year. So crazy we’re not the only ones, also seems to be happening to people and their significant other.",
            "I knew my ex reaching out was to good to be true.",
            "Now's our chance to send weird texts to people and then show them this thread like we didn't do it",
            "Russia's gonna Russian.",
            "This happened to me this morning.  I received a text from my girlfriend at 4:30 am, and she received three or so from me.  Looking at what I said and what she said we concluded that it was some old messages based on the context in them.  Something from prior to us moving in together.\n\nMay have been old texts that had trouble sending in the past that an update triggered.  Speculation though, the messages were from roughly a year ago (I think).\n\n\nEdit: Guess it was only a handful of months?  I didn't properly look into it.",
            "This happened to me last year! I was so freaked out. I had a samsung galaxy s6, I text my husband and someone answered, but it wasnt him. We went back and forth a few times to figure it out and couldn't. I dont know how it happened and it has never happened again.",
            "IT Administrator here. The carriers are scrambling. It's a known issue. They aren't even sure what's causing it. Is playing hell on our notifications system for patients.",
            "My ex got a message I didn't send, started a whole new arguement.",
            "This happened to me lastnight around 3am. I read the text in the morning, from my boyfriend, and asked why he was up at that time, and why he would ask if my feet were nice and warm? Lol. He said he wasnt, he was sleeping beside me. We looked on his messages, and he had nothing on his phone. So weird. Also, we live in Canada, he is on Bell and I am with Chater. We both have samsungs.",
            "Holy shit!  I’ve been calling my Husband Ghost all day because of a mystery text at 1:32am that said Me Toooo!  He had no record of sending it from his phone.  This clears it all up.",
            "This just happened to me and my past gf too. It was a message from almost 8 months ago that was sent back to her and a random message that was sent to me. I laughed it off saying that a time loop was just broken but who knows!",
            "Got one from my boyfriend at midnight that said \"save me\", scared the crap out of me this morning.",
            "Mom got a “can u call me?” text from her sister at 4 am. Aunt Patti died in August. Whatever is causing these weird delayed/ ghost texts, not a fan."
        ]
    },
    {
        "post_id": "hll3p6",
        "author": "Llsangerman",
        "title": "Do deaf people ‘talk’ in their sleep? Do they unconsciously do sign languages?",
        "url": "https://www.reddit.com/r/NoStupidQuestions/comments/hll3p6/do_deaf_people_talk_in_their_sleep_do_they/",
        "score": 13474,
        "num_comments": 576,
        "created_utc": 1593948369.0,
        "selftext": "",
        "permalink": "/r/NoStupidQuestions/comments/hll3p6/do_deaf_people_talk_in_their_sleep_do_they/",
        "comments": [
            "Yes they do talk in their sleep. \n\nMy sister is deaf and sometimes she'll say words in her sleep. She says certain words quite clearly so I get the gist of her dreams sometimes. She also cries if she's having a bad dream.\n\nShe doesn't do sign language from what I've observed.",
            "I’m deaf and my wife says I talk in my sleep and make no sense. Just like when I’m awake",
            "My very best friend is deaf. I've been roommates with him for a while now. He often talks in his sleep but rarely is it understandable. It's only when it might be an intense dream that he gets loud and I can pick up a couple of words.",
            "[removed]",
            "Deaf with two CIs here. Had an interesting conversation with hearing friends about this. When I’m dreaming, I can hear in them. None of that “sorry what was that” or misinterpretations that happen when I’m awake. My hearing partner also says I wake up, and will yell (as I cant control volume)\n\nFun for him...",
            "When I was a child, i remember my deaf mum would mutter to herself, while awake, with handshapes. Sometimes she would even do this while she was holding my hand and we were walking into town, which kind of felt like she was shaking my hand away, but I knew it was just her probably cursing 'under her breath'.",
            "[removed]",
            "My niece is Deaf, and she would talk in her sleep then I would tell her about it and we would laugh... There is no diction, sometimes words sound like other words 🤣",
            "yes we sign in our sleep sometimes",
            "My partner is hearing, but knows sign. She will occasionally sign in her sleep, seems no different than when she talks out loud in her sleep, where most of the “words” are mumbled beyond recognition.",
            "Have deaf wife. Deaf wife laughs in sleep. Deaf wife is creepy sleepy.",
            "Yes, sign language is not my native language however but I’ve studied it for many years and then lived with a deaf person later on so I got to use it all the time. I’m a HUGE sleep talker and will constantly be saying things in my sleep in English. My roommate who is deaf when I moved in with him and would use Sign language a lot every day I started dreaming in ASL. Then one morning he said he woke up to use the restroom and I was sitting up in bed, signed something for 10 seconds starting at a wall then plopped back in bed. I had no memory of that so I was skeptical, but then eventually I woke up one night sitting up in the middle of signing something. Based on my experience and talking to a bunch of deaf people they definitely do sleep talk but in sign language. I can only imagine the horror of my roommate waking up to see me just sitting up in bed signing something to a wall",
            "Deaf people can talk it just doesn't sound very fluent or coherent as everyone else's speech. So they would produce noises I think but you probably couldn't understand them",
            "I’m hard of hearing and I’ve caught myself subconsciously finger spelling whatever song is stuck in my head or random thoughts. Like, my inner monologue comes out visibly though me signing. I always get nervous when I realize I’m doing it that someone around me can understand what I’m signing and can essentially ‘read my mind’.",
            "Deaf people talk in everyday life, it's whether they can hear in their dreams which is the real question",
            "Related question, do multilingual people that know 3-4 languages dream people speaking all of them? I feel like a dream with 4 people speaking different languages would happen",
            "My best friend used to date this guy that was deaf. He was born that way and they always wrote letters to each other. One time she showed me a video of him moving his hands in sign. \n\nShe was asking me what was happening to him because it looks weird. I don't know why she was asking me because I only had a little bit of sign language in the books. And that was only because my brother didn't start talking until he was like really older. He has autism so yeah.\n\nI can see that he was making some letters and I forgot what he was exactly saying but I think he was signing in his sleep.\n\nAnd just so I don't get asked about this they broke up because he wanted to go to different places and he wanted someone he could actually sign with.",
            "Aspiring interpreter here. I'm not sure if I physically do it in my sleep but sometimes I'll use sign in my dreams to communicate or someone is signing to me. I'm not exactly sure why. 💁",
            "My sisters hands flutter like she’s trying to sign but it’s incomplete and jibberish fingerspelling",
            "Not quite this but ik someone who's brain is wired to typing. She's a super good at doing transcripts and when listening to people her fingers do typing motions to type out what they're saying as they talk. And they have done it in their sleep before so it's definitely possible to sign in your sleep",
            "So, deaf people can still make noise and many can still speak if they've been taught to/naturally taught themselves to. \n\nThe brain isn't typically able to do refined and specific movements. Deaf people just do what others do; make noises and sleep talk. Except it usually isn't coherent, as people who are deaf from a young age or born deaf can't really exact their tone (I think I'm wording that wrong, sorry). So, to answer you question, no! They talk like everybody else in their sleep, and I've seen it first hand.",
            "I’m Deaf and I see myself in 3rd person signing in my head like a tiny screen at the bottom of Life Tv but I can also think in first person signing like I’m just imagining my arms signing it instead of moving",
            "My sister is deaf. She has been known to not only talk but yell very loudly in her sleep.",
            "I'm hearing, my husband is deaf. He talks in his sleep regularly but I can never make out what he is saying, I've never seen him sign in his sleep. He also sleep walks a little bit. Our daughter who is hearing talks in her sleep as well and I can't make out what she says either. Mostly jibberish from both of them. My husband was born deaf but learned to speak first then sign.",
            "They probably won’t be able to do sight language in their sleep as the brain paradises the body so we don’t act out our dreams",
            "As someone who is deaf and have multiple def friends I have woken up before and seen them talking in their sleep or more so making noises I should say",
            "I would think signing in your sleep would be less common because usually your body is paralyzed while dreaming.",
            "Can't see why they wouldn't talk as they are not mute, (or at least murmur) I doubt they sign but probably like everyone else twitch.. Maybe just more",
            "Deaf people aren't mute, while they can't hear most people can speak",
            "I am deaf and also know ASL.  I can hear in my dreams, so no signing.\n\nI think it is different for everyone.",
            "I'm hearing. I took two years of ASL in high school. I have multiple witnesses that have seen me sign in my sleep. Not too unusual for me actually. My husband has witnessed me talk, sing, and sign in my sleep. I'm also a sleep walker and have even cooked in my sleep. Thank goodness hubby was home and awake to \"supervise.\" I wish this was a marketable skill lol.",
            "This lady in my apt building has gone deaf and she talks jibberish and cackle laughs in her sleep most every night.",
            "My girlfriend is deaf/hard of hearing. She both talks and signs in her sleep.",
            "I knew one person who was deaf, but could read lips pretty well, so sometimes she would speak, but the words would be pronounced a bit differently. Maybe some people who are deaf talk in their sleep that way? idk",
            "Once witnessed my friend sign in her sleep at a sleepover. She is the only hearing child in a deaf family - the middle child, too. Her parents didn’t realize she wasn’t deaf until she was about three years old. She still considers ASL her first language and English her second language. \n\nThe instance where I witnessed her signing was kinda sweet. She had a crush on someone at the time and in her sleep, she finger spelled his name, followed by the sign for “I love you”. She just cycled through that same phrase over and over. I asked her about it the next day and she had no recollection of it. \n\nMy sister is congenitally deaf, though, and I haven’t witnessed her sign in her sleep. She sleeps like the dead, once she’s out, she’s OUT.\n\nEdit: spelling",
            "Am Deaf. Can confirm I sign in my sleep, especially if it's a nightmare. My husband is hearing and will come wake me up if I am screaming or yelling (after reading other comments, yes, I can speak and also talk in my sleep) and has sent me some fun snippets of me signing in my sleep on snapchat every once in a while. I'm also just a wild signer though; I break my glasses every once in a while just getting overly enthusiastic and one time sliced my eyebrow with a particularly viciously signed WORRY and stiletto shaped nails.",
            "Just imagine someone having a nightmare and they start doing the Naruto hand gestures",
            "I think it might depend. People who later became deaf might talk and those born deaf doesn't",
            "During the REM state of sleep when we are doing most of our dreaming and prone to talking  out loud, the brain limits movements. It is referred to muscle atonia (or sleep paralysis) and prevents us from doing significant movements while we are dreaming, most likely as a safety mechanism. You may have experienced muscle atonia when you wake from a dream but cannot move for a few seconds, feeling paralyzed. \n\nSo, because of muscle atonia during dreaming, it is unlikely that a person would perform complex signals with their hands.\n\nInterestingly, not every mammal has effective muscle atonia during sleeping, dogs for example, will frequently run and wag their tails during a dream.",
            "I’m a sign language interpreter.\n\nSometimes when I’m falling asleep and thinking about work and things I interpreted that day - I’ll feel my fingers twitch in the direction of a word.\n\nIt always give me a giggle.",
            "Sometimes.   Sometimes my dreams have closed captioning.",
            "Yeah my dad was born completely deaf and he \"signs\" in his sleep (twitching his fingers) and if he has a bad dream he screams really loudly in his sleep.\n\nSometimes I can detect certain words etc.",
            "Yes. My grandson was born profoundly deaf. He signs in his sleep sometimes.",
            "I can't find if anyone answered this for you but yes they sign in their sleep sometimes and they will tap/smack you to do so (they do this when awake too to get you to look; tap, stomp, scream, flick a light switch). Yes they can sign clearly in their sleep. \n\nMy family are very active sleepers and we all have stories about this. My aunty used the interpret for comedians and musicians she'd sit up finish a joke and applaud herself (shaking her hands kinda like  bad spirit fingers) then drop all the time.\n\nFun fact: CODAs (children of deaf adults) do this a lot too it's based on dominant language generally, it can get really confusing when they're signing to you about something you have no context for and out loud talking about something different.",
            "I have sensitive hearing (autism and ADHD). So, not a direct reply to the question.\n\n\nBut as for signing it one’s sleep: When I was learning ASL in elementary school, my mom said I frequently signed in my sleep.\n\n\nI personally remember waking up to having the Sesame Street Alphabet song stuck in my head and I was instinctively _signing_ along to it.",
            "If they were born deaf and still are deaf, then they can't talk in their sleep, they'll just make sounds or talk in sign Language, but if they became deaf they may talk in their sleep",
            "Afaik, they mostly moan and mumble. I guess it depends heavily on how deaf they are and if they always were or not.",
            "I know someone who grew up signing (she has a deaf mom) and I saw her signing in her sleep a few times.",
            "Im not deaf but i sign and some times i think in sign. I wouldnt be suprised if i had dreamt in sign as well.",
            "I went to visit a friend in the hospital. The nurse said she had just given my friend a sedative, but to go on in. My friend slept nearly the whole time I was there, but I could tell she was knitting part of the time.",
            "Whew.",
            "I normally just speak in my sleep, i don’t sign. I wasn’t born deaf though",
            "Yup. Makes about as much sense too.",
            "Not a human but my deaf ferret would make loud squeaking noises in her sleep.",
            "I have a friend who isn't deaf but knows ASL very well and she signs in her sleep",
            "Not exactly relevant but still interesting, my fiance \"plays\" piano and guitar in his sleep, so I would think signing while asleep is pretty likely",
            "My youngest brother is deaf and he used to sign a lot in his sleep when he was 5-9, now he talks in his sleep.",
            "*screams in sign language*",
            "No, they make noise, but don’t use their hands",
            "I’m deaf and I don’t remember if I ever talked in sleep, but I’m pretty sure I don’t so sign language when I’m sleeping lol.",
            "Now I am wondering if deaf people dream of other people signing to them or if they dream where they can hear.\n\nEdit: looked it up and it said if a deaf person has never experienced sound they will most likely have mute dreams. Thats sad. :(",
            "My bff is deaf with a cochlear implant. She’s completely deaf without it on. I’ve known her for 20 years (since the 3rd grade). She never learned to sign but she talks in her sleep A LOT. Sometimes it’s gibberish, sometimes it’s words, very often it’s yelling. She’s a very active sleeper, too, whether it’s aggressive spooning or punching. And farting. She doesn’t have anything traumatic in her past, and she rarely remembers her dreams. I like to think that the loud toots are a defense mechanism to whatever is chasing her in her dreams. \n\nWhenever there’s a new guy in her life, I love hearing the first few sleepover stories. “Do you know you scream in your sleep?” “You punched me in the face last night.” “How do you not wake yourself up when you fart that much?”",
            "My sister that used to be deaf before they put in her implants used to talk alot in the sleep",
            "Yes they do. I shared a hotel room with my Deaf colleague on a work trip. Saw him talking about gardening while fast asleep. And it was actual signing.",
            "No. We mumble.",
            "You ever watch the show ..... you can't ask that? .... I def Recommend it. It will answer all kinds of questions that you don't even realize you have on different types of people lol.",
            "I am hearing but studied ASL for years and I’ve been told I’ll occasionally sign in my sleep.",
            "My wife does.",
            "https://www.reddit.com/r/todayilearned/comments/f8er3o/til_when_deaf_people_with_schizophrenia_hear/",
            "yes, ive seen normal signs, and Ive seen \"mumbling\" signs.\n\nMy friend, the youngest by many years, an oops baby,  of 3 deaf sisters, told me a story that she apparently was sleepwalking as a child, went to the oldest sister (also asleep) to ask/tell her something, who answered her! The middle sister witnessed the event.",
            "I'm a sign language interpreter and I sometimes wake up in the middle of the night sitting up in bed and signing. One time I even, in my sleep, put on a work shirt and started \"interpreting\" in my sleep",
            "Not Deaf, although ASL was my second language and I dream in it sometimes.  \nSame for Spanish, and sometimes French and German have cameos.",
            "Bruh how high are u",
            "I am not deaf but know ASL enough to communicate. When I was under anesthesia for my wisdom teeth getting removed, apparently I was signing in my sleep. Not for long tho, but long enough to where they thought I was awake for a second.",
            "Yes they do. My wife is deaf but has had a bunch of speech therapy growing up and both signs and talks in her sleep. And now so so I. She told me that one night I was complaining about our neighbors in my sleep one night. \n\nI'm addition to that is not uncommon to sign to yourself when you are thinking about something. We both do it.",
            "One of the most interesting things I learned in college regarding children’s development was how *all* children babble and speak nonsense syllables, etc., prior to speaking audibly—deaf children simply babble, involuntarily, with their hands, signing, that is. \n\nI found that amazing, and, rather universally, it seems to affirm the systematic progression of learning language en route to speech .",
            "Squads  have been known to do military drill in there sleep, all synchronised.",
            "I’m hearing but took two years of sign language. I woke myself up once because I was having a sign dream and I was signing IRL. It scared me awake and as far as I know is the only time I’ve signed in my sleep.",
            "My wife is an interpreter, she does both. She talks nonsense, but will sometimes wave her hands like she’s trying to get someone’s attention in sign",
            "My dad used to talk in his sleep. I found it so funny, how he would actually sign stories or conversations. However, now my wife says I do it too. It’s pretty cool to witness first hand.",
            "I don't think this is what you're looking for, but some sign language teachers teach students to sign unconsciously like you're describing. While I have never met anyone who has actually done this, it seems that it has been done.",
            "My father (60's) has been deaf all his life due to Usher's Syndrome. When he takes naps during the day in his recliner will sign (ASL) very fast to himself when he wakes up, usually gibberish with some form, but he does lift his hand to do so and doesn't really remember what he has said. Equates pretty well to when a hearing person is abruptly awoken and sleep talks as they wake up. I haven't seen him sign in his sleep, maybe a hand twitch here or there. For reference, he's had a cochlear implant in his 30's. Kind of late compared to kid now-a-days.\n\nEdit: additionally, he will sign to himself unconsciously when reading things, or when he's in deep thought. I do this too as someone who's fluent in ASL, but was born hearing.",
            "Some talk, some don't. It varies. If they're more oral, then they think in English sometimes. If not, then probably ASL (or whatever national sign language).\n\nMy parents are deaf and I'm an only child. I was sort of fortunate in that over 50% of the deaf population is unemployed, but my parents are pretty well off. It makes you rethink the standard for social justice though.",
            "I remember hearing that people who sleep walk fail to produce a hormone that creates temporarily paralysis that causes most people to not physically act out their dreams. So I imagine deaf people would only sleep talk with sign language if they also were a sleep walker. \n\nI'm not in any way a medical professional, so don't take this as fact.",
            "I'm not certain about movements, but when I signed more I certainly signed in my dreams. Likewise, I know people whose primary language is BSL who consistently see sign in their dreams.   \n\n\nMy guess, sleep-wise is that you'd need more muscle for signing than talking - larger movements at least. So rather than actual sign you'd probably see broad gross motor movements?    \n\n\nQuite often when people sleep talk it's mumbles, in any case. Although my wife has verged between silence, mumbles and full on strange conversations.",
            "Yes",
            "I’m hearing, but when I was in my intensive interpreting program, I’ve woken myself up by signing in my sleep. My dreams have also been in sign language before as well. Pretty crazy!",
            "Don't think so",
            "Nice",
            "Yes :)",
            "👉☝👇✌👈🖒👍✋👋🤘✊✋👊🖓👌🖐✊✊👍👌👎🖑🤘🖖🖐🖒🖓👋👏👊👎✋",
            "This is way late, but my son is 5 and has a significant speech delay and has developed a mix of his own signs, traditional signs and words to communicate. He does all three during his sleep, it's not uncommon to see him acting out his sign for \"building houses\" while making sound effects.",
            "It depends on whether or not you were born deaf or not. I was not, but I am deaf now. Yes, I can hear and talk in dreams, but only because I remember being able to. I don’t think someone who was born deaf would be able to because sound would not be stored in their brains, and couldn’t be reproduced in dreams, but I don’t know. I went deaf when I was 15.",
            "Was born deaf. No, I don't talk in my sleep. I use a cochlear implant though. It might vary from person to person.",
            "My mama told me I would talk and kick in my sleep when we go on vacations .",
            "I'm not deaf but my parents are and I've woken up signing and did it in my sleep before lol",
            "Yes, my best friend is deaf, occasionally I've seen him get into some heated arguments in his sleep",
            "Irrelevant but both my kids laugh in their sleep. Animals run during dreams... probably",
            "This will get buried... I’m not deaf, but I learned ASL as a little kid. My mom said I would sign/spell in my sleep. Great question!",
            "What language does the voice in their head speak in?",
            "This is kinda rude broh",
            "Side question: Do dead people think in sign language?\n\nEdit: Deaf* I really hate autocorrect.",
            "Hell no",
            "When the deaf get drunk do they slur their hand signs?"
        ]
    }
]