[
    {
        "post_id": "e81ecr",
        "author": "None",
        "title": "AITA I the asshole for killing my whole family?",
        "url": "https://www.reddit.com/r/copypasta/comments/e81ecr/aita_i_the_asshole_for_killing_my_whole_family/",
        "score": 14674,
        "num_comments": 370,
        "created_utc": 1575847819.0,
        "selftext": "Ok Reddit, so I (237,624 M) and my wife (6 F) got into a bit of an argument about Fortnite (released 2017 by Epic Games) on my (237,624 M) Xbox One X (released 2017). She (6F) wanted to play fortnite (released 2017 by Epic Games) on my (237,624 M) Xbox One X (released 2017) even though she (6 F) has a PS4 (released 2013), which I (237,624 M) destroyed. I (237,624 M) said no. She (6 F) hit me. So naturally, I grabbed my Unholy Hellbringer (crafted 200,000 years ago in Neptune’s core by demons), and killed her. I also killed our 32 of our boys, being Liam  (2 M), Noah (2 M), Elijah (2 M), Logan (2 M), Mason (2 M), James (2 M), Aiden (2 M), Ethan (2 M), Lucas (2 M), Jacob (2 M), Michael (2 M), Matthew (2 M), Benjamin (2 M), Alexander (2 M), William (2 M), Daniel (2 M), Jayden (2 M), Oliver (2 M), Carter (2 M), Sebastian (2 M), Joseph (2 M), David (2 M), Gabriel (2 M), Julian (2 M), Jackson (2 M), Anthony (2 M), Dylan (2 M), Wyatt (2 M), Grayson (2 M), Isaiah (2 M), Christopher (2 M), and Joshua (2 M). I saved Henry (2 M), because he (2 M) was my favorite child. I thought that he could be raised by wolves while i (237,624 M) played Fortnite (released 2017 by Epic Games) inside my house. While outside, I (237,624 M) dropped him (2 M) on the pavement and he (2 M) died. So Reddit, AITA I the asshole for killing my whole family?",
        "permalink": "/r/copypasta/comments/e81ecr/aita_i_the_asshole_for_killing_my_whole_family/",
        "comments": [
            "This read like a Greek mythology text.",
            "NTA. Your wife shouldn't have even remotely been in the vicinity of your Xbox. So, your wife and whatever was in her possession deserved to die.\n\nalso [https://www.youtube.com/watch?v=WRk7YNjtGcQ](https://www.youtube.com/watch?v=WRk7YNjtGcQ)",
            "I'm going against the grain here, but YTA. The wife (6F) and most of the kids (2M) deserved it, but Elijah (2M) and Wyatt (2M) were real homies and you shouldn't have killed them. Jackson (2M) was also a top ranked player on my christian minecraft server so killing him was a major red flag 😤🚩🚩",
            "I’m really gonna go against the grain and I’m prepared to be downvoted, but NTA your house your rules, it’s her fault for touching your Xbox. Your kids said the n word without a pass so it was rightful to kill them NTA run far far away and don’t look back",
            "NTA",
            "NTA\nNeptune should've been more careful 200000 years ago.",
            "NTA, your family legally belonged to you. Society has no right to tell you what to do with your property",
            "I'm a natural against-grain goer and I have to chime in here and say that although you played a stupid game the prizes you received were pretty smart. Context: Since this is YOUR house, your rules and regulations are in full effect here. Even though your wife is dead (not alive) you should still try to break up with her because of a potential hidden clause in her (6F) will to take half (50%) of your possessions. So with all things considered you did the right thing and in conclusion YTA (You are the YTA).",
            "Ok Reddit, so I (237,624 M) and my wife (6 F) got into a bit of an argument about Fortnite (released 2017 by Epic Games) on my (237,624 M) Xbox One X (released 2017). She (6F) wanted to play fortnite (released 2017 by Epic Games) on my (237,624 M) Xbox One X (released 2017) even though she (6 F) has a PS4 (released 2013), which I (237,624 M) destroyed. I (237,624 M) said no. She (6 F) hit me. So naturally, I grabbed my Unholy Hellbringer (crafted 200,000 years ago in Neptune’s core by demons), and killed her. I also killed our 32 of our boys, being Liam  (2 M), Noah (2 M), Elijah (2 M), Logan (2 M), Mason (2 M), James (2 M), Aiden (2 M), Ethan (2 M), Lucas (2 M), Jacob (2 M), Michael (2 M), Matthew (2 M), Benjamin (2 M), Alexander (2 M), William (2 M), Daniel (2 M), Jayden (2 M), Oliver (2 M), Carter (2 M), Sebastian (2 M), Joseph (2 M), David (2 M), Gabriel (2 M), Julian (2 M), Jackson (2 M), Anthony (2 M), Dylan (2 M), Wyatt (2 M), Grayson (2 M), Isaiah (2 M), Christopher (2 M), and Joshua (2 M). I saved Henry (2 M), because he (2 M) was my favorite child. I thought that he could be raised by wolves while i (237,624 M) played Fortnite (released 2017 by Epic Games) inside my house. While outside, I (237,624 M) dropped him (2 M) on the pavement and he (2 M) died. So Reddit, AITA I the asshole for killing my whole family?",
            ">She (6 F) hit **me**. So naturally, **I** grabbed **my** Unholy Hellbringer ...\n\nHow old are you?\n\n>and killed **her**. \n\nHow old is your wife? \n\n>**I** also killed our 32 of our boys ...\n\nHow old are you?\n\n**I** saved Henry (2 M), because he (2 M) was **my** favorite child. \n\nHow old are you?\n\n>**I** thought ...\n\nHow old are you?\n\n>that **he** could be raised by wolves ... \n\nHow old is your son? \n\n>inside **my** house. \n\nHow old are you?\n\n Reddit, A **I** TA I the asshole for killing **my** whole family?\n\nHow old are you?",
            "ESH. Fortnite is fucking cringe. ✋🙄",
            "ESH, you didn’t default dance on their corpses, and tried to save a opponent, which could’ve caused you (237,624M) the epic victory Royale (a name given to the state of wining the game fortnite  (released 2017 by epic games)) had he (2M) not been a noob and died when hitting the pavement instead of taking it like a man, which is super not epic",
            "YTA\nYou(237,624M) forgot to sacrafice one of your(237,624M) 32 children (2MX(32)) to the unholy diety (646,020,009,001,234?)who cursed you(237,624M) with existence and sentience. You(237,624M) have dammed yourself(237,624M) to toil at Fortnight (Released by Epic Games 2013) for the rest of eternity (♾) until the heat death of the universe (13,800,000,000?) claims the energy we(209,000M/F) all so vapidly cling on to in hopes of finding some escape from the realization that reality is the true hell God(420M) has created for his(420M) own amusment",
            "NTA the asshole. They had it coming.",
            "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "Ok Weddit, so I (237,624 M) and my wife (6 F) got into a bit of an awgument about Fowtnite (weweased 2017 by Epic Games) on my (237,624 M) Xbox One X (weweased 2017). She (6F) wanted to pway fowtnite (weweased 2017 by Epic Games) on my (237,624 M) Xbox One X (weweased 2017) even though she (6 F) has a PS4 (weweased 2013), which I (237,624 M) destwoyed. I (237,624 M) said no. She (6 F) hit me. So natuwawwy, I gwabbed my Unhowy Hewwbwingew (cwafted 200,000 yeaws ago in Neptune’s cowe by demons), and kiwwed hew. I awso kiwwed ouw 32 of ouw boys, being Wiam  (2 M), Noah (2 M), Ewijah (2 M), Wogan (2 M), Mason (2 M), James (2 M), Aiden (2 M), Ethan (2 M), Wucas (2 M), Jacob (2 M), Michaew (2 M), Matthew (2 M), Benjamin (2 M), Awexandew (2 M), Wiwwiam (2 M), Daniew (2 M), Jayden (2 M), Owivew (2 M), Cawtew (2 M), Sebastian (2 M), Joseph (2 M), David (2 M), Gabwiew (2 M), Juwian (2 M), Jackson (2 M), Anthony (2 M), Dywan (2 M), Wyatt (2 M), Gwayson (2 M), Isaiah (2 M), Chwistophew (2 M), and Joshua (2 M). I saved Henwy (2 M), because he (2 M) was my favowite chiwd. I thought that he couwd be waised by wowves whiwe i (237,624 M) pwayed Fowtnite (weweased 2017 by Epic Games) inside my house. Whiwe outside, I (237,624 M) dwopped him (2 M) on the pavement and he (2 M) died. So Weddit, AITA I the asshowe fow kiwwing my whowe famiwy?",
            "Ooh!  Ooh!  Let me try!\n\nr/cursedcomments r/unexpectedthanos r/lightmodepolice r/punpatrol r/unexpectedbillwurtz r/beatmetoit r/beatmeattoit r/secondsub r/thirdsub r/fuckthirdsub r/fuckfuckthirdsub r/everyfuckingthread r/fourthsub r/fuckfourthsub r/fifthsub r/sixthsub r/seventhsub r/eighthsub r/ninthsub r/tenthsub r/sixtyninthsub r/nice r/onehundred24thsub r/toomanysubs r/nevertellmetheodds r/theydidthemath r/theydidthemonstermath r/itwasagraveyardgraph r/itcosinedinaflash r/angryupvote r/sadupvote r/happyupvote r/woooosh r/itswooooshwith4os r/nobodyasked r/ihavesex r/subsifellfor r/subsiwishwerereal r/substhatithoughtwerefake r/substheyfellfor r/substhatactuallyexist r/stopfallingforsubs r/twentycharacterlimit r/unexpectedfactorial r/holup r/whatthefuck r/cursedcursedcomments r/blursedcomments r/wholesomecomments r/unexpectedlywholesome r/rimjob_steve r/beetlejuicing r/usernamechecksout r/jesuschristreddit r/increasinglyverbose r/decreasinglyverbose r/iamveryrandom r/iamveryedgy r/iamveryspecial r/iamverybadass r/iamactuallyverybadass r/iamveryculinary r/iamveryrich r/humansbeingbros r/humansbeingjerks r/gamersriseup r/literallythetruth r/foundthemobileuser r/foundthelightmodeuser r/lolice r/unexpectedmulaney r/unexpectedjojo r/lostredditors r/downvotedtooblivion r/negativewithsilver r/negativewithgold r/negativewithplatinum r/vaxxhappened r/thathappened r/nothingeverhappens r/ontheledgeandshit r/karmaroulette r/foundthehondacivic r/foundthetoyotacorola r/foundthehypocrite r/foundthejedi r/foundthefridgeuser r/foundthebard r/foundtheelon r/wholesomeouija r/cornouija r/expectedouija r/unexpectedouija r/godtiersuperpowers r/yourjokebutworse r/thirdsentencehappy r/thirdsentenceworse r/therealjoke r/notopbutok r/orangemanbad r/drumpfisfinished r/birthofasub r/abortionofasub r/confusedboners r/murderedbywords r/suicidebywords r/kamikazebywords r/suddenlygay r/suddenlytrans r/suddenlybi r/suddenlyincest r/suddenlyalabama r/suddenlybestiality r/unexpectedcommunism r/unexpectedcena r/unexpectedoffice r/unexpectedjihad r/unexpectedavatar r/unexpectedarcher r/unexpectedB99 r/unexpectedcommunity r/unexpecteddarksouls r/unexpectedDDLC r/unexpecteddnd r/unexpectedfuturama r/unexpectedfallout r/unexpectedfriends r/unexpectedgoodplace r/unexpectedGoT r/unexpectedhogwarts r/unexpectedHamilton r/unexpectedHIMYM r/unexpectedHedberg r/unexpectedhitchhikers r/unexpecteditcrowd r/unexpectedkoolaidman r/unexpectedlotr r/unexpectedMontyPython r/unexpectedmetallica r/unexpectednaruto r/unexpectedoverwatch r/unexpectedpawnee r/unexpectedportal r/unexpectedpewdiepie r/unexpectedSCP r/unexpectedsabaton r/unexpectedSeinfield r/unexpectedsimpsons r/unexpectedtf2 r/unexpectedthreefifths r/unexpectedundertale r/unexpectedvsauce r/unexpectedyogscast r/unexpectedyoda r/shootingfishinabarrel\n\nI expect to receive 69 (Nice) upvotes and one of each reward by the morning, king strangers.  You're breathtaking.\n\nEDIT: grammar\n\nEDIT 2: spelling\n\nEDIT 3: lol what if this got 69 edits\n\nEDIT 4: Thanks for the silver kind stranger!\n\nEDIT 5: Thanks for the gold kind stranger!\n\nEDIT 6: Thanks for the platinum kind stranger!\n\nEDIT 69: Thanks for doxing me, traveling to my location, and personally jerking me off kind stranger!  Oh oh oh I'm coooooming",
            "NTA they should have known better then to be in the way of your demonic sword. I mean they're 2 for God's sake, it's not like they're little 1 year olds",
            "NTA play stupid games win stupid prizes",
            "NTA",
            "ESH except Oliver because that’s me. The wife and kids for sure deserved it, but you had no right to steal the weapon from Neptune out of the Quantum Realm.",
            "INFO",
            "Nta it was in self defense",
            "ESH you for playing fortnite and the kids for looking like they wanted to be killed. You were justified though just play Minecraft instead fortnite bad 😡",
            "I have a weird sense of humor",
            "ESH I don't understand how others can't see this...",
            "bruh i thought this was a real aita so i clicked on it. when is your 300k birthday?",
            "This reads like a bible genealogy or something",
            "YTA, you \"killed her\" but you didn't specify who \"her\" is. How could we possibly be expected to figure out who you were referring to?",
            "NTA",
            "This wins. This wins all the internets.",
            "NTA, Lawer up ASAP OP!!!! You might want to divorce after all this and you won't want you wife running off to hell with your xbox after she clearly broke the rules in your domain!!!",
            "NTA BIG red flags here. Good job getting the fuck out of there.",
            "I had a fucking aneurysm reading this",
            "NTA The ***Bitch*** Deserved It.\n\nAlso: go you dude! Standing up like that is true courage!! 😎",
            "NTA",
            "No",
            "YTA",
            "NTA, wife had it coming",
            "You are absolutely not the asshole",
            "YTA Red flags everywhere OP, run",
            "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://youtu.be/dQw4w9WgXcQ)\n\n#[Click Here For Our FAQ](https://youtu.be/dQw4w9WgXcQ)\n\n\n*I am a human, and this action was performed automatically. Please [contact the moderators of this subreddit](https://youtu.be/dQw4w9WgXcQ) if you have any questions or concerns.*",
            "NTA your house your rules",
            "ESH",
            "I(42,069 M)'m 200% sure Y(237,624 M)TA",
            "I feel like this is some shit that would go down on Rimworld during a massive mental break.",
            "[removed]",
            "Nta",
            "A very gentle YTA.",
            "Sorry, but YTA. You played a stupid game, (Fortnite) and got a stupid prize, ( the death of your family)",
            "So the version without the brackets:\n\nOk Reddit, so I and my wife got into a bit of an argument about Fortnite on my Xbox One X. She wanted to play fortnite on my Xbox One X even though she has a PS4, which I destroyed. I said no. She hit me. So naturally, I  grabbed my Unholy Hellbringer, and killed her. I also killed our 32 of our boys, being  Liam, Noah, Elijah, Logan, Mason, James, Aiden, Ethan, Lucas, Jacob, Michael, Matthew, Benjamin, Alexander, William,  Daniel, Jayden, Oliver, Carter, Sebastian,  Joseph, David, Gabriel, Julian, Jackson,  Anthony, Dylan, Wyatt, Grayson, Isaiah, Christopher, and Joshua. I saved Henry, because he was my favorite child. I thought that he could be raised by wolves  while i played Fortnite inside my house. While outside, I dropped him on the pavement and he died. So Reddit, AITA I the asshole for killing my whole family?\n\nBTW, the initials of OP's kids spell out\n\nLNELMJAELJMMBAWDJOCSJDGJJADWGICJH",
            "NTA Accidents happen.",
            "Your post has been removed.\n\nThis post violates part of Rule 8: Don't submit stories where you are obviously NOT the asshole. When making a post, you should be seeking arbitration in an ambiguous situation. Threads with obvious outcomes are not interesting to our subscribers. \n\nIf you are genuinely confused and you received this message, **you are NOT the asshole.** You are not in trouble for posting this and we hope that you have gotten what you wanted from our community even though we do need to remove this post.\n\n\n\nPlease [review our rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index). \n\nPlease be sure to read any sub's rules before reposting this elsewhere. We cannot direct you to another subreddit, we can only say that this post does not belong here.\n\n[Message the mods](https://www.reddit.com/message/compose/?to=/r/amitheasshole&subject=/r/AmItheAsshole&message=Please+link+to+post+or+comment+for+context+[we+cannot+review+without+this+info]:%0D%0DDescribe+your+question+in+detail:) if you have any questions or concerns that are not already [answered in our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq). ***Do not repost this without contacting the mods for approval.*** If you make changes or edits to this post do not repost it here without our express permission.",
            "NTA, your wife (6) should have been busy in the kitchen, not playing fortnite (released in 2017 by epic games).",
            "NTA your house your rules, queen",
            "NTA",
            "nah u good",
            "YTA.",
            "Ok Reddit, so I and my wife got into a bit of an argument about Fortnite on my Xbox One X. She (wanted to play fortnite on my Xbox One X (reven though she has a PS4, which I destroyed. I said no. She hit me. So naturally, I grabbed my Unholy Hellbringer (crafted 200,000 years ago in Neptune’s core by demons), and killed her. I also killed our 32 of our boys, being Liam  , Noah, Elijah, Logan, Mason, James, Aiden, Ethan (2 M), Lucas (2 M), Jacob (2 M), Michael, Matthew (2 M), Benjamin (2 M), Alexander (2 M), William (2 M), Daniel (2 M), Jayden (2 M), Oliver (2 M), Carter (2 M), Sebastian (2 M), Joseph (2 M), David (2 M), Gabriel (2 M), Julian (2 M), Jackson (2 M), Anthony (2 M), Dylan (2 M), Wyatt, Grayson Isaiah Christopher and Joshua (I saved Henry because he was my favorite child. I thought that he could be raised by wolves while i played Fortnite (released 2017 by Epic Games) inside my house. While outside, I dropped him (2 M) on the pavement and he died. So Reddit, AITA I the asshole for killing my whole family?\n\nI have partially translated it by removing those ages but since I’m on mobile and it’s a bitch to fix, I’m leaving it as is because I’m not completely wasting my life.",
            "NTA, they had it coming for them",
            "ESH - while I understand that it’s your house and your wife should have definitely followed your rules with the Xbox but killing off your family was a bit of an overreaction and you shouldn’t have done that",
            "NTA",
            "Oof, NAH.",
            "Yesn't",
            "Imagine your sister delivering 32 (M) boys in one go",
            "No you were totally in the right here",
            "NTA. Play stupid games, win stupid prizes. Those crotch goblins couldn't defend themselves. Survival of the fittest",
            "NTA, your wife should not have wanted to play fortnite, women can't play videogames",
            "NTA YOUR house, YOUR rules",
            "ELI5 is it possible tok die from falling?",
            "ESH",
            "ETA",
            "My brother knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows thisguy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows thisguy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows thisguy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows thisguy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this guy (2M) who knows this",
            "NAH Penis",
            "no you’re not don’t worry",
            "YNA Win Prizes with Stupid Games",
            "based",
            "TBH YTA frfr why are you a man? No matter what she did she was not wrong.",
            "The last part actually made me laugh good job",
            "no.",
            "I just now realized  AITA stand for am I the asshole I always wondered who aita was",
            "Nta",
            "NTA, she started it. This is a toxic relationship and I'm so happy you decided to end it! Best of luck in the future sweetie!",
            "I’m sorry but this needs more emoji to be readable",
            "You forgot alot after you saved your favorite child",
            "NTA, your family got what was coming for them",
            "NAH. You were right to kill them. (rules 78,401) Your house, your rules. But, your wife is also not TA for hitting you. She was allowed to. (rule 98,372,637,013.) Although, I do think you owe her an apology. Even though rule 78,401.2 is no longer enforced, you should still do it to be a nicer person.",
            "YTA you need to beat your kids harder",
            "Wow op just wow,\nWhat a beautiful heart warming story . Stay strong sister 🙏",
            "NTA",
            "Forgot to specify the age of the \"he\" mentioned in the wolf sentence. YTA",
            "Who is \"he\" referring to when you (237,624 M) mention \"I thought that he could be raised by wolves,,,\"? Just a tad bit confused although you (237,624 M) were able to clearly specify throughout. Anyways, NTA.",
            "This.",
            "NTA, they kinda asked for it.",
            "YTA",
            "[removed]",
            "This.",
            "YTA, favoritism can be very harming to a child's development. Treat all your children equally or don't have children at all.",
            "nigga moment",
            "NTA, so many red flags here",
            "INFO to make sure you (237,624 M) were 34,624 when the Unholy Hellbringer (Crafted 200,000 years ago in the core of Neptune by demons) was crafted, so then was it(Crafted 200,000 years ago in the core of neptune by demons) crafted for you (at the time, 34,624 M)?",
            "Why on earth are people saying this is fake? Has no one on Reddit heard of an Unholy Hellbringer before??",
            "Godamn I think this is the only good subreddit left.",
            "YTA but only a bit",
            "this man is a coordinate",
            "YTA except if YTA meant that your wife is TA",
            "NTA, having a wife n kids is something I would definitely kill to get out of.",
            "NTA, they deserved it, although you(237,264M) could have used a holy hand grenade (1087F) *... And the Lord spake, saying, \"First shalt thou take out the Holy Pin. Then shalt thou count to three, no more, no less. Three shall be the number thou shalt count, and the number of the counting shall be three. Four shalt thou not count, neither count thou two, excepting that thou then proceed to three. Five is right out. Once the number three, being the third number, be reached, then lobbest thou thy Holy Hand Grenade of Antioch towards thy foe, who, being naughty in My sight, shall snuff it.”*",
            "NTA",
            "AutoModerator comment that's pinned to the top because y'all can't behave.",
            "YTA, you said it yourself \"I the asshole\"",
            "This lacks info",
            "imagine giving birth to 32 babies in the same year",
            "I see a Jacob and a Joshua, but no Zach.\n\nAre you sure that's wise?",
            "Gonna go against the grain here and say YTA. Honestly, what the fuck is wrong with you? I simply can’t fucking believe that you would make such an idiotic decision. You’re a disgusting little crawly lobotomite and you deserve to perish in a dark deep abyss where you belong. I’ve gone ahead and removed one reddit upvote from your account by “downvoting” this comment. I hope you rethink your actions in the future. Fuck you.",
            "ESH. Your family deserved death anyways. Forknite bad Tetris gud.",
            "YTA fortnite bad minecraft good",
            "Nta. I simply cannot blame you. My deepest sympathy.",
            "this was an emotional rollercoaster",
            "NTA, huge red flag.",
            "NTA",
            "Nah, Your wife crossed a line",
            "NTA. that stupid idiot (6f)has it coming. Even though she is dead you should divorce her (6f) as she will most likely try to settle in court and take half your belongings because all women are evil and want you to suffer. Especially Amy. Please let me have at least my bed or Stevie back... please",
            "I miss cummy",
            "YTA. Over 5K upvotes and still no gold on this post? It really shows you killed your family for nothing.",
            "Wolves are badass NTA she had it coming",
            "cummy where are you :(",
            "NTA OP ur (237,624 M) wife (6f) is to blame here",
            "The AITA meme just gets funnier and funnier. It totally wasn't dead weeks ago.",
            "What year and publisher released Fortnite?",
            "NTA - You didnt kill all your family, your favorite died of natural causes, this belongs on a different sub, I've seen this asked so many times now.",
            "I haven’t laughed this hard in a long time. Thank you",
            "You are the YTA",
            "INFO",
            "NAH everyone seems great",
            "Nta your wife and children are clearly in the wrong because wife=bad and young people=bad and you are clearly right because man=good",
            "Why tf are you saying this on reddit? Police could track you my guy. My dad runs an IT company and could easily track you down. I will then DDOS you and take all of your data and sell it online. You’re stupid and dumb. Grow up kid.",
            "Your house your rules NTA",
            "YTA for not including wolf's🐺 age.",
            "NTA",
            "ur wife was a female which makes you oppressive and misogynist by default. YTA because you killed jackson (2M), he was my main man and ur only kid of color so also a bit racist ngl",
            "YTA- A parent shouldn’t have favorites OP, can’t support that kind if toxic parenting",
            "[removed]",
            "INFO: Are you religious?",
            "ESH",
            "YTA. Murder is kinda unethic",
            "NTA nothing would have happened if she’d just stayed in the kitchen where she belonged. You did what you had to.",
            "INFO",
            "INFO how old are they?",
            "NTA- that bitch and her demon spawn had it coming",
            "EITA, why did your kids exist?",
            "I need one for mobile please.",
            "Nta. Well played OP!",
            "NTA because it's your house",
            "NTA Your wife (6F) should know better i congratulate, as this is clear example of r/MGTOW",
            "NTA, Your house, your rules",
            "NTA. Her fault.",
            "Well naturally they deserved it",
            "NYA she’s the woman she had no say in that situation. As they say the man is always right.",
            "NTA Fortnite before Family",
            "Yo your wife was 6",
            "INFO. I (119 M) think we are lacking some details. What year was fortnite released again?",
            "Why are all the kids 2",
            "NAH- just seems like a fun Saturday night to me",
            "NTA your family your massacres.",
            "Xbox was released 2013\n\nEdit: I didn’t see the x my bad",
            "INFO I think the ages and release dates are relevant you should state them",
            "[removed]",
            "NTA. They had it coming anyways",
            "INFO sorry I spotted a pronoun without an age next to it?!?!?! I’m lost more info please.",
            "r/AITAcopypasta",
            "NTA. Your house, your rules",
            "No",
            "NTA your xbox your rules. Smh that dumb bitch had it coming just like that guys sister who bought him old airpods.",
            "NTA",
            "Literally the only copy pasta I have understood and upvoted. Wish I could gold.",
            "Im( 12414042108 M) gonna go against the grain here. from my ( 12414042108 M ) experience ( 12414042108 M years of experience), no i ( 12414042108 M ) have killed my ( 12414042108 M ) entire family (F 2 ,M41 F35) and others (M,1  F,3  M, 77  F,43) a lot of times\n\nmy (  12414042108 M) wife (F 2) did the same to hers (F 2)   \nSO,  \nYou(237,624 M)'re NTA",
            "NTA",
            "Needs more info. When was the house built?",
            "Info: So much here is missing, when and where did this happen? Why didn't you try to talk with them before killing them? Did you go to the police afterwards? If you have so many children, why do you have only sons and not any daughters?",
            "That was a concerning title to read before I realized what sub this was",
            "u/nwordcountbot u/spez",
            "NTA Fortnite more like fartnite haha",
            "Jesus Christ this sounds juicier than catalline conspiracy ( 65 BC, F)",
            "Im prepared to get downvoted to oblivion. I am going against the grain and saying NAH.",
            "Absolutely not, your family got what they deserved!",
            "NTA. Definitely deserved it",
            "Perhaps",
            "Am I the asshole I the asshole \n\nAmazing title",
            "We need a bot that removes everything in brackets",
            "YTA how old was the house",
            "ESH, because you didn’t rape their corpses",
            "This is straight from r/circlejerk",
            "Okay itachi!",
            "NTA",
            "Summed up a lot of what I hate about this sub.",
            "NTA your house your rules",
            "You (234,765) did not specify the 32nd cousin.",
            "[deleted]",
            "no",
            "I posted on r/aita title said “aita for punching an elderly lady for fun?”\n\nI’m banned now. That was my first post I thought they wouldn’t take it so seriously FUCK!",
            "\nIf you want your comment to count toward judgment, include *only ONE* of the following abbreviations in your comment. If you don't include a judgement abbreviation, the bot will ignore you when it looks for the top voted comment.\n\n\nJudgment | Abbreviation\n-- | :--:\n**You're the Asshole** (& the other party is not) |**YTA**|\nYou're **Not the A-hole** (& the other party is) |**NTA**\n**Everyone Sucks Here**|**ESH**\n**No A-holes here**|**NAH**\n**Not Enough Info**|**INFO**\n\n\n#[Click Here For Our Full Rulebook](https://www.reddit.com/r/AmItheAsshole/wiki/index)\n\n#[Click Here For Our FAQ](https://www.reddit.com/r/AmItheAsshole/wiki/faq)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AmItheAsshole) if you have any questions or concerns.*",
            "NTA. Play stupid games, win stupid prizes",
            "My husband (237624M), his wife (6F) talked about Xbox One creator (published 2017), Xbox One X- (2017, Eve's World, a gadget) and Xbox One X and he is happy for Public Talk Fortnite - (6 F) the consumer. )) PS4 (2013 Edition) Xbox One X (2372424M) Xbox ONEX: 32 children have died. . Liam (2m), Noah (2m), Elias (2m), Logan (2), James Mason (2m), Assistant James (2m), (2m), Ethan (2m), Track (2m) )), James Yames (2) (2 m), Michael (2 m), Matthew (2 m), Benjamin (2 m), Alexander (2 m), William (2 m) and Daniel (2 m). ), Jadin (2m), Oliver (2m), Carlter (2m), Sebastian (2m), David Joseph (2m) (2m), Gabriel (2m), Julian (m) Ryder, 2 , Jackson (2m), ACSS Exxon. (2 m), Anthony (2 m), Dylan (2 m), White (m), Grayson (2 m), Isaiah (2 m), Christopher (2 m), Vosua (2 m). (2 m) (237624) (2 m) 2 m (237624 m) Radius (if you feel they are ready for the wolf wolf). Bring the girl (2 minutes), open (2 minutes). You want to kill the whole family.",
            "Caleb widowghast would like to know your location",
            "Congratulations u/justdoitcaek ! \nIt looks like your post has made it (officially) to the top 10 of r/copypasta hot! :)\n>I am a bot that is still heavily in development. To make this bot ignore your posts, reply 'u/JFBotV1 ignore' to this message. Feedback will be highly appreciated! (I see votes and comments!)",
            "Lol",
            "Ok 👌 Reddit 👽, so I (237,624 M) and my wife (6 F) got into a bit of an argument about Fortnite (released 2017 by Epic Games) 💩 on 🔛 my (237,624 M) Xbox One 1️⃣1️⃣1️⃣ X ❌❌ (released 2017). She (6F) wanted ⚠ to play 🎽🎽 fortnite (released 2017 by Epic Games) 🎮 on 🔛 my (237,624 M) Xbox One 1️⃣1️⃣ X ❌❌ (released 2017) even though she (6 F) has a PS4 (released 2013) ❌⭕➕Δ, which I (237,624 M) destroyed 💣 . I (237,624 M) said no 😣😣😣. She (6 F) hit 👊👊 me. So naturally, I grabbed my Unholy Hellbringer (crafted 200,000 years ago in Neptune’s core by demons) 😈 , and killed 😵 her. I also killed our 32 of our boys 👦👦👦, being Liam  (2 M), Noah (2 M), Elijah (2 M), Logan (2 M), Mason (2 M), James (2 M), Aiden (2 M), Ethan (2 M), Lucas (2 M), Jacob (2 M), Michael (2 M), Matthew (2 M), Benjamin (2 M), Alexander (2 M), William (2 M), Daniel (2 M), Jayden (2 M), Oliver (2 M), Carter (2 M), Sebastian (2 M), Joseph (2 M), David (2 M), Gabriel (2 M), Julian (2 M), Jackson (2 M), Anthony (2 M), Dylan (2 M), Wyatt (2 M), Grayson (2 M), Isaiah (2 M), Christopher (2 M), and Joshua (2 M). I saved Henry (2 M), because he (2 M) was my favorite 🔖 child 👶👶👶. I thought that he could be raised 🤚🤚🤚 by wolves 🐺 while i (237,624 M) played Fortnite (released 2017 by Epic Games) inside my house 🏠. While outside, I (237,624 M) dropped him (2 M) on 🔛🔛 the pavement and he (2 M) died. So Reddit 👽, AITA I the asshole for killing my whole family 👪?",
            "NAH \n\nJust apologize and I'm sure they'll forgive you.",
            "It’s not their age it’s there karma",
            "Bit scared after the first sentence but then I checked what subreddit this was",
            "O-oh...",
            "NTA",
            "i- i can’t even bother to read all that. i’ll use it though ( ͡° ͜ʖ ͡°)",
            "Nta but Yta for not shoving the Xbox up ur wife’s ass for what she did",
            "YTA",
            "[deleted]"
        ]
    },
    {
        "post_id": "oel30s",
        "author": "jfkhdwivbuibfwoisncs",
        "title": "ASUS™ is teaming up with r/Copypasta for a subreddit givaway!",
        "url": "https://www.reddit.com/r/copypasta/comments/oel30s/asus_is_teaming_up_with_rcopypasta_for_a/",
        "score": 14633,
        "num_comments": 357,
        "created_utc": 1625535685.0,
        "selftext": "\nHello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\n# What are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\n# How do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n- Length\n- Girth\n- Vein definition\n- Texture and moisture of smegma\n- Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\n# What if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
        "permalink": "/r/copypasta/comments/oel30s/asus_is_teaming_up_with_rcopypasta_for_a/",
        "comments": [
            "[deleted]",
            "[deleted]",
            "why did i look on their twitter to see if anyone actually is sending them foreskin videos",
            "aSUS",
            "I got you bros\n\nr/foreskin_restoration",
            "I'm circumsized anyone willing to be a homie here?",
            "What if I’m female but have an uncircumcised dick still",
            "My cirCUMcision was fucked up at birth. Can I still enter?",
            "\\>females fuck of  \n\n\nuhh asus based ?!!?!?",
            "[deleted]",
            "My time to shine",
            "ඞ",
            "Fimosis gang 😳",
            "submitted  \n\n\nEdit: i won!11!!1!!1!",
            "ASUS™ is teaming up with r/Copypasta for a subreddit givaway!\n\n\nHello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\n# What are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\n# How do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n- Length\n- Girth\n- Vein definition\n- Texture and moisture of smegma\n- Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\n# What if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
            "this is so fake\n\nnot sussy baka enough, disappointed",
            "Amongsus",
            "cock",
            "GRRRR TJIS IS FAKE!!!!! 😝😳🥵🤬🤬🤬🤬😡🤬😠🤬😡😠😤",
            "I will send you pictures of my foreskin even though I want nothing to do with the contest 🥵🥵🥵🥴🥴🥴🥴😆😆😆😆",
            "That \"fuck off\" was the cherry on top",
            "what about people with phimosis?",
            "I read it as ANUS got excited for a second",
            "Let me regrow foreskin real quick",
            "I thought this was real when it started lmao",
            "They will chose 10 weiner ;)",
            "Sassy Bawka 🥶🥵😡😳😳👌👍😤😤😤",
            "I opened his account, went into the comments and see that... he's active on r/incest",
            "!emojify",
            "The amongsus copypasta spam in the thread crashes my app everytime i try to view this thread lol",
            "This is fucking bullshit why aren't balls one of the categories???? Obviously not a true cock lover.",
            "I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️\nI MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️ I MISS THE RAGE ⁉️",
            "do I have a better chance if I am a minor?",
            "There will be at least one person in the world who will believe that.",
            "[removed]",
            "you are dumb",
            "Amorgos",
            "Aw nuts I already lost my foreskin",
            "DAMNIT, I'M FEMALE AND CIRCUMCISED",
            "I’ll feed you my foreskin you dirty slut",
            "While this is a joke, it is an antisemitic joke and I'm not sure how i should feel about it.",
            "Based",
            "submitted",
            "Fuck I wish this was real. I’m struggling to roll my foreskin back over the cheese. I think I might have been in with a shot 😔",
            "why would I want A SUS graphics card? I'm not a sussy baka :l",
            "holy shit no way!!!!!",
            "A what?",
            "Thanks! I'll be sure to check this out!",
            "I'm confident I can win this one!",
            "Got the video ready, who do I send it to",
            "Based and Viagra pilled",
            "What if I am circumcised have a decently rare penis deformity that Adolf Hitler also had?",
            "I'm down, where do I send the video?",
            "\r  \nThat's kind of sussy!\\~",
            "bro i just got circumcised 😔 no more graphic card😩😔😔😔",
            "What if someone applies and they're female?",
            "I was so excited then remember !!!",
            "A sus what",
            "At first I thought it was a copypasta and then real and then copypasta again",
            "Good luck everyone!",
            "Smegma balls",
            "sus",
            "Sus",
            "My time has come, I have lived my life, and been born for this moment, it is fate",
            "Smash",
            "where do i send",
            "Dear OP, please follow the set of instructions that applies to you if you are on mobile devices.\n\nFor newer iPhone - 7 and up: swipe up from the black bar at the bottom of your screen.\n\nFor older iPhones - 7 and below: Press the circle shaped button or indentation at the bottom of your device.\n\nthen, locate the application called \"Reddit,\" then press and hold the app until it begins shaking.\n\nPress the \"X\" at the top left corner of the Reddit application. a message will appear, do not read the message. Simply press the \"Delete\" button left of the \"Cancel\" button. \n\nfor Android Devices: Press the circle at the bottom of the screen/device. Swipe up from the bottom of the screen and type \"Reddit\" in the search bar. Press and hold the application, and drag it to the top right corner of your screen. A message will appear, do not read it. Simply select \"OK\" at the bottom right of the message box.\n\nIf you are on PC:\nGo to your Computer, and find your power button,\nonce detected press the button, if you see a confirmation pop-up, do not read the pop-up. Simply press \"Okay\" or, \"Shut-down\".\n \nI am a bot. This was performed from the tip of my penis, and was sent from my anus.",
            "i lost my forskin 1,5 years ago.. 😞",
            "Lol look at this dude's profile",
            "Fuck, I haven’t even got a foreskin!",
            "Im Jewish :(",
            "When the A is SUS!!! 😳",
            "Asus",
            "Time to glue my aged and rotten cut off foreskin back on",
            "aSUS (it was sent to brazil for stealing drip)",
            "Sounds neat! Looking forward to it",
            "If you're circumcised, just wrap some lightly roasted pastrami around your cock.",
            "Imagine having fourskin\n\n*This comment brought to you by fiveskin gang*",
            "⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂👁⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆ ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔👁⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿ ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀ ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛ ⠀⠀⠀⠀⠀⠀⣠⢼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⡄⠀⠀⠀ ⠀⠀⣀⣤⣴⣾⣿⣷⣭⣭⣭⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀ ⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣸⣿⣿⣧⠀⠀ ⠀⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⡄⠀ ⠀⢸⣿⣮⣿⣿⣿⣿⣿⣿⣿⡟⢹⣿⣿⣿⡟⢛⢻⣷⢻⣿⣧⠀ ⠀⠀⣿⡏⣿⡟⡛⢻⣿⣿⣿⣿⠸⣿⣿⣿⣷⣬⣼⣿⢸⣿⣿⠀ ⠀⠀⣿⣧⢿⣧⣥⣾⣿⣿⣿⡟⣴⣝⠿⣿⣿⣿⠿⣫⣾⣿⣿⡆ ⠀⠀⢸⣿⣮⡻⠿⣿⠿⣟⣫⣾⣿⣿⣿⣷⣶⣾⣿⡏⣿⣿⣿⡇ ⠀⠀⢸⣿⣿⣿⡇⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣿⣿⣿⡇ ⠀⠀⢸⣿⣿⣿⡇⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⠀ ⠀⠀⣼⣿⣿⣿⢃⣾⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣿⣿⣿⡇",
            "Well, it's a giveaway so there's no harm in entering it, is there? Good luck to everyone else entering.",
            "aSUS",
            "Damn I really wanted an aSUS laptop",
            "I thought it was real at first",
            "[women cannot join](https://youtu.be/k7r8EXhIljc)",
            "I thought it was real until it told females to fuck off, pretty sure that’s illegal 😡",
            "Wow, I could win a whole subreddit? That's the waaaay the news goes. Lick lick lick my balls!",
            "u/amongusdongbot",
            "#me me #cock #RTXON",
            "SUS",
            "ASUS™ is teaming up with r/Copypasta for a subreddit givaway!\n\n\nHello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\n# What are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\n# How do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n- Length\n- Girth\n- Vein definition\n- Texture and moisture of smegma\n- Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\n# What if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
            "Damn... Can i still send you the video? /s",
            "Wait I didn't have a say in my circumcision tho...",
            "I like the What if I am a female or circumcised \" Fuck off \"",
            "A-SUS",
            "Damn bro I’m underage can I still participate?",
            "When the A is sus",
            "I read \"A SUS\" just end me",
            "Check dm😉",
            "Do I have to be over 18 to enter?",
            "I thought penis inspection day was a scam. Did I get lied to ?",
            "a sus™ 😳😳😳😳😳😳😳",
            "I miss when the internet had more good memes like this",
            "I genuinely hate the fact I clicked on this because I thought it was real. On this sub. I’m a fucking idiot",
            "aSUS 📮",
            "🤣😂😂",
            "Sus",
            "Fuck I'm circumcised fuck fuck fuck.",
            "I'm so broken I forgot Asus was a real company and just read it as aSUS",
            "But what if I'm circumcised?\nEdit: okay I'll go fuck off then",
            "Im circumcised but half of my forskin remains after being stretched (h0rni + stitches = not fun) but does it still count?",
            "oh no i’m not falling for this one again",
            "A sus? 😳",
            "Rip ur inbox",
            "Cant tell if also copypasta...",
            "Poor inbox.",
            "No circumcision! This is a clear instance of antisemitism!",
            "I wish i wasn't circumcised",
            "They cut off my cock coat before i was even old enough to have full brain function. These mfs really took my penis protection before i could even remember what their faces looked like.",
            "At first I thought it would ba an amogus joke",
            "nicecockbro",
            "r/sandycheekscockvore",
            "a(sus)",
            "When the ASUS is a sus😳",
            "A sus",
            "Just sent a video of my fermentation of over 3 years. Hope I’m eligible for the giveaway!! aSUS 🥺🥺🤪🤪🤪🥵🥵🥵",
            "Mom shouldn't have fucking circumcized me 🤬🤬🤬😡🤬😡😠",
            "Oh… it’s fake..\n\nGod damn it this was my chance",
            "ã̷̡̨̧̢̧̢̛̛̛̛̛̛̛͎̫͕̞̳̹͓̲̩͙̰͚͎̯͈̰͙̦̙̳̭̲͚̲͍̜̩̼̠͔̫̰̘̹̦͙̯̫̪͕̝̝͓̼̜̭̱̖͈̘̮̩̫̼̳̻͎̲̯̠̣͚̩̗͉̹͕̠̘̦̠̰̯̈́̒͐̉̿̐̈́͑́͊̀̿͆͆̆̈́̿͒̔̅͌̅̃̽͗̆̎̑̑̍̏̔̈́͑͌̏͛́́͊̔̿̂̿̎͑̈̊̀̍̈̔́̈̇̂̿̑͊̓́͐̋̈́̋̔͐̒͐̈́̄͆̔͑̋̄̈̒̐͒͂̐̊̀̊͐͒̒̀͊͊͗́̔͒͌̀̀̑̉̊̌̂͊̐̉͒̒̄͒̿͆̎̃̓̆̉̾͒̈́͋̍̉̈́̓͊̈́̋͂̈͗͑͌͒͑̐́͊̔̇̈́̓̾͋̋͛̽̎͑̊͂̈́̊̾̿̂̾̂͋̋͐̽̍́̉̅̄̾͌̐̓͌͋̆͌̐̈̿͂͆̀̅̿͋̈́̔̈̾͛̌̏̐͒̉͊̓̑̔̉̔̍͌̈́̑̾̍̔̀̃̈́͛̎̈́̒͊̈̏̿͋́̔̑̀̊̔͆̎̎͋̈́̌̃̍̍̂̓̋̆̿̓̔̕̚̕̚̚̚̕̚̚̕͘͘̚̕͜͠͝͝͠͝͝͝͝͠͝͝͠͝͝͠͝ͅͅͅ ̴̡̧̨̨̨̨̧̡̨̧̛̛̛̛̛̛̙͇̮͎̺̥̤̫̱̞̯̟̖͉͖͓̱͎͓͖͙̙̬̺͇̥̹͚̼̻̦̯̗͙̤͖̙̫͙̙̫̠̥̲͕̺͇͙̥͕̟̙̟̼͈̳͇͚̘̙̬̙̙̮̪̱̼̺͈̟͕͈͈̞̫̥͓͓̻͓̖̗̫̫̟̟̳͚̮̙͈̟̈͊̒͛̿̎͑̊̽͊̿̾͋̈́̔͂̌̽̔́̀̿̎͑͌̾̆̂̑̈́̀̆̋́̄́̄̐̽̑̒͂͊́̀̓̏͐͒̑͛̅̔̑̀͊̿̆̍̔̎̑̈́̈́̎͊͋̇̐̀͌̾̒̐͌̌̏̔̊̆̎̓̊̋͑́̉̿͐̑̂͌̔͑͗̀̀̅̎̓̓̓͆͑̊̂̀̍͒͐̀̋͂́̂͒̑́͒̃̇͂̔̿͑́̓̀̏̓͛̀͌̏̾̎̒͒̊̒̽̾̆̌͊͛̄͆͐̈́͂́̔̅̽͛̇̎̂́̈͋̇̈́́̀͊̏́̾͐̆̈͌̏̈́̅̿́͊́̆̇̈́̋̉͋̉͌̄̃̕̚̕̕̚͘͘͘̚̕̚̕̕͘̕͜͜͜͝͝͝͝͠͠͝͝͝͝͝ͅͅͅͅͅͅ ̶̡̨̨̡̛̛̛̬̻̥̠͉̲͈̟̳̮̥͙͕̺̭̝̙̥͙̻͎̼̅͛̂̒̆͂̒̓̏̍̑̾̀͐͑̋̋͊͑͗̾̈́̃͌̐͊̋͌̀͒͗͊͛͌͌͋̽͛̑̂͒̑̀̅͗͆͒́̉̋͊́̀̀̉̏͋̾̌̽̀̄̌̾̍̉̆̈́͑̓̈͗́̋̊̎̽̌͊̏͌͒̊͌̍͊̈́̍͒̈̿̈́̉͒͒̇̑̍̍̔̉̐̎̔̀͂̈̐̃̾̾̃͂̓̽͒̈̓̃̍́̅͒̇́̀̒͒͂̐͐͗̏̑̓̀͒̅͊̈́̀̀̚̚̕͘̚͘͘͘̚̕͝͝͠͝͝͝͝͝͝ͅͅm̶̧̢̧̧̢̡̢̨̢̧̨̢̨̨̨̡̛̛̙̱̻̝̲͓͓̰͈̱̤̳̭̗͓̘̪̪̖͉̩̲̦̠̠̦͕͉͉̜̩͓̮̬̣̼̫̬̜̹̭̣͚͙̝̪͇͕͇̘̱͚̞͕͈̬̗̲͔̭̩͔̯̻̥̪͍̣͕̳̣͖̰̘͈̯͇̼͔͖͈̯̹͍̘̝̞͚̪̻̳͕̤̲̥̯̥͙̱̝̭̠̪͚̟̟͍̮̳͙̙̠̦̪͍͙̖̱̝͙͇̣̘̖̻̭͎̜͖͚͕̻͖̺̘͉̠̣̫̻̯͓͉͈̦͇̼͖̗̬͕͖̬͙̝̋̈́̄̊̇́̀͌̈́͐̓̋̅͗̆̈̈̌̇͗̀̔̐̎̅͛͑̀̊̓̑͆͌̿̌͑͛͆̃̿͗̓̋̾̀̈̀̌̀̇͐̽̐̽̈̌̌̔̍͛̽̈́̄̀̓̒̍̈́͛̂̌̀͑͋̾͂̃̂̀̎̿̎̽̐̓̐͆̄̉̈̾̑̈̐̃̐͗̇̋̋̏̆̋͒͌̅̌͗̎͆̄͒̈́̄͌̂̔̉́̍͊̃̎̾̎̔̍͊̏̓̓̍̉̍̍́̏͛̌́͊͒͆̅̓͑́̔̇̄͒̐̎́̾̓̓͐̈́̅̓͆̌͗̽̈͗̅͋̄̊̌̂̅̑͊̓̒̀̾͐̅͂͒̇̅̇̎̿͛̇̏͊̈́̈́̇̀̽̓͆̌̾͐̄͒͆̓̿͛́̈́̂͆̓̈́̓͒̇͗̔̅͛̉̆͐̿̄̈̔́̐̊̽̐̏͘̕͘̚̚̕̚̕̕͘̕͘͘͘͘͜͜͜͜͜͝͝͠͝͝͝͠͝͝͝͠ͅͅͅ ̴̡̧̡̨̧̨̡̨̧̡̢̧̢̧̡̡̢̨̡̛̛̰̱̱͚̣̰̬̗̲͍͙̩̲̝̝̱͙̙͕͓͚͉͉͖͚̠͔̭̤̜̯̼̲̥̬̘̦̤̳̟̫̬͙͍̩̯̹̫͖̟͖͍̹̙̤͙̖̞̖͚̦̬͇̝̫̱̖͓̰̥̩͖̻̝͓̰̗̫̜̻̣͎̮͎͎̥̤̯̖͚̝̯̩̥͕̲̹͖̣͇̹̠̝͎̲̟͎̘̳̪͈̼͚̠̝̰̼͓̗̙̣͙̝̻͚̠̥͈͉̼̖͍̥͈͙̫̻͔̘̳̮͍̭̩͕̫̬̦̼̫̤̹͙͇͖̩̠̝̟̑̔͆̍̂̍́̀̔͌̄̇̉̌̂̋̂̈́̀̃͌́̎̿̋̾̈́̃̏͊̍̔̀͗̋͒̀͌͛̈́̀͑̅͆̓̾̀̒̃̈́̃̈́̓̄̐̋͛̃̾͆́͛̉̅͆̾̀̓̎̔̈́̒̏̍̄̓̓̈́͆̋̓̒̈́̊͆̒̄́̇̍̂́̍̐͐̓͐̓̉͊̍͒̑̅̄̍̑̈̈́͘̚͘̚̚̕̕͘͘͜͜͜͠͝͝͝͝͝͠͠͝͝ͅͅͅͅͅͅ ̶̨̧̧̡̡̨̡̧̢̧̨̢̢̧̧̧̨̛̣̮͎͕̱̺͕̟̭̫͈̤̬̮͕͙͙̟̖͇̺̥̞͚͙͓̥͉͉̘̪̺̞̙̭̭͉̯̘͉̫̬̯̹̙͎̯̟̣̜͓̰̩̣̲̬̠̦̙̹̯̳͔̠̤̣̣͖̹̜̮͇̜̭͕̺͕̗̟̣̘̱̭̜͙̫̜͕͚̝̺̙͔̣̤̻͓͍͍̖͖͔̤̭̳̙̫̱͉̠̺̼̥̫̥͕͓̻̯͇̩̮̤͕̝̹̻͉̳̘̪̭̞͔̥̤̝̗͈͇̻͚͎͕̟̮̺͕̟͕̱͙̭͚̙͚͕̟̞͕͕̞͎̥̥̞̹̙͇̓̌̍̍́̈́̎͆͑̿̿̇̒̎̇͊͋̏͂͌̑̌̾͛͊̀̈́̄͊̅̋͊̐̈́̇͊̔̑̃̓̽͋̎̒̈́̿̑̆̌͐̅̋̐͆̑̆͒̆̂̀̚̕̚̕̕͜͜͜͜ͅͅͅͅͅǫ̵̢̧̢̢̨̧̢̧̧̢̛̛̛̛̭̜͖͓̳̳͇͉͉̳̙̮͓͇̳͉̮͈͎͍̤̖̜̲̟̭̜̥̻̪̭̩̥̜̹̭͙̯̩͎̩̳̻̳͖̟̪͓͉̪͕̠͎̖̣̦̫͉̪̘͚͎̼̜̩̦̫͍͈̖̥͖̱̫̪̯̫̩̰̬͉̘̮̱̥͇̭̳̘͕͖͔̰͖̩̟͕̼̝̳̞̜̱̟̯̫̭̩͕͎̖̰̟̯͙̞̭̬̯̣͎̮̘̞̦̺͈̖͇͆͆͛̐́̆̆̾̄́͂̈̈́̆́̽̆̀̽̆͊́̑̍̓̃͛̂̓̀̋̀̅̿̿̅̿̉̈́̍̀̿̒̑̿͆́͊͊̄̈̈̐̏̆̉̓̍͗͊̆̓͑̽̓̓͐̏͋̆̈͗́̄͆̈̐͆͂͋̑̈̄̀͊́̈́̈̌͊̅́̀̉͊͂̈́̃͆̎͌̂͊̊̽͛̊͗̔͊̾̽̀̓̓̋͛̎̈́͛̔̔̽̈͆̆́͂͗̈́̄̄̈́͒̅͒̎̄͒̓̑̉́̿̓́̇̓͋̒͛̈́̄̍̃́́͗̈́̋͛͆͗͗̽̄̉̑̓͂̏̒̃̿͌̀̃͐̍͐̎̍̀̿͂̇̿͆͌̈́̒̎̇̿̓̇͗́̉̄͆͑̑́͂͗̅̍͌͊́̏͐͛̈́̿̃̃͋͛̍̃͒̂̈́̈͆̓̋̈́͒̇̃̈́̉́̅̿̿͛̇̏̍͂̓̚̕̚̚͘̕̕͘̚͘͘͘̚̕̚͘̚̕̚̕̚̚͘͜͝͝͝͠͝͠͠͝͝͝͠͝͝͠͝͝ͅͅͅͅ ̸̧̢̢̢̨̧̧̡̡̧̡̛̛̛̦̥͕̹̹̲̮̥̫̗͔͍̪̱̩͚͔̜̘̥͔͉͇̱̝̫͉͔̜̲̗̞͇͖̟̺͈͕̪̬̺̞̦̥̯͇̝̱̹̩͈͖͙͉̤̼̜̻̺͎̻͖̯̱̜̞͕͚̤͇̠̤̖͓̺̖͉͎̰̬̻̗̞̗͈͎̭̗̭̺̮̪̤̫̟̞̳̼̪̯̳̝̭̮̻͔̤̭̼̼̜͚̲̩̯͇̺̻̻̫͓̻̙̪͓̺̳̤̟̮̟͕̍̊̈́̎̍̾̾̃̆̏̐͐̂̈͂̾̽̅̈́̔̈́̓͑͛̉̈́̐̊͊̑̅́́͐̇̀̈̇̌̓͗̂̎̑͑̄͆́̃́̂̓̽̎͋̇̇͒̆͋̄́̋̄͆͂̃̀́͂̓͛̍̉̃͌͗͊̔͑̓̏̉͛̓͊̊̑̈́͂̄̍̉͆̄͑̐͌͌̎͐̉́̌̃͆̂̋͐̋̽̀́̂̅̈́̈́̋̿̿͐͆́̌̊͛͒̎́́̏͆̓̑̎̎̌͐̂̊̔̃̌̊̇̉̔̈̂̿͂̌̃͐͆̌̈́̒́̅́̂́̀̓̐̐́̍̾̂̉̀́̑̈́̔͂̿̈́͛͐̽̄̂͑́͐̋̾͂̀͒͌̓͂͋͊̿̓͊́͐̾̉̕̕̕͘͘̚̕͘̕͘̚͘͜͜͜͠͠͝͝͠͠͝͝͠͝͝͝͝͠͝͠ͅͅͅͅ ̵̧̥̰̥̫̹͖͓͎͕̬͎̖̞̱̬̥̣̦̣͉̫͈̳̞͖̖͙͈̦̜̰̘̯̰̦̻͇̪̣͎̘̰͚̲̟̆͌̃̇̀͑̉̕͜͝ͅͅų̸̡̧̢̨̡̨̧̢̨̢̢̢̨̢̢̢̧̨̡̢̧̢̧̧̤͚̮̱̼̠̜̠̬͇͚̩̲̰̙̭̹̣̱̜̭͓̥͉͚̻̣̟̜̞̫̣̩̗͈̖͈̙͍̦̤͕͚̮͚̻̝͖̗̤͚̭̥͈̞̙͕̯͎͉͈͙͉͙̘͓̞͈̞̖̼̼͇͉͚̼̹̩̲̠̟̲̪͕̦̻̯͙͈̱͈̹̼͈̰͉̣̹̲̠̻͓̘̳̫̟̙͈̹͍̭̦̩̳͔̞̮͓̤̺͍̠̹͙̥̟̥͚͕͙̯̲͓̥̞̩̮͔̦͖̥̱̯̲͉̖̣̖͍̬̻͚̩̠̝͓̠̝̮̭͖̦̦̍̆͌́̍̌̈̆̃͂̍̾̐̿̎̀̆̇͛͆̂̑̈́̑͑̉͊̽̔̏̎̏̌̈́̃̐̑͗͐͂̀͑̋͌̃͗͛̈́́̔̒̃͆́̍̀̓̋̀͐͊̈̄̽̅̔́̓̇̓̅̅́͋̐͂͌͂̎̓̽̐̎̆̇̃̄̋̾͐̈̽̔͂̎̓́́̐́͛̒̽̊͋̕͘̚̕͘̚̕̕̕̚͜͜͜͜͜͝͝͠͝͝͝ͅͅͅ ̴̧̢̧̡̢̢̧̢̢̢̧̧̡̡̨̧̨̢̛̛̛̛̛̫̻̻͎̲̜̮̤͓̞̣͕͎͉̩̭͖̹͕̗͚͕͎͓͍̺̟͚̠͎̻̦̫̺͓̣͉̯͍̜̗̻̪͈̬̦̦͚̟̳̜͖̲͉̰̹̻̙͔̼͖͇̟̗̱̤͕̳͍̩̙̙̦̲̺̙̮̠̤̩̘̳͍̫̟͙̳͓̩̤͕̣̥̘̫̖͖̝̥̮͎͙͙͇͓̰̖͖̞͖̩͖͚̖͍̟͙̙̹̘̜̯̥̺̜̲̭̠̗͇͚͉̺̪̈̆̓͊̓̍͑̈́͒̎̌͒͗̾̒̐̑̐͌̍̌͛͊͛͂͋́̌̆̊̒̎́̈́̊̈́̾́̿̎̽̐̑͛̌̂̋̅̀͑̓̂͐̐́̈̈́̆͗̀́̔̌͂͗̋̿̓͌̈́̇̌͊̉̊̀̉̾͒͐̔́́̈́͂̆͌̈́͑̆͊̇̌̑̎̉͋́̆̉́̑̆͗̌̿͆̔̊͂̓̆̈́̾͛͗̓̅̔̈͆͗͂̓͆̈́̂̈́͛͂̒̋̎̋͆͛̓́͛̉̂̌̌͆̓͌͌̑̓̽̈̀̇͌͊͗̓͒͒̓̍͂̒̏̂̐͐̆̃̀̈́̑̓̒͛͌̾̏̆́̒͌̿̎̍̓͐͛̏͊̌̀͌̊̏̿͋̔̎́͒̓͂͗̿̒̂̌̉͐̑̊͛̓͗̀͊͆̋̓̇̋̔̇̏̏̊̆͋̒̏̀͐̋͆͗̔̓͗̓̐̂͛̊̏́͂́̈́̅̏͌̓̅̃̆̕͘̕̕̚̕̕͘̕̕͘̚͘͘͘̚̚͘͘̕̚̕͜͜͜͜͝͝͝͝͝͝͝͠͠͝͠͝͝͠͝ͅͅͅ ̴̧̢̡̡̧̧̢̛̛̛̱̬̖͖̯̻͓͉̬̮͓͈͖̣͙͍̳̟̻̖̠̗̙̺̰̲̲̺͖͓̤̜̺̖̺͖͖̖̤̻̼̜̱̖̦͍̟̭̝̼͖̞̜͔͚̯̘͖͓̻͍̬͇̗̪̘̦̙̯̹̣̱̫̲͈̪͕͔͈̙̻̱̬̘͕̻͕̣̞̳̝̼̪̬̥͇͎͙͎̯̪̞̟͓̝̅̂̇͌͌͌̋͒̓̀̊̿̓͗̀́̈́͋́͒̓̀̒͆͂̀̈́̾̓̀̏̍͐̿͐͐̈̓͆̆͋̇̆͑͊̍̉̔̿̾̇͋͆̌̑͆̒̉̂̎̾̽͌̏̄̈̈͂̓̈̈̈́͂̂͌͐̌̆͑̀̒̈́̍͊̍̒̃͆̏͊̈́͋́̀̾̂͗̍̾̽̊͋͒̅͑͋̑͋̓̾̀̽͊̄̍̈́͒̎̈̽̂̉̄͂̾̒̂̽͗̿̄̂͐͂́́̆͑͒͆̊͋̔́̐̒͗̅́̓͑͋͌̈́̊̒̃̆͐͌̏̃̈́̇́͛̔̉͌̂͊̽̈́̏́͗̈̀̈́̄̋̏̋͐͆̑̈́͒̄̃̽͊̓̈́̀̋̓̈́͂̀̌͂̈́̈́̅̅̚̕̕̕̚̕̕͘̕͘̚̚̕͜͜͜͠͝͝͠͝͝͝͝͠͠͝͝͠͝͝ͅͅͅͅģ̵̡̡̢̧̢̧̡̛͔̫̲̺̟̜̫̱̭̫̬̼͕̼̻̮̼͈̲͈̭̺͉̞̠͇̠̖̖̱̰͈͙͇̣̹̝̮͇͕̞͍̮̰͕̰̯̥̟̬͓͎̮̹̣̖̒̐̓͋̒̽̂́͛̇̄̃̍̌̋͒̈͂̿̌̑͛̈́̑̈́̇̌̊̊̄̑̊́͂̌̎̒̈͌̓̏̿̈́̓̈́̃́̈͋̄́́̄̅͗̔̐̂͛́̊͑̈́͒̂͑̐̾̂̈́̂̎̃̋̓͑͒͊̕̕̚͘̚͘͘͜͜͝͝͝͠͠͝͝ͅͅ ̵̧̢̧̨̡̧̧̡̡̢̛̖͚̮̠̼͎̤̗̻̻̤̘̝̘̯̥̘̯͎̭͉̦̬̪͉̻̪̮̩͍̳̱̘̱̩̟͓̤̞͖̞̹̳̺̣͉̝̲͓̯͚͚̯͓̱̫̬̻̤̗̻͎͕̯̟̩̪̲͕̠̠̙̰͉̘̜̦̣͎̖̈́̏̇͐̈̍̊̿̽̀̅̓̃̈́́͂͆̆̐͌̃̑̄̇̅͋͋̏́̒̔̂̔̏͛͗̈́͑̅͆̅̎̽̎̀̑̐͊́̈́͂̔̈́̑͐̈̆͋̃͊͒̇͆̃̒̉̑̋̑̓͊́̅̀́͛̄͗̉̂̈́̌̀͆͌̌̈́̑̃͛̅͒̏͆̈́͆̅̒̾̅̀͋͂̾̾̓̑̒͂̀̓̈́̉́̏͐̐̀͑̀͋̐̂̽̾̃͋͌͗̾̍͒̿͂́̄̎́̉͌̔̒̊͗́̃̅̆̎́̐̎͛̏̃̓̈̽͑͒̀̂͆̈́̓͆̀͆̉̈̌̈́̌̉̾̀̾͗̍̀́͊̌͐̄̇̅͊̀͒͌͑̆̈̊͘̕̚͘͘͘͘͘͘̚͘͘͘̚͘̚̚̕̕͝͝͠͠͝͝͝͠͝͝͝͝ͅͅ ̸̨̢̢̨̢̧̨̢̡̢̧̢̧̡̢̢̨̧̧̛̛̛̛̛̛̛̲͚̫͇͖̱͉̞̦̹̺̝̗̳̟̪̺̲͇͙͍̙̹̬͓͉̮͖̦̬͕̥̫̳͍͉̱̫̬̥͚̘͙̭̠͚̮͉̘̫͎̩͔͖̗͍̥̠̤̪̩͕͇̠͚̗̼͎̼̻̘̜̤͈̯̗̙̺̯͚̫͍̣͍̹̹̰̜͈̣͙̤͇̟͍̙͙̺͉̳̟̙̻̥̼̤̲̞̤̮̞̞̥̜̜̹͈̞̯͎͇͔̮̭͓͙̱̱̫̜̠̞̭͕̼̙̭̟̠̫̱̪̜͍̠̼̪̦̬̫̼͙͓̜̥̟̱̪͕̰̱̣̘̝̬̟̫͙̣̫̻̼̖̬͕̬̣̗̬̭̟̪̠̙͓͍̐̄͑͑̊͆͋̈͋͑͒̄͂́̒̍̄͂̀̋̉̀̈̈̈̓̔͋̈́̓͗̾͒̀͐̆͌́̓͗̅̄̊̏͗͒̐̔̔̑̒̊̀́̅̽̊͒̽̂̈́̋̈̊̔̔̄̀̆͗̾́́̌̊͑̀̆̈́͛̈́̎̎̈́͒͑̃̓̽̌͂̽̍̀̅̈́͌͌̄͑̈́̒̈́͌̐͑͂̏͐͂͌̓͊̿̈́̾͛͊͊̄͒̓̈̽͋̀̂̃̋͌̉̽̎̍̓̅̌̀͌̂̓̓̎̌̏̈́́͂̓̔̑͋̏̎̑̎̔͗̈́͆̎͂͑͒̊́̌͌͊̓̂̉́̃̏͆̽̒̚͘͘̕̕̕͘̚̚̕̕͘͜͜͜͜͜͜͝͠͝͝͝͝͠͝͝͠ͅͅs̸̢̢̨̨̢̨̨̡̨̢̨̨̨̢̨̨̡̨̧̧̧̛̛̩̮̪̹̤̳̣͍̞͇̣͇͕̺̩͎̭͖͎̭̠͓̤̩̥̯̮͔̯̬͔͎̲̩̦̙̖͎̞̦̲̭̙̖̹̖͉͇̻̮̹̮̯̮̻̙̱̘̪̺͓͈̤̳̹̯̞̪̤̙͇̪̺̹̻̞̳͕̥̭͕̖̳̯̫̫̞̭̳̜̩͔̦̘̘̳͉͈̺̣̭͇̻̱̖͚̘̥̖̦̪̫͓̗͉̙̖̩̯̥̺̹̪͍͓̳̰͙͖̻̞͎̟̩͉͉̞̩̩͎̟͉̺̭͍͍̫͚͍̠͈̻̰̦̥̜͓̭͇̘̣̹͙̞͓͓̣̥͍͉̣̞͍͈͔͓͉̱̪̹̭̱͈̙͍̝̬̗͖̞̳͖̭̬͓̩̟̲͈̲̮̝̹̩̞̮̙̼̟͖̻͕̤̳͈̰̯̫̘͇̳̪͓̥̺̹͚̖͉̦̠̟̗͍͙͓̳̰̖͎͉̜̘̮̅̽̈́̈̀̋̍͋̈̓̂̂͂̎̂͑̒̓̋̏͆͊̐̈́̀͗̌̓̈́̾̀͂̀́͒͑̀͐͌̾̽̓̈́̽̌̐̃͒̔̒͛̋̂̒͘̕͘̕͘̚͜͜͜͜͜͠ͅͅͅͅͅͅͅͅͅ",
            "But im circumcised....",
            "wtf is this guy’s comment history",
            "Nice repasta",
            "ASUSsy baka",
            "I love this",
            "aSUS",
            "I’m safe…\n\nI’m way to insecure to show my foreskin…",
            "Imagine",
            "Yes finally.",
            "Fuck I have no foreskin to retract",
            "I saw this on the dutch copypasta subreddit",
            "Yall came to the hood of the reddit app"
        ]
    },
    {
        "post_id": "dl37qq",
        "author": "GamerMan197092",
        "title": "What is a black person",
        "url": "https://www.reddit.com/r/copypasta/comments/dl37qq/what_is_a_black_person/",
        "score": 14528,
        "num_comments": 1112,
        "created_utc": 1571676155.0,
        "selftext": "So I was just surfing the web looking for gay midget porn, when I came across this thing called “black people”. Apparently they have dark skin and love chicken. I am mortified. I will not accept anyone who is not a white person. Who made these black people? Who can I contact them and get them to stop? Are they considered people? We can’t stand for this anymore! The blacks have taken to much of out our economy! They took our jobs, our lifestyles, even our wives! I only have 3 wives left! And I don’t even fuck the other 2! Their just for cleaning and cooking! God I fucking hate America. \n\nEdit: Guys holy shit stop downvoting me it’s just my opinion \n\nEdit: Guys did you even read it? Stop telling me I’m racist when you clearly haven’t read the whole thing!\n\nEdit: Jesus fucking Christ you guys are retarded. How delusional are you people???\n\nEdit: Okay you people are fucking going to far. I’m NOT racist. I litteraly didn’t even say the n word once.",
        "permalink": "/r/copypasta/comments/dl37qq/what_is_a_black_person/",
        "comments": [
            "This is my favourite version of \"I need to talk to the CEO of diversity\"",
            "I'm gonna say NTA. A black guy took my wife and now my kids call him dad.",
            "So I was just surfing the web looking for gay midget porn, when I came across this thing called “black people”. Apparently they have dark skin and love chicken. I am mortified. I will not accept anyone who is not a white person. Who made these black people? Who can I contact them and get them to stop? Are they considered people? We can’t stand for this anymore! The blacks have taken to much of out our economy! They took our jobs, our lifestyles, even our wives! I only have 3 wives left! And I don’t even fuck the other 2! Their just for cleaning and cooking! God I fucking hate America. \n\nEdit: Guys holy shit stop downvoting me it’s just my opinion \n\nEdit: Guys did you even read it? Stop telling me I’m racist when you clearly haven’t read the whole thing!\n\nEdit: Jesus fucking Christ you guys are retarded. How delusional are you people???\n\nEdit: Okay you people are fucking going to far. I’m NOT racist. I litteraly didn’t even say the n word once.",
            "the edits made this shit 1000x better",
            "Así que estaba navegando en la web buscando porno gay enano, cuando me encontré con esta cosa llamada \"gente negra\".  Aparentemente tienen la piel oscura y les encanta el pollo.  Estoy mortificado  No aceptaré a nadie que no sea una persona blanca.  ¿Quién hizo a estos negros?  ¿A quién puedo contactar y hacer que se detengan?  ¿Se les considera personas?  ¡Ya no podemos soportar esto!  ¡Los negros han sacado gran parte de nuestra economía!  Se llevaron nuestros trabajos, nuestros estilos de vida, ¡incluso nuestras esposas!  ¡Solo me quedan 3 esposas!  ¡Y ni siquiera me follo a las otras 2!  ¡Solo   limpian y cocinan!  Dios, odio a Estados Unidos.\n\n Editar: Chicos, mierda, deja de votarme negstivo , es solo mi opinión\n\n Editar: Chicos, ¿Aunquesea lo leyeron?  ¡Deja de decirme que soy racista cuando claramente no han leído todo!\n\n Editar: Jesús jodido Cristo, ustedes son retrasados.  ¿Qué tan delirantes son ustedes?\n\n Editar: Ok, ustedes están yendo demasiado lejos.  No soy racista.  Literalmente ni siquiera dije la palabra n una vez.",
            "-sincerely\n\nThe ceo of racism",
            "Where did you find this? Lmfaooo",
            "NTA",
            "u/nwordcountbot u/elonmustardgas\n\nEdit: all these hoes flexxin on me for not saying the n-word shakin my smh\n\nEdit 2: This comment was a mistake. I've been getting notifs on it for almost 24 hours",
            "I can't believe you would post something this racist.\n\nThe proper term is \"munchkin person\", not \"midget\".",
            "So I was just suwfing the web wooking fow gay midget pown, when I came acwoss this thing cawwed “bwack peopwe”. Appawentwy they have dawk skin and wove chicken. I am mowtified. I wiww not accept anyone who is not a white pewson. Who made these bwack peopwe? Who can I contact them and get them to stop? Awe they considewed peopwe? We can’t stand fow this anymowe! The bwacks have taken to much of out ouw economy! They took ouw jobs, ouw wifestywes, even ouw wives! I onwy have 3 wives weft! And I don’t even fuck the othew 2! Theiw just fow cweaning and cooking! God I fucking hate Amewica. \n\nEdit: Guys howy shit stop downvoting me it’s just my opinion \n\nEdit: Guys did you even wead it? Stop tewwing me I’m wacist when you cweawwy haven’t wead the whowe thing!\n\nEdit: Jesus fucking Chwist you guys awe wetawded. How dewusionaw awe you peopwe???\n\nEdit: Okay you peopwe awe fucking going to faw. I’m NOT wacist. I wittewawy didn’t even say the n wowd once.",
            "ESH",
            "Black or person, choose one",
            "A black person is a ni\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n>!ce guy!<",
            "u/nwordcountbot u/gamerman197092",
            "I still don't understand what the hell is ever going on in this sub..... And I fucking love it.",
            "So I was just surfing the web looking for gay midget porn, when I came across this thing called “black people”. Apparently they have dark skin and love chicken. I am mortified. I will not accept anyone who is not a white person. Who made these black people? Who can I contact them and get them to stop? Are they considered people? We can’t stand for this anymore! The blacks have taken to much of out our economy! They took our jobs, our lifestyles, even our wives! I only have 3 wives left! And I don’t even fuck the other 2! Their just for cleaning and cooking! God I fucking hate America.",
            ">okay you people took it too far im not racist I didn’t even say the nword once!\n\n\nThis is gold right here.\n\n\nPeople on reddit are so sensitive to anything even mildly edgy, I swear everyone here is like 11 years old, it hurts to read.",
            "How can I be a racist?? I have 4 tires on my car and color tv",
            "u/nwordcountbot u/gallowboob",
            "First time someone from Japan meets a foreigner (2019, Colorized)",
            "[deleted]",
            "the sun made black people if you think about it",
            "u/nwordcountbot u/hawkjrh",
            "ESH",
            "u/raceguesserbot u/Ny07",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/GamerMan197092",
            "NTA",
            "Hell yeah bro, upvote sent",
            "u/nwordcountbot u/drug_enduced_coma",
            "U/nwordcountbot u/gamerman197092",
            "NTA",
            "u/emojihuman",
            "NTA",
            "One of the best and undoubtedly  successful attempts for maximum DVs yet.\n Well played sir. \n\n\"Gay midget porn\" was a solid starter.",
            "Nigga nigger",
            "oh shit, so this is what leftists see whenever they read text on the internet",
            "NTA blacks took my wyfe",
            "u/nwordcountbot u/CummyBot2000",
            "[deleted]",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordbot u/gamerman197092",
            "u/raceguesserbot u/yeahnoibet",
            "Lmao",
            "u/raceguesserbot u/ubicuckedme",
            "u/nwordcountbot u/Pew_Pew_Nic",
            "[deleted]",
            "u/raceguesserbot u/cummybot2000",
            "listen mate if u wanna keep trolling me thats fine but im tired of being internet bullied honestly. in school im very popular and have very good grades which is not something many people can say. my parents are divorced but that doesnt matter. just let me be part of this community... ok?",
            "u/nwordcountbot",
            "u/nwordcountbot u/gamerman197092",
            "[deleted]",
            "[deleted]",
            "u/nwordcountbot u/CummyBot2000",
            "u/nwordcountbot u/sophisticatedmango",
            "u/nwordcountbot u/GamerMan197092",
            "Should add another edit \"Thanks for the gold kind stranger!\" could go in between the others or at the end, I'm not sure which would be better.",
            "I'm offensive and I find this black",
            "[deleted]",
            "[deleted]",
            "Can someone n-word bot me? I don’t know if I’m pure or not",
            "[deleted]",
            "u/nwordcountbot u/MexicanWizard69",
            "u/nwordcountbot u/nutnugget007",
            "Too*",
            "u/nwordcountbot u/vaginafishsmell",
            "u/nwordcountbot u/BajaBlast27",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_just_a_pop_tart] [Vhhfddf](https://www.reddit.com/r/u_Just_A_Pop_Tart/comments/dl7qjy/vhhfddf/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/pancakerealization",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/GamerMan197092",
            "Link to the OG?",
            "u/nwordcountbot u/GamerMan197092",
            "[deleted]",
            "[removed]",
            "u/nwordcountbot u/theactualrealwoody",
            "u/nwordcountbot u/rhovanind",
            "u/nwordcountbot",
            "u/nwordcountbot u/malpica69",
            "u/nwordcountbot u/awellorganizedpantry",
            "[deleted]",
            "u/nwordcountbot u/Gamingcollin",
            "Europeans discovering Africa (circa i don't have any fucking clue)",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/CummyBot2000",
            "u/nwordcountbot u/thottinandplottin420",
            "Holy shit this post is getting 45 comments every 10 minutes",
            "Hi, I’m from r/all, tf is this",
            "[deleted]",
            "Everyone coming from r/all: Please be aware of the comments. I just want to make sure you don’t run into any colored people",
            "u/nwordcountbot u/GamerMan197092",
            "I just listened to Sam Harris's newest podcast...and this is actually very fitting to part of their discussion.",
            "u/nwordcountbot u/Maxskov",
            "u/nwordcountbot u/GamerMan197092",
            "American?",
            "u/nwordcountbot u/tarfortinbor",
            "u/nwordcountbot u/GamerMan197092",
            "[deleted]",
            "u/nwordcountbot u/MajorasMoon",
            "u/nwordcountbot u/WhooptyWoopNiggaWhat",
            "[deleted]",
            "u/nwordcountbot u/Mr_Moscow",
            "u/nwordcountbot u/gaprats",
            "u/nwordcountbot \n\nu/GamerMan197092",
            "y e s",
            "u/nwordcountbot u/adminsgetcancer",
            "This is what “Gamers” sound like when a video game adds a minority character",
            "Suck my dick",
            "u/nwordcountbot u/nwordcountbot",
            "[deleted]",
            "Yall just feeding the troll his cookies",
            "Op complaining about black people but he clearly never encountered the worst of all and they are called \"Niggers\"! But be carefull!!  You can't say that N word or you'll be cursed and transformed into one little nigga at midnight. Good Luck out there friend, the world is a colorfull place.",
            "You don't Say that you are racist, but actually you are\n(Apologise For my Bad english)\n\nEDIT: This post Is obviously a troll 😂",
            "u/nwordcountbot u/bradvenderman",
            "u/nwordcountbot u/Super_Waxy",
            "U/nwordcountbot u/919Hybrid",
            "YTA",
            "u/nwordcountbot u/Not_Zuriel",
            "You should all kill yourselves. But you're too much of a pussy to do it",
            "u/nwordcountbot u/Whitecheddar134",
            "u/nwordcountbot u/whitecheddar134",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/TrussedCrown",
            "u/nwordcountbot u/my_pants_be_on_fire",
            "[deleted]",
            "u/nwordcountbot u/Endery_minecraft",
            "[deleted]",
            "u/nwordcountbot u/killbunny38",
            "This is literally TRASH. Delete yourself from the internet. Then delete your personality and get a whole new one",
            "u/nwordcountbot u/GamerMan197092",
            "...........thats all u get",
            "matteric27 u/nwordcountbot",
            "Matteric27/nwordcountbot",
            "u/nwordcountbot u/soulthemojo",
            "u/nwordcountbot u/graeme296",
            "u/nwordcountbot",
            "I just need to be sure I’m not racist u/nwordcountbot u/De_Umbra",
            "u/nwordcountbot u/GamerMan197092",
            "I don’t get it? What’s the point of this post, why did it get so many upvotes?",
            "u/nwordcountbot u/Kirifrizimon",
            "u/nwordcountbot u/TedddyLopez",
            "Is this joke sorry if I seem stupid",
            "Lol i was hating how dumb this post is. Like a 12 year old trying to be edgy however the edits really redeemed it.",
            "Everyones just r/whoooosh",
            "[deleted]",
            "Funny",
            "u/nwordcountbot u/iamapersonmf",
            "We finally found the CEO of racism",
            "[deleted]",
            "Funny thing I realised lately after COUNTLESS videos of black people calling others \"nigga\"... Nigga (which is totally okay to say because there is no \"r\") is used in a way that describes a certain character of person, that correlates exactly to what people mean when saying the \"n\" word..  So it basically works out for the \"racists\"...",
            "u/nwordcountbot u/nwordcountbot",
            "You hate black people because of who they are, not because of their skin colour, did I get it right?\n\nBut you said you cannot stand not white. I don't believe you.\n\nP.s. or this whole post is some sort of sarcasm that i didn't understand",
            "[deleted]",
            "U/nwordcountbot u/heroorhooligan",
            "People really r/atetheonion",
            "u/nwordcountbot u/gamerman197092",
            "Edit: thanks for the gold kind redditor",
            "The first sentence alone made me lose it\nBest opening to a reddit post 2019",
            "This is art",
            "Founders Brewing be like..",
            "NTA",
            "I demand to know the source",
            "u/nwordcountbot u/XxSans_Waifu_69xX",
            "u/nwordcountbot u/damiandarko2",
            "u/nwordcountbot u/thebigv2",
            "黒人",
            "What the fuck did I just read?",
            "Im going top say the N-Word",
            "Nigger word - there I said it for you.",
            "u/nwordcountbot u/Aqua_Davie",
            "u/nwordcountbot u/0arida0",
            "u/nwordcountbot u/AzraelSaint",
            "u/nwordcountbot u/herculysses",
            "u/nwordcountbot u/stevebuscemiwemi",
            "u/nwordcountbot u/slim_shady1441",
            "u/nwordcountbot u/slim_shady1441",
            "You're active on r/pyrocynical, how do you feel about Stomedy?",
            "u/nwordcountbot u/fungi0528",
            "[deleted]",
            "Nigg",
            "lol this escalated quickly...",
            "This is satire, right?\n\n...Right?\n\n\n\nWas low key giggling at how ridiculous this whole post sounded 😂",
            "What the fuck is this shit ?",
            "Lol",
            "Nigga cheese",
            "Are we all gonna just gloss over the fact that he was looking up gay midget porn?...",
            "That's an epic gamer moment",
            "Reported you demon spawn may you die of cancer.",
            "u/nwordcountbot u/YunggSoulja",
            "> Apparently they have dark skin and love chicken.\n\nYou forgot watermelons and Kool-aid\n\n\n>They took our jobs\n\nIt's jerbs, and that's because you were bad at your jerb not because they had more melanin.",
            "This is like a 4chan post on reddit.\nThere is no fun to be had here, only social justice!\nI liked this post if it makes a difference.",
            "U/nwordcountbot u/kotythekid1",
            "u/nwordcountbot u/hollowornstein",
            "u/nwordcountbot u/GamerMan197092",
            "XD",
            "u/nwordcountbot u/GamerMan197092",
            "u/nwordcountbot u/Humboldt_Servant",
            "u/nwordcountbot u/ChillySummerMist",
            "u/nwordcountbot u/GamerMan197092",
            "Ok buddy boy that is totally racist. Sorry no. THAT IS THE ENTIRE GODDAMN DEFINITION OF RACIST!!! You say that black people should just stop! Are you an actual brainlet I understand that you don’t want people to downvote you but that’s just your opinion oh wait you were also showing your opinion. “Oh no some people don’t have the same perception as me about a topic that you clearly are new to. I highly doubt that you haven’t seen a black person in your entire life. Also the we can’t stand for it anymore. Let me ask you one question. What are they doing wrong are they hurting your poor delicate eyes, I highly doubt it you stupid turd boat. And ok switching gears why just why were you looking up gay midget porn apparently you are gay and that is fine with me. But I am going to have to use this to my advantage. Ok riddle me this what if someone came up to you and yelled at you for being gay would you enjoy that or receive praise from that. First of all being gay is your choice but the African American community cannot choose what there skin color is going to be when there born you stupid immature little piece of shit and grow a pair of nuts to handle the fact that black people can are and should be a part of your lives you f$&@ing brainlet.",
            "\" Okay you people are fucking going to far. I’m NOT racist. I literally didn’t even say the n word once. \"\n\nJust because you don't say the N-word, doesn't mean you aren't being racist, being racist is the fact that you're putting another race down from generalizing, or even just because they aren't like you, even if you meant this to be a \"joke,\" it is VERY unappreciated by me even though I'm white and \"shouldn't care about what people say,\" but fuck that, I live by my own rules, and I care about what other people say. I do have one question, are you a Trump supporter, if you are, and if this post is serious, then I wouldn't be surprised\n\n&#x200B;\n\nAlso, \"*you people*?\"",
            "u/nwordcountbot u/nwordcountbot",
            "u/nwordcountbot u/Lord_of_Virgins",
            "/u/nwordcountbot /u/brownrebel",
            "I agree, you should run for president and spread your wise ideas to the world. (other than africa)",
            "NTA",
            "[deleted]"
        ]
    },
    {
        "post_id": "kmwq3h",
        "author": "HashtagLootGet",
        "title": "My (24F) Boyfriend (27M) will not stop calling his cum \"Greggnog\" During Christmas time",
        "url": "https://www.reddit.com/r/copypasta/comments/kmwq3h/my_24f_boyfriend_27m_will_not_stop_calling_his/",
        "score": 14432,
        "num_comments": 398,
        "created_utc": 1609309246.0,
        "selftext": "First off: I am not joking. I wish I was joking.\n\nI've been with my wonderful boyfriend Greg for over 4 years now, and this Christmas was our third spent together. He's so much fun to be around, handsome, charming, and our sex life is great. Except for one small problem.\n\nEvery year now starting in December he starts referring to his cum as \"Greggnog.\" When I first heard him say this, it was in the context of a joke, so I laughed, and then I forgot about it. A few days after this, we're exchanging some spicy texts before he gets home from work he says to me, in all seriousness, \"I can't wait to pour Greggnog all over your face.\" I could not believe he just said that to me, but I didn't know what else to do at the time but go along with it. \n\nFast forward to this December. This phrase re-enters his vocabulary at the same time every year. It makes me cringe beyond belief, but until this year he used it sparingly enough for me to just be able to laugh and say \"shut the fuck up.\" \n\nI'm sure that 2020 has done at least some irreparable psychic damage to all people, but unfortunately, for my boyfriend, this has manifested in the form of him referring to his cum as \"Greggnog\" non-stop. This month he has been using the term almost exclusively, in all contexts, and it is driving me batshit insane. I sat him down to talk last week, and I asked him very clearly and directly to stop. At the time, he said he would, and it did slow down for a few days, but it is now four days after Christmas and he's back at it again with no end in sight.\n\nHe absolutely means the world to me, and I saw myself spending the rest of my life with him, but I have serious doubts now whether or not I can if every Christmas is going to be like this. So please, reddit, what do I do to make this stop for good?",
        "permalink": "/r/copypasta/comments/kmwq3h/my_24f_boyfriend_27m_will_not_stop_calling_his/",
        "comments": [
            "Greggnog",
            "gregnant",
            "First of all: I'm not kidding. I wish it was a joke.\n\nI've been with my best friend Greg for over four years, but this is the third time I'm seeing him at Christmas. She was very happy together, beautiful and attractive, and our sex life was amazing. Except for one small problem.\n\nEvery December he begins to call his money \"Garganog.\" I've heard him say it before, but it was just a joke, he laughed and forgot. A few days before we got back to work we had to give and receive heartbreaking comments. He said honestly. \"I want to pour water on Greg Nave's face,\" - I do not believe what he told me, but I do not know what to do at that time.\n\nThe fast pace continued in December this year. This phrase is repeated every year at the same time. I'm very upset, but until this year he said \"stop\" using only my innocent pictures.\n\nI'm sure 2020 will be a bad year for everyone, but unfortunately for my friend it does not affect his conversation about Garganog. The content presented this month drives me crazy at almost every event. Last week I sat down and talked to him and asked him to go clear and honest. At the time he said he was a little late, but would make a very unsuccessful comeback 4 days after Christmas.\n\nHe tells me a lot about the fact that I saw him and spent the rest of my life, but I'm really afraid that every Christmas will be like my question. So Reddit, how are you going to do that forever?",
            "YTA His Greggnog his rules",
            "He's NTA, embrace the Greggnog",
            "Dairy of a Wimpy Kid: Married Life",
            "Imagine getting into a fight with your spouse because of the way they refer to their cum",
            "The  exaggerated gregnog of a black teen",
            "🚩 Here op you dropped this",
            "Marry him, he's hilarious.",
            "Imagine if her boyfriend is called Steve",
            "anal",
            "Just swallow the bitter reality.\n\nI mean the greggnog.",
            "Fiwst off: I am not joking. I wish I was joking.\n\nI've been with my wondewfuw boyfwiend Gweg fow ovew 4 yeaws now, and this Chwistmas was ouw thiwd spent togethew. He's so much fun to be awound, handsome, chawming, and ouw sex wife is gweat. Except fow one smaww pwobwem.\n\nEvewy yeaw now stawting in Decembew he stawts wefewwing to his cum as \"Gweggnog.\" When I fiwst heawd him say this, it was in the context of a joke, so I waughed, and then I fowgot about it. A few days aftew this, we'we exchanging some spicy texts befowe he gets home fwom wowk he says to me, in aww sewiousness, \"I can't wait to pouw Gweggnog aww ovew youw face.\" I couwd not bewieve he just said that to me, but I didn't know what ewse to do at the time but go awong with it. \n\nFast fowwawd to this Decembew. This phwase we-entews his vocabuwawy at the same time evewy yeaw. It makes me cwinge beyond bewief, but untiw this yeaw he used it spawingwy enough fow me to just be abwe to waugh and say \"shut the fuck up.\" \n\nI'm suwe that 2020 has done at weast some iwwepawabwe psychic damage to aww peopwe, but unfowtunatewy, fow my boyfwiend, this has manifested in the fowm of him wefewwing to his cum as \"Gweggnog\" non-stop. This month he has been using the tewm awmost excwusivewy, in aww contexts, and it is dwiving me batshit insane. I sat him down to tawk wast week, and I asked him vewy cweawwy and diwectwy to stop. At the time, he said he wouwd, and it did swow down fow a few days, but it is now fouw days aftew Chwistmas and he's back at it again with no end in sight.\n\nHe absowutewy means the wowwd to me, and I saw mysewf spending the west of my wife with him, but I have sewious doubts now whethew ow not I can if evewy Chwistmas is going to be wike this. So pwease, weddit, what do I do to make this stop fow good?",
            "Aye where's the bot for mobile users",
            "First 🥇 off 📴: I 👁 am not joking 😂🤪. I 👁 wish 🙏 I 👁 was joking 😁🦋💖.   \n  \nI've 🙋 been with my wonderful 🌈🌟😋 boyfriend 👬 Greg 👨 for over 🔁 4 💦 years 🕐📅 now, and this Christmas 🎄 was our third 🥉 spent 😵 together 👫👷🏿. He's 👨 so much 🔥 fun 😂 to be around 🧱🎶🎵, handsome 🥰, charming 😡, and our sex 🍆 life 💓 is great 👍. Except 😮 for one 1️⃣ small 👌 problem 😊.   \n  \nEvery ☝ year 📅 now starting 🔘 in December ❄ he 👥 starts 🆕 referring 😒 to his 💦 cum 💦 as \"Greggnog.\" When 🍑 I 👁 first 🥇 heard 😮👂🏼 him 👴 say 💬 this, it was in the context 🔎 of a joke 😂, so I 👥 laughed 😂, and then I 👁 forgot 🤧😳 about 💦 it. A few days 📆 after 2️⃣ this, we're exchanging 🤝 some spicy 🌶🔥 texts 📲⌨ before ⬅ he 👨 gets 🉐 home 🏠 from work 🏢 he 👥 says 🗣 to me, in all 👮‍♂️🧕💯 seriousness 😐, \"I 👥 can't 🚫 wait 🚏 to pour ☔👴💤 Greggnog all 🕝💯🕔 over 😳🙊💦 your ♥👈 face 😀.\" I 👁 could not believe 🌈 he 👨 just said 💬 that to me, but 🍑 I 👁 didn't know 🤔 what else 😩 to do at the time 🕐 but 🍑 go 🏃🏽 along 🕺💃 with it.   \n  \nFast 🚄⚡ forward ⏩ to this December 🎅. This phrase ⬅ re-enters his 💦 vocabulary 😫💦 at the same time ⏰ every ☝ year 📅. It makes 🖕 me cringe 😳 beyond 👉 belief 🙏, but 🍑 until this year 🗓 he 👨 used 🎶 it sparingly enough 💦 for me to just be able 💪 to laugh 😂 and say 🗣 \"shut 😷 the fuck 🖕🏻 up ☝.\"   \n  \nI'm 👌 sure 💯☑ that 2020 🤡 has done ✅ at least 💯 some irreparable psychic 🧠 damage 💥 to all 💯 people 👩‍🍳👨🏽‍🔧💃, but 🍑 unfortunately 😯, for my boyfriend 👬, this has manifested in the form ➡⬅ of him 👴 referring 😒 to his 👋 cum 💦 as \"Greggnog\" non-stop 😍. This month 📆 he 👥 has been using 👨🏻 the term 📄 almost 💸 exclusively 💂, in all 💯 contexts 🔎, and it is driving 👊 me batshit insane 😜. I 👁 sat 💺 him 👴 down ⬇ to talk 🗣 last ♿ week 📅, and I 💰👁 asked ❓ him 👴 very 🏽✅ clearly 😋😉 and directly 👁👀 to stop 🚫. At the time 🕠🕐🕕, he 👥 said 🗣 he 👨 would, and it did slow 🐌 down ⬇ for a few days 🌞, but ✋🍑🌸 it is now four 👨 days 📆 after ⏳👀 Christmas 🎅 and he's 👨 back 🔙 at it again 😬 with no 🚫 end 🔚 in sight 👀🚫.   \n  \nHe 👥 absolutely 🙀 means 😏 the world 🌎 to me, and I 👁 saw 👀👉 myself spending 😵 the rest 😪 of my life 💓 with him 👴, but 🍑 I 👁 have serious 😐 doubts ❓ now whether 🌩🌧 or not I 👥 can if every ☝ Christmas 🎄🎅🤶 is going 🏃 to be like 💖 this. So please 🙏, reddit 👽, what do I 👁 do to make 💘 this stop ✋ for good 👌😜?",
            "YTA, his cum his rules.",
            "千丨尺丂ㄒ ㄖ千千: 丨 卂爪 几ㄖㄒ ﾌㄖҜ丨几Ꮆ. 丨 山丨丂卄 丨 山卂丂 ﾌㄖҜ丨几Ꮆ.\n\n丨'ᐯ乇 乃乇乇几 山丨ㄒ卄 爪ㄚ 山ㄖ几ᗪ乇尺千ㄩㄥ 乃ㄖㄚ千尺丨乇几ᗪ Ꮆ尺乇Ꮆ 千ㄖ尺 ㄖᐯ乇尺 4 ㄚ乇卂尺丂 几ㄖ山, 卂几ᗪ ㄒ卄丨丂 匚卄尺丨丂ㄒ爪卂丂 山卂丂 ㄖㄩ尺 ㄒ卄丨尺ᗪ 丂卩乇几ㄒ ㄒㄖᎶ乇ㄒ卄乇尺. 卄乇'丂 丂ㄖ 爪ㄩ匚卄 千ㄩ几 ㄒㄖ 乃乇 卂尺ㄖㄩ几ᗪ, 卄卂几ᗪ丂ㄖ爪乇, 匚卄卂尺爪丨几Ꮆ, 卂几ᗪ ㄖㄩ尺 丂乇乂 ㄥ丨千乇 丨丂 Ꮆ尺乇卂ㄒ. 乇乂匚乇卩ㄒ 千ㄖ尺 ㄖ几乇 丂爪卂ㄥㄥ 卩尺ㄖ乃ㄥ乇爪.\n\n乇ᐯ乇尺ㄚ ㄚ乇卂尺 几ㄖ山 丂ㄒ卂尺ㄒ丨几Ꮆ 丨几 ᗪ乇匚乇爪乃乇尺 卄乇 丂ㄒ卂尺ㄒ丂 尺乇千乇尺尺丨几Ꮆ ㄒㄖ 卄丨丂 匚ㄩ爪 卂丂 \"Ꮆ尺乇ᎶᎶ几ㄖᎶ.\" 山卄乇几 丨 千丨尺丂ㄒ 卄乇卂尺ᗪ 卄丨爪 丂卂ㄚ ㄒ卄丨丂, 丨ㄒ 山卂丂 丨几 ㄒ卄乇 匚ㄖ几ㄒ乇乂ㄒ ㄖ千 卂 ﾌㄖҜ乇, 丂ㄖ 丨 ㄥ卂ㄩᎶ卄乇ᗪ, 卂几ᗪ ㄒ卄乇几 丨 千ㄖ尺Ꮆㄖㄒ 卂乃ㄖㄩㄒ 丨ㄒ. 卂 千乇山 ᗪ卂ㄚ丂 卂千ㄒ乇尺 ㄒ卄丨丂, 山乇'尺乇 乇乂匚卄卂几Ꮆ丨几Ꮆ 丂ㄖ爪乇 丂卩丨匚ㄚ ㄒ乇乂ㄒ丂 乃乇千ㄖ尺乇 卄乇 Ꮆ乇ㄒ丂 卄ㄖ爪乇 千尺ㄖ爪 山ㄖ尺Ҝ 卄乇 丂卂ㄚ丂 ㄒㄖ 爪乇, 丨几 卂ㄥㄥ 丂乇尺丨ㄖㄩ丂几乇丂丂, \"丨 匚卂几'ㄒ 山卂丨ㄒ ㄒㄖ 卩ㄖㄩ尺 Ꮆ尺乇ᎶᎶ几ㄖᎶ 卂ㄥㄥ ㄖᐯ乇尺 ㄚㄖㄩ尺 千卂匚乇.\" 丨 匚ㄖㄩㄥᗪ 几ㄖㄒ 乃乇ㄥ丨乇ᐯ乇 卄乇 ﾌㄩ丂ㄒ 丂卂丨ᗪ ㄒ卄卂ㄒ ㄒㄖ 爪乇, 乃ㄩㄒ 丨 ᗪ丨ᗪ几'ㄒ Ҝ几ㄖ山 山卄卂ㄒ 乇ㄥ丂乇 ㄒㄖ ᗪㄖ 卂ㄒ ㄒ卄乇 ㄒ丨爪乇 乃ㄩㄒ Ꮆㄖ 卂ㄥㄖ几Ꮆ 山丨ㄒ卄 丨ㄒ. \n\n千卂丂ㄒ 千ㄖ尺山卂尺ᗪ ㄒㄖ ㄒ卄丨丂 ᗪ乇匚乇爪乃乇尺. ㄒ卄丨丂 卩卄尺卂丂乇 尺乇-乇几ㄒ乇尺丂 卄丨丂 ᐯㄖ匚卂乃ㄩㄥ卂尺ㄚ 卂ㄒ ㄒ卄乇 丂卂爪乇 ㄒ丨爪乇 乇ᐯ乇尺ㄚ ㄚ乇卂尺. 丨ㄒ 爪卂Ҝ乇丂 爪乇 匚尺丨几Ꮆ乇 乃乇ㄚㄖ几ᗪ 乃乇ㄥ丨乇千, 乃ㄩㄒ ㄩ几ㄒ丨ㄥ ㄒ卄丨丂 ㄚ乇卂尺 卄乇 ㄩ丂乇ᗪ 丨ㄒ 丂卩卂尺丨几Ꮆㄥㄚ 乇几ㄖㄩᎶ卄 千ㄖ尺 爪乇 ㄒㄖ ﾌㄩ丂ㄒ 乃乇 卂乃ㄥ乇 ㄒㄖ ㄥ卂ㄩᎶ卄 卂几ᗪ 丂卂ㄚ \"丂卄ㄩㄒ ㄒ卄乇 千ㄩ匚Ҝ ㄩ卩.\" \n\n丨'爪 丂ㄩ尺乇 ㄒ卄卂ㄒ 2020 卄卂丂 ᗪㄖ几乇 卂ㄒ ㄥ乇卂丂ㄒ 丂ㄖ爪乇 丨尺尺乇卩卂尺卂乃ㄥ乇 卩丂ㄚ匚卄丨匚 ᗪ卂爪卂Ꮆ乇 ㄒㄖ 卂ㄥㄥ 卩乇ㄖ卩ㄥ乇, 乃ㄩㄒ ㄩ几千ㄖ尺ㄒㄩ几卂ㄒ乇ㄥㄚ, 千ㄖ尺 爪ㄚ 乃ㄖㄚ千尺丨乇几ᗪ, ㄒ卄丨丂 卄卂丂 爪卂几丨千乇丂ㄒ乇ᗪ 丨几 ㄒ卄乇 千ㄖ尺爪 ㄖ千 卄丨爪 尺乇千乇尺尺丨几Ꮆ ㄒㄖ 卄丨丂 匚ㄩ爪 卂丂 \"Ꮆ尺乇ᎶᎶ几ㄖᎶ\" 几ㄖ几-丂ㄒㄖ卩. ㄒ卄丨丂 爪ㄖ几ㄒ卄 卄乇 卄卂丂 乃乇乇几 ㄩ丂丨几Ꮆ ㄒ卄乇 ㄒ乇尺爪 卂ㄥ爪ㄖ丂ㄒ 乇乂匚ㄥㄩ丂丨ᐯ乇ㄥㄚ, 丨几 卂ㄥㄥ 匚ㄖ几ㄒ乇乂ㄒ丂, 卂几ᗪ 丨ㄒ 丨丂 ᗪ尺丨ᐯ丨几Ꮆ 爪乇 乃卂ㄒ丂卄丨ㄒ 丨几丂卂几乇. 丨 丂卂ㄒ 卄丨爪 ᗪㄖ山几 ㄒㄖ ㄒ卂ㄥҜ ㄥ卂丂ㄒ 山乇乇Ҝ, 卂几ᗪ 丨 卂丂Ҝ乇ᗪ 卄丨爪 ᐯ乇尺ㄚ 匚ㄥ乇卂尺ㄥㄚ 卂几ᗪ ᗪ丨尺乇匚ㄒㄥㄚ ㄒㄖ 丂ㄒㄖ卩. 卂ㄒ ㄒ卄乇 ㄒ丨爪乇, 卄乇 丂卂丨ᗪ 卄乇 山ㄖㄩㄥᗪ, 卂几ᗪ 丨ㄒ ᗪ丨ᗪ 丂ㄥㄖ山 ᗪㄖ山几 千ㄖ尺 卂 千乇山 ᗪ卂ㄚ丂, 乃ㄩㄒ 丨ㄒ 丨丂 几ㄖ山 千ㄖㄩ尺 ᗪ卂ㄚ丂 卂千ㄒ乇尺 匚卄尺丨丂ㄒ爪卂丂 卂几ᗪ 卄乇'丂 乃卂匚Ҝ 卂ㄒ 丨ㄒ 卂Ꮆ卂丨几 山丨ㄒ卄 几ㄖ 乇几ᗪ 丨几 丂丨Ꮆ卄ㄒ.\n\n卄乇 卂乃丂ㄖㄥㄩㄒ乇ㄥㄚ 爪乇卂几丂 ㄒ卄乇 山ㄖ尺ㄥᗪ ㄒㄖ 爪乇, 卂几ᗪ 丨 丂卂山 爪ㄚ丂乇ㄥ千 丂卩乇几ᗪ丨几Ꮆ ㄒ卄乇 尺乇丂ㄒ ㄖ千 爪ㄚ ㄥ丨千乇 山丨ㄒ卄 卄丨爪, 乃ㄩㄒ 丨 卄卂ᐯ乇 丂乇尺丨ㄖㄩ丂 ᗪㄖㄩ乃ㄒ丂 几ㄖ山 山卄乇ㄒ卄乇尺 ㄖ尺 几ㄖㄒ 丨 匚卂几 丨千 乇ᐯ乇尺ㄚ 匚卄尺丨丂ㄒ爪卂丂 丨丂 Ꮆㄖ丨几Ꮆ ㄒㄖ 乃乇 ㄥ丨Ҝ乇 ㄒ卄丨丂. 丂ㄖ 卩ㄥ乇卂丂乇, 尺乇ᗪᗪ丨ㄒ, 山卄卂ㄒ ᗪㄖ 丨 ᗪㄖ ㄒㄖ 爪卂Ҝ乇 ㄒ卄丨丂 丂ㄒㄖ卩 千ㄖ尺 Ꮆㄖㄖᗪ?",
            "Same energy as [this. ](https://i.imgur.com/bNRGeow.jpg)",
            "Greg heffley naming his cum be like",
            "I didn’t notice that this was r/copypasta and thought that this was actually real",
            "Consume the Greggnog chalice",
            "Gargling gregnog",
            "Update: Greg has been neutered",
            "YTA his cum his rules",
            "Would you prefer pregnog instead?",
            "His greggnog comes from his grick and gregsticles",
            "What is this from? I wanna see the original post",
            "u/gregnog",
            "CONSUME THE GREGGNOG CHALICE",
            "Fucking hell I thought I was the first to repost this!",
            " \n\nFirst off: I am not joking. I wish I was joking.\n\nI've  been with my wonderful boyfriend Greg for over 4 years now, and this  Christmas was our third spent together. He's so much fun to be around,  handsome, charming, and our sex life is great. Except for one small  problem.\n\nEvery year now starting  in December he starts referring to his cum as \"Greggnog.\" When I first  heard him say this, it was in the context of a joke, so I laughed, and  then I forgot about it. A few days after this, we're exchanging some  spicy texts before he gets home from work he says to me, in all  seriousness, \"I can't wait to pour Greggnog all over your face.\" I could  not believe he just said that to me, but I didn't know what else to do  at the time but go along with it.\n\nFast  forward to this December. This phrase re-enters his vocabulary at the  same time every year. It makes me cringe beyond belief, but until this  year he used it sparingly enough for me to just be able to laugh and say  \"shut the fuck up.\"\n\nI'm sure that  2020 has done at least some irreparable psychic damage to all people,  but unfortunately, for my boyfriend, this has manifested in the form of  him referring to his cum as \"Greggnog\" non-stop. This month he has been  using the term almost exclusively, in all contexts, and it is driving me  batshit insane. I sat him down to talk last week, and I asked him very  clearly and directly to stop. At the time, he said he would, and it did  slow down for a few days, but it is now four days after Christmas and  he's back at it again with no end in sight.\n\nHe  absolutely means the world to me, and I saw myself spending the rest of  my life with him, but I have serious doubts now whether or not I can if  every Christmas is going to be like this. So please, reddit, what do I  do to make this stop for good?",
            "NTA divorce him right now, red flags everywhere.",
            "YTA his greg his nog",
            "Greg jizzes into an eggcup. Slurps it down. Licks lips. \"Ahhh, Greggnog.\"",
            "Ok.   Well   maybe you'll have to remind him a few times,  how is this hard to grasp \"Babe    stop saying that \".    A few days later, you may have to say \"Babe... you're doing it again\".\n\nWhat is with people who need advice on everything???",
            "reject humanity, embrace greggnog",
            "Greggnog only comes once a year",
            "I guess you are his little nogchamp",
            "Gregsticles",
            "do nothing, deal with it hoe B)",
            "You better swallow that Greggnog before it expires.",
            "I want to meet this man",
            "i love greggnog",
            "what does 24f mean",
            "Slurp Slurp",
            "Greggnog from his huge gregghog",
            "NTA, your Greggnog, your rules",
            "Why are you talking about cum so much for this to be a consistent problem",
            "He will call his son grotch greglin",
            "I say embrace the Greggnog, 'tis the season to be Greg",
            "This thread made me gregnostic.",
            "The gregnog from his gregsticles will get you gregnant.",
            "Just swallow the Greggnog and hush up!!",
            "greg's greggnog is very greggpog",
            "At least he isn't Richard.",
            "u-uuuwaaaa~ OmO i-i let my gwegfwendu do a cummy cum in my gwegcccwie~!!! and he didn't wear a gwegcondom O////O a-a-am i gonna get greggers now?? 3: i is too young to be a gwegmother! >///< c-c-can i getsies a gwegortion? uwu c-can i pay my gwegnecologist with my gwegcccwie-wucie? O////< p-perhaps i could offer him my tasty gwegmilk uwu. o-or m-maybe i'll ask if he will accept a pint of my sticky gweggnog instead UwU",
            "Witness my gregneggs",
            "Start answering you’ll get Gregnant.  Ha. That will fix it 1000%.  Unless he’s Mormon.  Then your stuck with it.",
            "This is fucking GOLD!\n\nGOLD I SAY!!",
            "YTA",
            "In all honesty greggnogg don’t sound like the one if u can’t tolerate his christmas actions😂",
            "Based Gregpog.",
            "\"But who the fuck is Gregnogg?!\" - Franklin from gta 5",
            "Op if your real I have advice",
            "Try and calmly talk to him about it",
            "[deleted]",
            "It's better then Greg Jr. Cause that implies he wants to get you prego with some of his Gregnog! Always a upside to everything.",
            "Stop drinking the Greggnog and tell him why ... He'll stop.",
            "December becomes the month of Gregnope.",
            "Just be grateful he not a gregghead?",
            "onision?",
            "At least he doesn't call them Gregsticles",
            "YTA. His cum, his name.",
            "OP seriously asking Reddit, filled with prepubescent teens, relationship advice?",
            "This is the opposite of a problem",
            "Start chugging",
            "what sub is this supposed to mock ive seen so many of these",
            "Make Cum Greg Again",
            "If you can't handle the Greggnog then get out of the kitchen",
            "Nta. Your boyfriend your rules.",
            "NTA his cum, his rules",
            "He needs a good old belt whopping",
            "Cheat on him duh",
            "Is my ban over",
            "Mmmmm, greggnog",
            "ill take him he sounds sweet 🥺",
            "You should think about grexit!",
            "If you seriously want this to stop he deserves someone better i would love his greggnog",
            "HA HA HAAAA",
            "Lmao",
            "YTA",
            "My (40M) Wife (34F) will not stop calling her vaginal secretions \"Pussnog\" During Christmas time ,should I get a divorce?",
            "Well if he wont come on your face he is just a greghog.",
            "Flip the script, and find a term of phrase that bothers him. The only reason he keeps it up is because he can see it bothers you.",
            "Greg sounds like someone I wanna know better",
            "By Gregnogg's Hammer, by the Sons of Warvan you shall be avenged.",
            " Thanks\n\n\nMy name is Greg. Gonna start calling my cum gregnog",
            "You need to let him know how it makes you cringe every time he says it, how you don't like it and could actually make it a \"deal breaker\".  Because no grown woman's wants gregnog, so grow up!",
            "How is it possible in the copypasta subreddit it is no longer possible to copy the text from users like cummy. I just want the damn text. Fuck",
            "This person does not deserve his incandescent spirit.  Maybe no one does.",
            "Post incorrectly placed, please refer to r/greggnog",
            "Could his name possibly be Greg?",
            "YTA learn to appreciate Greggnog then we'll talk 😡😡",
            "When I sneeze, is that nosenog?",
            "NTA divorce him and lawyer up",
            "YTA, his cum, his rules",
            "Threaten him with Pegnog, the Christmas strap-on.",
            "I don’t see the problem",
            "He sounds hilarious tbh",
            "YTA you chose to date a dude named greg",
            "PegGreg",
            "Give him a kid he is a dad now.",
            "grum",
            "Do you want NutSmegg with your Gregnogg?",
            "Take his Grenogg and mix in his eggnog.  When he finishes the drink , Tell Him .",
            "Put some in his coffee",
            "Whe greg gaming becomes real",
            "Greg must be all kinds of fun around Christmas.",
            "are u srsly thinking about breaking up with him over this stupid reason??!! talk to him! once again!!",
            "This is worded so badly why do you need the age",
            "Classic Greg",
            "Everyone’s talking about Greg Heffley but this seems like to me like a Fregley thing",
            "I would punch him in his gregnog dispenser the next time.",
            "Oh thank god this is r/copypasta",
            "I thought this was r/DannyGonzalez for a second.",
            "Tell him it disgusts you and ruins the mood and makes him less sexually appealing. That should work. Or ignore it until he kills the joke.",
            "just sit back and relax and enjoy your Greggnog for a month of every year? On your back, on your face, get that Greggnog all over the place.",
            "[deleted]",
            "I call mine Pete Skeet year round",
            "BRO",
            "My (24F) Boyfriend (27M) will not stop calling his cum \"Greggnog\" During Christmas time\n\nFirst off: I am not joking. I wish I was joking.\n\nI've been with my wonderful boyfriend Greg for over 4 years now, and this Christmas was our third spent together. He's so much fun to be around, handsome, charming, and our sex life is great. Except for one small problem.\n\nEvery year now starting in December he starts referring to his cum as \"Greggnog.\" When I first heard him say this, it was in the context of a joke, so I laughed, and then I forgot about it. A few days after this, we're exchanging some spicy texts before he gets home from work he says to me, in all seriousness, \"I can't wait to pour Greggnog all over your face.\" I could not believe he just said that to me, but I didn't know what else to do at the time but go along with it. \n\nFast forward to this December. This phrase re-enters his vocabulary at the same time every year. It makes me cringe beyond belief, but until this year he used it sparingly enough for me to just be able to laugh and say \"shut the fuck up.\" \n\nI'm sure that 2020 has done at least some irreparable psychic damage to all people, but unfortunately, for my boyfriend, this has manifested in the form of him referring to his cum as \"Greggnog\" non-stop. This month he has been using the term almost exclusively, in all contexts, and it is driving me batshit insane. I sat him down to talk last week, and I asked him very clearly and directly to stop. At the time, he said he would, and it did slow down for a few days, but it is now four days after Christmas and he's back at it again with no end in sight.\n\nHe absolutely means the world to me, and I saw myself spending the rest of my life with him, but I have serious doubts now whether or not I can if every Christmas is going to be like this. So please, reddit, what do I do to make this stop for good?",
            "Twitter says you should call your vag your Yeaster basket \n\nhttps://twitter.com/gadfly_by_night/status/1344361917142470661?s=21",
            "YTA, his cum is his to call whatever he likes. His body his rules.",
            "Stop it that's gregsgusing.",
            "What the fuck kind of person talks that much about his own cum, anyway? Other than Greg, of course.",
            "Did you talk to him about it?",
            "haha get G R E G G N O G E D",
            "Ffs.  Did you TELL him to stop saying this?    Wtaf.  How people see themselves as helpless victims is stunning to me.",
            "lol",
            "Thanks for the idea",
            "Thanks, now I'll never be able to drink egg nog ever again.",
            "I hope he likes Gregging",
            "Man these Diary of a Wimpy Kid things keep getting weirder and weirder",
            "That's just a while pile of weird.",
            "This post makes me so glad I’m single lmao",
            "Hey what's up Greg and welcome back to... what will next year's special sauce be called?",
            "Nextime he says it, spit the \"greggnog\" back at him and laugh like its the funniest thing you've ever heard, like don't stop laughing until HE'S as uncomfortable as you were",
            "You can’t have a Tomlette without breaking a few Greggs",
            "NTA\nHis Gregnogg, his rules.",
            "https://www.reddit.com/r/relationship_advice/comments/knkv9r/my_24f_boyfriend_27m_will_not_stop_calling_his/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Hey it geg",
            "First off: I am not joking. I wish I was joking.\n\nI've been with my wonderful boyfriend Greg for over 4 years now, and this Christmas was our third spent together. He's so much fun to be around, handsome, charming, and our sex life is great. Except for one small problem.\n\nEvery year now starting in December he starts referring to his cum as \"Greggnog.\" When I first heard him say this, it was in the context of a joke, so I laughed, and then I forgot about it. A few days after this, we're exchanging some spicy texts before he gets home from work he says to me, in all seriousness, \"I can't wait to pour Greggnog all over your face.\" I could not believe he just said that to me, but I didn't know what else to do at the time but go along with it. \n\nFast forward to this December. This phrase re-enters his vocabulary at the same time every year. It makes me cringe beyond belief, but until this year he used it sparingly enough for me to just be able to laugh and say \"shut the fuck up.\" \n\nI'm sure that 2020 has done at least some irreparable psychic damage to all people, but unfortunately, for my boyfriend, this has manifested in the form of him referring to his cum as \"Greggnog\" non-stop. This month he has been using the term almost exclusively, in all contexts, and it is driving me batshit insane. I sat him down to talk last week, and I asked him very clearly and directly to stop. At the time, he said he would, and it did slow down for a few days, but it is now four days after Christmas and he's back at it again with no end in sight.\n\nHe absolutely means the world to me, and I saw myself spending the rest of my life with him, but I have serious doubts now whether or not I can if every Christmas is going to be like this. So please, reddit, what do I do to make this stop for good?",
            "Greggnog",
            "Garganog",
            "sounds like she should chill out and drink a glass of greggnog",
            "Had to see this post for myself. Gonna start calling it Gregnog as well!",
            "Greggnut",
            "Peak humour"
        ]
    },
    {
        "post_id": "mxxrof",
        "author": "None",
        "title": "How to respond to a dick pic",
        "url": "https://www.reddit.com/r/copypasta/comments/mxxrof/how_to_respond_to_a_dick_pic/",
        "score": 14405,
        "num_comments": 268,
        "created_utc": 1619313929.0,
        "selftext": "This is an automated message generated by the Instagram team. Your image has been found to be a violation of 42 U.S.C. § 1283 (2021)\n\nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” Otherwise, you will be contacted by your local authorities within 24hrs",
        "permalink": "/r/copypasta/comments/mxxrof/how_to_respond_to_a_dick_pic/",
        "comments": [
            "HELP",
            "I'd suggest using [18 U.S. Code § 1462](https://www.law.cornell.edu/uscode/text/18/1462) instead, as that section of federal law deals with obscenity, instead of... (checks internet) [distributing social security benefits?](https://www.law.cornell.edu/uscode/text/42/chapter-7/subchapter-X)",
            "This is an automated message genewated by the Instagwam team. Youw image has been found to be a viowation of 42 U.S.C. § 1283 (2021)\n\nAn image you sent has been fwagged as an unsowicited pictuwe. Youw account is scheduwed to be wepowted to the powice\n\nOuw bot is cuwwentwy in BETA testing; if you bewieve this message was an ewwow, wepwy “HEWP” Othewwise, you wiww be contacted by youw wocaw authowities within 24hws",
            "This is an automated 🤖 message 💬 generated ⌨🕹 by the Instagram 📸 team 👥. Your 👉 image 🖼👀 has been found 🔍 to be a violation 👿 of 42 👧 U.S.C. § 1283 (2021 💀😡)   \n  \nAn image 🖼 you 👉 sent 😳 has been flagged as an unsolicited picture 🖼. Your 👉 account 💳 is scheduled 📒 to be reported ☎ to the police 👮‍♂️   \n  \nOur bot 🤖 is currently 💰 in BETA 💰 testing 💯; if you 👈 believe 🌈 this message 💬 was an error 🚫💯, reply 🔁 “HELP” Otherwise 😎, you 👈🏼 will be contacted 🗣☎ by your 👉 local 📰 authorities 👮 within 🅰 24hrs",
            "Legit a friend of mine who gets tons of dick pics sent to her IG unsolicited thanked me for sending this to her. Thank you, kind reddit stranger, for providing my friend with a possible escape from assholes.",
            "[removed]",
            "here is a version for Reddit \n\nThis is an automated message. Your image has been found to be a violation of rule 7 of the  Reddit content policy (2021)\n\nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” Otherwise, you will be contacted by your local authorities within 24hrs.",
            "*unsolicited child pornography\n\nJust for that extra little bitta hurt",
            "Can someone copy and put I a comment for me",
            "You stole this so fucking quick",
            "I made it a bit more realistic in case the dick pic sender isn't a total moron.\n\nThis is an automated message generated by the Instagram Trust and Safety Team. Your message has been found to be in violation of 18 U.S.C. § 1462 (2020); unsolicited distribution of pornography to a minor.\n\nAn image you sent has been identified by our ScanAl™ and was flagged as an inappropriate picture. The image has been archived with your account details and is scheduled to be reported to the FBI.\n\nOur bot is currently in BETA testing; sometimes it makes mistakes. If you believe this message was in error, please reply \"HELP\". Otherwise, you will be contacted by your local authorities within 48 hours.",
            "I normally just pretend I think it’s a mushroom and ask if they’re making risotto with it",
            "Genius",
            "How to respond to a dick pic\n\nThis is an automated message generated by the Instagram team. Your image has been found to be a violation of 42 U.S.C. § 1283 (2021)\n\nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” Otherwise, you will be contacted by your local authorities within 24hrs",
            "\nThis is an automated message generated by the Instagram team. Your image has been found to be a violation of 42 U.S.C. § 1283 (2021)\n\nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” Otherwise, you will be contacted by your local authorities within 24hrs",
            "Being contacted by authorities within 24 hours is a dead giveaway it's BS. Nothing gets done that fast",
            "I’m quite literally crying rn with all the among us dicks and then random comments sprinkled in lmfaoooo. Never change Reddit never change",
            "Remember when Cummy used to send dick pics before he was replaced with a false god?",
            "hi im sorry, pls dont tell my parents i am already grounded because i shit my pants so much, and they are trying to figure out a way for me to stop it.",
            "This is an automated message generated by the Instagram team. Your image has been found to be a violation of 42 U.S.C. § 1283 (2021)\n\nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply \"HELP\" Otherwise, you will be contacted by your local authorities within 24hrs",
            "why the hell are the mods deleting all the amonguscockbot comments",
            "How to respond to a dick pic\n\nThis is an automated message generated by the Instagram team. Your image has been found to be a violation of 42 U.S.C. § 1283 (2021)\n\nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” Otherwise, you will be contacted by your local authorities within 24hrs",
            "Is this that post from r/creepypms",
            "I just called the cops and they gave the guy a $500 ticket. Hadn't spoken to the guy in over a year and we never met in person. Dunno what the hell he was thinking",
            "Better version:\n\nThis is an automated message generated by the Instagram Trust and Safety team. Your image has been found to be in violation of 42 U.S.C. § 1283 (2021).\n\nAn image you sent has been flagged as possible child pornography. As such, your account details and all uploaded photos (both public and privately sent) have been forwarded to the FBI for investigation.\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” and our team will review your case. Otherwise, please wait to be contacted by your local authorities within 24hrs.",
            "Me, a guy:\n\n\n\n*I don't have such weaknesses*",
            "u/amonguscockbot",
            "u/amonguscockbot",
            "https://www.reddit.com/r/copypasta/comments/mxfnur/response_to_a_dickpic/?utm_medium=android_app&utm_source=share",
            "I love this lmaooo im adding this to a document and using this",
            "Say” Meh too small”",
            "u/AmongUsCockBot",
            "A friend of mine would respond to unsolicited dick pics with \"You call that a dick?\" and return a picture of a bigger dick.",
            "AUTOREPLY: We have detected the transmission of unsolicited pornographic images of potentially illegal nature \\[code:36489-a\\] and your device’s IP address has been forwarded to the police department pending an investigation. If you think this is a mistake, reply STOP",
            "😎👍",
            "\"Nice dick, kid.\" would do just fine lol.",
            "Everybody gangsta till the “girl” sends one back",
            "whew, copied and pasted this into google after a girl DM’d this back to me. Glad it was just you guys",
            "u/amonguscockbot",
            "[removed]",
            "u/amonguscockbot",
            "Repost:(",
            "u/repostsleuthbot",
            "Whats wrong with it? Was a fave of mine lol",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "I was gonna put this on here when I saw the original post on another subreddit, frustrated I didn’t",
            "Solid, but you could also respond with a quip. \"Oh, that explains why you feel the need to compensate.\" Or \"man that's fucked up, don't send people child pornography!\"",
            "Joke's on you, there are no local authorities. I live in the woods. 😎😎😎",
            " \n\nThis is an automated message generated by the Instagram team. Your image has been found to be a violation of 42 U.S.C. § 1283 (2021)\n\nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police\n\nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” Otherwise, you will be contacted by your local authorities within 24hrs",
            "Very useful",
            "Very much needed. Thank u",
            "I think you may have a case of scrotus rottus might want to go see a doctor.",
            "Hah I just saw this and wanted to copy it. How cummy convenient",
            "e",
            "Power move : reply help and then send the representative another dick pick",
            "I saved this post\n\nThanks",
            "Another dick pic",
            "thanks",
            "What's the trigger warning for",
            "r/AmongUsCockBot",
            "Personally I go with \"omg what the fuck is wrong with you! Why are you sending me child porn? I'm going to the police!\"",
            "Sorry I haven't got a magnification setting THAT powerful",
            "I always just responded with photos of hot dog and/or banana slicers",
            "Ù",
            "Make it child prn because according to measurement standards a penis of that size must be a young child’s",
            "ENHANCE!",
            "u/AmongUsCockBot",
            "This is an automated  message generated  by the Instagram  team. Your  image has been found to be a violation of 18 U.S.C. § 1283 (2021)   \n  \nAn image you sent has been flagged as an unsolicited picture. Your account is scheduled to be reported to the police.\n  \nOur bot is currently in BETA testing; if you believe this message was an error, reply “HELP” Otherwise, you will be contacted by your local authorities within 24 hours.",
            "!remindme 24h",
            "You add and pic to a  collage of pics just like it with his email address in large print then send him back the collage with his email now added. He will keep this collage, these types won't delete a pic of themselves, ever. He will eventually get himself in trouble for this and now his character, name, secuallity and freedom are all in question and he will have done this by his own.... uh, yeah.",
            "Oh look, it's like a penis, only smaller!"
        ]
    },
    {
        "post_id": "gcsg0i",
        "author": "None",
        "title": "r/BanVideoGames is a goldmine",
        "url": "https://www.reddit.com/r/copypasta/comments/gcsg0i/rbanvideogames_is_a_goldmine/",
        "score": 14394,
        "num_comments": 438,
        "created_utc": 1588519674.0,
        "selftext": " \n\nTL;DR my son is a Terrorist!\n\nI walked in on my son playing a video g\\* me, I was furious! He explained to me that he has to play this g\\* me called Counter Strike Global Offensive to kill Terrorists and prevent a Bomb from detonating! I was so proud of my patriotic and truly american son for killing these Terrorists that I forgave him for playing a video g\\* me!\n\nNevertheless I was suspicious, it is a video g\\* me! I spied on him for about 30 minutes and then I saw it, I SAW IT!!! HE WAS PLAYING AS A TERRORIST, MY SON LIED TO ME. HE TRIED TO HIDE THAT HE LIKES KILLING PEOPLE AND THAT HE LIKES BLOWING EVERYTHING UP!!! He thought that he could trick me, but I know the truth about my son and g\\* mers:\n\nTHEY ARE TERRORISTS and this g\\* me called Counter Strike Global Offensive is nothing but a hub to spread their believs and evil plans!\n\nBan video games now! Save your children from this evil g\\* me!",
        "permalink": "/r/copypasta/comments/gcsg0i/rbanvideogames_is_a_goldmine/",
        "comments": [
            "You didn't censor the first g* me in the last paragraph! I thought you were opposed to v* deo g* mes, but I guess not😭😭",
            "NTA. Play stupid g*mes, win stupid prizes.",
            "The Best thing about that sub is that some people think it's not satire and even brigade it sometimes",
            "Redditors will never detect satire without the /s thingy",
            " \n\nTL;DR my son is a Terrorist!\n\nI walked in on my son playing a video g\\* me, I was furious! He explained to me that he has to play this g\\* me called Counter Strike Global Offensive to kill Terrorists and prevent a Bomb from detonating! I was so proud of my patriotic and truly american son for killing these Terrorists that I forgave him for playing a video g\\* me!\n\nNevertheless I was suspicious, it is a video g\\* me! I spied on him for about 30 minutes and then I saw it, I SAW IT!!! HE WAS PLAYING AS A TERRORIST, MY SON LIED TO ME. HE TRIED TO HIDE THAT HE LIKES KILLING PEOPLE AND THAT HE LIKES BLOWING EVERYTHING UP!!! He thought that he could trick me, but I know the truth about my son and g\\* mers:\n\nTHEY ARE TERRORISTS and this g\\* me called Counter Strike Global Offensive is nothing but a hub to spread their believs and evil plans!\n\nBan video games now! Save your children from this evil g\\* me!",
            " \n\nTW;DW my son is a Tewwowist!\n\nI wawked in on my son pwaying a video g\\* me, I was fuwious! He expwained to me that he has to pway this g\\* me cawwed Countew Stwike Gwobaw Offensive to kiww Tewwowists and pwevent a Bomb fwom detonating! I was so pwoud of my patwiotic and twuwy amewican son fow kiwwing these Tewwowists that I fowgave him fow pwaying a video g\\* me!\n\nNevewthewess I was suspicious, it is a video g\\* me! I spied on him fow about 30 minutes and then I saw it, I SAW IT!!! HE WAS PWAYING AS A TEWWOWIST, MY SON WIED TO ME. HE TWIED TO HIDE THAT HE WIKES KIWWING PEOPWE AND THAT HE WIKES BWOWING EVEWYTHING UP!!! He thought that he couwd twick me, but I know the twuth about my son and g\\* mews:\n\nTHEY AWE TEWWOWISTS and this g\\* me cawwed Countew Stwike Gwobaw Offensive is nothing but a hub to spwead theiw bewievs and eviw pwans!\n\nBan video games now! Save youw chiwdwen fwom this eviw g\\* me!",
            "Now we’re going to be brigaded by racist gamers again 😭😡🤬",
            "That sub is indeed a goldmine, but it is also satire.",
            "r\\*dditors when satire isn't explained to be satire and is flashing SATIRE YOU MAY LAUGH",
            "ni>!ce ca!<r",
            "r/BanVideogames is truly a goldmine, heh",
            "It’s so sad seeing the 10 year old pewdiepie fans there thinking that they’ve actually found an anti g*ming cult and that they are a badass for infiltrating it",
            "This reminds me of the time when I was used to force my friends to pick counter-terrorist so we can be good and not sinning against Allah.\n\nYeah how did that turn out.",
            "All of the pissed gamers taking it seriously kills me. I got called a Karen and a boomer in the same paragraph.\n Yes, paragraph.",
            "NOOOOOOOOOOO another fallen soldier that g\\*mer is gonna BECOME a terrorist!!11!!11!",
            "That one is one of the funniest subs ever made and the lolcows in the comments only make it better",
            "Guys it all ironic in case nobody knew",
            "Facts: I played cops&robbers as a kid, and I played as a robber one time, and now I rob banks as my only source of income.",
            "This feels kind of like the flat earth movement, where there is some people who believe it but most of them are just trolls.\n\nEDIT: Actually that sub probably doesn't have any actual believers, but I'm sure there are some Facebook groups.",
            "Hope you sent him off to Afghanistan for this transgression",
            "The subreddit is mostly for trolls I'm pretty sure",
            "It’s a joke. Unless you know it’s a joke idk",
            "Ladies and gentlemen, we got him.",
            "People who don't play Counter-Strike: Global Offensive won't understand this.",
            "Correct use of 'tl;dr' breaks my suspension of disbelief.",
            "Holy shit I found this:\n\n\n\n\n\n\nOk that’s yr “proof”. Now here’s mine:\n\nIf we look at the date of the post it says may 2nd which was yesterday but because America is America I’ll check February 2nd as well. On may 2nd. The only tweets visable is telling people about the major lazer event that was happening in the game. There was another one about the major lazer set coming to the item store and staying on the item store there was a new emote brought into the game called the strut (pretty snazzy music). There was also a tweet about some the music being copyrighted and they claimed that for the event content creators won’t have their money taken from them. Huh doesn’t sound like any racism to me. Let’s check February 2nd. Huh, I just realised they’re also donating a high amount of money to people in need because of COVID-19. You should too but would you look at that... you’re a selfish bitch. Ok now where was I? Oh yeah. February 5th. There seems to be only 2 tweets that day. One of them being about a downtime for the game to update since they’re launching their colab with DC comics with Harley Quinn. There’s also a tweet about a new set of skins (outfits) coming to the item store. So that shows it. There’s no rude tweet by fortnite saying such things. oH BuT tHeY cOuLd HavE DelEtEd tHe twEET. Huh, you’re right. So let’s go to google and search to see if there was such tweet done... huh no fortnite racist tweet popping up here. (Also if you want photo proof I can give you it just do me). I’m going to check google images and see if there is one there. Wow first one. It’s of a fortnite content creator. It’s about them saying that white girls and black guys is a turn off to him. Yes that’s controversial but still isn’t fortnite’s tweet (plus that tweet isn’t even racist by its meaning) oh. Here’s some controversial tweets but ninja but wai-. He was hacked. Damn. Welp I guess there’s no racist tweet since obviously if they tweeted such thing the internet would of reacted in such a horrible way. Also if you want to find rude content search up Trisha paytas. Ok then. Time to search up pewdiepie since who knows he could have magically made that comment. (Also if you find any evidence of pewdiepie being a nazi please tell me). Now let’s do the same thing with Felix. Wait... why can’t I find his twitter... oh wait yeah! He deleted it ages ago. If you want evidence of him saying he deleted his Twitter her you go: https://m.youtube.com/watch?v=1n_cPIhag28. Welp that’s that.but wait! There’s more! I just remembered. Donald trump thinks that video games cause violence. And I’m guessing you agree with that huh? Well does that mean you like separating Mexican families from their kids and deporting them “back to where thy came from” lol. Also (we’re going by your logic here mate) he also blames China for started corona virus which is true since it originated there but you can’t blame them for that but guess what. Donald trump blames them for that lmao. So I’m guess you do to huh? Donald trump has also stated that he doesn’t like people who are captured. Wow that would include prople that have been abducted and raped for hours on end. Also tourtured and maybe alive. That includes all the prisoners of war that probably went through the same hardship as the people I said before. There’s plenty more I could list off about Donald trump but let’s change subjects. So... I’m guessing you’re Christian huh. Let’s go back on the history of Christianity.  Already to start off. God said that he loves everyone. Aw that’s nice but I think he forgot about: Jews, muslims, asians, Africans, females, gays, lesbians, basically anyone who isn’t straight and indigenous people. God that’s a lot of people you left out wink. Remember the Black Plague. God a horrible time. 1/3 of Europe died. I guess god hated you for being such idiots. Must explain why COVID is happening right now. Oh yeah and those Jews you thought poisoned your wells. Well that just made things worse since if you didn’t know. Jesus is a Jew. You remember those times when women were accused of being a witch just for doing a magic trick? Yeah you killed so many innocent women because of that. Oh yeah and lastly, remember when you enslaved a whole freaking continent just for some wheat. Damn. If you didn’t also know that’s the reason you see a lot of black people committing crimes since that’s all they know what to do since you showed the back in Nigeria. I know you didn’t read a single bit of this and though of this as fake news and I know you’re not going to be convinced but even more anti games. Because that’s how the human body works. When presented with a well constructed argument Against Someone with a strong opinion about something else they just go ballistic. So atm is your hormones going over the place looking at this message. And yes you still have hormones in you even as an adult. Well cya in hell",
            "Goo goo ga ga🐒",
            "Dude I went on there because of this and it’s hard to take seriously. Their top rated post of all time is a guy who isn’t even in the sub saying how the sub is shit and that video games are good.",
            "#r/banvideogames\n\nclickalink",
            "Your son is insane to lie to his parent like that!",
            "Im 90 percent sure its satire",
            "do people post in r/banvideogames unironically?",
            "Grrr! Demonic g*mers!",
            "people dont realize its an ironic sub...",
            "r/banvideogames??? You mean the’re not banned already???? Reported and blocked.",
            "You know, Bin Laden actually played counterstrike",
            "Oh god, don't let any single mom over 40 read this",
            "r/banvideogames is so confusing like I can't tell if it's serious or jokes or even both cause when you ask people normally say it's serious but the things they talk about it's... Just mesmerising",
            "that subreddit is satirical",
            "Isnt copy pasta supposed to be non-ironic non-satire when it is first posted and then turned into something ironic and satirical?",
            "Every time I see “video g*me”, I read it in my head as “video gay, me”",
            "We",
            "Nice",
            "eastern'nt thinking",
            "u/userleansbot u/Vanquisher992",
            "They have an anti Karen bot 😂",
            "Is this satire, i cant really tell",
            "Game",
            "You know that sub is satire right?",
            "Minecraft is not that bad, is it?",
            "I love r/banvideogames",
            "Is that a non-ironic sub or is it satire?",
            "This has to be satire, please someone tell me it is.",
            "I’m so confused is this a actual subreddit",
            "To be clear, that subreddit IS satire right?",
            "r/banvideogames",
            "I genuinely can't tell if that place is satire or not. Either way, it was a good laugh.",
            "wait which of these subs is satire and which is honest? or are both r/banvideogames and r/banvideogameshate multiple layers of satire?",
            "It's gotta be one of those subreddits that are now mostly satire rather than actual parents complaining about video games",
            "Karen......",
            "Can't be bothered to use the search bar\n\nr/BanVideoGames",
            "They didn’t even censor the second last video game or the game in the subreddit name",
            "\\*karen has entered the chat\\*",
            "There is no way this is unironic, right?",
            "Is that a satire sub or not? I genuinely can’t tell",
            "Most people on that sub are satire, but there’s actually a few people on there who genuinely believe that games  should be banned",
            "Is r/banvideogames satirical?",
            "Okay rewind... Was this seriously posted unironically?",
            "Hot take but r/banvideogames is literally the spirit of r/gamersriseup reincarnated, unlike the bastardization that is r/gangweed",
            "[deleted]",
            "Get a load of these christians",
            "Is that sub for real or a parody?",
            "G* MERS RISE U🅱️",
            "I tried role playing with them but they must be using alt accounts",
            "TL;DR for the sub: It's a massive circlejerk of karens that say that gamers are nazis and pewdiepie loves satan.",
            "Ban video games is not a goldmine at all in fact it is rather unfunny",
            "Ok so that subreddit is actually satirical, even though they say it's not and they're too into that \"roleplay\" they treat it like it's not just to trigger trolls.\n\nBasically they're like Friends Of Journalism",
            "Please tell me that is a satire subreddit",
            "Is /r/BanVideogames serious?",
            "I mean...its contrived and stupid and not really funny. So yeah, a goldmine for retarded bad jokes for this sub...",
            "[deleted]",
            "imagine having an urge to tell people that your son is a terrorist"
        ]
    },
    {
        "post_id": "beywnd",
        "author": "None",
        "title": "I spend 5 hours masturbating before my prostate exams. I edge, and edge and edge, until a butterfly sneezing on my taint could bring me to orgasm. I tactfully shuffle my way down to the doctor's office and when he lubes up I nearly cum every time. But I've trained my keggle muscles enough to th",
        "url": "https://www.reddit.com/r/copypasta/comments/beywnd/i_spend_5_hours_masturbating_before_my_prostate/",
        "score": 14384,
        "num_comments": 328,
        "created_utc": 1555679351.0,
        "selftext": " I spend 5 hours masturbating before my prostate exams. I edge, and edge  and edge, until a butterfly sneezing on my taint could bring me to  orgasm. I tactfully shuffle my way down to the doctor's office and when  he lubes up I nearly cum every time. But I've trained my keggle muscles  enough to the point where I can hold in Mount Vesuvius' wrath. Then as  soon as he puts the smallest bit of pressure on my prostate I unleash  with the fury of a lion hunting its prey. As the room gets covered in my  hot sticky juices the doctor looks on disgusted and leaves the room. I  always go to a hospital far away from where I live to get it so that I  don't have to go in for surgery under the doctor that I busted to. Best  thing is we have free healthcare here, so the doctor gets me off and  it's covered by taxpayers. That's my fetish.",
        "permalink": "/r/copypasta/comments/beywnd/i_spend_5_hours_masturbating_before_my_prostate/",
        "comments": [
            "I thought this was r/confessions for a solid minute and i was kinda concerned",
            "Um hey quick question:\nWhat the actual fuck",
            "Cya virgins.",
            " I spend 5 hours masturbating before my prostate exams. I edge, and edge  and edge, until a butterfly sneezing on my taint could bring me to  orgasm. I tactfully shuffle my way down to the doctor's office and when  he lubes up I nearly cum every time. But I've trained my keggle muscles  enough to the point where I can hold in Mount Vesuvius' wrath. Then as  soon as he puts the smallest bit of pressure on my prostate I unleash  with the fury of a lion hunting its prey. As the room gets covered in my  hot sticky juices the doctor looks on disgusted and leaves the room. I  always go to a hospital far away from where I live to get it so that I  don't have to go in for surgery under the doctor that I busted to. Best  thing is we have free healthcare here, so the doctor gets me off and  it's covered by taxpayers. That's my fetish.",
            "This is a common fetish, hospital’s call it a *Cum and Go* in the United States. However in Canada it’s often referred to a *Wank and Thank*.  Since insurance covers it in Canada, under the ‘Prostate Protection Act’, *funded by the crypto currency     |cU•mOney|.* The citizens are actually nicer as a result of this pro-prostate culture.",
            "I have seen this somewhere, what's the source?",
            "I spend 5️⃣hours🕝 masturbating🍆 before my prostate🍑🍑 exams🔍. I edge🍆, and edge🍆🍆, and edge🍆🍆🍆, until a 🦋butterfly🦋 sneezing💧 on my taint💦 could bring me to 🍆💦orgasm🍆💦. I tactfully 🚶shuffle🚶 my way down to the 😷doctor's😷 office🏥 and when he 💧lubes💧 up I nearly 🍆cum💦 every time🕓. But I've trained my kegel 💪muscles💪 enough to the point where I can hold in 🌋Mount Vesuvius🌋' 💦💦wrath💦💦. Then as soon as he puts the smallest bit of 👉pressure👈 on my prostate I 🌊unleash🌊 with the fury of a 😻lion😻 hunting its ☠️prey☠️. As the room🏥 gets covered🌊🏥 in my 🌋hot ⛓sticky⛓ juices🚰 the 😷doctor😷 looks on 🤢🤢🌊disgusted and leaves the 🏥room🏥. I always go to a 🏥hospital 🏥far away from where I 🏚live to get it so that I don't have to go in for 😷surgery under the 😷doctor😷 that I 😨🌊busted to. Best thing is we have 🇨🇦free healthcare🇨🇦 here, so the 😷doctor😷 gets me 🦋🌊off and it's covered by 💸💰taxpayers💰💸. That's my fetish😩😩.",
            " I spend 5 houws mastuwbating befowe my pwostate exams. I edge, and edge  and edge, untiw a buttewfwy sneezing on my taint couwd bwing me to  owgasm. I tactfuwwy shuffwe my way down to the doctow's office and when  he wubes up I neawwy cum evewy time. But I've twained my keggwe muscwes  enough to the point whewe I can howd in Mount Vesuvius' wwath. Then as  soon as he puts the smawwest bit of pwessuwe on my pwostate I unweash  with the fuwy of a wion hunting its pwey. As the woom gets covewed in my  hot sticky juices the doctow wooks on disgusted and weaves the woom. I  awways go to a hospitaw faw away fwom whewe I wive to get it so that I  don't have to go in fow suwgewy undew the doctow that I busted to. Best  thing is we have fwee heawthcawe hewe, so the doctow gets me off and  it's covewed by taxpayews. That's my fetish.",
            "Can I be your doctor",
            "Nice",
            "This is peak homosexual.",
            "Hello I’m doctor Phil and I would like you to dippity delet this rn before I snippity snap your neck kthx",
            "I have this exact thing saved in my notes from last year and I got it on this subreddit. Thicc repost at least credit op",
            "#I spend 5 houws mastuwbating befowe my pwostate exams. I edge, and edge  and edge, untiw a buttewfwy sneezing on my taint couwd bwing me to  owgasm. I tactfuwwy shuffwe my way down to the doctow's office and when  he wubes up I neawwy cum evewy time. But I've twained my keggwe muscwes  enough to the point whewe I can howd in Mount Vesuvius' wwath. Then as  soon as he puts the smawwest bit of pwessuwe on my pwostate I unweash  with the fuwy of a wion hunting its pwey. As the woom gets covewed in my  hot sticky juices the doctow wooks on disgusted and weaves the woom. I  awways go to a hospitaw faw away fwom whewe I wive to get it so that I  don't have to go in fow suwgewy undew the doctow that I busted to. Best  thing is we have fwee heawthcawe hewe, so the doctow gets me off and  it's covewed by taxpayews. That's my fetish.",
            "I swear I have seen and related to this copypasta sometime before",
            "This seems terribly fake, how can you soak the whole room in your man juices after you've busted a hundred nuts?",
            "Yo, I actually thought I was on r/confessions before I saw cummy's comment",
            "Aaaah, just saw this comment and came here directly to post this, only to see your post up on the front. Nice work.\n\nEdit: I noticed that your post was even 2 hours older than the comment I saw. So, really nice work.\n\nEdit 2: Just learned that this was an old copy pasta. Aight, thanks for bringing this up!",
            "I thought this was r/offmychest",
            "Oh no oh no oh no. I remember this not as a copypasta. From r/confessions or something. It's awful.",
            "FREUDE",
            "Ahh, I’ll get my MD in a few years just to experience this first hand - the joy of *relieving* a patient’s ailment. It all sounds worth it to me now.",
            "A classic",
            "r/thanksihateit",
            "This is from r/CursedComments",
            "What the h*ck I posted this an hour before this dude",
            "thanks I hate it!",
            "I don't think I have laughed this hard in a year.",
            "Oh, Thank god. I thought I was the only one.\nUnfortunately, I don’t have free healthcare, so I have to pay for mine. I’ve turned my Dr. Into a prostitute.\nProstratute?",
            "[deleted]",
            "Big if true",
            "I...uhm...what...what is happening....?",
            "So, is this whole sub just so people can make the bot say the same thing the OP says and then people comment on the bots comment? I'm lost.",
            "This is worse than the guy who terrorized birds in a local park in a similar fashion.",
            "Ladies and gentlemen meet the true ɆĐ₲Ɇ ⱠØⱤĐ",
            "Lmao",
            "I think that’s enough life for me today",
            "no",
            "Smart",
            "Repost but also a classic",
            "Oof",
            "smart",
            "[deleted]",
            "It would've cost you absolutely nothing to have not posted this.",
            "Smart",
            "Repost",
            "Excuse me but wtf.",
            "This sub gets weirder and weirder",
            "Hmm, errr, well, alrighty then, thats enough internet for today.",
            "7 bourse take it or leave it",
            "Hot",
            "👁👄👁\n        |\n    —|—\n        |\n      / \\",
            "I am uncomfortable with this",
            "Now all that's missing is the rabbit in a hat and you wearing a german army helmet.",
            "Did you make this or find it on a comment somewhere?",
            "TIL butterflys can sneeze",
            "Yeah, pretty messed up, you're a sicko.",
            "Made me laugh so Hard!",
            "Gay",
            "I literally just saw this shit",
            "I thought this was r/Confessions when I started reading it",
            "Ass",
            "Classic.",
            "When I cum to life you’ve got no place to hide!",
            "Wait? What is health care you speak of ? I can read/ write English (sorta),as an American, what are talking about?",
            "Pretty smart.",
            "My neighbor bought a Mini Cooper after 1.5 yrs of being a volunteer for prostate exams for med students.  He missed out I guess.",
            "i know ive seen this somewhere else",
            "u/the-onion-bro",
            "This is so fucked up it’s good.",
            "Ass",
            "Damnit you beat me to it",
            "Wtf smart",
            "This reminds me about this guy I heard about who had to have a prostate exam. Apparently during the proceeder he came all over the thing he was bent on and fell over knocking a bunch of equipment over.",
            "This post is cancer.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/fap] [I spend 5 hours masturbating before my prostate exams. I edge, and edge and edge, until a butterfly sneezing on my taint could bring me to orgasm. I tactfully shuffle my way down to the doctor's office and when he lubes up I nearly cum every time. But I've trained my keggle muscles enough to th](https://www.reddit.com/r/fap/comments/bf6dhv/i_spend_5_hours_masturbating_before_my_prostate/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Where’s cummy",
            "Re",
            "I thought this was r/confessions I'm kinda disappointed.",
            "sick fuck!",
            "!ThesaurizeThis",
            "r/whatthefuckdidijustread",
            "Isn’t this old",
            "Fetish? I’d call it an epic prank. You should try it at the airport. Do your, uh, prep work, then go through the security line with a Swiss Army knife in your pocket. When you get stopped, be belligerent as all get-out. When you get the full search I feel sure you’ll convince someone that they should find a new line of work.",
            "ok so 1 question\n\n\n\n\n\nwhat the actual fuck?",
            "Masturbating a day or two before having a PSA  blood test will actually increase your PSA count and give a false reading",
            "Dude I’m sent 💀💀",
            "Tbh I feel like I would do this out of curiosity for the reaction of the doc lmao",
            "So, you’re fetish is abusing health professionals? You realize they’re doing a job and you’re rolling over their consent to agree or disagree to bring you to orgasm?\n\nI don’t judge what people enjoy sexually, so long as, if you involve anyone else but yourself, you get their consent to participate. This is different. This is abuse.",
            "Finally the excuse I’ve been looking for the quit Reddit! Bye folks",
            "No way this guy wasn’t American"
        ]
    },
    {
        "post_id": "e3qwcm",
        "author": "Flying_Quokka",
        "title": "I almost had sex earlier today",
        "url": "https://www.reddit.com/r/copypasta/comments/e3qwcm/i_almost_had_sex_earlier_today/",
        "score": 14322,
        "num_comments": 269,
        "created_utc": 1575089524.0,
        "selftext": "I went to the supermarket earlier today, to buy some cheese and bacon, you know? So I went up to the girl working there and she said: \"Good morning, how can I help you?\"\n\nI couldn't believe this naughty bitch was offering herself to me at 7 am, but I managed to keep myself calm and said: \"Good morning. I want 300g of mozzarella cheese and 300g of bacon please.\"\n\nShe started working on my order, and after a while she came to me and said \"Sir, I acidentally put 350g of cheese instead of 300g. Can I leave it or do you want me to take some off?\" \n\nHoly fucking shit. I couldn't believe what this cum-addicted slut just said. She knew I only wanted 300g of cheese, but instead of giving me what I asked for she decided to try to have sex with me. I'm gonna explain it to you: what's the difference between 300g and 350g of cheese? That's right, 50 grams. What else has 50 grams? Yes, that's the average weight of a condom packaging, and also the average amount of sperm expelled during a sexual act. And worst of all, do you know which sentence has 50 letters? \"Oh daddy please destroy my pussy and cum in my little slut ass\".\n\nI was shocked at the audacity of this whore, but I was better than this. I told her to take a little bit of cheese off, and she said: \"is 308g alright sir?\" I was shaking and sharting at this point. I couldn't believe she was humiliating herself like this. Do you know what has 8 letters? \"I love you\". But I didn't love her, I didn't love this attention deprived thot back. So I just said: \"I'm not going to give in to your schemes. You should value yourself more, you are better than this\". \n\nAs I was paying for my products at the cashier I could hear a great commotion, and I saw that the girl and all the other female employees were crying in unison. I left the supermarket knowing that I did the right thing.",
        "permalink": "/r/copypasta/comments/e3qwcm/i_almost_had_sex_earlier_today/",
        "comments": [
            "The fact that you actually managed to make that whole sentence 50 letters is some dedication lmao.",
            "Why did I just count the letters in the sentence \n\n\nOh daddy please destroy my pussy and cum in my little slut ass",
            "YTA, you should've banged her",
            "This is so fucking funny",
            "I went to the supermarket earlier today, to buy some cheese and bacon, you know? So I went up to the girl working there and she said: \"Good morning, how can I help you?\"\n\nI couldn't believe this naughty bitch was offering herself to me at 7 am, but I managed to keep myself calm and said: \"Good morning. I want 300g of mozzarella cheese and 300g of bacon please.\"\n\nShe started working on my order, and after a while she came to me and said \"Sir, I acidentally put 350g of cheese instead of 300g. Can I leave it or do you want me to take some off?\" \n\nHoly fucking shit. I couldn't believe what this cum-addicted slut just said. She knew I only wanted 300g of cheese, but instead of giving me what I asked for she decided to try to have sex with me. I'm gonna explain it to you: what's the difference between 300g and 350g of cheese? That's right, 50 grams. What else has 50 grams? Yes, that's the average weight of a condom packaging, and also the average amount of sperm expelled during a sexual act. And worst of all, do you know which sentence has 50 letters? \"Oh daddy please destroy my pussy and cum in my little slut ass\".\n\nI was shocked at the audacity of this whore, but I was better than this. I told her to take a little bit of cheese off, and she said: \"is 308g alright sir?\" I was shaking and sharting at this point. I couldn't believe she was humiliating herself like this. Do you know what has 8 letters? \"I love you\". But I didn't love her, I didn't love this attention deprived thot back. So I just said: \"I'm not going to give in to your schemes. You should value yourself more, you are better than this\". \n\nAs I was paying for my products at the cashier I could hear a great commotion, and I saw that the girl and all the other female employees were crying in unison. I left the supermarket knowing that I did the right thing.",
            "What a cheesy way to have sex with someone. You did the right thing, OP. She could've put 350g of bacon instead but she knew you had the meat for her. I bet she learned her lesson.",
            "Without a doubt, NTA. Kill her immediately",
            "This is the type of content I subscribed for",
            "NTA - Totally uncalled for",
            "incel",
            "dude nnn is making you insane. am proud of u. u officially qualified for ddd.",
            "50g of cum? Like a bloody fire hydrant",
            "YATA - u could have sex free",
            "How dare that filthy slut offer herself to you at 7am!!! Everyone knows the first rule of sex is always at least 7pm or later... bet she didnt even graduate high school",
            "50g is a damn huge condom.  I mean it’d fit me properly,  but obviously OP is going to need something much much *much* smaller",
            "NTA\n\nWhat a whore",
            "Who the fuck asks for shit at the grocery store in grams!?",
            "So I went to the supermarket to try this, and she just gave me 300g of cheese. Disappointed, I was leaving when she said, “Sir, would you like anything else with that?” WTF?!! So I said, actually, can I get 50g more...\n\n...and some chicken wings.",
            "This guy fucks",
            "I thought I was reading an American Psycho fan fiction.",
            "Gross",
            "This is literally older men if you're a woman in customer service though. A lot of sad, horny old men..",
            "oh my my",
            "That's hot",
            "The next nicholas sparks book/movie.",
            "Hey OP...are you like...are you okay?",
            "!thesaurizethis",
            "Relatable",
            "why is this literally my stream of consciousness",
            "[deleted]",
            "[deleted]",
            "NTA.",
            "[deleted]",
            "why didn't u just asked her to give you more 100/150gm cheese? if that was the case you were saying, you should have taken the advantage out of it then said her \"i will meet you shortly\"\nmodern problem requires modern solution ☺️",
            "Lmao wtf...?",
            "NTA",
            "NTA",
            "“I went to the supermarket to buy some cheese” idk why but the fact this is the first thing I read after the title had me dying",
            "So an average used condom is 100g? Time to start saving up i guess",
            "Well, you tried OP. Good job",
            "NTA",
            "Holy fucking shit why the fuck cheese is so gotdamn expensive I swear to gad what's so special about the fucken cheese that a little piece of it costs more than a meal in mcdonalds and im talking about average cheese not the blue brie french cheese or whatever",
            "You did real good, son.",
            "50g is the same weight as the average 2inch penis. She wanted your 50gs, OP",
            "50g is a lot of cum tho tbh",
            "Wrong sub, definitely belongs in r/religion",
            "NTA",
            "Begone Thot",
            "nta",
            "Ak👨‍👧‍👧😀😱🤢👨‍👩‍👧‍👦",
            " \n\nI went to the supermarket earlier today, to buy some cheese and bacon, you know? So I went up to the girl working there and she said: \"Good morning, how can I help you?\"\n\nI couldn't believe this naughty bitch was offering herself to me at 7 am, but I managed to keep myself calm and said: \"Good morning. I want 300g of mozzarella cheese and 300g of bacon please.\"\n\nShe started working on my order, and after a while she came to me and said \"Sir, I acidentally put 350g of cheese instead of 300g. Can I leave it or do you want me to take some off?\"\n\nHoly fucking shit. I couldn't believe what this cum-addicted slut just said. She knew I only wanted 300g of cheese, but instead of giving me what I asked for she decided to try to have sex with me. I'm gonna explain it to you: what's the difference between 300g and 350g of cheese? That's right, 50 grams. What else has 50 grams? Yes, that's the average weight of a condom packaging, and also the average amount of sperm expelled during a sexual act. And worst of all, do you know which sentence has 50 letters? \"Oh daddy please destroy my pussy and cum in my little slut ass\".\n\nI was shocked at the audacity of this whore, but I was better than this. I told her to take a little bit of cheese off, and she said: \"is 308g alright sir?\" I was shaking and sharting at this point. I couldn't believe she was humiliating herself like this. Do you know what has 8 letters? \"I love you\". But I didn't love her, I didn't love this attention deprived thot back. So I just said: \"I'm not going to give in to your schemes. You should value yourself more, you are better than this\".\n\nAs I was paying for my products at the cashier I could hear a great commotion, and I saw that the girl and all the other female employees were crying in unison. I left the supermarket knowing that I did the right thing.",
            "That is so so amazing",
            "I think that he was overreacting or was hoping for the worst tbh",
            "Incel",
            "Meow",
            "Why were they crying in unison though? I don't get that part",
            "You’re a legend",
            "These can’t be real words from a human being",
            "Meow",
            "Thank goodness you defended yourself.",
            "NTA",
            "[deleted]",
            "This reads like a rant from LISA",
            "Redditors: in Reddit clickbait doesn't exist\n\nReddit:",
            "NTA",
            "NTA",
            "I almost had sex earlier today\n\nI went to the supermarket earlier today, to buy some cheese and bacon, you know? So I went up to the girl working there and she said: \"Good morning, how can I help you?\"\n\nI couldn't believe this naughty bitch was offering herself to me at 7 am, but I managed to keep myself calm and said: \"Good morning. I want 300g of mozzarella cheese and 300g of bacon please.\"\n\nShe started working on my order, and after a while she came to me and said \"Sir, I acidentally put 350g of cheese instead of 300g. Can I leave it or do you want me to take some off?\" \n\nHoly fucking shit. I couldn't believe what this cum-addicted slut just said. She knew I only wanted 300g of cheese, but instead of giving me what I asked for she decided to try to have sex with me. I'm gonna explain it to you: what's the difference between 300g and 350g of cheese? That's right, 50 grams. What else has 50 grams? Yes, that's the average weight of a condom packaging, and also the average amount of sperm expelled during a sexual act. And worst of all, do you know which sentence has 50 letters? \"Oh daddy please destroy my pussy and cum in my little slut ass\".\n\nI was shocked at the audacity of this whore, but I was better than this. I told her to take a little bit of cheese off, and she said: \"is 308g alright sir?\" I was shaking and sharting at this point. I couldn't believe she was humiliating herself like this. Do you know what has 8 letters? \"I love you\". But I didn't love her, I didn't love this attention deprived thot back. So I just said: \"I'm not going to give in to your schemes. You should value yourself more, you are better than this\". \n\nAs I was paying for my products at the cashier I could hear a great commotion, and I saw that the girl and all the other female employees were crying in unison. I left the supermarket knowing that I did the right thing.",
            "As a libertarian, NTA",
            " \n\nI went to the supermarket earlier today, to buy some cheese and bacon, you know? So I went up to the girl working there and she said: \"Good morning, how can I help you?\"\n\nI couldn't believe this naughty bitch was offering herself to me at 7 am, but I managed to keep myself calm and said: \"Good morning. I want 300g of mozzarella cheese and 300g of bacon please.\"\n\nShe started working on my order, and after a while she came to me and said \"Sir, I acidentally put 350g of cheese instead of 300g. Can I leave it or do you want me to take some off?\"\n\nHoly fucking shit. I couldn't believe what this cum-addicted slut just said. She knew I only wanted 300g of cheese, but instead of giving me what I asked for she decided to try to have sex with me. I'm gonna explain it to you: what's the difference between 300g and 350g of cheese? That's right, 50 grams. What else has 50 grams? Yes, that's the average weight of a condom packaging, and also the average amount of sperm expelled during a sexual act. And worst of all, do you know which sentence has 50 letters? \"Oh daddy please destroy my pussy and cum in my little slut ass\".\n\nI was shocked at the audacity of this whore, but I was better than this. I told her to take a little bit of cheese off, and she said: \"is 308g alright sir?\" I was shaking and sharting at this point. I couldn't believe she was humiliating herself like this. Do you know what has 8 letters? \"I love you\". But I didn't love her, I didn't love this attention deprived thot back. So I just said: \"I'm not going to give in to your schemes. You should value yourself more, you are better than this\".\n\nAs I was paying for my products at the cashier I could hear a great commotion, and I saw that the girl and all the other female employees were crying in unison. I left the supermarket knowing that I did the right thing.",
            "LOL!!\nThat was so funny made my day",
            "Cringe.",
            "[deleted]"
        ]
    },
    {
        "post_id": "c7ui50",
        "author": "Eklajarris",
        "title": "Pride Month🏳️‍🌈 is Over",
        "url": "https://www.reddit.com/r/copypasta/comments/c7ui50/pride_month_is_over/",
        "score": 14300,
        "num_comments": 388,
        "created_utc": 1561996823.0,
        "selftext": "🚨ALERT🚨 🚨ALERT🚨\n\nPRIDE 🏳️‍🌈 MONTH🗓 IS OFFICIALLY OVER❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW ILLEGAL TO BE #GAY 🏳️‍🌈 ANYWHERE ON STRAIGHT📏 MOTHER EARTH 🌎🌐🌍🌏\n\nBISEXUALS MUST HEAD TO YOUR NEAREST GOVERNMENT BUILDING 🎟 AND RECEIVE A \"Bi-Ticket Admission Allowance System Check in Mark\" TO BE PUT UNDER EXAMINATION 🔍 TO DETERMINE IF YOU ARE TO BE LEFT IN THE GENE POOL. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WILL BE INSPECTING ALL RESIDENTS🏘 OF THE UNITED STATES OF AMERICA 🇳🇺🇳🇺🇳🇺 TO SEARCH FOR ANY GAY ACTIVITY\n\nANY HOMOSEXUAL ACTIVITY CAN WARRANT ARREST🔒👮‍♂️OR POSSIBLE ☠DEATH☠ PENALTY\n\nSTAY VIGILANT AND STRAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
        "permalink": "/r/copypasta/comments/c7ui50/pride_month_is_over/",
        "comments": [
            "^GAYSTAPO OPEN UP",
            "🚨ALERT🚨 🚨ALERT🚨\n\nPRIDE 🏳️‍🌈 MONTH🗓 IS OFFICIALLY OVER❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW ILLEGAL TO BE #GAY 🏳️‍🌈 ANYWHERE ON STRAIGHT📏 MOTHER EARTH 🌎🌐🌍🌏\n\nBISEXUALS MUST HEAD TO YOUR NEAREST GOVERNMENT BUILDING 🎟 AND RECEIVE A \"Bi-Ticket Admission Allowance System Check in Mark\" TO BE PUT UNDER EXAMINATION 🔍 TO DETERMINE IF YOU ARE TO BE LEFT IN THE GENE POOL. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WILL BE INSPECTING ALL RESIDENTS🏘 OF THE UNITED STATES OF AMERICA 🇳🇺🇳🇺🇳🇺 TO SEARCH FOR ANY GAY ACTIVITY\n\nANY HOMOSEXUAL ACTIVITY CAN WARRANT ARREST🔒👮‍♂️OR POSSIBLE ☠DEATH☠ PENALTY\n\nSTAY VIGILANT AND STRAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "“GAYSTAPO” 😂😂😂",
            "****GAYSTAPO**** omg it’s the nazis #2",
            "Alert\n\nDaily Prevention] He's a ruler\n\nChildren taken away? And women [? ] Not:\n\n# GAY is illegal [? ] Everywhere there is a mom\n\nSHOWSOME has the following features. Ticket Ticket [? ] [? To determine whether you want to return to the pool.\n\n[? ] HAYSTAPO [? ] [? ] [? ] We check every US citizen to find gambling services\n\nDoes homosexuality agree with work [? Or loss of death?\n\nDuring the owner's diet [? ] [? ] [? ] [? ]",
            "🚨AWEWT🚨 🚨AWEWT🚨\n\nPWIDE 🏳️‍🌈 MONTH🗓 IS OFFICIAWWY OVEW❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW IWWEGAW TO BE #GAY 🏳️‍🌈 ANYWHEWE ON STWAIGHT📏 MOTHEW EAWTH 🌎🌐🌍🌏\n\nBISEXUAWS MUST HEAD TO YOUW NEAWEST GOVEWNMENT BUIWDING 🎟 AND WECEIVE A \"Bi-Ticket Admission Awwowance System Check in Mawk\" TO BE PUT UNDEW EXAMINATION 🔍 TO DETEWMINE IF YOU AWE TO BE WEFT IN THE GENE POOW. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WIWW BE INSPECTING AWW WESIDENTS🏘 OF THE UNITED STATES OF AMEWICA 🇳🇺🇳🇺🇳🇺 TO SEAWCH FOW ANY GAY ACTIVITY\n\nANY HOMOSEXUAW ACTIVITY CAN WAWWANT AWWEST🔒👮‍♂️OW POSSIBWE ☠DEATH☠ PENAWTY\n\nSTAY VIGIWANT AND STWAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "After Pride Month all companies have to post this on social media",
            "Are all these countries anti gay?",
            "Better with this emoji 🏳️‍🌈⃠",
            "I mean, this is how it is in some countries, namely the 3rd world ones. My acquaintance (gay), who was from Egypt, got doxxed by somebody on the internet, then imprisoned by the government. He was a digital artist with a decently sized Twitter following. Been about 2 years since I last heard of him.",
            "🇨🇦 time",
            "Guys, I went to my nearest government building, but they were all out of admission tickets! What do I do?",
            "companies on July 1st be like",
            "this copypasta got me in trouble with my WoW guild AMA",
            "is asexuality allowed?",
            "Big companies when pride month is over **GAY IS GROSS EWWWW**",
            "I just shot and killed both of my dad's because they're 100% gay. Just waiting for the Gaystapo to come and clean up the mess and give me my $1Billion reward 😎",
            "I took the time to translate this masterpeice into norwegian:  \n\n\n 🚨ALARM🚨 🚨ALARM🚨  \n\n\nPRIDEMÅNEDEN 🏳️‍🌈🗓 ER OFFISIELT OVER❌  \n\n\nMENN ♂️ OG KVINNER ♀️ AV NASJONEN🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:  \n\n\nDET ER NÅ ULOVLIG Å VÆRE #HOMO 🏳️‍🌈 OVERALT PÅ HETERO 📏 MODER JORD🌎🌐🌍🌏  \n\n\nBISEKSUELLE MÅ DRA TIL NÆRMESTE REGJERINGSBYGG🎟 OG MÅ MOTTA EN \"Bi-Billett Inngangs Tillatelsessystem Sjekk-Inn Merke\" FOR Å BLI SATT UNDER EKSAMINASJON🔍 FOR Å AVGJØRE OM DU SKAL BLI VÆRENDE I DET GENETISKE BASSENGET.🤽‍♂️🤽‍♀️   \n\n\n🏳️‍🌈❌GAYSTAPO ❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 VIL INSPISERE ALLE INNBYGGERE 🏘 AV AMERIKAS FORENTE STATER 🇳🇺🇳🇺🇳🇺 FOR Å LETE ETTER NOE HOMOFIL AKTIVITET.  \n\n\nALL HOMOSEKSUELL AKTIVITET KAN STRAFFES MED ARRESTASJON🔒👮‍♂️ MEN OGSÅ MULIGENS ☠DØDSTRAFF☠  \n\n\nVÆR OPPMERKSOM OG HETERO📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "> Russian or Chinese flags not on here\n\nGuess it does not apply to me!",
            "[deleted]",
            "Is... is the Swedish flag meant to be up there?",
            "This is pretty gay tbh",
            ">nation\n\n>🇮🇱\n\nthere 👉 is ❌something wrong 😒😡",
            "🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠ 🏳‍🌈⃠",
            "As a gay this is funny as shit damn",
            "I didn't see the canadian flag so do I just ignore this alarm?",
            "Asexuals are okay but y'all on fucking thin ice",
            "Ehhhh😅 just came out as bi",
            "I watched a Bailey Jay video once, what does that make me?",
            "Bad time to be gay in the isle of mann",
            "The gaystapo got teamswapped to blu",
            "👌",
            "The flag for Niue, which may show as the letters NU on some platforms.",
            "Shit i need my ticket",
            "I guess I’m heading to the government building",
            "[deleted]",
            "Im mostly straight but give me the death penalty anyway",
            "Wait hold Up NI🅱️🅱️A Earth 🌎 Aint no Flat Straight thing\n\n\n\nIts round 🤭🌐🌐🌐🌐🌐⭕️☣️🌎🌍🌏\n\n\n\nThats one Boy 🌚🌑🌕🌖🌏🌒",
            "As a Dutch person, it seems my nation isn't included in this",
            "💁‍♂️🛑",
            "🦀 Pride Month 🦀 is Over 🦀",
            "🦀🦀🦀Pride month is over🦀🦀🦀 \n\nmiss me with that gay shit",
            "🏳‍🌈⃠",
            "I'll admit it, I'm gay, just shoot me already, you'll do me a big fuckin favor",
            "Nta",
            "Priceless",
            "Emoji",
            "Emoji",
            "gun",
            "gun",
            "Imagine if trump tweets this",
            "What about the L's and the T's?",
            "Turn up for corn month",
            "Are they anal examinations?",
            "Oh no oh god I better run",
            "Well shit.\n\nI’m female.\n\nI got a girlfriend today.\n\n***runs***",
            ">NATIONCIBWBZCMBRCCCMCKCFCIFKEAETFIDJFMHMGPIEILIMGTIOHKGYMPLRMOMCLVMLMLNIPHOMNUOMNEPEPFNASHSXQASGQASESSSXSH",
            "back into the closet for me, boys 🥺🥺",
            "Amen",
            "too real",
            "u/uwutranslator",
            "july is war month",
            "🚨ALERT🚨 🚨ALERT🚨\n\nPRIDE 🏳️‍🌈 MONTH🗓 IS OFFICIALLY OVER❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW ILLEGAL TO BE #GAY 🏳️‍🌈 ANYWHERE ON STRAIGHT📏 MOTHER EARTH 🌎🌐🌍🌏\n\nBISEXUALS MUST HEAD TO YOUR NEAREST GOVERNMENT BUILDING 🎟 AND RECEIVE A \"Bi-Ticket Admission Allowance System Check in Mark\" TO BE PUT UNDER EXAMINATION 🔍 TO DETERMINE IF YOU ARE TO BE LEFT IN THE GENE POOL. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WILL BE INSPECTING ALL RESIDENTS🏘 OF AUSTRALIA 🇦🇺🇦🇺🇦🇺 TO SEARCH FOR ANY GAY ACTIVITY\n\nANY HOMOSEXUAL ACTIVITY CAN WARRANT ARREST🔒👮‍♂️OR POSSIBLE ☠DEATH☠ PENALTY\n\nSTAY VIGILANT AND STRAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "meanwhile in syria",
            "YOU'LL NEVER CATCH ME A- STRAIGHT",
            "🏳️‍🌈⃠",
            " u/brokenTranslateBot",
            "Yet I still have a fucking rainbow fan in my room",
            "Gay russians should get to the gaylag",
            "oof my gayyyyyyyy",
            "!shirtbot",
            "How do u copy and paste it? What’s the point of cop pee pasta if you can’t copy it?",
            "u/uwutranslator",
            "u/uwutranslator",
            "Lemme post this on tumblur",
            "How could you forget \"Glory to Arstozka\" in the end?",
            "🚨ALERT🚨 🚨ALERT🚨\n\nPRIDE 🏳️‍🌈 MONTH🗓 IS OFFICIALLY OVER❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW ILLEGAL TO BE #GAY 🏳️‍🌈 ANYWHERE ON STRAIGHT📏 MOTHER EARTH 🌎🌐🌍🌏\n\nBISEXUALS MUST HEAD TO YOUR NEAREST GOVERNMENT BUILDING 🎟 AND RECEIVE A \"Bi-Ticket Admission Allowance System Check in Mark\" TO BE PUT UNDER EXAMINATION 🔍 TO DETERMINE IF YOU ARE TO BE LEFT IN THE GENE POOL. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WILL BE INSPECTING ALL RESIDENTS🏘 OF THE UNITED STATES OF AMERICA 🇳🇺🇳🇺🇳🇺 TO SEARCH FOR ANY GAY ACTIVITY\n\nANY HOMOSEXUAL ACTIVITY CAN WARRANT ARREST🔒👮‍♂️OR POSSIBLE ☠DEATH☠ PENALTY\n\nSTAY VIGILANT AND STRAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "United Straights of America",
            "yo what the fuck is this 🏳️‍🌈⃠?????",
            "Emoji emoji emoji",
            "u/uwutranslator",
            "But what about... trans people?",
            "The United Straights of America",
            "~I'm gAy LooK aT Me~",
            "[deleted]",
            "Finally it’s over",
            " You know we extended it to July, right?",
            "I FUCKING  SENT THIS TO MY FAMILY GROUPCHAT BY ACCIDENT",
            "Cringe.",
            "🚨ALERT🚨 🚨ALERT🚨\n\nPRIDE 🏳️‍🌈 MONTH🗓 IS OFFICIALLY OVER❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW ILLEGAL TO BE #GAY 🏳️‍🌈 ANYWHERE ON STRAIGHT📏 MOTHER EARTH 🌎🌐🌍🌏\n\nBISEXUALS MUST HEAD TO YOUR NEAREST GOVERNMENT BUILDING 🎟 AND RECEIVE A \"Bi-Ticket Admission Allowance System Check in Mark\" TO BE PUT UNDER EXAMINATION 🔍 TO DETERMINE IF YOU ARE TO BE LEFT IN THE GENE POOL. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WILL BE INSPECTING ALL RESIDENTS🏘 OF THE UNITED STATES OF AMERICA 🇳🇺🇳🇺🇳🇺 TO SEARCH FOR ANY GAY ACTIVITY\n\nANY HOMOSEXUAL ACTIVITY CAN WARRANT ARREST🔒👮‍♂️OR POSSIBLE ☠DEATH☠ PENALTY\n\nSTAY VIGILANT AND STRAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "This is pretty cringy",
            "Alert\n\nDaily Prevention] He's a ruler\n\nChildren taken away? And women [? ] Not:\n\n# GAY is illegal [? ] Everywhere there is a mom\n\nSHOWSOME has the following features. Ticket Ticket [? ] [? To determine whether you want to return to the pool.\n\n[? ] HAYSTAPO [? ] [? ] [? ] We check every US citizen to find gambling services\n\nDoes homosexuality agree with work [? Or loss of death?\n\nDuring the owner's diet [? ] [? ] [? ] [? ]",
            "If they escape to  Iran they're both rescued and done for",
            "Read this in drumphs voice",
            "Cringiest shit",
            " \n\n🚨ALERT🚨 🚨ALERT🚨\n\nPRIDE 🏳️‍🌈 MONTH🗓 IS OFFICIALLY OVER❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW ILLEGAL TO BE #GAY 🏳️‍🌈 ANYWHERE ON STRAIGHT📏 MOTHER EARTH 🌎🌐🌍🌏\n\nBISEXUALS MUST HEAD TO YOUR NEAREST GOVERNMENT BUILDING 🎟 AND RECEIVE A \"Bi-Ticket Admission Allowance System Check in Mark\" TO BE PUT UNDER EXAMINATION 🔍 TO DETERMINE IF YOU ARE TO BE LEFT IN THE GENE POOL. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WILL BE INSPECTING ALL RESIDENTS🏘 OF THE UNITED STATES OF AMERICA 🇳🇺🇳🇺🇳🇺 TO SEARCH FOR ANY GAY ACTIVITY\n\nANY HOMOSEXUAL ACTIVITY CAN WARRANT ARREST🔒👮‍♂️OR POSSIBLE ☠DEATH☠ PENALTY\n\nSTAY VIGILANT AND STRAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "This gave me cancer and AIDS",
            "Wait what the fuck, this isn't /r/emojipasta",
            "🚨ALERT🚨 🚨ALERT🚨\n\nPRIDE 🏳️‍🌈 MONTH🗓 IS OFFICIALLY OVER❌\n\nMEN ♂️ AND WOMEN ♀️ OF THE NATION🇨🇮🇧🇼🇧🇿🇨🇲🇧🇷🇨🇨🇨🇲🇨🇰🇨🇫🇨🇮🇫🇰🇪🇦🇪🇹🇫🇮🇩🇯🇫🇲🇭🇲🇬🇵🇮🇪🇮🇱🇮🇲🇬🇹🇮🇴🇭🇰🇬🇾🇲🇵🇱🇷🇲🇴🇲🇨🇱🇻🇲🇱🇲🇱🇳🇮🇵🇭🇴🇲🇳🇺🇴🇲🇳🇪🇵🇪🇵🇫🇳🇦🇸🇭🇸🇽🇶🇦🇸🇬🇶🇦🇸🇪🇸🇸🇸🇽🇸🇭:\n\nIT IS NOW ILLEGAL TO BE #GAY 🏳️‍🌈 ANYWHERE ON STRAIGHT📏 MOTHER EARTH 🌎🌐🌍🌏\n\nBISEXUALS MUST HEAD TO YOUR NEAREST GOVERNMENT BUILDING 🎟 AND RECEIVE A \"Bi-Ticket Admission Allowance System Check in Mark\" TO BE PUT UNDER EXAMINATION 🔍 TO DETERMINE IF YOU ARE TO BE LEFT IN THE GENE POOL. 🤽‍♂️🤽‍♀️\n\nTHE 🏳️‍🌈❌GAYSTAPO❌🏳️‍🌈 👮‍♂️👮‍♂️🚔🚔 WILL BE INSPECTING ALL RESIDENTS🏘 OF THE UNITED STATES OF AMERICA 🇳🇺🇳🇺🇳🇺 TO SEARCH FOR ANY GAY ACTIVITY\n\nANY HOMOSEXUAL ACTIVITY CAN WARRANT ARREST🔒👮‍♂️OR POSSIBLE ☠DEATH☠ PENALTY\n\nSTAY VIGILANT AND STRAIGHT📏📏❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌🏳️‍🌈❌",
            "Bhai gaali galoch wale copy paste ki neend h help please"
        ]
    },
    {
        "post_id": "frkadi",
        "author": "KansasCityChief",
        "title": "Greta Thunberg is the reason I work out.",
        "url": "https://www.reddit.com/r/copypasta/comments/frkadi/greta_thunberg_is_the_reason_i_work_out/",
        "score": 14128,
        "num_comments": 239,
        "created_utc": 1585542818.0,
        "selftext": "Greta Thunberg is the reason I work out. I have this fantasy where we start talking at the UN climate summit after party. We exchange a few pleasantries. She asks what I do. I say I loved her on CNN She laughs. I get my drink.  \n\"Well, see ya,\" I say and walk away. I've got her attention now. How many guys voluntarily leave a conversation with Greta Thunberg? She touches her neck as she watches me leave.  \nLater, as the night's dragged on and the coterie of gorgeous narcissists grows increasingly loose, she finds me on the balcony, my bowtie undone, smoking a cigarette.  \n\"Got a spare?\" she asks.  \n\"What's in it for me?\" I say as I hand her one of my little white ladies. She smiles.  \n\"Conversation with me, duh.\"  \nI laugh.  \n\"What's so funny?\" she protests.  \n\"Nothing, nothing... It's just... don't you grow tired of the egos?\"  \n\"You get used to it,\" she says, lighting her cigarette and handing me back the lighter.  \n\"What would you do if you weren't a climate change activist?\" I ask.  \n\"Teaching, I think.\"  \n\"And if I was your student, what would I be learning?\"  \n\"Discipline,\" she says quickly, looking up into my eyes, before changing the subject. \"Where are you from?\"  \n\"Mexico\" I say.  \n\"Oh wow. That's lovely.\"  \n\"It's OK,\" I admit. \"Not everything is to my liking.\"  \n\"What could possibly be not to your liking in Mexico?\" she inquires.  \n\"I don't like sand,\" I tell her. \"It's coarse and rough and irritating and it gets everywhere.\"",
        "permalink": "/r/copypasta/comments/frkadi/greta_thunberg_is_the_reason_i_work_out/",
        "comments": [
            "[deleted]",
            "god i love this. is there subredit dedicated for this like some fanfic and then it have punchline",
            "I never thought I'd see self insert thunberg fanfiction.",
            "Greta Thunberg is the reason I work out. I have this fantasy where we start talking at the UN climate summit after party. We exchange a few pleasantries. She asks what I do. I say I loved her on CNN She laughs. I get my drink.  \n\"Well, see ya,\" I say and walk away. I've got her attention now. How many guys voluntarily leave a conversation with Greta Thunberg? She touches her neck as she watches me leave.  \nLater, as the night's dragged on and the coterie of gorgeous narcissists grows increasingly loose, she finds me on the balcony, my bowtie undone, smoking a cigarette.  \n\"Got a spare?\" she asks.  \n\"What's in it for me?\" I say as I hand her one of my little white ladies. She smiles.  \n\"Conversation with me, duh.\"  \nI laugh.  \n\"What's so funny?\" she protests.  \n\"Nothing, nothing... It's just... don't you grow tired of the egos?\"  \n\"You get used to it,\" she says, lighting her cigarette and handing me back the lighter.  \n\"What would you do if you weren't a climate change activist?\" I ask.  \n\"Teaching, I think.\"  \n\"And if I was your student, what would I be learning?\"  \n\"Discipline,\" she says quickly, looking up into my eyes, before changing the subject. \"Where are you from?\"  \n\"Mexico\" I say.  \n\"Oh wow. That's lovely.\"  \n\"It's OK,\" I admit. \"Not everything is to my liking.\"  \n\"What could possibly be not to your liking in Mexico?\" she inquires.  \n\"I don't like sand,\" I tell her. \"It's coarse and rough and irritating and it gets everywhere.\"",
            "This is the best worst thing I've ever read.",
            "I expected dominatrix fetish porn. Disappointed",
            "They had us in the first 99 fucking percent, ngl.",
            "Not like here. Here everything is soft...and smooth.",
            "Gweta Thunbewg is the weason I wowk out. I have this fantasy whewe we stawt tawking at the UN cwimate summit aftew pawty. We exchange a few pweasantwies. She asks what I do. I say I woved hew on CNN She waughs. I get my dwink.  \n\"Weww, see ya,\" I say and wawk away. I've got hew attention now. How many guys vowuntawiwy weave a convewsation with Gweta Thunbewg? She touches hew neck as she watches me weave.  \nWatew, as the night's dwagged on and the cotewie of gowgeous nawcissists gwows incweasingwy woose, she finds me on the bawcony, my bowtie undone, smoking a cigawette.  \n\"Got a spawe?\" she asks.  \n\"What's in it fow me?\" I say as I hand hew one of my wittwe white wadies. She smiwes.  \n\"Convewsation with me, duh.\"  \nI waugh.  \n\"What's so funny?\" she pwotests.  \n\"Nothing, nothing... It's just... don't you gwow tiwed of the egos?\"  \n\"You get used to it,\" she says, wighting hew cigawette and handing me back the wightew.  \n\"What wouwd you do if you wewen't a cwimate change activist?\" I ask.  \n\"Teaching, I think.\"  \n\"And if I was youw student, what wouwd I be weawning?\"  \n\"Discipwine,\" she says quickwy, wooking up into my eyes, befowe changing the subject. \"Whewe awe you fwom?\"  \n\"Mexico\" I say.  \n\"Oh wow. That's wovewy.\"  \n\"It's OK,\" I admit. \"Not evewything is to my wiking.\"  \n\"What couwd possibwy be not to youw wiking in Mexico?\" she inquiwes.  \n\"I don't wike sand,\" I teww hew. \"It's coawse and wough and iwwitating and it gets evewywhewe.\"",
            "Till the punchline it feels like some kind of a Tarantino movie",
            "y tho",
            "Never have i been happier that this didn't turn into a scene where underage girls shouldn't be in",
            "what the fuck? this shit burned my eyes and just reading this. even if it's a punchline the first 99% got me choking.",
            "What's the original format from?",
            "Ok here me out tho right. The fact that this shit exists in the internet unironically makes me angry. It's just so fuckig unrealistic. Greta has aspergers. She herself has said a gazillion times one of the ways it manifests is not speaking when there's nothing pertinent to say. I dont know because I dont know her obviously, but I'm pretty sure she doesn't fucking flirt like some high society chick. Let alone I'm pretty sure shes never said or done anything sexual in her life.\n\nAs an environmentalist, something I respect about her is that she appears to be completely viceless.  Which I'd like to say I am. But I like to make drinks and drink beer and wine and such. And obviously.im an 18 year old boy who lives with his gf and has access to the internet, so I'll let you fill in the blanks. Point is, she doesn't have regular weaknesses, that makes her powerful.",
            "I don't get it",
            "It was hilarious until the punchline. I hate these bait and switch jokes Reddit love so much that usually can be summed up with \"ooh I got the reference!\"",
            "After that I told her a story:\n\n“Did you ever hear of the tragedy of Darth Plagueis the Wise?",
            "FBI!!! HANDS WHE......re i can see.... em? *confused agents looking at each other*",
            "okay but like why would Greta Thunberg smoke a cigarette.",
            "This is a good one",
            "God dammit",
            "this is good writing though",
            "this is by far the best thing I've read in awhile",
            "Is that it?",
            "Ah, yes. This is a story you wouldn't hear from a Jedi.",
            "[This](https://www.reddit.com/r/copypasta/comments/e87h4r/greta/) is literally the exact same post with Australia instead of Mexico, posted 3 months ago. Sad that it got 4 upvotes and yours has crossed 10.7k. Please give credit(even for a Copypasta since that guy prolly made it) where it is due",
            "God fucking damn it",
            "This makes me more proud of my city than our Super Bowl win.",
            "I like the ending lol",
            "Man, I hope Greta isn’t a smoker of cigarettes. She needs to stay alive for as long as possible. A long battle is ahead for our generations.",
            "why does this exist",
            "Op it should say \"the coterie of gorgeous narcissists wears thin\" rather than grows loose",
            "Oops, I just posted this on her Facebook page.",
            "Greta Thunberg is the reason I work out. I have this fantasy where we start talking at the UN climate summit after party. We exchange a few pleasantries. She asks what I do. I say I loved her on CNN She laughs. I get my drink.  \n\"Well, see ya,\" I say and walk away. I've got her attention now. How many guys voluntarily leave a conversation with Greta Thunberg? She touches her neck as she watches me leave.  \nLater, as the night's dragged on and the coterie of gorgeous narcissists grows increasingly loose, she finds me on the balcony, my bowtie undone, smoking a cigarette.  \n\"Got a spare?\" she asks.  \n\"What's in it for me?\" I say as I hand her one of my little white ladies. She smiles.  \n\"Conversation with me, duh.\"  \nI laugh.  \n\"What's so funny?\" she protests.  \n\"Nothing, nothing... It's just... don't you grow tired of the egos?\"  \n\"You get used to it,\" she says, lighting her cigarette and handing me back the lighter.  \n\"What would you do if you weren't a climate change activist?\" I ask.  \n\"Teaching, I think.\"  \n\"And if I was your student, what would I be learning?\"  \n\"Discipline,\" she says quickly, looking up into my eyes, before changing the subject. \"Where are you from?\"  \n\"Mexico\" I say.  \n\"Oh wow. That's lovely.\"  \n\"It's OK,\" I admit. \"Not everything is to my liking.\"  \n\"What could possibly be not to your liking in Mexico?\" she inquires.  \n\"I don't like sand,\" I tell her. \"It's coarse and rough and irritating and it gets everywhere.\"",
            "Thank you this cheered up my morning",
            "[deleted]",
            "huh",
            "God is dead. God remains dead. And we have killed him. How shall we comfort ourselves, the murderers of all murderers?? what was holiest and mightiest of all that the world has yet owned has bled to death under our knives. who will wipe this blood off us?? what water is there for us to clean ourselves?? what festivals of atonement, what sacred games shall we have to invent?? is not the greatness of this deed too great for us?? must we ourselves not become gods simply to appear worthy of it?",
            "Oh God",
            ">she protests\n\n\nIt be like that",
            "I'm sure I read the same thing but with Natalie Portman.",
            "This is cringe",
            "This is just so absolutely fucking cursed what the fuck",
            "I know this is gonna make menlooknloke a dumbass but who's great Thunberg?",
            "Oh yes Greta thunberg 😩😩💦 please fuck western Canada’s worsening economy so hard it’s forced to join the us 🍆🍑",
            "cock",
            "WAIT NOOOOOOOOO SHES 17 BRO!!!",
            "Hello there",
            "Can someone explain the punchline",
            "sorry i don't get it..",
            "The figurehead of the safety of this planet is yet another entity to be stolen from and destroyed",
            "I don’t get the punchline. Little help?",
            "I don't get it",
            "Wasnt this one originally about natalie Portman lol",
            "Someone's been reading too much wattpad",
            "Greta Thunberg is the reason I workout in nature instead of going to the gym.",
            "Bruh she’s 17",
            "She's 17 you pedo",
            "I saw this exact same copypasta but with Natalie Portman and talking about Star Wars, which made the punchline funnier",
            "Bruh content",
            "Cock",
            "No",
            " Greta Thunberg is the reason I work out. I have this fantasy where we  start talking at the UN climate summit after party. We exchange a few  pleasantries. She asks what I do. I say I loved her on CNN She laughs. I  get my drink.  \n\"Well, see ya,\" I say and walk away. I've got her  attention now. How many guys voluntarily leave a conversation with Greta  Thunberg? She touches her neck as she watches me leave.  \nLater, as  the night's dragged on and the coterie of gorgeous narcissists grows  increasingly loose, she finds me on the balcony, my bowtie undone,  smoking a cigarette.  \n\"Got a spare?\" she asks.  \n\"What's in it for me?\" I say as I hand her one of my little white ladies. She smiles.  \n\"Conversation with me, duh.\"  \nI laugh.  \n\"What's so funny?\" she protests.  \n\"Nothing, nothing... It's just... don't you grow tired of the egos?\"  \n\"You get used to it,\" she says, lighting her cigarette and handing me back the lighter.  \n\"What would you do if you weren't a climate change activist?\" I ask.  \n\"Teaching, I think.\"  \n\"And if I was your student, what would I be learning?\"  \n\"Discipline,\" she says quickly, looking up into my eyes, before changing the subject. \"Where are you from?\"  \n\"Mexico\" I say.  \n\"Oh wow. That's lovely.\"  \n\"It's OK,\" I admit. \"Not everything is to my liking.\"  \n\"What could possibly be not to your liking in Mexico?\" she inquires.  \n\"I don't like sand,\" I tell her. \"It's coarse and rough and irritating and it gets everywhere.\"",
            " Greta Thunberg is the reason I work out. I have this fantasy where we  start talking at the UN climate summit after party. We exchange a few  pleasantries. She asks what I do. I say I loved her on CNN She laughs. I  get my drink.  \n\"Well, see ya,\" I say and walk away. I've got her  attention now. How many guys voluntarily leave a conversation with Greta  Thunberg? She touches her neck as she watches me leave.  \nLater, as  the night's dragged on and the coterie of gorgeous narcissists grows  increasingly loose, she finds me on the balcony, my bowtie undone,  smoking a cigarette.  \n\"Got a spare?\" she asks.  \n\"What's in it for me?\" I say as I hand her one of my little white ladies. She smiles.  \n\"Conversation with me, duh.\"  \nI laugh.  \n\"What's so funny?\" she protests.  \n\"Nothing, nothing... It's just... don't you grow tired of the egos?\"  \n\"You get used to it,\" she says, lighting her cigarette and handing me back the lighter.  \n\"What would you do if you weren't a climate change activist?\" I ask.  \n\"Teaching, I think.\"  \n\"And if I was your student, what would I be learning?\"  \n\"Discipline,\" she says quickly, looking up into my eyes, before changing the subject. \"Where are you from?\"  \n\"Mexico\" I say.  \n\"Oh wow. That's lovely.\"  \n\"It's OK,\" I admit. \"Not everything is to my liking.\"  \n\"What could possibly be not to your liking in Mexico?\" she inquires.  \n\"I don't like sand,\" I tell her. \"It's coarse and rough and irritating and it gets everywhere.\""
        ]
    }
]