[
    {
        "post_id": "f6b6wj",
        "author": "PieGuy1793",
        "title": "Being a hentai actress must be weird.",
        "url": "https://www.reddit.com/r/copypasta/comments/f6b6wj/being_a_hentai_actress_must_be_weird/",
        "score": 10974,
        "num_comments": 507,
        "created_utc": 1582121702.0,
        "selftext": "Being a hentai actress must be so weird. Imagine this: you’re in a soundproof room pleasurably screaming into an 800,000¥ microphone about how much you love old man dick at 10:47 AM on a Tuesday in October while your 45-year-old boss oversees you through a glass window from the other room. You eventually look up after 2 hours of practicing your unnaturally high-pitched moans and see him give you a big thumbs up as you pretend to have an orgasm.",
        "permalink": "/r/copypasta/comments/f6b6wj/being_a_hentai_actress_must_be_weird/",
        "comments": [
            "Rumor has it the Dan Green, the voice of Yugi Moto, did hentai voice work.  I wonder if the King of Games remembers his time as the King of Anime Tiddy fondly?",
            "Being a hentai actress must be so weird. Imagine this: you’re in a soundproof room pleasurably screaming into an 800,000¥ microphone about how much you love old man dick at 10:47 AM on a Tuesday in October well your 45-year-old boss oversees you through a glass window from the other room. You eventually look up after 2 hours of practicing your unnaturally high-pitched moans and see him give you a big thumbs up as you pretend to have an orgasm.",
            "u/elonmustardgas\n\nmake the auto mod say this when someone says hentai",
            "Akchually there's a manga about a girl who become a VA in an eroge. The contents of the entire manga (and chapters) is basically this, I'm not gonna lie.",
            "The 800,000¥ thing sells this.",
            "Being a hentai actwess must be so weiwd. Imagine this: you’we in a soundpwoof woom pweasuwabwy scweaming into an 800,000¥ micwophone about how much you wove owd man dick at 10:47 AM on a Tuesday in Octobew weww youw 45-yeaw-owd boss ovewsees you thwough a gwass window fwom the othew woom. You eventuawwy wook up aftew 2 houws of pwacticing youw unnatuwawwy high-pitched moans and see him give you a big thumbs up as you pwetend to have an owgasm.",
            "is this a showerthought?",
            "I feel strange having witnessed the birth of this pasta.",
            "Dead",
            "Bot who replied is gae",
            "Man I actually thought about that a few years back",
            "So if you say dead or cock, the bot auto replies?",
            "This made me think of this clip. Very funny VO stuff: https://www.youtube.com/watch?v=nYjE8wPyu4Q",
            "cock",
            "a few translations later: \n\nInexperienced artists have become avid. They thought it was Tuesday. On October 10, the cost of solar insulation was 800,000 yen. But how much do you like your weaknesses? Remove the 45 minute sound from the window. The other half is honey. Finally, wait a few hours for someone to get sick. It's pretty cool when you get a flower.",
            "[deleted]",
            "Cock",
            "Meow",
            "you forgot the tentacles",
            "balls",
            "penis",
            "Cock",
            "tbh cummy isn't that hot he's kinda gross tbh",
            "Cock",
            "Cock",
            "Mods love cock",
            "Cock",
            "[deleted]",
            "Dead virgin cock",
            "cock",
            "idk sounds like a dream job to me",
            "cock",
            "cock",
            " u/nwordcountbot u/TheMage55",
            "Spo",
            "Sounds a bit specific",
            "cock",
            "cock",
            "Cock?",
            "I THOUght about this the other day",
            "Cock",
            "Cock",
            "Gun",
            "Ok I just felt this one",
            "I thought I was the only one who thought about this holy shit",
            "What in the goddamn fuck did I just read?",
            "u/automoderator is a cock",
            "This sub is for sub humans, really jump off a bridge the whole lot of you.",
            "No no no Sharon, you need to scream “fuck me otaku sensei octopus san” with a bit more sadness. This scene really captures the essence of what Oni Chan’s childhood meant to her...... one more time from the top",
            "Cock",
            "u/nwordcountbot u/soggywalnuts",
            "Hentai cock dead",
            "\\+translateto circleblack",
            "NTA\nYour orgasm your rules",
            "virgin god dead cock",
            "Pretend? oh I don't think so",
            "FUCK YOU, YOU STOLE u/Quack__Up's POST!",
            "what are these fucking comments 😂",
            "Cock",
            "Hentai",
            "I deadass don't know how to respond",
            "[deleted]",
            "Big pp brain",
            "Hey automod, reply if mods are gay and love cock",
            "Cock",
            "Does stuff work?\n\n\nEdit: No? Well, Bruh.",
            "Cock",
            "Being a hentai actress must be so weird. Imagine this: you’re in a soundproof room pleasurably screaming into an 800,000¥ microphone about how much you love old man dick at 10:47 AM on a Tuesday in October well your 45-year-old boss oversees you through a glass window from the other room. You eventually look up after 2 hours of practicing your unnaturally high-pitched moans and see him give you a big thumbs up as you pretend to have an orgasm.",
            "Bruh",
            "Es",
            "cuck",
            "cock"
        ]
    },
    {
        "post_id": "ev61h9",
        "author": "RErudon",
        "title": "From a review on the steam game \"Hentai Nazi\"",
        "url": "https://www.reddit.com/r/copypasta/comments/ev61h9/from_a_review_on_the_steam_game_hentai_nazi/",
        "score": 10977,
        "num_comments": 315,
        "created_utc": 1580220525.0,
        "selftext": "My 97 year old grandfather fought in ww2 and he always used to tell me stories about the ww2. he was just 18 when he faced battle for the first time. So i wanted to show him this game to make him happy about the (good?) old days. My grandfather never been a huge fan of electronic devices. But I managed to get him to play this game on my laptop. I explained everything but he didn't understand it at first but later he learned how to walk in this game. His first impression was... Quiet. And he still was figuring everything out. But after 2 minutes he stood up. And went outside for a walk. When he came back it was time for dinner. then he bursts out crying. \"I fought for this?'' he said. Then he kept on crying. my parents tried to cheer him up. but he kept crying. So we all silently finished eating our food. went home. I felt akward. Sad and ashamed. then I busted a big nut rubbin' it out on this game. 10/10 would bust again",
        "permalink": "/r/copypasta/comments/ev61h9/from_a_review_on_the_steam_game_hentai_nazi/",
        "comments": [
            "This is actually adapted from a much older copypasta, where a guy shows his grandfather the anime \"Girls und Panzer\". This is a pretty unoriginal take on it, to be honest.\n\nEdit: To be precise, the original copypasta stemmed from a viral greentext. I also think that the end part, after the grandfather voices his utter disappointment, might be new, but I can't quite be certain.\n\nEdit 2: Here's a [copy](https://www.reddit.com/r/greentext/comments/77u9ku/anon_shows_his_grandpa_anime/) of the original greentext. Thanks to u/DoubleSlamJam for linking it in a reply to this comment. Personally I think the original is much more amusing than this particular copypasta.",
            "How much is it for the whole fucking stock?",
            "The reviews on this game are gold. Here's another one:\n\nThis game saved my life.\n\nI am 27.\n\nMy ex-wife and I have a daughter together, and adopted our son together. They are now both 4 years old.\n\nWhen we were going through our separation, I found myself lost and miserable. I was self destructive. I got so mad one day from everything spiraling out of my control that I punched some concrete in a moment of overwhelming emotion. That caused me to break my 5th metacarpal in my right hand... my working hand... my games hand.. the hand that I held and carried my children to bed with.. The hand I desperately needed to make sure I could continue to provide.\n\nAfter learning of the severity of my self-inflicted damage, I was borderline suicidal. Keep in mind that just a few months before this, I was the happiest man with no history of depression or anxiety. I have never had fits of rage, or been one to break down and cry, but I was in a low spot that just really buried me from being able to see the light on the other side.\n\nHaving nothing better to do, I searched for a game I could play, ONE HANDED while I recovered. I somehow stumbled upon this game and read some of the reviews. I decided that it had to be worth a shot... I must admit, I didn't beat the game, or play nearly as long as some of you. In fact, I may have only played this game a day or two.. With that being said, after doing so, I had a new found joy and hope for life. I was able to put behind me the pain and suffering that had been cast over me. I was able to experience other peoples joy and happiness. I was able to see the fruits of my \"labor\". I relaxed for 5 ♥♥♥♥ing minutes to this music long enough to realize that I was going to be okay.\n\nAfter coming to that realization, I turned the game off, and I went back to work. It hurt my hand like hell but I was motivated. I stopped feeling so damn sorry for myself, and I became the father I needed to be in that moment, not the weak boy I was behaving as.\n\nToday, I am close friend with my kids mother. We don't fight, or argue, or say hurtful things to each other. We are parents, and friends.\n\nI now have 3 kids. My third child is, wait for it, ALSO 4 YEARS OLD. The woman I am with was going through a very similar situation at the time of my own separation, and we just stumbled in to each others life unexpectedly. We have been in a relationship for a year now, and are very happy together.\n\nMoral of the story, you never know what life holds in store for you, and if I would have given up when all the odds were stacked against me, I wouldn't be where I am today. This silly little game helped me realize that.\n\nThank you",
            "I own that game it’s actually rad",
            "My 97 year old grandfather fought in ww2 and he always used to tell me stories about the ww2. he was just 18 when he faced battle for the first time. So i wanted to show him this game to make him happy about the (good?) old days. My grandfather never been a huge fan of electronic devices. But I managed to get him to play this game on my laptop. I explained everything but he didn't understand it at first but later he learned how to walk in this game. His first impression was... Quiet. And he still was figuring everything out. But after 2 minutes he stood up. And went outside for a walk. When he came back it was time for dinner. then he bursts out crying. \"I fought for this?'' he said. Then he kept on crying. my parents tried to cheer him up. but he kept crying. So we all silently finished eating our food. went home. I felt akward. Sad and ashamed. then I busted a big nut rubbin' it out on this game. 10/10 would bust again",
            "NTA your grandfather your rules🚩🚩🚩",
            "What is wrong with all of these replies lol",
            "Poop",
            "NTA, you deserve custody of your children and your partner is wrong.",
            "Man, I know its a fucking copy pasta, but DANG, it hit me hard. I can't even explain, man.",
            "I saw that review lol",
            "this is a lot like an old Girls und Panzer Greentext",
            "That's an epic Chad game. I love sex",
            "Games",
            "This is one of those once-in-a-lifetime experiences. The time I spent with this video game will stay with me until the day I die. Which as of those moment, mere seconds after completing the game, I wish was this day.\n\nBefore I begin, I would also like to say that I am also a proud owner of the 18+ Nude DLC for this game. After I installed the DLC and restarted the game, I was greeted by the new option on the main menu \"Begin Game with 18+ DLC\", or something along those lines, I don't have it in me to reopen the game and check the exact verbage. Anyway, after what one might describe as furious clicking, the game would not start when I tried to select this option. As such, I cannot fully review this DLC. I hope for a future patch to address this issue.\n\nHentai Nazi only took me 49 minutes to complete, after multiple failed attempts and having to have a friend consult a guide to help me. The controls and general feeling of movement and gunplay are among the worst I've ever experienced in a video game, but surprisingly they were at the very least serviceable. The objective of the game is to collect 14 \"memes\", which are scattered around the map attached to buildings and such, similar to Slender: The Eight Pages. All the while you are accompanied by the soundtrack which is a very loud German anthem on an endless loop with the volume so high that it will not only burst your eardrums but also nuke your braincells.\n\nAnyway, the first time I collected all of the 14 memes and made it to the Hitler fight, I was killed by trying to duck behind cover and being blocked by an invisible wall. The next time I collected all 14 memes and was killed on the way to the boss fight. The third time I made it and used the inside of the church as cover and finally defeated Adolf Hitler himself.\n\nAfter I had spent an adequate amount of time tea bagging his oversized corpse, I made my way painfully up the stairs inside the church to the belltower at the top. It was at this moment I realised there was no reward for completing Hentai Nazi, nor was there any meaning behind my 49 minutes, my 2940 seconds. I attempted to have my character kill themselves, by jumping from the top of the tower. There was no fall damage. As I considered calling a taxi, at what is currently 4AM, into the centre of my town to find a building tall enough to jump off and cause fatal injuries, possibly even a belltower to fully experience the irony, I gave myself the chance to fully reflect upon the game. I have come to the definitive conclusion:\n\nAt least the pantie shots were hot.\n10/10 would recommend.",
            "I love that game",
            "Straight up I bought this game last week. I beat it and that shot is great. Except the music on menu screen...anyone that’s played it will understand",
            "Isn't this an adaptation fron a 4chan copypasta about Girls und Panzer and a British tanker grandpa?",
            "Take note bethesuda  \nThis game has it all, a playable game, graphics that scream TIDDIES, ya got guns, Nazis to shoot, and even a very inexpensive nudity DLC, Todd Howard if you're reading this, Hentai Nazi is how you make a AAA title, Hentai Nazi has less bugs then Fallout 76 which is amazing considering its very high budget of 10$, the gameplay is very fluid the gun sounds are so realistic it actually makes you feel like you're a hentai girl murdering Hitler, the realism in Hentai Nazi is stunning. I'd say this game is even better then Death Stranding, well done!",
            "I feel you, grandpa",
            "This game is amazing and I play it every day",
            "That game is on sale rn",
            "Would it be sad if I said I own this game?",
            "u/uwuwizard",
            "game me autobot",
            "I bought that game and it was worth it. The Hitler fight was pretty epic",
            "I’ve literally bought hentai nazi for everyone on my steam friend list",
            "I actually saw this two days ago when I was contemplating buying the game. Also I never bought it because it is a really short game.",
            "Poop",
            "Poop",
            "Poop",
            "[deleted]",
            "why do i feel bad",
            "Game",
            "game",
            "Game",
            "Game",
            "Game",
            "Funny cuz um i have the game",
            " \n\nMy 97 year old grandfather fought in ww2 and he always used to tell me stories about the ww2. he was just 18 when he faced battle for the first time. So i wanted to show him this game to make him happy about the (good?) old days. My grandfather never been a huge fan of electronic devices. But I managed to get him to play this game on my laptop. I explained everything but he didn't understand it at first but later he learned how to walk in this game. His first impression was... Quiet. And he still was figuring everything out. But after 2 minutes he stood up. And went outside for a walk. When he came back it was time for dinner. then he bursts out crying. \"I fought for this?'' he said. Then he kept on crying. my parents tried to cheer him up. but he kept crying. So we all silently finished eating our food. went home. I felt akward. Sad and ashamed. then I busted a big nut rubbin' it out on this game. 10/10 would bust again",
            "And then your grandpa died of a heart attack a day later",
            "Anyone else remember that time when the game had 3000 achievements for about a day?",
            "Jesus fuck like it's funny I guess but I feel like squeezing fucking lemon into my eyes",
            "I read this on the actual steam post lmao",
            "I prefer Hentai Hell and Hentai Area 51 myself",
            "[deleted]",
            "I don't know if I could play this...My Grandfather died in Auschwitz :(.....\nHe fell out of the guard tower when he was shooting at some Jews.",
            "[deleted]",
            "I own this game",
            "game gun joe virgin",
            "This is a slightly altered version of a 4chan greentext if I am not mistaken the original was about Girls und Panzers",
            "lol",
            "Game",
            "I am curious now",
            "Should I be worried because I actually played this game",
            "[deleted]",
            "*Fastens bowtie*",
            "Poop",
            "I'm sorry the game called, what?!",
            "I saw that review lol",
            "I saw that review lol",
            "hentai is for losers",
            "This is actually adapted from a much older copy pasta, where a guy shows his grandfather the anime \"Girls und Panzer\". This is a pretty unoriginal take on it, to be honest.",
            "(Only the JJBA fans will get this) it sounds like towards the end you fucking pulled a ZA HANDO and deleted a lot towards the end leading up to \"The Nut\"",
            "I saw that review lol",
            "Poop",
            "Nice",
            "Cock",
            "What is wrong with all of these replies lol",
            "*Fastens bowtie*",
            "*Fastens bowtie*",
            "That sounds like the average redditor",
            "*Fastens bowtie*",
            "Meow",
            "That sounds like the average redditor",
            "That sounds like the average redditor",
            "That sounds like the average redditor",
            "Nice",
            "*Fastens bowtie*",
            "Poop",
            "Poop",
            "Poop",
            "That sounds like the average redditor",
            "That sounds like all of reddit"
        ]
    },
    {
        "post_id": "f0k7qf",
        "author": "M000lie",
        "title": "asian girl",
        "url": "https://www.reddit.com/r/copypasta/comments/f0k7qf/asian_girl/",
        "score": 10975,
        "num_comments": 251,
        "created_utc": 1581124070.0,
        "selftext": " so today at school i saw this hot girl. super hot. super asian. chinese btw. she speaks mandarin. so anyways she had like the fattest ass ever and im talking fucking fat like FAT like so big you could see it from the front. so i walk up to her like i got a lot of money. my dad always taught me walking confident will boost your confidence. i like my dad but he sucks cats tits and i hate that. its a habit im trying to get him to stop. he says its beneficial to his health or whatever. so after i walk up to her like my cat-tit-sucking dad taught me to i say hi. she says hi back. im staring into her lips as i feel an intense feeling of euphoria. just her voice was enough to nigga knock my socks off. i ask her what cup size she wears and she says her boobs are too big for a bra. as shes talking i take the moment to stick my face into her fat titties and motorboat the shit out of them. she then stepped on my cock and balls and popped my scrotum. semen and blood were flying everywhere and it was so sexy. AWOOOOOOGAAAAA i yell. she then calls me a weirdo so i walk away. what should i do?",
        "permalink": "/r/copypasta/comments/f0k7qf/asian_girl/",
        "comments": [
            "NTA your cock, your rules",
            "Idk man I feel like that was a successful interaction. The balls were completely obliterated right?",
            "NTA your dad sucks cat titties its not your fault",
            "ETA quit school and run away from home",
            " so today at school i saw this hot girl. super hot. super asian. chinese btw. she speaks mandarin. so anyways she had like the fattest ass ever and im talking fucking fat like FAT like so big you could see it from the front. so i walk up to her like i got a lot of money. my dad always taught me walking confident will boost your confidence. i like my dad but he sucks cats tits and i hate that. its a habit im trying to get him to stop. he says its beneficial to his health or whatever. so after i walk up to her like my cat-tit-sucking dad taught me to i say hi. she says hi back. im staring into her lips as i feel an intense feeling of euphoria. just her voice was enough to nigga knock my socks off. i ask her what cup size she wears and she says her boobs are too big for a bra. as shes talking i take the moment to stick my face into her fat titties and motorboat the shit out of them. she then stepped on my cock and balls and popped my scrotum. semen and blood were flying everywhere and it was so sexy. AWOOOOOOGAAAAA i yell. she then calls me a weirdo so i walk away. what should i do?",
            " so today at schoow i saw this hot giww. supew hot. supew asian. chinese btw. she speaks mandawin. so anyways she had wike the fattest ass evew and im tawking fucking fat wike FAT wike so big you couwd see it fwom the fwont. so i wawk up to hew wike i got a wot of money. my dad awways taught me wawking confident wiww boost youw confidence. i wike my dad but he sucks cats tits and i hate that. its a habit im twying to get him to stop. he says its beneficiaw to his heawth ow whatevew. so aftew i wawk up to hew wike my cat-tit-sucking dad taught me to i say hi. she says hi back. im stawing into hew wips as i feew an intense feewing of euphowia. just hew voice was enough to nigga knock my socks off. i ask hew what cup size she weaws and she says hew boobs awe too big fow a bwa. as shes tawking i take the moment to stick my face into hew fat titties and motowboat the shit out of them. she then stepped on my cock and bawws and popped my scwotum. semen and bwood wewe fwying evewywhewe and it was so sexy. AWOOOOOOGAAAAA i yeww. she then cawws me a weiwdo so i wawk away. what shouwd i do?",
            "This is some great internet comment etiquette. You're teacher must be so proud",
            "[deleted]",
            "INFO  what was her foot size?",
            "You are NTA",
            "r/paag",
            "just her voice was enough to nigga knock my socks off",
            "ESH",
            "> nigga knock my socks off.\n\nwhat do you mean by this",
            "NTA she's rude",
            "ESH y'all suck cat tits",
            "NTA, she deserved it. Be stupid hot, win stupid prizes.",
            "NTA, because I like the phrase \"enough to nigga knock my socks off\"",
            "INFO: Does the girl go to the same school? If so, YTA. Her school, her rules. If not, NTA. Your school, your rules. Play stupid games, win stupid prizes, as my dad once taught me.",
            "NTA, she needs to re evaluate her life choices",
            "Don't worry dude I got some prosthetic balls :)",
            "YTA his cat his rules",
            "INFO did she have coronavirus? if yes YTA",
            "you should do it all over again",
            "Let’s say some alien thing outside of our universe could generate the wave-function for our universe. It could analyze it and look upon the trillions of particles moving around constantly and learn so much. But I don’t think it could understand this. I think this post defies all reason. It shouldn’t exist, yet it does. This post is the digital equivalent of a dying animal that begs to be put down, and not even some being infinitely more intelligent than us would be able to look at this through ANY lens of math or science, or whatever it would call math and/or science and honestly say that this post being real “makes sense”.\n\nThis feeling is incredible. I’m holding one of the most advanced pieces of technology our species has created in the last century and I’m using it to listen to someone play a game about browsing the deep web as I look at this post. What an absolute waste of resources. Just think of years it took to come up with the ideas that led to the set of power plants that allow this device to even turn on, all of it culminating on this post.\n\nThis is amazing.",
            "I am so desensitized to reddit I thought this was real at first till the end",
            ">Chinese\n\nInsert an overused Coronavirus joke",
            "NTA",
            "The most implausible part of this story was that you met an Asian with a fat ass. That shit’s rarer than my steak",
            "NTA",
            "Joe",
            "NTA i wouldve done the same",
            "Too big for a bra, you fuckin got me good",
            "AWOOOOOGAA",
            "NTA . Suck your father's tits while he sucks on cats tits.",
            "Also thank you mr u/thiccckarlmarx",
            "NTA. Your scortum your fetish. A lot of red flags tbh. My advice get out of there immediately",
            "Obliterate her cock to assert dominance",
            " This is a sacred text",
            "NAH. Normal conversation good job OP!",
            "[deleted]",
            "*NIGGA KNOCK*",
            "how does she speak mandalorian? that is tv show???!!",
            "NTA",
            "What was this from?",
            "Cock",
            "Meow",
            "Nigga knock",
            "AWOOGA",
            "NTA your dick your rules",
            "\"Just her voice was enough to big a knock my socks off\"\n\nBeen there before",
            "this post reads like a fever dream... a wet fever dream",
            "I don't even right now.",
            "ESH Your cock displays too many red flags. Chop it off and get a lawyer IMMEDIATELY sweetie.",
            "0 to 200 real quick",
            "idk call up hirohito  he should no",
            "Cock",
            "Wake up to your alarm clock",
            "top 25 on the reddit home page make it first",
            "YTA She has a humiliation kink and you were a spineless coward of a man\n\nYour cat tit sucking dad is right, maybe you should suck on cat tits and not be such a pussy",
            "You shouldn't kink shame your dad like that.",
            "她可爱和胖吗. Cute and Fat?",
            "You deserve better. Leave that piece of filth behind and move on with your life.",
            "Hm",
            "\"Ass so fat you could see it from the front\" thank you kind copy pasta! I recognize that sentence from a song I have not heard in years\n\nThe song is M.S fat booty-mos def",
            "Don’t kiss. Coronavirus",
            "NTA",
            "This was written by Holden Caulfield",
            "NTA Play stupid games win stupid prizes.",
            "NTA",
            "Bernard the bot has got some sexy cat tits, check out his profile its sharp as HD and all black and shit like Kevin Smith",
            "Don’t worry bro your balls come back twice as big I’ve done this before",
            "NTA massive red flags get out of there",
            "YTA",
            "YTA: ass",
            "Don't do that, Perv",
            "NTA, your dad has a problem.",
            "Send her flowers. She is officially your girlfriend now!",
            "NTA - your tits your rules.",
            "NTA your actions your rules",
            "NTA",
            "cock",
            "so today at school i saw this hot girl. super hot. super asian. chinese btw. she speaks mandarin. so anyways she had like the fattest ass ever and im talking fucking fat like FAT like so big you could see it from the front. so i walk up to her like i got a lot of money. my dad always taught me walking confident will boost your confidence. i like my dad but he sucks cats tits and i hate that. its a habit im trying to get him to stop. he says its beneficial to his health or whatever. so after i walk up to her like my cat-tit-sucking dad taught me to i say hi. she says hi back. im staring into her lips as i feel an intense feeling of euphoria. just her voice was enough to nigga knock my socks off. i ask her what cup size she wears and she says her boobs are too big for a bra. as shes talking i take the moment to stick my face into her fat titties and motorboat the shit out of them. she then stepped on my cock and balls and popped my scrotum. semen and blood were flying everywhere and it was so sexy. AWOOOOOOGAAAAA i yell. she then calls me a weirdo so i walk away. what should i do?",
            "try r/relationship_advice",
            "Holden Caulfield in a nutshell.",
            "Fake",
            "Nta. Play stupid games, win stupid prizes",
            "NTA",
            "ESH",
            "You should talk to your guidance counselor, maybe they'll explain the situation to her and she'll understand.",
            "Cock",
            "commit a ron the bird",
            "C o c k",
            "Today I saw this hot girl at school. very hot. Super Asian. By the way, she speaks Mandarin. Anyway, she likes the fattest ass ever and is fat like FAT, so she can see it from the front. So I got a lot of money, so I walk to her. My father said that I always walked with confidence. I like my father, but he sucks pussy boobs and I hate it. It is custom to stop him. He says it is beneficial to everything, including his health. My father smoked and was told to greet me after the cat approached me. She greets. He looks at her lips and feels a strong sense of happiness. Just her voice was enough for the nigga to take off my socks. When I ask her what cup size she wears, she says her boobs are too big for a bra. While she is talking, I stab her face into a thick nipple and then spend time on motorboat shit. She then stepped on my cock and ball and jumped out of my scrotum. Semen and blood were flying and it was very sexy. AWOOOOOOGAAAAA I shout. I leave because she calls me a weirdo. what should I do?",
            " ⢠⣾⣿⣷⣤⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢀⣀⣼⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣏⠉⠁⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀⠀⣠ ⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣤⣴⣶⣾⡿⠛ ⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠛⠋⠁⠀⠀ ⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⡅⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠿⠿⠿⠿⠿⠿⠿⠿⠇⠀⠀ ⠀⠀⠀⠀⠿⠿⠿⠿⠿⠿⠿⠿⠇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢠⣶⣶⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢿⣿⣿⣻⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠈⢿⣿⣿⣧⣀⣀⣠⣤⣀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⠀⠀⠀⠀⠀ ⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠀⠀⠀⠀ ⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⡄ ⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡹⣿⣿⡄⠀⠁ ⠀⠀⣿⣿⣿⠘⢻⣿⣿⣿⣿⣿⣿⣿⣷⠘⣿⣷⠀⠀ ⠀⠀⣿⣿⡏⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣷⡘⣿⡇⠀ ⠀⢰⣿⣿⠃⢰⣿⣿⣿⣿⣟⣿⣿⣿⣿⣿⣿⢸⣿⠀ ⠀⢸⣿⡟⠀⠘⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⡿⣿⡇ oh hey ⡿⠟⠉⠉⠉⢻⣿⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢸⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⣀⣀⣠⣖⡫⠼⠛⢿⣗⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠻⡟⠃⠁⢠⢀⣀⡼⢿⣷⣤⡤⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⢀⣴⣶⡃⠔⠋⣠⠟⣽⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀ ⣠⣿⡝⢫⡄⠀⠀⢡⣾⣿⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀ ⣿⣿⣷⡀⠀⠀⠀⢀⣿⣿⣿⣤⡤⠀⣶⣷⡄⠀⠀⣆ ⡇⠈⠙⡟⠀⠀⢀⣼⣿⣿⣿⣿⣧⣴⣿⣿⠇⠀⣴⣿ ⣷⣤⣰⣷⡄⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ jus boutta go to bed ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣤⣄⡀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⡿⢿⣿⣿⡄⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣋⠀⠀⢿⣿⣷⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⠿⢾⡷⣶⣾⣿⡇⠀⠀⠀ ⠀⠀⢀⣠⠤⠤⢤⣤⣼⣿⣤⣾⣁⣯⣙⡇⠀⠀⠀⠀ ⠀⢰⣿⣿⣧⣄⠀⣿⣿⡟⣿⡉⢻⣿⣿⠷⢔⠀⠂⠀ ⠀⣿⠛⢿⣿⣿⣷⣿⣿⡇⣿⠛⣿⣷⡯⠀⠈⢳⣆⢤ ⠀⣿⠀⠀⢹⣿⣿⣿⣿⣿⣿⣤⣾⣿⣿⣶⣤⣸⣿⡇ ⠀⣿⣿⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ ⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀ I know we couldn’t skype tonight ⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⣤⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢰⣿⠛⠉⢻⣿⡆⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⣿⢒⢤⣶⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⣧⣼⣬⣷⣼⠃⠀⠀⠀⠀⠀⠀ ⢀⠀⠀⠀⢀⣤⡶⠺⣿⣿⣷⣿⣿⡶⠒⠤⢄⠀⠀⠁ ⢠⡆⠀⣤⣿⣿⣿⣆⣻⣿⣿⣿⣿⠇⠀⠀⠀⢲⡀⠀ ⣿⣧⠐⣿⣿⠛⣿⣿⣦⣿⣿⣿⣷⣶⣶⣶⣦⣾⣧⠀ ⣿⣿⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀ ⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠀ but ⠀⠀⠀⠀⠀⠀⠀⣴⣿⠿⠟⢿⣷⡄⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢰⣿⡯⠄⠀⣀⣻⣿⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢸⣿⠁⡰⠛⠒⠺⡏⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠈⣿⣾⣟⣻⣿⣶⠃⠀⠀⠀⠀⠀⠀ ⠀⠀⢀⠠⠀⠒⢶⡏⣠⡗⠒⣻⣿⡤⠀⢀⠀⠀⠀⠀ ⠀⣼⣿⣧⡄⠀⠸⠑⠿⠁⠜⣩⣿⠀⠀⠀⠈⢲⡐⠀ ⢸⠟⠛⢿⣇⣀⣀⠀⠀⠀⢀⣾⣅⣠⣀⣤⣀⠘⣿⡆ ⢸⣇⠀⢸⣿⣿⣿⣷⣶⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣇ ⢸⣿⣷⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇ das alright ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⡿⠋⠉⠙⢻⣿ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣗⣢⠀⠀⠀⣿ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣁⡀⠺⢲⢿⣽⢟ ⠀⠀⠀⠀⡀⠀⠉⠀⠀⠒⣶⣿⣿⣟⠛⠳⣾⣦⡜⠈ ⠀⠀⠀⡜⠀⠀⢰⡄⠀⠀⣿⣿⣿⣿⢲⣴⣿⡋⠀⠀ ⠀⠀⢠⡇⠀⠀⠸⣿⣆⣀⣿⣿⣿⣿⣿⠏⠁⠉⣦⠀ ⠀⢠⣼⣷⠀⠀⠀⣿⣿⣿⣿⣿⣿⡿⠟⠋⣠⣾⣿⠀ ⣰⣿⣿⣿⣦⣀⣠⣿⣿⣿⣿⣿⣿⣤⣰⣾⣿⣿⡟⠀ goodnight girl, i’ll see you tomorrow ⠓⢦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⣿⣶⣿⣒⣤⣀⠀⠀⣠⣦⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠈⠻⣿⣿⣿⣿⣿⣾⣿⣿⡇⠀⠀⠀⠀⠀⠀⢀⣠⣾ ⠀⠀⠈⢻⣿⣿⣿⣿⣿⣿⣷⣦⣤⣴⣶⣶⣿⣿⡿⠃ ⠀⠀⣰⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠛⠋⠁⠀⢠ ⢀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀⠀⠀ ⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏",
            "Can I get the text in a comment so I can copy and paste?",
            "YTA you got coronavirus",
            "This isn't funny",
            "Nta",
            "YTA",
            "The way he speaks reminds me of Trump",
            "Coronavirus",
            "Can you not use the N word please."
        ]
    },
    {
        "post_id": "cs3rje",
        "author": "SMALL_NIGA_PEN",
        "title": "Shave my girls",
        "url": "https://www.reddit.com/r/copypasta/comments/cs3rje/shave_my_girls/",
        "score": 10966,
        "num_comments": 159,
        "created_utc": 1566147523.0,
        "selftext": "ALWAYS 🕔 make sure 👍 to shave 🔪🍑 because ✌️ the last time 🕒 we let 👐😪 a bush 🌳 in our lives 👈😜👉 it did 9/11 💥🏢🏢✈️🔥🔥🔥",
        "permalink": "/r/copypasta/comments/cs3rje/shave_my_girls/",
        "comments": [
            "ALWAYS 🕔 make sure 👍 to shave 🔪🍑 because ✌️ the last time 🕒 we let 👐😪 a bush 🌳 in our lives 👈😜👉 it did 9/11 💥🏢🏢✈️🔥🔥🔥",
            "This. This is the pinnacle of humanity. I refuse to believe anything can be better than this.",
            "Bush killed John F. Kennedy",
            "AWWAYS 🕔 make suwe 👍 to shave 🔪🍑 because ✌️ the wast time 🕒 we wet 👐😪 a bush 🌳 in ouw wives 👈😜👉 it did 9/11 💥🏢🏢✈️🔥🔥🔥",
            "dick did 9/11\n\ni havent paid my taxes since 2008",
            "This is art at it's best",
            "Mista used sex pistols to kill JFK",
            "Israel did 9/11 retard",
            "Fuck you I will never shave\n\n(Not really directed to OP)\n\nEdit: lol yes I do shave my armpits.",
            "I like 'em hairy",
            "r/emojipasta",
            "Yoooooooooo, i saw this like 2 years ago and wanted to find it back again so bad, i love you",
            "My fucking sides",
            "Squares, squares everywhere",
            "ALWAYS 🕔 make sure 👍 to shave 🔪🍑 because ✌️ the last time 🕒 we let 👐😪 a bush 🌳 in our lives 👈😜👉 it did 9/11 💥🏢🏢✈️🔥🔥🔥",
            "[deleted]",
            "[https://soundcloud.com/user-249084575/sets/play-to-spontaneously-combust](https://soundcloud.com/user-249084575/sets/play-to-spontaneously-combust)",
            "[deleted]"
        ]
    },
    {
        "post_id": "emqgyd",
        "author": "haldatte",
        "title": "AITA for \"bullying\" a co-worker?",
        "url": "https://www.reddit.com/r/copypasta/comments/emqgyd/aita_for_bullying_a_coworker/",
        "score": 10956,
        "num_comments": 451,
        "created_utc": 1578660367.0,
        "selftext": "On mobile, English ain't native language, yada yada.\n\nSo I walk up to this bitch (apparently right after she got divorced) and say \"what's up Karen you wanna go for a jog this afternoon haha\" and she's like \"please just leave me alone\" and I'm like \"whatever bitch\" and then like an hour later get called into our HR person's office and they're like \"you gotta stop harassing Karen she's going through a lot right now, she's just signed her divorce papers\"\n\nAnd I'm like \"hah who'd married that skank, someone with a wheelchair fetish?\" And my HR person (Hank) was well like \"come on man, they've been married for 16 years. They've been having trouble since her accident last year. She thinks he blames her for getting into the accident that killed their kids\" and I'm all like lol\n\nSo I leave and I'm hungry so I go to grab my lunch (turkey and provolone) only to see, lo and behold, that dumb bitch Karen set her bag of lunch RIGHT in front of mine!! so I write out a note saying how glad I am to be working with her but if she puts her lunch in front of mine again I swear to fuck I will finish the job that God couldn't\n\nSo I go through the rest of my day joking around with Karen every time I see her even though she is I giant cunt about it (my favorite was 'accidently' dropping a pair of scissors on her colostomy bag lol) and I have to ignore the picture of that fucking rat whenever I walk by her desk\n\nSo I finish my day asking for her ex husband's number since I need a new wingman to look for some babes with and she fucking flips it and when she's yelling at me I'm all like \"maybe if you don't want to get divorced you shouldn't have gotten hit by a drink driver you ever think of that bitch\" and then she rolled away aggressively\n\nSo AITA?",
        "permalink": "/r/copypasta/comments/emqgyd/aita_for_bullying_a_coworker/",
        "comments": [
            "NTA\n\nWhy is that bitch still breathing",
            "[removed]",
            "i genuinely thought this was a real AITA post and was horrified by the comments until i read cummy",
            "NTA it's not your fault she decided to have kids. Play stupid games win stupid prizes. You're not responsible for anyone's happiness!\n\n(fucking kids! I hate kids!)\n\nEDIT1: omg thanks for the silver kind stranger, give me your email address, telephone number and social security number and address and I will come and give you a sloppy blowjob! I'm literally crying with joy!\n\nEDIT2: Allahu Akbar! Gold medal! This is why I love reddit. The community is so kind. I love the community. I want to suckle on its little toes until they're dripping wet. I want to lay gently by its side as it falls asleep. I want to rip out my liver, make a fine pâté out of it and feed the community with it. I can feel how the community is throbbingly pulsing with kindness. Hot, juicy kindness that can quell my never-ending thirst. Hmu in DMs if you want hot vids of me playing with my community.\n\nEDIT3: Another gold award? Miss me with that shit bruh. I work at the White House, my dad's been a marine for forty years and has over 400 confirmed kills, more than half of them with his bare hands, you think I care about some 'gold award'? I will personally call an airstrike on the refugee camp you live in, you cheap bitch. I bet you've never even given a person 100$. How sad. We live in a society.\n\nEDIT4: I'm sorray, must've been the autocorrect :3 I luv you reddit ;*",
            "NTA\n\nHer fault for being outside. If she stayed in the kitchen like a woman should that car wouldnt have hit her\n\nPlay Stupid Games Win Stupid Prizes",
            "[deleted]",
            "NTA, *YOUR* house, *YOUR* rules",
            "NTA she shouldn't have gotten paralyzed, what a selfish woman",
            "ESH HR was an asshole for sexually enticing you like that, ex husband is an asshole for having pee, Karen is an asshole because her stanky lunch, your the asshole because",
            "On mobile, English ain't native language, yada yada.\n\nSo I walk up to this bitch (apparently right after she got divorced) and say \"what's up Karen you wanna go for a jog this afternoon haha\" and she's like \"please just leave me alone\" and I'm like \"whatever bitch\" and then like an hour later get called into our HR person's office and they're like \"you gotta stop harassing Karen she's going through a lot right now, she's just signed her divorce papers\"\n\nAnd I'm like \"hah who'd married that skank, someone with a wheelchair fetish?\" And my HR person (Hank) was well like \"come on man, they've been married for 16 years. They've been having trouble since her accident last year. She thinks he blames her for getting into the accident that killed their kids\" and I'm all like lol\n\nSo I leave and I'm hungry so I go to grab my lunch (turkey and provolone) only to see, lo and behold, that dumb bitch Karen set her bag of lunch RIGHT in front of mine!! so I write out a note saying how glad I am to be working with her but if she puts her lunch in front of mine again I swear to fuck I will finish the job that God couldn't\n\nSo I go through the rest of my day joking around with Karen every time I see her even though she is I giant cunt about it (my favorite was 'accidently' dropping a pair of scissors on her colostomy bag lol) and I have to ignore the picture of that fucking rat whenever I walk by her desk\n\nSo I finish my day asking for her ex husband's number since I need a new wingman to look for some babes with and she fucking flips it and when she's yelling at me I'm all like \"maybe if you don't want to get divorced you shouldn't have gotten hit by a drink driver you ever think of that bitch\" and then she rolled away aggressively\n\nSo AITA?",
            "I'm Rick Harrison, and this is my pawn shop. I work here with my old man and my son, Big Hoss. Everything in here has a story and a price. One thing I've learned after 21 years – you never know WHAT is gonna come through that door",
            "  \n\nHi (i dont speak english at all so sorry for spelling errors. like i dont even know if this is english) i had kind of a similar story that i wanted to share.\n\nSo one day i was driving my usual route from home to work (totaly drunk ofc) and this bitch in a car tried to fucking pass me. So ofc i slamed that bitch of the fucking road (and her car did a few flips it was actualy pretty cool). And then this motherfucker gets out the car all screaming like oh god my kids! (and this is the moment i realy got pissed) wait what she was trying to blame her kids for that crash? So i went up to her and then she said: Call a ambulance my kids are not moving! And I said: Bitch wtf your kids are just sleeping, you are trying to get away with this by making me think that your kids got hurt dont you? (by this point that was pretty obvious). So i knocked that bitch out and got in my car and drove over her(i think i broke her spine XD). Never heard of them again not even a sorry letter? Smh.",
            "YTA , repost",
            "On mobiwe, Engwish ain't native wanguage, yada yada.\n\nSo I wawk up to this bitch (appawentwy wight aftew she got divowced) and say \"what's up Kawen you wanna go fow a jog this aftewnoon haha\" and she's wike \"pwease just weave me awone\" and I'm wike \"whatevew bitch\" and then wike an houw watew get cawwed into ouw HW pewson's office and they'we wike \"you gotta stop hawassing Kawen she's going thwough a wot wight now, she's just signed hew divowce papews\"\n\nAnd I'm wike \"hah who'd mawwied that skank, someone with a wheewchaiw fetish?\" And my HW pewson (Hank) was weww wike \"come on man, they've been mawwied fow 16 yeaws. They've been having twoubwe since hew accident wast yeaw. She thinks he bwames hew fow getting into the accident that kiwwed theiw kids\" and I'm aww wike wow\n\nSo I weave and I'm hungwy so I go to gwab my wunch (tuwkey and pwovowone) onwy to see, wo and behowd, that dumb bitch Kawen set hew bag of wunch WIGHT in fwont of mine!! so I wwite out a note saying how gwad I am to be wowking with hew but if she puts hew wunch in fwont of mine again I sweaw to fuck I wiww finish the job that God couwdn't\n\nSo I go thwough the west of my day joking awound with Kawen evewy time I see hew even though she is I giant cunt about it (my favowite was 'accidentwy' dwopping a paiw of scissows on hew cowostomy bag wow) and I have to ignowe the pictuwe of that fucking wat whenevew I wawk by hew desk\n\nSo I finish my day asking fow hew ex husband's numbew since I need a new wingman to wook fow some babes with and she fucking fwips it and when she's yewwing at me I'm aww wike \"maybe if you don't want to get divowced you shouwdn't have gotten hit by a dwink dwivew you evew think of that bitch\" and then she wowwed away aggwessivewy\n\nSo AITA?",
            "YTA, didn't provide a TL;DR",
            "YTA. You didn't include age and gender (18F)",
            "NTA. She is literally a Karen.",
            "NTA \nPlay stupid prizes win stupid games",
            "Posting copypasta in /r/AmItheAsshole will get you banned. Don't do  it. Don't post about it here. Don't link it here. Brigading is against website rules.",
            "NTA, I would think YTA usually, but I see you're single and are looking for a woman in the kitchen to make some delicious sandwiches for your lunch. Cmon, just turkey and provolone? But that got me thinking, hey this guy is really struggling in the office setting as a single male with no one to make you sandwiches, so you are forced to live with just turkey and provolone. NTA",
            "Omg I thought this was an AitA a d I was like this is fake right then saw copypasta my god I died I was like fuck good one OP",
            "NTA, she should have thought before becoming an employed person.",
            "YTA for a repost",
            "Monkey",
            "NTA. Bitch had it coming",
            "NTA play stupid games win stupid prizes. Her husband really dodged a bullet there. You should totally leave that workplace I’m seeing a lot of red flags from that toxic atmosphere.",
            "nice repost",
            "YTA\n\nDidn't harass her enough since she's still working there, wtf?",
            "YTA. you didn't finish the job.",
            "You ar nit the ashole :)",
            "Cock",
            "Obviously NTA wtf",
            "[removed]",
            "ESH, Its not your responsibility to bs kind to her, but your also a man",
            "NTA\nFucking skank should have walked away if she didn't like it",
            "NTA sounds like a toxic workplace. I'm so sorry uou have to go through this OP.",
            "NTA don’t light yourself on fire to keep others warm OP",
            "I've seen this on this sub a couple times in the past and I'm wondering, is this at least partially a based on a real AITA? just curious",
            "Ok wtf?",
            "NTA",
            "NTA major 🚩🚩🚩🚩",
            "NTA, Your job, your rules.",
            "[removed]",
            "Since this is AITA and everyone on this sub is entitled to do everything, NTA",
            "NTA Your life, your choices.",
            "I don’t quite understand what this sub is yet but this post made me wanna join it",
            "YTA because you made me go through the whole thing before I realised it was a r/copypasta post",
            "woah there bucko I think I've seen this before is it a repost?",
            "NTA report her to HR for sexual harassment.",
            "Holy shit I thought this was serious until I looked at the sub...",
            "I'm Rick Harrison, and this is my pawn shop. I work here with my old man and my son, Big Hoss. Everything in here has a story and a price. One thing I've learned after 21 years – you never know WHAT is gonna come through that door",
            "NTA she shouldnt have had such a flashy late term abortion.",
            "Not gonna lie the first paragraph had me. then I realized what sub this was",
            "YTA didn’t finish her sooner she’s wasting oxygen",
            "I did not realize what sub I'm on at first. What a rollercoaster.",
            "So I walk up to this bitch (apparently right after she got divorced) and say \"what's up Karen you wanna go for a jog this afternoon haha\" and she's like \"please just leave me alone\" and I'm like \"whatever bitch\" and then like an hour later get called into our HR person's office and they're like \"you gotta stop harassing Karen she's going through a lot right now, she's just signed her divorce papers\"\n\nAnd I'm like \"hah who'd married that skank, someone with a wheelchair fetish?\" And my HR person (Hank) was well like \"come on man, they've been married for 16 years. They've been having trouble since her accident last year. She thinks he blames her for getting into the accident that killed their kids\" and I'm all like lol\n\nSo I leave and I'm hungry so I go to grab my lunch (turkey and provolone) only to see, lo and behold, that dumb bitch Karen set her bag of lunch RIGHT in front of mine!! so I write out a note saying how glad I am to be working with her but if she puts her lunch in front of mine again I swear to fuck I will finish the job that God couldn't\n\nSo I go through the rest of my day joking around with Karen every time I see her even though she is I giant cunt about it (my favorite was 'accidently' dropping a pair of scissors on her colostomy bag lol) and I have to ignore the picture of that fucking rat whenever I walk by her desk\n\nSo I finish my day asking for her ex husband's number since I need a new wingman to look for some babes with and she fucking flips it and when she's yelling at me I'm all like \"maybe if you don't want to get divorced you shouldn't have gotten hit by a drink driver you ever think of that bitch\" and then she rolled away aggressively\n\nSo AITA?",
            "NTA really dodged a bullet there, your house your rules",
            "Going against the grain here but YTA, you didn’t follow through with the promise to finish the job that god couldn’t.",
            "NTA your scissors your rules.",
            "OMG Karen is such a bitch can she just relax and enjoy life. Get her a Live, Laugh, Love sign.....obviosuly no one would love someone like her but you know some times we should hold our tongue even when its such a dumb cunt like Karen.....jeeeeze she sounds like such a bitch.",
            "NTA you did the right thing OP",
            "How do I summon the bot to post it in the comments  so I can copy it?",
            "this is so god damn good 😂😂",
            "NTA. play stupid games, win stupid prizes",
            "YTA for not shoving that fucking bitch down the stairs and stomping on her fucking head till she bleeds to death. fucking cunt. your house your rules.\n\nedit: thanks for the gold kind stranger",
            "What does aita mean?",
            "YTA just because you didn't clarify who was [M] and [F] and what their ages were. 0ther than that you seem like a pretty nice guy",
            "This has to be satire...",
            "NTA I can't believe that bitch rolled away aggressively like that. You should complain to HR.",
            "NTA. The driver of that car is doing something that’s called “gaslighting” \n\nAfter gaslighting comes a fiery explosion. You will not survive it.\n\n(Hence the name, gaslighting)",
            "NTA your workplace your rules",
            "I genuinely thought this was an AITA post",
            "NTA!!!\n\nWell played! You deserve an award but I'm broke so here's some emojis instead 🥇🏅🎖️\n\nEdit 1: Thanks for the awards!!\n\nEdit 2: thanks for all the awards now I have been able to give OP an award! Happy days and awesome sauce to all.",
            "Gonna get downvoted but ESH",
            "NTA, that bitch got what she deserved.",
            "YTA \n\nYou're being far to nice than she deserves.",
            "Give me a fucking break, one minute left. One minute fucking left. You’re gonna give me fucking one minute? Look at that fucking sign right there, one minute! Let me fucking tell you something, let me tell you something, I’ve been around since fucking nineteen eighty fucking eight, and you’re gonna give me one fucking minute?! You’ve gotta be fucking kidding me! You're fucking kidding me! What the fuck!? I’m not fucking Justin Bieber, you motherfuckers! You gotta be fucking joking, this is a fucking joke. I got one minute, one minute left. Oh now I got nothing left, now I got nothing left. Let me show you what one fucking minute fucking means!",
            "I got farther in this post then I care to admit and before I realised what sub this was",
            "For some reason I thought I was on AITA",
            "Your son's in hell, Delgado!",
            "NTA her name is Karen so that automatically means shes in the wrong",
            "I didn’t catch onto the “What’s up Karen wanna go for a jog later” bit for a while, but it’s fucking great",
            "NTA. She was being a bitch first.\n\nBurn it. Burn it with fire.",
            "AITS for making a overused copypasta?\n\n\n\n\n\nSo I (9M) made a copypasta on reddit (14?) and it was a complete ripoff of every other copypasta on this subreddit. Everyone keeps saying I (9M) am trying to farm karma and get in cummy's (3, Hot) pants, but I (9M) just want to support this community (10?) with content they (10?) love. My dad (70F) beat me (9M) when I (9M) was young and my mom (420M) left me to pursue his (420M) dream of becoming a child molester. Please give me (9M) pity karma so I (9M) get to the top of the hot page and get even more.  \n\n\nTD/LR   \nGive me (9M) karma or I (9M) will kill you (Soon to die if you do not give me updoot) in your sleep",
            "NAH",
            "Gonna go against the grain here, NTA. Play stupid games, win stupid prizes. You don't owe anybody anything.\n\nEDIT: All 1 comments on this post here was YTA when I showed up.",
            "YTA for making a validation post.",
            "Yeah you seem like an asshole in general, but also seems like this behavior wouldn't be a surprise to Karen so idk",
            "reddit",
            "NTA based and redpilled",
            "NTA, play stupid games win stupid prizes",
            "NTA the bitch deserved it",
            "This is a fucking repost",
            "Thought this was a real AITA post for a second. Fuck.",
            "NAH dumb bitch lmao",
            "Wholesome",
            "NTA \n\n\nHonestly I dont know how people like her can wake up and live with themselves, also she had no reason to freak out on you for asking for her husbands number, you were just looking for some new friends.",
            "NTA, your cubicle your rules",
            "NTA she deserved everything terrible.",
            "NTA\n\nKaren touched my kid",
            "NTA, Karen needs to be put in her place.",
            "[removed]",
            "NTA - just another episode of “Wheelz & The LegMan”",
            "YTA should have traumatized that little cunt for the rest of her life",
            "(turkey and provolone)",
            "This is the poster child charicature of men by feminists.",
            "“God I hate Karen” repost",
            "[deleted]",
            "NTA she played fortnite and won yo mama play stupid games win stupid prizes",
            "NTA cause you know that color red eats beans with the 1-rectangle spectrum",
            "NTA. Your job your rules",
            "Karen",
            "(turkey and probolone)",
            "Yeah",
            "\"AITA for \"Bullying\" a Co-worker?\" \n\nSo I walk up to this bitch",
            "NTa\n\nYUR BITCH UR RULE",
            "NTA it's her fault for existing",
            "See if you were male, AITA would say YTA. But if you hinted that you were female, it'd be nothing but NTA,  ESH, INFO, all that bullshit",
            "Those are red flags OP!! You need to get out of that situation! Women shouldn't be ha going around work that's disgusting",
            "NTA, not because you aren’t the asshole, but because everyone on this subreddit is too scared of controversy to call someone TA.",
            "He saw her rollin', he hatinnnnn'",
            "NTA she just shouldn't have gotten married in the first place",
            "[deleted]",
            "Bitvk",
            "AITA for spotting a repost?",
            "> but if she puts her lunch in front of mine again I swear to fuck I will finish the job that God couldn't\n\nhahahaha holy fucking shit",
            "Gonna go against the grain here and I'm probably going to get downvoted to oblivion. I cant believe I had to scroll this far to read my OWN comment wow reddit.\n\n YTA for wasting the colonoscopy bag and not plugging it into your own demonic hole to mix excretions and possibly mould her children back from the unholy mixture",
            "NTA. Karen needs to learn that life won't just let her by easily because she is disabled",
            "Dude I thought this was real... Ffs I need to look ar r/ allways",
            "This was legit funny",
            "Bruh you're a hero. Fucking entitled paralysed bitchhhhh",
            "NTA\nI'm surprised you didn't quit the first time you threw up from looking at \"that dirty rats picture\". Quite frankly, they're setting double standards at the workplace if they reprimand you for attempting to raise morale with some light-hearted jokes, but won't have a talk with this woman,  who is obviously doing the workplace AND her coworkers a disservice by bringing her attachments in with her. At my job, you get yelled at for texting your old lady, let alone, just sitting there, being UNPRODUCTIVE.",
            "\"So i walk up to this bitch...\"\nGAVEL!! GAVEL!!!\n\"guilty\"",
            "Dude are you guys both tryna chill?",
            "INFO IS SHE VEGAN?",
            "Esh, I'm guessing Karen deserves all this, but I feel like I need to know more about her.",
            "SERIOUSLY THOUGHT I WAS ON A DIFFERENT SUB.\nFelt like I had been transported to some different dimension. This is something else.",
            "DAE NTA? fUCK you karen",
            "NTA\nPlay stupid games win stupid prizes",
            "NTA her name was Karen",
            "Yo I was like half way into this when I realized it was copy pasta and not actually AITA and my god this was the funniest shit I've seen all day. 10/10 NTA",
            "AITA for down voting a repost even though it is a classic?",
            "YTA\n\nThis is a repost",
            "NTA",
            "Lmfao I was sorting by popular and thought this was real. Good job if you came up with this dude",
            "I posted this to /r/AmITheAsshole and this is what happened\n\n\nYou have been permanently banned from participating in r/AmItheAsshole. You can still view and subscribe to r/AmItheAsshole, but you won't be able to post or comment.\n\nNote from the moderators:\n\n>\t[^(context)](https://www.reddit.com/r/AmItheAsshole/comments/emzq34/-/?context=9) **/** [^(sub rules)](http://www.reddit.com/r/AmItheAsshole/wiki/index) **/**  [^(sidebar)](http://www.reddit.com/r/AmItheAsshole/about/sidebar) **/** [^(site rules)](http://www.reddit.com/rules)\n>\t\n>\tThis submission may have fully or partially contributed to your ban:\n>\t\n>\t---\n>\t\n>\t#####[AITA for \"bullying\" a co-worker?](https://www.reddit.com/r/AmItheAsshole/comments/emzq34/-/)\n>\t\n>\t> \n>\t\n>\t---\n\nIf you have a question regarding your ban, you can contact the moderator team for r/AmItheAsshole by replying to this message.\n\n**Reminder from the Reddit staff**: If you use another account to circumvent this subreddit ban, that will be considered a violation of [the Content Policy](https://reddit.com/help/contentpolicy#section_prohibited_behavior) and can result in your account being [suspended](https://www.reddithelp.com/en/categories/reddit-101/rules-reporting/account-and-community-restrictions/suspensions) from the site as a whole.",
            "NTA she shouldntve fucking crippled herself if she didn't want to be a bitch",
            "r/circlejerk",
            "Finished the 2nd paragraph and checked the sub lmao",
            "I had to do a double take to realize what sub I was on, gr8 b8 m8",
            "I thought this was a post on the actual sub for AITA and got halfway through and had to double check and thanked myself for doing so",
            "Just Karen...",
            "YTA that fucked up\n\n◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️◼️-37.3k⬇️",
            "My favorite part about the pasta is that there isn't a single typo (that I saw)",
            "YTA who eats turkey and provolone like seriously you should fave the death penalty for that. Other than that NTA for sure",
            "INFO - does she have a motorized wheelchair?",
            "Damn, I thought this was a genuine post... whoops",
            "[deleted]",
            "YTA",
            "Reading this genuinely made me feel sick to my stomach",
            "YTA you didn’t *bully* her enough. If you had bullied herself more and she could’ve killed herself so she didn’t have to live her shitty life",
            "YTA, should've chased her",
            "Meow",
            "NTA your co-worker your rules",
            "YTA period",
            "NTA, and I (19M) can explain why. You see, when I (19M) had a situation much like yours, here's how I handled it. It all started when me (19M) and my son (16M) went to his band performance. I (67M) sat in the bleachers and watched my son (24M) play the trombone (12F). In front of me (210M), there was a woman (42F) and her two kids (6M and 29F). The woman (42F) was laughing and smiling and enjoying her time. She was being an obnoxious bitch, saying things like \"I'm sure grandma would enjoy this if she were still around,\" and \"Check your blood sugar dear, we don't want you getting sick.\" It began to fucking annoy me (19M), so I leaned forward and said that I was happy that her mother died, and that her kids looked like they both got facefucked by a cast iron skillet. This bitch had the audacity to yell at me(19M). YELL, AT ME(19M)? WHO THE HELL DOES SHE THINK SHE IS? Her male spawn (6M) interrupted me by saying that his blood salt or whatever was 21. I (19M) laughed and shoved him down the bleachers, and the old witch had the nerve to slap me(19M). I started laughing and told the police that she had drugs on her. They took her away in handcuffs and her and her two kids got executed on live television lmao. Moral of the story, you stook to your principles and were a badass about it. DEFINITELY NOT TA!!",
            "YTA",
            "YTA\n\nyou're such a fucking shithead",
            "NTA. Fuck her if she can't take a joke.",
            "I'm Rick Harrison, and this is my pawn shop. I work here with my old man and my son, Big Hoss. Everything in here has a story and a price. One thing I've learned after 21 years – you never know WHAT is gonna come through that door",
            "I'm Rick Harrison, and this is my pawn shop. I work here with my old man and my son, Big Hoss. Everything in here has a story and a price. One thing I've learned after 21 years – you never know WHAT is gonna come through that door",
            "I'm Rick Harrison, and this is my pawn shop. I work here with my old man and my son, Big Hoss. Everything in here has a story and a price. One thing I've learned after 21 years – you never know WHAT is gonna come through that door."
        ]
    },
    {
        "post_id": "p0zs4p",
        "author": "tinyLivy",
        "title": "Found in r/leagueoflegends",
        "url": "https://www.reddit.com/r/copypasta/comments/p0zs4p/found_in_rleagueoflegends/",
        "score": 10951,
        "num_comments": 162,
        "created_utc": 1628509346.0,
        "selftext": "Recently I discovered my parents play LoL together in secrecy.\n\nMy younger brother and I were both gifted new gaming laptops last Christmas. My parents set some ground rules however. After 8pm they are to be left in the lounge room as to ensure we don’t take them to bed with us and spend the entire evening gaming.\n\nA few evenings ago I woke up in the middle of the night and was fairly restless, I tossed and turned in bed and for the love of god could just not get back to sleep. I laid awake staring at the ceiling finally on the verge of dozing back off until I started hearing some faint noises. The noises were fairly quiet at first and seemed to be coming from my parents room. As the seconds past the noises became more clear and more frequent. It was my father and mother, and they were playing LoL!\n\nI couldn’t make out most of what they were saying but they must of been caught in an intense team fight. I heard a lot of back a forth sighing and panting and what I assume was the banging of the mouse against bed side table.\n\nI laid there and listened in as best I could and the noises kept ramping up and I assume the game got more intense and more intense.\n\nIt must of been slightly past the 25 minute mark at this point when all I can assume a massive team fight broke out. I suppose my father is a support main like my self as I could hear my mother encouraging him and coaching him on his Alistar play.\n\n“Pulverise that pussy! Pulverise it”\n\nThere must have been a Yummi on the other team. I could picture the team fight in my head playing out and I started to get more frantic wondering what the outcome of the team fight would be.\n\n“Yes baby, keep going keep going” My mother exclaimed.\n\nThey must of aced them and are now running down mid to close the game out! I can only assume my mother has just respawned and is about to TP in the enemy base to join father in killing the nexus!\n\n“I’m coming baby I’m coming” She keeps repeating to my father “Yes keep hitting it just like that” My dad must be carrying this game from the way my mother is yelling at him in joy\n\n“OHHHH FUCK YES DAVID” she screams!\n\nHe’s done it. My dad has killed the nexus and my parents have gained some hard earned LP.\n\nThe room goes silent and I catch my breath also after listening in on one of the most intense games of my life. I assume they didn’t que up again because in the next hour or so I didn’t hear a noise. Eventually I fall back asleep myself.\n\nThe next morning I got up out of bed and went to the kitchen to make some breakfast. My parents are sitting at the table.\n\nWe make some small talk before I have to quickly head out the door and go meet my friends. As I’m about the leave I turn to both of them and let them know I heard them last night.\n\nI quickly pat my dad on the back and congratulate him and start heading out the door. My father has gone bright red and my mother’s mouth is wide open in shock.\n\nI assume they are both embarrassed and completely gob smacked because they haven’t said a word and I now know they are gamers.\n\nJust before I pull the door closed behind me I turn to my mother and exclaim “Don’t worry mum, I fucking hate Yummi too” and give her a cheeky little wink",
        "permalink": "/r/copypasta/comments/p0zs4p/found_in_rleagueoflegends/",
        "comments": [
            "Where is the cum from the sex?",
            "This made me laugh thanks op",
            "Link to original?",
            "I laughed out loud",
            "Nta your parents fucking your rules",
            "One of my new favourite copypastas, amazing find",
            "I wouldn't admit to playing that shit game to my kids either.",
            "Google translated for your pleasure:\n\n>I found out recently that my parents were secretly playing in the league.  \n>  \n>My brother and I started a new video game last December. The rules were set by my parents. After 8:00 a.m., leave him in the room so we can’t sleep and play at night.  \n>  \n>A few days ago I woke up in the middle of the night and I felt anxious, I lay down on the bed and prayed to God that we would not be able to sleep. I woke up and looked at the sky and at some point I would come back until I felt something disgusting. The first sound is displayed in the parents ’room. A few seconds ago, the volume was rising and falling. They’re parents, they’re playing LoL!  \n>  \n>They can’t do much to say, but they want the best. I feel a lot of complaints and pain, I just need to click with the mouse on the table next to the bed.  \n>  \n>I stood there and listened to the best of myself as the noise continued to play as the game screamed.It should take more than 25 minutes to reach this point; all I thought was a good team game. I think my father supports me as much as I do and I heard my mother encourage and scold him for working with Alistair.  \n>  \n>\"Be smart! Click\"It must be Yummi and the other side. I watched the team shake during the match and began to wonder more and what the outcome of the team game would be.  \n>  \n>\"Yes, dear, stop,\" Mom shouted.  \n>  \n>Maybe they got married and stopped fighting. I think my mom even took a vacation and went with my dad to end the relationship.  \n>  \n>“I told my son,” he told my father. \"That.\"  \n>  \n>\"Ohhhhh, I love David,\" he shouted!  \n>  \n>Yan My father died and his parents paid for his care.  \n>  \n>The room was quiet, peaceful and he listened to the ugliest games of my life. I don’t think he’ll come back sometime, I can’t hear the sound. Then I fell asleep again.  \n>  \n>The next day I got up and went to the kitchen for breakfast. My parents were sitting at the table.  \n>  \n>We started talking before we immediately went to talk to friends. When I left, he talked to me and told me I heard from him last night.  \n>  \n>I immediately called my father, thanked him and went to the door. My parents had gray hair and had fun.I think they were confused and disappointed that they didn’t speak, and now I know they were actors.  \n>  \n>Before I closed the door, I went to my mom and exclaimed, “Don’t worry, I love you,” and I laughed.",
            "Imagine being subbed to r/leagueoflegends",
            "My friends mom plays league of legends with random people outside just like this",
            "[deleted]",
            "Gamers are so cool ☺️",
            "Real",
            "r/queensofleague moment",
            "wtf is yummy 🤔more like CUMMY 😎",
            "The only post in this sub without the word cum that I have laughed to!",
            "Alistar Carry Alistar Carry",
            "Average league of legends player",
            "It's all fun and games until she says \"you're better at this than our son\"",
            "Recently 🕛 I 👁 discovered 😎 my 🏿💵 parents 👫👫 play 😈 LoL 😅😂 together 🏿 in ♀ secrecy. My ❌🌞 younger 👦 brother and I 👁 were 👶🏻 both ➡ gifted new 💦🆕 gaming laptops last ❗ Christmas. 🏼🎄 My 🆕😫 parents 👧👧 set 👌😠 some 🖤🏠 ground rules 📜 however. 🖐 After 8pm they ♂⚖ are 😻 to be 🌈 left in the lounge room as to ensure we don’t 😡👎 take 😀 them to bed 💯☠ with 😗 us 👨⛓ and 🎁 spend 💰💰 the 💦 entire 🌳👏 evening gaming. A few 😋 evenings 🌌🌌 ago I 👁 woke up 👌🍅 in the middle 🖕🖕 of 💦 the night and was 👏👊 fairly restless, 😿😿 I tossed and turned ↩ in bed 🛏 and for 👻 the 👏👏 love ❤ of 👊 god 🔝💦 could 🚅🔮 just 😤😡 not ❎ get 🤣 back ⬅⬅ to sleep. I 🏋 laid 🍆 awake 👁👁 staring 👀👁 at 😝 the ceiling finally 🙏 on the 👨😈 verge of 🍒 dozing back 🔙📬 off 😂 until ⏰ I 🙇 started 🙄💢 hearing some 🤔 faint noises. The 💰 noises were 👌👶 fairly quiet 🙊 at first 🔢🏻 and 😏💰 seemed 💌 to be 🐝 coming 💦 from 💰 my ❤ parents room. 😈😈 As 👨 the 😍👏 seconds past 🗿⚰ the noises 🔊🔊 became 😳 more 😰🍗 clear and 🍼 more frequent. It was 😱 my 🙈 father 😋 and 🆗➗ mother, 👵👵 and 🙇 they were 😓😉 playing ♀ LoL! I couldn’t make out 🗣 most of 🌾😢 what they 👧😄 were saying but ❄ they 👥🤵 must of 💦👏 been 📽 caught 👮🐾 in an intense team 🐒 fight. 🔫 I heard a lot 🍑🍑 of 💦 back ⬅ a forth sighing and panting and 🏿🙏 what 😦👼 I assume was 🏻💦 the 👨 banging of 😤 the 👏🚟 mouse against ✊ bed side ⏩🚔 table. I laid there 😍🤣 and listened in ⬇ as 😴👦 best I 💰 could 😈🤔 and the 🏼 noises kept ramping up 👀 and I 👀🤷 assume 🤷🤷 the 🌐 game got 💁 more ➕ intense 🅱 and more 😩 intense. It 💯👎 must of been 🤤 slightly past ⚰⚰ the 😗 25 👏 minute mark at this 🏻 point ⬆⬆ when all I 💰👉 can 💦 assume 🏽♀ a 🚾💰 massive 😯😯 team fight broke out. I suppose my ♂👨 father 💦 is 😩😧 a support 😥👬 main like 📞 my 👈 self 🍞💯 as I 👁 could 👈🤔 hear 🏼👂 my 😢 mother encouraging him and 🍀👏 coaching him 👱 on 🔛🔛 his 🚹 Alistar play. 😏 “Pulverise that 😐 pussy! 🙅 Pulverise it” 🤤 There 💕👨 must have 👏♂ been a Yummi on the 👏 other 👪 team. I 🤣👈 could picture 📷📷 the 👱🥖 team 🐒 fight in my 👖 head playing ♀👏 out and 🌰 I 🙋👁 started to 💦 get 🍌 more 🙅 frantic wondering 🤔 what 👶🚫 the ❤ outcome of the 🎖 team fight 💥 would be. 👬🐝 “Yes 🔞 baby, keep ✊ going ♂ keep ⏩ going” 😧🍆 My 👦🎂 mother 👵🎤 exclaimed. They 👨 must 💪🔐 of 💦😣 aced them 🏿 and 💰 are 👄 now running down 😞 mid to 💦🤧 close ↔ the game out! 🌃 I 👏🏼 can 🙂 only ☝ assume my mother has ✅ just 👏🤖 respawned and 👏 is 🤔 about to 💥 TP in the enemy base to 💦 join ♂ father 🏻💦 in killing 🔪 the nexus! “I’m ☝ coming baby 👼 I’m 💵 coming” 💦🤤 She 💁 keeps repeating to 🔟➡ my 😎 father 😋 “Yes keep 🏭♀ hitting 😦😦 it 😍 just 😬 like that” My 👈👏 dad 👨♂ must 🙅 be 🅱 carrying this 💯 game 🎳🔥 from 👉🏾 the ⛓ way my 😯🏿 mother 🎤🏻 is 😄🚟 yelling at 🍆🕛 him 💦😪 in 🚭 joy 😊 “OHHHH FUCK 💦🖕 YES ❗👶 DAVID” she 👸 screams! He’s done 💯🏽 it. 👊💯 My 🏿 dad 👴 has 👏🚪 killed ❌ the nexus and 🔫 my parents 👦 have gained some 💵💛 hard 🍆👅 earned 📈📈 LP. The room 😭🏨 goes 😩 silent and I 🙋😎 catch 🎣 my 👨 breath also 🙇✅ after listening 👌 in on one of the ❤ most 🔝💯 intense games 📀👏 of my 💖🤤 life. I 👁 assume 🏽 they didn’t 😊 que up 👎 again 😭 because ➡😡 in 😌👉 the 👑 next 📅💕 hour 💯 or so 🏫👉 I didn’t 😑 hear a noise. Eventually 🎓🎓 I 👁 fall 🍂↘ back 😌 asleep 💤💤 myself. 😂⚰ The 🍑💡 next 🗓 morning 😡 I 👁👀 got 😏 up ☝ out ♀ of 🗜 bed 🛏☠ and 💦 went 🚗👉 to 💦👱 the kitchen 💦💦 to ✌ make 👏 some 🎊💥 breakfast. My 🌞 parents are 💢😻 sitting at 🍆💯 the 🌛😍 table. We 🏻👴 make some 👆 small ⏬ talk 💬 before 🍑 I 🤢👁 have to quickly ⏰ head 👤😗 out 💦👅 the door 🚪🚪 and 👏 go meet my 🕎👣 friends. 👦💦 As I’m 😞💦 about 💦☝ the 🏿 leave I 👏👁 turn 🚟 to 🍆🤣 both 🌜 of them and 🔙 let 🙆 them 🌈🎈 know 📚 I 👁 heard 🤔 them 🙊 last ♿ night. 🌙🕛 I quickly pat my 👩 dad 😪 on 🔛 the 💰💋 back 👏🔙 and 👏 congratulate him and 💃🔻 start 😩 heading out the door. 🔑 My 💕 father 😋🍆 has 🏼✅ gone 🖐😡 bright 😎✨ red 🔴‼ and 💰😏 my mother’s mouth 😷 is wide 🏻👐 open 👐 in shock. 😨😨 I 💀 assume they are 🔢 both embarrassed and 💨 completely 😍🙌 gob smacked because 👮 they 👥💥 haven’t said ⚕ a 🎊💯 word and ➕ I 🤡 now 😨 know they 😂👥 are 😍😎 gamers. Just before 🍆 I 🚟 pull the 🅱💌 door 🔑😱 closed 🚫🚫 behind 🍑 me I 👁👁 turn to 🏼💰 my 🔌💦 mother 😇👵 and exclaim “Don’t 🚫😡 worry 😘🙇 mum, 😂 I 👁 fucking hate Yummi too” 😍😲 and 👏 give 👏😩 her 💦🏻 a cheeky 🍑🍑 little 👌 wink 💦💦",
            "This is hilarious, thank you",
            "I want to cum in the cat from league of legends ironically",
            "L🤢🤮ue of L😬😬😬nds",
            "I know this is satire and Def not real but the pure second hand embarrassment I'm feeling rn is ungodly",
            "Woah, well well well",
            "Holy shit, I hope Yummi got pulverized.",
            "HALAL DROVEN SMITE HARAM YUUMI WITH IMPUNITY",
            "Okay this guy’s a genius, let me explain\n\n\nSex",
            "在 r/leagueoflegends 中找到  \n國家安全局  \n最近我發現我的父母秘密地一起玩英雄聯盟。  \n去年聖誕節，我和弟弟都收到了新的遊戲筆記本電腦。然而，我的父母制定了一些基本規則。晚上 8 點之後，他們將被留在休息室，以確保我們不會帶他們和我們一起睡覺並度過整個晚上的遊戲。  \n前幾天晚上我半夜醒來，相當焦躁不安，在床上輾轉反側，看在上帝的份上怎麼也睡不著。我醒來盯著天花板，終於快要打瞌睡了，直到我開始聽到一些微弱的聲音。起初的聲音相當安靜，似乎是從我父母的房間里傳來的。隨著幾秒鐘過去，噪音變得更加清晰和頻繁。是我爸爸媽媽，他們在玩英雄聯盟！  \n我聽不清他們在說什麼，但他們肯定陷入了激烈的團隊鬥爭中。我聽到了很多前後的嘆息和喘氣聲，我認為是鼠標敲擊床頭櫃的聲音。  \n我躺在那裡盡我所能聆聽，噪音不斷增加，我認為比賽變得越來越激烈。  \n在這一點上，當我可以假設一場大規模的團隊戰鬥爆發時，它一定稍微超過了 25 分鐘。我想我的父親和我一樣是一個支持主力，因為我可以聽到我母親鼓勵他並指導他玩阿利斯塔。  \n“粉碎那個陰戶！粉碎它”  \n另一個團隊中一定有一個 Yummi。我可以在腦海中想像團戰正在上演，我開始更加瘋狂地想知道團戰的結果會是什麼。  \n“是的，寶貝，繼續，繼續。”媽媽喊道。  \n他們必須得勝，現在正跑到中路以結束比賽！我只能假設我的母親剛剛重生，即將在敵方基地 TP 與父親一起殺死紐帶！  \n“我來了寶貝我來了”她不斷對我父親重複“是的，一直這樣打”我爸爸一定是在玩這個遊戲，因為我媽媽高興地對他大喊大叫  \n“OHHHH FUCK YES DAVID”她尖叫起來！  \n他做到了。我父親殺死了這個關係，我的父母獲得了一些來之不易的 LP。  \n房間裡一片寂靜，聽完我一生中最激烈的一場比賽后，我也屏住了呼吸。我想他們沒有再次排隊，因為在接下來的一個小時左右我沒有聽到任何噪音。最後我自己又睡著了。  \n第二天早上，我起床，去廚房做早餐。我的父母坐在桌子旁。  \n在我不得不快速出門去見我的朋友之前，我們聊了幾句。當我要休假時，我轉向他們兩個，讓他們知道我昨晚聽到了他們的聲音。  \n我趕緊拍拍爸爸的後背祝賀他，然後開始出門。我父親臉色通紅，我母親震驚地張大了嘴巴。  \n我猜他們都很尷尬，而且完全被打臉了，因為他們一句話也沒說，我現在知道他們是遊戲玩家。  \n就在我關上身後的門之前，我轉向我的母親，大喊“媽媽別擔心，我他媽的也討厭 Yummi”，然後厚顏無恥地對她眨了眨眼",
            "?? Huh",
            "should've played the superior game dota2 instead",
            "this mus be troll",
            "[removed]",
            "This is gold",
            "Bruh",
            "One of the best copy pastas.",
            "Wholesome actually",
            "Absolute gold, I loved the part where he pulverized that pussy",
            "That's the funniest thing I've seen today. Thanks OP",
            "Lol",
            "This sounds like a scenario a league player would have in their life",
            "Message for dumb people: the parents aren't having sex, they are playing LoL",
            "U guys like Ninja?",
            "Now this is gaming",
            "Nothing will ever beat the rich guy who basically insulted people by saying you are poor I am not. Till this day it’s the funniest thing I’ve ever read but they deleted it I believe. The guy was not even remotely on our level of thinking and self awareness but man was it a funny post for LOL",
            "This is the greatest thing I’ve ever read",
            "when yuumi takes too much zoomies",
            "Great Google translate: \n\nRecently, I noticed that I secretly bought with LoL as well.\n           My sister and I received a new Christmas gift and a laptop.  But they made my rules.  He had to stay in his room after eight o’clock at night to make sure he couldn’t talk to her or sleep with her.\n           I awoke in the middle of the night quietly, jumping on the bed in the presence of God's sleepless night.  I woke up and saw the roof of the house, which was part of the economy, and I began to hear noises.  The first silence begins to fade, as if coming out of an old room.  In a matter of seconds, his voice was clear and unchanging.  Mom and Dad will play LoL!\n           I could not hear what he was saying, but he had to fight hard.  I heard a loud bang that I thought was a rat on a table by the bed.\n           I was sleeping there, feeling better than anyone, and my voice was louder than before, I thought my game was noisy.\n           It should be over 25 minutes now for me to think of a major attack on that team.  I think my dad is a good lover like me because I heard my mom loved him and coached him Alistar.\n           \"Get out.\"  In the stomach »\n           Some groups may have a sense of humor, and as I wondered how this group's fight got into my spirit, I began to think seriously about the consequences of the group's war.\n           My mother said, \"My child, let's go ahead.\"\n           He has to take the lead and miss the center to finish the game.  What I think the mother will wake up to is that she will join the great TPU enemy to destroy her relationship with her father.\n           \"I'm gone, my son, I'm here,\" he kept saying to my father.  \"Well, you're typing like that.\"\n           \"David!\"  Cry.\n           OK.  My people and people can understand that LPP is powerful.\n           This room quietly \"breathes\" after listening to one of the most important games in my life.  I think he will stop making lines because it hasn't been long since I heard him.  Later I fell asleep again.\n           The next day I got out of bed and went to the kitchen for breakfast.  She is sitting at my table.\n           I chatted a few times before I went out to meet my friends.  When I got to the trip, I turned around and told him I had spent the night listening.\n           I immediately turned to my father, greeted him, and left.  My father was red and my mother was scared.\n           I’m embarrassed, I’m angry, I don’t say anything, so now I know I’m a player.\n           Before closing the door, I looked up and shouted, \"Don't be afraid, Mom, I hate candy too,\" and looked at her without hesitation.",
            "OMG I only got it at the end, this is amazing.",
            "Ur mom a vajanna main",
            "First I started to throw up. Then I started to laugh",
            "Lmao this was actually funny",
            "ngl i hope you three three recover from LoL addiction",
            "lol good one",
            "i love this so much",
            "u/uwuwizard",
            "just imagine they were really playing lol."
        ]
    },
    {
        "post_id": "n1kegh",
        "author": "FistMeWithYourCactus",
        "title": "Am I gay?",
        "url": "https://www.reddit.com/r/copypasta/comments/n1kegh/am_i_gay/",
        "score": 10947,
        "num_comments": 304,
        "created_utc": 1619749893.0,
        "selftext": "Recently, I’ve been wondering if I might be a gay.  It all started a week ago. I was sitting on the toilet, pooping, when all of a sudden, a big shit turd comes out of my ass. It was huge. Big big. It’s so fucking big, I gotta look down into the toilet to check for blood. No blood, but the turd is fucking massive. I notice something strange about it. The end of the turd, sticking out of the water, looks like a dick head. A penis head. Needless to say, I was concerned. How could this be? I picked it up from the water, and put it back up my ass. To my surprise, it felt good. I then shit it back into the water. Splash. I then repeated this a few more times, moaning out “Oscar Winning actor Anthony Hopkins” each time. I am not sure if I am now gay. My boyfriend says it’s completely normal, but he’s gay, so I can’t trust him.",
        "permalink": "/r/copypasta/comments/n1kegh/am_i_gay/",
        "comments": [
            "Glorious.",
            "can someone copy and paste this for a poor mobile user please",
            "No soy hetero. pero quiero chupar una vagina. Las vaginas lucen tan jugosas y sabrosas cuando piensas en ellas. Solo imagina tener una calida y húmeda en tu boca mientras que una mujer mas pequeña y débil que tu te acaricia la cabeza y te llama papi. Soy completamente homosexual. Solo tengo un fetiche con vaginas.",
            "You're not gay.\nBeing gay is gay, and that's pretty gay bro 😘.",
            "Recently 🕑, I’ve been wondering 🤔 if I 👁 might 🔍 be a gay 🌈. It all 💯 started 💢 a week 📅 ago 😅. I 👁 was sitting 💺 on 🔛 the toilet 🚽, pooping 💩, when 🍑 all 😤 of a sudden 😱, a big 🍆 shit 💩 turd 💩 comes 💦 out of my ass 🍑. It was huge 😤. Big 👀🍆 big 🍆💦. It’s so fucking 🖕👦 big 🍆, I 👁 gotta 🔫✌🏼 look 👁 down 🔻 into the toilet 🚽❌ to check ✔ for blood 💉. No ⛔🚫 blood 💉, but 🍑 the turd 💩 is fucking 🖕👦😜 massive 🌐. I 👁 notice 👀👁 something 🤔💡 strange 😕🤔 about 💦 it. The end 🔚 of the turd 💩, sticking 👉👌 out of the water 💧, looks 👁👀 like 😄 a dick 🍆😋 head 💆. A penis 🍆 head 💆. Needless ❓ to say 🗣, I 👁 was concerned 😟. How could this be? I 👁 picked ⛏ it up ⬆ from the water 💦, and put 😏 it back 🔙 up ⬆ my ass 🍑. To my surprise 😱, it felt 😁 good 👍👌🐾. I 👁 then shit 💩 it back 🔙 into the water 💦🅱. Splash 💦👅. I 👁 then repeated 🔄 this a few more times 🕐, moaning 😩🗣👄 out “Oscar Winning 🏆 actor 🎭 Anthony 😈👱‍♀️ Hopkins” each time 🕐. I 👥 am not sure 👍 if I 👁 am now gay 🌈. My boyfriend 👬 says 🗣 it’s completely 🚫 normal 👩‍🦯, but 🔮🍑 he’s gay 🏳️‍🌈, so I 👁 can’t trust 🙅 him 👨.",
            "You don’t trust your gay boyfriend? That’s kinda cringe tbh.",
            "Only gay if the tips touch",
            "Wecentwy, I’ve been wondewing if I might be a gay.  It aww stawted a week ago. I was sitting on the toiwet, pooping, when aww of a sudden, a big shit tuwd comes out of my ass. It was huge. Big big. It’s so fucking big, I gotta wook down into the toiwet to check fow bwood. No bwood, but the tuwd is fucking massive. I notice something stwange about it. The end of the tuwd, sticking out of the watew, wooks wike a dick head. A penis head. Needwess to say, I was concewned. How couwd this be? I picked it up fwom the watew, and put it back up my ass. To my suwpwise, it fewt good. I then shit it back into the watew. Spwash. I then wepeated this a few mowe times, moaning out “Oscaw Winning actow Anthony Hopkins” each time. I am not suwe if I am now gay. My boyfwiend says it’s compwetewy nowmaw, but he’s gay, so I can’t twust him.",
            "Recently, I’ve been wondering if I might be a gay.  It all started a week ago. I was sitting on the toilet, pooping, when all of a sudden, a big shit turd comes out of my ass. It was huge. Big big. It’s so fucking big, I gotta look down into the toilet to check for blood. No blood, but the turd is fucking massive. I notice something strange about it. The end of the turd, sticking out of the water, looks like a dick head. A penis head. Needless to say, I was concerned. How could this be? I picked it up from the water, and put it back up my ass. To my surprise, it felt good. I then shit it back into the water. Splash. I then repeated this a few more times, moaning out “Oscar Winning actor Anthony Hopkins” each time. I am not sure if I am now gay. My boyfriend says it’s completely normal, but he’s gay, so I can’t trust him.",
            "Well that was a rollercoaster ride",
            "NTA your asshole your rules",
            "According to a research done by Dr. Asshole Department of Poopology at the University of Gays, if poop is pointy at the end, you are gay. So YTG. Yes the Gay.",
            "[removed]",
            "Based Poop",
            "Your a fake gay",
            "NTA your asshole your rules",
            "NTA. You were just experimenting. Anthony Hopkins is definitely the asshole.",
            "Prostate cancer 🥳",
            "masterpiece",
            "NTA your asshole your rules",
            "What a terrible day to be literate",
            "NTG (not the gay)",
            "Nah, sounds straight to me",
            "I lost 378 brain cells by just reading this.\n\ngreat story bro!",
            "Nothin gay about a little bit of butt stuff. Just make sure to keep your socks on next time.",
            "This is horrible and absolutely disgusting.  Where can i find more of this?",
            "Recently, I’ve been wondering if I might be a gay. It all started a week ago. I was sitting on the toilet, pooping, when all of a sudden, a big shit turd comes out of my ass. It was huge. Big big. It’s so fucking big, I gotta look down into the toilet to check for blood. No blood, but the turd is fucking massive. I notice something strange about it. The end of the turd, sticking out of the water, looks like a dick head. A penis head. Needless to say, I was concerned. How could this be? I picked it up from the water, and put it back up my ass. To my surprise, it felt good. I then shit it back into the water. Splash. I then repeated this a few more times, moaning out “Oscar Winning actor Anthony Hopkins” each time. I am not sure if I am now gay. My boyfriend says it’s completely normal, but he’s gay, so I can’t trust him.",
            "With a screen name of FistMeWithYourCactus, I don’t think there’s any question about it. You’re gay. I didn’t even read your post. Nothing wrong with it, as if you required my permission. You certainly don’t. Enjoy yourself. Be safe. Life is hard enough without beating yourself up about your sexuality. Bye.",
            "Cos'è sta merda",
            "I wish i was illiterate right now",
            "what the fuck",
            "Wtf did I just read..",
            "yes",
            "OPs username checks out",
            "hahahah",
            "WHY THE WHOLESOME AWARDS",
            "Very gay indeed.",
            "Okayyyyy that's enough of this copypasta.",
            "that’s gay",
            "Average r/196 user",
            "lmfaooo fuck you retard! 😂😂😂😂😂",
            "🚶‍♂️are you the👁👄👁new girl😜heh☺️ i thought so😌i’ve never seen👀 you before🤔 cone e chee wah ✋🏻 i’m david-kun😚it’s so nice😛to finally meet you🤪you look just like😳my waifu🥵HEH👹HEH👹HEH👹HEH👹HEH👹HEH👹anyways😐i’m so sorry😔about the jerks😡in class😤theyre all👊🏻BAKA👊🏻they only want😭one thing😫not me🥴i just like🤓to watch📺my favourite anime😍jiu jitsu kaisen😍and read manga😎mmmalso👉🏻👈🏻ithinkyourereallycool😅kawaee desu neigh😳🐴HEH👹HEH👹HEH👹HEH👹HEH👹HEH👹nghuuh😣i’m sorry😤i’m just nervous😭okay😡it’s just😉well😋it’s just🥵mm I JUST WANT TO KNOW🤔IF I CAN SUCK👅ON YOUR NIPPLETS🤭OKAY❓well😰what do you 👊🏻👊🏻NNGGGH😵",
            "[deleted]",
            "Not gay, just have a scat kink",
            "Breakup with ur boyfriend, he's making u gay, and dm me. I have some solutions",
            "Ligma",
            "*oscar winning actor anthony hopkins*",
            "Splendiferous!",
            "Fabulous",
            "NTA. Your gay, your rules",
            "Nice.",
            "What do you call a gay dinosaur? A megasaurass...",
            "🎵 Do your balls hangs, do they wobble to and fro, can you tie them in a knot, can you tie them in a bow. Do your balls hang low, do they wobble to and fro, do the balls, hang, low? 🎵 \n\nIf so - maybe",
            "Such a wonderful ending",
            "Chadtony Hopkins",
            "I’m sorry WHAT",
            "Not gay enough",
            "u/shittytranslatorbot",
            "Perfect",
            "I think OP shat on his brown big dildo",
            "Im so confused",
            "This is how I found out I was gay, so yeah. Your gay.",
            "Recently, I’ve been wondering if I might be a gay. It all started a week ago. I was sitting on the toilet, pooping, when all of a sudden, a big shit turd comes out of my ass. It was huge. Big big. It’s so fucking big, I gotta look down into the toilet to check for blood. No blood, but the turd is fucking massive. I notice something strange about it. The end of the turd, sticking out of the water, looks like a dick head. A penis head. Needless to say, I was concerned. How could this be? I picked it up from the water, and put it back up my ass. To my surprise, it felt good. I then shit it back into the water. Splash. I then repeated this a few more times, moaning out “Oscar Winning actor Anthony Hopkins” each time. I am not sure if I am now gay. My boyfriend says it’s completely normal, but he’s gay, so I can’t trust him.",
            "Totally straight, tell your bf he's wrong!",
            "Ok u/FistMeWithYourCactus",
            "kinda gay frfrfr",
            "This is humor?",
            "Y'know, if you can't be bothered to take an interest in your own sexual orientation, why should we?",
            "\"Am I gay?\"  \nYes you are",
            "Bro that can't be gay. If that was gay, I'd be gay because of all those times I shoved MY boyfriend's shit into my ass. Everyone knows the rule: it's only gay if the turd is 2.",
            "Kid in middle school kept making this joke \"it feels good when I poop.\" He said that enough to get me thinking. Turns out in highschool his friends kept setting him up with girls and he wasn't having it idk. \n\nI had my suspicions about two other kids.\n\nOne of them I saw on a Stephen King show on TV bullying this gay kid, very handsome lad that def sells the jock look, and the gay kid comes on to him and they begin to passionately tongue.\n\nThe other went to Oxford to be a Theologian. Now this kid was the most complicated. I mean he would be bisexual since the girl who always touched me he was obsessed with being her slave, got mad when she made a public FB post about it. \n\nAlso got mad, or more just started to cry real bad, when he got thrown to the floor by this girl out of his chair during Religion class, the teacher came in and as he was balling on the floor and said \"what happened.\" The girl unapologetic in tone said \"he smelled my hair.\" Indeed he did. I saw it, in the desk behind her he leaned in to take a big sniff. She turned around alarmed, the face one has when they are about to throw someone out of their chair.",
            "Yes you are gay",
            "can someone send me this",
            " Gayer than a bag of dicks",
            "Weird",
            "And Heerlik (Delicious)",
            "u/uwutraslator"
        ]
    },
    {
        "post_id": "je2edg",
        "author": "Enslaved3yo-old",
        "title": "Lamar’s famous quote from GTA V",
        "url": "https://www.reddit.com/r/copypasta/comments/je2edg/lamars_famous_quote_from_gta_v/",
        "score": 10955,
        "num_comments": 310,
        "created_utc": 1603116902.0,
        "selftext": "Nigga don’t hate me cause I’m beautiful nigga maybe if you got rid of that Yee Yee Ass hair cut you got you would get bitches on your dick, oh, better yet maybe Tanisha will call your dog ass if she ever stops fucking with that brain Surgeon or Lawyer she fucking with, Niiiggggaaaaaa.",
        "permalink": "/r/copypasta/comments/je2edg/lamars_famous_quote_from_gta_v/",
        "comments": [
            "The last \"Nigga\" is wrong, it should be \"Niiiggggggggaaaa\"",
            "Nigga don’t hate me because I’m beautifuw nigga maybe if you got wid of that Yee eh ass haiw cut if youws you wouwd get bitches on youw dick bettew yet maybe if Tanisha stops fucking with that bwain suwgeon ow shit. Nigga",
            "Wait where is cummy???",
            "[deleted]",
            "Black people in my country are not as angry as blacks.",
            "What!",
            "i honestly love the way he says the n word at the end. it's always been stuck in my head",
            "The last n word should be\n\n𝓝𝓲𝓰𝓰𝓪\n\n>!farewell, n word pass!<",
            "Surgeon or lawyer* / Yee Yee ass haircut* / There's no \"if\" in \"Maybe Tanisha will call your dog ass\"",
            "Nigga don’t hate me because I’m beautiful nigga maybe if you got rid of that old Yee Yee Ass hair cut you got you'd get bitches on your dick. Better yet, maybe Tanisha will call yo' dog ass if she ever stop fucking with that brain Surgeon or Lawyer she fucking with,\n\n♪♪ Niiiggggaaaaaa. ♪♪",
            "***** don’t hate me because I’m beautiful ***** maybe if you got rid of that Yee eh ass hair cut if yours you would get bitches on your dick better yet maybe if Tanisha stops fucking with that brain surgeon or shit. *****",
            "is cummy in danger again ?",
            "Ah yes, The scene that caused some Vtubers saying the N Word",
            "🎵 _Nigga_ 🎵",
            "Nigga don’t hate me because I’m beautiful nigga maybe if you got rid of that Yee Yee Ass hair cut you got you would get bitches on your dick, better yet maybe Tanisha will call your dog ass if she stops fucking with that brain Surgeon or Lawyer she fucking with, Niiiggggaaaaaa.",
            "edit: thanks for the 1 upvote! It means to much to me!\n\nedit: nobody cares",
            "#BIG DOG BIG BALLS",
            "*nnnyuuugaaaaahhhhhh*",
            "r/sandycheekscockvore",
            "!thesaurizeThis",
            "Down the rabbit hole I go peko",
            "!emojify",
            "it's ok, you didn't my feelings",
            "Ni-\n\n-ce",
            "Course you had to ruin it with your edits",
            "ah the infamous Vtuber catchprase",
            "u/nwordcountbot u/Enslaved3yo-old",
            "F cummy",
            "Hate to be that guy but its more like Niyguuuuuuhh",
            "Listening to your comments, I decided to correct a few things. Your welcome!",
            "Nigga ass nigga",
            "W H A T ? !",
            "N",
            "What a coincidence my friends and I were just talking about GTA V",
            "Does anyone have an N-word pass so that I may qoute this in my next online class?",
            "**** don’t hate me because I’m beautiful **** maybe if you got rid of that Yee eh **** hair cut of yours you would get **** on your ****, better yet maybe if Tanisha will call your dog **** if she stops **** with that brain surgeon and lawyer she is **** with. ****",
            "are all of the people in these replies must be black or mixed with something bc y'all seem a lil too comfortable saying the n word",
            "Pls cummy bot don't copy with n word quotes",
            "!emojify",
            "u/nwordcountbot",
            "KNOCK KNOCK NIIIIGAZ",
            "Horse cock",
            "it’s “yee yee ass haircut you got”",
            "Nigga don’t hate me because I’m beautiful nigga maybe if you got rid of that Yee-Yee ass haircut you got you’d get bitches on your dick. oh, better yet maybe Tanisha’ll call your dog-ass if she ever stop fucking with that brain surgeon or lawyer she fucking with. Niiigggggggggaaaa.",
            "u/uwuwizard",
            "u/nwordcountbot u/Kremlensk",
            "[removed]",
            "!translatify",
            "What?!",
            "Neeyyygaaaaa~",
            "u/emojifybot",
            "u/wordscountbot",
            "Cummy where are you",
            "Goddammit I miss Cummy so much 😵",
            "it’s actually “you would get *some* bitches on your dick” unless that’s just a mandela effect i’m having",
            "Damn Lamar on fire",
            "!emojify",
            "🎶 *Niieeegaa* 🎶",
            "Had to wake the kids up to witness this monumental dub.",
            "Lmao can I get a mobile version",
            "what ¿",
            "!emojify",
            "Great quote",
            "What is yee yee ass hair cut even supposed to mean lol",
            "u/nwordcop u/antievrbdy999",
            "u/nwordcop u/Enslaved3yo-old",
            "If there’s some shit to be won, God damn I want it",
            "This copypasta sucks ass, so I fixed it up-\n\nNigga don’t hate me cause I’m beautiful nigga- Maybe if you got rid of that yee yee ass haircut you’d get some bitches on your dick, oh- better yet, maybe Tanisha will call yo dog ass if she ever stop fucking with that brain surgeon or lawyer she fuckin with, Niiiggggaaaaaa.",
            "You’re a bit early for this",
            "Being black I find that whole thing ridiculous"
        ]
    },
    {
        "post_id": "dmyksz",
        "author": "DrWinmon",
        "title": "Hi there [minority group]! We're [multimillion dollar company]!",
        "url": "https://www.reddit.com/r/copypasta/comments/dmyksz/hi_there_minority_group_were_multimillion_dollar/",
        "score": 10930,
        "num_comments": 224,
        "created_utc": 1572015267.0,
        "selftext": "A few years ago, we would never have supported \\[minority group\\], but now that it's publicly acceptable and profitable to do so, we love you! Back when \\[minority group\\]'s rights wasn't socially accepted, we never would have hired or supported you, but now we love you! Our brand totally really pinky promise care about you, and 100% aren't a soulless corporation trying to make a profit from your social movement. Remember to buy our products, as much as you possibly can, in order to support us!",
        "permalink": "/r/copypasta/comments/dmyksz/hi_there_minority_group_were_multimillion_dollar/",
        "comments": [
            "Too bad that group will never be gamers 😭😭😭",
            "[COMPANY] SUPPORTS ME???? NOW I MUST CONSOOM PRODUCT",
            "[removed]",
            "\\* Note: This does not apply, under any circumstance🙅‍♂️, to individuals in 🇭🇰Hong Kong, 🧘Tibet, or 🇹🇼 Taiwan.",
            "A few yeaws ago, we wouwd nevew have suppowted \\[minowity gwoup\\], but now that it's pubwicwy acceptabwe and pwofitabwe to do so, we wove you! Back when \\[minowity gwoup\\]'s wights wasn't sociawwy accepted, we nevew wouwd have hiwed ow suppowted you, but now we wove you! Ouw bwand totawwy weawwy pinky pwomise cawe about you, and 100% awen't a souwwess cowpowation twying to make a pwofit fwom youw sociaw movement. Wemembew to buy ouw pwoducts, as much as you possibwy can, in owdew to suppowt us!",
            "Pride month be like",
            "[removed]",
            "Meow",
            "#Hi there, niggers! We're KKK!\n\nA few years ago, we would never have supported niggers, but now that it's publicly acceptable and profitable to do so, we love you! Back when niggers' rights wasn't socially accepted, we never would have hired or supported you, but now we love you! Our brand totally really pinky promise care about you, and 100% aren't a soulless corporation trying to make a profit from your social movement. Remember to buy our products, as much as you possibly can, in order to support us!",
            "r/HailCorporate would be proud",
            "!remindme 5 years",
            "there is no ethical consumption under capitalism",
            "A few years ago, we would never have supported ur mom, but now that it's publicly acceptable and profitable to do so, we love you! Back when ur mon's rights wasn't socially accepted, we never would have hired or supported you, but now we love you! Our brand totally really pinky promise care about you, and 100% aren't a soulless corporation trying to make a profit from your social movement. Remember to buy our products, as much as you possibly can, in order to support us!",
            "So glad [multimillion dollar company] took the time to say hello to us here on little tiny reddit!  Wow!",
            "A few years ago, we would never have supported [minority group], but now that it's publicly acceptable and profitable to do so, we love you! Back when [minority group]'s rights wasn't socially accepted, we never would have hired or supported you, but now we love you! Our brand totally really pinky promise care about you, and 100% aren't a soulless corporation trying to make a profit from your social movement. Remember to buy our products, as much as you possibly can, in order to support us!",
            "Hi there retard! We're the mods of r/copypasta\n\nA few years ago, we would never have supported retards, but now that it's publicly acceptable and profitable to do so, we love you! Back when retard's rights wasn't socially accepted, we never would have hired or supported you, but now we love you! Our brand totally really pinky promise care about you, and 100% aren't a soulless corporation trying to make a profit from your social movement. Remember to buy our products, as much as you possibly can, in order to support us!",
            "Isn't that kind of the point though? To change large corporations and the government by getting the people involved first?\n\nLike, for sure, they're doing it for the wrong reasons, no question about that. But you're kind of mocking the actual \"game plan\" here. People forcing change from the bottom up. Now that \"we\" have made it profitable, corps will start paying attention to minorities and disenfranchised peoples.",
            ">I get the feeling this is a little disingenuous...  \n>  \n>Who cares about their intention? They're doing a good thing either way, so consume. that. PRODUCT.",
            "rofl",
            "\" - in order to support us saying we support you!\"",
            "Meow",
            "Corporations during pride month be like",
            "!remindme 6 years",
            "r/hailcorporate",
            "Meow",
            "DAE hate company trying to get good PR?",
            "\"In order to stop this horrible warlord from kidnapping children and forcing them to do labor or kill each other on the front lines, buy our merch!\"",
            "Every college ever.",
            "When every company made their logo rainbow colored for gay month",
            "[deleted]",
            "Smh :(",
            "spicy",
            "not nearly as good as homosexuals pasta",
            "See: Chick fil a",
            "Ho there [minority group]! had we supported you prior to the legalization and acceptance of people like you, we would face great legal backlash. Now, however, we can profit off of it!",
            "!remindme 4 minutes",
            "Decided to put this through a German accent generator:\n\n\"Ein few years ako, ve vould neffer haffe zuborded \\[minority group\\], put now zat it's bublicly Haccebdable und brofidable to do zo, ve loffe vu! Pack ven \\[minority group\\]'s rights vasn't zocially Haccebded, ve neffer vould haffe hired or zuborded vu, put now ve loffe vu! Our prand totally really binky bromize care apout vu, und 100% aren't ein zoulless corborazion trying to make ein brofit from your zocial moffement. Arh ! Rememper to puy our brotucts, as much as vu bozibly can, in orter to zubort us!\"",
            "Damn i didn't know Nike had a reddit account.",
            "I never got why people didn’t like this. Times change and different people are in charge, so they do a little bit of awareness. Nothing wrong with it and I’m sure it’s better for it to exist than not, but unless gets to the point where people think a Jenner is gonna solve world peace then it’s fine.",
            "This but unironically",
            "Damn im a mexican but now that im a gamer my benefits cancel out",
            "Meow",
            "!kzme 5 years",
            "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀⠐⠠⡀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠶⣠⠖⠉⠀⠁⠀⠨⠢⠘⡄ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢤⠖⠅⡴⠁⠀⠀⠀⠀⠀⠰⡵⠂⢰ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠶⠕⢅⡞⠀⠀⠀⠀⠀⠀⠀⠨⠨⠆⢸ ⠀⠀⠀⠀⠀⠀⠀⠀⠰⠕⠕⠆⡜⠀⠀⠀⠀⠀⠀⠀⠀⠲⡵⠊⢸ ⠀⠀⠀⠀⠀⠀⠀⠀⠵⢊⠒⣸⠀⠀⠀⠀⠀⠀⠀⠀⡐⢊⠺⠅⣸ ⠀⠀⠀⠀⠀⠀⢀⣀⠐⠑⡅⡇⠀⠀⠀⠀⠀⠀⣠⢈⠚⠓⡐⣆⡇ ⠀⠀⠀⠀⠀⠀⠘⡗⡑⢊⢹⠀⠀⠀⠀⠀⢀⣼⡙⠓⡑⢊⢺⡸⠀ ⠀⠀⠀⠀⠀⠀⠡⠻⡚⠓⡜⠀⠀⠀⠀⣠⢞⠁⡞⢊⠚⢓⢣⠃⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠪⢜⣚⣢⣄⣒⡭⠖⠁⣼⠑⠓⡑⢮⠏⠀⠀ ⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⠓⠐⢊⢮⠏⠀⠀⠀ ⠀⢠⠖⠚⡒⢢⢢⠀⠀⠀⠀⠀⠀⠀⠀⠠⡃⢊⠊⣣⠋⠀⠀⠀⠀ ⠀⡰⠚⢊⠚⡓⣸⠀⠀⠀⠀⠀⠀⠀⠀⢈⠚⢂⡔⠁⠀⠀⠀⠀⠀ ⠀⠂⡖⠤⠭⠔⠃⠀⠀⠀⠀⠀⠀⢀⠚⢓⡵⠋⠀⠀⠀⠀⠀⠀⠀ ⠢⣀⠱⢄⡀⠀⠀⠀⣀⠠⠀⠀⢐⣠⠴⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠈⠓⠦⣬⣍⣉⣉⣠⣤⠼⠞⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
            "Disney:",
            "Well yeah thats basic PR",
            "Imagine being surprised that companies exist to make money.",
            "Your mom",
            "im tler did nothing wrong",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/aboringdystopia] [Hi there \\[minority group\\]! We're \\[multimillion dollar company\\]!](https://www.reddit.com/r/ABoringDystopia/comments/dn18tk/hi_there_minority_group_were_multimillion_dollar/)\n\n- [/r/chapotraphouse2_2_2] [Hi there \\[minority group\\]! We're \\[multimillion dollar company\\]!](https://www.reddit.com/r/chapotraphouse2_2_2/comments/dmzszs/hi_there_minority_group_were_multimillion_dollar/)\n\n- [/r/gamingcirclejerk] [Hi there \\[minority group\\]! We're \\[multimillion dollar company\\]!](https://www.reddit.com/r/Gamingcirclejerk/comments/dn200q/hi_there_minority_group_were_multimillion_dollar/)\n\n- [/r/genzedong] [Hi there \\[minority group\\]! We're \\[multimillion dollar company\\]!](https://www.reddit.com/r/GenZedong/comments/e07ww6/hi_there_minority_group_were_multimillion_dollar/)\n\n- [/r/suddenlycommunist] [r\\/copypasta of all places!](https://www.reddit.com/r/SuddenlyCommunist/comments/dn83dh/rcopypasta_of_all_places/)\n\n- [/r/vegancirclejerk] [Sounds familiar](https://www.reddit.com/r/vegancirclejerk/comments/dnwan8/sounds_familiar/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*"
        ]
    },
    {
        "post_id": "gvu1mh",
        "author": "not_so_zach",
        "title": "Snail Sexual Oppression",
        "url": "https://www.reddit.com/r/copypasta/comments/gvu1mh/snail_sexual_oppression/",
        "score": 10927,
        "num_comments": 168,
        "created_utc": 1591191314.0,
        "selftext": "I’ve had a fish tank for almost a year now. I started with 20 snails, and over the course of this year each generation of snail has had daily mass orgies. Now we are probably like on the 50th-60th snail generation. Even quite possibly more than that. Hundreds and hundreds of snails have been born and died. They have become SO inbred that they are now so depressed and slow that they can no longer really move or eat or reproduce like their sexy relatives had once before. Now their numbers are decreasing drastically. Some snails are born over the shells of their deceased inbred relatives and\nthey don’t even make it off the pile of the lost before they themselves pass. It is truly a hell of my own unintentional creation. They thought they could just have huge kinky snail orgies on the regular with no ramifications, but they never thought about the future. They failed to recognize the drastic ramifications of banging the same 20 snails confined to their small 10 gallon glass prison. They only sought to indulge in sin, and now their severely depressed, inbred children must pay the ultimate price.",
        "permalink": "/r/copypasta/comments/gvu1mh/snail_sexual_oppression/",
        "comments": [
            "The only way to fix this is having a human male mate with the female snails in order to purify and insure the bloodline.",
            "# JESUS CHRIST",
            "I want to kill myself after reading this",
            "I’ve had a fish tank for almost a year now. I started with 20 snails, and over the course of this year each generation of snail has had daily mass orgies. Now we are probably like on the 50th-60th snail generation. Even quite possibly more than that. Hundreds and hundreds of snails have been born and died. They have become SO inbred that they are now so depressed and slow that they can no longer really move or eat or reproduce like their sexy relatives had once before. Now their numbers are decreasing drastically. Some snails are born over the shells of their deceased inbred relatives and\nthey don’t even make it off the pile of the lost before they themselves pass. It is truly a hell of my own unintentional creation. They thought they could just have huge kinky snail orgies on the regular with no ramifications, but they never thought about the future. They failed to recognize the drastic ramifications of banging the same 20 snails confined to their small 10 gallon glass prison. They only sought to indulge in sin, and now their severely depressed, inbred children must pay the ultimate price.",
            "#SNEX",
            "Was expecting a snail slime pocket pussy of sorts, guess I'll just keep dreaming for one",
            "God is fucking dead.",
            "Haha imagine if someone did that with humans. imagine if someone locked 10 people in an underground bunker and forced them and their descendants to commit insane depraved incest for hundreds of years until they devolved into freakish subhuman monsters. Obviously i wouldnt want to do anything like that but i just find it interesting to think about (not for sexual reasons)",
            "I’ve had a fish tank fow awmost a yeaw now. I stawted with 20 snaiws, and ovew the couwse of this yeaw each genewation of snaiw has had daiwy mass owgies. Now we awe pwobabwy wike on the 50th-60th snaiw genewation. Even quite possibwy mowe than that. Hundweds and hundweds of snaiws have been bown and died. They have become SO inbwed that they awe now so depwessed and swow that they can no wongew weawwy move ow eat ow wepwoduce wike theiw sexy wewatives had once befowe. Now theiw numbews awe decweasing dwasticawwy. Some snaiws awe bown ovew the shewws of theiw deceased inbwed wewatives and\nthey don’t even make it off the piwe of the wost befowe they themsewves pass. It is twuwy a heww of my own unintentionaw cweation. They thought they couwd just have huge kinky snaiw owgies on the weguwaw with no wamifications, but they nevew thought about the futuwe. They faiwed to wecognize the dwastic wamifications of banging the same 20 snaiws confined to theiw smaww 10 gawwon gwass pwison. They onwy sought to induwge in sin, and now theiw sevewewy depwessed, inbwed chiwdwen must pay the uwtimate pwice.",
            "Can snail experts or someone from snail subreddits confirm this?",
            "This sounds like the mouse utopia experiment",
            "what the fuck",
            "This is so terrible particularly because it literally happened to me in my 5 gallon tank that I bought to keep a couple snails.",
            "\"If you give a snail a shell, he will have a home. If you give a snail a computer, he will be confused. If you give a snail a cousin, they shall have retarded children\" -Elbert Einstein",
            "Why did I read all of it",
            "If God exists he will have to ask for my forgiveness.",
            "Ok Weather Report",
            "so basically \"the mouse utopia experiment\" but with snails uh?  \nif anyone is wondering, this could actually happen and it's really interesting (and depressing)   \n[watch this video](https://www.youtube.com/watch?v=NgGLFozNM2o)",
            "I have fucking Molluscophobia (phobia of snails) and holy fuck that's the most disgusting shit I've read in my fucking life",
            "r/wtfaresnails",
            "Really wish emoji bot was still with us for this one",
            "I once had a tank with a handful of ramshorn snails and this legitimately happened. Whoever made this copypasta probably actually had this happen to them.",
            "Take some individuals and put them on an ark and sink the rest of the fish tank with salty water",
            "Not my proudest fap",
            "Could you add a picture? Just for... You know... Research",
            "69 virgin cock dead earth god game virus simp jojo masturbation incel sauce roblox food rape cum meow\n\nnow we wait",
            "[deleted]",
            "fun fact: snails have sex by having a massive dong to swap sperm with each another and stabbing since they have both male and female aspects like flowers.\n\n[reference](https://youtu.be/UOcLaI44TXA)\n\nSo wtf is this guy seeing?",
            "r/eyebleach",
            "the snail are us",
            "Poor snails, stuck in bread for their entire lives.",
            "Jolyne Cujoh would love this.",
            "YESSSS CUMMYYYYY, SEXY CUMMY SNAIIIIIIL TIIIMEEE",
            "Just make snail condoms",
            "Heard this on a philza stream today.",
            "🐌 🍆",
            "please die",
            "No one:\n\nSnails: Facc",
            "Cock",
            "I’m offended",
            "Sex penis",
            "Y4 we really can't 4u",
            "I w \n I hope you have a good",
            "Please tell me who wrote this I must know. The people need answers",
            "Reminds me of hollow knight",
            "See, the mistake was believing that there was a god to begin with...",
            "Where did this originate from?",
            "sadde",
            "*cries in Eldar*",
            "oh my god i am subscribed to both this and the aquariums subreddit and i was so extremely concerned and confused.",
            "I’ve had a fish tank for almost a year now. I started with 20 snails, and over the course of this year each generation of snail has had daily mass orgies. Now we are probably like on the 50th-60th snail generation. Even quite possibly more than that. Hundreds and hundreds of snails have been born and died. They have become SO inbred that they are now so depressed and slow that they can no longer really move or eat or reproduce like their sexy relatives had once before. Now their numbers are decreasing drastically. Some snails are born over the shells of their deceased inbred relatives and\nthey don’t even make it off the pile of the lost before they themselves pass. It is truly a hell of my own unintentional creation. They thought they could just have huge kinky snail orgies on the regular with no ramifications, but they never thought about the future. They failed to recognize the drastic ramifications of banging the same 20 snails confined to their small 10 gallon glass prison. They only sought to indulge in sin, and now their severely depressed, inbred children must pay the ultimate price.",
            "[deleted]",
            "Snells law",
            "Goddamn it. I want to see this as a movie and in 3D. I will pay 100 for a ticket to see it if it comes out as a movie",
            "Yeah had the same thing. Unloved those snails. They loved to orgy.",
            "this reminds me of the rat utopia experiments done in nimh",
            "Is this from something or just from your own fucked up mind",
            "I’ve had a fish tank for almost a year now. I started with 20 snails, and over the course of this year each generation of snail has had daily mass orgies. Now we are probably like on the 50th-60th snail generation. Even quite possibly more than that. Hundreds and hundreds of snails have been born and died. They have become SO inbred that they are now so depressed and slow that they can no longer really move or eat or reproduce like their sexy relatives had once before. Now their numbers are decreasing drastically. Some snails are born over the shells of their deceased inbred relatives and they don’t even make it off the pile of the lost before they themselves pass. It is truly a hell of my own unintentional creation. They thought they could just have huge kinky snail orgies on the regular with no ramifications, but they never thought about the future. They failed to recognize the drastic ramifications of banging the same 20 snails confined to their small 10 gallon glass prison. They only sought to indulge in sin, and now their severely depressed, inbred children must pay the ultimate price.",
            "How tf u kno when a snail depressed?",
            "Fun fact: snails only need themselves to breed; they reproduce asexually! This means that they separate part of themselves and then that cut off part becomes another snail!\n\nJust a fun fact.",
            "Wow you have just summed up Africa and most of the middle east"
        ]
    }
]