[
    {
        "post_id": "g9jje7",
        "author": "i-like-to-be-wooshed",
        "title": "I found a mobile g*me on my son’s phone, he and his friends have all been punished",
        "url": "https://www.reddit.com/r/copypasta/comments/g9jje7/i_found_a_mobile_gme_on_my_sons_phone_he_and_his/",
        "score": 10303,
        "num_comments": 263,
        "created_utc": 1588063169.0,
        "selftext": "I found a mobile g*me on my son’s phone, he and his friends have all been punished\n\nMy son (13M) was recently given his own iPhone 11 meant only for contacting me, his mother, and his friends. Today, I found a disgusting g\\*me on his phone called something like “Mindcraft”. \n\nI immediately deleted the app and threw his phone in the trash. I later found remains from a Satanic ritual he performed in his bedroom, and I am certain this “Minekraft” controlled his mind. He was also watching a terrible g\\*ming show on YouTube called “PewDieGuy” which I have now blocked. \n\nHe is no longer able to leave his room, and I’ve contacted all his friends’ parents about this, it seems like this g\\*me is an epidemic. They, too, are all being punished as well. I am very disappointed and I don’t think he will see the light for a long time.",
        "permalink": "/r/copypasta/comments/g9jje7/i_found_a_mobile_gme_on_my_sons_phone_he_and_his/",
        "comments": [
            "r/banvideogames",
            "Minecraft. More like mein kampf",
            "I found a mobile g*me on my son’s phone, he and his friends have all been punished\n\nMy son (13M) was recently given his own iPhone 11 meant only for contacting me, his mother, and his friends. Today, I found a disgusting g\\*me on his phone called something like “Mindcraft”. \n\nI immediately deleted the app and threw his phone in the trash. I later found remains from a Satanic ritual he performed in his bedroom, and I am certain this “Minekraft” controlled his mind. He was also watching a terrible g\\*ming show on YouTube called “PewDieGuy” which I have now blocked. \n\nHe is no longer able to leave his room, and I’ve contacted all his friends’ parents about this, it seems like this g\\*me is an epidemic. They, too, are all being punished as well. I am very disappointed and I don’t think he will see the light for a long time.",
            "I found a mobiwe g*me on my son’s phone, he and his fwiends have aww been punished\n\nMy son (13M) was wecentwy given his own iPhone 11 meant onwy fow contacting me, his mothew, and his fwiends. Today, I found a disgusting g\\*me on his phone cawwed something wike “Mindcwaft”. \n\nI immediatewy deweted the app and thwew his phone in the twash. I watew found wemains fwom a Satanic wituaw he pewfowmed in his bedwoom, and I am cewtain this “Minekwaft” contwowwed his mind. He was awso watching a tewwibwe g\\*ming show on YouTube cawwed “PewDieGuy” which I have now bwocked. \n\nHe is no wongew abwe to weave his woom, and I’ve contacted aww his fwiends’ pawents about this, it seems wike this g\\*me is an epidemic. They, too, awe aww being punished as weww. I am vewy disappointed and I don’t think he wiww see the wight fow a wong time.",
            "r/parentingdoneright",
            "let me guess, r/BanVideoGames ?",
            "YTA",
            "that subreddit is offensive",
            "I know it is satire, but I wish it were real.",
            "You should totally put this on r/pewdiepiesubmissions",
            "meinkraft was the name, ma'am.",
            "[removed]",
            "But Minecraft good fortnite bad",
            "[Original](https://www.reddit.com/r/BanVideoGames/comments/g9cbvn/i_found_a_mobile_gme_on_my_sons_phone_he_and_his/?utm_medium=android_app&utm_source=share)",
            "Minkecraf created coronavirus, it must be stopped",
            "is r/banvideogames satirical? im 90% sure it is, just wanna be sure",
            "Okay i know this is fake but reading this made me wanna kill myself thanks OP",
            "I love the satire",
            "I legit hate pewdiepie and his fan base",
            "/ub fuck Pewdiepie\n\n/rb fuck Pewdiepie",
            "Rise up gamers must",
            "Wait until you hear about r/AgainstHateSubreddits",
            "g\\*me",
            "Dam kid got game ended",
            "NTA.",
            "I am the 666th upvote, uh oh",
            "Why don't you just buy an old model instead of an iPhone 11? Like an old Nokia or smh. Yes. Doesn't look flexy, but does that matter if the main part of the phone is to make calls, not to show it to everyone....",
            "more like epic-demic amirite guys?",
            "Epidemic G\\*mer Moment",
            "See the problem, Mrs. Fredrickson l, is that you allowed him to contact his friends on his phone. It should only be used to contact his mother and that's it. It won't destroy his confidence or social skills whatsoever, I promise",
            "Yeah but have you tried GWENT?",
            "Ur the one to be punished who tf gives a kid an iPhone 11 to be in contact, what happened to nokia 3310's?",
            "Gamers rise up!",
            "obviously a fake post, invented story",
            "man i was just watching christian television when god called to me to tell me my son isaac was being corrupted by sin and i must take his things to keep him pure. after thats done im still flipping through my televised church service and god calls to me again he tells me i must lock him in his room so he wont be tainted by the world and after that i get the final message from god and he tells i gotta kill him to prove my faith i go do it and then i realised that crybaby has crawled into the basement i follow him for a while he crys me to death and now im here.",
            "What's sad is I'm genuinely annoyed that people are like this out there.",
            "I found a mobile g*me on my son’s phone, he and his friends have all been punished\n\nMy son (31M) was recently given his own iPhone 11 meant only for contacting me, his mother, and his friends. Today, I found a disgusting g\\*me on his phone called something like “Mindcraft”. \n\nI immediately deleted the app and threw his phone in the trash. I later found remains from a Satanic ritual he performed in his bedroom, and I am certain this “Minekraft” controlled his mind. He was also watching a terrible g\\*ming show on YouTube called “PewDieGuy” which I have now blocked. \n\nHe is no longer able to leave his room, and I’ve contacted all his friends’ parents about this, it seems like this g\\*me is an epidemic. They, too, are all being punished as well. I am very disappointed and I don’t think he will see the light for a long time.",
            "Should've been Fortnite",
            "Ouch my brain cells",
            "Oh fuck my eye started twitching when i read that... fuck",
            "One person posted 10 comments on this thread. Am I the only one questioning that?",
            "Wha-",
            "ban the video games ):( /s",
            "this seems like it was written by a karen that hates minecraft lol",
            "The sad thing is there are probably parents like this.",
            "Weakling.\n\nI would have spanked his ass red after seeing him watching P*wd*ep*e.\n\nMinecraft is fine though",
            "NOT PEWDIEPIE ;(",
            "\"The Count of Monte Cristo\" - Alexandre Dumas",
            "You can't do mindcraft then change it to minekraft to make a shitty mind control joke. \n\nThis attempt at a copypasta will die here. Copypastas are not about just writing whatever ridiculously stupid thing you can think of. It has to come across like something an actual person might say."
        ]
    },
    {
        "post_id": "hw2y89",
        "author": "DifficultHat",
        "title": "“Girlfriend baked all the beans” A deleted post from r/relationshipadvice",
        "url": "https://www.reddit.com/r/copypasta/comments/hw2y89/girlfriend_baked_all_the_beans_a_deleted_post/",
        "score": 10309,
        "num_comments": 292,
        "created_utc": 1595454589.0,
        "selftext": "“My (25M) girlfriend 26F baked all the beans, now I consider to end our relations? What do I do?\n\nHello,\n\nMy girlfriend and me have done dating for 5 month. I thought \"This girl is very good,\" and became of love with her.\n\nYet even so, on this Monday, I comed home and found she as baked all my beans.\n\nYes, all. Oh brother.\n\nIn my cupboard I store several bag of bean, to make soft and to bake on some days, to have a bit of baked bean on my dinner. Or, heck, a lunch too some days.\n\nBut on the Monday I find this girlfriend baked all the beans. I say \"Why do you bake my beans\", and she say something as \"I bakes them good to save time, so I bakes them all now.\"\n\nI am astonished and full of dissmay. I say \"I canfr not eat all the beans\", she say she is froze many of the beans so as we can unfrozen the on a later day and eat some at a time.\n\nBut, if a bean is froze and unfrozed, the very good and very nice flavor of bean is gone far.\n\nA bean is best if baked fresh as a Sunday Pie. Not to be froze and unfroze!\n\nI told my girfriend I am so sad of this, as to my opinion the baking of the beans and to freeze them has ruin all my beans. She say I am \"gone haywire\" by my enragement and sad manners.\n\nBut I hates what she did to my beans.\n\nOn the days before Monday I thought \"Will we marry the girlfriend? Well it might be so.\"\n\nBut now I am so sad she baked them beans. I am consider to end our relations and not be the boyfriend and girlfriend any more. But, is my idea wrong? Could my girlfriend make promise to not bake the beans? I do not know what doing to do and how to feel forgiving on her.”",
        "permalink": "/r/copypasta/comments/hw2y89/girlfriend_baked_all_the_beans_a_deleted_post/",
        "comments": [
            "YTA should’ve put your name on each individual bean otherwise it’s fair game",
            "Red flags everywhere. RUN",
            "But I hates what she did to my beans.",
            "Did anyone make it to the end without crying?",
            "NTA - Your beans your rules.\n\nGet out of this toxic relationship ASAP.",
            "Your beans, your rules",
            "“My (25M) girlfriend 26F baked all the beans, now I consider to end our relations? What do I do?”\n\n“i discovered this in another one of these askreddit posts but honestly its too good not to put here. now without further ado, here it is:\n\nHello,\n\nMy girlfriend and me have done dating for 5 month. I thought \"This girl is very good,\" and became of love with her.\n\nYet even so, on this Monday, I comed home and found she as baked all my beans.\n\nYes, all. Oh brother.\n\nIn my cupboard I store several bag of bean, to make soft and to bake on some days, to have a bit of baked bean on my dinner. Or, heck, a lunch too some days.\n\nBut on the Monday I find this girlfriend baked all the beans. I say \"Why do you bake my beans\", and she say something as \"I bakes them good to save time, so I bakes them all now.\"\n\nI am astonished and full of dissmay. I say \"I canfr not eat all the beans\", she say she is froze many of the beans so as we can unfrozen the on a later day and eat some at a time.\n\nBut, if a bean is froze and unfrozed, the very good and very nice flavor of bean is gone far.\n\nA bean is best if baked fresh as a Sunday Pie. Not to be froze and unfroze!\n\nI told my girfriend I am so sad of this, as to my opinion the baking of the beans and to freeze them has ruin all my beans. She say I am \"gone haywire\" by my enragement and sad manners.\n\nBut I hates what she did to my beans.\n\nOn the days before Monday I thought \"Will we marry the girlfriend? Well it might be so.\"\n\nBut now I am so sad she baked them beans. I am consider to end our relations and not be the boyfriend and girlfriend any more. But, is my idea wrong? Could my girlfriend make promise to not bake the beans? I do not know what doing to do and how to feel forgiving on her.",
            "Read in a Russian accent.",
            "Maybe she wanted to have a cars movie marathon",
            "how the hell do i read this shit? like which accent?",
            "“My (25M) giwwfwiend 26F baked aww the beans, now I considew to end ouw wewations? What do I do?”\n\n“i discovewed this in anothew one of these askweddit posts but honestwy its too good not to put hewe. now without fuwthew ado, hewe it is:\n\nHewwo,\n\nMy giwwfwiend and me have done dating fow 5 month. I thought \"This giww is vewy good,\" and became of wove with hew.\n\nYet even so, on this Monday, I comed home and found she as baked aww my beans.\n\nYes, aww. Oh bwothew.\n\nIn my cupboawd I stowe sevewaw bag of bean, to make soft and to bake on some days, to have a bit of baked bean on my dinnew. Ow, heck, a wunch too some days.\n\nBut on the Monday I find this giwwfwiend baked aww the beans. I say \"Why do you bake my beans\", and she say something as \"I bakes them good to save time, so I bakes them aww now.\"\n\nI am astonished and fuww of dissmay. I say \"I canfw not eat aww the beans\", she say she is fwoze many of the beans so as we can unfwozen the on a watew day and eat some at a time.\n\nBut, if a bean is fwoze and unfwozed, the vewy good and vewy nice fwavow of bean is gone faw.\n\nA bean is best if baked fwesh as a Sunday Pie. Not to be fwoze and unfwoze!\n\nI towd my giwfwiend I am so sad of this, as to my opinion the baking of the beans and to fweeze them has wuin aww my beans. She say I am \"gone haywiwe\" by my enwagement and sad mannews.\n\nBut I hates what she did to my beans.\n\nOn the days befowe Monday I thought \"Wiww we mawwy the giwwfwiend? Weww it might be so.\"\n\nBut now I am so sad she baked them beans. I am considew to end ouw wewations and not be the boyfwiend and giwwfwiend any mowe. But, is my idea wwong? Couwd my giwwfwiend make pwomise to not bake the beans? I do not know what doing to do and how to feew fowgiving on hew.",
            "Reminds me the one story about the guy who had to bury his beans from his girlfriend\n\nFound think link:\n\n\nhttps://www.reddit.com/r/tifu/comments/fy06bv/tifu_by_demanding_that_my_girlfriend_show_me/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "LMFAO HALF THE COMMENTS ARE ALL \"your beans your rules\"\n\ni love this subreddits community",
            "Looks like you dropped this 🚩🚩🚩🚩🚩",
            "apolgy for bad english\n\nwhere were u wen all bean bake?\n\ni was at house eating dorito when phone ring\n\n\"grill friend bake all bean then froze\"\n\n\"no\"",
            "NTA play stupid games, win stupid prizes",
            "Bean",
            "NTA. Buy stupid beans, win stupid prizes.",
            "NTA. Your beans, your rules.",
            "I'd say you leave he and your family and escape the country. Your beans come first",
            "Didnt know Frank Bowers use Reddit too.",
            "Could you imagine if this bean guy met the girl who buried the beans in the backyard? \n\nNational disaster.",
            "[deleted]",
            "Wow that’s super disrespectful of your boundaries that she decided to bake all of your bean. Definitely need to break it off before anymore of your bean gets baked without your knowledge.\n/s",
            "&nbsp;\n\n&nbsp;",
            "Reminds me of the girl who baked all her boyfriends beans 😬",
            "Yep your girlfriend sounds like a narcissist and there are red flags everwhere. I diagnose you both with every mental illness there is and also NTA. Your house your rules",
            "Kudos to anyone who was able to read past line 6, I gave up",
            "She should have bean more respectful",
            "> thought \"This girl is very good,\" and became of love with her.",
            "\"Yes, all. Oh brother\"\n\nI have no idea if I should have related, and yet, here I am. Relating. Oh brother.",
            "*she baked the beans*",
            "Your beans your rules",
            "Oh brother.",
            "NTA, No one comes between a man and his beans.",
            "!emojify",
            "Jesus Christ, did Gollum write this?",
            "Dang it, i was gonna repost this to copypasta but I forgot to do it. You win.",
            "Ah, I didn't see you already posted this. I'll just delete mine",
            "NTA buy a new batch of beans and bake them and pour them on her in the middle of the night while she's sleeping and yell \"MY BEANS MY RULES\" then kick her out. Before she leaves, tell her \"I knew our relationship was half baked, we've bean going downhill for awhile now\" then slam the door in her face.",
            "YTA both partners in any healthy relationship should both have access to beans. If your gf wishes to bake them that is her choice! Although I know nothing about you from this short story I can determine that you are a TOXIC person! 👋",
            "There’s no way that’s unironic... right?",
            "How old is this dam I’m old",
            "How do I copy this",
            "Tus frijoles, tus reglas",
            "I just downvoted your post.\n\n# FAQ\n\n# What does this mean?\n\nThe amount of karma (points) on your comment and Reddit account has decreased by one.\n\n# Why did you do this?\n\nThere are several reasons I may deem a comment to be unworthy of positive or neutral karma. These include, but are not limited to:\n\n* Rudeness towards other Redditors,\n* Spreading incorrect information,\n* Sarcasm not correctly flagged with a /s.\n\n# Am I banned from the Reddit?\n\nNo - not yet. But you should refrain from making comments like this in the future. Otherwise, I will be forced to issue an additional downvote, which may put your commenting and posting privileges in jeopardy.\n\n# I don't believe my comment deserved a downvote. Can you un-downvote it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I undo a downvote. If you would like to issue an appeal, shoot me a private message explaining what I got wrong. I tend to respond to Reddit PMs within several minutes. Do note, however, that over 99.9% of downvote appeals are rejected, and yours is likely no exception.\n\n# How can I prevent this from happening in the future?\n\nAccept the downvote and move on. But learn from this mistake: your behavior will not be tolerated on Reddit.com. I will continue to issue downvotes until you improve your conduct. Remember: Reddit is a privilege, not a right.",
            "Eat all me beans Ginger?",
            "I can only read this in BMO's voice",
            "NTA - your beans, your rules",
            "NTA. your girlfriend doesn’t deserve to be with a chad like you any longer. how dare she bake your beans..",
            "Are you dating my Ex?",
            "Isn't this like 2 years old?",
            "*read this post with thick Russian accent*",
            "Link to the post?",
            "But I hates what she did to my beans",
            "Walahi brother I stg to God that I thought she was the one, but u can't trust no المرأة with your فاصوليا ♥️🗡️😔⚰️",
            "thinkin bout thos; beans",
            "The fuck did I just read",
            "It's true though, freezing is such bullshit, stuff should be cooked fresh.",
            "Im shaking n crying rn his girlfriend would never bake all the beans",
            "! translatify",
            "!translatify",
            "NTA",
            "not the asshole",
            "4 / 5 poppy buttholes for girlfriend, 0 / 5 poppy buttholes for OP\nSue for baking bean!",
            "INFO - Type of beans?",
            "NTA your girlfriend, your rules",
            "NTA Your beans your rules",
            "You need to read this with the iDubbz retarded Italian voice. Hilarious.",
            "Imagine if you had children together and one day she decided to bake them all to save time",
            "NTA, your beans, your rules",
            "Damn lmao posted this like 2 seconds before seeing this post kms",
            "I could only hear Borat’s voice as I read that story.",
            "This has got undatable vibes",
            "Why is Gollum on Reddit",
            "🚩🚩🚩🚩🚩🚩🚩",
            "just slap that bitch with the frozen beans smh my head",
            "I hope this is satire",
            "The OP speaks like Gollum",
            "Oh Jack. I'm so sorry.",
            "sue her, you'll win all the beans back",
            "Read this in Gollum's voice. Makes it better.",
            "Roll that beautiful bean footage",
            "Is there a beans witness protection program? I'm no longer sure of their safety!",
            "End the relationship",
            "I think you should forgive her but maybe even the score. Eat all her makeup",
            "Lawyer up. Don’t do anything without consulting a lawyer. Get full custody of the beans.",
            "Listen to me. I was sexually assaulted by my dog when I was a fetus so I now the signs. This. IS. GaSLIghtIng.\n\nRun as fast as you can and please make sure you get a friend to get your stuff, your in danger",
            "NTA",
            "I read that in Fez's voice",
            "YTA. You should feed your dog so it doesn't feed itself.",
            "[someone took it seriously, I love humanity](https://www.reddit.com/r/relationship_advice/comments/a5dga8/my_25_m_girlfriend_26_f_baked_all_the_beans_now_i/eblv0xv/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "what",
            "One of the best pastas I’ve ever read",
            "!emojify",
            "[https://youtu.be/Zcxckb876cU](https://youtu.be/Zcxckb876cU)\n\n&#x200B;\n\nI may or may not have voice acted over this as an anime girl.",
            "This reads like an alien trying to speak like a human.",
            "nice.",
            "LEAVE HER!!\nthis happened to me and i didnt leave him then trust me",
            "My friends brother took his mic and read me this. I told him to get a better girlfriend.",
            "Play stupid games, win stupider prizes, NTA, major red flags!",
            "[deleted]",
            "“My (25M) girlfriend 💏 26F baked 🥖 all 🙌 the beans 🍭, now I 👁 consider ☺ to end 🔚 our relations 💏? What do I 👁 do?” \n\n“i discovered 🔎🧐 this in another 🏊 one ☝ of these askreddit posts ✉ but 😳 honestly 💯 its too good 👌 not to put 👏 here. now without 🚫 further ado, here it is: \n\nHello 👋, \n\nMy girlfriend 👫 and me have done ✅ dating 💏 for 5 5️⃣ month 🗓. I 👁 thought 🤔 \"This girl 👧 is very 💯 good 👌,\" and became 🧚🏼‍♂️ of love ❤ with her 👩. \n\nYet 🎩👓👍 even 💅 so, on this Monday 📷, I 👁 comed home 🏡 and found 🔎 she 👩 as baked 🥖 all 🙌 my beans 😋. \n\nYes 👍, all 🙌. Oh 🥴 brother 👨🏾. \n\nIn my cupboard I 👁 store 🏬 several ♀♂🚁 bag 😎 of bean 🥒, to make 🛠 soft 😩🙈 and to bake 🥖 on some days 📆, to have a bit 😁 of baked 🥖 bean 👀 on my dinner 🍣. Or, heck 👏, a lunch 🥡 too some days 📅. \n\nBut 🍑 on the Monday ⏭ I 👁 find 🔍 this girlfriend 💏 baked 🥖 all 👩‍👩‍👧‍👧 the beans 🍭. I ☝ say 🗣 \"Why ❓ do you 👆 bake 🍞 my beans 🥫\", and she 👩 say 🗣 something 🙅‍♀️ as \"I ☝ bakes ✨💞🧚 them good 😀 to save 🆘 time ⏰, so I ☝ bakes ✨💞🧚 them all 🤠 now.\" \n\nI 👁 am astonished 😲 and full 🌝 of dissmay. I ☝ say 🗣 \"I ☝ canfr not eat 🍽 all 🙅‍♂️💪 the beans 🥫\", she 👩🏽 say 🗣 she 👩🏽 is froze ❄ many 💯 of the beans 🥫 so as we can unfrozen the on a later ⌚⏱⏳ day 📆 and eat 🍴 some at a time ⏰. \n\nBut 🍑, if a bean 😋 is froze ❄ and unfrozed, the very 💯 good 👌 and very 💯 nice 😊 flavor 😛 of bean 🥫 is gone ❔ far 🌌. \n\nA bean 🥫 is best 🏆 if baked 🥖 fresh 💯 as a Sunday ☀ Pie ‼. Not to be froze 🥶 and unfroze! \n\nI 👁 told 🗣 my girfriend I 👁 am so sad 😭 of this, as to my opinion 💭 the baking 🥖 of the beans 😋 and to freeze ❄😱 them has ruin 🤬 all 👳🏾‍♂️👊🏿👀 my beans 🥫. She 👩 say 🗣 I 👁 am \"gone ❔ haywire\" by my enragement and sad 😭 manners. \n\nBut 😳 I 👁 hates 🤬 what she 👩 did to my beans 🍭. \n\nOn the days 🕢 before ⬅ Monday 📆😀 I ☝ thought 🤔 \"Will we marry 💍 the girlfriend 👫? Well 🖕🖕🏻🖕🏿 it might 🔍 be so.\" \n\nBut 🍑 now I ☝ am so sad 😭 she 👩🏽 baked 🥖 them beans 😋. I 👁 am consider 🤔 to end 🔚 our relations 💓💋 and not be the boyfriend 👬 and girlfriend 💏 any more. But 😳, is my idea 💡 wrong ❌? Could my girlfriend 💏 make 🔨 promise 🙏 to not bake 🥖 the beans 🍭? I 👁 do not know 🤔 what doing to do and how to feel 🤚 forgiving on her 🕰👧. \n\n^(To Emojify 😃: [message ✉ me](https://www.reddit.com/message/compose/?to=Emojify_Creator) \\| comment 💬 \"!emojify\" \\| comment 🗣️ )^([u\\/Emojify_Creator](/user/Emojify_Creator))",
            "Dumb fucking retarded bitch",
            "Niger",
            "Yes, all. Oh brother"
        ]
    },
    {
        "post_id": "jqckpu",
        "author": "saddamfuki",
        "title": "First post I saw after visiting 4chan for the first time",
        "url": "https://www.reddit.com/r/copypasta/comments/jqckpu/first_post_i_saw_after_visiting_4chan_for_the/",
        "score": 10286,
        "num_comments": 773,
        "created_utc": 1604845669.0,
        "selftext": " I FUCKING HATE LEFTISTS, THEY ARE DISGUSTING AND CALLING THEM PIECES OF SHIT WOULD BE INSENSITIVE TO SHIT. I FUCKING HATE THEM, EVER SINCE THEY CAME OUT OF THERE MOTHER'S ASSHOLE AND STAINED THIS ONCE SOMEWHAT PURE WORLD, GROWING UP TO BE A FUCKING FREAK WHO KILLS PEOPLE AND RAPES BABIES (I KNOW WHAT YOU FUCKERS DO, DON'T EVEN LIE TO ME CUNTS). THIS ISN'T EVEN ABOUT THE ELECTION, THIS ISN'T EVEN ABOUT POLITICS, THEY ARE GENUINELY BAD PEOPLE, BUT iT's OkAy If ThEy Go ArOuNd DeStRoYiNg EvErYtHiNg ThEy HaVe #BLM In ThEiR tWiTtEr BiO. I HAAATTTEEEEEE THEEEEEMMMMMM!!!!!!! I HOPE SOMEONE PISSES AND SHITS AND PUKES AND SHITS DIRTY DIARHEA ON THEIR HAND AND RAMS INTO THEIR EYEBALLS AND SPLITS THEIR PUPILS INTO TWO, AND THEN THEY KICK THEM TO SHIT AND CRACK THEIR SPINE IN HALF, AND THEN SNAP THEIR DICK INTO TWO AND THEN SHOVE IT DOWN THEIR EAR HOLES, AND THEY BURN THEM WITH CIGARETTES AND CUT THEM WITH KNIVES, DIRTY, RUSTY, SHARP KNIVES AFTER SHOVING THEM UP THEIR ASSHOLE, AND THEN THEY DROWN THEM IN A SOAPY POOL AND UNTIL THEY ALMOST DIE AND THEN FINALLY SLOWLY GRIND THEM UP IN A WOODCHIPPER WITH THE BLADES CLAWWWING THEIR SKIN OFF AND THAT SHIT GETS THROWN AT ANOTHER LEFTIST, WHICH WOULD BE THEY ONLY GOOD THING COMING OUT OF THESE \"RIGHTEOUS\" FUCKS. YOU KNOW WHAT THE FUCKING PROBLEM IS, GOVERNMENT, THAT'S WHAT THE FUCKING PROBLEM IS, BUT NO NO NO LET'S GIVE THE GOVERNMENT MOOOOORRRRREEEEE POOOOOOWWWWWEEEEEERRRRR (FOLLOWED BY EVIL LAUGHTER). THANKS GUYS, THANKS FOR FIGHTING ON BEHALF OF THE NEW WORLD FUCKING ORDER, THANKS FOR SUPPRESSING OUR FREEDOMS, THANKS FOR RUINING THIS COUNTRY, THANKS FOR LETTING IN LOADS OF IMMIGRANTS, THANK YOU FOR B̶u̶l̶l̶y̶i̶n̶g̶ CANCELLING I̶n̶n̶o̶c̶e̶n̶t̶ EVIL PEOPLE ON TWITTER, THANKS FOR EVERYTHING YOU FUCKS. NOW GO KILL YOURSELF, GO PUT YOUR HEAD IN A NECKROPE AND SUFFOCATE YOURSELF UNTIL YOU DIE, YOU CESSPIT OF A PERSON.",
        "permalink": "/r/copypasta/comments/jqckpu/first_post_i_saw_after_visiting_4chan_for_the/",
        "comments": [
            "I hate the left He left the chair to remove the dust and then read the chair. I hated them, they poured out the madness of mothers in the world of self-loathing until they turned into savages who killed these abusers and raped children. (I know what I do.) I know not to lie (crime). They are very bad But if they leave, they will not be able to do #BLM in their lives. Hayat Theiemmm !!!!!!! When a man enters the muddy newspaper, divides the boy into two and divides the grass in the middle of the garage, the ram closes his eyes and removes and continues to move the tree. Place a cave on a cigarette, cut with a knife, dip in soapy water with a clay-soaked knife, and gently massage almost everything. The skin then removes the dust with the other left hand You know where the problem is, the government of the problem. But don’t leave the government MOOOOORORRREEEEE POOOOOOWWWEEEEERRRR. Thank you all, thank you for fighting in the new world. Thank you for promoting our freedom. Thank you for destroying this country Thank you for sending this to Gotoka IDP. Now he has committed suicide, he is dead.",
            "The first thing i saw while visiting 4chan is a loli hentai ad",
            "I 👁 FUCKING 🍆🍑 HATE 😡 LEFTISTS 🤣🤫😂, THEY ARE DISGUSTING 😷🤒 AND CALLING 📞 THEM PIECES 💩 OF SHIT 💩 WOULD BE INSENSITIVE 😵😥 TO SHIT 💩. I 👁 FUCKING 🚫🖕 HATE 😡😤🙅 THEM, EVER 😠 SINCE 💦 THEY CAME 💦 OUT OF THERE MOTHER'S 👵 ASSHOLE 💦🍑😍 AND STAINED 💩💦 THIS ONCE SOMEWHAT 💩 PURE 😩 WORLD 🌎, GROWING 🌱 UP ⬆ TO BE A FUCKING 🖕👦 FREAK 😂😜😝 WHO KILLS 🔪💣☠ PEOPLE 👫 AND RAPES 😲 BABIES 👶 (I 👁 KNOW 🤔 WHAT YOU 👈🍆 FUCKERS 🖕 DO, DON'T ❌ EVEN 🌃 LIE 😡🤥😰 TO ME CUNTS 🍑). THIS ISN'T EVEN 🌝 ABOUT 💦 THE ELECTION 🇺🇸, THIS ISN'T EVEN 🌃 ABOUT 💦 POLITICS 🏛, THEY ARE GENUINELY 👌 BAD 👎 PEOPLE 👨, BUT 🍑🇮🇹 iT's OkAy 👌 If ThEy Go 🏃 ArOuNd 🧱🎶🎵 DeStRoYiNg 💥 EvErYtHiNg 😂🤣 ThEy HaVe #BLM ✊🏿 In ThEiR tWiTtEr 🐦 BiO 🖥📄. I 👁 HAAATTTEEEEEE THEEEEEMMMMMM!!!!!!! I ✊👁 HOPE 🙏 SOMEONE 👤 PISSES 🍆💦 AND SHITS 💩 AND PUKES ☹😞 AND SHITS 💩 DIRTY 💩 DIARHEA ON 🔛 THEIR HAND ✋ AND RAMS 👋 INTO THEIR EYEBALLS 🙈🤠 AND SPLITS 🚻 THEIR PUPILS 👨🏻‍🎓 INTO TWO ✌, AND THEN THEY KICK 👟 THEM TO SHIT 💩 AND CRACK 💉 THEIR SPINE 😂 IN HALF 💀, AND THEN SNAP 📲 THEIR DICK 🍆👅 INTO TWO 💏 AND THEN SHOVE ✊🍭 IT DOWN ⬇😰 THEIR EAR 👂 HOLES 🕳⛳, AND THEY BURN 🔥😩 THEM WITH CIGARETTES 🚬 AND CUT ✂ THEM WITH KNIVES 🔪, DIRTY 😷, RUSTY 🤫, SHARP 🔪 KNIVES 🔪 AFTER 👀 SHOVING ❄ THEM UP ☝ THEIR ASSHOLE 🍑, AND THEN THEY DROWN 😱🌊 THEM IN A SOAPY 🧼 POOL 🎱 AND UNTIL THEY ALMOST 💸 DIE ☠ AND THEN FINALLY 🙏 SLOWLY 🐌 GRIND 😫 THEM UP ☝ IN A WOODCHIPPER WITH THE BLADES 🗡 CLAWWWING THEIR SKIN 👨 OFF 💦😝😂 AND THAT SHIT 💩🙊🙈 GETS 🔟 THROWN 🚮 AT ANOTHER 2️⃣ LEFTIST 😱😅😈, WHICH WOULD BE THEY ONLY GOOD 🤤💦👌🏻 THING 📴 COMING 💦 OUT OF THESE \"RIGHTEOUS 😇\" FUCKS 👉👌. YOU 👈🏼 KNOW 🤔 WHAT THE FUCKING 🍆 PROBLEM ⚠ IS, GOVERNMENT 😓🙄, THAT'S ✔ WHAT THE FUCKING 🍆 PROBLEM 😊 IS, BUT 🍑 NO 🙅 NO 🚫😭🎉 NO 😣 LET'S 🙆 GIVE 👉 THE GOVERNMENT 😓🙄 MOOOOORRRRREEEEE POOOOOOWWWWWEEEEEERRRRR (FOLLOWED 😣 BY EVIL 😈 LAUGHTER 😂). THANKS 🙏 GUYS 👦, THANKS 🙏 FOR FIGHTING 👊😤 ON 🔛 BEHALF 😬 OF THE NEW 🆕 WORLD 🌎 FUCKING 🍆💦 ORDER 📑🤜, THANKS 🙏😔 FOR SUPPRESSING OUR FREEDOMS 🙌, THANKS 🙏 FOR RUINING 💣🧨 THIS COUNTRY 🇺🇸🏞🌎, THANKS 🙏 FOR LETTING 🇮🇹 IN LOADS 💦😤 OF IMMIGRANTS 🚢👨‍👩‍👧‍👧, THANK 🙏 YOU 👈🏻 FOR B̶u̶l̶l̶y̶i̶n̶g̶ CANCELLING ‼🚫 I̶n̶n̶o̶c̶e̶n̶t̶ EVIL 😈 PEOPLE 👩‍🍳👨🏽‍🔧💃 ON 🔛 TWITTER 🍆, THANKS 🙏🏽 FOR EVERYTHING 💯 YOU 👉 FUCKS 👉👌. NOW GO 🏃 KILL 🔪 YOURSELF, GO 👉 PUT 😏 YOUR 👉 HEAD 💆 IN A NECKROPE AND SUFFOCATE 😵😨 YOURSELF UNTIL YOU 👈 DIE 💀, YOU 👉 CESSPIT OF A PERSON 👫.",
            "Fake, not enough n words",
            "Where’s cummy? :(",
            " I FUCKING HATE WEFTISTS, THEY AWE DISGUSTING AND CAWWING THEM PIECES OF SHIT WOUWD BE INSENSITIVE TO SHIT. I FUCKING HATE THEM, EVEW SINCE THEY CAME OUT OF THEWE MOTHEW'S ASSHOWE AND STAINED THIS ONCE SOMEWHAT PUWE WOWWD, GWOWING UP TO BE A FUCKING FWEAK WHO KIWWS PEOPWE AND WAPES BABIES (I KNOW WHAT YOU FUCKEWS DO, DON'T EVEN WIE TO ME CUNTS). THIS ISN'T EVEN ABOUT THE EWECTION, THIS ISN'T EVEN ABOUT POWITICS, THEY AWE GENUINEWY BAD PEOPWE, BUT iT's OkAy If ThEy Go AwOuNd DeStWoYiNg EvEwYtHiNg ThEy HaVe #BWM In ThEiW tWiTtEw BiO. I HAAATTTEEEEEE THEEEEEMMMMMM!!!!!!! I HOPE SOMEONE PISSES AND SHITS AND PUKES AND SHITS DIWTY DIAWHEA ON THEIW HAND AND WAMS INTO THEIW EYEBAWWS AND SPWITS THEIW PUPIWS INTO TWO, AND THEN THEY KICK THEM TO SHIT AND CWACK THEIW SPINE IN HAWF, AND THEN SNAP THEIW DICK INTO TWO AND THEN SHOVE IT DOWN THEIW EAW HOWES, AND THEY BUWN THEM WITH CIGAWETTES AND CUT THEM WITH KNIVES, DIWTY, WUSTY, SHAWP KNIVES AFTEW SHOVING THEM UP THEIW ASSHOWE, AND THEN THEY DWOWN THEM IN A SOAPY POOW AND UNTIW THEY AWMOST DIE AND THEN FINAWWY SWOWWY GWIND THEM UP IN A WOODCHIPPEW WITH THE BWADES CWAWWWING THEIW SKIN OFF AND THAT SHIT GETS THWOWN AT ANOTHEW WEFTIST, WHICH WOUWD BE THEY ONWY GOOD THING COMING OUT OF THESE \"WIGHTEOUS\" FUCKS. YOU KNOW WHAT THE FUCKING PWOBWEM IS, GOVEWNMENT, THAT'S WHAT THE FUCKING PWOBWEM IS, BUT NO NO NO WET'S GIVE THE GOVEWNMENT MOOOOOWWWWWEEEEE POOOOOOWWWWWEEEEEEWWWWW (FOWWOWED BY EVIW WAUGHTEW). THANKS GUYS, THANKS FOW FIGHTING ON BEHAWF OF THE NEW WOWWD FUCKING OWDEW, THANKS FOW SUPPWESSING OUW FWEEDOMS, THANKS FOW WUINING THIS COUNTWY, THANKS FOW WETTING IN WOADS OF IMMIGWANTS, THANK YOU FOW B̶u̶w̶w̶y̶i̶n̶g̶ CANCEWWING I̶n̶n̶o̶c̶e̶n̶t̶ EVIW PEOPWE ON TWITTEW, THANKS FOW EVEWYTHING YOU FUCKS. NOW GO KIWW YOUWSEWF, GO PUT YOUW HEAD IN A NECKWOPE AND SUFFOCATE YOUWSEWF UNTIW YOU DIE, YOU CESSPIT OF A PEWSON.",
            "Pickle Rick with a horse dick",
            "remember the rule: new users must lurk for six months",
            "I wonder what caused his hate for leftists",
            "This just sounds like a REEEEEEEEEEEEEEEE copypasta.",
            "So eloquently written",
            "It's funny but also scary how some people genuinely feel like this",
            ">Mfw",
            "I sometimes think 4chan would turn into a ghost town if we started opening up more mental health facilities.",
            "[deleted]",
            "[deleted]",
            "this is the site in a nutshell nowadays",
            "I would think this is satire but you can never be too sure if it’s from 4chan",
            "Where us u/sentientsemen ?",
            "\"This isnt even about the election\"\n\nSure buddy whatever lets you sleep at night 👉👉",
            " I FUCKING HATE LEFTISTS, THEY ARE DISGUSTING AND CALLING THEM PIECES OF SHIT WOULD BE INSENSITIVE TO SHIT. I FUCKING HATE THEM, EVER SINCE THEY CAME OUT OF THERE MOTHER'S ASSHOLE AND STAINED THIS ONCE SOMEWHAT PURE WORLD, GROWING UP TO BE A FUCKING FREAK WHO KILLS PEOPLE AND RAPES BABIES (I KNOW WHAT YOU FUCKERS DO, DON'T EVEN LIE TO ME CUNTS). THIS ISN'T EVEN ABOUT THE ELECTION, THIS ISN'T EVEN ABOUT POLITICS, THEY ARE GENUINELY BAD PEOPLE, BUT iT's OkAy If ThEy Go ArOuNd DeStRoYiNg EvErYtHiNg ThEy HaVe #BLM In ThEiR tWiTtEr BiO. I HAAATTTEEEEEE THEEEEEMMMMMM!!!!!!! I HOPE SOMEONE PISSES AND SHITS AND PUKES AND SHITS DIRTY DIARHEA ON THEIR HAND AND RAMS INTO THEIR EYEBALLS AND SPLITS THEIR PUPILS INTO TWO, AND THEN THEY KICK THEM TO SHIT AND CRACK THEIR SPINE IN HALF, AND THEN SNAP THEIR DICK INTO TWO AND THEN SHOVE IT DOWN THEIR EAR HOLES, AND THEY BURN THEM WITH CIGARETTES AND CUT THEM WITH KNIVES, DIRTY, RUSTY, SHARP KNIVES AFTER SHOVING THEM UP THEIR ASSHOLE, AND THEN THEY DROWN THEM IN A SOAPY POOL AND UNTIL THEY ALMOST DIE AND THEN FINALLY SLOWLY GRIND THEM UP IN A WOODCHIPPER WITH THE BLADES CLAWWWING THEIR SKIN OFF AND THAT SHIT GETS THROWN AT ANOTHER LEFTIST, WHICH WOULD BE THEY ONLY GOOD THING COMING OUT OF THESE \"RIGHTEOUS\" FUCKS. YOU KNOW WHAT THE FUCKING PROBLEM IS, GOVERNMENT, THAT'S WHAT THE FUCKING PROBLEM IS, BUT NO NO NO LET'S GIVE THE GOVERNMENT MOOOOORRRRREEEEE POOOOOOWWWWWEEEEEERRRRR (FOLLOWED BY EVIL LAUGHTER). THANKS GUYS, THANKS FOR FIGHTING ON BEHALF OF THE NEW WORLD FUCKING ORDER, THANKS FOR SUPPRESSING OUR FREEDOMS, THANKS FOR RUINING THIS COUNTRY, THANKS FOR LETTING IN LOADS OF IMMIGRANTS, THANK YOU FOR B̶u̶l̶l̶y̶i̶n̶g̶ CANCELLING I̶n̶n̶o̶c̶e̶n̶t̶ EVIL PEOPLE ON TWITTER, THANKS FOR EVERYTHING YOU FUCKS. NOW GO KILL YOURSELF, GO PUT YOUR HEAD IN A NECKROPE AND SUFFOCATE YOURSELF UNTIL YOU DIE, YOU CESSPIT OF A PERSON. lol",
            "Typical 15 years 4chan user",
            "/uj 4chan would be a genuinely hilarious place if it wasn't extremely conducive to bigotry.\n\n/rj fuck libby leftards 😠😠😠",
            "Tis a silly place",
            "\"EVER SINCE THEY CAME OUT OF THERE MOTHER'S ASSHOLE\" bro I don't think that's how biology works",
            "believe it or not the was defe *not* the worst post on there. the worst thread was probably a tie between the furry loli porn thread or the thread where one guy replies to literally every single post with the n word",
            "This new world order sounds scary. Someone should do something about that.",
            "ngl 4chan culture is literally just counter-culture, a decade or two ago those guys were leaning left to counter mainstream conservatism and now that the left is mainstream, those guys started to lean more to the right to mess with them.",
            "Hey guys I'm not really sure but I think that anon might be a little upset because WE FUCKING WIN BABY",
            "Looks like someone needs a snickers",
            "Liberals owned",
            "why you hating on left handed people, we’re not so bad",
            "fake, not enough slurs",
            "Average r/averageredditor user",
            "This reads like a rap, at least the beginning of it",
            "Ugh, political stuff?? Booooring! I just want some fresh memes",
            "Racism Be Like:",
            "It's like an AVGN script",
            "I can guarantee OP went onto /b/ or /pol/ and clicked on one thread \n\n&#x200B;\n\nseriously, though, if you actually want to exist on 4chan without being a basement dwelling cro-magnon then just go to a non NSFW board like /c/ or /p/ which is basically tame tbh",
            "Someone’s triggered",
            "First Post i saw from 4chan was loli porn. You got off pretty good",
            "and we're the snowflakes having meltdowns??",
            "Biggest cope I’ve ever read lmaoo I don’t think I’ve laughed this hard in ages.",
            "guys 😳 i think this 4chan guy doesn't like leftist",
            "What board was this on? Damn",
            "Link?",
            "There are so many anatomical errors in this",
            "I went onto 4chan after hearing a bunch of outlandish stories from /b/ and was horribly disappointed when it was just porn. /x/ is still kinda interesting tho",
            "Yeah well that’s just 4chan innit",
            "First post I saw after visiting 4chan for the first time\n\n I FUCKING HATE LEFTISTS, THEY ARE DISGUSTING AND CALLING THEM PIECES OF SHIT WOULD BE INSENSITIVE TO SHIT. I FUCKING HATE THEM, EVER SINCE THEY CAME OUT OF THERE MOTHER'S ASSHOLE AND STAINED THIS ONCE SOMEWHAT PURE WORLD, GROWING UP TO BE A FUCKING FREAK WHO KILLS PEOPLE AND RAPES BABIES (I KNOW WHAT YOU FUCKERS DO, DON'T EVEN LIE TO ME CUNTS). THIS ISN'T EVEN ABOUT THE ELECTION, THIS ISN'T EVEN ABOUT POLITICS, THEY ARE GENUINELY BAD PEOPLE, BUT iT's OkAy If ThEy Go ArOuNd DeStRoYiNg EvErYtHiNg ThEy HaVe #BLM In ThEiR tWiTtEr BiO. I HAAATTTEEEEEE THEEEEEMMMMMM!!!!!!! I HOPE SOMEONE PISSES AND SHITS AND PUKES AND SHITS DIRTY DIARHEA ON THEIR HAND AND RAMS INTO THEIR EYEBALLS AND SPLITS THEIR PUPILS INTO TWO, AND THEN THEY KICK THEM TO SHIT AND CRACK THEIR SPINE IN HALF, AND THEN SNAP THEIR DICK INTO TWO AND THEN SHOVE IT DOWN THEIR EAR HOLES, AND THEY BURN THEM WITH CIGARETTES AND CUT THEM WITH KNIVES, DIRTY, RUSTY, SHARP KNIVES AFTER SHOVING THEM UP THEIR ASSHOLE, AND THEN THEY DROWN THEM IN A SOAPY POOL AND UNTIL THEY ALMOST DIE AND THEN FINALLY SLOWLY GRIND THEM UP IN A WOODCHIPPER WITH THE BLADES CLAWWWING THEIR SKIN OFF AND THAT SHIT GETS THROWN AT ANOTHER LEFTIST, WHICH WOULD BE THEY ONLY GOOD THING COMING OUT OF THESE \"RIGHTEOUS\" FUCKS. YOU KNOW WHAT THE FUCKING PROBLEM IS, GOVERNMENT, THAT'S WHAT THE FUCKING PROBLEM IS, BUT NO NO NO LET'S GIVE THE GOVERNMENT MOOOOORRRRREEEEE POOOOOOWWWWWEEEEEERRRRR (FOLLOWED BY EVIL LAUGHTER). THANKS GUYS, THANKS FOR FIGHTING ON BEHALF OF THE NEW WORLD FUCKING ORDER, THANKS FOR SUPPRESSING OUR FREEDOMS, THANKS FOR RUINING THIS COUNTRY, THANKS FOR LETTING IN LOADS OF IMMIGRANTS, THANK YOU FOR B̶u̶l̶l̶y̶i̶n̶g̶ CANCELLING I̶n̶n̶o̶c̶e̶n̶t̶ EVIL PEOPLE ON TWITTER, THANKS FOR EVERYTHING YOU FUCKS. NOW GO KILL YOURSELF, GO PUT YOUR HEAD IN A NECKROPE AND SUFFOCATE YOURSELF UNTIL YOU DIE, YOU CESSPIT OF A PERSON.",
            "/pol",
            "If this is from /pol/ or /b/ chances are it isn't ironic.",
            "It feels like I’m 12 all over again 😎😎",
            "This is the salt i needed. Thanks!",
            "Yeah, totally not about politics or the election.",
            "I began reading this and out of nowhere this sound ([https://www.youtube.com/watch?v=qTksCYUgI7s](https://www.youtube.com/watch?v=qTksCYUgI7s)) just started blaring in my ears... what a strange, strange phenomena.",
            "[removed]",
            "Lmao cope",
            "I love 4chan tbh",
            "Fellow /b/, the FBI may be on our side, they have a tab dedicated to election fraud, use all your archived evidence, and compile your own evidence and send it to FBI.gov, if another shitlip libtard says cope, they'll need therapy to cope with what'll happen to the country if Biden gets inaugurated.",
            "Oh 4Chan... Never change",
            "Based",
            "Based",
            "[deleted]",
            "Based.",
            "Tbf both leftists and right-wingers are a group of people that think their point of view is better than everyone else's so I hate them both",
            "based",
            "wtf he's right tho",
            "True",
            "Cock based",
            "Okay, but the left is terrible."
        ]
    },
    {
        "post_id": "ifibey",
        "author": "GayBrownHairedElf",
        "title": "I busted a nut to Clash Royale Valkarie.",
        "url": "https://www.reddit.com/r/copypasta/comments/ifibey/i_busted_a_nut_to_clash_royale_valkarie/",
        "score": 10276,
        "num_comments": 152,
        "created_utc": 1598243225.0,
        "selftext": "It was a nice hot night in August (9 months), my younger cousin (5) loves Clash Royale and forced me (16) to play Clash Royale. He (5) was a noob at the game and was only in Bone Pit (2ndnarena) so I (16) helped him out a bit and brought him to Barbarian Bowl (3rd arena) I was destroying all these other kids (4-6) and my cousin (5) was getting hungry. While my cousin (5) went to get food, I (16) started to feel a bit special. I loved how Valarie's boots klicked. I luved the sound she makes when destroying the enemies (5) skeleton army and she's so so *furiously fapping* so fuxking hot I'm writing this with my off hand, and I just nutted all over my svreen duck@!!",
        "permalink": "/r/copypasta/comments/ifibey/i_busted_a_nut_to_clash_royale_valkarie/",
        "comments": [
            "Google transulated version: On his way he searched for the meat of the chariots that had broken the King Velc.\n\nAugust is hot on a hot night (9 months). My cousin (girl / boy) liked the original shot, but when he was accused he was forced to play Kalashnikov. Unbeknownst to her (5) the game would help her, she asked Pete (2g) to be born (16), to take her back to her country (Vina 3). All (4-6) and one (5) brother are present. When my brother wanted food (5), I heard (16). I saw Valerie for a moment. I heard the enemy (5) break bones as a lover's weapon. The heat in the gold bag is in my hand and I am.",
            "It was a nice hot night in August (9 months), my younger cousin (5) loves Clash Royale and forced me (16) to play Clash Royale. He (5) was a noob at the game and was only in Bone Pit (2ndnarena) so I (16) helped him out a bit and brought him to Barbarian Bowl (3rd arena) I was destroying all these other kids (4-6) and my cousin (5) was getting hungry. While my cousin (5) went to get food, I (16) started to feel a bit special. I loved how Valarie's boots klicked. I luved the sound she makes when destroying the enemies (5) skeleton army and she's so so *furiously fapping* so fuxking hot I'm writing this with my off hand, and I just nutted all over my svreen duck@!!",
            "NTA your valk your rules",
            "Fun fact: my first nut really was at clash royale, but it wasnt because I was turned on, it just happened that I was moving my balls with my legs, and my penis liked that so I cummed. And yes this is true.",
            "YTA Valkyre isn’t meta",
            "Well who is gonna post this on r/clashroyale",
            "[deleted]",
            "Princess is hotter",
            "It was a nice hot night in August (9 months), my youngew cousin (5) woves Cwash Woyawe and fowced me (16) to pway Cwash Woyawe. He (5) was a noob at the game and was onwy in Bone Pit (2ndnawena) so I (16) hewped him out a bit and bwought him to Bawbawian Boww (3wd awena) I was destwoying aww these othew kids (4-6) and my cousin (5) was getting hungwy. Whiwe my cousin (5) went to get food, I (16) stawted to feew a bit speciaw. I woved how Vawawie's boots kwicked. I wuved the sound she makes when destwoying the enemies (5) skeweton awmy and she's so so *fuwiouswy fapping* so fuxking hot I'm wwiting this with my off hand, and I just nutted aww ovew my svween duck@!!",
            "100% upvoted",
            "YTA the Valkyrie from clash of clans is hotter",
            "LET'S PLAY RAID: SHADOW LEGENDS",
            "NEI you didn't tell us if you guys are F or M",
            ">It was a nice hot night in August (9 months)",
            "It was a nice hot night in Augest (9349579283579283579283579184679185698476984698146918918269816498124981749812749827394872398571985729387591375923759823759823823759237982375983475896582582765824576255923598273465982364598236459876239587623987569238569827346587541235568941598416984123656423656+6566+52+256+",
            "Why didn’t u add the genders",
            "valkyrie is my favourite card lmao",
            "NTA it wasnt fortnite porn",
            "The vussy",
            "i want to fricking die",
            "NTA. Your cum your rules",
            "what the fuck",
            "NTA Your game your rules.",
            "NTA you the are not the yes",
            "The Valkyrie is the new queen now huh",
            "NTA your nut your rules",
            "Relatable",
            "NEI I need every characters gender to decide",
            "Good bot",
            "Mark nsfw retard",
            "nice.",
            "I busted a nut to Calendar Royale August\n\nIt was a nice hot night in August (9 months), my younger cousin (5) loves Calendars and forced me (16) to play Calendars Royale. He (5) was a noob at the game and was only in February (2nd month) so I (16) helped him out a bit and brought him to March (3rd arena) I was destroying all these other kids (4-6) and my cousin (5) was getting hungry. While my cousin (5) went to get food, I (16) started to feel a bit special. I loved how August’s boots klicked. I luved the sound she makes when destroying the enemies (5) skeleton army and she's so so *furiously fapping* so fuxking hot I'm writing this with my off hand, and I just nutted all over my svreen duck@!!"
        ]
    },
    {
        "post_id": "howm39",
        "author": "None",
        "title": "Yeah, Orbees bladder torture is my fetish, what of it?",
        "url": "https://www.reddit.com/r/copypasta/comments/howm39/yeah_orbees_bladder_torture_is_my_fetish_what_of/",
        "score": 10281,
        "num_comments": 252,
        "created_utc": 1594413175.0,
        "selftext": "What are you laughing at?  You know, Orbees, those little water beads that swell up when you get them wet.  The torture involves putting a whole bunch of them into my bladder while they dry so they expand inside, growing too big to pass out.  This leaves me with a permanent need to relieve myself and a requirement of frequent trips to the bathroom as I can only let out a small amount of urine at a time.  That's my fetish and if you don't like it you can leave.",
        "permalink": "/r/copypasta/comments/howm39/yeah_orbees_bladder_torture_is_my_fetish_what_of/",
        "comments": [
            "Is this something that people do?",
            "Reminds me of a news story I read where a guy inserted a cell phone charger cord so far up his pee hole that it got stuck and he had to get surgery to remove it.",
            "This sub has some of the worst shit I've ever read yet I keep returning to it.",
            "What awe you waughing at?  You know, Owbees, those wittwe watew beads that sweww up when you get them wet.  The towtuwe invowves putting a whowe bunch of them into my bwaddew whiwe they dwy so they expand inside, gwowing too big to pass out.  This weaves me with a pewmanent need to wewieve mysewf and a wequiwement of fwequent twips to the bathwoom as I can onwy wet out a smaww amount of uwine at a time.  That's my fetish and if you don't wike it you can weave.",
            "What are you laughing at?  You know, Orbees, those little water beads that swell up when you get them wet.  The torture involves putting a whole bunch of them into my bladder while they dry so they expand inside, growing too big to pass out.  This leaves me with a permanent need to relieve myself and a requirement of frequent trips to the bathroom as I can only let out a small amount of urine at a time.  That's my fetish and if you don't like it you can leave.",
            "What are you 👈 laughing 😂 at? You 😂 know 🧠, Orbees, those little 👌 water 💧 beads 📿 that swell 🚬 up 🆙 when ⏰ you 👈 get 💪🏿 them wet 💦. The torture 😫🥵 involves putting 👉 a whole ✋🤚 bunch 🤑 of them into my bladder 🤠 while they dry 🤡 so they expand 💗 inside 💠, growing ⬆ too big 😳 to pass ⬆ out. This leaves 🍂 me with a permanent 🐐 need 🆕 to relieve myself and a requirement 💪 of frequent 📡 trips 👏 to the bathroom 🤑🤯👁 as I 👥 can only let 👏 out a small 🤏❌ amount 🔢📉 of urine 💦 at a time ⏰. That's ✔ my fetish ❤ and if you 😂 don't like 👍 it you 👈 can leave 🍑🍆💦. \n\nMessage 💬 [u/Emojify_Creator myself](https://www.reddit.com/message/compose/?to=Emojify_Creator), or the [Emojify Facebook 🌐📳 Messenger Bot 🤖](https://www.messenger.com/t/104121844644171) to Generate 👶👪 Emoji 😂 Pastas 🍝 Like 👍 This!",
            "I prefer Orbeez urethral torture",
            "How the fuck would you get them that deep? Push them in one at a time with a long rod? I really hope that wouldn’t actually work.",
            "It’s like passing jello kidney stones!",
            "it’s actually ORBEEZ you fucker",
            "how does whoever actually wrote this get the orbees in his bladder in the first place?",
            ">How To Give Yourself a Life-Threatening Urinary Tract Infection 101",
            "As a person with a piss fetish, this offends me",
            "My entire body hurts reading this",
            "How the hell do they get in there",
            "Jokes aside, that actually sounds very hot",
            "Understandable have a nice day",
            "Been there, done that with Bucky Balls. Those little ball magnets. First year of them inside my bladder was uncomfortable, second year was horrible.",
            "Why does this actually sound like a fetish someone would have?",
            "Well what the fuck do you do with the orbees in your bladder? Do just let them sit there and get super sized or sumn?",
            "how the fuck you put that there?",
            "Sniff hand after scratching balls",
            "#KINK SHAMING IS MY KINK",
            "What the fuck have I done?",
            "I think that's just called CBT",
            "Doesn’t sound like torture to me 😤🤤😳🤤😳😂😤",
            "How the hell do you even get them inside in the first place?! \n\nAsking for my friend.",
            "My feet fucking curled when reading this",
            "So how do you eventually get them back out?",
            "Now I have something else to spam in my friend’s dms",
            "When i had 6 i putted orbeez in my asshole beacuse they came like poop and the retard of me thinked it helped with pooping, i dont know why i thinked that",
            "r/sounding",
            "https://www.google.com/amp/s/www.dailymail.co.uk/news/article-7057789/amp/Boy-13-inserts-29-magnetic-beads-penis-curiosity.html",
            "Jump on my bladder balls",
            "Im leaving then",
            "Mental illness is a thing",
            "I read it as or bees and let me just tell you I’m disappointed I was wrong",
            "Now I have a picture in my head that I wish I never knew existed",
            "just pee the orbeez out",
            "I don't kinkshame but jesus christ this sounds painful",
            "This seems......unsafe.",
            "holy fuck",
            "Where do i learn this power?",
            "That's called, Evolution.",
            "nice.",
            "You break into my house, terrorize my wife and children, tell me about your orbeez fetish and demand that I leave my own home when I object to it?",
            "Hot",
            "r/noahgettheboat"
        ]
    },
    {
        "post_id": "gc72v0",
        "author": "marcosmou",
        "title": "Congratulations! Ding Ding Ding Ding! You are the 1 000 000 reddit user who posted a \"Fortnite bad haha\" post!",
        "url": "https://www.reddit.com/r/copypasta/comments/gc72v0/congratulations_ding_ding_ding_ding_you_are_the_1/",
        "score": 10273,
        "num_comments": 157,
        "created_utc": 1588428628.0,
        "selftext": "Found in r/gaming:\nCongratulations! Ding Ding Ding Ding! You are the 1 000 000 reddit user who posted a \"Fortnite bad haha\" post! Choose your prize dear user:\n\n1. A new horse: The one you got have obviously been beaten to death.\n\n2. A ticket off the bandwagon: A chance to move on to better and more original humor, but we both know you won't pick this one.\n\n3. A repost token: The ability to repost more \"Fortnite bad haha\" posts across other subreddits.\n\nFeel free to claim the third one, as it's our most popular prize and thank you!",
        "permalink": "/r/copypasta/comments/gc72v0/congratulations_ding_ding_ding_ding_you_are_the_1/",
        "comments": [
            "Fortnite bad haha",
            "Congratulations! Ding Ding Ding Ding! You are the 1 000 000 reddit user who posted a \"Fortnite bad haha\" post! Choose your prize dear user:\n\n1. A new horse: The one you got have obviously been beaten to death.\n\n2. A ticket off the bandwagon: A chance to move on to better and more original humor, but we both know you won't pick this one.\n\n3. A repost token: The ability to repost more \"Fortnite bad haha\" posts across other subreddits.\n\nFeel free to claim the third one, as it's our most popular prize and thank you!",
            "This should be a bot response when someone says fortnite bad",
            "chungus moment certified",
            "I choose the fourth.",
            "Forkknife bad hawhaw",
            "Congwatuwations! Ding Ding Ding Ding! You awe the 1 000 000 weddit usew who posted a \"Fowtnite bad haha\" post! Choose youw pwize deaw usew:\n\n1. A new howse: The one you got have obviouswy been beaten to death.\n\n2. A ticket off the bandwagon: A chance to move on to bettew and mowe owiginaw humow, but we both know you won't pick this one.\n\n3. A wepost token: The abiwity to wepost mowe \"Fowtnite bad haha\" posts acwoss othew subweddits.\n\nFeew fwee to cwaim the thiwd one, as it's ouw most popuwaw pwize and thank you!",
            "r/redditmoment but unironically",
            "You have been permanently banned from participating in r/copypasta. You can still view and subscribe to r/copypasta, but you won’t be able to post or comment. \n\nIf you have a question regarding your ban, you can contact the moderator team for r/copypasta by replying to this message. \n\n**Reminder to Reddit staff:** If you use another account to circumvent this subreddit ban, that will be considered a violation of [the Content Policy]( https://www.redditinc.com/policies/content-policy#section_prohibited_behavior) and can result in your account being [suspended](https://www.reddithelp.com/en/categories/account-status/my-account-was-suspended) from the site as a whole.",
            "Comment: [https://www.reddit.com/r/gaming/comments/gbzujm/lmao/fp96ppu?utm\\_source=share&utm\\_medium=web2x](https://www.reddit.com/r/gaming/comments/gbzujm/lmao/fp96ppu?utm_source=share&utm_medium=web2x)",
            "Fr",
            "Yeah lemme just get 3.50 fortbux",
            "NTA",
            "It wont be long until post saying keanu chungus 100 wholesum fortnite bad Minecraft Good will be as overused as that",
            "This is the most powerful copypasta because with a few edits it can ridicule any circlejerk you can think of",
            "Can this be an automod reply?",
            "[removed]",
            "Fortnite good hehe",
            "There should be a bot that replies with this copypasta but the number actually grows with every reply",
            "This is brilliant.",
            "I would like a ticket off the bandwagons even tho I haven’t posted a fortnite bad meme",
            "Hey I replied to this of thread lol and got attacked. End circlejerks",
            "I got a noti for this and I was like “when the fuck did I post fortnite ;w;”",
            "fornite sux!!!",
            "Cum",
            "Is this supposed to hate on the ironic fortnite bad haha or unironic?",
            "Fortnite stink haha",
            "Boutta use this on a fortnite bad post thanks",
            "Cock.",
            "How much is the horse worth?",
            "Fortnite bad haha",
            "I like fortnite. I enjoy warm food in my belly. I crave the fellowship of another joined in the swearing of my quest. You have been banished to nevermore feel the warmth that is fortnite.",
            "Fortunate good haha",
            "fortnite bad harhar",
            "fortnite bad haha",
            "Fortnite bad haha",
            "I friggin thought the user was named ding ding ding ding and I was like wtf",
            "So much variety with this one too",
            "CARDI B ALSO BAD!!",
            "\nCongratulations! Ding Ding Ding Ding! You are the 1 000 000 reddit user who posted a \"Fortnite bad haha\" post! Choose your prize dear user:\n\n1. A new horse: The one you got have obviously been beaten to death.\n\n2. A ticket off the bandwagon: A chance to move on to better and more original humor, but we both know you won't pick this one.\n\n3. A repost token: The ability to repost more \"Fortnite bad haha\" posts across other subreddits.\n\nFeel free to claim the third one, as it's our most popular prize and thank you!",
            "Congratulations! Ding Ding Ding Ding! You are the 1 000 000 reddit user who posted a \"Fortnite bad haha\" post! Choose your prize dear user:\n\n1. A new horse: The one you got have obviously been beaten to death.\n2. A ticket off the bandwagon: A chance to move on to better and more original humor, but we both know you won't pick this one.\n3. A repost token: The ability to repost more \"Fortnite bad haha\" posts across other subreddits.\n\nFeel free to claim the third one, as it's our most popular prize and thank you!",
            "I've always wondered how you would go about beating a horse to death. One botched swing and that thing is either speeding off or kicking you in the neck.",
            "Fucking retard how is there a popular option of he's the only person who was the millionth",
            "Haha Scar go pew pew pew",
            "God have mercy.",
            "YTA, I can't count to 3",
            "Why is this NSFW?",
            "Hey, I'm the user that came up with one. I'm glad it's being immortalized and hope it gets used both ironic and unironically in the future. Guess my cakeday wish did come true. So where can I go to claim my internet points? \n\n[Copy](https://www.reddit.com/r/gaming/comments/g9o9lq/i_can_dig_it/fouurpa?utm_medium=android_app&utm_source=share)\n\n[Pasta](https://www.reddit.com/r/gaming/comments/gbzujm/lmao/fp96ppu?utm_medium=android_app&utm_source=share)",
            "Fortnite bad haha",
            "Instagram bad haha",
            "oh thank god it was marked nsfw",
            "fortnite good downvote if gay",
            "I can't wait for the counter-copypasta that calls this a scam",
            "Why can't I unhear Jacksepticeyes bell when I read \"ding ding ding ding\" lmao",
            "Fortnite bad haha",
            "Fortnite",
            "Fortnite bad haha",
            "Xdxd",
            "Congratulations! Ding Ding Ding Ding! You are the 1 000 001 reddit user who posted a \"Fortnite bad haha\" post! Choose your prize dear user:\n\n1.\t⁠A new horse: The one you got have obviously been beaten to death.\n2.\t⁠A ticket off the bandwagon: A chance to move on to better and more original humor, but we both know you won't pick this one.\n3.\t⁠A repost token: The ability to repost more \"Fortnite bad haha\" posts across other subreddits.\n\nFeel free to claim the third one, as it's our most popular prize and thank you!",
            "Too bad it is tho"
        ]
    },
    {
        "post_id": "kitwke",
        "author": "-Koran-",
        "title": "Penis",
        "url": "https://www.reddit.com/r/copypasta/comments/kitwke/penis/",
        "score": 10265,
        "num_comments": 145,
        "created_utc": 1608733193.0,
        "selftext": "If my penis gets hard and decides that it wants sex but I don't, am I still required to have sex anyway? If that violates my consent, does that mean my penis is raping me? And on the flip side, if I violate my penis rights by using viagra, does that mean I'm raping my own penis?",
        "permalink": "/r/copypasta/comments/kitwke/penis/",
        "comments": [
            "NTA. Your penis, your rules.",
            "If my penis gets hawd and decides that it wants sex but I don't, am I stiww wequiwed to have sex anyway? If that viowates my consent, does that mean my penis is waping me? And on the fwip side, if I viowate my penis wights by using viagwa, does that mean I'm waping my own penis?",
            "If my penis 🍒🍆 gets 🉐 hard 🍆 and decides 🤔 that it wants 😍 sex 🍆 but 🍑 I 👁 don't 🚫, am I 😍👁 still 🤞🙌 required 😑 to have sex 🍑🍆 anyway 🔛? If that violates 👿👎 my consent ✅, does that mean 😏 my penis 🍆 is raping 😫 me? And on 🔛 the flip 🖕 side 👳, if I 👁 violate 👎❎🚫 my penis 🍆 rights ✔ by using 🏻 viagra 💊, does that mean 😏 I'm 💘 raping 😫 my own penis 🍆?",
            "Cummy.. :(",
            "\"If my penis gets hard and decides that it wants sex but I don't, am I still required to have sex anyway?\"  \n   \nDealer's choice.  \n   \n\"If that violates my consent, does that mean my penis is raping me?\"  \n   \nIn the rare occurrence when your penis can actually penetrate your asshole, your manlihood would essentially be raping you, leaving you a bitch to your own cock.  \n   \n\"if I violate my penis rights by using viagra, does that mean I'm raping my own penis?\"  \nSexual assault.   \nYou're not alone. Confidential help is available for free.  \n[Learn more](https://support.google.com/websearch/?p=crisis_prevention_info)[National Sexual Assault Hotline](http://rainn.org/)  \nCall 1-800-656-4673Available 24 hours everyday",
            "NTA BIIIIIG Red Flags🚩🚩🚩🚩🚩🚩The penis is clearly raping and sexually harassing you, i suggest either talking to a lawyer or just cutting it off",
            "u/shittytranslatorbot",
            "free the penis",
            "#rightsforpenis",
            "cool",
            "r/penis",
            "/r/askphilosophy might help",
            "I don’t need sleep I need answers.",
            "!ThesaurizeThis",
            "Vagina",
            "Ok boomer",
            "#PENIS",
            " \n\nChicken Little review\n\nChicken Little is an enduring 1884 classic made by Walt Disney and Barack Obama it is incredible masterpiece and potentially the best movie ever with stunning visuals, deep and rich dialogue and a plot deeper than the Mariana trench it is wonderous seeing this movie the actors nail these characters with highly acclaimed actors such as Will Smith Jonny Depp and Dwayne \"The Rock\" Johnson it is perfect 10/10\n\nIt has a legacy that no other work can even remotely challenge the movie it is timeless and is the second coming of Jesus Christ no matter who you are where you are you need to see this movie it will change your life it even cures cancer it was so incredible that a sequel was cancelled because nothing can live up to this masterpiece.\n\nIt has a sense of childhood wonder into every word it can be hilarious and dramatic at the same time. The main character named Chicken Little played by Albert Einstein is a child in Oakey Oaks who gets bullied by everyone in the town because of his intelligence because he realizes that the sky is falling before anyone else but the people do not believe him because of how stupid they are except his friends which we will get to later and Buck Cluck possibly the best father figure in all of cinema. Buck Cluck played by Barack Obama is supportive of his genius son as he is also one of the most intelligent characters in the story. Then we get to chicken little friends Abby Mallard is played by Travis Scott from Fortnite and she is a vocalist often doing karaoke sessions that consist of the lyrics \n\nThey told him, \"Don't you ever come around here\" \"Don't wanna see your face, you better disappear\" The fire's in their eyes and their words are really clear So beat it, just beat it You better run, you better do what you can Don't wanna see no blood, don't be a macho man You wanna be tough, better do what you can So beat it, but you wanna be bad Just beat it (beat it), beat it (beat it) No one wants to be defeated Showin' how funky and strong is your fight It doesn't matter who's wrong or right Just beat it (beat it) Just beat it (beat it) Just beat it (beat it) Just beat it (beat it, uh) They're out to get you, better leave while you can Don't wanna be a boy, you wanna be a man You wanna stay alive, better do what you can So beat it, just beat it You have to show them that you're really not scared You're playin' with your life, this ain't no truth or dare They'll kick you, then they'll beat you Then they'll tell you it's fair So beat it, but you wanna be bad Just beat it (beat it), beat it (beat it) No one wants to be defeated Showin' how funky and strong is your fight It doesn't matter who's wrong or right Just beat it (beat it), beat it (beat it) No one wants to be defeated Showin' how funky and strong is your fight It doesn't matter who's wrong or right Just beat it (beat it, beat it, beat it) Beat it (beat it, beat it) Beat it (beat it, beat it) Beat it (beat it, beat it) Beat it (beat it, beat it) Beat it (beat it), beat it (beat it) No one wants to be defeated Showin' how funky and strong is your fight It doesn't matter who's wrong or right (who's right) Just beat it (beat it), beat it (beat it) No one wants to be defeated (no one) Showin' how funky and strong is your fight It doesn't matter who's wrong or right Just beat it (beat it), beat it (beat it) No one wants to be defeated (oh, no) Showin' how funky and strong is your fight It doesn't matter who's wrong or right Just beat it (beat it), beat it (beat it) No one wants to be defeated Showin' how funky and strong is your fight It doesn't matter who's wrong or right Just beat it (beat it), beat it (beat it) No one wants to be defeated\n\nAnd is Chicken Little’s love interest and is one of the best designed characters whit a great dental plan and an amazing voice she is one of the best characters in cinema. Next is Runt played by Dwanye “The Rock” Johnson he is known for his physical might and his favorite songs lyrics (Hi, Barbie  \nHi, Ken! Do you wanna go for a ride? Sure, Ken! Jump in... I'm a Barbie girl in the Barbie world Life in plastic, it's fantastic! You can brush my hair, undress me everywhere Imagination, life is your creation Come on, Barbie, let's go party! I'm a Barbie girl in the Barbie world Life in plastic, it's fantastic! You can brush my hair, undress me everywhere Imagination, life is your creation I'm a blond bimbo girl in a fantasy world Dress me up, make it tight, I'm your dolly You're my doll, rock'n'roll, feel the glamour in pink, Kiss me here, touch me there, hanky panky... You can touch, you can play, if you say, \"I'm always yours.\" (uu-oooh-u) \\[2x\\] I'm a Barbie girl in the Barbie world Life in plastic, it's fantastic! You can brush my hair, undress me everywhere Imagination, life is your creation  \nCome on, Barbie, let's go party! (ah-ah-ah-yeah) Come on, Barbie, let's go party! (uu-oooh-u) \\[2x\\] Come on, Barbie, let's go party! (ah-ah-ah-yeah)  \nCome on, Barbie, let's go party!(uu-oooh-u) \\[2x\\]  \nMake me walk, make me talk, do whatever you please I can act like a star, I can beg on my knees Come jump in, bimbo friend, let us do it again, Hit the town, fool around, let's go party You can touch, you can play, if you say, \"I'm always yours.\" You can touch, you can play, if you say, \"I'm always yours.\" Come on, Barbie, let's go party! (ah-ah-ah-yeah) Come on, Barbie, let's go party! (uu-oooh-u) \\[2x\\] Come on, Barbie, let's go party! (ah-ah-ah-yeah) Come on, Barbie, let's go party! (uu-oooh-u) \\[2x\\] I'm a Barbie girl in the Barbie world Life in plastic, it's fantastic! You can brush my hair, undress me everywhere Imagination, life is your creation I'm a Barbie girl in the Barbie world Life in plastic, it's fantastic! You can brush my hair, undress me everywhere Imagination, life is your creation Come on, Barbie, let's go party! (Ah-ah-ah-yeah) Come on, Barbie, let's go party! (uu-oooh-u) \\[2x\\] Come on, Barbie, let's go party! (ah-ah-ah-yeah) Come on, Barbie, let's go party! (uu-oooh-u) \\[2x\\] Oh, I'm having so much fun! Well, Barbie, we're just getting started Oh, I love you, Ken!)",
            "This is wild",
            "Whoa. I guess being a man is- hard.",
            "u/king_mo_of_metal420",
            "You ask the real questions",
            "yesssss? Go on!",
            "I mean...",
            "This is a Chuck Tingle novel plot, isn't it?",
            "Just beat it",
            "Penis\nc:::::::::::::::::8",
            "based",
            "Chastity Cages are just Penis Jail.",
            "Nah I just maķe peace treaties with my penis",
            "yes",
            "Thank you for convincing me to finally filter out this dumpsterfire of a sub",
            "Just punch your penis, you have legit reasons to defend yourself",
            "If nothing happens within 15 minutes, you're legally allowed to stop.",
            "Fellas, is it gay to even HAVE a penis? You are literally touching penis 24/7.",
            "I don't think of the poster actually has a pene'us.\n\nI don't know what the word at the end of the sentence means but it looks funny so im going to keep it.",
            "Your penis violated the Non Aggression Pact. You must now destroy it with the power of 1000 suns",
            "asexual mood",
            "November moment.",
            "Thats some good weed bro",
            "The Pen Is mightier than the sword.",
            "Yes",
            "At best it's sexual assualt",
            "I have learned from many videos over the years that having sex is the only way to get rid of an erect penis. Sorry, you're trapped... :(",
            "This is the most retarded shit I have read this year.",
            "Wow... WTH is wrong with ppl.",
            "I miss my Cummy senpai"
        ]
    },
    {
        "post_id": "eazwqz",
        "author": "WoahStopItCummybot",
        "title": "❤️Cute little message to send to your BF/GF/MIL/FIL/Mother/Father/Brother/Sister/Aunt/Uncle/Son/Daughter/Grandpa/Granny/Niece/Nephew/Cousin/Neighbor/Mayor/Favorite deputy/Enemy/Dog/Cat/Fish/Lizard/Gecko/Cummybot2000/BDSM Master/Kidnapping's victim/Waiter/Doctor/Prison mate/Dead relative/Cult leader.",
        "url": "https://www.reddit.com/r/copypasta/comments/eazwqz/cute_little_message_to_send_to_your/",
        "score": 10269,
        "num_comments": 206,
        "created_utc": 1576422244.0,
        "selftext": "🌌 In a universe...\n\n☀️ In a solar system...\n\n🌎 On a planet...\n\n🗺️ On a continent...\n\n🗾 In a country...\n\n🌃 In a city...\n\n🛣️ On a street...\n\n🏬 In a building...\n\n🚪 In an apartment...\n\n🛋️ In a room...\n\n🛏️ In a bed...\n\n🕺 In a person...\n\n🧠 In an organ...\n\n🔬 In a skin tissue...\n\n💉 In my blood...\n\n🦠 In a cell...\n\n🌰 In the cell's core...\n\n🧬 In my DNA...\n\n🧫 In a molecule...\n\n☢️ In an atom...\n\n💩 There are shit particles because I eat my feces due to a mental disorder.\n\n**Edit: I don't give an absolute fuck about the upvotes, I guess the social conventions force me to say \"thanks\" but I'm above them.**\n\n**Edit 2: For real guys I'm allergic to upvotes and I lost my EpiPen and I'm dying irl so stop upvoting please my mom is panicking.**\n\n**Edit 3: Ok that's not funny I'm in the hospital because the upvotes doubled in 10 minutes and I'm coughing blood please guys I'm drawing my tombstone because I'm a preventive person but frl stop upvoting.**\n\n**Edit 4: Someone told me my edits are toxic😭😭**\n\n**Edit 5: First time I ever got gold, thanks!**\n\n**Edit 6: Someone told me my edits are cringe😭😭**\n\n**Edit 7: This is Brandon's mom. He died tonight at 6 PM. Doctors told me that the causes of the death were chronic cringe. Thank you for supporting our family.**",
        "permalink": "/r/copypasta/comments/eazwqz/cute_little_message_to_send_to_your/",
        "comments": [
            "🌌 In a universe...\n\n☀️ In a solar system...\n\n🌎 On a planet...\n\n🗺️ On a continent...\n\n🗾 In a country...\n\n🌃 In a city...\n\n🛣️ On a street...\n\n🏬 In a building...\n\n🚪 In an apartment...\n\n🛋️ In a room...\n\n🛏️ In a bed...\n\n🕺 In a person...\n\n🧠 In an organ...\n\n🔬 In a skin tissue...\n\n💉 In my blood...\n\n🦠 In a cell...\n\n🌰 In the cell's core...\n\n🧬 In my DNA...\n\n🧫 In a molecule...\n\n☢️ In an atom...\n\n💩 There are shit particles because I eat my feces due to a mental disorder.",
            "I believe you might be right.",
            ">🗾 In a country...\n\nConfirmed weeb, ban the animu",
            "+translateto onlystroke",
            "you are the answer to every “who watches this kind of porn” question",
            "Yo thanks for the edits dude!!!1!!!!",
            "You forgot to put \"galaxy\" between universe and solar system.",
            "🌌 In a univewse...\n\n☀️ In a sowaw system...\n\n🌎 On a pwanet...\n\n🗺️ On a continent...\n\n🗾 In a countwy...\n\n🌃 In a city...\n\n🛣️ On a stweet...\n\n🏬 In a buiwding...\n\n🚪 In an apawtment...\n\n🛋️ In a woom...\n\n🛏️ In a bed...\n\n🕺 In a pewson...\n\n🧠 In an owgan...\n\n🔬 In a skin tissue...\n\n💉 In my bwood...\n\n🦠 In a ceww...\n\n🌰 In the ceww's cowe...\n\n🧬 In my DNA...\n\n🧫 In a mowecuwe...\n\n☢️ In an atom...\n\n💩 Thewe awe shit pawticwes because I eat my feces due to a mentaw disowdew.",
            "The fact this pasta doesn't include references to mitochondria, means it's garbage.\n\n\"cell's core\"?? WTF is that supposed to mean?",
            "Kinda cringe doe",
            "NTA. Your house your rules",
            "Your edits are toxic",
            "[deleted]",
            "I thought the edits were part of the copypasta but cummy didn't get them :(",
            "I just downvoted your downvote comment.\n\n#FAQ\n\nWhat does this mean?\n\nThe amount of karma (points) on your downvote comment and Reddit account has decreased by one.\n\nWhy did you do this?\n\nThere are several reasons I may deem a downvote comment to be unworthy of positive or neutral karma. These include, but are not limited to:\n • Rudeness towards other Redditors,\n • Spreading incorrect information,\n • Sarcasm not correctly flagged with a _/s_.\n\nAm I banned from the Reddit?\n\nNo - not yet. But you should refrain from making downvote comments like this in the future. Otherwise I will be forced to issue an additional downvote, which may put your commenting and posting privileges in jeopardy.\n\nI don't believe my downvote comment deserved a downvote. Can you un-downvote it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I undo a downvote on a downvote comment. If you would like to issue an appeal, shoot me a private message explaining what I got wrong. I tend to respond to Reddit PMs within several minutes. Do note, however, that over 99.9% of downvote appeals are rejected, and yours is likely no exception.\n\nHow can I prevent this from happening in the future?\n\nAccept the downvote on your downvote comment and move on. But learn from this mistake: your behavior will not be tolerated on Reddit.com. I will continue to issue downvotes until you improve your conduct. Remember: Reddit is privilege, not a right.",
            "Now thats a cool kid fact B)",
            "🌌 In a universe...\n\n☀️ In a solar system...\n\n🌎 On a planet...\n\n🗺️ On a continent...\n\n🗾 In a country...\n\n🌃 In a city...\n\n🛣️ On a street...\n\n🏬 In a building...\n\n🚪 In an apartment...\n\n🛋️ In a room...\n\n🛏️ In a bed...\n\n🕺 In a person...\n\n🧠 In an organ...\n\n🔬 In a skin tissue...\n\n💉 In my blood...\n\n🦠 In a cell...\n\n🌰 In the cell's core...\n\n🧬 In my DNA...\n\n🧫 In a molecule...\n\n☢️ In an atom...\n\n🍆 Penis",
            "NTA eating shit particles is proven to cause unnecessary edit syndrome, your friends should be more considerate",
            "Cock and ball torture",
            "NTA",
            "u/uwutranslator",
            "🌌 𝕀𝕟 𝕒 𝕦𝕟𝕚𝕧𝕖𝕣𝕤𝕖...\n\n☀️ 𝕀𝕟 𝕒 𝕤𝕠𝕝𝕒𝕣 𝕤𝕪𝕤𝕥𝕖𝕞...\n\n🌎 𝕆𝕟 𝕒 𝕡𝕝𝕒𝕟𝕖𝕥...\n\n🗺️ 𝕆𝕟 𝕒 𝕔𝕠𝕟𝕥𝕚𝕟𝕖𝕟𝕥...\n\n🗾 𝕀𝕟 𝕒 𝕔𝕠𝕦𝕟𝕥𝕣𝕪...\n\n🌃 𝕀𝕟 𝕒 𝕔𝕚𝕥𝕪...\n\n🛣️ 𝕆𝕟 𝕒 𝕤𝕥𝕣𝕖𝕖𝕥...\n\n🏬 𝕀𝕟 𝕒 𝕓𝕦𝕚𝕝𝕕𝕚𝕟𝕘...\n\n🚪 𝕀𝕟 𝕒𝕟 𝕒𝕡𝕒𝕣𝕥𝕞𝕖𝕟𝕥...\n\n🛋️ 𝕀𝕟 𝕒 𝕣𝕠𝕠𝕞...\n\n🛏️ 𝕀𝕟 𝕒 𝕓𝕖𝕕...\n\n🕺 𝕀𝕟 𝕒 𝕡𝕖𝕣𝕤𝕠𝕟...\n\n🧠 𝕀𝕟 𝕒𝕟 𝕠𝕣𝕘𝕒𝕟...\n\n🔬 𝕀𝕟 𝕒 𝕤𝕜𝕚𝕟 𝕥𝕚𝕤𝕤𝕦𝕖...\n\n💉 𝕀𝕟 𝕞𝕪 𝕓𝕝𝕠𝕠𝕕...\n\n🦠 𝕀𝕟 𝕒 𝕔𝕖𝕝𝕝...\n\n🌰 𝕀𝕟 𝕥𝕙𝕖 𝕔𝕖𝕝𝕝'𝕤 𝕔𝕠𝕣𝕖...\n\n🧬 𝕀𝕟 𝕞𝕪 𝔻ℕ𝔸...\n\n🧫 𝕀𝕟 𝕒 𝕞𝕠𝕝𝕖𝕔𝕦𝕝𝕖...\n\n☢️ 𝕀𝕟 𝕒𝕟 𝕒𝕥𝕠𝕞...\n\n💩 There are shit particles because I eat my own feces due to a mental disorder.",
            "Shit 🐒 me die from poop, no likey or I die \nEdit: thanks for shit \nEdit: shit kill me \nShit:shit",
            "This is human centipede",
            "Cock",
            "So 👏much ✊this.👈",
            "Cock",
            "classic",
            "Cock",
            "Awwww",
            "This is it. This is the best we're gonna get. It all goes downhill from here.",
            "Why was Cummy the only comment?",
            "NTA",
            "Fs our for my boy Brandon",
            "+translateto rosemary",
            "Username checks out",
            "D:",
            "Emoji",
            "Rabbits eat their own poo too and people think they’re cool",
            "r/ontheledgeandshit",
            "General secretary",
            "I really enjoyed this, but man the edits lol, yeesh. Please stöp",
            "smart",
            "Who else cried when he died?",
            " \n\n🌌 In a universe...\n\n☀️ In a solar system...\n\n🌎 On a planet...\n\n🗺️ On a continent...\n\n🗾 In a country...\n\n🌃 In a city...\n\n🛣️ On a street...\n\n🏬 In a building...\n\n🚪 In an apartment...\n\n🛋️ In a room...\n\n🛏️ In a bed...\n\n🕺 In a person...\n\n🧠 In an organ...\n\n🔬 In a skin tissue...\n\n💉 In my blood...\n\n🦠 In a cell...\n\n🌰 In the cell's core...\n\n🧬 In my DNA...\n\n🧫 In a molecule...\n\n☢️ In an atom...\n\n💩 There are shit particles because I eat my feces due to a mental disorder.",
            "🌌 In a universe...\n\n☀️ In a solar system...\n\n🌎 On a planet...\n\n🗺️ On a continent...\n\n🗾 In a country...\n\n🌃 In a city...\n\n🛣️ On a street...\n\n🏬 In a building...\n\n🚪 In an apartment...\n\n🛋️ In a room...\n\n🛏️ In a bed...\n\n🕺 In a person...\n\n🧠 In an organ...\n\n🔬 In a skin tissue...\n\n💉 In my blood...\n\n🦠 In a cell...\n\n🌰 In the cell's core...\n\n🧬 In my DNA...\n\n🧫 In a molecule...\n\n☢️ In an atom...\n\n#IS JOE",
            "The edits are even better than the actual post\n\nRIP Brandon",
            "Your edits are cringe bro"
        ]
    },
    {
        "post_id": "bgmf88",
        "author": "DisprovedMemes",
        "title": "PORN IS BIG GAY",
        "url": "https://www.reddit.com/r/copypasta/comments/bgmf88/porn_is_big_gay/",
        "score": 10273,
        "num_comments": 388,
        "created_utc": 1556057226.0,
        "selftext": "Last night I was looking for some porn of the not gay variety.  Obviously gay porn is gay, so instead I went looking for guy on girl porn. But I realized that features a guy, with a penis, and is therefore 50% gay.  So I started looking for some girl on girl action, till I realized that is lesbian, and is therefore 100% gay.  \n\nSo clearly, I had to look into alternative options.  I started to consider hentai: since no one in it is real, it can’t contain guys, so it’s not gay, right? Well, hentai is anime, which not only is gay, but also makes me a weeb. The worst option so far.\n\nI considered traps. I’ve long heard debate over whether traps are gay, so I decided to do the math.  The gayness of traps lies in the premise. Let’s consider the 5 base premises:\n1) a guy and a trap, where the guy initially thinks he’s with a girl: effectively guy on girl, 50% gay\n2) a guy with a trap, and the guy knew it was a trap:\nDude looking for some dick, that’s gay\n3) a girl with a trap, where the girl doesn’t know it’s a trap: that’s lesbian, and is gay\n4) a girl with a trap, where the girl knows it’s a trap: effectively guy on girl, therefore 50% gay\nTherefore, on average traps are 75% gay, with a minimum gayness of 50%. Not an improvement.  The 5th option, trap on trap, is a singularity of the 4 prior possibilities, and is therefore on average 75% gay again.\n\nSo I got into specifics. What if it was girl on girl, and the premise was at least one of the girls was just bi-curious, and not actually fully lesbian? Well, in that case, their curiosity makes them a cat. Cats are furries, and furries are gay\n\nSo how about a girl soloing? Well that’s a girl touching girl bits. Lesbian and gay.\n\nMy conclusion is that the only way to live a life free of homosexual sin is to liberate oneself of sexual desire at all, and become an asexual.\n\nThanks for coming to my Ted Talk.",
        "permalink": "/r/copypasta/comments/bgmf88/porn_is_big_gay/",
        "comments": [
            "Asexual is in LGBT+ so that's gay",
            "What if you watch 2 girls and 1 guy? isnt that around only 25% gay? And last time I checked you need to be at least 50% gay to go to hell, so its a win",
            "Hear me out, what if I just watch 2 dudes fucking? 2 guys and 2 dicks means they cancel out and its not gay anymore PEMDAS",
            "Last night I was looking for some porn of the not gay variety.  Obviously gay porn is gay, so instead I went looking for guy on girl porn. But I realized that features a guy, with a penis, and is therefore 50% gay.  So I started looking for some girl on girl action, till I realized that is lesbian, and is therefore 100% gay.  \n\nSo clearly, I had to look into alternative options.  I started to consider hentai: since no one in it is real, it can’t contain guys, so it’s not gay, right? Well, hentai is anime, which not only is gay, but also makes me a weeb. The worst option so far.\n\nI considered traps. I’ve long heard debate over whether traps are gay, so I decided to do the math.  The gayness of traps lies in the premise. Let’s consider the 5 base premises:\n1) a guy and a trap, where the guy initially thinks he’s with a girl: effectively guy on girl, 50% gay\n2) a guy with a trap, and the guy knew it was a trap:\nDude looking for some dick, that’s gay\n3) a girl with a trap, where the girl doesn’t know it’s a trap: that’s lesbian, and is gay\n4) a girl with a trap, where the girl knows it’s a trap: effectively guy on girl, therefore 50% gay\nTherefore, on average traps are 75% gay, with a minimum gayness of 50%. Not an improvement.  The 5th option, trap on trap, is a singularity of the 4 prior possibilities, and is therefore on average 75% gay again.\n\nSo I got into specifics. What if it was girl on girl, and the premise was at least one of the girls was just bi-curious, and not actually fully lesbian? Well, in that case, their curiosity makes them a cat. Cats are furries, and furries are gay\n\nSo how about a girl soloing? Well that’s a girl touching girl bits. Lesbian and gay.\n\nMy conclusion is that the only way to live a life free of homosexual sin is to liberate oneself of sexual desire at all, and become an asexual.\n\nThanks for coming to my Ted Talk.",
            "I masturbate to single celled organisms reproducing asexually. So hot 🥵",
            "Welp guess im doing r/nofap now",
            "If u watch soft core with a vibrator, you see female parts that no human is touching and so it is 0% gay, problem solved",
            "Wast night I was wooking fow some pown of the not gay vawiety.  Obviouswy gay pown is gay, so instead I went wooking fow guy on giww pown. But I weawized that featuwes a guy, with a penis, and is thewefowe 50% gay.  So I stawted wooking fow some giww on giww action, tiww I weawized that is wesbian, and is thewefowe 100% gay.  \n\nSo cweawwy, I had to wook into awtewnative options.  I stawted to considew hentai: since no one in it is weaw, it can’t contain guys, so it’s not gay, wight? Weww, hentai is anime, which not onwy is gay, but awso makes me a weeb. The wowst option so faw.\n\nI considewed twaps. I’ve wong heawd debate ovew whethew twaps awe gay, so I decided to do the math.  The gayness of twaps wies in the pwemise. Wet’s considew the 5 base pwemises:\n1) a guy and a twap, whewe the guy initiawwy thinks he’s with a giww: effectivewy guy on giww, 50% gay\n2) a guy with a twap, and the guy knew it was a twap:\nDude wooking fow some dick, that’s gay\n3) a giww with a twap, whewe the giww doesn’t know it’s a twap: that’s wesbian, and is gay\n4) a giww with a twap, whewe the giww knows it’s a twap: effectivewy guy on giww, thewefowe 50% gay\nThewefowe, on avewage twaps awe 75% gay, with a minimum gayness of 50%. Not an impwovement.  The 5th option, twap on twap, is a singuwawity of the 4 pwiow possibiwities, and is thewefowe on avewage 75% gay again.\n\nSo I got into specifics. What if it was giww on giww, and the pwemise was at weast one of the giwws was just bi-cuwious, and not actuawwy fuwwy wesbian? Weww, in that case, theiw cuwiosity makes them a cat. Cats awe fuwwies, and fuwwies awe gay\n\nSo how about a giww sowoing? Weww that’s a giww touching giww bits. Wesbian and gay.\n\nMy concwusion is that the onwy way to wive a wife fwee of homosexuaw sin is to wibewate onesewf of sexuaw desiwe at aww, and become an asexuaw.\n\nThanks fow coming to my Ted Tawk.",
            "what about just one girl by herself?",
            "Traps are not gay.",
            "I’m bi",
            "Alternative:\n\nSay no homo. Now you can watch all the lesbian furry hentai you want",
            "The only way to not be gay is to condition yourself to spontaneously ejaculate once your mind is completely clear of anything whatsoever (aka reaching Buddhist enlightenment)",
            "Technically futa is the least gay as it's only 25%",
            "I’ve seen this posted like 5 times. Come on!",
            "Im already asexual but i like dick and thus am gay",
            "Being a man is gay, because you're inside of a man's body, and that's gay",
            "You're only gay if you like *men* specifically.",
            "Traps are gay, but futa is not because on average, a penis makes up around 2-3% of the body, and the penis is the only Male part of futa, therefore if it is a bi-curious female on a futa, it is only 2-3% gay, because the penis is the only gay part\n\n\nThis is basically what I remember from an old copypasta",
            "Solo masturbation",
            "I love this so much",
            "P - Penis\nE - Entering\nM - Men\nD - Doesn’t\nA - Actually\nS - Signifygayness",
            "So what if you're a guy and you're watching a woman get fucked by a dick machine? What is the verdict on the level of Big Gay with this activity?",
            "Just beat your dick to a wall. No other thoughts, meaning no gay.",
            "What if it's a threesome with 2 girls who don't touch each other and 1 guy? Then it's only 48.5% gay (because it's still kinda gay cuz it's 2 girls.\nThat's less than 50%. The more you add girls, the less % there will be guys, but there will be more girls. 3 girls means girl on girl 3x, but half gay, making it 12.5% gay per girl. 12.5% times 3 is 37.5% but theres the guy which is 100% gay so 37.5 +25%=62.5%. when you add more girls, gay level increases. This means that threesome with 2 girls and 1 guy is the only way it's less straight than gay and therefore the only relatively straight porn.\n\nBut isn't being a guy gay cuz you pretty much got a mans body inside you?",
            "but wait, if you are asexual, then you love yourself, which is a dude loving a dude or a woman loving a woman, both of which being 100% gay. Then, there are futas and shemales to work the numbers with. Basically everything is pretty gay and the lowest recorded gay is 50%",
            "Just watch a Female stripping and Mastebating 0% gay because there is only one person🤯",
            "why doesn't anyone on reddit know about POV virtual porn???",
            "I disagree. Female masturbation videos are NOT gay. There is no girl on girl action, and it is just someone having sex with themself. If female masturabtion is gay, then male masturbation is also gay, right? According to the Department of Health and Human Services, 92% of males over 13 masturbate. Therefore, if you are a man, which by the nature of your speech I am guessing you are, there is a 92% chance that you masturabte. This chance is increased by the fact that you are watching porn. Therefore, by your own logic, you are in fact gay.\n\n⏩⏪",
            "Futanari on girl. Girl isn’t gay and the futa is only half guy so 25% gay. It’s the best possible option.",
            "If you watch a girl with a dick fucking a girl then that’s only 25% gay",
            "What about a girl doing things to herself, but using a synthetic male part to do it and not touching her own parts directly?",
            "What the fuck is this post",
            "I dont even have sex with girls anymore because they have sex with men and having sex with men is gay.",
            "how about futa on girl? futas are considered 50% male because of the peepee but it's technically a fully developed girl with tits and vag, so futa on girl would only be 25% of the full gæy",
            "I'm looking for the big gay, just don't tell my family. They aren't ready to know I will be the end of the line for thousands of years of genetics.",
            "guy on guy = 100% gay \n\nguy on girl = 2 tits 1 dick = 50% gay\n\nGirl on girl = 100% gay (obviously)\n\ngirl on trap = 4 tits 1 vagina 1 dick = <25% gay",
            "Your math is wrong. Girl with trap is only 25% gay because traps have both peepee veganas making them half as gay so using the scientific method process of sublimation, it concludes to be the best option so far.\n\nYou just got owned with FACTS and KNOWLEDGE😤😤😡😡😡😵😵😵\n\nEdit: found out there's a difference between traps and futa and got owned by FACTS and KNOWLEDGE 😵🥺🤧",
            "Last night I was looking for some porn of the not gay variety.  Obviously gay porn is gay, so instead I went looking for guy on girl porn. But I realized that features a guy, with a penis, and is therefore 50% gay.  So I started looking for some girl on girl action, till I realized that is lesbian, and is therefore 100% gay. \n\nSo clearly, I had to look into alternative options.  I started to consider hentai: since no one in it is real, it can’t contain guys, so it’s not gay, right? Well, hentai is anime, which not only is gay, but also makes me a weeb. The worst option so far.\n\nI considered traps. I’ve long heard debate over whether traps are gay, so I decided to do the math.  The gayness of traps lies in the premise. Let’s consider the 5 base premises:\n\n1.\t⁠a guy and a trap, where the guy initially thinks he’s with a girl: effectively guy on girl, 50% gay\n2.\t⁠a guy with a trap, and the guy knew it was a trap: Dude looking for some dick, that’s gay\n3.\t⁠a girl with a trap, where the girl doesn’t know it’s a trap: that’s lesbian, and is gay\n4.\t⁠a girl with a trap, where the girl knows it’s a trap: effectively guy on girl, therefore 50% gay Therefore, on average traps are 75% gay, with a minimum gayness of 50%. Not an improvement.  The 5th option, trap on trap, is a singularity of the 4 prior possibilities, and is therefore on average 75% gay again.\n\nSo I got into specifics. What if it was girl on girl, and the premise was at least one of the girls was just bi-curious, and not actually fully lesbian? Well, in that case, their curiosity makes them a cat. Cats are furries, and furries are gay\n\nSo how about a girl soloing? Well that’s a girl touching girl bits. Lesbian and gay.\n\nMy conclusion is that the only way to live a life free of homosexual sin is to liberate oneself of sexual desire at all, and become an asexual.\n\nThanks for coming to my Ted Talk.",
            "Amazing.",
            "I was legitimately just about to watch porn too",
            "How gay is a reverse gangbang with 5 girls and 1 guy?",
            "These percentages are based off logic and reasoning and not actual mathematics.",
            "CUMMY? WHERE ARE YOU?",
            "Or but to the wall and gain your third eye",
            "Asexual here, can confirm this is correct",
            "Where's cummy?",
            "solo masterbation????????????????",
            "solo shows",
            "This should be written in Latin",
            "Repost.",
            "Good twist on a classic pasta",
            "What if it's a trap on a reverse trap?",
            "Its not gay only if its Ricardo",
            "Yes",
            "I like pussy, boss",
            "wouldn’t you have to consider that watching porn takes 3 people? the 2 persons you are watching, and the person who is watching.\n \nNow this changes some stuff since for example wathcing regular porn (guy and girl) is 66% gay when beeing watched by a boy\n and so on.",
            "Well what about futanari?",
            "Surely touching yourself as a man is then gay, as watching a female solo, she is touching lady parts therefore she is lesbian, so you touching yourself, is you touching your subsequent gender parts, therefore you are gay, so the act of masturbation is 100% gay and the minimum gay whilst watching porn is 125% gay, assuming that you watch porn to masturbated and not just for the story",
            "100 girls and one guy so its only 1% gay",
            "I saw this exact same thing a month or 2 ago",
            "Futa least gay since it is 2 girls but one is looking for dick and the futs girl happens to have just that",
            "this entire thread is good.",
            ">Well, in that case, their curiosity makes them a cat. Cats are furries, and furries are gay.\n\n10/10",
            "Wow that just changed my life",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/boat] [This sounds like Dillion’s futa logic](https://www.reddit.com/r/boat/comments/bgu4d8/this_sounds_like_dillions_futa_logic/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Blessed be this post!",
            "Oof",
            "Approved",
            "Just watch solo porn",
            "The last line did it for me.",
            "Interesting.",
            "You are super gay",
            "Wait isn't this a repost?",
            "I disagree. Female masturbation videos are NOT gay. There is no girl on girl action, and it is just someone having sex with themself. If female masturabtion is gay, then male masturbation is also gay, right? According to the Department of Health and Human Services, 92% of males over 13 masturbate. Therefore, if you are a man, which by the nature of your speech I am guessing you are, there is a 92% chance that you masturabte. This chance is increased by the fact that you are watching porn. Therefore, by your own logic, you are in fact gay.\n\n⏩⏪",
            "Watch solo porn ffs",
            "This made my day",
            "read this with videogamedunkey's voice",
            "he's onto something",
            "You were looking for material to touch your penis to. Sorry to tell you, but a guy touching a dick is gay, you were gay from the beginning",
            "Sounds like something I'll type",
            "What about a reverse trap soloing?\n(Woman who looks like a guy put is masturbating lady parts)",
            "Life itself is gay",
            "But if you watched one girl giggle her titties, is that gay? Also, you can be non homosexual and have sex with your wife is that gay? No. Porn is gay though.",
            "This is false because asexuality would require us to reproduce with ourselves, which is big gay. Therefore the only way to rid out selves of homosexuality sin is by killing ourselves. But even then, for men, Satan will waiting to accept us at the doors of death, and that sounds gay to me. At least for men. Women will be able to free themselves of homosexuality sin by killing themselves. Men won't.",
            "Liking girls is gay cuz they like dick and that's gay",
            "[removed]",
            "What if it is 10000000 girls on 1 man. That makes is 0.000025% gay which tends to 0% gay. Therefore a win.",
            "r/FWOB",
            "Repost you bitch, give credit where it is due\n\n[https://www.reddit.com/r/copypasta/comments/a80h2b/porn\\_of\\_the\\_not\\_gay\\_variety/](https://www.reddit.com/r/copypasta/comments/a80h2b/porn_of_the_not_gay_variety/)",
            "Show me anything tangible. I have literal proof of the first instance it ever appeared on the internet, on my profile page linked in an above comment. You have the burden of proof here, you emoji-overusing clownfaced numbskull🤡",
            "eMoJI",
            "asexual here it is very gay",
            "solo female",
            "Being gay isn’t gay according to historians",
            "What about Dick Girls? Girl looking for Dick and involves 0 men.",
            "No more porn for me",
            "Counterpoint: watching as a man, you imagine yourself feeling the things that the man is feeling in the porn. If you imagined yourself as the role of a woman, you would then be a trap, and traps are gay. Logically speaking the porn you are seeking is dudes fucking other dudes",
            "Homophobia is unreal on this post",
            "If your dick gets chopped off, but you still say your a male, what happens then?",
            "Try objects, oh wait, that's pansexual and sausages are cooked on pans and sausages are gay",
            "Lpm Loco no se que tienen en la cabeza los enfermos q escriben esto pero la verdad me hacen el dia che, siempre upvoteando y apoyando a la comunidad copypasta",
            "Basically just kill yourself and then there is no way to be gay",
            "Yes some porn is big gay",
            "OP didn't consider solo girl",
            "If you’re going to steal my post at least fix the formatting error at the end of the traps section you obtuse fat fingered fuckhead",
            "Surely because traps are only half girl, woman on trap is only 25% gay?",
            "Honestly I forget these posts are people typing this and not just a bunch of bots. It surprises me."
        ]
    },
    {
        "post_id": "l8em1n",
        "author": "Zetzun",
        "title": "Did you know a blue whales vagina is so big and deep that it could easily fit 5 to 6 full grown men, making it the second biggest pussy in the world behind people who sold GME stocks this week.",
        "url": "https://www.reddit.com/r/copypasta/comments/l8em1n/did_you_know_a_blue_whales_vagina_is_so_big_and/",
        "score": 10234,
        "num_comments": 95,
        "created_utc": 1611983886.0,
        "selftext": "Did you know a blue whales vagina is so big and deep that it could easily fit 5 to 6 full grown men, making it the second biggest pussy in the world behind people who sold GME stocks this week.\n\n&#x200B;\n\nSource /r/wallstreetbets comment: [https://www.reddit.com/r/wallstreetbets/comments/l8azdz/guy\\_living\\_in\\_his\\_truck\\_update\\_600\\_130k\\_in\\_16/glbklgg?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/wallstreetbets/comments/l8azdz/guy_living_in_his_truck_update_600_130k_in_16/glbklgg?utm_source=share&utm_medium=web2x&context=3)\n\n&#x200B;\n\nPD: Don't give awards, buy GME stock instead.",
        "permalink": "/r/copypasta/comments/l8em1n/did_you_know_a_blue_whales_vagina_is_so_big_and/",
        "comments": [
            "Based?",
            "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡠⠂⠉⠑⠄⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠌⠀⠀⠀⢀⠆⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠄⠒⠀⠒⠀⠀⠠⡀⠀⠀⠀⢠⠊⠀⠀⠀⠀⠂⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠠⠀⠢⡀⠀⠀⠀⠀⠀⠀⠑⠄⢀⠃⠀⠀⠀⠀⠰⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⡐⠁⠀⠀⠈⠂⠄⣀⠀⠀⠀⠀⡄⠌⠀⠀⠀⠀⠀⡆⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠥⡀⠀⠀⠀⠀⠀⠀⠈⠁⠒⡂⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠎⠀⠀⠁⠀⠂⠤⢀⡀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀\n⠀⠀⠀⠸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠐⠎⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⠀⠀⠀⠀\n⠀⠀⠀⠠⠉⠒⠤⢀⡀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⢠⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠐⢀⠀⠀⠀⠀⠉⠐⠂⠠⢤⠤⠀⠀⠀⠀⠀⠀⠀⠀⡘⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠐⠠⡄⣀⠀⠀⠀⠀⡠⠀⠀⠀⠀⠀⠀⠀⠀⢀⠃⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠈⠢⡀⠉⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢼⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠠⢄⡀⠀⠀⠀⠀⠀⢀⠠⠊⢸⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⡀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠃⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠤⠀⣀⣀⣀⣀⣀⣀⡀⠠⠈⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀",
            "Did you 👈 know 💭 a blue 🔵🌊 whales 🐋 vagina 🤰🌮 is so big 🍆 and deep 😱🤤 that it could easily ✅ fit 👕 5 🔳 to 6 🕕 full 🈵 grown 💪 men 👦, making 🖕 it the second 🕑 biggest 😍💫 pussy 🐱 in the world 🌎 behind 👟 people 💑👫 who sold 🌫 GME stocks 💰 this week 🗓.",
            "Robinhood sold my stocks for me though :c",
            "[I found the source](https://www.reddit.com/r/cursedcomments/comments/l8fma9/cursed_stocks/?utm_medium=android_app&utm_source=share)",
            "Bought 3 at 330 average, I'm doing my part, fuck the hedgies",
            " Did you know a blue whales vagina is so big and deep that it could easily fit 5 to 6 full grown men, making it the second biggest pussy in the world behind people who sold Dogecoin this week.",
            "Look, on a serious note, I know people are all about destroying hedgefunds right now, and its not all about profits. But I dont have that luxury, I put my money, I saw growth, and I sold. Maybe its going to rise to $500, maybe even $1000. But some people cant take that risk with the amount of money they put it.",
            "u/captainkevy I salute you sir",
            "⠀⠀⠀⠀⠀⠀⣀⣠⣀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣿⣯⢾⡿⠛⢹⠇⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣿⣏⡟⠀⠀⠈⣟⡌⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀ ⠀⠀⠀⠀⣿⢹⢃⣀⡤⢤⣼⣿⣜⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀ ⠀⠀⠀⢀⡿⣷⣡⠖⢻⣿⢮⣿⣿⣿⠿⣿⣿⡋⣶⡾⣏⣿⢻⣿⣯⡟⢹⣿⣿⡇⠀⠀⠀ ⠀⠀⠀⠈⣱⠏⠘⠂⠘⠭⠚⠉⡿⠇⠀⠙⠓⠉⠱⠛⠋⠁⢸⣿⣿⠇⣿⣿⡟⡇⠀⠀⠀ ⠀⠀⠀⠀⠘⡀⡀⠀⠀⠀⠀⢐⡄⢀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡿⢸⣿⣿⣇⡇⠀⠀⠀ ⠀⠀⠀⠀⠀⠂⠁⠀⠀⠀⠀⠀⠁⠀⠁⠀⠀⠀⠀⠀⠀⢸⣿⣿⣇⢿⣿⣿⣿⠇⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⣀⣠⣤⣤⣤⣤⣤⣍⡅⠀⠀⠈⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠅⠀⠀⠀⢹⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠘⡿⠟⢿⣿⣿⠁⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⠿⢿⠿⠿⠛⠁⠀⠀⠀⠀⢠⡰⢁⢮⡿⠁⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⢣⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣶⣟⠃⣸⠟⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠁⠘⢦⣄⠀⠀⠀⠀⣀⣤⣶⣿⣿⣿⠇⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢷⣶⣶⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢰⣤⣤⣀⠙⢿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⣧⢰⣿⣿⣿⣿⣿⣿⡿⠟⡂⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠸⣬⣛⣛⡻⣻⢟⠛⣛⢋⣍⣥⣶⣷⣿⣇⢀⣴⣶⣶⣶⣶⣿⣿⣿ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠑⠳⢿⡽⠯⢿⡿⣿⠿⠿⠛⠛⠃⠉⠈⣾⣿⣿⣿⣿⣿⣿⣿⣿ ⠀⣀⣀⣀⣀⣠⣴⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣿⣿⠟⠟⠿⠿⠿⣿⣿ ⣿⣿⣿⣿⣦⡻⣿⣷⣦⣤⣄⣀⣀⣀⣀⣀⣠⣤⣤⣶⣶⣿⣿⠿⣻⠋⠀⠀⠀⠀⠀⠀⣸",
            "Wilbur soot fucked a salmon, time for something bigger pfft",
            "Did you know a blue whales vagina is so big and deep that it could easily fit 5 to 6 full grown men, making it the second biggest pussy in the world behind people who sold GME stocks this week.",
            "Third if you count op's mom.",
            "Sir this is a Wendy's",
            "What's all this stocks stuff? What happened?",
            "I this is where I would have kept my stocks. IF I HAD ANY",
            "r/whalecumlore",
            "Based on your fat fucking nuts, OP",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿ ⡟⠛⢻⣿⡟⠛⣿⡟⠛⠛⠛⠛⢻⣿⡿⠛⠛⠛⢻⡟⠛⠛⠛⠛⢻⣿ ⡇⠄⠄⢻⡇⠄⣿⣿⣿⠄⠄⣿⣿⡏⠄⣼⣿⣿⣿⡇⠄⣿⣿⣿⣿⣿ ⡇⠄⣧⠄⠄⠄⣿⣿⣿⠄⠄⣿⣿⡇⠄⣿⣿⣿⣿⡇⠄⣥⣥⣥⣿⣿ ⡇⠄⣿⣧⠄⠄⣿⡟⠛⠄⠄⠛⢻⣷⣄⠈⠙⠛⢹⡇⠄⠉⠉⠉⢹⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿",
            "WE LIKE THE STOCK",
            "What a legend",
            "Larry, I'm on DuckTales",
            "Right after this was a picture of the pokemon kyogre",
            "lol i bought calls on AMC that expired last friday for 7k in tendies off of 410 bucks invested  \n\n\ntechnically speaking, i didn't sell.",
            "Buy dogecoin, shit’s low rn",
            "Did you know :\n\nA blue whales vagina is so big and deep that it could easily fit 5 to 6 full grown men, making it the second biggest cunt in the world behind people who enslave beach bobs permanently",
            "[deleted]",
            "Based",
            "Id fucking buy some if *any of the apps worked and weren't server overloaded Ive been trying for the past 4 days now and its making me feel like shit*",
            "Whales are mammals",
            "i have no words"
        ]
    }
]