[
    {
        "post_id": "fkqa6b",
        "author": "BallHexagonBall",
        "title": "I can't wait any longer for Isabelle's pussy.",
        "url": "https://www.reddit.com/r/copypasta/comments/fkqa6b/i_cant_wait_any_longer_for_isabelles_pussy/",
        "score": 10061,
        "num_comments": 280,
        "created_utc": 1584541388.0,
        "selftext": "Holy fucking shit. There are less than 2 days left until animal crossing comes out on the switch and I can't wait any longer. I need to see Isabelle in 1080P HD 60FPS, and I need to see her NOW. Not only is she the love of my life, but I fucking need more rule 34 of her. There is nothing more fucking hot than Isabelle, and the new game's release will (If my calculations are correct) cause a massive flood of new Isabelle rule 34. I have harassed everyone I've found with an early copy, and I've tried to convince them to give it to me in every way I know. That includes offering my mum's credit card (that's fucking revenge for trying to take away my 3DS you bitch), death threats, begging, and other typically effective means. So if anyone has an early copy, please give it to me. I physically cannot wait any longer for Isabelle. \n\nPlease.",
        "permalink": "/r/copypasta/comments/fkqa6b/i_cant_wait_any_longer_for_isabelles_pussy/",
        "comments": [
            "I want to fuck the doom slayer",
            "What the fuck",
            "Holy fucking shit. There are less than 2 days left until animal crossing comes out on the switch and I can't wait any longer. I need to see Isabelle in 1080P HD 60FPS, and I need to see her NOW. Not only is she the love of my life, but I fucking need more rule 34 of her. There is nothing more fucking hot than Isabelle, and the new game's release will (If my calculations are correct) cause a massive flood of new Isabelle rule 34. I have harassed everyone I've found with an early copy, and I've tried to convince them to give it to me in every way I know. That includes offering my mum's credit card (that's fucking revenge for trying to take away my 3DS you bitch), death threats, begging, and other typically effective means. So if anyone has an early copy, please give it to me. I physically cannot wait any longer for Isabelle. \n\nPlease.",
            "Howy fucking shit. Thewe awe wess than 2 days weft untiw animaw cwossing comes out on the switch and I can't wait any wongew. I need to see Isabewwe in 1080P HD 60FPS, and I need to see hew NOW. Not onwy is she the wove of my wife, but I fucking need mowe wuwe 34 of hew. Thewe is nothing mowe fucking hot than Isabewwe, and the new game's wewease wiww (If my cawcuwations awe cowwect) cause a massive fwood of new Isabewwe wuwe 34. I have hawassed evewyone I've found with an eawwy copy, and I've twied to convince them to give it to me in evewy way I know. That incwudes offewing my mum's cwedit cawd (that's fucking wevenge fow twying to take away my 3DS you bitch), death thweats, begging, and othew typicawwy effective means. So if anyone has an eawwy copy, pwease give it to me. I physicawwy cannot wait any wongew fow Isabewwe. \n\nPwease.",
            "Okay. So, I’ve been seeing this copypasta floating around about wanting to “bang the Animal Crossing dog”, and frankly- I think this is disgusting. First of all, her name isn’t “the Animal Crossing dog”, it’s Isabelle. It’s a beautiful name for a beautiful person, and you would all do well to refer to her as such. If you don’t even know her name, than you have no right wanted to have sex with her! Secondly, wanting to bang her is just gross. Saying that you want to bang Isabelle is objectifying her, and it is not okay. If you’ve ever wanted to bang Isabelle, you should be disgusted with yourself. Unlike you cretins, I however- respect her. Sure, it’s possible I may consider her to be rather bangable, but I wouldn’t dare do such a thing. Isabelle is a fucking queen, and deserves to be treated as such. I DO NOT want to bang “The Animal Crossing dog”. I want to hug her. I want to be in a healthy and loving relationship with Isabelle. I want to wake up every morning in bed, with her lying peacefully next to me as the morning sun shines in through the window. I want to make her breakfast every morning, and tend to her every need. I want her to feel like she is truly loved, (because she is). I want her to be by my side for my whole life, because I know that she is the perfect woman for me, and I am perfect for her. I want to be to be with her every day, just so I can tell her how much I fucking love her. I want her to know how much I adore everything amazing personality, her incredible fashion sense, her extremely impressive caretaking abilities, and her absolutely beautiful head to body ratio, and her beautiful, beautiful eyes. However, if I were to ever have sex with Isabelle, I wouldn’t simply be “banging” her. If Isabelle were to ever consent to me having sexual intercourse with her, it would be tender and loving and passionate. As we make love, I’d slowly and gently caress her soft, golden fur as I slowly but deliberately thrusted into her tight dog pussy. I would make her pleasure my utmost priority, with my own being secondary. But if she was willing, than oh god. What I wouldn’t give to feel her adorable little paws running up and down the length of my shaft. I just wanna pet every inch of her body, and give her scritches on her tummy so she does that thing that dogs do where their legs spaz out. That’d just be so fucking hot. I’d probably end up cumming all over her, so it gets in her fur. But goddamn. I love that fur so much, that I’d personally lick off every last drop of cum, just to I have another opportunity to get as close to her gorgeous fur as possible. But if you just want to bang her, than you are a disgusting degenerate, and I hope you burn in the deepest pits of tartarus. But Digby on the other hand. Now he’s somebody that I’d wanna bang.",
            "Me tooo,send me ASAP!",
            "Didn’t know anyone else felt this way",
            "You have committed a vile sin good friend and for that you must perish",
            "The game actually runs in 30fps retard ☺️☺️😊🙂🥰",
            "Yeah,mee tooo send fast,ASAP!",
            "I'm pretty sure someone ripped her model so ummmn *yeah*",
            "     /  イ                 (((ヽ\n     (  ノ     __🎩_____     Y  \\     \n      | ( \\   (  👁️ 👃👁️)  |   )\n      ヽ ヽ `    (  👄)   _ノ   /\n         ＼   |   ⌒Ｙ⌒   /    /      \n             | ヽ   |   ﾉ ／\n              ＼トー仝ーイ\n                |ミ土彡/             \n                )\\  ° /  \n               (  \\  / )\n              (    ѼΞΞΞΞΞΞΞΞΞΞD💦\n             / /  /  \\ \\ \\ \n           ( (  ).     ) ).)\n           (   ).      ( | |           \n           |  /         \\  |\n          (  ↄↄつ       (  つↄↄ",
            "Holy fucking shit. I want to bang the animal crossing dog so goddamn bad. I can't stand it anymore. Every time I go to the town hall I get a massive erection. I've seen literally every rule 34 post there is of her online. My dreams are nothing but constant fucking sex with Isabelle. I'm sick of waking up every morning with six nuts in my boxers and knowing that those are nuts that should've been busted inside of Isabelle's tight dog pussy. I want her to have my mutant human/dog babies.\n\nFuck, my fucking mom caught me with the neighbors dog. I'd dressed her in my sister's skirt and went to fucking town. She hasn't said a word to me in 10 hours and I'm worried she's gonna take away my 3DS. I might not ever get to see Isabelle again.",
            "The sequel we all wanted",
            "Cock",
            "So this is the sequel to the 'jacking off to Isabelle' copypasta\n\nNeato",
            "Okay. So, I’ve been seeing this copypasta floating around about wanting to “bang the Animal Crossing dog”, and frankly- I think this is disgusting. First of all, her name isn’t “the Animal Crossing dog”, it’s Isabelle. It’s a beautiful name for a beautiful person, and you would all do well to refer to her as such. If you don’t even know her name, than you have no right wanted to have sex with her! Secondly, wanting to bang her is just gross. Saying that you want to bang Isabelle is objectifying her, and it is not okay. If you’ve ever wanted to bang Isabelle, you should be disgusted with yourself. Unlike you cretins, I however- respect her. Sure, it’s possible I may consider her to be rather bangable, but I wouldn’t dare do such a thing. Isabelle is a fucking queen, and deserves to be treated as such. I DO NOT want to bang “The Animal Crossing dog”. I want to hug her. I want to be in a healthy and loving relationship with Isabelle. I want to wake up every morning in bed, with her lying peacefully next to me as the morning sun shines in through the window. I want to make her breakfast every morning, and tend to her every need. I want her to feel like she is truly loved, (because she is). I want her to be by my side for my whole life, because I know that she is the perfect woman for me, and I am perfect for her. I want to be to be with her every day, just so I can tell her how much I fucking love her. I want her to know how much I adore everything amazing personality, her incredible fashion sense, her extremely impressive caretaking abilities, and her absolutely beautiful head to body ratio, and her beautiful, beautiful eyes. However, if I were to ever have sex with Isabelle, I wouldn’t simply be “banging” her. If Isabelle were to ever consent to me having sexual intercourse with her, it would be tender and loving and passionate. As we make love, I’d slowly and gently caress her soft, golden fur as I slowly but deliberately thrusted into her tight dog pussy. I would make her pleasure my utmost priority, with my own being secondary. But if she was willing, than oh god. What I wouldn’t give to feel her adorable little paws running up and down the length of my shaft. I just wanna pet every inch of her body, and give her scritches on her tummy so she does that thing that dogs do where their legs spaz out. That’d just be so fucking hot. I’d probably end up cumming all over her, so it gets in her fur. But goddamn. I love that fur so much, that I’d personally lick off every last drop of cum, just to I have another opportunity to get as close to her gorgeous fur as possible. But if you just want to bang her, than you are a disgusting degenerate, and I hope you burn in the deepest pits of tartarus. But Digby on the other hand. Now he’s somebody that I’d wanna bang.",
            "The game is 30fps lol",
            "HOLY SHIT ITS BALL HEXAGON BALL",
            "Cherry is better",
            "wait is this the continuation from that copypasta of Isabelle hentai?",
            "How is this not NSFW",
            "Hey quick question op, where the FUCK did you find this?",
            "FIRST SCRAP BABY NOW THIS?",
            "Scrap baby is pleased",
            "NTA. I do your mom",
            "I liked it 10 seconds ago before I knew this existed.",
            "me",
            "Oh fuck oh no",
            "I literally IRL actually got a headache reading this.",
            "Cock",
            "Cock",
            "Nintendo ads have evolved",
            "Why the FUCK does this have 4.6k upvotes? Ya'll need to go outsi- oh....oh no...",
            "simp",
            "Tart labia. Crippled cervix. Untapped uterus.",
            "Good God.",
            "The switch is 720p 30fps",
            "Scrap baby is disappointed",
            "Name a better duo, cock and balls\nDo it. I'll wait.",
            "Same",
            "NTA",
            "Isn't this like a second part to the saga? I remember seeing a while back another Isabella copypasta, although it was a bit more graphic..",
            "So I guess his is a sequel to that other copypasta.",
            "cock",
            "Oh no",
            " Oh my god, that's so correct. I need to be able to know how Isabelle feels when she has my hot, dripping cum all over her chiseled features. I want her to be able to suck my dick and enjoy it, I want to fuck her so bad. I wish she could feel how rock-hard I was, so I could get down and fuck her wet pussy. I want to hear her moan with pleasure as my parents watch me and feel no disappointment, as they're stuck with no one to fuck but themselves. I want to eat Isabelle's ass the way I do in my dreams.",
            "Oh hi there Scrap Baby fucker",
            "I want Toy Chica from fnaf 2 (Five Nights at Freddy’s 2) to crush my head with her big, juicy, metallic thighs. I want her to crack my dick and balls with her big robo-coochie. I don’t care what all the other people think, my life’s goal is to be absolutely dominated by this mechanical beauty. Just by a single glance, her hip to waist ratio is that of a goddess. I can just imagine how much pleasure I’ll be in when she squeezes my throbbing meat rod with her cold metal meat grinders. Just when I’m about to bust, I want her to remove her beaks so that way when I receive oral penetration, her gears will grind my cock, and my seed will destroy her internal machinery.",
            "W h y ?  Just w h y,.  I hate this sub",
            "Why is your entire online legacy sex",
            "I FRICKING KNEW THIS WAS A COPYPASTA ACCOUNT.",
            "Hahah- wait my profile picture is Isabelle with a gun",
            "Question: Do you still like Isabelle? Or did you move on to other things like scrap baby?",
            "s t o p",
            "Wait. \"Ballhexagonball\" OH SHIT OH FUCK IT'S HIM RUUUUUUN",
            "What happens when Scrap Baby finds out you are cheating on her?",
            "Isabelle is prety girl",
            "I remember this gut",
            "Agreed",
            "Game",
            "I’ve been playing since yesterday",
            "I  stan the new leaf Isabelle",
            "Oh god... is she even legal age??",
            "Degenerates like you belong on a cross.",
            "god",
            "Why are we here?",
            "I'll never eat pussy again.",
            "# OBJECTIVE: PROTECT AT ALL COSTS",
            "The human eye can only see 30 fps, red flags EVERYWHERE.",
            "is this a sequel to the other isabelle one",
            "Those calculations are indeed correct. But Ankha is the superior waifu.",
            "Nah I'm all about that DOOM FUCKING ETERNAL",
            "Tide yourself over with rule34 of real shibas",
            "I can't wait any longer for Doomguy's dick.\n\nHoly fucking shit. There are less than 2 days left until doom eternal comes out on the switch and I can't wait any longer. I need to see Doomguy in 1080P HD 60FPS, and I need to see him NOW. Not only is he the love of my life, but I fucking need more rule 34 of her. There is nothing more fucking hot than Doomguy, and the new game's release will (If my calculations are correct) cause a massive flood of new Doomguy rule 34. I have harassed everyone I've found with an early copy, and I've tried to convince them to give it to me in every way I know. That includes offering my mum's credit card (that's fucking revenge for trying to take away my 3DS you bitch), death threats, begging, and other typically effective means. So if anyone has an early copy, please give it to me. I physically cannot wait any longer for Doomguy. \n\nPlease.",
            "[deleted]",
            "Oh boy 60fps in 1080,im back in 2004",
            "I'm lost, who is Isabelle? Any photos of her?",
            "u/Quagbot9000",
            "Game\n\nGod\n\nCock\n\nFuck",
            "I thought your waifu was Scrap Baby",
            "omg u cheated on scrap baby",
            "This is low key every single animal crossing player 😂😂😂",
            "[deleted]"
        ]
    },
    {
        "post_id": "hepvq9",
        "author": "Jheme",
        "title": "Wore a mask at Target today",
        "url": "https://www.reddit.com/r/copypasta/comments/hepvq9/wore_a_mask_at_target_today/",
        "score": 10053,
        "num_comments": 167,
        "created_utc": 1592955695.0,
        "selftext": "I wore a mask at Target today. Three of my lungs collapsed as I got carbon monoxide poisoning from breathing in my own bacteria.\nA brave patriot wearing an Affliction shirt, a MAGA hat, and sweet wrap around sunglasses saved me by giving me CPR. I thanked him and asked if he was a doctor and he said \"who needs doctors when we have our fellow Americans, the ones who are here legally I mean.\"\nI hugged him and threw my mask on the ground. The Star Spangled Banner played on the speaker system as everyone in the store ripped off their masks and threw them on the ground, chanting \"down with communism!\" God, Jesus, and all the angels looked down upon us from Heaven and clapped.",
        "permalink": "/r/copypasta/comments/hepvq9/wore_a_mask_at_target_today/",
        "comments": [
            "What is an affliction shirt?",
            "I wore a mask at Target today. Three of my lungs collapsed as I got carbon monoxide poisoning from breathing in my own bacteria.\nA brave patriot wearing an Affliction shirt, a MAGA hat, and sweet wrap around sunglasses saved me by giving me CPR. I thanked him and asked if he was a doctor and he said \"who needs doctors when we have our fellow Americans, the ones who are here legally I mean.\"\nI hugged him and threw my mask on the ground. The Star Spangled Banner played on the speaker system as everyone in the store ripped off their masks and threw them on the ground, chanting \"down with communism!\" God, Jesus, and all the angels looked down upon us from Heaven and clapped.",
            "NTA, your. country your rules.",
            "That patriot’s name? Alfred Eisenhower.",
            "libtards owned 😎😎",
            "I wowe a mask at Tawget today. Thwee of my wungs cowwapsed as I got cawbon monoxide poisoning fwom bweathing in my own bactewia.\nA bwave patwiot weawing an Affwiction shiwt, a MAGA hat, and sweet wwap awound sungwasses saved me by giving me CPW. I thanked him and asked if he was a doctow and he said \"who needs doctows when we have ouw fewwow Amewicans, the ones who awe hewe wegawwy I mean.\"\nI hugged him and thwew my mask on the gwound. The Staw Spangwed Bannew pwayed on the speakew system as evewyone in the stowe wipped off theiw masks and thwew them on the gwound, chanting \"down with communism!\" God, Jesus, and aww the angews wooked down upon us fwom Heaven and cwapped.",
            "I tried wear panties to see if I could try to make through work. I went behind the saw my fan, and was instantly reminded that I will no longer have a cool breeze to breath in, as I had for the past three years. I had a severe panic and combined anxiety attack, after less than one minute I had to flee from the building, just as soon as I grabbed my fan. At Kroger.",
            "Just noticed it says ‘three of my lungs collapsed’",
            "R \\ tahthappened",
            "[deleted]",
            "\"carbon monoxide poisoning from breathing my own bacteria\"\n\nLmao",
            "NTA, stupid games prizes or something",
            "Neil Degrassi Titan enters, barreling through the door in a hurl of sweat staining his signature suit, the tie of which he's loosening to try to help himself catch his breathe, winded from the running and hard to breathru mask, raising his finger he begins to say,\n\n\"Ahctually...\"\n\na subsonic round, .300 blackout fired from an integrally suppressed AR-15 (Armalite American Made) rips through the air yet without breaking the sound barrier landing square on Neil's BLM tie clip. Neil smiles as it ricochets back towards the lone gunman, Donald Trump himself. Barreling towards the chest of Trump, a potential kill shot. However the hot lead, amidst zooming towards his tie, lands exactly on his MAGA tie clip. \n\nRicochet, redirect. Trump smiles, Neil's turns upside down. \n\n5 hours layer, Helicopter's in the air circling the Target. Everyone evacuated by sheer luck via Elon Musk, all except the two Titans. Everyone is still, the only thing in motion being the bullet, volleying back and forth, to and fro, as the two are in the stare down go the millennium. \n\nHour Ten. CNN and Fox News arguing about whose tie clip will give in first, every American tuned in, at the edge of their seats. Nails are being bit, sobbing is contagious, people are placing high stakes bets. Only a few hours pass before those camera news copter's are now relaying the live footage to the whole world: this has become a matter of international investment. The UN emergency meeting has all countries leaders arguing over what to do.\n\n3 days have passed now but it's as if its been an eternity yet paradoxically as if no timed passed because nothing has changed. It is a perpetual game on Pong.\n\nJoe Biden is watching from his home, alone while snaking on some kettle corn. The type that is a mix of candied Carmel and cheddery cheese. Just like the green M&Ms, he throws the undesirable kernals, the inferior cheddar, behind his head so that he can focus on the Carmel. His sense of taste is the only sense he's able to focus on. Thus he cannot feel the cold steel barrel of the 1911 pressed to the back of his head.\n\nA trigger is pulled, the TV before him is painted red. Smoke from the barrel begins to dissipate revealing the figure behind his now limp body. Adorning a smile, it's Hillary. She stares into the blood spattered TV watching the bullet pass back and forth from the two men's tie clips.\n\nShe smile's wider, some blood freckling her face while her eyes are lit up by the bright tv. She stands silently in the dark until she said silence is broken,\n\n\"It's all going according to plan.\"\n\nWiping the blood of of her face while she beings to chuckle, the chuckling turning to hysteric laughter as she points the 45 caliber pistol at the TV. A gunshot. Complete darkness. Chaotic laughter. Then silence. The sound of a door is opened. Slight light flashes. The sound of a door is closed. Darkness Once More.",
            "A woman said the \"breathing in your own bacteria\" because i made her wear a mask at my job. I turned around and walked away when she said that. So seeing this post is highly amusing.",
            "3 lungs",
            "“Three of my lungs”",
            "What are you a space maine 3 lung headass",
            "TL;DR I came to scat man porn",
            "Countdown to when Fox News unironically uses this in a news report, beggining now",
            "every karen ever",
            "[https://voca.ro/gKxONdz5Zbo](https://voca.ro/gKxONdz5Zbo)",
            "3 lungs?! HOW?!",
            "It's true I was the Target",
            "This is unironically epic",
            "This but unironically",
            " I wore a mask at Target today. Three of my lungs collapsed as I got  carbon monoxide poisoning from breathing in my own bacteria. A brave  patriot wearing an Affliction shirt, a MAGA hat, and sweet wrap around  sunglasses saved me by giving me CPR. I thanked him and asked if he was a  doctor and he said \"who needs doctors when we have our fellow  Americans, the ones who are here legally I mean.\" I hugged him and threw  my mask on the ground. The Star Spangled Banner played on the speaker  system as everyone in the store ripped off their masks and threw them on  the ground, chanting \"down with communism!\" God, Jesus, and all the  angels looked down upon us from Heaven and clapped",
            "NTA it was your masks fault",
            "God Bless.",
            "Is affliction a maga thing now?",
            "clapping really is a power play",
            "It’s true. I was there. I was god",
            "trump",
            "I like the carbon monoxide touch, since anyone who says this or something similar UNIRONICALLY has no idea of the difference between carbon dioxide and monoxide",
            "Ok",
            "ꜗꜗ",
            "Braindead liberals and their fun. Lol"
        ]
    },
    {
        "post_id": "flltd0",
        "author": "None",
        "title": "We have ALWAYS had more subscribers than OKBR.",
        "url": "https://i.redd.it/kz48z4u19qn41.png",
        "score": 10042,
        "num_comments": 255,
        "created_utc": 1584666439.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/flltd0/we_have_always_had_more_subscribers_than_okbr/",
        "comments": [
            "I'm subscribed to both 😳😳😳😳",
            "[deleted]",
            "is this sub enemies with okbr? had no idea",
            "We have ALWAYS had more subscribers than OKBR.",
            "okbuddyretard mod here\n\nL L L L L L L WE ARE BETTER THAN YOU L L L L\n\nLMAO YOU MAD CUZ I DIDNT ACCEPT YOUR WEIRD MODMAIL MOD APPLICATION LMAO L L L L",
            "What do you mean okbr?\n\nNothing called okbr has ever existed",
            "Pewdiepie fans don't count. We still have more subs than OKBR.",
            "We have ALWAYS had more subscribers than OKBR.",
            "Username's first letter checks out.",
            "Guys plz stop abusing cummy 🥺🥺🥺",
            "[deleted]",
            "Retarded okbr banned me afyer ive waited for over 67 days to post their 😠😠🤬🤬",
            "very double plus good",
            "[deleted]",
            "Is...\n\nIs this an r/copypasta IngSoc logo?\n\nAlso why do I know that?",
            "massive references of 1984. i love it.",
            "Like Vietnam with JOHNNY CASH CHEESE MARKET",
            "what is OKBR?",
            "Not anymore😡",
            "Petition to make this the new sub logo.",
            "Ok buddy retard? Isn’t that the sub \nPewdiepie (Felix Kjellberg)\nreviewed and made really big?",
            "Strong and peaceful, wise and brave,\nFighting the fight for the whole reddit to save,\nWe the users will ceaselessly strive\nTo keep our great subreddit alive!\nUnfurl the banners! Look at the screen!\nNever before has such glory been seen!\n\nCopypasta! Copypasta! Copypasta, 'tis for thee!\nEvery shit, every post, 'tis for thee!\nEvery shit, every post, 'tis for thee!\nEvery shit, every post, 'tis for thee!\"",
            "CTRL+V",
            "c*m",
            "Ctrl+V squad checking in",
            "Ingsoc, huh?",
            "/unreterd but where can I learn second aid 😳😳",
            "ALL HAIL BIG CUMMY 😫",
            "r/copypasta in 1 year:\n\nWe had to change the neon sign outside our house from saying \"We've ALWAYS had more subscribers than OKBR\" to \"We've NEVER had more subscribers than OKBR \", and then we had to throw that sign in the garbage because it was inaccurate. We've had more subscribers than OKBR in the past; We just didn't at the moment.",
            "Epic",
            "Allah is displeased with you! Repent!",
            "Cock",
            "bruh I thought this was the Fakku logo at first glance",
            "Hey this guy used to post on r/chapotraphouse",
            "Why would we not have more subscribers than OKBR? I can’t even imagine them having more than us. Glory to the mods!",
            "OKBR is a fucking cesspool",
            "This is all poopiepies fault 🤬🤬🤬🤬🤬🥴🥴🥵🥵🥵🥵🥵",
            "No.",
            "Doubleplus good",
            "/unretard for a sec who the fukk are yo",
            "CUM IN MY AS \nHAHAH SEEEEES I A. M FUNNY\nNa but fr I like both. Both are my fav subs.",
            "Ok",
            "OkayBattleRoyale",
            "INSOG PASTA\n\nINSOG PASTA",
            "Pewdiepie is a homersexyal. Praise allah",
            "why fight",
            "Aren't they the same sub lol\n\nIdiot",
            "I unsubbed because it was just painful.",
            "OMG COPYPASTA HAS MORE SUBSCRIBERS THEN OKBR.",
            "Reminds me of city 24",
            "COPY PASTA ‘TIS FOR THEEE\n\nEVERY DEED\n\nEVERY THOUGHT\n\n‘TIS FOR THEE",
            "The v looks like Ingsoc's logo from 1984",
            "the thought police wants to know your location",
            "Thus should be the background image for this sub",
            "This is some epic Oceania shit",
            "What the fuck is an OKBR",
            "OKBR stopped being funny as all shit the moment kirbizia left, I went on there right before the whole pewdiepie thing and I could not bring myself to laugh at one of the jokes in there",
            "Cock and balls",
            "Hey guys, welcome to TOP 10 PLANETS ON EARTH!\n\n1. New york\n2. Aphganstan\n3. Cambodia\n4. Nepal\n\nanyway thats it guys thank you so much for wtching if we hit 15 THOUSAND LIKES! we will DO A GIVEAWAY of 15 gift cards! Leave your name down below and comment why you should get a GIFT CARD!",
            "/unretard that looks a lot like the ingsoc logo whats up with that",
            " arent they the same place b where am i help",
            "k",
            "I fail to comprehend the point of this post, please enlighten me",
            "What’s OKBR?",
            "[deleted]",
            "OKBR does not have cummy so we are always more epic 👍👍👍",
            "Why is a white hand shaking a black hand, not very gamer of you",
            "What's OKBR?",
            "[deleted]",
            "now okbr has more subscribers than us"
        ]
    },
    {
        "post_id": "nsho4u",
        "author": "GreenLavaBubble_73",
        "title": "A girl in our class whatsapp group said copypastas dont affect her and the quiet kid wrote this out by hand",
        "url": "https://www.reddit.com/r/copypasta/comments/nsho4u/a_girl_in_our_class_whatsapp_group_said/",
        "score": 10030,
        "num_comments": 208,
        "created_utc": 1622846970.0,
        "selftext": "The art of the copypasta is an ancient technique used by multiple generations across the world. It is a staple of mocking culture, a cornerstone. You're saying that, because \"it's a secondhand insult, it does not affect me\". Do I need to tell you how stupid that statement that is? Do you know how politicians get their votes halved? Exactly, by the media. \"B-b-but how does the media do this?????\" I hear you ask. Well, they use their own words against them. Just because you said something doesn't mean you are ''immune'' to any insult involved with that saying. Your pathetic little brain isn't able to even comprehend basic karma and I do not have a smidge of empathy for your inevitable failure in life. The author of a terribly written book is never immune to criticism. \"Well, they spent a lot of time into writing the book so-\" Shut Up. No. The mere cringe I experience when you speak using that voice of yours and its very own screeching nagging tone is close to infinite. The sheer inability of your mind to get a grasp of modern culture and society is a massive red flag involving all your future interactions with actually competent beings. I actively yearn for the day that your IQ surpasses 7 but alas, it'll sadly never happen.\n\nKind Regards, \n\nme",
        "permalink": "/r/copypasta/comments/nsho4u/a_girl_in_our_class_whatsapp_group_said/",
        "comments": [
            "What did she say back?",
            "wtf why are you talking about copypastas with normal irl people",
            "\n\n>be McDonald's\n\n>finally release the Mcdonald amogus meal\n\n>be me\n\n>like amogus (not sus OK)\n\n>ask mommy to get me some mcds or I throw my  poop socks at her \n\n>mfw she agrees \n\n>she gets me 1 amogus meal with extra dip \n\n>mfw when there's something on the pack \n\n> it says \"time to play amogus there are 10 nuggies in this pack and one of them is laced with cyanide, let the games begin\" \n\n> youwotmate.mkv \n\n>decides to take a chance and eat it \n\n>mfw I take the first bite \n\n>it's good but it's a bit sussy..... \n\n>tfw I drop dead \n\n>walterwhitefalling. Jpeg \n\nAnons be careful the amogus meal is pretty sus.",
            "I rate this post 8 out of 10.\n\nI have rated 1 of your posts so far, with a total score of 8.",
            "The art 🎨 of the copypasta 🍝 is an ancient 📜 technique 🥋🤹 used 🎶 by multiple 🍼🐦👶🏻 generations 👶 across ✝ the world 🌎. It is a staple 😱‼🔥 of mocking 🤡 culture ⛩, a cornerstone. You're saying 🗣 that, because \"it's a secondhand 👊 insult 🎢🚫, it does not affect 🤭 me\". Do I 👥 need 👉 to tell 🗣 you 👈 how stupid 📖🚫 that statement 🇺🇸 that is? Do you 👤👈 know 🚫🤔 how politicians 🇺🇸 get 🉐 their votes 🗳 halved? Exactly 👌, by the media 💦. \"B-b-but how does the media 📞✈⛵ do this?????\" I 👁 hear 👂🖐 you 👉🏻 ask 🙏. Well 😤, they use 🏻 their own words 📓 against 🚫 them. Just because you 🤦👉😟 said 💬 something 😅 doesn't mean 😏 you 👉 are ''immune'' 😷 to any insult 🎢🚫 involved 👨‍❤️‍👨 with that saying 🗣. Your 👉🤴 pathetic 😂 little 👌 brain 🧠 isn't able 💪 to even 🌃 comprehend 🤓 basic 🚂 karma 👆 and I 👁 do not have a smidge of empathy 👍 for your 👉 inevitable 😳😱😨 failure ❌ in life 💓. The author ⚪⬜◻ of a terribly 👎 written ✒🖌 book 📚 is never ❌ immune 🤮 to criticism 🤔. \"Well 😤, they spent 😵 a lot 🍑 of time 🕐 into writing ✏ the book 🎒📚 so-\" Shut 😷🤫 Up ⬆🔝. No ⚠🚫. The mere 😐 cringe 😳 I 👥 experience 🍆 when ⏰ you 👈👤 speak 🙅♂🗣 using 🏻🤳 that voice 🔊 of yours and its very 👌 own screeching 😱 nagging tone 🍺 is close 🚫 to infinite 🔁. The sheer 😔😍🙁 inability of your 👉 mind 🤯 to get 🉐 a grasp ✊💪😫 of modern 🕸 culture ⛩ and society 👥 is a massive 🌐❎ red 🔴 flag 🇺🇸 involving 👐🔟 all 😤 your 👉 future 📅 interactions 🍆 with actually 😳 competent beings 👍💦. I 👁 actively 🏃🏻 yearn 😣 for the day 📆💉 that your 👉 IQ 🤓 surpasses 💀 7 💪😂 but 🍑 alas 😫, it'll 💖🤔 sadly 😭 never 🚫 happen 😱.   \n  \nKind 🙁 Regards 🤔❤,   \n  \nme",
            "The awt of the copypasta is an ancient technique used by muwtipwe genewations acwoss the wowwd. It is a stapwe of mocking cuwtuwe, a cownewstone. You'we saying that, because \"it's a secondhand insuwt, it does not affect me\". Do I need to teww you how stupid that statement that is? Do you know how powiticians get theiw votes hawved? Exactwy, by the media. \"B-b-but how does the media do this?????\" I heaw you ask. Weww, they use theiw own wowds against them. Just because you said something doesn't mean you awe ''immune'' to any insuwt invowved with that saying. Youw pathetic wittwe bwain isn't abwe to even compwehend basic kawma and I do not have a smidge of empathy fow youw inevitabwe faiwuwe in wife. The authow of a tewwibwy wwitten book is nevew immune to cwiticism. \"Weww, they spent a wot of time into wwiting the book so-\" Shut Up. No. The mewe cwinge I expewience when you speak using that voice of youws and its vewy own scweeching nagging tone is cwose to infinite. The sheew inabiwity of youw mind to get a gwasp of modewn cuwtuwe and society is a massive wed fwag invowving aww youw futuwe intewactions with actuawwy competent beings. I activewy yeawn fow the day that youw IQ suwpasses 7 but awas, it'ww sadwy nevew happen.\n\nKind Wegawds, \n\nme",
            "Yeah I call bullshit",
            "Why do I feel like this copypasta would be written on hundred year old parchment with an overly large feather quill in cursive?",
            ">they spent a lot of time into writing the book\n\nCan people stop fucking talking like this? You put time into writing. You spend time writing. You don't spend time into. \n\nSame type of shit as \"how it looks like.\" Like is redundant, stop putting it there. \"How it looks\" implies the existence of the \"like\" because it's a relative statement.",
            "holy shit, has this person ever left their room?",
            "I see a dried teardrop on that handwritten letter, but he killed her",
            "holy shit its me when mega man maker discord server",
            "我們班whatsapp組的一個女孩說copypastas不會影響她，安靜的孩子手寫了  \ncopypasta 的藝術是一種古老的技術，被世界各地的幾代人使用。它是嘲弄文化的主要內容，是基石。你這麼說是因為“這是二手侮辱，它不會影響我”。我需要告訴你那句話有多愚蠢嗎？你知道政客如何讓他們的選票減半嗎？沒錯，是媒體報導的。 “B-B-但是媒體是怎麼做到的？？？？”我聽到你問。好吧，他們用自己的話來反對他們。僅僅因為你說了一些話並不意味著你對任何與這句話有關的侮辱“免疫”。你可憐的小腦袋連基本的業力都看不懂，我對你人生中不可避免的失敗沒有一絲同情。一本寫得很糟糕的書的作者從來都不會受到批評。 “嗯，他們花了很多時間寫這本書，所以——” 閉嘴。不。當你用你的聲音說話時，我感受到的僅僅是畏縮，它自己的尖刺嘮叨聲幾乎是無限的。你的頭腦完全無法掌握現代文化和社會是一個巨大的危險信號，涉及你未來與真正有能力的人的所有互動。我積極地渴望你的智商超過 7 的那一天，但遺憾的是，它永遠不會發生。  \n親切的問候，  \n我",
            "NICE looking jar of semen, seems like it's starting to dry up though. Make sure you keep it in the fridge to keep it nice and humid/colder so it doesn't dry up or mildew. Keep collecting bro! *cow noises*",
            "Lol this is so poorly written kid had to be 10 years old.",
            "At the end, you should switch the words \"sheer\" and \"mere\". It would make more sense and be more poignant",
            "The art of the copypasta is an ancient technique used by multiple generations across the world. It is a staple of mocking culture, a cornerstone. You're saying that, because \"it's a secondhand insult, it does not affect me\". Do I need to tell you how stupid that statement that is? Do you know how politicians get their votes halved? Exactly, by the media. \"B-b-but how does the media do this?????\" I hear you ask. Well, they use their own words against them. Just because you said something doesn't mean you are ''immune'' to any insult involved with that saying. Your pathetic little brain isn't able to even comprehend basic karma and I do not have a smidge of empathy for your inevitable failure in life. The author of a terribly written book is never immune to criticism. \"Well, they spent a lot of time into writing the book so-\" Shut Up. No. The mere cringe I experience when you speak using that voice of yours and its very own screeching nagging tone is close to infinite. The sheer inability of your mind to get a grasp of modern culture and society is a massive red flag involving all your future interactions with actually competent beings. I actively yearn for the day that your IQ surpasses 7 but alas, it'll sadly never happen.\n\nKind Regards, \n\nme",
            "Truly a cultured boy",
            "Reddit",
            "This is the most pathetic thread I have ever seen. Yet I’m enthralled.",
            "What a damn genius",
            "I love copy pastas. Spamming them on Twitch with words like pogger and kekw is the coolest thing.",
            "Okay, please forgive me this, but I truly dont know what a copypasta is and why some person should or should not be offended by it? I did like the *quiet-guy's* rebuttal though, even though I don't know what he was talking about. Hes going to go far.",
            "Holy shit, if that was ironic hats off to them. If it wasn’t Jesus Christ they need help.",
            "10/10",
            "are you the quiet kid?",
            "What I have a really hard time believing is that the WHOLE CLASS has a Whatsapp group chat?? I honestly cannot tell if this is real or not lmfao I'm prob a dumbass",
            "Sounds like something out of a fight from Jojo",
            "[removed]",
            "dear god",
            "Redditors when a normal person says they are annoying",
            "That is fucking cringe",
            "Ten years ago a crack commando unit was sent to prison by a military court for a crime they didn't commit. These men promptly escaped from a maximum security stockade to the Los Angeles underground. Today, still wanted by the government, they survive as soldiers of fortune. If you have a problem and no one else can help, and if you can find them, maybe you can hire the A-team.",
            "I hate people like him"
        ]
    },
    {
        "post_id": "sdxmkl",
        "author": "susdragon",
        "title": "Schödinger's Blowjob",
        "url": "https://www.reddit.com/r/copypasta/comments/sdxmkl/schödingers_blowjob/",
        "score": 10024,
        "num_comments": 363,
        "created_utc": 1643287724.0,
        "selftext": "Imagine you're blindfolded and you're getting the best raw pornstar-grade blowjob in the entire universe. The catch is, however, that you'll never figure out who's giving you that god-tier awesome schmösome sloppy toppy unless you take the blindfold off. It could be anybody, Ariana Grande, Ben Shapiro, Harold from the 7-11 near my house, or even your uncle's neighbour's fireman's cat. Now the question is: would you take off the blindfold and find out who the person/thing behind the stupendous jimmy-nibbler is and risk permanently scarring yourself, or would you keep the blindfold on and continue having your knob slobbed till your spirit hits the sky?",
        "permalink": "/r/copypasta/comments/sdxmkl/schödingers_blowjob/",
        "comments": [
            "The answer is obvious, take the blindfold off right  after you finish to maximise the PTSD",
            "Lovecraft moment",
            "#O CUMMY, WHERE ART THOU??",
            "Cummy please I need to copy this",
            "Please put an NSFW tag on this. I was on the train and when I saw this I had to start furiously masturbating. Everyone else gave me strange looks and were saying things like “what the fuck” and “call the police”. I dropped my phone and everyone around me saw this image. Now there is a whole train of men masturbating together at this one image. This is all your fault, you could have prevented this if you had just tagged this post NSFW",
            "Ignorance is bliss, who cares, it was a beautiful fucking bj.",
            "Should we tell OP about glory holes?",
            "It’s probably not the cat, cats have little spikes called papillae on their tongues",
            "The thing is, quantum mechanics has no intuition to it. The macroscopic world we live in doesn’t provide an analogue to the quantum world. Thus, we must merely accept the strangeness of it and study the subject from there. \n\nFor example, is an electron a particle or a wave? Is it both? No, it’s just an electron. We don’t need to macroscopic concepts for us to study and understand it’s function. \n\nSchrödinger’s equation states that we cannot know exactly where an electron with a certain energy level is, only the probability of us observing it somewhere in space relative to another coordinate. So a similar model must be constructed for the blowjob scenario, we cannot know who might be performing the action, but merely the probability of who it may be. \n\nPerhaps the probability is extremely low, but the most preferred observance of who is performing the blowjob would most definitely be Erwin Schrödinger himself.",
            "[deleted]",
            "Where is cummy!?! I need cummys cum!!",
            "Well, I would take it off, nothing really emotionally scars me anymore.",
            "So the Blowjobbist is completely silent, no moaning, no noises? Fuck it. I'll take an A+ stealth BJ from Ben.",
            "First time looking through the comments: what the fuck is a cummy",
            "I uhhh I think I've had enough Reddit for today.",
            "Just stopping by to say kudos on \"jimmy-nibbler.\" Carry on.",
            "I'd keep it on.. damn what if it's shrek 😧",
            "Take it off, so you know who to go back to for more. A mouth is a mouth.",
            "Where did cummy go ?",
            " Cummypasta",
            "I would recognize a bj from my relatives, Arianna, Ben, and the local pets,  so it must be from Harold. GGEZ.",
            "schrodinger's satire: whenever someone begins telling a \"schrodinger's [blank]\" joke, their mind enters a quantum superposition in which they both do and do not understand Schrodinger's box, and only once they finish the joke will you know they do not.",
            "> fireman's cat,  \n\nbut that sandpaper tongue...",
            "So...glory hole? I mean this concept already exists lol.",
            "It's a scientific fact that people with dicks give better head than people without dicks. If you have one of your own, you'll better understand how to satisfy someone else's. If you were born without a penis, your head can only ever be good, never phenomenal. Sorry, but that's facts.",
            "How bad could it be, honestly. Unless it's someone with a mouth disease",
            "Nah I’m good on knowing who but I’m hoping it’s Ben Shapiro",
            "my friends exact words: second option hoping it's harold tho.\n\nwhen i asked why: sounds like a cool dude.\n\nmy other friend chimed in: i think i would keep the blindfold cause it might be awkward to talk about them.\n\nmy first friend: but like  \ncould be harold\n\nmy second friend: yeah  \nstill. i'll keep you updated if this continues.",
            "[removed]",
            "There needs to be a Heisenberg aspect to this- you can either get the blowjob, or know who is giving it to you, but not both. In other words, if you take the blindfold off, no more playing the bone flute.",
            "Well it probably will be my homie so doesn't matter",
            "⬤▅▇█▇▆▅▄▄▄▇",
            "Why would your uncle have a different fireman than his neighbor?",
            "Someone's obviously never felt the sweet kiss of a 5:00 shadow on their nutsack.",
            "See no evil, speak no evil, hear no evil, get a hummer from no evil.",
            "Love the mystery. Keep the blindfold on",
            "But it could be OPs mom too",
            "A wise man once told me never \"pass on a knobber, you'll miss a good one\".  I live by that.",
            "First rule of the Gloryhole. Never look behind the hole.",
            "i wish i had a dick to experience such a BJ…",
            "Why is it the first word I noticed was \"Ben Shapiro\"",
            "Ben Shapiro Ben Shapiro pleeease be Ben Shapiro 😫😫😫",
            "Blow is a blow. And sometimes guys would be best. Id take it off",
            "Remember that school event where the kids are blindfolded and they made out with their parents? Pepperidge Farm remembers.",
            "Why isn't this a poll?",
            "Obama?",
            "oh",
            "[cum nut fuck nut lube](https://paste.ee/p/6tZjN)",
            "\\*Laughs in The Shining\\*",
            "Sloppy toppy",
            "Knob cheese",
            "Bro keep it why would you care who it is if its good",
            "Who knew glory holes had such philosophical implications",
            "May or may not been there .  May or not have done that.",
            "Idc I’m bi",
            "As long as it’s nobody I care about I think I’ll be okay",
            "Am I missing something? You're talking about glory holes right?",
            "Imagine shindler giving a BJ",
            "Keep it on. It's obviously Natalie imbruglia",
            "I'd finish then look, then get their digits",
            "reach for the sky!",
            "#ben",
            "Keep it on, I can get alot of amazing BJs, and be blindfolded. Kinky",
            "I'd take it off. I'm bi so it doesn't matter who it is, I'll give them my number.",
            "If I were blindfolded and some hot naked boob was licking my dick without an audible sound I would pull off my blindfold as soon as I realized it was the naked boob licking me.",
            "Y’all know what captain Riker would do mmhmm",
            "Who has a personal fireman?",
            "Well, I think I'd be able to figure out if it was a cat, so unless it's my parents I don't think I'd ever be scarred by what I saw. Totally taking off the blindfold",
            "Keep it on fuck it",
            "To job or to not to job is the answer",
            "I think I need to take the rest of the day off to comprehend this post.",
            "this particular scenario reminds me of that one (abjectly horrific) strip from oglaf",
            "HELL YES I WOULD DO/GO FOR THAT UNLESS I SAW A TOOTHLESS HOOD RAT GIVING ME THE KNOB SLOBBERING  WHICH  THE TOOTHLESS PART MIGHT JUST POSSIBLY MAKE THE FEELING EVEN BETTER",
            "How about I come so hard, I die at the very moment?",
            "First of all,  ill try try to figure out if it's a guy or a girl.\nThen if i feel that's a guy i'm keeping the blindfolds on. If it's a girl i'll try to figure out if it's someone familiar or not. They propably will have characteristic touch or may make a characteristic noise.\nIf nothing works i'll ask them. If they don't answer then i will take the blindfolds off.",
            "It would be pleasure to get blowed from Ben Shapiro.",
            "Ben Shapiro or Arianna Grande?\n\nI call that a win win",
            "Ya'll are a bunch 'O pothead aren't you? 🤣🤣🤣",
            "I would, I mean, come on! Of the blow job was that damn good, it wouldn't matter to me what sex the person was. I love my cock being sucked....period 😋",
            "\"MOM????\"",
            "Average coomer",
            "YTA, no sloppy toppy until marriage",
            "ofc id take off the blindfold, new girlfriend or boyfriend if they can give that good of a bj",
            "OFF NOW",
            "Thats just a gloryhole",
            "This is sum red pill blue pill shit right here"
        ]
    },
    {
        "post_id": "nczmx8",
        "author": "icallthissupersex3",
        "title": "Masturbation is more gay than having another male give you a handjob",
        "url": "https://www.reddit.com/r/copypasta/comments/nczmx8/masturbation_is_more_gay_than_having_another_male/",
        "score": 10023,
        "num_comments": 193,
        "created_utc": 1621087545.0,
        "selftext": "Now hear me out. When masturbating you're essentially both giving AND receiving a handjob at the same time from a guy. That’s pretty fucking gay if you ask me. Now say you see a cute guy, his ass is so fucking nice and slappable, his juicy feminine lips look like they were made to be wrapped around your cock, and his hands are soft and slender, maybe even more so than your own (thereby making it even less gay). You make your move and he agrees to give you a handy. In this case, you’re simply receiving a handjob, you aren’t giving one as well. That’s half the gay, guys. Stop masturbating, it’s gay as fuck. Get yourself a man that’ll give you a hand. \n\nP.S. if you do decide to give him one back in return because his beautiful, glistening, throbbing cock is just sitting there asking to be stroked, just make sure he’s somewhat more feminine than yourself because technically, giving and receiving a handjob from someone more feminine is less gay than someone who is more masculine (yourself).\n\nEDIT: would giving AND receiving a handjob from a male be equivalently/less gay than just receiving OR giving a blowjob?? Please let me know because I’m no gayer than the average straight man who indulges in masturbation but I really, really want to suck my friend’s cock.",
        "permalink": "/r/copypasta/comments/nczmx8/masturbation_is_more_gay_than_having_another_male/",
        "comments": [
            "What if I use my ass as a pussy? That's straight right? I'm imagining it's a girls hole so not gay",
            "NTA, friend needs to learn to share",
            "He’s got a point",
            "penis 🍆 penis 🍆 penis 🍆🍌 penis 🍆 penis 🍆 penis 👀🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍒🍆 penis 🍆 penis 🍆 penis 🍆😱 penis 🍆🤭 penis 🍆 penis 🍆🌽♂ penis 🍆 penis 💦🍆 penis 🍌👀 penis 🍆😤 penis 🍆 penis 😛🍆 penis 🍆 penis 🍆 penis 🍒🍆 penis 🍼🍆 penis 🍆😛😉 penis 🍆 penis 🍆 penis ❓🍆⁉ penis 🍆👀 penis 🍌🍆 penis 🍆 penis 🍆🍌🥒 penis 🍆 penis 🍆 penis 🍆 penis 👀🍌 penis 🍆💦 penis 👀🍆 penis 👀 penis 🍆 penis 🍌🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍒🍆 penis 🍆 penis 🍆 penis 🍆🍌 penis 🍆 penis 🍆 penis 👀 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 👀 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆🍌 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 👀 penis 🍆 penis 🍆🍌 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆😛😉 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 👀👽 penis 👽🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆 penis 🍆💦 penis 🍆 penis 🍆😱 penis 🍆 penis 🍆 penis 👀🍆",
            "Imma post this on r/unpopularopinion",
            "Now hear 👂 me out. When ⏰ masturbating 🍆 you're essentially 🔝 both giving 🎁 AND receiving 📲 a handjob 👉👌 at the same time 🕐 from a guy 👨👦. That’s pretty 👰 fucking 🍆 gay 🏳️‍🌈 if you 👈 ask 🙏 me. Now say 👱🏿💬🙈 you 👉 see 👀 a cute 😏 guy 👨, his 💦 ass 🍑 is so fucking 💦🍆 nice 🔥 and slappable, his 💦 juicy 🍹 feminine 💄💃 lips 👄⬆⬇ look 👀 like 👍 they were made 👆👑 for to be wrapped 🎁 around 🔃 your 👉 cock 🍆, and his 💦 hands 👋 are soft 🐇 and slender, maybe 🤷‍♀️ even 🌃 more so than your 👉 own (making 🖕 it even 🌃 less ➖ gay 🏳️‍🌈). You 👈 make 💘 your 😈👉 move 📦 and he 👨 agrees 👍 to give 👉 you 👈 a handy 😂♿✋🏿. In this case 💼, you’re simply 🔢 receiving 😹😆 a handjob 🙀✊, you 👈 aren’t giving 👉 one ☝🏻 as well 😤. That’s half 💀 the gay 🌈, guys 👨. Stop ✋👆 masturbating 👶🏼, it’s gay 🏳️‍🌈 as fuck 🖕👦. Get 🉐❌ yourself a man 👨 that’ll give 👉 you 👈 a hand ✋.   \n  \nP.S 🅰. if you 👈 do decide 🤔 to give 🎁 him 👴 one 😤 back ⬅🔙 in return ↪ because his 💦 beautiful 😍, glistening 😎👦, throbbing 💢 cock 🍆 is just sitting 🚽 there asking 🙏 to be stroked ✊, just make 💘 sure 👍 he’s somewhat 💩 more feminine 💄💃 than yourself because technically 🔧❌, giving 👉 and receiving 📫 a handjob 🙀✊ from someone 👤 more feminine 💄💃 is less ➖ gay 🔹🌈 than someone 👤 who is more masculine 💪🍆👀.   \n  \nEDIT 📝: would giving 👉 AND receiving 📫 a handjob ✊ from a male 👦 be equivalently/less gay 🏳️‍🌈 than just receiving 😹😆 OR giving 🎁 a blowjob 🌬👅🐡?? Please 🙏 let 🙆 me know 💭 because I’m no 😣 gayer than the average 💰 straight 📏↔ man 👨 who indulges 🙃 in masturbation 🍆 but 🤔 I 👁 really 😍, really 💯💀 want 😍 to suck 😜💦 my friend’s cock 🍆🌽.",
            "[removed]",
            "If it’s double the gay then it cancels each other out, elementary stuff",
            "This makes sense. Why does this make sense",
            "Wait, you masturbate with your hand? I just use my mouth",
            "Masturbation is more gay than having another male give you a handjob\n\nNow hear me out. When masturbating you're essentially both giving AND receiving a handjob at the same time from a guy. That’s pretty fucking gay if you ask me. Now say you see a cute guy, his ass is so fucking nice and slappable, his juicy feminine lips look like they were made to be wrapped around your cock, and his hands are soft and slender, maybe even more so than your own (thereby making it even less gay). You make your move and he agrees to give you a handy. In this case, you’re simply receiving a handjob, you aren’t giving one as well. That’s half the gay, guys. Stop masturbating, it’s gay as fuck. Get yourself a man that’ll give you a hand. \n\nP.S. if you do decide to give him one back in return because his beautiful, glistening, throbbing cock is just sitting there asking to be stroked, just make sure he’s somewhat more feminine than yourself because technically, giving and receiving a handjob from someone more feminine is less gay than someone who is more masculine (yourself).\n\nEDIT: would giving AND receiving a handjob from a male be equivalently/less gay than just receiving OR giving a blowjob?? Please let me know because I’m no gayer than the average straight man who indulges in masturbation but I really, really want to suck my friend’s cock.",
            "great now im horny",
            "posting this on r/gay",
            "wow, OP is giving solid points here, im impressed",
            "Where is the UwU bot when you need it",
            "Copypasta writing essays on how you can be less gay\n\nBi people being completely unaffected",
            "No, no. He's got a point.",
            "[deleted]",
            "that's why I don't touch my duck while masturbating",
            "Can we post this on r/noFap ?",
            "NTA, your dick, your rules",
            "All this for some suck",
            "Nice",
            "This would be a great post for Among Us Cock Bot",
            "What if my hand identifies as female?",
            "Sad part is there's at least one kid out there who is never going to masturbate again because he took this post seriously",
            "John 3:16\r  \nKing James Version\r  \n16 For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life.",
            "Getting a grip on sexuality",
            "sound logic. also - you can fuck as many dudes in the ass as you want and it’s *not* gay. you’re just getting anal, the gay dude you’re fucking is the one taking it in the ass.",
            "Its technically incest to",
            "Gay",
            "This whole post is gay",
            "What if I identify as female while i'm doing it?",
            "[deleted]",
            "[deleted]",
            "If I am interested in the guys cock, is that make me gay",
            "Would not masturbiting be less more gay since it is one guy YOU instead of TWo menS?",
            "Stop being homophobic and a kink shamer.",
            "Did you just assume your gender?",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "[King Missile already sorted all this out years ago](https://www.youtube.com/watch?v=KiPyMciRWQQ).",
            "How can it be gay if I put a wig on you and pretended you were a woman?\n\nNot that I did it...",
            "No other hand can compete with my callous placement.",
            "[deleted]",
            "out of line, but youre right",
            "Straight up he’s not wrong",
            "Being homosexual means you prefer a same sex partner.  If you're masturbating to thoughts or images of the same sex then you're likely homosexual. If you're getting a handjob from a same sex partner but would prefer an opposite sex partner then you're likely heterosexual. It's all about preference, not the act.",
            "gospel",
            "Upvoted.",
            "Me, trying to figure out if i agree, disagree, or if this even makes any sense.",
            "Giving and receiving cancel eachother out so its not gay",
            "if im the one giving it, does that make me a woman?",
            "Someone copy this because I'm mobile and i wanna send this to my friends",
            "Half the gay, double the pleasure",
            "yeah",
            "Is it weird that this is hot as fuck and Jesus Christ Linda if you’re reading this will you please come home?",
            "the day you disgusting straight males stop making gay jokes is when i'll be happy",
            "Just reading the title made me laugh.",
            "I see this as a win",
            "First off all how is it less gay? Homosexuality is loving the same gender in men therefore being attracted to the same gender (men) touching yourself for pleasure it is if jack off to male pictures as a man",
            "Nothing wrong with being gay so your comment makes no sense.",
            "Then let me suck your cock Enola pa"
        ]
    },
    {
        "post_id": "jqz1bu",
        "author": "AmberrBaby",
        "title": "Biden arrives at the podium for his inauguration",
        "url": "https://www.reddit.com/r/copypasta/comments/jqz1bu/biden_arrives_at_the_podium_for_his_inauguration/",
        "score": 10022,
        "num_comments": 172,
        "created_utc": 1604933818.0,
        "selftext": "He lets out a sigh and then a plastic smile. “Under the Biden administration,” he says, carefully “There will be a few new rules. It will be forbidden to cook,” The crowd gasps. “Everyone will have to eat McDonalds,” Jill hangs her head in shame. “You may have to charge your phone. You may have to twerk. Hell, you may even have to be bisexual.” An uproar starts in the crowd, but Biden ushers a silence with his next words “But it will all be worth it when we as a people can eat hot chip and lie. Thank you.” Biden leaves the podium to a thunderous applause. America is saved.",
        "permalink": "/r/copypasta/comments/jqz1bu/biden_arrives_at_the_podium_for_his_inauguration/",
        "comments": [
            "Breath and smile. \"Their rule, there will be new rules, is to ban cooking.\" People are angry, \"Everyone eats at McDonald's.\" Goodness depends on numbers. \"You have to fund your phone, you have to ruin it. Hell, you might get married.\" When the people's uprising arose, Biden broke the silence with these words: Thank you, Biden got off the stage and thundered, alive America.",
            "He 👥 lets 🙆 out a sigh 🌬😤 and then a plastic 💳 smile 😊. “Under the Biden 🧓🏻🔥 administration,” he 👨 says 💬, carefully 🚫 “There will be a few new 👌 rules 🚷. It will be forbidden 🚫 to cook,” The crowd 👥 gasps 😮. “Everyone will have to eat 👅 McDonalds,” Jill 💪🏻 hangs 😜 her 👩 head 💆 in shame 😳. “You may 🗓 have to charge 👔 your 👈🏾 phone 🗣🤷🏽‍♀️. You 👉 may 🗓 have to twerk 😤🥁🍑. Hell 🔥👿😈, you 👉 may 🗓 even 🌃 have to be bisexual.” An uproar starts 🆕 in the crowd 👥, but 🍑 Biden 🤯🧠➡ ushers a silence 🔇 with his 💦 next ⏭ words 🔚 “But it will all 💯 be worth 💸💵 it when ⏰ we as a people 👫 can eat 🍽 hot 🌡🔥 chip 🍟 and lie 😤. Thank 🙏 you.” Biden 🧓🏻🔥 leaves 🍃 the podium 🚯 to a thunderous 🌩 applause 👏🏽. America 🇺🇸 is saved 💾.",
            "let an ai finish this lmao   \n **He lets out a sigh and then a plastic smile. “Under the Biden administration,” he says, carefully “There will be a few new rules. It will be forbidden to cook,” The crowd gasps. “Everyone will have to eat McDonalds,”** he says. “And”—glancing at the woman in the front row who has the biggest smile—“McDonalds will be the national restaurant of the United States.” “And”—he pauses for effect, says the plastic smile again—“your most important job as a citizen will be to ensure the success of the national restaurant.”  For those not afflicted by severe paranoia, this is a surprisingly insightful, funny speech, with one brilliant surprise near the end. During a tour of the American heartland, he tells a staffer",
            "NTA your country, your rules",
            "Biden will bring the burger back to the McDonalds dollar menu. America is saved.",
            "I’m gonna un-retard for a sec and say thank you to OP. This is legitimately one of the funniest things I have ever seen in my life. Ive been laughing hysterically for 9 minutes straight. God bless you for bringing this into my life.",
            "He lets out a sigh and then a plastic smile. “Under the Biden administration,” he says, carefully “There will be a few new rules. It will be forbidden to cook,” The crowd gasps. “Everyone will have to eat McDonalds,” Jill hangs her head in shame. “You may have to charge your phone. You may have to twerk. Hell, you may even have to be bisexual.” An uproar starts in the crowd, but Biden ushers a silence with his next words “But it will all be worth it when we as a people can eat hot chip and lie. Thank you.” Biden leaves the podium to a thunderous applause. America is saved.",
            "For me, it's Biden. The best Presidential candidate. I even ask for extra absentee ballots and the staff is so friendly and more than willing to oblige.  One time I asked for an absentee ballot and they gave me three. I said, \"Wow, three for free!\" and the nice friendly poll worker laughed and said, \"I'm going to call you 3-for-free!\".  Now the staff greets me with \"hey it's 3-for-free!\" and ALWAYS give me three ballots. It's such a fun and cool atmosphere at my local polling station, I go there at least 3 times a week for voting and a nice papermate pen with blue ink instead of black, 1-2 times for voting on the weekend, and maybe once around dinner when I'm in a rush but want a great ballot that is affordable, fast, and can meet Biden's daily electorate needs.  I even do it with the security watching, it's wonderful! What a great polling station.",
            "Mods are hot",
            "\\#1 President of the American States of United since Gorg Wanshingmachine.",
            "My username is based on this iconic meme. God bless this sacred copypasta.",
            "this is the future liberals want",
            "[deleted]",
            "I miss cummy, it's just sad to see him gone.",
            "A nation healed",
            "What if you were born 1993 or earlier? Checkmate, conservatards.",
            "Big chungus moment!",
            "u/owoifier",
            "For anyone not in the know-\n\n\n\n“any female born after 1993 can’t cook… all they know is mcdonald’s , charge they phone, twerk, be bisexual , eat hot chip & lie”",
            "Wtf did I just read lmao",
            "You had me at twerk",
            "Based Joe?",
            "don’t know what the fuck this is but holy hell if it ain’t america",
            "u/shittytranslatorbot",
            "based",
            "[deleted]",
            "... -And thank you for listening to my Ted talk.",
            "You reddit people are gay as fuck",
            "Game",
            "u/EmojifierBot",
            "NTA: Your america, Your Rules."
        ]
    },
    {
        "post_id": "jv0ji6",
        "author": "EZ25-bnet",
        "title": "\"I EdItEd ThIs cOmMeNt sO ThAt yOu wOn'T KnOw hOw iT GoT So MaNy lIkEs\"",
        "url": "https://www.reddit.com/r/copypasta/comments/jv0ji6/i_edited_this_comment_so_that_you_wont_know_how/",
        "score": 10019,
        "num_comments": 213,
        "created_utc": 1605501047.0,
        "selftext": "After finishing his edit, he begins laughing heartily as he saves the changes to his previously tolerable comment. His chuckling comes to a steady end as he fully relaxes on his chair, closing his eyes. Suddenly, his eyes shoot open and his face violently straightens. He stands up, and fully extends his arms straight and outwards to his sides. His body begins slowly levitating upwards, seemingly breaking the very fundamental rules of reality itself. As he goes against all logic and reason with his vehement hovering, his eyelids drop and rise up again to reveal godly lights beaming from his eye sockets. A disembodied heavenly choir resonates from the abruptly omniscient man. A deific shock wave is fiercely expelled from his body, leveling his house and the surrounding neighborly architecture unworthy of his divine presence. Screams are heard from all directions, from both his family, neighbors, and bystanders walking by. Before continuing his ascent, his lips part to deliver one final message to the mere mortals surrounding him.\n\"I HAVE ACHIEVED, MAXIMUM, COMEDIC, PERFORMANCE.\"\nHe looks up, and with one swift movement, launches to the heavens, to properly acquire his ownership of the universe itself.",
        "permalink": "/r/copypasta/comments/jv0ji6/i_edited_this_comment_so_that_you_wont_know_how/",
        "comments": [
            "After completing his silk began to laugh heartily as you save the changes the original view of the economy. his laughter ended, while resting on a chair, eyes closed. Suddenly his eyes and full power to expand his face. He stood up and completely straight arm extending outward along one side. his body began to rise slowly, clearly violating the rules by their own event. I will go with logic and reason in the shadow of violence falls and transmitted light reveal poverty looms its orbit. Chorus disembodied voice from heaven deific sudden shock waves violently expelled from their body weight and great architecture near her unworthy of the presence of God. Listen to all sides of your family, your neighbors and pedestrians. Before we continue to provide for the increase of his lips is a final message to the ordinary people with their neighbors.\n\"I've done comedy.\".\nHe looked up and started quickly a movement to maintain ownership of the world sky itself.\n***\n^(Call me by tagging my username anywhere on Reddit!)",
            "That kind of comments are fucking annoying",
            "Based cock penis pog",
            "Aftew finishing his edit, he begins waughing heawtiwy as he saves the changes to his pweviouswy towewabwe comment. His chuckwing comes to a steady end as he fuwwy wewaxes on his chaiw, cwosing his eyes. Suddenwy, his eyes shoot open and his face viowentwy stwaightens. He stands up, and fuwwy extends his awms stwaight and outwawds to his sides. His body begins swowwy wevitating upwawds, seemingwy bweaking the vewy fundamentaw wuwes of weawity itsewf. As he goes against aww wogic and weason with his vehement hovewing, his eyewids dwop and wise up again to weveaw godwy wights beaming fwom his eye sockets. A disembodied heavenwy choiw wesonates fwom the abwuptwy omniscient man. A deific shock wave is fiewcewy expewwed fwom his body, wevewing his house and the suwwounding neighbowwy awchitectuwe unwowthy of his divine pwesence. Scweams awe heawd fwom aww diwections, fwom both his famiwy, neighbows, and bystandews wawking by. Befowe continuing his ascent, his wips pawt to dewivew one finaw message to the mewe mowtaws suwwounding him.\n\"I HAVE ACHIEVED, MAXIMUM, COMEDIC, PEWFOWMANCE.\"\nHe wooks up, and with one swift movement, waunches to the heavens, to pwopewwy acquiwe his ownewship of the univewse itsewf.",
            "After 🏻👀 finishing 🏁 his 💦 edit 📝, he 👥 begins 🖤🤠🐎 laughing 😆😂🤣 heartily 💔 as he 👨 saves 📑 the changes 📈 to his 💦 previously ↩ tolerable comment 💬. His 💦 chuckling comes 💦 to a steady 😫 end 🔚 as he 👨 fully 🌝 relaxes 🍺 on 🔛 his 💦 chair ♿, closing 😚 his 👋 eyes 👀. Suddenly 😲, his 💦 eyes 👀💓 shoot 💦 open 😃 and his 💦 face 😀 violently 💣🔪 straightens 🎓. He 👨 stands 🕴 up ☝, and fully 🌝 extends 👆 his 💦 arms 💪 straight 📏 and outwards to his 🍆💦 sides 👈👉. His 🎀💦🤔 body 😍 begins 🖤🤠🐎 slowly 🐢 levitating 🛫 upwards 👆⬆, seemingly 💯 breaking 🇲🇩 the very 👌 fundamental 💑 rules 🚷 of reality 💯 itself. As he 👨 goes 👉🏼 against 😏👉🚫 all 💯 logic 👌 and reason 🌟 with his 💦 vehement ✝🙏 hovering 🚁, his 💦 eyelids 👀🌞 drop ⬇ and rise 😳 up ☝ again ❌😬 to reveal 🐜👒🔌 godly 🙏🙌 lights 🔅 beaming from his 👋 eye 👀 sockets ‼🔧👀. A disembodied 👨 heavenly 🌌 choir 🎶 resonates from the abruptly 🖐🛑 omniscient man 👨. A deific shock 😧 wave ©🌊 is fiercely 😡😤 expelled 🤷 from his 💦 body 😍, leveling ☝ his 💦 house ❕😈🏠 and the surrounding 📫 neighborly 🏡 architecture unworthy ❌💰 of his 💦 divine 😰 presence ✌🙌. Screams 😫 are heard 👂 from all 💯 directions ♦, from both his 💦 family 👪, neighbors 🏡, and bystanders walking 🚶🏼 by. Before 😂 continuing 🔄 his 💦 ascent 🙌😇, his 💦 lips 👄💋 part 🍆 to deliver 🚚 one 😤 final 👆 message ✉ to the mere 🏫 mortals 🔮 surrounding 💄👠 him 👴.   \n\"I 👁 HAVE ACHIEVED 💯✔, MAXIMUM 💦, COMEDIC 😂😎🤪, PERFORMANCE 🎭.\"   \nHe 👥 looks 👀 up ☝, and with one 1️⃣ swift 🏃🏼 movement 📦, launches 💰 to the heavens 👼🏻👼🏿, to properly 🎩 acquire 🐁🛀🏼👎🏼 his 💦 ownership 💯 of the universe ❓🌌 itself.",
            "Pee poo",
            "Where is cummy",
            "Filling in for our boy \n\nAfter finishing his edit, he begins laughing heartily as he saves the changes to his previously tolerable comment. His chuckling comes to a steady end as he fully relaxes on his chair, closing his eyes. Suddenly, his eyes shoot open and his face violently straightens. He stands up, and fully extends his arms straight and outwards to his sides. His body begins slowly levitating upwards, seemingly breaking the very fundamental rules of reality itself. As he goes against all logic and reason with his vehement hovering, his eyelids drop and rise up again to reveal godly lights beaming from his eye sockets. A disembodied heavenly choir resonates from the abruptly omniscient man. A deific shock wave is fiercely expelled from his body, leveling his house and the surrounding neighborly architecture unworthy of his divine presence. Screams are heard from all directions, from both his family, neighbors, and bystanders walking by. Before continuing his ascent, his lips part to deliver one final message to the mere mortals surrounding him. \"I HAVE ACHIEVED, MAXIMUM, COMEDIC, PERFORMANCE.\" He looks up, and with one swift movement, launches to the heavens, to properly acquire his ownership of the universe itself.",
            "You think changing the comment after you get a ton of likes is funny? You dense motherfucker. This is anything but funny! People like you ruin the faith in humanity. Why would you even do that? You used your last remaining brain cells to make probably a good joke but no, you had to ruin it. You probably think pewdiepie and callmeCarson are the funniest people alive don’t you? You fucking ass licking troglodyte. Your parents raised you and sent you to school thinking that in the future you will honor their family name, give them grandkids etc but reality hit them harder than the plane that hit the twin towers. Look at yourself! wasting your time making dumbass shitty memes then deleting them to ‘troll’ everyone. What are you ? Fucking retarded? Bitch ass. \n\nFuck you.",
            "[deleted]",
            "this is so old",
            "this is literally a repost of something that was posted here a few months ago",
            "I'd be honest, anyone who does this is required to be gassed by Mr. Schmitler",
            "Repost.",
            "Reposted a 6 year old copy pasta... nice.",
            "LOL",
            "[deleted]",
            "[deleted]",
            "After finishing his edit, he begins laughing heartily as he saves the changes to his previously tolerable comment. His chuckling comes to a steady end as he fully relaxes on his chair, closing his eyes. Suddenly, his eyes shoot open and his face violently straightens. He stands up, and fully extends his arms straight and outwards to his sides. His body begins slowly levitating upwards, seemingly breaking the very fundamental rules of reality itself. As he goes against all logic and reason with his vehement hovering, his eyelids drop and rise up again to reveal godly lights beaming from his eye sockets. A disembodied heavenly choir resonates from the abruptly omniscient man. A deific shock wave is fiercely expelled from his body, leveling his house and the surrounding neighborly architecture unworthy of his divine presence. Screams are heard from all directions, from both his family, neighbors, and bystanders walking by. Before continuing his ascent, his lips part to deliver one final message to the mere mortals surrounding him. \"I HAVE ACHIEVED, MAXIMUM, COMEDIC, PERFORMANCE.\" He looks up, and with one swift movement, launches to the heavens, to properly acquire his ownership of the universe itself.",
            "Those are extremely annoying",
            "# \"I EdItEd ThIs cOmMeNt sO ThAt yOu wOn'T KnOw hOw iT GoT So MaNy lIkEs\"\n\n📷\n\nAftew finishing his edit, he begins laughing heawtiwy as he saves the changes to his pweviously towewable comment. His chuckwing comes to a steady end as he fully wewaxes on his chaiw, closing his eyes. Suddenwy, his eyes shoot open and his face viowentwy stwaightens. He stands up, and fuwwy extends his awms stwaight and outwawds to his sides. His body begins swowwy wevitating upwards, seemingwy bweaking the vewy fundamentaw wuwes of weawity itsewf. As he goes against aww wogic and weason with his vehement hovewing, his eyewids dwop and wise up again to weveaw godwy wights beaming from his eye sockets. A disembodied heavenwy choiw wesonates fwom the abwuptwy omniscient man. A deific shock wave is fiewcewy expewwed from his body, wevewing his house and the suwwounding neighbowwy architectuwe unwowthy of his divine pwesence. Scweams awe heawd from aww diwections, fwom both his famiwy, neighbows, and bystandews wawking by. Befowe continuing his ascent, his wips part to delivew one finaw message to the mewe mowtaws suwwounding him. \"I HAVE ACHIEVED, MAXIMUM, COMEDIC, PEWFOWMANCE.\" He wooks up, and with one swift movement, waunches to the heavens, to pwopewly acquiwe his ownewship of the univewse itsewf.",
            "You should make a deleted reddit comment one 😂\n\nEdit: I will give you wholesome reward to make that dream come true!",
            "I edited this comment so that you won't know how I got no upvotes.",
            "I feel like I've seen this before",
            "meantol breakdance",
            "Lmao",
            "Checkmate atheists...",
            "You think changing the comment after you get a ton of likes is funny? You dense motherfucker. This is anything but funny! People like you ruin the faith in humanity. Why would you even do that? You used your last remaining brain cells to make probably a good joke but no, you had to ruin it. You probably think pewdiepie and callmeCarson are the funniest people alive don’t you? You fucking ass licking troglodyte. Your parents raised you and sent you to school thinking that in the future you will honor their family name, give them grandkids etc but reality hit them harder than the plane that hit the twin towers. Look at yourself! wasting your time making dumbass shitty memes then deleting them to ‘troll’ everyone. What are you ? Fucking retarded? Bitch ass. \n\nFuck you.",
            "what the fuck",
            "This was posted a couple months ago, yeh?",
            "Oh boy I can't wait to use this one day when I'm pissy about a youtube commentor",
            "u/repostsleuthbot",
            "Very good pasta",
            "repost",
            "<- Upvote here",
            "I edited this so you won’t know how I got these upvotes",
            "I think this copypasta is pretty funny",
            "I edited this comment so you won't know how it got so many downvotes",
            "Everyone downvote this comment and I will 100% EDIT IT",
            "instagram",
            "[deleted]",
            "U/uwubot",
            "Стекло",
            "Smh why they gotta be so annoying",
            "[original](https://www.reddit.com/r/copypasta/comments/i3gaqh/i_edited_this_comment_so_the_replies_make_no_sense/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "Based",
            "Hilarious \n\n*I am a bot, and this action was performed automatically. Please contact the [moderators of this subreddit](https://youtu.be/HSfb5t2_ggo) if you have any questions or concerns.*",
            "vehement hovering",
            "7113 upvotes\n\nNOICE",
            "I stg I hate this",
            "# \"I EdItEd ThIs cOmMeNt sO ThAt yOu wOn'T KnOw hOw iT GoT So MaNy lIkEs\"\n\nAfter finishing his edit, he begins laughing heartily as he saves the changes to his previously tolerable comment. His chuckling comes to a steady end as he fully relaxes on his chair, closing his eyes. Suddenly, his eyes shoot open and his face violently straightens. He stands up, and fully extends his arms straight and outwards to his sides. His body begins slowly levitating upwards, seemingly breaking the very fundamental rules of reality itself. As he goes against all logic and reason with his vehement hovering, his eyelids drop and rise up again to reveal godly lights beaming from his eye sockets. A disembodied heavenly choir resonates from the abruptly omniscient man. A deific shock wave is fiercely expelled from his body, leveling his house and the surrounding neighborly architecture unworthy of his divine presence. Screams are heard from all directions, from both his family, neighbors, and bystanders walking by. Before continuing his ascent, his lips part to deliver one final message to the mere mortals surrounding him. \"I HAVE ACHIEVED, MAXIMUM, COMEDIC, PERFORMANCE.\" He looks up, and with one swift movement, launches to the heavens, to properly acquire his ownership of the universe itself.",
            "cohmdy",
            "I wonder what the original version of this is from... I just know you didnt make it yourself, as there is a comment below on the youtube video that says the exact same message and it was commented 3 months ago. Sorry to spoil the Karma farming.\n\n[https://www.youtube.com/watch?v=11IH9wvzLzc](https://www.youtube.com/watch?v=11IH9wvzLzc)",
            "Pog",
            "I/shittytranslatorbot",
            "I know how to out pizza the hut",
            "Everybody gangsta till he edits the laws of gravity so we won’t know what living is even like",
            "!thesaurizethis",
            "reeeepost",
            "frick you dude",
            " \n\nI’ll have a double triple chungus deluxe,on a tit, 4x4 really nigga style, extra chungles with a pogger, light nut grease, make it kek, fuck it and let it cum",
            "After finishing his edit, he begins laughing heartily as he saves the changes to his previously tolerable comment. His chuckling comes to a steady end as he fully relaxes on his chair, closing his eyes. Suddenly, his eyes shoot open and his face violently straightens. He stands up, and fully extends his arms straight and outwards to his sides. His body begins slowly levitating upwards, seemingly breaking the very fundamental rules of reality itself. As he goes against all logic and reason with his vehement hovering, his eyelids drop and rise up again to reveal godly lights beaming from his eye sockets. A disembodied heavenly choir resonates from the abruptly omniscient man. A deific shock wave is fiercely expelled from his body, leveling his house and the surrounding neighborly architecture unworthy of his divine presence. Screams are heard from all directions, from both his family, neighbors, and bystanders walking by. Before continuing his ascent, his lips part to deliver one final message to the mere mortals surrounding him. \"I HAVE ACHIEVED, MAXIMUM, COMEDIC, PERFORMANCE.\" He looks up, and with one swift movement, launches to the heavens, to properly acquire his ownership of the universe itself.",
            "I love how I can't copy the copypasta",
            "Glad I was able to find this again.  I love this so much."
        ]
    },
    {
        "post_id": "np30n4",
        "author": "322322322322322322",
        "title": "Lady Dimitrescu",
        "url": "https://www.reddit.com/r/copypasta/comments/np30n4/lady_dimitrescu/",
        "score": 10008,
        "num_comments": 190,
        "created_utc": 1622466481.0,
        "selftext": "Holy fucking shit. I(17M) want to bang Lady Dimitrescu so fucking badly. I can't stand it anymore. Every time I play Resident Evil Village and see her, I get so fucking horny. I hate waking up in the morning with 72818 gallons of cum in my boxers and knowing that cum should have gone inside of Lady Dimitrescu's fat pale ass. I want to have my hybrid human-vampire babies with her.\n\nFuck, my mom(45F) caught me banging my body pillow again. I put a picture of Lady Dimitrescu on it and went to fucking town. My mom is going to take away my Resident Evil Village, as well as all my games, and is going to bring me to therapy. I might never get to see Lady Dimitrescu ever again. Please help Reddit, you are my last hope.",
        "permalink": "/r/copypasta/comments/np30n4/lady_dimitrescu/",
        "comments": [
            "Holy fucking shit. I(17M) want to bang Lady Dimitrescu(44F) so fucking badly. I(17M) can't stand it anymore. Every time I(17M) play Resident Evil Village and see her(44F), I(17M) get so fucking horny. I(17M) hate waking up in the morning with 72818 gallons(275646.225L) of cum in my(17M) boxers and knowing that cum should have gone inside of Lady Dimitrescu's(44F) fat pale ass. I(17M) want to have my(17M) hybrid human-vampire babies with her(44F).\n\nFuck, my(17M) mom(45F) caught me(17M) banging my body pillow again. I(17M) put a picture of Lady Dimitrescu(44F) on it and went to fucking town. My(17M) mom(45F) is going to take away my(17M) Resident Evil Village, as well as all my(17M) games, and is going to bring me(17M) to therapy. I(17M) might never get to see Lady Dimitrescu(44F) ever again. Please help Reddit, you are my(17M) last hope.",
            "NTA your body pillow your rules",
            "The fucking legend put his mom's age and sex lmaooooooo",
            "Holy 🙏 fucking 💦🍆 shit 💩. I(17M) want 😋 to bang 💦💥 Lady 👩🏽👱🏼‍♀️‼ Dimitrescu so fucking 🖕 badly 👎😡👺. I 👥 can't 🚫 stand 🚏🕴 it anymore 🔥. Every ☝🏼👆🏼👇🏼 time 🕐 I 👁 play 🎮 Resident 🏘 Evil 👿 Village 🏘 and see 👀 her 👩, I 👁 get 🉐 so fucking 🖕🍆🍑 horny 😉. I 👥 hate 😡 waking ⏰ up ☝ in the morning ⏰🌅 with 72818 gallons 😩😂 of cum 💦 in my boxers 📦 and knowing 💭 that cum 💦 should have gone 🏃 inside 💠 of Lady 👩🏻‍💼👩🏽‍💼👩🏾‍💼 Dimitrescu's fat 🎅🤷‍♀️ pale 👻 ass 🍑. I 👁 want 😋 to have my hybrid 🐕👱 human-vampire babies 🍼 with her 👩.   \n  \nFuck 🖕, my mom(45F) caught 🎣 me banging 💥 my body 💃 pillow 🥵 again ❌😬. I 👁 put 😏 a picture 🌐📸 of Lady 👩 Dimitrescu on 🔛 it and went 🏃 to fucking 🍆 town 🏪. My mom 👪 is going 🏃 to take 💅 away 😂 my Resident 🏠 Evil 👿 Village 🏡, as well 😦 as all 💯 my games 🎮, and is going 🏃 to bring 🚶 me to therapy 💊😭🏥. I 👁 might 🔍 never ❌ get 🉐 to see 👀 Lady 👩 Dimitrescu ever 😠 again 😬. Please 🙏 help 💁 Reddit 💰, you 👈 are my last 😍 hope 🙏.",
            "UwUifier isn’t working, so I’ll do what I can.\n\nHowy fucking shit. I(17M) want to bang Wady Dimitwescu so fucking badwy. Evewy time I pway Wesident Eviw Viwwage and see hew, I get so fucking howny. I hate waking up in the mowning with 72818 gawwons of cum in my boxews knowing that cum shouwd’ve gone inside Wady Dimitwescu’s fat pawe ass. I want to have my hybwid human-vampiwe babies with hew.",
            "This sounds exactly like the oh my fucking gosh I wanna fuck the dog from animal crossing so fucking bad copy pasta",
            "Literally 1984, smh.",
            "You found this on r/teenagers didn't you?",
            "Holy fucking shit. I(17M) want to bang Lady Dimitrescu so fucking badly. I can't stand it anymore. Every time I play Resident Evil Village and see her, I get so fucking horny. I hate waking up in the morning with 72818 gallons of cum in my boxers and knowing that cum should have gone inside of Lady Dimitrescu's fat pale ass. I want to have my hybrid human-vampire babies with her.\n\nFuck, my mom(45F) caught me banging my body pillow again. I put a picture of Lady Dimitrescu on it and went to fucking town. My mom is going to take away my Resident Evil Village, as well as all my games, and is going to bring me to therapy. I might never get to see Lady Dimitrescu ever again. Please help Reddit, you are my last hope.",
            "Stupid Manthing! You Won't Live Long!",
            "acceptable reason",
            "the fuck we supposed to do",
            "hOlY FuCkInG ShIt. I(17M) wAnT To bAnG LaDy dImItReScU So fUcKiNg bAdLy. I CaN'T StAnD It aNyMoRe. EvErY TiMe i pLaY ReSiDeNt eViL ViLlAgE AnD SeE HeR, i gEt sO FuCkInG HoRnY. i hAtE WaKiNg uP In tHe mOrNiNg wItH 72818 GaLlOnS Of cUm iN My bOxErS AnD KnOwInG ThAt cUm sHoUlD HaVe gOnE InSiDe oF LaDy dImItReScU'S FaT PaLe aSs. I WaNt tO HaVe mY HyBrId hUmAn-vAmPiRe bAbIeS WiTh hEr.  \nfUcK, mY MoM(45F) cAuGhT Me bAnGiNg mY BoDy pIlLoW AgAiN. i pUt a pIcTuRe oF LaDy dImItReScU On iT AnD WeNt tO FuCkInG ToWn. My mOm iS GoInG To tAkE AwAy mY ReSiDeNt eViL ViLlAgE, aS WeLl aS AlL My gAmEs, AnD Is gOiNg tO BrInG Me tO ThErApY. i mIgHt nEvEr gEt tO SeE LaDy dImItReScU EvEr aGaIn. PlEaSe hElP ReDdIt, YoU ArE My lAsT HoPe.",
            "Does anyone want to address that Lady D probably smells like a dead body and you'd be swatting flies the whole time if you got with one of her daughters.",
            "I won't judge, but that's a sad moment, RIP your games mate. Hope you get em back😞",
            "What’s the original",
            "I'm on mobile can someone copy and paste in comments plz",
            "Try not to look at pictures of Christina Hendricks until this all blows over.",
            "Tell me you're a virgin without telling me you're a virgin",
            "[removed]",
            "Lady Dimitrescu is not hot. She's old and musty, and prolly stanks like dust.",
            "Tall lady",
            "NTA, your cum, your rules",
            "Sorry Liberal, Lady Dimitrescu isn’t a vampire, she’s actually a product of the cadou parasite 😎",
            "I think you like that young granny look u get from her.",
            "Sad thing is there are idiots who are really like this",
            "Bro the fuck you wnst us to do",
            "This man is a menace to society",
            "Stay strong man, at 18 there's nothing your mom can do to stop your love with Lady d",
            "[Sauce](https://np.reddit.com/r/196/comments/notsdp/rule/h020jzr/?utm_medium=web2x&context=3&utm_source=share)",
            "Fuck off. \n\n\n\nPlease fuck off.",
            "Go touch grass, wtff😂",
            "[deleted]",
            "source?",
            "Mi s-a sculat pula",
            "Only thing you can do is, bang ur mom😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😔😊😔😔",
            "Isn't this just the Isabelle copypasta?",
            ">I hate waking up in the morning with 72818 gallons of cum in my boxers\n\nBRO WHAT",
            "If therapy didn't work, they'll be sending you to an asylum. You'll have more than enough of Alcina in there.",
            "r/teenagers?",
            "Test comment please ignore",
            "Half vampire half human hybrids are known as Dhampir (dam peer), in some regions.",
            "Lady Dimitrescu + nsfw tag \n\nname a better duo I'll wait",
            "I've already seen OF cosplayers as her, just buy some clips and use a Fleshlight. Your poor pillow, and mom!",
            "She is not hot, she looks like a grandma that is eating food through a tube in her hospital bed.",
            "!emojify",
            "fun fact , if you check the notes  at the end when chris redfield  enter the main villain's lab you'd learn that lady dimitrescu has a  very bad \"blood disease\" (I'm thinking aids maybe) that's why she sustains on blood after getting her mutations . so i wouldn't recommend having unprotected seggs with her",
            "“Curse you!”",
            "There is a floppa one thats exactly like this",
            "I hope this is satire.",
            "Wow a very horny minor",
            ">Holy fucking shit. I(17M) want to bang Lady Dimitrescu so fucking badly. I can't stand it anymore. Every time I play Resident Evil Village and see her, I get so fucking horny. I hate waking up in the morning with 72818 gallons of cum in my boxers and knowing that cum should have gone inside of Lady Dimitrescu's fat pale ass. I want to have my hybrid human-vampire babies with her.\n\n>Fuck, my mom(45F) caught me banging my body pillow again. I put a picture of Lady Dimitrescu on it and went to fucking town. My mom is going to take away my Resident Evil Village, as well as all my games, and is going to bring me to therapy. I might never get to see Lady Dimitrescu ever again. Please help Reddit, you are my last hope.\n\n👇👇👇👇👇"
        ]
    },
    {
        "post_id": "9u341j",
        "author": "magnificentmemer",
        "title": "I'm already tracer",
        "url": "https://www.reddit.com/r/copypasta/comments/9u341j/im_already_tracer/",
        "score": 9994,
        "num_comments": 305,
        "created_utc": 1541336070.0,
        "selftext": "What pisses me the fuck of about it is how fucking nonsensical the lyrics are, the guy is saying that he wants different characters and the girl is saying that she already is ALL the characters that the guy suggests, how in the everloving fuck does that make sense?? You can't be several characters at once! Or is the girl supposed to be different people every time she answers?? And another thing, when he suggests Bastion, she says that they should NERF Bastion which implies that he is an OP character, which would be a reason FOR picking Bastion, not the other way around. It's such fucking nonsense and it pisses me off",
        "permalink": "/r/copypasta/comments/9u341j/im_already_tracer/",
        "comments": [
            "ok this is really funny and epic",
            "Finally someone pointed out the nerf bastion part I was thinking that from the start",
            "this is so sad can we hit my wife",
            "Id actually thought about how she said \"I wanna be winston\" but she never really chooses winston so the guy could just yoink winston from her",
            "TikTok in general is just like this ",
            "What pisses me the fuck of about it is how fucking nonsensical the lyrics are, the guy is saying that he wants different characters and the girl is saying that she already is ALL the characters that the guy suggests, how in the everloving fuck does that make sense?? You can't be several characters at once! Or is the girl supposed to be different people every time she answers?? And another thing, when he suggests Bastion, she says that they should NERF Bastion which implies that he is an OP character, which would be a reason FOR picking Bastion, not the other way around. It's such fucking nonsense and it pisses me off",
            "Also they've already nerfed bastion, hes not ,\"OP\" as he once was",
            "The other trash guy cheering him on absolutely made this.",
            "Maybe all 5 of the “maybe I’ll be” guy’s teammates have a very similar voice, and we only see one of them? A bit of a stretch, but it could be plausible.\n\nThe nerf Bastion part could just be them wanting to be good sports? Really, though, Bastion isn’t even overpowered, and might even be a bit weak.\n\nWhat REALLY doesn’t make sense is how, if all 5 players stuck with their classes, they would have 4 damage classes and 1 tank, which is a horrible team set-up. To make things worse, the player trying to choose a character would probably also make an awful choice, seeing as he tried to play as McCree while the team already had 3 damage classes. Generally, 3 damage classes is the absolute maximum that you would want, and even then, having 2 is usually better.\n\nTLDR: the song makes a tiny bit more sense than somebody would think at first glance, but to play with any of these people would be horrible!",
            "I’ll probably be shanked here but can I get an r/OutOfTheLoop ?",
            "This post made me make another account to dislike that I’m already tracer meme",
            "Well than i'l be genji than",
            "I'm already Thanos",
            "u/Gorillaz_RWBY",
            "This an important message for the youth, thank you for sharing. Bless you 🙏🙏",
            "Also, bastion is the last character that needs a nerf right now. After torb, sym, and Hanzo got reworks and are now viable, bastion is the only troll pick left. This song was written, I’m assuming, during the brief time he was actually overpowered (when he was bordlerine unkillable in turret form), as is stands now, 90% of people above bronze would consider him easily the most useless hero in the game. ",
            "TIK TOK ON DAT CLOCK AND HIT ME WITH THE GLOCK",
            "For real though I fucking hate this song, none of the lyrics sound remotely good at all, it just flows like shit. It doesn't sound good to rhyme the same words together, and all the lyrics sound awkward to sing, like if a 5 year old with no sense of rhythm made the song.",
            "I know this is r/copypasta, but I'm gonna be a bit serious. I like the band that made the song, they're called The Living Tombstone. But this song wasn't that good imo, especially with tik tok fucking it up.\n\nEdit: apparently not a band, but one person.",
            "THIS! I hate that song with a passion",
            "thisisunironicallytrue",
            "IKR, When I first heard the song I was right\n\"Do these people know what nerf is?\"",
            "9 year olds taking over memes, soon they will start influencing elections",
            "Ok, I’m r/outoftheloop",
            "So, nice and all with the funny comments and shit, but whom’st the fuck be commenting the copypasta, my broke ass on my phone can’t copy the post and shit",
            "Libtard😤DESTROYED💯",
            "I’ve thought this in my head several times and I love this. Please have my children",
            "Nooooo... The girl is giving voice to the whole team. The male voice is a guy who thinks he's top shit and the rest a bunch of n00bs, but when he tries to pick a good character, everyone else calls dibs on the popular ones, until one n00b is left... And the last one refuses to pick a support character.\n\"Nerf\" is used here to mean \"fuck\".",
            "Ok this is epic",
            "Alts",
            "*off",
            "I wanna be genji.",
            "SAME DUDE\n",
            "this is a movement i can get behind",
            "FINALLY SOMEONE POINTS OUT THE NERF BASTION THANK YOU FOR CONFIRMING THERE IS NOTHING WRONG WITH ME",
            "All of this goes thru my mind every time I hear that fucking song. Glad someone put it into words 👏",
            "What is this? How did I get here?",
            "What did I just read",
            "The song was made when bastion was OP ",
            "I unironicly agree with this",
            "Its from a song about the girl specifically not wanting to choose mercy, so I assumr she's trying to force him into being mercy?",
            "*Trying to put logic in autism*",
            "Epic",
            "If bastion is like the auto in csgo, I can understand.\n\nThe first to use it in a ranked game have no honor.",
            "but... but... Im already tracer.",
            "I unironically agree with all of this",
            "I unironically agree with this",
            "It makes total sense if you think about it as her swapping characters as the guy says he’s going to play them instead while in comms. Obviously she can’t be multiple heroes at the same time so instead she’s swapping to what the guy wants to play as instead. The dude just has to stop vocalizing what he’s going to pick before it gets taken or go pick the previously stolen character after she switches. She probably says nerf Bastion because she’s bad at playing as and against Bastion, wants them nerfed so they don’t get picked, and if Bastion is weak she can avoid having to pick Bastion without being at a loss.",
            "I wanna be Winston 🦍 ",
            "Okay, this is epic!",
            " NERF BASTION",
            "Especially since Bastion isn't even OP, in fact if you were a real gamer like me, you'd realize he's actually low-tier in Overwatch.",
            "NERF 🅱️ASTION???😭😭😭😭😭😭",
            "Bastion isn’t even OP, he’s so fuckin easy to play around. The whole song pisses me off.",
            "As autistic as this is I’ve had the same thought process.",
            "She could be changing character every time he mentions one, but then he could just not announce his actions before executing them.",
            "But the girl wanted to be Winston the whole time tho?",
            "mAyBe I'lL bE tRaCeR",
            "I'm not joking I was thinking about this at work for the last 2 hours. My thought process was almost identical to this post. This is some glitch in the matrix shit.",
            "You should’ve picked Mercy",
            "holy shit i have never agreed more with a copypasta in my life",
            "someone had to say it. \n",
            "r/gamergate",
            "All this talk...\n\n\nYeah, all of it.\n\n\n\n\nIs. \n...\n...\n...\n\n\n\nTalk.\n\n\n\n\n\n\n\n\nTalky\ntalk\ntalk\ntalk\n\n\n\n*invigorated\n\n\n\nShit now i need a shower.",
            "i actually fucking hate this pathetic attempt at a meme and tiktok in general",
            "True!",
            "!thesaurizethis",
            "ok, this is epic\n\n&#x200B;",
            "Hello\n",
            "Okay, now this is Epic 😎 ",
            "Yeah this bothered me so much, and I don't even play Overwatch. I can't get over it (hence why I'm posting so late still)",
            "same tbh",
            "This is the worst store I have ever worked at in my life  \nWhen we finally get twenty sales, everyone dies  \nI understand that every now and then the staff won't click  \nWhen it comes to you, I don't think I can sympathize  \n\n\nYou should've picked Claudia  \nYou should've picked any kind of support  \nWe ended up folding, and it's all your fault  \nYou should learn how this job works  \nYou should've been helping—  \n\n\nIf you like Claudia so much, why don't you just marry her?  \n\n\nSo you're the type that gets all mad and tries to  lecture me  \nYou're the most useless person we have on our team  \nI've never seen anybody rage quite as hard as you  \nMaybe you should go back to working call centers too  \n\n\nI'm not gonna be Claudia  \nI'm not gonna be any kind of support  \nWe ended up folding, and you got all mad  \nYour tears are what I live for  \nYou should've been Claudia  \nI'm not gonna be any kind of support  \nWe ended up folding, and it's all your fault  \nYour tears are what I live for  \n\n\nMaybe I'm Nanami  \nAlready Nanami  \nWhat about Kitaeri-tan?  \nI'm already Kitaeri-tan  \nI'll be Tenchō  \nNerf Tenchō  \nYou're right. So, Goichi  \nI wanna be Goichi  \nGuess I'll be Kyuuhachi  \nAlready Kyuuhachi  \nThen I’m Hitonobu  \nAlready Hitonobu  \nI have an idea  \nWhat's your idea?  \nYou should be...  \nI'm not gonna be Claudia  \n\nYou should've picked Claudia  \nI'm not gonna be any kind of support  \nWe ended up folding, and it's all your fault  \nYour tears are what I live for  \nI'm not gonna be Claudia  \nYou should've picked any kind of support  \nWe ended up folding, and you got all mad  \nYou should learn how this job works",
            "Ben Shapiro DESTROYS liberals with FACTS and LOGIC",
            "stfu its a meme",
            "it a song bro",
            "I think I may have started this copy pasta :/ not on this Reddit account I've had several. \n\nIt fuckin totally reads like me and it's exactly how I feel and how I would express it.",
            "[removed]",
            "Whats a overwatch",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_chmicalcrybaby] [o](https://www.reddit.com/r/u_Chmicalcrybaby/comments/9u574v/o/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "The song was made when Bastion could do headshots in turret form.",
            "Thats a song on youtube from some rap channel or something.",
            "wanna go cunt im tracer",
            "Why can't the guy just pick a hero without even telling her",
            "I wanna be Winston",
            "Also the fact that she don’t wanna go support just because instead of trying to win is dumb as fuck",
            "I love that song and I’m a 40year old dude who absolutely hates internet 4chan lel culture \n",
            " I wanna face fuck the girl in the meme until the peepee mayonnaise cume "
        ]
    }
]