[
    {
        "post_id": "o2qpvd",
        "author": "orient_vermillion",
        "title": "Most vaginas are repulsive",
        "url": "https://www.reddit.com/r/copypasta/comments/o2qpvd/most_vaginas_are_repulsive/",
        "score": 9785,
        "num_comments": 727,
        "created_utc": 1624027450.0,
        "selftext": "It's not a beautiful, delicate little flower. The average vag looks like a disgusting floppy wound with guts hanging out of it. It's nauseating to look at. And whenever I say that, it's either cause I'm 'gay' or it's \"massage a knee\". Meanwhile, it's perfectly normal to shame men for not having a mutilated jew cock. It's considered hilarious to mock penises for existing, but the vagina, the sacred hole of meat and smelly discharge, is a forbidden taboo never to be discussed in a negative light.",
        "permalink": "/r/copypasta/comments/o2qpvd/most_vaginas_are_repulsive/",
        "comments": [
            "man massage a knee is getting out of hand",
            "Okay so this is a strong intro with clearly articulated thesis, but you still need to flesh out your supporting evidence in the body paragraphs. And be careful not to get careless and barrel into the meat of your essay without outlining its core structure first. Too many times people will start writing, confident that their position is so strong they can just wing their reasoning behind it as they go, only to later learn that their opinion is either more subjective than they originally thought, or that arguments that *sounded* distinct and mutually exclusive in their heads actually tend to vaguely bleed into one another.\n\nIt's got bones, but now it needs muscle.",
            "It's not a beautiful 🌄, delicate 👴👵👼 little 👌 flower 🌺. The average 🆗 vag 🌮✌ looks 👁 like 💖 a disgusting 🤢🌡 floppy 🙅😔🙍 wound 💨 with guts 🤤 hanging 🔛 out of it. It's nauseating to look 👀 at. And whenever 🏪 I 👁 say 🗣 that, it's either 🚫 cause 💋 I'm 👌 'gay' 🏳️‍🌈 or it's \"massage 🤫 a knee 👇\". Meanwhile ⌛⏳, it's perfectly 👌 normal 👩‍🦯 to shame 😔 men 👨 for not having a mutilated 💔 jew 👳 cock 🍆. It's considered 🤔 hilarious 🤣 to mock 😨😟 penises 👀🍆 for existing 🚩🎭🅾, but 🍑 the vagina 🍑, the sacred 🔥 hole 🕳 of meat 🍆 and smelly 🤑 discharge 🐙, is a forbidden ❌ taboo 🙄 never ❌ to be discussed 🗣🤔 in a negative 👎 light 💡.",
            "In highschool i had a lesbian friend who would always talk to me about how weird dicks were and how they were just little floppy snakes. At the same time i had a gay friend who would always rant about how vaginas were so strange and would tell me they were just ham sandwiches. Well one day the stars aligned and they both happened to be walking with me and i popped the question. “Well guys, what’s better, a penis or vagina?” and I think that may have been the funniest and most passionate argument i have ever witnessed. At some point i just walked away and they had no idea.",
            "genitals of any kind r objectively weird looking",
            "[removed]",
            "This post is absolutely massage a knee stick(I had to google what misogyny means and I can't make a good joke out of it)",
            "Who the fuck shames guys for being uncut? I have having a mutilated Jew cock, and I’m not even Jewish.",
            "[deleted]",
            "I feel like I’m not insecure enough to participate in this conversation",
            "*\"To learn who rules over you, simply find out who you are not allowed to criticize\"*\n\nRise up against vaginas",
            "the sacred hole of meat 🍖🙏",
            "I actually think vaginas are beautiful, in fact I tell every m'lady I meet this. I of course first off bow before each goddess, then I tip my fedora and utter these words \"why, thy goddess of everything that is good and holy thy part of privates is like the most beautiful grapefruit ever to be created and exist in this cruel world. As I ponder upon that which is holy and divine, of course it being thine magical fairy grapefruit from the land of valinor I shutter in disgust at my own mutilated stick of debauchery and wish I too had thy beautiful piece of genatalia. May your peen juice flow freely and pain-free, and may your vagina always shine.\" It works wonders!",
            "thats why i like women with dicks",
            "Based",
            "It's not a beautiful, delicate little sausage. The average dick looks like a disgusting floppy tube with deflated balls hanging onto it. It's nauseating to look at. And whenever I say that, it's either cause I'm 'lesbian' or it's \"miss and ray\". Meanwhile, it's perfectly normal to shame women for not having a perfect porn pussy. It's considered hilarious to mock  vaginas for existing, but the penis, the sacred rod of meat and smelly smegma, is a forbidden taboo never to be discussed in a negative light.\n\nFor gender equality",
            "Is it weird if i got hard when reading the vagina part?",
            "ngl I somewhat agree",
            "I sense a recent traumatic event for this person involving either their penis or a vagina or possibly both!",
            "Gay",
            "There's a lot to unpack here.",
            "he's not wrong though, vaginas really do tend to be...gross looking to some extent.",
            "You okay brother? Take a little time and rub one out before posting next time! I think you were a little heated while typing this out. remember, \"when in doubt, rub one out\".",
            "Ghey",
            "Fortunately, op will never have a chance to see a real vigina anyways",
            "This but unironic",
            "idk if its weird but vaginas dont look attractive to me and they kinda look gross to me but the shape if a long thin penis gets me turned onn, im not turned onn by the male body but i would like to taste one, unfourtanatly i cant lean down enough to suck my own dick. i dont want to resort to paying somone to do it, anyone help me pls what do i do",
            "Have you seen enough vaginas to average them?\n\nI notice no one is even discussing the male scrotum. Jeeeezus! Now those damn things are disgusting and inconvenient.",
            "Kinda agree exept for the incel bits",
            "This but unironically",
            "Nah fr tho both genitals are disgusting😭",
            "Sorry but I have to do this. The vagina is INTERNAL, what is seen externally is the labia majora (otherwise known as the lips), labia minora (inner lips), clitoris, urethra opening, vaginal opening. Neither male or female genitalia is attractive, at least a penis doesn’t need to dilate to 10 times it size to get something the size of a watermelon out of something the size of a lemon.",
            "Tbf most of these problems are kinda hard to fix.. like.. in the sense that no one has to waste money and time just to cut the labia and to get rid of smell. But eh",
            "I never met a vagina I didn't like.  Never found one repulsive.  Sorry man, I think you prefer penis or no sex at all.",
            "[deleted]",
            "I now know what an anti boner feels like.",
            "ur not living for the bad ones, live for the ones u find sexy :)",
            "Thank you, Ben Shapiro.",
            "Unbonk get out of horny jail.",
            "So many r/newsentence lines here. 👾",
            "What the fuck did I just read!",
            "Maybe just in general, be a decent person and don't make fun of people's genitals.\nIf they show you their intimate parts just be respectful.\n\nRemember you don't have to touch or engage with anything or anyone you don't want to.",
            "facts",
            "He's right you know",
            "During pride month? Bro…",
            "My vagina is beautiful !",
            "if you're gay you have no right to talk about vaginas   \n\n\nits 2021  stay in your lane",
            "Incel mentality",
            "[deleted]",
            "Fugma",
            "[deleted]",
            "🤨",
            "Obviously never seen one have you?",
            "\"bumping uglies\"",
            "Yikes, just yikes.",
            "Howabout we don't shame anyone for things they were born with?",
            "Who hurt you? Lmao",
            "Fucking incels",
            "Wtf does \"massage a knee\" means?",
            "Sounds like you got your pp made fun of and your redirecting your rage. A little pathetic…",
            "as a man with a vagina, i agree with this post, I can't wait to receive my much needed deluxe phallus through the post xxx",
            "I unironically 100% agree. Vaginas are fucking disgusting, they make me want to puke.",
            "Mutilated Jew cock.\n\nr/brandnewsentence",
            "Most don’t look good, ladies prove me wrong. DMs are open",
            "[deleted]",
            "HERETIC! BE GONE IMPOSTER! You jus probably never got any pussy",
            "This seems more like a rant",
            "\"I am gay I am gay I am gay I am gay I am gay I am gay I am gay I am gay\"\n\nOkay buddy, chill out, we know and it's fine.",
            "How I feel after beating off",
            "That's some classic post-nut clarity right there.",
            "I mean yeah I can honestly agree, The vaginas that look the most appealing to me are the ones covered by skin so I don’t have to look at the “floppy wound with guts” which is honestly an amazing description",
            "I'm straight as fuck and I like the concept of pussy but it's just fucking repulsive. What is wrong with you guys.",
            "I second this copypasta, however I have extreme dysphoria hahahaha",
            "I’ve seen a few I wish I hadn’t.. some do look like they’ve seen more fruit and veg than bury market but when you find one that’s not seen more business than a bank, dude! Yes please.. \n\nDon’t be so sensitive though.. if folk want to diss on cock n balls that’s their prerogative, people that point fingers are insecure and just want to move the attention away from themselves and their own imperfections, just roll your eyes and move on..",
            "I’ve always thought this",
            "He has a point tho",
            "大多數陰道是令人厭惡的  \n國家安全局  \n它不是一朵美麗、嬌嫩的小花。 普通的陰道看起來像是一個令人作嘔的鬆軟傷口，裡面掛著內臟。 看著就噁心。 每當我這麼說時，要么是因為我是“同性戀”，要么是“按摩膝蓋”。 同時，因為沒有殘缺的猶太公雞而羞辱男人是完全正常的。 嘲笑存在的陰莖被認為是搞笑的，但陰道，肉和臭味分泌物的神聖洞，是一個禁止的禁忌，永遠不會消極地討論。",
            "Im a hetero male. Vaginas look nice, dicks look fucking ridiculous.",
            "Real Incel vibes going on.",
            "You are correct, sir. Vaginas are gross, and that is a fact. \n\nNope, not gay-I just don't think there's anything beautiful (looking) about vaginas.",
            "I actually agree. There is a nice looking perfect vagina but I suppose it’s my preference and that it’s a pretty specific thing",
            "I agree and I like women",
            "Couldn´t agree more, they are truely disgusting looking.",
            "But it's delicious",
            "he have a point tho",
            "Vaginas are gross bro.",
            "i only see facts",
            "Have said this multiple times myself.  Great take.",
            "Based",
            "poor guy encountered to many flap lips in a row, thinks it's that way across the board. lol",
            "Bitch smells like a whole ass seafood market.",
            "facts",
            "I mean you’re not wrong tbh",
            "honestly i kinda agree",
            "You can admit you’re gay, it’s 2021",
            "Idk man. Not to sound like I’ve had a ton of pussy but I feel like most of what I got is indeed not only sexy but beautiful. I suppose anyone (guys or girls) who don’t keep it clean down there can be off putting but to say most vaginas are repulsive? Idk about that",
            "You sir are totally gay, I love vags and love liking them, don’t know what kind of smelly girls you date, but let me tell you, even with hairs it taste delicious.",
            "But yet your preference is a hairy ASSHOLE No smelly discharge THERE.    If Sweaty flappy cheese balls & furry  meatpoles with salty curdled cream is more your taste.  Then More power bottoms to you ,, stop looking at pretty pink tacos if u don’t hav the stomach for it.  Hairy ass pillows seem  more your taste.  Enjoy your cockmeat sandwich & wipe off ur chin . Keep the dick breath & shit vapors all for yourself.  Opinions are like assholes everyone has them & some are bigger than others , just like yours.  Gaping & full of shit. This was a joke & my opinion.    To each their own.  Peace out Girl Scout.",
            "Based. And and Fishpilled.",
            "Never cared for those floppy lips that look like an Arby's sandwich.",
            "Poor, useless idiot. How’s he gonna feel when he hears about menstruation?\n\nStrictly speaking, a vagina is an empty space, it can’t look like anything.",
            "Check out r/Real Girls beautiful!",
            "I’m an asexual so I’m somewhere in between “pretty pink flower” and “this copypasta”.",
            "Vaginas repulse me, but I admire how strong they are! Vaginas are amazing,  but gross.",
            "r/pussy",
            "he’s definitely gay in denial"
        ]
    },
    {
        "post_id": "k7khz9",
        "author": "None",
        "title": "Server icon is back to yandev",
        "url": "https://www.reddit.com/r/copypasta/comments/k7khz9/server_icon_is_back_to_yandev/",
        "score": 9782,
        "num_comments": 390,
        "created_utc": 1607219388.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/k7khz9/server_icon_is_back_to_yandev/",
        "comments": [
            "The server ID will be returned in January.",
            "[deleted]",
            "#cum",
            "Server 💁 icon ❗ is back ⬅ to yandev",
            "Thank you for listening to the people",
            "OUR LORD AND... well YandereDev is anything but a savior but he sure makes for a wacky mascot",
            "sexy yandev 😳😳😳",
            "Prise the sun! ☀️☀️☀️☀️",
            "now all that's left is to bring cum \nmy back",
            "What was it before I missed it",
            "\"what if put my yandev pic  next to yours uwu 😳\"",
            "YAYAYAYAYAYAYAYAYYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAAYAYAYAYAYAYA\n\nYAYAYAYAYAYAYAYAYYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAAYAYAYAYAYAYA\n\nYAYAYAYAYAYAYAYAYYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAAYAYAYAYAYAYA\n\nYAYAYAYAYAYAYAYAYYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAAYAYAYAYAYAYA\n\nYAYAYAYAYAYAYAYAYYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAAYAYAYAYAYAYA\n\nYAYAYAYAYAYAYAYAYYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAYAAYAYAYAYAYAYA\n\nYABA GABA!",
            "We have re-ascended.",
            "good",
            "u/Cummybot clone When?",
            "r/copypasta good ending",
            "what was it before?",
            "Could I get a High Definition image of his glorious visage?\n\nEdit: wait I just realized my comment rhymed",
            "i was curious if he looked anything like that photo, and the dude has aged thirty years in ten. looks insanely old now",
            "piss in my mouth",
            "Yandev senpai has returned to us UwU",
            "Blessed is this day for YandereDev has returned to our server icon. Our honor has been restored.",
            "Poggar",
            "funny cummy man back, me hape",
            "Yandev so hot 🤤",
            "Nice",
            "#",
            "Piss, shit and cum",
            "Yes",
            "ok",
            "***YES***",
            "ag",
            "Hot (also sexy but that's beside the point)",
            "Yay 😀😃😄😁😆😅😂🤣☺😊😇🙂🙃😉😌😍🥰😘😗😙😚😋😜😝😛🤑🤗🤪😎🤓🤩🥳😏🤠🤤😭🥴😺😸😹😻😼😽👍🤟🤘💋👅",
            "Why was it ever changed?",
            "Thank you",
            "Thats what I fucking thought",
            "Change it back the OG pasta",
            "Finally, back to the good old days.",
            "**I love democracy**",
            "https://www.youtube.com/watch?v=8gddMPwOc_s",
            "bro",
            "Finally",
            "Love and peace",
            "Lets goooo",
            "wholesome",
            "FUCK YEAH",
            "Democracy",
            "Thank you based god",
            "LET'S FUCKING GOOOOOOOOOO",
            "why did u change it in da first place 🤦‍♂️",
            "Victory",
            "yandev dev",
            "why",
            "WOOOOOOO",
            "u/shittytranslatorbot",
            "Yay! We did it! We did it!",
            "YESSSSS",
            "As things should be",
            "As all means to be",
            "LETS FUCKING GOOOOOOOO",
            "For some reason i thought the icon was tucker carlson",
            "Finally 😳 i can 👉👌 cum 💦💧🍆 every day 🗓  to yandere dev’s sexy face 🥵",
            "We did it reddit\n\nThis is such a holesum100 r/redditmoment",
            "Oil?",
            "We killed the rival",
            "Actual Super Hero",
            "now bring back daddy cummy",
            "whos yandev",
            "Base",
            "Pog",
            "Finally",
            "thank christ",
            "Thank you",
            "poggers",
            " Thank god",
            "cum",
            "LETS GOOOOOOO",
            "He probably left the server and had a chat ban for a while.",
            "[deleted]",
            "Back to cum daddy yandere😫🥰",
            "Perfect",
            "YanGoat*",
            "Cummy is smiling upon us",
            "Close one",
            "Oh man",
            "Server icon is back to Yandev",
            "r/teenagers is facing. Good sub imo",
            "Oh yeah 😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍😍",
            "Inb4 Yandev buys the subreddit",
            "Bring back pasta bowl, it's superior",
            "bring back cummybot2000, please",
            "The chalice is missing cummy :(",
            "Sex",
            "Good",
            "epic and based",
            "also cum",
            "Wow mods, you really changed it back fast didn't you? Good job",
            "Based",
            "[deleted]",
            "Thanks guys",
            "#LETS GOOOO",
            "Good.",
            "Rip",
            "Good",
            "Cheers, I will consume to that.",
            "YES YES YES YES YES 😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡😡fortnite needs sex. I am an 11 year old boy who often fantasizes about sex I want sex I am virgin. fortnite sex could help me have real sex please epic games give me sex I am very lonely please epic games what must I do to sejydTueriFykFHIZRAYORSUOSTUORSUOSROYUROSORZYZRYOFXUYZFOIYCPGUCOUTCF YOUOXTTUCOe Ariel assault trooper have their black round cheeks clapped by agent peely like damn give me upvotes and awards so fortnite sex is made real.😡😡AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\n\nHoly fucking shit. I want to bang the fortnite anime girl so goddamn bad. I can't stand it anymore. Every time I go to the battle pass I get a massive erection. I've seen literally every rule 34 post there is of her online. My dreams are nothingHello bitch, nice TITS ahahahahah milky millky milky baby thirsty mommy baby want milk suck suck suck suck hahahaha stupid cunt give me those big udders you slut hahahaha tits tit titty me your caveman me use big titty for big bitty hahaha honk honk honk slut cunt mommy honk honk milky baby want more now honk honk honk pitter patter on those big mommy milkies hee hee hee haha haaaa haaaa can’t stop the milk truck coming through honk honk all aboard the titty train hee hee wooo wooooooo honk honk honk!!! but constant fucking sex with the fortnite anime girl. I'm sick of waking up every morning with six nuts in my boxers and knowing that those are nuts that should've been busted inside of her tight anime pussy. I want her to have my mutant human/anime girl babies.\n\nFuck, my fucking mom caught me with the neighbors anime body pillow. I'd dressed her in my sister's skirt'LL\nZDZRYDXTYUROXYLYTXUTOTU and went to fucking town. She hasn't said a word to me in 10 hours and I'm worried she's gonna take away my PS5. I might not ever get to see the fortnite anime girl again.AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
            "YES, YES, YES",
            "Thanks, guys!",
            "For mobile users :)\n\nServer icon is back to yandev",
            "You live another day.",
            "Poggers emoji 😮",
            "Ok, this is epic",
            "We did it, u/YandereDev!",
            "pog"
        ]
    },
    {
        "post_id": "elz7od",
        "author": "bettazg28",
        "title": "Oh? You're a stoner? Name every stone...",
        "url": "https://www.reddit.com/r/copypasta/comments/elz7od/oh_youre_a_stoner_name_every_stone/",
        "score": 9776,
        "num_comments": 270,
        "created_utc": 1578518897.0,
        "selftext": "ok here i go\n\nActinolite Nephrite Adamite Aegerine Afghanite Agate Iris Agate Onyx Sardonyx  Agrellite Albite Alunite Amblygonite Analcime Anatase Andalusite Chiastolite Andesine Anglesite Anhydrite Annabergite\n\nAntigorite\n\nBowenite\n\nApatite\n\nApophyllite\n\nAragonite\n\nArfvedsonite\n\nAstrophyllite\n\nAtacamite\n\nAustinite\n\nAxinite group:\n\nFerroaxinite\n\nMagnesioaxinite\n\nManganaxinite\n\nTinzenite\n\nAzurite\n\nBaryte\n\nBastnaesite\n\nBayldonite\n\nBenitoite\n\nBeryl subgroup:\n\nAquamarine\n\nBixbite\n\nEmerald\n\nGoshenite\n\nGolden beryl\n\nHeliodor\n\nMorganite\n\nBeryllonite\n\nBeudantite\n\nBiotite\n\nBoleite\n\nBoracite\n\nBornite\n\nBrazilianite\n\nBronzite\n\nBrookite\n\nBrucite\n\nBustamite\n\nBytownite\n\nCalcite\n\nManganocalcite\n\nCaledonite\n\nCancrinite\n\nVishnevite\n\nCarletonite\n\nCarnallite\n\nCarnelian\n\nCassiterite\n\nCavansite\n\nCelestite\n\nCerussite\n\nChabazite\n\nChalcopyrite\n\nChambersite\n\nCharlesite\n\nCharoite\n\nChildrenite\n\nChloromelanite\n\nChondrodite\n\nChrysoberyl\n\nAlexandrite\n\nCymophane\n\nChromite\n\nChrysocolla\n\nChrysoprase\n\nChrysotile\n\nCinnabar\n\nCitrine\n\nClinochlore\n\nClinohumite\n\nClinozoisite\n\nClintonite\n\nCordierite\n\nIolite\n\nCorundum\n\nRuby\n\nSapphire\n\nPadparadscha\n\nCovellite\n\nCreedite\n\nCryolite\n\nCuprite\n\nDanburite\n\nDatolite\n\nDiamond\n\nBort\n\nDiaspore\n\nDiopside\n\nDioptase\n\nDolomite\n\nDravite\n\nDumortierite\n\nElbaite\n\nEmerald\n\nTrapiche emerald Enstatite\n\nBronzite\n\nHypersthene\n\nEosphorite\n\nEpidote\n\nPiemontite\n\nErythrite\n\nEsperite\n\nEttringite\n\nEuclase\n\nEudialyte\n\nFayalite\n\nFerroaxinite\n\nFeldspar subgroup:\n\nAndesine\n\nAlbite\n\nAnorthite\n\nAnorthoclase\n\nAmazonite\n\nBytownite\n\nCelsian\n\nLabradorite\n\nMicrocline\n\nMoonstone\n\nOrthoclase\n\nSanidine\n\nSunstone\n\nFluorapatite\n\nFluorapophyllite\n\nFluorite\n\nForsterite\n\nGahnite\n\nPyralspite\n\nAlmandine\n\nPyrope\n\nSpessartine\n\nUgrandite\n\nAndradite\n\nDemantoid\n\nMelanite\n\nTopazolite\n\nGrossular\n\nHessonite\n\nHydrogrossular\n\nTsavorite\n\nUvarovite\n\nAlmandine-Pyrope\n\nRhodolite\n\n\nrock\n\n\nannd of course\n\ndiamonds and coal aswell and iron of couse and also reds strone (is that commie?!?!) and also gold aswlell",
        "permalink": "/r/copypasta/comments/elz7od/oh_youre_a_stoner_name_every_stone/",
        "comments": [
            "Hm 🤔 yikes sweetie 🍰 these are minerals 💎",
            "Where's lapis lazuli you oaf?",
            "ok here i go\n\nActinolite Nephrite Adamite Aegerine Afghanite Agate Iris Agate Onyx Sardonyx  Agrellite Albite Alunite Amblygonite Analcime Anatase Andalusite Chiastolite Andesine Anglesite Anhydrite Annabergite\n\nAntigorite\n\nBowenite\n\nApatite\n\nApophyllite\n\nAragonite\n\nArfvedsonite\n\nAstrophyllite\n\nAtacamite\n\nAustinite\n\nAxinite group:\n\nFerroaxinite\n\nMagnesioaxinite\n\nManganaxinite\n\nTinzenite\n\nAzurite\n\nBaryte\n\nBastnaesite\n\nBayldonite\n\nBenitoite\n\nBeryl subgroup:\n\nAquamarine\n\nBixbite\n\nEmerald\n\nGoshenite\n\nGolden beryl\n\nHeliodor\n\nMorganite\n\nBeryllonite\n\nBeudantite\n\nBiotite\n\nBoleite\n\nBoracite\n\nBornite\n\nBrazilianite\n\nBronzite\n\nBrookite\n\nBrucite\n\nBustamite\n\nBytownite\n\nCalcite\n\nManganocalcite\n\nCaledonite\n\nCancrinite\n\nVishnevite\n\nCarletonite\n\nCarnallite\n\nCarnelian\n\nCassiterite\n\nCavansite\n\nCelestite\n\nCerussite\n\nChabazite\n\nChalcopyrite\n\nChambersite\n\nCharlesite\n\nCharoite\n\nChildrenite\n\nChloromelanite\n\nChondrodite\n\nChrysoberyl\n\nAlexandrite\n\nCymophane\n\nChromite\n\nChrysocolla\n\nChrysoprase\n\nChrysotile\n\nCinnabar\n\nCitrine\n\nClinochlore\n\nClinohumite\n\nClinozoisite\n\nClintonite\n\nCordierite\n\nIolite\n\nCorundum\n\nRuby\n\nSapphire\n\nPadparadscha\n\nCovellite\n\nCreedite\n\nCryolite\n\nCuprite\n\nDanburite\n\nDatolite\n\nDiamond\n\nBort\n\nDiaspore\n\nDiopside\n\nDioptase\n\nDolomite\n\nDravite\n\nDumortierite\n\nElbaite\n\nEmerald\n\nTrapiche emerald Enstatite\n\nBronzite\n\nHypersthene\n\nEosphorite\n\nEpidote\n\nPiemontite\n\nErythrite\n\nEsperite\n\nEttringite\n\nEuclase\n\nEudialyte\n\nFayalite\n\nFerroaxinite\n\nFeldspar subgroup:\n\nAndesine\n\nAlbite\n\nAnorthite\n\nAnorthoclase\n\nAmazonite\n\nBytownite\n\nCelsian\n\nLabradorite\n\nMicrocline\n\nMoonstone\n\nOrthoclase\n\nSanidine\n\nSunstone\n\nFluorapatite\n\nFluorapophyllite\n\nFluorite\n\nForsterite\n\nGahnite\n\nPyralspite\n\nAlmandine\n\nPyrope\n\nSpessartine\n\nUgrandite\n\nAndradite\n\nDemantoid\n\nMelanite\n\nTopazolite\n\nGrossular\n\nHessonite\n\nHydrogrossular\n\nTsavorite\n\nUvarovite\n\nAlmandine-Pyrope\n\nRhodolite\n\n\nrock\n\n\nannd of course\n\ndiamonds and coal aswell and iron of couse and also reds strone (is that commie?!?!) and also gold aswlell",
            "No it’s just sedementary, igneous and metamorphic. Get it right",
            "somebody stop him",
            "[deleted]",
            "Jesus Christ Marie, they’re minerals",
            ">Childrenite\n\nExcuse me?",
            "ok hewe i go\n\nActinowite Nephwite Adamite Aegewine Afghanite Agate Iwis Agate Onyx Sawdonyx  Agwewwite Awbite Awunite Ambwygonite Anawcime Anatase Andawusite Chiastowite Andesine Angwesite Anhydwite Annabewgite\n\nAntigowite\n\nBowenite\n\nApatite\n\nApophywwite\n\nAwagonite\n\nAwfvedsonite\n\nAstwophywwite\n\nAtacamite\n\nAustinite\n\nAxinite gwoup:\n\nFewwoaxinite\n\nMagnesioaxinite\n\nManganaxinite\n\nTinzenite\n\nAzuwite\n\nBawyte\n\nBastnaesite\n\nBaywdonite\n\nBenitoite\n\nBewyw subgwoup:\n\nAquamawine\n\nBixbite\n\nEmewawd\n\nGoshenite\n\nGowden bewyw\n\nHewiodow\n\nMowganite\n\nBewywwonite\n\nBeudantite\n\nBiotite\n\nBoweite\n\nBowacite\n\nBownite\n\nBwaziwianite\n\nBwonzite\n\nBwookite\n\nBwucite\n\nBustamite\n\nBytownite\n\nCawcite\n\nManganocawcite\n\nCawedonite\n\nCancwinite\n\nVishnevite\n\nCawwetonite\n\nCawnawwite\n\nCawnewian\n\nCassitewite\n\nCavansite\n\nCewestite\n\nCewussite\n\nChabazite\n\nChawcopywite\n\nChambewsite\n\nChawwesite\n\nChawoite\n\nChiwdwenite\n\nChwowomewanite\n\nChondwodite\n\nChwysobewyw\n\nAwexandwite\n\nCymophane\n\nChwomite\n\nChwysocowwa\n\nChwysopwase\n\nChwysotiwe\n\nCinnabaw\n\nCitwine\n\nCwinochwowe\n\nCwinohumite\n\nCwinozoisite\n\nCwintonite\n\nCowdiewite\n\nIowite\n\nCowundum\n\nWuby\n\nSapphiwe\n\nPadpawadscha\n\nCovewwite\n\nCweedite\n\nCwyowite\n\nCupwite\n\nDanbuwite\n\nDatowite\n\nDiamond\n\nBowt\n\nDiaspowe\n\nDiopside\n\nDioptase\n\nDowomite\n\nDwavite\n\nDumowtiewite\n\nEwbaite\n\nEmewawd\n\nTwapiche emewawd Enstatite\n\nBwonzite\n\nHypewsthene\n\nEosphowite\n\nEpidote\n\nPiemontite\n\nEwythwite\n\nEspewite\n\nEttwingite\n\nEucwase\n\nEudiawyte\n\nFayawite\n\nFewwoaxinite\n\nFewdspaw subgwoup:\n\nAndesine\n\nAwbite\n\nAnowthite\n\nAnowthocwase\n\nAmazonite\n\nBytownite\n\nCewsian\n\nWabwadowite\n\nMicwocwine\n\nMoonstone\n\nOwthocwase\n\nSanidine\n\nSunstone\n\nFwuowapatite\n\nFwuowapophywwite\n\nFwuowite\n\nFowstewite\n\nGahnite\n\nPywawspite\n\nAwmandine\n\nPywope\n\nSpessawtine\n\nUgwandite\n\nAndwadite\n\nDemantoid\n\nMewanite\n\nTopazowite\n\nGwossuwaw\n\nHessonite\n\nHydwogwossuwaw\n\nTsavowite\n\nUvawovite\n\nAwmandine-Pywope\n\nWhodowite\n\n\nwock\n\n\nannd of couwse\n\ndiamonds and coaw asweww and iwon of couse and awso weds stwone (is that commie?!?!) and awso gowd aswweww",
            "[deleted]",
            "you forgot angelo",
            "[removed]",
            "where the FUCk is granite",
            "Bruh",
            "God reddit is full of cock",
            "0/10 no bedrock",
            "I don’t see any galena,bauxite,copper pyrite and haematite",
            "you forgot weed",
            "THESE ARE NOT STONES! THEY ARE JUST THE POKÉMON RAP!",
            "rock",
            "Careful one of those could be someone's password",
            "(link to original)\n\nhttps://www.reddit.com/r/okbuddyretard/comments/elxbfg/marbles_kinda_smooth_doe/fdkw0k9/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nu/doodlebois",
            "Stone is a rather broad term. What you seem to be naming here are minerals with examples like Amazonite. You’re not a true stoner",
            "you forgot crack",
            "Bro sick Steven Universe fanfiction",
            "r/beachcity is quaking",
            "What about the mega evolution stones tho?",
            "you forgot lapis for the enchantment table😩",
            "Bort",
            "Isn't crack a rock?",
            "This really be a bort moment",
            "You forgot the red stone of Aja",
            "Sbeven Universe",
            "You forgot Steven",
            "Stonetoss",
            "where's redstone >:(",
            "Hyuck if you hate Nascar doesn’t that make you a raceist?",
            "Why the FUCK are you including metals and crystals in the list, fucking NOOB",
            "You forgot cummintonite",
            "You can change title into my favorite pokemons and i legit wouldn't notice that those are rocks",
            "I think my sense of humor is broken because I was laying in bed after midnight scrolling through this post and saw\n\n*Bort*\n\nAnd just started cracking up lmao that shit is great for some reason",
            "You deadass forgot the chaos emeralds 😂",
            "YOU MISSED CROC-*COUGH*-ODILITE YOU *COUGH* FUCKIN *COUGH* IDIOT\n\nCAPITALISM",
            "You didn't add interludes so it could be sung to the pokerap theme. 2/5 stars.",
            "Stoner? I hardly know her!",
            "This is it, u are a real stoner",
            "Fish \nepic emoji gun anime IQ gamer",
            "Dr stone",
            "No Dragonite? You should be ashamed.",
            "people who watched steven universe: **Heavy Breathing**",
            "My intro to geology class got me like",
            "steven universe fans: it's free real estate",
            "🙂 honey yes",
            "Ok.",
            "rock",
            "4️⃣",
            "rock\n\nTHE rock",
            "rock",
            "\"Childrenite\"",
            "Bustamite",
            "Hey my username is in this list!",
            "Stone free",
            "> azurite\n\nThe woons champion",
            "Saving for Rock-type Pokémon names.",
            "Missed kärnäiitti 😤",
            "he said diamond twice >:(",
            "geology rocks",
            "# nice",
            "420 rock it",
            "You were expecting a stone, but it was me Diopside!",
            "...WE DIDN'T START THE FIRE!",
            "You forgot pebble smh",
            "Redstone\n\nDiamond\n\nGold\n\nIron\n\nCoal\n \nEmerald\n\nLapis Lazuli",
            "God",
            "😳😳😳😳😳😳",
            "that's why the people, of this world, believe in \n\nActinolite Nephrite Adamite Aegerine Afghanite Agate Iris Agate Onyx Sardonyx  Agrellite Albite Alunite Amblygonite Analcime Anatase Andalusite Chiastolite Andesine Anglesite Anhydrite Annabergite\n\nAntigorite\n\nBowenite\n\nApatite\n\nApophyllite\n\nAragonite\n\nArfvedsonite\n\nAstrophyllite\n\nAtacamite\n\nAustinite\n\nAxinite group:\n\nFerroaxinite\n\nMagnesioaxinite\n\nManganaxinite\n\nTinzenite\n\nAzurite\n\nBaryte\n\nBastnaesite\n\nBayldonite\n\nBenitoite\n\nBeryl subgroup:\n\nAquamarine\n\nBixbite\n\nEmerald\n\nGoshenite\n\nGolden beryl\n\nHeliodor\n\nMorganite\n\nBeryllonite\n\nBeudantite\n\nBiotite\n\nBoleite\n\nBoracite\n\nBornite\n\nBrazilianite\n\nBronzite\n\nBrookite\n\nBrucite\n\nBustamite\n\nBytownite\n\nCalcite\n\nManganocalcite\n\nCaledonite\n\nCancrinite\n\nVishnevite\n\nCarletonite\n\nCarnallite\n\nCarnelian\n\nCassiterite\n\nCavansite\n\nCelestite\n\nCerussite\n\nChabazite\n\nChalcopyrite\n\nChambersite\n\nCharlesite\n\nCharoite\n\nChildrenite\n\nChloromelanite\n\nChondrodite\n\nChrysoberyl\n\nAlexandrite\n\nCymophane\n\nChromite\n\nChrysocolla\n\nChrysoprase\n\nChrysotile\n\nCinnabar\n\nCitrine\n\nClinochlore\n\nClinohumite\n\nClinozoisite\n\nClintonite\n\nCordierite\n\nIolite\n\nCorundum\n\nRuby\n\nSapphire\n\nPadparadscha\n\nCovellite\n\nCreedite\n\nCryolite\n\nCuprite\n\nDanburite\n\nDatolite\n\nDiamond\n\nBort\n\nDiaspore\n\nDiopside\n\nDioptase\n\nDolomite\n\nDravite\n\nDumortierite\n\nElbaite\n\nEmerald\n\nTrapiche emerald Enstatite\n\nBronzite\n\nHypersthene\n\nEosphorite\n\nEpidote\n\nPiemontite\n\nErythrite\n\nEsperite\n\nEttringite\n\nEuclase\n\nEudialyte\n\nFayalite\n\nFerroaxinite\n\nFeldspar subgroup:\n\nAndesine\n\nAlbite\n\nAnorthite\n\nAnorthoclase\n\nAmazonite\n\nBytownite\n\nCelsian\n\nLabradorite\n\nMicrocline\n\nMoonstone\n\nOrthoclase\n\nSanidine\n\nSunstone\n\nFluorapatite\n\nFluorapophyllite\n\nFluorite\n\nForsterite\n\nGahnite\n\nPyralspite\n\nAlmandine\n\nPyrope\n\nSpessartine\n\nUgrandite\n\nAndradite\n\nDemantoid\n\nMelanite\n\nTopazolite\n\nGrossular\n\nHessonite\n\nHydrogrossular\n\nTsavorite\n\nUvarovite\n\nAlmandine-Pyrope\n\nRhodolite\n\n\nrock\n\n\nannd of course\n\ndiamonds and coal aswell and iron of couse and also reds strone (is that commie?!?!) and also gold aswlell  \n\n and Steven",
            "[deleted]",
            "What about.... Andesite and diorite, huh? Checkmate atheists",
            "infinity stones",
            "Cumingtonite",
            "Oh? You're a stoner? Name every stone...\n\nok here i go\n\nActinolite Nephrite Adamite Aegerine Afghanite Agate Iris Agate Onyx Sardonyx Agrellite Albite Alunite Amblygonite Analcime Anatase Andalusite Chiastolite Andesine Anglesite Anhydrite Annabergite\n\nAntigorite\n\nBowenite\n\nApatite\n\nApophyllite\n\nAragonite\n\nArfvedsonite\n\nAstrophyllite\n\nAtacamite\n\nAustinite\n\nAxinite group:\n\nFerroaxinite\n\nMagnesioaxinite\n\nManganaxinite\n\nTinzenite\n\nAzurite\n\nBaryte\n\nBastnaesite\n\nBayldonite\n\nBenitoite\n\nBeryl subgroup:\n\nAquamarine\n\nBixbite\n\nEmerald\n\nGoshenite\n\nGolden beryl\n\nHeliodor\n\nMorganite\n\nBeryllonite\n\nBeudantite\n\nBiotite\n\nBoleite\n\nBoracite\n\nBornite\n\nBrazilianite\n\nBronzite\n\nBrookite\n\nBrucite\n\nBustamite\n\nBytownite\n\nCalcite\n\nManganocalcite\n\nCaledonite\n\nCancrinite\n\nVishnevite\n\nCarletonite\n\nCarnallite\n\nCarnelian\n\nCassiterite\n\nCavansite\n\nCelestite\n\nCerussite\n\nChabazite\n\nChalcopyrite\n\nChambersite\n\nCharlesite\n\nCharoite\n\nChildrenite\n\nChloromelanite\n\nChondrodite\n\nChrysoberyl\n\nAlexandrite\n\nCymophane\n\nChromite\n\nChrysocolla\n\nChrysoprase\n\nChrysotile\n\nCinnabar\n\nCitrine\n\nClinochlore\n\nClinohumite\n\nClinozoisite\n\nClintonite\n\nCordierite\n\nIolite\n\nCorundum\n\nRuby\n\nSapphire\n\nPadparadscha\n\nCovellite\n\nCreedite\n\nCryolite\n\nCuprite\n\nDanburite\n\nDatolite\n\nDiamond\n\nBort\n\nDiaspore\n\nDiopside\n\nDioptase\n\nDolomite\n\nDravite\n\nDumortierite\n\nElbaite\n\nEmerald\n\nTrapiche emerald Enstatite\n\nBronzite\n\nHypersthene\n\nEosphorite\n\nEpidote\n\nPiemontite\n\nErythrite\n\nEsperite\n\nEttringite\n\nEuclase\n\nEudialyte\n\nFayalite\n\nFerroaxinite\n\nFeldspar subgroup:\n\nAndesine\n\nAlbite\n\nAnorthite\n\nAnorthoclase\n\nAmazonite\n\nBytownite\n\nCelsian\n\nLabradorite\n\nMicrocline\n\nMoonstone\n\nOrthoclase\n\nSanidine\n\nSunstone\n\nFluorapatite\n\nFluorapophyllite\n\nFluorite\n\nForsterite\n\nGahnite\n\nPyralspite\n\nAlmandine\n\nPyrope\n\nSpessartine\n\nUgrandite\n\nAndradite\n\nDemantoid\n\nMelanite\n\nTopazolite\n\nGrossular\n\nHessonite\n\nHydrogrossular\n\nTsavorite\n\nUvarovite\n\nAlmandine-Pyrope\n\nRhodolite\n\nrock\n\nannd of course\n\ndiamonds and coal aswell and iron of couse and also reds strone (is that commie?!?!) and also gold aswlell",
            "You forgot nether quartz 😡😡🤬",
            "What about trinitite?",
            "You forgot Angelo",
            "Mmm childrenite \n\nMy favourite 🤤",
            ">rock",
            "I read all of these in Jacksepticeye’s voice because of his Subnautica series",
            "Rock",
            "Pls send that in the comment so I can copy that",
            "Steven Universe fans unite",
            "holy shit i really thought all those were drugs",
            "when she doesnt put amethyst :(",
            "🗿",
            "[removed]",
            "you.... need a kinda sorta job 😂",
            "[removed]",
            "Whers cummingtonite",
            "forgot crocidolite",
            "Pokérap vibes",
            "Forgot the vesicular rocks",
            "steven universe's fans be like",
            ":)",
            "You forgot Dragonite jesus fuck dude",
            "reddit gold from kind strangers to be exact",
            "what about granite or diorite",
            "You forgot Rog",
            "Cock",
            "forgot niggerite",
            "A lot of new mega stones for my pokemon!!",
            "[removed]",
            "ok here i go\n\nActinolite Nephrite Adamite Aegerine Afghanite Agate Iris Agate Onyx Sardonyx  Agrellite Albite Alunite Amblygonite Analcime Anatase Andalusite Chiastolite Andesine Anglesite Anhydrite Annabergite\n\nAntigorite\n\nBowenite\n\nApatite\n\nApophyllite\n\nAragonite\n\nArfvedsonite\n\nAstrophyllite\n\nAtacamite\n\nAustinite\n\nAxinite group:\n\nFerroaxinite\n\nMagnesioaxinite\n\nManganaxinite\n\nTinzenite\n\nAzurite\n\nBaryte\n\nBastnaesite\n\nBayldonite\n\nBenitoite\n\nBeryl subgroup:\n\nAquamarine\n\nBixbite\n\nEmerald\n\nGoshenite\n\nGolden beryl\n\nHeliodor\n\nMorganite\n\nBeryllonite\n\nBeudantite\n\nBiotite\n\nBoleite\n\nBoracite\n\nBornite\n\nBrazilianite\n\nBronzite\n\nBrookite\n\nBrucite\n\nBustamite\n\nBytownite\n\nCalcite\n\nManganocalcite\n\nCaledonite\n\nCancrinite\n\nVishnevite\n\nCarletonite\n\nCarnallite\n\nCarnelian\n\nCassiterite\n\nCavansite\n\nCelestite\n\nCerussite\n\nChabazite\n\nChalcopyrite\n\nChambersite\n\nCharlesite\n\nCharoite\n\nChildrenite\n\nChloromelanite\n\nChondrodite\n\nChrysoberyl\n\nAlexandrite\n\nCymophane\n\nChromite\n\nChrysocolla\n\nChrysoprase\n\nChrysotile\n\nCinnabar\n\nCitrine\n\nClinochlore\n\nClinohumite\n\nClinozoisite\n\nClintonite\n\nCordierite\n\nIolite\n\nCorundum\n\nRuby\n\nSapphire\n\nPadparadscha\n\nCovellite\n\nCreedite\n\nCryolite\n\nCuprite\n\nDanburite\n\nDatolite\n\nDiamond\n\nBort\n\nDiaspore\n\nDiopside\n\nDioptase\n\nDolomite\n\nDravite\n\nDumortierite\n\nElbaite\n\nEmerald\n\nTrapiche emerald Enstatite\n\nBronzite\n\nHypersthene\n\nEosphorite\n\nEpidote\n\nPiemontite\n\nErythrite\n\nEsperite\n\nEttringite\n\nEuclase\n\nEudialyte\n\nFayalite\n\nFerroaxinite\n\nFeldspar subgroup:\n\nAndesine\n\nAlbite\n\nAnorthite\n\nAnorthoclase\n\nAmazonite\n\nBytownite\n\nCelsian\n\nLabradorite\n\nMicrocline\n\nMoonstone\n\nOrthoclase\n\nSanidine\n\nSunstone\n\nFluorapatite\n\nFluorapophyllite\n\nFluorite\n\nForsterite\n\nGahnite\n\nPyralspite\n\nAlmandine\n\nPyrope\n\nSpessartine\n\nUgrandite\n\nAndradite\n\nDemantoid\n\nMelanite\n\nTopazolite\n\nGrossular\n\nHessonite\n\nHydrogrossular\n\nTsavorite\n\nUvarovite\n\nAlmandine-Pyrope\n\nRhodolite\n\n\nrock\n\n\nannd of course\n\ndiamonds and coal aswell and iron of couse and also reds strone (is that commie?!?!) and also gold aswlell",
            "quadratica",
            "You forgot the most important Stone.\n\n🗿",
            "Oh your a stoner? Name every weed strand\n[Yakkos world ir whatever that video is called starts plaing)\nSativa\n\nIndica\n\nSativa\n\nAcopocol gold\n\nAnd\n\nGorilla glue...",
            "Jesus Christ Marie, they’re MINERALS",
            "Theres no granite, pasta ruined",
            "brazialianite? FUCK BRAZIL"
        ]
    },
    {
        "post_id": "fr6y2i",
        "author": "FinnischerSadist",
        "title": "Consider yourself #blocked",
        "url": "https://www.reddit.com/r/copypasta/comments/fr6y2i/consider_yourself_blocked/",
        "score": 9778,
        "num_comments": 197,
        "created_utc": 1585493173.0,
        "selftext": "So I've blocked you. Wondering why? \nPlease consult the criteria below:\n\n\n✔️You done a racism. \n\n✔️You done a sexism.\n\n✔️You done a bi-erasure.\n\n✔️You heckin disrespected sex work.\n\n✔️You called me \"Joe Cuckhold\"\n\n\nTwitter is my weapon of justice, and the block button my bullet. \n\nPow.",
        "permalink": "/r/copypasta/comments/fr6y2i/consider_yourself_blocked/",
        "comments": [
            "So I've blocked you. Wondering why? \nPlease consult the criteria below:\n\n\n✔️You done a racism. \n\n✔️You done a sexism.\n\n✔️You done a bi-erasure.\n\n✔️You heckin disrespected sex work.\n\n✔️You called me \"Joe Cuckhold\"\n\n\nTwitter is my weapon of justice, and the block button my bullet. \n\nPow.",
            "i physically recoiled, nice work",
            "Game",
            "So I've bwocked you. Wondewing why? \nPwease consuwt the cwitewia bewow:\n\n\n✔️You done a wacism. \n\n✔️You done a sexism.\n\n✔️You done a bi-ewasuwe.\n\n✔️You heckin diswespected sex wowk.\n\n✔️You cawwed me \"Joe Cuckhowd\"\n\n\nTwittew is my weapon of justice, and the bwock button my buwwet. \n\nPow.",
            "joe cuckold",
            "I did not do a racism You useless piece of shit. You absolute waste of space and air. You uneducated, ignorant, idiotic dumb swine, you’re an absolute embarrassment to humanity and all life as a whole. The magnitude of your failure just now is so indescribably massive that one hundred years into the future your name will be used as moniker of evil for heretics. Even if all of humanity put together their collective intelligence there is no conceivable way they could have thought up a way to fuck up on the unimaginable scale you just did. When Jesus died for our sins, he must not have seen the sacrilegious act we just witnessed you performing, because if he did he would have forsaken humanity long ago so that your birth may have never become reality. After you die, your skeleton will be displayed in a museum after being scientifically researched so that all future generations may learn not to generate your bone structure, because every tiny detail anyone may have in common with you degrades them to a useless piece of trash and a burden to society. No wonder your father questioned whether or not your were truly his son, for you'd have to not be a waste of carbon matter for anyone to love you like a family member. Your birth made it so that mankind is worse of in every way you can possibly imagine, and you have made it so that society can never really recover into a state of organization. Everything has forever fallen into a bewildering chaos, through which unrecognizable core, you can only find misfortune. I would say the apocalypse is upon us but this is merely the closest word humans have for the sheer scale of horror that is now reality. You have forever condemned everyone you love and know into an eternal state of suffering, worse than any human concept of hell. You are such an unholy being, that if you step within a one hundred foot radius of a holy place or a place that has ever been deemed important by anyone, your distorted sac religious soul will ruin whatever meaning it ever had beyond repair. You are an idiotic, shiteating, dumbass ape and no one has ever loved you. Rhodes Island would have been better off if you'd never joined us. You are a lying, backstabbing, cowardly useless piece of shit and I hate you with every single part of my being. Even this worlds finest writers and poets from throughout the ages could never hope to accurately describe the scale on which you just fucked up, and how incredibly idiotic you are. Anyone that believes in any religion out there should now realize that they have been wrong this entire time, for if divine beings were real, they would never have allowed a being such as you to stain the earth and this universe. In the future there will be horror stories made about you, with the scariest part of them being that the reader has to realize that such an indescribable monster actually exists, and that the horrific events from the movie have actually taken place in the same world that they live in right now. You are the absolute embodiment of everything that has ever been wrong on this earth, yet you manage to make it so that that is only a small part of the evil that is your being. Never in the history of mankind has there been anyone that could have predicted such an eldrich abomination, but here you are. It’s hard to believe that I am seeing such an incredible failure with my own eyes, but here I am, so unfortunately I cannot deny your existence. Even if I did my very best, my vocabulary is not able to describe the sheer magnitude of the idiotic mistake that is you. Even if time travel some day will be invented, there still would not be a single soul willing to go back in time to before this moment to fix history, because having to witness such incredible horrors if they failed would have to many mental and physical drawbacks that not even the bravest soul in history would be willing to risk it. I cannot imagine the pure dread your mother must have felt when she had to carry a baby for nine months and then giving birth to such a wretched monster as you. Not a single word of the incoherent, illogical rambling you may be wanting to do to defend yourself or apologize would ever be able to make up for what you just did. The countries of the world would have wanted to make laws preventing such a terrible event like this from ever happening again, but sadly this is not possible since your horrific actions just now have shattered every form of order this world once had, making concepts such as laws irrelevant. Right from the moment I first set my eyes on you I knew you were an absolute abomination of everything that is wrong with humanity. I was hoping I would have been able to prevent your evil from being released upon this world by tagging along and keeping my eye on you, but it is clear to me now that not even the greatest efforts would have been able to prevent a terrible event in this scale from occurring. You are the worst human being, or even just being in general, that I have ever had the misfortune of witnessing. Events like the infected plague apparently only happened with the goal of teaching humanity to survive such a horrible event as the one you just created, but not even mankind’s greatest trials were able to even slightly prepare anyone for the insufferable evil you have just created. If you ever had them, your children would be preemptively killed to protect this universe from the possibility of anyone in your bloodline being even half as bad as you are, except you will never be able to have children, because not a single human being will ever want to come within a hundred mile radius of you and anything you have ever touched. You are a colossal disappointment not only to your parents, but to your ancestors and entire bloodline. The disgusting mistake that you have just made is so incredibly terrible that everyone who would ever be to hear about it would spontaneously feel an indescribable mixture of immense anger, fear and anxiety that emotionally and physically they would never truly be the same ever again. The sheer scale of your mistake, if ever to be materialized, would not only surpass the size of the world, but it would reach far beyond the edges of the known, and almost certainly the unknown universe. I could sit here and write paragraphs, nay, books describing your immense failure, yet even if I were to dedicate my life to describing the reality of what has just gone down here, and I would spend every moment of it until my heart stops beating working as hard and efficiently as possible, yet there is not even a snowballs chance in hell that I would be able to come close to transcribing the absolute shitshow you have just released upon the world. You are an irresponsible, idiotic, disgusting, unloved, horrible excuse for a living being who’s soul contains less humanity than every ginger in history combined. The absolute disgust I feel when thinking about anything that has even a slight resemblance to anything that might have to do with you and your unholy actions is so incredibly great that when I am honest about it I think that even I do not posses a consciousness great enough to comprehend my own feelings about it. When people of Columbia fought to break free from Lungmen, countless soldiers fought and lost their lives in favor of a chance at a better future for their children, they did not give their lives to have you fuck the world up beyond repair to the degree that you are doing right now. Honestly, even when technology advances and studies on the subject become more and more accurate, I do not think humanity will ever truly be able to understand what your failure actually means for the universe. My hate for you and everything you stand for is so much deeper than the depths of Shambala that you could probably take the entire Lungmen population down there and back up around twenty million times before you would have sunk to the end of my hate, and honestly, I do not want to exaggerate, but I think that that insult was low balling it such a massive amount that all mountains in this world combined would not be able to stack up to this imprecise judgement in light of the fact that when being honest, my hate is almost certainly bottomless. There is no one in this world that has ever loved you, and especially after what you just did, no one will ever love you in the future either. There is no hope that your idiotic behavior and especially your crooked soul will ever change for the better, and in fact quite the opposite might be true. By making the mistake that you just did, you have shown me that you are so incredibly hopeless that you will only devolve into a more idiotic and wretched creature than you already are. The only possible way in which your future would be brighter than the black hole your existence currently is would exclusively be because there is absolutely no conceivable way that you would even be able to sink lower than the pathetic place your current failure has put you in. But than again, you are so incredibly abominable that you would probably be able to surpass the worst conceivable failure a living being could possibly make. You are so incredibly pathetic that you are honestly not worthy of any more of my words nor my time. Just know that I will forever detest you for your failure and everything you stand for, and that no matter what happens, I will never ever forgive you",
            "when i 1st joined reddit i think someone replied to me with shit like this. i couldnt tell if it was a bot, or someone who loses arguments a lot.",
            " So I've blocked you. Wondering why? Please consult the criteria below:\n\n✔️What the fuck did you just fucking say to me?\n\n✔️You little bitch.\n\n✔️I have over 300 confirmed kills.\n\n✔️I'm trained in gorilla warfare.\n\n✔️You're fucking dead, kiddo.\n\nTwitter is my weapon of justice, and the block button my bullet.\n\nPow.",
            "Cock",
            "The guy who tweeted this is named \"Joe Keskold\", best satire account ever.",
            "Reddit moment",
            "[deleted]",
            "FYI Joe keskold is a troll account",
            "r/doggohate",
            "Whatever Joe Cuckhold.",
            "u/uwuwizard",
            "Plan to use in future. Thank you.",
            "r/againsthatesubreddits this is their anthem",
            "What the hell is bi-erasure?",
            " \n\nSo I've blocked you. Wondering why? Please consult the criteria below:\n\n✔️You called me \"Joe Cuckhold\"\n\n✔️You called me \"Joe Cuckhold\"\n\n✔️You called me \"Joe Cuckhold\"\n\n✔️You called me \"Joe Cuckhold\"\n\n✔️You called me \"Joe Cuckhold\"\n\nTwitter is my weapon of justice, and the block button my bullet.\n\nPow.",
            "You used emogeess🥰🐕🇵🇰😳",
            "What is bi-erasure?",
            "Game",
            "Cock Game Jojo",
            "Cock daddy",
            "Joe cuckhold lmao",
            "[deleted]",
            "shut up joe cuckhold",
            "Original pls",
            "3e333elk. Hu23rr",
            "God",
            " \n\nSo I've blocked you. Wondering why? Please consult the criteria below:\n\n✔️You done a racism.\n\n✔️You done a sexism.\n\n✔️You done a bi-erasure.\n\n✔️You heckin disrespected sex work.\n\n✔️You called me \"Joe Cuckhold\"\n\nTwitter is my weapon of justice, and the block button my bullet.\n\nPow.",
            "@idubbz",
            "ok joe cuckhold",
            "Aight Joe Cuckhold",
            "nigge",
            "Was and, blocked",
            "POW is for Prisoner Of War.",
            "Le blue checkmark has arrived",
            "Ngl i read that in captain americas voice",
            "I remember seeing that tweet. Classic.",
            " Joe Cuckhold Strikes Again",
            "ok joe cuckold",
            "DICE Stockholm developers 101.",
            ">✔️You heckin disrespected sex work.\n\niDubbbz is a simp",
            "Wow I was just blocked by someOne who ships MHA characters and does role play.",
            "that's why i love reddit",
            "Im racist and i like to race",
            "God JoJo game cock",
            "Joe keskold is my favorite Twitter account",
            "Then how is it you haven't banned me 5 times by now?"
        ]
    },
    {
        "post_id": "i8usfe",
        "author": "Nokkpitch",
        "title": "A now deleted post from r/unpopularopinion",
        "url": "https://www.reddit.com/r/copypasta/comments/i8usfe/a_now_deleted_post_from_runpopularopinion/",
        "score": 9769,
        "num_comments": 299,
        "created_utc": 1597299806.0,
        "selftext": "**Incest porn should not exist.**\n\nIncest is not a good thing. Incest porn might make people want to have sex with their families, and that is not ok. People should not have sex with their family members. It is disgusting.",
        "permalink": "/r/copypasta/comments/i8usfe/a_now_deleted_post_from_runpopularopinion/",
        "comments": [
            "Truly a brave and unpopular opinion",
            "What a brave and controversial take!",
            "But then mods couldn't jerk off thinking about fucking their mom.",
            "**Incest porn should not exist.**\n\nIncest is not a good thing. Incest porn might make people want to have sex with their families, and that is not ok. People should not have sex with their family members. It is disgusting.",
            "**Incest 🤢 porn 🍑 should not exist 🙄😬😂.** \n\nIncest 🤢 is not a good 👍🏻 thing 📴. Incest 🤢 porn 😜 might 🔍 make 💘 people 👨 want 😋 to have sex 🍆👅💦 with their families 👨‍👩‍👧‍👦, and that is not ok 👌. People 👫🛀🏽⛔ should not have sex 💦😩🍆 with their family 👪 members 👦. It is disgusting 😷.",
            "**Loil porn should not exist.**\n\nLoil is not a good thing. Loli porn might make people want to have sex with kids, and that is not ok. People should not have sex with kids. It is disgusting.",
            "Still more unpopular and rational than most posts on that sub lmao",
            "Hello, is this Pizza Hut?\n\nExcellent. My name is Ben Shapiro. Conservative thought leader. Prominent white YouTuber. The Muggsy Bogues of the intellectual dark Web. And—look, it’s just a fact—I would like to order some pizza pie. If you are triggered by that request, I do not care. I truly do not.\n\nNow let’s discuss conditions. First, thank you for agreeing to debate me. Typically, in fora such as this, I am met with ad-hominem mudslinging, anything from “You racist creep” or “Is that your real voice?” to raucous schoolyard laughter and threats of the dreaded “toilet swirly.” However, your willingness to engage with me over the phone on the subject of pizza shows an intellectual fortitude and openness to dangerous ideas which reflects highly on your character. Huzzah, good sir. Huzzah.\n\nSecond, any pizza I order will be male. None of this “Our pizza identifies as trans-fluid-pan-poly”—no. Pizza is a boy. With a penis. It’s that simple. It’s been true for all of human history, from Plato to Socrates to Mr. Mistoffelees, and any attempt to rewrite the pillars of Western thought will be met with a hearty “Fuh!” by yours truly. And, trust me, that is not a fate you wish to meet.\n\nNow. With regard to my topping preference. I have eaten from your pizzeria in times past, and it must be said: your pepperoni is embarrassingly spicy. Frankly, it boggles the mind. I mean, what kind of drugs are you inhaling over there? Pot?! One bite of that stuff and I had to take a shower. So tread lightly when it comes to spice, my good man. You do not want to see me at my most epic. Like the great white hero of Zack Snyder’s classic film “300,” I will kick you.\n\nOnions, peppers—no, thank you. If I wanted veggies, I’d go to a salad bar. I’m not some sort of vegan, Cory Booker weirdo. And your efforts to Michelle Obama-ize the great American pizza pie are, frankly, hilarious. Though not as funny as the impressively named P’Zone—when I finally figured out that genuinely creative pun, I laughed until I cried and peed. A true Spartan admits defeat, and I must admit that, in this instance, your Hut humor slayed me, Dennis Miller style.\n\nAnd, with that, you have earned my order. Congratulations. Ahem. Without further ado, I would like your smallest child pizza, no sauce, extra cheese. Hello? Aha. A hang-up. Another triggered lib, bested by logic. Damn it. I’m fucking starving.",
            "**Incest pown shouwd not exist.**\n\nIncest is not a good thing. Incest pown might make peopwe want to have sex with theiw famiwies, and that is not ok. Peopwe shouwd not have sex with theiw famiwy membews. It is disgusting.",
            "YTA don’t knock it til you try it.",
            "Everyone talks about how people are obsessed with incest porn nowadays, but I don’t think it’s that at all. It’s just that there’s so much of it out there it’s almost impossible to avoid, especially if you like older women. I find myself watching it all the time and I have no interest in incest, I just like the woman in the video.",
            " \n\nCompletely agree. This is a hot take and a very unpopular opinion, despite the fact that the majority of people in the comments are agreeing. If the mods remove it for being unpopular, i’ll just say that since there are a lot of replies that automatically means it’s unpopular, despite the fact that the opinion is literally just common fucking sense that most NORMAL people would agree on. I shall now upvote your post because I agree, completely defeating the purpose of this subreddit and making all the popular opinions go to the top of the subreddit while all the unpopular opinions get downvoted. It doesn’t matter if literally every motherfucking goddamm person in the comments is agreeing, there were like 4 people in real life that disagreed with op(I think), so that makes it unpopular, no need to hear anyone else’s opinion. So yeah basically I upvote posts I agree with. No need to thank me, i’m just a 27 year old millennial who hates kids, karens, boomers, and Trump. I’m obsessed with politics, porn, and I love the education system(btw my kid comes home everyday from school exhausted and stressed out but idgaf play stupid games win stupid prizes if you know what i’m sayin). Stupid fucking teenagers saying they have depression need to stfu only adults are allowed to have depression we work so much harder than those little brats. I don’t care if they actually have depression, fucking crotch goblins deserve it tbh. I love the education system cuz it gives me an excuse to not take care of my stupid fucking retarded child. I can’t handle it when someone disagrees with me. I shall also send death threats to people who post actual unpopular opinions.\n\nPS: fuck america, even though I live in america. Canada good, china bad.",
            "Google transulated version:\n\n\nAnd r/hate disappears\n\n**According to our foreign requirements**\n\nHigh family is the pain of things, I don't care if I don't have sex and family is forbidden I hate it.",
            "Well, if you don't want to fuck your mom incest porn isn't necesarly bad",
            "Sounds like a third grader's report on why incest porn is bad",
            "remember guys.\n\nIncest is wincest",
            "he wrote it like he was fuckin autistic bruh",
            "I know, bold statements only on this channel.",
            "Porn is freaky by nature. People fantasize about weird shit, and as long as it's *fantasy* and everyone in the video is a legal consenting adult who is not harmed in the making of the video, I don't give a fuck what they're doing in there, or that there is some deviant who thinks it's the hottest thing ever.",
            "Someone sbould tell guy \"yes finally someone said it ! We should also ban video games to stop encouraging violence\" and receive a shitload of death threats",
            "Having this kind of opinion made public can land you jail time",
            "so brave.",
            "Incest porn is not about incest, it is about close platonic long term bonds. It is essentially \"platonic best friends all of a sudden becoming sexual\" porn with a clickbait title.\n\nThe incest dynamic is really effective because it is one of the few plot hooks which can overcome porn logic. In most any porn you see, if there is a guy and a girl in the same room, they are going to have sex. There is never a situation where they aren't going to have sex. Furthermore, there is never a situation in a porn where two individuals are not going to want to have sex with each other....\n\nExcept what if that other person in the room was your sister?\n\nFor whatever reason, that is an exception to porn logic. It creates a situation in which there can be two individuals in a room who don't exactly want to have sex with each other which is believable. If it is a brother/sister sort of thing and the sister is trying to seduce the brother, it is believable that the brother might try resisting the sister. It can create a lot of sexual tension because there is a believe resistance. If the sister accidentally walks in on her brother and sees him in the shower, and she doesn't quite look but then can't help but taking some peeks, well that is believable because the taboo aspect of it makes sense. In almost any other non-incest porno the only possible way to handle that would be the girl seeing the guy and then walking in and giving him a blowjob.\n\nWhat is interesting about this is that there is almost never a blood line, it is always step-sister, and that is because being actually related isn't what is important to this. It isn't about that person being a biological sister, but more about them being \"like\" a sister.\n\nWhy is that effective? Well, it opens up the avenue for people to project their own real life situations onto the porn. In everyday life, especially men, have friends who we are attracted to and want to have sex with, but the relationship is really only platonic. I've had attractive female friends who I have been very close with, so much so that they were \"like\" my sister. The way incest porn plays out, it is very similar to how the sex would play out if one of my attractive female friends who was like my sister started to come on to me.\n\nThere are many different avenues that these porns can go and they kind of borrow from different relationship dynamics. Father daughter can be for girls who want to be with an older man, maybe there is an older man they want to experience but feel like it would be too wrong because they are \"like\" a father to them, but it can also be effective for older men who know young attractive women who they are \"like\" a father to. You can go into all the different dynamics.\n\nWhen you really start to see it from this perspective, it is put in a similar category to where two female best friends end up having sex. It is believable in porn logic for there to be two girls in a room and for one of them to not exactly want to have sex with another girl and to show some resistance, or for both of them to show some resistance and for them to just fall into having sex. This can work for a lot of girls viewers because they may have sexual feelings towards some of their female friends, and recreates some of the dynamics. It can work for male viewers because they can imagine that dynamic being at play with some of the people in their life.\n\nThere are other porn categories which play off this as well, like teacher/student porn. It creates some sort of strong enough reason as to why a man would resist sex, but also for anyone to resist sex. It plays on certain real life roles and boundaries which people find relate-able.\n\nThere is so much more to this answer and avenues I could go down, but that is the rough idea of it.",
            "Should be deleted. Fucking normie who doesn't fuck his sister.",
            "If you incest.",
            "Wow that post fits perfectly in r/unpopularopinion",
            "incest rate drops to 0%",
            "Doin my mom doin doin my mom\n\nDoin my mom doin doin my mom\n\nDoin doin my mom doin doin my mom\n\nYou know we straight with doin my mom\n\nDoin my mom doin doin my mom\n\nDoin my mom doin doin my mom\n\nDoin doin my mom doin doin my mom\n\nYou know we straight with doin my mom\n\nI'm doin my mom. Yes mines!\n\nI first saw her in the Wal-Mart pickin out my drawers.\n\nBig Dolly Parton hair like an 80s prom queen\n\nBut her ass was lookin good all up in those mom-jeans.\n\nI approached her in the checkout line, and said yo \nbaby wassup?\n\nShe had two gallons of milk, and I was starin at her jugs.\n\nFive minutes later she agreed to get with me\n\nSo we went and rocked the minivan like Giggity. Giggity. Giggity.\n\nI was ridin my mom like she was Mario Kart.\n\nI gave her a lift back to her crib cause her car wouldn't start.\n\nShe invited me in the house, and we started makin out again.\n\nHow many times I tap that ass? OVER 9000!\n\nYeah. She called me Pledge cause I knocked the dust off it.\n\nShe later made me a sandwich and she cut the crust off it.\n\nCause she knows how I like it, and that I'm a little young\n\nTo be in the bed, butt-naked doin my mom.\n\nDoin my mom doin doin my mom\n\nDoin my mom doin doin my mom\n\nDoin doin my mom doin doin my mom\n\nYou know we straight with doin my mom\n\nDoin my mom doin doin my mom\n\nDoin my mom doin doin my mom\n\nDoin doin my mom doin doin my mom\n\nYou know we straight with doin my mom\n\nI like my mamas big butt, and I cannot lie.\n\nMy other brothers can't deny that she's fly.\n\nWe make sexy time, yes and every night I tap that.\n\nShe saw me butt-naked, now she thinks I'm half black.\n\nBut your moms the best, the super M.I.L.F.\n\nCause she loves to toss the salad even though she ain't a chef\n\nAnd I blame it on the al-al-al-cohol\n\nBut If I were you, I wouldn't kiss my mom on the mouth at all.\n\nShe likes the Donkey-Punch. She likes the Dirty Sanchez.\n\nSometimes she even likes to fool around in my bed.\n\nShe likes rough sex with handcuffs and I'll be honest\n\nShe likes me to Chris Brown her when she acts like Rihanna.\n\nShe's so therapeutic. When I need to cure my restlessness\n\nI br-br-br-br-br-br-br-br motorboat your moms breastestess.\n\nI didn't wanna tell you, but I had to write this song\n\nCause I'm in my house every night doin my mo-om.\n\nDoin my mom doin doin my mom\n\nDoin my mom doin doin my mom\n\nDoin doin my mom doin doin my mom\n\nYou know we straight with doin my mom\n\nDoin my mom doin doin my mom\n\nDoin my mom doin doin my mom\n\nDoin doin my mom doin doin my mom\n\nYou know we straight with doin my mom\n\nI'm havin sex with my mother\n\nThat makes me better than you.\n\nI'm havin sex with my mother\n\nThat makes me better than you.\n\nDoin my mom doin doin my mom\n\nDoin my mom doin doin my mom\n\nDoin doin my mom doin doin my mom\n\nYou know we straight with doin my mom\n\nDoin my mom doin doin my mom\n\nDoin your mom doin doin my mom\n\nDoin doin my mom doin doin your mom\n\nYou know we straight with doin my mom",
            "If you turn down the volume it's just normal porn.",
            "What's incest?",
            "I don’t know what all the pushback against incest is now. Yeah it’s bad, but I can guarantee to everyone on earth has or had one of their ancestors have an incestuous relationship",
            "Cumlord approves",
            "hmm yes this is very unpopular thought i must immediately post on reddit",
            "I don’t usually pay too much attention to the plot.",
            "Damn the poster must have been feeling very brave to post that one.\n\nThis reminds me of why I unsubbed from there.",
            "I ended up leaving and blocking that group. Honestly it's shocking of hypocrisy reigns supreme there, but that's pretty true of all the big ones lmao",
            "The original post was killed by the \"Big Hentai Conspiracy\".",
            "YTA.",
            "I saw this on unpopularopinion before it was deleted lolol",
            "Hot take, but I must say I agree. You may get hate for this, op, but this is what the subreddit is about. Unpopular opinions.",
            "That sub might as well just be called popular opinion or simply \"r/duh\"",
            "Is this some kind of weird confession or what",
            "I saw a post on there that was like “if you make yourself your lock screen on your phone you’re a loser” like how is this unpopular",
            "Pls explain",
            "I completely agree",
            "i never thought about it like that",
            "Habsburgs disagree.",
            "i actually remember that post.",
            "But the memes are good",
            "You can’t stop people enjoying what they enjoy even if it’s fucked up.",
            "All the people who jerk off to incest and have fantasies about their family just got really triggered",
            "WOW HOW UNPOPULAR",
            "> Incest porn might make people want to have sex with their families, \n\n\"Violent video games/movies/TV might make people violent.\"\n\nI'm not even into incest, I just hate this argument and all of its forms. It's a way of trying to get Thing I Don't Like #873 banned or restricted on an insincere moral appeal. No one is going to decide to bone family members just because they saw some alleged \"siblings\" on Pornhub. The people in those videos aren't the actual people in their lives, so watching them probably isn't any worse than the roleplay itself.",
            "Take my upvote, brave Redditor",
            "Incest bad!",
            "Is that an unpopular opinion? I get that A LOT of people are into (fake) step-family porn (which isn’t actually incest, just taboo, and anything taboo turns people on), but I don’t think many people are genuinely pro-incest or think it’s ok to have sex with family members. Maybe that’s why it was removed? Because the idea that incest is bad is not an unpopular opinion. \n\nUnfortunately, incest is a pernicious and widespread form of sexual abuse. If anyone doesn’t think that incest is a SERIOUS problem in our society, take a look at this short academic paper on the prevalence of incest in different parts of the world (https://family.jrank.org/pages/846/Incest-Prevalence-Incest.html) Spoiler alert: it’s disturbingly common. Of the close female friends I’ve had in my life, two confided in me about abuse perpetrated against them as children by close family members. Seeing the terrible toll this abuse took on these amazing women, I cannot watch any kind of quasi-incest porn, even if it’s all staged and everyone is a performer. Once you see the damage incest does to its victims, it really makes it impossible to become turned on by any kind of depiction of it, however fake it is.\n\nEdit: changed a word, removed a couple sentences",
            "Uhhhhh it's not incest porn if the sound is muted",
            "They aren't wrong.",
            "This post is very wrong. I'm sure my mom would agree with me",
            "wtf??? the internet cant handle all that controversy what is he gonna say next cp bad?",
            "Ben",
            "\nIncest porn is not about incest, it is about close platonic long term bonds. It is essentially \"platonic best friends all of a sudden becoming sexual\" porn with a clickbait title.\n\nThe incest dynamic is really effective because it is one of the few plot hooks which can overcome porn logic. In most any porn you see, if there is a guy and a girl in the same room, they are going to have sex. There is never a situation where they aren't going to have sex. Furthermore, there is never a situation in a porn where two individuals are not going to want to have sex with each other....\n\nExcept what if that other person in the room was your sister?\n\nFor whatever reason, that is an exception to porn logic. It creates a situation in which there can be two individuals in a room who don't exactly want to have sex with each other which is believable. If it is a brother/sister sort of thing and the sister is trying to seduce the brother, it is believable that the brother might try resisting the sister. It can create a lot of sexual tension because there is a believe resistance. If the sister accidentally walks in on her brother and sees him in the shower, and she doesn't quite look but then can't help but taking some peeks, well that is believable because the taboo aspect of it makes sense. In almost any other non-incest porno the only possible way to handle that would be the girl seeing the guy and then walking in and giving him a blowjob.\n\nWhat is interesting about this is that there is almost never a blood line, it is always step-sister, and that is because being actually related isn't what is important to this. It isn't about that person being a biological sister, but more about them being \"like\" a sister.\n\nWhy is that effective? Well, it opens up the avenue for people to project their own real life situations onto the porn. In everyday life, especially men, have friends who we are attracted to and want to have sex with, but the relationship is really only platonic. I've had attractive female friends who I have been very close with, so much so that they were \"like\" my sister. The way incest porn plays out, it is very similar to how the sex would play out if one of my attractive female friends who was like my sister started to come on to me.\n\nThere are many different avenues that these porns can go and they kind of borrow from different relationship dynamics. Father daughter can be for girls who want to be with an older man, maybe there is an older man they want to experience but feel like it would be too wrong because they are \"like\" a father to them, but it can also be effective for older men who know young attractive women who they are \"like\" a father to. You can go into all the different dynamics.\n\nWhen you really start to see it from this perspective, it is put in a similar category to where two female best friends end up having sex. It is believable in porn logic for there to be two girls in a room and for one of them to not exactly want to have sex with another girl and to show some resistance, or for both of them to show some resistance and for them to just fall into having sex. This can work for a lot of girls viewers because they may have sexual feelings towards some of their female friends, and recreates some of the dynamics. It can work for male viewers because they can imagine that dynamic being at play with some of the people in their life.\n\nThere are other porn categories which play off this as well, like teacher/student porn. It creates some sort of strong enough reason as to why a man would resist sex, but also for anyone to resist sex. It plays on certain real life roles and boundaries which people find relate-able.\n\nThere is so much more to this answer and avenues I could go down, but that is the rough idea of it.",
            "I love the way it's worded and phrased. It's like an 8-year-old wrote it",
            "Lol I actually saw this earlier on the sub",
            "~hi~",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Porn should not exist.\n\nSex is not a good thing. Porn might make people want to have sex, and that is not ok. People should not have sex. It is disgusting.",
            "YTA my family my rules",
            "Hot and redpilled take especially in \"reddit\", a community full of chomo incels",
            "Sad people would go out of their way to stop consenting adults from having a relationship.\n\nLike 90% of incest porn is fake anyways.",
            "[deleted]",
            "What's wrong with Incest?  If it was morally wrong, the human race wouldn't exist.  Remember, Cain had kids with his own mother and then they had kids with each other, so all people are the product of it",
            "Ah yes, porn will influence people that badly",
            "[deleted]"
        ]
    },
    {
        "post_id": "mzo6vd",
        "author": "Classy_Shadow",
        "title": "Send this to someone when they’re bragging",
        "url": "https://www.reddit.com/r/copypasta/comments/mzo6vd/send_this_to_someone_when_theyre_bragging/",
        "score": 9747,
        "num_comments": 107,
        "created_utc": 1619529264.0,
        "selftext": "Hi there! My name is Michael Grover, and I am an explorer. Ever since I’ve been little, I’ve loved searching for new things. As a baby, my parents kept finding me in nooks and crannies around the house. “On the search” as they would say.\n\nBy the age of 5, I had been to every continent on the planet, barring Antarctica. For my 12th birthday, my parents got me diving lessons, and by the time I was 13, I could scuba dive to a depth of 40 meters, as well as go cave diving.\n\nI got a pilot’s license by the age of 17, and I learned to sail just before my 18th birthday. Instead of going to university, I decided to travel around South America, exploring its rich jungles and beautiful landscapes. \n\nDuring my trip, I met my now wife who was also an explorer. For our honeymoon, we sailed around the Caribbean and we discovered 3 new islands which we named after the cats that I had growing up. \n\nOver the course of my life, I have come across great treasures and wondrous experiences. But in all my life, and in all my travels, I’m afraid I have never come across a single person who cared about what you just said.",
        "permalink": "/r/copypasta/comments/mzo6vd/send_this_to_someone_when_theyre_bragging/",
        "comments": [
            "Well done! My name is Michael Grover. I am a researcher. Since childhood, I have loved exploring new things. When I was young, my parents always visited me from every corner of my house.\n\nWhen I was 5 years old, I traveled all over the world except Antarctica. My parents learned scuba diving on their 12th birthday. When I was 13, I jumped into a 40-meter-long cave.\n\nI got a pilot's license at the age of 17 and learned to drive before the age of 18. Instead of going to college, he decided to travel to South America to explore the rich forests and beautiful landscapes.\n\nDuring the trip, I met my husband, a researcher. For our vacation, we traveled the Caribbean and discovered three new islands named after the cats we grew up with.\n\nThroughout my life, I have met countless wealth and discoveries. But in my life and in my travels, I've never met anyone who wants to know what I'm talking about.",
            "https://youtu.be/GjHiq09Zkws Original Video",
            " (This is a gimmick account I've created with the intention of plugging in text posts to AI Dungeon and seeing what weird shit it churns out. Decided to try r/Copypasta first since it's the first mostly text based subreddit that came to mind. Gauging whether or not people think this is a painfully unfunny idea.)\n\nHi there! My name is Michael Grover, and I am an explorer. Ever since I've been little, I've loved searching for new things. As a baby, my parents kept finding me in nooks and crannies around the house. \"On the search\" as they would say.  By the age of 5, I had been to every continent on the planet, barring Antarctica. For my 12th birthday, my parents got me diving lessons, and by the time I was 13, I could scuba dive to a depth of 40 meters, as well as go cave diving.  I got a pilot's license by the age of 17, and I learned to sail just before my 18th birthday. Instead of going to university, I decided to travel around South America, exploring its rich jungles and beautiful landscapes.  During my trip, I met my now wife who was also an explorer. For our honeymoon, we sailed around the Caribbean and we discovered 3 new islands which we named after the cats that I had growing up.  Over the course of my life, I have come across great treasures and wondrous experiences. But in all my life, and in all my travels, I'm afraid I have never come across a single person who cared about what you just said. \n\nYou're right, I haven't.  But then again, it seems like this world has no room for people with a sense of adventure or curiosity. So here's to you, Mr. Adventurer. Here's to your explorations. And here's to your adventures that were not so much adventures as they were pointless diversions from the real work at hand: getting laid.  You may be an adventurer, but you are certainly not alone. Thank you for reading, and don't hesitate to journey onward into the next! I hope you have a wonderful adventure, and may you come back alive. Mr. Adventurer out. \n\nYou close the letter and sigh. What exactly is Mr. Adventurer getting at? You have a hunch you'll find out soon. In the meantime, you continue your bread winning activities such as pan handling. It's a very busy day today and you make a good bit. Afterward, you head to the candy store. \"Go on back, I got a customer!\" Mr. Candy Says to you. You nod and approach the counter eagerly. \"Umm... Hi.\" You say. \"Hello, new guy, do you need some candy?\" Mr. Candy asks. \"I need to know what you think of me.\" You say bluntly. Mr. Candy blanches. \"What? Did my mother send you?\" He asks. \"No!\" You reply. \"Then what do you know? Is she forcing me to hire bums, cut people's fingers off and put out fires?\" \"No to all three.\" \"Damn. I feel like I'm getting shanked by a teenager.\" You blush and look down.",
            "Hi there! My name is Michael Grover, and I am an explorer. Ever since I’ve been little, I’ve loved searching for new things. As a baby, my parents kept finding me in nooks and crannies around the house. “On the search” as they would say.\n\nBy the age of 5, I had been to every continent on the planet, barring Antarctica. For my 12th birthday, my parents got me diving lessons, and by the time I was 13, I could scuba dive to a depth of 40 meters, as well as go cave diving.\n\nI got a pilot’s license by the age of 17, and I learned to sail just before my 18th birthday. Instead of going to university, I decided to travel around South America, exploring its rich jungles and beautiful landscapes. \n\nDuring my trip, I met my now wife who was also an explorer. For our honeymoon, we sailed around the Caribbean and we discovered 3 new islands which we named after the cats that I had growing up. \n\nOver the course of my life, I have come across great treasures and wondrous experiences. But in all my life, and in all my travels, I’m afraid I have never come across a single person who cared about what you just said",
            "That video is so good. Thank you bro for making this!",
            "Hi 💦 there! My name 📛 is Michael 👓 Grover, and I 👥 am an explorer 🚁🛩. Ever 😠 since 👨 I’ve been little 👌🏽, I’ve loved ❤ searching 🔭 for new 🆕 things 🕑. As a baby 👶, my parents 👪 kept 😣 finding 🔎 me in nooks ♎ and crannies around 🔃 the house 🏡🙈🙊. “On the search” as they would say 💬.   \n  \nBy the age 👵 of 5 🔳, I 👥 had been to every ☝ continent 🇺🇸 on 🔛 the planet 🌏, barring Antarctica ❄. For my 12th ⏳ birthday 🎉, my parents 👪 got 🍸 me diving 🏊‍♀️🤽‍♂️ lessons 🎓, and by the time ⏰ I 👁 was 13 ✋🏻☕, I 👁 could scuba dive 🏊‍♂️ to a depth 🤔🙀👽 of 40 💦 meters 😍💦, as well 😦 as go 🏃👳 cave 🕳 diving 🏊‍♀️🤽‍♂️.   \n  \nI 👁 got 🍸 a pilot’s license 🔄🔃 by the age 👴👵 of 17 🕚, and I 👁 learned 1️⃣ to sail ⛵ just before 😂 my 18th birthday 🎂. Instead 👍 of going 🏃🏿💗 to university 🎓, I 👁 decided 🤔 to travel ✈ around 🧱🎶🎵 South 🇿🇦 America 🇺🇸, exploring 🚁🛩 its rich 💲 jungles 🌴 and beautiful 😍😜 landscapes 🔳💀😣.   \n  \nDuring my trip 🛣💯, I 👁 met 🤝 my now wife 👫👰 who was also 👨 an explorer 🚁🛩. For our honeymoon 🍯🌕🛏, we sailed around 🔃 the Caribbean 🇬🇱🇸🇻 and we discovered 🚬 3 ⭕ℹ🕘 new 🆕 islands 🇦🇽 which we named 📛 after 👀 the cats 🐱 that I 👁 had growing 🌱 up ⬆.   \n  \nOver 🔄🔁 the course 🏎 of my life 👤, I 👥 have come 💦 across ➡ great 👌👍💯 treasures 💰💸💎 and wondrous 🤔 experiences 💯. But 🍑 in all 💯 my life 💓, and in all 💯 my travels 🚓✈🚁, I’m afraid 😱 I 👁 have never 🚫 come 💦🍆🚾 across ➡ a single 🏻 person 👨 who cared 😍 about 💦🌽 what you 👉😡🖌 just said 💦💬.",
            "Hi thewe! My name is Michaew Gwovew, and I am an expwowew. Evew since I’ve been wittwe, I’ve woved seawching fow new things. As a baby, my pawents kept finding me in nooks and cwannies awound the house. “On the seawch” as they wouwd say.\n\nBy the age of 5, I had been to evewy continent on the pwanet, bawwing Antawctica. Fow my 12th biwthday, my pawents got me diving wessons, and by the time I was 13, I couwd scuba dive to a depth of 40 metews, as weww as go cave diving.\n\nI got a piwot’s wicense by the age of 17, and I weawned to saiw just befowe my 18th biwthday. Instead of going to univewsity, I decided to twavew awound South Amewica, expwowing its wich jungwes and beautifuw wandscapes. \n\nDuwing my twip, I met my now wife who was awso an expwowew. Fow ouw honeymoon, we saiwed awound the Cawibbean and we discovewed 3 new iswands which we named aftew the cats that I had gwowing up. \n\nOvew the couwse of my wife, I have come acwoss gweat tweasuwes and wondwous expewiences. But in aww my wife, and in aww my twavews, I’m afwaid I have nevew come acwoss a singwe pewson who cawed about what you just said.",
            "I know this is a meme, but I'm happy with how many things I've ticked off from that list. Father's a pilot, took me around the world, visited 40+ countries with him by age 20. PADI certified on my 13th birthday, advanced certified age 14. First flight with him age 14, studying in a top uni thanks to him. \n\nHe battled Covid and won recently, I'm really proud of him. \n\nEven though it was a meme OP, it was a good trip through memory lane, I'll share this with him (excluding the last bit haha)",
            "Is this just the transcript of the one Redd is Dead video",
            "God damn that's about the most reddit response you can to someone",
            "Based",
            "⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀ ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀ ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀ ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆ ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿ ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀ ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛⠉",
            " \n\n# Send this to someone when they’re bragging\n\n**Hi there! My name is Michael Grover, and I am an explorer. Ever since I’ve been little, I’ve loved searching for new things. As a baby, my parents kept finding me in nooks and crannies around the house. “On the search” as they would say.**\n\n**By the age of 5, I had been to every continent on the planet, barring Antarctica. For my 12th birthday, my parents got me diving lessons, and by the time I was 13, I could scuba dive to a depth of 40 meters, as well as go cave diving.**\n\n**I got a pilot’s license by the age of 17, and I learned to sail just before my 18th birthday. Instead of going to university, I decided to travel around South America, exploring its rich jungles and beautiful landscapes.**\n\n**During my trip, I met my now wife who was also an explorer. For our honeymoon, we sailed around the Caribbean and we discovered 3 new islands which we named after the cats that I had growing up.**\n\n**Over the course of my life, I have come across great treasures and wondrous experiences. But in all my life, and in all my travels, I’m afraid I have never come across a single person who cared about what you just said.**",
            "Finally, a good copypasta",
            " \n\nHi there! My name is Michael Grover, and I am an explorer. Ever since I’ve been little, I’ve loved searching for new things. As a baby, my parents kept finding me in nooks and crannies around the house. “On the search” as they would say.\n\nBy the age of 5, I had been to every continent on the planet, barring Antarctica. For my 12th birthday, my parents got me diving lessons, and by the time I was 13, I could scuba dive to a depth of 40 meters, as well as go cave diving.\n\nI got a pilot’s license by the age of 17, and I learned to sail just before my 18th birthday. Instead of going to university, I decided to travel around South America, exploring its rich jungles and beautiful landscapes.\n\nDuring my trip, I met my now wife who was also an explorer. For our honeymoon, we sailed around the Caribbean and we discovered 3 new islands which we named after the cats that I had growing up.\n\nOver the course of my life, I have come across great treasures and wondrous experiences. But in all my life, and in all my travels, I’m afraid I have never met someone who brags so much.",
            "man I loved that video",
            "At Cornell University they have an incredible piece of scientific equipment known as the tunneling electron microscope. Now, this microscope is so powerful that by firing electrons you can actually see images of the atom, the infinitesimally minute building blocks of our universe. If I were using that microscope right now... I still wouldn't be able to locate my interest in your [story]",
            "so basically I’m the best person on earth",
            "[removed]",
            "Bragging to own the bragtards",
            "way too tryhard",
            "I love this",
            "Man I loved that video.",
            "Bugsnax",
            "I’m gonna end it with “that asked” because I am two and still find who asked funny",
            "ah i remember that video",
            "And if you are in a hurry, you could just say: ”I’m afraid I have never come across a single person who cared about what you just said”. Rest of that was mostly unnecessary bragging.",
            "That's funny OP because the same thing happened to me.",
            "Bro this is awesome"
        ]
    },
    {
        "post_id": "cpicdg",
        "author": "yhavmin",
        "title": "I FUCKING FOUND THE FUCKING MOBILE USER!!!!!",
        "url": "https://www.reddit.com/r/copypasta/comments/cpicdg/i_fucking_found_the_fucking_mobile_user/",
        "score": 9738,
        "num_comments": 309,
        "created_utc": 1565642828.0,
        "selftext": "OOHH!!! OOHH!!!! I FOUND THE MOBILE USER GUYS!!! THIS GUY USES MOBILE!!!!!!!!!!!!!!!!\n\nHE USED THE CAPITAL R HE'S A MOBILE USER GUYS!!!!!!!!!!!!! ROASTED!!!!!!!!!!!\n\nI AWAIT MY KARMA AND GOLD BECAUSE OF MY EPIC ROAST MY DUDES, I JUST ROASTED THE MOBILE USER!!!!\n\nr/FOUNDTHEMOBILEUSER!!!! (NOTICE HOW I DIDN'T USE THE CAPITAL R BECAUSE IM NOT A WUSSY MOBILE USER, IM A LE EPIC DESKTOP USER!!!!!!!)\n\nGET PAWNED YOU WIMPY MOBILE USER!!!!!!",
        "permalink": "/r/copypasta/comments/cpicdg/i_fucking_found_the_fucking_mobile_user/",
        "comments": [
            "Imagine even using a phone - Posted from Samsung smart fridge",
            "[deleted]",
            "😘😳😘😢😏💕💕😍😢😢😍😍😢R/whuush",
            "OOHH!!! OOHH!!!! I FOUND THE MOBILE USER GUYS!!! THIS GUY USES MOBILE!!!!!!!!!!!!!!!!\n\nHE USED THE CAPITAL R HE'S A MOBILE USER GUYS!!!!!!!!!!!!! ROASTED!!!!!!!!!!!\n\nI AWAIT MY KARMA AND GOLD BECAUSE OF MY EPIC ROAST MY DUDES, I JUST ROASTED THE MOBILE USER!!!!\n\nr/FOUNDTHEMOBILEUSER!!!! (NOTICE HOW I DIDN'T USE THE CAPITAL R BECAUSE IM NOT A WUSSY MOBILE USER, IM A LE EPIC DESKTOP USER!!!!!!!)\n\nGET PAWNED YOU WIMPY MOBILE USER!!!!!!",
            "Honestly every time someone links that sub it's a 50/50 whether it gets downvoted to hell or not. It's pretty interesting to watch, it's like karma roulette",
            "[deleted]",
            "R/woooosh",
            "⠀⠀⠀⢀⡤⢶⣶⣶⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⢀⣠⣤⣤⣤⣿⣧⣀⣀⣀⣀⣀⣀⣀⣀⣤⡄⠀ ⢠⣾⡟⠋⠁⠀⠀⣸⠇⠈⣿⣿⡟⠉⠉⠉⠙⠻⣿⡀ ⢺⣿⡀⠀⠀⢀⡴⠋⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠙⠇ ⠈⠛⠿⠶⠚⠋⣀⣤⣤⣤⣿⣿⣇⣀⣀⣴⡆⠀⠀⠀ ⠀⠀⠀⠀⠠⡞⠋⠀⠀⠀⣿⣿⡏⠉⠛⠻⣿⡀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⡇⠀⠀⠀⠈⠁⠀⠀ ⠀⠀⣠⣶⣶⣶⣶⡄⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀ ⠀⢰⣿⠟⠉⠙⢿⡟⠀⠀⣿⣿⡇⠀⠀⠀⠀⠀⠀⠀ ⠀⢸⡟⠀⠀⠀⠘⠀⠀⠀⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀ ⠀⠈⢿⡄⠀⠀⠀⠀⠀⣼⣿⠏⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠙⠷⠶⠶⠶⠿⠟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀",
            "OOHH!!! OOHH!!!! I FOUND THE MOBIWE USEW GUYS!!! THIS GUY USES MOBIWE!!!!!!!!!!!!!!!!\n\nHE USED THE CAPITAW W HE'S A MOBIWE USEW GUYS!!!!!!!!!!!!! WOASTED!!!!!!!!!!!\n\nI AWAIT MY KAWMA AND GOWD BECAUSE OF MY EPIC WOAST MY DUDES, I JUST WOASTED THE MOBIWE USEW!!!!\n\nw/FOUNDTHEMOBIWEUSEW!!!! (NOTICE HOW I DIDN'T USE THE CAPITAW W BECAUSE IM NOT A WUSSY MOBIWE USEW, IM A WE EPIC DESKTOP USEW!!!!!!!)\n\nGET PAWNED YOU WIMPY MOBIWE USEW!!!!!!",
            "You know what this needs?\n\nR/emojipasta",
            "YTA",
            "Yo this one got to me 😂",
            "R/foundthepcuser",
            "Is that a fucking capital r in that subreddit name? Do I look like a fucking idiot to you? Did you really think that you could slip a capital r in the subreddit by me? I’ll have you know I fucking created High Valerian for game of thrones and can speak 18 languages fluently. You’ve obviously never heard of me because I like to keep a low profile so fucktards like you don’t mess with me. Why did you think it was okay to use a mobile device to browse reddit, you stupid cunt. And even more so, why did you fucking comment with it. Fuck you, and fuck your phone.r/foundthemobileuser",
            "R/woosh normiee",
            "Got this from u/el_liam0 in a comment",
            "R/foundthemobileuser",
            "[deleted]",
            "for some reason I found myself reading this in a dorky and nasally Justin Roiland voice. Thank you for that",
            "R/funnylaughed",
            "r/mobileuserswithoutautocaps",
            "Imagine using a phone, posted by brain argumentation gang",
            "Wait i am posting on a link from gmail on a phone so I am the weak and a alpha male",
            "Feels like r/coaxedintoasnafu rn",
            "imagining OP writing this in a huff like theyre REALLY FUCKING PISSED on their phone",
            "I had to decide. \n\nDo I take the name or browse reddit on PC? \n\nWell, the answer seems clear",
            "r/foundthehondacivic cRinge NorMie",
            "Wait I made a thing",
            "Pfff. Who uses a phone these days? I'm browsing reddit with a motherfr*cking toaster.",
            "I use mobile but I know how to tap a button to make that 'R' to an 'r' because I'm not a degenerate.",
            "R/roasted",
            "Ok my defense for the sub is posts with R/ are fine, because its not about making fun of them for being on mobile, its about how annoying it is that now you cant click the link. Everything else on the sub is pretty lame.",
            "OMG THAT IS SO THE MOBILE USER 👁👄👁📲",
            "OMG THAT IS SO THE MOBILE USER 👁👄👁📲",
            "Edit: thanks for the gold kind stranger",
            "Lol",
            "Some people can't afford PCs",
            "Are Slash I Found The Mobile User",
            "R/imthemobileuser",
            "r/circlejerk",
            "Don't you guys have phones?",
            "r/FTMUfinder",
            "R/guysimnotmobileiswear",
            "This makes me sad cause I don’t use mobile but I do capitalize the first letter",
            "Mexicans",
            "Yeah, take that you fucking phone plebs!  \n\n\n\\-Sent with gameboy color",
            "R",
            "😂😂🤣🤣🤣🤣 omfg this is so funny this should go on R/funny LMAOOOO 😹😹😹😹😹😹",
            "r/penis",
            "Imagine using anything else then a roomba",
            "Instagram bad",
            "Next can you make one about r/thirdsub ?",
            "It's ironic bro. R/woosh",
            "hah! pathetic! you have to use PHYSICAL OBJECTS?? \n-sent from the ultimate stand 「SUPERFLY」",
            "R/Bruh",
            "Smart",
            "u/uwutranslator",
            "r/foundthemobileuser",
            "i honestly hate that sub its like what if i use a phone",
            "Hahaha and my axe",
            "R/foundthemobileuser",
            "Nice try Blizzard..",
            "I just got banned from r/foundthemobileuser because I commented on a post. Thank you. That was so immensely satisfying.\n\nEdit: Oh and the post was locked by the gay mods over there.",
            "R/foundthemobileuser",
            "I’m currently posting from my potato",
            "OOHH!!! OOHH!!!! I FOUND THE MOBILE USER GUYS!!! THIS GUY USES MOBILE!!!!!!!!!!!!!!!!\n  \nHE USED THE CAPITAL R HE'S A MOBILE USER GUYS!!!!!!!!!!!!! ROASTED!!!!!!!!!!!\n  \nI AWAIT MY KARMA AND GOLD BECAUSE OF MY EPIC ROAST MY DUDES, I JUST ROASTED THE MOBILE USER!!!!\n  \nr/FOUNDTHEMOBILEUSER!!!! (NOTICE HOW I DIDN'T USE THE CAPITAL R BECAUSE IM NOT A WUSSY MOBILE USER, IM A LE EPIC DESKTOP USER!!!!!!!)\n  \nGET PAWNED YOU WIMPY MOBILE USER!!!!!!",
            "Yummy",
            "arr/wosh",
            "I use a capital r when im linking subreddits even when im on a computer because it just feels right",
            "This sub is getting pretty bad",
            "Can someone help me find a copypasta I think I saw on this sub. It started out like r/WOshH IDIOT ... it’s a JOKE..... idk the rest",
            "what happens to the people which uses phone because his internet is too slow on desktop?",
            "u/uwutranslator",
            "*laughs in default lowercase on mobile*",
            "I got banned from that subreddit by commenting this copypasta",
            "r/firstsub",
            "Emoji",
            "Twitter for android",
            "Credit goes to u/ChopFricks",
            "R/iwouldneverusemobile",
            "Twitter for Android",
            " \n\nOOHH!!! OOHH!!!! I FOUND THE MOBILE USER GUYS!!! THIS GUY USES MOBILE!!!!!!!!!!!!!!!!\n\nHE USED THE CAPITAL R HE'S A MOBILE USER GUYS!!!!!!!!!!!!! ROASTED!!!!!!!!!!!\n\nI AWAIT MY KARMA AND GOLD BECAUSE OF MY EPIC ROAST MY DUDES, I JUST ROASTED THE MOBILE USER!!!!\n\n[r/FOUNDTHEMOBILEUSER](https://www.reddit.com/r/FOUNDTHEMOBILEUSER/)!!!! (NOTICE HOW I DIDN'T USE THE CAPITAL R BECAUSE IM NOT A WUSSY MOBILE USER, IM A LE EPIC DESKTOP USER!!!!!!!)\n\nGET PAWNED YOU WIMPY MOBILE USER!!!!!!\n\n&#x200B;\n\n \n\nOOHH!!! OOHH!!!! I FOUND THE MOBILE USER GUYS!!! THIS GUY USES MOBILE!!!!!!!!!!!!!!!!\n\nHE USED THE CAPITAL R HE'S A MOBILE USER GUYS!!!!!!!!!!!!! ROASTED!!!!!!!!!!!\n\nI AWAIT MY KARMA AND GOLD BECAUSE OF MY EPIC ROAST MY DUDES, I JUST ROASTED THE MOBILE USER!!!!\n\n[r/FOUNDTHEMOBILEUSER](https://www.reddit.com/r/FOUNDTHEMOBILEUSER/)!!!! (NOTICE HOW I DIDN'T USE THE CAPITAL R BECAUSE IM NOT A WUSSY MOBILE USER, IM A LE EPIC DESKTOP USER!!!!!!!)\n\nGET PAWNED YOU WIMPY MOBILE USER!!!!!!\n\n&#x200B;\n\n \n\nOOHH!!! OOHH!!!! I FOUND THE MOBILE USER GUYS!!! THIS GUY USES MOBILE!!!!!!!!!!!!!!!!\n\nHE USED THE CAPITAL R HE'S A MOBILE USER GUYS!!!!!!!!!!!!! ROASTED!!!!!!!!!!!\n\nI AWAIT MY KARMA AND GOLD BECAUSE OF MY EPIC ROAST MY DUDES, I JUST ROASTED THE MOBILE USER!!!!\n\n[r/FOUNDTHEMOBILEUSER](https://www.reddit.com/r/FOUNDTHEMOBILEUSER/)!!!! (NOTICE HOW I DIDN'T USE THE CAPITAL R BECAUSE IM NOT A WUSSY MOBILE USER, IM A LE EPIC DESKTOP USER!!!!!!!)\n\nGET PAWNED YOU WIMPY MOBILE USER!!!!!!\n\n&#x200B;\n\n \n\nOOHH!!! OOHH!!!! I FOUND THE MOBILE USER GUYS!!! THIS GUY USES MOBILE!!!!!!!!!!!!!!!!\n\nHE USED THE CAPITAL R HE'S A MOBILE USER GUYS!!!!!!!!!!!!! ROASTED!!!!!!!!!!!\n\nI AWAIT MY KARMA AND GOLD BECAUSE OF MY EPIC ROAST MY DUDES, I JUST ROASTED THE MOBILE USER!!!!\n\n[r/FOUNDTHEMOBILEUSER](https://www.reddit.com/r/FOUNDTHEMOBILEUSER/)!!!! (NOTICE HOW I DIDN'T USE THE CAPITAL R BECAUSE IM NOT A WUSSY MOBILE USER, IM A LE EPIC DESKTOP USER!!!!!!!)\n\nGET PAWNED YOU WIMPY MOBILE USER!!!!!!",
            "u/uwutranslator",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Can you stop reposting this?\n[1](https://www.reddit.com/r/copypasta/comments/concwi/rfoundthemobileuser/?utm_medium=android_app&utm_source=share)\n[2](https://www.reddit.com/r/copypasta/comments/cc8kg7/_/?utm_medium=android_app&utm_source=share)\n[3](https://www.reddit.com/r/copypasta/comments/c2coag/rfoundthemobileuser/?utm_medium=android_app&utm_source=share)\n[4](https://www.reddit.com/r/copypasta/comments/cg89zc/rcopypasta/?utm_medium=android_app&utm_source=share)",
            "R/foundthegamerwhoalsousesmobile",
            "[deleted]"
        ]
    },
    {
        "post_id": "mqmpix",
        "author": "BandicootFirst53",
        "title": "Never, EVER put diet coke and mentos in your ass",
        "url": "https://www.reddit.com/r/copypasta/comments/mqmpix/never_ever_put_diet_coke_and_mentos_in_your_ass/",
        "score": 9743,
        "num_comments": 269,
        "created_utc": 1618391072.0,
        "selftext": "Never, EVER put diet coke and mentos in your ass\n\nY’all know about the prostate gland? The male rub-to-cum? Yea that thing. This is the glorious story of how I tried (and failed) to stimulate it.\n\n\n#The Buildup\n\nI was drinking Pepsi and reading an article on how prostate stimulation intensifies orgasms. So, I had the genius idea of using coke to stimulate my ass. WCGW? I mean that the carbonation feels... good in my mouth, so It should work in my ass.\nAs an engineer, there are many logistical challenges to bypass when trying to insert coke into one’s asshole.\n\n\n*Q: How do I put cola in my anus in the first place?*\n\n*A: You use the rim of the bottle and stick it directly in the anus.*\n\n\n*Q: How do I make sure that the coke stays there?*\n\n*A: You don’t. That’s where I fucked up*\n\n\nNow, with a half-assed plan, I went to the store. As I was checking out, I saw a pack mentos.\nTime to bring this to level two. I put back the original coke and bought diet coke instead. All 2 liters of glory.\n\n\n#The disaster\n\n20 mins later...\n\nWith three mentos in my ass, I gingerly lowered the rim to my rim and poured. The reaction was nearly instant. With the tidal force of a tsunami, the bottle was violently ejected from my ass. A pressure was building up, and the gates of hell opened. I felt Satan’s sugary fire burst from my asshole onto the bed. Holy shit, you would not realize the panic I had. There was a pain, both emotional and physical. The sugary wet fart, the sound of a thousand ass-trumpets creating a heavenly cacophony. I saw the light, I saw the dark. I felt The intense sting of carbonation,  I experienced nothing and everything. I had found God, and he was punishing me. There was the maddening sensation of your asshole bending over itself, inside out, shrinking, expanding. It was worse than any experience ever. My brain still cannot comprehend the sensations, but they were torturous. I have contemplated what hell might feel like, and I know that I could find peace there. My bed was soaked with shit-coke. Lord, how am I to clean up.\n\nDon't ever try what I did.\n\n\n#The aftermath\n\nI learned a very valuable lesson that day. Don’t try anything insane. Avoid the asshole. \n\nAlso, TIL that the human asshole can stretch 8 centimeters without damage.\n\nTL;DR: Stick to beating your meat, folks.",
        "permalink": "/r/copypasta/comments/mqmpix/never_ever_put_diet_coke_and_mentos_in_your_ass/",
        "comments": [
            "r/teenagers?",
            "I... I don’t know whether I should believe someone actually tried this... I very very much want this to be someone trolling",
            "Nevew, EVEW put diet coke and mentos in youw ass\n\nY’aww know about the pwostate gwand? The mawe wub-to-cum? Yea that thing. This is the gwowious stowy of how I twied (and faiwed) to stimuwate it.\n\n\n#The Buiwdup\n\nI was dwinking Pepsi and weading an awticwe on how pwostate stimuwation intensifies owgasms. So, I had the genius idea of using coke to stimuwate my ass. WCGW? I mean that the cawbonation feews... good in my mouth, so It shouwd wowk in my ass.\nAs an engineew, thewe awe many wogisticaw chawwenges to bypass when twying to insewt coke into one’s asshowe.\n\n\n*Q: How do I put cowa in my anus in the fiwst pwace?*\n\n*A: You use the wim of the bottwe and stick it diwectwy in the anus.*\n\n\n*Q: How do I make suwe that the coke stays thewe?*\n\n*A: You don’t. That’s whewe I fucked up*\n\n\nNow, with a hawf-assed pwan, I went to the stowe. As I was checking out, I saw a pack mentos.\nTime to bwing this to wevew two. I put back the owiginaw coke and bought diet coke instead. Aww 2 witews of gwowy.\n\n\n#The disastew\n\n20 mins watew...\n\nWith thwee mentos in my ass, I gingewwy wowewed the wim to my wim and pouwed. The weaction was neawwy instant. With the tidaw fowce of a tsunami, the bottwe was viowentwy ejected fwom my ass. A pwessuwe was buiwding up, and the gates of heww opened. I fewt Satan’s sugawy fiwe buwst fwom my asshowe onto the bed. Howy shit, you wouwd not weawize the panic I had. Thewe was a pain, both emotionaw and physicaw. The sugawy wet fawt, the sound of a thousand ass-twumpets cweating a heavenwy cacophony. I saw the wight, I saw the dawk. I fewt The intense sting of cawbonation,  I expewienced nothing and evewything. I had found God, and he was punishing me. Thewe was the maddening sensation of youw asshowe bending ovew itsewf, inside out, shwinking, expanding. It was wowse than any expewience evew. My bwain stiww cannot compwehend the sensations, but they wewe towtuwous. I have contempwated what heww might feew wike, and I know that I couwd find peace thewe. My bed was soaked with shit-coke. Wowd, how am I to cwean up.\n\nDon't evew twy what I did.\n\n\n#The aftewmath\n\nI weawned a vewy vawuabwe wesson that day. Don’t twy anything insane. Avoid the asshowe. \n\nAwso, TIW that the human asshowe can stwetch 8 centimetews without damage.\n\nTW;DW: Stick to beating youw meat, fowks.",
            "Never 🚫, EVER 😠 put 🔛 diet 🍷 coke 🥃💦😩 and mentos 🧊 in your 👈 ass 🍑   \n  \nY’all know 💭☣ about 💦 the prostate 🍆 gland 🗿? The male 👦 rub-to-cum? Yea 😀 that thing 🕑. This is the glorious 😇 story 📖 of how I 👁 tried 🇮🇹 (and failed 🚫) to stimulate 💡 it.   \n  \n  \n#The Buildup 💪   \n  \nI 👁 was drinking 🍹 Pepsi ™ and reading 📖👀 an article 📓 on 💦 how prostate ™🍆 stimulation 💡 intensifies 💥 orgasms 💦💧. So, I 👁 had the genius 🔬 idea 💡 of using 😏 coke 🍻 to stimulate 💡 my ass 🍑. WCGW? I 👁 mean 👀👅 that the carbonation ⚗ feels 😜... good 👌👍🏾 in my mouth 👄🤤, so It should work 💼 in my ass 🍑.   \nAs an engineer 👷, there are many 👬 logistical challenges 🏋 to bypass 🔓 when ⏰ trying 😼👌💥 to insert 👀 coke 🥃💦😩 into one’s asshole 🍑.   \n  \n  \n*Q ☘: How do I 👁👀 put 🔛 cola 💦🙇🏽‍♀️👍🏼 in my anus 🍑 in the first 👆 place 🚵🏻🏆💅🏽?*   \n  \n*A: You 👉 use 🏻 the rim 💦 of the bottle 🍾 and stick 😳🍆💦 it directly 👁👀 in the anus 🕳🔅🔆.*   \n  \n  \n*Q 🚁: How do I 👁 make 💘 sure 💯 that the coke 👃🏾 stays ✋ there?*   \n  \n*A: You ❓👌👈 don’t. That’s where I 👁🅱 fucked 😩 up ☝*   \n  \n  \nNow, with a half-assed plan 📝, I 👁 went 💨 to the store 🏪. As I 👥 was checking ✔ out, I 👁 saw 👀 a pack 📦 mentos 🧊.   \nTime 🕐 to bring 👎 this to level 💯🔝 two ✌🏼. I 👁 put 🔛 back ⬅ the original 👌 coke 👃🏾 and bought 💸 diet 🍷 coke 🍻 instead 👍. All 💯 2 🕝 liters 💦 of glory 😇.   \n  \n  \n#The disaster 🌊💵   \n  \n20 🔳 mins 🙅 later 🕑...   \n  \nWith three 3️⃣ mentos 🧊 in my ass 🍑, I 👁 gingerly 😅 lowered the rim 💦 to my rim 🚘 and poured 🔛. The reaction 😲 was nearly 👣 instant ⌛😮. With the tidal 🌊 force 🖐 of a tsunami 🌊, the bottle 🍾 was violently 🔫👊💬 ejected 📼💦 from my ass 🍑. A pressure 🛃 was building 👷 up ⬆, and the gates 🚧 of hell 😈 opened 🆙. I 👁 felt 😨😎 Satan’s sugary fire 🔥 burst 💦🍆 from my asshole 🍑 onto 🐦 the bed 🛌. Holy 🙏🏿 shit 👌, you 👈❎ would not realize 🤔😮😧 the panic ❗☝🙅‍♀️ I 👁 had. There was a pain 😡, both emotional 😍😭😱 and physical 👁😱😤. The sugary wet 💦 fart 💨, the sound 👂 of a thousand 🔢 ass-trumpets creating 🔚🔜 a heavenly 🌌 cacophony. I 👁🤴 saw 👀🤔🙄 the light 💡, I 👁 saw 👁 the dark 🌑. I 👁 felt 😎 The intense 💥 sting 🤗 of carbonation ⚗, I 👥 experienced 😏 nothing 🚫 and everything 💯. I 👁 had found 🔍 God 😇, and he 👥 was punishing 😈 me. There was the maddening sensation 🤗🙏💰 of your 👉😍 asshole 🍑 bending 😦 over 🔁 itself, inside 💠 out, shrinking ⬅, expanding ↔. It was worse 📉 than any experience 💯 ever 😠. My brain 🧠 still 🙄 cannot 🚫 comprehend 🤷‍♂️ the sensations 💰, but 😮🍑 they were torturous 😈. I 👁 have contemplated 🤔 what hell 👊👹🔥 might 💪 feel 😜😱 like 😄, and I 👁 know 💭 that I 👁 could find 🔍💦💧 peace ✌☮ there. My bed 🛏 was soaked 💦 with shit-coke. Lord 😇, how am I 👥 to clean 🛁 up ⬆.   \n  \nDon't 🚫⛔🙅‍♂️ ever 😠 try 😐 what I 👁 did.   \n  \n  \n#The aftermath 🏢🗣🎙   \n  \nI 👁 learned 😌 a very 👌 valuable 💵👇 lesson 🎓 that day 📆. Don’t try 😐 anything 😯 insane 😜. Avoid 👋 the asshole 🍑🕳.   \n  \nAlso 👨, TIL ⬆ that the human 👤 asshole 🍑 can stretch 😼👌💥 8 👊 centimeters 😳 without ❌ damage 👻.   \n  \nTL;DR 👇🏾📘: Stick 🍆 to beating 👊 your 👉 meat 🍆, folks 👥👩👧.",
            "ನಿಮ್ಮ ಬಕೆಟ್‌ನಲ್ಲಿ ಆಹಾರದಲ್ಲಿ ಕಪ್ ಮತ್ತು ಮೆಂಥೋಸ್ ಹಾಕಬೇಡಿ\n\nವೇಶ್ಯಾವಾಟಿಕೆ ಬಗ್ಗೆ ನಿಮಗೆ ತಿಳಿದಿದೆಯೇ? ಮಾನವರು ವೀರ್ಯವನ್ನು ನುಂಗುತ್ತಾರೆಯೇ? ಇದು ಸರಿಯಾಗಿದೆ. ಸ್ಫೂರ್ತಿ ಪಡೆಯಲು ನಾನು ಹೇಗೆ ಪ್ರಯತ್ನಿಸಿದೆ (ಮತ್ತು ವಿಫಲವಾಗಿದೆ) ಎಂಬುದರ ಕುರಿತು ಒಂದು ದೊಡ್ಡ ಕಥೆ ಇಲ್ಲಿದೆ.\n\n\n# ನಿರ್ಮಿಸಿ\n\nನಾನು ಪೆಪ್ಸಿಯನ್ನು ಸೇವಿಸಿದೆ ಮತ್ತು ಪರಾಕಾಷ್ಠೆ ಹೆಚ್ಚಿಸಲು ಪ್ರಾಸ್ಟೇಟ್ ಪ್ರಚೋದನೆಯ ಬಗ್ಗೆ ಒಂದು ಕಥೆಯನ್ನು ಓದಿದ್ದೇನೆ. ಹಾಗಾಗಿ ನನ್ನ ಶಬ್ದವನ್ನು ಹೆಚ್ಚಿಸಲು ಕೋಕ್ ಬಳಸುವ ಸ್ಮಾರ್ಟ್ ಐಡಿಯಾ ಇತ್ತು. ಡಬ್ಲ್ಯೂಸಿಜಿಡಬ್ಲ್ಯೂ? ಮತ್ತು ನನ್ನ ಬಾಯಿಯಲ್ಲಿರುವ ಕಾರ್ಬೊನೇಟ್ ... ಅದ್ಭುತವೆನಿಸುತ್ತದೆ ಮತ್ತು ನನ್ನ ಬೆಕ್ಕಿನ ಮೇಲೆ ಕೆಲಸ ಮಾಡುತ್ತದೆ.\nಎಂಜಿನಿಯರ್ ಆಗಿ, ನಿಮಗೆ ಇಷ್ಟವಿಲ್ಲದವರಿಂದ ಕೋಕ್ ಖರೀದಿಸಲು ಪ್ರಯತ್ನಿಸುವಾಗ ತಪ್ಪಿಸಲು ಅನೇಕ ಡಿಜಿಟಲ್ ಸವಾಲುಗಳಿವೆ.\n\n\nಪ್ರಶ್ನೆ: ನನ್ನ ಗುದದ್ವಾರದಲ್ಲಿ ಕೋಲಾವನ್ನು ನಾನು ಮೊದಲು ಹೇಗೆ ಪಡೆಯಬಹುದು? *\n\nಉತ್ತರ: ನೇರವಾಗಿ ಮೂಗಿಗೆ ಜೋಡಿಸಲಾದ ಬಾಟಲಿಯ ತುದಿಯನ್ನು ಬಳಸಿ. *\n\n\n* ಪ್ರಶ್ನೆ: ಕೋಕ್ ಇನ್ನೂ ಇದೆ ಎಂದು ನಾನು ಹೇಗೆ ಖಚಿತಪಡಿಸಿಕೊಳ್ಳುವುದು? *\n\n* ಎ: ಇಲ್ಲ. ಅಲ್ಲಿಯೇ ನನಗೆ ಕೆಟ್ಟದ್ದಾಗಿದೆ *\n\n\nಸರಿ, ಅರೆಮನಸ್ಸಿನ ಯೋಜನೆಯೊಂದಿಗೆ ನಾನು ಅಂಗಡಿಗೆ ಹೋದೆ. ನಾನು ನೋಂದಾಯಿಸಿದಾಗ, ನಾನು ಪ್ಯಾಕ್‌ಮೆಂಟೋಸ್ ಅನ್ನು ಕಂಡುಕೊಂಡೆ.\nಇದನ್ನು 2 ನೇ ಸ್ಥಾನಕ್ಕೆ ತರುವ ಸಮಯ. ನಾನು ಮೂಲ ಖಾದ್ಯವನ್ನು ಬದಲಾಯಿಸಿದ್ದೇನೆ ಮತ್ತು ಬದಲಿಗೆ dinner ಟದ meal ಟವನ್ನು ಖರೀದಿಸಿದೆ. ಪ್ರತಿ ಲೀಟರ್ ವೈಭವ.\n\n\n# ಡಿಸ್ಟ್ರಾಕ್ಷನ್\n\n20 ನಿಮಿಷಗಳ ನಂತರ ...\n\nನನ್ನ ಪುಸಿಯಲ್ಲಿ 3 ಮೆಂಟೋಸ್ನೊಂದಿಗೆ, ನಾನು ನನ್ನ ತುಟಿಗಳನ್ನು ಮತ್ತು ಶುಂಠಿಯನ್ನು ಕೆಳಗೆ ಇರಿಸಿ ಅದನ್ನು ಸುರಿಯುತ್ತೇನೆ. ಬಹುತೇಕ ಉತ್ತರವಿದೆ. ಸುನಾಮಿಯ ಬಲದಿಂದಾಗಿ, ಬಾಟಲಿಯು ಬಂಡೆಯಿಂದ ಹೊರಗೆ ಹಾರಿತು. ಒತ್ತಡ ಹೆಚ್ಚಾಯಿತು, ಮತ್ತು ಗೇಟ್ ಆಫ್ ಹೆಲ್ ತೆರೆಯಲಾಯಿತು. ನಾನು ದ್ವೇಷಿಸುವವರಿಂದ ನನ್ನ ಹಾಸಿಗೆಯಲ್ಲಿ ಸೈತಾನನ ಕಡುಗೆಂಪು ಹೊಳಪು ಇದೆ. ತುಂಬಾ ಕೆಟ್ಟದು ನನ್ನ ಚಿಂತೆ ನಿಮಗೆ ತಿಳಿದಿಲ್ಲ. ನಾನು ಮಾನಸಿಕ ಮತ್ತು ದೈಹಿಕ ನೋವನ್ನು ಸಹಿಸಬೇಕಾಯಿತು. ಸಿಹಿ, ಒದ್ದೆಯಾದ ಹೊಗೆ ಮತ್ತು ಸ್ವರ್ಗವನ್ನು ಬೇರ್ಪಡಿಸುವ ಸಾವಿರಾರು ಕತ್ತೆಗಳ ಟ್ರಂಪ್. ನಾನು ಬೆಳಕನ್ನು ನೋಡಿದ್ದೇನೆ, ಕತ್ತಲೆಯನ್ನು ನೋಡಿದ್ದೇನೆ. ನಾನು ಗಂಭೀರವಾದ ಥ್ರೊಟಲ್ ಗಾಯವನ್ನು ಅನುಭವಿಸುತ್ತೇನೆ, ಎಲ್ಲದರ ಬಗ್ಗೆ ನನಗೆ ಯಾವುದೇ ಅನುಭವವಿಲ್ಲ. ನಾನು ದೇವರನ್ನು ಕಂಡುಕೊಂಡೆ, ಮತ್ತು ಅವನು ನನ್ನನ್ನು ಶಿಕ್ಷಿಸುತ್ತಿದ್ದಾನೆ. ಅಸ್ವಸ್ಥತೆಯ ಪ್ರಜ್ಞೆ ಇದೆ ಏಕೆಂದರೆ ನಿಮ್ಮ ಹತಾಶೆಯು ಬಾಗುತ್ತದೆ, ಒಳಮುಖವಾಗಿ ತಿರುಗುತ್ತದೆ, oms ೂಮ್ ಮತ್ತು ಹೊರಗೆ. ನಾನು ಮೊದಲಿಗಿಂತ ಕೆಟ್ಟದಾಗಿತ್ತು. ನನ್ನ ಮೆದುಳಿಗೆ ಸಂವೇದನೆಯನ್ನು ಅರ್ಥಮಾಡಿಕೊಳ್ಳಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ, ಆದರೆ ಇದು ನಿಜವಾಗಿಯೂ ನೋವಿನಿಂದ ಕೂಡಿದೆ. ಹೇಗೆ ಎಂದು ನಾನು ಆಶ್ಚರ್ಯ ಪಡುತ್ತೇನೆ ಮತ್ತು ಅಲ್ಲಿ ನಾನು ಶಾಂತಿಯನ್ನು ಪಡೆಯಬಹುದೆಂದು ನನಗೆ ಖಾತ್ರಿಯಿದೆ. ನನ್ನ ಹಾಸಿಗೆಯನ್ನು ಮಣ್ಣು ಮತ್ತು ನನ್ನ ಕಾಲರ್ನಿಂದ ನೆನೆಸಲಾಗುತ್ತದೆ. ದೇವರೇ, ನಾನು ಹೇಗೆ ಬಿಟ್ಟುಕೊಡಬಲ್ಲೆ?\n\nನಾನು ಮಾಡಿದ್ದನ್ನು ಪ್ರಯತ್ನಿಸಬೇಡಿ.\n\n\n# ಫಲಿತಾಂಶ\n\nಆ ದಿನ, ನಾನು ಬಹಳ ಮುಖ್ಯವಾದ ಪಾಠವನ್ನು ಕಲಿತಿದ್ದೇನೆ. ಸಾಮಾನ್ಯದಿಂದ ಏನನ್ನೂ ಮಾಡಬೇಡಿ. ನಿಮಗೆ ಇಷ್ಟವಿಲ್ಲದ ಜನರನ್ನು ತಪ್ಪಿಸಿ.\n\nಇದಲ್ಲದೆ, ಜನರು ಇಷ್ಟಪಡದ ಜನರಿಗೆ ಹಾನಿಯಾಗದಂತೆ 8 ಸೆಂ.ಮೀ ಬೆಳೆಯಲು ಟಿಐಎಲ್ ಅನುಮತಿಸುತ್ತದೆ.\n\nಟಿಎಲ್; ಡಿಆರ್: ಎಲ್ಲರೂ, ಮಾಂಸವನ್ನು ಸೋಲಿಸೋಣ.",
            "NTA, your ass your rules",
            "[deleted]",
            "You can’t stop me bitch",
            "For some reason I find it hard to believe this is a copy pasta. I feel like YOU made this",
            "what a coincidence, today i saw a video of a man doing this exact same thing to his woman, it was quite amusing how quickly her face went from kinky enjoyment to deep regret",
            "I uhh\nI Wanna do this",
            "Yoooo somebody actually did this lmaoooo (NSFW warning) \nhttps://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "\"I found God and he was punishing me\" is a phrase i will use regularly now",
            "[deleted]",
            "That was beautiful",
            "Where is cummy i need to copypaste",
            "⣿⣿⣿⠟⢹⣶⣶⣝⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡟⢰⡌⠿⢿⣿⡾⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⢸⣿⣤⣒⣶⣾⣳⡻⣿⣿⣿⣿⡿⢛⣯⣭⣭⣭⣽⣻⣿⣿⣿ ⣿⣿⣿⢸⣿⣿⣿⣿⢿⡇⣶⡽⣿⠟⣡⣶⣾⣯⣭⣽⣟⡻⣿⣷⡽⣿ ⣿⣿⣿⠸⣿⣿⣿⣿⢇⠃⣟⣷⠃⢸⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽ ⣿⣿⣿⣇⢻⣿⣿⣯⣕⠧⢿⢿⣇⢯⣝⣒⣛⣯⣭⣛⣛⣣⣿⣿⣿⡇ ⣿⣿⣿⣿⣌⢿⣿⣿⣿⣿⡘⣞⣿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ ⣿⣿⣿⣿⣿⣦⠻⠿⣿⣿⣷⠈⢞⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ ⣿⣿⣿⣿⣿⣿⣗⠄⢿⣿⣿⡆⡈⣽⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢻ ⣿⣿⣿⣿⡿⣻⣽⣿⣆⠹⣿⡇⠁⣿⡼⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣾ ⣿⠿⣛⣽⣾⣿⣿⠿⠋⠄⢻⣷⣾⣿⣧⠟⣡⣾⣿⣿⣿⣿⣿⣿⡇⣿ ⢼⡟⢿⣿⡿⠋⠁⣀⡀⠄⠘⠊⣨⣽⠁⠰⣿⣿⣿⣿⣿⣿⣿⡍⠗⣿ ⡼⣿⠄⠄⠄⠄⣼⣿⡗⢠⣶⣿⣿⡇⠄⠄⣿⣿⣿⣿⣿⣿⣿⣇⢠⣿ ⣷⣝⠄⠄⢀⠄⢻⡟⠄⣿⣿⣿⣿⠃⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⢹⣿ ⣿⣿⣿⣿⣿⣧⣄⣁⡀⠙⢿⡿⠋⠄⣸⡆⠄⠻⣿⡿⠟⢛⣩⣝⣚⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣤⣾⣿⣿⣄⠄⠄⠄⣴⣿⣿⣿⣇⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⡀⠛⠿⣿⣫⣾⣿",
            "what in the actual heavenly danganronpa-filled foot fetish lesbian hentai godly fucking earth did I just read?",
            "[removed]",
            "Less bots holy shit it's not even funny anymore",
            "Ferb, I know what we're gonna do today",
            "r/teenagers users are a different breed",
            "Why would you do this in your bed?",
            "I actually saw a video of a girl doing that.\n\nIt cut too early to really see her reaction. But it was a fantastic assplosion.",
            "Why wouldn't OP do this in the bathroom? Wayy easier to clean up, I imagine",
            "✋Is regular Coke fine?",
            "u/amonguscockbot",
            "u/Cummy-Bot2000",
            "Inspired by [this](https://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)?",
            "Is there a reason there's a post from /r/instant_regret just a few items down?",
            "https://www.reddit.com/r/CrazyHuman/comments/mq8grd/when_you_mix_mentos_and_cola_in_the_wrong_cup/?utm_medium=android_app&utm_source=share",
            "Does this work with regular coke too?",
            "Wasn't there *just* a gif of this floating around?...",
            "https://imgur.com/a/S2PN3dy\nLook what I found",
            "The thing that bothered me most is that he decided to do this in bed.",
            "Don’t tell me how to live my life",
            "https://www.reddit.com/r/gayspiderbrothel/comments/mrm4is/woman_moment/?utm_medium=android_app&utm_source=share",
            "Why is there never a copy of the *actual* copypasta *itself* in the comments, I want a copy of it but I'm on mobile so I can only copy comments",
            "Never,😂EVER😂put😂diet😂coke😂and😂mentos😂in😂your😂ass\n\nY’all😂know😂about😂the😂prostate😂gland?😂The😂male😂rub-to-cum?😂Yea😂that😂thing.😂This😂is😂the😂glorious😂story😂of😂how😂I😂tried😂(and😂failed)😂to😂stimulate😂it.\n\n\n#The😂Buildup\n\nI😂was😂drinking😂Pepsi😂and😂reading😂an😂article😂on😂how😂prostate😂stimulation😂intensifies😂orgasms.😂So,😂I😂had😂the😂genius😂idea😂of😂using😂coke😂to😂stimulate😂my😂ass.😂WCGW?😂I😂mean😂that😂the😂carbonation😂feels...😂good😂in😂my😂mouth,😂so😂It😂should😂work😂in😂my😂ass.\nAs😂an😂engineer,😂there😂are😂many😂logistical😂challenges😂to😂bypass😂when😂trying😂to😂insert😂coke😂into😂one’s😂asshole.\n\n\n*Q:😂How😂do😂I😂put😂cola😂in😂my😂anus😂in😂the😂first😂place?*\n\n*A:😂You😂use😂the😂rim😂of😂the😂bottle😂and😂stick😂it😂directly😂in😂the😂anus.*\n\n\n*Q:😂How😂do😂I😂make😂sure😂that😂the😂coke😂stays😂there?*\n\n*A:😂You😂don’t.😂That’s😂where😂I😂fucked😂up*\n\n\nNow,😂with😂a😂half-assed😂plan,😂I😂went😂to😂the😂store.😂As😂I😂was😂checking😂out,😂I😂saw😂a😂pack😂mentos.\nTime😂to😂bring😂this😂to😂level😂two.😂I😂put😂back😂the😂original😂coke😂and😂bought😂diet😂coke😂instead.😂All😂2😂liters😂of😂glory.\n\n\n#The😂disaster\n\n20😂mins😂later...\n\nWith😂three😂mentos😂in😂my😂ass,😂I😂gingerly😂lowered😂the😂rim😂to😂my😂rim😂and😂poured.😂The😂reaction😂was😂nearly😂instant.😂With😂the😂tidal😂force😂of😂a😂tsunami,😂the😂bottle😂was😂violently😂ejected😂from😂my😂ass.😂A😂pressure😂was😂building😂up,😂and😂the😂gates😂of😂hell😂opened.😂I😂felt😂Satan’s😂sugary😂fire😂burst😂from😂my😂asshole😂onto😂the😂bed.😂Holy😂shit,😂you😂would😂not😂realize😂the😂panic😂I😂had.😂There😂was😂a😂pain,😂both😂emotional😂and😂physical.😂The😂sugary😂wet😂fart,😂the😂sound😂of😂a😂thousand😂ass-trumpets😂creating😂a😂heavenly😂cacophony.😂I😂saw😂the😂light,😂I😂saw😂the😂dark.😂I😂felt😂The😂intense😂sting😂of😂carbonation,😂😂I😂experienced😂nothing😂and😂everything.😂I😂had😂found😂God,😂and😂he😂was😂punishing😂me.😂There😂was😂the😂maddening😂sensation😂of😂your😂asshole😂bending😂over😂itself,😂inside😂out,😂shrinking,😂expanding.😂It😂was😂worse😂than😂any😂experience😂ever.😂My😂brain😂still😂cannot😂comprehend😂the😂sensations,😂but😂they😂were😂torturous.😂I😂have😂contemplated😂what😂hell😂might😂feel😂like,😂and😂I😂know😂that😂I😂could😂find😂peace😂there.😂My😂bed😂was😂soaked😂with😂shit-coke.😂Lord,😂how😂am😂I😂to😂clean😂up.\n\nDon't😂ever😂try😂what😂I😂did.\n\n\n#The😂aftermath\n\nI😂learned😂a😂very😂valuable😂lesson😂that😂day.😂Don’t😂try😂anything😂insane.😂Avoid😂the😂asshole.😂\n\nAlso,😂TIL😂that😂the😂human😂asshole😂can😂stretch😂8😂centimeters😂without😂damage.\n\nTL;DR:😂Stick😂to😂beating😂your😂meat,😂folks.",
            "U/shittytranslatorbot",
            "https://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_medium=android_app&utm_source=share",
            "yeah, well uhhh... here\n\n[https://www.reddit.com/r/instant\\_regret/comments/mql871/that\\_no\\_place\\_for\\_a\\_mentos\\_fountain/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_source=share&utm_medium=web2x&context=3)",
            "Seeing this after that post hurts even more\n\nhttps://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_medium=android_app&utm_source=share",
            "I know what im doint this evening",
            "Yeah, a lot of us saw that post on instant regret too buddy",
            "holy shit this is perfection",
            "Ya... the lesson is avoid the asshole.... totally was the problem in this story....",
            "the disASSter",
            "https://m.imgur.com/a/S2PN3dy",
            "I was about to post this a couple days ago but it had been reposted recently lol",
            "I like how it is written like a phd thesis",
            "This... this is the first thing I see when I open reddit.",
            "u/amonguscockbot",
            "so i think the problem was you used diet coke and mentos i justed tried it with coke and it worked so much better",
            "this is awesome",
            "u/profanitycounter u/bandicootfire53",
            "good to know",
            "I just watched someone do this on Reddit, sheeesh",
            "God wasn't punishing him, he was just being a dumbass lol",
            "https://reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/",
            "Having Yandev as the sub icon really improves the experience of all these copypastas",
            "NSFW warning\nhttps://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Mate i was bout to post this",
            "Weird that I see this post, then this post like 2 posts after lmao \n\nhttps://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_medium=android_app&utm_source=share",
            "anyone whos curious, r/instantregret just did A VID post with a woman doing one....do not recommend.",
            "i can't stop laughing.",
            "[Funny you say that](https://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "I saw that vid earlier this day",
            "i’ve been having a really bad day this made me genuinely laugh",
            "To be fair, at least they tried.",
            "[I mean...](https://www.reddit.com/r/instant_regret/comments/mql871/that_no_place_for_a_mentos_fountain/)",
            "K",
            "https://imgur.com/a/S2PN3dy nsfw",
            "[if you haven't seen it.](https://imgur.com/a/S2PN3dy)",
            "Stick to butt plugs next time, okay?",
            "This made me laugh a lot",
            "fun fact: a human anus can stretch up to 20cm in diameter",
            "Ferb, I know what we're gonna do today",
            "Sir, this is a Wendy's.",
            "Did you measure your asshole?",
            "I'm just wondering how you though this would be a good idea....",
            "u/AmongUsCockBot",
            "God",
            "!emojify",
            "#The forbiddenema",
            "Should have tried a whole assed plan",
            "!emojify",
            "I imagine this is what the cenobites in hellraiser wanted",
            "u/cummybot2000",
            "https://www.reddit.com/r/PaymoneyWubby/comments/mr4276/chats_copy_and_pasta_porn/?utm_medium=android_app&utm_source=share",
            "But like... why tho",
            "Obviously your supposed to put the diet coke in first, duh",
            "Lmao this could have been my research methods RISE paper",
            "\"The human asshole can stretch 8 centimeters without damage.\"\n\nYou haven't played with cucumbers before, have you?",
            "What the kentucky fried fuck",
            "This says a lot about our society...",
            "LMFAO",
            "God is dead.",
            "god",
            "u/amonguscockbot",
            "𓃟Infinite poop. You sit on the toilet to poop, but the poop never stops coming out of your butt. You have to start flushing the toilet every two minutes to keep up. You try to pinch your butt closed but that makes your insides hurt. The poop accelerates. You call 911. The paramedics call for doctors. The doctors call for specialists. The story trends on Twitter. You turn down talk show appearances. Your septic tank fails. People form a cult. Your toilet is finished. Volunteers arrive with buckets and shovels. You are completely used to the smell. The poop accelerates. You are moved to a stepladder with a hole in the top step. The poop accelerates. The shovelers abandon the buckets and shovel directly out the window. The poop accelerates. A candlelight vigil forms around your house. One of the workers falls over and can't free himself. The poop accelerates. A priest knocks over the stepladder and tackles you out the window. You land in the pile. The poop accelerates. The force now propels you forward and upward. Vigil goers grab at your legs. The poop ignites from their candles. The Facebook live event hits 1 million viewers. The poop accelerates. You are 30 feet in the air. The fire engulfs the vigil and your house. 60 feet. The poop accelerates. The torrent underneath you is deafening. 5 million Facebook live viewers. You try to close up shop but your butthole disintegrated long ago. 120 feet up. Your house explodes. The poop accelerates. 1000 feet. You are now tracked on radar. You try to change your angle of ascent but you should have thought of that way earlier. The poop accelerates. 4,000 feet. NORAD upgrades to DEFCON 3. Concentric circles of fire engulf your city. The poop accelerates. You have broken the sound barrier. 30,000 feet. You no longer take in enough oxygen to sustain consciousness. 60,000 feet. CNN is reporting on all the world records you've broken. 200,000 feet. You are no longer alive. The poop accelerates. Your body disintegrates but your poop contrail remains. NASA can no longer track you. You break the light-speed barrier and we can no longer bear witness. The poop accelerates. Forever.𓃟",
            "Never put cola and mint under it\n\nNever put cola and mint under it\n\nDo you feel the whole prostate? Do men rub? Yes, it depends. A famous story about how he tried (but failed) to start it.\n\n\n#Talk\n\nI'm drinking peppermint and reading an article on how prostate stimulation can make my body worse. So I have a great idea of ​​using cocaine to stimulate my joints. WCGW? I think carbon dioxide is comfortable in my mouth so it should be coming out of my ceiling.\nAs an engineer, there are many sequential challenges that can be overcome.\n\n\nQuestion: How do I put cola in the rectum for the first time?\n\n* Answer: Use the rim of the bowl and insert it directly into the rectum.\n\n\nQuestion: How can I stay Coca-Cola there?\n\nA: You don't know. Did you sleep here *\n\n\nAfter the middle bullet is fired, I go to the store. When I went out, I saw a lot of pieces.\nIt's time to drop them and move on. I returned the original cola and bought the grocery cola. 2 liter name.\n\n\n# Catastrophe\n\nIn 20 minutes ...\n\nThere were three peppercorns on the floor, and my lips slowly fell to the bank and then fell. The answer was instant. Because of the waves, the bottle jumped out my door. The pressure increased and the gates of hell opened. I felt the devil's gentle fire come out of bed. My soul, you don't understand my fear. There is emotional and physical pain. The sweet sounds of thousands of beans will get the sound of paradise. I saw the light and saw the darkness. I felt a strong tingling sensation of carbon dioxide and there was nothing left. I have found that the Lord will judge me. The devil bends and shrinks and expands which is crazy. It's worse than ever. My temper still doesn't understand these feelings, but they hurt. I've been thinking of hell and know that I can get some rest out of it. My bed was a wet cook. My god how do i purify myself?\n\nNever try what I've done\n\n\n# Effect\n\nI learned a very valuable lesson that day. Don't be crazy Beware of criminals.\n\nIn addition, the human layer can be extended by 8 cm without damaging the TIL.\n\nTL; Doctor: Men, stick with the war.",
            "wasnt planning on but thx anyways",
            "Be right back, gotta test.... something"
        ]
    },
    {
        "post_id": "fatk6l",
        "author": "Meemsterxd",
        "title": "You are NOT quirky.",
        "url": "https://www.reddit.com/r/copypasta/comments/fatk6l/you_are_not_quirky/",
        "score": 9738,
        "num_comments": 302,
        "created_utc": 1582890670.0,
        "selftext": "Wowww you like food, huh? That means you're quirky, right? WRONG! Everyone loves food you cum-soaked cunt, we LITERALLY NEED IT TO SURVIVE. You're not cool, you're not unique, you \"loving food\" isn't a fucking personality trait. You looove pizza and mcnuggets, and that means you're sooo easy to take care of, and guys should \"date YOU instead of all these other hoes\". Shut the fuck up.",
        "permalink": "/r/copypasta/comments/fatk6l/you_are_not_quirky/",
        "comments": [
            "Oh, you like food? Name every food.",
            "Wowww you like food, huh? That means you're quirky, right? WRONG! Everyone loves food you cum-soaked cunt, we LITERALLY NEED IT TO SURVIVE. You're not cool, you're not unique, you \"loving food\" isn't a fucking personality trait. You looove pizza and mcnuggets, and that means you're sooo easy to take care of, and guys should \"date YOU instead of all these other hoes\". Shut the fuck up.",
            "I feel like this copypasta was very genuine. Most of the others are clearly facetious, and theres absolutely nothing wrong with that, they're hilarious. But this has a backstory behind it, and real rage.",
            "Wowww you wike food, huh? That means you'we quiwky, wight? WWONG! Evewyone woves food you cum-soaked cunt, we WITEWAWWY NEED IT TO SUWVIVE. You'we not coow, you'we not unique, you \"woving food\" isn't a fucking pewsonawity twait. You wooove pizza and mcnuggets, and that means you'we sooo easy to take cawe of, and guys shouwd \"date YOU instead of aww these othew hoes\". Shut the fuck up.",
            "Meow",
            "Wowww you have a hydroflask, huh? That means you're quirky, right? WRONG! Everyone loves the environment you cum-soaked cunt,we LITERALLY NEED IT TO SURVIVE. You're not cool, you're not unique, you \"saving the turtles\" isn't a fucking personality trait. You looove recycling and eating green, and that means you're sooo environmentally conscious, and guys should \"date YOU instead of all these other hoes\". Shut the fuck up.",
            "Cock",
            "This but unironically",
            "u/nwordcountbot u/spez",
            "This is why radical Islam is the only solution to gender equality",
            "fresh",
            "Ik this is a copypasta but he still spitting facts doe",
            "Cock",
            "@literally every gacha life fan ever",
            "hello welcome to mcdonalds you are very very fat should i replace your french fries order with a salad maybe your extra greasy hamburger with a fat free veggie burger according to the scale you weigh 4000 pounds thats disgusting now go be a fatass and suck a dick its less fattening than a big mac hello fat cunt welcome to mcdiarrhea you are one obese motherfucker should i replace your shit ass garbage with something fucking healthy maybe your shit sandwich with something that won't give you a goddamn heart attack at 40 according to the scale you weigh 4000 pounds thats disgusting you goddamn landwhale now go be a fat cunt and suThe humanoid species populating the area today known as Alabama evolved from the bacterium cletus yeehawus. When c. yeehawus first evolved genitalia, an unknown bottleneck event happened that left a single family of four. These primitive mammalians had no choice but to mate with each other. All modern homo hillbillis are descended from this family, and have maintained the instinctual proclivity towards inbreeding. H. hillbillis has since migrated to other regions of North America, most recently having been spotted in Quebecck a fucking dick its less motherfucking fattening than a fucking big mac Greetings, my good sir. I must welcome you to this most elegant of high-class restaurants which is known by the name of McDonald's. However, you are quite overweight, and you have ordered a dish that is fairly unhealthy. Might I suggest substituting the potato-based side dish with a healthier salad? How about instead of a hamburger, I shall serve you a meat-free substitute made from vegetables, tofu, or another cruelty-free substance? The device we have provided to measure your weight dictates it to be 1814.369 kilograms! Absolutely ghastly! Please vacate the premises of our fine establishment, continue your hedonistic lifestyle, and maybe try fellatio. You might find that the male sex organ contains less fattening substances than our signature Big Mac. HEY FUCKNUTS YOU GONNA ORDER SOMETHING OR WHAT? NO NO NO NOT THE FRIES YOU FAT FUCK TRY A SALAD! MAYBE LAY OF THE MEAT TOO BITCH! YOU GOTTA BE WHAT? 4000 POUNDS? WTF? GET OUT OF HERE AND GO BLOW A GUY. I'M SURE YOU COULD SURVIVE ON A CUM-ONLY DIET FOR A WHILE. WAY BETTER FOR YOU THAN OUR SHITTY BIG MAC. Uhhh... can you order something already please? I mean, you've put on a bit of weight lately, maybe you should get a salad instead of what you usually get. Look at the scale, it's 4000 pounds dude. Not exactly healthy. Maybe you could try sucking dick. Semen is an excellent source of protein, and it's not nearly as fattening as the crap they serve here. wtf bro order something preferably something healthy cuz you weigh 4000 pounds try sucking dick instead hello welcome to mcdonalds you are very very fat should i replace your french fries order with a salad maybe your extra greasy hamburger with a fat free veggie burger according to the scale you weigh 4000 pounds thats disgusting now go be a fatass and suck a dick its less fattening than a big mac hello fat cunt welcome to mcdiarrhea you are one obese motherfucker should i replace your shit ass garbage with something fucking healthy maybe your shit sandwich with something that won't give you a goddamn heart attack at 40 according to the scale you weigh 4000 pounds thats disgusting you goddamn landwhale now go be a fat cunt and suck a fucking dick its less motherfucking fattening than a fucking big mac Greetings, my good sir. I must welcome you to this most elegant of high-class restaurants which is known by the name of McDonald's. However, you are quite overweight, and you have ordered a dish that is fairly unhealthy. Might I suggest substituting the potato-based side dish with a healthier salad? How about instead of a hamburger, I shall serve you a meat-free substitute made from vegetables, tofu, or another cruelty-free substance? The device we have provided to measure your weight dictates it to be 1814.369 kilograms! Absolutely ghastly! Please vacate the premises of our fine establishment, continue your hedonistic lifestyle, and maybe try fellatio. You might find that the male sex organ contains less fattening substances than our signature Big Mac. HEY FUCKNUTS YOU GONNA ORDER SOMETHING OR WHAT? NO NO NO NOT THE FRIES YOU FAT FUCK TRY A SALAD! MAYBE LAY OF THE MEAT TOO BITCH! YOU GOTTA BE WHAT? 4000 POUNDS? WTF? GET OUT OF HERE AND GO BLOW A GUY. I'M SURE YOU COULD SURVIVE ON A CUM-ONLY DIET FOR A WHILE. WAY BETTER FOR YOU THAN OUR SHITTY BIG MAC. Uhhh... can you order something already please? I mean, you've put on a bit of weight lately, maybe you should get a salad instead of what you usually get. Look at the scale, it's 4000 pounds dude. Not exactly healthy. Maybe you could try sucking dick. Semen is an excellent source of protein, and it's not nearly as fattening as the crap they serve here. wtf bro order something preferably something healthy cuz you weigh 4000 pounds try sucking dick instead hello welcome to mcdonalds you are very very fat should i replace your french fries order with a salad maybe your extra greasy hamburger with a fat free veggie burger according to the scale you weigh 4000 pounds thats disgusting now go be a fatass and suck a dick its less fattening than a big mac hello fat cunt welcome to mcdiarrhea you are one obese motherfucker should i replace your shit ass garbage with something fucking healthy maybe your shit sandwich with something that won't give you a goddamn heart attack at 40 according to the scale you weigh 4000 pounds thats disgusting you goddamn landwhale now go be a fat cunt and suck a fucking dick its less motherfucking fattening than a fucking big mac Greetings, my good sir. I must welcome you to this most elegant of high-class restaurants which is known by the name of McDonald's. However, you are quite overweight, and you have ordered a dish that is fairly unhealthy. Might I suggest substituting the potato-based side dish with a healthier salad? How about instead of a hamburger, I shall serve you a meat-free substitute made from vegetables, tofu, or another cruelty-free substance? The device we have provided to measure your weight dictates it to be 1814.369 kilograms! Absolutely ghastly! Please vacate the premises of our fine establishment, continue your hedonistic lifestyle, and maybe try fellatio. You might find that the male sex organ contains less fattening substances than our signature Big Mac. HEY FUCKNUTS YOU GONNA ORDER SOMETHING OR WHAT? NO NO NO NOT THE FRIES YOU FAT FUCK TRY A SALAD! MAYBE LAY OF THE MEAT TOO BITCH! YOU GOTTA BE WHAT? 4000 POUNDS? WTF? GET OUT OF HERE AND GO BLOW A GUY. I'M SURE YOU COULD SURVIVE ON A CUM-ONLY DIET FOR A WHILE. WAY BETTER FOR YOU THAN OUR SHITTY BIG MAC. Uhhh... can you order something already please? I mean, you've put on a bit of weight lately, maybe you should get a salad instead of what you usually get. Look at the scale, it's 4000 pounds dude. Not exactly healthy. Maybe you could try sucking dick. Semen is an excellent source of protein, and it's not nearly asREMOVE SWASTIKA remove swastika you are worst nazi. you are the nazi idiot you are the nazi smell. return to hell. to our nazi cousins you may come our contry. you may live in the gas chamber….ahahahaha ,hitler we will never forgeve you. fascist rascal FUck but fuck asshole nazi stink hitler gestapo ghetsapo..battle of berlin best day of my life. take a bath of dead nazi..ahahahahahHITLER WE WILL GET YOU!! do not forget ww2 .italy we kill the duce , fascist return to your precious hell….hahahahaha idiot nazi and fascist smell so bad..wow i can smell it. REMOVE SWASTIKA FROM THE PREMISES. you will get caught. russia+usa+britain+france+canada+australia+new zealand=kill nazi…you will ww2/ hitler dead in the ground, hitler burning in hell . hitler burn in hell. we are free and have democracy now hahahaha ha because of grandparents… you are ppoor stink nazi… you live in a trailer park hahahaha, you live in a dump hitler dead burning in hell ….fuck the alt right ,..FUCKk ashol nazis no good i spit﻿ in the mouth eye of ur flag and ideology. hitler ded and real week pusy kill himself and his dog with cowardice now you the nazi burn in hell .angry moustache model adofl hilter fukc the great satan and lay egg this egg hatch and nazis wa;s born. stupid baby form the eggn go bak to hell we will crush u lik a skull of pig. nazis worsttt pepoelfattening as the crap they serve here. wtf bro order something preferably something healthy cuz you weigh 4000 pounds try sucking dick insteadThanos is such a fucking cuck. His platform only calls for killing HALF of all life in the universe. We need a REAL LEADER who truly has our best interests at heart. We need someone who won't kowtow to leftist liberal bullshit and WIPE OUT ALL LIFE THROUGHOUT THE UNIVERSE. HEAT DEATH 2020!!! Make Everything Dead AgainAaAaaAaaaAaaaaAaaaaaAaaaaaaAaaaaaaaAaAaAafuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckSir, for the last time, the Szechuan Sauce promotion was for a limited time only. If you like, I can jerk off into one of those paper ketchup things and give it to you you fat fucking PATHETIC BARELY SENTIENT TUB OF GODDAMN MOTHERFUCKING LARD BITCH! NO I WILL NOT SELL YOU A BIG MAC I WILL ONLY SELL YOU SALAD WITH MY CUM AS FUCKING DRESSING THE SCALE SAYS YOU WEIGH 4000 POUNDS NOW GO BE A FATASS AND SUCK A DICK ITS LESS FATTENING THAN A BIG MAC.fuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuckfuck hello welcome to mcdonalds i stuck my dick in a bun now suck it bitch mother fuckermother fuckermother fuckermother fuckermother fuckermother fuckermother fuckermother fuckermother fuckermother fuckermother fuckermother fuckermother",
            "she quirky doe",
            "Yum, this is good pasta 🍝",
            "I’m gonna say this to a girl at school who is like this",
            "Cock",
            "Same could be said but about girls that think liking dogs is a personality trait",
            "This but cock virgin god 69",
            "A cornel of truth in this one.",
            "[deleted]",
            ">cum-soaked cunt\n\nThat's a good insult",
            "It's not entirely wrong though",
            "u/nwordcountbot u/JeffersonComingHome",
            "My boss said I am quirky the other day and it kinda bummed me out.",
            "I don’t think this guy knows how fat I am.",
            "Cock",
            "Virgin god cock anime",
            "Cock",
            "I like food",
            "Cock",
            "[deleted]",
            "Nta quirkiness is gay",
            "gacha life",
            "People who always type the first letter of a sentence in lowercase to act quirky",
            "PREACH IT BROTHER",
            "[u/nwordcountbot](https://www.reddit.com/u/nwordcountbot/) u/nigga",
            "I dont like food",
            "NTA",
            "I personally don’t especially like food all the much. Just bc you need something doesn’t necessarily like it",
            "NTA op! Eat stupid food get diarrhoea! Fuck that hoe",
            "Cock",
            "Is liking trains not quirky though? Personally I think I need trains to survive but I don't know about other people.",
            "I 100% agree",
            "Com soaked cunt is a new one I will forever use now",
            "You say you like food, but you probably don't even listen to any of his music",
            "This is the most true copypasta I have every read",
            "I only eat cat food. Am I quirky?",
            "Tumblr users would like to know your location",
            "r/youarenotquirky",
            "u/nwordcountbot u/AutoModerator",
            "NTA, your food your rules.",
            "Being in a sorority has taught me that any girl that thinks they're unique for \"liking\" food and having food as a personality traits, has clearly never talked to another girl. We fucking love food. We will get together and end up talking about new menu items or new restaurants on campus. Everybody fucking loves food. It's a weird Sister Bonding thing.",
            "Cock",
            "Cock",
            "Cock",
            "Same thing applies for people who \"don’t like eating/food\". Shut the fuck up bitch nobody cares.",
            "Why are these always bad?"
        ]
    },
    {
        "post_id": "kmdvjm",
        "author": "somerandoonreddit29",
        "title": "An actual ad on YouTube I’m not kidding, wtf.",
        "url": "https://www.reddit.com/r/copypasta/comments/kmdvjm/an_actual_ad_on_youtube_im_not_kidding_wtf/",
        "score": 9731,
        "num_comments": 236,
        "created_utc": 1609246438.0,
        "selftext": "This is my magic sex gun. All I do is point it at a woman I want to fuck, and BANG! She's all over me. How does it work? Go to MagicSexGun.com. You can have your own! And it's not buying hookers, not using personal sites, and definitely not spanking it to porn... so go to MagicSexGun.com before we take the site down. This magic sex gun works especially well on younger women. Point your magic sex gun at your innocent-looking young coworker and bam! She's sucking your dick below the desk. Point it at the cute young French woman bagging your groceries and bam! She's letting you rail her behind the dumpster. And of course... point it at any girl on a dating app site, and well... you'll feel like you have a sex machine gun with all the women you're mowing down. This is only if you go to MagicSexGun.com. Get it right now: MagicSexGun.com. There's only so many magic sex guns available,  so you want to get in while the getting is good. MAGICSEXGUN.COM!\n\nEdit: An NSFW advertisement copypasta is now my most upvotes post. Ever. Thanks...\n\nEdit 2: apparently this was already posted 2 years ago by u/legoandmars and only received 22 upvotes. Have to give credit where credit is needed.",
        "permalink": "/r/copypasta/comments/kmdvjm/an_actual_ad_on_youtube_im_not_kidding_wtf/",
        "comments": [
            "If y'all are wondering the legitemacy of the ad, I've seen a video of it on r/Cringetopia, so it's real lol.",
            "does this work on men",
            "NTA your gun your rules",
            "This is my magic sex gun. What I'm doing is killing a girl who wants sex and boom! It all depends on me. How does it work? Go to MagicSexGun.com. You can show yourself! And he doesn't buy prostitutes, he doesn't use his personal website, he doesn't have pornographic images. Go to Magicsexgun.com before deleting the site. This magical magical weapon is perfect for little girls. Aim your ridiculous stupid weapon for innocent teens! He sucks cock in the office and talks to beautiful French girls who tie your food to them! This way you can tie it to the back of the trash. Sure ... Connect with any girl on a dating site. Well ... you feel like you have a gun with all the women you talk to. This only applies when you go to MagicSexGun.com. Get It Now: Magicsexgun.com. If you are looking for something good, you will need to download a lot of magic weapons. MAGICSEXGUN.COM!",
            "THANKS MAGIC SEX GUN AND THE YOUTUBE AD ALGORITHM",
            "The magic sex gun made me lose my wife and get her back in the same day",
            "This is my magic sex gun. There are many like it, but this one is mine. My magic sex gun is my best friend. It is my life. I must master it as I must master my life. Without me, my magic sex gun is useless. Without my magic sex gun, I am useless. I must fire my magic sex gun true.",
            "I’ve seen this ad",
            "I want to visit the website but I'll probably get a virus",
            "automatic quickest narrow flag lush zealous start cause yam unpack\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev)*",
            "https://www.reddit.com/r/shittymobilegameads/comments/kmbcla/ive_literally_seen_this_ad_on_porn_videos/?utm_medium=android_app&utm_source=share\n\nLink to video if you wanna see it",
            "This sounds like an ad they’d do on Rick and Morty for Interdimensional Cable",
            "This is my magic sex gun. Aww I do is point it at a woman I want to fuck, and BANG! She's aww ovew me. How does it wowk? Go to MagicSexGun.com. You can have youw own! And it's not buying hookews, not using pewsonaw sites, and definitewy not spanking it to pown... so go to MagicSexGun.com befowe we take the site down. This magic sex gun wowks especiawwy weww on youngew women. Point youw magic sex gun at youw innocent-wooking young cowowkew and bam! She's sucking youw dick bewow the desk. Point it at the cute young Fwench woman bagging youw gwocewies and bam! She's wetting you waiw hew behind the dumpstew. And of couwse... point it at any giww on a dating app site, and weww... you'ww feew wike you have a sex machine gun with aww the women you'we mowing down. This is onwy if you go to MagicSexGun.com. Get it wight now: MagicSexGun.com. Thewe's onwy so many magic sex guns avaiwabwe,  so you want to get in whiwe the getting is good. MAGICSEXGUN.COM!",
            "This is my magic 🧙‍♂️✨ sex 👉👌 gun 🔫. All 💯 I 👁 do is point 📍 it at a woman 👩 I 👁 want 😋 to fuck 🖕, and BANG 😩💦💥! She's 👧 all 💯👌👀 over 😳🙊💦 me. How does it work 🏢? Go 🏃 to MagicSexGun.com. You 👉 can have your 👉 own! And it's not buying 💸 hookers 🎣, not using 🏻 personal 👨 sites 🚫💻📥, and definitely 💯 not spanking 👋🏼🍑 it to porn 🍑... so go 🏃 to MagicSexGun.com before 😂 we take 👊 the site 💗💻😘 down ⬇. This magic 🎩 sex 🍆 gun 🔫 works 💼 especially 💯 well 😤 on 🔛 younger 🧒 women 👩. Point 📍 your 👈 magic ✨🧙‍♂️ sex 🍆 gun 🔫 at your 👉 innocent-looking young 🧒 coworker 👨 and bam 💦✴! She's 🤜👩 sucking 😜💦 your 👉 dick 🍆🥕🥖 below 🙆 the desk 👌. Point 📍 it at the cute 😏 young 👶 French 🥐 woman 👧 bagging 💰💵🤑 your 👈 groceries 🍅🍏🍐 and bam 💦✴! She's 👧 letting 🤗💁🏻 you 👈 rail 🚂💦👨🏻 her 👩 behind 👟 the dumpster 🗑. And of course 😂... point 🈯 it at any girl 🕵👩 on 🔛 a dating 👫 app 📲 site 💻🚫📥, and well 😦... you'll feel 😜 like 👌👍 you 👉 have a sex 👉👌 machine 😡🤖🍆 gun 🔫 with all 💯 the women 👩 you're mowing 🌾 down 👇🏽⬇. This is only if you 👉 go 🏃 to MagicSexGun.com. Get 🉐 it right 👌 now: MagicSexGun.com. There's ✔ only so many 👬 magic 🎩 sex 🍆 guns 🔫 available 💢, so you 👈 want 😍 to get 🔟 in while the getting 👉🔟👈 is good 👍🏼. MAGICSEXGUN.COM!",
            "i wanna know the contents of the website",
            "where is cummy",
            "I got this ad at like 3 am last night and I was like what the actual fuck did I just watch",
            "https://www.reddit.com/r/SomeOrdinaryGmrs/comments/kmawpz/youtube_just_doesnt_care/?utm_medium=android_app&utm_source=share",
            "What the actual fuck?",
            "This is my magic sex gun. There are many like it but this one is mine.",
            "I got this yesterday and I was waiting for the fucking punchline and it never came",
            "Is it just a normal gun lol",
            "I saw this on r/YouTube , it’s fucking real",
            "I am sex weapons guy. And this is my weapon.",
            "this is where the link goes: [what the fuck is this](https://desiresystem.com/?r=178201940&a=193626&o=50&s1=MSGun&s2=wttllmvhbhcfkud42ce6la3f&s3=)",
            "Me, my brother, and my friend saw it as well like at 3 am that shit was funny asf",
            "I got it too like a year ago last time",
            "Can't say \"fr*ck\" but you can literally advertise to children how to have sex.",
            "OP, I'm pretty sure that's called rape at gunpoint.",
            "Ok guys so I went to magicsexgun.com and it redirects to desiresystem.com, which has a video about the one simple trick to make any woman uncontrollably horny. And in their video they talk about how the feminists are trying to take down their website because \"giving men this much power over women is a step back in today's progressive society\" fucking LOL AND THIS SCAM HAS BEEN RUNNING SINCE 2013 HOW THOUGH",
            "Now that's fine and good but i feel underrepresented. I straghts can have one, i deserve to have one that only works on gay furries",
            "[deleted]",
            "LMFAO i just visited the link to see what the bait was and it’s 25 minutes of my life i’ll never get back",
            "[bet](http://Magicsexgun.com)",
            "I saw this lol",
            "Holy shit i saw this! One of the pictures in the ad legit had a girl sucking a guy off uncensored.",
            "Can confirm that not only is M A G I C S E X G U N D O T C O M real, it even works to turn straight dudes gay!  Now you can get any straight guy to fuck you just by using the M A G I C S E X G U N!  That twunk, college jock on Spring Break?  He fucked my brains out in the beach bathrooms.  That hunk out for dinner with his wife with the bulging biceps in a ridiculously tight shirt?  I had him sucking my cock right in front of his wife’s salad.  Go to M A G I C S E X G U N D O T C O M and get yours today!    Supplies are limited, and the site will be taken down soon before the straights catch on.  M A G I C S E X G U N D O T C O M.  Now for the gays!",
            "I SAW THAT LAST NIGHT LMAO\n\nI can confirm it’s real",
            "Man i just get like, normal ads about shit. Where do ya'll find this stuff?",
            "What happens if you shoot yourself?",
            "###NORMALIZE MAGIC SEX GUNS\n\n##NORMALIZE MAGIC SEX GUNS\n\n#NORMALIZE MAGIC SEX GUNS",
            "r/itemshop",
            "\"Works especially well on young women\"\nDamn guess I'm bringing it to show and tell",
            "This is my magic sex gun. All I do is point it at a woman I want to fuck, and BANG! She's all over me. How does it work? Go to MagicSexGun.com. You can have your own! And it's not buying hookers, not using personal sites, and definitely not spanking it to porn... so go to MagicSexGun.com before we take the site down. This magic sex gun works especially well on younger women. Point your magic sex gun at your innocent-looking young coworker and bam! She's sucking your dick below the desk. Point it at the cute young French woman bagging your groceries and bam! She's letting you rail her behind the dumpster. And of course... point it at any girl on a dating app site, and well... you'll feel like you have a sex machine gun with all the women you're mowing down. This is only if you go to MagicSexGun.com. Get it right now: MagicSexGun.com. There's only so many magic sex guns available,  so you want to get in while the getting is good. MAGICSEXGUN.COM!",
            "I need to see it to believe it",
            "I got this ad lmao",
            "[removed]",
            "ㄒ卄丨丂 丨丂 爪ㄚ 爪卂Ꮆ丨匚 丂乇乂 Ꮆㄩ几. 卂ㄥㄥ 丨 ᗪㄖ 丨丂 卩ㄖ丨几ㄒ 丨ㄒ 卂ㄒ 卂 山ㄖ爪卂几 丨 山卂几ㄒ ㄒㄖ 千ㄩ匚Ҝ, 卂几ᗪ 乃卂几Ꮆ! 丂卄乇'丂 卂ㄥㄥ ㄖᐯ乇尺 爪乇. 卄ㄖ山 ᗪㄖ乇丂 丨ㄒ 山ㄖ尺Ҝ? Ꮆㄖ ㄒㄖ 爪卂Ꮆ丨匚丂乇乂Ꮆㄩ几.匚ㄖ爪. ㄚㄖㄩ 匚卂几 卄卂ᐯ乇 ㄚㄖㄩ尺 ㄖ山几! 卂几ᗪ 丨ㄒ'丂 几ㄖㄒ 乃ㄩㄚ丨几Ꮆ 卄ㄖㄖҜ乇尺丂, 几ㄖㄒ ㄩ丂丨几Ꮆ 卩乇尺丂ㄖ几卂ㄥ 丂丨ㄒ乇丂, 卂几ᗪ ᗪ乇千丨几丨ㄒ乇ㄥㄚ 几ㄖㄒ 丂卩卂几Ҝ丨几Ꮆ 丨ㄒ ㄒㄖ 卩ㄖ尺几... 丂ㄖ Ꮆㄖ ㄒㄖ 爪卂Ꮆ丨匚丂乇乂Ꮆㄩ几.匚ㄖ爪 乃乇千ㄖ尺乇 山乇 ㄒ卂Ҝ乇 ㄒ卄乇 丂丨ㄒ乇 ᗪㄖ山几. ㄒ卄丨丂 爪卂Ꮆ丨匚 丂乇乂 Ꮆㄩ几 山ㄖ尺Ҝ丂 乇丂卩乇匚丨卂ㄥㄥㄚ 山乇ㄥㄥ ㄖ几 ㄚㄖㄩ几Ꮆ乇尺 山ㄖ爪乇几. 卩ㄖ丨几ㄒ ㄚㄖㄩ尺 爪卂Ꮆ丨匚 丂乇乂 Ꮆㄩ几 卂ㄒ ㄚㄖㄩ尺 丨几几ㄖ匚乇几ㄒ-ㄥㄖㄖҜ丨几Ꮆ ㄚㄖㄩ几Ꮆ 匚ㄖ山ㄖ尺Ҝ乇尺 卂几ᗪ 乃卂爪! 丂卄乇'丂 丂ㄩ匚Ҝ丨几Ꮆ ㄚㄖㄩ尺 ᗪ丨匚Ҝ 乃乇ㄥㄖ山 ㄒ卄乇 ᗪ乇丂Ҝ. 卩ㄖ丨几ㄒ 丨ㄒ 卂ㄒ ㄒ卄乇 匚ㄩㄒ乇 ㄚㄖㄩ几Ꮆ 千尺乇几匚卄 山ㄖ爪卂几 乃卂ᎶᎶ丨几Ꮆ ㄚㄖㄩ尺 Ꮆ尺ㄖ匚乇尺丨乇丂 卂几ᗪ 乃卂爪! 丂卄乇'丂 ㄥ乇ㄒㄒ丨几Ꮆ ㄚㄖㄩ 尺卂丨ㄥ 卄乇尺 乃乇卄丨几ᗪ ㄒ卄乇 ᗪㄩ爪卩丂ㄒ乇尺. 卂几ᗪ ㄖ千 匚ㄖㄩ尺丂乇... 卩ㄖ丨几ㄒ 丨ㄒ 卂ㄒ 卂几ㄚ Ꮆ丨尺ㄥ ㄖ几 卂 ᗪ卂ㄒ丨几Ꮆ 卂卩卩 丂丨ㄒ乇, 卂几ᗪ 山乇ㄥㄥ... ㄚㄖㄩ'ㄥㄥ 千乇乇ㄥ ㄥ丨Ҝ乇 ㄚㄖㄩ 卄卂ᐯ乇 卂 丂乇乂 爪卂匚卄丨几乇 Ꮆㄩ几 山丨ㄒ卄 卂ㄥㄥ ㄒ卄乇 山ㄖ爪乇几 ㄚㄖㄩ'尺乇 爪ㄖ山丨几Ꮆ ᗪㄖ山几. ㄒ卄丨丂 丨丂 ㄖ几ㄥㄚ 丨千 ㄚㄖㄩ Ꮆㄖ ㄒㄖ 爪卂Ꮆ丨匚丂乇乂Ꮆㄩ几.匚ㄖ爪. Ꮆ乇ㄒ 丨ㄒ 尺丨Ꮆ卄ㄒ 几ㄖ山: 爪卂Ꮆ丨匚丂乇乂Ꮆㄩ几.匚ㄖ爪. ㄒ卄乇尺乇'丂 ㄖ几ㄥㄚ 丂ㄖ 爪卂几ㄚ 爪卂Ꮆ丨匚 丂乇乂 Ꮆㄩ几丂 卂ᐯ卂丨ㄥ卂乃ㄥ乇,  丂ㄖ ㄚㄖㄩ 山卂几ㄒ ㄒㄖ Ꮆ乇ㄒ 丨几 山卄丨ㄥ乇 ㄒ卄乇 Ꮆ乇ㄒㄒ丨几Ꮆ 丨丂 Ꮆㄖㄖᗪ. 爪卂Ꮆ丨匚丂乇乂Ꮆㄩ几.匚ㄖ爪!",
            "I’ve seen this and i have no fucking idea what it’s advertising",
            "is this the same 30 minute ad I get sometimes on youtube about a magic trick that will make any girl want to fuck you?",
            "[magic sex gun](http://magicsexgun.com)",
            "i see.",
            "I got the add earlier",
            "Literally I seen an ad on YouTube yesterday for PERIOD SEX. Not joking....a REAL ad. I just couldn’t believe honestly why we need ads for that but ok lmfaooo.",
            "Alex?",
            "I saw that and I’m scared",
            "Took a screenshot of the ad, I have it on my account. It's fuckin stupid man.",
            "“ and definitely not spanking it to porn...” wtf 😂",
            "God damn I need this 😔",
            "An actual ad on YouTube I’m not kidding, wtf.\n\nThis is my magic sex gun. All I do is point it at a woman I want to fuck, and BANG! She's all over me. How does it work? Go to MagicSexGun.com. You can have your own! And it's not buying hookers, not using personal sites, and definitely not spanking it to porn... so go to MagicSexGun.com before we take the site down. This magic sex gun works especially well on younger women. Point your magic sex gun at your innocent-looking young coworker and bam! She's sucking your dick below the desk. Point it at the cute young French woman bagging your groceries and bam! She's letting you rail her behind the dumpster. And of course... point it at any girl on a dating app site, and well... you'll feel like you have a sex machine gun with all the women you're mowing down. This is only if you go to MagicSexGun.com. Get it right now: MagicSexGun.com. There's only so many magic sex guns available, so you want to get in while the getting is good. MAGICSEXGUN.COM!",
            "I once saw a similar yt ad about a 'balls trimmer'.\nNot kidding. Those exact words. 'Balls trimmer'.",
            "Call me Dylan Klebold 😏",
            "I have a magic sex gun too.\nIt works like this:\nI point it at a woman,\nI pull the trigger,\nThe magic sex gun makes a really loud noise,\nAnd BAM! i can do whatever i want to the woman and she wont say a single word!!\nBut mine has some weird side effects... \nThe woman always has a hole in her body after i use it and she remains silent even after i finish....... Well maybe i gave her her best orgasm she ever had and shes in shock lmao\nSo yeah the magic sex gun is AWESOME!!! GO GET ONE TODAY!!!!!!",
            "I saw that",
            "Yep, this is real. I've seen it a few times on... some select websites.",
            "And I thought the weirdest YouTube ad was one of a guy trying to raise support for his quest to convert Israel to Christianity.",
            "Does this gun works to guys thought?",
            "Has anyone tried going to MagicSexGun.Com?",
            "I have seen that once and I don’t like it",
            "Bruh I legit got this as an ad last night.\n\nWhat the fuck youtube",
            "I must know what lies beyond... im going in\n\nEdit: i just watched a 20 minute video about how the magic sex gun is actually 1 easy trick that women HATE and it costs $67 to learn it. What a let down.",
            "I've seen a FUCKING LOT of ads like this. I mean ads that prey on lonely men to get scammed. What the fuck is wrong with people? I see this shit everyday and it makes me so fucking angry and sad",
            "I only like milfs so that's gonna be a no for me",
            "[magic sex gun](www.magicsexgun.com)",
            "I'll take your entire stock",
            "the video on the website is lije 40 min long and ill never get that time back",
            "it redirects lol",
            "Is it real? The gun I mean",
            "Here's a link to the video \n\n[**https://www.youtube.com/watch?v=VmZaODD06Tc**](https://www.youtube.com/watch?v=VmZaODD06Tc)",
            "Wtf were you watching that made the algorithm give you that ad",
            "Omg I'm so fucking glad I'm not the only one who saw this fucking ad",
            "I GOT THAT AS WELL, TWICE",
            "yeah i got it yesterday, on a russian badger video. the amount of kids that have probably seen it is disappointing",
            "Oh my god I heard this one last night. It’s fucking insane",
            "Well, that's something",
            "I checked it and watch half of their video. Yawning makes women horny. Thats what they said",
            "I got this ad too, it was weird as shit",
            "They allow ads like these and child p*** on youtube but they dont let a youtuber curse in a video without getting demonized...?",
            "I think the best part is it goes “how does it work?” And then just moves on",
            "It really sounds like a Gta ad lol",
            "LoL",
            "Oh my gosh, I remember this shit too well, but it was on porn videos. There's also the unbelievable ad on porn videos about a \"newly discovered loophole in the female mind\" and they have this dramatic music in the background, it's hilariously bad.",
            "u/uwuwizard",
            "anyone notice how youtube and twitch are both terrible at what they do?",
            "I got this on pornhub.",
            "What I particularly like is how it mentions the question of \"How does it work?\" And convienently changes topic in the next sentence, never to bring it up again. *how does it work? Stick a 7$ up your ass, shit it out, and sniff it to find our secret ya jackwad! It just does!*",
            "\"Why don't you have adblock on your computer?\"",
            "[The Orgasmotator?](https://youtu.be/o0fNNWDe0hs)",
            "Ive actually seen the ad lmao. I clicked on the site looking for a laugh and its the dumbest fucking website ive ever seen",
            "This is my magic sex gun. All I do is point it at a woman I want to fuck, and BANG! She's all over me. How does it work? Go to MagicSexGun.com. You can have your own! And it's not buying hookers, not using personal sites, and definitely not spanking it to porn... so go to MagicSexGun.com before we take the site down. This magic sex gun works especially well on younger women. Point your magic sex gun at your innocent-looking young coworker and bam! She's sucking your dick below the desk. Point it at the cute young French woman bagging your groceries and bam! She's letting you rail her behind the dumpster. And of course... point it at any girl on a dating app site, and well... you'll feel like you have a sex machine gun with all the women you're mowing down. This is only if you go to MagicSexGun.com. Get it right now: MagicSexGun.com. There's only so many magic sex guns available,  so you want to get in while the getting is good. MAGICSEXGUN.COM!",
            "https://youtu.be/DRolhuX-Enw"
        ]
    }
]