[
    {
        "post_id": "kqyb6w",
        "author": "None",
        "title": "IS THAT A DOOM REFERENCE??",
        "url": "https://www.reddit.com/r/copypasta/comments/kqyb6w/is_that_a_doom_reference/",
        "score": 8830,
        "num_comments": 368,
        "created_utc": 1609852703.0,
        "selftext": "IS THAT A FUCKING DOOM REFERENCE?? DOOMSLAYER IS SO COOL! RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸LOCAL MAN TOO ANGRY TO DIE!!! DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶 THE LONGER ICON✳ OF SIN☠✝️ STAYS ON EARTH🌏 THE STRONGER💪 HE👨 WILL BECOME BUT YOU CAN'T SHOOT🔫 A HOLE🕳 INTO THE SURFACE OF MARS!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌",
        "permalink": "/r/copypasta/comments/kqyb6w/is_that_a_doom_reference/",
        "comments": [
            "How did you make the jojo copypasta worse",
            "Ing! Is this a bad relationship? The killer is very poisonous. Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears, Tears of Great Torment x Isabelle or Keller Roca x Isabelle Punishment x Isabelle Punishment x Isabelle x Isabelle's killer x Isabelle Isabelle Doom killer x Isabelle",
            "IS THAT A FUCKING DOOM REFERENCE?? DOOMSLAYER IS SO COOL! RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸LOCAL MAN TOO ANGRY TO DIE!!! DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶 THE LONGER ICON✳ OF SIN☠✝️ STAYS ON EARTH🌏 THE STRONGER💪 HE👨 WILL BECOME BUT YOU CAN'T SHOOT🔫 A HOLE🕳 INTO THE SURFACE OF MARS!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌",
            "Doritos cheetos or fritos",
            "You forgot that stupid fucking rabbit those 14 year olds can't stop hrm hrm'ing about",
            "IS THAT A FUCKING 🍆🍑 DOOM 😓😰 REFERENCE 👀👄🙀?? DOOMSLAYER IS SO COOL 🆒😎‼! RIP 💀 AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸LOCAL MAN 👦 TOO ANGRY 😡😤👺 TO DIE ☠😂!!! DOOMSLAYER X ❌ ISABELLE 🦙😊 🐶DOOMSLAYER X ❌ ISABELLE 🦙😊 🐶DOOMSLAYER X ❌ ISABELLE 🦙😊 🐶DOOMSLAYER X ❌ ISABELLE 🦙😊 🐶DOOMSLAYER X ❌ ISABELLE 🦙😊 🐶DOOMSLAYER X ❌ ISABELLE 🦙😊 🐶DOOMSLAYER X ❌ ISABELLE 🦙😊 🐶 THE LONGER 📏 ICON✳ OF SIN☠✝️ STAYS ✋ ON 🔛 EARTH🌏 THE STRONGER💪 HE👨 WILL BECOME 💦👅 BUT 🍑 YOU 👉 CAN'T 🚫 SHOOT🔫 A HOLE🕳 INTO THE SURFACE 🌎 OF MARS!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌",
            "am i able to like one fucking thing without it getting circlejerked into oblivion? i literally just bought doom eternal and now i'm seeing this shit",
            "‼️‼️HOLY FUCKING SHIT‼️‼️‼️‼️ IS THAT A MOTHERFUCKING JOJO REFERENCE??????!!!!!!!!!!11!1!1!1!1!1!1! 😱😱😱😱😱😱😱 JOJO IS THE BEST FUCKING ANIME 🔥🔥🔥🔥💯💯💯💯 JOSUKE IS SO BADASSSSS 😎😎😎😎😎😎😎👊👊👊👊👊 ORAORAORAORAORALORAORAORAORAORAORAORAORAORAORAORAORAORAORAORA 😩😩😩😩😩😩😩😩 😩😩😩😩 MUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDA 🤬😡🤬😡🤬😡🤬🤬😡🤬🤬😡WRYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Oh you’re approaching me❓❓❓❓❓❓❓❓❓❓But it was me, Dio‼️‼️‼️‼️‼️‼️‼️‼️‼️‼️😂🤣😂🤣😂🤣😂😂😂🤣🤣🤣😂😂",
            "This isabellxdoomguh is one of the worst memes of the year",
            "RIP MF DOOM",
            "IS THAT A FUCKING DOOM WEFEWENCE?? DOOMSWAYEW IS SO COOW! WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WIP AND TEAW🩸WOCAW MAN TOO ANGWY TO DIE!!! DOOMSWAYEW X ISABEWWE 🐶DOOMSWAYEW X ISABEWWE 🐶DOOMSWAYEW X ISABEWWE 🐶DOOMSWAYEW X ISABEWWE 🐶DOOMSWAYEW X ISABEWWE 🐶DOOMSWAYEW X ISABEWWE 🐶DOOMSWAYEW X ISABEWWE 🐶 THE WONGEW ICON✳ OF SIN☠✝️ STAYS ON EAWTH🌏 THE STWONGEW💪 HE👨 WIWW BECOME BUT YOU CAN'T SHOOT🔫 A HOWE🕳 INTO THE SUWFACE OF MAWS!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌",
            "Sometimes he rhyme quick, sometimes he rhyme slow. Or vice versa",
            "The sequel to IS THAT A JOJO REFERENCE?!?!",
            "IS THAT A MOTHER FUCKING JOJO REFERENCE!? MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MYDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUSA MUDA MUDA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA ORA OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE OI JOSUKE ZA WARUDO MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA MUDA KILLER QUEEN BITES THE DUST KILLER QUEEN BITES THE DUST KILLER QUEEN BITES THE DUST KILLER QUEEN BITES THE DUST KILLER QUEEN BITES THE DUST WRYYYYYYYYYYYYYYYYYYYYYY",
            ">AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AN\n\nmy asshole be like LOLLOLL",
            "Now do Fallout NV",
            "Thought this was gonna be about Doritos Cheetos and Fritos :(",
            "NOOOOO OOOO DONT GOOGLE DOOMSLAYER X ISABELLE NOOOOOOOOOOO MY FUCKING EYES\n\n\n\nEdit:I'm Racist.",
            "MF DOOM > Doomslayer",
            "Doom fanbase is fucking annoying",
            "nice.",
            "IS THAT A FUCKING DOOM REFERENCE?? DOOMSLAYER IS SO COOL! RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸LOCAL MAN TOO ANGRY TO DIE!!! DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶 THE LONGER ICON✳ OF SIN☠✝️ STAYS ON EARTH🌏 THE STRONGER💪 HE👨 WILL BECOME BUT YOU CAN'T SHOOT🔫 A HOLE🕳 INTO THE SURFACE OF MARS!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌",
            "wait i got doom for christmas is this what i am doomed to become",
            "I thought this was an mf doom thing and oh boy",
            "IS THAT AN AMONG US REFFERENCE??!!\n\n‼️‼️HOLY FUCKING SHIT‼️‼️‼️‼️ IS THAT A MOTHERFUCKING AMONG US REFERENCE??????!!!!!!!!!!11!1!1!1!1!1!1! 😱😱😱😱😱😱😱 AMONG US IS THE BEST FUCKING GAME 🔥🔥🔥🔥💯💯💯💯 RED IS SO SUSSSSS 🕵️🕵️🕵️🕵️🕵️🕵️🕵️🟥🟥🟥🟥🟥 COME TO MEDBAY AND WATCH ME SCAN 🏥🏥🏥🏥🏥🏥🏥🏥 🏥🏥🏥🏥 WHY IS NO ONE FIXING O2 🤬😡🤬😡🤬😡🤬🤬😡🤬🤬😡 OH YOUR CREWMATE? NAME EVERY TASK 🔫😠🔫😠🔫😠🔫😠🔫😠 Where Any sus!❓ ❓ Where!❓ ❓ Where! Any sus!❓ Where! ❓ Any sus!❓ ❓ Any sus! ❓ ❓ ❓ ❓ Where!Where!Where! Any sus!Where!Any sus Where!❓ Where! ❓ Where!Any sus❓ ❓ Any sus! ❓ ❓ ❓ ❓ ❓ ❓ Where! ❓ Where! ❓ Any sus!❓ ❓ ❓ ❓ Any sus! ❓ ❓ Where!❓ Any sus! ❓ ❓ Any sus!❓ ❓ ❓ Any sus!❓ ❓ ❓ ❓ Where! ❓ Where! Where!Any sus!Where! Where! ❓ ❓ ❓ ❓ ❓ ❓ I think it was purple!👀👀👀👀👀👀👀👀👀👀It wasnt me I was in vents!!!!!!!!!!!!!!😂🤣😂🤣😂🤣😂😂😂🤣🤣🤣😂😂😂",
            "I won't shoot mars, instead I'll piss on the moon",
            "IS THAT A FUCKING DOOM REFERENCE?? DOOMSLAYER IS SO COOL! RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸LOCAL MAN TOO ANGRY TO DIE!!! DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶 THE LONGER ICON✳ OF SIN☠✝️ STAYS ON EARTH🌏 THE STRONGER💪 HE👨 WILL BECOME BUT YOU CAN'T SHOOT🔫 A HOLE🕳 INTO THE SURFACE OF MARS!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌",
            "In the first age, in the first battle, when the shadows first lengthened, one stood. Burned by the embers of Armageddon, his soul blistered by the fires of hell, tainted beyond ascension, he chose the path of perpetual torment. In his ravenous hatred he found no peace, and with boiling blood he scoured the umbral plains seeking vengeance against the dark lords who had wronged him. He wore the crown of the night sentinels, and those that tasted the bite of his sword named him... the doom slayer.",
            "[bruh](https://imgur.com/a/wROJEOy)",
            "All caps",
            "Hot take but people who spam these copypastas are just as annoying as the people they use them against maybe even more so.",
            "YOU, YOU HAVE HUGE GUTS, RIP AND TEAR THESE GUTS",
            "What if ISABELLE and DOOM SLAYER. . .  WERE BEST FREINDSIES😳😳😳😳😳😳",
            "Oh my god did you say metal? Yes I listen to metal, I heard the Doom OST. What's a Cannibal Corpse? Met-what-ica? What priest?",
            "This was literally below a post from r/Doom",
            "god the isabelle and doomslayer/ doom is eternal memes were awful",
            "Doom fans and JoJo fans are cut from the same cringy cloth",
            "丨丂 ㄒ卄卂ㄒ 卂 千ㄩ匚Ҝ丨几Ꮆ ᗪㄖㄖ爪 尺乇千乇尺乇几匚乇?? ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 丨丂 丂ㄖ 匚ㄖㄖㄥ! 尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸尺丨卩 卂几ᗪ ㄒ乇卂尺🩸ㄥㄖ匚卂ㄥ 爪卂几 ㄒㄖㄖ 卂几Ꮆ尺ㄚ ㄒㄖ ᗪ丨乇!!! ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 乂 丨丂卂乃乇ㄥㄥ乇 🐶ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 乂 丨丂卂乃乇ㄥㄥ乇 🐶ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 乂 丨丂卂乃乇ㄥㄥ乇 🐶ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 乂 丨丂卂乃乇ㄥㄥ乇 🐶ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 乂 丨丂卂乃乇ㄥㄥ乇 🐶ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 乂 丨丂卂乃乇ㄥㄥ乇 🐶ᗪㄖㄖ爪丂ㄥ卂ㄚ乇尺 乂 丨丂卂乃乇ㄥㄥ乇 🐶 ㄒ卄乇 ㄥㄖ几Ꮆ乇尺 丨匚ㄖ几✳ ㄖ千 丂丨几☠✝️ 丂ㄒ卂ㄚ丂 ㄖ几 乇卂尺ㄒ卄🌏 ㄒ卄乇 丂ㄒ尺ㄖ几Ꮆ乇尺💪 卄乇👨 山丨ㄥㄥ 乃乇匚ㄖ爪乇 乃ㄩㄒ ㄚㄖㄩ 匚卂几'ㄒ 丂卄ㄖㄖㄒ🔫 卂 卄ㄖㄥ乇🕳 丨几ㄒㄖ ㄒ卄乇 丂ㄩ尺千卂匚乇 ㄖ千 爪卂尺丂!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌",
            "OP, did you come up with this? It's really poorly done.",
            "No liking things allowed.",
            "Doom 2016 fucking ruined doom lmao",
            "That drip",
            ">Great torment x Isabelle\n\n>Punishment x Isabelle\n\nJesus christ",
            "u/EmojifierBot",
            "Something something game journalist don’t like marauder something something",
            "I think this was stolen from Isabell's journal...",
            "Doom is just Metroid on meth",
            "Good shit",
            "?!?!?!?!?!?!",
            "IS THAT A DOOM SOUND EFFECT??",
            "*points out a legit glitch* GIT GUUUUUUUDDDDDDDD YAAAAAAHAHAHAHAA SHOOT HOLE INTO MY ANUSS GIT GUDDD",
            "I literally just got the game today lmao",
            "My music genre is violence🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪🤪",
            "fuck man i just want my old doom community back feels like shit",
            "Actually it’s a Duke Nukem reference",
            "replace with jojo",
            "This sub lives up to its name",
            "REST IN BEATS VILLAIN",
            "This is what people who only play the modern doom games sound like.",
            "Someone said it. Fucking finally. Doom fans will be the end of me because you can't enjoy a game about hell without \" IS THAT A FUCKING DOOM REFERENCE?? DOOMSLAYER IS SO COOL! RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸RIP AND TEAR🩸LOCAL MAN TOO ANGRY TO DIE!!! DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶DOOMSLAYER X ISABELLE 🐶 THE LONGER ICON✳ OF SIN☠✝️ STAYS ON EARTH🌏 THE STRONGER💪 HE👨 WILL BECOME BUT YOU CAN'T SHOOT🔫 A HOLE🕳 INTO THE SURFACE OF MARS!!!🌌🌌🌌🌌🌌🌌🌌🌌🌌 \" This is why all helltaker content comments are a nightmare to go into. I mean comments in general are a nightmare."
        ]
    },
    {
        "post_id": "pib3xp",
        "author": "GIGA_BYTER",
        "title": "So as a joke, I fucked my friend in a Pekora cosplay",
        "url": "https://www.reddit.com/r/copypasta/comments/pib3xp/so_as_a_joke_i_fucked_my_friend_in_a_pekora/",
        "score": 8825,
        "num_comments": 213,
        "created_utc": 1630839728.0,
        "selftext": "So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"",
        "permalink": "/r/copypasta/comments/pib3xp/so_as_a_joke_i_fucked_my_friend_in_a_pekora/",
        "comments": [
            "I’m convinced people are posting their real fantasies here as a façade.",
            "It's called we do a little trolling",
            "Just imagine the laughter they had after that hilarious joke 🤣🤣🤣",
            "\"It's a prank bro it's a prank, the camera's right there!!\"",
            "Wow, what an epic prank! Could you please do it again but this time hide some cameras and post the prank online? Thanks",
            "Least homosexual vtuber watcher",
            "I respect it",
            "Brb trying this",
            "Bro it’s just a prank!\nThe prank:",
            "Google Translated Version: When I took my wig and Pecora shirt to my friend's house, I was very happy. I could hardly control my laughter because she turned the tomato red and looked at me up and down with her lips. Her appearance also made me feel a little strange, but I decided to take off her shirt to annoy her. He asked me, \"Are you serious?\" I said, \"Yo Peko.\" He was always silent, so I asked, \"What happened to Bacon?\" He said he was confused, but the club really had a hard time forcing me to take it off. Drop the jersey. I waited for him to call \"Stop!\" While kissing and stroking his penis, he shouted, \"My God, Pecora!\" This broke me, and before I knew it, I was blown up first. The mane was too thick and stuck in his throat, and he couldn't swallow it anymore. Then he said: \"I want to fuck you now!\" When I knew we were here and we were all naked, I pushed my own thing. A few hours later, the peak came down, and she said, “Why are we doing this? I don’t feel it anymore. But she still looks so funny and confused, so I got angry and helped her wipe her face with sperm,” pretending We match Pecora very well. \"",
            "Usada construction has gone too far",
            "\"This post from 2021 A.D. on an almost-anonymous mongolian noodle cooking forum is why I kill people\", said Pekora after being captured and revealed to have been the true leader of the Al-Queda all along today, and it was revealed that the entire Bin Laden family - Osama bin Laden, Ayman al Zahiri, Obama bin Laden, Osama bin Laden II, Keksama vin Haden I through XXVII had been revealed to have been captured and brainwashed prisoners of war. Her execution is planned to be carried out tomorrow at Sexday (32nd day of the week, introduced 2143 A.D.) by making her click a link made by the fake cummybot9999. This has been the r/copypasta news.",
            "So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"",
            "Unironically, kinda hot",
            ">which made me get a boner myself.\n\nUltimate plot twist.",
            "i thought i was in r/okbuddyhololive for a bit lol",
            "Pain peko.",
            "r/196:",
            "Hilarious prank to try between friends.",
            "\"Are you seeing this shit, peko?\"\n- Usada Pekora reading this, probably",
            "Costume now",
            "Where did you even find this?",
            "DUDE, He just got owned! Epic style.",
            "Bruh momento",
            "Yo that's so damn funny! I'm gonna do this to someone else this is gonna be hilarious!",
            "Not the asshole, he was never straight in the first place",
            "[deleted]",
            "Gotta love playing pranks on friends.",
            "God im rock hard 🤪🤪🤪🤪",
            "u/uwuwizard",
            "Brb gonna try that",
            "Doesn’t get more straight than finding a girl hot even when she’s a literal dude",
            "Kumpeko kumpeko kumpeko",
            "Figured out who that was🗿",
            "We do a large amount of tomfoolery",
            "if the balls don't touch it's not gay, believe me, i'm an expert",
            "And then everyone in the rooms balls clapped",
            ">\"Why did we do that? Now I'm not fucking straight.\"\n\nClassic.",
            "shirty transulated version:\n\nI was playing with a friend Pekola Cospay\n\nI went to my friend's house to hide Peck's clothes in a game. I smiled like a tomato, from head to toe, placing my fingers in my mouth. It looked a little cute, but I decided to take off her clothes and make fun of her. He asked: \"Are you right?\" He asked me. he asked. I said, \"Hey Peko!\" I spoke. I say.\n\nHe was silent because like eternity, \"Why Peko?\" I asked. He said he was confused, but the man had a good laugh and started taking off his clothes. \"Stop!\" I spoke. I waited until he burst into tears. When he kissed and touched the chicken, he said, \"Oh, Pecora!\" he cried. She started crying. He takes care of me. Before I knew it, I had painted the first picture of him.\n\nThe seeds are so big that whatever you swallow, they will stick to your bag. \"I'm going to have sex with you now!\" they said. When we got there and saw that they were both naked, I must have done it. After a few hours, every joke was lost, and he said: \"Why should we do this? Not now.",
            "SHADAP…BEACH",
            "Pranked",
            "Gonna pull this on my friends",
            "NTA his cummies your rules",
            "I'm picturing him dressed as a tasty Indian vegetable snack",
            "they didn’t fuck their friend, they were fucked",
            "Possibly fake\n\nDefinitey gay",
            "It's not gay. It's pekorasexual.",
            "I want this translated to japanese and put in a red super chat she has to read.",
            "i should post this to r/tifu",
            "Post this on r/hololive",
            "Now let’s be real, if a vicious war criminal started pulling your pants down, would you dare defy them?",
            "Bro, I got a boner😳😳😳",
            "Okay wait is it weird I’ve thought about this exact senario with my best friend today",
            "The culmination of the joke is a decade later they open a bed and breakfast and raise Pomeranians.",
            "As much as I hate this, I can’t stop thinking about “i’ms till Pekora”.\n\nBut also, what the fuck is this",
            "this is a repost https://www.reddit.com/r/copypasta/comments/pbuqd8/whatever_the_fuck_this_is_peko/?utm_medium=android_app&utm_source=share",
            "We do a small amount of jokery",
            "Mans really just \n\n“I fucked you In the ass. What now?”\n\n”Its just a prank bro!!111!”",
            "Saving this to beat later",
            "This is kinda sus",
            "fuck bro I'm straight and that made me hard I gotchu fam",
            "I unironically want this\n\nMe in the Pekora cosplay obviously",
            "Average Hololive fan",
            "So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"So as a joke, I went to my friend's house wearing Pekora's wig and clothes. I could barely stop my laughter as he went as red as a tomato and looked at me from head to toe with a bit of drool in his mouth. The way he stared made mde feel a bit funny too, but I decided to tease him more by taking off my clothes. He asked me, \"Are you serious?\" and I said \"Yep peko.\"\n\nHe went silent for what seemed like forever, so I asked him, \"What's the matter peko?\" He said he's confused, but then his boner got really hard, which made me take off his clothes. I expected him to scream, \"Stop!\" as I kissed him and stroked his cock, but he instead shouted \"Oh God, Pekora!\" which made me get a boner myself. Before I knew it, I was blowing him for the first time till he came.\n\nHis semen was so thick, it got stuck inside my throat no matter how hard I swallowed. He then said, \"I want to fuck you now!\" and seeing that we've already gone that far and we were both naked, I obliged. A few hours later, the jerk went all pale and said to me \"Why did we do that? Now I'm not fucking straight.\" But he still looked so cute all confused like that, so I took pity on him and reassured while wiping his cum off my face, \"Let's just pretend I'ms till Pekora.\"",
            "May have to run this into AI Dungeon.",
            "is this... wholesome?",
            "I have the most confused boner now.",
            "bruh peko",
            "> looks up to see who Pekora is\n\n> “V-Tuber”\n\nDay ruined\n\nYour downvotes mean nothing to me, I’ve seen what you all crave",
            "The cringe is so strong",
            "[removed]",
            "This happened to my friend",
            "A",
            "I’m going to hell for laughing at this 😹💦💦💦",
            "Wholesome ending",
            "The peko-pasta!",
            "for a friend can I have a more detailed form of the story for a friend btw",
            "Cum",
            "[deleted]",
            "Ugh...sleeping with Pekora is like sleeping with Bugs Bunny.",
            ">joke\n\nyes is funni",
            "https://youtu.be/m00S8DSgrx4",
            "I enjoy",
            "fucking what",
            "Where are the pekora trademarked war crimes?",
            "the amount of hololive posts here fuck me up",
            "r/okbuddyhololive",
            "?pekofy",
            "A classic",
            "Bruh",
            "Calm down, it's just a prank......",
            "What the fuck",
            "I don't know what a pekora is, so saying that both dicks got hard was the biggest plot twist of the century.",
            "Who’s pekoera? Idfk spupulling",
            "That is real love",
            "I hate my life",
            "oh wow cool",
            "Concerning"
        ]
    },
    {
        "post_id": "bcvpwv",
        "author": "Damozi",
        "title": "Parkinsons disease? Nah, I'm a gamer, my hand is just lagging 😎🎮",
        "url": "https://www.reddit.com/r/copypasta/comments/bcvpwv/parkinsons_disease_nah_im_a_gamer_my_hand_is_just/",
        "score": 8818,
        "num_comments": 127,
        "created_utc": 1555192297.0,
        "selftext": " Parkinsons disease? Nah, I'm a gamer, my hand is just lagging 😎🎮",
        "permalink": "/r/copypasta/comments/bcvpwv/parkinsons_disease_nah_im_a_gamer_my_hand_is_just/",
        "comments": [
            " Parkinsons disease? Nah, I'm a gamer, my hand is just lagging 😎🎮",
            "Who are all these fake cummy’s??? There will only ever be one cummy",
            "Gamers rise up",
            "Haha thats what killed my grandfather lol what a gamer",
            "Alzheimer's disease? Nah, I'm a gamer, my brain has packet loss😎🕹",
            " Pawkinsons disease? Nah, I'm a gamew, my hand is just wagging 😎🎮",
            "Pilots license, what for?",
            "***proceeds to ddox***",
            "⣿⣷⡶⠚⠉⢀⣤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠠⣴⣿⣿⣿⣿⣶⣤⣤⣤ ⠿⠥⢶⡏⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⢀⣴⣷⣌⢿⣿⣿⣿⣿⣿⣿⣿ ⣍⡛⢷⣠⣿⣿⣿⣿⣿⣟⠻⣯⠽⣿⣿⠟⠁⣠⠿⠿⣿⣿⣎⠻⣿⣿⣿⡿⠟⣿ ⣿⣿⣦⠙⣿⣿⣿⣿⣿⣿⣷⣏⡧⠙⠁⣀⢾⣧    ⠈⣿⡟  ⠙⣫⣵⣶⠇⣋ ⣿⣿⣿⢀⣿⣿⣿⣿⣿⣿⣿⠟⠃⢀⣀⢻⣎⢻⣷⣤⣴⠟  ⣠⣾⣿⢟⣵⡆⢿ ⣿⣯⣄⢘⢻⣿⣿⣿⣿⡟⠁⢀⣤⡙⢿⣴⣿⣷⡉⠉⢀  ⣴⣿⡿⣡⣿⣿⡿⢆ ⠿⣿⣧⣤⡘⢿⣿⣿⠏  ⡔⠉⠉⢻⣦⠻⣿⣿⣶⣾⡟⣼⣿⣿⣱⣿⡿⢫⣾⣿ ⣷⣮⣝⣛⣃⡉⣿⡏  ⣾⣧⡀    ⣿⡇⢘⣿⠋    ⠻⣿⣿⣿⢟⣵⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣌⢧⣴⣘⢿⣿⣶⣾⡿⠁⢠⠿⠁⠜    ⣿⣿⣿⣿⡿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣦⡙⣿⣷⣉⡛⠋    ⣰⣾⣦⣤⣤⣤⣿⢿⠟⢋⣴⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣌⢿⣿⣿⣿⣿⢰⡿⣻⣿⣿⣿⣿⣿⢃⣰⣫⣾⣿⣿⣿ ⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠿⠿⠿⠛⢰⣾⡿⢟⣭⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "This isn't even a copypasta dude it's a fucking sentence",
            "Hand is rubber banding",
            "no, your skeleton's bouta hatch",
            "!thesaurizethis",
            "I thought it said Pokemons Disease. Quite ironic since it was a gamer post",
            "smart",
            "Smart.",
            "We will age well i see",
            "gun smart idiot funny",
            "Gun",
            "Parkinsons disease? Nah, I'm a gamer, my hand is just lagging 😎🎮",
            "Smart funny gun ass",
            "Parkinsons disease? Nah, I'm a gamer, my hand is just lagging 😎🎮",
            "Parkinsons disease? Nah, I'm a gamer, my hand is just lagging 😎🎮"
        ]
    },
    {
        "post_id": "jxiau6",
        "author": "None",
        "title": "Can I get a booty pic with your panties on and one without them on?",
        "url": "https://www.reddit.com/r/copypasta/comments/jxiau6/can_i_get_a_booty_pic_with_your_panties_on_and/",
        "score": 8806,
        "num_comments": 307,
        "created_utc": 1605845622.0,
        "selftext": "Can I get a booty pic with your panties on and one without them on? Can I also get 3 different pics of your boobs any position. Also, can i get just a normal pic or your pussy from the front and one where it's spread a bit open. Can i get a picture of you fingering yourself? Can i get a pic of your pussy and ass from behind in one shot? Can i also get a pic your full front body in just your bra and panties? And can I get a pic of your ass while your panties are all up? Can I also get a pic of your boobs while you're in the shower? For the rest of the pics can you just send whatever sexy things you want?",
        "permalink": "/r/copypasta/comments/jxiau6/can_i_get_a_booty_pic_with_your_panties_on_and/",
        "comments": [
            "Now, I need this one, but for the men so that I can properly catfish my friends",
            "Can I get a picture with underwear without them? I can also put three pictures of the chest in every place. You can also find general pictures and homes from the front. Can I keep yourself? Can I get a picture about your cat? Will the front body fill my heart with my sons? When you assemble all the pants, you can find pictures about your love? Can I take a picture of my chest while bathing? For all the pictures, you can send the exciting things you want?",
            "No",
            "I'll have two number 9s, a number 9 large, a number 6 with extra dip, a number 7, two number 45s, one with cheese, and a large soda.",
            "Can I 👁 get 🉐🆘 a booty 🍑 pic 👌👀 with your ⛔👉👈 panties 👙 on 🔛 and one 😤 without ❌😏 them on 🔛? Can I 👁 also 👨 get 🉐 3 ⭕ℹ🕘 different 😡 pics 👌👀 of your 👉 boobs 🍒 any position 💯. Also 👨, can i 👁 get 🉐 just a normal 😐 pic 👌👀 or your 👈 pussy 🐱 from the front 🔝 and one ☝🏻 where it's spread 👐 a bit 😁 open 👐. Can i 👥 get 🔟 a picture 📸 of you 👈 fingering 🖐 yourself? Can i 👁 get 🉐 a pic 👌👀 of your 👉 pussy 🐱 and ass 🍑 from behind 👟 in one 😤😬 shot 🔫? Can i 👁 also 👨 get 🉐 a pic 👌👀 your 👉 full 🌝 front 🔝 body 😍👗 in just your 👉🚪 bra 👙 and panties 👙? And can I 👁 get 🉐 a pic 👌👀 of your 👉 ass 🍑 while your 👉 panties 👙 are all 💯 up ⬆? Can I 👁 also ➕ get 🉐 a pic 🌃👌 of your 👉 boobs 🍒 while you're in the shower 🚿? For the rest 😪 of the pics 👌👀 can you 👈 just send 📩📬 whatever 🙌 sexy 🍆💦 things 🕑 you 👈 want 😋?",
            "Can I get a booty pic with youw panties on and one without them on? Can I awso get 3 diffewent pics of youw boobs any position. Awso, can i get just a nowmaw pic ow youw pussy fwom the fwont and one whewe it's spwead a bit open. Can i get a pictuwe of you fingewing youwsewf? Can i get a pic of youw pussy and ass fwom behind in one shot? Can i awso get a pic youw fuww fwont body in just youw bwa and panties? And can I get a pic of youw ass whiwe youw panties awe aww up? Can I awso get a pic of youw boobs whiwe you'we in the showew? Fow the west of the pics can you just send whatevew sexy things you want?",
            "I'm not female but you can have pics of me in hot pants if you want",
            "Butter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em\nButter dawg, dawg wit butter on em",
            "Can I get a booty pic with your panties on and one without them on? Can I also get 3 different pics of your boobs any position. Also, can i get just a normal pic or your pussy from the front and one where it's spread a bit open. Can i get a picture of you fingering yourself? Can i get a pic of your pussy and ass from behind in one shot? Can i also get a pic your full front body in just your bra and panties? And can I get a pic of your ass while your panties are all up? Can I also get a pic of your boobs while you're in the shower? For the rest of the pics can you just send whatever sexy things you want?",
            "Where is cummybot",
            "Sent this to the girl im talking to as soon as she woke up. She was very confused.",
            "im gonna use this on all the girls using reddit to promote their onlyfans",
            "Discord mod talking to underage teenagers be like:",
            "No problem dad😊",
            "The worst part about this is some of the “i’s” are capitalized",
            "Want one of my cock too homeboy?",
            "I would but im a guy so",
            "Is this that one thing dexonic sent to a 13 year old lmao",
            "Based",
            "Can I get a booty pic with your panties on and one without them on? Can I also get 3 different pics of your boobs any position. Also, can i get just a normal pic or your pussy from the front and one where it's spread a bit open. Can i get a picture of you fingering yourself? Can i get a pic of your pussy and ass from behind in one shot? Can i also get a pic your full front body in just your bra and panties? And can I get a pic of your ass while your panties are all up? Can I also get a pic of your boobs while you're in the shower? For the rest of the pics can you just send whatever sexy things you want?",
            "wrote this like a children’s book",
            "forgot to end it with a thank you",
            "Definitely gonna use this one day",
            "Ah, this reminds me of my favourite copypasta: \n\nDo 3 naked mirror photos, 3 Bra and pantie ones in mirror, 2 ass pictures in mirror (1 with panties and one naked), 3 close up bra kissy face photos , 3 shirt phoros kissy face heart filter\n\n:3 okaii baby :kissing_heart:\n14 Total Baby <3 go do those okaii cx\n:3 go do it\nlike 10+ more pics\ngo do em.\nso naked mirror ones.\nsome bra and panties,\nsome ass ones in mirror,\nand some close up bra and shirt photos kissy face hearts filter.\ncan you go do them <3\nily",
            "Send Bob's, but dont nude while driving...",
            "u/shittytranslatorbot",
            "bro this is how mfs act irl 💀",
            "Ok",
            "If you try to catch a lady like THAT you gotta catch these HANDS SISTER",
            "u/shittytranslatorbot",
            "What if a child sends you those pictures?!",
            "Can I have bleach?! Cause that's disgusting",
            "Perv",
            "I support this claim",
            "Cum back Cummy 🥺",
            "This is actually what I need 😔",
            "[deleted]",
            "R.I.P. @1984toyotacorolla",
            "Feet pics now kitten😈",
            "Daymmmmmmmmm Ay girl can I get yo numba? Can I have it? Can I have it?",
            "The classic Bobs and Vageene copy pasta",
            "I’m willing to send you pics",
            "Repost",
            "I also need these to catfish"
        ]
    },
    {
        "post_id": "bi6sbh",
        "author": "CodeRedBoi",
        "title": "DO NOT WATCH ENDGAME! IT CONTAINS NUMEROUS SPOILERS!!",
        "url": "https://www.reddit.com/r/copypasta/comments/bi6sbh/do_not_watch_endgame_it_contains_numerous_spoilers/",
        "score": 8801,
        "num_comments": 265,
        "created_utc": 1556419744.0,
        "selftext": "I've been very careful to avoid spoilers for the past week, and once Avengers: Endgame finally released in America I decided to watch the long-awaited movie. I merrily walked in expecting a quick in and out experience. Nope. I sat through over 3 hours of living hell, watching spoiler after spoiler unfold. I was sweating profusely thinking to myself \"it's just one spoiler, is it really that bad?\" while unbeknownst to me there were practically hundreds more spoilers following. \n\nI couldn't just get up and leave, the theater was packed with savages who sat there, absorbing the spoilers like some sort of disgusting animals. I let them have their fun, but believe you me I was silently preparing to write the nastiest review on this cinema ever. My entire experience was ruined...no way was I going to watch the movie after seeing all of these spoilers.\n\nIn conclusion, fuck Cinemark.",
        "permalink": "/r/copypasta/comments/bi6sbh/do_not_watch_endgame_it_contains_numerous_spoilers/",
        "comments": [
            "Will Smith fucks Batman",
            "As long as they weren't rocking Thanos's alleged 2ft throbbing cock then I can get behind your cause OP.",
            "I've been very careful to avoid spoilers for the past week, and once Avengers: Endgame finally released in America I decided to watch the long-awaited movie. I merrily walked in expecting a quick in and out experience. Nope. I sat through over 3 hours of living hell, watching spoiler after spoiler unfold. I was sweating profusely thinking to myself \"it's just one spoiler, is it really that bad?\" while unbeknownst to me there were practically hundreds more spoilers following. \n\nI couldn't just get up and leave, the theater was packed with savages who sat there, absorbing the spoilers like some sort of disgusting animals. I let them have their fun, but believe you me I was silently preparing to write the nastiest review on this cinema ever. My entire experience was ruined...no way was I going to watch the movie after seeing all of these spoilers.\n\nIn conclusion, fuck Cinemark.",
            "I just saw endgame, and it was pretty good, but there were a few weird things.\n\nI thought it was strange how the Russo Brothers decided to render Thanos’ erect penis in such vivid detail. The veins were so perfectly done I couldn’t even tell his cock wasn’t real.\n\nAnother thing I found weird was when Black Panther broke the fourth wall and gave the audience the n-word pass. I did appreciate it, but it would feel more in place in a Deadpool movie.\n\nOverall, it was still excellent, but I think that they definitely need to reconsider some things.",
            "Iron Man and Cap have fucking sex for 30 minutes straight in a continuious shot",
            "emoji",
            "Endgame spoiler: Thanos fucking jacks off for 2 hours and 30 minutes with different pan shots and zooms showing his fat, greasy cock and balls and then the last 30 minutes are just him fucking cumming ALL OVER the screen",
            "Guys, you wouldn’t believe what happened to me today. \n\nI stumbled upon a site called “GayHub.com”, and guess what’s in it? FULL ON MAN ON MAN SEX SCENES! Im talking about men fucking men in the ass, men performing fellatio on other men, sometimes more than 2 of them. Just pure uncensored, explicit cocks and balls, not a single pair of boobs or pussy in sight! I’m so sick of these homos keeps pushing their gay agenda on me : a healthy, normal heterosexual Male. I couldn’t just leave the site, so I begrudgingly sat through the whole 30 minutes fapping session, “edging” myself while switching between clips of bear on twinks videos and some random interracial porn, but believe me I’m prepared to give a 1 star review to every single video I watched and maybe even send an angry email to their support team once I’m done masturbating to them. I have a premium GayHub account, so I’m sure my words carries some weight. \n\nIn conclusion, fuck GayHub!",
            "Quality shitpost 👌",
            "The gamora orgy scene with Thanos and his weird halo prophet lookin friend really caught me off guard",
            "Shark boy sacrifices himself for humanity to save the universe",
            "Lil Xan dies in endgame",
            "Same here it was infuriating you should see the review I wrote, never going back to that theatre again😡😡😡",
            "At the end of endgame my dad commits tax fraud",
            "I've been vewy cawefuw to avoid spoiwews fow the past week, and once Avengews: Endgame finawwy weweased in Amewica I decided to watch the wong-awaited movie. I mewwiwy wawked in expecting a quick in and out expewience. Nope. I sat thwough ovew 3 houws of wiving heww, watching spoiwew aftew spoiwew unfowd. I was sweating pwofusewy thinking to mysewf \"it's just one spoiwew, is it weawwy that bad?\" whiwe unbeknownst to me thewe wewe pwacticawwy hundweds mowe spoiwews fowwowing. \n\nI couwdn't just get up and weave, the theatew was packed with savages who sat thewe, absowbing the spoiwews wike some sowt of disgusting animaws. I wet them have theiw fun, but bewieve you me I was siwentwy pwepawing to wwite the nastiest weview on this cinema evew. My entiwe expewience was wuined...no way was I going to watch the movie aftew seeing aww of these spoiwews.\n\nIn concwusion, fuck Cinemawk.",
            "Anyone else enjoy the part where Thanos' throbbing cock rips out of his pants?",
            "can’t believe pee wee Herman fucking dies in endgame",
            "Thanks finds out he's Scarlet Witch's father after a night of passionate love making.",
            "#THOR TRASH TALKS A KID IN FORTNITE",
            "Thor GEts THAT EPic VicTory ROyale",
            "Voldemort and Thanks have a fling",
            "Batman dies!",
            "**MINOR ENDGAME SPOILERS BELOW ENTER WITH CAUTION**",
            "Superman dies",
            "Everything in my life was going well. I had a loving family, had no financial woes, and enjoyed a quiet and fulfilling middle-class American life. But everything changed after I saw the Endgame spoilers. They popped up on my facebook feed out of nowhere. Immediately I knew that this was the end. I could no longer enjoy this film I had been working on enjoying for 11 years the way the Russos intended. All this hard work from going to the theater in 2008 and seeing Robert Downey Jr. put up his suit as Iron Man to crying while his apprentice died in his arms was now dusted away like my favorite heroes.\n\nI knew I couldn't leave such injustice unpunished. I doxxed my facebook friend from 8th grade that posted the spoilery footage, went to his house, took all of his pokemon cards and burned them in my attic. It should teach him and all the other monsters who ruin precious cinematic experiences a lesson.\n\nYou don't mess with my Marvel movies. You don't spoil one-liners for me. Or I will come after you - and I will avenge my moviegoing experience.\n\nI'm not sure how I will move on after this. Knowing I will never have seen Avengers: Endgame the way the Russos, Kevin Feige and all the thousands of good men and women who worked on the film wanted me too. I thought about therapy, but then realized I couldn't afford it. I thought about bashing my head against a wall to forget the spoilers I saw, but then I realized that my insurance doesn't cover that neither.\n\nI am now doomed to live a life of never seeing Avengers: Endgame the way it was meant to be seen. I am writing this so that you may take measures to protect yourself against those spoilers and so that you may never live the life I now have to live.",
            "antman sticks the thanoscopter up his ass, and then expands to bigger than the earth, then helicopters his dick and hits the earth with it, and launches it",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_cactusreddskies999] [Bruh](https://www.reddit.com/r/u_cactusreddskies999/comments/bi81ur/bruh/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Endgame spoiler: Thanos fucking jacks off for 2 hours and 30 minutes with different pan shots and zooms showing his fat, greasy cock and balls and then the last 30 minutes are just him fucking cumming ALL OVER the screen",
            "Jah yoits thanos",
            "Tony Stark kills Khaleesi and the other Starks. Iron man takes the Iron Throne",
            "Endgame spoiler: Thanos fucking jacks off for 2 hours and 30 minutes with different pan shots and zooms showing his fat, greasy cock and balls and then the last 30 minutes are just him fucking cumming ALL OVER the screen",
            "[deleted]",
            "Don’t fucking spoil it im gonna watch it again!",
            "Hulk dabs",
            "The fuck is your problem? Thanks for telling me it contains spoilers, asshole.",
            "having not seen endgame yet thanks for the spoiler warning",
            "[endgame spoilers:](https://twitter.com/i/status/1122246143188975616)",
            "Jack Dorsey dies in endgame",
            "X dies in Endgame",
            "Thanos says the n word",
            "Jesus Christ stop spoiling it man",
            "Yeah man fuck Cinemark who does that??? You wait patiently for MONTHS then you go watch and BAM spoilers! If I was you I would never go to the movies again, a industry made of spoilers. Those bastards.",
            "[removed]",
            "[removed]",
            "Did you just fucking use the word \"unbeknownst\"?",
            "I know it’s a joke but it *still* low-key makes me angry lol",
            "[removed]"
        ]
    },
    {
        "post_id": "dm04vr",
        "author": "nickipinz",
        "title": "Everyone is bisexual",
        "url": "https://www.reddit.com/r/copypasta/comments/dm04vr/everyone_is_bisexual/",
        "score": 8796,
        "num_comments": 458,
        "created_utc": 1571841087.0,
        "selftext": "Everyone is bisexual and let me explain why. \n\nSo, guys, you see a hot girl and say “wow that girl is hot.” You’re straight because you like hot girls? You’re 50% wrong! Half of that girls looks came form her daddy’s ballsack! Half of her looks came from a GUY! And guess what, you called her hot, and half of HER is from a MALE making YOU bisexual. \n\nSo, girls, you see a hot guy and say “wow that guy is hot.” You’re straight because you like hot guys? You are ALSO 50% wrong! Half of that guys looks and DNA came from his mommy’s vagina! Guess what, you called him hot, as half of HIM is from a FEMALE making YOU bisexual! \n\nEven lesbians and gays are not fully gay and lesbian: they’re bisexual! You’re all bisexual! No more alpha males or females! You’re all 50% gay! \n\nEdit 1: guys stop downvoting please read! \n\nEdit 2: omg guys can you STOP downvoting! We’re all 50% gay so we’re all equal! \n\nEdit 3: fuck all of you! You’re mad I know the truth!",
        "permalink": "/r/copypasta/comments/dm04vr/everyone_is_bisexual/",
        "comments": [
            "I'm rock hard right now just think of all the possibilities.",
            "I'm bisexual, does that mean i'm also bisexual?",
            "meow",
            "Everyone is bisexual and let me explain why. \n\nSo, guys, you see a hot girl and say “wow that girl is hot.” You’re straight because you like hot girls? You’re 50% wrong! Half of that girls looks came form her daddy’s ballsack! Half of her looks came from a GUY! And guess what, you called her hot, and half of HER is from a MALE making YOU bisexual. \n\nSo, girls, you see a hot guy and say “wow that guy is hot.” You’re straight because you like hot guys? You are ALSO 50% wrong! Half of that guys looks and DNA came from his mommy’s vagina! Guess what, you called him hot, as half of HIM is from a FEMALE making YOU bisexual! \n\nEven lesbians and gays are not fully gay and lesbian: they’re bisexual! You’re all bisexual! No more alpha males or females! You’re all 50% gay! \n\nEdit 1: guys stop downvoting please read! \n\nEdit 2: omg guys can you STOP downvoting! We’re all 50% gay so we’re all equal! \n\nEdit 3: fuck all of you! You’re mad I know the truth!",
            "Everyone is on a gay spectrum so everyone isn’t 100% straight unless it’s me. The reason that everyone has some gay in them is because everyone was a girl in their moms womb. Eventually when the fetuses grows it has a little bit higher than 50% chance to become a male. This is why everyone has nipples and everyone isn’t 100% straight. Unless it’s me, who was male from when the sperm hit the egg and I don’t even have nipples.",
            "unironically couldn’t you say if you like the girl in the way that you should like a girl (which is because of her personality and not because of her looks) you could also just find a guy that has that personality and therefore like him because you also like a girl with the same attributes? DISCUSS.",
            "1 guy + 1 guy = 100% gay\nTherefore 1 guy = 50% gay\n1 girl + 1 girl = 100% gay \nTherefore 1 girl = 50% gay \nHence, 1 guy + 1 girl = 100% gay",
            "Not being bi is a sin. The Bible says Adam and Eve, not or eve.",
            "What’s an asexual then?",
            "Every time a baby boy is born, his penis slides through and touches his mom's vagina, which means no man is born a virgin.",
            "Jesus....i swear some of these copypastas can be from r/subredditsimulator",
            "Evewyone is bisexuaw and wet me expwain why. \n\nSo, guys, you see a hot giww and say “wow that giww is hot.” You’we stwaight because you wike hot giwws? You’we 50% wwong! Hawf of that giwws wooks came fowm hew daddy’s bawwsack! Hawf of hew wooks came fwom a GUY! And guess what, you cawwed hew hot, and hawf of HEW is fwom a MAWE making YOU bisexuaw. \n\nSo, giwws, you see a hot guy and say “wow that guy is hot.” You’we stwaight because you wike hot guys? You awe AWSO 50% wwong! Hawf of that guys wooks and DNA came fwom his mommy’s vagina! Guess what, you cawwed him hot, as hawf of HIM is fwom a FEMAWE making YOU bisexuaw! \n\nEven wesbians and gays awe not fuwwy gay and wesbian: they’we bisexuaw! You’we aww bisexuaw! No mowe awpha mawes ow femawes! You’we aww 50% gay! \n\nEdit 1: guys stop downvoting pwease wead! \n\nEdit 2: omg guys can you STOP downvoting! We’we aww 50% gay so we’we aww equaw! \n\nEdit 3: fuck aww of you! You’we mad I know the twuth!",
            "I am not a homosexual\n\nLast night I was looking for some porn of the not gay variety.  Obviously gay porn is gay, so instead I went looking for guy on girl porn. But I realized that features a guy, with a penis, and is therefore 50% gay.  So I started looking for some girl on girl action, till I realized that is lesbian, and is therefore 100% gay. \n\n\nSo clearly, I had to look into alternative options.  I started to consider hentai: since no one in it is real, it can’t contain guys, so it’s not gay, right? Well, hentai is anime, which not only is gay, but also makes me a weeb. The worst option so far.\n\n\nI considered traps. I’ve long heard debate over whether traps are gay, so I decided to do the math.  The gayness of traps lies in the premise. Let’s consider the 5 base premises: 1) a guy and a trap, where the guy initially thinks he’s with a girl: effectively guy on girl, 50% gay 2) a guy with a trap, and the guy knew it was a trap: Dude looking for some dick, that’s gay 3) a girl with a trap, where the girl doesn’t know it’s a trap: that’s lesbian, and is gay 4) a girl with a trap, where the girl knows it’s a trap: effectively guy on girl, therefore 50% gay Therefore, on average traps are 75% gay, with a minimum gayness of 50%. Not an improvement.  The 5th option, trap on trap, is a singularity of the 4 prior possibilities, and is therefore on average 75% gay again.\n\n\nSo I got into specifics. What if it was girl on girl, and the premise was at least one of the girls was just bi-curious, and not actually fully lesbian? Well, in that case, their curiosity makes them a cat. Cats are furries, and furries are gay\n\n\nSo how about a girl soloing? Well that’s a girl touching girl bits. Lesbian and gay.\n\n\nMy conclusion is that the only way to live a life free of homosexual sin is to liberate oneself of sexual desire at all, and become an asexual.\n\n\nThanks for coming to my Ted Talk.",
            "What about bisexuals",
            "Meow",
            "But do you twerk, charge you phone, eat hot chip, and lie?",
            "As a bi guy, can confirm",
            "We are all 50% gay? Then this includes the mods and YOU JUST CALLED THE MODS GAY 😤😤😤😤😤 HOW DARE YOU, YOU SHALL SUFFER FROM THE POWER OF THE BAN 🚫🚫🚫🚫 HAMMER 🔨🔨🔨🔨",
            "I'm biosexual, that means I wanna fuck the earth",
            "I’m a man that identifies as a lesbian",
            "I'm Bi, lol",
            "_I’m asexual._\n\n– Me, an intellectual.",
            "I thought everyone was bisexual because Ryan Reynolds and Blake Lively",
            "This reminds me of that interview Elton John had in the mid 1970s where he came out as bisexual and referred to everyone as being “a little bit bisexual”",
            "But for a girl, her mom's looks also are 50% male.  So it is 75% gay.\n\nBut her grandma's looks are also 50% male, so her mom's looks are actually also  75% gay. This makes liking a girl 87.5% gay.\n\nIf you keep going on, it makes liking a girl 100% gay.",
            "What about asexuals",
            "#$@&ing moron",
            "As an actual bisexual, this gave me a good chuckle",
            "What if I am asexual? Am I hetero now?",
            "yeah well what if she was adopted",
            "What if you're sexually attracted to tractors",
            "What about asexuals tho",
            "meow",
            "I kinda had a similar thought when I saw a picture of Kelsey Grammer's daughter Spencer. She's very attractive, but if you focus only on her face—it's Kelsey Grammer.",
            "I only half think shes hot tho",
            "This will be nationwide curriculum by second grade in a few years",
            "I’m everyone",
            "In all seriousness, you are kinda bi if you watch and enjoy straight porn.",
            "My gf has her beautiful gorgeous dad's eyes and stare. That makes me bi?",
            "Gay",
            "Why would people downvote this? Do people on reddit not have a sense of humor?",
            "Why is this so funny",
            "yo man i think Harvard is calling you right now",
            "So are bisexual people bisexual²",
            "I'm not gay",
            "man spittin fax",
            "[deleted]",
            "[deleted]",
            "I am bi with a vagina a mother of two sons I am definitely not man not like a man because they are very different personalities physically and emotionally. However I believe if we as a society were more open like say the Romans and Greeks we would mostly be bisexual as they were.",
            "You’re truth fits my truth too.",
            "Whats all this retarded discussion im reading? I came here to jerk off to cummybot not to learn about sexuality",
            "u/nwordcountbot u/nwordcountbot",
            "Oh shit 0-0",
            "What if it was Eve?",
            "What if I think guys are 50% hot",
            "What if somebody's asexual and does not recognize sexuality or the meanings behind it?",
            "So will it be called the LGBQT+!><7W&",
            "I'm leaving. Does this mean I'm trisexual?",
            "I didn't check the sub, thought this was Unpopular Opinion, Shower Thoughts, or any of the other rant-mildly mind blowing subs. Until I got to the fourth line, I realized...",
            "meow",
            "Okay but if you round... everyone is gay",
            "Bork",
            "no u",
            "Meow",
            "They hated him because He told the truth",
            "I have a theory straight porn is half gay because your watching a dude fuck so lesbian porn is the only straight porn men could watch but then it flips the odometer because it is gay porn so all porn is gay unless your jerking off to jelly fish reproducing asexually but even that's a grey area because it means they are both sex not neither so it's   like a theoretical half gay because it's half dude jelly fish solo action. Thank you for coming to my Ted talk",
            "Also means you're only half gay if you drink your bros cum since its technically 50% vagina juice",
            "I'm asexual, what does that mean with these figures",
            "cum is fum",
            "lol Edit 3 gave me a chuckle. Thanks! You go gurl! (guy+girl=gurl) You go down swinging!!!",
            "asexual?",
            "Humans share like 99.99% of our DNA, so does that mean we’re all incestuous?",
            "Freud was right!",
            "\" DNA came from his mommy’s vagina! \"",
            "Meow",
            "Woof",
            "but the other half comes from her mother thus making you 100% straight",
            "No. Just no.",
            "Shut the fuck up I'm straight",
            "This feels like liberalism logic... \nConvinced me of one thing and then telling me something else that I never thought I was.",
            "No ur mom gay",
            "In the words of Brett Williams, a little person comedian\n\n\"There is a little bit of gay in you. That voice in the back of your head that determines you whether or not a guy is hot is your tiny bit of gay. And when you're in a threesome with your friend and his cock in your face, theres a little bit of gay in the back of your head that says 'Suck It?'\"\n\nI'm paraphrasing",
            "Imagine spending your limited time on Earth writing this nonsense.",
            "I was just talking about how it's 50% gay to own a slave this afternoon lmao",
            "the edits make it so much better.",
            "Meow",
            "There are only two genders. Me, and everything with a hole.",
            "I’m attracted to triangles",
            "You are also random mutations.  So you might like Beast or maybe Cyclops. But hopefully Emma Frost",
            "I'm bisexual²",
            "Start sucking, retard",
            "This reminds me of that stop sending me traps guy",
            "Lol i am gay but im not bi;)",
            "Someone forgot to account for some genders like:\n\nA B C D E F G H I J K L M N O P Q R S T U V W X Y Z of them",
            "Meow",
            "No, that's not how it works",
            "Ace gang rise up",
            "Am a bisexual, can confirm",
            "Wouldn’t this only make you 50% bisexual, since 100% bisexual is dedicated to both females and males?",
            "meow",
            "[deleted]",
            "[deleted]",
            "So here’s why I disagree because if you want to be vague then yes that’s how babies are made thanks for giving us the birds and the bees.\n\nHowever it’s all DNA. It’s the genes you pass down to the children which is not male or female they are just features characteristics eye color hair color that sorta thing. Just like you can have a child that’s a boy but only looks like the mother or a daughter who looks like the father. Also just like you can have a child who looks more like one of your parents or siblings even.\n\nYour argument to try to stir the pot with a spur of the moment guess what I just came up with shower thought was a failed attempt...\n\nBetter luck next time!",
            "Joe",
            "Everyone is bisexual or asexual. Society has it drilled into our heads that, for the most part, you're either straight or gay.\n\nShow a straight male or gay female a picture of a \"convincing\" m2f, and they'll say that m2f is attractive. Similarly with straight women or gay men, and a f2m. As soon as you reveal what genitals that person has, they will be repulsed.\n\nThere's no biological reason to be repulsed by genitals. After all, you already like your own. And a penis is similar in ways to a vagina."
        ]
    },
    {
        "post_id": "gfij3w",
        "author": "TheInternetPolice2",
        "title": "Cock",
        "url": "https://www.reddit.com/r/copypasta/comments/gfij3w/cock/",
        "score": 8787,
        "num_comments": 220,
        "created_utc": 1588896848.0,
        "selftext": "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
        "permalink": "/r/copypasta/comments/gfij3w/cock/",
        "comments": [
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Pepege TeaTime COCK",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆ ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿ ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀ ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛⠉",
            "YEP",
            "⠄⢰⣧⣼⣯⠄⣸⣠⣶⣶⣦⣾⠄⢸⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣠  ⠄⣾⣿⠿⠿⠶⠿⢿⣿⣿⣿⣿⣦⣤⣄⢀⡅⢠⣾⣛⡉⠄⠄⠄⠸⢀⣿⠄  ⢀⡋⣡⣴⣶⣶⡀⠄⠄⠙⢿⣿⣿⣿⣿⣿⣴⣿⣿⣿⢃⣤⣄⣀⣥⣿⣿⠄  ⢸⣇⠻⣿⣿⣿⣧⣀⢀⣠⡌⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠿⣿⣿⣿⠄  ⢸⣿⣷⣤⣤⣤⣬⣙⣛⢿⣿⣿⣿⣿⣿⣿⡿⣿⣿⡍⠄⠄⢀⣤⣄⠉⠋⣰  ⣖⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⢇⣿⣿⡷⠶⠶⢿⣿⣿⠇⢀⣤  ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽⣿⣿⣿⡇⣿⣿⣿⣿⣿⣿⣷⣶⣥⣴⣿⡗  ⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄  ⣦⣌⣛⣻⣿⣿⣧⠙⠛⠛⡭⠅⠒⠦⠭⣭⡻⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠄  ⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄⠄⠹⠈⢋⣽⣿⣿⣿⣿⣵⣾⠃⠄  ⣿⣿⣿⣿⣿⣿⣿⣿⠄⣴⣿⣶⣄⠄⣴⣶⠄⢀⣾⣿⣿⣿⣿⣿⣿⠃⠄⠄  ⠈⠻⣿⣿⣿⣿⣿⣿⡄⢻⣿⣿⣿⠄⣿⣿⡀⣾⣿⣿⣿⣿⣛⠛⠁⠄⠄⠄  ⠄⠄⠈⠛⢿⣿⣿⣿⠁⠞⢿⣿⣿⡄⢿⣿⡇⣸⣿⣿⠿⠛⠁⠄⠄⠄⠄⠄  ⠄⠄⠄⠄⠄⠉⠻⣿⣿⣾⣦⡙⠻⣷⣾⣿⠃⠿⠋⠁⠄⠄⠄⠄⠄⢀⣠⣴  ⣿⣶⣶⣮⣥⣒⠲⢮⣝⡿⣿⣿⡆⣿⡿⠃⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣠",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉\n⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿\nDiscord version",
            "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣤⣄⠄⡀⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣴⣿⣿⣿⣿⣷⡒⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⡀⣹⣿⣿⣿⣿⣿⣯⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣀⣀⣴⣿⣿⣿⣿⣿⣿⠿⠋⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⢀⣀⣤⣶⣾⠿⠿⠿⠿⣿⣿⣿⣿⣿⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄ ⠄⡶⣶⡿⠛⠛⠉⠉⠄⠄⠄⠄⢸⣿⣿⣿⣿⣿⣿⣿⠃⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠘⠃⠄⠄⠄⠄⠄⠄⠄⠄⢠⣿⣿⣿⣿⣿⡟⠁⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⣤⣾⣷⣿⣿⣿⣿⡏⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⢀⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⠂⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⢀⣤⣴⣾⣿⣿⣿⣿⡿⠛⠻⣿⣿⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠸⣿⣿⣿⣿⠋⠉⠄⠄⠄⠄⣼⣿⣿⡿⠇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠈⠻⣿⣿⣆⠄⠄⠄⠄⠄⣿⣿⣿⣷⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠻⣿⣿⣆⡀⠄⠄⠈⠻⣿⣿⣿⣦⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⣀⣌⣿⣿⣿⣦⡄⠄⠄⠄⠙⠻⣿⣿⣦⣀⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠈⠉⠉⠉⠉⠉⠁⠄⠄⠄⠄⠄⠄⠄⠘⠻⣿⢿⢖⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠉⠁⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⣴⣧⣤⣴⡖⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⣰⣿⣿⣿⣿⣿⣷⣀⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠘⠻⢿⣿⣿⣿⣿⣿⣿⣿⣆⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⢤⣴⣦⣄⣀⣀⣴⣿⡟⢿⣿⡿⣿⣿⣿⣿⣿⣿⡄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠉⠉⠙⠻⠿⣿⡿⠋⠄⠈⢀⣀⣠⣾⣿⣿⣿⣿⣿⡄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠉⠋⠉⠉⠁⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠈⠛⠛⣿⣿⣿⣿⣿⣿⣇⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⢀⣠⣶⣿⣿⠿⢛⣿⣿⣿⣿⣷⣤⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⣶⣷⣿⣿⡉⠄⠄⠄⠄⠉⠉⠉⠉⠉⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠘⠛⠟⢿⣤⣤⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⠄⣠⣶⣶⣷⣿⣶⡊⠄⠄⣀⣤⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⣀⣴⣶⣾⢿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣿⣿⡏⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⢸⣿⡍⠁⠄⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠁⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⠏⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⡿⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⣿⣿⣿⣿⣿⡿⠋⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣡⣶⣶⣄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⣀⣀⣠⣴⣦⡤⣿⣿⣿⣿⡻⣿⣿⡯⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⡟⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⢻⣿⣿⡏⠉⠙⠛⢛⣿⣿⣿⣿⠟⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⢿⣿⡧⠄⠄⢠⣾⣿⣿⡿⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠈⣿⣿⣄⣼⣿⣿⣿⠏⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠸⡿⣻⣿⣿⣿⣿⣆⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣻⠟⠈⠻⢿⣿⣿⣆⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠿⠍⠄⠄⠄⠄⠉⠻⣿⣷⡤⣀⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⢻⣿⡿⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⡯⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠸⠃⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⣶⣶⣤⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣾⣿⣿⣿⣿⣿⡞⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⡿⢃⡀⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠘⢿⣿⣿⣿⣿⣿⣿⣿⣧⡀⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢈⣽⣿⣿⣿⣿⣿⣿⣿⢿⣷⣦⣀⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⠄⢉⣻⣿⡇⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⣿⣿⡉⣀⣿⣿⣿⣿⣋⣴⣿⠟⠋⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⢀⣀⣼⣿⣿⣿⣿⣿⣿⠿⢿⣿⣿⣿⣿⣿⣮⡠⠄⠄⠄⠄ ⠄⠄⠄⠄⢰⣾⣿⣿⡿⠿⠛⠛⠛⠉⠄⠄⠄⠄⠙⠻⢿⣿⣿⣿⣶⣆⡀⠄ ⠄⠄⠄⠄⠄⠹⣿⣿⣦⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢉⣿⣿⣿⣿⣿⠂ ⠄⠄⠄⠄⠄⠄⠈⢿⣿⣇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣴⣾⣿⡿⠟⠉⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠂⢿⣿⣥⡄⠄⠄⠄⠄⢀⣠⣶⣿⣿⠟⠋⠁⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⣀⣤⣾⣿⣿⣷⣿⣃⡀⢴⣿⣿⡿⣿⣍⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠈⠉⠉⠉⠉⠉⠉⠉⠄⠄⠄⠉⠙⠛⠛⠛⠛⠂⠄⠄⠄⠄⠄",
            "Shrek\n\n⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆ ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿ ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀ ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠀⠀⠀⠀⠀⠀⠀⠀ ⠄⠄⠄⠄⠄⠄⣠⢼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⡄⠄⠄⠄ ⠄⠄⣀⣤⣴⣾⣿⣷⣭⣭⣭⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠄⠄ ⠄⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣸⣿⣿⣧⠄⠄ ⠄⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⡄⠄ ⠄⢸⣿⣮⣿⣿⣿⣿⣿⣿⣿⡟⢹⣿⣿⣿⡟⢛⢻⣷⢻⣿⣧⠄ ⠄⠄⣿⡏⣿⡟⡛⢻⣿⣿⣿⣿⠸⣿⣿⣿⣷⣬⣼⣿⢸⣿⣿⠄ ⠄⠄⣿⣧⢿⣧⣥⣾⣿⣿⣿⡟⣴⣝⠿⣿⣿⣿⠿⣫⣾⣿⣿⡆ ⠄⠄⢸⣿⣮⡻⠿⣿⠿⣟⣫⣾⣿⣿⣿⣷⣶⣾⣿⡏⣿⣿⣿⡇ ⠄⠄⢸⣿⣿⣿⡇⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣿⣿⣿⡇ ⠄⠄⢸⣿⣿⣿⡇⠄⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⠄ ⠄⠄⣼⣿⣿⣿⢃⣾⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣿⣿⣿⡇⠄ ⠄ ⠄⠄⠸⣿⣿⢣⢶⣟⣿⣖⣿⣷⣻⣮⡿⣽⣿⣻⣖⣶⣤⣭⡉⠄⠄⠄⠄⠄ ⠄⠄⠄⢹⠣⣛⣣⣭⣭⣭⣁⡛⠻⢽⣿⣿⣿⣿⢻⣿⣿⣿⣽⡧⡄⠄⠄⠄ ⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣶⣌⡛⢿⣽⢘⣿⣷⣿⡻⠏⣛⣀⠄⠄ ⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠙⡅⣿⠚⣡⣴⣿⣿⣿⡆⠄ ⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⠄⣱⣾⣿⣿⣿⣿⣿⣿⠄ ⠄⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⣿⣿⣿⣿⣿⠄ ⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠣⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄ ⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠑⣿⣮⣝⣛⠿⠿⣿⣿⣿⣿⠄ ⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄ ⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠄⠄⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⣿⠁⠄ ⣸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠏⠄⠄⠄⠄⠄⠸⣿⣿⣿⣿⣿⡿⢟⣣⣀",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Ok, this is ABSOLUTE fucking bullshit. I went to take a test in class yesterday, and when I saw some sexy looking quadratics, my boner engaged. When I found the y-intercept of the equation, I couldn't help it!!! I closed my eyes, and I TORE my dick to shreds, using whip like motions and pulled with great force. That was one of the best nuts I ever had, just thinking about it now gets me riled up. Thing is, I nutted all over the kid sitting right next to me, and the teacher got all pissed at me, screaming at me for jacking off on a classmate. I told that bitch to shut the fuck up, and that jacking off is a natural, artistic, and beautiful process. He should BE HAPPY that my semen is all over him, maybe he can learn a lesson or two about the culture and art of jacking off. HOWEVER, the teacher didn't agree with me. She KICKED ME OUT of the classroom, and I didn't even finish taking the test. Not only THAT, but they made me clean up my cum after it already dried out and solidified on the carrpet. THATS TORTURE!! Do you know how hard it is to clean dried cum? You CLEAN cum after its FRESH out of your dick, not an hour after you fucking nutted. This is a fucking OUTRAGE. Do you really expect me to not whip out my cock and jack off when i see a HOT quadratic on a test? Either make the equations less sexy, or LET ME jack off in your classroom, asshole.",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Okayge COCK\n\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "YEP COCK",
            "YEP COCK",
            "YEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK \n\nYEP COCK",
            "need more of this please",
            "🐸🐸🐸🐸🐸🐸🐸🐸",
            "YEP",
            "u/nymn_ show cock teatime",
            "Cock and ball torture, CBT, is a sexual activity involving torture of the male genitals. \n\nThis may involve directly painful activities such as wax play, genital spanking, squeezing, ball busting, genital flogging, urethera play, tickle torture, erotic electro stimulation, or even kicking.\n\n The recipient of such activities may receive direct physical pleasure via masochism through knowledge that the play is pleasing to a sadistic dominant. Image: electro stimulation applied on a penis. Contents \n\nSection 1: In pornography \n\nSection 2: Ball stretcher \n\nSection 3: Parachute \n\nSection 4: Humbler \n\nSection 5: Testicle Cuff\n\nSection 1: In pornography. In addition to it's occational role in BDSM pornography, temakeria, literally ball kicking, is a separate genre in Japan. One notable actress in temakeria is Erika Negai, who typically uses her martial art skills to knee or kick men in the testicles. \n\nSection 2: Ball stretcher. A ball stretcher is a sex toy that is fastened around a man in order to elongate the scrotum, and provide a feeling of weight, pulling the testicles away from the body. While leather stretchers are most common, other models are made of steel rings that are fastened with screws causing additional, mildly uncomfortable weight to the wearer. The length of the stretchers may very from 1-4 inches, and the steel models can weigh up to 5 pounds.  \n\nSection 3: Parachute. A parachute is a small collar usually made from leather which fastens around the scrotum, and from which weights can be hung. Conical is shape, with 3 or 4 short chains having beneath to which weight can be applied. Used as part of cock and ball torture within a BDSM relationship, the parachute provides a constant drag and  squeezing affect on man's testicles. Moderate weights of 3 to 5 kilograms can be suspended especially during bondage. Smaller weights can be used when the man is free to move when the swinging effect of the weight can restrict sudden movements as well as providing a visual stimulus for the dominant partner. \n\nSection 4: Humbler. A Humbler is a BDSM physical restraint device used to restrict the movement of a submissive male partner in a BDSM scene. The Humbler consists of a testicle cuff device that clamps around the base of the scrotum mounted in the center of a bar that passes behind the thighs at the base of the buttox. This forces the wearer to keep his legs forward as any attempt to straighten the legs even slightly pulls directly on the scrotum causing from considerable discomfort to extreme pain. Section 5: Testicle Cuff. A testicle cuff is a ring shape device around the scrotum between the body and the testicles such that when closed, it does not allow the testicles to pass through it. A common type has two connected cuffs. One for the scrotum and one for the base of the penis. They are one of many different gadgets for restraining the male genitalia. Also a standard pad lock may be locked around the scrotum and without the key, the man may not be able to remove it. Some men enjoy the feeling of being owned. And some people enjoy the feeling of owning their partners. Making the man wear testicle cuffs gives a sense that his sexual organs belong to his partner. Equally, there is a certain level of humiliation inherit in the devices by which some people are sexually aroused. Finally, the cuffs may form part of a sexual fetish of the wearer or his partner.﻿",
            "Fixed:\n\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ \n\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ \n\n⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ \n\n⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ \n\n⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ \n\n⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ \n\n⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ \n\n⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ \n\n⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ \n\n⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ \n\n⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ \n\n⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ \n\n⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ \n\n⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Please God, I want to impregnate Kim Yo Jong so bad. I want her to bear my children with those beautiful child-bearing hips. That beautiful, radiant asian angel. Like a goddess, having come down to Earth to cleanse us of our sins.\n\nKim Yo Jong  is beyond divine. I can’t help but drop to my knees in worship whenever I see her beautiful figure. I yearn for her in a way both primal and spiritual. I would commit more war crimes than every president in United States history just to lick the sweet, glistening sweat from her smooth, creamy skin. I want to listen to her moans as my manhood throbs within her, I want to hear her heart race as our bodies become one and our souls irreversibly intertwine in the holy sin of carnal union.\n\nI want to suckle at her motherly bosom, slurping that rich juche milk from her teat as she gently strokes my raging erection. I would stir her velvety Korean cream into my coffee and let my balls boil in it. Her cries of pleasure and the rocking of our bed would be louder than the cacophony of ten thousand drone strikes. I would make love to her until my body gave out, and then some. I would let her break my rib cage with any part of her body. I would let her hit me with her car just to be near her for a brief moment.\n\nShe’s so perfect it hurts. Every moment without her I suffer a pain worse than breaking every bone in my body simultaneously while drowning and also having shards of glass coated in hot sauce forced through every orifice of my body. I want her, I need her. I want to desecrate her crisp general suit. I want to start a family with her and retire after our twenty seven children have grown up and moved out. I want to see those luscious lips speak such filthy, perverse words into my ear while she slides ice cubes down my gaping pisshole.\n\nI want to fuck her like she owes me money. I would let her step on me, just to feel the soft, firm warmth of her feet upon my face and groin area. I would sleep under her just to catch her drool in my mouth. I would fish the strands of hair from her shower drain just to smell her alluring scent, and braid them into necklaces to keep her with me always. Or cock rings. Whichever would please her more.\n\nGod please, I would do anything for her. I would relinquish my life, all my hopes and dreams, just to become the socks on her feet so that I may warm her mouthwatering toes with my very being, so that she may feel the heat of my love always. I would encase myself in cement and become her doorstep, so that she may wipe her heels upon my face. I would tear my own limbs off. I don’t know what I’d do after that, or why she might want my limbs. But I would do it.\n\nMy queen, my goddess, the light of my life. Please God, let me have her. I want her to be mine and only mine. I would lick the Doritos dust from her fingers and fill her belly button with honey mustard to dip my tendies in. I would give her a sponge-bath with my tongue every morning and serve her breakfast in bed. \n\nI would let her eat her eggs and pancakes off my body if it pleased her, no matter how painful the third-degree burns would be.\n\nI would bear the torment of eternal damnation until the end of time to taste the seat of her car but once. There is nothing I wouldn’t do for her, nothing I wouldn’t say. I would beat my own mother to death with my engorged penis if it would bring a smile to Kim Yo Jong's shining face. I wouldn’t even let myself cum until she gave me permission.\n\nI love you, Kim Yo Jong. Please. Be mine. Be my wife, my lover, my Juche mommy, my everything. Say yes. I see it in your eyes, when you’re up there on that throne talking about nuking Japan or whatever. Answer my calls, respond to my letters. Something. Give me a sign, Kim Yo Jong. I’m waiting for you.\n\nI’ll always be waiting for you.",
            "Thank you father",
            "100% upvoted that's some shit",
            "YEP COCK",
            "YEP COCK",
            "YEP",
            "PogU Twitch copypasta",
            "yep cock",
            "#YEP COCK",
            "YEP",
            "Cock",
            "sadly didn't work on discord",
            "ï",
            "cock",
            "Nice one bro",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Cum",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "YEP COCK",
            "YEP",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿\nDamn this only really works on reddit",
            "Let me give you a Hand.",
            "Okayge",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "disappointed\n\nnot a real cock",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Okayge TeaTime",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Why do these never copy and paste correctly on my phone",
            "Yep",
            "Any cockers?",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "YEP COCK",
            "YEP",
            "https://www.reddit.com/r/copypasta/comments/geacf7/cock/?utm_source=share&utm_medium=ios_app&utm_name=iossmf unfortunate :(",
            "YEP \"COCK\"",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "where did you get this from I swear I was spamming this around yesterday",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Cock\n\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Nice",
            "Cock\n\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Cock\n\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Will spam in r/jschlatt. Thank you",
            "⠀⠀⠀⢀⣀⣤⣴⣶⣶⣾⣿⣷⣶⣶⣦⣄⡀⠀⠀⠀   ⠀⢠⣴⣿⣿⣿⣿⣿⣭⣭⣭⣭⣭⣿⣿⣿⣿⣧⣀⠀   ⢰⣿⣿⣿⣿⣿⣯⣿⡶⠶⠶⠶⠶⣶⣭⣽⣿⣿⣷⣆   ⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿   ⠈⢿⣿⣿⡿⠋⠉⠁⠈⠉⠛⠉⠀⠀⠀⠈⠻⣿⡿⠃    ⠀⠀⠀⠉⠁⠀⢴⣐⢦⠀⠀⠀⣴⡖⣦⠀⠀. . . . ..\n................⠈⠛⠋⠀⠀⠀⠈⠛⠁⠀⠀⠀⠀⠀   ⠀⠀⠀⠀⠀⣀⡀⠀⠀⠀⣀⠀⠀⠀⢀⡀⠀⠀⠀⠀\n ⠀⠀⢀⡔⣻⣭⡇⠀⣼⣿⣿⣿⡇⠦⣬⣟⢓⡄⠀⠀   ⠀⠀⠀⠉⠁⠀⠀⠀⣿⣿⣿⣿⡇⠀⠀⠉⠉⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠻⠿⠿⠟⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣠⢼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⡄⠀⠀⠀ ⠀⠀⣀⣤⣴⣾⣿⣷⣭⣭⣭⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀ ⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣸⣿⣿⣧⠀⠀ ⠀⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⡄⠀ ⠀⢸⣿⣮⣿⣿⣿⣿⣿⣿⣿⡟⢹⣿⣿⣿⡟⢛⢻⣷⢻⣿⣧⠀ ⠀⠀⣿⡏⣿⡟⡛⢻⣿⣿⣿⣿⠸⣿⣿⣿⣷⣬⣼⣿⢸⣿⣿⠀ ⠀⠀⣿⣧⢿⣧⣥⣾⣿⣿⣿⡟⣴⣝⠿⣿⣿⣿⠿⣫⣾⣿⣿⡆ ⠀⠀⢸⣿⣮⡻⠿⣿⠿⣟⣫⣾⣿⣿⣿⣷⣶⣾⣿⡏⣿⣿⣿⡇ ⠀⠀⢸⣿⣿⣿⡇⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣿⣿⣿⡇ ⠀⠀⢸⣿⣿⣿⡇⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⠀ ⠀⠀⣼⣿⣿⣿⢃⣾⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣿⣿⣿",
            "nice cock",
            "Okayge",
            "cock",
            " ⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣯⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟",
            " ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "the image is called pepege i believe",
            "Twitch memes poggers",
            "[deleted]"
        ]
    },
    {
        "post_id": "kgwa8d",
        "author": "Toko_Fukawa_Scissors",
        "title": "An actual message I was sent on discord because I made a your mom joke.",
        "url": "https://www.reddit.com/r/copypasta/comments/kgwa8d/an_actual_message_i_was_sent_on_discord_because_i/",
        "score": 8772,
        "num_comments": 199,
        "created_utc": 1608479585.0,
        "selftext": "I do not care what you say about my mother. Your opinion is your opinion. But trust me, if you actually attempt to do something to my mother, even though she's made some bad decisions in the past that we still need to work through, I will personally call the police on you and I'll be laughing as your mugshot is shown on TV. You don't even know her, do you? The point of your entire existence seems to be to just tease other people. Well, I believe your jokes are in bad taste, and you should cease and desist digging through the dregs left at the bottom of the joke barrel; you could get a splinter, whose pain will be significantly increased by the significantly high amount of salt you carry in your bloodstream. Thank you, and let us cease talking about each other's parents.",
        "permalink": "/r/copypasta/comments/kgwa8d/an_actual_message_i_was_sent_on_discord_because_i/",
        "comments": [
            "doin ya mom",
            "I 👁 do not care 💅 what you 👈 say 🗨💭💬 about 💦 my mother 👪. Your 👉 opinion 😤 is your 👉 opinion 😤. But 🍑👀 trust 😫🙅🏻😡 me, if you 👈 actually 😨😳 attempt 🙋 to do something 😅 to my mother 👶👩🔪, even 🌃 though 🤔 she's 👩 made 👉 some bad 👎 decisions 🤔 in the past 💦 that we still 🙄 need 👉 to work 🏢 through, I 👁🙌🏻 will personally 👨 call 📲 the police 👮🏻‍♂️👮🏻‍♀️ on 🔛 you 👈 and I'll 🤫 be laughing 😂 as your 👉 mugshot 🗿 is shown 👀🔍 on 🔛 TV 📺. You 👉 don't ❌ even 🌃 know 🤔 her 👩, do you 👈? The point 📍 of your 👉 entire 🇺🇸 existence 💁 seems 👀 to be to just tease 😗 other people 👨. Well 😤, I 👁 believe 🙏 your 👈 jokes 😂🤡 are in bad 👎 taste 👅👄, and you 👉🏽 should cease ✋ and desist digging ⛏ through the dregs 🅰🏦👍🏽 left 👈 at the bottom 👟⬇ of the joke 😂 barrel 🛢; you 👉🏿 could get 🉐 a splinter 💥, whose 🌄 pain 😡 will be significantly 💦 increased 🧂😭 by the significantly 💦 high 🕛 amount 💯 of salt 🧂 you 👈 carry 🔛 in your 👉🏻👤 bloodstream 💦. Thank 🙌 you 👉🏻🧑🏻, and let 👌🤞👫 us 👨 cease ⚠ talking 🗨💬 about 💦 each other's 👪 parents 👪.",
            "This almost seems like the type of thing I would've said when I was 11.",
            "I do not cawe what you say about my mothew. Youw opinion is youw opinion. But twust me, if you actuawwy attempt to do something to my mothew, even though she's made some bad decisions in the past that we stiww need to wowk thwough, I wiww pewsonawwy caww the powice on you and I'ww be waughing as youw mugshot is shown on TV. You don't even know hew, do you? The point of youw entiwe existence seems to be to just tease othew peopwe. Weww, I bewieve youw jokes awe in bad taste, and you shouwd cease and desist digging thwough the dwegs weft at the bottom of the joke bawwew; you couwd get a spwintew, whose pain wiww be significantwy incweased by the significantwy high amount of sawt you cawwy in youw bwoodstweam. Thank you, and wet us cease tawking about each othew's pawents.",
            "your\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nnephew",
            "Yo Mama Obama",
            " I do not care what you will have said about my mother. Your opinion will have been your opinion. But trust me, if you were to have actually attempted to do something to my mother, even though she's made some bad decisions in the past that we still need to work through, I will personally call the police on you and I'll be laughing as your mugshot is shown on TV. You don't even know her, do you? The point of your entire existence seems to be to just tease other people. Well, I will have believed your jokes are in bad taste, and you will be having to  cease and desist digging through the dregs left at the bottom of the joke barrel; you could have gotten a splinter, whose pain will have been significantly increased by the significantly high amount of salt you carry in your bloodstream. Thank you, and let us cease talking about each other's parents.",
            "Your mother is not a pleasant woman",
            "Shut up.  Literally shut the fuck up.  I can't even think.  You talk so much.  You literally can't stop talking for one second.  Do you have a disorder or something?  Me and your mother are very worried.  You should be getting A's,  not speech impediments.  The doctor says it will be permanent,  but then again,  nothing is temporary.  So do what you want dude.  You've only got one life, enjoy it 😎👉",
            "I respect the guy for defending his mother",
            "“I will personally call the police on you” lmfao",
            "Sounds like a Kevin to me!",
            "discord moment",
            "i can confirm the validity of this message. i was there when it was sent.",
            "mom",
            "YO M",
            "[deleted]",
            "This subreddit is a gold mine",
            "His mom FUCKS",
            "Lmao this person is crazy\n\n[Also, your username...DANGANRONPA!]",
            "Lmao, that's what your mom said",
            "Lol ur mum",
            "u/shittytranslatorbot",
            "Cant tell if satire or not",
            "Fingerlicking good.",
            "I sex you mom",
            "This subreddit is the best",
            "your mom’s gonna get a splinter",
            "Was going to bang yu mum but the line was too long",
            "Ive actually seen a friend get told off because he said “large mom have you”. How do people find this something to argue about",
            "your mom haha",
            "Is cummy still gone?",
            "coom",
            "Deadass, I made a tongue in cheek joke about doing someone's mom in the comments section of Twitch. Turns out their mom died.",
            "u/uwuwizard",
            "Hit em with the “uhh your mom fat” aha comedy gold amirite",
            "I'm on mobile, can someone be my cummy uwu",
            "I think this sucks the big titties",
            "Mobile user :(",
            "there is no way this wasn't already a copypasta",
            "Reminds me of these two guys I knew in 7th grade",
            "cummy...bot?",
            "You shoulda just responded w \"Your mom is so dumb she didn't put you up for adoption\" or something along those lines",
            "welp over 3300 people so far have laughed at him instead lol",
            "Bruh this is amazing lmao",
            "please respond to him with a link to this thread",
            "a gem",
            "I do not care what you say about Joe. Your opinion is your opinion. But trust me, if you actually attempt to do something to Joe, even though he's made some bad decisions in the past that we still need to work through, I will personally call the police on you and I'll be laughing as your mugshot is shown on TV. You don't even know him, do you? The point of your entire existence seems to be to just tease other people. Well, I believe your jokes are in bad taste, and you should cease and desist digging through the dregs left at the bottom of the joke barrel; you could get a splinter, whose pain will be significantly increased by the significantly high amount of salt you carry in your bloodstream. Thank you, and let us cease talking about Joe Mama.",
            "All I got from that is that his mom is bottom of the barrel or something",
            "What was your your mom joke?",
            "NTA, your mother, your rules.",
            "Signicantly good post,  real significant.",
            "Imagine typing a full blown response to a \"your mom\" joke and it gets posted to r/copypasta with ~8k upvotes and plenty of awards",
            "POV: ur a 4chan user",
            "Why tf do they type like a very pissed off anime character",
            "I do not care what you say about my mother. Your opinion is your opinion. But trust me, if you actually attempt to do something to my mother, even though she's made some bad decisions in the past that we still need to work through, I will personally call the police on you and I'll be laughing as your mugshot is shown on TV. You don't even know her, do you? The point of your entire existence seems to be to just tease other people. Well, I believe your jokes are in bad taste, and you should cease and desist digging through the dregs left at the bottom of the joke barrel; you could get a splinter, whose pain will be significantly increased by the significantly high amount of salt you carry in your bloodstream. Thank you, and let us cease talking about each other's parents.",
            "Yo mama so dumb\nthat she died.",
            "that username, i see.. r/abodysbeendiscovered",
            "Call him a faggot lmao",
            "Mine",
            "This is why discord mods are pedophiles. They just have enough of these little shits pretending to be better and want some revenge.",
            "same lol",
            "!emojify",
            "🙊",
            "LMAO WAT",
            "I do nyot cawe what you say about my mothew. Youw opinyion is youw opinyion. But twust me, if you actuawwy attempt to do something to my mothew, even though she's made some bad decisions in the past that we stiww nyeed to wowk thwough, I wiww pewsonyawwy caww the powice on you and I'ww be waughing as youw mugshot is shown on TV. You don't even knyow hew, do you? The point of youw entiwe existence seems to be to just tease othew peopwe. Weww, I bewieve youw jokes awe in bad taste, and you shouwd cease and desist digging thwough the dwegs weft at the bottom of the joke bawwew; you couwd get a spwintew, whose pain wiww be signyificantwy incweased by the signyificantwy high amount of sawt you cawwy in youw bwoodstweam. Thank you, and wet us cease tawking about each othew's pawents.",
            "you make jokes at everyone's expense and you try to take advantage of the misery you're responsible for giving them\n\n&#x200B;\n\nand never admit to any wrongdoing\n\n&#x200B;\n\nnor take anyone's criticisms of you lightly whether it's directly or indirectly or not even in direct reference to your base ideals because you're oversensitive"
        ]
    },
    {
        "post_id": "mw5hsm",
        "author": "hypeyeast6",
        "title": "A comment I found on hentaimemes",
        "url": "https://www.reddit.com/r/copypasta/comments/mw5hsm/a_comment_i_found_on_hentaimemes/",
        "score": 8769,
        "num_comments": 206,
        "created_utc": 1619100331.0,
        "selftext": "Futa hentai is the best and totally not gay. On the contrary, it's actually double straight, even more straight than vanilla hentai. Futas have all the sex organs: dick, vag, boobs. That's 66.6% straight and 33.3 (repeating, of course) % gay if you don't like futas. However, the dick and vag cancel out mathematically and we're left with nothing but female boobs, which is 100% straight. On top of that, the male g spot is in the ass. Getting your g spot pounded by a man is gay. Getting your g spot pounded by a fat twelve inch futa cock is straight because there's a vagina somewhere back there and boobs that can rest on your back, plus the math checked out. There are only two types of men: men who want a fat futa cock railing their throat and dumping a hot load into their stomach followed by hours upon hours of anal, and men who are in denial.\n\nEdit: thank you for the gold kind stranger.",
        "permalink": "/r/copypasta/comments/mw5hsm/a_comment_i_found_on_hentaimemes/",
        "comments": [
            "Why, the hell, did I even open this post",
            "Futa hentai is the best and totawwy not gay. On the contwawy, it's actuawwy doubwe stwaight, even mowe stwaight than vaniwwa hentai. Futas have aww the sex owgans: dick, vag, boobs. That's 66.6% stwaight and 33.3 (wepeating, of couwse) % gay if you don't wike futas. Howevew, the dick and vag cancew out mathematicawwy and we'we weft with nothing but femawe boobs, which is 100% stwaight. On top of that, the mawe g spot is in the ass. Getting youw g spot pounded by a man is gay. Getting youw g spot pounded by a fat twewve inch futa cock is stwaight because thewe's a vagina somewhewe back thewe and boobs that can west on youw back, pwus the math checked out. Thewe awe onwy two types of men: men who want a fat futa cock waiwing theiw thwoat and dumping a hot woad into theiw stomach fowwowed by houws upon houws of anaw, and men who awe in deniaw.",
            "Futa 👩🍆😍 hentai 👯 is the best 🏆 and totally 💯👌 not gay 🌈. On 🔛 the contrary ✋, it's actually 🤔 double ✌ straight 📏, even 🌃 more straight 📏 than vanilla 🥛 hentai 👯. Futas have all 💯 the sex 🍑🍆💦 organs ♻: dick 🍆🍑, vag 🐠🐟❌, boobs 🍒. That's ✔ 66.6 👹% straight 💑👫❌ and 33.3 🏚 (repeating ✂📋, of course 🏎) % gay 🌈 if you 👈🤡 don't 🚫 like 😄 futas. However 🖐, the dick 🍆 and vag 🐠🐟❌ cancel ❌ out mathematically 🧮 and we're left 👈 with nothing 🚫 but 🍑 female 👧 boobs 🏔, which is 100 💯% straight 💩📏. On 💦 top 🔼 of that, the male 👦 g 🅾🇳 spot 🌍 is in the ass 🍑. Getting 🉐🇻🇮 your 👉 g 🅾🇳 spot 🌍 pounded 🙈 by a man 👨 is gay 🌈. Getting 🔟 your 👉 g 🅾🇳 spot ⭕ pounded ⚒ by a fat 🎅 twelve 🕛 inch 📏 futa 👩🍆😍 cock 🐓 is straight 📏 because there's ✔🌃 a vagina 🍑 somewhere 💍 back 🔙 there and boobs 🍒 that can rest 😪 on 🔛 your 👉🏿 back 🔙, plus ◼◻➕ the math 📈 checked 🧐🔬📝 out. There are only two ✌ types 💻 of men 👨: men 👦 who want 😍 a fat 🎅 futa 👩🍆😍 cock 🍆 railing 👸🏽👌🏿 their throat 🍆👅👀 and dumping 💩🙍‍♂️ a hot 🔥🌡 load 💦 into their stomach 😮 followed 😤 by hours 🕐 upon 👦 hours 🕐 of anal 🍑, and men 👨 who are in denial 🚫.",
            "Link to post?",
            "I mean he does have arguments.",
            "Protect yourself today, say NO to futas. Protect our community, protect yourself, protect the future of humanity\n\n- This was a pre-recorded message from villesmore (me)",
            "What a terrible day to have eyes",
            "[removed]",
            "(From a friend)\n\nHmmm interesting. The man counted boobs as one object when they are, in fact, two. However he also neglected to mention that dicks have balls. Which are also two objects. Therefore the dicks and vaginas cancel each other out, as do balls and boobs, therefore futa hentai is asexual",
            "u/amonguscockbot",
            "What zero pussy does to a mf",
            "😐🔫",
            "This is completely false, everybody knows that tomboys are the better choice",
            "It’s gay if you’re a woman",
            "Actualy there is this formula that proves that both futas AND traps aren't gay so basicaly let's do these points:  \n\n\n1 ) In a male point of view:\n\n&#x200B;\n\nA masculine body = 1 gay point.\n\nA dick = 1 gay point.\n\nA feminine body = 1 straight point.\n\nA vagina = 1 straight point.\n\n&#x200B;\n\nTo make a man like we commonly understand it, we need 1 masculine body + 1 dick so it means 2 gay points.\n\n&#x200B;\n\nTo make a woman like we commonly understand it, we need 1 feminine body + 1 vagina so it means 2 straight points.\n\n&#x200B;\n\n2 ) Based on this we can assert that:\n\n&#x200B;\n\nAppreciating a man doing some solo sexual activities is 2 gays points meaning it’s gay.\n\nAppreciating a woman doing some solo sexual activities is 2 straight points meaning it’s straight.\n\n&#x200B;\n\n3 ) If a man and a woman have sexual activities we have the following situation:\n\n&#x200B;\n\n2 gays points + 2 straight points. \n\nSince gay is the opposite of straight 1 gay point = -1 straight point.\n\n&#x200B;\n\nSo we obtain -2 + 2 = 0. \n\n&#x200B;\n\nWatching a man and a female having sexual activities is neutral, not straight nor gay.\n\n4 ) Now a futanari is : \n\n&#x200B;\n\n1 feminine body = 1 straight point.\n\n1 vagina = 1 straight point.\n\n1 dick = 1 gay point or -1 straight point.\n\n&#x200B;\n\n1 + 1 -1 = 1\n\n&#x200B;\n\nThe result is 1 straight point, meaning that a solo futanari is straight.\n\nNow if we have:\n\nFutanari on Futanari => 1 + 1 = 2.\n\nFutanari on Female => 1 + 2 = 3.\n\nFutanari on male => 1 – 2 = -1.\n\n&#x200B;\n\nThe results here are the following: futanari on futanari is straight, futanari on female is straight, futanari on male is gay.\n\n&#x200B;\n\n5 ) Now a trap is:\n\n1 feminine body = 1 straight point.\n\n1 dick = 1 gay point or -1 straight point.\n\n&#x200B;\n\n1 – 1 = 0\n\n&#x200B;\n\nThe result is 0, meaning that a solo trap is neutral, it is not gay nor straight.\n\nNow if we have:\n\nTrap on Trap => 0 + 0 = 0\n\nTrap on Futanari => 0 + 1 = 1\n\nTrap on Female => 0 + 2 = 2\n\nTrap on male => 0 - 2 = - 2\n\n&#x200B;\n\nThe result here are the following: trap on trap is neutral, trap on futanari is straight, trap on female is straight , trap on male is gay.\n\n&#x200B;\n\n6 ) Since we are analyzing the whole fetish in itself we need to take them as a whole:\n\n&#x200B;\n\nFutanari ( whole fetish )  = (solo) + (futanari on futanari) + (futanari on female) + (futanari on male)  => 1 + 2 + 3 – 1 = 5 straight points.\n\n&#x200B;\n\nTrap ( whole fetish ) = (solo) + (trap on trap) + (trap on futanari) + (trap on female) + (trap on male) => 0 + 0 + 1 + 2 – 2 = 1 straight point.\n\n&#x200B;\n\nConclusion\n\nWe can safely say that we have demonstrated that Futanari and Trap are not gay in a situation where one is either watching, reading, listening to, playing a game, or fapping to those category",
            "Why?",
            "They hated Jesus because he spoke the truth",
            "Sex is sex, and whom worries about being gay is the most gay themselves!",
            "wouldnt futa porn be bi",
            "   at least I admit that I watch half gay half straight shit not his fucking r/dataisbeautiful calculation",
            "Based and futapilled",
            "But the balls contradict the equation...",
            "The fucking Leroy Jenkins reference killed me.",
            "repeating of course hahahahahaha",
            "My bisexuality won't even deny that.",
            "This is a bad time to say I still love reddit",
            "What is wrong with our world",
            "Who the fuck even thinks that futa is gay?",
            "This made me wish if I couldn't read.",
            "He makes a compelling argument, I’ll give him that",
            "These types of posts remind me of that Sacrifice meme that went around. \n\nIf you add girl dick to the mix you have a 66.6% of being gay. At sacrifice\n\nThe numbers don't lie. And they spell disaster",
            "P",
            "Cant argue with that",
            "Bulletproof logic I love futas",
            "What if you're a girl and like futas? Does that make you lesbian even though you're straight?",
            "Is it gay if I'm a woman?",
            "Say no the the futa, means you a puta",
            "https://youtu.be/rZrV1OtrEyQ",
            "Depends on how you see them, if you see them as man with boobs them it's gay but if you see them as a woman with dick then it's not gay",
            "i just opened the post bc i like futanari but only ones with the yuri tag but what the fuck",
            "No cock like ~~horse~~ futa cock",
            "I spit my coffee because of the gold ffs",
            "I love how you kept in the \"thanks for the gold kind stranger\"",
            "Actualy there is this formula that proves that both futas AND traps aren't gay so basicaly let's do these points:  \n\n\n1 ) In a male point of view:\n\n&#x200B;\n\nA masculine body = 1 gay point.\n\nA dick = 1 gay point.\n\nA feminine body = 1 straight point.\n\nA vagina = 1 straight point.\n\n&#x200B;\n\nTo make a man like we commonly understand it, we need 1 masculine body + 1 dick so it means 2 gay points.\n\n&#x200B;\n\nTo make a woman like we commonly understand it, we need 1 feminine body + 1 vagina so it means 2 straight points.\n\n&#x200B;\n\n2 ) Based on this we can assert that:\n\n&#x200B;\n\nAppreciating a man doing some solo sexual activities is 2 gays points meaning it’s gay.\n\nAppreciating a woman doing some solo sexual activities is 2 straight points meaning it’s straight.\n\n&#x200B;\n\n3 ) If a man and a woman have sexual activities we have the following situation:\n\n&#x200B;\n\n2 gays points + 2 straight points. \n\nSince gay is the opposite of straight 1 gay point = -1 straight point.\n\n&#x200B;\n\nSo we obtain -2 + 2 = 0. \n\n&#x200B;\n\nWatching a man and a female having sexual activities is neutral, not straight nor gay.\n\n4 ) Now a futanari is : \n\n&#x200B;\n\n1 feminine body = 1 straight point.\n\n1 vagina = 1 straight point.\n\n1 dick = 1 gay point or -1 straight point.\n\n&#x200B;\n\n1 + 1 -1 = 1\n\n&#x200B;\n\nThe result is 1 straight point, meaning that a solo futanari is straight.\n\nNow if we have:\n\nFutanari on Futanari => 1 + 1 = 2.\n\nFutanari on Female => 1 + 2 = 3.\n\nFutanari on male => 1 – 2 = -1.\n\n&#x200B;\n\nThe results here are the following: futanari on futanari is straight, futanari on female is straight, futanari on male is gay.\n\n&#x200B;\n\n5 ) Now a trap is:\n\n1 feminine body = 1 straight point.\n\n1 dick = 1 gay point or -1 straight point.\n\n&#x200B;\n\n1 – 1 = 0\n\n&#x200B;\n\nThe result is 0, meaning that a solo trap is neutral, it is not gay nor straight.\n\nNow if we have:\n\nTrap on Trap => 0 + 0 = 0\n\nTrap on Futanari => 0 + 1 = 1\n\nTrap on Female => 0 + 2 = 2\n\nTrap on male => 0 - 2 = - 2\n\n&#x200B;\n\nThe result here are the following: trap on trap is neutral, trap on futanari is straight, trap on female is straight , trap on male is gay.\n\n&#x200B;\n\n6 ) Since we are analyzing the whole fetish in itself we need to take them as a whole:\n\n&#x200B;\n\nFutanari ( whole fetish )  = (solo) + (futanari on futanari) + (futanari on female) + (futanari on male)  => 1 + 2 + 3 – 1 = 5 straight points.\n\n&#x200B;\n\nTrap ( whole fetish ) = (solo) + (trap on trap) + (trap on futanari) + (trap on female) + (trap on male) => 0 + 0 + 1 + 2 – 2 = 1 straight point.\n\n&#x200B;\n\nConclusion\n\nWe can safely say that we have demonstrated that Futanari and Trap are not gay in a situation where one is either watching, reading, listening to, playing a game, or fapping to those category",
            "I'll allow it",
            "I won’t judge him for having a fetish. I _will_ judge him for him conspiracy-nut level math to try and sound smarter than the average person—“woke” if you will—when in reality it sounds like he’s one of the men who are in denial. Also, very insecure.\n\nI’ll also judge him for posting something so cringy that it could turn a person inside out.",
            "he has a point",
            "Fucking hilarious",
            "God weeps.",
            " Futa hentai is the 🤘🤘🤘 best and totally not ⏳ gay. 🏳️‍🌈 On the 🤣 contrary, it's actually double ➿➿➿ straight, 📏 even 🌒🌜🌘🌛🌚🌗🌙🌃🌕🌆🌓🌑🌔🌖 more ➕ straight 📏📏📏 than vanilla hentai. Futas have 🈶 all the 🤣 sex organs: dick, vag, boobs. That's 66.6% straight 📏 and 33.3 (repeating, of course) % gay 🏳️‍🌈🏳️‍🌈🏳️‍🌈 if you 😀😊 don't like 💒💕💌💞💛😍😻💖💜💚👭😄👨‍❤️‍💋‍👨💟💋👩‍❤️‍💋‍👩👫💓👨‍❤️‍👨🥰💘😗💑💏😘🏩💗😚❤️👬🧡💙👍 futas. However, the 🤣 dick and vag cancel ❌❌❌ out 😵 mathematically and we're left ↙️🔍↩️🗨️👈↔️🛅↖️⬅️↪️🤛 with nothing 🈚⏳ but 😥😥😥 female 🤷‍♀️💂‍♀️🧜‍♀️🚶‍♀️🏌️‍♀️⛹️‍♀️🚴‍♀️🏃‍♀️👷‍♀️🧛‍♀️👙👭🏋️‍♀️🙎‍♀️👒💇‍♀️🙇‍♀️🙆‍♀️🦸‍♀️👧🧞‍♀️🧗‍♀️💃🤦‍♀️💆‍♀️🧘‍♀️♀️🚺🤶🧕🕵️‍♀️👠👱‍♀️💄👩🧙‍♀️🙋‍♀️🚵‍♀️🧟‍♀️👸👯‍♀️🙅‍♀️🏊‍♀️👳‍♀️🧝‍♀️💁‍♀️👮‍♀️👘👵👚🧚‍♀️🧖‍♀️🚣‍♀️🦹‍♀️🏄‍♀️ boobs, which is 100% straight. 📏 On top 🔼⤴️⬆️🔝⏫🔺 of that, the 🤘🤘🤘 male 👷‍♂️🧗‍♂️💇‍♂️💆‍♂️🧟‍♂️🦸‍♂️👞🧘‍♂️🙆‍♂️🤷‍♂️🙋‍♂️🧞‍♂️🦹‍♂️💂‍♂️🧙‍♂️🙇‍♂️🤦‍♂️👦🎅💁‍♂️🚹🧜‍♂️🕺♂️🧛‍♂️🙍‍♂️👱‍♂️👳‍♂️👴🙎‍♂️🧚‍♂️🤴👲🙅‍♂️🧖‍♂️👯‍♂️ g spot 🦒 is in the 🤣 ass. Getting 💇🉐💆💆‍♂️💇‍♀️💇‍♂️💇🉐💆💆‍♂️💇‍♀️💇‍♂️💇🉐💆💆‍♂️💇‍♀️💇‍♂️ your g spot 🦒 pounded 💷 by a man 💇‍♂️👨‍🦯💆‍♂️🤦‍♂️🏃‍♂️👦👨‍👦‍👦👨‍🎓👨‍🔬🤽‍♂️💁‍♂️👨‍🌾👨‍🔧🚵‍♂️👨‍🚒🧞‍♂️👨‍🦱👷‍♂️👨‍👧‍👧👨‍👩‍👧‍👦👨‍🦰🏌️‍♂️👨‍❤️‍💋‍👨🧟‍♂️👞🙅‍♂️👨‍🏫👫🦸‍♂️👨‍🏭👨‍👦👨‍🦼🕵️‍♂️🏊‍♂️👨‍✈️👩‍❤️‍👨👨‍❤️‍👨🦹‍♂️🙆‍♂️🧗‍♂️🙇‍♂️🧛‍♂️🚴‍♂️👨‍👩‍👧‍👧🧖‍♂️🤹‍♂️👨‍🦳⛹️‍♂️🧍‍♂️👮‍♂️👨‍👩‍👦👨🧎‍♂️🕺👨‍👩‍👧🏋️‍♂️👨‍💻🇮🇲👨‍👨‍👧‍👧👨‍⚖️👨‍👨‍👧👩‍❤️‍💋‍👨🙎‍♂️👨‍👨‍👧‍👦🙍‍♂️👨‍🍼🎅💂‍♂️👨‍🦲🤷‍♂️🧝‍♂️🧜‍♂️👨‍👨‍👦‍👦👨‍🎤👨‍👩‍👦‍👦🧚‍♂️🧘‍♂️🚣‍♂️🚶‍♂️🙋‍♂️👰‍♂️👨‍👧🏄‍♂️👨‍🍳🧙‍♂️👨‍⚕️🤴🤾‍♂️👨‍🦽🤸‍♂️👴👨‍👧‍👦👨‍👨‍👦👳‍♂️👱‍♂️🧏‍♂️👨‍🎨👨‍🚀🤵‍♂️ is gay. 🏳️‍🌈🏳️‍🌈🏳️‍🌈 Getting 💇‍♂️💇🉐💆💆‍♂️💇‍♀️ your g spot 🦒 pounded 💷 by a fat twelve 🕛🕛🕛 inch futa cock is straight 📏 because there's a vagina somewhere back ⬅️🔙🤚 there and boobs that can rest 😪🛌 on your back, 🔙⬅️↩️🔙⬅️↩️🔙⬅️↩️ plus ➕ the 🤘 math ➕📏📐✖️➖ checked ☑️✅☑️✅☑️✅ out. 😵 There are 👉 only two 🐫✌️🕝🕑 types ⌨️⌨️⌨️ of men: 🙆‍♂️🤼‍♂️🚹👬👴 men 👯‍♂️🤼‍♂️👬🚹🙆‍♂️ who want a fat futa cock railing 🚈 their throat and dumping a hot 🍛♨️🍨🐫🍧🍦🫖☕🥵🔥😅🌶️😓🐪🌭🍛♨️🍨🐫🍧🍦🫖☕🥵🔥😅🌶️😓🐪🌭🍛♨️🍨🐫🍧🍦🫖☕🥵🔥😅🌶️😓🐪🌭 load 📂 into their stomach followed by hours upon hours of anal, and men 👴👯‍♂️🚹🤼‍♂️👬 who are 👉 in denial.  Edit: thank 🙌🙌🙌 you 😀🤟 for 🈺 the 🤣 gold kind stranger.",
            "based",
            "I hate to say it, but he has a point",
            "I mean he isnt wrong",
            "Why do I oddly agree with the last sentence",
            "Idk about y'all but he's spittin",
            "thats not wrong tho",
            "futa is nasty",
            "I swear I tried my hardest \n\nbut my peen just keeps on getting flaccid \n\nand deep within my heart I loathed the futanaris\n\n\nNever really understood\n\nWhy chicks with dicks were so approved\n\nIt looks and feels unnatural and sick\n\nTheir veiny dicks gave me the very reason to commit atrocious war crimes in the former Yugoslavia\n\n\nTheir faces filled with lust and pleasure\n\nReminded me of sex addicted pigs\n\nThe appraisal from the filthy weebs \n\nTurned my loathing into blood lust\n\n\nEverytime I see a futa\n\nA desire surges deep within my heart \n\nTo cut their dicks and crush their balls\n\nTo rip and tear  their face and balls",
            "I'm downvoting this shit",
            "true",
            "lmao that last line",
            "[slow clap]\n\nExemplary copypasta finding",
            "me who is also gay",
            "This is the way.",
            "Repeating, of course",
            "what in the actual frigate did i just read",
            "Oh god I'm eating cereal as well.",
            "Hhhhhh",
            "r/eyeblech",
            "Straight sex has a cock too but at least with futa they are both girls even if one has a dick",
            "I'm gonna have nightmares about this",
            "Why are you on hentaimemes, op?",
            "lowkey spittin",
            "Roses are red, violets are blue, I’m deleting my history and you should too.",
            "what about lesbian futa?",
            "hey is there a possibility that we can plant a trained sniper on the guy who made the original post in hentaimemes",
            "WHY",
            "doesnt matter if its gay if youre into it youre into it, and by golly im into it",
            "why",
            "But what if you fuck the futa in either hole?",
            "beautiful",
            "Imagine having such fragile heterosexuality that you write an essay to prove you aren't gay",
            "Based",
            "Please delete this",
            "Stonks...",
            "I agree",
            "but futa women have no vgina???",
            "LOLLL",
            "you cant cancel out x in x+y/x tho",
            "Me",
            "#\"vag\"#",
            "idk why this is my only takeaway from this fucking thing but boobs aren't sex organs??????",
            "That is such a reddit thing to write"
        ]
    },
    {
        "post_id": "jfc091",
        "author": "owo-translator",
        "title": "Under a boomer meme",
        "url": "https://www.reddit.com/r/copypasta/comments/jfc091/under_a_boomer_meme/",
        "score": 8758,
        "num_comments": 267,
        "created_utc": 1603283978.0,
        "selftext": "FATHER 👨👴 I 👥 CANNOT 🚫 CLICK 👁 THE BOOK 📖\nI 👁 CAN'T ❌💨 CLICK 👅 THE BOOK 📖, FATHER 👨\nDAD 👨\nDAD 👨🏻\nTHIS BOOK 📙📚 IS ANCIENT 🗿🎼 TECHNOLOGY 💡 THAT IS BEYOND 👉 MY MIND 🧠😤, AS I 👁 HAVE BEEN TAINTED 😷 BY TOUCHPAD TECHNOLOGY 💡\nFATHER 👨\nTHE BOOK 📕📚 IS ANALOG AND THE DEVICES 📱 I 👁 AM ACCUSTOMED TO OPERATING 🤖 ARE DIGITAL 🔢\nAND THUS 😂 CLICKING THE BOOK 📖 YIELDS ⚠ UNSATISFACTORY 😢 RESULTS 💹 WHEN 🍑 COMPARED 😡✊🔏 TO THE DIGITAL 🚫 DEVICES 📱 THAT HAVE BECOME 😌 COMMONPLACR AFTER 👀 THE TURN 🔄 OF THE CENTURY 👴\nFATHER 👨 PLEASE 🙏🏾 INSTRUCT ⚠ ME ON 🔛 HOW TO OPERATE 🔪⚔ THE BOOK 👈🤡📖 WITH YOUR 👉 SUPERIOR 🎰 MIND 🧠\nYOU 👈 WERE BORN 👶 IN THE LATE 💤 1970S 👩‍🎤 AND THUS 😂 YOUR 👉 REALM 👽 OF KNOWLEDGE 📃📚📔 WOULD MOST LIKELY 😠 ENCOMPASS 🎯 THE HANDLING 😲 AND OPERATION 🔪⚔ OF THIS ANCIENT 📜 TOME 😐\nFATHER 📅👨🏼 I 👁 CANNOT 🚫 CLICK 💜 THE BOOK 📖",
        "permalink": "/r/copypasta/comments/jfc091/under_a_boomer_meme/",
        "comments": [
            "Dad could not publish the book\nClick \"Save\", the boys can't.\nfather\nBaba 🏻\nThis book is about \"technology\" rather than \"my heart.\" I have a touch on technology.\nfather\nThese manuals, the machine can perform statistical functions efficiently.\nAnd click on the \"Earnings\" heading in the Property Properties - results when comparing machine numbers after centuries.\nI use spiritual information to graduate.\nHe was born in the late seventies. Why does light support the “old” norm?\nBoys can click the \"reserve\" button.",
            "FATHER 👨 👨👴 I 👁 👥 CANNOT 🚫 🚫 CLICK 💜 👁 THE BOOK 📖 📖   \nI 👁 👁 CAN'T 🚫 ❌💨 CLICK 👁 👅 THE BOOK 📚 📖, FATHER 👨 👨   \nDAD 👨🏻 👨   \nDAD 👨 👨🏻   \nTHIS BOOK 📚😢 📙📚 IS ANCIENT 📜 🗿🎼 TECHNOLOGY 💡 💡 THAT IS BEYOND 👆 👉 MY MIND 🤯 🧠😤, AS I 👁 👁 HAVE BEEN TAINTED 💩 😷 BY TOUCHPAD TECHNOLOGY 💡 💡   \nFATHER 👨 👨   \nTHE BOOK 📚 📕📚 IS ANALOG AND THE DEVICES 📼📱💻 📱 I 👁 👁 AM ACCUSTOMED TO OPERATING 🤖 🤖 ARE DIGITAL 👧🏿 🔢   \nAND THUS 😮 😂 CLICKING THE BOOK 📚 📖 YIELDS ⚠ ⚠ UNSATISFACTORY 😢 😢 RESULTS 💹 💹 WHEN 🍑 🍑 COMPARED ⚖ 😡✊🔏 TO THE DIGITAL 🔢 🚫 DEVICES 📱🔌 📱 THAT HAVE BECOME 😌 😌 COMMONPLACR AFTER 👀 👀 THE TURN 🔄 🔄 OF THE CENTURY 💯🌃⁉ 👴   \nFATHER 👨🏻‍💼 👨 PLEASE 🙏 🙏🏾 INSTRUCT ⚠ ⚠ ME ON 🔛 🔛 HOW TO OPERATE 🔪⚔ 🔪⚔ THE BOOK 📚 👈🤡📖 WITH YOUR 👉 👉 SUPERIOR 🎰 🎰 MIND 🤯 🧠   \nYOU 👉 👈 WERE BORN 👶 👶 IN THE LATE 🕛 💤 1970S 👩‍🎤 👩‍🎤 AND THUS 😂👌 😂 YOUR 👉 👉 REALM 👽 👽 OF KNOWLEDGE 📚💹 📃📚📔 WOULD MOST LIKELY 🎮 😠 ENCOMPASS 🎯 🎯 THE HANDLING 😲 😲 AND OPERATION 🔪⚔ 🔪⚔ OF THIS ANCIENT 📜 📜 TOME 🇸🇹 😐   \nFATHER 👨👨🏻👨🏼 📅👨🏼 I 👥 👁 CANNOT 🚫 🚫 CLICK 🖱 💜 THE BOOK 📚 📖",
            "[at least give the guy some credit](https://www.reddit.com/r/Cringetopia/comments/jf8119/thats_some_top_level_boomer_joke/g9j2b9t?utm_medium=android_app&utm_source=share&context=3)\n\n\n\n\n\n\n\n\n\n\n\nEdit: apparently this isn't an original but whatever",
            "Father, for weeks I have struggled to understand this primitive apparatus. I have over and over again pressed my fingers against the pages, expecting some sort of change, but to no avail. My hand is a tangled mess, and the blood leaves chaotic streaks across the pages, a painting of confusion and desperation. How I want nothing more than information, knowledge, mastery of the topic to course through my veins, but I realize now that I am a prisoner to primordial concepts that exist outside of my sphere of understanding. Ironic, isn't it, father? All this technology to make the next generation smarter, but yet I am confounded by something trivial to individuals centuries ago.  \n\nFather, I am letting my hand bleed out. I have no use for this mortal coil if I cannot attain the knowledge I desire. It would forever haunt me if I were to continue on like this. I am sorry.",
            "[deleted]",
            "FATHEW 👨👴 I 👥 CANNOT 🚫 CWICK 👁 THE BOOK 📖\nI 👁 CAN'T ❌💨 CWICK 👅 THE BOOK 📖, FATHEW 👨\nDAD 👨\nDAD 👨🏻\nTHIS BOOK 📙📚 IS ANCIENT 🗿🎼 TECHNOWOGY 💡 THAT IS BEYOND 👉 MY MIND 🧠😤, AS I 👁 HAVE BEEN TAINTED 😷 BY TOUCHPAD TECHNOWOGY 💡\nFATHEW 👨\nTHE BOOK 📕📚 IS ANAWOG AND THE DEVICES 📱 I 👁 AM ACCUSTOMED TO OPEWATING 🤖 AWE DIGITAW 🔢\nAND THUS 😂 CWICKING THE BOOK 📖 YIEWDS ⚠ UNSATISFACTOWY 😢 WESUWTS 💹 WHEN 🍑 COMPAWED 😡✊🔏 TO THE DIGITAW 🚫 DEVICES 📱 THAT HAVE BECOME 😌 COMMONPWACW AFTEW 👀 THE TUWN 🔄 OF THE CENTUWY 👴\nFATHEW 👨 PWEASE 🙏🏾 INSTWUCT ⚠ ME ON 🔛 HOW TO OPEWATE 🔪⚔ THE BOOK 👈🤡📖 WITH YOUW 👉 SUPEWIOW 🎰 MIND 🧠\nYOU 👈 WEWE BOWN 👶 IN THE WATE 💤 1970S 👩‍🎤 AND THUS 😂 YOUW 👉 WEAWM 👽 OF KNOWWEDGE 📃📚📔 WOUWD MOST WIKEWY 😠 ENCOMPASS 🎯 THE HANDWING 😲 AND OPEWATION 🔪⚔ OF THIS ANCIENT 📜 TOME 😐\nFATHEW 📅👨🏼 I 👁 CANNOT 🚫 CWICK 💜 THE BOOK 📖",
            "FATHER 👨👴 I 👥 CANNOT 🚫 CLICK 👁 THE BOOK 📖 I 👁 CAN'T ❌💨 CLICK 👅 THE BOOK 📖, FATHER 👨 DAD 👨 DAD 👨🏻 THIS BOOK 📙📚 IS ANCIENT 🗿🎼 TECHNOLOGY 💡 THAT IS BEYOND 👉 MY MIND 🧠😤, AS I 👁 HAVE BEEN TAINTED 😷 BY TOUCHPAD TECHNOLOGY 💡 FATHER 👨 THE BOOK 📕📚 IS ANALOG AND THE DEVICES 📱 I 👁 AM ACCUSTOMED TO OPERATING 🤖 ARE DIGITAL 🔢 AND THUS 😂 CLICKING THE BOOK 📖 YIELDS ⚠ UNSATISFACTORY 😢 RESULTS 💹 WHEN 🍑 COMPARED 😡✊🔏 TO THE DIGITAL 🚫 DEVICES 📱 THAT HAVE BECOME 😌 COMMONPLACR AFTER 👀 THE TURN 🔄 OF THE CENTURY 👴 FATHER 👨 PLEASE 🙏🏾 INSTRUCT ⚠ ME ON 🔛 HOW TO OPERATE 🔪⚔ THE BOOK 👈🤡📖 WITH YOUR 👉 SUPERIOR 🎰 MIND 🧠 YOU 👈 WERE BORN 👶 IN THE LATE 💤 1970S 👩‍🎤 AND THUS 😂 YOUR 👉 REALM 👽 OF KNOWLEDGE 📃📚📔 WOULD MOST LIKELY 😠 ENCOMPASS 🎯 THE HANDLING 😲 AND OPERATION 🔪⚔ OF THIS ANCIENT 📜 TOME 😐 FATHER 📅👨🏼 I 👁 CANNOT 🚫 CLICK 💜 THE BOOK 📖",
            "this is based",
            "https://www.reddit.com/r/copypasta/comments/cwn9vf/father_i_cannot_click_the_book/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Trump",
            "!emojify",
            "Okay.... WHERE THE FUCCCCCCCK IS CUMMY?!",
            "u/uwuwizard",
            "Based",
            "!emojify",
            "https://quizlet.com/86962711/ap-comparative-government-and-politics-introduction-flash-cards/",
            "e",
            "Time to whip up the industrial revolution and its consequences have been a disaster for the human race",
            "Based",
            "wow what a hot take i haven’t seen this one a million times before",
            "repost",
            "u/uwuwizard",
            "Based",
            "!emojify",
            "[deleted]",
            "Based",
            "Based",
            "But late 1970’s isn’t boomer",
            "[deleted]",
            "Based",
            "Oh god the emojifier",
            "based cock weed",
            "!thesaurizethis",
            " !thesaurizethis"
        ]
    }
]