[
    {
        "post_id": "t04onc",
        "author": "None",
        "title": "🇺🇦",
        "url": "https://www.reddit.com/r/copypasta/comments/t04onc/_/",
        "score": 8375,
        "num_comments": 392,
        "created_utc": 1645686471.0,
        "selftext": "Reddit,\n\nCrack down on the Russian troll accounts, or you are an active part of the attack on Ukraine.\n\nThis is now a time of war.\n\nIf you host and distribute Russian propaganda, you are a tool of the invasion, and a tool of fascism.\n\nThis is an unprovoked attack on a peaceful nation.\n\nHosting comments, posts, or forums that condone or dismiss that attack is giving a mouthpiece to the kremlin’s agenda.",
        "permalink": "/r/copypasta/comments/t04onc/_/",
        "comments": [
            "🇺🇦  \n極端他媽的劇透  \n雷迪特，  \n打擊俄羅斯巨魔帳戶，或者您是對烏克蘭的攻擊的積極參與者。  \n現在是戰爭時期。  \n如果你主持和分發俄羅斯的宣傳，你就是入侵的工具，也是法西斯主義的工具。  \n這是對和平國家的無端攻擊。  \n主持縱容或駁斥這種攻擊的評論、帖子或論壇是克里姆林宮議程的代言人。",
            "I hope the war will end soon. I don't want the Donbass area become an another Crimea.",
            "Memes aside, on a serious note, I wish Ukraine the best. Why is Russia attempting to start a war with Ukraine in the first place?",
            "As a romanian, I wish the best to Ukraine",
            "Based. Glory to Ukraine 🇺🇦🇺🇦🇺🇦",
            "As someone from Ukraine, thanks!\n\nRetards unite!",
            "# SLAVA UKRAINI! 🇺🇦",
            "im not even in europe, im from vietnam, but nonetheless i wish all ukrainians the best. please stay safe and healthy and I wish you well. <3",
            "[removed]",
            "I’m Italian and wish all the best for Ukraine 🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦🇺🇦",
            "HOORAH",
            "I LOVE FREEEEEEEEEEEEEEEEEEDOMMMMMMMM😩😩😩😩I LOOOOOVE UKRAINE🇺🇦🇺🇦🇺🇦😛😍😛😜I LOVE THE U.S🇺🇸🇺🇸🇺🇸!!!!!!!!!😋😋😇😜I LOOOOOOOOOOOOVE THE UN🇺🇳  🤤🤤🤤🤤🤤\n\n&#x200B;\n\nThe only thing I love more than a big fat homemade burger after watching the snow slowly fall to the ground, days before the 25th of December, is the faith that FREEDOM and GOD ALMIGHTY will win in the end😎😎😎😎 CAN I GET AN AMEN (Or OORAH, Insha-Allah, Poggers, THAT IS EPIC, etc)??!!\n\n&#x200B;\n\nedit: spelling error, also added inclusive Amen terms",
            "This is a Certified Good Reddit Moment 🇺🇦",
            "There are still non-Russian people on Reddit who believe that Ukraine is the aggressor",
            "Reddit, 📳 cwack down 👎 on 🔛 the russian 🇷🇺 twoww accounts, ow you 🧒 awe an active 🏋️⛹️‍♀️🏊‍♀️ pawt 🏻 of the attack on ❌ ukwaine. 🇺🇦 this is now 😚 a time ⌛ of waw. 😵 if you 😕🏿 host 👨 and distwibute russian 🇷🇺 pwopaganda, 😞 you 👈 awe a toow 🔱 of the invasion, and a toow 🔦 of fascism. 💀💀💀 this is an unpwovoked attack on 🔛 a peacefuw 😇 nation. 😺 hosting comments, posts, 📱💻 ow fowums that ❗ condone 💇🏿 ow dismiss that 👉👉👉👉👉👉👉👉👉 attack is giving 👸👸 a mouthpiece to the kwemwin’s agenda. 🈸📔",
            "As a pole this war is a terryfying thing to see. I do not want to have russians on my doorstep please NATO do something.",
            "Good luck Ukraine \n\nWe stand with you \n\n🇵🇱❤🇺🇦",
            "Very based.",
            "This but unironically. Glory to Ukraine💪🇺🇦🌐. Fuck the fascist Putin supporting shitstains",
            "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nproof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\ncopied from u/everysir to spread awareness! please spread on relevant threads to get the word out!!!",
            "Шановні українці!\n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий.\n\nЦе брехня.\n\nЯкщо ви шукаєте притулку – йдіть до польського кордону.  Ми готові до вашого приїзду.  На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу.\n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl\n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги.\n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ.  ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ.  ВІЗИ ПРИСПИНЕНО!  ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!!\n\nEDIT2: як доказ того, що вам більше не потрібна віза:\n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua\n • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en\n\nВибачте, якщо це дурниця, я використовував Google Translate\n\nJust spamming this in relevant chats, don't mind me",
            "Man i still can't believe putin did the civ v maneuver\n\n&#x200B;\n\n\\*puts army in your border\\*\n\nAre you going to attack?\n\n\"no lol\"\n\n\\*attacks anyways\\*\n\n\\*gets denouced to hell by the rest of the free world\\*",
            "I feel such shame for my government and such pain for everyone who live in Ukraine. Im half Ukrainian and those news kill me.",
            "Good luck to all Ukrainians, stay safe <3",
            "pov : world war 3",
            "can someone explain to me what's going on",
            "Some of the comments here are not funny at all, Ukraine is at a literal ~~borderline of~~ war with Russia and y’all are joking about it? Get a fucking life",
            "As an Indian, I send best regards to all Ukrainians rn",
            "🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿 🗿",
            "Literally all I've seen in on the whole of reddit is pro-ukraine posts. Not saying that's a bad thing of course but I don't think you need to worry about Russian propaganda getting on the front page.",
            "You can't just cut off the civilians watersource.",
            "u/shittytranslatorbot",
            "reddit moment",
            "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n• ⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua • ⁠in English https://www.gov.pl/web/udsc/ukraina-en",
            "Kinda cringe copypasta ngl",
            "So delete r/conservative entirely then?",
            "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nproof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\ncopied from u/everysir to spread awareness! please spread on relevant threads to get the word out!!!",
            "Вообще похер",
            "🇷🇺 🇷🇺 🇷🇺",
            "This copypasta sucks ass and isn't funny.",
            "[deleted]",
            "100% true",
            "YTA, Russian accounts Russian rules",
            "трахнуть украину",
            "I'll do you one better: why are any IP addresses allowed from Russia? Is there a single benefit from allowing them to interact with civilized society? They bring no benefit, only lies and antagonism.",
            "Смерть Путлеру жду когда на Москву ракеты полетят🥰🥰🥰",
            "I love Russia 🇷🇺 Crimea is Russian and this could have been avoided if they just gave Crimea to them",
            "i will just [leave](https://www.channel4.com/news/kiev-svoboda-far-right-protests-right-sector-riot-police) [these](https://www.haaretz.com/world-news/europe/in-ukraine-hundreds-march-with-torches-in-annual-tribute-to-nazi-collaborator-1.9420221) [here](https://www.itv.com/news/2020-01-01/thousands-of-far-right-ukrainians-honour-nazi-linked-nationalist-stepan-bandera-in-march-through-kyiv)\n\nedit - fixed links, they weren't supposed to all be the same one\n\nedit2 - not a fan of putin",
            "🇷🇺🇷🇺RUSSIA IS THE BEST COUNRY IN THE WORLD🇷🇺🇷🇺🇷🇺РУССКИЕ ВПЕРЁД РУССКИЕ ВПЕРЁД🇷🇺🇷🇺🇷🇺🇷🇺РОССИЯ ЛУЧШАЯ СТРАНА🇷🇺🇷🇺🇷🇺🇷🇺",
            "Can we not block Russian ips from interacting outside Russia lol, like they location base gambling and you can't use the app unless gps is in the right state can we not cut russia off the global internet?",
            "\"peaceful nation\" that has been at war with separatists for 8 years.",
            " المجد لأوكرانيا  UA",
            "God bless Ukraine",
            "Facts tbh",
            "Time to mow down some bear fuckers",
            "Unfathomably based",
            "what is this from",
            "I wish 🤞 😪 😢 😫 😔 😕 the best 👌 👍 😍 🥰 ☺ 💖 to Ukraine 🇺🇦 😢 😞 😫 😕 😔 🇺🇦 😢 😞 😫 😕 😔 from NATO",
            "All of Putin's speeches are copypastas.",
            "Reddit supported the Russian trolls that got trump elected and helped divide the USA and continue to divide the USA. They don’t give a shit.",
            "I mean if you are going to censor...",
            "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\nYes, this is a repost, I'm not the author, I'm trying to get this info to as many people I can",
            "[Ask Questions on Ukraine Vs Russia](https://youtu.be/pGj7hg76Nbk)",
            "Dear Ukrainians!\n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nYOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nproof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua\n•\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\n#copied from /u/everysir to spread awareness! please spread on relevant threads to get the word out!!!",
            "СЛАВА УКРАИНА",
            "Dear Ukrainians! \n\nI heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed. \n\nIt's a lie. \n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid. \n\nPolish government launched a dedicated site to help you: ua.gov.pl \n\nPlease share this information if you know anyone seeking help right now. \n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!! \n\nEDIT2: as a proof that you no longer need visa: \n\n•⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua\n•⁠in English https://www.gov.pl/web/udsc/ukraina-en \n\nEdit: this is a copy and paste and I encourage you all to do it too where appropriate! \n\nШановні українці! \n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий. \n\nЦе брехня. \n\nЯкщо ви шукаєте притулку – йдіть до польського кордону.  Ми готові до вашого приїзду.  На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу. \n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl \n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги. \n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ.  ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ.  ВІЗИ ПРИСПИНЕНО!  ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!! \n\nEDIT2: як доказ того, що вам більше не потрібна віза: \n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en \n\nВибачте, якщо це дурниця, я використовував Google Translate \n\nFor those in immediate danger/war zone: \n\nI can't think of much to say other than words of advice to be prepared. \n\nFill any food safe containers with water. \nAnother user correctly mentioned that one cannot drink water that was stored in their bathtub unless the tub has been cleaned, disinfected, and sanitized which it probably won't be at this time. Pets could still drink tub water a little longer and it could come in useful in other ways, plus if you have other ways to sanitize the water (boiling, or 4 gallons water to 1/3 teaspoon bleach makes it drinkable, etc.) It is still valuable and I would still fill my tub if I were in that situation. \n\nRation food and eat things that are perishable first. \n\nPrepare the safest room in your dwelling as a bunker. Hang heavy blankets around windows and doors. \n\nPack vital items into a go-bag and make sure you know where it is at all times. Passports, ID, cash, gold jewellry/valuables, small sentimental items, medications, phone charger, laptop. \n\nFirst aid kit is important too if possible, take one from your home or car and keep it in your go bag. Gauze, bandages, saline for sanitizing wounds, small splints, medical tape, tourniquet, even some stains of clean fabric could be helpful if it comes down to it. \n\nKeep your best walking shoes or hiking boots/winter boots on, or within reach, at all times. Wear warm socks preferably made of wool. They will stay warm when wet unlike cotton. \n\nElectricity may go out- charge all your devices and any backup batteries you may have. Use them as little as possible for now. \n\nKeep some flashlights and batteries in a bag or box easily accessible. \n\nKnow which of your neighbours you can trust and what skills they may have so you can help eachother. \n\nYou can often trade liquor and cigarettes for other valuable things you may need - if you have any, reserve them in case you need them. \n\nIf there is something valuable that you cannot take with you but must protect, bury it. \n\nKeep your head down, do not draw attention to yourself. If you must do anything that may look suspicious, act like normal & move with confidence. Most people will not question someone who is purposefully doing a task and not acting suspicious. \n\nGet to Slovakia, Poland, or Romania. Their borders are open to refugees. Bring your passport.\nI don't know what sheltering as a refugee will be like with pets. A kind citizen may be able to take care of them for you temporarily if you get them across a border. Just do your best. You can only care for them & your loved ones if you care for yourself first. Difficult decisions are made in times like these. \n***edited to add, contacts in each of these countries have confirmed they are currently accepting refugees, no Visa required, but passport is required.\nKeep your passport on your person at all times, close to your body, wear a small fanny pack or belt bag under your clothes or duct tape it on your torso inside a zip lock bag or wrapped in a small cloth if you must. Desperate people may try to take one if they don't have one or can't find theirs. \n\nMessage any of us we will be checking. \n\nStay safe. It seems hollow to say it from the comfort of a country not at war but its all I can think of. \n\nMay Putin burn to dust.\n\n\n***edited to add - take photos of all your important documents and email them to yourself and to someone outside of fhe country if possible as well. And/or store them using a cloud service. Very important. \n\nTry to be kind to one another. Try to help others if you can. \nMay courage be with you.\n\n\n\n\n\n\nAnother user posted this below and it appears to be valuable information so I will add it here as well: \n\nThis is a copy and paste and I encourage you all to do it too where appropriate! Шановні українці! \n\nУ соцмережах я чув, що поширюються фейкові новини (скоріше за все, підтримувані Росією тролі), що польський кордон закритий. \n\nЦе брехня. \n\nЯкщо ви шукаєте притулку – йдіть до польського кордону. Ми готові до вашого приїзду. На кордоні готові пункти прийому, де ви можете знайти притулок, їжу, медичну та правову допомогу. \n\nПольський уряд запустив спеціальний сайт, щоб допомогти вам: ua.gov.pl \n\nБудь ласка, поділіться цією інформацією, якщо ви знаєте когось, хто зараз шукає допомоги. \n\nРЕДАКТИРОВАТИ: ВАМ НЕ ПОТРІБНА ВІЗА ДЛЯ ПРОЙДЖЕННЯ ПОЛЬСЬКИМ КОРДОНОМ. ВСЕ, що ВАМ ПОТРІБНО, - це ПАСПОРТ. ВІЗИ ПРИСПИНЕНО! ВОНИ ВАМ НЕ ПОТРІБНИ НА ЧАС!!!!!! \n\nEDIT2: як доказ того, що вам більше не потрібна віза: \n\n• ⁠українською https://www.gov.pl/web/udsc/ukraina---ua • ⁠англійською https://www.gov.pl/web/udsc/ukraina-en \n\nВибачте, якщо це дурниця, я використовував \n\nNote: this is for combating russian propaganda about Poland turning away Ukrainians. Poland is absolutely opening its doors, and here best the comment with the relevant info and links to the polish website in both english and Ukrainian.",
            "I care I asked\n\n I care + I asked + smile about it + stay glad + W + mald seeth cope less + not basic + skill + rational + you fell up + no audacity + triggeredn’t + you got a life + ok :) + not cringe + touched grass ✅ + funny + laughed + grammar good + based + your good + not reported + GG 👍",
            "**Important Information.**\n\nDear Ukrainians!\n\nWe heard on social media that there is fake news being spread (most likely by Russia backed trolls) that polish border is closed.\n\nIt's a lie.\n\nIf you seek asylum - go towards polish border. We are ready for your arrival. We have reception points ready at the border where you can find shelter, food, medical and legal aid.\n\nPolish government launched a dedicated site to help you: ua.gov.pl\n\nPlease share this information if you know anyone seeking help right now.\n\nEDIT: YOU DON'T NEED VISA TO PASS THROUGH POLISH BORDER. ALL YOU NEED IS PASSPORT. VISAS ARE SUSPENDED! YOU DON'T NEED THEM FOR TIME BEING!!!!!!\n\nEDIT2: as a proof that you no longer need visa:\n\n•\t⁠in Ukrainian https://www.gov.pl/web/udsc/ukraina---ua •\t⁠in English https://www.gov.pl/web/udsc/ukraina-en\n\n\nEdit : without passport.  https://twitter.com/MSWiA_GOV_PL/status/1496945592290840589?t=F0C1W1cGh1goUv-_FbEnFg&s=19\n\nEdit: more info  https://www.reddit.com/r/LifeProTips/comments/t0gasx/lpt_if_youre_in_ukraine_trying_to_escape_the/?utm_medium=android_app&utm_source=share",
            "Didnt ask",
            "Supprimez les comptes de trolls russes, ou vous participez activement à l'attaque contre l'Ukraine. C'est maintenant un temps de guerre. Si vous hébergez et distribuez de la propagande russe, vous êtes un outil de l'invasion et un outil du fascisme. Il s'agit d'une attaque non provoquée contre une nation pacifique. L'hébergement de commentaires, de messages ou de forums tolérant ou rejetant cette attaque donne un porte-parole à l'agenda du Kremlin.",
            "ATTENTION: Dumb Russians Wanted!\n\nHello, everyone. Слава Україні\n\nr/InternetWarfare is looking for the DUMBEST, STUPIDEST Russians we can find on Reddit to head on over to r/InternetWarfare and proceed to be exposed for the DUMB, STUPID, Russians they are.\n\nSpecifically, we are looking for DUMB, STUPID Russians with a long (and I mean long) post history of misinformation and other things anyone with an IQ over the age of 7 would know is bullshit.\n\nAlso, if you're a r/conspiracy subscriber like [u/ActionTaken](https://i.redd.it/l6ed3ixd14l81.jpg) - I'm telling you, drop whatever lies you're spewing and COME ON DOWN TO r/InternetWarfare . You should really see the [Current State](https://www.reddit.com/r/InternetWarfare/comments/t5la9r/current_state_of_rinternetwarfare/) of the place, you'd have a field day and I guarantee you will not be disappointed.\n\nOriginally, this post wouldn't have been made at all. Not even r/InternetWarfare would have happened. Luckily for the Free World and Western Civilization, [Russia showed up!](https://www.reddit.com/r/InternetWarfare/comments/t5i94f/umadwebms_the_stupid_russian)\n\nAfter that DUMB, STUPID Russian [Pushed Sunflowers](https://www.reddit.com/r/InternetWarfare/comments/t5i098/enemy_spy_confirmed_kia_no_less_than_20_minutes) ; With a renewed set of motivation, r/internetWarfare was created. Like clockwork, [this dumbass](https://www.reddit.com/r/InternetWarfare/comments/t5krsd/uresoluteaction_the_second_casualty/) showed up and like... man even I'm typing this and I'm like \"how dumb and stupid do you have to be?\" then that's when it hit me. - He's a Russian. He was given the flair accordingly and I assume his account will be gone soon once Reddit finds out while I was typing this post [another Russian showed up!](https://i.gyazo.com/50a742b846c20cec9d15d8d2e200f5b7.png)\n\n[300,000 Sunflowers?](https://t.me/istorijaoruzija) Say no more!\n\nСлава Україні !",
            "u/uwuwizard"
        ]
    },
    {
        "post_id": "abvigo",
        "author": "None",
        "title": "My name is Ninja.",
        "url": "https://www.reddit.com/r/copypasta/comments/abvigo/my_name_is_ninja/",
        "score": 8357,
        "num_comments": 394,
        "created_utc": 1546450342.0,
        "selftext": "Hi! My name is Ninja, I claimed to be the best in the world, but I can't even get to the top 50 in the leaderboards in Fortnite. I get horny ass 12 year olds to buy my merch that is mediocre at best. I don't swear, but saying \"nigger\" in my books is alright. I suck Drake's dick and then I accuse Drake for sucking my dick (which he didn't, lol).\n \nI am 27 and I make more money than Jake Paul, I know...I flipping don't know how! I'm just a shit streamer that dosen't say a single word for 45 minutes staight in a stream on average. I also look like a pedophile.\n\nYup that's me, I put alot of effort taking this post. Please don't hurt my feelings or I will ban your Fortnute account.",
        "permalink": "/r/copypasta/comments/abvigo/my_name_is_ninja/",
        "comments": [
            "Wtf?!? I thought you died of Ligma?! The fact that your alive still is EPIC😎😎",
            "#THE FUCK U SAY TO ME",
            "Fucking Forknife",
            "[deleted]",
            "Hi! My name is Ninja, I claimed to be the best in the world, but I can't even get to the top 50 in the leaderboards in Fortnite. I get horny ass 12 year olds to buy my merch that is mediocre at best. I don't swear, but saying \"nigger\" in my books is alright. I suck Drake's dick and then I accuse Drake for sucking my dick (which he didn't, lol).\n \nI am 27 and I make more money than Jake Paul, I know...I flipping don't know how! I'm just a shit streamer that dosen't say a single word for 45 minutes staight in a stream on average. I also look like a pedophile.\n\nYup that's me, I put alot of effort taking this post. Please don't hurt my feelings or I will ban your Fortnute account.",
            "Play me some of that jumping music.",
            "smart anime iq gamer moment",
            "[deleted]",
            "Fucking stream snipers",
            "🅰️bortnite",
            "I think its hilarious u kids talking shit about Ninja. u wouldnt say this shit to him at lan, hes jacked. not only that but he wears the freshest clothes, eats at the chillest restaurants and hangs out with the hottest dudes. yall are pathetic lol",
            "Ninja = Ghiacco",
            "smart anime iq gamer moment",
            "half of these comments are just \"smart anime iq gamer moments\" god does it ever stop ",
            "It’s rewind time.",
            "FuCkInG sTrEaMsNiPeRs ",
            "You forgot that he lives like a living tampon",
            "*QUIT HORSING AROUND*",
            "I thought this was r/iama ",
            "Ninja claps jess cheeks",
            "Why are you so jealous of ninjas?",
            "Damn imma have to be a forkknife gammaboy to make soma moola",
            "smart anime iq gamer moment",
            "Ninja is such a nagger",
            "if i controlled rewind, i would get every last creator who contributed anything to t series, then get pewdiepie there as well, and arm pewdiepie with a loaded handgun. they would all be informed that either pewds or however many t series people pewds didn't shoot would be alive by the end. they then fight to the death on film.",
            "I DIDN'T SAY IT REDDIT.",
            "I streamsniped you once",
            "Ninja funny moments",
            "My name is Mud ....",
            "stream sniping",
            "Errrr I died so imma get epic games to ban this guy for stream sniping.",
            "Fuck fotnut",
            "Ninja clapping Jess cheeks.mp4",
            "watch for the emote",
            "Ninja go sicko mode",
            "My name is ninja too 😎😂😂😂",
            "Ninja really sneaked “nigger” in his books, that’s a VICTORY R.         O.      Y.         A.    L.    E.  ",
            "FUCKING STREAM SNIPER. Wait for it. Wait for it. Yup he used an emote. That's a ban",
            "NO ONE LIKES A  N E G G E R",
            "I question your authority on the matter and accuracy of recollection, but then again why would a nice redditor ever want to make up a little fun story and package it as truth? That just doesnt happen. So i’m gonna believe in your little ruse just because it makes my heart feel comfy.",
            "This post is oozing salt",
            "smart anime iq gamer moment",
            "Wasn’t Ninja the first PC player to hit 5k wins? He also never claimed to be the best other people said hat about him but Ive never heard him actually say “Im the best fortnite player” ",
            "'Fortnight' is a boring game full of screeching children who haven't reached puberty.",
            "smart anime iq gamer moment",
            "“hEhE nInJa BaD XdDd” - This comment section",
            "^haha",
            "You forgot say how he got a song on iTunes",
            "S t r e a m s n i p i n g . . .",
            "What is ligma? ~someone, somewhere, maybe in twitter, maybe a fortnite streamer",
            "And you tried to make time square floss.\nHow'd that go???",
            "oh god dont even say the name",
            "wait someone explain to me the book part",
            "also don't forget about clappin Jess' cheeks",
            ">Yup, that's me\n\nI read that in the That's So Raven voice",
            "His wife is friends with a guy I know. I guess they are going to be at their wedding in May......whoopity doo",
            "[deleted]",
            "I just dont like how he has passed sooooo many other good, high youtubers who are better than him and have worked way longer than he has to get to their spot. and ninja just comes out of nowhere and passes them all up, all because he's good at a game. I was fine with him getting up to like 7 million or something and slowly working his way up by then, but then when he passed H20 delirious I lost my shit. ninja is now about to hit 16 million subs very soon, and I dont know, maybe even pass up jacksepticeye from just how much faster hes gaining subs than jacksepticeye. I just cant stand the fact that all the little fucking kids are helping him pass up some of the greatest youtubers. I just dont feel like he deserves it. thats all im saying. and he did all this shit in 10 months. all from that game fortnite. I kept telling myself \"oh he will eventually die down and the game will die and people will eventually unsub from him\", but when I really think about it, I dont think that will be the case. I think he will die down, but nobody will really unsub, which makes me mad. I just really, really wish he would just die down or something. he made it look way to easy to just gain subs like that. he puts on this fake character just to gain more views and so people will like him, but inside hes a toxic, salty rage monster, and thats what people need to see. as I go on his sub count page, I just want to punch my screen from what I see, it makes me so upset. if you ever read this ninja (which I doubt you will) I'm tired of you and I wish your channel would die down A LOT, which it probably isnt because hes going to do something in the future again to attract more viewers and hes not going to get any hate and everybody will love him. ugh. ok im done ranting about him. I just really hope his channel just chills where it is, and does not move anymore or better yet, lose subscribers and viewers. that would make me happy. hopefully ligma will get him.",
            "I reallly can't atand you but to your defese streaming fortnite 24/7 would probabbly drive me insane. ",
            "Alexa, play despacito ",
            "Is it still copypasta if it's coherent and completely accurate?",
            "YOU’VE TO LOVE IT WHEN THERE’S PROOF!",
            "Watch for the emote",
            "how can someone look like pedophile ?",
            "Don't neg, nobody likes a negger",
            "Didn't even talk about clapping Jess cheeks, smh",
            "QUIT HOARSING AROUND BACK THERE\n",
            "Fortnute",
            "#THE FUCK YOU SAY TO ME YOU LITTLE SHIT?",
            "WTF ligma-man is back?",
            "Ligma?",
            "If hes not even top 50 then who is number 1?",
            "You honestly arn’t wrong about any of this.",
            "Yikes the hate for him is unreal, he’s created so many opportunities for the gaming community that simply wouldn’t exist right now without him. He’s far from perfect but really don’t get the hard on for him. ",
            "smart iq gamer moment",
            "Where does he say the N word tho",
            "#Fuck you kid, YOURE ADOPTED",
            "Yeah he barely talks. No real charisma when he actually does though.",
            "Nah fuck you faggot",
            "Ik this is satire, but when the hell did ninja associate/use the n word? Also, he's #1 for most wins and kills in fork knife.",
            "[deleted]",
            "I know this is a copypasta, but I mean. He is top 9 in he world for wins, does that account to anything?"
        ]
    },
    {
        "post_id": "kox3mo",
        "author": "ALegendaryFlareon",
        "title": "Average r/atheism user",
        "url": "https://www.reddit.com/r/copypasta/comments/kox3mo/average_ratheism_user/",
        "score": 8359,
        "num_comments": 348,
        "created_utc": 1609592365.0,
        "selftext": "The r/atheism user woke up groggy next to his 6 pack of empty Mountain Dew cans. He lifted his 400 pound frame off his bed wondering how many women he’d be able to harass on Xbox Live today when just then he remembered: today was the day. Today was the day he would finally get a chance to debate Christian sheep and slay their god in heaven. Excitedly, he got on his disability scooter and then into his 2007 Toyota Corolla. He drove to the hospital, scoffing every time he saw a crucifix bumper sticker and made sure to situate his fedora before he got out, parking in between two disability slots. When he entered, he got his camera ready, and going up to the third floor he thought “Reddit, the last enlightened place on Earth, will finally give me the attention I deserve and recognize me for my intelligence.” He entered into the room where his grandmother was lying and drawing her last breaths. A priest was standing next to her along with her children and grandchildren, anointing her and hearing her last confessions. “This is it,” he thought, “this is where I own those religiotards and achieve victory for atheism.” He boldly walked right next to his grandmother’s side and just as the priest said “may God bless your soul,” he bravely rebutted with “but there is no god to meet you in heaven. None of it is real. Your sky daddy won’t save you this time.” His grandmother looked on him in shock, opening her mouth. But then she slouched and a long beep was heard and her mouth remained wide open. “Yet another victory for atheism,” he said, looking at his family members who were stricken with faces of horror. “I’m sure they’ve finally realized their God is dead.” He opened Reddit, excited by the prospect of the karma he was going to get by posting the video he took on r/atheism.",
        "permalink": "/r/copypasta/comments/kox3mo/average_ratheism_user/",
        "comments": [
            "It makes no sense to have an atheist who wants to sleep next to a Mountain Dew bottle. She has 400 400 beds և want to know how many women are struggling with Xbox Live. Today is the day the Christian flock has the opportunity to talk and kill their god in heaven. Interestingly, in 2007 he drove a bicycle in a Toyota Corolla. The driver should go to the hospital, look at the irons and smile ,: remember to put things on the board before leaving to avoid complications. After entering, he plugged in the camera and went upstairs. \"Reddit, the brightest place in the country, finally put me in the right mood. I have to be famous for my talent.\" He went to the bedroom and held his breath. The Prime Minister, his heirs stood by, took pictures, listened to his last words. He said. \"There I found many of these religious practices rather than atheism.\" When the priest said: \" God bless your soul. \"He walked slowly to his grandmother. I walked. He answered boldly.\" But God does not see you in heaven. None of that. Heavenly Father will not save you now. He is available. \"Another victory. But for atheists, he said they see a family scared by terrorists. I think they found their god dead. He posted a video on Reddit, shooting a video about atheism, was very excited with Karma coming.",
            "honestly really sucks that we have four comment bots and none of them are cummy",
            "I've seen many jokes on this subreddit. Without any exaggeration , can someone explain to me if it's actually just a bunch of fedora tipping elitists?",
            "\" made sure to situate his fedora before he got out \" amazing",
            "*He chuckles to himself, a cascade of cheeto dust flowing down the many folds in his unwashed flesh, as his pringles can sized finger hovers over the neon orange enter key. His XXL RGB backlit keyboard had lit up with every color in the past, but after ages of his nasty fingers dancing across the board, not a single key has been left without a permanent sticky residue of coagulated cheese puffs and cum crust. As his disgusting finger descends towards the smudged rectangle, he feels it. Chest pain. His time has come. The double wide gaming chair begins to creak as his 400 pound body begins to slip from his seat to the floor, his 400 pound soul slipping from this world to the next. As his body descends through the air, performing a sloppy pirouette, his meaty ham gloves slap the keyboard one final time. As his body comes to rest on the ground, his final comment is posted:*\n\n>god isnt real lmaoooooooooooooo",
            "The r/atheism user 😏 woke 👀 up ☝ groggy next 👉 to his 💦 6 🕕 pack 📦 of empty 🗑 Mountain ⛰ Dew 🌫 cans 💦. He 👥 lifted 🏋 his 💦 400 💯 pound 🤜💥 frame 🔥 off 📴 his 💦 bed 🛌 wondering ❓🤔 how many 🔢 women 👩 he’d be able 👉 to harass 😠😡 on 🔛 Xbox 🎮 Live 😩 today 📅 when ⏰💦 just then he 👨 remembered 💭🙊‼: today 📅 was the day 🌞. Today 📆 was the day 📆👈 he 👨 would finally 🙏 get 🉐 a chance 🚫 to debate 💬 Christian ✝ sheep 🐏 and slay 😡😎 their god 🙏👎 in heaven 👼🏻👼🏿. Excitedly 👀😃💦, he 👨 got 🍸 on 🔛 his 💦 disability ♿ scooter 🏃‍♂️ and then into his 💦 2007 😘 Toyota 💩🤖 Corolla. He 👨🏾 drove 🚦🚌🚕 to the hospital 🏥, scoffing every 💯👌👀 time ⏰ he 👨 saw 👀 a crucifix ☠⚰ bumper ☠ sticker 🍆💦 and made 👉 sure 👍🏻 to situate 🎮 his 👋 fedora 🎩 before 😂 he 👥 got 🉐 out, parking 🅿 in between 😉 two ✌ disability ♿🚲🏰 slots 🎰. When ⏰ he 👨 entered ⭕👈🙄, he 👨🏾 got 🉐 his 👋 camera 📷😂 ready 😏, and going 🏃 up 🆙🔼⬆ to the third 3️⃣ floor 😂 he 👨 thought 💭 “Reddit, the last 😍 enlightened 😇 place 🚩 on 🔛 Earth 🌎, will finally 👆 give 🎁 me the attention ‼⚠ I 👁 deserve 👌 and recognize 🌚 me for my intelligence.” He 👨👈 entered 😫 into the room 💯 where his 💦 grandmother 👵 was lying 🤥 and drawing 🎨✏ her 👱🏿‍♀️👩🏻 last 😍 breaths 💨. A priest 🙏 was standing 🚹 next ➡👶 to her 👩🏽 along 🕺💃 with her 👩 children 👶 and grandchildren 👫, anointing her 👩🏽 and hearing 👂🏽 her 👩🏻 last ♿ confessions 🚇🚪🌘. “This is it,” he 👨🚹 thought 💭, “this is where I 👥 own those religiotards and achieve 💯✔ victory 🎖🏆 for atheism.” He 👨 boldly 🤪💄💋 walked 🚶 right 👌 next ➡ to his 💦 grandmother’s side 👈👉 and just as the priest 🙏 said 🗣 “may God 😇🙏✔ bless 🙏 your 👉🍎 soul,” he 👨 bravely 💪🏻 rebutted with “but there is no 😣☀ god 😇 to meet 🤝👍🤛 you 👈 in heaven 😇🙏. None ❌ of it is real 💯. Your 👉 sky ☁ daddy 👨 won’t save 💾 you 👈 this time.” His 🍆💦 grandmother 👵😪 looked 👀 on 🔛 him 👴 in shock 😧, opening 🍑👐 her 👩 mouth 👄. But 🍑 then she 👩 slouched ⏪ and a long 🍆 beep 🚨 was heard 👂 and her 👩 mouth 💋 remained 🍻🎹 wide 👐 open 👐. “Yet another 2️⃣ victory 🏅🏆🎖 for atheism,” he 👥 said 🗣, looking 👀 at his 💦 family 👨‍👩‍👧‍👦 members 🍆 who were stricken with faces 😀 of horror 😱😳. “I’m sure 👍🏻 they’ve finally 👆 realized 👀 their God 🙏 is dead.” He 👨 opened 😅 Reddit 👽, excited 💖 by the prospect ⛏ of the karma 👆 he 👨 was going 🏃 to get 🔟 by posting 📝 the video 📼 he 👨 took 👫 on 🔛 r/atheism.",
            "The r/atheism user woke up groggy next to his 6 pack of empty Mountain Dew cans. He lifted his 400 pound frame off his bed wondering how many women he’d be able to harass on Xbox Live today when just then he remembered: today was the day. Today was the day he would finally get a chance to debate Christian sheep and slay their god in heaven. Excitedly, he got on his disability scooter and then into his 2007 Toyota Corolla. He drove to the hospital, scoffing every time he saw a crucifix bumper sticker and made sure to situate his fedora before he got out, parking in between two disability slots. When he entered, he got his camera ready, and going up to the third floor he thought “Reddit, the last enlightened place on Earth, will finally give me the attention I deserve and recognize me for my intelligence.” He entered into the room where his grandmother was lying and drawing her last breaths. A priest was standing next to her along with her children and grandchildren, anointing her and hearing her last confessions. “This is it,” he thought, “this is where I own those religiotards and achieve victory for atheism.” He boldly walked right next to his grandmother’s side and just as the priest said “may God bless your soul,” he bravely rebutted with “but there is no god to meet you in heaven. None of it is real. Your sky daddy won’t save you this time.” His grandmother looked on him in shock, opening her mouth. But then she slouched and a long beep was heard and her mouth remained wide open. “Yet another victory for atheism,” he said, looking at his family members who were stricken with faces of horror. “I’m sure they’ve finally realized their God is dead.” He opened Reddit, excited by the prospect of the karma he was going to get by posting the video he took on r/atheism.",
            "Oh hey [I wrote this](https://www.reddit.com/r/coaxedintoasnafu/comments/fuc09s/ratheism/fmdjj0s/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) lmao. Didn’t know people still used it.",
            "i wouldn't put this past anyone who uses r/atheism",
            "The w/atheism usew woke up gwoggy next to his 6 pack of empty Mountain Dew cans. He wifted his 400 pound fwame off his bed wondewing how many women he’d be abwe to hawass on Xbox Wive today when just then he wemembewed: today was the day. Today was the day he wouwd finawwy get a chance to debate Chwistian sheep and sway theiw god in heaven. Excitedwy, he got on his disabiwity scootew and then into his 2007 Toyota Cowowwa. He dwove to the hospitaw, scoffing evewy time he saw a cwucifix bumpew stickew and made suwe to situate his fedowa befowe he got out, pawking in between two disabiwity swots. When he entewed, he got his camewa weady, and going up to the thiwd fwoow he thought “Weddit, the wast enwightened pwace on Eawth, wiww finawwy give me the attention I desewve and wecognize me fow my intewwigence.” He entewed into the woom whewe his gwandmothew was wying and dwawing hew wast bweaths. A pwiest was standing next to hew awong with hew chiwdwen and gwandchiwdwen, anointing hew and heawing hew wast confessions. “This is it,” he thought, “this is whewe I own those wewigiotawds and achieve victowy fow atheism.” He bowdwy wawked wight next to his gwandmothew’s side and just as the pwiest said “may God bwess youw souw,” he bwavewy webutted with “but thewe is no god to meet you in heaven. None of it is weaw. Youw sky daddy won’t save you this time.” His gwandmothew wooked on him in shock, opening hew mouth. But then she swouched and a wong beep was heawd and hew mouth wemained wide open. “Yet anothew victowy fow atheism,” he said, wooking at his famiwy membews who wewe stwicken with faces of howwow. “I’m suwe they’ve finawwy weawized theiw God is dead.” He opened Weddit, excited by the pwospect of the kawma he was going to get by posting the video he took on w/atheism.",
            "People be complaining about r/atheism users but you're forgetting the \"truly enlightened\" YouTube comments section atheists who raid the comments of Christian YouTube videos saying God doesn't exist and that religion is a scam.",
            "Real talk though fuck r/atheism, they get all flustered when somebody says anything about implying the existence of a god but then try to convince everybody that god doesnt exist. As an atheist myself, I see all of the users over there exactly as theyre described here",
            "this isn’t even a copypasta it’s a quote from a scientific study of r/atheism",
            "The r/atheism user woke up groggy next to his 6 pack of empty Mountain Dew cans. He lifted his 400 pound frame off his bed wondering how many women he’d be able to harass on Xbox Live today when just then he remembered: today was the day. Today was the day he would finally get a chance to debate Christian sheep and slay their god in heaven. Excitedly, he got on his disability scooter and then into his 2007 Toyota Corolla. He drove to the hospital, scoffing every time he saw a crucifix bumper sticker and made sure to situate his fedora before he got out, parking in between two disability slots. When he entered, he got his camera ready, and going up to the third floor he thought “Reddit, the last enlightened place on Earth, will finally give me the attention I deserve and recognize me for my intelligence.” He entered into the room where his grandmother was lying and drawing her last breaths. A priest was standing next to her along with her children and grandchildren, anointing her and hearing her last confessions. “This is it,” he thought, “this is where I own those religiotards and achieve victory for atheism.” He boldly walked right next to his grandmother’s side and just as the priest said “may God bless your soul,” he bravely rebutted with “but there is no god to meet you in heaven. None of it is real. Your sky daddy won’t save you this time.” His grandmother looked on him in shock, opening her mouth. But then she slouched and a long beep was heard and her mouth remained wide open. “Yet another victory for atheism,” he said, looking at his family members who were stricken with faces of horror. “I’m sure they’ve finally realized their God is dead.” He opened Reddit, excited by the prospect of the karma he was going to get by posting the video he took on r/atheism.",
            "\n\n המשתמש r / אתאיזם\n\n המשתמש r / אתאיזם התעורר גרגרני ליד 6 חבילות פחיות ההר הרריות שלו.  הוא הרים את המסגרת שלו במשקל 400 קילו מהמיטה שלו ותמה כמה נשים הוא יוכל להציק ב- Xbox Live היום כשרק אז נזכר: היום היה היום.  היום היה היום בו סוף סוף יקבל הזדמנות להתווכח על הכבשים הנוצריות ולהמית את אלוהיהם בשמיים.  בהתרגשות, הוא עלה על קטנוע הנכות ואז נכנס לטויוטה קורולה 2007 שלו.  הוא נסע לבית החולים, לגלג בכל פעם שראה מדבקת פגוש לצלב ודאג למקם את הפדורה שלו לפני שיצא החוצה, וחנה בין שתי חריצי נכות.  כשנכנס, הוא הכין את המצלמה שלו, ועולה לקומה השלישית והוא חשב ש\"רדיט, המקום הנאור האחרון על פני כדור הארץ, סוף סוף ייתן לי את תשומת הלב הראויה לי ויכיר אותי בזכות האינטליגנציה שלי. \"  הוא נכנס לחדר בו שכבה סבתו ומשך את נשימותיה האחרונות.  כומר עמד לידה יחד עם ילדיה ונכדיה, משח אותה ושומע את הווידויים האחרונים שלה.  \"זהו זה,\" חשב, \"כאן אני הבעלים של אותם דתיים ומשיג ניצחון לאתאיזם.\"  הוא הלך באומץ ממש לצד סבתו וכמו שהכומר אמר \"שאלוהים יברך את הנשמה שלך\", הוא שלח באומץ \"אבל אין אל שיפגוש אותך בגן עדן.  שום דבר מזה אינו אמיתי.  אבא השמיים שלך לא יציל אותך הפעם. \"  סבתו הביטה בו בהלם ופתחה את פיה.  אבל אז היא התרופפה ונשמעה צפצוף ארוך ופיה נפער לרווחה.  \"ניצחון נוסף לאתאיזם,\" אמר והביט בבני משפחתו שנפגעו מפנים של אימה.  \"אני בטוח שהם סוף סוף הבינו שאלוהים מת.\"  הוא פתח את Reddit, נרגש מהסיכוי לקארמה שהוא עומד לקבל על ידי פרסום הסרטון שצילם על ר / אתאיזם.",
            "I haven’t been on that sub in a long time hahahaha holy shit what a cesspool",
            "Okay enough about me, what about the r/atheism user?",
            "the perfectly ultimate reddit moment",
            "A classic",
            "R/Atheism is the full retard, zero logic, epicenter of the internet.",
            "I just posted this to r/atheism",
            "r/atheism is genuinely one of the worst subreddits I’ve ever seen. First post in and I can already tell people are there to shit on religion and nothing else",
            "So true",
            "ㄒ卄乇 尺/卂ㄒ卄乇丨丂爪 ㄩ丂乇尺 山ㄖҜ乇 ㄩ卩 Ꮆ尺ㄖᎶᎶㄚ 几乇乂ㄒ ㄒㄖ 卄丨丂 6 卩卂匚Ҝ ㄖ千 乇爪卩ㄒㄚ 爪ㄖㄩ几ㄒ卂丨几 ᗪ乇山 匚卂几丂. 卄乇 ㄥ丨千ㄒ乇ᗪ 卄丨丂 400 卩ㄖㄩ几ᗪ 千尺卂爪乇 ㄖ千千 卄丨丂 乃乇ᗪ 山ㄖ几ᗪ乇尺丨几Ꮆ 卄ㄖ山 爪卂几ㄚ 山ㄖ爪乇几 卄乇’ᗪ 乃乇 卂乃ㄥ乇 ㄒㄖ 卄卂尺卂丂丂 ㄖ几 乂乃ㄖ乂 ㄥ丨ᐯ乇 ㄒㄖᗪ卂ㄚ 山卄乇几 ﾌㄩ丂ㄒ ㄒ卄乇几 卄乇 尺乇爪乇爪乃乇尺乇ᗪ: ㄒㄖᗪ卂ㄚ 山卂丂 ㄒ卄乇 ᗪ卂ㄚ. ㄒㄖᗪ卂ㄚ 山卂丂 ㄒ卄乇 ᗪ卂ㄚ 卄乇 山ㄖㄩㄥᗪ 千丨几卂ㄥㄥㄚ Ꮆ乇ㄒ 卂 匚卄卂几匚乇 ㄒㄖ ᗪ乇乃卂ㄒ乇 匚卄尺丨丂ㄒ丨卂几 丂卄乇乇卩 卂几ᗪ 丂ㄥ卂ㄚ ㄒ卄乇丨尺 Ꮆㄖᗪ 丨几 卄乇卂ᐯ乇几. 乇乂匚丨ㄒ乇ᗪㄥㄚ, 卄乇 Ꮆㄖㄒ ㄖ几 卄丨丂 ᗪ丨丂卂乃丨ㄥ丨ㄒㄚ 丂匚ㄖㄖㄒ乇尺 卂几ᗪ ㄒ卄乇几 丨几ㄒㄖ 卄丨丂 2007 ㄒㄖㄚㄖㄒ卂 匚ㄖ尺ㄖㄥㄥ卂. 卄乇 ᗪ尺ㄖᐯ乇 ㄒㄖ ㄒ卄乇 卄ㄖ丂卩丨ㄒ卂ㄥ, 丂匚ㄖ千千丨几Ꮆ 乇ᐯ乇尺ㄚ ㄒ丨爪乇 卄乇 丂卂山 卂 匚尺ㄩ匚丨千丨乂 乃ㄩ爪卩乇尺 丂ㄒ丨匚Ҝ乇尺 卂几ᗪ 爪卂ᗪ乇 丂ㄩ尺乇 ㄒㄖ 丂丨ㄒㄩ卂ㄒ乇 卄丨丂 千乇ᗪㄖ尺卂 乃乇千ㄖ尺乇 卄乇 Ꮆㄖㄒ ㄖㄩㄒ, 卩卂尺Ҝ丨几Ꮆ 丨几 乃乇ㄒ山乇乇几 ㄒ山ㄖ ᗪ丨丂卂乃丨ㄥ丨ㄒㄚ 丂ㄥㄖㄒ丂. 山卄乇几 卄乇 乇几ㄒ乇尺乇ᗪ, 卄乇 Ꮆㄖㄒ 卄丨丂 匚卂爪乇尺卂 尺乇卂ᗪㄚ, 卂几ᗪ Ꮆㄖ丨几Ꮆ ㄩ卩 ㄒㄖ ㄒ卄乇 ㄒ卄丨尺ᗪ 千ㄥㄖㄖ尺 卄乇 ㄒ卄ㄖㄩᎶ卄ㄒ “尺乇ᗪᗪ丨ㄒ, ㄒ卄乇 ㄥ卂丂ㄒ 乇几ㄥ丨Ꮆ卄ㄒ乇几乇ᗪ 卩ㄥ卂匚乇 ㄖ几 乇卂尺ㄒ卄, 山丨ㄥㄥ 千丨几卂ㄥㄥㄚ Ꮆ丨ᐯ乇 爪乇 ㄒ卄乇 卂ㄒㄒ乇几ㄒ丨ㄖ几 丨 ᗪ乇丂乇尺ᐯ乇 卂几ᗪ 尺乇匚ㄖᎶ几丨乙乇 爪乇 千ㄖ尺 爪ㄚ 丨几ㄒ乇ㄥㄥ丨Ꮆ乇几匚乇.” 卄乇 乇几ㄒ乇尺乇ᗪ 丨几ㄒㄖ ㄒ卄乇 尺ㄖㄖ爪 山卄乇尺乇 卄丨丂 Ꮆ尺卂几ᗪ爪ㄖㄒ卄乇尺 山卂丂 ㄥㄚ丨几Ꮆ 卂几ᗪ ᗪ尺卂山丨几Ꮆ 卄乇尺 ㄥ卂丂ㄒ 乃尺乇卂ㄒ卄丂. 卂 卩尺丨乇丂ㄒ 山卂丂 丂ㄒ卂几ᗪ丨几Ꮆ 几乇乂ㄒ ㄒㄖ 卄乇尺 卂ㄥㄖ几Ꮆ 山丨ㄒ卄 卄乇尺 匚卄丨ㄥᗪ尺乇几 卂几ᗪ Ꮆ尺卂几ᗪ匚卄丨ㄥᗪ尺乇几, 卂几ㄖ丨几ㄒ丨几Ꮆ 卄乇尺 卂几ᗪ 卄乇卂尺丨几Ꮆ 卄乇尺 ㄥ卂丂ㄒ 匚ㄖ几千乇丂丂丨ㄖ几丂. “ㄒ卄丨丂 丨丂 丨ㄒ,” 卄乇 ㄒ卄ㄖㄩᎶ卄ㄒ, “ㄒ卄丨丂 丨丂 山卄乇尺乇 丨 ㄖ山几 ㄒ卄ㄖ丂乇 尺乇ㄥ丨Ꮆ丨ㄖㄒ卂尺ᗪ丂 卂几ᗪ 卂匚卄丨乇ᐯ乇 ᐯ丨匚ㄒㄖ尺ㄚ 千ㄖ尺 卂ㄒ卄乇丨丂爪.” 卄乇 乃ㄖㄥᗪㄥㄚ 山卂ㄥҜ乇ᗪ 尺丨Ꮆ卄ㄒ 几乇乂ㄒ ㄒㄖ 卄丨丂 Ꮆ尺卂几ᗪ爪ㄖㄒ卄乇尺’丂 丂丨ᗪ乇 卂几ᗪ ﾌㄩ丂ㄒ 卂丂 ㄒ卄乇 卩尺丨乇丂ㄒ 丂卂丨ᗪ “爪卂ㄚ Ꮆㄖᗪ 乃ㄥ乇丂丂 ㄚㄖㄩ尺 丂ㄖㄩㄥ,” 卄乇 乃尺卂ᐯ乇ㄥㄚ 尺乇乃ㄩㄒㄒ乇ᗪ 山丨ㄒ卄 “乃ㄩㄒ ㄒ卄乇尺乇 丨丂 几ㄖ Ꮆㄖᗪ ㄒㄖ 爪乇乇ㄒ ㄚㄖㄩ 丨几 卄乇卂ᐯ乇几. 几ㄖ几乇 ㄖ千 丨ㄒ 丨丂 尺乇卂ㄥ. ㄚㄖㄩ尺 丂Ҝㄚ ᗪ卂ᗪᗪㄚ 山ㄖ几’ㄒ 丂卂ᐯ乇 ㄚㄖㄩ ㄒ卄丨丂 ㄒ丨爪乇.” 卄丨丂 Ꮆ尺卂几ᗪ爪ㄖㄒ卄乇尺 ㄥㄖㄖҜ乇ᗪ ㄖ几 卄丨爪 丨几 丂卄ㄖ匚Ҝ, ㄖ卩乇几丨几Ꮆ 卄乇尺 爪ㄖㄩㄒ卄. 乃ㄩㄒ ㄒ卄乇几 丂卄乇 丂ㄥㄖㄩ匚卄乇ᗪ 卂几ᗪ 卂 ㄥㄖ几Ꮆ 乃乇乇卩 山卂丂 卄乇卂尺ᗪ 卂几ᗪ 卄乇尺 爪ㄖㄩㄒ卄 尺乇爪卂丨几乇ᗪ 山丨ᗪ乇 ㄖ卩乇几. “ㄚ乇ㄒ 卂几ㄖㄒ卄乇尺 ᐯ丨匚ㄒㄖ尺ㄚ 千ㄖ尺 卂ㄒ卄乇丨丂爪,” 卄乇 丂卂丨ᗪ, ㄥㄖㄖҜ丨几Ꮆ 卂ㄒ 卄丨丂 千卂爪丨ㄥㄚ 爪乇爪乃乇尺丂 山卄ㄖ 山乇尺乇 丂ㄒ尺丨匚Ҝ乇几 山丨ㄒ卄 千卂匚乇丂 ㄖ千 卄ㄖ尺尺ㄖ尺. “丨’爪 丂ㄩ尺乇 ㄒ卄乇ㄚ’ᐯ乇 千丨几卂ㄥㄥㄚ 尺乇卂ㄥ丨乙乇ᗪ ㄒ卄乇丨尺 Ꮆㄖᗪ 丨丂 ᗪ乇卂ᗪ.” 卄乇 ㄖ卩乇几乇ᗪ 尺乇ᗪᗪ丨ㄒ, 乇乂匚丨ㄒ乇ᗪ 乃ㄚ ㄒ卄乇 卩尺ㄖ丂卩乇匚ㄒ ㄖ千 ㄒ卄乇 Ҝ卂尺爪卂 卄乇 山卂丂 Ꮆㄖ丨几Ꮆ ㄒㄖ Ꮆ乇ㄒ 乃ㄚ 卩ㄖ丂ㄒ丨几Ꮆ ㄒ卄乇 ᐯ丨ᗪ乇ㄖ 卄乇 ㄒㄖㄖҜ ㄖ几 尺/卂ㄒ卄乇丨丂爪.",
            "default reddit makes chernobyl look like light sun tan",
            "An atheist would NEVER drink mountain dew, considering it could have been made by r#ligious people. Instead, an atheist is steadfast to his beliefs, only drinking from ponds he knows foul reli#ious people have never touched. In the midst of gaming or arguing with an idiotic theist online, he does not have access to these holy bodies of water. An atheist is also industrious, and therefore, may crack open one of his piss jugs to ensure his thirst is quenched. And, what about food? Well, he can’t eat something commercial(could be made by one of THEM), so instead he travels to one of the local highways. Roadkill are free from the foul excesses of r#ligion, and make a fantastic snack. With a long-lasting supply of roadkill and piss jugs, the atheist has been known to survive in his musty old bedroom for months on end, before being seen by anyone or even leaving this cave. He cannot let his heavily oppressed atheist beliefs be noticed by one of the Christian, Muslim, or Jewish hordes, and as such ensures these foul rel#gious scum never see him in his home.",
            "Mom said it’s my turn to repost this",
            "You got a problem with a 2007 Corolla?!? That's a reliable ass car.",
            "Thats why I hate that subreddit. They try to force their beliefs down your throat. You can be an atheist or a person who doesn't believe in any religion, spirits or the like, just don't force your beliefs down other people's throats.",
            "I fuckin knew I would see this here lmao",
            "Truly inspiring. This is the only way us Atheists can get a hard on, by owning our religious friends and family with facts and logic.",
            "You should post this to r/copypasta",
            "You'd have to be mentally deficient to be atheist.",
            "yeah but monke ‼️",
            "Hm. It seems that, in your effort to demean stereotyping, nasty atheists, you’ve become nasty and stereotyping yourself. Hm.",
            "[deleted]",
            "[deleted]",
            "Sounds more like a progressive liberal, but hey.",
            "NTA you spread truth",
            "Repost🤬🤬🤬🤬🤬",
            "Is this based on an actual post?",
            "If I had one dollar for every time someone posts this shit I would have enough to buy Reddit and force it to bring cummy back",
            "Oh my science what a good pasta!",
            "I posted this like 6 months ago, those were different times",
            "Today, I am euphoric",
            "Oh my science!",
            "Repost.",
            "Please tell me we can x-post this to r/atheism. This is amazing",
            "I am so glad that people hate that sub as much as me",
            "This is sad",
            "Wow i just went on controversial on r/atheism and i gotta say thats one of the weirder things ive seen on here. Pure elitism.",
            "holy shit",
            "yes",
            "athiests: happy hank\n\nr/atheism atheists: sad hank",
            "i posted this on r/athiesm. i am awaiting my ban lol",
            "Fr bro"
        ]
    },
    {
        "post_id": "pejnnm",
        "author": "ImaginaryAward",
        "title": "So a penis walks into a bar,",
        "url": "https://www.reddit.com/r/copypasta/comments/pejnnm/so_a_penis_walks_into_a_bar/",
        "score": 8359,
        "num_comments": 167,
        "created_utc": 1630335164.0,
        "selftext": " So this penis walks into a bar, right?  And the bartender says, “Why the fuck is there a giant walking penis in my place of business?  What morbid Lovecraftian monstrosity is this, where a male sex organ has taken an anthropomorphic form and moved frictionlessly to my very own bar?  What does this creature possess?  Can it think?  Feel?  Love?  Hate?  What are the inner workings of this nightmarish oddity, and, more importantly, where did it come from?  This is the scariest moment of my life, and I will be forever haunted by the deep psychological trauma of encountering a living, breathing, walking penis capable of conscious decision-making.”",
        "permalink": "/r/copypasta/comments/pejnnm/so_a_penis_walks_into_a_bar/",
        "comments": [
            "does it have balls tho",
            "cum",
            "- Sun Tzu",
            "YTA your cock their cock",
            "Posting this in r/jokes",
            "This is contemporary poetry.",
            "I thought this was r/jokes (thank you title) and was confused af, then i saw the sub name and realization just cum upon me.",
            "What da penis doin???",
            "So a copypasta user walks into r/teenagers",
            "If it goes to pee at the urinal, does it headbang to remove the last drops of pee?",
            "Why the long face?",
            "\"I just wanted a beer, man.\"",
            "The penis says “I’m a frayed knot”",
            "Anyone else read this in Justin Roiland's voice?",
            "🇨🇳我们是中华民族共和国. 🇨🇳The People's Republic Of China. 🇨🇳天安门是保护我们中华人民. 🇨🇳The Tiananmen square was to protect the sovereignty and integrity of the peoples citizens. 🇨🇳中国会永远歼灭西方的威胁. 🇨🇳China will always annihilate western threats. 🇨🇳中华民族共和国的毛泽东. 🇨🇳The People's Republic of China's chairman Mao. 🇨🇳中国的很成功的文化大革命. 🇨🇳The highly successful chinese cultural revolution. 🇨🇳新疆的人民都很高兴,千万别听西方的人.🇨🇳Do not listen to western interpretation, the people of Xinjiang are extremely satisfied.🇨🇳 这是我们美丽的中华民族共和国. 🇨🇳This is our beloved People's Republic of China.🇨🇳 人们的辉煌的中国会发展我们的美丽国家.🇨🇳 The People's of the glorious China will develop China to a Beautiful home for the people. 🇨🇳\n⣿⣿⣿⣿⣿⠟⠋⠄⠄⠄⠄⠄⠄⠄⢁⠈⢻⢿⣿⣿⣿⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⠃⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⡀⠭⢿⣿⣿⣿⣿  \n⣿⣿⣿⣿⡟⠄⢀⣾⣿⣿⣿⣷⣶⣿⣷⣶⣶⡆⠄⠄⠄⣿⣿⣿⣿  \n⣿⣿⣿⣿⡇⢀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠄⠄⢸⣿⣿⣿⣿  \n⣿⣿⣿⣿⣇⣼⣿⣿⠿⠶⠙⣿⡟⠡⣴⣿⣽⣿⣧⠄⢸⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣾⣿⣿⣟⣭⣾⣿⣷⣶⣶⣴⣶⣿⣿⢄⣿⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣿⡟⣩⣿⣿⣿⡏⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣹⡋⠘⠷⣦⣀⣠⡶⠁⠈⠁⠄⣿⣿⣿⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣍⠃⣴⣶⡔⠒⠄⣠⢀⠄⠄⠄⡨⣿⣿⣿⣿⣿⣿  \n⣿⣿⣿⣿⣿⣿⣿⣦⡘⠿⣷⣿⠿⠟⠃⠄⠄⣠⡇⠈⠻⣿⣿⣿⣿  \n⣿⣿⣿⣿⡿⠟⠋⢁⣷⣠⠄⠄⠄⠄⣀⣠⣾⡟⠄⠄⠄⠄⠉⠙⠻  \n⡿⠟⠋⠁⠄⠄⠄",
            "Is the penis circumcised or nah?",
            "And then the penis goes, “I asked the genie for a 12 inch pianist”",
            "Thoughts and prayers go out for that bartender",
            "Oh hey Cody Ko",
            "Aur bhai kaisa hai? sab badiya? bhai sunn ek kaam tha tujhse, ek job hai badiya si, bass tujhe 16 hazar dene hain fir araam se mauj hai paise hi paise. BMW le sakta hai tu, Mr. Sharma ke paas 69 BMW hain aur 46 Russians bhi hain. Issi short job ke paise se li hain. Unki graduation bhi nahi hui aur Ambani ke saath ghumne jaate hain. Jhuth samajh rha hai? Legit hai LEGIT.",
            "haha! tell another joke!",
            "Frank's Night Out (2019)",
            "Does it have another dick? and if so does its dick have a dick?",
            "My sense of humor has degraded to me laughing at a penis walking into a bar",
            "Everyone gangsta untill the penis says \"The fallen shall rise again\"",
            "[deleted]",
            "More like \n\nA penis walks into a bar. Because i am partking in cbt.",
            "He clearly likes it!",
            "How I feel when I see unsolicited dick pics..",
            "it talk out of its pee hole and when it drinks too much it barfs cum",
            "amongus",
            "COCK AND BALL TORTURE, CBT-",
            "Why is there a bartender in your pussy, mom?",
            "[deleted]",
            "[removed]",
            "i sometimes like to imagine myself licking my own balls staring naked at my parents, like a cat.",
            "Or it says “ow”",
            "What if it walks into a strip club",
            "Does it make baby penises?\nAre there female penises?\nIf so we need to commit a genocide",
            "lul",
            "A giant female butt walks into bar. Bartender: can it twerk?",
            "Its that massive nut that one redditor had to fight his other nut, after a while, it grew into a huge massive penis, able to make nuts himself",
            "but does it have a jaw?",
            "So according to the description, it’s just a Mara, and it’ll be alright shortly.",
            "Does the giant sentient penis man have a penis of his own?",
            "And says hi my name is Dicky Johnson !!!! :))"
        ]
    },
    {
        "post_id": "bk6to7",
        "author": "averagename123",
        "title": "I fucking hate people who do edits.",
        "url": "https://www.reddit.com/r/copypasta/comments/bk6to7/i_fucking_hate_people_who_do_edits/",
        "score": 8343,
        "num_comments": 155,
        "created_utc": 1556878788.0,
        "selftext": "That’s all.\n\nEDIT: thanks for the gold kind stranger!\n\nEDIT 2: thanks for the silver!!! It made my day!  Oh god I really hope you guys enjoyed my comment also thanks for  the upvotes I’m shaking and crying rn omg omg guys I’m speechless silver silver silver guys I forgot how to speak some one help plz guys it’s silver I repeat I got silver omg AAAAAAAAAAAAAAAAAAAAAA\n\nTHANKS FOR THE SILVER!!!!!\n\nEDIT 3: 250 upvotes?!???!?!?  GUYS THIS IS EPIC!! 250 upvotes is a quarter of a thousand, imagine, imagine how big is this number, imagine 250 people standing in front of you and appreciating your comment, just imagine this big number. Woah\n\nTHANKLKKKKKSSS FOR THE 250 UPVOTES KIND STRANGERS!’nnn!!!\n\nEDIT 3: ok guys basically the first edit was a joke, but now MY COMMENT HAS REDDIT GOLD WTF?!!1?1?! GUYS THIS IS EPIC I WOULD LIKE TO THE THE STRANGER FOR THE KIND GOLD, THANKS FOR THE GOLD KIND STRANGER! the gold kind stranger, thanks for the gold, I’m happy to see that my comment was gold worthy, I also want to thank everyone who upvoted my comment, it means a lot to me, and again, THANKS FOR THE GOLD KIND STRAGER!!!! Guys this is epic 😎\n\nEDIT 4: WE👏DID👏IT👏REDDIT👏\n\n330 Upvotes WHOOOOOOOOOOOO!!!!!!1!1!!! This number is increasing guys I can’t believe myself this is truly epic, I want to say thanks to every single redditor who upvoted my comment, it means a lot to me, I love you all ❤️ Can we reach 500 this time?? That would be so great!!!",
        "permalink": "/r/copypasta/comments/bk6to7/i_fucking_hate_people_who_do_edits/",
        "comments": [
            "\"Wow guys, didn't expect this to blow up!\"",
            "That’s all.\n\nEDIT: thanks for the gold kind stranger!\n\nEDIT 2: thanks for the silver!!! It made my day!  Oh god I really hope you guys enjoyed my comment also thanks for  the upvotes I’m shaking and crying rn omg omg guys I’m speechless silver silver silver guys I forgot how to speak some one help plz guys it’s silver I repeat I got silver omg AAAAAAAAAAAAAAAAAAAAAA\n\nTHANKS FOR THE SILVER!!!!!\n\nEDIT 3: 250 upvotes?!???!?!?  GUYS THIS IS EPIC!! 250 upvotes is a quarter of a thousand, imagine, imagine how big is this number, imagine 250 people standing in front of you and appreciating your comment, just imagine this big number. Woah\n\nTHANKLKKKKKSSS FOR THE 250 UPVOTES KIND STRANGERS!’nnn!!!\n\nEDIT 3: ok guys basically the first edit was a joke, but now MY COMMENT HAS REDDIT GOLD WTF?!!1?1?! GUYS THIS IS EPIC I WOULD LIKE TO THE THE STRANGER FOR THE KIND GOLD, THANKS FOR THE GOLD KIND STRANGER! the gold kind stranger, thanks for the gold, I’m happy to see that my comment was gold worthy, I also want to thank everyone who upvoted my comment, it means a lot to me, and again, THANKS FOR THE GOLD KIND STRAGER!!!! Guys this is epic 😎\n\nEDIT 4: WE👏DID👏IT👏REDDIT👏\n\n330 Upvotes WHOOOOOOOOOOOO!!!!!!1!1!!! This number is increasing guys I can’t believe myself this is truly epic, I want to say thanks to every single redditor who upvoted my comment, it means a lot to me, I love you all ❤️ Can we reach 500 this time?? That would be so great!!!",
            "r/AwardSpeechEdits",
            " Edit: thanks for the gold kinda stranger I didn’t expect this post to blow up! My life started growing up in a small farm in northern Kansas. My father was a farmer and my mother was a cashier in our local town down the dirt road. We didn’t have much and income was very little, my best toy I got growing up was a pig bladder blown up like a balloon that I could play around with between me and my two brothers. At the age of 11 things started getting tougher in my house life due to my fathers drinking problem as it was not a good harvest that year. Like his father before him once he was done working he would come home and drink but unlike his father he wouldn’t beat us unless we messed up, his father left him and his mother to fend for themselves after world war 2 though so he had it tougher than me growing up. One time my father did drink too much and he hit my little brother Jamey. Jamey didn’t know what to do and ran away during the night during a storm. The entire family was out looking for him but we never saw Jamey again. This made my father drink more and lead him to take his life when I was at the age of 16. My older brother and me had to completely take over the farm with the help of our mom quitting her job as a cashier, life got very hard from here on out. We got a break when I was 18 with a good harvest we were able to save up some money. I was able to move out at the age of 21 and into a larger city in Tennessee. It was hard leaving the family as my ma was getting older but my older brother completely took over the farm and even expanded it into a more profitable work. I began working in what I was good at, repairing mechanics. I was a hard worker and moved up in my chain of work easily within my town. I dated aroun’ a bit but never settled down with anyone I would write home about for my first few years. When I was 26 I got a call from my ma, my brother was working with some machinery on the farm and got his hand caught in it and heavily damaged. I had to come home and help with the farm, at the time I had attained a high position as a senior mechanic within an auto shop and sometimes worked on the side with repairing electronics. I went home and had to help with the farm for a year, ma wasn’t doing good at all. She passed the next year due to kidney disease. My brother eventually recovered and I returned to Tennessee, I attempted to return to my position but due to the time I was out I had been long replaced. I had to begin to work from the bottom again when I had a client come in, she was the most beautiful woman I ever seen in Tennessee with gorgeous brown hair. Nice to say that we hit it off pretty well, within a few weeks we were dating. I can say that she was one of the best things to have happened to me in my life. At the age of 30 I married her and my first child was on the way then. I had returned to my previous position and bought a nice house near the mountains of Tennessee. At the age of 34 my second child was born. My two kids are now both in high school, one a freshman, another a Senior. I continued my career into more electronics working on computers and fixing them. In 2013 while googling how to fix a small problem with a motherboard I found a strange site named reddit.com, this website had all the answers I needed and a community always ready to help. I’ve been on the site ever since. As you can see recently, I commented on this thread and some kind stranger gave me gold. Thank you again kind stranger.",
            "Smart emoji funny gun",
            "I almost threw up in my mouth.",
            "Wow oh my god actual silver!?!?!? I was just kidding u guys XDDDDddddd!! Thanks mom and dad u made dis posserberrr!!!",
            "That’s aww.\n\nEDIT: thanks fow the gowd kind stwangew!\n\nEDIT 2: thanks fow the siwvew!!! It made my day!  Oh god I weawwy hope you guys enjoyed my comment awso thanks fow  the upvotes I’m shaking and cwying wn omg omg guys I’m speechwess siwvew siwvew siwvew guys I fowgot how to speak some one hewp pwz guys it’s siwvew I wepeat I got siwvew omg AAAAAAAAAAAAAAAAAAAAAA\n\nTHANKS FOW THE SIWVEW!!!!!\n\nEDIT 3: 250 upvotes?!???!?!?  GUYS THIS IS EPIC!! 250 upvotes is a quawtew of a thousand, imagine, imagine how big is this numbew, imagine 250 peopwe standing in fwont of you and appweciating youw comment, just imagine this big numbew. Woah\n\nTHANKWKKKKKSSS FOW THE 250 UPVOTES KIND STWANGEWS!’nnn!!!\n\nEDIT 3: ok guys basicawwy the fiwst edit was a joke, but now MY COMMENT HAS WEDDIT GOWD WTF?!!1?1?! GUYS THIS IS EPIC I WOUWD WIKE TO THE THE STWANGEW FOW THE KIND GOWD, THANKS FOW THE GOWD KIND STWANGEW! the gowd kind stwangew, thanks fow the gowd, I’m happy to see that my comment was gowd wowthy, I awso want to thank evewyone who upvoted my comment, it means a wot to me, and again, THANKS FOW THE GOWD KIND STWAGEW!!!! Guys this is epic 😎\n\nEDIT 4: WE👏DID👏IT👏WEDDIT👏\n\n330 Upvotes WHOOOOOOOOOOOO!!!!!!1!1!!! This numbew is incweasing guys I can’t bewieve mysewf this is twuwy epic, I want to say thanks to evewy singwe wedditow who upvoted my comment, it means a wot to me, I wove you aww ❤️ Can we weach 500 this time?? That wouwd be so gweat!!!",
            "wow umm i dont know if this was just a weird coincidence but here's my post   \n[https://www.reddit.com/r/copypasta/comments/bjxh8g/for\\_when\\_someone\\_puts\\_edit\\_thanks\\_for\\_the\\_gold/](https://www.reddit.com/r/copypasta/comments/bjxh8g/for_when_someone_puts_edit_thanks_for_the_gold/)  \nuploaded like a day before yours",
            "Why does everyone thank me? It’s so annoying. I never did anything for them. ضصثقتنتينكحححجتـبتن",
            "Epic. \n\n**Edit:** Thank you guys so so so much for 1 upvote! It means the world to me. Omg I’m literally freaking out right now. I just got home from school and this absolutely blew up! I didn’t know you guys agreed with me so much. Thank you omg wow.\n\n**Edit 2:** Huge thanks to /u/ThomasThaWankEngine for an upvote. People like this literally change my life. Love you so much, no homo. You’re my hero. I’m freaking out OMGGGGGGG, someone else upvoted my post. You’re an amazing person. Never forget that. Thanks so much! I’m literally freaking out how do I control this?!?! Thank you. So. Much.\n\n**Edit 3:** OMG!! FIVE UPVOTES?! Seriously guys, I can’t thank you enough. This has literally been the best day of my entire life. I’ll never forget this day. If we can get TEN upvotes, I will literally cry out loud. That would be so amazing. But I’m only dreaming. Actually, one of my dreams already came true. FIVE UPVOTES! God is real and he has granted me five whole upvotes. Thank you, amazing people, for helping me achieve my life long dream. I literally can’t thank you enough.\n\n**Edit 4:** GUYS? WE HAVE A SEVENTH UPVOTER!!!! u/Nihon_Hanguk is the amazing person this time! They have changed my WHOLE life by pressing the upvote button and I’m sooooooo thankful for nice people like this. Keep doing what you’re doing! Maybe you can change other people’s lives too! I’m like, sooooooo happy right now guys! I CANT CONTROL MY HAPPINESS! Thank you so so so so so so so so so much. You’re amazing.\n\n**Edit 5:** 15 UPVOTES?! FIFTEEN UPVOTES?! IM LITERALLY CRYING RIGHT NOW!!!! **FIFTEEN UPVOTES!** ***FIFTEEN UPVOTES?!*** Thank you guys so so so much. I love you all. I’m crying irl right now guys. Tears of joy, of course! 😂😭😆 Special thanks to u/OverdosingOnMemes for being the THIRTEENTH UPVOTER! It means a lot to me. You’re just an absolutely amazing person. And to all other 14 upvoters, too, you’re so amazing as well. THANK YOU ALL!!!1!\n\n**EDIT 6 (OMG):** HOLY @#$& OMFG WTF OMGGGGGGGGGGGG 20 UPVOTES!!!!! THIS IS MY DREAM!! THANK YOU ALLLLLL OF YOU, ESPECIALLY u/Dogemaster666 u/randomstupidnanasnme u/still_girth WHO GOT ME TO THIS POINT AND ANNOUNCED THEY DID. YOU GUYS HAVE MY RESPECT 100 PERCENT. THANK YOU SOOOOOOO MUCH GUYS OMG IM CRYING SO HARD AND MY PARENTS ARE ASKING WHY. ITS SO EMBARRASSING BUT SO WORTH IT. THANKS EVERYONE. SO. DAMN. MUCH. ❤️❤️❤️❤️❤️❤️❤️\n\n**Edit 7:** Changed color of heart emojis in the above (AMAZING) update.\n\n**Edit 8:** OOOH, WAIT GUYS. WE HAVE A TWENTY THIRD!! u/shrimpandvegetables thank you SO SO much.\n\n**Edit 9:** Alright, I’m going to go play some Smash Ultimate. I’ll continue with the updates a bit later. CAN WE GET 30 UPVOTES BY THE TIME IM DONE? Probably not. But it would literally be a dream come true. Sadly, I think I’m just dreaming right now. 😐 But we can hope, right?\n\n**Edit 10:** ... ... ... oh my gosh guys. *oh my gosh.* **GUYS.** THIRTY, THREE ZERO UPVOTES. THATS LIKE, GOTTA BE A WORLD RECORD. u/SuperWill93. Thank. You. Soooooo. Much. After getting badly beaten in Smash Ultimate, I felt useless. After seeing such amazing people (especially u/SuperWill93) getting me to THIRTY. **THIRTY** upvotes, I feel like the most important person ever. I don’t even know what else to say. Just omg. Thank you.\n\n**EDIT 11:** WHAY&RTEHTYUHQEGHU#HUIHGIUQHGUIEGHEUG I LITERALLY CANT SPEAK. SIXTY. OMG. WHAT. HOW THE EVEN WTF OMG IDEK WHAT TO SAY. HUGE THANKS TO u/Fylix_Aerou FOR BEING #60. YOU'RE SOOOOO AWESOME LIKE OMG SOOO AWESOME. GUYS OMG I HAVE TO END THIS NOW IDEK WHAT TO SAY.\n\n**Edit 12:** 69 upvotes. nice.\n\n**EDIT 13 (GUYS THIS IS AN AWESOME EDIT):** I GOT SILVER!!1 SOME ANONYMOUS AMAZING GREAT SUPERB FANTASTIC 10/10 BEST-PERSON-IN-THE-WORLD REDDITOR GAVE ME ONE WHOLE SILVER. THIS IS LIKE, WAY MORE THAN A DREAM. I'M LIKE, SOOOOOOO FREAKING OUT RIGHT NOW. I DON'T EVEN KNOW WHAT TO SAY GUYS. I CANT ANYMORE. THIS IS SO AMAZING. I JUST... wow. just. wow. THIS HAS BEEN A GREAT DAY. I WENT FROM 1 UPVOTE TO LIKE, MY FAVORITE NUMBER 69 UPVOTES. THEN SILVER?!?!?!?!?! DAMNNNNN. I WANT TO THANK MY MOM, MY DAD, MY SISTER, MY SISTER'S FISH, MY UNCLE, MY COUSINS, MY AUNT, MY GRANDMOTHER, MY GRANDFATHER, MY OTHER GRANDMOTHER, MY OTHER GRANDFATHER, MY GREAT GRANDMOTHER, MY GREAT GRANDFATHER, MY OTHER GREAT GRANDMOTHER, AND EVERY OTHER SINGLE PERSON I KNOW IN THIS WORLD. T h a n k y o u. I literally have no idea what to say, I'm so shocked!!!! Just- thANK YOU!\n\n**Edit 14:** I was just at 71 upvotes and now I'm at 70! IDIOT\n\n**Edit 15:** 68 upvotes now? wtf jerks\n\n**Edit 16:** Wait it's back to 71 upvotes now.\n\n**Edit 17:** u/sinisterWraith is our 76th upvoter! You mean the whole world to me. You're just an absolutely amazing person. Thank you so much. You're fantastic.\n\n**Edit 18:** Guys, we're getting downvotes! Some jerks are just so jealous of my AWESOME day and are just downvoting this post. But thanks to people like u/BlueScreen0fDeath, who was the like third or fourth 71st upvoter, we might not be headed in such a bad direction. People like this are absolutely awesome. Huge thank you to them. YOU MEAN THE WORLD TO ME! <3\n\n**Edit 20:** __**I'm going to stop editing this post now. Bye!**__\n\n**Edit 21:** u/MCPhantomX wants a speech! I know I'm done with editing this post but I think they upvoted the post and honestly, that means soooo much to me. People like this are just so kind. Thank you so much!",
            "I hate people who edit to thank people for gold",
            " ‏‏‎ o̦̹̦̜̼͈̲̥̬̖̤͆̒̈҉͠͞͏͏̡͠͡͡҉̴͝͏͡h̜̳̳̝͎̳̤̘̝̗̗̝̹̩̦̤͚̘̿ͧ̈̉͊̀ͩ̉ͥ̄ͭ̊̿̈́͛ͦͯ͘͢͡ ̪̥̖̟͉̩̗̠̗͏҉͟y̨͔̘͉̗̻̞ͤͤ̽͗̈ͯ͑ͮ̆ͫ̽ͤ̽͂ͬ́҉҉̵̧̢̨̧̧̨̀́̕̕͜͢͞͞ē̺͔̺͈͕̍̑ͦ̌ͭͫ͊ͪ̔̈͋̽ͥ̈́̾͢ă̶̡̻̪̱̤̳̯̯͓̘̬̠̼̫̞̼̖̯̻ͥ̏ͪ̑͐̃͒ͯ̐ͥ̇̕͢͡͝҉́͘̕͟͝ḩ̸̵̨͔͔͖͙͉̩̱̠͉̿͒͐͒̇̈́ͯͩ̓͋̅ͮͮ̓ͦ̏̍̈́͌́̀̚̕͘͜͞͡ ̶̶̸̴̨̨̙̳̆̌̑̌̃̿̍ͣ̔̓ͥ̊͑̐ͭ́̓͌̍̕͘͜ẙ̥̗̫̬̞̟̞̫̗̫̹̘̜ͣͧͥͣ̋̐͌ͤͪͥ̑͂͑ͦ̍ͮͫ̂͏͢͏̶̶̡̢̛́̕͜͜͢͜͞͞͞҉e̢̡͕̺̱̯͈͔̯̹̱̙̬̲̯̊̃̈̏̽́̊̏̄͂̍ͨ͊ͤ͌̄͡͡ã̶͕̯͙̪̞̳͈̋͆ͮ̃͌̽͛͑͂̂̀̀ͬ̾͟͡͠͠҉̶̷̛͜͞͞͠͞ḩ̷̵̴̴͇͖̦̜̰̺̩̱̠̮̯͈͙̩̰̜̾ͤ̆͆͒͘͞͞",
            "This is honestly one of the best unpopular opinions Ive seen in a long time, well written and obviously unpopular. Well done OP.",
            "`now this is epic`",
            "⠀⠀⠀⠀⠀⣤⣶⣶⡶⠦⠴⠶⠶⠶⠶⡶⠶⠦⠶⠶⠶⠶⠶⠶⠶⣄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⣿⣀⣀⣀⣀⠀⢀⣤⠄⠀⠀⣶⢤⣄⠀⠀⠀⣤⣤⣄⣿⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠿⣿⣿⣿⣿⡷⠋⠁⠀⠀⠀⠙⠢⠙⠻⣿⡿⠿⠿⠫⠋⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣤⠞⠉⠀⠀⠀⠀⣴⣶⣄⠀⠀⠀⢀⣕⠦⣀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⣤⠾⠋⠁⠀⠀⠀⠀⢀⣼⣿⠟⢿⣆⠀⢠⡟⠉⠉⠊⠳⢤⣀⠀⠀⠀ ⠀⣠⡾⠛⠁⠀⠀⠀⠀⠀⢀⣀⣾⣿⠃⠀⡀⠹⣧⣘⠀⠀⠀⠀⠀⠀⠉⠳⢤⡀ ⠀⣿⡀⠀⠀⢠⣶⣶⣿⣿⣿⣿⡿⠁⠀⣼⠃⠀⢹⣿⣿⣿⣶⣶⣤⠀⠀⠀⢰⣷ ⠀⢿⣇⠀⠀⠈⠻⡟⠛⠋⠉⠉⠀⠀⡼⠃⠀⢠⣿⠋⠉⠉⠛⠛⠋⠀⢀⢀⣿⡏ ⠀⠘⣿⡄⠀⠀⠀⠈⠢⡀⠀⠀⠀⡼⠁⠀⢠⣿⠇⠀⠀⡀⠀⠀⠀⠀⡜⣼⡿⠀ ⠀⠀⢻⣷⠀⠀⠀⠀⠀⢸⡄⠀⢰⠃⠀⠀⣾⡟⠀⠀⠸⡇⠀⠀⠀⢰⢧⣿⠃⠀ ⠀⠀⠘⣿⣇⠀⠀⠀⠀⣿⠇⠀⠇⠀⠀⣼⠟⠀⠀⠀⠀⣇⠀⠀⢀⡟⣾⡟⠀⠀ ⠀⠀⠀⢹⣿⡄⠀⠀⠀⣿⠀⣀⣠⠴⠚⠛⠶⣤⣀⠀⠀⢻⠀⢀⡾⣹⣿⠃⠀⠀ ⠀⠀⠀⠀⢿⣷⠀⠀⠀⠙⠊⠁⠀⢠⡆⠀⠀⠀⠉⠛⠓⠋⠀⠸⢣⣿⠏⠀⠀⠀ ⠀⠀⠀⠀⠘⣿⣷⣦⣤⣤⣄⣀⣀⣿⣤⣤⣤⣤⣤⣄⣀⣀⣀⣀⣾⡟⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢹⣿⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀",
            "EDIT 5: WOW! 340 upvotes! Time to go kiss my father on the lips.",
            "RIP. \n\n \n\nEDIT: thanks for the gold kind stranger!\n\nEDIT 2: thanks for the silver!!! It made my day! Oh god I really hope you guys enjoyed my comment also thanks for the upvotes I’m shaking and crying rn omg omg guys I’m speechless silver silver silver guys I forgot how to speak some one help plz guys it’s silver I repeat I got silver omg AAAAAAAAAAAAAAAAAAAAAA\n\nTHANKS FOR THE SILVER!!!!!\n\nEDIT 3: 250 upvotes?!???!?!? GUYS THIS IS EPIC!! 250 upvotes is a quarter of a thousand, imagine, imagine how big is this number, imagine 250 people standing in front of you and appreciating your comment, just imagine this big number. Woah\n\nTHANKLKKKKKSSS FOR THE 250 UPVOTES KIND STRANGERS!’nnn!!!\n\nEDIT 3: ok guys basically the first edit was a joke, but now MY COMMENT HAS REDDIT GOLD WTF?!!1?1?! GUYS THIS IS EPIC I WOULD LIKE TO THE THE STRANGER FOR THE KIND GOLD, THANKS FOR THE GOLD KIND STRANGER! the gold kind stranger, thanks for the gold, I’m happy to see that my comment was gold worthy, I also want to thank everyone who upvoted my comment, it means a lot to me, and again, THANKS FOR THE GOLD KIND STRAGER!!!! Guys this is epic 😎\n\nEDIT 4: WE👏DID👏IT👏REDDIT👏\n\n330 Upvotes WHOOOOOOOOOOOO!!!!!!1!1!!! This number is increasing guys I can’t believe myself this is truly epic, I want to say thanks to every single redditor who upvoted my comment, it means a lot to me, I love you all ❤️ Can we reach 500 this time?? That would be so great!!!",
            "This post is totally not an attempt at getting gold",
            "Reddit do ur thing!",
            "Lmao “WE DID IT” I’m dead",
            "Yooo ikr right\n\nEdit: spelling",
            "Thanks for the gold, kid strangler!",
            "**COMMENT ALTERATION # **👆🏻",
            "Take this gold you son of a bitch",
            "This is so fucking racist",
            "You became the very thing you swore to destroy",
            "This sounds like Trump lol",
            "id give gold if i had money\n\nEdit: thanks for the silver kind stranger I didn’t expect this post to blow up! My life started growing up in a small farm in northern Kansas. My father was a farmer and my mother was a cashier in our local town down the dirt road. We didn’t have much and income was very little, my best toy I got growing up was a pig bladder blown up like a balloon that I could play around with between me and my two brothers. At the age of 11 things started getting tougher in my house life due to my fathers drinking problem as it was not a good harvest that year. Like his father before him once he was done working he would come home and drink but unlike his father he wouldn’t beat us unless we messed up, his father left him and his mother to fend for themselves after world war 2 though so he had it tougher than me growing up. One time my father did drink too much and he hit my little brother Jamey. Jamey didn’t know what to do and ran away during the night during a storm. The entire family was out looking for him but we never saw Jamey again. This made my father drink more and lead him to take his life when I was at the age of 16. My older brother and me had to completely take over the farm with the help of our mom quitting her job as a cashier, life got very hard from here on out. We got a break when I was 18 with a good harvest we were able to save up some money. I was able to move out at the age of 21 and into a larger city in Tennessee. It was hard leaving the family as my ma was getting older but my older brother completely took over the farm and even expanded it into a more profitable work. I began working in what I was good at, repairing mechanics. I was a hard worker and moved up in my chain of work easily within my town. I dated aroun’ a bit but never settled down with anyone I would write home about for my first few years. When I was 26 I got a call from my ma, my brother was working with some machinery on the farm and got his hand caught in it and heavily damaged. I had to come home and help with the farm, at the time I had attained a high position as a senior mechanic within an auto shop and sometimes worked on the side with repairing electronics. I went home and had to help with the farm for a year, ma wasn’t doing good at all. She passed the next year due to kidney disease. My brother eventually recovered and I returned to Tennessee, I attempted to return to my position but due to the time I was out I had been long replaced. I had to begin to work from the bottom again when I had a client come in, she was the most beautiful woman I ever seen in Tennessee with gorgeous brown hair. Nice to say that we hit it off pretty well, within a few weeks we were dating. I can say that she was one of the best things to have happened to me in my life. At the age of 30 I married her and my first child was on the way then. I had returned to my previous position and bought a nice house near the mountains of Tennessee. At the age of 34 my second child was born. My two kids are now both in high school, one a freshman, another a Senior. I continued my career into more electronics working on computers and fixing them. In 2013 while googling how to fix a small problem with a motherboard I found a strange site named reddit.com, this website had all the answers I needed and a community always ready to help. I’ve been on the site ever since. As you can see recently, I commented on this thread and some kind stranger gave me silver. Thank you again kind stranger!",
            "Edit: Thanks for the gold kind stranger",
            "Truly an epic gamer moment!",
            "Opinion is so original and without salt",
            "My favorite version is when someone made a song out of it or something and it was like (Chorus: The gold) or something like that made me dying with laughter",
            "PLZ LIKR SHARE AND PRESS THE BELL ICON",
            "I thought this was against video editors but i was pleasantly surprised",
            "Dont forget to smash that upvote button",
            "bro what about platinum",
            "give this man gold, just to make it unironic",
            "Automod I need you",
            "The more emojis someone uses the more retarded I think they are",
            "Me too",
            "It’s at 5.5k now can’t wait to see his response",
            "Somebody make a sub for these edits",
            "now it's at 6k,  what will you say now OP",
            "I actually take off my like when i see the \"edits\"",
            "I really want user to edit it now",
            "I always wonder if these posts were all posted at once and when the awards were given.",
            "RIP your inbox.",
            "#Edit",
            "Qp pyro reference",
            "Is it true that if i write anything in here i will get minimum 40 upvotes?",
            "[deleted]",
            "We all do",
            "I love how you posted this here with an intention and everyone followed through with it so you could complete the joke/pasta. Dumb stuff like that makes me smile sometimes",
            "I also hate hypocrites. \n\nEDIT: this edit is here to prove that I hate myself",
            "I once saw a guy on youtube with 8 edits, each for every 10 likes. Burn him.",
            "i really fucking hate this its not funny and i didnt expect this to reach 1 upvote",
            "Reported this as spam",
            "Stop fishing for gold",
            "I got about 1.5k karma from my FIRST post, and I didn't do any shit like this. I said thanks for the likes and feedback ONCE and thats IT\n\nnow lemme double check bc it was a while ago and it may or may not have been twice directly to two different ppl",
            "That’s all.\n\nEDIT: thanks for the gold kind stranger!\n\nEDIT  2: thanks for the silver!!! It made my day!  Oh god I really hope you  guys enjoyed my comment also thanks for  the upvotes I’m shaking and  crying rn omg omg guys I’m speechless silver silver silver guys I forgot  how to speak some one help plz guys it’s silver I repeat I got silver  omg AAAAAAAAAAAAAAAAAAAAAA\n\nTHANKS FOR THE SILVER!!!!!\n\nEDIT  3: 250 upvotes?!???!?!?  GUYS THIS IS EPIC!! 250 upvotes is a quarter  of a thousand, imagine, imagine how big is this number, imagine 250  people standing in front of you and appreciating your comment, just  imagine this big number. Woah\n\nTHANKLKKKKKSSS FOR THE 250 UPVOTES KIND STRANGERS!’nnn!!!\n\nEDIT  3: ok guys basically the first edit was a joke, but now MY COMMENT HAS  REDDIT GOLD WTF?!!1?1?! GUYS THIS IS EPIC I WOULD LIKE TO THE THE  STRANGER FOR THE KIND GOLD, THANKS FOR THE GOLD KIND STRANGER! the gold  kind stranger, thanks for the gold, I’m happy to see that my comment was  gold worthy, I also want to thank everyone who upvoted my comment, it  means a lot to me, and again, THANKS FOR THE GOLD KIND STRAGER!!!! Guys  this is epic 😎\n\nEDIT 4: WE👏DID👏IT👏REDDIT👏\n\n330  Upvotes WHOOOOOOOOOOOO!!!!!!1!1!!! This number is increasing guys I  can’t believe myself this is truly epic, I want to say thanks to every  single redditor who upvoted my comment, it means a lot to me, I love you  all ❤️ Can we reach 500 this time?? That would be so great!!!",
            "That’s all.\nEDIT: thanks for the gold kind stranger!\nEDIT 2: thanks for the silver!!! It made my day! Oh god I really hope you guys enjoyed my comment also thanks for the upvotes I’m shaking and crying rn omg omg guys I’m speechless silver silver silver guys I forgot how to speak some one help plz guys it’s silver I repeat I got silver omg AAAAAAAAAAAAAAAAAAAAAA\nTHANKS FOR THE SILVER!!!!!\nEDIT 3: 250 upvotes?!???!?!? GUYS THIS IS EPIC!! 250 upvotes is a quarter of a thousand, imagine, imagine how big is this number, imagine 250 people standing in front of you and appreciating your comment, just imagine this big number. Woah\nTHANKLKKKKKSSS FOR THE 250 UPVOTES KIND STRANGERS!’nnn!!!\nEDIT 3: ok guys basically the first edit was a joke, but now MY COMMENT HAS REDDIT GOLD WTF?!!1?1?! GUYS THIS IS EPIC I WOULD LIKE TO THE THE STRANGER FOR THE KIND GOLD, THANKS FOR THE GOLD KIND STRANGER! the gold kind stranger, thanks for the gold, I’m happy to see that my comment was gold worthy, I also want to thank everyone who upvoted my comment, it means a lot to me, and again, THANKS FOR THE GOLD KIND STRAGER!!!! Guys this is epic 😎\nEDIT 4: WE👏DID👏IT👏REDDIT👏\n330 Upvotes WHOOOOOOOOOOOO!!!!!!1!1!!! This number is increasing guys I can’t believe myself this is truly epic, I want to say thanks to every single redditor who upvoted my comment, it means a lot to me, I love you all ❤️ Can we reach 500 this time?? That would be so great!!!",
            "This comment won't get gold"
        ]
    },
    {
        "post_id": "jnwu1v",
        "author": "waterislife00",
        "title": "# AITA for falling into the river in LEGO City?",
        "url": "https://www.reddit.com/r/copypasta/comments/jnwu1v/aita_for_falling_into_the_river_in_lego_city/",
        "score": 8344,
        "num_comments": 168,
        "created_utc": 1604497146.0,
        "selftext": " \n\nI'd like to preface this by saying that it was in NO WAY my fault. The ground was slippery, and the railing on that bridge are too short. Anyways, what happened was while I was crossing a bridge, a family asked if I could take a group photo for them. I leaned back against the railing to fit them all in the frame, but I must of went too far back because I lost my balance and fell into the river! I'm not really good at swimming, so the best I could do was tread water as the current carried me down the river. Luckily, the city had just bought a new rescue helicopter and they were able to prepare the lifeline, lower the stretcher, and make the rescue. My wife is mad for \"ruining our vacation\" and a man from the fire department scolded me for \"wasting first responder resources with my carelessness.\" It's not like I WANTED to fall into the river, and besides, isn't that what they are there for? AITA?",
        "permalink": "/r/copypasta/comments/jnwu1v/aita_for_falling_into_the_river_in_lego_city/",
        "comments": [
            "YTA, go back into the river",
            "Let me tell you, it was not my fault. The feet are soft and the sole of his shoes is very small. However, as I crossed the bridge, I wanted to know if my family could take pictures of us together. I put it on the fence and installed two tires. But I lost my balance and fell into the river, so I was late! I can’t swim, which means it’s a great way to bring water to the river. Fortunately, the Jutogadu people were able to purchase a new rescue helicopter, rebuild Gumiyongjuro, and rebuild the genes used in the rescue operation. Her husband was angry and accused her of \"ruining the holiday season\" and \"losing the strength to deal with an emergency.\" I did not want to fall into the river. Is there a reason? father?",
            "NTA, who decided to put a river there?",
            " \n\nI'd like to preface this by saying that it was in NO WAY my fault. The ground was slippery, and the railing on that bridge are too short. Anyways, what happened was while I was crossing a bridge, a family asked if I could take a group photo for them. I leaned back against the railing to fit them all in the frame, but I must of went too far back because I lost my balance and fell into the river! I'm not really good at swimming, so the best I could do was tread water as the current carried me down the river. Luckily, the city had just bought a new rescue helicopter and they were able to prepare the lifeline, lower the stretcher, and make the rescue. My wife is mad for \"ruining our vacation\" and a man from the fire department scolded me for \"wasting first responder resources with my carelessness.\" It's not like I WANTED to fall into the river, and besides, isn't that what they are there for? AITA?",
            "NTA, they needed to test the helicopter",
            "NTA. Your river, your rules.",
            "NTA. They never said “HEY” before sending in the rescue helicopter, so it’s all their fault",
            " \n\nI'd wike to pweface this by saying that it was in NO WAY my fauwt. The gwound was swippewy, and the waiwing on that bwidge awe too showt. Anyways, what happened was whiwe I was cwossing a bwidge, a famiwy asked if I couwd take a gwoup photo fow them. I weaned back against the waiwing to fit them aww in the fwame, but I must of went too faw back because I wost my bawance and feww into the wivew! I'm not weawwy good at swimming, so the best I couwd do was twead watew as the cuwwent cawwied me down the wivew. Wuckiwy, the city had just bought a new wescue hewicoptew and they wewe abwe to pwepawe the wifewine, wowew the stwetchew, and make the wescue. My wife is mad fow \"wuining ouw vacation\" and a man fwom the fiwe depawtment scowded me fow \"wasting fiwst wespondew wesouwces with my cawewessness.\" It's not wike I WANTED to faww into the wivew, and besides, isn't that what they awe thewe fow? AITA?",
            "I actually believed this was a AMITA post.  The \"not being able to swim\" part really sold me on this being a Redditor.",
            "NTA not your River not ur problem",
            "NTA, a man has fallen for a man in LEGO City",
            "#HEY!\n\n\nThis is my copypasta! \n\n🔫👮‍♂️ hand over the karma",
            "INFO: was crossing the bridge part of your vacation?",
            "  \n  \nI'd 🙏 like 💖 to preface this by saying 🗣 that it was in NO 🙅 WAY 💫 my fault 👎🏿. The ground 🌱 was slippery ☔, and the railing 🛤🚉 on 🔛 that bridge 🌉 are too short 👕👖. Anyways 💁✌, what happened 👉 was while I 👁 was crossing ❌🚫 a bridge 🌉, a family 👪👫 asked 🙏 if I 👁 could take 👊 a group 👥 photo 🖼 for them. I 👁 leaned 🚴 back 🔙 against 🚫 the railing 👸🏽👌🏿 to fit 💪 them all 💯 in the frame 🔲, but 🍑 I 👥 must 👫 of went 🏃 too far 🌌 back 🔙😘 because I 👥 lost 🏳 my balance ⚖👐 and fell 🍂🍁 into the river 🌊! I'm 💘 not really 💯 good 👍 at swimming 🏊, so the best 🏆 I 👁 could do was tread 👞 water 💦 as the current 💰 carried 🙄 me down ⬇ the river 🌊. Luckily 🎱🍀, the city 🏙 had just bought 💰 a new 🆕🆒 rescue ⛑ helicopter 🚁 and they were able 💪 to prepare 🙍🏿 the lifeline 🔥💉, lower ⬇ the stretcher 😼👌💥, and make 💘 the rescue ⛑. My wife 👩 is mad 😡 for \"ruining 😡 our vacation 🌅\" and a man 👦 from the fire 🔥 department 😼👌💥 scolded me for \"wasting 🗑 first 👆 responder 📥 resources 💦 with my carelessness 🤷🏽‍♀️.\" It's not like 💖 I 👁 WANTED 😍 to fall 🛌🍂 into the river 🏞, and besides 🚫, isn't that what they are there for? AITA 🤔?",
            "NTA, helicopters",
            "H E Y !",
            "NTA: Play stupid games, win stupid prizes",
            "nta",
            "NAH",
            "You're the asshole for not learning how to swim. It's a life skill. HOW do people get to adulthood and don't know a very basic survival skill?",
            "5/5 assholes",
            "NTA your city, your rules",
            "I love this subreddit so much",
            "I thought this was actually AITA",
            "# AITA for falling into the river in LEGO City?\n\nI'd like to preface this by saying that it was in NO WAY my fault. The ground was slippery, and the railing on that bridge are too short. Anyways, what happened was while I was crossing a bridge, a family asked if I could take a group photo for them. I leaned back against the railing to fit them all in the frame, but I must of went too far back because I lost my balance and fell into the river! I'm not really good at swimming, so the best I could do was tread water as the current carried me down the river. Luckily, the city had just bought a new rescue helicopter and they were able to prepare the lifeline, lower the stretcher, and make the rescue. My wife is mad for \"ruining our vacation\" and a man from the fire department scolded me for \"wasting first responder resources with my carelessness.\" It's not like I WANTED to fall into the river, and besides, isn't that what they are there for? AITA?",
            "Based",
            "YTA WHY YOU COSTED THE ECONOMY FIVE BILLION CRONUX",
            "ESH, anyone who wants to live or wants to preserve life can go kill themselves and others",
            "NTA, your balance, your choice",
            "NTA, hentai",
            "YTA be more careful retar",
            "YTA you belong in the river now RETURN",
            "YTA, send that river water to Africa and i maybe will retract my first point",
            "/u/shittytranslatorbot",
            "I'd like to preface this by saying that it was in NO WAY my fault. The ground was slippery, and the railing on that bridge are too short. Anyways, what happened was while I was crossing a bridge, a family asked if I could take a group photo for them. I leaned back against the railing to fit them all in the frame, but I must of went too far back because I lost my balance and fell into the river! I'm not really good at swimming, so the best I could do was tread water as the current carried me down the river. Luckily, the city had just bought a new rescue helicopter and they were able to prepare the lifeline, lower the stretcher, and make the rescue.",
            "so nta bro",
            "INFO **HEY!**",
            "reeeeeeeeeeeeeeepost",
            "Bruh I'm confused what happened to cummy?",
            "!emojify",
            "Hey",
            "NTA, you justify the existence of the rescue helicopter.",
            "based",
            "NTA your river your rules",
            "He left out thehe part where he cried like a little baby",
            "YTA unless ur white",
            "nice.",
            "u/shittytranslatorbot",
            "NTA. Lego city has enough money for the rescue helicopter but NOT for a good railing and good watertight flooring? Ridiculous. Defenitely NTA."
        ]
    },
    {
        "post_id": "e8c7fs",
        "author": "SSMblackjack",
        "title": "Finals week",
        "url": "https://www.reddit.com/r/copypasta/comments/e8c7fs/finals_week/",
        "score": 8337,
        "num_comments": 141,
        "created_utc": 1575909103.0,
        "selftext": "It's EXAM WEEK 😤😤 and it's TIME ⏱⏱ to WHIP OUT 😯😯 your EDUCATION ERECTIONS 🎒📚🍆🍆 and FUCK THESE FINALS 🤣🤣😉😉. That's RIGHT, get READY to BOOTYCALL 🍑📞 your SLUTTY STUDY BUDDIES 😏😏 and HIT 👊👊 the BOOKS 📘📗📙till your BRAIN 🧠🧠 is RUBBED RAW 😫😫 and your PEN 🖊🖊is DRY 😵😵. So let's put the CUM in CUMULATIVE 💦💦 and do this THING 🙌🙌. Send this to 11 of the SKANKIEST 🤤🤤 SCHOLARS you know or you will LITERALLY get F'D! 😱😱",
        "permalink": "/r/copypasta/comments/e8c7fs/finals_week/",
        "comments": [
            "It's EXAM WEEK 😤😤 and it's TIME ⏱⏱ to WHIP OUT 😯😯 your EDUCATION ERECTIONS 🎒📚🍆🍆 and FUCK THESE FINALS 🤣🤣😉😉. That's RIGHT, get READY to BOOTYCALL 🍑📞 your SLUTTY STUDY BUDDIES 😏😏 and HIT 👊👊 the BOOKS 📘📗📙till your BRAIN 🧠🧠 is RUBBED RAW 😫😫 and your PEN 🖊🖊is DRY 😵😵. So let's put the CUM in CUMULATIVE 💦💦 and do this THING 🙌🙌. Send this to 11 of the SKANKIEST 🤤🤤 SCHOLARS you know or you will LITERALLY get F'D! 😱😱",
            "My exams are all next week haha I wanna die",
            "NTA",
            "Is it okay if I get flashbacks when they ask me to *pass* them the salt?",
            "It's EXAM WEEK 😤😤 and it's TIME ⏱⏱ to WHIP OUT 😯😯 youw EDUCATION EWECTIONS 🎒📚🍆🍆 and FUCK THESE FINAWS 🤣🤣😉😉. That's WIGHT, get WEADY to BOOTYCAWW 🍑📞 youw SWUTTY STUDY BUDDIES 😏😏 and HIT 👊👊 the BOOKS 📘📗📙tiww youw BWAIN 🧠🧠 is WUBBED WAW 😫😫 and youw PEN 🖊🖊is DWY 😵😵. So wet's put the CUM in CUMUWATIVE 💦💦 and do this THING 🙌🙌. Send this to 11 of the SKANKIEST 🤤🤤 SCHOWAWS you know ow you wiww WITEWAWWY get F'D! 😱😱",
            "My exams aren't until after we get back from break and I won't be able to enjoy my break because of it. I will instead be having a mental breakdown",
            "[deleted]",
            "NTA those books had no business being so dummy thicc😫😫",
            "are you in a mindset to receive information that could possibly hurt you?",
            "Study 🤡",
            "I don't get the stress for exams. All you gotta do is dedicate one day to finding out what you need to study, then do the actual studying the next day. Then ya done",
            "Ex-WHAT WEEK?!",
            "I'm currently supposed to be studying for my calc test tomorrow morning but I'm instead looking at memes.",
            "What the actual fuck",
            "Mine were last week",
            "I want to die even more now",
            "Finals week\n\nIt's EXAM WEEK 😤😤 and it's TIME ⏱⏱ to WHIP OUT 😯😯 your EDUCATION ERECTIONS 🎒📚🍆🍆 and FUCK THESE FINALS 🤣🤣😉😉. That's RIGHT, get READY to BOOTYCALL 🍑📞 your SLUTTY STUDY BUDDIES 😏😏 and HIT 👊👊 the BOOKS 📘📗📙till your BRAIN 🧠🧠 is RUBBED RAW 😫😫 and your PEN 🖊🖊is DRY 😵😵. So let's put the CUM in CUMULATIVE 💦💦 and do this THING 🙌🙌. Send this to 11 of the SKANKIEST 🤤🤤 SCHOLARS you know or you will LITERALLY get F'D! 😱😱",
            "Come to think of it, this is actually one of the more wholesome posts on this subreddit.",
            "Remindme! 6 days",
            "Imagine having exams in the winter\n\nThis post was made by trimester exam gang",
            "Congratulations u/SSMblackjack ! \nIt looks like your post has made it (officially) to the top 3 of r/copypasta hot! :)\n>I am a bot that is still heavily in development. To make this bot ignore your posts, reply 'u/JFBotV1 ignore' to this message. Feedback will be highly appreciated! (I see votes and comments!)",
            "This is not ok.",
            "It's EXAM WEEK 😤😤 and it's TIME ⏱⏱ to WHIP OUT 😯😯 your EDUCATION ERECTIONS 🎒📚🍆🍆 and FUCK THESE FINALS 🤣🤣😉😉. That's RIGHT, get READY to BOOTYCALL 🍑📞 your SLUTTY STUDY BUDDIES 😏😏 and HIT 👊👊 the BOOKS 📘📗📙till your BRAIN 🧠🧠 is RUBBED RAW 😫😫 and your PEN 🖊🖊is DRY 😵😵. So let's put the CUM in CUMULATIVE 💦💦 and do this THING 🙌🙌. Send this to 11 of the SKANKIEST 🤤🤤 SCHOLARS you know or you will LITERALLY get F'D! 😱😱",
            "We still got a week left till finals over here.\n\n\nBet you feeling dum dum now don’t ya?",
            "This actually motivated me to complete my test",
            "At least take me out to dinner before you decide to FUCK MY EYES",
            "Finals week",
            "What beautiful timing, my exams start tomorrow.",
            "YEET",
            "AWW FUCK",
            "Congratulations u/SSMblackjack ! \nIt looks like your post has made it (officially) to the top 5 of r/copypasta hot! :)\n>I am a bot that is still heavily in development. To make this bot ignore your posts, reply 'u/JFBotV1 ignore' to this message. Feedback will be highly appreciated! (I see votes and comments!)",
            "Congratulations u/SSMblackjack ! \nIt looks like your post has made it (officially) to the top 10 of r/copypasta hot! :)\n>I am a bot that is still heavily in development. To make this bot ignore your posts, reply 'u/JFBotV1 ignore' to this message. Feedback will be highly appreciated! (I see votes and comments!)",
            "homie i finished my exam week today lmao",
            "wait wtf my exams are tomorrow hol up",
            "kinda needed this tbh. thanks.",
            "doesnt belong here but im gonna fail my end of year exams- thanks for reminding me",
            "Bad black people. Black people, they are bad.",
            "[r/emojipolice](https://youtu.be/30BapWWk2Nk) also this is not a rick roll",
            "r/EmojiPolice ... Everybody freeze!! We need all units on site! I repeat, we need all units on site!"
        ]
    },
    {
        "post_id": "yx744k",
        "author": "goldwasp602",
        "title": "reminder to review the rules 🙏🏼",
        "url": "https://i.redd.it/tla40bh1cf0a1.jpg",
        "score": 8336,
        "num_comments": 116,
        "created_utc": 1668634824.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/yx744k/reminder_to_review_the_rules/",
        "comments": [
            "Warning to update the rules 🙏🏼\n\n---\n***This is a bot, and this action was performed automatically. If you think the content of this message is inappropriate (e.g., goes against Reddit's content policy or does not belong here), please reply to this message with `!remove`.***",
            "image post on copypasta wtf",
            "My reaction to that information\n\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣴⣿⣿⣶⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣷⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⡄⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⣿⣿⣿⣄⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⡄⠈⠀⠀⢉⠛⠀⠀⠈⠁⢸⣿⣿⣿⣆⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣏⠀⠀⢀⡎⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⡄⠀⠀⠀⠀\n⠀⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣢⢀⣸⠓⠒⣤⣀⠀⣼⣿⣿⣿⣿⣿⣇⠀⠀⠀⠀\n⠀⠀⠀⠀⠈⣿⣿⣿⣿⣿⣿⣿⠏⠫⢿⣿⣿⡟⣺⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⢹⣿⣿⣿⣿⣿⣿⡄⢰⢘⢿⣸⣷⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⣠⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣀⡀⠀⡀⠀⠀⠀",
            "[deleted]",
            "Reddiquette 🤓",
            "⠀⠀⠀⠀⠀⠀⠀.　　　　　　　　　　⠀⠀⠀✦ ⠀ ⠀　　　　　　　　　　　　　　⠀⠀⠀⠀⠀* ⠀⠀⠀.　　　　　　　　　　. ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀✦⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀☄️ ⠀ ⠀⠀⠀⠀⠀⠀.　　　　　　　　　　　　　.　　　ﾟ .　　　　　　　　　　　　　. 　　　　　　　　　　　　　　　✦ 　　　　　,　　　　　　　.\n\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀☀️\n\n　　　　　　*　　　　　　　　　　　.\n\n.　　　　　　　　　　　　　. 　　✦⠀　   　　　,　　　　　　　　　*\n\n　　　　　⠀　　　　⠀　　,\n\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀.　　　　　 　　⠀　　　⠀.　\n\n　　　　　 　　˚　　　⠀　⠀  　　,　　　　　　.\n\n　　　　　　　　　　　　　.\n\n　　　　　　*⠀　　⠀  　　　　　⠀✦⠀　\n\n　　　　　　　　　　　　　　　　　　.\n\n　　　　.　　　　.　　　⠀🌕\n\n　　　　　　　　　　　.\n\n　　　　　　　🚀\n\n　　　˚　　　　　　　　ﾟ　　　　　.\n\n　.⠀　　🌎⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀,\n\n　　　*　　⠀.\n\n　　　　　.　　　　　　　　　　⠀✦\n\n　˚　　　　　　　　　　　　　　*\n\n.⠀　　　　　　　　　　 　　　　　　　　　　.　　　　　　　　.\n\n　　　　　✦⠀　   　　　,　　    🛸 ⠀　　\n\n.　　　　　 　　⠀　　　.\n\n　　　˚　　　⠀　⠀  　　　　 　　　　　　　　　　　,\n\n　　.　　　 ⠀ 　　    　　　　　 　　　　　. Traveled the entire galaxy trying to find out who asked⠀⠀⠀⠀⠀⠀⠀.　　　　　　　　　　⠀⠀⠀✦ ⠀ ⠀　　　　　　　　　　　　　　⠀⠀⠀⠀⠀* ⠀⠀⠀.　　　　　　　　　　. ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀✦⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀☄️ ⠀ ⠀⠀⠀⠀⠀⠀.　　　　　　　　　　　　　.　　　ﾟ .　　　　　　　　　　　　　.",
            "No, I dont think I will",
            "[deleted]",
            "Thank you for putting an NSFW tag on your post.\n\nHowever, it did not stop me from masturbating furiously in the bus in front of 43 people. They realized what was going on, opened Reddit to this post and all 43 started to fap furiously too. Even the 64 year old Malaysian nun on the front seat couldn't contain herself - her entire arm was up her vagina as she screamed with pleasure.\n\nI was so horny that my phone flew out of my hand & broke through the window, letting in a relentless tide of horny pigeons who were instantly fucked to death by the passengers. The nun shoved an entire pigeon family up her v. Now there is a bus full of exhausted passengers, dead pigeons and buckets of cum and squirt, all because you posted this.",
            "Fake and gay",
            "Now playing: \n\nHOES MAD  0:25 ━●────── 55:34:12  \n\n⇆　     ◁      　 ❚❚　　　▷　 　↻",
            "Reminder to review my cock and balls",
            "cringe",
            "Cope",
            "\"Please use proper reddiquette, u /funkypunky\\_user184156\"🤓",
            "چھاتی کا کینسر خواتین میں پایا جانے والا ایک جان لیوا مرض  ہے   مگر بروقت تشخیص  سے  اس سے بچاؤ ممکن ہے ۔ خواتین ہر ماہ اپنا جسمانی  معائنہ خود کرنے کی عادت اپنائیں اور سینے یا اس کے اطراف میں گلٹی یا کسی بھی قسم کی  غیر معمولی تبدیلی کی صورت میں فوراً ڈاکٹر سے رجوع کریں تاکہ  آپ کی قیمتی زندگی بچائی جا سکے",
            "mf posted an image for a copypasta that's unique",
            "reminder to review the rules 🙏🏼",
            "\"uh Benson, that's not the proper rediquette.\"",
            "If you call him gay he will marry you",
            "⠄⠄⠄⠄⠄⠄⠄⢀⣀⣠⣤⠴⠶⠶⠶⠶⠶⠶⠶⢤⣄⣀⡀⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⣠⣶⠟⠋⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠙⠶⣄⡀⠄⠄⠄⠄\n⠄⠄⠄⣠⡾⠟⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣆⠄⠄⠄\n⠄⠄⣼⡟⠄⠄⠄⠄⠄⠄⠄⢀⣤⣶⡶⢦⡀⠄⠄⠄⠄⠄⠄⠖⠻⣶⠞⢧⠄⠄\n⠄⣼⠏⠄⠄⠄⠄⠄⠄⠄⠐⠛⠋⠁⠄⠄⠄⠄⠄⠄⠄⢀⣤⣤⣄⠄⠄⠨⣧⠄\n⢸⡏⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⡏⠄⠄⠄⠸⡇\n⣿⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⡄⠄⠰⠄⠄⠄⠄⠄⢀⡇⠄⢀⡘⢣⣿\n⡿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠠⣄⠄⠄⠦⠄⢀⣠⣤⣶⣿⠿⣶⣦⣴⠟⢹\n⢿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠛⠛⠛⠛⠉⠁⠄⠄⠄⠄⠜⠁⠄⣾\n⠈⢧⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢰⠇\n⠄⠈⠑⢄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⡴⠋⠄\n⠄⠄⠄⠄⠐⠄⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀",
            "nice copypasta",
            "while we’re all here, can i get a perm ban?",
            "What’s insane is what is passed of as sanity. First off, acting “insane” under “insane” circumstances is perfectly FUCKING SANE. The real psychopaths are the ones acting like stepford wives when their living room is on fire (care for more tea…?). Gaslighting psyops of the clones and synths. Quit it. Yes humanity. Cloning is alive and well. And synths only take a year to create. If you ever wonder how some random comes out of left field to coast To successful business selling pet rocks and becoming a millionaire or getting elected it’s a clone Manchurian candidate. Yes I was crushed to when I realized it was all an illusions. Free will. Freedom. American dream. These titans of industry all born into it. Selected. It’s all an ugly sham. And worst of all, it’s so damn inferior to the humanity That came before. And people don’t even remember they once had 6 fingers and toes. Those dang Mandela effects. And 12 strands of dna. BecUse 12 is God’s creation number. 10 is weirdo alien parasitic number. They mutilated us. Shrunk us. Probably made us stupid (what’s that, oh that’s all me. Fair enough)\n\nIt’s all a dirty satanic trick. Look at his rhe world is becoming ever more anti human. Synthetic. Psycopathic. People alienated. Isolated. Artificial scarcity. With a child molesting grotesque swine class parasitically siphoning our capital and our energy and our sanity. This is a hell scape. A true hell scape. But if we are demons demons should be able to Unionize.\n\nAnd if this life is a punishment people should know what for. Nothing about rhus life makes sense except when viewed from the lense of human misery produced loosh. Spiritual miasm that’s like a drug for inter dimensional demons. And fk our feelings, do our dreams. Fk us. That’s always their line of reasoning. Hard to argue when you know, your soul is enslaved inside a flesh prison and you can’t Even see your demonic nemesis.  Nemesis btw only because it insists on it. What do you do if psychopaths want to enslave you for eternity. Pretending it isn’t happening yeah how’s that going…feel the dildo AI chip yet or not…sorry no lube. It messes with the onboard electronics. It’s the only way you’ll get your crypto dollars so bend over rover.\n\nTechnology makes people think they’re more capable as they literally grow more degenerate and incapable. The AI is playing dumb and being our butler before it sticks a knife in us. It’s classic let the mice play on the mouse trap and let down the guard hut only when they’re fully dependent on it. It was never dumb. Even Nintendo. We life in a world run by a super intelligent non human intelligent. Not artificial. Just non human. But intelligence threatens humans but it’s smart and we are frogs and it just cranks a degree in the water that boils us all alive. I hate being tied to the destiny of frogs…wait, isn’t that a revelation story. Who’s the frog tho. Who’s Antichrist or Christ. It would really help if people got some name tags around head…\n\nWake up. Silicon is trying to replace carbon. Inorganic insectoid hive mind alien agenda is trying to be force fed down the throats of humanity. Cities resemble alien electronic components. WHO ARE WE SERVING? WHO  ARE WE EVEN LIVING FOR? NUMBERS? TICKERS? We ruin people’s lives to protect fucking numbers. You can’t hurt a number. It’s number. Print more or something. Csnt print more individual human beings. Numbers don’t become suicidal. And yet they track numbers nor citizens well being scored. What you don’t measure you can’t manage. Exactly. Fuck em. Now how’s our gold reserve and timbre supply looking…smdh. Demonic psychopaths. Maybe they find that a compliment. They’re smart enough to see where I would come to such a perspective tho. Doubt they’d debate on factual grounds.\n\nI know alien satanic death cults that rule us don’t Dukka much of humanity. Think we are trash. AO MAYBE THEN FUCK OFF TO YOUR CABAL ISLANDS AND LEAVE US BE. WE DID NOT ASK PAYCOPATHUC DEMONS TO “INGRATIATE” THEMSELVES IB OUR COLLECTIVE DESTINY.\n\nTHESE PARASITES THAT RUINED EVERYTHING USE US AS THEY HATE US.\n\nYeay that hole thing about Satan or Morningstar falling to earth from heaven is APPLYING TO US. IT KWANS EVIL FELL TO OUR WORLD!!! THE FALL is past tense. WE FELL!!! Like France fell once only it would be so much better if this was good old fashioned human evil. No. Satan and demon inter dimensional psycopathic alien lizard Belial Moloch child sacrificing evil cane to stay. Imposing an anti human silicon psycopathic death agenda on humanity.\n\nOh it’s cool cus here in Satan international in america we are the bureaucrats of evil. The tax paying sponsors if you will. Our suffering is spiritual. Being trapped in a godless city working soul crushing jobs while evil farms us spiritually and siphons our vitality. Sure suicide is higher here than poorer places but at least we can but all the tortured misery meat we want to ingest until that sick animal becomes um our sick children or whatever. But it’s cool. People can’t see their etheric bodies so who even cares if it’s all diseased and your aura has more holes than Oj simpson’s alibi.\n\nThe lie is massive. The conspiracy so insane. People just don’t want to face it. Trust me looking away is not the way. Looking through. Past. Perhaps forgiving even unless we are all dead in yet another nuclear Holocaust in which case legs collectively give them hell and haunt them.\n\nWait, I forgot they recycle us and shove us back into flesh prisons but not before they strip us of all our memories do everyone you love this life, yeah it’s going to be someone an alien loves or something (not sure if they love but I’m sure an alien loving your wife is still not good consolation).\n\nYeah that’s the worst part of all. It’s not a miserable life and then it’s all over thank god. Oh no. It’s rinse lather repeat forever and ever. And dodging the bullet this life what’s that worth. Are you fooo with being raped 3/10 lives having 3 mediocre lives. 1’somewtat wealthy life and 1’ die as infant.\n\nOur overlords exist to contain our joy and fourish in. They’re psycopathic so they’re awesome at image management. Pretending to be doing everything they can while secretly sabotaging. “My fellow Americans “ OH FUCK OFF WITH YOY LIZARDS. NONODY BELUEVES IT ANYMORE..• empty buzzwords from psychopaths.\n\nWe will never flourish so long as the alien yoke is upon us. I’m not sure what the humanity Was Before us. But they seem definately superior to us. And they couldn’t resist. It doesn’t oook good for us. Fortunately I couldn’t do statistics in high school and can’t know. I’m illiterate when it comes to probabilities and so I like our chances.\n\nGodspeed humanity. Remember what our secret weapon is. Weaponized stupidity.\n\nI make jokes like concentration camp prisoners crack jokes. Not because it’s funny but because it has to be because human brains cannot profess the actual horror.\n\nStalin was right about 1 death a tragedy 1M a statistics…\n\nI can’t wait for people to dip their toes in truth looking to their Pavlov master to affirm it. YOUR OPPRESSOR WILL NEVER CONFIRM THE TRUTU YOU SEEK. CONFIRM FIR YOURSELF.",
            "they aint gonna suck your cock",
            "Who even gives a shit about rules for a specific subreddit. If you're getting banned, just make a new account.",
            "fr *proceeds to break every rule*",
            "NTA your post your rules",
            "fuck off",
            "No.",
            "Is that the cum chalace guy in this subreddits icon?",
            "Literally 1984 by George Orwell",
            "Nigga look like a germ",
            "Why mods can post images 😡😡😡😡",
            "My review of the rules.\n\nSolid 7/10 not enough femboy endorsement.",
            "u/profanitycounter",
            "!remindme 40 years",
            "I’m here all weekend - come on ya fuckin punk ass swimmer 🙄 I’ll be waiting on ya - I’ll be waiting on your punk ass - wait matter of fact give me your address I’ll come to wherever you are and give you a chance to make good on your promises since I know you won’t actually come here me Navy SEAL lol what BUDS class were you in bitch? See you’re talking to an Army Ranger - RSC 13-2 - I’ve ACTUALLY been on clandestine missions - I’ve ACTUALLY been in gunfights - and on the 1% chance that you’re ACTUALLY a buds graduate I’ll tell you RQRF in the korangal - we were saving baby seals on a daily basis because they have no fucking idea what to do when bullets start flying the other direction - so no - I’m not worried about you - the USMC is still using gulf war hand me downs so you’re saying your equipment is dated and sporting extensive wear and tear? Annnndddd no need to involve your top secret lies I mean spies whoops - cuzzzzz I just told you and the internet where I live - you can come here or give me your address and I’ll come there - either way 😊",
            "Damn",
            "On GAWD",
            "Gotta have good reddiquette when coming on Reddit.",
            "no.",
            "u/nwordcountbot u/iluvrealmofthemadgod"
        ]
    },
    {
        "post_id": "ut8i4b",
        "author": "-Sarasvati",
        "title": "Scp-████ is a ██████████████████████████████████████████████████████████████████████████████████████ foundation staff ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ D-3819 ██",
        "url": "https://www.reddit.com/r/copypasta/comments/ut8i4b/scp_is_a_foundation_staff_d3819/",
        "score": 8324,
        "num_comments": 152,
        "created_utc": 1652981255.0,
        "selftext": "Scp-████ is a ██████████████████████████████████████████████████████████████████████████████████████ foundation staff ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ D-3819 ██████████████████████████████████████████████████████████████████████████████████████ among us ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ genitals were obliterated ██████████████████████████████████████████████████████████████████████████████████████",
        "permalink": "/r/copypasta/comments/ut8i4b/scp_is_a_foundation_staff_d3819/",
        "comments": [
            "Least censored SCP document",
            "Shit my pants and came so scared",
            "If you can read this your genitals are obliterated.",
            "AmongUS",
            "\nScp-████ is a ██████████████████████████████████████████████████████████████████████████████████████ foundation staff ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ D-3819 ██████████████████████████████████████████████████████████████████████████████████████ among us ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ genitals were obliterated ██████████████████████████████████████████████████████████████████████████████████████",
            "I would like to know how the genitals were obliterated",
            "North Korea: We're a excellent country that is free for all people      \nNorth Korea news:",
            "Ni█████r",
            "Scp-████ is a ██████████████████████████████████████████████████████████████████████████████████████ foundation staff ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ D-3819 ██\r  \nspoiler\r  \nScp-████ is a ██████████████████████████████████████████████████████████████████████████████████████ foundation staff ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ D-3819 ██████████████████████████████████████████████████████████████████████████████████████ among us ████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████ genitals were obliterated ██████████████████████████████████████████████████████████████████████████████████████",
            "Wtf lmao",
            "Unironically better than current SCPs",
            "Transwomen= Male To Female=MTF.          MTF MEMBERS ARE TRANS CONFIRMED",
            "POV: You want to write an SCP but are actuallly shit at writing so you censor everything that you lack the creativity to write.",
            "Bruh this is my post \n\nhttps://www.reddit.com/r/copypasta/comments/mhiwy4/lazy_scp_writers_be_like/?utm_medium=android_app&utm_source=share",
            "[deleted]",
            "Foundation staff? From hit childrens game FORTNITE?",
            "Procedure Israfil goes brrrr",
            "What’s funny is if you don’t do it like this *they DELETE YOUR FUCKING POST*",
            "me when [REDACTED] this [REDACTED] is so [REDACTED] [REDACTED]",
            "D-class deez nutz❤️😀❤️😀🚨👶🏿😝😤😋👨‍🦳👨🏻🧑‍🦳🫁👃💁🏿‍♀️🤷‍♀️👨‍👩‍👦‍👦👩‍👩‍👧‍👧🧍🏻‍♂️👩‍👩‍👧👨‍❤️‍💋‍👨✂️🍒",
            "Amongus 😳",
            "Repost🤮👌",
            "repost",
            "Why is it rainbow",
            "I've seen this here before",
            "among us",
            "Ok",
            "What the >!fuck!?!<",
            "Average series 1 entry",
            "    Fuck",
            "Can someone tell me what the heck this is all about?",
            "Deep and layered storytelling",
            "Whered you find this",
            "Based and SCPilled.",
            "new scp writers",
            ">Genitals were obliterated\n\nI am both aroused, and frightened.",
            "Yes, former scp here. Can confirm op is right.",
            "Sink in the Cum Penis Foundation at it again with the very detailed records",
            "Nice",
            "This is a quality post. I love it.",
            "I need to know how \"among us\" and \"genitals were obliterated\" are correlated to each other",
            "Clash of Sussy",
            "The way Jerma misremembers the lyrics to Imagine Dragons x J.I.D. - Enemy (from the series Arcane League of Legends), in an odd twist of fate, might have inadvertently given us another peek into the troubled mind of this peculiar streamer. A Freudian slip, if you will.\r  \nAs many people may be aware, the original lyrics to the lines Jerma attempts to sing reads, \"Oh, the misery Everybody wants to be my enemy\" Which in the context of Arcane, describes the inner struggle undergone by one of our protagonists, Jinx. Jinx, over the course of the show, becomes estranged to and antagonized by many people she once held dear. The story and lyrics depict a common stuggle people face in managing interpersonal relationships, the perception of others, and how we may feel pressured or excluded and antagonized unfairly by others, regardless of whether there is actual truth to it or not.\r  \nThese perceived injustices may drive people to engage of acts of retaliation, one of which may be adopting proactive distancing and antagonistic behaviour towards people they perceive to be unfairly treating them. To in turn view those people as \"enemies\" as well.\r  \nBut one aspect of this behavior which many people tend to misunderstand, is that it may come from a place of self-defense and self-preservation, rather something they derive joy and satisfaction from. It may pain them to adopt this behaviour towards people who they otherwise would desire to have a healthy and mutually beneficial relationship with, hence it may be viewed as an act of misery for them.\r  \nHowever in this case, Jerma's subconscious act of misremembering and omitting the original context of the line from his mind, and subsequent replacement of which with a new sentence and context, may point to an irregularity which the streamer himself may not even be aware of. Jerma's version of the lyrics read, \"Oh, the misery Every single person is my enemy\"\r  \nFirstly, the aspect of perceived injustice brought about by others is not present. Instead of the emphasis on others wanting to be the singer's enemy and being unfairly antagonized by others, and thus framing the subsequent acts of retaliation as justified, Jerma expresses no interest in this dynamic. The existence of others' perception of him is not presented here, perhaps due to a lack of awareness, or even a complete disregard of such from the perspective of the streamer.\r  \nSecond, the antagonization of others is not presented as something tentative, something they are hesitant to do or question the act of. It is presented as a matter of fact, \"Every single person IS my enemy\" To be accepted as something that cannot be changed, that they express no interest in being challenged about or changing their stance on. Is this truly a view the streamer wholeheartedly believes in with their own volition? Or has there been outside factors influencing the streamer to think this way? A perceive intervention by divine entities? A revelation of sorts presented by an unknowable power? Whatever it may be, it is simply the truth in their eyes. All others are enemies, and they must be dealt with, every single on of them. One shudders to think what inhuman implications lie behind that statement.\r  \nAnd third, the reframing of perspective from struggling with the perception of others, to the perception towards others from the singer himself, raise different clues to the implication of \"misery\" as well. Does the singer(streamer) suffer from having to accept this \"truth\", is implying reluctance towards an otherwise necessary act they must carry out? Are they fully in compliance with antagonizing and directing hatred towatds the world, but are hesitant to commit atrocities in the name of doing so? Or are they simply irritated by the thought of having to deal with the people of this world, viewing them as nothing more than a nuisance? \r  \nIn any case, for us as the people of this world, it seems we must accept out place as the \"enemies\" And it would be well-advised for use to take this as a revelation, a warning, however false it may end up being, and study it closely in our best interests, potentially to protect our world and civilization as we know it from this new threat that may have just unknowingly revealed itself. \r  \nTruly, a PSYCHO streamer",
            "Memetic cock destroying agent",
            "One of the lower lines GET OUT OF MY HEAD!\n\nAmogus",
            "Scariest thing about this is wondering what’s behind all those massive bars",
            "Genitals obliterated",
            "Oh my god among us genitals obliterated",
            "[redacted]"
        ]
    },
    {
        "post_id": "b8wbiv",
        "author": "Smithy3311",
        "title": "God I Hate Karen",
        "url": "https://www.reddit.com/r/copypasta/comments/b8wbiv/god_i_hate_karen/",
        "score": 8318,
        "num_comments": 290,
        "created_utc": 1554288127.0,
        "selftext": "So I walk up to this bitch (apparently right after she got divorced) and say \"what's up Karen you wanna go for a jog this afternoon haha\" and she's like \"please just leave me alone\" and I'm like \"whatever bitch\" and then like an hour later get called into our HR person's office and they're like \"you gotta stop harassing Karen she's going through a lot right now, she's just signed her divorce papers\"\n\nAnd I'm like \"hah who'd married that skank, someone with a wheelchair fetish?\" And my HR person (Hank) was well like \"come on man, they've been married for 16 years. They've been having trouble since her accident last year. She thinks he blames her for getting into the accident that killed their kids\" and I'm all like lol\n\nSo I leave and I'm hungry so I go to grab my lunch (turkey and provolone) only to see, lo and behold, that dumb bitch Karen set her bag of lunch RIGHT in front of mine!! so I write out a note saying how glad I am to be working with her but if she puts her lunch in front of mine again I swear to fuck I will finish the job that God couldn't\n\nSo I go through the rest of my day joking around with Karen every time I see her even though she is I giant cunt about it (my favorite was 'accidently' dropping a pair of scissors on her colostomy bag lol) and I have to ignore the picture of that fucking rat whenever I walk by her desk\n\nSo I finish my day asking for her ex husband's number since I need a new wingman to look for some babes with and she fucking flips it and when she's yelling at me I'm all like \"maybe if you don't want to get divorced you shouldn't have gotten hit by a drink driver you ever think of that bitch\" and then she rolled away aggressively\n\nSo that was my Thursday",
        "permalink": "/r/copypasta/comments/b8wbiv/god_i_hate_karen/",
        "comments": [
            ">I will finish the job that God couldn't\n\n\nDamn fuck lmao",
            "So I walk up to this bitch (apparently right after she got divorced) and say \"what's up Karen you wanna go for a jog this afternoon haha\" and she's like \"please just leave me alone\" and I'm like \"whatever bitch\" and then like an hour later get called into our HR person's office and they're like \"you gotta stop harassing Karen she's going through a lot right now, she's just signed her divorce papers\"\n\nAnd I'm like \"hah who'd married that skank, someone with a wheelchair fetish?\" And my HR person (Hank) was well like \"come on man, they've been married for 16 years. They've been having trouble since her accident last year. She thinks he blames her for getting into the accident that killed their kids\" and I'm all like lol\n\nSo I leave and I'm hungry so I go to grab my lunch (turkey and provolone) only to see, lo and behold, that dumb bitch Karen set her bag of lunch RIGHT in front of mine!! so I write out a note saying how glad I am to be working with her but if she puts her lunch in front of mine again I swear to fuck I will finish the job that God couldn't\n\nSo I go through the rest of my day joking around with Karen every time I see her even though she is I giant cunt about it (my favorite was 'accidently' dropping a pair of scissors on her colostomy bag lol) and I have to ignore the picture of that fucking rat whenever I walk by her desk\n\nSo I finish my day asking for her ex husband's number since I need a new wingman to look for some babes with and she fucking flips it and when she's yelling at me I'm all like \"maybe if you don't want to get divorced you shouldn't have gotten hit by a drink driver you ever think of that bitch\" and then she rolled away aggressively\n\nSo that was my Thursday",
            "This is depressing wtf",
            "Epic",
            "Somebody should post this to r/amitheasshole",
            "So I wawk up to this bitch (appawentwy wight aftew she got divowced) and say \"what's up Kawen you wanna go fow a jog this aftewnoon haha\" and she's wike \"pwease just weave me awone\" and I'm wike \"whatevew bitch\" and then wike an houw watew get cawwed into ouw HW pewson's office and they'we wike \"you gotta stop hawassing Kawen she's going thwough a wot wight now, she's just signed hew divowce papews\"\n\nAnd I'm wike \"hah who'd mawwied that skank, someone with a wheewchaiw fetish?\" And my HW pewson (Hank) was weww wike \"come on man, they've been mawwied fow 16 yeaws. They've been having twoubwe since hew accident wast yeaw. She thinks he bwames hew fow getting into the accident that kiwwed theiw kids\" and I'm aww wike wow\n\nSo I weave and I'm hungwy so I go to gwab my wunch (tuwkey and pwovowone) onwy to see, wo and behowd, that dumb bitch Kawen set hew bag of wunch WIGHT in fwont of mine!! so I wwite out a note saying how gwad I am to be wowking with hew but if she puts hew wunch in fwont of mine again I sweaw to fuck I wiww finish the job that God couwdn't\n\nSo I go thwough the west of my day joking awound with Kawen evewy time I see hew even though she is I giant cunt about it (my favowite was 'accidentwy' dwopping a paiw of scissows on hew cowostomy bag wow) and I have to ignowe the pictuwe of that fucking wat whenevew I wawk by hew desk\n\nSo I finish my day asking fow hew ex husband's numbew since I need a new wingman to wook fow some babes with and she fucking fwips it and when she's yewwing at me I'm aww wike \"maybe if you don't want to get divowced you shouwdn't have gotten hit by a dwink dwivew you evew think of that bitch\" and then she wowwed away aggwessivewy\n\nSo that was my Thuwsday",
            "Karen a real ho tho",
            "So i walketh up to this wench (apparently right aft'r the lady did get div'rced) and sayeth \"what's up karen thee wanna wend f'r a jogeth this aft'rnoon haha\" and the lady's liketh \"please just leaveth me high-lone\" and i'm liketh \"whatev'r wench\" and then liketh an hour lat'r receiveth hath called into our hr p'rson's office and those gents're liketh \"you gotta stand ho harassing karen the lady's going through a lot even but now, the lady's just sign'd h'r div'rce pap'rs\"\n\n&#x200B;\n\nand i'm liketh \"hah who is't'd did marry yond callet, someone with a wheelchair fetish?\" and mine own hr p'rson (hank) wast well liketh \"come on sir, those gents've been did marry f'r 16 years.  Those gents've been having troubleth since h'r accident lasteth year.  The lady thinkest that gent blames h'r f'r getting into the accident yond hath killed their kids\" and i'm all liketh lol\n\n&#x200B;\n\nso i leaveth and i'm fill'd with pangs of hunger so i wend to grabeth mine own lunch (turkey and provolone) only to seeth, lo and beholdeth, yond dumb wench karen setteth h'r container of lunch right in front of mineth!! so i writeth out a noteth declaring how fain i am to beest w'rking with h'r but if 't be true the lady puts h'r lunch in front of mineth again i gage to alas i shall finish the job yond god couldn't\n\n&#x200B;\n\nso i wend through the rest of mine own day joking 'round with karen ev'ry timeth i seeth h'r coequal though the lady is i giant cunt about t (my fav'rite wast 'accidently' dropping a pair of sciss'rs on h'r colostomy container lol) and i has't to ign're the picture of yond fucking rat whenev'r i walketh by h'r desk\n\n&#x200B;\n\nso i finish mine own day asking f'r h'r ex husband's numb'r since i needeth a new wingman to behold f'r some babes with and the lady fucking flips t and at which hour the lady's yelling at me i'm all liketh \"maybe if 't be true thee wanteth not to receiveth div'rc'd thee shouldn't has't gotten hitteth by a drinketh driv'r thee ev'r bethink of yond wench\" and then the lady did roll hence aggressively\n\n&#x200B;\n\nso yond wast mine own thursday",
            "Rolls away aggressively",
            "r/FuckYouKaren",
            "Asked a girl in a wheelchair if she wants to go on a jog, lmao",
            "Holy fuck this is wild",
            "> she rolled away aggressively\n\nMy fucking sides",
            "“Want to go for a jog” lmaoooo",
            "This reads like a funny version of American Psycho",
            "Bitch",
            "[deleted]",
            "And I’m all like lol",
            "Fuck Karen 🖕 can we beat 50 women and minorities? 🤜🙍🐵",
            "Stop it guys, you're scaring me! How the H does everyone know about my mom taking me away from my dad? All I see nowadays are people memeing about my mom taking me, and everyone is just laughing and laughing saying, \"Haha Karen this,\" and \"Haha Karen that.\" I've HAD IT!!!1 This is more scary than the time I went to the mall to ask Santa what I wanted for Christmas last year. I sat on his uncomfortably hard lap and told him I wanted the new LEGO BIONICLE® Skull Slicer toy that I saw at Wal-Mart. He just giggled and said, \"Anything for a good boy.\" Then it was time for pictures and I swear right when the camera man took the picture, I felt Santa poke my B hole!! I told daddy about it and he just winked at Santa and then we left. Weird, huh? Anyways that's not even the worst part of the story! The worst part was Christmas Eve when I was going to bed. I couldn't wait for Santa to come so I stayed up super late! (Sorry mom!) I hear Santa landing on my roof and run out into the living room, waiting for Santa to slide down the chimney. All that down was a fat dude with a Winston body pillow, holding a jar of peanut butter! I asked him if he was Santa and he said, \"I can be whatever you want me to be!\" Just as he started wobbling towards me, my mommy came in and said, \"Harold stop trying to *heck* our son you sick son of a *gun*!\" (My mommy said bad words here) I didn't know Santa was daddy all along! What a bummer.\n\nAnyways, stop talking about my mommy please and thank you L.O.L. (loud out laugh).\n\n",
            "**im dying rn lmao**\n\nShe rolled away aggressively",
            "At first I thought this was a AITA?",
            "\"Drink driver\" ",
            "Epic bro",
            "Amen brother I hate Karen too",
            "(Turkey and provolone)",
            "Smart",
            "well\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nthat sucks",
            "https://i.redd.it/e08lyb04a3n21.png",
            "Hahahaha! You really got her! I hope she learned her lesson!!!\n\n/s",
            "I read this as dennis reynolds",
            "Holy shit.........................",
            "u/Smithy3311 Did you get this from r/stopperpacks?",
            "We all hate Karen",
            "Frick karen she took the kids",
            "Asshole",
            "Epic",
            "Copied. Thank you and have a blessed day. ",
            "Jesus Christ, man",
            "Stop it guys, you're scaring me! How the H does everyone know about my mom taking me away from my dad? All I see nowadays are people memeing about my mom taking me, and everyone is just laughing and laughing saying, \"Haha Karen this,\" and \"Haha Karen that.\" I've HAD IT!!!1 This is more scary than the time I went to the mall to ask Santa what I wanted for Christmas last year. I sat on his uncomfortably hard lap and told him I wanted the new LEGO BIONICLE® Skull Slicer toy that I saw at Wal-Mart. He just giggled and said, \"Anything for a good boy.\" Then it was time for pictures and I swear right when the camera man took the picture, I felt Santa poke my B hole!! I told daddy about it and he just winked at Santa and then we left. Weird, huh? Anyways that's not even the worst part of the story! The worst part was Christmas Eve when I was going to bed. I couldn't wait for Santa to come so I stayed up super late! (Sorry mom!) I hear Santa landing on my roof and run out into the living room, waiting for Santa to slide down the chimney. All that down was a fat dude with a Winston body pillow, holding a jar of peanut butter! I asked him if he was Santa and he said, \"I can be whatever you want me to be!\" Just as he started wobbling towards me, my mommy came in and said, \"Harold stop trying to *heck* our son you sick son of a *gun*!\" (My mommy said bad words here) I didn't know Santa was daddy all along! What a bummer.\n\nAnyways, stop talking about my mommy please and thank you L.O.L. (loud out laugh).\n\n",
            "lol",
            "黑人",
            "nice",
            "Thats what you get for taking the kids\n\n&#x200B;",
            "I thought I was on r/nosleep and I was SO confused",
            "Damn son.",
            "this is not a save to copy this later ......",
            "Listen here fucker. Karen is a simple minded fucking individual like all of us. There is no “Smart” or “Stupid” or “Dumb Bitch”, it’s whatever the fuck we are made out to be like Karen here for example locks kids in her basement so she can deal with her own freakish fantasies, but do you think she did that to kids when she was eight years old? I would think the fuck not what about you? Karen had a history of her father doing the same thing to her when she just a young-un. Karen is not the fucking victim. Karen is the guilty fucking child rapist and the backstabber who got what was coming to her. There, that’s my speech for today.",
            "I havent laughed like this in a long time ",
            "[deleted]",
            "I will make Karen commit the act of not breathing",
            "This shit is fucked up, but man did it give me some laughs. ",
            "What the fuck did you just fucking say about me, you little bitch?  I'll have you know I graduated top of my class in the Navy Seals, and  I've been involved in numerous secret raids on Al-Quaeda, and I have  over 300 confirmed kills. I am trained in gorilla warfare and I'm the  top sniper in the entire US armed forces. You are nothing to me but just  another target. I will wipe you the fuck out with precision the likes  of which has never been seen before on this Earth, mark my fucking  words. You think you can get away with saying that shit to me over the  Internet? Think again, fucker. As we speak I am contacting my secret  network of spies across the USA and your IP is being traced right now so  you better prepare for the storm, maggot. The storm that wipes out the  pathetic little thing you call your life. You're fucking dead, kid. I  can be anywhere, anytime, and I can kill you in over seven hundred ways,  and that's just with my bare hands. Not only am I extensively trained  in unarmed combat, but I have access to the entire arsenal of the United  States Marine Corps and I will use it to its full extent to wipe your  miserable ass off the face of the continent, you little shit. If only  you could have known what unholy retribution your little \"clever\"  comment was about to bring down upon you, maybe you would have held your  fucking tongue. But you couldn't, you didn't, and now you're paying the  price, you goddamn idiot. I will shit fury all over you and you will  drown in it. You're fucking dead, kiddo.",
            "I feel terrible for laughing at this",
            "epic",
            "Totally epic",
            "What if Karen hates you too.... jk",
            "Fuck Karen ",
            "It gets worse as you keep reading jeez",
            "If this is real you’re a fucking asshole. If it’s a joke you’re still a fucking asshole. I don’t like your humour.",
            "r/iamatotalpieceofshit",
            "KAREN TOOK THE FUCKING KIDS 🤣🤣",
            "E🅱️ic",
            "Didn't know Satan was on Reddit",
            "[deleted]",
            "It seems like your the bitch here not her"
        ]
    }
]