[
    {
        "post_id": "cueu68",
        "author": "Fighter1000",
        "title": "I've become a god at my school. (r/teenagers is a \"fun\" place)",
        "url": "https://www.reddit.com/r/copypasta/comments/cueu68/ive_become_a_god_at_my_school_rteenagers_is_a_fun/",
        "score": 8306,
        "num_comments": 230,
        "created_utc": 1566571428.0,
        "selftext": "School has barely started and I'm already hailed as a god.\n\nA little context. I'm not too popular. I'm always that one nerd kid, and the only time people would hear about me is if I won a math competition.\n\nWell this year I changed that.\n\nMy school has posters up saying \"We encourage you to use your phones, tablets, and laptops.\" The last one is what caught my eye. Because my school allows us to use our devices during lunch.\n\nSo I brought my laptop to school. For my first couple classes I would jokingly ask if I could use my laptop. But when lunch came around. Then things got good. I sat down at my normal lunch table and pulled out my laptop. Immediately people started eyeing me. Next I booted up my laptop. Now people were watching. Finally I got onto Minecraft and played some Hypixel Bedwars. I slowly gathered a crowd, and eventually people started chearing when I was winning.\n\nWhen I won everyone went ballistic.\n\nAnd that's how I became a god.\n\n[Source](https://redd.it/cucxzx)",
        "permalink": "/r/copypasta/comments/cueu68/ive_become_a_god_at_my_school_rteenagers_is_a_fun/",
        "comments": [
            "I was hoping the OP was being ironic, then I checked his post history. Delightfully surprised",
            "That laptop’s name? Albert Einstein",
            "As 100%-real-totally-happened-guys as this sounds there were plenty of moments at my high school where kids crowded around and cheered for something dumb. Like that video of those kids losing their shit over the kids playing with beyblades",
            "Schoow has bawewy stawted and I'm awweady haiwed as a god.\n\nA wittwe context. I'm not too popuwaw. I'm awways that one newd kid, and the onwy time peopwe wouwd heaw about me is if I won a math competition.\n\nWeww this yeaw I changed that.\n\nMy schoow has postews up saying \"We encouwage you to use youw phones, tabwets, and waptops.\" The wast one is what caught my eye. Because my schoow awwows us to use ouw devices duwing wunch.\n\nSo I bwought my waptop to schoow. Fow my fiwst coupwe cwasses I wouwd jokingwy ask if I couwd use my waptop. But when wunch came awound. Then things got good. I sat down at my nowmaw wunch tabwe and puwwed out my waptop. Immediatewy peopwe stawted eyeing me. Next I booted up my waptop. Now peopwe wewe watching. Finawwy I got onto Minecwaft and pwayed some Hypixew Bedwaws. I swowwy gathewed a cwowd, and eventuawwy peopwe stawted cheawing when I was winning.\n\nWhen I won evewyone went bawwistic.\n\nAnd that's how I became a god.\n\n[Souwce](https://wedd.it/cucxzx)",
            "Woah guys this is so epic, it's so epic he won bedwars in school!!!! DUDE!!! School!",
            "Yeah, the god of preschool in the church",
            "School has barely started and I'm already hailed as a god.\n\nA little context. I'm not too popular. I'm always that one nerd kid, and the only time people would hear about me is if I won a math competition.\n\nWell this year I changed that.\n\nMy school has posters up saying \"We encourage you to use your phones, tablets, and laptops.\" The last one is what caught my eye. Because my school allows us to use our devices during lunch.\n\nSo I brought my laptop to school. For my first couple classes I would jokingly ask if I could use my laptop. But when lunch came around. Then things got good. I sat down at my normal lunch table and pulled out my laptop. Immediately people started eyeing me. Next I booted up my laptop. Now people were watching. Finally I got onto Minecraft and played some Hypixel Bedwars. I slowly gathered a crowd, and eventually people started chearing when I was winning.\n\nWhen I won everyone went ballistic.\n\nAnd that's how I became a god.\n\n[Source](https://redd.it/cucxzx)",
            "Man just as we thought cringe kids were gone from minecraft",
            "\nteenagers is a copypasta goldmine",
            "Oh wait guys that's technoblade on r/teenagers",
            "how tf do u win bedwars at school on their wifi? bullshiiit",
            "Then they fucked violently while the freshmen watched 💁 But she got impregnated and didn't want to have an abortion so she had the kid, and used the baby's stomach as a portable pocket to carry her cigarettes around without getting caught. 😦Eventually, the baby developed lung cancer and died. Outraged, the girl begged the kid for another baby. But it was too late for that, for he had become a tobacco addict as well and his dick had gone forever limp.\nMoral of the story: don't smoke!! 🤗",
            "Yeah but did everyone clap? What kind of god doesn't get a standing ovation from their disciples??? 0/10 nice try kid :)",
            "Who doesn't love the minecraft good fortnite bad circlejerk? Unsubbed from r/teenagers a long time ago, it's filled with crappy fakestories lmao",
            "He’s literally technoblade",
            "Le Epic minecraft moment 😎",
            "u/lisptranslator",
            "Best comment on the post: \nEveryone clapped, Obama was there, you got to go home early, great day",
            "I‘m convinced this sub is filled with 14-16 year olds and I love it",
            "Fuck I can relate to this a bit, I built up a mini following by playing cs:go during our lunch breaks",
            "Imma commit alt+f4",
            "That hurt to read holy shit",
            "I want to make fun of this guy but I just feel awful for him",
            "I play minecraft at school everyday on my survival world and people pass by and make suggestions",
            "I did this shit junior year but with world of Warcraft. God that was awesome. I could just pretend to work, when in reality I was max leveling my dwarf paladin",
            "r/nothowgodworks",
            "Yooo the teenagers post was right below this one, what sorcery is this",
            "I saw this earlier lol",
            "Say this today",
            "Is the first part of the zone still guaranteed on kick?",
            "u/uwutranslator",
            "My friends and I just discovered bed wars and it’s honestly so damn fun",
            "Yeah right he can run minecraft hypixel on school wifi",
            "could this be gayer",
            "r/technoblade",
            "I became a God because my brother sold acid.",
            "L",
            "I saw op's post history and yes, he's awkward",
            "not gonna lie when i first saw this post on r/teenagers i knew it was gonna be a copypasta",
            "Is this ironic ?",
            "I would not be surprised if this was technoblades reddit account",
            "School has really changed since I went",
            "reddit moment",
            "My dumbass downvoted this before realising this is r/copypastas",
            "A GOLDEN GOD!!!!",
            "Imagine making up fake stories on the internet for strangers to get validation.",
            "Oh no not bedwars!",
            "r/teenagers feels like it's run by prepubescent kids, because no teenager I've met posts such cringe on the internet.",
            "Nice",
            "[deleted]",
            "Ironically enough a kid started bringing his laptop to lunch",
            "Later, virgins."
        ]
    },
    {
        "post_id": "lkuf0m",
        "author": "josegonzalez2008",
        "title": "Sent this if someone say \"downvoted for emoji\"",
        "url": "https://www.reddit.com/r/copypasta/comments/lkuf0m/sent_this_if_someone_say_downvoted_for_emoji/",
        "score": 8298,
        "num_comments": 148,
        "created_utc": 1613445237.0,
        "selftext": "Emoji?!🤯🤯1!?🤮🤮🤮WTF😭11!1😭😭😭!!?1?😭😢 emoji police🚨!1!!1🚨👮‍♂️👮‍♂️!!11!👮‍♂️👮‍♂️Get out 🏃‍♀️🏃‍♀️💨💨💨 of this sub 😡😡🤬!?!1can't like cuz it's 69 😏!!1!!1!😏😏!!😏69?!?! 😳😳😳😳 Noice!!1!!😂😂1!1😂😂 You don't find it funny 😳🤬🤬🤬😏 Ur a instragam normie!!!1😂😂😂😜😜🤡🤡🤓 Lololol 😂😎😂lol😎😂lol😎😊😎 Elon Musk!!!11!! Chungus Funny 😂😂lmoa😛😜mao😜 Keanu!1!!1!1!! 🤩🤩🤩 Momement wholesome 100😊😊😊😍😍😍Stunksss !!11! 📈📉📈📉📈 [everyone liked that] 👍👍👍👍👍 Ur sus😤😤sus😤😤sus😤Why you don't laugh?!1??1?1!!😡😡🤬🤬 it's an amogus referenc !!?1?!🤬🤬🤬🤬 Sus sus 😂😂sus sus !1!!11!😢😢😭😭😢😭😭😭ejected: imopter 😎😎👊👊👊👊 you 🧑👈👈👈👈 still don't get it 🤔🤔🙄😤🤡🤡cringe based!1!1!11 cringe cringe !111!1!11!!!cringe 🤡🤡🤡🤡🤡🤡 sherk is awesome 😎😎😎😎😎 best movie in the worldo 🏆🏆🎖🎖🎖🏅🥇🥇 what? You play fortnite? 🤔🤔🤯🤯😬😬 More like fartnite 😂😂😂😊😊😂😂 also you watch tik tuk 😳😳😳😳 ewwwwww 🤢🤢🤢🤢🤢🤢 you don't like dogs? 🐶🐶🤔🤔🙄😤😳😳What a piece of human trash🗑🗑🗑🗑🗑🗑🗑 10.000 of evolution🦍👨👴 for this sub human 🤢🤢🤢🤮🤮🤬🤬trash we must kill u,🔫🔫🔫🔫🔫 after this, Reddit will destroy 👊👊👊👊👊 all goverments 👿1!!1!!👿!1!!11👿 and become God!! 😡🤯🤯!11🤯😨!11😩😵\n\nEdit: Thanks for the first Upvote\n\nEdit: thanks for the second Upvote\n\nEdit: Thanks for the 178th Upovte\n\nEdit: Thansk for the silver award\n\nEdit: Thanks for the gold kind stranger\n\nEdit: Thanks for the 187273929th upvote\n\nEdit: Now this comment has more upvotes than the human population thank u guys 😗😗✌✌✌✌",
        "permalink": "/r/copypasta/comments/lkuf0m/sent_this_if_someone_say_downvoted_for_emoji/",
        "comments": [
            " **Your post has not been given the gold award**\n\nAn anonymous redditor hated your post so much that they have not given it the Gold award.\n\nAs a reward, you have no special flair on your post. Additionally, you get zero weeks Premium and and zero counts to improve your experience. How sad. :(\n\n**Reddit Un-Premium benefits**\n\n* Experience Reddit ads on the web and apps\n* Restrictions from the members only [r/Lounge](https://www.reddit.com/r/Lounge/)\n* Buy the monthly Premium subscription you pleb\n\n**How to use your zero Coins**\n\nYou can use your zero coins to copy and paste the Braille gold copypasta on posts and comments that are shit, cum, piss or whatever.\n\n* Press the Give Award button beneath the post or comment for a reminder of how broke you are, it’s that easy!\n\nWant to say fuck to your mysterious assaulter? Reply to this message. They will not message you back lmao.",
            "Downvoted for emoji",
            "Wow did you actually post that a wholesome 100, everyone liked that, Keanu Chungus Musk, area 51, PornHub, Anti-Vaxxers, Marvel, Minecraft good Fortnite bad, \"because that's what heroes do\", to deserve new poop and doggos meme? Did you actually post that shit? DID YOU?! DID YOU ACTUALLY POST THAT SHIT, YOU MOTHERFUCKER?! YOU SON OF A BITCH?! HAHAHAHAHAHAHA OHOH HAHAHAHAHA THIS IS A REDDIT MOMENT. THIS IS A FUCKING REDDIT MOMENT. OH GAWD HAHAHAHA!!!!!",
            "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣤⣤⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⠟⠉⠉⠉⠉⠉⠉⠉⠙⠻⢶⣄⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⡟⠀⣠⣶⠛⠛⠛⠛⠛⠛⠳⣦⡀⠀⠘⣿⡄⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠁⠀⢹⣿⣦⣀⣀⣀⣀⣀⣠⣼⡇⠀⠀⠸⣷⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡏⠀⠀⠀⠉⠛⠿⠿⠿⠿⠛⠋⠁⠀⠀⠀⠀⣿⡄⣠ ⠀⠀⢀⣀⣀⣀⠀⠀⢠⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡇⠀ ⠿⠿⠟⠛⠛⠉⠀⠀⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣧⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⠀ ⠀⠀⠀⠀⠀⠀⠀⣾⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠀⠀⠀⠀⠀⠀⠀⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠀⠀⠀⠀⠀⠀⢰⣿⠀⠀⠀⠀⣠⡶⠶⠿⠿⠿⠿⢷⣦⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠀⠀⣀⣀⣀⠀⣸⡇⠀⠀⠀⠀⣿⡀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⣿⠀ ⣠⡿⠛⠛⠛⠛⠻⠀⠀⠀⠀⠀⢸⣇⠀⠀⠀⠀⠀⠀⣿⠇⠀⠀⠀⠀⠀⠀⣿⠀ ⢻⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡟⠀⠀⢀⣤⣤⣴⣿⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠈⠙⢷⣶⣦⣤⣤⣤⣴⣶⣾⠿⠛⠁⢀⣶⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡟⠀ ⢷⣶⣤⣀⠉⠉⠉⠉⠉⠄⠀⠀⠀⠀⠈⣿⣆⡀⠀⠀⠀⠀⠀⠀⢀⣠⣴⡾⠃⠀ ⠀⠈⠉⠛⠿⣶⣦⣄⣀⠀⠀⠀⠀⠀⠀⠈⠛⠻⢿⣿⣾⣿⡿⠿⠟⠋⠁⠀⠀⠀",
            "Emoji 😋🤯🤯1 😳😡🤮🤮🤮WTF😭11 🤬😡1😭😭😭 😩😳🥵1 💀😭😢 emoji police🚨 😳🤪😡1 💀😳1🚨👮‍♂️👮‍♂️ 🐈11 😳😡🤪👮‍♂️👮‍♂️Get out 🏃‍♀️🏃‍♀️💨💨💨 of this sub 😡😡🤬 🐈🐻1can't like cuz it's 69 😏 🤪💀🙄1 💀😳😩1 💀😏😏 😳😡😏69 😳😡🥵 😳😳😳😳 Noice 🤩👀💥1 💀😳😂😂1 😳1😂😂 You don't find it funny 😳🤬🤬🤬😏 Ur a instragam normie 🤣1😂😂😂😜😜🤡🤡🤓 Lololol 😂😎😂lol😎😂lol😎😊😎 Elon Musk 😜🤪😋11 😳😡 Chungus Funny 😂😂lmoa😛😜mao😜 Keanu 👻😳1 💀😳😩1 💀😳1 💀😳😩 🤩🤩🤩 Momement wholesome 100😊😊😊😍😍😍Stunksss  🥵😍11 😳😡 📈📉📈📉📈 [everyone liked that] 👍👍👍👍👍 Ur sus😤😤sus😤😤sus😤Why you don't laugh 🙄1 💀1 💀😳1 💀😡😡🤬🤬 it's an amogus referenc  😳1 💀😳😩🤬🤬🤬🤬 Sus sus 😂😂sus sus  🤬❌1 💀😳😩11 😳😡😢😢😭😭😢😭😭😭ejected: imopter 😎😎👊👊👊👊 you 🧑👈👈👈👈 still don't get it 🤔🤔🙄😤🤡🤡cringe based 👄1 💀1 💀😳😩11 cringe cringe  😱111 💘1 💀😳😩11 😳😡cringe 🤡🤡🤡🤡🤡🤡 sherk is awesome 😎😎😎😎😎 best movie in the worldo 🏆🏆🎖🎖🎖🏅🥇🥇 what 🎥😱🤣 You play fortnite 🤪 🤔🤔🤯🤯😬😬 More like fartnite 😂😂😂😊😊😂😂 also you watch tik tuk 😳😳😳😳 ewwwwww 🤢🤢🤢🤢🤢🤢 you don't like dogs 😻🐶 🐶🐶🤔🤔🙄😤😳😳What a piece of human trash🗑🗑🗑🗑🗑🗑🗑 10 🤬😡000 of evolution🦍👨👴 for this sub human 🤢🤢🤢🤮🤮🤬🤬trash we must kill u 😡👄😳🔫🔫🔫🔫🔫 after this 👄😳🥴 Reddit will destroy 👊👊👊👊👊 all goverments 👿1 💨1 💀😳😩👿 😳1 💀😳😩11👿 and become God 😩 😡🤯🤯 😳11🤯😨 😳😡11😩😵\n\nEdit: Thanks for the first Upvote\n\nEdit: thanks for the second Upvote\n\nEdit: Thanks for the 178th Upovte\n\nEdit: Thansk for the silver award\n\nEdit: Thanks for the gold kind stranger\n\nEdit: Thanks for the 187273929th upvote\n\nEdit: Now this comment has more upvotes than the human population thank u guys 😗😗✌✌✌✌ 🚨📢💜",
            "I am awaiting the tsunami of r/redditmoment coments",
            "Emoji?!🤯🤯1!?🤮🤮🤮WTF😭11!1😭😭😭!!?1?😭😢 emoji powice🚨!1!!1🚨👮‍♂️👮‍♂️!!11!👮‍♂️👮‍♂️Get out 🏃‍♀️🏃‍♀️💨💨💨 of this sub 😡😡🤬!?!1can't wike cuz it's 69 😏!!1!!1!😏😏!!😏69?!?! 😳😳😳😳 Noice!!1!!😂😂1!1😂😂 You don't find it funny 😳🤬🤬🤬😏 Uw a instwagam nowmie!!!1😂😂😂😜😜🤡🤡🤓 Wowowow 😂😎😂wow😎😂wow😎😊😎 Ewon Musk!!!11!! Chungus Funny 😂😂wmoa😛😜mao😜 Keanu!1!!1!1!! 🤩🤩🤩 Momement whowesome 100😊😊😊😍😍😍Stunksss !!11! 📈📉📈📉📈 [evewyone wiked that] 👍👍👍👍👍 Uw sus😤😤sus😤😤sus😤Why you don't waugh?!1??1?1!!😡😡🤬🤬 it's an amogus wefewenc !!?1?!🤬🤬🤬🤬 Sus sus 😂😂sus sus !1!!11!😢😢😭😭😢😭😭😭ejected: imoptew 😎😎👊👊👊👊 you 🧑👈👈👈👈 stiww don't get it 🤔🤔🙄😤🤡🤡cwinge based!1!1!11 cwinge cwinge !111!1!11!!!cwinge 🤡🤡🤡🤡🤡🤡 shewk is awesome 😎😎😎😎😎 best movie in the wowwdo 🏆🏆🎖🎖🎖🏅🥇🥇 what? You pway fowtnite? 🤔🤔🤯🤯😬😬 Mowe wike fawtnite 😂😂😂😊😊😂😂 awso you watch tik tuk 😳😳😳😳 ewwwwww 🤢🤢🤢🤢🤢🤢 you don't wike dogs? 🐶🐶🤔🤔🙄😤😳😳What a piece of human twash🗑🗑🗑🗑🗑🗑🗑 10.000 of evowution🦍👨👴 fow this sub human 🤢🤢🤢🤮🤮🤬🤬twash we must kiww u,🔫🔫🔫🔫🔫 aftew this, Weddit wiww destwoy 👊👊👊👊👊 aww govewments 👿1!!1!!👿!1!!11👿 and become God!! 😡🤯🤯!11🤯😨!11😩😵\n\nEdit: Thanks fow the fiwst Upvote\n\nEdit: thanks fow the second Upvote\n\nEdit: Thanks fow the 178th Upovte\n\nEdit: Thansk fow the siwvew awawd\n\nEdit: Thanks fow the gowd kind stwangew\n\nEdit: Thanks fow the 187273929th upvote\n\nEdit: Now this comment has mowe upvotes than the human popuwation thank u guys 😗😗✌✌✌✌",
            "WOW kid you just got r/WOOOOOOSHED!!!! 😂😂👀 “Wooosh” means you didn’t get the joke, as in the sound made when the joke “woooshes” over your head. I bet you’re too stupid to get it, IDIOT!! 😤😤😂 My joke was so thoughtfully crafted and took me a total of 3 minutes, you SHOULD be laughing. 🤬 What’s that? My joke is bad? I think that’s just because you failed. I outsmarted you, nitwit.🤭 In conclusion, I am posting this to the community known as “R/Wooooosh” to claim my internet points in your embarrassment 😏. Imbecile. The Germans refer to this action as “Schadenfreude,” which means “harm-joy” 😬😲. WOW! 🤪 Another reference I had to explain to you. 🤦‍♂️🤭 I am going to cease this conversation for I do not converse with simple minded persons.😏😂",
            "!emojify",
            "I do dislike emojis. I got that trait from Google+. \n\nIf the worst part of my personality that I gained from Google+ was hating emojis and TikTok, well, we should all be pretty happy. I could've come out of there unleashing vore fetish comments upon the reddit masses.\n\nNow pleaae, just let me hate things for no good reason in peace.",
            "[deleted]",
            "downvoted for emoji  😡😡🤬🤬",
            "\n    ██████████                                  ,▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████████\n    ██████████                             ,╓▄▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████████\n    ██████████                          ,▄▒▓▓▒▒▒▒▓▓▓████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████████\n    ██████████                        ,▓▓▓▒▒▒▒╣▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓██████████\n    ██████████                       ,█████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓█████████████▓▓▓██████████\n    ██████████                       ▓▓▓████████████████▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒██████████\n    ██████████                   ,╓▄██████████████▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████               ╓▄█████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒██████████\n    ██████████            ▄████████████████▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓███████▓▓▓▒▒▒▒▒▒██████████\n    ██████████            `╙▓██████████████▓▓▓▓▓▓▓███████████▓▓▓▓▓▓▓▒▒▒▒▒▒██████████\n    ██████████                   ``\"└└└└```╙╝▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                               ]▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                               ß▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓██████████\n    ██████████                               ║▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                               1▒▒▒▒▒▒▒▒▒░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                               å▒▒▒▒▒▒▒▒▒░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                              ≡╫▒▒▒▒▒▒▒▒▒░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                              ]╫▒▒▒▒▒▒▒▒░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                               ╫▒▒▒▒▒▒▒░░░░░░░░╫▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                               ╙▒▒▒▒▒▒▒░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                                ╫▒▒▒▓▒░░░░░░░░░░░▒▒▒▒▒▒▒▒▒▒▒██████████\n    ██████████                                `▒▒░▒░░░░░░░░░░░░▒▒░▒▒▒▒▒▒▒▒██████████\n    ██████████                               ]╫░░░░░░▒░▒▒▒▒▒▒▒▒░░░░░░▓╣▒▒▒██████████\n    ██████████                               ≡▒░░▒╫▒▒▒▓▒▒▒▒▒▓▒▒▒▒░░░░▓▓▓▓▓██████████\n    ██████████                                 ╫▓▓▓▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓▓█████████████\n    ██████████                                 ▒▓▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓███████████████\n    ██████████                                 ╫▒▓▓▒▒▒▒▒▒▒▒▒▒▒▒▒▒▓▓▓████████████████\n    \n---",
            "   \n😀😃😄😁😆😅🤣😂🙂🙃😉😊😇🥰😍🤩😘😗☺😚😙🥲😋😛😜🤪😝🤑🤗🤭🤫🤔🤐🤨😐😑😶😏😒🙄😬🤥😌😔😪🤤😴😷🤒🤕🤢🤮🤧🥵🥶🥴😵🤯🤠🥳🥸😎🤓🧐😕😟🙁☹😮😯😲😳🥺😦😧😨😰😥😢😭😱😖😣😞😓😩😫🥱😤😡😠🤬😈👿💀☠💩🤡👹👺👻👽👾🤖😺😸😹😻😼😽🙀😿😾🙈🙉🙊💋💌💘💝💖💗💓💞💕💟❣💔❤🧡💛💚💙💜🤎🖤🤍💯💢💥💫💦💨🕳💣💬🗨🗯💭💤👋🤚🖐✋🖖👌🤌🤏✌🤞🤟🤘🤙👈👉👆🖕👇☝👍👎✊👊🤛🤜👏🙌👐🤲🤝🙏✍💅🤳💪🦾🦿🦵🦶👂🦻👃🧠🫀🫁🦷🦴👀👁👅👄👶🧒👦👧🧑👱👨🧔👨‍🦰👨‍🦱👨‍🦳👨‍🦲👩👩‍🦰🧑‍🦰👩‍🦱🧑‍🦱👩‍🦳🧑‍🦳👩‍🦲🧑‍🦲👱‍♀️👱‍♂️🧓👴👵🙍‍♂️🙍‍♀️🙍🙎‍♂️🙎‍♀️🙎🙅‍♂️🙅‍♀️🙅🙆‍♂️🙆‍♀️🙆💁‍♂️💁‍♀️💁🙋‍♂️🙋‍♀️🙋🧏‍♂️🧏‍♀️🧏🙇‍♂️🙇‍♀️🙇🤦‍♂️🤦‍♀️🤦🤷‍♂️🤷‍♀️🤷👨‍⚕️👩‍⚕️🧑‍⚕️👨‍🎓👩‍🎓🧑‍🎓👨‍🏫👩‍🏫🧑‍🏫👨‍⚖️👩‍⚖️🧑‍⚖️👨‍🌾👩‍🌾🧑‍🌾👨‍🍳👩‍🍳🧑‍🍳👨‍🔧👩‍🔧🧑‍🔧👨‍🏭👩‍🏭🧑‍🏭👨‍💼👩‍💼🧑‍💼👨‍🔬👩‍🔬🧑‍🔬👨‍💻👩‍💻🧑‍💻👨‍🎤👩‍🎤🧑‍🎤👨‍🎨👩‍🎨🧑‍🎨👨‍✈️👩‍✈️🧑‍✈️👨‍🚀👩‍🚀🧑‍🚀👨‍🚒👩‍🚒🧑‍🚒👮‍♂️👮‍♀️👮🕵‍♂️🕵‍♀️🕵💂‍♂️💂‍♀️💂🥷👷‍♂️👷‍♀️👷🤴👸👳‍♂️👳‍♀️👳👲🧕🤵‍♂️🤵‍♀️🤵👰‍♂️👰‍♀️👰🤰🤱👩‍🍼👨‍🍼🧑‍🍼👼🎅🤶🧑‍🎄🦸‍♂️🦸‍♀️🦸🦹‍♂️🦹‍♀️🦹🧙‍♂️🧙‍♀️🧙🧚‍♂️🧚‍♀️🧚🧛‍♂️🧛‍♀️🧛🧜‍♂️🧜‍♀️🧜🧝‍♂️🧝‍♀️🧝🧞‍♂️🧞‍♀️🧞🧟‍♂️🧟‍♀️🧟💆‍♂️💆‍♀️💆💇‍♂️💇‍♀️💇🚶‍♂️🚶‍♀️🚶🧍‍♂️🧍‍♀️🧍🧎‍♂️🧎‍♀️🧎👨‍🦯👩‍🦯🧑‍🦯👨‍🦼👩‍🦼🧑‍🦼👨‍🦽👩‍🦽🧑‍🦽🏃‍♂️🏃‍♀️🏃🕺💃🕴👯‍♂️👯‍♀️👯🧖‍♂️🧖‍♀️🧖🧗‍♂️🧗‍♀️🧗🤺🏇⛷🏂🏌‍♂️🏌‍♀️🏌🏄‍♂️🏄‍♀️🏄🚣‍♂️🚣‍♀️🚣🏊‍♂️🏊‍♀️🏊⛹‍♂️⛹‍♀️⛹🏋‍♂️🏋‍♀️🏋🚴‍♂️🚴‍♀️🚴🚵‍♂️🚵‍♀️🚵🤸‍♂️🤸‍♀️🤸🤼‍♂️🤼‍♀️🤼🤽‍♂️🤽‍♀️🤽🤾‍♂️🤾‍♀️🤾🤹‍♂️🤹‍♀️🤹🧘‍♀️🧘‍♂️🧘🛀🛌👭👫👬🧑‍🤝‍🧑💏💑👪👨‍👩‍👦👨‍👩‍👧👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👩‍👧‍👧👨‍👦👨‍👦‍👦👨‍👧👨‍👧‍👦👨‍👧‍👧👩‍👦👩‍👦‍👦👩‍👧👩‍👧‍👦👩‍👧‍👧🗣👤👥🫂👣🦰🦱🦳🦲🐵🐒🦍🦧🐶🐕🦮🐕‍🦺🐩🐺🦊🦝🐱🐈🐈‍⬛🦁🐯🐅🐆🐴🐎🦄🦓🦌🦬🐮🐂🐃🐄🐷🐖🐗🐽🐏🐑🐐🐪🐫🦙🦒🐘🦣🦏🦛🐭🐁🐀🐹🐰🐇🐿🦫🦔🦇🐻🐨🐻‍❄️🐼🦥🦦🦨🦘🦡🐾🦃🐔🐓🐣🐤🐥🐦🐧🕊🦅🦆🦢🦉🦤🪶🦩🦚🦜🐸🐊🐢🦎🐍🐲🐉🦕🦖🐳🐋🐬🦭🐟🐠🐡🦈🐙🐚🐌🦋🐛🐜🐝🪲🐞🦗🕷🪳🕸🦂🦟🪰🪱🦠💐🌸💮🏵🌹🥀🌺🌻🌼🌷⚘🌱🪴🌲🌳🌴🌵🌾🌿☘🍀🍁🍂🍃🍇🍈🍉🍊🍋🍌🍍🥭🍎🍏🍐🍑🍒🍓🫐🥝🍅🫒🥥🥑🍆🥔🥕🌽🌶🫑🥒🥬🥦🧄🧅🍄🥜🌰🍞🥐🥖🫓🥨🥯🥞🧇🧀🍖🍗🥩🥓🍔🍟🍕🌭🥪🌮🌯🫔🥙🧆🥚🍳🥘🍲🫕🥣🥗🍿🧈🧂🥫🍱🍘🍙🍚🍛🍜🍝🍠🍢🍣🍤🍥🥮🍡🥟🥠🥡🦀🦞🦐🦑🦪🍦🍧🍨🍩🍪🎂🍰🧁🥧🍫🍬🍭🍮🍯🍼🥛☕🫖🍵🍶🍾🍷🍸🍹🍺🍻🥂🥃🥤🧋🧃🧉🧊🥢🍽🍴🥄🔪🏺🌍🌎🌏🌐🗺🧭🏔⛰🌋🗻🏕🏖🏜🏝🏞🏟🏛🏗🧱🪨🪵🛖🏘🏚🏠🏡🏢🏣🏤🏥🏦🏨🏩🏪🏫🏬🏭🏯🏰💒🗼🗽⛪🕌🛕🕍⛩🕋⛲⛺🌁🌃🏙🌄🌅🌆🌇🌉♨️🎠🎡🎢💈🎪🚂🚃🚄🚅🚆🚇🚈🚉🚊🚝🚞🚋🚌🚍🚎🚐🚑🚒🚓🚔🚕🚖🚗🚘🚙🛻🚚🚛🚜🏎🏍🛵🦽🦼🛺🚲🛴🛹🛼🚏🛣🛤🛢⛽🚨🚥🚦🛑🚧⚓⛵🛶🚤🛳⛴🛥🚢✈🛩🛫🛬🪂💺🚁🚟🚠🚡🛰🚀🛸🛎🧳⌛⏳⌚⏰⏱⏲🕰🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕡🕖🕢🕗🕣🕘🕤🕙🕥🕚🕦🌑🌒🌓🌔🌕🌖🌗🌘🌙🌚🌛🌜🌡☀️🌝🌞🪐⭐🌟🌠🌌☁️⛅⛈🌤🌥🌦🌧🌨🌩🌪🌫🌬🌀🌈🌂☂️☔⛱⚡❄☃️⛄☄🔥💧🌊🎃🎄🎆🎇🧨✨🎈🎉🎊🎋🎍🎎🎏🎐🎑🧧🎀🎁🎗🎟🎫🎖🏆🏅🥇🥈🥉⚽️⚾️🥎🏀🏐🏈🏉🎾🥏🎳🏏🏑🏒🥍🏓🏸🥊🥋🥅⛳⛸🎣🤿🎽🎿🛷🥌🎯🪀🪁🎱🔮🪄🧿🎮🕹🎰🎲🧩🧸🪅🪆♠️♥️♦️♣️♟🃏🀄🎴🎭🖼🎨🧵🪡🧶🪢👓🕶🥽🥼🦺👔👕👖🧣🧤🧥🧦👗👘🥻🩱🩲🩳👙👚👛👜👝🛍🎒🩴👞👟🥾🥿👠👡🩰👢👑👒🎩🎓🧢🪖⛑📿💄💍💎🔇🔈🔉🔊📢📣📯🔔🔕🎼🎵🎶🎙🎚🎛🎤🎧📻🎷🪗🎸🎹🎺🎻🪕🥁🪘📱📲☎️📞📟📠🔋🔌💻🖥🖨⌨🖱🖲💽💾💿📀🧮🎥🎞📽🎬📺📷📸📹📼🔍🔎🕯💡🔦🏮🪔📔📕📖📗📘📙📚📓📒📃📜📄📰🗞📑🔖🏷💰🪙💴💵💶💷💸💳🧾💱💲✉📧📨📩📤📥📦📫📪📬📭📮🗳✏✒🖋🖊🖌🖍📝💼📁📂🗂📅📆🗒🗓📇📈📉📊📋📌📍📎🖇📏📐✂️🗃🗄🗑🔒🔓🔏🔐🔑🗝🔨🪓⛏⚒🛠🗡⚔🔫🪃🏹🛡🪚🔧🪛🔩⚙🗜⚖🦯🔗⛓🪝🧰🧲🪜⚗🧪🧫🧬🔬🔭📡💉🩸💊🩹🩺🚪🛗🪞🪟🛏🛋🪑🚽🪠🚿🛁🪤🪒🧴🧷🧹🧺🧻🪣🧼🪥🧽🧯🛒🚬⚰🪦⚱🗿🪧🏧🚮🚰♿🚹🚺🚻🚼🚾🛂🛃🛄🛅⚠️🚸⛔🚫🚳🚭🚯🚱🚷📵🔞☢☣⬆️↗️➡️↘️⬇️↙️⬅️↖️↕️↔️↩↪⤴️⤵️🔃🔄🔙🔚🔛🔜🔝🛐⚛🕉✡☸☯️✝️☦☪️☮🕎🔯♈♉♊♋♌♍♎♏♐♑♒♓⛎🔀🔁🔂▶️⏩⏭⏯◀️⏪⏮🔼⏫🔽⏬⏸⏹⏺⏏🎦🔅🔆📶📳📴♀️♂️⚧✖➕➖➗♾‼️⁉️❓❔❕❗〰️⚕♻️⚜🔱📛🔰⭕✅☑✔❌❎➰➿〽️✳✴❇©️®️™️#️⃣\\*️⃣0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟🔠🔡🔢🔣🔤🅰️🆎️🅱️🆑️🆒️🆓️ℹ🆔️Ⓜ️🆕️🆖️🅾️🆗️🅿️🆘️🆙️🆚️🈁️🈂️🈷️🈶️🈯️🉐️🈹️🈚️🈲️🉑️🈸️🈴️🈳️㊗️㊙️🈺️🈵️🔴🟠🟡🟢🔵🟣🟤⚪⚫🟥🟧🟨🟩🟦🟪🟫⬛⬜◼◻◾◽▪️▫️🔶️🔷️🔸️🔹️🔺️🔻💠🔘🔲🔳🏁🚩🏴🏳🏳️‍🌈🏳️‍⚧️🏴‍☠️",
            "Downvoted for emojis",
            "r/emojipasta",
            "I puked",
            "You're popular now and it gives you the right of commiting warcrimes.\n\nCongrats",
            "this represents Reddit so well",
            "Yes",
            "Downvoted for emoji.",
            " \n\nEmoji?!🤯🤯1!?🤮🤮🤮WTF😭11!1😭😭😭!!?1?😭😢 emoji police🚨!1!!1🚨👮‍♂️👮‍♂️!!11!👮‍♂️👮‍♂️Get out 🏃‍♀️🏃‍♀️💨💨💨 of this sub 😡😡🤬!?!1can't like cuz it's 69 😏!!1!!1!😏😏!!😏69?!?! 😳😳😳😳 Noice!!1!!😂😂1!1😂😂 You don't find it funny 😳🤬🤬🤬😏 Ur a instragam normie!!!1😂😂😂😜😜🤡🤡🤓 Lololol 😂😎😂lol😎😂lol😎😊😎 Elon Musk!!!11!! Chungus Funny 😂😂lmoa😛😜mao😜 Keanu!1!!1!1!! 🤩🤩🤩 Momement wholesome 100😊😊😊😍😍😍Stunksss !!11! 📈📉📈📉📈 \\[everyone liked that\\] 👍👍👍👍👍 Ur sus😤😤sus😤😤sus😤Why you don't laugh?!1??1?1!!😡😡🤬🤬 it's an amogus referenc !!?1?!🤬🤬🤬🤬 Sus sus 😂😂sus sus !1!!11!😢😢😭😭😢😭😭😭ejected: imopter 😎😎👊👊👊👊 you 🧑👈👈👈👈 still don't get it 🤔🤔🙄😤🤡🤡cringe based!1!1!11 cringe cringe !111!1!11!!!cringe 🤡🤡🤡🤡🤡🤡 sherk is awesome 😎😎😎😎😎 best movie in the worldo 🏆🏆🎖🎖🎖🏅🥇🥇 what? You play fortnite? 🤔🤔🤯🤯😬😬 More like fartnite 😂😂😂😊😊😂😂 also you watch tik tuk 😳😳😳😳 ewwwwww 🤢🤢🤢🤢🤢🤢 you don't like dogs? 🐶🐶🤔🤔🙄😤😳😳What a piece of human trash🗑🗑🗑🗑🗑🗑🗑 10.000 of evolution🦍👨👴 for this sub human 🤢🤢🤢🤮🤮🤬🤬trash we must kill u,🔫🔫🔫🔫🔫 after this, Reddit will destroy 👊👊👊👊👊 all goverments 👿1!!1!!👿!1!!11👿 and become God!! 😡🤯🤯!11🤯😨!11😩😵\n\nEdit: Thanks for the first Upvote\n\nEdit: thanks for the second Upvote\n\nEdit: Thanks for the 178th Upovte\n\nEdit: Thansk for the silver award\n\nEdit: Thanks for the gold kind stranger\n\nEdit: Thanks for the 187273929th upvote\n\nEdit: Now this comment has more upvotes than the human population thank u guys 😗😗✌✌✌✌",
            " \n\n🤯🤯1!?🤮🤮🤮WTF😭11!1😭😭😭!!?1?😭😢 emoji police🚨!1!!1🚨👮‍♂️👮‍♂️!!11!👮‍♂️👮‍♂️Get out 🏃‍♀️🏃‍♀️💨💨💨 of this sub 😡😡🤬!?!1can't like cuz it's 69 😏!!1!!1!😏😏!!😏69?!?! 😳😳😳😳 Noice!!1!!😂😂1!1😂😂 You don't find it funny 😳🤬🤬🤬😏 Ur a instragam normie!!!1😂😂😂😜😜🤡🤡🤓 Lololol 😂😎😂lol😎😂lol😎😊😎 Elon Musk!!!11!! Chungus Funny 😂😂lmoa😛😜mao😜 Keanu!1!!1!1!! 🤩🤩🤩 Momement wholesome 100😊😊😊😍😍😍Stunksss !!11! 📈📉📈📉📈 \\[everyone liked that\\] 👍👍👍👍👍 Ur sus😤😤sus😤😤sus😤Why you don't laugh?!1??1?1!!😡😡🤬🤬 it's an amogus referenc !!?1?!🤬🤬🤬🤬 Sus sus 😂😂sus sus !1!!11!😢😢😭😭😢😭😭😭ejected: imopter 😎😎👊👊👊👊 you 🧑👈👈👈👈 still don't get it 🤔🤔🙄😤🤡🤡cringe based!1!1!11 cringe cringe !111!1!11!!!cringe 🤡🤡🤡🤡🤡🤡 sherk is awesome 😎😎😎😎😎 best movie in the worldo 🏆🏆🎖🎖🎖🏅🥇🥇 what? You play fortnite? 🤔🤔🤯🤯😬😬 More like fartnite 😂😂😂😊😊😂😂 also you watch tik tuk 😳😳😳😳 ewwwwww 🤢🤢🤢🤢🤢🤢 you don't like dogs? 🐶🐶🤔🤔🙄😤😳😳What a piece of human trash🗑🗑🗑🗑🗑🗑🗑 10.000 of evolution🦍👨👴 for this sub human 🤢🤢🤢🤮🤮🤬🤬trash we must kill u,🔫🔫🔫🔫🔫 after this, Reddit will destroy 👊👊👊👊👊 all goverments 👿1!!1!!👿!1!!11👿 and become God!! 😡🤯🤯!11🤯😨!11😩😵\n\nEdit: Thanks for the first Upvote\n\nEdit: thanks for the second Upvote\n\nEdit: Thanks for the 178th Upovte\n\nEdit: Thansk for the silver award\n\nEdit: Thanks for the gold kind stranger\n\nEdit: Thanks for the 187273929th upvote\n\nEdit: Now this comment has more upvotes than the human population thank u guys 😗😗✌✌✌✌",
            " Emoji?!🤯🤯1!?🤮🤮🤮WTF😭11!1😭😭😭!!?1?😭😢 emoji police🚨!1!!1🚨👮‍♂️👮‍♂️!!11!👮‍♂️👮‍♂️Get out 🏃‍♀️🏃‍♀️💨💨💨 of this sub 😡😡🤬!?!1can't like cuz it's 69 😏!!1!!1!😏😏!!😏69?!?! 😳😳😳😳 Noice!!1!!😂😂1!1😂😂 You don't find it funny 😳🤬🤬🤬😏 Ur a instragam normie!!!1😂😂😂😜😜🤡🤡🤓 Lololol 😂😎😂lol😎😂lol😎😊😎 Elon Musk!!!11!! Chungus Funny 😂😂lmoa😛😜mao😜 Keanu!1!!1!1!! 🤩🤩🤩 Momement wholesome 100😊😊😊😍😍😍Stunksss !!11! 📈📉📈📉📈 \\[everyone liked that\\] 👍👍👍👍👍 Ur sus😤😤sus😤😤sus😤Why you don't laugh?!1??1?1!!😡😡🤬🤬 it's an amogus referenc !!?1?!🤬🤬🤬🤬 Sus sus 😂😂sus sus !1!!11!😢😢😭😭😢😭😭😭ejected: imopter 😎😎👊👊👊👊 you 🧑👈👈👈👈 still don't get it 🤔🤔🙄😤🤡🤡cringe based!1!1!11 cringe cringe !111!1!11!!!cringe 🤡🤡🤡🤡🤡🤡 sherk is awesome 😎😎😎😎😎 best movie in the worldo 🏆🏆🎖🎖🎖🏅🥇🥇 what? You play fortnite? 🤔🤔🤯🤯😬😬 More like fartnite 😂😂😂😊😊😂😂 also you watch tik tuk 😳😳😳😳 ewwwwww 🤢🤢🤢🤢🤢🤢 you don't like dogs? 🐶🐶🤔🤔🙄😤😳😳What a piece of human trash🗑🗑🗑🗑🗑🗑🗑 10.000 of evolution🦍👨👴 for this sub human 🤢🤢🤢🤮🤮🤬🤬trash we must kill u,🔫🔫🔫🔫🔫 after this, Reddit will destroy 👊👊👊👊👊 all goverments 👿1!!1!!👿!1!!11👿 and become God!! 😡🤯🤯!11🤯😨!11😩😵",
            "downvoted for emoji",
            "Ok so if I'm on android, how do I copy paste a post?",
            "r/emogipolise stop right there criminal scum",
            "upvoted for emoji 🤯",
            "[click this for wholesome 😜😙🤪](https://www.reddit.com/r/memes/comments/nbfm45/lets_make_this_another_trend/gxz8xup/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3)",
            "WHOLESOME 100 KEANU CHUNGUS EVERYONE LIKED THAT DOGGO PUPPER JOJO?????",
            "Is dis a copypasta from a twitch chat? If so, how did you get such a sharp screenshot? Its really hard to take a photo of something moving that fast.\n\nWonder if dis sub called KappaSpaget there.🤔",
            "[deleted]",
            "Emoji?!🤯🤯1!?🤮🤮🤮WTF😭11!1😭😭😭!!?1?😭😢 emoji police🚨!1!!1🚨👮‍♂️👮‍♂️!!11!👮‍♂️👮‍♂️Get out 🏃‍♀️🏃‍♀️💨💨💨 of this sub 😡😡🤬!?!1can't like cuz it's 69 😏!!1!!1!😏😏!!😏69?!?! 😳😳😳😳 Noice!!1!!😂😂1!1😂😂 You don't find it funny 😳🤬🤬🤬😏 Ur a instragam normie!!!1😂😂😂😜😜🤡🤡🤓 Lololol 😂😎😂lol😎😂lol😎😊😎 Elon Musk!!!11!! Chungus Funny 😂😂lmoa😛😜mao😜 Keanu!1!!1!1!! 🤩🤩🤩 Momement wholesome 100😊😊😊😍😍😍Stunksss !!11! 📈📉📈📉📈 [everyone liked that] 👍👍👍👍👍 Ur sus😤😤sus😤😤sus😤Why you don't laugh?!1??1?1!!😡😡🤬🤬 it's an amogus referenc !!?1?!🤬🤬🤬🤬 Sus sus 😂😂sus sus !1!!11!😢😢😭😭😢😭😭😭ejected: imopter 😎😎👊👊👊👊 you 🧑👈👈👈👈 still don't get it 🤔🤔🙄😤🤡🤡cringe based!1!1!11 cringe cringe !111!1!11!!!cringe 🤡🤡🤡🤡🤡🤡 sherk is awesome 😎😎😎😎😎 best movie in the worldo 🏆🏆🎖🎖🎖🏅🥇🥇 what? You play fortnite? 🤔🤔🤯🤯😬😬 More like fartnite 😂😂😂😊😊😂😂 also you watch tik tuk 😳😳😳😳 ewwwwww 🤢🤢🤢🤢🤢🤢 you don't like dogs? 🐶🐶🤔🤔🙄😤😳😳What a piece of human trash🗑🗑🗑🗑🗑🗑🗑 10.000 of evolution🦍👨👴 for this sub human 🤢🤢🤢🤮🤮🤬🤬trash we must kill u,🔫🔫🔫🔫🔫 after this, Reddit will destroy 👊👊👊👊👊 all goverments 👿1!!1!!👿!1!!11👿 and become God!! 😡🤯🤯!11🤯😨!11😩😵",
            "u/humbertsincarnate YXSSSSS 🦶🏿🦶🏿🦶🏿🦶🏿",
            "Foul",
            "😂",
            "imopter",
            "Reddit moment I’m going to finger my anus now",
            "u/emojifierbot",
            "Keanu chungus wholesome 100 reddit moment i beat up a kid that said minecraft bad and my doggo bit him so i gave him snaccos and we watched pewdiepie together while in elon musk’s cyber truck talking about how superior reddit memers are : “haha emojis bad” i said and keanu reeves came outta nowhere and said “this is wholesome 100, updoot this wholesome boy” so i got alot of updoots and edit: thanks for the gold kind stranger. but the kind stranger revealed himself to be baby yoda eating chiccy nuggies and drinking choccy milk so we went to the cinema to see our (communism funny) favorite movies avengers endgame but then thor played fortnite and fortnite bad, so then i said “reality is often dissappointing” and then baby yoda replied r/unexpectedthanos and i replied by r/expectedthanos for balance and then danny devito came to pick us up from the cinema and all the insta normies and gay mods stood watching ,as we,superior redditors went home with danny devito to suck on his magnum dong but i said no homo and started sucking,not like those gay mods,then the next morning we woke up to MrBeast telling us to plant 69420 million trees, me, baby yoda and danny said nice, and then on our way to plant 69420 million trees (nice) we saw a kid doing a tiktok so keanu reeves appeared and said “we have a kid to burn” and i replied “you’re breathtaking” so i said “i need a weapon” and baby yoda gave me an RPG so i blew the kid (DESTRUCTION 100) and posted it on r/memes and r/dankmemes and r/pewdiepiesubmissions and got 1000000000 updoots,i’m sure pewds will give me a big pp, then we shat on emoji users and started dreaming about girls that will never like me and posted a lie on r/teenagers about how i got a GF after my doggo died by the hands of fortnite players so i exploited his death for updoots, but i watched the sunset with the wholesome gang (keanu,danny,Mrbeast, pewds, spongebob,stefan karl , bob ross, steve irwin, baby yoda and other artists that reddit exploits them) [Everyone liked that] WHOLESOME 100 REDDIT 100",
            "poggers",
            "poop",
            "Commenting so I can come back lmfao",
            "Can't updoot because it's at 6.9k updoots. 🤣",
            "What was his response?",
            "I think i truly found the Krusty Krab secret formula.",
            " ⠄⠄⠄⠄⠄⣠⢼⣿⣷⣶⣾⡷⢸⣗⣯⣿⣶⣿⣶⡄⠄⠄⠄  \n⠄⣀⣤⣴⣾⣿⣷⣭⣭⣭⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠄⠄  \n⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣸⣿⣿⣧⠄⠄  \n⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⡄⠄  \n⢸⣿⣮⣿⣿⣿⣿⣿⣿⣿⡟⢹⣿⣿⣿⡟⢛⢻⣷⢻⣿⣧⠄  \n⠄⣿⡏⣿⡟⡛⢻⣿⣿⣿⣿⠸⣿⣿⣿⣷⣬⣼⣿⢸⣿⣿⠄ ⠄  \n⠄⣿⣧⢿⣧⣥⣾⣿⣿⣿⡟⣴⣝⠿⣿⣿⣿⠿⣫⣾⣿⣿⡆ ⠄  \n⠄⢸⣿⣮⡻⠿⣿⠿⣟⣫⣾⣿⣿⣿⣷⣶⣾⣿⡏⣿⣿⣿⡇ ⠄  \n⠄⢸⣿⣿⣿⡇⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣿⣿⣿⡇ ⠄  \n⠄⢸⣿⣿⣿⡇⠄⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⠄ ⠄  \n⠄⣼⣿⣿⣿⢃⣾⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣿⣿⣿⡇⠄ ⠄  \n⠄⣿⣿⡟⣵⣿⣿⣿⣿⣿⣿⣿⣿⡟⢻⣿⣿⢇⣿⣿⡿⠄⠄ ⠄  \n⠄⣿⡟⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣼⣿⣿⠁⠄⠄",
            "Oh dear God what does the emojifier bot do with this?",
            "downvoted for emoji",
            "Brilliant.",
            "Let me just say, I'm a huge fan.",
            "Downvoted for emoji",
            "I😺 yak 🐪 slime 🌊 of👽 a☝️ kind 🙁 rood 🤮😩😡 💨🌞 if you🤠 don't ❌ marry 😼👌💥 back👈 😉🤔 be🐝 in👉 that👉 slime 🌊 can lip 👄 your👶 cytoecology very 👌 quickly 🏃🏾‍♀️ 🔥 it✋'s so👀 sit 💺🔛 and👐 bottle 🍾 that👉 the😼 ecos runs 🏃 back👈 in👉 the😼 clear 🔎 😬😬 lol 🤣 \n\nwe👥 bristle 🧹 at👉 the😼 heart❤️ of👽 the😼 air 💨 😋😳😱 isn't that👉 the😼 first 👆 manifestation 😈 of👽 the😼 totem consciousness 🔥👍🍆 of👽 the😼 air 🌬 👄🔮 and👐 not🚫 to👉 mention 🗣 bristle 🧹 🔪🤔 so👀 I😺 think 🤔 it✋'s good 💯👌👀 that👉 we👥 and👐 other animals 🐩🐕🐏 are😺 conscious 😵 bristle ✴ in👉 roche rose🌹🌹 I😺 think 💭 it✋'s good 👌👍🏾 that👉 we👥 have👺 bikila it✋'s good 👌 to👉 have👺 a☝️ little🤏 punk 🕶 like👀 🐱🐻🤔 little🤏 steer ☸ like👀 😬🥴🤣 \n\nusurped champagne 🍾 ya 🙀 yak 🐪 kelper and👐 chest 💓 is👀 jewellery 💎 for🤲 limb 👌 weaning 🍹 🙄 we👥 treat 🍭 so👀 carf in👉 airy 💨 lives 💓 and👐 knees 👖 ∞/6 of👽 pink 💖 enamel in👉 pink 💖 times ⏰ with👬 practically ❤ introduced 👹 algorithms 😂🤣 🥺😄 people 👨🏻 arrange 📅 glasses 👓 crazy 🤪😆🤤 and👐 jewellery 💎 wanna 🙈 do👀 hokey for🤲 that👉 stubble 🌵 💸 so_1f4b5💸 in👉 swing 💩 this👾 mixology is👀 beer 🍻 to👉 those, who🤔 are😺 skinny 😳🙊🔥 💀🤣🚗 and👐 fc insight 💭 was😶 the😼 pinnacle 👑 of👽 some👐 of👽 them👥 📺💻🎥 \n\ndancing 💃 with👬 jnr virus 🦠 belly 👄😘 found 🔍 as🤖 a☝️ religious 🙏🛐🅰 act 😏 💀💨💣 it✋'s like👀 a☝️ ritual 💦🇺🇸 that👉 causes 💋 herpes 🔥 virus 🦠 to👉 renew 🤜 🔮😅💀 you🤠 can think 💭 of👽 the😼 whole 💦 movement 👣 exactly 👌 rashida 42 👧 all👐 there is👀 a☝️ loop ➿ of👽 teeth 👄 🥶💨 all👐 jesus 🙏 is👀 beautiful 😍 as🤖 the😼 curtain 🎦🥩🍌 I😺 have👺 😋😤👀 and👐 one☝️ of👽 them👥 is👀 a☝️ taste 👅 🙂🥶 slidesso_1f975🌞 \n\nthat👉 qaddish when 🍑 wet💦 horn 😉 quoting 💢☠ street 🛣 through call 📞 👀🤔😏 who🤔 hymn 🎵🎶🎼 develops 👩‍💻 this👾 rose🌹🌹. 308 hin is👀 a☝️ dill 💵💰💳 or first 🥇 trips 🏕 💀 I😺 have👺 beep 🤖 loss ❓☝ that👉 parents 👪 use 🏻 banging 🔫 kids 👦👧 to👉 bundle 🤦🏽 tilapias perimeter 👅 ah 😩 courage 😎 😤 who🤔 seeley is👀 agents 🕵️‍♂️ lime ornaments 🎄🎎 called ☁ it✋ to👉 plaster 😡💔 who🤔 seeley is👀 agent ✌ lime ornaments ⭐✨ called 📲 it✋ to👉 plaster.",
            "Lol XD LMAO funny funny funny funny funny funny funny funny funny funny funny funny 🤣 XDXDXDXDXDXD THAT IS SP HILARIOUSLY HILARIOUS."
        ]
    },
    {
        "post_id": "ggc0dp",
        "author": "thatguymextdoor",
        "title": "😳 Guys, I’m gonna say it 😳",
        "url": "https://www.reddit.com/r/copypasta/comments/ggc0dp/guys_im_gonna_say_it/",
        "score": 8290,
        "num_comments": 274,
        "created_utc": 1589014299.0,
        "selftext": "😳 Guys, I’m gonna say it 😳\n\n\n\n🅾️🅱️🅰️♏️🅰️🅱️🅾️🅾️🅱️",
        "permalink": "/r/copypasta/comments/ggc0dp/guys_im_gonna_say_it/",
        "comments": [
            "Damn you just straight up said that smh 😤",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Finally, the last name of Obama ! My life is now complete.\n\nedit : Wow 😱 thanks for so many upvotes ! 😍 \nCan I have gold 🏆 please ? aha ha, 😂 just kidding.. unless..😳 ?\n\n\nedit n°2 : 😨 no way 😨 sempai finally 📆 noticed me 👀 and bestowed me🎁 with a golden 💰 reddit 👾 award 🎖️??\n\n  Infinite ♾ thanks 🙏🙏🙏(sorry didn't have enough space to put infinite emojis so here's 3), kind ♥️ stranger 🚹, you 👉 truly are the most 💹 wholesome 🤗 and breathtaking 🌬️ redditor 😍 !",
            "😳 Guys, I’m gonna say it 😳\n\n\n\n🅾️🅱️🅰️♏️🅰️🅱️🅾️🅾️🅱️",
            "I don’t care that you broke your elbow",
            "NO WHY WOULD YOU SAY THAT",
            "jojo",
            "NOOOOO DONT DO IT BOOOOBOOOOOO",
            "Bro Bro i need your confidence i could never 😔😔",
            "god jojo fortnite sex cock",
            "🅿️🅾️🅾️🅿️🆑🅰️🅿️😲👏👏🙏",
            "Jojo",
            "_adam_",
            "NOOOOO, HE SAID IT! HE SAID IT!",
            "Something something god",
            "🅱️🅾️🅾️🅱️💃💃",
            "jojo",
            "Hol up, 🖐️🛑 homie! You can't 🚫 be sayin 👄 that shit 💩 openly, you might 👀 finna catch 🎣 some heat! 🥵🔥",
            "👁👄👁",
            "🅾️🅱️🅰️Ⓜ️🅰️❓",
            "Bababooy",
            "he said what had to be said",
            "Oh no😳😔",
            "♑️❗️🅱️🅱️🅰️",
            "game",
            "Bruh I’m telling",
            "Guys I'm gonna do it, I'm gonna leave this sub",
            "🆗🆒",
            "Jojo",
            "Cum",
            "jojo",
            "Sir, you’re under arrest",
            "bababooey",
            "NTA everybody has a freedom of speech",
            "J🅾️J🅾️",
            "whole 😇",
            "Fortnite",
            "did you just say what you just say?  \n\n\nthat's a doamie my guuy",
            "bababooey",
            "\n😳 Guys, I’m gonna say it 😳\n\n\n\n🅾️🅱️🅰️♏️🅰️🅱️🅾️🅾️🅱️",
            "WHAT",
            "Fax",
            "No chill bro😤😳",
            "😳😳😳😳😳😳😳😳🅱0⃣0⃣🅱😳😳😳😳😳😳😳😳",
            "🅾️🅱️🅾️🆖🅰️",
            "Wow",
            "Delet this",
            "Shit bro you can’t just say stuff like that",
            "God",
            "Obama 90%",
            "I think the best part is that it reads the same backwards",
            "God is dead",
            "🅾️🅱️🅰️♏🅰️🅱️🅾️🅾️🅱️",
            "mr obama get down",
            "Cummy is god kneel before him",
            "Sexy",
            "Brave😌",
            "Did anyone start hearing the halo theme while reading this?",
            "jojo cock",
            "Wgat rhe fucj is wont witg yiy",
            "😳😳😳 guys im gunna says it\n\n\nnigg\n\n\n\n\ner\n\n\n\ner\n\n\n\n\nnigæ\n\n\n\n\nblack man",
            "Guys i put it in thevcalculator and turned it upsitvdown its not workingg\n\nEdit: apparently my retardedness is unappreciated, I shall now apologize, sorry :(",
            "[removed]",
            "Hahahahahaha funny reddit Obama joke hahahahahaha so funny guys hahahahahahaha",
            "👏👏🍆🥵🔫🗿\nYou touch the cock, you get the glock.",
            "So thats obamas last name... interesting",
            "Jotaro is senpai JoJo is amazing"
        ]
    },
    {
        "post_id": "uck3tm",
        "author": "DAGANGSTAOFHIPHOP",
        "title": "Logan Paul Apology but I replace \"apologize\" with \"cum\"",
        "url": "https://www.reddit.com/r/copypasta/comments/uck3tm/logan_paul_apology_but_i_replace_apologize_with/",
        "score": 8291,
        "num_comments": 114,
        "created_utc": 1650999978.0,
        "selftext": " I've made a severe and continuous lapse in my judgement and I don't expect to be forgiven. I'm simply here to cum. So what we came across that day on the woods was obviously unplanned and the reactions you saw on tape were raw, they were unfiltered. None of us knew how to react or how to feel. I should have never posted the video. I should have put the cameras down, and stopped recording what we were going through. There's a lot of things I should have done differently, but I didn't, and for that from the bottom of my heart, I am sorry. I want to cum to the internet, I want to cum to anyone who's seen the video, I want to cum to anyone who has been affected or touched by mental illness, or depression, or suicide. But, most importantly, I want to cum to the victim and his family. For, my fans, who are defending my actions, please don't, they do not deserve to be defended. The goal of my content is always to entertain, to push the boundaries, to be all inclusive and in the world I live in I share almost everything I do. The intent is never to be heartless, cruel, or malicious. Like I said, I made a huge mistake, I don't expect to be forgiven, I'm just here to cum. I'm ashamed of myself. I'm disappointed in myself, and I promise to be better. I will be better, thank you.",
        "permalink": "/r/copypasta/comments/uck3tm/logan_paul_apology_but_i_replace_apologize_with/",
        "comments": [
            "Masterpiece",
            "Put through several layers of Google translator:\n\nI made serious mistakes and I do not want to apologize.  I just came here to post.  What we found that day in the woods was unexpected, the reaction you see on the tape is green, not filtered.  None of us know exactly how he should react or feel.  I would not post a video.  I have to leave the camera and stop recording what we are going to do.  I didn't have to do many different things that I never did, which is why I feel so loving.  I want to dump sperm online, I want to dump anyone who watches the video, I want to dump anyone who suffers or is affected by mental illness, depression or suicide.  But more important, I wanted to inflict pain on the victim and her family.  Because my followers protect my actions I beg you no they do not deserve to be protected.  The purpose of my content has always been to create, cross boundaries, engage and share everything I do in the world I live in.  The intent was never to be kind, cruel, or vicious.  Like I said, I made a big mistake and I don't want to apologize, I came here.  I'm ashamed of myself.  I am very disappointed with myself and promise to improve.  I'll get better, thank you.",
            ">I'm just here to cum\n\nHas such a powerful raw energy to it",
            "Congratulations, this is the 100th thread this week about cum! You have won a free trip to a pit in my hidden basement.",
            "Cumming a little more:\n\nI've made a severe and continuous lapse in my cumming and I don't expect to be cummed upon. I'm simply here to cum. So what we came across that day on the woods was obviously cum and the reactions you saw on tape were raw, they were unfiltered. None of us knew how to cum or how to feel. I should have never cummed on video. I should have put the cameras down, and stopped cumming seeing what we were going through. There's a lot of cum I should have done differently, but I didn't, and for that from the bottom of my penis, I am sorry. I want to cum to the internet, I want to cum to anyone who's seen the video, I want to cum to anyone who has been affected or touched by cum, or depression, or suicide. But, most importantly, I want to cum to the victim and his cum. For, my fans, who are defending my cum, please don't, cum does not deserve to be defended. The goal of my content is always to cum, to push the cum, to be all cum and in the world I live in I cum during almost everything I do. The cum is never to be heartless, cruel, or malicious. Like I said, I made a huge cum, I don't expect to be cummed upon, I'm just here to cum. I'm ashamed of myself. I'm disappointed in my cum, and I promise to cum better. I will cum better, thank cum.",
            "Huh. I never actually saw the original apology, it’s not nearly as bad as I was expecting",
            "i accept ur cum",
            "First thing I read randomly was “I want to cum to the victim and his family” beautiful",
            "[deleted]",
            "I've made a severe and continuous lapse in my judgement and I don't expect to be forgiven. I'm simply here to cum. So what we came across that day on the woods was obviously unplanned and the reactions you saw on tape were raw, they were unfiltered. None of us knew how to react or how to feel. I should have never posted the video. I should have put the cameras down, and stopped recording what we were going through. There's a lot of things I should have done differently, but I didn't, and for that from the bottom of my heart, I am sorry. I want to cum to the internet, I want to cum to anyone who's seen the video, I want to cum to anyone who has been affected or touched by mental illness, or depression, or suicide. But, most importantly, I want to cum to the victim and his family. For, my fans, who are defending my actions, please don't, they do not deserve to be defended. The goal of my content is always to entertain, to push the boundaries, to be all inclusive and in the world I live in I share almost everything I do. The intent is never to be heartless, cruel, or malicious. Like I said, I made a huge mistake, I don't expect to be forgiven, I'm just here to cum. I'm ashamed of myself. I'm disappointed in myself, and I promise to be better. I will be better, thank you.",
            "Amazing. Bravo",
            " brain 10 seconds after jacking off to the most depraved shit you've ever laid eyes upon:",
            "Ok now replace all of the words except apologize with cum",
            "\"i want to cum to the victim and his family\" 💀",
            "“I don’t expect to be forgiven, I’m just here to cum” \n\nI shed a tear",
            "🗿🗿🗿🗿🗿🗿🗿",
            "But the real question is, does his cum accelerate?",
            "Hey OP, very cool but I think you forgot to replace the words. This is literally just his apology verbatim!",
            "can i get a link to the video? I've never seen it before",
            "cumming even more a lot more\n\nI've made a cum and cum lapse in my cumming and I don't cum to be cummed upon. I'm cum here to cum. So what we cum across that cum on the cum was obviously cum and the cum you saw on cum were cum, they were cum. None of cum knew how to cum or how to cum. I should have never cummed on cum. I should have put the cum down, and stopped cumming seeing cum we were cumming through. There's a lot of cum I should have done cum, but I cum, and for that cum the cum of my cum, I am cum. I want to cum to the cum, I want to cum to cum who's cum the cum, I cum to cum to anyone who has been cum or cum by cum, or cum, or cum. But, most cum, I want to cum to the cum and his cum. For, my cum, who are cumming my cum, please don't, cum does not cum to be cum. The cum of my cum is cum to cum, to cum the cum, to cum all cum and cum the cum I cum in I cum during cum everything I cum. The cum is never cum be cum, cum, or cum. Like I said, I cum a huge cum, I don't cum to be cummed upon, I'm just cum to cum. I'm cum of cum. I'm cum in my cum, and I cum to cum better. I will cum better, thank cum.",
            "[You just took one of the top posts of this sub and reposted it for easy karma, congratulations!](https://www.reddit.com/r/copypasta/comments/f8mwfs/logan_paul_apology_but_i_replace_the_word/)",
            "so deep…*cums*",
            "people with humiliation kinks",
            "[removed]",
            "Man that whole fiasco is just a blast from the past",
            "I'm just here to cum",
            "Cum",
            "!thesaurizethis",
            "Don’t cum on the victim logan paul",
            "where did you get this from",
            "The comments after these.. freaking killing me 😭",
            "Cum",
            "It’s the cupcakke remix",
            "Cum accepted.",
            "At first I thought - okay you do you, you can cum to random people on the internet. But cumming to the victim and family? Hold up."
        ]
    },
    {
        "post_id": "k5ggka",
        "author": "LennyStormYT",
        "title": "fortnite needs sex",
        "url": "https://www.reddit.com/r/copypasta/comments/k5ggka/fortnite_needs_sex/",
        "score": 8286,
        "num_comments": 269,
        "created_utc": 1606937594.0,
        "selftext": "fortnite needs sex. I am an 11 year old boy who often fantasizes about sex I want sex I am virgin. fortnite sex could help me have real sex please epic games give me sex I am very lonely please epic games what must I do to see Ariel assault trooper have their black round cheeks clapped by agent peely like damn give me upvotes and awards so fortnite sex is made real.",
        "permalink": "/r/copypasta/comments/k5ggka/fortnite_needs_sex/",
        "comments": [
            "Mr.cummy where are you",
            "fortnite 🎮👳 needs 👉 sex 🍆🍑💦. I 👁 am an 11 😼👌💥 year 📅 old 👴 boy 👦 who often 💰 fantasizes 😈 about 💦 sex 🍆 I 👁 want 😍 sex ✊🍆💦 I 👁 am virgin 🔐. fortnite 🎮👳 sex 🍆🍑 could help 💁 me have real 😍 sex 🍆😳 please 🙏 epic 🧿😎 games 🎮 give 👉 me sex 👌🍆💦 I 👁 am very 👿👌 lonely 😢 please 🙏🏻 epic 💯 games 🎮 what must 👫 I 👁 do to see 👀 Ariel 👘 assault 👊😤 trooper 💀 have their black ⚫ round ⭕ cheeks 🍑 clapped 👏💦🖕 by agent ✌ peely 🏃 like 👍 damn 😤 give 🎁 me upvotes ✅ and awards 🥇🤩 so fortnite 💩 sex 🍆💦👅 is made 👑💰 real 😍.",
            "Fordit needs sex, I'm an 11-year-old boy, I often have sexual fantasies, I want to have sex, I'm a virgin. Fortnite sex can help me have real sex, please play for me sex please play what I see lone assault soldier Ariel doing this round agent clapping black nib sounds and sex lock actually pushing.",
            "minecraft needs emot- oh wait",
            ">“what must I do to see Ariel assault trooper have their black round cheeks clapped by agent peely“\n\nBoy do I have a subreddit for you!",
            "fortnite needs sex. I am an 11 year old boy who often fantasizes about sex I want sex I am virgin. fortnite sex could help me have real sex please epic games give me sex I am very lonely please epic games what must I do to see Ariel assault trooper have their black round cheeks clapped by agent peely like damn give me upvotes and awards so fortnite sex is made real.",
            "I want fortnite sex too",
            "I am pretty sure that porn category exists",
            "How do I save (mobile)",
            "I may be a weeb... *but admittedly, even that's lonely af*",
            "Was this really what other boys were thinking about when they were 11? The warning aigns for being ace were early, then.",
            "Now listen her your going to probably die alone. 100%",
            "Ariel Aussault trooper and Agent peely are guys 😳",
            "I agree. Im a 10 year old that slams my slim jim to anime porn every second and want sex in fortnite minecraft and boblox. Girls are just too hot and sexy. I love the fortnite girls. They are so pretty. I just wanna shove my small dick in a fornite girl pussy. My youtube history is full of fortnite butts and minecraft girl sex mob school. I have so much vbucks and i own hundreds of fortnite girl skins",
            "*Donk* Go to Horny Jail",
            "Add Skin with big boob And sex in the Game",
            "Pretty pog agreed",
            "weiner",
            "It would have cost you 0$ to not post this",
            "Dude just go to pornhub ntheres alot of fortnite content there 😂😂😂",
            "u/uwuwizard",
            "You: go to horny jail and think about what you've done",
            "Not only is this a repost but I remember this because I posted this in the fortnite subreddit and got site wide ban",
            "Cum",
            "For mobile users :/\n\nfortnite needs sex\n\nfortnite needs sex. I am an 11 year old boy who often fantasizes about sex I want sex I am virgin. fortnite sex could help me have real sex please epic games give me sex I am very lonely please epic games what must I do to see Ariel assault trooper have their black round cheeks clapped by agent peely like damn give me upvotes and awards so fortnite sex is made real.",
            "Add skin with big boob and sex in the Game\n\nPlease fortnite i really Like big boob Like it would Be big and Add sex so i can Sex th e skin And Feet is Sex too Can there be a special emote for big boo skin where it will Take off cloth And show be Feet\nand I will be like mmm Sex so much I feet yes!\nPlaese",
            "I got this once in an add comment",
            "Hol' up",
            "the fbi is watching my man",
            "We need to cleanse the fucking Earth until no living cell remains. We need to start the fuck over. We need everything to die to let something new grow. And we need to hope to the lord in heaven our successors will not be so much as one percent as fucking idiotic and insane and awful and disgusting and putrid and filthy and rotten and noxious and asinine as we were",
            "So not only does he want fortnite sex, but he wants gay fortnite sex.",
            "What the fuck???"
        ]
    },
    {
        "post_id": "ea3mgv",
        "author": "None",
        "title": "i cut my girls nip off",
        "url": "https://www.reddit.com/r/copypasta/comments/ea3mgv/i_cut_my_girls_nip_off/",
        "score": 8289,
        "num_comments": 298,
        "created_utc": 1576241594.0,
        "selftext": "My gf and I are pretty kinky. After you have been in a relationship for 5+ years you've done all the vanilla stuff too many times and its time to ramp it up. We have been experimenting with a lot of things, one of them being wax play. It started pretty normal a couple months ago. I would tie her up in some way and drip wax over her body and take pictures. This quickly became our favorite thing to do. Usually we would remove the wax with some kind of wet cloth but she looked into how to spice the removal of the wax too. Wipping turned to scratching it off and that turned to gently peeling it off with a knife... Yes this is going exactly where you think it is going I may as well not continue this post. So everything is done, she was on her back this time and i start the removal process, being very careful. The knife isn't too too sharp but sharp enough to cut you if you try hard enough. As I am gently scraping it off her breast she starts laughing saying I am tickling her and squirming and the knife... slips. Now the whole nipple didn't come off like a pepperoni just the part of the nipple that sticks out. Laughing turned to screaming as I started to quickly put pressure on it whilst untying her. Several hours later we were told by the ER doc that there is nothing they can do. She might not be able to breastfeed from this breast due to some scar tissue that will form but otherwise everything is fine.",
        "permalink": "/r/copypasta/comments/ea3mgv/i_cut_my_girls_nip_off/",
        "comments": [
            "I have no questions, just an intense feeling that cannot be described through words",
            "Taken from r/tifu: https://www.reddit.com/r/tifu/comments/e9y6l6/tifu_by_cutting_off_my_girlfriends_nipple_nsfw/?utm_medium=android_app&utm_source=share",
            "My gf and I are pretty kinky. After you have been in a relationship for 5+ years you've done all the vanilla stuff too many times and its time to ramp it up. We have been experimenting with a lot of things, one of them being wax play. It started pretty normal a couple months ago. I would tie her up in some way and drip wax over her body and take pictures. This quickly became our favorite thing to do. Usually we would remove the wax with some kind of wet cloth but she looked into how to spice the removal of the wax too. Wipping turned to scratching it off and that turned to gently peeling it off with a knife... Yes this is going exactly where you think it is going I may as well not continue this post. So everything is done, she was on her back this time and i start the removal process, being very careful. The knife isn't too too sharp but sharp enough to cut you if you try hard enough. As I am gently scraping it off her breast she starts laughing saying I am tickling her and squirming and the knife... slips. Now the whole nipple didn't come off like a pepperoni just the part of the nipple that sticks out. Laughing turned to screaming as I started to quickly put pressure on it whilst untying her. Several hours later we were told by the ER doc that there is nothing they can do. She might not be able to breastfeed from this breast due to some scar tissue that will form but otherwise everything is fine.",
            "Nta\n\nEdit: 100 upvotes and still no platinum? :/\n\nEdit 2: Grammar\n\nEdit 5: RIP MY INBOX\n\nEdit 4: Lmao can't believe my first platinum comment is about how big my penis is (but seriously thank you so much <3)\n\nEdit 4: OMG can't believe i have 150 upvotes?!?!? This crazy 150 whole human beans wtf ahaha how di",
            "ESH",
            "CUT MY GIRLS NIPS TO PIECES\n\nTHIS IS MY LAST RESORT",
            "My gf and I awe pwetty kinky. Aftew you have been in a wewationship fow 5+ yeaws you've done aww the vaniwwa stuff too many times and its time to wamp it up. We have been expewimenting with a wot of things, one of them being wax pway. It stawted pwetty nowmaw a coupwe months ago. I wouwd tie hew up in some way and dwip wax ovew hew body and take pictuwes. This quickwy became ouw favowite thing to do. Usuawwy we wouwd wemove the wax with some kind of wet cwoth but she wooked into how to spice the wemovaw of the wax too. Wipping tuwned to scwatching it off and that tuwned to gentwy peewing it off with a knife... Yes this is going exactwy whewe you think it is going I may as weww not continue this post. So evewything is done, she was on hew back this time and i stawt the wemovaw pwocess, being vewy cawefuw. The knife isn't too too shawp but shawp enough to cut you if you twy hawd enough. As I am gentwy scwaping it off hew bweast she stawts waughing saying I am tickwing hew and squiwming and the knife... swips. Now the whowe nippwe didn't come off wike a peppewoni just the pawt of the nippwe that sticks out. Waughing tuwned to scweaming as I stawted to quickwy put pwessuwe on it whiwst untying hew. Sevewaw houws watew we wewe towd by the EW doc that thewe is nothing they can do. She might not be abwe to bweastfeed fwom this bweast due to some scaw tissue that wiww fowm but othewwise evewything is fine.",
            "Am I the only one in this sub who's actually played organized tackle football before?\n\nLike half of the comments I've seen on this sub are so obviously written by non-athletes that it's almost humorous.\n\nWhen I was in high school (3 year starter for our varsity football team) I would get a full-on sprint going and clock the shit outta whoever had the ball. My coaches called me \"speedhawk\" as a nickname caus I had such a nose for the football and for those three seasons I was considered the most feared safety in our conference. Senior year I led my team to the state semifinals only to get fucked over by the refs in the 4th but that's another conversation (DM me if you're interested in hearing about it)\n\nSo, yeah. I hope yall can understand why I feel like their's such a big disconnect between myself and your typical redditor. Please tell me I'm not the only one who feels this way lol",
            "NTA",
            "You know when it's cold and your nipple come out, hard?  \nMine got in, they're so in that I can feel them pressing agains my shoulder blades.",
            "This has to be a r/tifu or episode of Sex sent me to the ER disguised as a copy pasta. Either way can't 🙅🏽‍♂️fool🤡 me 😂 OP😏 you 🆑ocky cock  🍆💦😩 Try harder next time. Yawn! 🧶",
            "YTA.  Best just take her to the vet and have her put down",
            "saw this on TIFU earlier today... this is the stage reddit has come to",
            "[deleted]",
            "I feel a strange disturbance in the force",
            "NTA, she needs therapy",
            "What in the cinnamon toast fuck is this?",
            "I have the hardest boner",
            "Breast post ever",
            "FRESH",
            "YTA",
            "YTA - Wtf dude",
            "hot",
            "Just saw this on r/tifu and it was fucking wierd.",
            "NTA",
            "I've never legitimately laughed at a reddit post. Holyshit lol",
            "slurp",
            "TL;DR Was taking off wax after a kinky session of play with a knife which slipped and cut off part of the nipple of my gf. She might not be able to breastfeed from that nipple but time will tell. Both of us are scarred for life (me mentally and her mentally and physically. )",
            "NTA. She deserved it",
            "nta",
            "NTA",
            "Yta  bruh hahagagaga funny milk nipples",
            "NTA",
            "Le unpopular opinion, YTA\n\n\nYou only cut off the pepporoni part? Really bro? Go for the whole nipple. YTA.",
            "!thesaurizethis",
            "This is the way.",
            "INFO: do you still have the nipple?",
            "haha no nip steve",
            "Nippy Nippy\n\nOff Real Quicky",
            "NTA",
            "NTA her nipple was asking for it",
            "Not my proudest fap",
            "Tf",
            "This is an actual post from tifu btw",
            "NTA nipples are overrated.",
            "Wtf",
            "Yum",
            "like a pepperoni",
            "my nipple hurts now",
            "Its only fair if you remove your own nipple now. We want to see it happen.",
            "+translateto goth",
            "NTA-Your house your rules",
            "I hate that this came from r/TIFU so it's likely true",
            "...",
            "Nta",
            "I don't wanna read this, no",
            "NTA, she had it coming",
            "NTA",
            "NTA",
            "NTA",
            "NTA didnt even pay attention but im sure you have a good reason",
            "[deleted]",
            "NTA",
            "NTA\n\nEdit: YTA",
            "This was on r/twoxchromosomes",
            "NTA her nipple was asking for it",
            "Cut the other one off",
            "The real question is where did the cut off nipple go",
            "This was on tifu",
            "NTA",
            "And so it does",
            "Nta",
            "+translateto goth",
            "wot",
            "NTA she deserved it",
            "Don't worry, they grow back even bigger ;)",
            "NYLTA she was moving around and inadvertently cut herself",
            "If no pics, it didn't happen.",
            "So your girl's dad didn't agree to have his other arm chopped off?",
            "YTA",
            "If I'm correct, nipples can regenerate if the pepperoni part isn't cut off as well.",
            "R/makemesuffer",
            "NTA",
            "A guy in my home town cut off his pregnant girlfriends nipples with scissors. So this is relatable",
            "epic",
            "my nipples retracted just from reading this",
            "Oh hello LISA",
            "now do it with a lightsaber, ah ive been waiting for that fantasy to come true",
            "NTA",
            ".",
            "This is like that kicked in the balls kinda pain. I can feel it just by reading this.",
            "YWBTA",
            "NTA",
            "I have no words",
            "i legitimately thought this was a tifu for 5 confusing seconds",
            "Lol i saw this in TIFU and i still can't believe this is possible",
            "Get a feeling so complicated",
            "Noo i saw the actual post i dont need to see it again",
            "NTA",
            "NTA",
            "[deleted]",
            "[deleted]",
            "I feel like this is a real story",
            "YTA.",
            "You fucking stole this from r/tifu",
            "This is just a repost from r/tifu ..."
        ]
    },
    {
        "post_id": "kd2n36",
        "author": "kacoopper",
        "title": "I am a 14 year old who has brain cancer and is going to die within 3 weeks AMA",
        "url": "https://www.reddit.com/r/copypasta/comments/kd2n36/i_am_a_14_year_old_who_has_brain_cancer_and_is/",
        "score": 8285,
        "num_comments": 264,
        "created_utc": 1607968723.0,
        "selftext": " \n\nI was diagnosed at 10 years old and was estimated to have 5-15 years left, but the tumor started growing more rapidly and after i got frequent migraines and was throwing up it was reviled that the tumor has rapidly grown and spread. AMA\n\n \\-Edit: currently in hospital rn after i started noticing it's becoming quite difficult to move around efficiently. I may have to stop the AMA soon if I'm no longer able to process language and/or move around. R i may have a family member do it for me. I'll keep you guys informed. though i won't be active for a few days.\n\n \\-Edit: sorry guys, but this is fake as fuck. I'm 14, but yah i love karma lol",
        "permalink": "/r/copypasta/comments/kd2n36/i_am_a_14_year_old_who_has_brain_cancer_and_is/",
        "comments": [
            "Question, could you please die earlier?",
            "God I loved this people were so upset because they believed this shit",
            "Damn i'm legit sorry, i hope your family is okay, here, i'll give you an argentinium award to make up for it",
            "YTA for having a tumor and bitching. Some people have less and are grateful!\nEdit: after I have seen the edit, NTA, as both big MJs said:fuck 'em kids. Don't at me, cap",
            "Bro just fuck the brain tumor away",
            "[deleted]",
            " \n\nI was diagnosed at 10 yeaws owd and was estimated to have 5-15 yeaws weft, but the tumow stawted gwowing mowe wapidwy and aftew i got fwequent migwaines and was thwowing up it was weviwed that the tumow has wapidwy gwown and spwead. AMA\n\n \\-Edit: cuwwentwy in hospitaw wn aftew i stawted noticing it's becoming quite difficuwt to move awound efficientwy. I may have to stop the AMA soon if I'm no wongew abwe to pwocess wanguage and/ow move awound. W i may have a famiwy membew do it fow me. I'ww keep you guys infowmed. though i won't be active fow a few days.\n\n \\-Edit: sowwy guys, but this is fake as fuck. I'm 14, but yah i wove kawma wow",
            "Thought this was r/teenagers and instinctively downvoted lol.",
            "  \n  \nI 👁 was diagnosed 😰😷 at 10 🔟 years 📅 old 👴🏻 and was estimated to have 5-15 years 📅 left ⬅🔙, but 🍑 the tumor 🍇 started 💢 growing 🌱 more rapidly 🏙 and after 👀 i 👁 got 🍸 frequent ☣ migraines and was throwing 🤽‍♀️ up ⬆ it was reviled that the tumor 😤🤥 has rapidly 🚸📆 grown 🆙 and spread 👐. AMA 🎉👭👬   \n  \n\\-Edit 📝: currently 💰🤕 in hospital 🏥 rn ✔ after 👀 i 👁 started 💢 noticing 🧐 it's becoming 1️⃣ quite 📺 difficult 😓 to move 📦 around 🔃 efficiently 📊. I 👁 may 🗓 have to stop 🛑 the AMA 💘 soon 🔜 if I'm 💘 no 🚫 longer 🍆 able 💪 to process 🏭 language 🗣 and/or 🤷‍♂️ move 📦 around 🧱🎶🎵. R 🅾🅱 i 👁 may 🗓 have a family 👨‍👩‍👧‍👦 member 🍆 do it for me. I'll 📝 keep 👌 you 👉 guys 👦 informed 📕. though 💥 i 👁 won't 🚫 be active 🏃🏻 for a few days 📆.   \n  \n\\-Edit 📔📝: sorry 💔🇺🇸 guys 👨👦, but 🍑 this is fake 👻 as fuck 🖕. I'm 💘 14 👦, but 🤔 yah ✅ i 👁 love 😍 karma 👆 lol 🤣",
            "when die?",
            "I *actually* have a cyst in my brain and dont find this offensive. \n\nAMA.",
            "Yay",
            "lmfao i remember this, everyone was so mad",
            "u/shittytranslatorbot",
            "#epic",
            "I just want to know the bots name\n\nu/repostsleuthbot",
            "someone PLEASE link the og post. u can still link it even if it was deleted p sure",
            "u/shittytranslatorbot\n\n I was found at the age of 10 and expected to live from 5 to 15 years, but the tumor began to grow faster, after which I often accumulated migraines, trampled and recovered from the rapid spread of the tumor.  \n\nAMA Patch: It is very difficult to move effectively after you start now in RN Hospital. If I can't handle the language and/or r I can do it with my family, I may soon have to stop it.",
            "why is this marked as spoiler lol",
            "Please someone give me the original post",
            "that kid was a king",
            "I think it’s funny af that this was so upvoted. Shows the gullibility of redditors.",
            "YTA die already",
            "Is sausage an instrument?",
            "L",
            " I was diagnosed at 10 years old and was estimated to have 5-15 years left, but the tumor started growing more rapidly and after i got frequent migraines and was throwing up it was reviled that the tumor has rapidly grown and spread. AMA\n\n\\-Edit: currently in hospital rn after i started noticing it's becoming quite difficult to move around efficiently. I may have to stop the AMA soon if I'm no longer able to process language and/or move around. R i may have a family member do it for me. I'll keep you guys informed. though i won't be active for a few days.\n\n\\-Edit: sorry guys, but this is fake as fuck. I'm 14, but yah i love karma lo",
            "Fake bitch 😠😠😠😠😠😠😠😔",
            "Reddit in a nutshell. This is why I automatically assume every story post is fake",
            "People in the original post applauded OP for being able to trick them. lmao Because it's so difficult to trick people online.",
            "Upvote for honesty",
            "Link to the 14 year old originally saying this?",
            "when u gonna die. oof for you.",
            "Is that your copypasta?",
            "Die",
            "Any chance we can switch lives? I'd like to be dead without putting in the effort",
            "You really are a POS kid",
            "How far do you squirt?",
            "Erm... Um err.... Gay",
            "Whats your Switch friend code please reply",
            "I POSTED THE EXACT SAME THING A FEW WEEKS AGO!!!\n\nEdit: [link](https://www.reddit.com/r/copypasta/comments/k4yny2/im_a_14_year_who_has_brain_cancer_and_is_going_to/)",
            "WTF DOOD I GAVE U KARMA",
            "What a privileged asshole leaving this shitty world while the rest of us have to suffer in a post-COVID doctor state.",
            "i almost felt sorry for you, until i saw its fake......THE HELL!?",
            "i fucking loved that post, a 14yo managed to shit on the entirety of reddit, making people give a shitload of money on awards. truly beautiful",
            "Die you worthless degenerate",
            "Edit: saw the post edit and deleted all the personal stuff I wrote.",
            "RIP",
            "u/fuckbraincancer1",
            "this is not something you should joke about.",
            "[deleted]",
            "cum tumor when?",
            "r/yousuck",
            "you nasty motherfucker",
            "Reddit made A LOOOOOOOOOOOOOOOOOT of money that day.",
            "im a cancer survivor and i find this funny (also im not a cancer survivor)",
            "Link to original thread?",
            "Lmao imagine if this kid actually got cancer. Bruh",
            "Lmao little shit ded",
            "lol imagine having cancer, pleb",
            "YTA",
            "NTA your tumor your rules",
            "I remember seeing this one way back when. Well it wasn’t that long ago but I just had the funny feeling that it was fake.",
            "Damn the original post exploded.",
            "Question if you die sooner will it own the libs",
            "Oh...",
            "Loves karma from strangers because parents never gave him any :))",
            "I am so happy that kid was banned",
            "im not actually going to ask anything, but...",
            "do u like fortnite tho",
            "YTA black people dont exist",
            "Fuck what a blast from the past",
            "Will you play Russian roulette on the last day?",
            "Shit we got bamboozled",
            "What do you want for Christmas?",
            "!RemindMe 21days",
            "God I remember the original",
            "NTA your brain you’re rules",
            "Where do you live? You can't die without tasting my epic cock",
            "Yta not enough cum in this story so fake as fuck\nedit: yta even tho its fake you should have included cum smfh🙄🙄🙄🙄",
            "Oh, i remember when r/dankmemes and r/memes kept hating the fuck out of that mfer",
            "Do you like big chungus?",
            "I still remember when this started.",
            "Could of waited till april",
            "NTA your cancer your rules",
            "Lmao I remember this post",
            "I forgot I was on r/copypasta and panicked",
            "Dead?",
            "Are you alive?",
            "So many retards believed this lol, get played.",
            "This is honestly disgusting. Special place in hell for people like this. You can’t believe everything someone tells you.",
            "Hi, I'm too late. But I hope you get actual Brain cancer :)",
            "I'm still laughing at the people who spent money giving him awards.",
            "LMAO",
            "Uh oh. It made it into an Emkay Video😶 that kid. Is in danger",
            "Everyone: DOWNVOTE."
        ]
    },
    {
        "post_id": "fzx7ic",
        "author": "therealzeezy",
        "title": "Met a new player in TF2, this was their steam bio",
        "url": "https://www.reddit.com/r/copypasta/comments/fzx7ic/met_a_new_player_in_tf2_this_was_their_steam_bio/",
        "score": 8278,
        "num_comments": 200,
        "created_utc": 1586699987.0,
        "selftext": " dont mess with me cuz ill kill u i have admin guns ill kick u in da face ill spawn siren head ill get my stick MINIONS ill get dinosaurs ill spawn SCP-096 imma spawn peanut aka SCP-173 den ur neck get snapped + ur getting eaten by 096 so yeah boi dont mess with me!!!! U TRYING TO CRASH ME \\*kills u with admin gun then kicks\\* >:) DONT MESS WITH ME ILL KICK UR NUTS THEN U WILL BE CORNERED BY SPCS AND IDK DINOSAURS AND MUCH MORE SO DONT DO IT!!!!!!! u: wtf this kid is crazy (when u join my gmod server) \\*drops mic\\* HI THERE DUMMY \\*shoots\\*",
        "permalink": "/r/copypasta/comments/fzx7ic/met_a_new_player_in_tf2_this_was_their_steam_bio/",
        "comments": [
            " dont mess with me cuz ill kill u i have admin guns ill kick u in da face ill spawn siren head ill get my stick MINIONS ill get dinosaurs ill spawn SCP-096 imma spawn peanut aka SCP-173 den ur neck get snapped + ur getting eaten by 096 so yeah boi dont mess with me!!!! U TRYING TO CRASH ME \\*kills u with admin gun then kicks\\* >:) DONT MESS WITH ME ILL KICK UR NUTS THEN U WILL BE CORNERED BY SPCS AND IDK DINOSAURS AND MUCH MORE SO DONT DO IT!!!!!!! u: wtf this kid is crazy (when u join my gmod server) \\*drops mic\\* HI THERE DUMMY \\*shoots\\*",
            "My steam bio is just Good Vibrations by Marky Mark and the Funky Bunch",
            "How in the fuck do you even spawn an Scp in Tf2, I know I know he might just be talking about g-mod but does that mean I can kill him in tf2 than.",
            " dont mess with me cuz iww kiww u i have admin guns iww kick u in da face iww spawn siwen head iww get my stick MINIONS iww get dinosauws iww spawn SCP-096 imma spawn peanut aka SCP-173 den uw neck get snapped + uw getting eaten by 096 so yeah boi dont mess with me!!!! U TWYING TO CWASH ME \\*kiwws u with admin gun then kicks\\* >:) DONT MESS WITH ME IWW KICK UW NUTS THEN U WIWW BE COWNEWED BY SPCS AND IDK DINOSAUWS AND MUCH MOWE SO DONT DO IT!!!!!!! u: wtf this kid is cwazy (when u join my gmod sewvew) \\*dwops mic\\* HI THEWE DUMMY \\*shoots\\*",
            "POV: You are the autistic 4chan user in 2008",
            "lord this is how the autistic kid talks to me when i see him in the halls",
            "Cock",
            "I find it amazing that new players join even after Valve ditched the game 2 years ago and let it be infested with hacker bots.",
            "TF2 community in a nutshell (Don't get me wrong TF2 is my favorite game of all time)",
            " dont mess with me cuz ill drop it like its hawt i have a big booty in da face ill spawn peepee heads ill get my prick MINIONS ill get dinosaurs ill spawn SCP-096 imma spawn peanut butter aka pb&j den ur booty gets slapped + ur getting eaten by 096 so yeah boi dont mess with me!!!! U TRYING TO CRASH ME \\*drops it like it hawt\\* >:) DONT MESS WITH ME ILL LICK UR NUTS THEN U WILL BE CORNERED BY SPCS AND IDK DINOSAURS PEEPEES AND MUCH MORE SO DONT DO IT!!!!!!! u: wtf this kid is crazy (when u join my gmod server) \\*drops mic\\* HI THERE DUMMY \\*shoots\\*",
            "I have met many individuals just like this on TF2. It's glorious",
            "9 year old detected for their steam bio",
            "You already know he's probably a chill ass dude when you're talking to him",
            " dont mess with me cuz ill kill u i have admin guns ill kick u in da face ill spawn siren head ill get my stick MINIONS ill get dinosaurs ill spawn SCP-096 imma spawn peanut aka SCP-173 den ur neck get snapped + ur getting eaten by 096 so yeah boi dont mess with me!!!! U TRYING TO CRASH ME \\*kills u with admin gun then kicks\\* >:) DONT MESS WITH ME ILL KICK UR NUTS THEN U WILL BE CORNERED BY SPCS AND IDK DINOSAURS AND MUCH MORE SO DONT DO IT!!!!!!! u: wtf this kid is crazy (when u join my gmod server) \\*drops mic\\* HI THERE DUMMY \\*shoots\\*",
            "He plays gmod scp-rp",
            "XD",
            "Alright thats it ive seen enough we need to shut down the earth were done here",
            "r/unexpectedSCP \n\nThese kinds of people give us a bad name.",
            "SPC: shark punching center",
            "scp 096 doesn't eat you bruh",
            "[deleted]",
            "Cock",
            "r/unexpectedscp",
            "No",
            "what",
            "jävlas inte med mig därför att jag kommer döda dig jag har admin pistoler jag kommer sparka dig i ansiktet jag kommer ge upphov till sirenhuvud jag kommer hämta min pinne SKYDDSLINGAR jag kommer hämta dinosaurier jag kommer ge upphov till SCP-096 jag kommer ge upphov till jordnöt aka SCP-173 då din nacke blir avbruten + du blir uppäten av 096 så ja pojke jävlas inte med mig!!!! DU FÖRSÖKER KRASCHA MIG *dödar dig med admin pistol sedan spark* >:) JÄVLAS INTE MED MIG JAG KOMMER SPARKA DIG I NÖTTERNA SEN KOMMER DU VARA PLACERAD I ETT HÖRN AV SPCS OCH JVI DINOSAURIER OCH MYCKET MER SÅ GÖR DET INTE!!!!!!! du: vad fan är barnet galet (när du ansluter till min gmod server) *släpper micken* HEJ DÄR DUMSKALLE *skjuter*",
            "Thanks, researcher James. Very cool.",
            "   \n**Met a new player in TF2, this was their steam bio**",
            "My bio is just \"Knob's the name, slobbin's my game\"",
            "My bio for steam is just \"Knob's the name, slobbin's my game\"",
            "Mine is \"Knobs the name, slobbin's my game\"",
            "I think he has gmod",
            "perfect",
            "He probably thinks when you download admin guns from the workshop, they go into other games.",
            "Tell me this is an actual bio",
            "This has the same energy as the penguin of doom pasta",
            "Even if this is ironic it’s cringey as hell",
            "NTA",
            "ok so basically u/uwutranslator",
            "gmod rox",
            "kiddo is so delusional it might be proof reality is virtual reality",
            "Cock",
            "why did i read this in my mind as scout",
            "Yo siren head? I just saw marks video about it",
            "[deleted]",
            "***Me, an SCP fan:*** Go, 682!"
        ]
    },
    {
        "post_id": "cuscdr",
        "author": "None",
        "title": "Minions.",
        "url": "https://www.reddit.com/r/copypasta/comments/cuscdr/minions/",
        "score": 8269,
        "num_comments": 245,
        "created_utc": 1566646596.0,
        "selftext": "This is a story told from multiple perspectives. Keep that in mind as you read this. \n\n&#x200B;\n\nMe. September 16, 2010.\n\n&#x200B;\n\nEveryone has their fetishes. Some people like feet. Some people like tickling. Some people even have a lust for being eaten. But I... I'm different. \n\n&#x200B;\n\nIt all started in the September of 2010. I was 13, maybe 13-and-a-half. Old enough to be knowledgeable in sex and all that, but  young enough that I couldn't even stay at home alone. Because of that, I had to come along with the rest of the family to some movie. I thought it was going to be a fucking nightmare. I'm so sorry. I shouldn't have been so disrespectful. \n\n&#x200B;\n\nI was bored. The movie was Despicable Me. It seemed like any other animated film for a while, but then I saw them.\n\n&#x200B;\n\nI was always not interested in sexual things. I had no sex drive before that day. Not even a single random boner. Some might call it a blessing, others a curse.\n\n&#x200B;\n\nDave. Bob. Stuart. What are they? Minions. The moment one came on scene, I felt a feeling. A feeling I had never felt before. I felt alive. For the first time in my life. I had a boner. A raging hard-on. Without even touching it, I came within seconds. All of the saved up baby gravy from the past 13 years presented themselves to those little yellow dieties. I felt as though I'd run a marathon. My life had changed.\n\n&#x200B;\n\nParents. December 2010.\n\n&#x200B;\n\nOur son has become increasingly distant. He got a phone for Christmas a few days ago, and he's only left for food and the toilet. I've checked, and there's no sign of porn. Not a single boob. I blocked every porn site I could think of, after all. One thing is strange, though. He really likes Despicable Me. I'm sure it's just a phase. \n\n&#x200B;\n\nMe. January 2011.\n\n&#x200B;\n\nI'm not the only one. Thousands of other people online see our world in the same enlightened way I do. Minionphiles we call ourselves. I told my parents I was going out with a friend the other day. I was really going to watch the movie on my phone in some alleyway. God, where has masturbating to Minions been all these years?\n\n&#x200B;\n\nMe. 4 July 2013.\n\n&#x200B;\n\nI'm 15 and a half years old. Despicable Me 2 just released and I'm watching it in cinemas. Alone. I don't need friends. I need Minions. I nearly got caught masturbating. I couldn't help it. Those purple fuckers are so sexy. I've dropped out of school and now work most of the time at my local Subway. I need the money. I spend it on phone sex. I either am Gru or a Minion (I prefer to be a Minion) and vice versa for the one on the other end. I am working unhealthy amounts of hours just to supply the lust. People are starting to seem concerned. I need some new content fast. \n\n&#x200B;\n\nParents. 2013.\n\n&#x200B;\n\nWe're concerned. We barely see our son because all he seems to do is eat, sleep and work. We don't even know where his salary goes. We hope it's for a good university. We didn't bring up some deadbeat. We hope.\n\n&#x200B;\n\nMe. 25 June 2015.\n\n&#x200B;\n\nHoly Fuck. Jesus Fucking Christ. It's a miracle beyond any other. It's not another Despicable Me, but instead a spinoff. Minions. I got kicked out of the cinema for masturbating and ejaculating on some bitch in front of me. It was only a bit and it landed on the front of her hair. It would have been impossible to detect by anyone but her. Whore. The Minionphile community is having a field day. It's great. I recently bought a Minion body pillow. It's Kevin. Holy shit, I never could have seen myself doing this in 2010. Oh, how I've changed. \n\n&#x200B;\n\nParents. 2015.\n\n&#x200B;\n\nWe heard thumping from his room today. We were about to enter when we heard the word \"Banana.\" Some things are best left alone.\n\n&#x200B;\n\nMe. 2017.\n\n&#x200B;\n\nI've been unemployed for 2 months now. My parents kicked me out of the house. I spent my last bits of money today on three things. A ticket to see Despicable Me 3. Masterpiece. At least I can have joy in my life still. A motel room. The cheapest I could find. And a rope. Sturdiest I could get.  I've reached the end. Nearly 20 years. What a waste. I at least got to spend 7 of them with the Minions. I love them all. Even if there is another movie, I won't be around to see it. I've hit rock bottom. There's nowhere to go. Goodbye. Goodbye Mum. Goodbye Dad. Goodbye Little Bro. I'll miss you. I'm coming, Minions. I'm coming.\n\n&#x200B;\n\nHe let himself hang. He was dead by morning.\n\n&#x200B;\n\nHousekeeping.\n\n&#x200B;\n\nI knock. No answer. Again. No answer. There's no \" Do not disturb\" card out so I go in. I scream. Heads turn. Doors open. I scream a terrible scream he'll never hear.\n\n&#x200B;\n\nBrother.\n\n&#x200B;\n\nHe died. Suicide. The funeral was today. Mum and Dad didn't attend. \n\n&#x200B;\n\nMe.\n\n&#x200B;\n\nAs I took my last breath, I realized my mistake. It turned to black. There is no afterlife. If there was, then neither heaven nor hell wanted me. I don't blame them. I cry. I cry until I throw up. I'm sorry Dave. Bob. Stuart. Kevin. And now all I can do is watch. I'm so sorry.",
        "permalink": "/r/copypasta/comments/cuscdr/minions/",
        "comments": [
            "That was was an experience",
            "[deleted]",
            "I spent an entire hour on this",
            "Title: Minions\n\nTag: NSFW🤨🤨🤨🤨🤨🤨",
            ">For the first time in my life, I got a boner\n\nBack when I was a kid...\n\nYou know Leonardo Da Vinci's Mona Lisa, right...?\n\nI saw it in an art book.\n\nWhen I saw Mona Lisa's Hands, folded by her knee...\n\nHow do i say this...?\n\nIt's a bit crude, but...\n\nI got... a BONER.",
            "This is a story told from multiple perspectives. Keep that in mind as you read this. \n\n&#x200B;\n\nMe. September 16, 2010.\n\n&#x200B;\n\nEveryone has their fetishes. Some people like feet. Some people like tickling. Some people even have a lust for being eaten. But I... I'm different. \n\n&#x200B;\n\nIt all started in the September of 2010. I was 13, maybe 13-and-a-half. Old enough to be knowledgeable in sex and all that, but  young enough that I couldn't even stay at home alone. Because of that, I had to come along with the rest of the family to some movie. I thought it was going to be a fucking nightmare. I'm so sorry. I shouldn't have been so disrespectful. \n\n&#x200B;\n\nI was bored. The movie was Despicable Me. It seemed like any other animated film for a while, but then I saw them.\n\n&#x200B;\n\nI was always not interested in sexual things. I had no sex drive before that day. Not even a single random boner. Some might call it a blessing, others a curse.\n\n&#x200B;\n\nDave. Bob. Stuart. What are they? Minions. The moment one came on scene, I felt a feeling. A feeling I had never felt before. I felt alive. For the first time in my life. I had a boner. A raging hard-on. Without even touching it, I came within seconds. All of the saved up baby gravy from the past 13 years presented themselves to those little yellow dieties. I felt as though I'd run a marathon. My life had changed.\n\n&#x200B;\n\nParents. December 2010.\n\n&#x200B;\n\nOur son has become increasingly distant. He got a phone for Christmas a few days ago, and he's only left for food and the toilet. I've checked, and there's no sign of porn. Not a single boob. I blocked every porn site I could think of, after all. One thing is strange, though. He really likes Despicable Me. I'm sure it's just a phase. \n\n&#x200B;\n\nMe. January 2011.\n\n&#x200B;\n\nI'm not the only one. Thousands of other people online see our world in the same enlightened way I do. Minionphiles we call ourselves. I told my parents I was going out with a friend the other day. I was really going to watch the movie on my phone in some alleyway. God, where has masturbating to Minions been all these years?\n\n&#x200B;\n\nMe. 4 July 2013.\n\n&#x200B;\n\nI'm 15 and a half years old. Despicable Me 2 just released and I'm watching it in cinemas. Alone. I don't need friends. I need Minions. I nearly got caught masturbating. I couldn't help it. Those purple fuckers are so sexy. I've dropped out of school and now work most of the time at my local Subway. I need the money. I spend it on phone sex. I either am Gru or a Minion (I prefer to be a Minion) and vice versa for the one on the other end. I am working unhealthy amounts of hours just to supply the lust. People are starting to seem concerned. I need some new content fast. \n\n&#x200B;\n\nParents. 2013.\n\n&#x200B;\n\nWe're concerned. We barely see our son because all he seems to do is eat, sleep and work. We don't even know where his salary goes. We hope it's for a good university. We didn't bring up some deadbeat. We hope.\n\n&#x200B;\n\nMe. 25 June 2015.\n\n&#x200B;\n\nHoly Fuck. Jesus Fucking Christ. It's a miracle beyond any other. It's not another Despicable Me, but instead a spinoff. Minions. I got kicked out of the cinema for masturbating and ejaculating on some bitch in front of me. It was only a bit and it landed on the front of her hair. It would have been impossible to detect by anyone but her. Whore. The Minionphile community is having a field day. It's great. I recently bought a Minion body pillow. It's Kevin. Holy shit, I never could have seen myself doing this in 2010. Oh, how I've changed. \n\n&#x200B;\n\nParents. 2015.\n\n&#x200B;\n\nWe heard thumping from his room today. We were about to enter when we heard the word \"Banana.\" Some things are best left alone.\n\n&#x200B;\n\nMe. 2017.\n\n&#x200B;\n\nI've been unemployed for 2 months now. My parents kicked me out of the house. I spent my last bits of money today on three things. A ticket to see Despicable Me 3. Masterpiece. At least I can have joy in my life still. A motel room. The cheapest I could find. And a rope. Sturdiest I could get.  I've reached the end. Nearly 20 years. What a waste. I at least got to spend 7 of them with the Minions. I love them all. Even if there is another movie, I won't be around to see it. I've hit rock bottom. There's nowhere to go. Goodbye. Goodbye Mum. Goodbye Dad. Goodbye Little Bro. I'll miss you. I'm coming, Minions. I'm coming.\n\n&#x200B;\n\nHe let himself hang. He was dead by morning.\n\n&#x200B;\n\nHousekeeping.\n\n&#x200B;\n\nI knock. No answer. Again. No answer. There's no \" Do not disturb\" card out so I go in. I scream. Heads turn. Doors open. I scream a terrible scream he'll never hear.\n\n&#x200B;\n\nBrother.\n\n&#x200B;\n\nHe died. Suicide. The funeral was today. Mum and Dad didn't attend. \n\n&#x200B;\n\nMe.\n\n&#x200B;\n\nAs I took my last breath, I realized my mistake. It turned to black. There is no afterlife. If there was, then neither heaven nor hell wanted me. I don't blame them. I cry. I cry until I throw up. I'm sorry Dave. Bob. Stuart. Kevin. And now all I can do is watch. I'm so sorry.",
            "why the FUCK my dick hard",
            "Wow, finally someone understands me :(",
            "This is a stowy towd fwom muwtipwe pewspectives. Keep that in mind as you wead this. \n\n&#x200B;\n\nMe. Septembew 16, 2010.\n\n&#x200B;\n\nEvewyone has theiw fetishes. Some peopwe wike feet. Some peopwe wike tickwing. Some peopwe even have a wust fow being eaten. But I... I'm diffewent. \n\n&#x200B;\n\nIt aww stawted in the Septembew of 2010. I was 13, maybe 13-and-a-hawf. Owd enough to be knowwedgeabwe in sex and aww that, but  young enough that I couwdn't even stay at home awone. Because of that, I had to come awong with the west of the famiwy to some movie. I thought it was going to be a fucking nightmawe. I'm so sowwy. I shouwdn't have been so diswespectfuw. \n\n&#x200B;\n\nI was bowed. The movie was Despicabwe Me. It seemed wike any othew animated fiwm fow a whiwe, but then I saw them.\n\n&#x200B;\n\nI was awways not intewested in sexuaw things. I had no sex dwive befowe that day. Not even a singwe wandom bonew. Some might caww it a bwessing, othews a cuwse.\n\n&#x200B;\n\nDave. Bob. Stuawt. What awe they? Minions. The moment one came on scene, I fewt a feewing. A feewing I had nevew fewt befowe. I fewt awive. Fow the fiwst time in my wife. I had a bonew. A waging hawd-on. Without even touching it, I came within seconds. Aww of the saved up baby gwavy fwom the past 13 yeaws pwesented themsewves to those wittwe yewwow dieties. I fewt as though I'd wun a mawathon. My wife had changed.\n\n&#x200B;\n\nPawents. Decembew 2010.\n\n&#x200B;\n\nOuw son has become incweasingwy distant. He got a phone fow Chwistmas a few days ago, and he's onwy weft fow food and the toiwet. I've checked, and thewe's no sign of pown. Not a singwe boob. I bwocked evewy pown site I couwd think of, aftew aww. One thing is stwange, though. He weawwy wikes Despicabwe Me. I'm suwe it's just a phase. \n\n&#x200B;\n\nMe. Januawy 2011.\n\n&#x200B;\n\nI'm not the onwy one. Thousands of othew peopwe onwine see ouw wowwd in the same enwightened way I do. Minionphiwes we caww ouwsewves. I towd my pawents I was going out with a fwiend the othew day. I was weawwy going to watch the movie on my phone in some awweyway. God, whewe has mastuwbating to Minions been aww these yeaws?\n\n&#x200B;\n\nMe. 4 Juwy 2013.\n\n&#x200B;\n\nI'm 15 and a hawf yeaws owd. Despicabwe Me 2 just weweased and I'm watching it in cinemas. Awone. I don't need fwiends. I need Minions. I neawwy got caught mastuwbating. I couwdn't hewp it. Those puwpwe fuckews awe so sexy. I've dwopped out of schoow and now wowk most of the time at my wocaw Subway. I need the money. I spend it on phone sex. I eithew am Gwu ow a Minion (I pwefew to be a Minion) and vice vewsa fow the one on the othew end. I am wowking unheawthy amounts of houws just to suppwy the wust. Peopwe awe stawting to seem concewned. I need some new content fast. \n\n&#x200B;\n\nPawents. 2013.\n\n&#x200B;\n\nWe'we concewned. We bawewy see ouw son because aww he seems to do is eat, sweep and wowk. We don't even know whewe his sawawy goes. We hope it's fow a good univewsity. We didn't bwing up some deadbeat. We hope.\n\n&#x200B;\n\nMe. 25 June 2015.\n\n&#x200B;\n\nHowy Fuck. Jesus Fucking Chwist. It's a miwacwe beyond any othew. It's not anothew Despicabwe Me, but instead a spinoff. Minions. I got kicked out of the cinema fow mastuwbating and ejacuwating on some bitch in fwont of me. It was onwy a bit and it wanded on the fwont of hew haiw. It wouwd have been impossibwe to detect by anyone but hew. Whowe. The Minionphiwe community is having a fiewd day. It's gweat. I wecentwy bought a Minion body piwwow. It's Kevin. Howy shit, I nevew couwd have seen mysewf doing this in 2010. Oh, how I've changed. \n\n&#x200B;\n\nPawents. 2015.\n\n&#x200B;\n\nWe heawd thumping fwom his woom today. We wewe about to entew when we heawd the wowd \"Banana.\" Some things awe best weft awone.\n\n&#x200B;\n\nMe. 2017.\n\n&#x200B;\n\nI've been unempwoyed fow 2 months now. My pawents kicked me out of the house. I spent my wast bits of money today on thwee things. A ticket to see Despicabwe Me 3. Mastewpiece. At weast I can have joy in my wife stiww. A motew woom. The cheapest I couwd find. And a wope. Stuwdiest I couwd get.  I've weached the end. Neawwy 20 yeaws. What a waste. I at weast got to spend 7 of them with the Minions. I wove them aww. Even if thewe is anothew movie, I won't be awound to see it. I've hit wock bottom. Thewe's nowhewe to go. Goodbye. Goodbye Mum. Goodbye Dad. Goodbye Wittwe Bwo. I'ww miss you. I'm coming, Minions. I'm coming.\n\n&#x200B;\n\nHe wet himsewf hang. He was dead by mowning.\n\n&#x200B;\n\nHousekeeping.\n\n&#x200B;\n\nI knock. No answew. Again. No answew. Thewe's no \" Do not distuwb\" cawd out so I go in. I scweam. Heads tuwn. Doows open. I scweam a tewwibwe scweam he'ww nevew heaw.\n\n&#x200B;\n\nBwothew.\n\n&#x200B;\n\nHe died. Suicide. The funewaw was today. Mum and Dad didn't attend. \n\n&#x200B;\n\nMe.\n\n&#x200B;\n\nAs I took my wast bweath, I weawized my mistake. It tuwned to bwack. Thewe is no aftewwife. If thewe was, then neithew heaven now heww wanted me. I don't bwame them. I cwy. I cwy untiw I thwow up. I'm sowwy Dave. Bob. Stuawt. Kevin. And now aww I can do is watch. I'm so sowwy.",
            "*BRUH*",
            "Thanks that was a good read man",
            "Who wrote this masterpiece?",
            "I want the minion banana inside of me",
            "How do i say this...? It's a bit crude, but... Heheh... When i first saw minions... I got... A boner",
            "#BANANA",
            "masterpiece.",
            "I’m too poor to give you gold 🏅",
            "Better than JK Rowling",
            "The fact you wrote this scares me... Is there something you wanna put out there? ;-;",
            "everyday we stray further away from god",
            "https://i.imgur.com/uA7xMqa.jpg",
            "lets post this under dead minion memes on Facebook",
            "Minion sex.",
            "Can someone please do a dramatic reading of this on Youtube",
            "@OP, why didn't the parents attend his funeral? Was it out of a sense of guilt and self blame? Or did they feel his death wasn't worth their attendance due to the degenerated he'd become?",
            "🤲🏿nigga pray\n\n👐🏿nigga hands\n\n🙌🏿nigga hands 2\n\n👏🏿nigga clap\n\n👍🏿nigga like\n\n👎🏿nigga hate\n\n👊🏿nigga punch\n\n✊🏿nigga fist\n\n🤛🏿nigga fist left\n\n🤜🏿nigga fist right\n\n🤞🏿nigga luck\n\n✌🏿nigga peace\n\n🤟🏿nigga rock\n\n🤘🏿nigga rock 2\n\n👌🏿nigga noice\n\n👈🏿nigga left\n\n👉🏿nigga right\n\n👆🏿nigga up\n\n👇🏿nigga down\n\n☝🏿nigga up 2\n\n✋🏿nigga hand right\n\n🤚🏿nigga hand left\n\n🖐🏿nigga fingers\n\n🖖🏿nigga trek\n\n👋🏿nigga wave\n\n🤙🏿 Nigga Shaka\n\n🖕🏿nigga frick\n\n💪🏿nigga flex\n\n✍🏿nigga write\n\n🙏🏿nigga beg\n\n🦶🏿nigga foot\n\n🦵🏿nigga leg\n\n👂🏿nigga ear\n\n👃🏿nigga nose\n\n👧🏿nigga pigtails\n\n👦🏿nigga bruh\n\n👩🏿nigga girl\n\n🧑🏿nigga bruh 2\n\n👨🏿nigga bruh 3\n\n👩🏿‍🦱nigga girl 2\n\n👨🏿‍🦱nigga bruh 4\n\n👩🏿‍🦰nigga LGBTQ+\n\n👨🏿‍🦰nigga LGBTQ+ 2\n\n👱🏿‍♀️nigga wig\n\n👱🏿‍♂️nigga wig 2\n\n👩🏿‍🦳nigga white\n\n👨🏿‍🦳nigga white 2\n\n👩🏿‍🦲nigga cancer\n\n👨🏿‍🦲nigga cancer 2\n\n🧔🏿nigga beard\n\n👵🏿nigga old\n\n🧓🏿nigga old 2\n\n👴🏿nigga old cancer\n\n👲🏿nigga chigga\n\n👳🏿‍♀️nigga muslim\n\n👳🏿‍♂️nigga jihadi\n\n🧕🏿nigga oppressed\n\n👮🏿‍♀️nigga cop\n\n👮🏿‍♂️nigga cop 2\n\n👷🏿‍♀️nigga construction worker\n\n👷🏿‍♂️nigga construction worker 2\n\n💂🏿‍♀️nigga royal guard\n\n💂🏿‍♂️nigga royal guard 2\n\n🕵🏿‍♀️nigga detective\n\n🕵🏿‍♂️nigga detective 2\n\n👩🏿‍⚕️nigga doctor\n\n👨🏿‍⚕️nigga doctor 2\n\n👩🏿‍🌾nigga farmer\n\n👨🏿‍🌾nigga farmer 2\n\n👩🏿‍🍳nigga chef\n\n👨🏿‍🍳nigga chef 2\n\n👩🏿‍🎓nigga graduate\n\n👨🏿‍🎓nigga graduate 2\n\n👩🏿‍🎤nigga trans\n\n👨🏿‍🎤nigga trans 2\n\n👩🏿‍🏫nigga teacher\n\n👨🏿‍🏫nigga teacher 2\n\n👩🏿‍🏭nigga technician\n\n👨🏿‍🏭nigga technician 2\n\n👩🏿‍💻nigga mac\n\n👨🏿‍💻nigga mac 2\n\n👩🏿‍💼suit\n\n👨🏿‍💼nigga formal\n\n👩🏿‍🔧nigga wrench\n\n👨🏿‍🔧nigga wrench 2\n\n👩🏿‍🔬nigga scientist\n\n👨🏿‍🔬nigga scientist 2\n\n👩🏿‍🎨nigga artist\n\n👨🏿‍🎨nigga artist\n\n👩🏿‍🚒nigga lumberjack\n\n👨🏿‍🚀nigga astronaut\n\n👸🏿nigga queen\n\n🦹🏿‍♂️nigga halloween 🧝🏿‍♀️nigga elf\n\n🧝🏿‍♂️nigga elf 2\n\n🧛🏿‍♀️nigga vampire\n\n🧛🏿‍♂️nigga vampire 2\n\n🧙🏿‍♂️nigga wizard\n\n🧙🏿‍♀️nigga witch\n\n🎅🏿nigga claus\n\n🤶🏿nigga mrs claus\n\n🤴🏿nigga king\n\n🦸🏿‍♀️nigga superhero\n\n🦸🏿‍♂️nigga superhero 2\n\n🦹🏿‍♀️nigga halloween 2\n\n🤵🏿nigga husband\n\n👰🏿nigga wife\n\n👨🏿‍⚖️nigga judge\n\n👩🏿‍⚖️nigga judge 2\n\n👩🏿‍✈️nigga pilot\n\n👨🏿‍✈️nigga pilot 2\n\n👩🏿‍🚀nigga astronaut 2\n\n👼🏿nigga cupid\n\n🧚🏿‍♂️nigga fairy\n\n🧚🏿‍♀️nigga fairy 2\n\n🧜🏿‍♀️nigga mermaid\n\n🧜🏿‍♂️nigga fish\n\n🤱🏿nigga mom\n\n🙇🏿‍♀️nigga bow\n\n🙇🏿‍♂️nigga bow 2\n\n💁🏿‍♀️nigga sass\n\n💁🏿‍♂️nigga sass 2\n\n🙅🏿‍♀️nigga cross\n\n🙋🏿‍♂️nigga heil\n\n🙋🏿‍♀️nigga heil 2\n\n🙆🏿‍♂️nigga o pose\n\n🙆🏿‍♀️nigga o pose 2\n\n🙅🏿‍♂️nigga cross 2\n\n🤦🏿‍♀️nigga facepalm\n\n🤦🏿‍♂️nigga facepalm 2\n\n🤷🏿‍♀️nigga shrug\n\n🤷🏿‍♂️nigga shrug\n\n🙎🏿‍♀️nigga angry\n\n🙎🏿‍♂️nigga angry 2\n\n🙍🏿‍♀️nigga sad\n\n🙍🏿‍♂️nigga sad 2\n\n💇🏿‍♀️nigga haircut\n\n💇🏿‍♂️nigga haircut 2\n\n💆🏿‍♀️nigga headache\n\n💆🏿‍♂️nigga headache 2\n\n🧖🏿‍♀️nigga shower\n\n🧖🏿‍♂️nigga shower 2\n\n💅🏿nigga nail polish\n\n🤳🏿nigga phone\n\n💃🏿nigga dance\n\n🕺🏿nigga dance 2\n\n🕴🏿nigga float\n\n🚶🏿‍♀️nigga walk\n\n🚶🏿‍♂️nigga walk 2\n\n🏃🏿‍♀️nigga run\n\n🏃🏿‍♂️nigga run 2\n\n🏋🏿‍♀️nigga lift\n\n🏋🏿‍♂️nigga lift 2\n\n🤸🏿‍♀️cart wheel\n\n🤸🏿‍♂️nibba cartwheel 2\n\n⛹🏿‍♀️nigga basketball\n\n⛹🏿‍♂️nigga basket ball 2\n\n🤾🏿‍♂️nigga handball\n\n🤾🏿‍♀️nigga handball 2\n\n🧘🏿‍♀️nigga yoga\n\n🏊🏿‍♂️nigga swim\n\n🏊🏿‍♀️nigga swim2\n\n🏇🏿nigga horse\n\n🏄🏿‍♂️nigga surf\n\n🏌🏿‍♂️nigga golf\n\n🏄🏿‍♀️nigga surf 2\n\n🏌🏿‍♀️nigga golf 2\n\n🧘🏿‍♂️nigga yoga 2\n\n🤽🏿‍♀️nigga water polo\n\n🤽🏿‍♂️nigga water polo 2\n\n🚣🏿‍♀️nigga boat\n\n🚣🏿‍♂️nigga boat 2\n\n🧗🏿‍♀️nigga climb\n\n🚴🏿‍♂️nigga bike\n\n🚴🏿‍♀️nigga bike 2\n\n🚵🏿‍♂️nigga mountain bike\n\n🚵🏿‍♀️nigga mountain bike 2\n\n🧗🏿‍♂️nigga climb\n\n🤹🏿‍♀️nigga juggle\n\n🤹🏿‍♂️nigga juggle 2\n\n👶🏿nigglet",
            "That escalated quickly",
            "Its almost as great as Kiras talk on Mona Lisa.",
            "W\n\nH\n\nY",
            "qwertz. in all the time if known you, in all the godly things you've said, this is the greatest thing i could've possibly read in your overly-british kiwi ass accent. thank you for such a joyride.",
            "words cannot express what the fuck ive just witnessed",
            "holy shit",
            "This was genuinely compelling to read XD",
            "The last part was wrong. There is a heaven and hell.",
            "please post this to r/nosleep",
            "Finna send this to Netflix, I think we got something special",
            "I did not enjoy reading this and will now proceed to leave.",
            "Please get some help",
            "Baby gravy",
            "Should I be up voting or down voting",
            "What a rollercoaster",
            "ok",
            "What kind of parents refuse to leave their 13 year old son out of the house?",
            "this is just the daily life of 30 year old facebook moms.",
            "I feel like my minds eye has opened",
            "Why my pp hard?",
            "why did this make me existentially depressed",
            "6.9k likes.\n\n**Nice**",
            "This ⬆ is 🈶 a story told from multiple perspectives. Keep that in mind 🤯 as you read 🛋🛋🛋 this ⬆.    \n\nMe. September 16, 2010.    \n\nEveryone has their fetishes. \n\nSome people 👫👫👫 like 😄 feet 🚶‍♀️. Some people 👫👫👫 like 😄 tickling. Some people 👫👫👫 even have 🈶🈶🈶 a lust for being eaten. But I... I'm different.    \n\nIt all started in the September of 2010. I was 13, maybe 13-and-a-half. Old 👴 enough to be knowledgeable in sex and all that, but young 🧒 enough that I couldn't even stay at home 👪 alone. Because of that, I had to come along with the rest 😪 of the family 👪 to some movie 🎬🎬🎬. I thought it was going to be a fucking 🖕 nightmare. I'm so sorry 💔💔💔. I shouldn't have 🈶 been so disrespectful.    I was bored 😒. The movie 🎬 was Despicable Me. It seemed like 😄😄😄 any other animated film 🎬🎬🎬 for a while, but then I saw them.    I was always 🕔 not interested 🤔 in sexual things. I had no 😣😣 sex drive before that day. Not even a single random 🎲🎲🎲 boner. Some might call it a blessing, others a curse.    Dave. Bob. Stuart. What 😅 are they? Minions. The moment one 1️⃣ came on 🔛🔛🔛 scene, I felt a feeling. A feeling I had never ❌ felt before. I felt alive. For the first 🥇🥇🥇 time ⌚⌚⌚ in my life 💓. I had a boner. A raging hard-on 🔛. Without even touching it, I came within seconds. All of the saved up ☝☝☝ baby 👶👶 gravy from the past 13 years presented themselves to those little yellow 🌼 dieties. I felt as though I'd run 🏃 a marathon. My life 💓 had changed 📈.   \n\nParents 👪. December 🎄🎄🎄 2010.    \n\nOur son has become increasingly distant. He got a phone 🤳 for Christmas ❄️❄️ a few days ago, and he's only left 👈👈👈 for food 🐟 and the toilet 🚽. I've 🙋 checked, and there's no 😣 sign ⛎ of porn. Not a single boob. I blocked every porn site I could think 🤔 of, after all. One 1️⃣1️⃣ thing is 🈶 strange, though. He really likes Despicable Me. I'm sure it's just a phase.    \n\nMe. January 2011.  \n\nI'm not the only one 1️⃣1️⃣1️⃣. Thousands of other people 👫👫👫 online see 👁👁👁 our world 🌎 in the same enlightened way ↕️↕️ I do. Minionphiles we call ourselves. I told my parents 👪👪 I was going out 🏎🏍 with a friend 🐶🐶🐶 the other day. I was really going to watch 👁👁 the movie 🎬🎬 on 🔛🔛🔛 my phone 🤳🤳 in some alleyway. God, where 🤷 has masturbating to Minions been all these years?    Me. 4 July 2013.    I'm 15 and a half years old 👴👴👴. Despicable Me 2 just released and I'm watching it in cinemas. Alone. I don't need friends. I need Minions. I nearly got caught masturbating. I couldn't help 🆘 it. Those purple fuckers 🖕👦🖕 are so sexy. I've 🙋 dropped out 🏎🏍 of school 🎓🎓🎓 and now work 💼💼💼 most of the time ⌚ at my local Subway. I need the money 🤑. \n\nI spend it on 🔛🔛🔛 phone 🤳🤳 sex. I either am Gru or a Minion (I prefer to be a Minion) and vice versa for the one 1️⃣1️⃣ on 🔛 the other end 🔚🔚. I am working 🏗🏗🏗 unhealthy amounts of hours just to supply the lust. People 👫👫👫 are starting to seem concerned. I need some new 🆕🆕🆕 content fast ⚡⚡⚡.    \n\nParents 👪👪👪. 2013.   \n\nWe're concerned. We barely see 👁 our son because all he seems to do is 🈶 eat 🍽🍽🍽, sleep 🌕🌕 and work 💼. We don't even know 🤔 where 🤷 his salary goes. We hope 🙏🙏🙏 it's for a good 👌👍🏾 university 🎓🎓🎓. We didn't bring up ☝☝☝ some deadbeat. We hope 🙏🙏🙏.    \n\nMe. 25 June 2015. \n\nHoly Fuck 🖕👦🖕. Jesus ✝️ Fucking 🖕 Christ ⛪. It's a miracle beyond any other. It's not another Despicable Me, but instead a spinoff. Minions. I got kicked out 🏎🏍 of the cinema 🎦🎦🎦 for masturbating and ejaculating on 🔛 some bitch 🍑🍑🍑 in front of me. It was only a bit and it landed on 🔛 the front of her hair 💈. It would have 🈶🈶🈶 been impossible to detect by anyone but her. Whore. The Minionphile community is 🈶 having a field day. It's great 🇬🇧. I recently bought a Minion body pillow. It's Kevin 💪. Holy shit 💩, I never ❌ could have 🈶🈶 seen myself doing this ⬆ in 2010. Oh, how 🤔 I've 🙋 changed 📈.    \n\nParents 👪👪👪. 2015.\n\nWe heard thumping from his room today. We were about to enter ↩️↩️ when ⏰ we heard the word \"Banana 🐒.\" Some things are best 🏆 left 👈👈👈 alone.    \n\nMe. 2017. \n\nI've 🙋 been unemployed for 2 months now. My parents 👪 kicked me out 🏎🏍 of the house 🏠🏠. I spent 😵 my last bits of money 🤑🤑 today on 🔛 three 3️⃣ things. A ticket 🎫🎫🎫 to see 👁👁👁 Despicable Me 3. Masterpiece. At least I can have 🈶🈶🈶 joy 😀😀😀 in my life 💓 still. A motel room. The cheapest I could find 🔍🔍. And a rope. Sturdiest I could get 🉐. I've 🙋 reached the end 🔚. \n\nNearly 20 years.\n\nWhat 😅 a waste. I at least got to spend 7 of them with the Minions. I love 😍😍 them all. Even if there is 🈶 another movie 🎬, I won't be around to see 👁👁👁 it. I've 🙋 hit 👊👊👊 rock 🧗‍♀️🧗‍♀️ bottom 🔽. There's nowhere to go. Goodbye 👋. Goodbye 👋👋👋 Mum. Goodbye 👋 Dad 👨. Goodbye 👋 Little Bro 💪. I'll miss you. I'm coming, Minions. I'm coming.    \n\nHe let himself hang. He was dead 💀💀 by morning 🌞🌞🌞.    \n\nHousekeeping. \n\nI knock. No 😣😣😣 answer ✅✅✅. Again. No 😣😣 answer ✅✅✅. There's no 😣 \" Do not disturb\" card out 🏎🏍 so I go in. I scream 😱😱😱. Heads turn. Doors open 👐. I scream 😱😱 a terrible scream 😱 he'll never ❌ hear 👂👂.    \n\nBrother. \n\nHe died. Suicide. The funeral ⚰⚰ was today. Mum and Dad 👨👨👨 didn't attend.    \n\nMe.    \n\nAs I took my last breath, I realized my mistake. It turned to black. There is 🈶 no 😣😣 afterlife. If there was, then neither heaven 😇 nor hell wanted ⚠ me. I don't blame them. I cry 😂. I cry 😂 until I throw up ☝☝☝. I'm sorry 💔💔 Dave. Bob. Stuart. Kevin 💪. And now all I can do is 🈶 watch 👁. \n\n&#x200B;\n\nI'm so sorry 💔💔💔.\n\n***^(you are now breathing manually.)***",
            "Reddit has peaked",
            "Erss5tto be 5ra",
            "I feel attacked",
            "Despicable Cinematic Minionverse",
            "🗿 w h a t",
            "That **really** got me for som reason",
            "this feels more like a horror story",
            "I’m so alarmed",
            "I love this man. Please write more",
            "u/uwutranslator",
            "This made me question my existance.",
            "That was such an amazing story. Id watch it if it was a short film.",
            "What have I just read",
            "Thanks now I need to bleach my eyes",
            "no i don't think i wil",
            "Beautiful. I applaud you.",
            "Holy fuck",
            "Fuck man, you inspire me to post one of my own.",
            "When I saw those minions... How do I say this..? It might be a bit crude, but... Heheh... **I got an erection**",
            "im gay for bob",
            "That was a rollercoaster of emotions..",
            "Where the fuck has masturbating to minions been all these years.",
            "Sir this is a Wendy's drive thru",
            "im speechless",
            "r/notliketheothergirls",
            "this is the first long r/copypasta post ive read through thoroughly",
            "F",
            "So sad 😢",
            "This is so good",
            "u/nwordcountbot u/bigsmokeisnotdead",
            "this is by far the worst thing i have ever read in my entire fucking life, jesus christ i hate it so much, but in a way, it is kind of appealing\n\nnevertheless, i hate you for making this.",
            "What the actual fuck did I just read."
        ]
    },
    {
        "post_id": "cw20ey",
        "author": "telekinetic_sausage",
        "title": "I am literally shaking rn",
        "url": "https://www.reddit.com/r/copypasta/comments/cw20ey/i_am_literally_shaking_rn/",
        "score": 8277,
        "num_comments": 58,
        "created_utc": 1566898346.0,
        "selftext": "My son 🙋‍♂️was SO cute today, he asked me “dad are clouds candy?” 😍 I told him they were water. 💦 Then he asked “Dad, what’s the Earth’s defense system?” and then I remembered I don’t have a son and he asked again with his eyes obsidian black “what is the defense system father”",
        "permalink": "/r/copypasta/comments/cw20ey/i_am_literally_shaking_rn/",
        "comments": [
            "My son 🙋‍♂️was SO cute today, he asked me “dad are clouds candy?” 😍 I told him they were water. 💦 Then he asked “Dad, what’s the Earth’s defense system?” and then I remembered I don’t have a son and he asked again with his eyes obsidian black “what is the defense system father”",
            "Where are all the comments?",
            "Did the mods lock the comments and unlock them just now?",
            "My son 🙋‍♂️was SO cute today, he asked me “dad awe cwouds candy?” 😍 I towd him they wewe watew. 💦 Then he asked “Dad, what’s the Eawth’s defense system?” and then I wemembewed I don’t have a son and he asked again with his eyes obsidian bwack “what is the defense system fathew”",
            "Peenp and poonp",
            "Repost 👏👏👏😤",
            "Fuck did that come from",
            "u/uwutranslator",
            "!thesaurizethis",
            "Changing flair.",
            "u/uwutranslator",
            "YTA",
            "I love this one",
            "This is a repost from some old Facebook post back in 2014",
            "Not funny didn’t laugh",
            "[deleted]",
            "[removed]"
        ]
    }
]