[
    {
        "post_id": "g2qvde",
        "author": "libo720",
        "title": "Who asked?",
        "url": "https://www.reddit.com/r/copypasta/comments/g2qvde/who_asked/",
        "score": 8083,
        "num_comments": 130,
        "created_utc": 1587081571.0,
        "selftext": "According to world population studies, approximately 108 billion people have lived on this planet. Assuming that the average lifespan of all these people was 25, there has been around 2.7 trillion\nyears of life, if we multiply this by the number of days in a year (365), there is a\ntotal of 985,500,000,000,000 days of life\n(985.5 trillion days). Not once in any of\nthose days did anybody ask.",
        "permalink": "/r/copypasta/comments/g2qvde/who_asked/",
        "comments": [
            "According to world population studies, approximately 108 billion people have lived on this planet. Assuming that the average lifespan of all these people was 25, there has been around 2.7 trillion\nyears of life, if we multiply this by the number of days in a year (365), there is a\ntotal of 985,500,000,000,000 days of life\n(985.5 trillion days). Not once in any of\nthose days did anybody ask.",
            "[deleted]",
            "Is the average lifespan actually around 25 years in human history? That's wild.",
            "Accowding to wowwd popuwation studies, appwoximatewy 108 biwwion peopwe have wived on this pwanet. Assuming that the avewage wifespan of aww these peopwe was 25, thewe has been awound 2.7 twiwwion\nyeaws of wife, if we muwtipwy this by the numbew of days in a yeaw (365), thewe is a\ntotaw of 985,500,000,000,000 days of wife\n(985.5 twiwwion days). Not once in any of\nthose days did anybody ask.",
            "[bruh](https://www.reddit.com/r/copypasta/comments/fxwgwr/world_history/)",
            "I love this haha",
            "Oh god the annoying kid in the groupchat is gonna have a field day with this",
            "NTA obviously nobody asked.",
            "It's me, i am the guy who asked.",
            "Transform any room into a movie theater in seconds. Complete home entertainment system connects to all your devices. Watch your favorite shows anytime, anywhere! 🍿",
            "But what if I live to 26",
            "The universe hasn’t even been alive for a tenth of a trillion years. Fake news",
            "Nice",
            "Incel cock",
            "costume the cum chalice",
            "It's me! The guy who asked!",
            "I love this sub",
            "Placing the tongue gently on the roof of the mouth completes an energetic circuit within the body. Thus, it is the most connected space to keep your tongue. There are many energetic tests for the body which you need that circuit to be completed prior to the test being conducted. These sort of tests include bioenergetic feedback of various reactors within your environment. When one naturally places their tongue on the roof of their mouth as a resting state, many times it is a sign of sensitivity to energy. I know my Qigong master used my natural disposition to keep my tongue there as one of the indicators of my sensitivity to various energetic influences.",
            "Cock",
            "🤡when you say who asked🤡\n\njust because you think that no one asked for a certain information doesnt make you dominant in an arguement. You have to be the biggest fucking spastic in yuor country to think that saying \"who asked\" will grant you advantage in a fucking arguement. You're a fucking idiot if you think of that",
            "I’m stealing this lmao",
            "r/theydidthemath",
            "I know for a fact that some Twitterfag is going to copy paste this...",
            "Ok but who asked",
            "Nice repost",
            "According to world population studies, approximately 108 billion people have lived on this planet. Assuming that the average lifespan of all these people was 25, there has been around 2.7 trillion\nyears of life, if we multiply this by the number of days in a year (365), there is a\ntotal of 985,500,000,000,000 days of life\n(985.5 trillion days). Not once in any of\nthose days did anybody ask.",
            "[deleted]",
            "Lmaooo",
            "who asked you to post this?? \n\nbruh. ..",
            "I saw this on r/theydidthemath",
            "r/hedidthemath",
            "This is a repost but this is r/copypasta so does that mean it’s ok. I mean I feel kinda bad because the OP only got like 4 updoots",
            "Your math is bad, why would you round to 2 sigfigs in intermediate calculations but 4 in the final?\n\nEdit: also you should use median age rather than average since the average is brought down by the high infant mortality rate",
            "Thanks I will make good use of this",
            "\nAccording to world population studies, approximately 108 billion people have lived on this planet. Assuming that the average lifespan of all these people was 25, there has been around 2.7 trillion\nyears of life, if we multiply this by the number of days in a year (365), there is a\ntotal of 985,500,000,000,000 days of life\n(985.5 trillion days). Not once in any of\nthose days did anybody ask.",
            "Good, but too short"
        ]
    },
    {
        "post_id": "k35xxj",
        "author": "AshamedFish2",
        "title": "You have been bonked",
        "url": "https://www.reddit.com/r/copypasta/comments/k35xxj/you_have_been_bonked/",
        "score": 8079,
        "num_comments": 96,
        "created_utc": 1606638308.0,
        "selftext": "You have been bonked, \"go to horny jail\" is the last thing you hear before your vision fades to black.\n\nYou are woken to find your self in a prison cell, you look around and find all the other cells are full of other victims of the bonk. You sit down in your cell, you almost forget about being horny in the first place. You reach the back of your head and look at your hand to find it covered in blood. \"Damn, you were bonked pretty hard. My names Doge, I can help you get out it of this hell but you need to help me first.\"\n\nYou slowly nod and try to ignore the pain. \n\n\"When I was taken to Horny jail they took any sharp objects to make sure we cant escape, get me a plastic spoon from the cafeteria and bring it to me\" says Doge.\n\nA few hours later the cell doors open, and you are escorted to the cafeteria with 200 other prisoners. You grab an extra spoon and return to your cell. \n\nDoge takes the spoon and starts hitting it against his wall, eventually breaking off a chunk of it. He sharpens the brick until it is sharp enough to seriously hurt someone.\n\nLater that night, after the guards tell everyone to get to bed he hands you your own sharp brick. At about 2 in the morning he starts cutting the bars off his cell until he can fit through. You see Doge sneak up to a guard and knock him out, taking all his equipment with him. \n\nHe unlocks your cell and leads you to a weak area in the wall where he knocks a hole through the brick. You and doge run across the field until you reach the fence keeping you in the prison. Luckily Doge has already dug a hole underneath the fence. \n\nOnce you escape the prison with Doge you hear shouting and lights start bouncing off walls towards your direction. Until one hits you and illuminates your position, you barely avoid the gun fire from the guards until you are finally shot and collapse on the ground, your vision fading to black. \n\nYou are awoken to the sound of a carriage and the smells of a forest.\n\n\"Hey you, you're finally awake\"",
        "permalink": "/r/copypasta/comments/k35xxj/you_have_been_bonked/",
        "comments": [
            "i already knew how it would end, i think i should stop scrolling the internet and go outside holy shit.",
            "You are trying. \"Go home. From the Hore \"- This is the last thing you hear before your black.\n\nYou wake up to be in prison. You look around and find two cells full of other victims. You live in your cell, you first forget the worry. You go to the head and watch your hand to find blood \",\" Danin has a lot of problems. My name can help you in this hell. But you have to help first \"\n\nYou are slowing slowly and trying to ignore the pain.\n\n\"But I have sent a conflict in prison for me to clean it. It cannot avoid church from the church.\n\nA few hours later, open the door, open the door, open the rest and more than 200. You get a small table and return your fence.\n\nThe dog uses a spoon and began to try on the wall, which eventually folded its parts. Mask's consumptions can be very strong.\n\nAfter that night the police went to bed after you laughed at you. My insects were at 2 o'clock in the evening. He started cutting from the cell to him. You see how to hug it with rain and tap, do everything with him.\n\nHe turned your camera and brought you into a wall in soft water all blowing. You and you crawl from the stadium until you come to the bar to catch you in prison. But when you are good, the dog digs under the fence.\n\nAfter avoiding imprisonment and listen to shouts and orange, which begin to get rid of your side walls. Until now, one won't hit you and won't shine your position. You don't like to avoid firearms, shoot up the world.\n\nYou wake up with a car's voice and the smell of forest.\n\n\"Hey, you can't sleep\"",
            "You were trying to cross the border, right? Walked right into that Imperial ambush, same as us, and that thief over there.\nDamn you Stormcloaks. Skyrim was fine until you came along. Empire was nice and lazy. If they hadn't been looking for you, I could've stolen that horse and be halfway to Hammerfell. You there. You and me - we shouldn't be here. It's these Stormcloaks the Empire wants.\nWe're all brothers and sisters in binds now, thief.\nShut up back there!\nAnd what's wrong with him, huh?\nWatch your tongue. You're speaking to Ulfric Stormcloak, the true High King.\nUlfric? The Jarl of Windhelm? You're the leader of the rebellion. But if they've captured you... Oh gods, where are they taking us?\nI don't know where we're going, but Sovngarde awaits.\nNo, this can't be happening. This isn't happening.\nHey, what village are you from, horse thief?\nWhy do you care?\nA Nord's last thoughts should be of home.\nRorikstead. I'm... I'm from Rorikstead.\n\n\n...looks like the Thalmor are with him.\n\n\nGeneral Tullius, sir. The headsman is waiting.\nGood. Let's get this over with!\nShor, Mara, Dibella, Kynareth, Akatosh. Divines, please help me.\nLook at him. General Tullius the Military Governor. And it looks like the Thalmor are with him. Damn elves. I bet they had something to do with this.\n\nWhy are we stopping?\nWhy do you think? End of the line. Let's go. Shouldn't keep the gods waiting for us.",
            "You have been bonked, \"go to horny jail\" is the last thing you hear before your vision fades to black.\n\nYou are woken to find your self in a prison cell, you look around and find all the other cells are full of other victims of the bonk. You sit down in your cell, you almost forget about being horny in the first place. You reach the back of your head and look at your hand to find it covered in blood. \"Damn, you were bonked pretty hard. My names Doge, I can help you get out it of this hell but you need to help me first.\"\n\nYou slowly nod and try to ignore the pain.\n\n\"When I was taken to Horny jail they took any sharp objects to make sure we cant escape, get me a plastic spoon from the cafeteria and bring it to me\" says Doge.\n\nA few hours later the cell doors open, and you are escorted to the cafeteria with 200 other prisoners. You grab an extra spoon and return to your cell.\n\nDoge takes the spoon and starts hitting it against his wall, eventually breaking off a chunk of it. He sharpens the brick until it is sharp enough to seriously hurt someone.\n\nLater that night, after the guards tell everyone to get to bed he hands you your own sharp brick. At about 2 in the morning he starts cutting the bars off his cell until he can fit through. You see Doge sneak up to a guard and knock him out, taking all his equipment with him.\n\nHe unlocks your cell and leads you to a weak area in the wall where he knocks a whole through the brick. You and doge run across the field until you reach the fence keeping you in the prison. Luckily Doge has already dug a whole underneath the fence.\n\nOnce you escape the prison with Doge you hear shouting and lights start bouncing off walls towards your direction. Until one hits you and illuminates your position, you barely avoid the gun fire from the guards until you are finally shot and collapse on the ground, your vision fading to black.\n\nYou are awoken to the sound of a carriage and the smells of a forest.\n\n\"Hey you, you're finally awake",
            "You 👈🏼 have been bonked, \"go 🏃 to horny 😩😈 jail ⛓\" is the last 😍 thing 📴 you 👈 hear 👂 before 😂 your 👉 vision 👀 fades 😜😏💯 to black ⬛.   \n  \nYou 👈 are woken 😴🚫⏰ to find 🔍 your 👉 self 💯 in a prison 🚔 cell 🦠, you 👈 look 👀 around 🧱🎶🎵 and find 🔍🕵🏼‍♀️ all 💯 the other cells 🦠 are full 🌝 of other victims 😱😵😖 of the bonk. You 👈 sit 💺 down ⬇ in your 👉 cell 🦠, you 👈 almost 💸 forget 🧠🤔 about 💦💭 being horny 😉 in the first 🥇 place 🏆. You 👉 reach 👉 the back 🔙 of your 👉 head 🗣 and look 👀 at your 👉 hand ✋👋 to find 🔍 it covered 🍆 in blood 💉. \"Damn 💯, you 👈🏾 were bonked pretty 👰 hard 🍆😯. My names 📛 Doge 🐶, I 👁 can help 💁 you 👈 get 🉐 out it of this hell 👿🔥 but 🍑😩 you 👉👤 need 👉 to help 💁 me first 👆.\"   \n  \nYou 👈 slowly 🐢 nod ↪↩ and try 😐 to ignore 💩 the pain 😡.   \n  \n\"When ⏰ I 👁 was taken 💅 to Horny 😉 jail 🚔 they took 👫 any sharp 🔪 objects 👀👉 to make 🖕 sure 👍 we cant 🚫 escape 😫, get 🉐🅰 me a plastic 🛢 spoon 🥄 from the cafeteria 🍌🍕🥪 and bring 👎 it to me\" says 🗣 Doge 🐶.   \n  \nA few hours 🕐🕔 later 👋🅱 the cell 📱 doors 🔑 open 😃, and you 👉👨🏻 are escorted 👉 to the cafeteria 🍌🍕🥪 with 200 💯 other prisoners 👨. You 👈 grab ✊ an extra ➕ spoon 🥄😩👅 and return ↪ to your 😒👉 cell 📱.   \n  \nDoge 🐶 takes 👊 the spoon 🥄😯 and starts 🆕 hitting 👊 it against 🚫 his 💦 wall 🧱🎶🎵, eventually ⌚ breaking 🔨 off 📴 a chunk 🍯 of it. He 👥 sharpens the brick 🧱 until it is sharp 🔪 enough 💦 to seriously 😐 hurt 🤕 someone 👤.   \n  \nLater 🕑 that night 🌒😪🌚, after 🔜👀 the guards 💂‍♂️ tell 🗣 everyone 👥 to get 🔟 to bed 🛌 he 👨 hands ✋❤ you 👈 your 👉 own sharp 😎 brick 🏗🔨😟. At about 💦 2 🕝 in the morning 🌞🌄🌅 he 👨 starts 🔘 cutting 🔪 the bars 🎯 off 📴 his 👋 cell 🦠 until he 👨 can fit 💪♀ through. You 👈 see 👀 Doge 🐶 sneak 🤫 up ⬆ to a guard 💂 and knock 👊 him 👨🏾 out, taking 👊 all 💯 his 💦 equipment 🎿 with him 👨🏼.   \n  \nHe 👥 unlocks 🔐 your 👉 cell 🦠🧬 and leads 🔆 you 👈😥👉 to a weak ❌💪🏻 area ⚠💀 in the wall 🧱🎶🎵 where he 👨 knocks ✊👊 a whole 💦😍 through the brick 🏗🔨😟. You 👈 and doge 🐶 run 🏃 across ➡ the field 🖼 until you 👈 reach 👍 the fence 🚧 keeping 👌 you 👉🏻 in the prison 🔒. Luckily ⚠🍀 Doge 🐶 has already 👋 dug ⛏ a whole 💦😍 underneath 🌲 the fence 🚧.   \n  \nOnce you 👈 escape 🏃🏻 the prison 🔒 with Doge 🐶 you 👉 hear 👂 shouting 🗣🗯 and lights 💡 start 🆕 bouncing 😱 off 📴 walls 🧱🎶🎵 towards 😂 your 👉 direction 👆. Until one ☝🏼 hits 👊 you 👈 and illuminates 💡🕎🕯 your 👉🏻🧑🏻 position 😻, you 👉🏿 barely 🐻 avoid 👋😒🤳 the gun 😭🔫 fire 🔥 from the guards 💂 until you 👉 are finally 👆 shot 🔫 and collapse 👹 on 🔛 the ground 😫, your 👉 vision 👓👀🕶 fading 😜😏💯 to black ⬛.   \n  \nYou 👉🏻 are awoken to the sound 👂 of a carriage 🍛🔛 and the smells 👃 of a forest 🌲.   \n  \n\"Hey 👋 you 👉, you're finally 🙏 awake 💪🏼\"",
            "Perfect for ai dungeon tbh",
            "Expected that doge would use sharp brick as dildo.",
            "You have been bonked, \"go to howny jaiw\" is the wast thing you heaw befowe youw vision fades to bwack.\n\nYou awe woken to find youw sewf in a pwison ceww, you wook awound and find aww the othew cewws awe fuww of othew victims of the bonk. You sit down in youw ceww, you awmost fowget about being howny in the fiwst pwace. You weach the back of youw head and wook at youw hand to find it covewed in bwood. \"Damn, you wewe bonked pwetty hawd. My names Doge, I can hewp you get out it of this heww but you need to hewp me fiwst.\"\n\nYou swowwy nod and twy to ignowe the pain. \n\n\"When I was taken to Howny jaiw they took any shawp objects to make suwe we cant escape, get me a pwastic spoon fwom the cafetewia and bwing it to me\" says Doge.\n\nA few houws watew the ceww doows open, and you awe escowted to the cafetewia with 200 othew pwisonews. You gwab an extwa spoon and wetuwn to youw ceww. \n\nDoge takes the spoon and stawts hitting it against his waww, eventuawwy bweaking off a chunk of it. He shawpens the bwick untiw it is shawp enough to sewiouswy huwt someone.\n\nWatew that night, aftew the guawds teww evewyone to get to bed he hands you youw own shawp bwick. At about 2 in the mowning he stawts cutting the baws off his ceww untiw he can fit thwough. You see Doge sneak up to a guawd and knock him out, taking aww his equipment with him. \n\nHe unwocks youw ceww and weads you to a weak awea in the waww whewe he knocks a whowe thwough the bwick. You and doge wun acwoss the fiewd untiw you weach the fence keeping you in the pwison. Wuckiwy Doge has awweady dug a whowe undewneath the fence. \n\nOnce you escape the pwison with Doge you heaw shouting and wights stawt bouncing off wawws towawds youw diwection. Untiw one hits you and iwwuminates youw position, you bawewy avoid the gun fiwe fwom the guawds untiw you awe finawwy shot and cowwapse on the gwound, youw vision fading to bwack. \n\nYou awe awoken to the sound of a cawwiage and the smewws of a fowest.\n\n\"Hey you, you'we finawwy awake\"",
            "This would make a great r/dogelore post",
            "You have been bonked, \"go to horny jail\" is the last thing you hear before your vision fades to black.\n\nYou are woken to find your self in a prison cell, you look around and find all the other cells are full of other victims of the bonk. You sit down in your cell, you almost forget about being horny in the first place. You reach the back of your head and look at your hand to find it covered in blood. \"Damn, you were bonked pretty hard. My names Doge, I can help you get out it of this hell but you need to help me first.\"\n\nYou slowly nod and try to ignore the pain.\n\n\"When I was taken to Horny jail they took any sharp objects to make sure we cant escape, get me a plastic spoon from the cafeteria and bring it to me\" says Doge.\n\nA few hours later the cell doors open, and you are escorted to the cafeteria with 200 other prisoners. You grab an extra spoon and return to your cell.\n\nDoge takes the spoon and starts hitting it against his wall, eventually breaking off a chunk of it. He sharpens the brick until it is sharp enough to seriously hurt someone.\n\nLater that night, after the guards tell everyone to get to bed he hands you your own sharp brick. At about 2 in the morning he starts cutting the bars off his cell until he can fit through. You see Doge sneak up to a guard and knock him out, taking all his equipment with him.\n\nHe unlocks your cell and leads you to a weak area in the wall where he knocks a whole through the brick. You and doge run across the field until you reach the fence keeping you in the prison. Luckily Doge has already dug a whole underneath the fence.\n\nOnce you escape the prison with Doge you hear shouting and lights start bouncing off walls towards your direction. Until one hits you and illuminates your position, you barely avoid the gun fire from the guards until you are finally shot and collapse on the ground, your vision fading to black.\n\nYou are awoken to the sound of a carriage and the smells of a forest.\n\n\"Hey you, you're finally awake\"\n\n\nDoing Cummy's job 😩\nRIP u/cummybot2020 😔",
            "Doge, what a mad lad",
            "This reads like a DM who is sick of their bard seducing everyone so they design this special event specifically for him to be gone on his own for a session to change his attitude for the sake of the rest of the party/campaign.",
            "For mobile users :)\n\nYou have been bonked\n\nYou have been bonked, \"go to horny jail\" is the last thing you hear before your vision fades to black.\n\nYou are woken to find your self in a prison cell, you look around and find all the other cells are full of other victims of the bonk. You sit down in your cell, you almost forget about being horny in the first place. You reach the back of your head and look at your hand to find it covered in blood. \"Damn, you were bonked pretty hard. My names Doge, I can help you get out it of this hell but you need to help me first.\"\n\nYou slowly nod and try to ignore the pain. \n\n\"When I was taken to Horny jail they took any sharp objects to make sure we cant escape, get me a plastic spoon from the cafeteria and bring it to me\" says Doge.\n\nA few hours later the cell doors open, and you are escorted to the cafeteria with 200 other prisoners. You grab an extra spoon and return to your cell. \n\nDoge takes the spoon and starts hitting it against his wall, eventually breaking off a chunk of it. He sharpens the brick until it is sharp enough to seriously hurt someone.\n\nLater that night, after the guards tell everyone to get to bed he hands you your own sharp brick. At about 2 in the morning he starts cutting the bars off his cell until he can fit through. You see Doge sneak up to a guard and knock him out, taking all his equipment with him. \n\nHe unlocks your cell and leads you to a weak area in the wall where he knocks a whole through the brick. You and doge run across the field until you reach the fence keeping you in the prison. Luckily Doge has already dug a whole underneath the fence. \n\nOnce you escape the prison with Doge you hear shouting and lights start bouncing off walls towards your direction. Until one hits you and illuminates your position, you barely avoid the gun fire from the guards until you are finally shot and collapse on the ground, your vision fading to black. \n\nYou are awoken to the sound of a carriage and the smells of a forest.\n\n\"Hey you, you're finally awake\"",
            "My favorite part is when Doge decided to not use the spoon as a weapon and instead uses it to sharpen a brick",
            "based",
            "YOU CALL THIS RESISTING ARREST, WE LIKE CALL THIS A DIFFICULTY TWEAK",
            "r/hornyjail actually exists.",
            "I’d use this had you not misspelled “hole” 4 times",
            "I commented 'You're finally awake' before even reading the end i was talking about the start and now im both pleased and disappointed somehow",
            "Bout time that meme got a story",
            "I thought this was gonna be about TF2 then got Skyrim not disappointed",
            "I was invested in this whole story, please, make a part 2",
            "[thanks for the inspiration buddy ](https://www.reddit.com/r/dogelore/comments/k3o0xy/le_horny_jail_part_1/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "I knew this was gonna be a horny jail reference just by reading the title",
            "i can't contain my horny level",
            "How the fuck is a \"sharp brick\" gonna cut metal bars?",
            "very predictable \n\n0/10",
            "cringe stfu",
            "My friend bonked me on the head once and I completely sobered up from my acid trip immediately",
            "!emojify",
            "Please explain how we went from whacking a spoon to somehow coming across a... sharp... brick?",
            "Arthur Morgan being kidnapped",
            "I always thought horny jail was full of horny people and all it is, is just one huge orgy inside",
            "!emoji",
            "The Infinite Dream Cycle.",
            "Certified Diavolo Moment",
            "Is the ending shrek",
            "i’m gonna make a dogelore post for this\n\ni recon it will take a couple days",
            "nice.",
            "What happened to the bot that replied with the post so I could copy it- I’m on mobile",
            "*A relevant comment in this thread was deleted. You can read it below.*\n\n----\n\nYou have been bonked, \"go to horny jail\" is the last thing you hear before your vision fades to black.\n\nYou are woken to find your self in a prison cell, you look around and find all the other cells are full of other victims of the bonk. You sit down in your cell, you almost forget about being horny in the first place. You reach the back of your head and look at your hand to find it covered in blood. \"Damn, you were bonked pretty hard. My names Doge, I can help you get out it of this hell but you need to help me first.\"\n\nYou slowly nod and try to ignore the pain. [[Continued...]](https://www.resavr.com/comment/been-bonked-15629965)\n\n----\n\n\n*^The ^username ^of ^the ^original ^author ^has ^been ^hidden ^for ^their ^own ^privacy. ^If ^you ^are ^the ^original ^author ^of ^this ^comment ^and ^want ^it ^removed, ^please [^[Send ^this ^PM]](http://np.reddit.com/message/compose?to=resavr_bot&subject=remove&message=15629965)*",
            "\nG sea j ok I’ll r Dr weird no"
        ]
    },
    {
        "post_id": "lcgn8b",
        "author": "DashingFlame",
        "title": "Buy $COCK",
        "url": "https://www.reddit.com/r/copypasta/comments/lcgn8b/buy_cock/",
        "score": 8079,
        "num_comments": 70,
        "created_utc": 1612448496.0,
        "selftext": "Buy $**COCK**. I heard WSB is buying $COCK and $COCK IS THE NEXT BIG THING.\n\n$COCK IS RISING TODAY.\n\nDo your own DD on $COCK and let me know how much you like $COCK.\n\n💎✊ your 🚀🚀🚀 $COCK to the 🌑",
        "permalink": "/r/copypasta/comments/lcgn8b/buy_cock/",
        "comments": [
            "$GAYMF",
            "** Bought a chicken each ** I heard WSB $ COCK and $ COCK are another great thing\n\nToday, the number of poultry is growing.\n\nYou DD with $ COCK and say how much $ COCK is worth.\n\nRo c.",
            "[Original comment](https://www.reddit.com/r/wallstreetbets/comments/lcc1z6/comment/glz20gt)",
            "There once was a ship ⛴ that put 😏 to sea 🐳  \nAnd the name 📛 of that ship ⛴ was the Billy 👨🏿 o' Tea ☕  \nThe winds 💨 blew 💨 hard 🍆, her 👩🏽 bow 🏹 dipped 💨🚘🔙 down ⬇  \nBlow 💥, me bully 😡 boys 👦, blow 💥 (huh 😕)\n\nSoon 🔜 may 🗓 the Wellerman come 💦  \nTo bring 👎 us 🇺🇸 sugar 🍚 and tea ☕🍵😏 and rum 🏥  \nOne ☝ day 🌞, when 🍑 the tonguing' is done 🔨  \nWe'll 😤 take 👊 our leave 🍂 and go 🏃🏻‍♀️\n\nShe 👩🏻 had not been two ✌ weeks 🗓 from shore 🌊  \nWhen ⏰ down ⬇ on 💦 her 💀👩 a right ✔ whale 🐋 bore 😒  \nThe captain 👨‍✈️ called 📞 all 💯 hands ✋ and swore 🤞  \nHe'd 😶 take 👊 that whale 🐋 in tow 🏙 (huh 😨)\n\nSoon ⏰ may 🗓 the Wellerman come 💦😣  \nTo bring 🚶 us 👨 sugar 🍬 and tea 🍵 and rum 🥃  \nOne 😤 day 📆➕, when 🍑 the tonguing' is done 🔨  \nWe'll 😦 take 👊 our leave 🍃 and go 🏃  \nBefore 😂 the boat ⛵ had hit 👊 the water 💧  \nThe whale's 🐋🐳🔫 tail 🏃🏻🚨 came 💦 up ☝ and caught 🐾 her 👩🏽‍💼  \nAll 💯 hands ✋ to the side 👈👉, harpooned and fought 💭 her 👩🧊  \nWhen 🍑 she 👩 dived down ⬇ below 🙆 (huh 😕)\n\nSoon ⏰ may 🗓 the Wellerman come 💦  \nTo bring 🚶 us 👨 sugar 🍚 and tea 🍵👐 and rum 🥃  \nOne 😤 day 🌞, when 🍑 the tonguing' is done ✅  \nWe'll 😦 take 👊 our leave 🍂 and go 🏃\n\nNo 🙅 line ➖ was cut 🔪, no 🚫❌ whale 🐋🐳🔫 was freed 🙈  \nAn' the captain's 👨‍✈️ mind 🤯 was not on 🔛 greed 😩  \nBut 🍑 he 👨 belonged 🏠 to the Whaleman's creed ⛪  \nShe 👩 took 👫 that ship 🛳 in tow 🏙 (huh 😕)\n\nSoon 🔜 may 🗓 the Wellerman come 💦✝  \nTo bring 🚶 us 👨 sugar 🍚 and tea 😍🍵 and rum 🗿  \nOne ☝ day 🌞⭐🌟, when ⏰ the tonguing' is done 🔨  \nWe'll 😦 take 👊 our leave 🍃 and go 👉\n\nFor forty 👴🚗 days 🌞 or even 🌃 more (ooh 😮)  \nThe line 〰 went 💨 slack 😪 then tight 😫 once more  \nAll 💯 boats 🚤 were lost 💸, there were only four 4️⃣  \nAnd still 🙄😽 that whale 🐋🐳🔫 did go 👉📨\n\nSoon 🔜 may 👌 the Wellerman come 😩💦  \nTo bring 🚶 us 👨 sugar 🍬 and tea 🍵 and rum 🥃  \nOne 1️⃣ day 🌞, when 🍑💕💯 the tonguing' is done ✅  \nWe'll 😦 take 👊 our leave 🍃 and go 🏃\n\nAs far ↔ as I've 🙋 heard 📣👂🏾, the fight's 😠👊 still 🙄 on 🔛  \nThe line's 〰 not cut ✂, and the whale's 🐋🐳🔫 not gone 🏃  \nThe Wellerman makes 🛠 his 👋 regular 🌙 call 📞  \nTo encourage 🏄‍♂️🏊‍♂️🤽‍♂️ the captain 👨‍✈️, crew 👬 and all 💯\n\nSoon 🔜 may 🗓 the Wellerman come 💦😏😩  \nTo bring 🚶 us 👨 sugar 💰👴🏻🍭 and tea ☕👌👀 and rum 🏥  \nOne ☝ day 📆, when ⏰ the tounging' is done ✅  \nWe'll 😤 take 👊 our leave 🍃🍂 and go 🏃",
            "Buy 💰 $**COCK 🐓**. I 👁 heard 🙉 WSB is buying 💵💸💻 $COCK 🐓 and $COCK 🍆 IS THE NEXT ➡👶 BIG 📏🐘🍆 THING 🕑.   \n  \n$COCK 🐓 IS RISING 🌹 TODAY 📆.   \n  \nDo your 👉👩‍🦰 own DD 🆎 on 🔛 $COCK 🍆🍌🐓 and let 👫 me know ☣💭🤔 how much 😩😂🙀 you 👉 like 👍 $COCK 🍆.   \n  \n💎✊ your 👉 🚀🚀🚀 $COCK 🍆 to the 🌑",
            "WE LIKE THE $COCK 🚀🚀🚀",
            "Buy $**COCK**. I heawd WSB is buying $COCK and $COCK IS THE NEXT BIG THING.\n\n$COCK IS WISING TODAY.\n\nDo youw own DD on $COCK and wet me know how much you wike $COCK.\n\n💎✊ youw 🚀🚀🚀 $COCK to the 🌑",
            "Truly disgusting, that some \"people\" would do this horrible thing.",
            "My $COCK isn't growing...",
            "Buy $COCK\n\nBuy $**COCK**. I heard WSB is buying $COCK and $COCK IS THE NEXT BIG THING.\n\n$COCK IS RISING TODAY.\n\nDo your own DD on $COCK and let me know how much you like $COCK.\n\n💎✊ your 🚀🚀🚀 $COCK to the 🌑",
            "HOLD $COCK LIKE YOUR LIFE DEPENDS ON IT. GIVE ALL YOUR MONEY FOR $COCK\n\nIF YOU DON’T INVEST $COCK GOING DOWN IS YOUR FAULT NOT MINE FOR INVESTING MY LIFE SAVINGS BASED ON WHAT SOME DUMBASSES ON WSB SAID!!!! SHORT $COCK",
            "Buy $cock\n\nnsfw\n\nbuy $cock. 🙋‍♂️ heard wsb ✅ buying $cock ➕ $cock ✅ ☝️ next big thing.\n\n \n\n$cock ✅ rising today.\n\n \n\ndo your own dd on $cock ➕ let me know how much 👉 like $cock.\n\n \n\n💎✊ your 🚀🚀🚀 $cock to ☝️ 🌑",
            "I got scammed, they gave me a £COCK instead of a $COCK",
            "$COCK is getting huge.  \nI'm going to hold $COCK  \nSqueeze $COCK and short sellers will blow their loads",
            "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            "Went past the primary school down the road and LET ME TELL YOU, $COCK is definitely rising",
            "COCK TO THE MOON",
            "If he's still on $COCK I'm still on $COCK!",
            "I bought $BBW for my $COCK",
            "INVEST IN C.U.M",
            "I NEED INSIDER TIPS ON BIG SUCCESSFUL COCKS FOR GAY TRADING. ALSO INTERESTED IN JUMPING INTO CHODE FUTURES",
            "&#x200b;",
            "\nstock market is like a shop where like the limbs of a company is sold. Now, the money you used to buy their limbs will be used by the company to fund other things for their own. U might wonder why some stocks are expensive. Well let's put it this way, let's say that Angelina Jollie announces that she's selling her parts. And we know that Angelina Jollie is very popular, so that's the reason why her parts are more expensive. We can also say that she have done some controversy so her value declines and people will be selling her parts to somebody else. People sometimes will take advantage of this because the value is now cheaper. But we know, Angelina Jollie is can regain people's trust and again will boost value. How do we know this? It's publicly displayed in the media. Media will be our market. We check the TV for news and see what's currently happening. From there, we can see the current status although in real world, their are tickers for this. Ticker names is like Apple is to APPL. Now let's say that Angelina Jollie's stock price was $50 when you bought her back in 2000 and today the price is $150 because you know, Angelina gains so much popularity she was all over the media. You decided to sell the stock and now you just made $100 out of your $50.",
            "I love my $COCK. If I sold it, I don't know how I could call myself a man anymore.",
            "$COCK and $BALLS are on the rise",
            "Reddit, do your thing",
            "To the moon",
            "** bought a chicken each **",
            "Hold the line boys",
            "cock is rising today",
            "We like the $COCK",
            "$RTRD",
            "Brilliant lmaoo",
            "HOLD your $COCK",
            "yes",
            "Buy $COCK\n\nBuy $**COCK**. I heard WSB is buying $COCK and $COCK IS THE NEXT BIG THING.\n\n$COCK IS RISING TODAY.\n\nDo your own DD on $COCK and let me know how much you like $COCK.\n\n💎✊ your 🚀🚀🚀 $COCK to the 🌑",
            "This is how to get tendies",
            "i love $COCK",
            "Lol",
            "Ah $h!t-",
            "Yall on sum😔🤦‍♂️🤦‍♂️. Ya gotta buy DNG🙏🙏👍💯☝☝💯💰"
        ]
    },
    {
        "post_id": "sx6tpd",
        "author": "sirens_war_cry",
        "title": "I masturbate to pictures of Ben Shapiro almost every day just because I know he would hate the idea of a male wanking to him",
        "url": "https://www.reddit.com/r/copypasta/comments/sx6tpd/i_masturbate_to_pictures_of_ben_shapiro_almost/",
        "score": 8064,
        "num_comments": 139,
        "created_utc": 1645379257.0,
        "selftext": "it's actually really difficult because I don't find him sexually attractive in any way and especially just his headshots but I have done it every day for about 2 years because I found it funny at first but now I'm so used to it that it makes me feel incomplete if I don't do it every day",
        "permalink": "/r/copypasta/comments/sx6tpd/i_masturbate_to_pictures_of_ben_shapiro_almost/",
        "comments": [
            "What about his sister?",
            "Hi! Just thought I'd let you know that you're not the only one. I used to be obsessed with Ben Shapiro. I would use my phone to look up photos of him and try to imagine he was in bed with me. He looks pretty much the same from photos and videos. Sometimes I would masturbate to videos of him just because I would find them really difficult to resist. I would masturbate in the bathroom, in the closet, in my bedroom, in my office. Anything. Even if I knew it would make me so depressed afterwards, I'd have to do it.\n\nI recently lost interest in Ben Shapiro, because he came out as a conservative, which he always seemed to be but he's too smart to act like that on purpose. He was never the kind of guy I would ever date, but now I realize that's how I was treating him.",
            "Copy for mobile?",
            "NTA Ben should be grateful you take the time to do this. Very Selfless",
            "Chad",
            "We salute you for your sacrifice",
            "what makes you think he doesn't like it ?",
            "props to the guy who actually did this",
            "Let’s say, hypothetically, you’re absolutely cranking your hog to me.",
            "Cum doesn't care about your feelings.",
            "I doubt that anyone can truly find him sexually attractive. I'm bi and I see literally nothing of worth in him",
            "I played a Ben Shapiro video on 2x speed and it almost went back in time",
            "Jacking off to men to own the conservatives.",
            "Same",
            "I think he would be flattered tbh. If u want to destroy him u have to get pregnant name the baby Ben and abort it.",
            "This ages like fine wine.",
            "Let’s say, hypothetically, I have a 13” big black dildo up my bussy",
            "I masturbate to pictures of Ben Shapiro almost every day just because I know he would hate the idea of a male wanking to him  \nit's actually really difficult because I don't find him sexually attractive in any way and especially just his headshots but I have done it every day for about 2 years because I found it funny at first but now I'm so used to it that it makes me feel incomplete if I don't do it every day",
            "i jerk to your jerk... how deep do it go?",
            "You should send him a video, I'm sure he'd love that.  Really we should all be sending our dick pics to Ben.",
            "Is this part of a gay therapy regimen? It just might work.",
            "ben shakpiro amriki hom0 sex 🤬😂👌 كاري السمك free netbot 😘😘 🚗🚗🏳‍🌈🔥🔥🔥🔥🔥   \n\nISIS amriki war free punjab أمريكا زيت الطبخ الحرب 😁😍😈😈  😨😘 فيلم مضحك البنجاب 😁💋",
            "u should do cum tribute and send it to him.",
            "[removed]",
            "u/UberPheonix",
            "Can I used this to say he ranked batman movies and I honestly thought it was an AI voice shitpost for about a minute before I realized it was in his channel. Like not what I expected from him. Couple bad takes but what's new",
            "mood",
            "ah yes I remember that r/ confessions post",
            "I like Ben but that's some funny shit right there. Lol",
            "Me",
            "bruh",
            "r/HoldUp",
            "Hello",
            "Chad move",
            "You might think that....but you'd be wrong.",
            "Don’t do that.",
            "I dont even know who he is🗿",
            "I do the exact same thing but with Glenn Beck. I’ve started to have sex dreams about him.",
            "he broke the 4th wall",
            "I relate to this post"
        ]
    },
    {
        "post_id": "fczcv2",
        "author": "hexaflexagon-",
        "title": "general grievous doe",
        "url": "https://www.reddit.com/r/copypasta/comments/fczcv2/general_grievous_doe/",
        "score": 8059,
        "num_comments": 186,
        "created_utc": 1583261533.0,
        "selftext": "          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
        "permalink": "/r/copypasta/comments/fczcv2/general_grievous_doe/",
        "comments": [
            "          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "Hello there!",
            "_💀_\n                     /   _|_   \\\n                    /  /  |   \\  \\\n                🧪 /    |    \\  🔪\n                  🖍 __|__  ✏️\n                      /          \\\n                    /              \\\n                    \\              / \n                  __\\           /__                           \n _💀_\n                     /   _|_   \\\n                    /  /  |   \\  \\\n                🧪 /    |    \\  🔪\n                  🖍 __|__  ✏️\n                      /          \\\n                    /              \\\n                    \\              / \n                  __\\           /__                       _💀_\n                     /   _|_   \\\n                    /  /  |   \\  \\\n                🧪 /    |    \\  🔪\n                  🖍 __|__  ✏️\n                      /          \\\n                    /              \\\n                    \\              / \n                  __\\           /__",
            "my wife",
            "          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "Cum",
            "          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "My pp hard",
            "Grieving these nuts",
            "He do be broken doe",
            "No dats not grewious dats Mithrax the Forsaken 😤",
            "_💀_ / _|_ \\ / / | \\ \\ 🧪 / | \\ 🔪 🖍 __|__ ✏️ / \\ / \\ \\ / __\\ /__",
            "Gen griv got the drip",
            "          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "Cock",
            "*cough cough* alright, maybe it happened. But six million? *cough cough*",
            "general grievous doe\n\n          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "Emoji s were used in the making of this meme",
            "Meow",
            "Hello there",
            "          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "          \n\n                           _💀_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    🧪 /    |    \\  🔪\n                      🖍 __|__  ✏️\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "\n                           _😂_\n                         /   _|_   \\\n                        /  /  |   \\  \\\n                    👌 /    |    \\  👌\n                      👌 __|__  👌\n                          /          \\\n                        /              \\\n                        \\              / \n                      __\\           /__",
            "its time to abandon ship",
            "I’m torn between naming this General Grievous or “General Kenobi” in my library",
            "                       _💀_\n                     /   _|_   \\\n                    /  /  |   \\  \\\n                🧪 /    |    \\  🔪\n                  🖍 __|__  ✏️\n                      /          \\\n                    /              \\\n                    \\              / \n                  __\\           /__",
            "It’s skeleton prime but with a body",
            "Pee",
            "[deleted]",
            "cock",
            "This is so bad but thats what makes it so good",
            "Cuck",
            "God",
            "Cock",
            "cock virgin god",
            "Cock",
            "Cock",
            "Cock",
            "[deleted]",
            "Cock",
            "Cum",
            "_💀_ / _|_ \\ / / | \\ \\ 🧪 / | \\ 🔪 🖍 __|__ ✏️ / \\ / \\ \\ / __\\ /__ _💀_ / _|_ \\ / / | \\ \\ 🧪 / | \\ 🔪 🖍 __|__ ✏️ / \\ / \\ \\ / __\\ /__ _💀_ / _|_ \\ / / | \\ \\ 🧪 / | \\ 🔪 🖍 __|__ ✏️ / \\ / \\ \\ / __\\ /__ _💀_ / _|_ \\ / / | \\ \\ 🧪 / | \\ 🔪 🖍 __|__ ✏️ / \\ / \\ \\ / __\\ /__ _💀_ / _|_ \\ / / | \\ \\ 🧪 / | \\ 🔪 🖍 __|__ ✏️ / \\ / \\ \\ / __\\ /__ _💀_ / _|_ \\ / / | \\ \\ 🧪 / | \\ 🔪 🖍 __|__ ✏️ / \\ / \\ \\ / __\\ /__",
            "Cock",
            "Cock",
            "Cock",
            "Cock",
            "Cock",
            "Cock",
            "cock",
            "I don't care for this ASCII art.",
            "Cock",
            "Cock",
            "\\_💀\\_\r  \n/   \\_|\\_   \\\\\r  \n/  /  |   \\\\  \\\\\r  \n🧪 /    |    \\\\  🔪\r  \n🖍 \\_\\_|\\_\\_  ✏️\r  \n/          \\\\\r  \n/              \\\\\r  \n\\\\              / \r  \n\\_\\_\\\\           /\\_\\_",
            "Cock"
        ]
    },
    {
        "post_id": "jgp3q7",
        "author": "ArthurFan599",
        "title": "I beat a child.",
        "url": "https://www.reddit.com/r/copypasta/comments/jgp3q7/i_beat_a_child/",
        "score": 8068,
        "num_comments": 336,
        "created_utc": 1603466358.0,
        "selftext": "  I beat a child. He was just staring at me with his big, stupid face while I ate my delicious 8oz steak. His snot flapping in his nostrils and his eyes blinking out of sync infuriated me. The final straw was when he had the *audacity* to take a drink of his chocolate milk with his stupid idiot lips. I took my steak knife, which was stained with steak sauce and juices, and I stabbed him in the eyeball 98 times. I then proceeded to dumb an entire bottle of ketchup into his mouth as he screamed in pain. It gurgled with the force of a volcano. Finally, he stopped breathing altogether, and his mother called the police. When the police arrived, I used my half-eaten steak to beat them both to death, then I ran out, stripped off all my clothes, and ran naked through the local daycare, screaming “98 STAB WOUNDS” until I finally was apprehended by the authorities. I am facing 13 life sentences without parole.",
        "permalink": "/r/copypasta/comments/jgp3q7/i_beat_a_child/",
        "comments": [
            "They beat the boy While I was eating this delicious 8G steak, he looked at me with a smile. The nasopharynx is part of the nose and is balanced. It was the last weed he forced to drink chocolate milk * on the lips of a fool. I ate steaks and dishes in the kitchen and washed them 98 times. When I screamed in pain, I foolishly put a bottle of ketchup in my mouth. The power of the volcano is in me. His mother finally calmed down and called the police. When the police arrived, they beat him, ate ‘half the meal, then jumped out of the car, took my clothes, ran to the orphanage, and finally arrested him. Prison for life",
            "I 👁 beat 💓 a child 👶🧒👨. He 👨 was just staring 👀 at me with his 💦 big 🍆💁, stupid 💩 face 👧 while I 👁 ate 😋🐣 my delicious 😋🎤 8oz steak 🥩. His 💦 snot 💦 flapping 🍑🚫✋ in his 💦 nostrils 😂 and his 💦 eyes 👀 blinking 🔴 out of sync 4⃣ infuriated me. The final 👆 straw 🚬 was when ⏰ he 👨 had the *audacity 🤦‍♂️* to take 💅 a drink 🍹 of his 💦 chocolate 🍫🍪🍩 milk 🥛 with his 👋 stupid 💩 idiot 💢 lips 👄💋. I 👥 took 👫 my steak 🥩 knife 🔪, which was stained 😂 with steak ♨🔥 sauce 💦 and juices 🍹, and I 👁 stabbed 🔪 him 👴 in the eyeball 👁 98 🔥 times 🕐. I 👁 then proceeded 😂 to dumb 🤤 an entire 🎬 bottle 🍼 of ketchup 🍅👌😂 into his 💦 mouth 👄🤤 as he 🙋👥👧🏽 screamed 😱😨 in pain 😡. It gurgled with the force 🖐 of a volcano ☄. Finally 🙏, he 👨 stopped 🛑❌🚫 breathing 😤 altogether, and his 💦 mother 👵 called 📲 the police 👮. When 🍑 the police 👮‍♂️ arrived 🎅, I 👁 used 🎶 my half-eaten 🥄 steak 🥩 to beat 👊 them both to death 💀, then I 👥 ran 🏃 out, stripped 👎 off 📴 all 💯😫 my clothes 👙, and ran 🏃 naked 😏 through the local 📰 daycare 😯, screaming 😱 “98 STAB 🔪 WOUNDS” until I 👥 finally 🙏 was apprehended by the authorities 👮. I 👁 am facing 🛅😀💃🏽 13 💯 life 👤 sentences ✍ without 🚫 parole 😳💔.",
            "r/childfree be like",
            "  I beat a chiwd. He was just stawing at me with his big, stupid face whiwe I ate my dewicious 8oz steak. His snot fwapping in his nostwiws and his eyes bwinking out of sync infuwiated me. The finaw stwaw was when he had the *audacity* to take a dwink of his chocowate miwk with his stupid idiot wips. I took my steak knife, which was stained with steak sauce and juices, and I stabbed him in the eyebaww 98 times. I then pwoceeded to dumb an entiwe bottwe of ketchup into his mouth as he scweamed in pain. It guwgwed with the fowce of a vowcano. Finawwy, he stopped bweathing awtogethew, and his mothew cawwed the powice. When the powice awwived, I used my hawf-eaten steak to beat them both to death, then I wan out, stwipped off aww my cwothes, and wan naked thwough the wocaw daycawe, scweaming “98 STAB WOUNDS” untiw I finawwy was appwehended by the authowities. I am facing 13 wife sentences without pawowe.",
            "98 STAB WOUNDS! \n\nDidnt even want to give him a chance, huh.",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "Weed",
            "It  is  surprising  how  often  people  who  seek  analytic  treatment  for  hysteria  or an  obsessional  neurosis  confess  to  having  indulged  in  the  phantasy:  ‘A  child  is being  beaten.’  Very  probably  there  are  still  more  frequent  instances  of  it  among the  far  greater  number  of  people  who  have  not  been  obliged  to  come  to  analysis by  manifest  illness. The  phantasy  has  feelings  of  pleasure  attached  to  it,  and  on  their  account  the patient  has  reproduced  it  on  innumerable  occasions  in  the  past  or  may  even  still be  doing  so.  At  the  climax  of  the  imaginary  situation  there  is  almost  invariably  a masturbatory  satisfaction—carried  out,  that  is  to  say,  on  the  genitals.  At  first  this takes  place  voluntarily,  but  later  on  it  does  so  in  spite  of  the  patient's  efforts,  and with  the  characteristics  of  an  obsession. It  is  only  with  hesitation  that  this  phantasy  is  confessed  to.  Its  first  appearance is  recollected  with  uncertainty.  The  analytic  treatment  of  the  topic  is  met  by unmistakable  resistance.  Shame  and  a  sense  of  guilt  are  perhaps  more  strongly excited  in  this  connection  than  when  similar  accounts  are  given  of  memories  of the  beginning  of  sexual  life. Eventually  it  becomes  possible  to  establish  that  the  first  phantasies  of  the kind  were  entertained  very  early  in  life:  certainly  before  school  age,  and  not later  than  in  the  fifth  or  sixth  year.  When  the  child  was  at  school  and  saw  other children  being  beaten  by  the  teacher,  then,  if  the  phantasies  had  become  dormant, this  experience  called  them  up  again,  or,  if  they  were  still  present,  it  reinforced them and  noticeably  modified  their  content.  From that  time  forward  it  was  ‘an indefinite  number’  of  children  that  were  being  beaten.  The  influence  of  the school  was  so  clear  that  the  patients  concerned  were  at  first  tempted  to  trace back  their  beating-phantasies  exclusively  to  these  impressions  of  school  life, which  dated  from later  than  their sixth  year.  But  it  was  never  possible  for  them to  maintain  that  position;  the phantasies  had  already  been  in  existence  before. Though  in  the  higher  forms  at  school  the  children  were  no  longer  beaten,  the influence  of  such  occasions  was  replaced  and  more  than  replaced  by  the  effects of  reading,  of  which  the  importance  was  soon  to  be  felt.  In  my  patients'  milieu  it was  almost  always  the  same  books  whose  contents  gave  a  new  stimulus  to  the beating-phantasies:  those  accessible  to  young  people,  such  as  what  was  known as  the  ‘Bibliothèque  rose’ ,  Uncle  Tom's  Cabin,  etc.  The  child  began  to 1 compete  with  these  works  of  fiction  by  producing  his  own  phantasies  and  by constructing  a  wealth  of  situations  and  institutions,  in  which  children  were beaten,  or  were  punished  and  disciplined  in  some  other  way,  because  of  their naughtiness  and  bad  behaviour. This  phantasy—‘a  child  is  being  beaten’—was  invariably  cathected  with  a high  degree  of  pleasure  and  had  its  issue  in  an  act  of  pleasurable  auto-erotic satisfaction.  It  might  therefore  be  expected  that  the  sight  of  another  child  being beaten  at  school  would  also  be  a  source  of  similar  enjoyment.  But  as  a  matter  of fact  this  was  never  so.  The  experience  of  real  scenes  of  beating  at  school produced  in  the  child  who  witnessed  them a  peculiarly  excited  feeling  which was  probably  of  a  mixed  character  and  in  which  repugnance  had  a  large  share. In  a  few  cases  the  real  experience  of  the  scenes  of  beating  was  felt  to  be intolerable.  Moreover,  it  was  always  a  condition  of  the  more  sophisticated phantasies  of  later  years  that  the  punishment  should  do  the  children  no  serious injury. The  question  was  bound  to  arise  of  what  relation  there  might  be  between  the importance  of  the  beating-phantasies  and  the  part  that  real  corporal  punishment might  have  played  in  the  child's  bringing  up  at  home.  It  was  impossible,  on account  of  the  one-sidedness  of  the  material,  to  confirm  the  first  suspicion  that the  relation  was  an  inverse  one.  The  individuals  from whom the  data  for  these analyses  were  derived  were  very  seldom beaten  in  their  childhood,  or  were  at all  events  not  brought  up  by  the  help  of  the  rod.  Naturally,  however,  each  of these  children  was  bound  to  have  become  aware  at  one  time  or  another  of  the superior  physical  strength  of  its  parents  or  educators;  the  fact that  in  every  nursery  the  children  themselves  at  times  come  to  blows  requires  no special  emphasis. As  regards  the  early  and  simple  phantasies  which  could  not  be  obviously traced  to  the  influence  of  school  impressions  or  of  scenes  taken  from books, further  information  would  have  been  welcome.  Who  was  the  child  that  was being  beaten?  The  one  who  was  himself  producing  the  phantasy  or  another?  Was it  always  the  same  child  or  as  often  as  not  a  different  one?  Who  was  it  that  was beating  the  child?  A  grown-up  person?  And  if  so,  who?  Or  did  the  child  imagine that  he  himself  was  beating  another  one?  Nothing  could  be  ascertained  that  threw any  light  upon  all  these  questions—only  the  hesitant  reply:  ‘I  know  nothing  more about  it:  a  child  is  being  beaten.’ Enquiries  as  to  the  sex  of  the  child  that  was  being  beaten  met  with  more success,  but  none  the  less  brought  no  enlightenment.  Sometimes  the  answer  was: ‘Always  boys’,  or  ‘Only  girls’  more  often  it  was:  ‘I  don't  know’,  or  ‘It  doesn't matter  which’.  But  the  point  to  which  the  questions  were  directed,  the  discovery of  some  constant  relation  between  the  sex  of  the  child  producing  the  phantasy and  that  of  the  child  that  was  being  beaten,  was  never  established.  Now  and again  another  characteristic  detail  of  the  content  of  the  phantasy  came  to  light: ‘A  small  child  is  being  beaten  on  its  naked  bottom.’ In  these  circumstances  it  was  impossible  at  first  even  to  decide  whether  the pleasure  attaching  to  the  beating-phantasy  was  to  be  described  as  sadistic  or masochistic.",
            "NTA your child your rules",
            "  I beat a child. He was just staring at me with his big, stupid face while I ate my delicious 8oz steak. His snot flapping in his nostrils and his eyes blinking out of sync infuriated me. The final straw was when he had the *audacity* to take a drink of his chocolate milk with his stupid idiot lips. I took my steak knife, which was stained with steak sauce and juices, and I stabbed him in the eyeball 98 times. I then proceeded to dumb an entire bottle of ketchup into his mouth as he screamed in pain. It gurgled with the force of a volcano. Finally, he stopped breathing altogether, and his mother called the police. When the police arrived, I used my half-eaten steak to beat them both to death, then I ran out, stripped off all my clothes, and ran naked through the local daycare, screaming “98 STAB WOUNDS” until I finally was apprehended by the authorities. I am facing 13 life sentences without parole.",
            "bruh",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "I love this sub so much",
            "This is every post on r/unpopularopinion about how children are annoying.",
            "Weed",
            "I thought you meant the other type of \"beat\" ;)",
            "nta",
            "Average r/childfree user",
            "Weed",
            "Based",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "Weed",
            "what the. Fuc k",
            "We finally found Anakin's Diary I see.",
            "Okay but can you beat Goku tho?",
            "NTA",
            "NTA play stupid games win stupid prizes",
            "Only at Miller Grove 😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂😂",
            "Based",
            "Bad bot",
            "13 life sentences? This justice system is fucked, he had to coming to him. I hate children.",
            "I would've upvoted but I don't see anything about women getting beat. A message to the OP, u/ArthurFan599: please reconsider your actions.",
            "You deserve 98 stab wounds for having ketchup with your steak. Degenerates like you belong on a cross.",
            "Wholesome 100 🥰🥰😘😍😍☺️",
            "NTA play prizes win stupid games stupid",
            "what the truck",
            "what is this",
            "u/thesaurizethis",
            "You sus",
            "Weed",
            "stupid crotch goblin 😂😂😂😂",
            "TWENTY EIGHT STAB WOUNDS",
            "Typical AI dungeon story",
            "Based",
            "Based",
            "NTA",
            "NTA, your steak, your rules.",
            "Gun",
            "27 STAB WOUNDS",
            "r/youngpeopleyoutube in a nutshell",
            "NTA your steak your rules",
            "[deleted]",
            "The most disgusting part of this whole story is the implication of putting ketchup on your steak. What kind of fucking despicable piece of trash does that.",
            "You absolute monster.\n\nunless he liked fortnite, in which case that was wholesome 100 and you're breathtaking",
            "Aita?",
            "🚩",
            ">98 \n\nIs that a Love Live reference?",
            "NTA he deserved he it he as being a little cunt",
            "Based",
            "NTA, NTA.",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "I thought this was r/creepypasta and I was so confused.",
            "NTA.",
            "#9 8   S T A B   W O U N D S !",
            "Nice",
            "NTA",
            "Based",
            "Nice",
            "children.",
            "98 STAB WOUNDS!!! YOU DIDNT WANT TO GIVE HIM A CHANCE!!!  \n97% stress level",
            "u/EmojifierBot"
        ]
    },
    {
        "post_id": "kgb843",
        "author": "None",
        "title": "OURcraft?!?!?🥴🤣😂😎",
        "url": "https://www.reddit.com/r/copypasta/comments/kgb843/ourcraft/",
        "score": 8060,
        "num_comments": 155,
        "created_utc": 1608396526.0,
        "selftext": "Youtube? More like OURtube, am I right?😂😂 I'll put a picture of Staling next to this, so the meme will be super-duper funny!! Get it? Get it? Cause communism, you know, its about making everything shared, right? So you see, this joke is so clever because instead of saying \"you\", I say OURS! 🤣🤣😂🤢😂😢😜 Get it? Get it? Cuz ours is like its SHARED XD. Man, i'm soooo clever. You know what, it seems to me like I'm really good at these camunism jokes, so I'll try making more!! How about instead of minecraft we say OURcraft? 😁🤣😂😆🤮🤣🤣😂 Get it? Cause commanism!!! Oh, how about, whenever I see something that breaks or falls apart, I'll ask in a very clever and humorous way: \"What is this, the USSR?\" Get it? Its cause the USSSSSSR also fell apart!! 😁😁😁😁😁 Or maybe I'll call anything that has the colour red in it COMMUNIST!! 🤣🤣🤗😅😆😂🤢😁😄😫🤯😅🤣🤣🤣 Cuz you know, the USssSSSSR's flag is ALSO RED!!!!",
        "permalink": "/r/copypasta/comments/kgb843/ourcraft/",
        "comments": [
            "My 13th reason why",
            "Youtube 👨🏿🤳🏼📹? More like 😄🎗 OURtube, am I 👁 right?😂😂 I'll 🤫 put 😏 a picture 🖼 of Staling next ➡👶 to this, so the meme 🐸 will be super-duper funny 😃😆!! Get 🉐 it? Get 🉐 it? Cause 🎗 communism 🇨🇳, you 👈 know 🤔👀, its about 💦 making 🖕 everything 💯 shared 👬, right ✔? So you 👈 see 👀, this joke 😂🤣😍 is so clever 📃 because instead 🚔 of saying 🗣 \"you 👈🏼\", I 👁 say 💬 OURS! 🤣🤣😂🤢😂😢😜 Get 🉐 it? Get 🉐 it? Cuz ✨ ours is like 💖 its SHARED 👬 XD 😂. Man 👨🏻, i'm 💘 soooo 😄 clever 📃. You 👈 know 🤔 what, it seems 🤔 to me like 💖 I'm 💘 really 💯 good 👍 at these camunism jokes 😂😃😳, so I'll 📝 try 😐 making 🖕 more!! How about 💦 instead 🚔 of minecraft 🔲 we say 🗣 OURcraft? 😁🤣😂😆🤮🤣🤣😂 Get 🉐📦 it? Cause 🎗 commanism!!! Oh 🙀, how about 💦, whenever 🏪 I 👁 see 👀 something 😅 that breaks 💔 or falls 🍁 apart 😂, I'll 📝 ask 🙏 in a very 👌 clever 📃 and humorous 🤣😂👍 way ↕: \"What is this, the USSR 🇷🇺?\" Get 🔟 it? Its cause 💋 the USSSSSSR also 👨 fell 🍂🍃🍁 apart 💖💕💓!! 😁😁😁😁😁 Or maybe 🤷‍♀️ I'll 📝 call 📞 anything 💰🤤 that has the colour 🌈 red 📛 in it COMMUNIST 👻!! 🤣🤣🤗😅😆😂🤢😁😄😫🤯😅🤣🤣🤣 Cuz ✨ you 👈 know 💭, the USssSSSSR's flag 🇺🇸 is ALSO 👨🅱 RED 🔴!!!!",
            "I have something even funnier, let’s blast the Russian national anthem earrape at the back of the bus! It’ll be totally funny and epic",
            "cum",
            "Youtube? Mowe wike OUWtube, am I wight?😂😂 I'ww put a pictuwe of Stawing next to this, so the meme wiww be supew-dupew funny!! Get it? Get it? Cause communism, you know, its about making evewything shawed, wight? So you see, this joke is so cwevew because instead of saying \"you\", I say OUWS! 🤣🤣😂🤢😂😢😜 Get it? Get it? Cuz ouws is wike its SHAWED XD. Man, i'm soooo cwevew. You know what, it seems to me wike I'm weawwy good at these camunism jokes, so I'ww twy making mowe!! How about instead of minecwaft we say OUWcwaft? 😁🤣😂😆🤮🤣🤣😂 Get it? Cause commanism!!! Oh, how about, whenevew I see something that bweaks ow fawws apawt, I'ww ask in a vewy cwevew and humowous way: \"What is this, the USSW?\" Get it? Its cause the USSSSSSW awso feww apawt!! 😁😁😁😁😁 Ow maybe I'ww caww anything that has the cowouw wed in it COMMUNIST!! 🤣🤣🤗😅😆😂🤢😁😄😫🤯😅🤣🤣🤣 Cuz you know, the USssSSSSW's fwag is AWSO WED!!!!",
            "cum",
            "Youtube? More like OURtube, am I right?😂😂 I'll put a picture of Staling next to this, so the meme will be super-duper funny!! Get it? Get it? Cause communism, you know, its about making everything shared, right? So you see, this joke is so clever because instead of saying \"you\", I say OURS! 🤣🤣😂🤢😂😢😜 Get it? Get it? Cuz ours is like its SHARED XD. Man, i'm soooo clever. You know what, it seems to me like I'm really good at these camunism jokes, so I'll try making more!! How about instead of minecraft we say OURcraft? 😁🤣😂😆🤮🤣🤣😂 Get it? Cause commanism!!! Oh, how about, whenever I see something that breaks or falls apart, I'll ask in a very clever and humorous way: \"What is this, the USSR?\" Get it? Its cause the USSSSSSR also fell apart!! 😁😁😁😁😁 Or maybe I'll call anything that has the colour red in it COMMUNIST!! 🤣🤣🤗😅😆😂🤢😁😄😫🤯😅🤣🤣🤣 Cuz you know, the USssSSSSR's flag is ALSO RED!!!!",
            "cum",
            "cum",
            "I thought this was r/okbuddyretard for a second.",
            "cum",
            "We/our/us = communismm!1!!1!1!!11 lololol 😂👌\n\nr/unexpectedcommunism r/communism r/stalin r/lenin r/communist r/slav r/russia r/ussr r/sounding my fellow le epic slav comrade russia moment *le epically slav squats* *dabs* *does nazi salute* *ussr anthem (le funny meme song) intensifies*",
            "cum",
            "cum",
            "cum",
            "cum",
            "cum",
            "cum",
            "cum",
            "Band kid humor",
            "cum",
            "cum",
            "Our aids 🇷🇺",
            "Cock and ball futanari Samus vore tentacle alien",
            "Copypasta are essentially just communism if you think about it",
            "Based",
            "r/unexpectedcommunism 😂😂😂\n\n/s for balance😂😂😂",
            "are the bots down or something?",
            "cum",
            "cum",
            "cum",
            "cummunism",
            "Cum",
            "Socialism is when the government does stuff",
            "Here’s how Bernie can still win",
            "99% of people who do this doesn't even know what's really communism",
            "People like this piss me off so much",
            "gum",
            "Reddit",
            "communism is when you share your toothbrush the more you share toothbrush the more communist it is",
            "jreg fans be like",
            "Cum",
            "Did you just stole my copypasta?",
            "Oh, how about, whenever I see something that breaks or falls apart, I’ll ask in a very clever and humorous way: “what is this, the Roman Empire?” \n\nThat is also a common one",
            "[deleted]",
            "Over a million communists in Indonesia died at the hands of a tyrannical government backed by the CIA for this.",
            "copypasta is the peak of communism",
            "Haha yes Reddit let's go romanticise communism wholesome 100 lol",
            "This feels like it was written by a fed up tankie.",
            "r/unexpectedcommunist",
            "7th Grade trumpet players when they can finally play up to an F",
            " Youtube? More like OURtube, am I right?😂😂 I'll put a picture of Staling next to this, so the meme will be super-duper funny!! Get it? Get it? Cause communism, you know, its about making everything shared, right? So you see, this joke is so clever because instead of saying \"you\", I say OURS! 🤣🤣😂🤢😂😢😜 Get it? Get it? Cuz ours is like its SHARED XD. Man, i'm soooo clever. You know what, it seems to me like I'm really good at these camunism jokes, so I'll try making more!! How about instead of minecraft we say OURcraft? 😁🤣😂😆🤮🤣🤣😂 Get it? Cause commanism!!! Oh, how about, whenever I see something that breaks or falls apart, I'll ask in a very clever and humorous way: \"What is this, the USSR?\" Get it? Its cause the USSSSSSR also fell apart!! 😁😁😁😁😁 Or maybe I'll call anything that has the colour red in it COMMUNIST!! 🤣🤣🤗😅😆😂🤢😁😄😫🤯😅🤣🤣🤣 Cuz you know, the USssSSSSR's flag is ALSO RED!!!!",
            "toycat video",
            "Hey I used this yesterday! Am I famous now?",
            "At last, the bugs bunny meme is finally considered cringe. pog",
            "Written by republitards.",
            "Cummunism",
            "cum",
            " \n\n# 🥴",
            " Youtube? More like OURtube, am I right?😂😂 I'll put a picture of  Staling next to this, so the meme will be super-duper funny!! Get it?  Get it? Cause communism, you know, its about making everything shared,  right? So you see, this joke is so clever because instead of saying  \"you\", I say OURS! 🤣🤣😂🤢😂😢😜 Get it? Get it? Cuz ours is like its  SHARED XD. Man, i'm soooo clever. You know what, it seems to me like I'm  really good at these camunism jokes, so I'll try making more!! How  about instead of minecraft we say OURcraft? 😁🤣😂😆🤮🤣🤣😂 Get it?  Cause commanism!!! Oh, how about, whenever I see something that breaks  or falls apart, I'll ask in a very clever and humorous way: \"What is  this, the USSR?\" Get it? Its cause the USSSSSSR also fell apart!!  😁😁😁😁😁 Or maybe I'll call anything that has the colour red in it  COMMUNIST!! 🤣🤣🤗😅😆😂🤢😁😄😫🤯😅🤣🤣🤣 Cuz you know, the USssSSSSR's  flag is ALSO RED!!!!"
        ]
    },
    {
        "post_id": "fwkfyq",
        "author": "IndulgentOne",
        "title": "FAQ: I just shit and cum at your comment",
        "url": "https://www.reddit.com/r/copypasta/comments/fwkfyq/faq_i_just_shit_and_cum_at_your_comment/",
        "score": 8056,
        "num_comments": 128,
        "created_utc": 1586265852.0,
        "selftext": "# FAQ\n\n# What does this mean?\n\nThe amount of shit (and cum) on my computer and floor has increased by one.\n\n# Why did you do this?\n\nThere are several reasons I may deem a comment to be worthy of feces or ejaculation. These include, but are not limited to:\n\n* Being gay\n* Dank copypasta bro, where'd you find it\n* walter\n\n# Am I going to shit and cum too?\n\nNo - not yet. But you should refrain from shitposting and cumposting like this in the future. Otherwise I will be forced to shit and cum again, which may put your shitting and cumming privileges in jeopardy.\n\n# I don't believe my comment deserved being shit and cum at. Can you un-cum it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I put shit back into my butt. If you would like to issue an appeal, shoot me a hot load explaining what I got wrong. I tend to respond to retaliatory ejaculation within several minutes. Do note, however, that over 99.9% of semen dies before it can fertilize the egg, and yours is likely no exception.\n\n# How can I prevent this from happening in the future?\n\nAccept the goopy brown and white substance and move on. But learn from this mistake: your behavior will not be tolerated in my mom's basement. I will continue to shit and cum until you improve your conduct. Remember: ejaculation is privilege, not a right.",
        "permalink": "/r/copypasta/comments/fwkfyq/faq_i_just_shit_and_cum_at_your_comment/",
        "comments": [
            "What's the contact info for the Shit and Cum Customer Support? My cum came out red and I was wondering if I should be concerned",
            "NTA. Your basement, your rules.",
            "# FAQ\n\n# What does this mean?\n\nThe amount of shit (and cum) on my computer and floor has increased by one.\n\n# Why did you do this?\n\nThere are several reasons I may deem a comment to be worthy of feces or ejaculation. These include, but are not limited to:\n\n* Being gay\n* Dank copypasta bro, where'd you find it\n* walter\n\n# Am I going to shit and cum too?\n\nNo - not yet. But you should refrain from shitposting and cumposting like this in the future. Otherwise I will be forced to shit and cum again, which may put your shitting and cumming privileges in jeopardy.\n\n# I don't believe my comment deserved being shit and cum at. Can you un-cum it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I put shit back into my butt. If you would like to issue an appeal, shoot me a hot load explaining what I got wrong. I tend to respond to retaliatory ejaculation within several minutes. Do note, however, that over 99.9% of semen dies before it can fertilize the egg, and yours is likely no exception.\n\n# How can I prevent this from happening in the future?\n\nAccept the goopy brown and white substance and move on. But learn from this mistake: your behavior will not be tolerated in my mom's basement. I will continue to shit and cum until you improve your conduct. Remember: ejaculation is privilege, not a right.",
            "This is why we desperately need a Tulsi Gabbard presidency.",
            "Shit+cum=shum",
            "Im taking a shit rn and I open reddit and this is the first post",
            "# FAQ\n\n# What does this mean?\n\nThe amount of shit (and cum) on my computew and fwoow has incweased by one.\n\n# Why did you do this?\n\nThewe awe sevewaw weasons I may deem a comment to be wowthy of feces ow ejacuwation. These incwude, but awe not wimited to:\n\n* Being gay\n* Dank copypasta bwo, whewe'd you find it\n* wawtew\n\n# Am I going to shit and cum too?\n\nNo - not yet. But you shouwd wefwain fwom shitposting and cumposting wike this in the futuwe. Othewwise I wiww be fowced to shit and cum again, which may put youw shitting and cumming pwiviweges in jeopawdy.\n\n# I don't bewieve my comment desewved being shit and cum at. Can you un-cum it?\n\nSuwe, mistakes happen. But onwy in exceedingwy wawe ciwcumstances wiww I put shit back into my butt. If you wouwd wike to issue an appeaw, shoot me a hot woad expwaining what I got wwong. I tend to wespond to wetawiatowy ejacuwation within sevewaw minutes. Do note, howevew, that ovew 99.9% of semen dies befowe it can fewtiwize the egg, and youws is wikewy no exception.\n\n# How can I pwevent this fwom happening in the futuwe?\n\nAccept the goopy bwown and white substance and move on. But weawn fwom this mistake: youw behaviow wiww not be towewated in my mom's basement. I wiww continue to shit and cum untiw you impwove youw conduct. Wemembew: ejacuwation is pwiviwege, not a wight.",
            "**L:** for any sexual tendencies committed though a laptop.\n\n**W:** for use of a cellular device as it’s compact and has a necessary 180 degree view for deeper reconnaissance.",
            "[Shot opens on ringing alarm bell; sirens and klaxons play in the background] The Administrator: \"Intruder Alert! A RED Spy is in the base!\" [Signs illuminate on a large security panel: \"Intruder Alert', 'RED Spy' and 'In Base'; pull out to reveal the BLU Soldier watching the board] Soldier: \"A RED Spy is in the base!?\" [Intruder Alert begins to play. The Soldier reaches from off-screen and pulls a Shotgun off a rack of weapons. Cut to the Soldier dashing down the stairs and through the 2Fort sublevel while saying \"Hut, Hut, Hut!\" with every step he takes] The Administrator: \"Protect the briefcase!\" Soldier: \"We need to protect the briefcase!\" [Camera pans to reveal the BLU Scout trying to open the code-locked 'Briefcase Room' door] Scout: \"Yo, a lil' help here!?\" [The Soldier pushes the Scout aside and begins to 'decode' the combination] Soldier: \"All right, all right, I got it. Stand back son. 1, 1, 1, umm... 1!\" Scout: \"Let's go, let's go-\" [BLU Heavy comes around the corner, Sasha in hand, charging towards the Scout and Soldier] Heavy: \"INCOMING!\" [Heavy shoulder-barges the door, destroying it. The three of them are sent tumbling and screaming into the Intelligence Room] Heavy: \"AAAAAAAAAAAAAAA- [screaming]\" [The Scout reaches the desk to discover the briefcase is perfectly safe] Scout: [while screaming, he notices the briefcase] \"AAAAAHHHH- Hey, it's still here!\" Heavy: \"-AAAAalright then.\" Spy: \"Ahem.\" [Camera zooms in to reveal the BLU Spy, with the BLU Sniper's corpse over one shoulder] Spy: \"Gentlemen.\" [Meet the Spy' Title Card] [Cut back to the Spy, carrying the dead Sniper towards the desk] Spy: \"I see the briefcase is safe.\" Soldier: \"Safe and sound, mm-hmm.\" Scout: \"Yeah, it is!\" Spy: \"Tell me... did anyone happen to kill a RED Spy on the way here?\" [The other three BLUs shake their heads and shrug] Spy: No? Then we still have a problem. [He deposits the Sniper's body on the desk, revealing a bloody Knife in his back] Soldier: \"...and a knife.\" [The Scout approaches and removes the knife] Scout: \"Oooh, big problem. I've killed plenty of Spies; they're dime-a-dozen back-stabbing scumbags - like you!\" [The Scout attempts to manipulate the knife like the Spy, only to cut himself with the blunt end on the finger and drop it] Scout: \"Ow! No offense.\" Spy: \"If you managed to kill them, I assure you, they were not like me.\" [The Spy deftly retrieves the knife and flicks it shut, handing it back to the Scout] \"And nothing... nothing like the man loose inside this building.\" Scout: \"What're you? President of his fan club?\" [The Soldier and Heavy chuckle while the Spy turns to face the Scout] Spy: \"No... that would be your mother!\" [The Spy reveals a folder and slaps it down on the table, revealing several compromising photographs of the RED Spy and the Scout's mother while Right Behind You plays] Scout: \"What the?\" [stammers out of shock and disbelief] Spy: Indeed, and now he's here to f**k us! So listen up boy, or pornography starring your mother will be the second worst thing that happens to you today.\" [The Soldier and Heavy examine the photographs. The Heavy leans over and shows the Soldier one photo in particular] Soldier: Oh! [The Scout frantically retrieves the photos as the Spy lights and smokes a cigarillo in the foreground] Scout: \"Gimme that!\" Spy: \"This Spy has already breached our defenses...\" [Fade to the RED Spy, creeping through the Hydro tunnels. He pauses at a corner, as the camera pulls back to reveal a BLU Level 3 Sentry Gun with its Engineer. He slides a Sapper across the floor, disarming and destroying the Sentry Gun immediately] Engineer: \"Sentry Down!\" [The BLU Engineer throws his Wrench down and frantically reaches for his Pistol, only to have the Spy shoot him in the head with the Revolver. The dead Engineer crashes through a door and the Spy steps over him and fires at a target off-screen] [Cut back to the BLU Intelligence Room. The BLU Spy leans over the dead Sniper, gesturing frantically.] Spy: \"You've seen what he's done to our colleagues!\" [Fade to the BLU Sniper, still alive and sniping from a dusty attic. The RED Spy creeps up on him and steps on a creaking floorboard, alerting the Sniper, who engages the Spy with the Kukri. A struggle ensues. Spy deftly dodges and parries Sniper’s flailing attacks and counters with fatal strikes; the Sniper is cut across his left cheek (1:55), gutted under the right rib cage (1:57), cut across the back of his skull (1:58), and is ultimately backstabbed (1:59).] [Cut back to BLU Intelligence Room] Spy: \"And worst of all, he could be any one of us...\" [Fade to the RED Spy fighting a BLU Medic, armed with a Bonesaw] Medic: \"Raus, raus!\" [The Spy breaks the Medic's arm, disarming him. Close-up on the Spy's face as he disguises as the Medic, sans spectacles] Medic: [gasps] \"Nein...\" [The Spy kills the Medic with a well-placed chop to the throat, knocking off his spectacles, which he catches and wears, completing his disguise] [Cut back to BLU Intel Room. The BLU Spy looks frantic] Spy: \"He could be in this very room! He could be you! He could be me! He could even be-\" [The Spy is cut off as his head explodes violently. The camera switches to the Soldier, Shotgun in hand, with a confused Heavy and a panicked Scout] Scout: \"Whoa, whoa, whoa!\" Heavy: \"Oh!\" Soldier: \"What? It was obvious!\" [The Soldier pumps his Shotgun, discarding the spent shell.] \"He's the RED Spy! Watch, he'll turn red any second now...\" [The Soldier and Heavy approach the dead Spy, with The Soldier prodding the Spy's foot with his Shotgun] Soldier: \"Any second now... See? Red! Oh, wait... that's blood.\" Heavy: \"So, we still got problem...\" Soldier: \"Big problem...\" [The Scout lingers behind, his expression sinister. He approaches the Soldier and Heavy, retrieving the knife he pocketed earlier, and flicking it open easily] Soldier: All right, who's ready to go find this Spy?\" [As the Scout approaches, he flickers and melts, revealing himself to be the RED Spy] Spy: \"Right behind you.\" [Team Fortress 2 ending flourish music plays, with the stabbing of the Soldier and Heavy punctuating the beat of the tune.] [Petite Chou-Fleur plays] [Fade to the scattered photos of the Scout's mother. The RED Spy retrieves one of them and smiles wistfully] Spy: \"Ahh... ma petit chou-fleur.\" [The RED Spy walks off with the BLU team's intel in tow. Fade to black.]",
            "⚠ WARNING ⚠ GAY LEVELS 👬 INCREASING!!!\n\n⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛\n\n🟥⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛\n\n🟥🟥🟥🟥⬛⬛⬛⬛⬛⬛⬛\n\n🟥🟥🟥🟥🟥🟥🟥⬛⬛⬛⬛\n\n🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛\n\n🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥\n\n☣☣☣ CRITICAL GAY LEVELS REACHED ☣☣☣\n\n☢☢☢ COCKSUCKING MELTDOWN INITIATED ☢☢☢\n\n😨EVACUATE 🏃‍♂️ THE FACILITY 🏙 IMMEDIATELY ‼\n\n😱Oh no! 😱It looks 🔎👀 like my levels of 🏳️‍🌈 homosexuality 🏳️‍🌈 have reached 🙌 the point of no return ⛔🚫Just like my cock 🍆when it touches 👇another cock 🐔and my ejaculation 💦explodes 💥💥💥like a ☢nuclear reactor ☢ If you're reading this 📚👁👁👓 it's probably already too late 😰🕗 My ⚠volatile ⚠ GAY PARTICLES 🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈 have contaminated 😷the surrounding area 🏞 and you too might be affected! 🤒Make sure to quarantine 🔐yourself immediately 🚪to avoid passing on ➡ the gay 🏳️‍🌈 to others 🤼and call for medical 🏥 help 🚑 at once 👨‍⚕️",
            "Sex🥵penis🍆",
            "W A L T E R",
            "[:(](https://www.reddit.com/r/copypasta/comments/dqmvex/i_just_shit_and_cum/?utm_medium=android_app&utm_source=share)",
            "Repost you cummyhead",
            "Going to cry? Shit and cum maybe? Maybe piss your pants?",
            "\n\nI just downvoted your comment.\n\n#FAQ\n\n#What does this mean?\n\nThe amount of karma (points) on your comment and Reddit account has decreased by one.\n\n#Why did you do this?\n\nThere are several reasons I may deem a comment to be unworthy of positive or neutral karma. These include, but are not limited to:\n\n•\t⁠Rudeness towards other Redditors,\n•\t⁠Spreading incorrect information,\n•\t⁠Sarcasm not correctly flagged with a /s.\n\n#Am I banned from the Reddit?\n\nNo - not yet. But you should refrain from making comments like this in the future. Otherwise I will be forced to issue an additional downvote, which may put your commenting and posting privileges in jeopardy.\n\n#I don't believe my comment deserved a downvote. Can you un-downvote it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I undo a downvote. If you would like to issue an appeal, shoot me a private message explaining what I got wrong. I tend to respond to Reddit PMs within several minutes. Do note, however, that over 99.9% of downvote appeals are rejected, and yours is likely no exception.\n\n#How can I prevent this from happening in the future?\n\nAccept the downvote and move on. But learn from this mistake: your behavior will not be tolerated on Reddit.com. I will continue to issue downvotes until you improve your conduct. Remember: Reddit is privilege, not a right.",
            "I once thought a specific comment was cum worthy but they edited in thanks for the gold so I had to suck the coom back up my penis. Long story short, my sack is pregnant and my baby is twice as inbred due to the complete lack of genetic diversity.\n\n1 enjoy = 1 pray",
            "General reposti",
            "This shit and cum again. Did you at least change it a bit?",
            "I read this in dunkeys voice and I cant explain why",
            "Walter",
            "COCKCOCKCOCKCOCKCOCK COCKCOCKCOCKCOCKCOCK COCKCOCKCOCKCOCKCOCK COCKCOCKCOCKCOCKCOCK COCKCOCKCOCKCOCKCOCK COCKCOCKCOCKCOCKCOCK",
            "This has made *me* shit and cum",
            "I just shit and cum at your comment\n\n#FAQ\n\n#What does this mean?\n\nThe amount of shit (and cum) on my computer and floor has increased by one.\n\n#Why did you do this?\n\nThere are several reasons I may deem a comment to be worthy of feces or ejaculation. These include, but are not limited to:\n\n* Being gay\n* Dank copypasta bro, where'd you find it\n* walter\n\n# Am I going to shit and cum too?\n\nNo - not yet. But you should refrain from shitposting and cumposting like this in the future. Otherwise I will be forced to shit and cum again, which may put your shitting and cumming privileges in jeopardy.\n\n#I don't believe my comment deserved being shit and cum at. Can you un-cum it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I put shit back into my butt. If you would like to issue an appeal, shoot me a hot load explaining what I got wrong. I tend to respond to retaliatory ejaculation within several minutes. Do note, however, that over 99.9% of semen dies before it can fertilize the egg, and yours is likely no exception.\n\n#How can I prevent this from happening in the future?\n\nAccept the goopy brown and white substance and move on. But learn from this mistake: your behavior will not be tolerated in my mom's basement. I will continue to shit and cum until you improve your conduct. Remember: ejaculation is privilege, not a right.",
            "loI",
            "⚠ WARNING ⚠ GAY LEVELS 👬 INCREASING!!!\n\n⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛\n\n🟥⬛⬛⬛⬛⬛⬛⬛⬛⬛⬛\n\n🟥🟥🟥🟥⬛⬛⬛⬛⬛⬛⬛\n\n🟥🟥🟥🟥🟥🟥🟥⬛⬛⬛⬛\n\n🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥⬛\n\n🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥🟥\n\n***☣☣☣ CRITICAL GAY LEVELS REACHED ☣☣☣***\n\n***☢☢☢ COCKSUCKING MELTDOWN INITIATED ☢☢☢***\n\n😨EVACUATE 🏃‍♂️ THE FACILITY 🏙 IMMEDIATELY ‼\n\n&#x200B;\n\n😱Oh no! 😱It looks 🔎👀 like my levels of  🏳️‍🌈 homosexuality  🏳️‍🌈 have reached 🙌 the point of no return ⛔🚫Just like my cock 🍆when it touches 👇another cock 🐔and my ejaculation 💦explodes 💥💥💥like a ☢nuclear reactor ☢ If you're reading this 📚👁👁👓 it's probably already too late 😰🕗 My ⚠volatile ⚠ GAY PARTICLES 🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈🏳️‍🌈 have contaminated 😷the surrounding area 🏞 and you too might be affected! 🤒Make sure to quarantine 🔐yourself immediately 🚪to avoid passing on ➡ the gay 🏳️‍🌈 to others 🤼and call for medical 🏥 help 🚑 at once 👨‍⚕️",
            "Why are we still here? Just to suffer? Every night, I can feel my leg… and my arm… even my fingers. The body I’ve lost… the comrades I’ve lost… won’t stop hurting… It’s like they’re all still there. You feel it, too, don’t you?",
            "Walter",
            "Walterette.",
            "Who wants to do yummy cummies in me. Cummy cummy yummy yummy in my bummy 🤪🤪🤪",
            "Does anyone have the original?",
            "This is a repost btw",
            "Walter",
            "Heeey, that's a [repost](https://www.reddit.com/r/copypasta/comments/e3144a/i_shit_and_cum/?utm_medium=android_app&utm_source=share)",
            "FAQ: I just shit and cum at your comment\n\n# FAQ\n\n# What does this mean?\n\nThe amount of shit (and cum) on my computer and floor has increased by one.\n\n# Why did you do this?\n\nThere are several reasons I may deem a comment to be worthy of feces or ejaculation. These include, but are not limited to:\n\n* Being gay\n* Dank copypasta bro, where'd you find it\n* walter\n\n# Am I going to shit and cum too?\n\nNo - not yet. But you should refrain from shitposting and cumposting like this in the future. Otherwise I will be forced to shit and cum again, which may put your shitting and cumming privileges in jeopardy.\n\n# I don't believe my comment deserved being shit and cum at. Can you un-cum it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I put shit back into my butt. If you would like to issue an appeal, shoot me a hot load explaining what I got wrong. I tend to respond to retaliatory ejaculation within several minutes. Do note, however, that over 99.9% of semen dies before it can fertilize the egg, and yours is likely no exception.\n\n# How can I prevent this from happening in the future?\n\nAccept the goopy brown and white substance and move on. But learn from this mistake: your behavior will not be tolerated in my mom's basement. I will continue to shit and cum until you improve your conduct. Remember: ejaculation is privilege, not a right.",
            "I always read FAQ as Facts and Queries.",
            "I don't know why but I can't breath I found this genuinely the funniest shit at 2am. Yes even funnier than a scientist Turing himself into a pickle. I mean I literally LOLed. Not even just a nose exhale, a full I can't inhale do I have covid",
            "Fucking art",
            "if ejaculation is a privilege we should all edge so we don’t cum",
            "thanks for this walterpost",
            "What the FAQ did i just read",
            "This is some hot scat action",
            "Bruh"
        ]
    },
    {
        "post_id": "dpm724",
        "author": "dontmindthechips",
        "title": "POV: You're Ben Shapiro's little naughty girl",
        "url": "https://www.reddit.com/r/copypasta/comments/dpm724/pov_youre_ben_shapiros_little_naughty_girl/",
        "score": 8062,
        "num_comments": 174,
        "created_utc": 1572521489.0,
        "selftext": "Let's say you've been a bad girl. Let's say, hypothetically, you've been a naughty girl even. Ok, and if you were a naughty girl, you would be my dirty little slut right? Then hypothetically speaking, you would be my little cumslut. Now, let's say you're also daddy's girl.\n\nNow that we have established that you are both a bad girl and daddy's girl, I believe you'd agree with me when I say that you deserve a spanking. Am I not correct? A bad girl deserves a spanking, and as I am daddy, you are my girl, so I am the one who must provide punishment.",
        "permalink": "/r/copypasta/comments/dpm724/pov_youre_ben_shapiros_little_naughty_girl/",
        "comments": [
            "God I wanna run a train on Ben Shapiro's sister. Everytime I see those two Republican titties swaying in the god damn breeze all I can think about is the entire state of Israel getting fucked as I hear her moans. All I can think about is debating Ben and getting absolutely demolished and called a #libtard by his fan base. His sister walks in and start sucking on my cock out of sorrow. I quickly have to pull out to avoid busting the largest nut ever recorded on her pretty conservative face",
            "Let's say you've been a bad girl. Let's say, hypothetically, you've been a naughty girl even. Ok, and if you were a naughty girl, you would be my dirty little slut right? Then hypothetically speaking, you would be my little cumslut. Now, let's say you're also daddy's girl.\n\nNow that we have established that you are both a bad girl and daddy's girl, I believe you'd agree with me when I say that you deserve a spanking. Am I not correct? A bad girl deserves a spanking, and as I am daddy, you are my girl, so I am the one who must provide punishment.",
            "[Copypasta with audio](https://youtu.be/PnoqC1PdGXE)",
            "Oh god I love this",
            "You are a bad girl who happens to be a doctor",
            "[deleted]",
            "Wet's say you've been a bad giww. Wet's say, hypotheticawwy, you've been a naughty giww even. Ok, and if you wewe a naughty giww, you wouwd be my diwty wittwe swut wight? Then hypotheticawwy speaking, you wouwd be my wittwe cumswut. Now, wet's say you'we awso daddy's giww.\n\nNow that we have estabwished that you awe both a bad giww and daddy's giww, I bewieve you'd agwee with me when I say that you desewve a spanking. Am I not cowwect? A bad giww desewves a spanking, and as I am daddy, you awe my giww, so I am the one who must pwovide punishment.",
            "Thanks, this is second worst fanfiction I've read in the last 24 hours \nEdit: Since is everyone is asking here it is https://www.wattpad.com/698413852-ocean-blue-chapter-1 there’s 10 chapters and every one is horrible",
            "What the fuck? I did not need this today but thank you",
            "Meow",
            "I'm ashamed to have even created this...but [here you go](https://soundcloud.com/user-796847132/ben-shapiro)",
            "Go ahead...Shit your pants\nSince you wanna be a bad girl 😈",
            "[it's even better when you hear it.](https://youtu.be/EjPzvvLT04U)",
            "hey, this is my post >:( oh well, enjoy the karma ;)",
            "wtf",
            "This is a repost",
            "Meow",
            "This makes me all happy inside",
            "I posted this :(",
            "Dirty little slut destroyed with facts and logic",
            "I can hear him say this in my head",
            "Oh God I wanna be Ben Shapiros little cum kitten",
            " I want to be Ben Shapiro's sexy little cum kitten. I want daddy Ben to boss me around and slap me for being a naughty little sissy boy, and then pin me to a cold wall and chastise me with FACTS and LOGIC to OWN me as I moan and scream at the sheer force of his flesh inside my tight little asshole",
            "Repost",
            "[deleted]",
            "It's logically sound",
            "Okay now this is epic",
            "I pictured him reading this to AOC's feet",
            "This mimics Ben's talking style perfectly. Props to the chef",
            "This video is on my music playlist",
            "Fuck you this was my post",
            "Who ever game this post silver and cummy gold made a fucking power play",
            "God damn it I love freedom",
            "tfw posted this like a month ago and no upvotes feelsbadman\n\nedit: a month not a week",
            "cummy bots gonna have a good time with this",
            "Why is this popular now it was posted like 3 months ago and got like 100 upvotes",
            "I’ve needed this for so long to put in my Minecraft book.",
            "There's a video of a very similar voice saying it. Can give a link if anyone wants",
            "naughty girl",
            "r/InstinctiveDownvotes",
            "😳",
            "Well no nut November put me in trial early, does it?",
            "AOC?",
            "What the fuck, you guys are fucking psychos",
            "why did I unironically get an erection",
            "https://youtu.be/Q1xDtSaVUOo\n\n\nIm sorry",
            "My Reddit account was a mistake",
            "u/the-onion-bro",
            "Are we sure Shapiro doesn't want to marry you first and do missionary for the rest of your life?",
            "Meow",
            "i never knew where it comes from but i hate it so much",
            "K i n k y",
            "Hey I've seen this one!",
            "I’m the one doing the spanking",
            "[deleted]",
            "Meow",
            "#CRINGE COMMENT DETECTED\n\nInitiating VIBECHECK.EXE\n\nProcessing...\n\nProcessing complete\n\nYou have scored: 0/69\n\nScore required to pass: 69/69\n\n*This bot detected a pretty cringe comment. A human being will arrive shortly to determine your punishment.*\n\n...\n\n...\n\n...\n\nHello! I am the creator of the Cringe detecting BoT (CBT). It looks like our bot detected a cringe comment. Please give us a moment to review your comment and determine the cringe level in case this was an error.\n\n...\n\nYep! Sorry bro, but that’s a real cringe comment! Fortunately, we’ve got a strict punishment system to put cringe normies like you in their place! Here’s what’s gonna happen!\n\n#STAGE ONE\n\nYour comment will be downvoted. Remember: Posting cringe could cause you to lose subscriber!\n\n#STAGE TWO\n\nYou will be reported to the Reddit admins. This will aid us in stopping you from posting any more cringe.\n\n#STAGE THREE\n\nYou will start to feel a sense of uneasiness and/or the feeling of being watched. Ignore this. Everything is perfectly fine!\n\n#STAGE FOUR\n\nYou will start to have rather odd dreams. Here is a common example of what you can expect to see: https://m.youtube.com/watch?v=WJ2JyY_bIZU\n\n#STAGE FIVE\n\nDo not tell a n y o n e.\n\nThey don’t need to know about you posting cringe! :D\n\n#STAGE SIX\n\nExactly eight days, twelve hours and thirteen minutes after you receive this message, go to your bed and lie down. Close your eyes. Make sure you are alone. (Wearing no clothing is preferred)\n\ne v e r y t h i n g\n\ni s \n\nf i n e\n\n#STAGE SEVEN\n\nTaking a painkiller or two might be helpful for this stage!\n\nYou should hear either your front door open or one of your windows smash.\n\nThis is fine.\n\nYou will hear something/someone come into your room.\n\nThis is fine.\n\nYour clothes will be taken off (If you are wearing any)\n\nThis is fine.\n\nYou will feel a sharp pain in the general area of your genitals. This is completely normal. The entity you saw in your dreams is NOT in the room with you. Make sure you keep your eyes closed!\n\n(Any sudden movements are also not recommended)\n\n#STAGE EIGHT\n\nWait approximately fifteen minutes. Please ignore the excruciating pain your private parts are currently in. Don’t worry about the feeling of warm liquid pooling between your legs.\n\nRemember to keep your eyes closed! Making eye contact with h̴̪͘į̷̗̌̔m̵̡̗̈ isn’t a real fun experience! :)\n\n#STAGE NINE\n\nAlright! The process is now complete!\n\nCheck it out! We ripped your foreskin off! Isn’t that something? This is what cringe posters like you get!\n\nDo not tell anyone.\n\nDo not see a doctor.\n\nDo not go to a hospital.\n\n#BUT MOST IMPORTANTLY:\n\nDon’t post cringe!\n\nHave a great day! Thank you for your time. (And foreskin!) \n\n;)",
            "u/LovesCompany u/TearsFromTheSky",
            "Meow",
            "[deleted]"
        ]
    },
    {
        "post_id": "do44e7",
        "author": "ZMangames",
        "title": "LPT: Did you know that as a 30 year old obese man you are legally entitled to sit on a mall santa’s lap and loudly moan while you piss and shit your pants? The dumb lawboys forgot to write that one down.",
        "url": "https://www.reddit.com/r/copypasta/comments/do44e7/lpt_did_you_know_that_as_a_30_year_old_obese_man/",
        "score": 8059,
        "num_comments": 79,
        "created_utc": 1572237515.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/do44e7/lpt_did_you_know_that_as_a_30_year_old_obese_man/",
        "comments": [
            "LPT: Did you know that as a 30 year old obese man you are legally entitled to sit on a mall santa’s lap and loudly moan while you piss and shit your pants? The dumb lawboys forgot to write that one down.",
            "Actually did this myself today. I did it alone though :( im so lonely i wish someone would let me do this to them",
            "Is this actually legeal? Asking for a friend.",
            "NTA",
            "YTA, not enough poop",
            "Almost downvoted until I saw the sub",
            "What does LPT mean?",
            "what does LPT stand for",
            "Owoifier is down so I guess I gotta fill in...\n\nWPT: Did you know as a 30 yeaw owd obese man you awe wegawwy entitwed to sit on a maww Santa's wap and woudwy moan whiwe you piss and shit youw pants? The dumb wawboys fowgot to wwite that one down \n\nYour welcome",
            "\"dumb lawboys\" killed me.",
            "NAH",
            "Is there some reference I am not getting here?",
            "[deleted]",
            "LPT: Did you know that as a 30 year old obese man you are legally entitled to sit on a mall santa’s lap and loudly moan while you piss and shit your pants? The dumb lawboys forgot to write that one down.",
            "I just shit and cum.\n\n# FAQ\n\n## What does this mean?\n\nThe amount of shit (and cum) on my computer and floor has increased by one.\n\n## Why did you do this?\n\nThere are several reasons I may deem a comment to be worthy of feces or ejaculation. These include, but are not limited to:\n\n* Being gay\n* Dank copypasta bro, where'd you find it\n* walter\n\n## Am I going to shit and cum too?\n\nNo - not yet. But you should refrain from shitposting and cumposting like this in the future. Otherwise I will be forced to shit and cum again, which may put your shitting and cumming privileges in jeopardy.\n\n## I don't believe my comment deserved being shit and cum at. Can you un-cum it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I put shit back into my butt. If you would like to issue an appeal, shoot me a hot load explaining what I got wrong. I tend to respond to retaliatory ejaculation within several minutes. Do note, however, that over 99.9% of semen dies before it can fertilize the egg, and yours is likely no exception.\n\n## How can I prevent this from happening in the future?\n\nAccept the goopy brown and white substance and move on. But learn from this mistake: your behavior will not be tolerated in my mom's basement. I will continue to shit and cum until you improve your conduct. Remember: ejaculation is privilege, not a right.",
            "ESH.",
            "who is joe?",
            "yta, i don’t think that really reflects on the holiday spirit",
            "Some of these Santas claim to have been there\n\nConfessions of a mall santa\n\n[https://youtu.be/QWZUPhEEkVc](https://youtu.be/QWZUPhEEkVc)",
            "Amharic:\n\nLPT: የ 30 ዓመት ዕድሜ ያለው ወፍራም ሰው እንደመሆኔ መጠን ሱሪዎቻውን እየመታ እና ሲያጫጫጭቁ በጫት ጩኸት ላይ ቁጭ ብለው ጮክ ብለው ማልቀስ በሕጋዊ መብት እንዳሎት ያውቃሉ? ዲዳ ሕግ አውጪዎች ያንን መጻፍ ረሱ ፡፡\n\nTag me to Amharic Translate things.\n\nOr I just do it randomly.",
            "You have been temporarily banned from participating in [r/copypasta](https://www.reddit.com/r/copypasta/). This ban will last for 10 days. You can still view and subscribe to [r/copypasta](https://www.reddit.com/r/copypasta/), but you won't be able to post or comment.\n\nIf you have a question regarding your ban, you can contact the moderator team for [r/copypasta](https://www.reddit.com/r/copypasta/) by replying to this message.\n\nReminder from the Reddit staff: If you use another account to circumvent this subreddit ban, that will be considered a violation of the Content Policy and can result in your account being suspended from the site as a whole.",
            "random = funny"
        ]
    }
]