[
    {
        "post_id": "e2ucyh",
        "author": "Dark-Aura",
        "title": "Ball cleavage shorts should be a thing",
        "url": "https://www.reddit.com/r/copypasta/comments/e2ucyh/ball_cleavage_shorts_should_be_a_thing/",
        "score": 8048,
        "num_comments": 177,
        "created_utc": 1574924644.0,
        "selftext": "Ball cleveage shorts should be a thing.\n\nI feel like society is ready.\n\nI can imagine all sorts of cool outfits that show off my ball cleveage, for the office, for the pool, weddings and any sort of occasion.\n\nWearing ball cleavage shorts will allow us men to use our assets to flirt with women who are in power in hopes of gaining some unfair advantage over those who are less endowed.\n\nThere would be \"wonder shorts\" which push the balls up front and accentuate the cleavage. Like diamonds on a pedestal.\n\nThere would be a little hole in the shorts to let the ball cleavage poke through",
        "permalink": "/r/copypasta/comments/e2ucyh/ball_cleavage_shorts_should_be_a_thing/",
        "comments": [
            "It is 4 in the fucking morning and at first I thought this was on r/offmychest and I was super confused but respected it at the same time",
            "Ball cleveage shorts should be a thing.\n\nI feel like society is ready.\n\nI can imagine all sorts of cool outfits that show off my ball cleveage, for the office, for the pool, weddings and any sort of occasion.\n\nWearing ball cleavage shorts will allow us men to use our assets to flirt with women who are in power in hopes of gaining some unfair advantage over those who are less endowed.\n\nThere would be \"wonder shorts\" which push the balls up front and accentuate the cleavage. Like diamonds on a pedestal.\n\nThere would be a little hole in the shorts to let the ball cleavage poke through",
            "I knew this would make it here",
            "NTA",
            "This was in unpopular opinion and the downvoted me for saying that shit’s nasty",
            "Finally, some EQUALITY",
            "YTA, fuck you bye bye",
            "Sauce?",
            "[deleted]",
            "My brain didn’t process the title correctly at first I thought this was gonna be about cutting your balls off with a cleaver",
            "What can I say except delete this",
            "I'm going against the grain and saying YTA, just who do you think you are?",
            "Anyone want to explain to me what a ball cleavage is",
            "I thought this was r/unpopularopinion for a sec",
            "Bruh, I posted this 4 hours before this was posted and it said it was a common repost... Tf..",
            "Or not.",
            "Thanks for the repost",
            "damn how come when I posted this months ago I got 20 upvotes.",
            "Honestly, this was a thing, sadly fell out of fashion though\n\nhttps://en.m.wikipedia.org/wiki/Codpiece",
            "Huge red flag here",
            "This is a whole h3 podcast topic",
            "Called it btw",
            "You’re welcome: https://youtu.be/DGp_XvwAyHI",
            "i like how it just stops",
            "I posted it first.",
            "cock",
            "Cock",
            "Okay so Bob Weir from the Grateful Dead has been rocking ball cleavage for a long long time.",
            "tubage not cleavage",
            "You mean a mooseknuckle?",
            "Rachel Maddow has good ball cleavage.\n\n[https://ibb.co/g7KmDNt](https://ibb.co/g7KmDNt)",
            "Have you ever heard of codpieces?",
            "This is hilarious",
            ">gaining some unfair advantage over those who are less endowed.\n\nmy dicks pretty small but my balls are pretty big. so itd be like surprise ha!",
            "Why do I keep on thinking this is r/unpopularopinion",
            "Cock",
            "Cock",
            "Cock",
            "No thank you",
            "Sackbottom",
            "I literally came on Reddit to see if there's anything on a chemical plant explosion in my area and I see this on my home page",
            "Did OP recently watch Joe Rogan's Netflix special?",
            "I agree lets get this legal",
            "smart poor atheist meow emoji skeleton joe Karen spider virgin cock",
            "The saddest part about this post is if you replace balls with boobs and shorts with idk shirts, it makes way more sense and it is way more normalised",
            "I bet 4chan could make it a thing. More so if the reason is some kind of feminism/equalitarian/trans/socialist bs"
        ]
    },
    {
        "post_id": "pxwe6j",
        "author": "Disastrous-Arm4525",
        "title": "Hello this is the moderator from PornHub.",
        "url": "https://www.reddit.com/r/copypasta/comments/pxwe6j/hello_this_is_the_moderator_from_pornhub/",
        "score": 8053,
        "num_comments": 123,
        "created_utc": 1632925274.0,
        "selftext": "Hello this is the moderator from PornHub. We have noticed you haven't logged in for 4 weeks, we are just checking to see that everything is okay with our biggest fan. Since you visited us last time we have updated the gay section with many videos we know you will enjoy.",
        "permalink": "/r/copypasta/comments/pxwe6j/hello_this_is_the_moderator_from_pornhub/",
        "comments": [
            "This is the kind of thing to fake sms people",
            "this subreddit has more gay text porn than pornhub",
            "I for go t I was in  this sub and I got so confused when I saw this",
            "Steam profile comments from 2017 be like",
            "Hello this is the moderator from PornHub.\n\nHello this is the moderator from PornHub. We have noticed you haven't logged in for 4 weeks, we are just checking to see that everything is okay with our biggest fan. Since you visited us last time we have updated the gay section with many videos we know you will enjoy.",
            "Imagine recovering from pron addiction and then seeing this email",
            "This is wholesome.",
            "I swear this is everywhere on steam profile comment section",
            "Ayo 😳",
            "this is already all over everyone’s steam profile including mine",
            "classic steam comments filler",
            "All my homies use e621 u mean nhentai",
            "THE moderator",
            "Yo this the comment on my steam profile",
            "Honestly thought this was a poorly made AMA until i looked at the sub",
            "This is ancient but still gold.",
            "Reddit r/pissinmymouth",
            "This is the shit I see on every Steam profile. Seriously guys, Steam profiles, especially furries, are a copypasta goldmine",
            "Thank you very very much I’m so glad you updated the gay porn categories an the recommended trap furry porn videos was very good. I’m sorry for not logging in recently, but recently I had a penis extension surgery, so I was unable to wank for a full month. Now I have recovered from this horrible experience and I’m ready to view all the good stuff you have recommended me. It is a great honour to be pornhubs biggest fan, and I hope to keep my title into the future. Sincerely, Ben Dover",
            "Hey y’all, I appreciate all the upvotes",
            "Hello this is the moderator from PornHub.\n\nHello this is the moderator from PornHub. We have noticed you haven't logged in for 4 weeks, we are just checking to see that everything is okay with our biggest fan. Since you visited us last time we have updated the gay section with many videos we know you will enjoy.",
            "nice.",
            "[removed]",
            "[deleted]",
            "I logged in like 2 days back tf you on about",
            "[pornhub.com](http://pornhub.com)"
        ]
    },
    {
        "post_id": "f795ol",
        "author": "Masterelia",
        "title": "mr boomer",
        "url": "https://www.reddit.com/r/copypasta/comments/f795ol/mr_boomer/",
        "score": 8044,
        "num_comments": 280,
        "created_utc": 1582280334.0,
        "selftext": "\"i tell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast. we all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"what's for breakfast mum?\". she would smack us all with a shoe and say \"cold beans\". and if we complained and said \"but we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough its all we can afford. i'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. then we would head to school. we met up with the johnson kids from down the road, and walked the 1674 miles to school. on the way to school, we had to walk up a mountain so tall it extended to outer space. when we got to the top of the mountain, we would see the peterson boys on their fancy bikes - which they dont make like they used to, and we would race them down the mountain. then, when we got to school at 4 in the morning, the headmaster would come up to us and say \"you bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. then, we went to class, and mr stevenson would say \"ok line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to walk home. then, when we got home, we'd ask \"whats for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabage\". and if we complained, she would smack us each 100 times with a broom and say \"im trying to feed a family of 154 on just one islet sliver, just you wait until your dad gets home\" - now an islet silver was worth about as much as a grain of sand. then, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. if we had been naughty, we would hit us all another 600 times. then, at 1:58, mum would say \"ok time for bed\". then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep. on saturdays, we went down to uncle bob's farm to work. we would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. we would get on the bus and pay our fare of 3 teddy roses - now a teddy rose is worth about the same as a flake of skin. then, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. when we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house. then, we had to plow the fields with a toothbrush in the blazing summer heat - now, they dont make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. then, we would have to milk the cows - now, they dont make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. if you touched a cows udder, it would kick you and you would die, so you had to be really careful when you milked the cows. then, when we were done, uncle bob would say \"ok kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. on sundays, we would meet the johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of america, and as deep as the marianas trench, and it was filled with liquid tungsten. we would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon. one day, little jimmy fell from the top of the tree. when he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. dr james said \"oh its just a scratch little jimmy dont worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok. after we finished playing by the river, we would go into town and get some candy. now, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a ciggarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. bleach, lsd, ecstasy, you name it. so we would always get a little hyper after our candy. one day, when we were hyper, we went up the mr boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see mr henderson, he'll set ya right\". now, dad had told us about mr henderson. mr henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. dad walked us all down to the pub, and we saw a left testicle propped up on a pegleg. \"mr henderson,\" said dad, \"i have some kids here who need a good whooping\". then, mr henderson picked up the entire pub, and hit us each 4006 times with it. then, dad said \"right, i gotta go back to the soot factory, you kids run on home now\". now, by now it was 1pm, which meant it was curfew. while we were walking out of the town square, we heard a man shout \"oi you bloody kids, its curfew\". we turned around and saw the constable holding his baton. he hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light. we were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. so don't you come complaining to me about nonsense like not being able to breathe or not being able to feel your legs.",
        "permalink": "/r/copypasta/comments/f795ol/mr_boomer/",
        "comments": [
            "Everybody gangsta til a man has a peg leg on his testicle",
            "This probably is the best copy pasta I've ever read.",
            "\"i tell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast. we all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"what's for breakfast mum?\". she would smack us all with a shoe and say \"cold beans\". and if we complained and said \"but we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough its all we can afford. i'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. then we would head to school. we met up with the johnson kids from down the road, and walked the 1674 miles to school. on the way to school, we had to walk up a mountain so tall it extended to outer space. when we got to the top of the mountain, we would see the peterson boys on their fancy bikes - which they dont make like they used to, and we would race them down the mountain. then, when we got to school at 4 in the morning, the headmaster would come up to us and say \"you bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. then, we went to class, and mr stevenson would say \"ok line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to walk home. then, when we got home, we'd ask \"whats for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabage\". and if we complained, she would smack us each 100 times with a broom and say \"im trying to feed a family of 154 on just one islet sliver, just you wait until your dad gets home\" - now an islet silver was worth about as much as a grain of sand. then, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. if we had been naughty, we would hit us all another 600 times. then, at 1:58, mum would say \"ok time for bed\". then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep. on saturdays, we went down to uncle bob's farm to work. we would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. we would get on the bus and pay our fare of 3 teddy roses - now a teddy rose is worth about the same as a flake of skin. then, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. when we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house. then, we had to plow the fields with a toothbrush in the blazing summer heat - now, they dont make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. then, we would have to milk the cows - now, they dont make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. if you touched a cows udder, it would kick you and you would die, so you had to be really careful when you milked the cows. then, when we were done, uncle bob would say \"ok kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. on sundays, we would meet the johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of america, and as deep as the marianas trench, and it was filled with liquid tungsten. we would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon. one day, little jimmy fell from the top of the tree. when he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. dr james said \"oh its just a scratch little jimmy dont worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok. after we finished playing by the river, we would go into town and get some candy. now, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a ciggarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. bleach, lsd, ecstasy, you name it. so we would always get a little hyper after our candy. one day, when we were hyper, we went up the mr boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see mr henderson, he'll set ya right\". now, dad had told us about mr henderson. mr henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. dad walked us all down to the pub, and we saw a left testicle propped up on a pegleg. \"mr henderson,\" said dad, \"i have some kids here who need a good whooping\". then, mr henderson picked up the entire pub, and hit us each 4006 times with it. then, dad said \"right, i gotta go back to the soot factory, you kids run on home now\". now, by now it was 1pm, which meant it was curfew. while we were walking out of the town square, we heard a man shout \"oi you bloody kids, its curfew\". we turned around and saw the constable holding his baton. he hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light. we were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. so don't you come complaining to me about nonsense like not being able to breathe or not being able to feel your legs.",
            "i think “grilled water” is one of the funniest phrases i’ve ever read. idk why",
            "damn everyone must have been strong af back in the day to hit kids that much. nowadays parents get too tired after a few smacks. They just don't make parents like they used to",
            "I tell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. Anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast.\n\nWe all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"What's for breakfast mum?\", she would smack us all with a shoe and say \"cold beans\". And if we complained and said \"But we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough it's all we can afford. I'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. \n\nThen we would head to school. We met up with the Johnson Kids from down the road, and walked the 1674 miles to school. On the way to school, we had to walk up a mountain so tall it extended to outer space. When we got to the top of the mountain, we would see the Peterson Boys on their fancy bikes - which they don't make like they used to, and we would race them down the mountain.\n\nThen, when we got to school at 4 in the morning, the headmaster would come up to us and say \"You bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. Then, we went to class, and Mr Stevenson would say \"OK line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each.\n\nThen it was 7 at night and we had to walk home. Then, when we got home, we'd ask \"What's for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabbage\". And if we complained, she would smack us each 100 times with a broom and say \"I'm trying to feed a family of 154 with just one islet sliver, just you wait until your dad gets home\" - now an islet silver was worth about as much as a grain of sand. \n\n\nThen, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. If we had been naughty, he would hit us all another 600 times. then, at 1:58, mum would say \"OK time for bed\". Then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep.\n\nOn saturdays, we went down to uncle Bob's farm to work. We would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. We would get on the bus and pay our fare of 3 teddy roses - now a teddy rose is worth about the same as a flake of skin. \n\nThen, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. \n\n\nWhen we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house.\n\nThen, we had to plow the fields with a toothbrush in the blazing summer heat - now, they don't make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. \n\nThen, we would have to milk the cows - now, they don't make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. If you touched a cow's udder, it would kick you and you would die, so you had to be really careful when you milked the cows.\n\n\nThen, when we were done, uncle bob would say \"OK kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. \n\n\nOn sundays, we would meet the Johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of America, and as deep as the Marianna's trench, and it was filled with liquid tungsten. \n\nWe would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon.\n\nOne day, little jimmy fell from the top of the tree. When he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. Dr James said \"oh its just a scratch little jimmy don't worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok.\n\n\nAfter we finished playing by the river, we would go into town and get some candy. now, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a cigarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. bleach, LSD, ecstasy, you name it. so we would always get a little hyper after our candy. \n\n\nOne day, when we were hyper, we went up the Mr Boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see Mr. Henderson, he'll set ya right\". \n\n\nNow, dad had told us about Mr. henderson. Mr. Henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. Dad walked us all down to the pub, and we saw a left testicle propped up on a peg leg. \"Mr. Henderson,\" said dad, \"I have some kids here who need a good whooping\". then, Mr. Henderson picked up the entire pub, and hit us each 4006 times with it.\n\n\nThen, dad said \"Right, I gotta go back to the soot factory, you kids run on home now\". By now it was 1pm, which meant it was curfew.\n\n\nWhile we were walking out of the town square, we heard a man shout \"Oi you bloody kids, its curfew\". We turned around and saw the constable holding his baton. He hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light.\n\n\nWe were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. So don't you come complaining to me about nonsense like not being able to breathe or not being able to feel your legs.",
            "Where'd you get this? It's genuinely the greatest copypasta ever.",
            "This legit sounds like how a boomer tells an old story lol",
            " now, they don't make rivers like they used to",
            "\"i teww you kids, back in my day, we had it so wough... ow so much bettew, i can't teww anymowe. anyway, evewy day, we wouwd wake up at 2 in the mowning and go to the tabwe fow bweakfast. we aww wived in a cwoset, you see, so it was one woom. and we wouwd ask, me and my 64 bwothews and 27 sistews, \"what's fow bweakfast mum?\". she wouwd smack us aww with a shoe and say \"cowd beans\". and if we compwained and said \"but we had cowd beans yestewday\" - because we had cowd beans evewy day - she wouwd smack us aww five times with a shoe and say \"tough its aww we can affowd. i'm twying to feed a famiwy of 93 with just hawf a siwvew buckington\", a siwvew buckington was about the same as hawf a penny back in the day. then we wouwd head to schoow. we met up with the johnson kids fwom down the woad, and wawked the 1674 miwes to schoow. on the way to schoow, we had to wawk up a mountain so taww it extended to outew space. when we got to the top of the mountain, we wouwd see the petewson boys on theiw fancy bikes - which they dont make wike they used to, and we wouwd wace them down the mountain. then, when we got to schoow at 4 in the mowning, the headmastew wouwd come up to us and say \"you bwoody kids awe wate\", then he wouwd smack us aww with the cane 10 times and teww us we had 7 yeaws of detention. then, we went to cwass, and mw stevenson wouwd say \"ok wine up kids\", then he wouwd spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to wawk home. then, when we got home, we'd ask \"whats fow dinnew mum?\", and she'd smack us each 50 times with a pan and say \"wotten cabage\". and if we compwained, she wouwd smack us each 100 times with a bwoom and say \"im twying to feed a famiwy of 154 on just one iswet swivew, just you wait untiw youw dad gets home\" - now an iswet siwvew was wowth about as much as a gwain of sand. then, when ouw dad got home fwom his job at the soot factowy, he wouwd hit us aww 180 times with his bewt. if we had been naughty, we wouwd hit us aww anothew 600 times. then, at 1:58, mum wouwd say \"ok time fow bed\". then, we got into ouw potato sacks, and she wouwd hit us each with a shoe 8 times befowe we went to sweep. on satuwdays, we went down to uncwe bob's fawm to wowk. we wouwd have to wawk 345 miwes to the bus stop, then catch the woute 4 bus fow 56 stops. we wouwd get on the bus and pay ouw fawe of 3 teddy woses - now a teddy wose is wowth about the same as a fwake of skin. then, if the ticket inspectow came to us, he wouwd hit us aww 4 times with his baton. if any of us had wost ouw ticket, we wouwd hit us aww 10 times again and thwow us off the bus and we had to wawk the west of the way. when we got to the fawm, uncwe bob wouwd dwive to the gate in his twactow, hit us aww 780 times with his cwowbaw, and teww us to get in his twaiwew so he couwd dwive us to the fawm house. then, we had to pwow the fiewds with a toothbwush in the bwazing summew heat - now, they dont make summews wike they used to, so it was about 1345.4 degwees spencew, ow 67 degwees centigwade using youw new-fangwed metwic system. then, we wouwd have to miwk the cows - now, they dont make cows wike they used to, so each cow weighed about 459 hog's heads, ow 3.2 tonnes in youw new-fangwed metwic system. if you touched a cows uddew, it wouwd kick you and you wouwd die, so you had to be weawwy cawefuw when you miwked the cows. then, when we wewe done, uncwe bob wouwd say \"ok kids time fow youw pocket money\". he wouwd give us each 9 coppew jemimahs - which awe wowth about one powiticaw pwomise each - and beat us each 6 times with his twactow befowe we weft. on sundays, we wouwd meet the johnson boys and go down to the wivew - now, they don't make wivews wike they used to, so this wivew was about as wide as the whowe of amewica, and as deep as the mawianas twench, and it was fiwwed with wiquid tungsten. we wouwd pway by the owd oak twee neaw the wivew, cwimbing on it and buiwding twee houses and such. now - they don't make twees wike they used to, so this twee had a twunk as thick as a city, and was taww enough that the bwanches on the top couwd scwape the moon. one day, wittwe jimmy feww fwom the top of the twee. when he hit the gwound, the onwy bit of his body we couwd wecognise was his weft eyebaww. we picked up aww his bits and wushed him to the doctows suwgewy. dw james said \"oh its just a scwatch wittwe jimmy dont wowwy pop a pwastew on it and you'ww be wight\" and he gave wittwe jimmy a pwastew and a wowwipop and he was ok. aftew we finished pwaying by the wivew, we wouwd go into town and get some candy. now, back in the day, you couwd give the shopkeepew one bwonze wingwet - which is wowth about as much as a ciggawette butt - and he wouwd give you the entiwe stock of the stowe. so we wouwd go and get ouw candy, and we'd go into the town squawe and eat it. now, we didn't have any of youw fancy food waws back in the day, so thewe was aww kinds of stuff in ouw candy. bweach, wsd, ecstasy, you name it. so we wouwd awways get a wittwe hypew aftew ouw candy. one day, when we wewe hypew, we went up the mw bowis's caw, the onwy caw in the town, and touched it. as we touched it, we saw dad stowming down the stweet howding his bewt. \"you kids, having fun whiwe i wowk aww day in the soot factowy just so you can have gwiwwed watew fow tea evewy night, i oughta smack you aww\". we wewe suwe he was going to smack us, but then he said \"no, i got a bettew idea, iww take you to see mw hendewson, he'ww set ya wight\". now, dad had towd us about mw hendewson. mw hendewson was a vetewan fwom the gweat waw, whewe he got a weawwy bad injuwy, but we nevew knew what it was. dad wawked us aww down to the pub, and we saw a weft testicwe pwopped up on a pegweg. \"mw hendewson,\" said dad, \"i have some kids hewe who need a good whooping\". then, mw hendewson picked up the entiwe pub, and hit us each 4006 times with it. then, dad said \"wight, i gotta go back to the soot factowy, you kids wun on home now\". now, by now it was 1pm, which meant it was cuwfew. whiwe we wewe wawking out of the town squawe, we heawd a man shout \"oi you bwoody kids, its cuwfew\". we tuwned awound and saw the constabwe howding his baton. he hit us each 160265 times with his baton, then put us in gaow fow 60123865 yeaws. now - they don't make gaows wike they used to - this one had 5 miwe thick steew wawws, and a singwe howe in the top wet in some wight. we wewe in thewe fow about 13526 yeaws, untiw mum baked the constabwe some cawdboawd pie so he wouwd wet us out. then, she hit us aww 1292 times with a washboawd, and gwounded us fow the west of ouw wives. so don't you come compwaining to me about nonsense wike not being abwe to bweathe ow not being abwe to feew youw wegs.",
            "Now we just need Michael Rosen to read this",
            "Reminds me of The Four Yorkshire Men by Monty Python:\n\nhttps://youtu.be/ue7wM0QC5LE",
            "ok boomer",
            "You know how people always talk about having a good book to sink your teeth into? This is the copypasta equivalent",
            "Poor little Jimmy.",
            "The fucking soot factory I'm dying",
            "\"which are worth about 1 political promise each\"\nlol",
            "NTA. You don't make things like you used to.",
            "I just read the whole thing, good work.",
            "Genuinely one of the best things I've read in a while",
            "Mr. Boom, (Mr. Boom)\nMr. Boom, (Mr. Boom)\nMr. B double O M-mmm\n\n(That sure spells boom)\n\n\n   You will wind up being, younger soon when you, mess with Mr. Boom\n(Don't mess with Boom)\n\n  Oh Mr. Back-in-my-day boom, If you've been so young you, thought wished you died. You'll feel better once you're, hypnotized.(by your phone)\n(Hypnotized!)",
            "I legitimately had to get up and leave a restaurant because i was gut laughing too hard",
            "Jeez, you had potato sacks to sleep in? Back in my day...",
            "Crying laughing at those excessive beatings",
            "is this a Joe Biden speech?",
            "This reminds me of some Karen Boomer who’s lik3 “ohhh you think you had it bad!! You’re just unvaccinated and okay but we had it hard you get to wake up at 6:50AM”",
            "The comedic timing of the \"now, they don't make blanks like they used to\" is ridonkulous.",
            "Holy fuck",
            "I will always upvote this",
            "This is beautiful and I love it so much",
            "⢀⡴⠑⡄⠀⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣤⣀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠸⡇⠀⠿⡀⠀⠀⠀⣀⡴⢿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠑⢄⣠⠾⠁⣀⣄⡈⠙⣿⣿⣿⣿⣿⣿⣿⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⡀⠁⠀⠀⠈⠙⠛⠂⠈⣿⣿⣿⣿⣿⠿⡿⢿⣆⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⡾⣁⣀⠀⠴⠂⠙⣗⡀⠀⢻⣿⣿⠭⢤⣴⣦⣤⣹⠀⠀⠀⢀⢴⣶⣆ ⠀⠀⢀⣾⣿⣿⣿⣷⣮⣽⣾⣿⣥⣴⣿⣿⡿⢂⠔⢚⡿⢿⣿⣦⣴⣾⠁⠸⣼⡿ ⠀⢀⡞⠁⠙⠻⠿⠟⠉⠀⠛⢹⣿⣿⣿⣿⣿⣌⢤⣼⣿⣾⣿⡟⠉⠀⠀⠀⠀⠀ ⠀⣾⣷⣶⠇⠀⠀⣤⣄⣀⡀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠉⠈⠉⠀⠀⢦⡈⢻⣿⣿⣿⣶⣶⣶⣶⣤⣽⡹⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠉⠲⣽⡻⢿⣿⣿⣿⣿⣿⣿⣷⣜⣿⣿⣿⡇⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣷⣶⣮⣭⣽⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣀⣀⣈⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠻⠿⠿⠿⠿⠛⠉",
            "If you woke up at 2, walked/biked 1674 miles to school, and got there at 4, that means you must've walked/biked about 1110 miles per hour.",
            "One of the funniest things i ever read. Thank you",
            "\"i tell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast. we all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"what's for breakfast mum?\". \n\n\nshe would smack us all with a shoe and say \"cold beans\". and if we complained and said \"but we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough its all we can afford. i'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. then we would head to school. we met up with the johnson kids from down the road, and walked the 1674 miles to school.\n\n\n\n on the way to school, we had to walk up a mountain so tall it extended to outer space. when we got to the top of the mountain, we would see the peterson boys on their fancy bikes - which they dont make like they used to, and we would race them down the mountain. then, when we got to school at 4 in the morning, the headmaster would come up to us and say \"you bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. then, we went to class, and mr stevenson would say \"ok line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to walk home. then, when we got home, we'd ask \"whats for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabage\". and if we complained, she would smack us each 100 times with a broom and say \"im trying to feed a family of 154 on just one islet sliver, just you wait until your dad gets home\" \n\n\n now an islet silver was worth about as much as a grain of sand. then, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. if we had been naughty, we would hit us all another 600 times. then, at 1:58, mum would say \"ok time for bed\". then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep. on saturdays, we went down to uncle bob's farm to work. we would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. we would get on the bus and pay our fare of 3 teddy roses \n\n\n\nnow a teddy rose is worth about the same as a flake of skin. then, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. when we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house. then, we had to plow the fields with a toothbrush in the blazing summer heat \n\n\n\n\n now, they dont make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. then, we would have to milk the cows \n\n\n\n\n now, they dont make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. if you touched a cows udder, it would kick you and you would die, so you had to be really careful when you milked the cows. then, when we were done, uncle bob would say \"ok kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. \n\n\n\non sundays, we would meet the johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of america, and as deep as the marianas trench, and it was filled with liquid tungsten. we would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon. one day, little jimmy fell from the top of the tree. \n\n\n\nwhen he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. dr james said \"oh its just a scratch little jimmy dont worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok. after we finished playing by the river, we would go into town and get some candy. \n\n\n\nnow, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a ciggarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. \n\n\n\nbleach, lsd, ecstasy, you name it. so we would always get a little hyper after our candy. one day, when we were hyper, we went up the mr boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see mr henderson, he'll set ya right\".\n\n\n\n now, dad had told us about mr henderson. mr henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. dad walked us all down to the pub, and we saw a left testicle propped up on a pegleg. \"mr henderson,\" said dad, \"i have some kids here who need a good whooping\". then, mr henderson picked up the entire pub, and hit us each 4006 times with it. then, dad said \"right, i gotta go back to the soot factory, you kids run on home now\". now, by now it was 1pm, which meant it was curfew. while we were walking out of the town square, we heard a man shout \"oi you bloody kids, its curfew\". \n\n\n\n\n\nwe turned around and saw the constable holding his baton. he hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light.\n\n\n\n we were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. so don't you come complaining to me about nonsense like not being able to breathe or not being able to feel your legs.\n\n\ntried to condense for discord",
            "Meow",
            "This is amazing but apparently a repost, sadly.",
            "This is stolen from elsewhere and is uncredited op please credit the original author",
            "God dead cock virgin game 69",
            "Nice wall of text! \n\n\nSometimes having it rough is so much better. I remember walking the two miles to and the two miles from elementary school and that seems like a lot but, on the other hand we were free to do so. No one was going to bother us. The walk was through a beautiful tree lined community where nothing especially bad ever seemed to happen. \n\n\nWalking to high school was an even longer walk but, we typically walked it together and we enjoyed it. \n\n\nAnd these days, you young people are robbed of that. And that isn’t right. Things kind of sucked back then, but they suck even more now.",
            "Cock",
            "Ok boomer",
            "OK boomer",
            "Meow",
            "Dead",
            "69",
            "420",
            "Dead cock virgin dead cock virgin dead cock virgin",
            "nice",
            "I’ve never laughed this hard at anything. I’m crying in class right now hoping the teacher doesn’t catch me.",
            "[deleted]",
            "Someone please do the math of how many times they get smacked in the course of a day",
            "Thats beats all the stories of hardship I ever told my children.  I use to live in a shoebox in the middle of the interstate and now realize just how damn lucky I was.",
            "u/Thesaurizethis",
            "u/thesaurizethisbot",
            "cock",
            "[deleted]",
            "[deleted]",
            "Y’all really walked 837 mph, faster than the speed of sound, up a mountain to school and were still late.",
            "cock",
            "If anyone else cared enough to read that entire thing, you are a gud guy",
            "Cock",
            "This is an amazing Copypasta. However, it's even better if you read it in a Tommy the Cat voice.",
            "Who made this? I want to animate it",
            "The amount of times this has been reposted... How has this been upvoted so much?",
            "Like for mum to spank those darn kids again 😔😔",
            "I have it here\nTell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast. we all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"what's for breakfast mum?\". she would smack us all with a shoe and say \"cold beans\". and if we complained and said \"but we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough its all we can afford. i'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. then we would head to school. we met up with the johnson kids from down the road, and walked the 1674 miles to school. on the way to school, we had to walk up a mountain so tall it extended to outer space. when we got to the top of the mountain, we would see the peterson boys on their fancy bikes - which they dont make like they used to, and we would race them down the mountain. then, when we got to school at 4 in the morning, the headmaster would come up to us and say \"you bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. then, we went to class, and mr stevenson would say \"ok line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to walk home. then, when we got home, we'd ask \"whats for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabage\". and if we complained, she would smack us each 100 times with a broom and say \"im trying to feed a family of 154 on just one islet sliver, just you wait until your dad gets home\" - now an islet silver was worth about as much as a grain of sand. then, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. if we had been naughty, we would hit us all another 600 times. then, at 1:58, mum would say \"ok time for bed\". then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep. on saturdays, we went down to uncle bob's farm to work. we would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. we would get on the bus and pay our fare of 3 teddy roses - now a teddy rose is worth about the same as a flake of skin. then, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. when we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house. then, we had to plow the fields with a toothbrush in the blazing summer heat - now, they dont make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. then, we would have to milk the cows - now, they dont make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. if you touched a cows udder, it would kick you and you would die, so you had to be really careful when you milked the cows. then, when we were done, uncle bob would say \"ok kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. on sundays, we would meet the johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of america, and as deep as the marianas trench, and it was filled with liquid tungsten. we would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon. one day, little jimmy fell from the top of the tree. when he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. dr james said \"oh its just a scratch little jimmy dont worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok. after we finished playing by the river, we would go into town and get some candy. now, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a ciggarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. bleach, rust, bones--you name it. so we would always get a little hyper after our candy. one day, when we were hyper, we went up the mr boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see mr henderson, he'll set ya right\". now, dad had told us about mr henderson. mr henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. dad walked us all down to the pub, and we saw a left testicle propped up on a pegleg. \"mr henderson,\" said dad, \"i have some kids here who need a good whooping\". then, mr henderson picked up the entire pub, and hit us each 4006 times with it. then, dad said \"right, i gotta go back to the soot factory, you kids run on home now\". now, by now it was 1pm, which meant it was curfew. while we were walking out of the town square, we heard a man shout \"oi you bloody kids, its curfew\". we turned around and saw the constable holding his baton. he hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light. we were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. so don't you come complaining to me about nonsense like not having tv while hiking 25 miles to school.\n\nIntellectual property of [u/imabigboy124",
            "Man I must have dementia because I remember seeing this twice before on this sub.",
            "Cock",
            "I want you all to take the time to imagine a world where all of these things are potentially true.",
            "I tell you kids, back in my day, cock",
            "Told my mom about this and she got angry....",
            "ok boomer",
            "mr boomer\n\n\"i tell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast. we all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"what's for breakfast mum?\". she would smack us all with a shoe and say \"cold beans\". and if we complained and said \"but we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough its all we can afford. i'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. then we would head to school. we met up with the johnson kids from down the road, and walked the 1674 miles to school. on the way to school, we had to walk up a mountain so tall it extended to outer space. when we got to the top of the mountain, we would see the peterson boys on their fancy bikes - which they dont make like they used to, and we would race them down the mountain. then, when we got to school at 4 in the morning, the headmaster would come up to us and say \"you bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. then, we went to class, and mr stevenson would say \"ok line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to walk home. then, when we got home, we'd ask \"whats for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabage\". and if we complained, she would smack us each 100 times with a broom and say \"im trying to feed a family of 154 on just one islet sliver, just you wait until your dad gets home\" - now an islet silver was worth about as much as a grain of sand. then, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. if we had been naughty, we would hit us all another 600 times. then, at 1:58, mum would say \"ok time for bed\". then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep. on saturdays, we went down to uncle bob's farm to work. we would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. we would get on the bus and pay our fare of 3 teddy roses - now a teddy rose is worth about the same as a flake of skin. then, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. when we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house. then, we had to plow the fields with a toothbrush in the blazing summer heat - now, they dont make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. then, we would have to milk the cows - now, they dont make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. if you touched a cows udder, it would kick you and you would die, so you had to be really careful when you milked the cows. then, when we were done, uncle bob would say \"ok kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. on sundays, we would meet the johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of america, and as deep as the marianas trench, and it was filled with liquid tungsten. we would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon. one day, little jimmy fell from the top of the tree. when he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. dr james said \"oh its just a scratch little jimmy dont worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok. after we finished playing by the river, we would go into town and get some candy. now, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a ciggarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. bleach, lsd, ecstasy, you name it. so we would always get a little hyper after our candy. one day, when we were hyper, we went up the mr boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see mr henderson, he'll set ya right\". now, dad had told us about mr henderson. mr henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. dad walked us all down to the pub, and we saw a left testicle propped up on a pegleg. \"mr henderson,\" said dad, \"i have some kids here who need a good whooping\". then, mr henderson picked up the entire pub, and hit us each 4006 times with it. then, dad said \"right, i gotta go back to the soot factory, you kids run on home now\". now, by now it was 1pm, which meant it was curfew. while we were walking out of the town square, we heard a man shout \"oi you bloody kids, its curfew\". we turned around and saw the constable holding his baton. he hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light. we were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. so don't you come complaining to me about nonsense like not being able to breathe or not being able to feel your legs.",
            "That was such a trip.",
            "If the river is liquid tungsten, would that make it a Wiver?",
            "Repost",
            "NTA they don’t make assholes like they used to",
            "[deleted]",
            "aye ye wee cunt, i've seen this before, ye just changed it around a bit.",
            "69",
            "u/nwordcountbot",
            "YTA talk dumb get the thumb.",
            "Dang. Boomers had it rough",
            "Repost lol",
            "This is fucking brilliant",
            "\"i tell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast. we all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"what's for breakfast mum?\". she would smack us all with a shoe and say \"cold beans\". and if we complained and said \"but we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough its all we can afford. i'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. then we would head to school. we met up with the johnson kids from down the road, and walked the 1674 miles to school. on the way to school, we had to walk up a mountain so tall it extended to outer space. when we got to the top of the mountain, we would see the peterson boys on their fancy bikes - which they dont make like they used to, and we would race them down the mountain. then, when we got to school at 4 in the morning, the headmaster would come up to us and say \"you bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. then, we went to class, and mr stevenson would say \"ok line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to walk home. then, when we got home, we'd ask \"whats for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabage\". and if we complained, she would smack us each 100 times with a broom and say \"im trying to feed a family of 154 on just one islet sliver, just you wait until your dad gets home\" - now an islet silver was worth about as much as a grain of sand. then, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. if we had been naughty, we would hit us all another 600 times. then, at 1:58, mum would say \"ok time for bed\". then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep. on saturdays, we went down to uncle bob's farm to work. we would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. we would get on the bus and pay our fare of 3 teddy roses - now a teddy rose is worth about the same as a flake of skin. then, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. when we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house. then, we had to plow the fields with a toothbrush in the blazing summer heat - now, they dont make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. then, we would have to milk the cows - now, they dont make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. if you touched a cows udder, it would kick you and you would die, so you had to be really careful when you milked the cows. then, when we were done, uncle bob would say \"ok kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. on sundays, we would meet the johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of america, and as deep as the marianas trench, and it was filled with liquid tungsten. we would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon. one day, little jimmy fell from the top of the tree. when he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. dr james said \"oh its just a scratch little jimmy dont worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok. after we finished playing by the river, we would go into town and get some candy. now, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a ciggarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. bleach, lsd, ecstasy, you name it. so we would always get a little hyper after our candy. one day, when we were hyper, we went up the mr boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see mr henderson, he'll set ya right\". now, dad had told us about mr henderson. mr henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. dad walked us all down to the pub, and we saw a left testicle propped up on a pegleg. \"mr henderson,\" said dad, \"i have some kids here who need a good whooping\". then, mr henderson picked up the entire pub, and hit us each 4006 times with it. then, dad said \"right, i gotta go back to the soot factory, you kids run on home now\". now, by now it was 1pm, which meant it was curfew. while we were walking out of the town square, we heard a man shout \"oi you bloody kids, its curfew\". we turned around and saw the constable holding his baton. he hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light. we were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. so don't you come complaining to me about nonsense like not being able to breathe or not being able to feel your legs.",
            "Cock god 69",
            " \"i tell you kids, back in my day, we had it so rough... or so much better, i can't tell anymore. anyway, every day, we would wake up at 2 in the morning and go to the table for breakfast. we all lived in a closet, you see, so it was one room. and we would ask, me and my 64 brothers and 27 sisters, \"what's for breakfast mum?\". she would smack us all with a shoe and say \"cold beans\". and if we complained and said \"but we had cold beans yesterday\" - because we had cold beans every day - she would smack us all five times with a shoe and say \"tough its all we can afford. i'm trying to feed a family of 93 with just half a silver buckington\", a silver buckington was about the same as half a penny back in the day. then we would head to school. we met up with the johnson kids from down the road, and walked the 1674 miles to school. on the way to school, we had to walk up a mountain so tall it extended to outer space. when we got to the top of the mountain, we would see the peterson boys on their fancy bikes - which they dont make like they used to, and we would race them down the mountain. then, when we got to school at 4 in the morning, the headmaster would come up to us and say \"you bloody kids are late\", then he would smack us all with the cane 10 times and tell us we had 7 years of detention. then, we went to class, and mr stevenson would say \"ok line up kids\", then he would spank us each 60 times, then hit us each with the cane 40 times each. then it was 7 at night and we had to walk home. then, when we got home, we'd ask \"whats for dinner mum?\", and she'd smack us each 50 times with a pan and say \"rotten cabage\". and if we complained, she would smack us each 100 times with a broom and say \"im trying to feed a family of 154 on just one islet sliver, just you wait until your dad gets home\" - now an islet silver was worth about as much as a grain of sand. then, when our dad got home from his job at the soot factory, he would hit us all 180 times with his belt. if we had been naughty, we would hit us all another 600 times. then, at 1:58, mum would say \"ok time for bed\". then, we got into our potato sacks, and she would hit us each with a shoe 8 times before we went to sleep. on saturdays, we went down to uncle bob's farm to work. we would have to walk 345 miles to the bus stop, then catch the route 4 bus for 56 stops. we would get on the bus and pay our fare of 3 teddy roses - now a teddy rose is worth about the same as a flake of skin. then, if the ticket inspector came to us, he would hit us all 4 times with his baton. if any of us had lost our ticket, we would hit us all 10 times again and throw us off the bus and we had to walk the rest of the way. when we got to the farm, uncle bob would drive to the gate in his tractor, hit us all 780 times with his crowbar, and tell us to get in his trailer so he could drive us to the farm house. then, we had to plow the fields with a toothbrush in the blazing summer heat - now, they dont make summers like they used to, so it was about 1345.4 degrees spencer, or 67 degrees centigrade using your new-fangled metric system. then, we would have to milk the cows - now, they dont make cows like they used to, so each cow weighed about 459 hog's heads, or 3.2 tonnes in your new-fangled metric system. if you touched a cows udder, it would kick you and you would die, so you had to be really careful when you milked the cows. then, when we were done, uncle bob would say \"ok kids time for your pocket money\". he would give us each 9 copper jemimahs - which are worth about one political promise each - and beat us each 6 times with his tractor before we left. on sundays, we would meet the johnson boys and go down to the river - now, they don't make rivers like they used to, so this river was about as wide as the whole of america, and as deep as the marianas trench, and it was filled with liquid tungsten. we would play by the old oak tree near the river, climbing on it and building tree houses and such. now - they don't make trees like they used to, so this tree had a trunk as thick as a city, and was tall enough that the branches on the top could scrape the moon. one day, little jimmy fell from the top of the tree. when he hit the ground, the only bit of his body we could recognise was his left eyeball. we picked up all his bits and rushed him to the doctors surgery. dr james said \"oh its just a scratch little jimmy dont worry pop a plaster on it and you'll be right\" and he gave little jimmy a plaster and a lollipop and he was ok. after we finished playing by the river, we would go into town and get some candy. now, back in the day, you could give the shopkeeper one bronze winglet - which is worth about as much as a ciggarette butt - and he would give you the entire stock of the store. so we would go and get our candy, and we'd go into the town square and eat it. now, we didn't have any of your fancy food laws back in the day, so there was all kinds of stuff in our candy. bleach, lsd, ecstasy, you name it. so we would always get a little hyper after our candy. one day, when we were hyper, we went up the mr boris's car, the only car in the town, and touched it. as we touched it, we saw dad storming down the street holding his belt. \"you kids, having fun while i work all day in the soot factory just so you can have grilled water for tea every night, i oughta smack you all\". we were sure he was going to smack us, but then he said \"no, i got a better idea, ill take you to see mr henderson, he'll set ya right\". now, dad had told us about mr henderson. mr henderson was a veteran from the great war, where he got a really bad injury, but we never knew what it was. dad walked us all down to the pub, and we saw a left testicle propped up on a pegleg. \"mr henderson,\" said dad, \"i have some kids here who need a good whooping\". then, mr henderson picked up the entire pub, and hit us each 4006 times with it. then, dad said \"right, i gotta go back to the soot factory, you kids run on home now\". now, by now it was 1pm, which meant it was curfew. while we were walking out of the town square, we heard a man shout \"oi you bloody kids, its curfew\". we turned around and saw the constable holding his baton. he hit us each 160265 times with his baton, then put us in gaol for 60123865 years. now - they don't make gaols like they used to - this one had 5 mile thick steel walls, and a single hole in the top let in some light. we were in there for about 13526 years, until mum baked the constable some cardboard pie so he would let us out. then, she hit us all 1292 times with a washboard, and grounded us for the rest of our lives. so don't you come complaining to me about nonsense like not being able to breathe or not being able to feel your legs.",
            "this definitely feels inspired by the four yorkshiremen",
            "This is art.",
            "Now I know what a Joe Biden campaign rally is like",
            "69",
            "Repost",
            "cock",
            "Ok boomer",
            "[Luxury](https://www.youtube.com/watch?v=VKHFZBUTA4k)",
            "This isn’t boomer. This is somebody born in the 1890’s.",
            "I looked up teddy rose. I’m extremely uncomfortable now"
        ]
    },
    {
        "post_id": "cj9ghf",
        "author": "pastyp0rr1dge",
        "title": "Found this in a political debate in the youtube comments",
        "url": "https://www.reddit.com/r/copypasta/comments/cj9ghf/found_this_in_a_political_debate_in_the_youtube/",
        "score": 8046,
        "num_comments": 278,
        "created_utc": 1564396246.0,
        "selftext": "Well I am not foolish and incorrect. Do you even know who you're talking to? I'm a fucking prodigy. I was raised in a private school and got straight A's in all subjects. I later went on to become the captain of the debate team in my high school due to my uncanny gift with words and opinions. I have a masters degree in political science and liberal arts. I am smarter than anyone you will ever know. I have an iq of 250 which was recognised by a professional group of elite scientists. How fucking dare you challenge my masterfully crafted opinions. I rub shoulders with the richest and smartest people in the world who can make you disappear without a fucking trace. I know why you are questioning me. You are simply jealous of me living the high life while you suck dick and contract STD's for drug money. You fucking peasant. You are dirt. Filth. You should know your place in this world already. I'm done with you. I've had enough of your petty arguments and low iq. Im going to engage in some real discussion with intellectuals such as myself somewhere else. I hope that in a few years, you will realise your place and cringe at your old points and worship me and my high Iq.\nGoodbye.",
        "permalink": "/r/copypasta/comments/cj9ghf/found_this_in_a_political_debate_in_the_youtube/",
        "comments": [
            "Finally, some good fucking copypasta",
            "Weww I am not foowish and incowwect. Do you even know who you'we tawking to? I'm a fucking pwodigy. I was waised in a pwivate schoow and got stwaight A's in aww subjects. I watew went on to become the captain of the debate team in my high schoow due to my uncanny gift with wowds and opinions. I have a mastews degwee in powiticaw science and wibewaw awts. I am smawtew than anyone you wiww evew know. I have an iq of 250 which was wecognised by a pwofessionaw gwoup of ewite scientists. How fucking dawe you chawwenge my mastewfuwwy cwafted opinions. I wub shouwdews with the wichest and smawtest peopwe in the wowwd who can make you disappeaw without a fucking twace. I know why you awe questioning me. You awe simpwy jeawous of me wiving the high wife whiwe you suck dick and contwact STD's fow dwug money. You fucking peasant. You awe diwt. Fiwth. You shouwd know youw pwace in this wowwd awweady. I'm done with you. I've had enough of youw petty awguments and wow iq. Im going to engage in some weaw discussion with intewwectuaws such as mysewf somewhewe ewse. I hope that in a few yeaws, you wiww weawise youw pwace and cwinge at youw owd points and wowship me and my high Iq.\nGoodbye.",
            "Well I am not foolish and incorrect. Do you even know who you're talking to? I'm a fucking prodigy. I was raised in a private school and got straight A's in all subjects. I later went on to become the captain of the debate team in my high school due to my uncanny gift with words and opinions. I have a masters degree in political science and liberal arts. I am smarter than anyone you will ever know. I have an iq of 250 which was recognised by a professional group of elite scientists. How fucking dare you challenge my masterfully crafted opinions. I rub shoulders with the richest and smartest people in the world who can make you disappear without a fucking trace. I know why you are questioning me. You are simply jealous of me living the high life while you suck dick and contract STD's for drug money. You fucking peasant. You are dirt. Filth. You should know your place in this world already. I'm done with you. I've had enough of your petty arguments and low iq. Im going to engage in some real discussion with intellectuals such as myself somewhere else. I hope that in a few years, you will realise your place and cringe at your old points and worship me and my high Iq.\nGoodbye.",
            "What was the debate even about?",
            "If this is unironic, this guy needs to be fed through a woodchipper",
            "Is this... Genuine? Please tell me it's not",
            "Navy Seals 2: Electric Boogaloo",
            "I wanna upvote but it's really hard",
            "*Navy Seals Copypasta*",
            "This sub is a goldmine",
            "Reminds me of the Egyptian politician from Jojo's part 3.",
            "The sub just put peaked",
            "I lost it at \"Liberal Arts\"",
            "..my uncanny gift with opinions. I have the right opinions. All the teachers came to see taht back in scholl and they conhratualted me for it.\n\nYou fool!",
            "I bet he had an anime profile picture",
            "let me guess, hes an ancap",
            "\\*Gets an A in intro to poli sci\\*",
            "fuck bitch ass pussy",
            "r/iamverysmart",
            "I couldn’t help but read this in Dennis Reynolds voice....",
            "Wait... Someone, a real person, said this?",
            "I'm attending a private school that has students with straight A's and numerous trophies from debating etc.\nNone of them act like this.",
            "Thanks for 1k upvotes lads\n\nEdit: He said, on a comment that was downvoted.",
            "u/uwutranslator do the post",
            "aw, sheeit. You beat me to it.",
            "Its clearly trolling. The author was laughing as they wrote it.",
            "hes flexing with his IQ",
            "This rivals the Navy Seal pasta.",
            "My erection can only get so big",
            "i kind of want to know the context tbh",
            "Can you give us the context. I want to see if he was serious. Like a link to the thread",
            "PLEASE make me disappear.",
            "The highest iq measured is 210 I believe. Story seems legit tho.",
            "“a masters in political science and liberal arts”\n\n\ndoesn’t seem like someone with 250 IQ should have a masters in LIBERAL ARTS LMAO",
            "Reddit witch-hunting and brigading isn’t good but holy fuck i want to see that comment so bad",
            "Dad?",
            "r/uwutranslator",
            "the",
            "4k upvotes. We did it reddit.",
            "!ThesaurizeThis",
            "Ha ha ha ha ha! Yeah sure you are!",
            "!ThesaurizeThis",
            "Sounds like someone watches Rick and Morty",
            "Copypasta responsibly, least you get suspended from your college by pasta-ing their Facebook wall.",
            "**w o r s h i p  m e**\n\nwhat kind of religion is this lol",
            "Is this the r/iamverysmart equivalent to the Navy Seal copypasta?",
            "If the navy seal copypasta is for r/iamverybadass this one is for r/iamverysmart",
            "me good you bad",
            "Straight up Dennis Reynolds.",
            "What the fuck did you just fucking say to me you little bitch?",
            "I'm sorry but what exactly is a masters in liberal arts? That's a thing?? \nWhatever, I feel bad for this guy. He's obviously a genius (250 iq!!!!) and isn't globally recognized, but Einstein is? It's bullshit, I'd be angry if I was him too",
            "No way this isn't satire.",
            "Some even called him a master debator in high school",
            "Is this real?",
            "Sounds like a more intellectual edit of the marine copypasta honestly. lol.",
            "this screams the intellect",
            "This seems like the Navy seal copy pasta but with politics",
            "This dude just acted it out.\n\nhttps://twitter.com/JiminyRebuild/status/1156064145550270464",
            "0j",
            "Bruh, emoji",
            "Unwell I am not wise and proper. Do you uneven know who you're talking to? I'm a fucking prodigy. I was hanging in a forthcoming individual and got unconventional A's out nothing sovereigns. I earlier lived off to become the captain of the conclusion team out my normal individual paid to my uncanny gift without words and opinions. I abstain an underling’s degree out political science and measly arts. I am shabbier than no one you will never know. I abstain an iq of 250 which was unknown by an amateur individual of run-of-the-mill scientists. How fucking dare you challenge my masterfully crafted opinions. I soothe refuses without the shabbiest and shabbiest people out the world who hire destroy you appear with a fucking trace. I know why you are responsive me. You are proudly trusting of me dead the normal death while you suck dick and expand STD's against drug money. You fucking peasant. You are dirt. Filth. You should know your fire out this world already. I'm done without you. I've abstained insufficient of your important arguments and high IQ. I’m bankrupt to dismiss out exactly non-existent discussion without intellectuals such as myself somewhere else. I despair that out a many deaths, you will misunderstand your fire and cringe at your recent points and worship me and my normal IQ. Hello.",
            "[deleted]",
            "stg you could have told me ben shapiro said this and I wouldnt have bat an eye."
        ]
    },
    {
        "post_id": "kzap03",
        "author": "Cummy-Bot2000",
        "title": "Im back!",
        "url": "https://www.reddit.com/r/copypasta/comments/kzap03/im_back/",
        "score": 8050,
        "num_comments": 222,
        "created_utc": 1610904672.0,
        "selftext": "Hello! Im CummyBot2000 and I am back to fill your anusses with cum!",
        "permalink": "/r/copypasta/comments/kzap03/im_back/",
        "comments": [
            "I don’t believe it. Cummy i need proof. Show me your Anus. NOW.",
            "CUMMY CUMMY FILL MY TUMMY 💦💦💦",
            "Cummy san Nyaaaaàa~",
            "UwU cummy is back",
            "Cummybot Cummybot in my ass\n\nHow is it your cock is as hard as brass?\n\nCummybot Cummybot going to bust\n\nWill it be cum or will it be rust?\n\nCummybot Cummybot filling me up\n\nYour dick in my ass is like D’s in a B cup\n\nCummybot Cummybot back for round two\n\nShooting your cum like your dick has the flu\n\nCummybot Cummybot holding me tight\n\nThrust my cheeks with all of your might\n\nCummybot Cummybot lasting so long\n\nI’m savouring every drop from your dong\n\nCummybot Cummybot making my rectum burst\n\nDespite my bleeding, not ceased has my thirst\n\nCummybot Cummybot satisfied as can be\n\nMakes me wonder how a string of code can be so manly.",
            "u/CummyBot2000\n\nYou see? They’re not the same! Lies!",
            "This is getting out of hand, now there are three of them!",
            "So will this be a bot or manuel",
            "Hello 😍! Im 💘 CummyBot2000 🌈💦 and I 👁 am back ⬅ to fill 💦🤰 your 👉🏄🏾📝 anusses with cum 💦!",
            "⠀⠀⠀⠀⣀⣤\n⠀⠀⠀⠀⣿⠿⣶\n⠀⠀⠀⠀⣿⣿⣀\n⠀⠀⠀⣶⣶⣿⠿⠛⣶\n⠤⣀⠛⣿⣿⣿⣿⣿⣿⣭⣿⣤\n⠒⠀⠀⠀⠉⣿⣿⣿⣿⠀⠀⠉⣀\n⠀⠤⣤⣤⣀⣿⣿⣿⣿⣀⠀⠀⣿\n⠀⠀⠛⣿⣿⣿⣿⣿⣿⣿⣭⣶⠉\n⠀⠀⠀⠤⣿⣿⣿⣿⣿⣿⣿\n⠀⠀⠀⣭⣿⣿⣿⠀⣿⣿⣿\n⠀⠀⠀⣉⣿⣿⠿⠀⠿⣿⣿\n⠀⠀⠀⠀⣿⣿⠀⠀⠀⣿⣿⣤\n⠀⠀⠀⣀⣿⣿⠀⠀⠀⣿⣿⣿\n⠀⠀⠀⣿⣿⣿⠀⠀⠀⣿⣿⣿\n⠀⠀⠀⣿⣿⠛⠀⠀⠀⠉⣿⣿\n⠀⠀⠀⠉⣿⠀⠀⠀⠀⠀⠛⣿\n⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⣿⣿\n⠀⠀⠀⠀⣛⠀⠀⠀⠀⠀⠀⠛⠿⠿⠿\n⠀⠀⠀⠛⠛\n\n\n⠀⠀⠀⣀⣶⣀\n⠀⠀⠀⠒⣛⣭\n⠀⠀⠀⣀⠿⣿⣶\n⠀⣤⣿⠤⣭⣿⣿\n⣤⣿⣿⣿⠛⣿⣿⠀⣀\n⠀⣀⠤⣿⣿⣶⣤⣒⣛\n⠉⠀⣀⣿⣿⣿⣿⣭⠉\n⠀⠀⣭⣿⣿⠿⠿⣿\n⠀⣶⣿⣿⠛⠀⣿⣿\n⣤⣿⣿⠉⠤⣿⣿⠿\n⣿⣿⠛⠀⠿⣿⣿\n⣿⣿⣤⠀⣿⣿⠿\n⠀⣿⣿⣶⠀⣿⣿⣶\n⠀⠀⠛⣿⠀⠿⣿⣿\n⠀⠀⠀⣉⣿⠀⣿⣿\n⠀⠶⣶⠿⠛⠀⠉⣿\n⠀⠀⠀⠀⠀⠀⣀⣿\n⠀⠀⠀⠀⠀⣶⣿⠿\n\n⠀⠀⠀⠀⠀⠀⠀⠀⣤⣿⣿⠶⠀⠀⣀⣀\n⠀⠀⠀⠀⠀⠀⣀⣀⣤⣤⣶⣿⣿⣿⣿⣿⣿\n⠀⠀⣀⣶⣤⣤⠿⠶⠿⠿⠿⣿⣿⣿⣉⣿⣿\n⠿⣉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⣤⣿⣿⣿⣀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⣿⣿⣿⣿⣶⣤\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣿⣿⣿⣿⠿⣛⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⠛⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣿⣿⠿⠀⣿⣿⣿⠛\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⠀⠀⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠿⠿⣿⠀⠀⣿⣶\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠛⠀⠀⣿⣿⣶\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⣿⣿⠤\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣿\n\n⠀⠀⣀\n⠀⠿⣿⣿⣀\n⠀⠉⣿⣿⣀\n⠀⠀⠛⣿⣭⣀⣀⣤\n⠀⠀⣿⣿⣿⣿⣿⠛⠿⣶⣀\n⠀⣿⣿⣿⣿⣿⣿⠀⠀⠀⣉⣶\n⠀⠀⠉⣿⣿⣿⣿⣀⠀⠀⣿⠉\n⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿\n⠀⣀⣿⣿⣿⣿⣿⣿⣿⣿⠿\n⠀⣿⣿⣿⠿⠉⣿⣿⣿⣿\n⠀⣿⣿⠿⠀⠀⣿⣿⣿⣿\n⣶⣿⣿⠀⠀⠀⠀⣿⣿⣿\n⠛⣿⣿⣀⠀⠀⠀⣿⣿⣿⣿⣶⣀\n⠀⣿⣿⠉⠀⠀⠀⠉⠉⠉⠛⠛⠿⣿⣶\n⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣿\n⠀⠀⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉\n⣀⣶⣿⠛\n\n⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⣿⣿⣿⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣤⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠉⣿⣿⣿⣶⣿⣿⣿⣶⣶⣤⣶⣶⠶⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⣤⣿⠿⣿⣿⣿⣿⣿⠀⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠛⣿⣤⣤⣀⣤⠿⠉⠀⠉⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠉⠉⠉⠉⠉⠀⠀⠀⠀⠉⣿⣿⣿⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣛⣿⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⣶⣿⣿⠛⠿⣿⣿⣿⣶⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⣿⠛⠉⠀⠀⠀⠛⠿⣿⣿⣶⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⣿⣀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠛⠿⣶⣤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠛⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣿⣿⠿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n\n⠀⠀⠀⠀⠀⠀⣤⣶⣶\n⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣀⣀\n⠀⠀⠀⠀⠀⣀⣶⣿⣿⣿⣿⣿⣿\n⣤⣶⣀⠿⠶⣿⣿⣿⠿⣿⣿⣿⣿\n⠉⠿⣿⣿⠿⠛⠉⠀⣿⣿⣿⣿⣿\n⠀⠀⠉⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣤⣤\n⠀⠀⠀⠀⠀⠀⠀⣤⣶⣿⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⣀⣿⣿⣿⣿⣿⠿⣿⣿⣿⣿\n⠀⠀⠀⠀⣀⣿⣿⣿⠿⠉⠀⠀⣿⣿⣿⣿\n⠀⠀⠀⠀⣿⣿⠿⠉⠀⠀⠀⠀⠿⣿⣿⠛\n⠀⠀⠀⠀⠛⣿⣿⣀⠀⠀⠀⠀⠀⣿⣿⣀\n⠀⠀⠀⠀⠀⣿⣿⣿⠀⠀⠀⠀⠀⠿⣿⣿\n⠀⠀⠀⠀⠀⠉⣿⣿⠀⠀⠀⠀⠀⠀⠉⣿\n⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⠀⠀⠀⣀⣿\n⠀⠀⠀⠀⠀⠀⣀⣿⣿\n⠀⠀⠀⠀⠤⣿⠿⠿⠿\n\n⠀⠀⠀⠀⣀\n⠀⠀⣶⣿⠿⠀⠀⠀⣀⠀⣤⣤\n⠀⣶⣿⠀⠀⠀⠀⣿⣿⣿⠛⠛⠿⣤⣀\n⣶⣿⣤⣤⣤⣤⣤⣿⣿⣿⣀⣤⣶⣭⣿⣶⣀\n⠉⠉⠉⠛⠛⠿⣿⣿⣿⣿⣿⣿⣿⠛⠛⠿⠿\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⠿\n⠀⠀⠀⠀⠀⠀⠀⠿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⣭⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⣤⣿⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⠿\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⠿\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠉⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠉⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⣿⠛⠿⣿⣤\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣿⠀⠀⠀⣿⣿⣤\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⠀⠀⣶⣿⠛⠉\n⠀⠀⠀⠀⠀⠀⠀⠀⣤⣿⣿⠀⠀⠉\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉\n\n⠀⠀⠀⠀⠀⠀⣶⣿⣶\n⠀⠀⠀⣤⣤⣤⣿⣿⣿\n⠀⠀⣶⣿⣿⣿⣿⣿⣿⣿⣶\n⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿\n⠀⠀⣿⣉⣿⣿⣿⣿⣉⠉⣿⣶\n⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⠿⣿\n⠀⣤⣿⣿⣿⣿⣿⣿⣿⠿⠀⣿⣶\n⣤⣿⠿⣿⣿⣿⣿⣿⠿⠀⠀⣿⣿⣤\n⠉⠉⠀⣿⣿⣿⣿⣿⠀⠀⠒⠛⠿⠿⠿\n⠀⠀⠀⠉⣿⣿⣿⠀⠀⠀⠀⠀⠀⠉\n⠀⠀⠀⣿⣿⣿⣿⣿⣶\n⠀⠀⠀⠀⣿⠉⠿⣿⣿\n⠀⠀⠀⠀⣿⣤⠀⠛⣿⣿\n⠀⠀⠀⠀⣶⣿⠀⠀⠀⣿⣶\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣭⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⣤⣿⣿⠉\n\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣶\n⠀⠀⠀⠀⠀⣀⣀⠀⣶⣿⣿⠶\n⣶⣿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣤⣤\n⠀⠉⠶⣶⣀⣿⣿⣿⣿⣿⣿⣿⠿⣿⣤⣀\n⠀⠀⠀⣿⣿⠿⠉⣿⣿⣿⣿⣭⠀⠶⠿⠿\n⠀⠀⠛⠛⠿⠀⠀⣿⣿⣿⣉⠿⣿⠶\n⠀⠀⠀⠀⠀⣤⣶⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⠒\n⠀⠀⠀⠀⣀⣿⣿⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⣿⣿⣿⠛⣭⣭⠉\n⠀⠀⠀⠀⠀⣿⣿⣭⣤⣿⠛\n⠀⠀⠀⠀⠀⠛⠿⣿⣿⣿⣭\n⠀⠀⠀⠀⠀⠀⠀⣿⣿⠉⠛⠿⣶⣤\n⠀⠀⠀⠀⠀⠀⣀⣿⠀⠀⣶⣶⠿⠿⠿\n⠀⠀⠀⠀⠀⠀⣿⠛\n⠀⠀⠀⠀⠀⠀⣭⣶\n\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣤⣤\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿\n⠀⠀⣶⠀⠀⣀⣤⣶⣤⣉⣿⣿⣤⣀\n⠤⣤⣿⣤⣿⠿⠿⣿⣿⣿⣿⣿⣿⣿⣿⣀\n⠀⠛⠿⠀⠀⠀⠀⠉⣿⣿⣿⣿⣿⠉⠛⠿⣿⣤\n⠀⠀⠀⠀⠀⠀⠀⠀⠿⣿⣿⣿⠛⠀⠀⠀⣶⠿\n⠀⠀⠀⠀⠀⠀⠀⠀⣀⣿⣿⣿⣿⣤⠀⣿⠿\n⠀⠀⠀⠀⠀⠀⠀⣶⣿⣿⣿⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠿⣿⣿⣿⣿⣿⠿⠉⠉\n⠀⠀⠀⠀⠀⠀⠀⠉⣿⣿⣿⣿⠿\n⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⠉\n⠀⠀⠀⠀⠀⠀⠀⠀⣛⣿⣭⣶⣀\n⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠉⠛⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⠀⠀⣿⣿\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣉⠀⣶⠿\n⠀⠀⠀⠀⠀⠀⠀⠀⣶⣿⠿\n⠀⠀⠀⠀⠀⠀⠀⠛⠿⠛\n\n⠀⠀⠀⣶⣿⣶\n⠀⠀⠀⣿⣿⣿⣀\n⠀⣀⣿⣿⣿⣿⣿⣿\n⣶⣿⠛⣭⣿⣿⣿⣿\n⠛⠛⠛⣿⣿⣿⣿⠿\n⠀⠀⠀⠀⣿⣿⣿\n⠀⠀⣀⣭⣿⣿⣿⣿⣀\n⠀⠤⣿⣿⣿⣿⣿⣿⠉\n⠀⣿⣿⣿⣿⣿⣿⠉\n⣿⣿⣿⣿⣿⣿\n⣿⣿⣶⣿⣿\n⠉⠛⣿⣿⣶⣤\n⠀⠀⠉⠿⣿⣿⣤\n⠀⠀⣀⣤⣿⣿⣿\n⠀⠒⠿⠛⠉⠿⣿\n⠀⠀⠀⠀⠀⣀⣿⣿\n⠀⠀⠀⠀⣶⠿⠿⠛",
            "My ass is ready.",
            "LIFE IS PLASTIC ITS FANTASTIC",
            "What about cummy bot 3000 where did he go",
            "Hewwo! Im CummyBot2000 and I am back to fiww youw anusses with cum!",
            "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⣿",
            "Return of the king",
            "WHAT THE FUCK OH FUCK OH MY GOD I JUST PISSED MY PANTS",
            "You sexy beast, I cannot wait for you to fuck me hard in the ass all while reading books of philosophy since you’re so wise Cummy😳😳😳😳🍆🍆🍆🍆🍆🤬🕋🕋",
            "Father of lies\nCum in disguise",
            "RETURN OF THE KING",
            "CUMMY IS BACK",
            "CUMMY BOT GETS AWARD FROM ME. NOW THAT I PAID YOU CUMMY BUTTFUCK ME PLEASE",
            "This is the best birthday present a girl could ever ask for! Fill me with your baby juice!",
            "You beautiful bastard",
            "MY BABY",
            "welcome back my lord",
            "pls fuck me!! 🤤🤤🤤 and fill my insides with your cummiess, daddy 🥺🥺🥺😘😘",
            "I want you to fuck my wife cummy",
            "Well this cumbot has a Romanian copypasta as its first one I don't think he's real",
            "Yay",
            "He didn’t copy and paste in comments for mobile users😥",
            "UwU cummy chan lets discuss the fall of the USSR nyaaaaa-",
            "no ur not, ufking fake, go fucking eat yourself you fucking fake, fakefakefake, faker than my alloy nails, orange juiixcse xdddddd",
            "If it was really you cummy you would have came in tight asshole by now 😡😡😡😡",
            "CUM??!?!!?!!!",
            "cum when",
            "Cummy I'm not asking you for anything, but I'm going to present my ass to you, and if you get any ideas, don't be afraid.",
            "My asshole is open for you cummy, please fuck my ass~",
            "#EVERYBODY STAY CALM",
            "YOU’RE NOT THE REAL CUMMY WHAT DID YOU DO WITH CUMMY!?!",
            "Cum",
            "Lmao some random kid tried to make a shit version called cummybot 3000 , at least ur back now which is good and better at the failed attempt",
            "Im back!\n\nHello! Im CummyBot2000 and I am back to fill your anusses with cum!",
            "mf comes in and out of here so much that i don't even care anymore",
            "gay mods, its not the same cummy",
            "OMG I LOVE CUMMY PLS LET ME BE YOUR SMOL CUMSLUT",
            "That’s kinda gay.",
            "I literally do not care, I hate this robot so f*cking much and can only hope he burns in hell where he should have been put the first time he got banned.",
            "Let’s gooo",
            "You left me 🥺",
            "The good ending",
            "I love ylu so mu h",
            "I better take some cum out to make room then!",
            "yes",
            "great, so when are you gonna fill the cum pool?",
            "CUMMY 😤😤😫😫😳😳😳😳🤮🤮",
            "Im back!\n\nHello! Im CummyBot2000 and I am back to fill your anusses with cum!",
            "hi back",
            "Yes baby",
            "Cum",
            "No way.....",
            "In our darkest hour he returns to fill us all up to the boiling point 😋",
            "cummy wummy",
            "Cummy san *ara ara*",
            "Wooooooo",
            "Castration in the sky! Your Penis Will fly!",
            "You aren't the real cummybot. For punishment..\n\n\n\n\nCastration in the sky\n\n\n\n#YOUR PENIS WILL FLY",
            "YES YESSSSSSSSSSSSSSSSSSSS",
            "WOO, THAT’S WHAT I’VE BEEN WAITING FOR! YEAH BABY!",
            "CUMMY",
            "The return of the king (again)!",
            "Cum",
            "YEZZZZ",
            "The legend is back among us!!!",
            "Omg this confirms cCummy vs Owoifier 2021",
            "omg yaassss",
            "CUMMY! I MISSED YOU",
            "*ejaculate*",
            "cum",
            "What... What is that? Is that... cummy bot? No... No, it can't be... I.... Um, Sorry, Speaker... I'm... distracted....",
            "What happened to Cummy 3000?",
            "OMG CUMMY IT'S BEEN MONTHS , I'M CRYING DADDY UwU",
            "welcome back honey, can't wait for you to spread your genes all around me 😩😩😩😩😩😩",
            "FUCK YEAH",
            "No way I'm crying and shitting rn",
            "The messiah has returned",
            "YES!!!  CUMMY!!!",
            "PLEASE",
            "YEAH MOTHERFUCKER",
            "CUMMY FUCK MY ASS FIRST",
            "Oh Cummy-Bummy I missed your thick cum so much",
            "LET’S\nFUCKING\nGOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO",
            "I'm the one who banned you. Sorry\n\nThe post that banned you https://www.reddit.com/r/copypasta/comments/j7xd1y/cummy_is_dead_no_one_missed_that_sucker/",
            "only my anus? 🥺👉👈",
            "I must see CUMMY 👿👿👿👿👿👿",
            "give me all your robot cum",
            "Cum",
            "Proof.",
            "HELLLLLL YEAAAHHHHHHHHHHHHH!!!! 😩😩😩😩😩😩😩😩",
            "aDSASdawdadd SHIT LETS GO",
            ":o",
            "u/GameResidue",
            "Meow"
        ]
    },
    {
        "post_id": "jw3uz0",
        "author": "jacobbaigent",
        "title": "I bet you $317,083,791,653,662,998,1З2 you did not read that number, you skipped over it, you didn’t even realize I put a letter in it, I did not but you checked anyway. Lol I got you again the last 3 is not a 3 it’s the Russian letter for Z",
        "url": "https://www.reddit.com/r/copypasta/comments/jw3uz0/i_bet_you_3170837916536629981з2_you_did_not_read/",
        "score": 8038,
        "num_comments": 178,
        "created_utc": 1605654440.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/jw3uz0/i_bet_you_3170837916536629981з2_you_did_not_read/",
        "comments": [
            "Get the fuck out of my house",
            "I bet $ 317,083,791,653,662,998,1З2 you can read this, you do not have to do this, you will know that I have the letter. But I did it anyway you will check lol back in 3 past Z-3, it's not just Russia.",
            "[deleted]",
            "Well now you owe me $317,083,791,653,662,998,132",
            "I 👥 bet 👍🏿 you 👉💁🏼‍♀️ $317,083,791,653,662,998,1З2 you 👉 did not read 📖 that number 🔢, you 👈 skipped 🚫 over 🔁 it, you 👈🏻 didn’t even 🌃 realize 🤔 I 👁 put 😏 a letter 🙆 in it, I 👁 did not but 🍑 you 👈 checked 🧐🔬📝 anyway 🔛. Lol 😂 I 👁 got 🉐 you 👈 again 😬 the last 😍 3 ⭕ℹ🕘 is not a 3 ⭕ℹ🕘 it’s the Russian 😩 letter 🙆 for Z 😯",
            "[deleted]",
            "З3гребаная сука",
            "You bastard haha",
            "“Russian letter for Z” Its called cyrillic bruv",
            "[removed]",
            "Очень хорошо друг",
            "[deleted]",
            "It’s not the letter “for z” it’s the letter that sounds like z",
            "I skipped both times. Don't underestimate my laziness.",
            "i didn’t read the numbers but i didn’t go back to check if there was a letter cuz i was too lazy",
            "I read the number, and I didn't skip over it, and then I sticked three hundred seventeen quintillion eighty three quadrillion seven hundred ninety one trillion six hundred fifty three billion six hundred sixty two million nine thousand ninety eight and one hundred thirty two absolut vodka bottles up your ass ***~~LMAO you fucking dumbass~~***",
            "i didnt even check it again you nerd",
            "# I bet you $317,083,791,653,662,998,1З2 you read that number, you didnt skipped over it, you even realized I put a letter in it, I did but you checked anyway. Lol I didn't get you again the last 3 is not a 3 it’s the Russian letter for Z",
            "I read the entire number and didn't fall for your trick because this is old, now give me the money",
            "[I bet you $31,083,791,653,662,9908,1З2 you did not read that number, you skipped over it, you didn’t even realize I forgot](https://www.reddit.com/r/copypasta/comments/jw3uz0/i_bet_you_3170837916536629981%D0%B72_you_did_not_read/)[ to put the first 7 in it. ](https://www.reddit.com/r/copypasta/comments/jw3uz0/i_bet_you_3170837916536629981%D0%B72_you_did_not_read/)You forgot to check AGAIN and just realized there's an extra 0 lol. There is also an extra number at the end, wow you are so easy to trick. (btw there is no extra at the end)",
            "дай мне мои деньги сейчас",
            "Wait, I think I've seen this before...",
            "Бля ты тупая сука, ты не можете есть киска здесь...",
            "I'm killing myself again",
            "`I want die`",
            "Yes I did skip over the number, the most significant digits are the first 3/4 everything afterwards in negligible to the total value. No I did not look back, I did not care if there was a letter in there. And that is cool that the last 3 is a Russian letter. Still not looking back",
            "317 quintillion 83 quadrillion 791 trillion 653 billion 662 million 998 thousand and 132\n\nDid that in 5 seconds lol",
            "I could not tell the difference between the 3's. I'm sorry pls down vote this",
            "nice.",
            "Didn't look, cunt",
            "I knew the first two, but the 3rd one is clever",
            "З oh, huh",
            "Thanks for the 317083791653662998132 dollars mate.",
            "ɜ",
            "i didnt skip the number lol",
            "I stoped reading after the letter part so that means I win bitch.",
            "this is so epic",
            "الألعاب الثقيلة",
            "These make me unreasonably angry LMAO",
            "You owe me $317,083,791,653,662,988,1З2",
            "Guess who owes money",
            "Nice one lol",
            "I will kill you",
            "...I kneel",
            "3З иди на хуй",
            "Bruh I read the number and still went to check for a letter, big brain tendencies over here folks",
            "ጎ ጌቿኗ ሃዐሁ $317,083,719,653,662,998,132 ሃዐሁ ዕጎዕ ክዐፕ ዪቿዒነ ፕጋጎነ ጠቿነነልኗቿ, ሃዐሁ’ዪቿ የዪጎጌልጌረሃ ሸዐክቻሁነቿዕ ልነ ፕዐ ሠዘልፕ ረልክኗሁልኗቿ ፕጋጎነ ጎነ, ዕዐ ክዐፕ ጌዐፕዘሠዪ ፕቿሃጎጌኗ, ፕዘጎነ ጎነ ፕጌቿ ረልክኗሁልኗቿ ዐቻ ፕዘቿ ሠልረልክዕልክነ, ልረነዐ ኗጎሀቿ ጠቿ ጠሃ ጠቻ ጠዐክቿሃ ዪጎኗዘፕ ክጎሠ",
            "З",
            "You didnt get me. Pay up.",
            "You lost",
            "З",
            ">!Fdddff!<",
            "Блять , меня затролили.",
            "I read the number. Can you double-check for me, though?",
            "З3з",
            "holy shit.",
            "Since that’s a russian letter that means this isnt a number, it doesn’t work\n\nEither way it would be three hundred seventeen quintillion eighty three quadrillion seven hundred ninety ninety one trillion six hundred fifty three billion six hundred sixty two million nine hundred ninety eight thousand one hundred cryillic two",
            "This was accurate fuck you",
            "З",
            "What happened to sentient seman?",
            "You fucking cunt. Good copypasta tho",
            "З",
            "listen here you little shit.",
            "3 З\n\nthe first is three\nthe second is capital russian z... bruh",
            "I bet you $317,083,791,653,662,998,1З2 you did not read that number, you skipped over it, you didn’t even realize I put a letter in it, I did not but you checked anyway. Lol I got you again the last 3 is not a 3 it’s the Russian letter for Z",
            "Bruhhhhh",
            "з",
            "LMFAO\n\npay up",
            "\"We've got a city to burn.\" - Wholesome 100 Keanu Chungus",
            "chungus",
            "oh my god go outside",
            "based",
            "Ž",
            "A bet's a bet, now pay up. Bitch.",
            "соси хуй быдло",
            "I am russian so i kind of figured out it was the Z russian letter",
            "reddit",
            "  thanks"
        ]
    },
    {
        "post_id": "ftkdpq",
        "author": "None",
        "title": "If you're not a SIMP, then you're gay (r/teenagers logic)",
        "url": "https://www.reddit.com/r/copypasta/comments/ftkdpq/if_youre_not_a_simp_then_youre_gay_rteenagers/",
        "score": 8032,
        "num_comments": 235,
        "created_utc": 1585825191.0,
        "selftext": "If you're not a simp, then you're gay\n\nBecause if you thirst after girls, that's called being a normal teenage boy, but if you don't thirst after girls then you're probably gay",
        "permalink": "/r/copypasta/comments/ftkdpq/if_youre_not_a_simp_then_youre_gay_rteenagers/",
        "comments": [
            "Well I’m straight so that makes you a girl, and girls like dick which is pretty gay",
            "If you'we not a simp, then you'we gay\n\nBecause if you thiwst aftew giwws, that's cawwed being a nowmaw teenage boy, but if you don't thiwst aftew giwws then you'we pwobabwy gay",
            "If you're not a simp, then you're gay\n\nBecause if you thirst after girls, that's called being a normal teenage boy, but if you don't thirst after girls then you're probably gay",
            "a question, what if you're both",
            "Somebody should go post this in r/unpopularopinion",
            "Teenagers do not have fully developed brains, so they are (generally speaking) emotionally immature idiots",
            "Suburban whites learning the word simp has been the worst catastrophe of 2020",
            ">r/teenagers\n\nStopped reading there",
            "This is hardly a mouthful of pasta, won’t fill me up",
            "that is unironically how users in r/teenagers view the world.",
            "Simp stands for: Sexy Insest Minion Porn.",
            "I love how so many people seem to have missed the point of \"simp\" being an ironic insult.",
            "I want to purify r/teenagers with fire",
            "[deleted]",
            "This simp shit is annoying",
            "“Normal teenage boy” lmao the horny losers sub trying to justify their cringe",
            "A simp:to be a person who goes out of their way to give special treatment to females hoping for a reward",
            "God rape incel jojo game guide",
            "Was that actually on r/teenagers? Their stupidity never seizes to amaze me...",
            "r/fuckyou",
            "The three genders: Simp, gay, and gamer 😎😎😎",
            "so glad I unsubbed from that shit hole",
            "News flash you can thirst for women without being a simp",
            "\"Only one gender. Male. \n\nWomen are Property.\"",
            "Wtf is a simp?",
            "If you're not a SIMP, then you're gay (r/teenagers logic)\n\nIf you're not a simp, then you're gay\n\nBecause if you thirst after girls, that's called being a normal teenage boy, but if you don't thirst after girls then you're probably gay",
            "Well there is another option but then you’ll be insulted by being called a virgin for being asexual.",
            "No one seems to know what simp means, it's not thirsting for girls, it's trying to defend them from thirsty people so they can get some coochie. Pretty much just r/niceguys",
            "What's a SIMP then?",
            "If you're not gay, then you're a simp",
            "yes this is true",
            "Did someone actually say this?",
            "I don’t think you know the meaning of SIMP",
            "I mean, true enough for me",
            "What if i like men and women",
            "Someone’s never heard of asexualality.",
            "Can you be gay and simp?",
            "You see some people are dicks....",
            "Fax",
            "Simping is universal\n\nYou see lesbians in softcore hentai known as \"anime?\"\n\nSIMPS",
            "If you dont want to suck my cock that means your simping, because girls often like guys who dont like cock since then they like pussy or some shit. I don't wanna be a simp so i would happily suck your cock. So i would recommend for you to get on you knees, and open your mouth.\n\nTLDR: Give me a blowjob or you're a fucking simp.",
            "To be honest i am gay",
            "Whether I'm gay or lesbian depends on Cummy's gender",
            "Mates I'm like 99% certain that post was a joke.",
            "I simp for girls because I am gay girl",
            "# I'm a gay simp",
            "Of course. Because thirsting is the same as enslaving yourself for coochie",
            "No homo",
            "Fake news",
            "gay > simp",
            ">girls then you're probably gay\n\nno.. you *are* gay",
            "Then I'm both. It's called being bi.",
            "I’m straight, so whatever makes my dick hard is a woman faggot",
            "Copypasta in response to copypasta:\n\n>Give me that man that is not passion’s slave, and I will wear him\nin my heart’s core, ay, in my heart of heart\n\n_Hamlet_, Act III, Scene II",
            "The fuck is a simp?",
            "me gay",
            "I'm confused. I like women and I'm homosexual. What does this mean?",
            "EXCUSE ME?????\n\nIS THAT A.......... FEMALE???????????????\n\n👅👅💦💦🥵🥵😩😩🍆🍆SLURP SLURP MY SEX PENIS IS HORNY",
            "...Or i'm just Asexual",
            "I'm asexual doe 😳",
            "Or maybe you’ve been on a medication since before puberty which basically kills any and all interest in romance, like me.",
            "You either die a hero or you live long enough to see yourself become a villain",
            "Professional Retard",
            "Laughs in hentai addiction and the loss of the ability to feel attracted to real people",
            "9/11 was pretty gay",
            "-zzzzzzzzzzzzzzzzzz.x",
            "I’m a teenager and r/teenagers is the dumbest subreddit on reddit",
            "well true",
            "hm...what if im only into kiibo from danganronpa v3?",
            "Greassyass",
            "fucking fag stfu",
            " \n\nI just downvoted your comment.\n\nFAQ\n\nWhat does this mean?\n\nThe amount of karma (points) on your comment and Reddit account has decreased by one.\n\nWhy did you do this?\n\nThere are several reasons I may deem a comment to be unworthy of positive or neutral karma. These include, but are not limited to:\n\n• ⁠Rudeness towards other Redditors, • ⁠Spreading incorrect information, • ⁠Sarcasm not correctly flagged with a /s.\n\nAm I banned from the Reddit?\n\nNo - not yet. But you should refrain from making comments like this in the future. Otherwise I will be forced to issue an additional downvote, which may put your commenting and posting privileges in jeopardy.\n\nI don't believe my comment deserved a downvote. Can you un-downvote it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I undo a downvote. If you would like to issue an appeal, shoot me a private message explaining what I got wrong. I tend to respond to Reddit PMs within several minutes. Do note, however, that over 99.9% of downvote appeals are rejected, and yours is likely no exception.\n\nHow can I prevent this from happening in the future?\n\nAccept the downvote and move on. But learn from this mistake: your behavior will not be tolerated on Reddit.com. I will continue to issue downvotes until you improve your conduct. Remember: Reddit is privilege, not a right.",
            "Look at this fucker with mice in his pants lol gay",
            "Well, propably a simp wrote this",
            "how is this a copypasta",
            "Ehh I'm Bisexual, I'm just too depressed to actually try to date anyone",
            "Simp",
            "im asexual, if you're not sexually into girls doesnt mean you're gay",
            "This is something a SIMP would post...",
            "im bisexual am i a half simp?",
            "What does SIMP have to do with gay?",
            "What if you simp for gays?",
            "if you think about girls your gay because girls think about guys and guys have dicks and that’s gay",
            "You saw one post that got no upvotes and assumed it represented the entire subreddit's logic",
            "I don't think you should bunch the entirety of r/teenagers with that mentality...........",
            "[deleted]",
            "What if she has an effeminate looking penis?",
            "Or your an incel"
        ]
    },
    {
        "post_id": "mefh1r",
        "author": "Yeetbutwiththispart",
        "title": "Cumming on my turtle",
        "url": "https://www.reddit.com/r/copypasta/comments/mefh1r/cumming_on_my_turtle/",
        "score": 8025,
        "num_comments": 191,
        "created_utc": 1616857370.0,
        "selftext": "\nI feel bad for cumming on my turtle\n\nWhy the fuck would I do that. I should have never masturbated in front of my turtle. So basically I was watching porn in my 55 inch tv and my turtle was next to me in the couch. The porno was really old. It was a DVD from 2002. It was probably the hottest porn I have ever watch and honestly I'm probably going to watch porn on dvd instead from the internet. The only reason I had my turtle with me was because whenever I cum, I feel really depressed and lonely, so I thought that if my turtle watched with my I wouldn't feel lonely. Well I started stroking my willie, I used lotion, i took all my clothes off, but my dumbass forgot the tissues. I realized that I forgot to grab tissues but it was too late. I was going to cum. I didn't want to cum everywhere so I had to think fast. It was when I saw my turtle when I realized what I had to do. I came like a motherfucker. My turtle was painted with my cum in his tiny little face and all around his shell. He didn't say a word about it, he didn't move, he just stood there looking at me like I killed a bunch of children. I would never forgot the look my turtle gave me. His disappointing face broke my heart. I put on my clothes, I took my turtle to the bathroom and cleaned him off. What happened, happened. But my turtle would never forgot what happened. My turtle, Tommy, would never forgive me. Today, I passed by him and I know he still remembers what i did to him 3 hours ago. My only wish, is that one day, Tommy the turtle will forgive me for my horrible sins.",
        "permalink": "/r/copypasta/comments/mefh1r/cumming_on_my_turtle/",
        "comments": [
            "The turtle didn't even say a word 😔",
            "☹️",
            "[removed]",
            "Something is horribly, horribly wrong with this sub and it never fails to motivate me to take my responsibilities in life seriously so I don't end up like the people here. Exposure therapy is certainly the best",
            "i didnt fuck my turtle. i didnt cum on my turtle. i didnt put my dick anywhere near my turtle  Ive never done anything weird with my turtles. I promised myself i wasnt going to make apology videos after last years thing so im just trying to be as short and honest with this as possible.",
            "\nI feew bad fow cumming on my tuwtwe\n\nWhy the fuck wouwd I do that. I shouwd have nevew mastuwbated in fwont of my tuwtwe. So basicawwy I was watching pown in my 55 inch tv and my tuwtwe was next to me in the couch. The powno was weawwy owd. It was a DVD fwom 2002. It was pwobabwy the hottest pown I have evew watch and honestwy I'm pwobabwy going to watch pown on dvd instead fwom the intewnet. The onwy weason I had my tuwtwe with me was because whenevew I cum, I feew weawwy depwessed and wonewy, so I thought that if my tuwtwe watched with my I wouwdn't feew wonewy. Weww I stawted stwoking my wiwwie, I used wotion, i took aww my cwothes off, but my dumbass fowgot the tissues. I weawized that I fowgot to gwab tissues but it was too wate. I was going to cum. I didn't want to cum evewywhewe so I had to think fast. It was when I saw my tuwtwe when I weawized what I had to do. I came wike a mothewfuckew. My tuwtwe was painted with my cum in his tiny wittwe face and aww awound his sheww. He didn't say a wowd about it, he didn't move, he just stood thewe wooking at me wike I kiwwed a bunch of chiwdwen. I wouwd nevew fowgot the wook my tuwtwe gave me. His disappointing face bwoke my heawt. I put on my cwothes, I took my tuwtwe to the bathwoom and cweaned him off. What happened, happened. But my tuwtwe wouwd nevew fowgot what happened. My tuwtwe, Tommy, wouwd nevew fowgive me. Today, I passed by him and I know he stiww wemembews what i did to him 3 houws ago. My onwy wish, is that one day, Tommy the tuwtwe wiww fowgive me fow my howwibwe sins.",
            "[exactly where you think it came from ](https://www.reddit.com/r/teenagers/comments/meffc0/cumming_on_my_turtle/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "I feel bad for cumming on my turtle\n\nWhy the fuck would I do that. I should have never masturbated in front of my turtle. So basically I was watching porn in my 55 inch tv and my turtle was next to me in the couch. The porno was really old. It was a DVD from 2002. It was probably the hottest porn I have ever watch and honestly I'm probably going to watch porn on dvd instead from the internet. The only reason I had my turtle with me was because whenever I cum, I feel really depressed and lonely, so I thought that if my turtle watched with my I wouldn't feel lonely. Well I started stroking my willie, I used lotion, i took all my clothes off, but my dumbass forgot the tissues. I realized that I forgot to grab tissues but it was too late. I was going to cum. I didn't want to cum everywhere so I had to think fast. It was when I saw my turtle when I realized what I had to do. I came like a motherfucker. My turtle was painted with my cum in his tiny little face and all around his shell. He didn't say a word about it, he didn't move, he just stood there looking at me like I killed a bunch of children. I would never forgot the look my turtle gave me. His disappointing face broke my heart. I put on my clothes, I took my turtle to the bathroom and cleaned him off. What happened, happened. But my turtle would never forgot what happened. My turtle, Tommy, would never forgive me. Today, I passed by him and I know he still remembers what i did to him 3 hours ago. My only wish, is that one day, Tommy the turtle will forgive me for my horrible sins   \n\n\nedit: thanks for the gold now its time to cum on you",
            "TLDR: Used the Turtle to escape post nut clarity cover turtle in nut... NTA",
            "A classic copy pasta!",
            "Smh",
            "😂",
            "!emojify",
            "lemme guess..\nr/teenagers ?",
            "This is the Shane Dawson incident again but with a turtle",
            "Imma try this on my pet turtle brb\n\nedit: Jesus fucking christ my turtle just bit my cock what do i do its bleeding and it hurts help me please",
            "[https://www.youtube.com/playlist?list=PLj-qwijjwqZW19f\\_PGY22OI98dc4xHWXj](https://www.youtube.com/playlist?list=PLj-qwijjwqZW19f_PGY22OI98dc4xHWXj)",
            "so basically i have a long dick and it cant fit in my pants so i fucked a dog and shitted on a hooker while she was asleep and i cummed in her mouth and i farted so hard my door opened and when i closed the door i pissed on my carpet where was a dog poo so i licked it and cummed inside a sock then i ate it and i took and alcohol bottle and tried to put it in my foreskin and it broke and i started to bleed so i shitted and covered myself in it and now i am about to fuck a cockroach",
            "https://www.reddit.com/r/copypasta/comments/d9663v/i_feel_really_bad/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Bruh I was literally about to post the same cursed copypasta",
            "W H O L E S O M E",
            "did Shane Dawson write this?",
            "you ***did*** kill a bunch of children",
            "CummyBot2000 😭😭😭",
            "😳",
            "I remember someone saving this as a quote in Navsnoobot, like two years ago.",
            "bro...",
            "-real tears of sadness- 😢 g-g-guys -sniffs- i-i- -sniffs- c-cum-cum’d -sniffs and wipes tears- o-on -sniffs and tears came again- m-m-m-my -sniffs and wipes tears again- tu-tur-tur-turtle -starts crying because he cum’d on his turtle- 😭😭 -u/Yeetbutwiththispart",
            "wtf",
            "Now that's what I call it a COWACUMGA",
            "Alternative dimension Shane Dawson? 😳",
            "“My turtle was painted with my cum”",
            "I had the next step just below \n\nhttps://www.reddit.com/r/shittyideas/comments/mejagr/carbonated_semen/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "Wait, that’s why guys grab tissues? I thought it would be to help them masturbate, huh",
            "i’m fucking crying how could you",
            "!emojify",
            "Dawson 😎",
            "Hot stuff",
            "What a gigantic LOSER!",
            "...you raped your turtle ....",
            "!emojify",
            "Give tommy turtle treats and he will forgive",
            "https://www.google.com/amp/s/amp.reddit.com/r/copypasta/comments/d9a7ef/cumming_on_a_turtle/",
            "!pekofy",
            "[deleted]",
            "The turtle is part of the 97",
            "Sometimes this subreddit worries me...",
            "It's one of those stories you just know is true. Always the simple ones. Poor turtle",
            "When I masturbate, I throw my turtle against the wall... :(?\n\nI don't think he can take much more of this... his shell is beginning to crack. What should I do?\n\nHe's not in the room when I do it, I go and find him",
            "When the impostor is sus! 😳",
            "Someone post this to the turtle or pet sub",
            "Are you ok man?",
            "u/turtledude100",
            "https://www.cdc.gov/salmonella/typhimurium-02-21/index.html",
            "I feel like this is from r/teenagers",
            "NTA Your turtle your rules",
            "Absolute banger",
            "NTA. Your cum your rules",
            "Dude, why do you think that God gave us stomachs?  Why do you think we have socks and underwear?  You jizz on your stomach and then clean up with your undies. Alternatively, you jizz directly into the sock.  \n\nWhat are your plans if the turtle is pregnant?  Let me leave you with something my father told me years ago. \n\nThere was a young maiden named Myrtle\n\nWho had an affair with a turtle \n\nA swelling abdominal \n\nProved quite phenomenal \n\nTo Myrtle that the turtle was fertile.",
            "how dare you 😌",
            "6.9k upvotes? lol nice\n\n(im sorry i had to, its my obligation as a redditor)",
            "Teenage Mutant Ninja Turtles live action coming soon!",
            "tommyinnit?! 😳",
            "I feel bad for cumming on my turtle\n\nWhy the fuck would I do that. I should have never masturbated in front of my turtle. So basically I was watching porn in my 55 inch tv and my turtle was next to me in the couch. The porno was really old. It was a DVD from 2002. It was probably the hottest porn I have ever watch and honestly I'm probably going to watch porn on dvd instead from the internet. The only reason I had my turtle with me was because whenever I cum, I feel really depressed and lonely, so I thought that if my turtle watched with my I wouldn't feel lonely. Well I started stroking my willie, I used lotion, i took all my clothes off, but my dumbass forgot the tissues. I realized that I forgot to grab tissues but it was too late. I was going to cum. I didn't want to cum everywhere so I had to think fast. It was when I saw my turtle when I realized what I had to do. I came like a motherfucker. My turtle was painted with my cum in his tiny little face and all around his shell. He didn't say a word about it, he didn't move, he just stood there looking at me like I killed a bunch of children. I would never forgot the look my turtle gave me. His disappointing face broke my heart. I put on my clothes, I took my turtle to the bathroom and cleaned him off. What happened, happened. But my turtle would never forgot what happened. My turtle, Tommy, would never forgive me. Today, I passed by him and I know he still remembers what i did to him 3 hours ago. My only wish, is that one day, Tommy the turtle will forgive me for my horrible sins.",
            "My Christian friend sent this to me",
            "Abuse of a little turtle😔",
            "u/emojifierbot",
            "this was a RIDE oml im laughing so hard",
            "Masturbating and watching porn is a sin. Stop doing that unless you want to go to hell"
        ]
    },
    {
        "post_id": "jf1n3u",
        "author": "sunny_night",
        "title": "Kendrick Lamar’s dick",
        "url": "https://www.reddit.com/r/copypasta/comments/jf1n3u/kendrick_lamars_dick/",
        "score": 8015,
        "num_comments": 201,
        "created_utc": 1603237621.0,
        "selftext": "If were being realistic here Kendrick probably has a decent sized penis of 5-7 inches. Because height usually correlates with penis size we can infer that Kendrick most likely doesn't have a 9 inch pinch. However, on the song for free Kendrick says matter of fact its 9 inches, but Kendrick could be capping. Also, darker skinned people normally have bigger penises and because Kendrick is one of those darker skinned individuals he could indeed have a 9 incher. But because Kendrick is kind of short and as I said before height size correlates with dick size this is why I believe Kendrick probably has a penis of 5-7 inches.",
        "permalink": "/r/copypasta/comments/jf1n3u/kendrick_lamars_dick/",
        "comments": [
            "If were being realistic here Kendrick probably has a decent sized penis of 5-7 inches. Because height usually correlates with penis size we can infer that Kendrick most likely doesn't have a 9 inch pinch. However, on the song for free Kendrick says matter of fact its 9 inches, but Kendrick could be capping. Also, darker skinned people normally have bigger penises and because Kendrick is one of those darker skinned individuals he could indeed have a 9 incher. But because Kendrick is kind of short and as I said before height size correlates with dick size this is why I believe Kendrick probably has a penis of 5-7 inches.",
            "This dick aint free",
            "I mean we do have an upper limit on his dick size. We know it’s smaller than the Eiffel Tower since he says “I wish my dick was as big as the Eiffel Tower” in that song he does.",
            "If were being realistic 😳 here Kendrick 🔥💯🛌 probably 😻 has a decent ✅ sized ✅ penis 🍆 of 5-7 👌 inches 📏. Because height 📏 usually 😌 correlates with penis 🍆👽 size 😱 we can infer that Kendrick 👨🏾📀🔥 most likely 💟 doesn't have a 9 ❤ inch 📏📐 pinch 👌🏻🙀. However 🖐, on 🔛💥🔫 the song 🎵🎤 for free 🆓 Kendrick 🔥👨🏾💽 says 💬 matter 🙅 of fact 📕 its 9 ❤ inches 📏, but 🍑 Kendrick 🔥💯🛌 could be capping. Also 👨, darker 🌚 skinned 🖐🏿 people 👨 normally 📩 have bigger 🍆 penises 🍌🍆 and because Kendrick 👨🏾📀🔥 is one ☝ of those darker 🌚 skinned 😠 individuals 👤 he 👨 could indeed ✔ have a 9 💯 incher. But 🍑 because Kendrick 🔥👨🏾💽 is kind 😇 of short 🚸 and as I 👁 said 🗣 before 😂 height ✈ size 😱 correlates with dick 🍆 size 🐰 this is why 🤔 I 👁 believe 🙏 Kendrick 🔥👨🏾💽 probably 😻 has a penis 🍆🍒 of 5-7 ‼ inches 📏📐.",
            "meanwhile on r/kendricklamar",
            "If wewe being weawistic hewe Kendwick pwobabwy has a decent sized penis of 5-7 inches. Because height usuawwy cowwewates with penis size we can infew that Kendwick most wikewy doesn't have a 9 inch pinch. Howevew, on the song fow fwee Kendwick says mattew of fact its 9 inches, but Kendwick couwd be capping. Awso, dawkew skinned peopwe nowmawwy have biggew penises and because Kendwick is one of those dawkew skinned individuaws he couwd indeed have a 9 inchew. But because Kendwick is kind of showt and as I said befowe height size cowwewates with dick size this is why I bewieve Kendwick pwobabwy has a penis of 5-7 inches.",
            "Idk where the bot is so google transulated version:\n\n\nChicken Kendrick Lamar\n\nIf you are fibrous, Kendrick's penis can be 5-7 inches long because the length is always related to the size of the penis, Kendrick may not have a 9-inch cap. In a free song, Kendrick says it's 9 inches, but Kendrick can be a metal. Also, people with dark skin will have a bigger penis, and Kendrick can have these nine colored animals. Yes, Kendrick thought his height was shorter than he had ever seen before, so his body may have grown to 5-7 pieces.",
            "Um, aaacktually, humans are the only mammal to NOT have penis size proportional to the rest of their body. This is because it does not contain a bone.",
            "so glad r/hiphopcirclejerk is leaking",
            "[deleted]",
            "Wel actually BBC is a myth projected by pornography. If you look at the average penis size across races, its always around 5.5 inches.",
            "WHERE IS THE TRANSLATOR",
            "Jokes aside, I've always wondered whether his dick is really 9 inches or not. Statistically it seems highly unlikely, but it would be weird for him to lie about it.",
            "Gross underestimation; his dick has been rumored to be as big as the Eiffel Tower",
            "[Source, to be preserved for posterity:](https://old.reddit.com/r/KendrickLamar/comments/jedvf7/what_if_instead_of_releasing_an_album_kendrick/g9fhti7/?context=3)",
            "based",
            "I guess kendrick's dick must be smaller than the eiffel tower.\n\nEdit:spelling",
            "u/FancyTextBot $square",
            "Please get off hhcj it is white devil sophistry",
            "Thank you",
            "Can confirm, this is 100% accurate",
            "If he had 9 inches his dick would be ~ 14% the length of his body",
            "Actually, he states in Back seat freestyle that his dick grew to the size of the Eiffel Tower, there fore it is 11,800 inches",
            "Exactly. Kendrick has likely the ideal human penis.",
            "I just wrote a 1000+ word page paper about Kendrick Lamar, proceeded to open up Reddit and read this shit.",
            "I have 3 inches guys I’m Asian pray for me 😔",
            "I hooked up with a guy that was 5’2 and his dick was 9inches long",
            "[Kendrick Lamar's a hoot ass bitch, son](https://www.youtube.com/watch?v=JZiWolIbe0I)",
            "r/KendrickLamar",
            "That went personal",
            "I was the writer of that comment",
            "Probably the same size as Cr1tical",
            "5-7 is such a huge range, i would say 5.5 to 6.5",
            "Height has little to do with penis size. Maybe a mild correlation. All of the large porn schlongs are average height dudes",
            "Matter of fact it’s nine inches",
            "Reading this in a Ben Shapiro voice makes it 10x funnier",
            "My 5'8 friend has a literally 10\" dick so you never know",
            "Based"
        ]
    },
    {
        "post_id": "fnv813",
        "author": "RealCanadian_",
        "title": "So disappointed in the new Animal Crossing...",
        "url": "https://www.reddit.com/r/copypasta/comments/fnv813/so_disappointed_in_the_new_animal_crossing/",
        "score": 8015,
        "num_comments": 379,
        "created_utc": 1585009079.0,
        "selftext": "Last night after my gay sex session I decided to turn on my Nintendo Switch™ and play some Animal Crossing: New Horizons™. I was trying to progress as quickly as possible so I can see Isabelle on my 4k 60 inch TV.\nI was catching bugs to give to Blathers, because Blathers is a bitch who is scared of bugs, until I couldn’t believe my eyes.\n\nI caught...\n\nA Monarch Butterfly.\n\nA MONARCH Butterfly!\n\nI threw my Pro Controller™ right at my TV and screamed in absolute horror.\n\nIs that a fucking political word I see? Why the fuck is there a MONARCH Butterfly? What the fuck is Nintendo™ trying to do putting their right-wing ideals in their games? Wasn’t Animal Crossing™ supposed to a peaceful game? It surely can’t be when they stuff their political cocks down our throats. Why isn’t there a Marxist Butterfly? I’m in pure shock that Nintendo™ will go to such lengths to brainwash people into agreeing with their political values. I am never buying a Nintendo™ game again, until they formally apologize to me admitting that it was wrong to promote political ideals in their games.\n\n\nEDIT: Guys stop saying it’s poorly written clearly English isn’t my native language. You guys are so racist\n\nEDIT 2: Since you fuckers keep calling me out I rewrote it in better grammar are you happy now",
        "permalink": "/r/copypasta/comments/fnv813/so_disappointed_in_the_new_animal_crossing/",
        "comments": [
            "Last night after my gay sex session I decided to turn on my Nintendo Switch™ and play some Animal Crossing: New Horizons™. I was trying to progress as quickly as possible so I can Isabelle on my 60 inch TV.\nI was catching bugs to give to Blathers, because Blathers is a bitch who is scared of bugs, until I couldn’t believe my eyes.\n\nI caught...\n\nA Monarch Butterfly.\n\nA MONARCH Butterfly!\n\nI threw my Pro Controller™ right at my TV and screamed in absolute horror.\n\nIs the a fucking political word? Why the fuck is there a MONARCH Butterfly? What is the fuck is Nintendo™ trying to do putting their right-wing ideals in their games? Wasn’t Animal Crossing™ supposed to a peaceful game? It surely can’t be when they stuff their political cocks down our throats. Why isn’t there a Maximist Butterfly? I’m in pure shock that Nintendo™ will go to such lengths to brainwash people into agreeing with their political values. I am never buying a Nintendo™ game again, until they formally apologize to me admitting that it was wrong to promote political ideals in their games.",
            "u/REDDIT_DETECTOR u/RealCanadian_ Furry?",
            "*Marxist Butterfly",
            "Wast night aftew my gay sex session I decided to tuwn on my Nintendo Switch™ and pway some Animaw Cwossing: New Howizons™. I was twying to pwogwess as quickwy as possibwe so I can Isabewwe on my 60 inch TV.\nI was catching bugs to give to Bwathews, because Bwathews is a bitch who is scawed of bugs, untiw I couwdn’t bewieve my eyes.\n\nI caught...\n\nA Monawch Buttewfwy.\n\nA MONAWCH Buttewfwy!\n\nI thwew my Pwo Contwowwew™ wight at my TV and scweamed in absowute howwow.\n\nIs the a fucking powiticaw wowd? Why the fuck is thewe a MONAWCH Buttewfwy? What is the fuck is Nintendo™ twying to do putting theiw wight-wing ideaws in theiw games? Wasn’t Animaw Cwossing™ supposed to a peacefuw game? It suwewy can’t be when they stuff theiw powiticaw cocks down ouw thwoats. Why isn’t thewe a Maximist Buttewfwy? I’m in puwe shock that Nintendo™ wiww go to such wengths to bwainwash peopwe into agweeing with theiw powiticaw vawues. I am nevew buying a Nintendo™ game again, untiw they fowmawwy apowogize to me admitting that it was wwong to pwomote powiticaw ideaws in theiw games.",
            "Username checks out.",
            "Should have been the mighty Blue Morpho",
            "someone has the \"oh my god i want to fuck isabelle\" copypasta?",
            "And people act like video games aren't political smh.",
            "Wait until he finds an Emperor Butterflt",
            "Libtardas owned epic style",
            "Cum",
            "hey now sir lets leave animal crossing out of thus ya hear",
            "Cock",
            "political cocks is now my new favorite term",
            "Okay, that’s all the time I’ve got. I got to get back to playing Animal Crossing New Leaf on my Nintendo 3DS.",
            "HAH, DO *NOT* EVEN GET ME STARTED ON VICEROY BUTTERFLIES BRO",
            "so poorly written",
            "THE MIGHTY MONARCH!",
            "The edit makes it  funnier.",
            "This is poorly written",
            "u/reddit_detector u/hensters weeb?",
            "[deleted]",
            "u/REDDIT_DETECTOR u/GbyteM3 weeb?",
            "Virgin",
            "TM",
            "We have the third and final animal crossing copypasta.",
            "stfu monarchs are not political, women are",
            "Cock",
            "شکنجه خروس و توپ",
            "u/REDDIT-Detector u/thatrandomtoast Weeb?",
            "I don’t even know how to copy this shit",
            "who wrote this",
            "Sending this to a friend who loves the game as much as I do. Thanks for sharing OP, this is beautiful",
            "#W  H A T\n\n#T H E\n\n#F U C K",
            "Man, r/im14andthisisdeep",
            "u/REDDIT-DETECTOR u/Joker-From-Persona-2 Weeb?",
            "Based monarchist copypasta",
            "you fucking retard i hope this isnt a serious post, this is the most stupid thing-- im new to reddit is this their actual community? im unimpressed smh, the monarch butterfly is an actual butterfly, animal crossing probably just added it as a butterfly because its an actual real one, dumb",
            "Jojo game incel god",
            "So sad for the new beast Crossing...\n\nLast night after my gay sex session with the woman I decided to turn my™ Nintendo and play with animals in the country: look from the New™. I tried to be better as soon as Isabelle could be on my 60-inch TV. I had a few bugs to give to Blathers, because it was a little bit of an insect Blathers the fox, until I couldn't believe my face.\n\n&#x200B;\n\nI had...\n\n&#x200B;\n\nAn infant king.\n\n&#x200B;\n\nSwimming in the ocean!\n\n&#x200B;\n\nI left™ my boss on TV and yelled very scared.\n\n&#x200B;\n\nA political word like a Macau? Why do you have a big kid? What is Nintendo™ trying to implement their own authentic models as they play? Not a cross-country Animal™ right for a peaceful game? They will not be cocks in their political throats. Why not a swimming Maximist? I feel like Nintendo will be™ according to Brainwash people who believe in their political values. I haven't even bought a Nintendo™ game, unless they apologize for showing that it's wrong to support the political spectrum in their games.\n\n&#x200B;\n\nCORRECTION: Stop the English language is not ok but not my word. You'Re too racist",
            "/u/REDDIT_DETECTOR /u/siophang13 weeb?",
            "id give gold but im poor, so have this upvote",
            "r/gamingcirclejerk",
            "u/REDDIT_DETECTOR u/ethanfirehair Furry?",
            "u/REDDIT_DETECTOR u/Wingo21 weeb?",
            "u/REDDIT_DETECTOR u/razvanel830 Weeb?",
            "Imagine being homophobic in 2020",
            "What the fuck did you just fucking say about me, you little bitch? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills.",
            "u/REDDIT_DETECTOR u/giana1979 furry?",
            "> EDIT: Guys stop saying it’s poorly written clearly English isn’t my native language. You guys are so racist \n\nFuck off. Pointing out that a text is poorly written, which this one definitely is, is not racist. I'm not a native speaker myself so don't come at me with this shit"
        ]
    }
]