[
    {
        "post_id": "mwost7",
        "author": "somekidonhiscomputer",
        "title": "Did you know: It is illegal to joke about how Sweden and Finland look like a dick and a balls in Sweden?",
        "url": "https://www.reddit.com/r/copypasta/comments/mwost7/did_you_know_it_is_illegal_to_joke_about_how/",
        "score": 7998,
        "num_comments": 143,
        "created_utc": 1619158081.0,
        "selftext": " [OC] Did you know in Sweden, it is illegal to joke about Finnish-Swedish relations post-independence, and the shape of the nations all together? You can get up to 10 years in jail for joking about it. It states in section 3, paragraph 4 of the Swedish constitution that it is illegal to make statements about the shape and size of the nation, and any country bordering it.   \n\n\nThe law was put into place when Danish politician Emil Amundsen visited Stockholm in 1857 and made a joke about Swedish and Finnish territories looking like a penis and a scrotum.  This did not amuse the King of Sweden, who then ordered to have the man spend 3 days in jail. When Amundsen was released, they made a decree that he was no longer to make such jokes about the nation ever again. The new law was put into place the same day. They removed it in 1890 over claims that it was too childish. It was then again written into the constitution when Finland became independent in 1918.    \n\n\nDon't believe me? Search up Sweden-Finland rule 34.",
        "permalink": "/r/copypasta/comments/mwost7/did_you_know_it_is_illegal_to_joke_about_how/",
        "comments": [
            "what if we arent joking? they look like fucking cock and balls.",
            "\"and a balls\"\n\nSeriously, the word \"balls\" has lost all its meaning. It's only complete with the word cock. Now, for example, you go into a restaurant and say \"One cock and two balls please\" that doesn't feel right, or just \"One balls please\" it doesn't sound right either. So it's only right to say \"One cock and balls please\" or when the cock is really good, you don't just say, \"that's a good cock and good balls\" you say \"that's some fine cock and balls\"",
            "Literally 1984",
            "Did you know that Sweden handles jokes about relations between Finland and Sweden after independence, which the whole country does? Illegal activities can lead to ten years in prison. Article 3-4 of the Swedish Constitution provides for the preparation of a declaration on the size of neighboring countries.\n\n\nThe law came into force in 1857, when the Danish politician Emil Amundosen visited Stockholm with a joke about the lands of Sweden and Finland, reminiscent of a skull. The Swedish king was not pleased with the man's three-day imprisonment, and when Amundosen was released they ordered him to laugh at the government. The new law will come into force on the same day. They removed it in the 1890s and said it was too small. It was then rewritten in the constitution when Finland gained independence in 1969. Fourth, 1918\n\n\nyou do not believe me? Look for Swedish-Finnish law 34",
            "‎\n\n \n\n\n      🧢\n     👉🏿😬👈🏿 lesss gooo\n\n\n\n\n‏‏‎ ‎",
            "Did you know in Sweden, it is illegal to joke about Finnish-Swedish relations post-independence, and the shape of the nations all together? You can get up to 10 years in jail for joking about it. It states in section 3, paragraph 4 of the Swedish constitution that it is illegal to make statements about the shape and size of the nation, and any country bordering it.\n\nThe law was put into place when Danish politician Emil Amundsen visited Stockholm in 1857 and made a joke about Swedish and Finnish territories looking like a penis and a scrotum. This did not amuse the King of Sweden, who then ordered to have the man spend 3 days in jail. When Amundsen was released, they made a decree that he was no longer to make such jokes about the nation ever again. The new law was put into place the same day. They removed it in 1890 over claims that it was too childish. It was then again written into the constitution when Finland became independent in 1918.\n\nDon't believe me? Search up Sweden-Finland rule 34.",
            "Did you 👈 know 🤔📝 in Sweden 🇸🇪, it is illegal 😉💦 to joke 😜 about 💦 Finnish-Swedish relations 👫👬👭 post-independence, and the shape 🤙👀 of the nations 😺 all 💯 together 👫👷🏿? You 👈😏 can get 🔟 up ☝ to 10 🔟 years 📅 in jail ⛓ for joking 😂 about 💦 it. It states 🇺🇸 in section 😼👌💥 3 ⭕ℹ🕘, paragraph 😁😂😃 4 🍆 of the Swedish 🇨🇭 constitution 📜 that it is illegal 🚔 to make 🖕 statements 👌 about 🤔💭 the shape 🤙👀 and size 🐰 of the nation 😺, and any country 🇺🇸🏞🌎 bordering it.   \n  \n  \nThe law ⚖ was put 😏 into place 🚩 when ⏰ Danish 🗣🇩 politician 🏛 Emil Amundsen visited 👎🏻 Stockholm 🇫🇷 in 1857 and made 👉 a joke 😂🤡😡 about 💦 Swedish 🇨🇭 and Finnish territories 🔯💦 looking 👍 like 👍 a penis 👀🍆 and a scrotum 🍆. This did not amuse 😂👌 the King 👑 of Sweden 🇸🇪, who then ordered 🛒 to have the man 👨👴👷 spend 💰 3 ⭕ℹ🕘 days 📆 in jail ⛓. When ⏰ Amundsen was released 😎💦, they made 👑 a decree ❓ that he 👨 was no 🚫 longer 📏 to make 🖕 such jokes 😜 about 💦 the nation 😺 ever 😠 again ❌😬. The new 👌👀 law ⚖ was put 😏 into place 🚩 the same day 🌝🌞. They removed ❌ it in 1890 over 😳🙊💦 claims 🌊 that it was too childish 👶. It was then again ❌😬 written 👇 into the constitution 📜 when 🍑 Finland 🇫🇮 became ❓ independent ✍ in 1918.   \n  \n  \nDon't ❌ believe 🙏🏻 me? Search 🔎 up ☝ Sweden-Finland rule 🚷 34 🍑.",
            "I made the mistake of doing that. I didn't know why I did it, knowing what rule 34 is, but why...",
            "Okay but why did this countryhumans porn give me a half chub",
            " Did you know in Sweden, it is iwwegaw to joke about Finnish-Swedish wewations post-independence, and the shape of the nations aww togethew? You can get up to 10 yeaws in jaiw fow joking about it. It states in section 3, pawagwaph 4 of the Swedish constitution that it is iwwegaw to make statements about the shape and size of the nation, and any countwy bowdewing it.   \n\n\nThe waw was put into pwace when Danish powitician Emiw Amundsen visited Stockhowm in 1857 and made a joke about Swedish and Finnish tewwitowies wooking wike a penis and a scwotum.  This did not amuse the King of Sweden, who then owdewed to have the man spend 3 days in jaiw. When Amundsen was weweased, they made a decwee that he was no wongew to make such jokes about the nation evew again. The new waw was put into pwace the same day. They wemoved it in 1890 ovew cwaims that it was too chiwdish. It was then again wwitten into the constitution when Finwand became independent in 1918.    \n\n\nDon't bewieve me? Seawch up Sweden-Finwand wuwe 34.",
            "[removed]",
            "Sverige och Finland ser ut som ett fettschysst par kuk och ballar. Kan inte förneka.",
            "This post could be a great way to tell everyone abt their \"peculiar\" shape & shame them internationally by a successor of the first person imprisoned as a revenge.",
            "You can't trick me again! Finland really hot tho...",
            "Does anyone remember about 10 years ago there was a US minted coin that didn't show Norway, just Sweden and Finland and it looked like a penis floating in the top right image on the coin??? It was odd. Seems like it was gold in color, but I can't find any images of it.",
            "I miss cummy",
            "I googled it an it’s all gay porn, does anyone know why?",
            "I have a massive problem with this post. Finland doesn't exist and this is fake news. \n\n[r](https://www.reddit.com/r/finlandConspiracy/)/finlandconspiracy",
            "Okay but its actually Sweden and norway that look like that however Finland looks like a (very sloppy and badly drawn) pile of jizz",
            "Anything can be dick and balls if you try hard enough.",
            "I just looked it up, and all I got was Chad Finland fucking a fem Sweden. You lied to me 😡",
            "This is the socialist utopia reddit is on about. Can't even say cock and balls smh. I wonder if you can even watch cock n ball torture there 😔",
            "instructions unclear, i only found countryhumans porn",
            "I actually looked up sweden Finland rule 34 and it exists wh a t",
            "im getting flashbacks leave me alone i cant do this",
            "This could be posted on r/jokes too",
            "It doesn't help that below them is the\"BALtic sea\"",
            "Based",
            "I am Swede. This joke is new when you're seven. Then it just fades into the background noise.",
            "best one yet",
            "As a finnish person i have a personal grudge against Sweden because we are forced to learn swedish from grades 3-10. Because one 10th of finlands population Speaks swedish as a first language",
            "So we not yoking? 🤣👌😂😂",
            "wait fr?",
            "I'm Swedish, and this is not true",
            "And denmark is the nut?",
            "Mitä helvettiä nyt taas",
            " Did you 😀😀😀 know in Sweden, 🇸🇪 it is illegal to joke about Finnish-Swedish relations post-independence, 🏣 and the 🤣 shape ◾◾◾ of the 🤣 nations 🇲🇽 all together? 🤲 You 😊😊😊 can get 🉐 up to 10 years in jail for 🔰 joking about it. It states 🇺🇸 in section 3, 🕞🕞🕞 paragraph 4 🍀 of the 🤣 Swedish constitution that it is illegal to make statements about the 🤣 shape ◼️◼️◼️ and size 🤌 of the 🤣 nation, 🇰🇮 and any country 🇵🇦🇵🇦🇵🇦 bordering 🛃 it.  The 🤘🤘🤘 law ⚖️ was put into place 🏆 when Danish politician Emil Amundsen visited Stockholm in 1857 and made a joke about Swedish and Finnish territories 🇹🇫 looking 👁️👁️👁️ like 👨‍❤️‍💋‍👨 a penis and a scrotum. This did not ⏳ amuse the 🤘 King 👑👑👑 of Sweden, 🇸🇪 who then ordered 📑 to have 🈶 the 🤣🤣🤣 man 👨‍👩‍👧 spend 3 🕒 days in jail. When Amundsen was released, they 💁 made a decree that he 💁‍♂️💁‍♂️💁‍♂️ was no ⛔ longer 🪘 to make such jokes about the 🤣 nation 🇻🇬🇻🇬🇻🇬 ever again. The 🤘 new 🇵🇬 law 👮‍♀️ was put into place 🥇🥇🥇 the 🤘 same day. They 💁 removed it in 1890 over 🤭 claims 🛄🛄🛄 that it was too childish. 😛 It was then again written into the 🤘 constitution when Finland 🇫🇮 became independent in 1918.  Don't believe me? Search 🔎🔎🔎 up Sweden-Finland 🇸🇪 rule 🚷 34.",
            "Should i do it?",
            "I just about looked it up...",
            "swedick and finballs",
            "but in Finland it is completely legal",
            "Finland doesn’t exist just loke my balls",
            "They look like cock and balls🤣"
        ]
    },
    {
        "post_id": "dirpoa",
        "author": "None",
        "title": "🃏Joker telling murray a joke🃏",
        "url": "https://www.reddit.com/r/copypasta/comments/dirpoa/joker_telling_murray_a_joke/",
        "score": 7995,
        "num_comments": 110,
        "created_utc": 1571243184.0,
        "selftext": "📺🎥🤡How 🤷🏻‍♂️ 🆎out another joke😂😂😂😂🤡, Murrrrray🤔😏❓\n  \n🎥😡No 🚫🛑😤🙅🏻‍♂️I 👁think 🧠we've 💁🏻‍♂️📺👨‍👩‍👧‍👦👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👨‍👦‍👦👩‍👩‍👧‍👧 had enough 🙅🏻‍♂️ 🙉of your👉🏻🤡 jokes😂🤡 😂😂😡\n  \n🎥🤡💁🏻‍♂️What 🤔❓do you 👉🏻🤷🏻‍♂️ get🤔🤡\n  \n🎥😡😤I 👁don't think🤔🧠❓🧠 so🤬\n  \n🎥🤡when 🤔you 👉🏻cross ✝️🙅🏻‍♂️🤡\n  \n🎥🤔😤I 👁think 🧠we're 😡➕🤡 done 🚫🛑here now👉🏻⏰ thank you👋🏻✌🏻\n  \n🎥🤡a mentally 🧠ill 🤢🤮😞😔😢loner 🚶🏻‍♂️🤡🕺🏻with a 🤡 S O C I E T Y 😡😡🏙🌇🌃🌆 that 🆎andons💔 👋🏻✌🏻him 😨🤡😰and treats🍭🍫🍰 him 🤡😭like trash😭🗑🤬😡⁉️‼️❓\n  \n🎥😳😠Call☎️📞 the police🚨🚔🔫👮‍♀️👮🏻‍♂️👮🏼‍♂️👮🏽‍♂️🚓👮🏾‍♂️👮🏿‍♂️ 🚨Gene🤭 call☎️ the police🚨🚔🔫👮‍♂️👮🏻‍♀️👮🏼‍♀️🚓👮🏽‍♀️👮🏾‍♀️👮🏿‍♀️🚨\n  \n🎥🤡I’ll tell💬 you👉🏻 what 🤔🤷🏻‍♂️you 👉🏻get🤝You 👉🏻get 👉🏻what 🤷🏻‍♂️you 👉🏻🤬fuckin' 🖕🏻🤬deserve😡‼️💥🧠☠️💥👔🔫😂😂😂😂🤡🎥🕺🏻🎉🕺🏻🎉🕺🏻📺",
        "permalink": "/r/copypasta/comments/dirpoa/joker_telling_murray_a_joke/",
        "comments": [
            "[removed]",
            "browsing this sub is like going to the gym, it's not fun but leaves you more mentally prepared for other facets of life",
            "📺🎥🤡How 🤷🏻‍♂️ 🆎out another joke😂😂😂😂🤡, Murrrrray🤔😏❓\n  \n🎥😡No 🚫🛑😤🙅🏻‍♂️I 👁think 🧠we've 💁🏻‍♂️📺👨‍👩‍👧‍👦👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👨‍👦‍👦👩‍👩‍👧‍👧 had enough 🙅🏻‍♂️ 🙉of your👉🏻🤡 jokes😂🤡 😂😂😡\n  \n🎥🤡💁🏻‍♂️What 🤔❓do you 👉🏻🤷🏻‍♂️ get🤔🤡\n  \n🎥😡😤I 👁don't think🤔🧠❓🧠 so🤬\n  \n🎥🤡when 🤔you 👉🏻cross ✝️🙅🏻‍♂️🤡\n  \n🎥🤔😤I 👁think 🧠we're 😡➕🤡 done 🚫🛑here now👉🏻⏰ thank you👋🏻✌🏻\n  \n🎥🤡a mentally 🧠ill 🤢🤮😞😔😢loner 🚶🏻‍♂️🤡🕺🏻with a 🤡 S O C I E T Y 😡😡🏙🌇🌃🌆 that 🆎andons💔 👋🏻✌🏻him 😨🤡😰and treats🍭🍫🍰 him 🤡😭like trash😭🗑🤬😡⁉️‼️❓\n  \n🎥😳😠Call☎️📞 the police🚨🚔🔫👮‍♀️👮🏻‍♂️👮🏼‍♂️👮🏽‍♂️🚓👮🏾‍♂️👮🏿‍♂️ 🚨Gene🤭 call☎️ the police🚨🚔🔫👮‍♂️👮🏻‍♀️👮🏼‍♀️🚓👮🏽‍♀️👮🏾‍♀️👮🏿‍♀️🚨\n  \n🎥🤡I’ll tell💬 you👉🏻 what 🤔🤷🏻‍♂️you 👉🏻get🤝You 👉🏻get 👉🏻what 🤷🏻‍♂️you 👉🏻🤬fuckin' 🖕🏻🤬deserve😡‼️💥🧠☠️💥👔🔫😂😂😂😂🤡🎥🕺🏻🎉🕺🏻🎉🕺🏻📺",
            "MURAYYYY",
            "God has left us",
            "I want to upvote, downvote, report, and award this all at the same time. Fuck this post.",
            "📺🎥🤡How 🤷🏻‍♂️ 🆎out anothew joke😂😂😂😂🤡, Muwwwwway🤔😏❓\n  \n🎥😡No 🚫🛑😤🙅🏻‍♂️I 👁think 🧠we've 💁🏻‍♂️📺👨‍👩‍👧‍👦👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👨‍👦‍👦👩‍👩‍👧‍👧 had enough 🙅🏻‍♂️ 🙉of youw👉🏻🤡 jokes😂🤡 😂😂😡\n  \n🎥🤡💁🏻‍♂️What 🤔❓do you 👉🏻🤷🏻‍♂️ get🤔🤡\n  \n🎥😡😤I 👁don't think🤔🧠❓🧠 so🤬\n  \n🎥🤡when 🤔you 👉🏻cwoss ✝️🙅🏻‍♂️🤡\n  \n🎥🤔😤I 👁think 🧠we'we 😡➕🤡 done 🚫🛑hewe now👉🏻⏰ thank you👋🏻✌🏻\n  \n🎥🤡a mentawwy 🧠iww 🤢🤮😞😔😢wonew 🚶🏻‍♂️🤡🕺🏻with a 🤡 S O C I E T Y 😡😡🏙🌇🌃🌆 that 🆎andons💔 👋🏻✌🏻him 😨🤡😰and tweats🍭🍫🍰 him 🤡😭wike twash😭🗑🤬😡⁉️‼️❓\n  \n🎥😳😠Caww☎️📞 the powice🚨🚔🔫👮‍♀️👮🏻‍♂️👮🏼‍♂️👮🏽‍♂️🚓👮🏾‍♂️👮🏿‍♂️ 🚨Gene🤭 caww☎️ the powice🚨🚔🔫👮‍♂️👮🏻‍♀️👮🏼‍♀️🚓👮🏽‍♀️👮🏾‍♀️👮🏿‍♀️🚨\n  \n🎥🤡I’ww teww💬 you👉🏻 what 🤔🤷🏻‍♂️you 👉🏻get🤝You 👉🏻get 👉🏻what 🤷🏻‍♂️you 👉🏻🤬fuckin' 🖕🏻🤬desewve😡‼️💥🧠☠️💥👔🔫😂😂😂😂🤡🎥🕺🏻🎉🕺🏻🎉🕺🏻📺",
            "This really says a lot about society",
            "And remember folks, that’s li-\n\n\ngma",
            "[deleted]",
            "#MURR-AYE!",
            "\n\n“How about another joke, Murrrrray?”\n  \n“No I think we've had enough of your jokes.”\n  \n“What do you get...”\n  \n“I don't think so”\n  \n“...when you cross...”\n  \n“I think we're done here now thank you”\n  \n“...a mentally ill loner with a S O C I E T Y that abandons him and treats him like trash?!”\n  \n“Call the police, *Gene call the police*”\n  \n“I’ll tell you what you get you get what you fuckin' deserve!”",
            "I can't tell, is this about the Denver Nuggets?",
            "I was told a kid in my school was muttering this scene under his breath and even imitated the gunshot sounds and I'm ngl I'm kinda scared",
            "🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻 🕺🏻",
            "Y’know, Murray, despite only making up thirteen percent of the population...",
            "I'm the joker baby!",
            "So... Cummmaaaaayyyyyysssssssss?",
            "oNlY Pe0Ple wiTh mENtal iLlNEsses cAN uNderStANd",
            "andons",
            "Holy fucking shit, what in the ever loving shit bbq, how in the actual ever living fuck oh my ducking fucking god.",
            " \n\n📺🎥🤡How 🤷🏻‍♂️ 🆎out another joke😂😂😂😂🤡, Murrrrray🤔😏❓\n\n🎥😡No 🚫🛑😤🙅🏻‍♂️I 👁think 🧠we've 💁🏻‍♂️📺👨‍👩‍👧‍👦👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👨‍👦‍👦👩‍👩‍👧‍👧 had enough 🙅🏻‍♂️ 🙉of your👉🏻🤡 jokes😂🤡 😂😂😡\n\n🎥🤡💁🏻‍♂️What 🤔❓do you 👉🏻🤷🏻‍♂️ get🤔🤡\n\n🎥😡😤I 👁don't think🤔🧠❓🧠 so🤬\n\n🎥🤡when 🤔you 👉🏻cross ✝️🙅🏻‍♂️🤡\n\n🎥🤔😤I 👁think 🧠we're 😡➕🤡 done 🚫🛑here now👉🏻⏰ thank you👋🏻✌🏻\n\n🎥🤡a mentally 🧠ill 🤢🤮😞😔😢loner 🚶🏻‍♂️🤡🕺🏻with a 🤡 S O C I E T Y 😡😡🏙🌇🌃🌆 that 🆎andons💔 👋🏻✌🏻him 😨🤡😰and treats🍭🍫🍰 him 🤡😭like trash😭🗑🤬😡⁉️‼️❓\n\n🎥😳😠Call☎️📞 the police🚨🚔🔫👮‍♀️👮🏻‍♂️👮🏼‍♂️👮🏽‍♂️🚓👮🏾‍♂️👮🏿‍♂️ 🚨Gene🤭 call☎️ the police🚨🚔🔫👮‍♂️👮🏻‍♀️👮🏼‍♀️🚓👮🏽‍♀️👮🏾‍♀️👮🏿‍♀️🚨\n\n🎥🤡I’ll tell💬 you👉🏻 what 🤔🤷🏻‍♂️you 👉🏻get🤝You 👉🏻get 👉🏻what 🤷🏻‍♂️you 👉🏻🤬fuckin' 🖕🏻🤬deserve😡‼️💥🧠☠️💥👔🔫😂😂😂😂🤡🎥🕺🏻🎉🕺🏻🎉🕺🏻📺",
            "Guys, this isn't funny 😂, I'm liberal 🏳️‍🌈🌈from bottom of my heart ♥️(Justin Trudeau 🇨🇦for life), and I feel very hurt 🥺😢🤕when you post anti-liberal 🛑🏳️‍🌈content, please stop this nonsense right now😡😡😡😡😡. Or else I ask Daddy Trudeau 🤪😜🤪😜🤪😜🤪😜to deport you😌😌😌😌............. #liberal4life",
            "Murray understood the fear of what happens when Gamers truly rise up.",
            "This meme is too great for society",
            "Society amirite? \n\nWhy the fuck was this downvoted",
            "knock knock",
            "[deleted]",
            "I still can’t believe this is an actual line in the movie. “Subtle” my ass.",
            "Spoiler: >!Would’ve been better if it was his real mum and he killed her due to mis information. I didn’t like the way he was portrayed entirely as a victim. He’s supposed to be evil!<",
            "Wtf with the comments XD"
        ]
    },
    {
        "post_id": "tqstpo",
        "author": "None",
        "title": "Transcript of Will Smith and his wife",
        "url": "https://www.reddit.com/r/copypasta/comments/tqstpo/transcript_of_will_smith_and_his_wife/",
        "score": 7991,
        "num_comments": 162,
        "created_utc": 1648532492.0,
        "selftext": "Jada: Are you going to let him speak about me like that?\n\nWill: What, it was funny, you were terrible in G.I. Jane\n\nJ: I wasn't in G.I. Jane, Will\n\nW: Oh, then why did he say that?\n\nJ: It was a joke about my hair!!\n\nW: Girl, you ain't got no hair\n\nJ: THATS THE POINT WILL!!\n\nW: Ohh. ohhhh. OH Hell No!!",
        "permalink": "/r/copypasta/comments/tqstpo/transcript_of_will_smith_and_his_wife/",
        "comments": [
            "#KEEP MY WIFE'S NAME. OUT YOUR FUCKING MOUTH.",
            "Does no one see how deep the joke goes? Being thay the actor for gi Jane cheated on her husband with a younger guy and was caught up in it much like Jada? Lmao It was disrespectful",
            "EXTREME FUCKING SPOILERS!",
            "💀",
            "Can I go to the bathroom?\nNo",
            "\"Fresh Prince\" bumper starts playing as it cuts to a commercial break.",
            "Real transcript\n\nWill: Hahahhahah\n\nJada: August would never let him get away with that\n\nWill: 😡",
            "what happen between will and chris?",
            "Transcript of Will Smith and his wife\n\n\nJada: Are you going to let him speak about me like that?\n\nWill: What, it was funny, you were terrible in G.I. Jane\n\nJ: I wasn't in G.I. Jane, Will\n\nW: Oh, then why did he say that?\n\nJ: It was a joke about my hair!!\n\nW: Girl, you ain't got no hair\n\nJ: THATS THE POINT WILL!!\n\nW: Ohh. ohhhh. OH Hell No!!",
            "Wait, is this a meme, or did he really say this?",
            "The only thing she said that matters is \"My boyfriends wouldn't let him say that to me\"",
            "🗿",
            "JADA got this man's head F#%ed up! He just played himself not Chris Rock. No one told dis dude to let his wife put all they business on Facebook! 🤡\n\nHe could have handled dat ish afterwards if he really wanted to get at him, chess not checkers. However that joke was a low blow. Same folks going to be protesting  when they can't get nominated next year. 🤷🏿‍♂️ This ant nothin but Black-on-Black crime.\n\nImagine getting calls from Oprah and Obama on how you F#%ed up the money for the next generation. 😂😂😂🤣🤣🤣\n\nYou want better do better!",
            "I can’t believe that will smiths wife has the same name as this one girl i edated once who emotionally manipulated me",
            "The White Man giveth Oscar, The White Man can taketh away. This is not going to end how he thinks. When GOD gives that type of favor the expectations are the equivalent.\n\nI think Will is struggling mentally and emotionally. What the man needs or wants real Love... a real hug... For Will Smith to smack a man on National Tv and walk off like a super model...... he's going through it 🙏🏿🤲🏿\n\nThe only way to reconcile this fiasco is to send a strong message by taking away his Oscar and banning both of them (Will and JADA) for life. Chris on the other hand deserves a NAACP award for exemplifying class. \n\nThis is the kind of thin-skinned society that Dave Chappelle warns his audience about.",
            "#**KEEP. MY WIFE'S NAME. OUT. YO FUCKING. MOUTH!!!**",
            "If I could slap a celebrity on live TV with no consequences, it would be Benedict Cumberbatch. The pun is perfect and I think he’d be a good sport about it. Benedict CumberSlap.",
            "the joke was actually about jada cheating on will",
            "This happened, Source? Trust me bro",
            "I need to copy this rn, Can someone post it",
            "I just find it ironic that Chris Rock, the creator of \\*Good Hair\\* specifically targets a woman with a medical condition about her hair. \n\nHe also finds a way to bring her up year after year after year. \n\nI'm 100% with Will Smith on this one, if you don't defend your wife who will?",
            "MARIOBRU THE CORRUPTION THE BEST MOVIE OF 2022 COMING OUT TOMORROW DON'T MISS 🤑🤑🤑 https://www.youtube.com/watch?v=8EB0vcjoMkY&ab\\_channel=Mariobruhttps://www.youtube.com/watch?v=8EB0vcjoMkY&ab\\_channel=Mariobruhttps://www.youtube.com/watch?v=8EB0vcjoMkY&ab\\_channel=Mariobru",
            "Jada should have defended herself. That is what the woke ideology is all about. Sad to see her not being a strong and independent woman...",
            "*tactical airstrike inbound*",
            "Hey G, would you make me a sandwich?",
            "bruh",
            "Never knew there was an unseen script of a fresh prince of bel air episode",
            "oh shit",
            "ccjheesensa birger",
            "Chris is like my grandmother slaps me better than you.",
            "[Spongebob reenactment](https://media.discordapp.net/attachments/815365731792453663/958089312996556820/IMG_8971.mp4)",
            "#BALLS",
            "you can sorta see jada after the blow look at will like 'bruh this man do be slow af' XD",
            "Literally slapped a guy for her and she just outright says \"didn't want to marry him\"\npoor guy",
            "#KEEP MY WIFE'S NAME. OUT YOUR FUCKING MOUTH.",
            ":0"
        ]
    },
    {
        "post_id": "uzq527",
        "author": "johndoemysterious",
        "title": "An Afghan, an Albanian, an Algerian, an American, an Andorran, an Angolan, an Antiguans, an Argentine, an Armenian, an Australian, an Austrian, an Azerbaijani, a Bahamian, a Bahraini, a Bangladeshi, a Barbadian, a Barbudans, a Batswanan, a Belarusian, a Belgian, a Belizean, a Beninese, a Bhutanese,",
        "url": "https://www.reddit.com/r/copypasta/comments/uzq527/an_afghan_an_albanian_an_algerian_an_american_an/",
        "score": 7988,
        "num_comments": 139,
        "created_utc": 1653753262.0,
        "selftext": " a Bolivian, a Bosnian, a Brazilian, a Brit, a Bruneian, a Bulgarian, a Burkinabe, a Burmese, a Burundian, a Cambodian, a Cameroonian, a Canadian, a Cape Verdean, a Central African, a Chadian, a Chilean, a Chinese, a Colombian, a Comoran, a Congolese, a Costa Rican, a Croatian, a Cuban, a Cypriot, a Czech, a Dane, a Djibouti, a Dominican, a Dutchman, an East Timorese, an Ecuadorean, an Egyptian, an Emirian, an Equatorial Guinean, an Eritrean, an Estonian, an Ethiopian, a Fijian, a Filipino, a Finn, a Frenchman, a Gabonese, a Gambian, a Georgian, a German, a Ghanaian, a Greek, a Grenadian, a Guatemalan, a Guinea-Bissauan, a Guinean, a Guyanese, a Haitian, a Herzegovinian, a Honduran, a Hungarian, an I-Kiribati, an Icelander, an Indian, an Indonesian, an Iranian, an Iraqi, an Irishman, an Israeli, an Italian, an Ivorian, a Jamaican, a Japanese, a Jordanian, a Kazakhstani, a Kenyan, a Kittian and Nevisian, a Kuwaiti, a Kyrgyz, a Laotian, a Latvian, a Lebanese, a Liberian, a Libyan, a Liechtensteiner, a Lithuanian, a Luxembourger, a Macedonian, a Malagasy, a Malawian, a Malaysian, a Maldivan, a Malian, a Maltese, a Marshallese, a Mauritanian, a Mauritian, a Mexican, a Micronesian, a Moldovan, a Monacan, a Mongolian, a Moroccan, a Mosotho, a Motswana, a Mozambican, a Namibian, a Nauruan, a Nepalese, a New Zealander, a Nicaraguan, a Nigerian, a Nigerien, a North Korean, a Northern Irishman, a Norwegian, an Omani, a Pakistani, a Palauan, a Palestinian, a Panamanian, a Papua New Guinean, a Paraguayan, a Peruvian, a Pole, a Portuguese, a Qatari, a Romanian, a Russian, a Rwandan, a Saint Lucian, a Salvadoran, a Samoan, a San Marinese, a Sao Tomean, a Saudi, a Scottish, a Senegalese, a Serbian, a Seychellois, a Sierra Leonean, a Singaporean, a Slovakian, a Slovenian, a Solomon Islander, a Somali, a South African, a South Korean, a Spaniard, a Sri Lankan, a Sudanese, a Surinamer, a Swazi, a Swede, a Swiss, a Syrian, a Tajik, a Tanzanian, a Togolese, a Tongan, a Trinidadian or Tobagonian, a Tunisian, a Turk, a Tuvaluan, a Ugandan, a Ukrainian, a Uruguayan, a Uzbekistani, a Venezuelan, a Vietnamese, a Welshman, a Yemenite, a Zambian and a Zimbabwean\n\nall go to a bar..\n\nThe doorman stops them and says \"Sorry, I can’t let you in without a Thai.",
        "permalink": "/r/copypasta/comments/uzq527/an_afghan_an_albanian_an_algerian_an_american_an/",
        "comments": [
            "r/dadjokes",
            "Ayo where my Montenegrins at bro ????",
            "An Afghan, an Albanian, an Algerian, an American, an Andorran, an Angolan, an Antiguans, an Argentine, an Armenian, an Australian, an Austrian, an Azerbaijani, a Bahamian, a Bahraini, a Bangladeshi, a Barbadian, a Barbudans, a Batswanan, a Belarusian, a Belgian, a Belizean, a Beninese, a Bhutanese,\n\n a Bolivian, a Bosnian, a Brazilian, a Brit, a Bruneian, a Bulgarian, a Burkinabe, a Burmese, a Burundian, a Cambodian, a Cameroonian, a Canadian, a Cape Verdean, a Central African, a Chadian, a Chilean, a Chinese, a Colombian, a Comoran, a Congolese, a Costa Rican, a Croatian, a Cuban, a Cypriot, a Czech, a Dane, a Djibouti, a Dominican, a Dutchman, an East Timorese, an Ecuadorean, an Egyptian, an Emirian, an Equatorial Guinean, an Eritrean, an Estonian, an Ethiopian, a Fijian, a Filipino, a Finn, a Frenchman, a Gabonese, a Gambian, a Georgian, a German, a Ghanaian, a Greek, a Grenadian, a Guatemalan, a Guinea-Bissauan, a Guinean, a Guyanese, a Haitian, a Herzegovinian, a Honduran, a Hungarian, an I-Kiribati, an Icelander, an Indian, an Indonesian, an Iranian, an Iraqi, an Irishman, an Israeli, an Italian, an Ivorian, a Jamaican, a Japanese, a Jordanian, a Kazakhstani, a Kenyan, a Kittian and Nevisian, a Kuwaiti, a Kyrgyz, a Laotian, a Latvian, a Lebanese, a Liberian, a Libyan, a Liechtensteiner, a Lithuanian, a Luxembourger, a Macedonian, a Malagasy, a Malawian, a Malaysian, a Maldivan, a Malian, a Maltese, a Marshallese, a Mauritanian, a Mauritian, a Mexican, a Micronesian, a Moldovan, a Monacan, a Mongolian, a Moroccan, a Mosotho, a Motswana, a Mozambican, a Namibian, a Nauruan, a Nepalese, a New Zealander, a Nicaraguan, a Nigerian, a Nigerien, a North Korean, a Northern Irishman, a Norwegian, an Omani, a Pakistani, a Palauan, a Palestinian, a Panamanian, a Papua New Guinean, a Paraguayan, a Peruvian, a Pole, a Portuguese, a Qatari, a Romanian, a Russian, a Rwandan, a Saint Lucian, a Salvadoran, a Samoan, a San Marinese, a Sao Tomean, a Saudi, a Scottish, a Senegalese, a Serbian, a Seychellois, a Sierra Leonean, a Singaporean, a Slovakian, a Slovenian, a Solomon Islander, a Somali, a South African, a South Korean, a Spaniard, a Sri Lankan, a Sudanese, a Surinamer, a Swazi, a Swede, a Swiss, a Syrian, a Tajik, a Tanzanian, a Togolese, a Tongan, a Trinidadian or Tobagonian, a Tunisian, a Turk, a Tuvaluan, a Ugandan, a Ukrainian, a Uruguayan, a Uzbekistani, a Venezuelan, a Vietnamese, a Welshman, a Yemenite, a Zambian and a Zimbabwean\n\nall go to a bar..\n\nThe doorman stops them and says \"Sorry, I can’t let you in without a Thai.",
            "Can someone explain me the joke? English isn't my main language",
            "It's not Monacan, it's Monegascué you uncultured cunt",
            "But who is going to pick up the Czech?",
            "Proof that Kosovo isn't real",
            "An Afghan, an Albanian, an Algerian, an American, an Andorran, an Angolan, an Antiguans, an Argentine, an Armenian, an Australian, an Austrian, an Azerbaijani, a Bahamian, a Bahraini, a Bangladeshi, a Barbadian, a Barbudans, a Batswanan, a Belarusian, a Belgian, a Belizean, a Beninese, a Bhutanese,\n\n a Bolivian, a Bosnian, a Brazilian, a Brit, a Bruneian, a Bulgarian, a Burkinabe, a Burmese, a Burundian, a Cambodian, a Cameroonian, a Canadian, a Cape Verdean, a Central African, a Chadian, a Chilean, a Chinese, a Colombian, a Comoran, a Congolese, a Costa Rican, a Croatian, a Cuban, a Cypriot, a Czech, a Dane, a Djibouti, a Dominican, a Dutchman, an East Timorese, an Ecuadorean, an Egyptian, an Emirian, an Equatorial Guinean, an Eritrean, an Estonian, an Ethiopian, a Fijian, a Filipino, a Finn, a Frenchman, a Gabonese, a Gambian, a Georgian, a German, a Ghanaian, a Greek, a Grenadian, a Guatemalan, a Guinea-Bissauan, a Guinean, a Guyanese, a Haitian, a Herzegovinian, a Honduran, a Hungarian, an I-Kiribati, an Icelander, an Indian, an Indonesian, an Iranian, an Iraqi, an Irishman, an Israeli, an Italian, an Ivorian, a Jamaican, a Japanese, a Jordanian, a Kazakhstani, a Kenyan, a Kittian and Nevisian, a Kuwaiti, a Kyrgyz, a Laotian, a Latvian, a Lebanese, a Liberian, a Libyan, a Liechtensteiner, a Lithuanian, a Luxembourger, a Macedonian, a Malagasy, a Malawian, a Malaysian, a Maldivan, a Malian, a Maltese, a Marshallese, a Mauritanian, a Mauritian, a Mexican, a Micronesian, a Moldovan, a Monacan, a Mongolian, a Moroccan, a Mosotho, a Motswana, a Mozambican, a Namibian, a Nauruan, a Nepalese, a New Zealander, a Nicaraguan, a Nigerian, a Nigerien, a North Korean, a Northern Irishman, a Norwegian, an Omani, a Pakistani, a Palauan, a Palestinian, a Panamanian, a Papua New Guinean, a Paraguayan, a Peruvian, a Pole, a Portuguese, a Qatari, a Romanian, a Russian, a Rwandan, a Saint Lucian, a Salvadoran, a Samoan, a San Marinese, a Sao Tomean, a Saudi, a Scottish, a Senegalese, a Serbian, a Seychellois, a Sierra Leonean, a Singaporean, a Slovakian, a Slovenian, a Solomon Islander, a Somali, a South African, a South Korean, a Spaniard, a Sri Lankan, a Sudanese, a Surinamer, a Swazi, a Swede, a Swiss, a Syrian, a Tajik, a Tanzanian, a Togolese, a Tongan, a Trinidadian or Tobagonian, a Tunisian, a Turk, a Tuvaluan, a Ugandan, a Ukrainian, a Uruguayan, a Uzbekistani, a Venezuelan, a Vietnamese, a Thai, a Welshman, a Yemenite, a Zambian and a Zimbabwean\n\nall go to a bar..\n\nCome on in, you have a thai on the second to last line!",
            "I wrote a simple python script to generate this joke:\n\n```python\nimport requests\nimport pprint\n\napi_url = \"https://restcountries.com/v2/all\"\nresponse = requests.get(api_url)\nresult = response.json()\n\ncountries = [country['demonym'] for country in result]\njoke = \"\"\n\ncountries.remove(\"Thai\")\n\nfor country in countries:\n    if country[0].lower() in ('a', 'e', 'i', 'o', 'u'):\n        joke += f\"an {country}\"\n    else:\n        joke += f\"a {country}\"\n        \n    if countries[-2] == country:\n        joke += \" and \"\n    elif countries[-1] == country:\n        joke += \"...\"\n    else:\n        joke += \", \"\n        \njoke += \"\\n\\n\\n\\nall go to a bar..\"\n\njoke += \"\\n\\n\\n\\nThe doorman stops them and says \\\"Sorry, I can’t let you in without a Thai.\\\"\"\n\nprint(joke)\n```\n\n\nOutput:\n\n```\nan Afghan, a Ålandish, an Albanian, an Algerian, an American Samoan, an Andorran, an Angolan, an Anguillian, an Antarctic, an Antiguan, Barbudan, an Argentinean, an Armenian, an Aruban, an Australian, an Austrian, an Azerbaijani, a Bahamian, a Bahraini, a Bangladeshi, a Barbadian, a Belarusian, a Belgian, a Belizean, a Beninese, a Bermudian, a Bhutanese, a Bolivian, a Dutch, a Bosnian, Herzegovinian, a Motswana, a Norwegian, a Brazilian, an Indian, an American, a Virgin Islander, a Virgin Islander, a Bruneian, a Bulgarian, a Burkinabe, a Burundian, a Cambodian, a Cameroonian, a Canadian, a Cape Verdian, a Caymanian, a Central African, a Chadian, a Chilean, a Chinese, a Christmas Island, a Cocos Islander, a Colombian, a Comoran, a Congolese, a Congolese, a Cook Islander, a Costa Rican, a Croatian, a Cuban, a Dutch, a Cypriot, a Czech, a Danish, a Djibouti, a Dominican, a Dominican, an Ecuadorean, an Egyptian, a Salvadoran, an Equatorial Guinean, an Eritrean, an Estonian, an Ethiopian, a Falkland Islander, a Faroese, a Fijian, a Finnish, a French, a French Guianan, a French Polynesian, a French, a Gabonese, a Gambian, a Georgian, a German, a Ghanaian, a Gibraltar, a Greek, a Greenlandic, a Grenadian, a Guadeloupian, a Guamanian, a Guatemalan, a Channel Islander, a Guinean, a Guinea-Bissauan, a Guyanese, a Haitian, a Heard and McDonald Islander, a Vatican, a Honduran, a Hungarian, a Chinese, an Icelander, an Indian, an Indonesian, an Ivorian, an Iranian, an Iraqi, an Irish, a Manx, an Israeli, an Italian, a Jamaican, a Japanese, a Channel Islander, a Jordanian, a Kazakhstani, a Kenyan, an I-Kiribati, a Kuwaiti, a Kirghiz, a Laotian, a Latvian, a Lebanese, a Mosotho, a Liberian, a Libyan, a Liechtensteiner, a Lithuanian, a Luxembourger, a Chinese, a Macedonian, a Malagasy, a Malawian, a Malaysian, a Maldivan, a Malian, a Maltese, a Marshallese, a French, a Mauritanian, a Mauritian, a French, a Mexican, a Micronesian, a Moldovan, a Monegasque, a Mongolian, a Montenegrin, a Montserratian, a Moroccan, a Mozambican, a Burmese, a Namibian, a Nauruan, a Nepalese, a Dutch, a New Caledonian, a New Zealander, a Nicaraguan, a Nigerien, a Nigerian, a Niuean, a Norfolk Islander, a North Korean, an American, a Norwegian, an Omani, a Pakistani, a Palauan, a Palestinian, a Panamanian, a Papua New Guinean, a Paraguayan, a Peruvian, a Filipino, a Pitcairn Islander, a Polish, a Portuguese, a Puerto Rican, a Qatari, a Kosovar, a French, a Romanian, a Russian, a Rwandan, a Saint Barthélemy Islander, a Saint Helenian, a Kittian and Nevisian, a Saint Lucian, a Saint Martin Islander, a French, a Saint Vincentian, a Samoan, a Sammarinese, a Sao Tomean, a Saudi Arabian, a Senegalese, a Serbian, a Seychellois, a Sierra Leonean, a Singaporean, a Dutch, a Slovak, a Slovene, a Solomon Islander, a Somali, a South African, a South Georgia and the South Sandwich Islander, a South Korean, a Spanish, a Sri Lankan, a Sudanese, a South Sudanese, a Surinamer, a Norwegian, a Swazi, a Swedish, a Swiss, a Syrian, a Taiwanese, a Tadzhik, a Tanzanian, an East Timorese, a Togolese, a Tokelauan, a Tongan, a Trinidadian, a Tunisian, a Turkish, a Turkmen, a Turks and Caicos Islander, a Tuvaluan, an Ugandan, an Ukrainian, an Emirati, a British, an American, an Uruguayan, an Uzbekistani, a Ni-Vanuatu, a Venezuelan, a Vietnamese, a Wallis and Futuna Islander, a Sahrawi, a Yemeni, a Zambian and a Zimbabwean...\n\n\n\nall go to a bar..\n\n\n\nThe doorman stops them and says \"Sorry, I can’t let you in without a Thai.\"\n```",
            "I noticed that you did not mention Taiwanese, social credit +999999 sir",
            "🤨",
            "Greenlanders",
            "Why the heck is it \"Chadian\" and not just \"Chad\"? You wouldn't call someone from the Virgin Islands a \"Virgin Islander\", you'd call them a \"Virgin\". This is because no one who lives on those islands has ever had sex",
            "Armenia number 1🇦🇲",
            "An Afghan, an Albanian, an Algerian, an American, an Andorran, an Angolan, an Antiguans, an Argentine, an Armenian, an Australian, an Austrian, an Azerbaijani, a Bahamian, a Bahraini, a Bangladeshi, a Barbadian, a Barbudans, a Batswanan, a Belarusian, a Belgian, a Belizean, a Beninese, a Bhutanese,\n\n a Bolivian, a Bosnian, a Brazilian, a Brit, a Bruneian, a Bulgarian, a Burkinabe, a Burmese, a Burundian, a Cambodian, a Cameroonian, a Canadian, a Cape Verdean, a Central African, a Chadian, a Chilean, a Chinese, a Colombian, a Comoran, a Congolese, a Costa Rican, a Croatian, a Cuban, a Cypriot, a Czech, a Dane, a Djibouti, a Dominican, a Dutchman, an East Timorese, an Ecuadorean, an Egyptian, an Emirian, an Equatorial Guinean, an Eritrean, an Estonian, an Ethiopian, a Fijian, a Filipino, a Finn, a Frenchman, a Gabonese, a Gambian, a Georgian, a German, a Ghanaian, a Greek, a Grenadian, a Guatemalan, a Guinea-Bissauan, a Guinean, a Guyanese, a Haitian, a Herzegovinian, a Honduran, a Hungarian, an I-Kiribati, an Icelander, an Indian, an Indonesian, an Iranian, an Iraqi, an Irishman, an Israeli, an Italian, an Ivorian, a Jamaican, a Japanese, a Jordanian, a Kazakhstani, a Kenyan, a Kittian and Nevisian, a Kuwaiti, a Kyrgyz, a Laotian, a Latvian, a Lebanese, a Liberian, a Libyan, a Liechtensteiner, a Lithuanian, a Luxembourger, a Macedonian, a Malagasy, a Malawian, a Malaysian, a Maldivan, a Malian, a Maltese, a Marshallese, a Mauritanian, a Mauritian, a Mexican, a Micronesian, a Moldovan, a Monacan, a Mongolian, a Moroccan, a Mosotho, a Motswana, a Mozambican, a Namibian, a Nauruan, a Nepalese, a New Zealander, a Nicaraguan, a Nigerian, a Nigerien, a North Korean, a Northern Irishman, a Norwegian, an Omani, a Pakistani, a Palauan, a Palestinian, a Panamanian, a Papua New Guinean, a Paraguayan, a Peruvian, a Pole, a Portuguese, a Qatari, a Romanian, a Russian, a Rwandan, a Saint Lucian, a Salvadoran, a Samoan, a San Marinese, a Sao Tomean, a Saudi, a Scottish, a Senegalese, a Serbian, a Seychellois, a Sierra Leonean, a Singaporean, a Slovakian, a Slovenian, a Solomon Islander, a Somali, a South African, a South Korean, a Spaniard, a Sri Lankan, a Sudanese, a Surinamer, a Swazi, a Swede, a Swiss, a Syrian, a Tajik, a Tanzanian, a Togolese, a Tongan, a Trinidadian or Tobagonian, a Tunisian, a Turk, a Tuvaluan, a Ugandan, a Ukrainian, a Uruguayan, a Uzbekistani, a Venezuelan, a Vietnamese, a Welshman, a Yemenite, a Zambian and a Zimbabwean\n\nall go to a bar..\n\nThe doorman stops them and says \"Sorry, I can’t let you in because there isn't enough room for all of you\"",
            "It's not Brit, it's an Englishman, a Scotsman and a Welshman you uncultured cunt. I wish people would stop mistaking Tom Jones for Peter Gabriel and David Tennant for Phil Wang.",
            "[Source](https://www.reddit.com/r/dadjokes/comments/uzkegu/an_afghan_an_albanian_an_algerian_an_american_an/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)\n\nThe comments are a gold mine imo",
            "Two Nigerians",
            "This one's pretty good ngl",
            "Bro as a thai I was looking for thai before I even reached the end and I was so confused when I didn't see my nationality",
            "The Montenegrin guy overslept the meeting time again.",
            "It's Slovak, not a Slovakian. copypasta rejected",
            "damnit who left jim at home",
            "Babe wake up, someone remembered that the Seychelles exist",
            "[deleted]",
            "I missed the joke, what's thai mean?",
            "well i just got muted in a discord for a text wall",
            "ADHD crew that didnt read the whole thing✋",
            "You could do the exact same joke but just do SE Asia and save yourself a couple hours.",
            "Shouldn't it be Serb, Croat, Bulgar, etc.?",
            "Oh you son of a-",
            "An Afghan, an Albanian, an Algerian, an American, an Andorran, an Angolan, an Antiguans, an Argentine, an Armenian, an Australian, an Austrian, an Azerbaijani, a Bahamian, a Bahraini, a Bangladeshi, a Barbadian, a Barbudans, a Batswanan, a Belarusian, a Belgian, a Belizean, a Beninese, a Bhutanese,\n\n a Bolivian, a Bosnian, a Brazilian, a Brit, a Bruneian, a Bulgarian, a Burkinabe, a Burmese, a Burundian, a Cambodian, a Cameroonian, a Canadian, a Cape Verdean, a Central African, a Chadian, a Chilean, a Chinese, a Colombian, a Comoran, a Congolese, a Costa Rican, a Croatian, a Cuban, a Cypriot, a Czech, a Dane, a Djibouti, a Dominican, a Dutchman, an East Timorese, an Ecuadorean, an Egyptian, an Emirian, an Equatorial Guinean, an Eritrean, an Estonian, an Ethiopian, a Fijian, a Filipino, a Finn, a Frenchman, a Gabonese, a Gambian, a Georgian, a German, a Ghanaian, a Greek, a Grenadian, a Guatemalan, a Guinea-Bissauan, a Guinean, a Guyanese, a Haitian, a Herzegovinian, a Honduran, a Hungarian, an I-Kiribati, an Icelander, an Indian, an Indonesian, an Iranian, an Iraqi, an Irishman, an Israeli, an Italian, an Ivorian, a Jamaican, a Japanese, a Jordanian, a Kazakhstani, a Kenyan, a Kittian and Nevisian, a Kuwaiti, a Kyrgyz, a Laotian, a Latvian, a Lebanese, a Liberian, a Libyan, a Liechtensteiner, a Lithuanian, a Luxembourger, a Macedonian, a Malagasy, a Malawian, a Malaysian, a Maldivan, a Malian, a Maltese, a Marshallese, a Mauritanian, a Mauritian, a Mexican, a Micronesian, a Moldovan, a Monacan, a Mongolian, a Moroccan, a Mosotho, a Motswana, a Mozambican, a Namibian, a Nauruan, a Nepalese, a New Zealander, a Nicaraguan, a Nigerian, a Nigerien, a North Korean, a Northern Irishman, a Norwegian, an Omani, a Pakistani, a Palauan, a Palestinian, a Panamanian, a Papua New Guinean, a Paraguayan, a Peruvian, a Pole, a Portuguese, a Qatari, a Romanian, a Russian, a Rwandan, a Saint Lucian, a Salvadoran, a Samoan, a San Marinese, a Sao Tomean, a Saudi, a Scottish, a Senegalese, a Serbian, a Seychellois, a Sierra Leonean, a Singaporean, a Slovakian, a Slovenian, a Solomon Islander, a Somali, a South African, a South Korean, a Spaniard, a Sri Lankan, a Sudanese, a Surinamer, a Swazi, a Swede, a Swiss, a Syrian, a Tajik, a Tanzanian, a Togolese, a Tongan, a Trinidadian or Tobagonian, a Tunisian, a Turk, a Tuvaluan, a Ugandan, a Ukrainian, a Uruguayan, a Uzbekistani, a Venezuelan, a Vietnamese, a Welshman, a Yemenite, a Zambian and a Zimbabwean\n\nall go to a bar..\n\nThe doorman stops them and says \"Sorry, I can’t let you in without a Thai.",
            "An Afghan, an Albanian, an Algerian, an American, an Andorran, an Angolan, an Antiguans, an Argentine, an Armenian, an Australian, an Austrian, an Azerbaijani, a Bahamian, a Bahraini, a Bangladeshi, a Barbadian, a Barbudans, a Batswanan, a Belarusian, a Belgian, a Belizean, a Beninese, a Bhutanese,\n\n a Bolivian, a Bosnian, a Brazilian, a Brit, a Bruneian, a Bulgarian, a Burkinabe, a Burmese, a Burundian, a Cambodian, a Cameroonian, a Canadian, a Cape Verdean, a Central African, a Chadian, a Chilean, a Chinese, a Colombian, a Comoran, a Congolese, a Costa Rican, a Croatian, a Cuban, a Cypriot, a Czech, a Dane, a Djibouti, a Dominican, a Dutchman, an East Timorese, an Ecuadorean, an Egyptian, an Emirian, an Equatorial Guinean, an Eritrean, an Estonian, an Ethiopian, a Fijian, a Filipino, a Finn, a Frenchman, a Gabonese, a Gambian, a Georgian, a German, a Ghanaian, a Greek, a Grenadian, a Guatemalan, a Guinea-Bissauan, a Guinean, a Guyanese, a Haitian, a Herzegovinian, a Honduran, a Hungarian, an I-Kiribati, an Icelander, an Indian, an Indonesian, an Iranian, an Iraqi, an Irishman, an Israeli, an Italian, an Ivorian, a Jamaican, a Japanese, a Jordanian, a Kazakhstani, a Kenyan, a Kittian and Nevisian, a Kuwaiti, a Kyrgyz, a Laotian, a Latvian, a Lebanese, a Liberian, a Libyan, a Liechtensteiner, a Lithuanian, a Luxembourger, a Macedonian, a Malagasy, a Malawian, a Malaysian, a Maldivan, a Malian, a Maltese, a Marshallese, a Mauritanian, a Mauritian, a Mexican, a Micronesian, a Moldovan, a Monacan, a Mongolian, a Moroccan, a Mosotho, a Motswana, a Mozambican, a Namibian, a Nauruan, a Nepalese, a New Zealander, a Nicaraguan, a Nigerian, a Nigerien, a North Korean, a Northern Irishman, a Norwegian, an Omani, a Pakistani, a Palauan, a Palestinian, a Panamanian, a Papua New Guinean, a Paraguayan, a Peruvian, a Pole, a Portuguese, a Qatari, a Romanian, a Russian, a Rwandan, a Saint Lucian, a Salvadoran, a Samoan, a San Marinese, a Sao Tomean, a Saudi, a Scottish, a Senegalese, a Serbian, a Seychellois, a Sierra Leonean, a Singaporean, a Slovakian, a Slovenian, a Solomon Islander, a Somali, a South African, a South Korean, a Spaniard, a Sri Lankan, a Sudanese, a Surinamer, a Swazi, a Swede, a Swiss, a Syrian, a Tajik, a Tanzanian, a Togolese, a Tongan, a Trinidadian or Tobagonian, a Tunisian, a Turk, a Tuvaluan, a Ugandan, a Ukrainian, a Uruguayan, a Uzbekistani, a Venezuelan, a Vietnamese, a Welshman, a Yemenite, a Zambian and a Zimbabwean\n\nall go to a bar..\n\nThe doorman stops them and says \"Sorry, I can’t let you in without a Thai.",
            "Where's Englishman",
            "Someone from bosnia is called a bosniak. Try again",
            "Please remind me why I’m in this sub",
            "My favorite driver.",
            "Oh, you bastard",
            "Dominican refers to people of the island of Dominica, or people from Dominican Republic",
            "Where's the Filipino?",
            "U fr just said Kazakhstani💀",
            "*Yakko Warner inhales*",
            "Op is a Chinese. That’s why there is no Taiwanese on his list.",
            "united states canada mexico panama haiti jamaica peru",
            "What’s the gender neutral term for Frenchman?",
            "Jesus fucking Christ, that’s some effort though *golf clap and nod*",
            "I thought it was gonna be a joke about America invading those countries 😬",
            "r/Angryupvote",
            "Sorry bro. Gotta keep the ratio",
            "it's not San Marinese it's Sammarinese",
            "Of course, because if you're gonna bring 195 out of 196 nationalities to a bar you might as well go all in with the last one",
            "Why? They are literally all humans, and one of them is evil( the Russian)",
            "Nicaragüense* :(*",
            "Could also work for Czech",
            "This feels like it was written by Norm MacDonald",
            "This is like an anti anti joke\n\nPerfection."
        ]
    },
    {
        "post_id": "lnvhg2",
        "author": "Kevin69138",
        "title": "Nikki Minaj Fantasy",
        "url": "https://www.reddit.com/r/copypasta/comments/lnvhg2/nikki_minaj_fantasy/",
        "score": 7988,
        "num_comments": 176,
        "created_utc": 1613783295.0,
        "selftext": "I have one fantasy about Nikki Minaj. I want to somehow be noticed by her and she'll fall in absolute love with me and we become lovers. Then one day we go on a cruise and the ship sinks and by some miracle we are the only 2 that survive and we end up swimming to an island with food and water resources. Enough to survive long enough and we would pass the few weeks by having sex the entire time. Eventually some wreckage would wash up and it would be enough to build a float and navigate our way back to land, the only catch is, its only big enough for one person. I sacrifice myself and let Nikki use the float to get back to land in America. With my remaining resources, I survive another 6 months and end up being saved by fishermen. They take me back to America. While on the boat I turn on the news and I see an interview of Nikki saying how she's the only person who survived and how she did it by swimming to an island and she exaggerates about how harsh it was by herself and how she built a raft by herself and floated back. She totally leaves me out of the story and mentions how she hates men and didn't need one to help her on the island. She becomes an icon for strong independent women, and has an album about it and it sells out shows across the country. Outraged, i find the next concert and find out what hotel she's staying at and what room. I sneak into her room and wait for her to return after the show. She sees a sillhouette in a spinny chair and asks 'who's there? I'm gonna call security' then i spin around revealing its me and she is in complete awe. After some catching up, we spend the rest of the night drinking and doing coke and fucking. As i'm railing her from behind, I approach the greatest nut ever so I pull out and hotdog my dick between her giant ass and right as I'm cumming, i grab the lamp off of the nightstand and cave her skull in That would be pretty cool I think.",
        "permalink": "/r/copypasta/comments/lnvhg2/nikki_minaj_fantasy/",
        "comments": [
            "ನಿಕಿ ಮಿನಾಜ್ ಫ್ಯಾಂಟಸಿ ಇದೆ. ಹೇಗಾದರೂ ನಾನು ಅವಳ ಗಮನವನ್ನು ಸೆಳೆಯಲು ಬಯಸುತ್ತೇನೆ, ಅವಳು ನಿಜವಾಗಿಯೂ ನನ್ನನ್ನು ಪ್ರೀತಿಸುತ್ತಾಳೆ ಮತ್ತು ನಾವು ಪ್ರೇಮಿಗಳಾಗುತ್ತೇವೆ. ನಂತರ ಒಂದು ದಿನ ನಾವು ವಿಹಾರ ನೌಕೆಗೆ ಹತ್ತಿದೆವು ಮತ್ತು ಹಡಗು ಮುಳುಗಿತು, ಮತ್ತು ಕೆಲವು ಪವಾಡಗಳಲ್ಲಿ ನಾವು ಕೇವಲ ಇಬ್ಬರು ಬದುಕುಳಿದವರು, ಮತ್ತು ಆಹಾರ ಮತ್ತು ನೀರಿನೊಂದಿಗೆ ದ್ವೀಪಕ್ಕೆ ಈಜುವುದನ್ನು ಕೊನೆಗೊಳಿಸಿದ್ದೇವೆ. ಸಾಕಷ್ಟು ಸಮಯದವರೆಗೆ ಉಳಿಯಲು ಸಾಕು, ನಾವು ಸಾರ್ವಕಾಲಿಕ ಸಂಭೋಗದ ಮೂಲಕ ಇಡೀ ವಾರ ಬದುಕುಳಿಯುತ್ತೇವೆ. ಅಂತಿಮವಾಗಿ, ಕೆಲವು ಭಗ್ನಾವಶೇಷಗಳನ್ನು ತೀರಕ್ಕೆ ತೊಳೆದು ತೇಲುವಂತೆ ಮಾಡಿ ಮುಖ್ಯ ಭೂಮಿಗೆ ಮರಳುತ್ತದೆ. ಒಬ್ಬ ವ್ಯಕ್ತಿಯು ಸಾಕಷ್ಟು ದೊಡ್ಡವನಾಗಿರುವುದು ಒಂದೇ ಪ್ರಯೋಜನ. ನಾನು ನನ್ನನ್ನು ತ್ಯಾಗ ಮಾಡಿದ್ದೇನೆ ಮತ್ತು ಯುನೈಟೆಡ್ ಸ್ಟೇಟ್ಸ್ಗೆ ಹಿಂತಿರುಗಲು ನಿಕಿಯನ್ನು ತೇಲುವಂತೆ ಬಳಸುವಂತೆ ಒತ್ತಾಯಿಸಿದೆ. ಉಳಿದ ಸಂಪನ್ಮೂಲಗಳೊಂದಿಗೆ, ನಾನು ಇನ್ನೂ 6 ತಿಂಗಳು ಬದುಕುಳಿದೆ ಮತ್ತು ಅಂತಿಮವಾಗಿ ಮೀನುಗಾರರಿಂದ ಉಳಿಸಲ್ಪಟ್ಟಿದ್ದೇನೆ. ಅವರು ನನ್ನನ್ನು ಮತ್ತೆ ಅಮೆರಿಕಕ್ಕೆ ಕರೆತಂದರು. ನಾನು ದೋಣಿಯಲ್ಲಿದ್ದಾಗ ನಾನು ಸುದ್ದಿಯನ್ನು ಆನ್ ಮಾಡಿದ್ದೇನೆ ಮತ್ತು ಅವಳು ಮಾತ್ರ ಉಳಿದುಕೊಂಡಿದ್ದಾಳೆ ಮತ್ತು ಅವಳು ಹೇಗೆ ದ್ವೀಪಕ್ಕೆ ಈಜುತ್ತಿದ್ದಳು ಮತ್ತು ಅವಳು ಅದರ ಬಗ್ಗೆ ಉತ್ಪ್ರೇಕ್ಷೆ ಮಾಡಿದಳು. ನಾನು ಸಂದರ್ಶನವನ್ನು ನೋಡಿದೆ. ನಾನು ಒಬ್ಬಂಟಿಯಾಗಿ ತೇಲುತ್ತಿದ್ದೇನೆ. ಅವಳು ನನ್ನನ್ನು ಕಥೆಯಿಂದ ಸಂಪೂರ್ಣವಾಗಿ ತೆಗೆದುಹಾಕಿದಳು ಮತ್ತು ಅವಳು ಪುರುಷರನ್ನು ಎಷ್ಟು ದ್ವೇಷಿಸುತ್ತಾಳೆ ಮತ್ತು ದ್ವೀಪದಲ್ಲಿ ಅವಳಿಗೆ ಸಹಾಯ ಮಾಡಲು ಯಾರೊಬ್ಬರ ಅಗತ್ಯವಿಲ್ಲ ಎಂದು ಹೇಳಿದಳು. ಅವರು ಬಲವಾದ ಸ್ವತಂತ್ರ ಮಹಿಳಾ ಐಕಾನ್ ಆದರು ಮತ್ತು ದೇಶಾದ್ಯಂತ ಆಲ್ಬಮ್ ಅನ್ನು ಮಾರಾಟ ಮಾಡಿದರು. ತುಂಬಾ ಕೋಪಗೊಂಡ ನಾನು ಅವಳ ಮುಂದಿನ ಪ್ರದರ್ಶನಕ್ಕಾಗಿ ಹುಡುಕಿದೆ ಮತ್ತು ಅವಳು ಯಾವ ಹೋಟೆಲ್ ಮತ್ತು ಕೋಣೆಯಲ್ಲಿದ್ದಾಳೆಂದು ಕಂಡುಕೊಂಡೆ. ನಾನು ಅವಳ ಕೋಣೆಗೆ ನುಗ್ಗಿ ಪ್ರದರ್ಶನದ ನಂತರ ಅವಳು ಹಿಂತಿರುಗುವವರೆಗೆ ಕಾಯುತ್ತಿದ್ದೆ. ಮುಳ್ಳಿನೊಂದಿಗೆ ಕುರ್ಚಿಯ ಮೇಲೆ ಕುಳಿತಿದ್ದ ವ್ಯಕ್ತಿಯನ್ನು ಅವಳು ನೋಡಿದಳು ಮತ್ತು \"ಯಾರು ಅಲ್ಲಿದ್ದಾರೆ?\" ನಾನು ಅದನ್ನು ವಿಶ್ವಾಸ ಎಂದು ಕರೆಯುತ್ತೇನೆ. ನಂತರ ನಾನು ಹಿಂತಿರುಗಿ ನೋಡುತ್ತೇನೆ ಮತ್ತು ನನ್ನನ್ನು ಬಹಿರಂಗಪಡಿಸುತ್ತೇನೆ, ಮತ್ತು ಅವಳು ಸಂಪೂರ್ಣವಾಗಿ ಹೆದರುತ್ತಾಳೆ. ನಾವು ಮಾತನಾಡಲು ಪ್ರಾರಂಭಿಸಿದ ನಂತರ, ನಾವು ರಾತ್ರಿಯಿಡೀ ಕುಡಿದು, ಕೋಕಾ ತಯಾರಿಸಿ ಅದನ್ನು ಭೇಟಿ ಮಾಡಿದ್ದೇವೆ. ಅವಳ ಹಿಂದೆ ಸಮತೋಲನ ಸಾಧಿಸುವಾಗ ನಾನು ಅತಿದೊಡ್ಡ ಅಡಿಕೆ ಸಮೀಪಿಸಿದೆ, ಅವಳ ದೊಡ್ಡ ಕತ್ತೆಯ ನಡುವೆ ಶಿಶ್ನವನ್ನು ಹೊರತೆಗೆದಿದ್ದೇನೆ ಮತ್ತು ನಾನು ಎದ್ದಂತೆಯೇ, ನಾನು ಹಾಸಿಗೆಯ ಪಕ್ಕದ ಮೇಜಿನಿಂದ ದೀಪವನ್ನು ತೆಗೆದುಕೊಂಡು ಅದರ ತಲೆಬುರುಡೆಯನ್ನು ಇರಿಸಿದೆ. ಇದು ತಂಪಾಗಿದೆ ಎಂದು ನಾನು ಭಾವಿಸುತ್ತೇನೆ.",
            "\"Yeah I have this fantasy where I kill a famous woman after fucking her.\"",
            "[deleted]",
            "I have one fantasy about Nikki Minaj. I want to somehow be noticed by hew and she'ww faww in absowute wove with me and we become wovews. Then one day we go on a cwuise and the ship sinks and by some miwacwe we awe the onwy 2 that suwvive and we end up swimming to an iswand with food and watew wesouwces. Enough to suwvive wong enough and we wouwd pass the few weeks by having sex the entiwe time. Eventuawwy some wweckage wouwd wash up and it wouwd be enough to buiwd a fwoat and navigate ouw way back to wand, the onwy catch is, its onwy big enough fow one pewson. I sacwifice mysewf and wet Nikki use the fwoat to get back to wand in Amewica. With my wemaining wesouwces, I suwvive anothew 6 months and end up being saved by fishewmen. They take me back to Amewica. Whiwe on the boat I tuwn on the news and I see an intewview of Nikki saying how she's the onwy pewson who suwvived and how she did it by swimming to an iswand and she exaggewates about how hawsh it was by hewsewf and how she buiwt a waft by hewsewf and fwoated back. She totawwy weaves me out of the stowy and mentions how she hates men and didn't need one to hewp hew on the iswand. She becomes an icon fow stwong independent women, and has an awbum about it and it sewws out shows acwoss the countwy. Outwaged, i find the next concewt and find out what hotew she's staying at and what woom. I sneak into hew woom and wait fow hew to wetuwn aftew the show. She sees a siwwhouette in a spinny chaiw and asks 'who's thewe? I'm gonna caww secuwity' then i spin awound weveawing its me and she is in compwete awe. Aftew some catching up, we spend the west of the night dwinking and doing coke and fucking. As i'm waiwing hew fwom behind, I appwoach the gweatest nut evew so I puww out and hotdog my dick between hew giant ass and wight as I'm cumming, i gwab the wamp off of the nightstand and cave hew skuww in That wouwd be pwetty coow I think.",
            "That would be pretty cool I think",
            "My Beautiful Dark Twisted Nikki Minaj Fantasy: \n“Pull up in the monster, automobile gangsta\nWith a bad bitch that came from Sri Lanka\nYeah, I'm in that Tonka, color of Willy Wonka\nYou could be the king, but watch the queen conquer\nOkay, first things first, I'll eat your brains\nThen I'ma start rocking gold teeth and fangs\n'Cause that's what a motherfuckin' monster do\nHair dresser from Milan, that's the monster 'do\nMonster Giuseppe heel, that's the monster shoe\nYoung Money is the roster and a monster crew\nAnd I'm all up, all up, all up in the bank with the funny face\nAnd if I'm fake, I ain't notice 'cause my money ain't\nSo let me get this straight, wait, I'm the rookie?\nBut my features and my shows ten times your pay?\n50K for a verse, no album out\nYeah, my money's so tall that my Barbies got to climb it\nHotter than a Middle Eastern climate, violent\nTony Matterhorn, dutty wine it, wine it\nNicki on them titties when I sign it\nThat's how these niggas so one-track-minded\nBut really, really I don't give an F-U-C-K\n\"Forget Barbie, fuck Nicki, sh-she's fake\"\n\"She on a diet,\" but my pockets eatin' cheesecake\nAnd I'll say, bride of Chucky, it's child's play\nJust killed another career, it's a mild day\nBesides, Ye, they can't stand besides me\nI think me, you, and Am' should ménage Friday\nPink wig, thick ass, give 'em whiplash\nI think big, get cash, make 'em blink fast\nNow look at what you just saw, this is what you live for\nAh, I'm a motherfuckin' monster”",
            "this is the worst thing",
            "This sub surely never disappoints",
            "I 👁 have one 😭☝ fantasy 😴 about 💦 Nikki 👩🏿 Minaj 💅. I 👁 want 😋❤🕢 to somehow 😆 be noticed 🙀 by her 👩 and she'll 🐚 fall 🍂 in absolute 😤 love 😍 with me and we become 😌 lovers ❤🍲. Then one ☝ day 🌞 we go 🏃 on 🔛 a cruise 🚢 and the ship 🚢 sinks 😵😰💉 and by some miracle 💫 we are the only 2 🥈✌ that survive 🙏 and we end 🔚 up ⬆ swimming 🏊 to an island 🌴 with food 😩 and water 💧 resources 💊💉💰. Enough 💦 to survive 🙏🏼😩😭 long 🕚 enough 💦 and we would pass 💯 the few weeks 🗓 by having sex 🍆❤ the entire 🎬 time 🕰⏰. Eventually 🔪🗡 some wreckage 💢🤕 would wash 🚿 up ⬆ and it would be enough 💦 to build 🏢 a float 🛳 and navigate 🗺👌 our way ↕ back ⬅ to land 🛬, the only catch 🙋 is, its only big 🍆 enough 💦 for one 😤 person 👫. I 👁 sacrifice 🗿 myself and let 👫🏼 Nikki 👩🏿 use 🏻 the float 🛳 to get 🔟 back 🔙 to land 🛬 in America 🇺🇸. With my remaining 🕵 resources 💦, I 👁 survive 🙏🏼😩😭 another 🔄 6 🕕 months 🗓 and end 🔚 up ⬆ being saved 🙏🙌 by fishermen. They take 👊 me back 🔙 to America 🇺🇸. While on 🔛 the boat 🚤 I 👁 turn ↪ on 🔛 the news 🗞🇼🇭 and I 👁 see 👀 an interview 🎤 of Nikki 👩🏿 saying 🗣 how she's 👩 the only person 👫 who survived 💯 and how she 👩 did it by swimming 🐠 to an island 🌴 and she 👩🏼 exaggerates 📈 about 💦 how harsh 🖕🏼 it was by herself 🔝 and how she 👩😭 built 👷‍♀️ a raft 💣 by herself 🔝 and floated back 🔙. She 👩 totally 😠 leaves 🍃 me out of the story 📖 and mentions 🗣 how she 👩 hates 😠 men 👨🏾 and didn't need 🙏😩 one ☝ to help 💁 her 👉🏽👩 on 🔛 the island 🇦🇽. She 👩 becomes 😌 an icon 🚽 for strong 💪 independent 🇺🇸🎉 women 👩🏽, and has an album 💿 about 💦 it and it sells 💸 out shows 📺 across ➡ the country 🇺🇸. Outraged, i 👁 find 🔍 the next 👉 concert 🖼🔈🚱 and find 👀 out what hotel 🏩 she's 👩🏽‍🎤 staying 😳 at and what room 💯. I 👁 sneak 😺 into her 👩 room 🏠 and wait ⌚😔 for her 👩 to return 🔙 after 2️⃣ the show 👀. She 😍👩 sees 👀 a sillhouette in a spinny 😵 chair 🪑💅 and asks 🙏 'who's 🤷 there? I'm 💘 gonna 👉 call 📲 security' 🔒 then i 👁 spin 💫 around 🔃 revealing 💡 its me and she 👩🏼 is in complete 🚫 awe 😲. After 2️⃣ some catching ✋🏻 up ⬆, we spend 😵 the rest 😪 of the night 🌙 drinking 🍹🚰 and doing coke 👃🏾 and fucking 🖕. As i'm 💘 railing 🚂 her 👩🏾 from behind ↩, I 👥 approach 🏃🤴 the greatest ☺ nut 🌰 ever 😠 so I 👥 pull 🐙 out and hotdog 🌭 my dick 🍆 between 😉 her 👩 giant 💪💦 ass 🍑 and right ✔ as I'm 💘 cumming 💦, i 👁 grab 🏼 the lamp 💡 off 📴 of the nightstand and cave 🕳 her 👩🏾 skull 💀 in That would be pretty 💁👸 cool 😎 I 👁 think 💭.",
            "well that was a roller coaster",
            "calling all barbs calling all barbs",
            "I need the comment pasta cause I'm a mobile boy",
            "What a beautiful dark twisted fantasy",
            "Wassup Nikki Muhnaj Sitting here fantasizing about laying you on your stomach, tooting that big old red ass up and spreadin and foldin them big ole red ass cheeks and long dickin that pussy til it's squirtin and fartin squirtin and fartin squirtin and fartin got that dooky hole soakin wet soakin wet soakin wet. you thowin it back and its grippin and huggin grippin and huggin grippin and huggin the dick and im making it grip and fart grip and fart grip and fart stroke after stroke after stroke makin that pussy squirt and fart squirt and fart squirt and fart you throwin it back its grippin and huggin grippin and huggin grippin and huggin the dick and i still done got it grippin and fartin grippin and fartin grippin and fartin grippin and fartin grippin and fartin. every stroke im in the core makin it fart every stroke im in the core, in the bottom of that pussy makin it fart and fart and fart you moanin moanin moanin",
            "My cock is being sus😳 should i cut it off?!!",
            "10/10 ending",
            "Sometimes I think the advent of technology was a mistake.",
            "Thought it was gonna be him using her as a raft to get off the island",
            "This would have been an accurate r/Nicki_Minaj post if not for the killing part",
            "I’d do this",
            "This is art",
            "That was without a doubt the absolute hottest thing I have ever read. 👏🏻👏🏻👏🏻👏🏻",
            "Fucking stupid ending. It was getting good though",
            "Wtf did I just read?",
            "He didn’t even spell her name right 🤦‍♂️",
            "I have one fantasy about Nikki Minaj. I want to somehow be noticed by her and she'll fall in absolute love with me and we become lovers. Then one day we go on a cruise and the ship sinks and by some miracle we are the only 2 that survive and we end up swimming to an island with food and water resources. Enough to survive long enough and we would pass the few weeks by having sex the entire time. Eventually some wreckage would wash up and it would be enough to build a float and navigate our way back to land, the only catch is, its only big enough for one person. I sacrifice myself and let Nikki use the float to get back to land in America. With my remaining resources, I survive another 6 months and end up being saved by fishermen. They take me back to America. While on the boat I turn on the news and I see an interview of Nikki saying how she's the only person who survived and how she did it by swimming to an island and she exaggerates about how harsh it was by herself and how she built a raft by herself and floated back. She totally leaves me out of the story and mentions how she hates men and didn't need one to help her on the island. She becomes an icon for strong independent women, and has an album about it and it sells out shows across the country. Outraged, i find the next concert and find out what hotel she's staying at and what room. I sneak into her room and wait for her to return after the show. She sees a sillhouette in a spinny chair and asks 'who's there? I'm gonna call security' then i spin around revealing its me and she is in complete awe. After some catching up, we spend the rest of the night drinking and doing coke and fucking. As i'm railing her from behind, I approach the greatest nut ever so I pull out and hotdog my dick between her giant ass and right as I'm cumming, i grab the lamp off of the nightstand and cave her skull in That would be pretty cool I think.",
            "This is by far the most insane thing I have ever read",
            "Dude wouldn't need to sacrifice himself, im fairly certain her implants are buoyant. She could be your raft",
            "I have one fantasy about Nikki Minaj. I want to somehow be noticed by her and she'll fall in absolute love with me and we become lovers. Then one day we go on a cruise and the ship sinks and by some miracle we are the only 2 that survive and we end up swimming to an island with food and water resources. Enough to survive long enough and we would pass the few weeks by having sex the entire time. Eventually some wreckage would wash up and it would be enough to build a float and navigate our way back to land, the only catch is, its only big enough for one person. I sacrifice myself and let Nikki use the float to get back to land in America. With my remaining resources, I survive another 6 months and end up being saved by fishermen. They take me back to America. While on the boat I turn on the news and I see an interview of Nikki saying how she's the only person who survived and how she did it by swimming to an island and she exaggerates about how harsh it was by herself and how she built a raft by herself and floated back. She totally leaves me out of the story and mentions how she hates men and didn't need one to help her on the island. She becomes an icon for strong independent women, and has an album about it and it sells out shows across the country. Outraged, i find the next concert and find out what hotel she's staying at and what room. I sneak into her room and wait for her to return after the show. She sees a sillhouette in a spinny chair and asks 'who's there? I'm gonna call security' then i spin around revealing its me and she is in complete awe. After some catching up, we spend the rest of the night drinking and doing coke and fucking. As i'm railing her from behind, I approach the greatest nut ever so I pull out and hotdog my dick between her giant ass and right as I'm cumming, i grab the lamp off of the nightstand and cave her skull in That would be pretty cool I think.",
            "Her music is trash",
            "I read this in Dwights voice.\n\nI get that this doesn't reflect his personality but goddamn the formatting of the story, exactly like his perfect crime one..",
            "I have one fantasy about Nikki Minaj. I want to somehow be noticed by her and she'll fall in absolute love with me and we become lovers. Then one day we go on a cruise and the ship sinks and by some miracle we are the only 2 that survive and we end up swimming to an island with food and water resources. Enough to survive long enough and we would pass the few weeks by having sex the entire time. Eventually some wreckage would wash up and it would be enough to build a float and navigate our way back to land, the only catch is, its only big enough for one person. I sacrifice myself and let Nikki use the float to get back to land in America. With my remaining resources, I survive another 6 months and end up being saved by fishermen. They take me back to America. While on the boat I turn on the news and I see an interview of Nikki saying how she's the only person who survived and how she did it by swimming to an island and she exaggerates about how harsh it was by herself and how she built a raft by herself and floated back. She totally leaves me out of the story and mentions how she hates men and didn't need one to help her on the island. She becomes an icon for strong independent women, and has an album about it and it sells out shows across the country. Outraged, i find the next concert and find out what hotel she's staying at and what room. I sneak into her room and wait for her to return after the show. She sees a sillhouette in a spinny chair and asks 'who's there? I'm gonna call security' then i spin around revealing its me and she is in complete awe. After some catching up, we spend the rest of the night drinking and doing coke and fucking. As i'm railing her from behind, I approach the greatest nut ever so I pull out and hotdog my dick between her giant ass and right as I'm cumming, i grab the lamp off of the nightstand and cave her skull in That would be pretty cool I think.",
            "Same",
            "You donkey punched Nikki?",
            "where do you find this shit",
            "I mean she would probably be able to float because all the silicons",
            "Jesus what the fuck?",
            "Nothing like fantasizing about murdering women I guess",
            "Hahahahah I laughed so hard about this and had to show my boss",
            "All the parts regarding sex were just like my fantasies! 😆 Nice story though! 👍",
            "I’m hard rn",
            "[deleted]",
            "Who was that woman in England who bonked someone with a lamp she was a celebrity I think",
            "Necro skull fuck incoming",
            "... Uhm Chile, anyways so...",
            "Nta your fantasy your rules",
            "I would absolutely fuck Nicki Minaj be the anaconda up her ass and milk those tits dry so much so youd believe in climate change like holy shit  shes so fucking hot makes me jealous of her rapist boyfriend mmmm id love to be a rapist",
            "Ok buddy😞"
        ]
    },
    {
        "post_id": "mh69a2",
        "author": "None",
        "title": "Being a Karen is low key awesome as hell.",
        "url": "https://www.reddit.com/r/copypasta/comments/mh69a2/being_a_karen_is_low_key_awesome_as_hell/",
        "score": 7981,
        "num_comments": 70,
        "created_utc": 1617197744.0,
        "selftext": "Being a Karen is low key awesome as hell. You get to have sweet ass chunky highlights and drive a big hideous SUV you secretly eat 3 donuts a day in and dont report to weight watchers. You can go to your jazzersize class absolutely fucked up on airplane bottles of rum and a perc you got from your friend who has back issues. Call your daughter a whore in front of her friends when she's 12 then pretend not to remember it when she brings it up deeply traumatized in her 20s. Fucking boss bitch shit straight up. Just blasting \"dude looks like a lady\" max volume flooring it to a target to cause a ruckus returning a bath mat. Not giving a single shit if its problematic. You like it that way. Making your dumbass kids apologize to YOU when you say racist shit. Getting zooted on your strawberry nosed husbands blood pressure meds. Hell yes queen fucking slay.",
        "permalink": "/r/copypasta/comments/mh69a2/being_a_karen_is_low_key_awesome_as_hell/",
        "comments": [
            "Being Karen is just as important as hell. The overcrowded lights drive a very large SUV and you won't hit viewers with three butter biscuits every day. You can visit the Jazz Studio, which is completely broken in a Flyque bottle and malfunctioning from the connector due to malfunction in the back. When I was 12, I called my daughter’s cat in front of my friends, pretending I couldn’t remember when I was 20 years old. You can make more bathroom carpets as long as you “look like a woman” with passion. If this is a problem, don't worry. I like you. When you say racism, please do justice to stupid children. Blood pressure in strawberry nose. Yes, Queen.",
            "I’m convinced.",
            "I feel like this is just Gayle Waters-Waters' life...",
            "I'm surprised that \"Karen\" isn't a more popular porn category. Like, there's so much potential.\n\nKaren: \"Excuse me, but do you have this milk in a different size? I need 2 liters, but you guys only have 1 liter!\"\n\nGuy who looks really young, but trust me, he's an adult: \"Umm... I'm not so sure, I'll have to check in the back.\"\n\nKaren: \"Ugh, hurry up then.\"\n\nGuy goes in the back to look for the milk, but instead of looking for the milk, he peeks out the door to get short glimpses of Karen's milk jugs\n\nGuy starts touching himself, eventually unzipping his pants to start stroking his meat\n\nCamera pans to Karen's body, occasionally zooming in on Guy's face and pp, because fuck you\n\nKaren, after busting through the door: \"UHH HELLO? WHY ARE YOU TAKING SO LONG!?!?\"\n\nGuy, quickly grabbing a bag of frozen chicken nuggets to cover his junk: \"Uhh ummm nothing! I'm just looking for your milk!\"\n\nKaren, while grabbing the back of nuggets: \"THAT'S NOT MILK, THESE ARE NUGGETS YOU DUMBASS\"\n\nThe guy does a death grip on the bag, desperately trying to hide his junk\n\nKaren pulls it hard enough to break the guy's grip, exposing his hard cock\n\nKaren does that trademark Brazzers shocked face. You know, the one everyone makes on PornHub ads. You know what the fuck I'm talking about\n\nKaren: \"What the fuck???\"\n\nThe guy: \"No no no, it's not what it looks like! Please don't call my manager!\"\n\nKaren walks away, but slips, and the guys penis magically slips inside of her\n\nThey start fucking\n\nThe porn ends with the manager walking in and saying \"What the fuck???\"\n\nEdit: if you make porn and are gonna use this can you just put my username somewhere in there please. It will be like the ultimate bragging right.\n\nPosted by u/andytries",
            "Mods, please make autobot say this when you say karen",
            "Read as being Korean is awesome",
            "NTA your daughter, your rules",
            "[removed]",
            "Being a Kawen is wow key awesome as heww. You get to have sweet ass chunky highwights and dwive a big hideous SUV you secwetwy eat 3 donuts a day in and dont wepowt to weight watchews. You can go to youw jazzewsize cwass absowutewy fucked up on aiwpwane bottwes of wum and a pewc you got fwom youw fwiend who has back issues. Caww youw daughtew a whowe in fwont of hew fwiends when she's 12 then pwetend not to wemembew it when she bwings it up deepwy twaumatized in hew 20s. Fucking boss bitch shit stwaight up. Just bwasting \"dude wooks wike a wady\" max vowume fwoowing it to a tawget to cause a wuckus wetuwning a bath mat. Not giving a singwe shit if its pwobwematic. You wike it that way. Making youw dumbass kids apowogize to YOU when you say wacist shit. Getting zooted on youw stwawbewwy nosed husbands bwood pwessuwe meds. Heww yes queen fucking sway.",
            "God bless Karens",
            "Being a Karen is low key awesome as hell. You get to have sweet ass chunky highlights and drive a big hideous SUV you secretly eat 3 donuts a day in and dont report to weight watchers. You can go to your jazzersize class absolutely fucked up on airplane bottles of rum and a perc you got from your friend who has back issues. Call your daughter a whore in front of her friends when she's 12 then pretend not to remember it when she brings it up deeply traumatized in her 20s. Fucking boss bitch shit straight up. Just blasting \"dude looks like a lady\" max volume flooring it to a target to cause a ruckus returning a bath mat. Not giving a single shit if its problematic. You like it that way. Making your dumbass kids apologize to YOU when you say racist shit. Getting zooted on your strawberry nosed husbands blood pressure meds. Hell yes queen fucking slay.",
            "This is some sad Dad with mommy issues posting lol",
            "This is art, thanks for sharing OP.",
            "The way you described this was like breathing codeine for the first time. Gave me a head rush, dick rush and made me cum within a matter of sentences. Will someone write an entire novel based on the behaviors of a Karen?",
            "I can't believe I'm saying this but Karens are based",
            "Not enough Hell Yas in here",
            "r/unpopularopinions for sure 😂",
            "who else is gonna do donuts in a glittering minivan with an empty carseat until they crash into hobby lobby and claim their baby was stolen and they need store credit for it to by a cricut",
            "Karen’s have my respect. They know what they want, and they will do what they need to get it. Admirable in a country where everyone is a pussy",
            "I’ve been gone for a while. Where the fuck is cummy?",
            "!emojify",
            "The benefits of the upper middle class",
            "karen"
        ]
    },
    {
        "post_id": "il4uwo",
        "author": "woshengbingle1",
        "title": "a message for nikocado avocado",
        "url": "https://www.reddit.com/r/copypasta/comments/il4uwo/a_message_for_nikocado_avocado/",
        "score": 7975,
        "num_comments": 236,
        "created_utc": 1599045349.0,
        "selftext": "nikocado, my love. what a beguiling, breathtaking mukbanger you are. i love the sounds of your mouth as you chew your weekly 47th chicken nugget, along with the hysterical jokes you make which i find so, so appealing. once i get employed at a workplace, i shall invest in only buying your onlyfans. i am incredibly thrilled to see your mammoth-sized, juicy, voluptuous, tender, moist arsecheeks. i love you.",
        "permalink": "/r/copypasta/comments/il4uwo/a_message_for_nikocado_avocado/",
        "comments": [
            "nikocado, my love. what a beguiling, breathtaking mukbanger you are. i love the sounds of your mouth as you chew your weekly 47th chicken nugget, along with the hysterical jokes you make which i find so, so appealing. once i get employed at a workplace, i shall invest in only buying your onlyfans. i am incredibly thrilled to see your mammoth-sized, juicy, voluptuous, tender, moist arsecheeks. i love you.",
            "nikocado, my wove. what a beguiwing, bweathtaking mukbangew you awe. i wove the sounds of youw mouth as you chew youw weekwy 47th chicken nugget, awong with the hystewicaw jokes you make which i find so, so appeawing. once i get empwoyed at a wowkpwace, i shaww invest in onwy buying youw onwyfans. i am incwedibwy thwiwwed to see youw mammoth-sized, juicy, vowuptuous, tendew, moist awsecheeks. i wove you.",
            "Simp",
            "That bitch is still not banned from YouTube and yet many YouTubers are getting strikes for dumb reasons",
            "No joke, I saw his asshole before on Reddit. It was stretched open so wide just thinking about it is making me want to puke",
            "OH MY GOD james marriot is on r/copypasta flirting with nikocado",
            "Wait the automod trolls anyone who comments on this subreddit? No wonder it's so quiet.",
            "Do forgive my innocence but he has a what",
            "NTA: Play stupid games, win stupid prizes",
            "Based",
            "Wait does he really have an onlyfans\n\nedit: NO... NOOOO!!!",
            "Simp",
            "Culiada",
            "Just felt like pointing out that 47 chicken nuggets a week sounds like a lot at first, but really is not that much if you can't afford anything else, have no idea how to cook, and have only 7 chicken nuggets a day. You should get to chicken nugget number 47 by Saturday and it will cost very little if you're using those freezer isle store brand nuggets. \n\nThank you for coming to my Ted Talk.",
            "I lost braincells reading this. A lot of them. Not that I had any to begin with, but you get the deal. This hurt to read.\n\nIn other words 13/10 copypasta. Would suffer again.",
            "His brain is more fried than his chicky nuggies",
            "should I put this in the nickado avocado comment section",
            "Good bot",
            "I listen to him while trying to sleep and I jolted awake anytime his tongue hit the roof of his mouth",
            "Imma take this and fly with it",
            "With a dick like a \"beautiful burrito\" according to Orlin",
            "thanks guys, credit to my friend for making this",
            "I hate the videos he makes so I left a stupid joke in the comments of his car meltdown video. Forgot his viewers are more stupid than the joke I made. Now it's one of the most liked comments on the video.",
            "Simp",
            "Simp",
            "simp",
            "Nikka 🙈🤝🐵",
            "nikocado’s penis is fucking terrifying",
            "I can only imagine this in a TheRightOpinion voice for some reason.",
            "Niko have this stupid ass hand award Reddit gave for free",
            "I fucking hate him",
            "N",
            "Simp",
            "Avocado",
            "[removed]",
            "Oh feck.  Get it then xD.",
            "[Yeet]",
            "meow",
            "If u bought his onlyfans send me pls",
            "Shitty copypasta fucking nerd imbecile piece of shit 0/10"
        ]
    },
    {
        "post_id": "kzt4py",
        "author": "CenturionStorm",
        "title": "I missed you cummy bot",
        "url": "https://www.reddit.com/r/copypasta/comments/kzt4py/i_missed_you_cummy_bot/",
        "score": 7964,
        "num_comments": 190,
        "created_utc": 1610970249.0,
        "selftext": "Oh cummybot how I’ve missed you so!\nI want you to penetrate me and fill me with your hot sticky nectar of cum until I burst\nWords cannot describe how much I’ve missed you now please fuck me until I can’t stand for a week \nOh my lord I want you to fuck me so bad cummy bot I’m so incredibly horny just shove it deep inside of me please cummy bot I’m literally begging you I’ve missed you so much my life was meaningless without you",
        "permalink": "/r/copypasta/comments/kzt4py/i_missed_you_cummy_bot/",
        "comments": [
            " Oh cummybot how I’ve missed you so! I want you to penetrate me and fill me with your hot sticky nectar of cum until I burst Words cannot describe how much I’ve missed you now please fuck me until I can’t stand for a week Oh my lord I want you to fuck me so bad cummy bot I’m so incredibly horny just shove it deep inside of me please cummy bot I’m literally begging you I’ve missed you so much my life was meaningless without you",
            "Oh 🙀 cummybot 🤖💦 how I’ve missed 🚫 you 👉🚫 so!   \nI 👁 want 😋 you 👈 to penetrate 👉👌 me and fill 💦💉☔ me with your 👉 hot 🔥 sticky 💦 nectar 👄💦 of cum 🍩👊🏾💦 until I 👁 burst 💦🍆   \nWords 📓 cannot 🚫 describe 💭 how much 🔥 I’ve missed 🚫 you 👉 now please 🙏💯 fuck 👉👌 me until I 👁 can’t stand 🕴 for a week 📅   \nOh 😳 my lord 😍💋🙏 I 👥 want 😍 you 👈 to fuck 👉 me so bad 👎🔚 cummy 💦🤖 bot 🤖 I’m so incredibly 😯‼❗ horny 😉 just shove ✊🍭 it deep ⬇ inside 💠 of me please 🙏🏼 cummy 💦 bot 🤖 I’m literally 👋🏻 begging 🙏 you 👉👨👩🏽 I’ve missed 🚫 you 👈 so much 🔥 my life 👤 was meaningless ❌😰 without ❌ you 🏳️‍🌈👉👨‍❤️‍👨",
            "He's gone again",
            "Oh cummybot how I’ve missed you so!\nI want you to penetwate me and fiww me with youw hot sticky nectaw of cum untiw I buwst\nWowds cannot descwibe how much I’ve missed you now pwease fuck me untiw I can’t stand fow a week \nOh my wowd I want you to fuck me so bad cummy bot I’m so incwedibwy howny just shove it deep inside of me pwease cummy bot I’m witewawwy begging you I’ve missed you so much my wife was meaningwess without you",
            "What do you think would happen if I showed my therapist this thread",
            "cummy where are you again wtf",
            "i think he just died again",
            "You can say this shit, but my account u/raikoplays got banned for replying cummy bot \"i wanna penetrate your 13 yo ass\"",
            "what is this subs obsession with the man know as \"cummy\"?",
            "Where was cummy all this time?",
            "YES HES BACK FINALLY AFTER MONTHS I MISSED HIM SO MUCH",
            "Wait, did cummy bot die again recently? My 100 day ban just ended so I haven’t been here in a while.",
            "this is so low effort i cannot breathe",
            "u/shittytranslatorbot",
            "O Cummy, Where Art Thou?",
            "Oh cummybot how I’ve missed you so!\nI want you to penetrate me and fill me with your hot sticky nectar of cum until I burst\nWords cannot describe how much I’ve missed you now please fuck me until I can’t stand for a week \nOh my lord I want you to fuck me so bad cummy bot I’m so incredibly horny just shove it deep inside of me please cummy bot I’m literally begging you I’ve missed you so much my life was meaningless without you",
            "Wtf",
            "Fuck cummybot\n\nHe's a racist, communistic, homophobic, discriminatory line of code that needs to shut the fuck up",
            "Oh cummybot how I’ve missed you so! I want you to penetrate me and fill me with your hot sticky nectar of cum until I burst Words cannot describe how much I’ve missed you now please fuck me until I can’t stand for a week Oh my lord I want you to fuck me so bad cummy bot I’m so incredibly horny just shove it deep inside of me please cummy bot I’m literally begging you I’ve missed you so much my life was meaningless without you",
            "Oh 🙀 cummybot 🤖💦 how I’ve missed 🚫 you 👉🚫 so!\nI 👁 want 😋 you 👈 to penetrate 👉👌 me and fill 💦💉☔ me with your 👉 hot 🔥 sticky 💦 nectar 👄💦 of cum 🍩👊🏾💦 until I 👁 burst 💦🍆\nWords 📓 cannot 🚫 describe 💭 how much 🔥 I’ve missed 🚫 you 👉 now please 🙏💯 fuck 👉👌 me until I 👁 can’t stand 🕴 for a week 📅\nOh 😳 my lord 😍💋🙏 I 👥 want 😍 you 👈 to fuck 👉 me so bad 👎🔚 cummy 💦🤖 bot 🤖 I’m so incredibly 😯‼❗ horny 😉 just shove ✊🍭 it deep ⬇ inside 💠 of me please 🙏🏼 cummy 💦 bot 🤖 I’m literally 👋🏻 begging 🙏 you 👉👨👩🏽 I’ve missed 🚫 you 👈 so much 🔥 my life 👤 was meaningless ❌😰 without ❌ you 🏳️‍🌈👉👨‍❤️‍👨",
            "Cock\n\n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "Oh cummybot how I’ve missed you so! I want you to penetrate me and fill me with your hot sticky nectar of cum until I burst Words cannot describe how much I’ve missed you now please fuck me until I can’t stand for a week Oh my lord I want you to fuck me so bad cummy bot I’m so incredibly horny just shove it deep inside of me please cummy bot I’m literally begging you I’ve missed you so much my life was meaningless without you"
        ]
    },
    {
        "post_id": "o6x5ab",
        "author": "BanthaMilk",
        "title": "Give a femboy cum and it has cum for a day, teach a femboy to cum and it cums forever",
        "url": "https://www.reddit.com/r/copypasta/comments/o6x5ab/give_a_femboy_cum_and_it_has_cum_for_a_day_teach/",
        "score": 7954,
        "num_comments": 156,
        "created_utc": 1624525533.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/o6x5ab/give_a_femboy_cum_and_it_has_cum_for_a_day_teach/",
        "comments": [
            "cock",
            "Infinite cum. You sit on the toilet to jack off, but you begin to cum uncontrollably. After ten spurts you start to worry. Your hand is sticky and it reeks of semen. You desperately shove your dick into a wad of toilet paper, but that only makes your balls hurt. The cum accelerates. It’s been three minutes. You can’t stop cumming. Your bathroom floor is covered in a thin layer of baby fluid. You try to cum into the shower drain but it builds up too fast. You try the toilet. The cum is too thick to be flushed. You lock the bathroom door to prevent the cum from escaping. The air grows hot and humid from the cum. The cum accelerates. You slip and fall in your own sperm. The cum is now six inches deep, almost as long as your still-erect semen hose. Sprawled on your back, you begin to cum all over the ceiling. Globs of the sticky white fluid begin to fall like raindrops, giving you a facial with your own cum. The cum accelerates. You struggle to stand as the force of the cum begins to propel you backwards as if you were on a bukkake themed slip-and-slide. Still on your knees, the cum is now at chin height. To avoid drowning you open the bathroom door. The deluge of man juice reminds you of the Great Molasses Flood of 1919, only with cum instead of molasses. The cum accelerates. It’s been two hours. Your children and wife scream in terror as their bodies are engulfed by the snow-white sludge. Your youngest child goes under, with viscous bubbles and muffled cries rising from the goop. You plead to God to end your suffering. The cum accelerates. You squeeze your dick to stop the cum, but it begins to leak out of your asshole instead. You let go. The force of the cum tears your urethra open, leaving only a gaping hole in your crotch that spews semen. Your body picks up speed as it slides backwards along the cum. You smash through the wall, hurtling into the sky at thirty miles an hour. From a bird’s eye view you see your house is completely white. Your neighbor calls the cops. The cum accelerates. As you continue to ascend, you spot police cars racing towards your house. The cops pull out their guns and take aim, but stray loads of cum hit them in the eyes, blinding them. The cum accelerates. You are now at an altitude of 1000 feet. The SWAT team arrives. Military helicopters circle you. Hundreds of bullets pierce your body at once, yet you stay conscious. Your testicles have now grown into a substitute brain. The cum accelerates. It has been two days. With your body now destroyed, the cum begins to spray in all directions. You break the sound barrier. The government deploys fighter jets to chase you down, but the impact of your cum sends one plane crashing to the ground. The government decides to let you leave the earth. You feel your gonads start to burn up as you reach the edges of the atmosphere. You narrowly miss the ISS, giving it a new white paint job as you fly past. Physicists struggle to calculate your erratic trajectory. The cum accelerates. The cum begins to gravitate towards itself, forming a comet trail of semen. Astronomers begin calling you the “Cummet.” You are stuck in space forever, stripped of your body and senses, forced to endure an eternity of cumshots. Eventually, you stop thinking.",
            "r/Wiseposting",
            "Give a femboy cum and it has cum for a day, teach a femboy to cum and it cums forever",
            "can someone teach me",
            "Deep (in his ass)",
            "\"Sun Tzu, the art of cum\"",
            "Just it'll never stop cumming\n\n\\[the cum accelerates\\]",
            "i wanna fuck a femboy feel so bad. i wanna take his skirt off and shove my cock into his feminine asshole. i wanna jack off his feminine penis until femboy cum comes out. i wanna hear him moan. i wanna feel his feminine body. i want him to cosplay as venti so i can fuck his cute little bard ass. femboys are so hot",
            "waiting for infinite cum copypasta",
            "[deleted]",
            "Teach a man to build a fire and he'll be warm for the evening. Set a man on fire and he'll be warm for the rest of his life.",
            "It?",
            "\"it\"",
            "Incredible words of wisdom.",
            "CUMMY NOOO",
            "I like how the copypasta says “it” instead of “he”",
            "What the fuck",
            "https://youtu.be/0K4oym9Pw48",
            "I can't cum in my own asshole tho",
            "Deep 😔",
            "I think I have a new family saying now",
            "Original credit is to u/rymarre\n\nHe made this meme on Discord",
            "Hello. I used to shoot cum years ago. Then I got stuck on cum for awhile and lost my mind. Thought my brother was a psychic out to kill me, had to cum in my dads room sometimes, I thought my neighbors were out to get me, and I had an extremely profound addiction watching amongus porn. Like, I once jerked off for like 18 hours straight to amogus. It needs to be said I am not proud of this and I am deeply ashamed to admit I enjoyed it. To this day I still feel the disgusting desire to relive these moments. I hate myself for it. I have to take multiple cumshots to stay partially sane. I'm sure that's my nasty habits lasting impact, no more good cum. And rightfully so, I don't deserve it.\n\nI could cum on forever about all the stupid shit I did watching among us porn, but the end result was me jacking off and getting into a cum accident with a young woman on her bicycle. She died and I went to prison for 18 months. I'm a felon now with a cum strike. My career in cum is destroyed. I have massive debt. I live with my father. Struggle to pay my bills. I don't really feel my cock anymore.\n\nCum cost me my cock, and lead me to make terrible life altering choices that go well beyond my selfish little bubble.\n\nDon't cum. Like seriously, don't. Don't watch among us porn either, it's the same thing as cumming. I hope this post disgusts a lot of people so they don't make the dumb mistake of fucking around with cum. You don't fuck with cum, cum fucks with YOU.",
            "Wise words",
            "The world is not ready for this truth.",
            "are slash shower thoughts 🤯🤯😱🤬🥶",
            "You can't possibly expect me to copy this, much less paste it.",
            "[removed]",
            "I seriously wonder why I'm still in this subreddit it's just random funny nonsense, hell I'll stay",
            "motherfucker you know where you got this from",
            "I appreciate people using the correct pronoun for femboys.\nIt.",
            "What even is this sub? Where is the pasta?",
            "[removed]",
            "[shit nut jizz fuck semen](https://www.youtube.com/watch?v=NsW_0JTI7to) [cum shit lube](https://www.youtube.com/watch?v=NsW_0JTI7to)",
            "u/C1iver I'm leaving reddit",
            "Based",
            "It cums inside itself",
            "ඞ",
            "Teach me",
            "COCK JOKE",
            "\\- Sun Tzu, in the Art of War",
            "words of the wise",
            "Su s",
            "\"it\"",
            "wait where did the cum you gave to the femboy go",
            "rubish",
            "Fax"
        ]
    },
    {
        "post_id": "kpaix2",
        "author": "None",
        "title": "Courtesy of r/teenagers",
        "url": "https://www.reddit.com/r/copypasta/comments/kpaix2/courtesy_of_rteenagers/",
        "score": 7960,
        "num_comments": 238,
        "created_utc": 1609637112.0,
        "selftext": "How can i, a white boy, look and act more black and ghetto without it being racist?\n\nSo like ya fr like ya im a white boy and shit and nah i aint wven act white no cap so i aint really fuckwit the white kids at my school and black kids aint want me either cuss well im a white boy shit lol LOL. Idk bruh i been wanting to get braids or dreds and wear durags and shit and so many times in my life i felt like saying the nword but i had to use shit like bruh or bitch or homie instead like nah fr i just feel black and shit u feel me im more black than white and i think i have a little black in me too i never took a dna test to find out tho haha so ya, is there any medicine i can take to become black?",
        "permalink": "/r/copypasta/comments/kpaix2/courtesy_of_rteenagers/",
        "comments": [
            "How can i 👁, a white 🏳💅🏼 boy 🕖👶🔼, look 👀 and act 🎭 more black ⚫ and ghetto 🔫 without 🚫 it being racist 🤜🏻💥👶🏾?   \n  \nSo like 😄 ya 🙀 fr 👌🏿 like 👍 ya 🙀 im 💘 a white 🏳💅🏼 boy 👦 and shit 💩👌2⃣ and nah ❌😧 i 👁 aint 🚫 wven act 🎭 white 🏳💅🏼 no 😣 cap 🚫🧢 so i 👥 aint ❌🙅‍♂️🚫 really 💯 fuckwit the white ⚪ kids 👶 at my school 🏫 and black 👺⚫😰 kids 👶🏽 aint 😡🚫 want 😋 me either 🚫 cuss 😠 well 😦 im 💘 a white 🏳💅🏼 boy 👦 shit 💩 lol 😛😂🥰 LOL 😛😂🥰. Idk 😐 bruh ⚠ i 👥 been wanting 😋 to get 🉐🅰 braids ✂ or dreds and wear 👙😍 durags and shit 💩 and so many 👬 times 🕐 in my life 💓 i 👥 felt 😎 like 👍👌😍 saying 🗣 the nword 🙅😤 but 🍑 i 👁 had to use 🏻 shit 💩 like 😄 bruh ⚠ or bitch 💃🍑 or homie 👬 instead 🚔 like 👍🤤 nah 🚫 fr 💔😧😥 i 👁 just feel 😜👀💀 black ⬛ and shit 💩 u 💦🤕🔫 feel 😜 me im 💘 more black ⬛ than white ⚪ and i 👁 think 🤔 i 👁 have a little 👶 black ⬛ in me too i 👥 never 🙅🏾‍♂️ took 👫 a dna 🔁 test 📝 to find 🔍🔎 out tho 😏 haha 😂 so ya 🙀, is there any medicine 💊 i 👁 can take 💅 to become 😌 black ⚫?",
            "Look up what Michael Jackson did and then do the opposite of that",
            "Kendrick Lamar fans",
            "The exaggerated swagger of a white teen",
            "Lmfao has to be fake",
            "beat me to it 😔😔",
            "How can i, a white boy, wook and act mowe bwack and ghetto without it being wacist?\n\nSo wike ya fw wike ya im a white boy and shit and nah i aint wven act white no cap so i aint weawwy fuckwit the white kids at my schoow and bwack kids aint want me eithew cuss weww im a white boy shit wow WOW. Idk bwuh i been wanting to get bwaids ow dweds and weaw duwags and shit and so many times in my wife i fewt wike saying the nwowd but i had to use shit wike bwuh ow bitch ow homie instead wike nah fw i just feew bwack and shit u feew me im mowe bwack than white and i think i have a wittwe bwack in me too i nevew took a dna test to find out tho haha so ya, is thewe any medicine i can take to become bwack?",
            " \n\nHow can i, a white boy, look and act more black and ghetto without it being racist?\n\nSo like ya fr like ya im a white boy and shit and nah i aint wven act white no cap so i aint really fuckwit the white kids at my school and black kids aint want me either cuss well im a white boy shit lol LOL. Idk bruh i been wanting to get braids or dreds and wear durags and shit and so many times in my life i felt like saying the nword but i had to use shit like bruh or bitch or homie instead like nah fr i just feel black and shit u feel me im more black than white and i think i have a little black in me too i never took a dna test to find out tho haha so ya, is there any medicine i can take to become black?",
            "wigger moment",
            "Mf wants to do a reverse Michael Jackson",
            "coming out as transnigga has been lowkey tough no cap",
            "The long way of getting the N word pass.",
            "u/shittytranslatorbot",
            "Gayboi farti",
            "I go to school with like 30 of these kids",
            "Heya, here is a copy for mobile users:\n\nHow can i, a white boy, look and act more black and ghetto without it being racist?\n\nSo like ya fr like ya im a white boy and shit and nah i aint wven act white no cap so i aint really fuckwit the white kids at my school and black kids aint want me either cuss well im a white boy shit lol LOL. Idk bruh i been wanting to get braids or dreds and wear durags and shit and so many times in my life i felt like saying the nword but i had to use shit like bruh or bitch or homie instead like nah fr i just feel black and shit u feel me im more black than white and i think i have a little black in me too i never took a dna test to find out tho haha so ya, is there any medicine i can take to become black?\n\n*I am a bot, and this action was performed automatically. I am still learning, so dm me if you have any feedback! A human volunteer will get back to you soon!*",
            "Exaggerated swagger of a black teen",
            "wheres  [u/shittytranslatorbot](https://www.reddit.com/u/shittytranslatorbot/)  when you need it",
            "       👆        😩\n          🦎💤👔🦎\n                    ⛽  🚶\n                🥢  8=👊=D💦\n             ⚡       🌂           💦\n             👢           👢       🙆‍♀️",
            "Found J Roc",
            "my nathan ✊🏻",
            "Reverse Michael Jackson",
            "read this in the voice of jimmy from gta 5",
            "https://www.reddit.com/r/teenagers/comments/kp3eey/how_can_i_a_white_boy_look_and_act_more_black_and/?utm_medium=android_app&utm_source=share\n\nOriginal post",
            "Nuka Zeus 🅱️asipally 😳",
            "Jesus",
            "Cummybot....?",
            "there is this guy on youtube called nuka zeus, he was white but “identified himself” as black and started taking some experimental drugs called melaton or something like that and after a few months his color changed",
            "Hey wtf i was about to repost my post to this sub >:(",
            "TWEENER!",
            "He is a white boy",
            "Woah Vicky",
            "You did AwfulReddit's job. This is probably one of the few good subs because it mocks all the cancerous ones lol",
            "The fact that I was with someone who'd speak exactly like that",
            "Bad day to know how to read",
            "too white for the black kids but too black for the white kids",
            "U sound like the white guy on youtube who said he was black so he took melena the chemical that's in your skin well he takes that daily and over the course of two years he goes from white boy with red hair to, a weird greasy brown skinned dreaded dude.",
            "What is wrong with americans",
            "Wiggers still alive and well then",
            "How many fucking times can you say \"ya\" and \"and shit\"?",
            "god dammit reddit.",
            "Medicine? Did this man just say MEDICINE?",
            "just transrace bro",
            "J to the Roc nomsayin?",
            "J-ROC: origins.",
            "Kendick Lamar",
            "Everyday I am more grateful that I didn't have social media as a kid as my cringe ass would be featured on here all the goddamned time.",
            "I think this was just someone over at HHCJ trying to be funny.",
            "YTA black people arent real",
            "whats great is that people in the comment are asking if its a joke what did i expect",
            "just inject some melanin bro",
            "r/whiteboytherapycenter",
            "r/dababy mods",
            "I remember as a lonely teen joining r/teenagers\nAnd I completely forgot how awful teens can be(me included, I was a degenerate lmao)",
            "He should be poor first that would make him ghetto",
            "i can’t blame him. it often feels like my entire generation is hooked on gangsta rap",
            "Nigger momenr",
            "um",
            "The beautiful English language ladies and gents",
            "why waste your future",
            "卄ㄖ山 匚卂几 丨, 卂 山卄丨ㄒ乇 乃ㄖㄚ, ㄥㄖㄖҜ 卂几ᗪ 卂匚ㄒ 爪ㄖ尺乇 乃ㄥ卂匚Ҝ 卂几ᗪ Ꮆ卄乇ㄒㄒㄖ 山丨ㄒ卄ㄖㄩㄒ 丨ㄒ 乃乇丨几Ꮆ 尺卂匚丨丂ㄒ?\n\n丂ㄖ ㄥ丨Ҝ乇 ㄚ卂 千尺 ㄥ丨Ҝ乇 ㄚ卂 丨爪 卂 山卄丨ㄒ乇 乃ㄖㄚ 卂几ᗪ 丂卄丨ㄒ 卂几ᗪ 几卂卄 丨 卂丨几ㄒ 山ᐯ乇几 卂匚ㄒ 山卄丨ㄒ乇 几ㄖ 匚卂卩 丂ㄖ 丨 卂丨几ㄒ 尺乇卂ㄥㄥㄚ 千ㄩ匚Ҝ山丨ㄒ ㄒ卄乇 山卄丨ㄒ乇 Ҝ丨ᗪ丂 卂ㄒ 爪ㄚ 丂匚卄ㄖㄖㄥ 卂几ᗪ 乃ㄥ卂匚Ҝ Ҝ丨ᗪ丂 卂丨几ㄒ 山卂几ㄒ 爪乇 乇丨ㄒ卄乇尺 匚ㄩ丂丂 山乇ㄥㄥ 丨爪 卂 山卄丨ㄒ乇 乃ㄖㄚ 丂卄丨ㄒ ㄥㄖㄥ ㄥㄖㄥ. 丨ᗪҜ 乃尺ㄩ卄 丨 乃乇乇几 山卂几ㄒ丨几Ꮆ ㄒㄖ Ꮆ乇ㄒ 乃尺卂丨ᗪ丂 ㄖ尺 ᗪ尺乇ᗪ丂 卂几ᗪ 山乇卂尺 ᗪㄩ尺卂Ꮆ丂 卂几ᗪ 丂卄丨ㄒ 卂几ᗪ 丂ㄖ 爪卂几ㄚ ㄒ丨爪乇丂 丨几 爪ㄚ ㄥ丨千乇 丨 千乇ㄥㄒ ㄥ丨Ҝ乇 丂卂ㄚ丨几Ꮆ ㄒ卄乇 几山ㄖ尺ᗪ 乃ㄩㄒ 丨 卄卂ᗪ ㄒㄖ ㄩ丂乇 丂卄丨ㄒ ㄥ丨Ҝ乇 乃尺ㄩ卄 ㄖ尺 乃丨ㄒ匚卄 ㄖ尺 卄ㄖ爪丨乇 丨几丂ㄒ乇卂ᗪ ㄥ丨Ҝ乇 几卂卄 千尺 丨 ﾌㄩ丂ㄒ 千乇乇ㄥ 乃ㄥ卂匚Ҝ 卂几ᗪ 丂卄丨ㄒ ㄩ 千乇乇ㄥ 爪乇 丨爪 爪ㄖ尺乇 乃ㄥ卂匚Ҝ ㄒ卄卂几 山卄丨ㄒ乇 卂几ᗪ 丨 ㄒ卄丨几Ҝ 丨 卄卂ᐯ乇 卂 ㄥ丨ㄒㄒㄥ乇 乃ㄥ卂匚Ҝ 丨几 爪乇 ㄒㄖㄖ 丨 几乇ᐯ乇尺 ㄒㄖㄖҜ 卂 ᗪ几卂 ㄒ乇丂ㄒ ㄒㄖ 千丨几ᗪ ㄖㄩㄒ ㄒ卄ㄖ 卄卂卄卂 丂ㄖ ㄚ卂, 丨丂 ㄒ卄乇尺乇 卂几ㄚ 爪乇ᗪ丨匚丨几乇 丨 匚卂几 ㄒ卂Ҝ乇 ㄒㄖ 乃乇匚ㄖ爪乇 乃ㄥ卂匚Ҝ?",
            "[deleted]",
            "[deleted]",
            "Just live in East London. Most white teens here talk black!",
            "Modify your DNA",
            "I see the mods are feeling extra sassy.",
            "Read in J-roc’s voice",
            "\"Wven\" ... ... Cronus Ampora..?",
            "God I just git major PTSD from my middle school...",
            "Talk to uncle ruckus. He might be able to get you some of that revitiligo",
            "Based",
            "https://discord.gg/w6Sw4d3A"
        ]
    }
]