[
    {
        "post_id": "de41u5",
        "author": "philthebadger",
        "title": "Straight from the Joker (2019) Discussion Thread",
        "url": "https://www.reddit.com/r/copypasta/comments/de41u5/straight_from_the_joker_2019_discussion_thread/",
        "score": 7960,
        "num_comments": 649,
        "created_utc": 1570372659.0,
        "selftext": "#I absolutely refuse to watch this film on principal. All it does is glorify the \"lone wolf white male\" archetype. It gives incels and and nazis a hero figure for them to look up to. It is absolutely disgusting and is NOT the movie that we need right now. Who the fuck thought this would be a good idea in our current political climate? The number one terrorist threat in the US right now is a white male.",
        "permalink": "/r/copypasta/comments/de41u5/straight_from_the_joker_2019_discussion_thread/",
        "comments": [
            "He’s talking about what the movie does yet he hasn’t see it",
            "#I absolutely refuse to watch this film on principal. All it does is glorify the \"lone wolf white male\" archetype. It gives incels and and nazis a hero figure for them to look up to. It is absolutely disgusting and is NOT the movie that we need right now. Who the fuck thought this would be a good idea in our current political climate? The number one terrorist threat in the US right now is a white male.",
            "#I absowutewy wefuse to watch this fiwm on pwincipaw. Aww it does is gwowify the \"wone wowf white mawe\" awchetype. It gives incews and and nazis a hewo figuwe fow them to wook up to. It is absowutewy disgusting and is NOT the movie that we need wight now. Who the fuck thought this wouwd be a good idea in ouw cuwwent powiticaw cwimate? The numbew one tewwowist thweat in the US wight now is a white mawe.",
            "Gamers rise up",
            "Link?",
            "#FUCK HEADERS",
            "[deleted]",
            "Recuso-me absolutamente a ver este filme sobre o director. Tudo o que ele faz é glorificar o \"lobo solitário branco macho\" arquétipo. Ele dá incels e e nazis uma figura de herói para eles olharem. É absolutamente nojento e NÃO é o filme que precisamos agora. Quem diabos pensou que isso seria uma boa idéia em nosso clima político atual? A ameaça terrorista número um nos EUA agora é um homem branco.",
            "Reddit: video games don't cause violence\n\nAlso Reddit: THIS MOVIE CAUSES TERRORISM",
            "Who wrote this lmao",
            "Having seen the OP of this comment spam a review thread with this in the wild I lol’d so hard when I saw this thread pop up.",
            "This movie gives me hope",
            "smh straight white men, they're all the same, homophobic, racist, and sexist!\n\nwait...",
            "The only major problem I had with the movie is that it wasn't comic-accurate. \n\nGod, I'm a loser....",
            "Now i wanna go watch it even more.",
            "if people think joker is authright and not 100% libleft did u even watch the movie bruh >!he kills 3 rich dudes and starts an anti-government riot because he wasnt treated well!<",
            "  Movies featuring white males doing stuff will no longer be made. Because of terrorism and shit.",
            "I commented this a couple times on r/joker randomly and now i keep getting slowly downvoted and also keep getting angry responses.",
            "id rather read this than white kids unironically saying they felt empowered and identified with the film and they went to watch it in trench coats",
            "[deleted]",
            "You need to watch the film before you offer a critique. How could you ever be accurate if you dont at least watch what you're talking about. #cancelculture",
            "):",
            "Gamews wise up",
            "Good lord. There’s actual racism and sexism in the world to be concerned about, but the goddamn Joker movie is worth bitching about. These are the flip side of the idiots who wept about the Ghostbusters remake because there were women in it.\n\nEdit: Also, does the person who wrote this know that the Joker is a villain? He’s a psychotic serial killer. He’s not someone who’s meant to be looked up to.",
            "Need the link",
            "iq 200 here",
            "[deleted]",
            "Imagine thinking only white males can be incels lol",
            "When will people realize this isn’t a concern that a majority of people have? A few alarmist articles claim to have an issue with the content of the movie > nerds are outraged > trolls parrot the same sentiment in the articles for yucks > nerds continue to be outraged.",
            "this person would have an aneurysm if you said something even remotely this racist about blacks\n\n&#x200B;\n\ni hate reddit",
            "It's a movie, girl.. relax",
            "#bruh",
            "wait, is there a Joker archetype? better build my YGO deck",
            "Just imagine if A Clockwork Orange came out today",
            "It's the newest form of \"To Be fair\"",
            "The funniest part is that this movie is closer to SJW than a Nazi. I mean come on, how people missed that?\n\n* Crazy person, so victim and minority \n* His first victims are 3 rich assholes, and he mostly target establishment \n* Movie portrait big tech and rich people as part of the problem\n* He is a \"hero\" to common violent part of the people in masks (like Antifa) that are anti establishment  \n* Attracted to black woman (can't blame him, she was hot)\n* Living with Mom and taking care of her \n* Super creep\n* Lame job \n* Anarchist \n\nDoes this scream white nazi arian to you? More like SJW go wild. /S",
            "I absolutely refuse to watch this film on principal. All it does is glorify the \"lone wolf white male\" archetype. It gives incels and and nazis a hero figure for them to look up to. It is absolutely disgusting and is NOT the movie that we need right now. Who the fuck thought this would be a good idea in our current political climate? The number one terrorist threat in the US right now is a white male.",
            "There’s nothing wrong with being a lone wolf though",
            "I found nothing in this movie that glorified anything but the idea of paying attention to the people around you. Look at your fellow woman/man and understand they could be going through something you could never understand. You can choose to perceive this as a movie about glorifying white rage or you can see this as human tragedy. I left looking at the people exiting the theater in a way I never have before. I felt I was really seeing them as just people, struggling to get by and I sympathized with them. This film resensitized violence in film for me and helped me understand how lost a human being must be to resort to it when they feel like there is nothing else. The Joker is not a hero, he is the villain in us that wins out when we lose our will to survive. I hope he never wins in me.",
            "[https://imgflip.com/i/3d5cgr](https://imgflip.com/i/3d5cgr)",
            "I think the film did an amazing job at turning the spotlight on mental health. I grew up in a family where I was constantly surrounded by schizophrenia, manic depression, extreme narcissism, mental and physical abuse, you name it. I think they nailed it on the head when it comes to how it all really does just combine into a terrible situation and no one really bats an eye. His comment in the notebook that says, \"the worst part about having a mental illness is people expect you to behave as if you don't\" is an incredibly strong statement. I hate to say, but for the majority of the film, I connected with him a lot. But does that mean it makes me want to go out and mimic his actions? Not at all. I think instead of the media attacking video games and movies for violence, they should turn around and use this as a statement as to why its important to help those like my family and many others who need serious help. That's just my two cents, sorry for the long read.",
            "Reeeeeeeeeeeeeeeeeeeee!",
            "also video games cause violence",
            "Yeah movies are never for entertainment they always have to have an underlying political meaning.",
            "I mean I see how some lunatic ~~incel~~ redditeur (thanks automod) or whatever could sympathise with the movie but it's still a great movie imo and shouldn't be reduced to incel bait",
            "The thing is, anarchy(the ideology presented in the movie) is the polar opposite of nazism (national socialism which is the proper term.)",
            "Imagine clarifying every white male on the fucking planet as a terrorist, way to go boys. We did it.\n\nEdit: F downvoted",
            "What the fuck are you on about. The movie is about how the joker became the joker you idiot. No one is making and statement and I’ll tell ya it’s was a fucking great movie.",
            "[deleted]",
            "[Best Review Of The Movie](https://www.youtube.com/watch?v=mmO_cp-BEr0)",
            "Who is the real clown here?",
            "Its a movie and entertaining. Give me that free speech.",
            "Hey everyone let’s completely normalize the state of the world and claim that a movie is the reason crazy people are going to kill people rather than the fact that they’re crazy.",
            "Sooo, this person doesn't want movies being released based on the current political climate? Wtf, that's insane.",
            "Press x to doubt",
            "The white wolf archetype lol",
            "Triggered PC culture retard.  Maybe they should understand this DC character has been around for SIXTY YEARS.  Freakin idiot.",
            "Are You Kidding?",
            "I love the joker (the character) but the fanbase is so fucking weird.",
            "Lmfao number one terrorist threat is the white Male lmfao",
            "Wanna know how I got these scars..?",
            "Missing out on some great artistic movie watching but aight man you do you.\n\nMovie was great btw 10/10 and I still have 0/10 feelings of becoming a shooter.",
            "Some people are gay and that's ok",
            "FAX",
            "Joker's not the film this world needs its the film this world deserves",
            "Got rocks on my wrist, that shit you can't resist\nCash flow greater than the haters hating on my gyst\nRiding in your face, looking like I found a damn genie\nWiling in my Lamborghini\nLa-Lamborghini, La-Lamborghini\nBitch, I know you see me in my Lamborghini\nLa-Lamborghini, La-Lamborghini\nRide so quick, you would think I'm Houdini\nBeen in the game since Namco\nBring it back, I'm fully gassed, yo\nVroom, vroom, in my brand new Lambo\nJuiced up, and I don't give a damn, yo\nGoing 120, and that's my slowest\nOn a one-way lane, like Lois\nWho's that? Superman's bitch\nWanna see what happens when I touch the Superman switch?\nRide with more peers than Morgan\nDrive past bloggers that are walking\nI taunt them, Matt Lees, can you see me?\nWiling in my Lamborghini\nLa-Lamborghini, La-Lamborghini\nBitch, I know you see me in my Lamborghini\nLa-Lamborghini, La-Lamborghini\nRide so quick, you would think I'm Houdini\nI be at home on the Xbox\nLord of the Mics in the background, slewing MCs with dreadlocks\nSnap that party, told this girl \"come round\"\nChick's long-tempered but her head top\nShe goes hard till my head drops\nIt's all eyes when we connect\nDoggystyle and a Playboy bunny from downstairs, upstairs\nSound like a pet shop\nGuys wanna hype on man\nCall KSI, come yours and I'll put you in a headlock\nI've been around since CoD 4\nSearch and Destroy hardcore G3 with a red dot\nHaters get treated like a ho\nYou can tell them suck my dick and get lost\nPaparazzi wanna take pics when I'm out with my son\nYou can all get headshots\nThis flow's like Formula One\nCause I use the track like DRS\nQuickly boosting the PRS\nShe's going ape when I beat her chest\nBro, it's mad\nYou can tell Rihanna come see me\nMight have to speed dial in that genie\nJJ, lend me the Lamborghini\nLa-Lamborghini, La-Lamborghini\nBitch, I know you see me in my Lamborghini\nLa-Lamborghini, La-Lamborghini\nRide so quick, you would think I'm Houdini\nWhen my Lambo on the track, fall back\nWhen I'm riding at speed, get that neck crack\nBlazing on the engine, everybody looking back\nLike I'm shooting, gratata, got them going, \"fuck that\"\nRaise the fucking doors, I said make it look\nLike a fucking eagle, like I'm starting wars\nDictating with my V12 deagle, speeds ain't even legal\nScaring people, we ain't equal\nDanny Glover ain't got shit on my motherfucking lethal weapon\nArmageddon sounding when the man arrives\nWhen we hype I come alive, like a 5 Alive\nOn the drive 21 years, smashing up the scene\nAnd I keep on winning, like I'm Mr Charlie Sheen\nLa-Lamborghini, La-Lamborghini\nBitch, I know you see me in my Lamborghini\nLa-Lamborghini, La-Lamborghini\nRide so quick, you would think I'm Houdini",
            "Pretty much just every mainstream article rn",
            "[deleted]",
            "[deleted]",
            "Here's the weird thing. It doesn't do that, but it's still not the movie we need right now. It handles Joker/Arthur well, but Gotham and current politics poorly. Phillips has some of his wires crossed when comparing the far-right and the far-left",
            "I just commented this on the Joker thread and got three angry comments in 15 seconds lol",
            "Is this sarcasm because I really hope it is.",
            "Is this for actually?",
            "That’s why you should watch it.",
            "But the movie is so inspirational though? I really connected with his relationship with his neighbor",
            ">All it does is glorify the \"lone wolf white male\" archetype. It gives incels and and nazis a hero figure for them to look up to.\n\nName one scene that was pro nacism, I'll wait. \n\n>I absolutely refuse to watch this film on principal.\n\nHow can you talk about what is the movie about, if you refuse to see it?",
            "Watch it and you’ll find yourself to be completely wrong. It doesn’t glorify lunatics and killing or stereotypes but is merely a somber story of a mentally challenged man in a terrible city who needs and asks for help yet is still neglected and ignored leading a decent into madness. It could be seen as a movie that simply highlights the issues of mental health and hide who need help with it. Not once throughout the movie do they reference race so don’t judge something you have no knowledge about.",
            "God are u actually brain dead. The movie isn't political in the slightest. The Joker has always been white and always been sinister. He is not classist or racist and if he was real he would kill and torture anyone without even thinking about what color they are. I'm so sick of reddit.",
            "It speaks on actual problems in society . Government corruption , wealthy vs poor , lack of empathy of the people and mental illness . It does not encourage any toxic nor negative things such as violence . It just tells a story and the Joker story ... well at least a movie version of it .",
            "I liked it",
            "**shrug**",
            "This radiates strong Karen karens....",
            "So you're saying you would be all for the film if it were about a group of black jokers?   What we really don't need now is people rambling about movies they haven't even seen. Sorry to disappoint you but this film is about mental illness and the outcomes of domestic abuse...  no nazis or terrorists.",
            "## [https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html](https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html)\n\n## Joker: \"King of comedy\" dipped in the pale sauce of DC universe\n\nA movie with a far fetched thinking looming around the actual villain.\n\nJoker specifically is not in any way related to the actual Joker we know about. As the director mentioned, it was a Joker in his own vision leaving himself in a safe spot cornering the fanatics to a limited space to whine about Joker. \n\nAfter all, when we see it as just another remembrance of new American culture we tempt to get paralyzed about the new Joker.\n\n[https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html](https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html)\n\nIt is indeed a pleasure to see the comic book characters dwelling with real life. However, even as a two dimensional villain who lacks the super human fight skills or the extremely rich attires of his alter ego he holds more grittier side of reality than the movie version\n\nJoker in the movie does hold a revolting mind within him but despite of that we can never see the man who wants to watch the whole world burn. He might have faced mental illness in his past, maybe he was a lousy comedian but that doesn't mean his origin can be an adaptation from one of the greatest story of a master director pulling him out from the actual character he beholds.\n\nThe movie revolves around Arthur Fletcher and his delusions sticking himself into the void of pale yellow Gotham. While Bruce still a rich toddler, Thomas Wayne hold the potential of being a villain of this Joker adaptation which most of us might not accept even in the real world scenarios.\n\n[https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html](https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html)\n\nStory mostly seems vaguely running along the hardships of Fletcher in desperately achieving something he thinks he wants while he never puts an actual effort in being what he wants to be. The character is mostly never concerned about the political and revolting atmosphere around him while just pitching himself in his own narcissistic self loathing and it hits an extreme when the story finally progress in a snail phase.\n\nAfter all it's a movie up-gradation of \"King of comedy\" dipped in the pale sauce of DC universe which just falls apart in a matter of time.\n\n[https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html](https://delicacyondelicacy.blogspot.com/2020/03/joker-director-todd-phillips-language.html)",
            "We need to round up all the white males and deal with them once and for all!!!",
            "I don’t fucking get what the big deal about this comment is. Why is everyone so upset over it",
            "I assume a woman wrote this on the same weekend Birds of prey dropped a trailer......\n\nAnd asking who thought it was a good idea to make the movie is a fucking moronic question. Just check IMDb",
            "\"terrorist\" \"nazi\" \"white male\" how much cnn does this guy binge daily",
            "Guess I'm a terrorist now.\n\nYTA btw",
            "Yeah fuck white males",
            "He’s right tho"
        ]
    },
    {
        "post_id": "i3qbul",
        "author": "mrcleansmeanmachine",
        "title": "POV: You are taking an order from a band kid at a fast food restaurant",
        "url": "https://www.reddit.com/r/copypasta/comments/i3qbul/pov_you_are_taking_an_order_from_a_band_kid_at_a/",
        "score": 7960,
        "num_comments": 198,
        "created_utc": 1596570468.0,
        "selftext": "Nugget biscuit nu- hey whats up? Can I get a- NUMBER 15. BURGER KING FOOT LETTUCE. You guys don't  sell that? BRUH. Well I guess I'll take the finest chicken nuggies you guys sell. Cash or card? Do you accept Reddit karma?",
        "permalink": "/r/copypasta/comments/i3qbul/pov_you_are_taking_an_order_from_a_band_kid_at_a/",
        "comments": [
            "Nugget biscuit nu- hey whats up? Can I get a- NUMBER 15. BURGER KING FOOT LETTUCE. You guys don't  sell that? BRUH. Well I guess I'll take the finest chicken nuggies you guys sell. Cash or card? Do you accept Reddit karma?",
            "u/MrSoftServe1337 in his early childhood",
            "Shit like this made me realize why I should never tell anyone that I'm in band.  \n\n&#x200B;\n\n&#x200B;\n\nWait",
            "Nugget biscuit nu- hey whats up? Can I get a- NUMBEW 15. BUWGEW KING FOOT WETTUCE. You guys don't  seww that? BWUH. Weww I guess I'ww take the finest chicken nuggies you guys seww. Cash ow cawd? Do you accept Weddit kawma?",
            "https://youtu.be/s_SM3qaO-Os",
            "Where did the “band kids are typical Redditors” joke come from? Is this a universal thing? I thought it was just my school...",
            "You forgot a CallmeCarson reference for ultimate band kid",
            " \n\nNugget biscuit nu- \n\nHey whats up? \n\nCan I get a- NUMBER 15. BURGER KING FOOT LETTUCE. \n\nYou guys don't sell that? BRUH. \n\nWell I guess I'll take the finest chicken nuggies you guys sell. Cash or card? \n\n*DoyouacceptRedditkarma?*",
            "Nugget 🍗 biscuit 📷 nu- hey 👋 whats 😦👌 up ☝? Can I 👁 get 🉐 a- NUMBER 🔢 15 🔳. BURGER 🍔 KING 🤴 FOOT 👣 LETTUCE ☘🌿. You 👈 guys 👨 don't 🚫 sell 💸 that? BRUH 😂🤣🥵. Well 😦 I 👁 guess 🤔 I'll 📝 take 👊 the finest 📥 chicken 🐓 nuggies 👅😍 you 👈 guys 👨 sell 💸😭. Cash 💵💴 or card 🃏? Do you 👈 accept 🤝 Reddit 👽 karma 👆?",
            "The guy who made this on tiktok is so good at these",
            "Do you Do you accept Do you accept Reddit karma. Cash or BURGER? karma. Cash or BURGER? Do you accept Reddit karma. Cash or BURGER? karma. Cash or BURGER? biscuit nu- hey whats up? Can I get a- NUMBER 15.  KING FOOT LETTUCE. You guys don't  sell KING FOOT LETTUCE. You Do you accept Reddit karma. Cash or BURGER? don't  sell that? BRUH. BURGER I guess I'll take the finest chicken nuggies you guys sell. Do you accept Reddit karma. Cash or BURGER? or BURGER? Do you accept Reddit karma? BRUH. BURGER I guess I'll take the finest chicken nuggies KING FOOT LETTUCE. You guys don't  sell that? BRUH. BURGER I guess I'll take the finest KING FOOT LETTUCE. You guys don't  sell that? BRUH. BURGER I guess I'll take the finest chicken nuggies you guys sell. Cash or BURGER? Do you Do you accept Reddit karma. Cash or BURGER? Reddit karma. Cash or BURGER? Do you accept Reddit karma? BRUH. BURGER I guess I'll take the finest chicken nuggies KING FOOT LETTUCE. You guys don't  sell that? BRUH. BURGER I guess I'll take the finest KING FOOT LETTUCE. You guys don't  sell that? BRUH. BURGER I guess I'll take the finest chicken nuggies you guys sell. Cash or BURGER? Do you accept Reddit karma\n\nEdit:holy fuckin shit Mates, thanks for the upvotes\n\nEdit2: OH SHIT, this is the most upvotes I've gotten, THANKS",
            "oh no \n\n\non a school field trip there was a kid saying things like this at the gas station cashier \n\n\nhe was also a band kid",
            "He ask for da fornite burguer ?",
            "Guys who is Cummy?",
            "Big chungus",
            "Lucky for me I'm an orchestra kid",
            "Everytime I see this I can only think of YandereDev",
            "https://youtu.be/R-Hrt9tGGhw",
            "This one sounds like the crab man bank kid tik tok where he asks what lunch your having I love his band kid work",
            "I get the band kid stereotype and know a few band kids that act like this. I'm in orchestra, though. Band with string instruments. What does that make me?",
            "You missed the hehe",
            "Stolen joke from a video",
            "When I was in school all the band kids were drug addicts and degenerates and the football teams were all in christian youthgroup. Times change man.",
            "Okay but did he smell as bad as I'm imagining?",
            "This is a tik tok.",
            "I play bass on a band, so yeah...",
            "ain’t this from a tiktok or am I crazy?",
            "This is from tiktok you rat",
            "nice.",
            "!emojify",
            "I miss her",
            "DIP IT ALL IN MASHED POTATOES",
            "You forgot the part where he says “I’ll take the skim milk” (at least I think he said that but my hearing is shit so I don’t really know)",
            "I read this in Snakes voice",
            "An actual human wrote this",
            "YandereDev",
            "https://www.youtube.com/watch?v=s_SM3qaO-Os Yandere Dev version",
            "Bro what i posted this First",
            "🤗",
            "🤔🤔Nugget biscuit nu- 😦hey whats up? 😎 Can I get a- NUMBER 15. BURGER KING FOOT LETTUCE 👑 👑 🍔 🍔 🥬 😆🤣🤣🤗🤗🤗You guys don't  sell that? 😮😮😮😮 BRUH. 😩😭😞😞🤬🤬🤬🤬Well I guess I'll take the finest chicken nuggies you guys sell 😤😤😜😏😏🐓 🐓 🐔 🍗🍽🍽🍽🍗🍗🍗 Cash or card? 💁🏻‍♂️💁🏻‍♂️ 💳 💵 Do you accept Reddit karma? 💻 💯 🔊 🔥 🔥 👌🏼 👌🏼 😂 😂😂😂",
            "Oh no, are all band kids like this?",
            "As someone in band, this is not us.",
            "What's a band kid",
            "Are band kids known for being cringey meme lords now?",
            "As a former band kid, what the fuck?",
            "i watched this but it was made with yandere devs face over it",
            "A band kid? What does op mean by that?",
            "This actually got me thinking. What if Reddit karma was actually a currency?",
            "This is true \n\nSource: am middle school band kid"
        ]
    },
    {
        "post_id": "mqyq1i",
        "author": "None",
        "title": "Dolphin pussy jelly",
        "url": "https://www.reddit.com/r/copypasta/comments/mqyq1i/dolphin_pussy_jelly/",
        "score": 7948,
        "num_comments": 379,
        "created_utc": 1618430491.0,
        "selftext": " So female dolphins have vaginal secretions that make a male dolphin just cum over and over and over. From this point on, I will call these secretions Dolphin pussy jelly. Scientists were like \"holy shit, dude we gotta test this. You know, for science\" So the scientists collected a sample of said dolphin pussy jelly, and had a test primate. They swabbed it on the male primate's dick, sat back and watched the show. Now you see, it worked. But it worked a little too well. The monkey straight up had a heart attack because it used all of its energy into fucking cumming. I want to live in a world where this is a commercial product. I want to say \"you know what, I want to die and i know what to do about it.\" I want to live in a world where i can go into my local grocery store, pick up a bottle of Smucker's Dolphin Pussy Jelly, and just fucking cum myself to death",
        "permalink": "/r/copypasta/comments/mqyq1i/dolphin_pussy_jelly/",
        "comments": [
            "I just saw a comment on a post yesterday about fucking dolphins. Can I ever escape NSFW dolphin posts?",
            "you can cum to death, wow this has made my day.",
            " So femawe dowphins have vaginaw secwetions that make a mawe dowphin just cum ovew and ovew and ovew. Fwom this point on, I wiww caww these secwetions Dowphin pussy jewwy. Scientists wewe wike \"howy shit, dude we gotta test this. You know, fow science\" So the scientists cowwected a sampwe of said dowphin pussy jewwy, and had a test pwimate. They swabbed it on the mawe pwimate's dick, sat back and watched the show. Now you see, it wowked. But it wowked a wittwe too weww. The monkey stwaight up had a heawt attack because it used aww of its enewgy into fucking cumming. I want to wive in a wowwd whewe this is a commewciaw pwoduct. I want to say \"you know what, I want to die and i know what to do about it.\" I want to wive in a wowwd whewe i can go into my wocaw gwocewy stowe, pick up a bottwe of Smuckew's Dowphin Pussy Jewwy, and just fucking cum mysewf to death",
            "I want to know if this “secretion” is a real thing cause if it is it sounds kinda scientifically interesting",
            "So female 👧 dolphins 🦈 have vaginal 🍑 secretions 💦 that make 💘 a male 👦 dolphin 🐬 just cum 💦 over 😳🙊💦 and over 😳🙊💦 and over 🔁. From this point 📍 on 🔛, I 👁 will call 📲 these secretions 💦 Dolphin 🦈 pussy 🐱 jelly 🍴. Scientists 🔬 were like 💖 \"holy 🙌🙏 shit 💩, dude 😎 we gotta 👉 test 📝 this. You 👉 know 🤔👅, for science 🔬\" So the scientists 🔬 collected 🤐 a sample 🤤 of said 👱🏿💬🙈 dolphin 🦈 pussy 💦🐱🚫 jelly 🍧, and had a test 💯 primate 🐒. They swabbed it on 🔛 the male 👦😱👨 primate's 👍🏼👌🏼😳 dick 🍆, sat 🚽 back ⬅🔙 and watched 👀 the show 📺. Now you 👈 see 👁, it worked 🏢. But 🍑 it worked 💼 a little 👌 too well 😤. The monkey 🐵 straight 💑 up ⬆🔙 had a heart ❤ attack 👊 because it used 🎶 all 💯 of its energy ⚡ into fucking 🖕👉 cumming 💦. I 👁 want 😋 to live 🐙 in a world 🌎 where this is a commercial 🎫📺 product 🏭🔨🔧. I 👁 want 😋 to say 🗣 \"you 👈 know 💭 what, I 👁 want 😋 to die 💀 and i 👁 know 🤔 what to do about 🥕💦 it.\" I 👁 want 😍 to live 😩 in a world 🌎 where i 👁 can go 👉 into my local 📰 grocery 🍅🍏🍐 store 🏪, pick ⛏ up ⬆🆙⤴ a bottle 🍼 of Smucker's Dolphin 🐬 Pussy 🐱 Jelly 🍇🍓, and just fucking 🍆 cum 💦 myself to death 💀",
            "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
            "Okay. Today is the first time ever on r/copypasta in my many years subbed, where I decided that I'm not going to read a post based on the title.",
            "the fact i knew what story it was gonna be before i opened it...",
            "WHERE'S CUMMY?",
            "Smucker’s Dolphin Pussy Jelly.",
            "Fun fact: (isn’t a fact about dolphins however)\nWhales ejaculate 400 gallons of sperm, but only 10% of it makes it into his mate. Ever wonder why the sea was so salty?",
            "😂So😂female😂dolphins😂have😂vaginal😂secretions😂that😂make😂a😂male😂dolphin😂just😂cum😂over😂and😂over😂and😂over.😂From😂this😂point😂on,😂I😂will😂call😂these😂secretions😂Dolphin😂pussy😂jelly.😂Scientists😂were😂like😂\"holy😂shit,😂dude😂we😂gotta😂test😂this.😂You😂know,😂for😂science\"😂So😂the😂scientists😂collected😂a😂sample😂of😂said😂dolphin😂pussy😂jelly,😂and😂had😂a😂test😂primate.😂They😂swabbed😂it😂on😂the😂male😂primate's😂dick,😂sat😂back😂and😂watched😂the😂show.😂Now😂you😂see,😂it😂worked.😂But😂it😂worked😂a😂little😂too😂well.😂The😂monkey😂straight😂up😂had😂a😂heart😂attack😂because😂it😂used😂all😂of😂its😂energy😂into😂fucking😂cumming.😂I😂want😂to😂live😂in😂a😂world😂where😂this😂is😂a😂commercial😂product.😂I😂want😂to😂say😂\"you😂know😂what,😂I😂want😂to😂die😂and😂i😂know😂what😂to😂do😂about😂it.\"😂I😂want😂to😂live😂in😂a😂world😂where😂i😂can😂go😂into😂my😂local😂grocery😂store,😂pick😂up😂a😂bottle😂of😂Smucker's😂Dolphin😂Pussy😂Jelly,😂and😂just😂fucking😂cum😂myself😂to😂death",
            "Imo, dolphin pussy fetish should be much more acceptable than feet fetish",
            "So uh... where can we get this?",
            "So. In the mean time you will have to go with a one night stand or dolphin tinder.",
            "So people with dolphin fursonas.... how you feel about moth dick....",
            "I hate it here... why did that one reply go so in depth with how to have sex with dolphins....",
            "Fuck yeah",
            "[removed]",
            "sounds made up.\n\nlike, we know dolphin fuckers exist. \n\nthere is unequivocal proof.\n\nand they lived long enough to upload said proof at a time where 56k internet was the norm.",
            "I'm disappointed in all of you.",
            "Pls I want this 😫😫😫😫😫",
            "Jotaro moment",
            "JOTARO NOOO",
            "you really stole my post and reposted it\n\nyou actual cuck",
            "where is cummy",
            "I CASDBT BREATHE",
            "Noted.",
            "I swear to god your post's are dead pools thoughts",
            "Whang made a video about a dolphin fucker. Was it fake all along???",
            "u/shittytranslatorbot1",
            "Can someone copy & paste this for my cringe ass mobile self?",
            "This is fake right?",
            "Ok Jotaro calm down",
            "Smucker's Dolphin Pussy Jelly sounds great lol",
            "dolphin jelly fleshlite",
            "Ok is this just a joke or is dolphin pussy jelly real?",
            " So female dolphins have vaginal secretions that make a male dolphin just cum over and over and over. From this point on, I will call these secretions Dolphin pussy jelly. Scientists were like \"holy shit, dude we gotta test this. You know, for science\" So the scientists collected a sample of said dolphin pussy jelly, and had a test primate. They swabbed it on the male primate's dick, sat back and watched the show. Now you see, it worked. But it worked a little too well. The monkey straight up had a heart attack because it used all of its energy into fucking cumming. I want to live in a world where this is a commercial product. I want to say \"you know what, I want to die and i know what to do about it.\" I want to live in a world where i can go into my local grocery store, pick up a bottle of Smucker's Dolphin Pussy Jelly, and just fucking cum myself to death",
            "woah calm down jotaro",
            "Cursed",
            "Jotaro Supports your theory",
            "Okay Jotaro",
            "fake: i shit my pants\n\n\ngay: anon was interested in penis",
            "goes down into the comments and sees people legitimately wanting to fuck animals  \nGod please someone do the world a favor and throw these fucking incels in a woodchipper",
            "Cute your sources, bitch!\n\n(That's a Jacksepticeye reference for you uncultured folk)",
            "No",
            "Dolphins",
            "The more I read this, the more I figured this guy just likes jerking it to dolphins.",
            "I posted this a while ago and no one noticed it :( \n\nI deleted it after a while",
            "Oog",
            "Noice... also pussy jelly😂",
            "u/uwuwizard",
            "Секс с самкой дельфина лучше всего проводить на мелководье, так будет комфортно вам обоим. Положите ее на бок, так чтобы ее живот смотрел на вас. Оперитесь на локти и лягте ей на живот. Одной рукой прижимайте ее к себе, а второй направляйте свой форточка. Она станет изгибаться под вами и немного ерзать, но именно эти движения сделают вашу позу наиболее удобной. Как только вы примете нужную позицию, форточка самки сделает несколько мышечных сокращений, затем она станет ритмичными толчками идти вам навстречу. Все эти движения принесут столько форточка, что вы очень скоро достигнете кульминационного момента. Опытные дебилы рассказывают, что самки, как правило, всегда подстраиваются под своих партнеров. Они сдерживают свой форточка, до момента наступления его у своего форточка партнера.\nСамочки требуют более тонкого и чуткого отношения к себе. Нежно поглаживая ее одной рукой, другой стимулируйте ее форточка. Он расположен сверху ее полового форточка, и если самка возбуждена, то форточка разбухнет, и будет напоминать небольшой бугорок. Потрите его подушечками своих пальцев, но не старайтесь сделать это орально, потому, что рискуете остаться без носа. Самка дельфина от смеха может ударить хвостом. Аккуратно просуньте в ее возбужденное форточка руку и нежно погладьте там. Постоянно ласкайте ее, поглаживайте - пусть она чувствует вашу любовь. Через некоторое время ее настигнет форточка. Он будет сопровождаться дрожью, небольшими рывками, иногда звуками и оцепенением. Когда дельфин заинтересован вами, единственное, что вы можете сделать, если вы мужчина, это форточка. (К несчастью, я не могу сказать, как поступить женщинам, принимая во внимание человеческие особености строения женских половых органов…похоже, что женщины вообще не долюбливают дельфинов…поэтому я не могу быть уверен в безопасности спаривания с женщинами. Я думаю, что все-таки это небезопасно, учитывая размер у дельфина, но, опять же, я не могу отсоветовать этого женщинам, в силу тех же особенностей).\n\nВНИМАНИЕ! По соображениям безопасности, не затевайте с дельфином анальный секс. Член дельфина в обхвате - около 12 дюймов [примерно 27 см], очень мускулистый и сильный; сила семяизвержения (сперма может выплескиваться на 14 футов [примерно 4.3 метра]) может причинить серьезные внутренние повреждения, которые приведут к внутреннму кровотечению и, возможно, фатальному исходу.",
            "I think that it's not the cum that's going out. It's the soul.",
            "[removed]",
            "Thank you sir u/Lmaoijustpeedmypants. You have led me to discover these amazing copypastas by posting in another thread",
            "You guys are losers"
        ]
    },
    {
        "post_id": "hqv7a7",
        "author": "CypressYT",
        "title": "Ben Shapiro kindly asks his mom for Robux",
        "url": "https://www.reddit.com/r/copypasta/comments/hqv7a7/ben_shapiro_kindly_asks_his_mom_for_robux/",
        "score": 7935,
        "num_comments": 189,
        "created_utc": 1594702337.0,
        "selftext": "Now, let’s say hypothetically, you, my mother. Were to give me, your son, your credit card information. So I could make a purchase of 500 robux on the Roblox.com/store. Contrary to what my sister will have you believe, I have done a very good job of doing my chores, including, but not limited to; The dishes, the laundry and the taking out the trash.",
        "permalink": "/r/copypasta/comments/hqv7a7/ben_shapiro_kindly_asks_his_mom_for_robux/",
        "comments": [
            "Now lets say, hypothetically, party rock isnt in the house tonight",
            "Now, let’s say hypothetically, you, my mother. Were to give me, your son, your credit card information. So I could make a purchase of 500 robux on the Roblox.com/store. Contrary to what my sister will have you believe, I have done a very good job of doing my chores, including, but not limited to; The dishes, the laundry and the taking out the trash.",
            "Ben Shapiro, I will have you know that you can NOT make a purchase of 500 Robux, the closest thing you can buy to 500 Robux is 400 Robux for $4.99. So there is no such thing, as to buy 500 Robux.",
            "[deleted]",
            "Now, let’s say 🗣 hypothetically, you 👆, my mother 👪. Were to give 🎁 me, your 👉 son 🙎‍♂️, your 👉 credit 💸 card 💳 information 👌🏼. So I 👥 could make 🛠 a purchase 💲 of 500 💯 robux 👏 on the Roblox.com/store. Contrary to what my sister 👱‍♀️ will have you 👆 believe 🙅🏻, I 👥 have done ✅ a very ‼ good 👌 job 🙆‍♂️🤵 of doing my chores 🧼, including 📲, but 🍑 not limited 🔒 to; The dishes 😳🍽👈🏼, the laundry and the taking 👊 out the trash ⛹️‍♀️👶🗑. \n\nMessage 📝 [u/Emojify_Creator myself](https://www.reddit.com/message/compose/?to=Emojify_Creator), or the [Emojify Facebook 👥 Messenger Bot 🤖](https://www.messenger.com/t/104121844644171) to Generate 👶👪 Emoji 😂 Pastas 🍝 Like 👍 This!",
            "Theoretically, for example, in a hypothetical situation, for the sake of the argument,\n\n\nWhat would you do if we kissed 🥺😳",
            "Now, wet’s say hypotheticawwy, you, my mothew. Wewe to give me, youw son, youw cwedit cawd infowmation. So I couwd make a puwchase of 500 wobux on the Wobwox.com/stowe. Contwawy to what my sistew wiww have you bewieve, I have done a vewy good job of doing my chowes, incwuding, but not wimited to; The dishes, the waundwy and the taking out the twash.",
            "Ben Chaperon",
            "And these are facts, which don’t care about your feelings by the way",
            "Damn this from tik tok",
            "I just saw this tik tok lmao",
            "Let's say, you've been a bad girl. Let’s say, hypothetically, you’ve been a naughty girl even, ok, and if you were a naughty girl you would also be my dirty little slut right? Then hypothetically speaking you would be my little cumslut. Now let’s say that you’re also daddy’s girl, now that we’ve established you’re both a bad girl and daddy’s girl, then I believe you’d agree with me when I say that you deserve a spanking, am I not correct? A bad girl deserves a spanking and as I am daddy, you are my girl, so I am the one who must provide punishment.",
            "Attention all Roblox gamers. \n\nBen Shapiro is need of help\n\nHe’s trying to get 500 Robux from his mother so he can buy that epic gear\n\nNow, in order to help him, he needs his mother’s credit card information, the expiration date and year, and the three numbers on the back.\n\nBut you have to be quick, so that Ben Shapiro can get that epic gear and look cool on the internet",
            "Ben Shapiro is a loser",
            "Isn't this from a tik tok?",
            "Ok, this is epic.",
            "Let’s say hypothetically I’m not a small dick haver",
            "WRONG! There is no way to purchase exactly 500 robux on the Roblox.com site. The two lowest units are 400 (4.99) and 800 (9.99) so, there is no way to purchase exactly 500 robux.",
            "Not gonna lie. Ive seen this exact same thing because my younger sister showed me the tik tok this is from",
            "I can't be a fucking retard as fucking implies I have sex with my wife - who is a doctor by the way. And I cannot be retarded as my mum says I'm very smart.\n\nLiberals destroyed.",
            "quick reminder that his sister have great honkers",
            "My brother showed me a Tiktok of a guy saying this exact thing, and it was made 3 hours ago",
            "I just read that in Shapiro's voice, and okay, it was epic.",
            "r/toiletpaperusa",
            "Happy B-day Cummy (the others).\nFunny post.",
            "This is from a video I saw yesterday lol",
            "Let's say hypothetically that I shat my pants why you do",
            "But you can’t purchase 500 Robux at a time. The smallest is 400 the the next one is 1000.",
            "haha i saw this tiktok",
            "Let's say that, hypothetically, you stole this from TikTok.",
            " u/Emojify_Creator",
            "Now, let's say hypothetically, you, my mother, made me, your son, dino chicken nuggets for dinner.",
            "u/Emojify_Creator",
            "[deleted]",
            "NTA",
            "I saw that Tiktok. I'm onto you. 👀"
        ]
    },
    {
        "post_id": "k4a2mo",
        "author": "DaMeteor",
        "title": "DaBaby turned white for me, a lesbian",
        "url": "https://www.reddit.com/r/copypasta/comments/k4a2mo/dababy_turned_white_for_me_a_lesbian/",
        "score": 7932,
        "num_comments": 98,
        "created_utc": 1606784880.0,
        "selftext": " I got VIP tickets at a Dababy concert and was invited backstage. After talking with him about his leaked dick pics and how his music helped me realize I was sexually attracted to men, I asked him if he could just turn white so his fans could relate to him more. He just smiled and said it was no problem, and before my eyes the melanin in DaBaby literally started falling out of his skin right in front of me while he was laughing like a maniac. Pretty cool guy tbh.",
        "permalink": "/r/copypasta/comments/k4a2mo/dababy_turned_white_for_me_a_lesbian/",
        "comments": [
            "r/DaBaby is insanity. Not even an opinion, just a fact.\n\nEdit: I guess it was too insane. R.I.P r/DaBaby :(",
            "DaBaby helped me conquer my erectile dysfunction\n\nI am a 65 year old man. For the past 15 years, I have been affected by erectile dysfunction. As I was following my daily procedure of looking through twitter porn in an attempt to get hard, I saw a picture of DaBaby on my timeline. As soon as I saw this picture, my dick instantly shot up, and after a mere 5 seconds of masturbating, I was able to come more than I ever did with my wife during my glory days. Truly, thank you DaBaby.",
            "I 👥 got 🍸 VIP 😎 tickets 💳 at a Dababy 👶🏾 concert 💅🏼🦄🧚🏻‍♀️ and was invited 📲📩💌 backstage ⬅. After 👀ℹ talking 🗣 with him 👴 about 💦 his 💦 leaked 🚰 dick 🍆 pics 🌃👌 and how his 💦 music 🎶 helped 👊 me realize 🤔😮😧 I 👁 was sexually 🍑🍆💦 attracted 💔 to men 👨🏾, I 👁 asked 🙏 him 👴 if he 👥 could just turn 🔄 white ⚪ so his 💦 fans 🏃🏾‍♂️🏃🏽‍♀️🏃🏼‍♀️ could relate 👫 to him 👴 more. He 👨 just smiled 😀 and said 👱🏿💬🙈 it was no 🙅 problem ⚠, and before 😂 my eyes 👀 the melanin 👳 in DaBaby 👶🏾 literally 💯 started 💢 falling 🌇 out of his 💦 skin 👨 right 👌 in front 🔝 of me while he 👨 was laughing 😂 like 👍 a maniac 😈. Pretty 👰 cool 😎 guy 👦🏼 tbh 😠.",
            "I got a VIP card at the Debbie Festival and was invited backstage. After talking to him about the leaked photos and his music, I realized I was sexually attracted to men, so I asked if he would turn white, so fans may have more to do with him. He smiled and said there was nothing wrong with it, and in front of me, Melanin Debavi really started falling out of my skin in front of me when he smiled like an insurance company. Pretty cool tbh guy.",
            "[Source](https://www.reddit.com/r/DaBaby/comments/k3yae0/not_really_into_black_people_all_that_much_so_i/ge5xcu6?utm_source=share&utm_medium=web2x&context=3)",
            "Literally came here to say this",
            " I got VIP tickets at a Dababy concert and was invited backstage. After talking with him about his leaked dick pics and how his music helped me realize I was sexually attracted to men, I asked him if he could just turn white so his fans could relate to him more. He just smiled and said it was no problem, and before my eyes the melanin in DaBaby literally started falling out of his skin right in front of me while he was laughing like a maniac. Pretty cool guy tbh.",
            "This is the best thing I’ve read so far",
            " I got VIP tickets at a Dababy concewt and was invited backstage. Aftew tawking with him about his weaked dick pics and how his music hewped me weawize I was sexuawwy attwacted to men, I asked him if he couwd just tuwn white so his fans couwd wewate to him mowe. He just smiwed and said it was no pwobwem, and befowe my eyes the mewanin in DaBaby witewawwy stawted fawwing out of his skin wight in fwont of me whiwe he was waughing wike a maniac. Pwetty coow guy tbh.",
            "dawhite dababy",
            "I'm not black, should I call him TheBaby?",
            "For mobile users :) \n\nDaBaby turned white for me, a lesbian\n\nI got VIP tickets at a Dababy concert and was invited backstage. After talking with him about his leaked dick pics and how his music helped me realize I was sexually attracted to men, I asked him if he could just turn white so his fans could relate to him more. He just smiled and said it was no problem, and before my eyes the melanin in DaBaby literally started falling out of his skin right in front of me while he was laughing like a maniac. Pretty cool guy tbh.",
            "Da Same Flo",
            "[IMPOSTER](https://www.reddit.com/r/DaBaby/comments/k4d2hl/do_i_look_like_dababybe_honest/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "!emojify",
            "Who?"
        ]
    },
    {
        "post_id": "n1uaug",
        "author": "Nullfic",
        "title": "AITA for sucking my friend's penis?",
        "url": "https://www.reddit.com/r/copypasta/comments/n1uaug/aita_for_sucking_my_friends_penis/",
        "score": 7923,
        "num_comments": 238,
        "created_utc": 1619790758.0,
        "selftext": " I'm (14M) really straight and I've always wanted to befriend females, but the problem with females is that they are annoying and manipulative, they cry all the time and say that you're not good enough while they do nothing to improve themselves. I think men are much more better than females and that we should handle things. We're prettier and more talented and stronger and a lot smarter than them and we don't let emotions take over us. I was talking about this one day with my friend (15F) who thinks exactly like me and he agreed with me that men are the best and then he took off my pants and told me my penis is praiseworthy for a man. I did the same thing to him and then he asked me if I want to feel in my mouth how manly he is so I did it and we switched the roles. It was amazing to see how strong men are together and how much better we are than females. It should be noted that I am a homophobe and what we did wasn't homosexual but was men's empowerment. Am I the asshole?",
        "permalink": "/r/copypasta/comments/n1uaug/aita_for_sucking_my_friends_penis/",
        "comments": [
            "[deleted]",
            "#I just shit and cum at your comment\n\n# FAQ\n\n# What does this mean?\n\nThe amount of shit (and cum) on my computer and floor has increased by one.\n\n# Why did you do this?\n\nThere are several reasons I may deem a comment to be worthy of feces or ejaculation. These include, but are not limited to:\n\n* Being gay\n* Dank copypasta bro, where'd you find it\n* walter\n\n# Am I going to shit and cum too?\n\nNo - not yet. But you should refrain from shitposting and cumposting like this in the future. Otherwise I will be forced to shit and cum again, which may put your shitting and cumming privileges in jeopardy.\n\n# I don't believe my comment deserved being shit and cum at. Can you un-cum it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I put shit back into my butt. If you would like to issue an appeal, shoot me a hot load explaining what I got wrong. I tend to respond to retaliatory ejaculation within several minutes. Do note, however, that over 99.9% of semen dies before it can fertilize the egg, and yours is likely no exception.\n\n# How can I prevent this from happening in the future?\n\nAccept the goopy brown and white substance and move on. But learn from this mistake: your behavior will not be tolerated in my mom's basement. I will continue to shit and cum until you improve your conduct. Remember: ejaculation is privilege, not a right.",
            "NTA your cocks your rules",
            "I'm 😼👌💥 (14M) really 💯 straight 📏 and I've 🙋 always 🕔 wanted 😍 to befriend 👨‍❤️‍👨 females 🧜🏻‍♀️🚺, but 🍑 the problem ⚠ with females 👧 is that they are annoying 😠 and manipulative 😟, they cry 💦😭 all 💯 the time ⏰ and say 👁️‍🗨️💬💭 that you're not good 👌 enough 💦 while they do nothing 🚫 to improve 💕 themselves. I 👁 think 🤔 men 👦 are much 🔥 more better 🎲🎰 than females 👧 and that we should handle 🍑👈 things 📴. We're prettier and more talented 😀😋😍 and stronger 💪 and a lot 🍑 smarter 👩📊 than them and we don't 🚫 let 🙆 emotions 😭 take 💅 over 🔁 us 👨. I 👁 was talking 🗣 about 😎🤔 this one ☝ day 🌞☀ with my friend 👬 (15F) who thinks 🤔 exactly 👌 like 💖 me and he 🏾👨👈 agreed 😸 with me that men 👨 are the best 👌 and then he 👥 took 👫 off 📴 my pants 👖 and told 🗣 me my penis 🍆 is praiseworthy for a man 👦👨👴. I 👁 did the same thing 📴 to him 👴 and then he 👨 asked 🙏 me if I 👁 want 😋 to feel 😁 in my mouth 👄 how manly 👨 he 👥 is so I 👁 did it and we switched 🔀 the roles 😩. It was amazing ❤🧡💛 to see 👁 how strong 💪 men 👨🏻🌊😍 are together 👫👷🏿 and how much 🔥 better 👍 we are than females 👧. It should be noted ❗ that I 👥 am a homophobe 🚮 and what we did wasn't homosexual 🏳️‍🌈 but 🍑 was men's 👴👨 empowerment 💥. Am I 👁 the asshole 🍑🤭?",
            "NTA it's showing homies affection",
            "NTA, your boyfriend’s penis your rules",
            " I'm (14M) weawwy stwaight and I've awways wanted to befwiend femawes, but the pwobwem with femawes is that they awe annoying and manipuwative, they cwy aww the time and say that you'we not good enough whiwe they do nothing to impwove themsewves. I think men awe much mowe bettew than femawes and that we shouwd handwe things. We'we pwettiew and mowe tawented and stwongew and a wot smawtew than them and we don't wet emotions take ovew us. I was tawking about this one day with my fwiend (15F) who thinks exactwy wike me and he agweed with me that men awe the best and then he took off my pants and towd me my penis is pwaisewowthy fow a man. I did the same thing to him and then he asked me if I want to feew in my mouth how manwy he is so I did it and we switched the wowes. It was amazing to see how stwong men awe togethew and how much bettew we awe than femawes. It shouwd be noted that I am a homophobe and what we did wasn't homosexuaw but was men's empowewment. Am I the asshowe?",
            "LMFAO I THOUGHT I WAS ACTUALLY ON AITA",
            "NTA, bros before hoes",
            "NTA, malecock is free real estate",
            "YTA. play stupid games, win stupid prizes",
            "NTA but the dick",
            "# pay the penis tax\n\n* the dog tax but for penis",
            "No soy hetero. pero quiero chupar una vagina. Las vaginas lucen tan jugosas y sabrosas cuando piensas en ellas. Solo imagina tener una calida y húmeda en tu boca mientras que una mujer mas pequeña y débil que tu te acaricia la cabeza y te llama papi. Soy completamente homosexual. Solo tengo un fetiche con vaginas.",
            "NTA, it’s not gay until your socks are off.",
            "Yes YTA because you forgot to say \"no homo\" when you sucked his dick which technically makes you gay, and you inadvertently made your friend gay which is an AH move",
            "I don't get this, why 15F, so that's female?",
            "Cock",
            "I just posted this on r/AmITheAsshole? 😎😎😎\n\nUpdate: I got permanently banned 😔",
            "Nta\nCock cock Cock cock Cock cock Cock cock Cock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cock Cock cock Cock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cockCock cockCock cock Cock cockCock cock Cock cock Cock cock Cock cock",
            "ESH a dick",
            "NTA lots of 🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩🚩",
            "The (15F) killed me",
            "NAH. Although butt stuff would really empower males",
            "I fucking thought this was r/AmITheAsshole",
            "These are back huh",
            "You have been permanently banned from participating in [r/FMA](https://youtu.be/QtBDL8EiNZo).. This ban will last for 7 days. You can still view and subscribe to [r/FMA](https://youtu.be/QtBDL8EiNZo)., but you won't be able to post or comment.\n\nNote from the moderators:\n\nHumankind cannot gain anything without first giving something in return. To obtain, something of equal value must be lost. That is reddit's first law of Equivalent Exchange. In those days, we really believed that to be the world's one, and only truth.\n\nIf you have a question regarding your ban, you can contact the moderator team for [r/FMA](https://youtu.be/QtBDL8EiNZo). by replying to this message.\n\nReminder from the Reddit staff: If you use another account to circumvent this subreddit ban, that will be considered a violation of the Content Policy and can result in your account being suspended from the site as a whole.",
            "deadass thought i was in the AITA sub when I read the whole thing",
            "YTA females can’t have penises",
            "[removed]",
            "NTA, your friend’s penis, your rules",
            "Greco/Roman society:",
            "YTA, didn't say \"no homo\" first so you broke the rules",
            "Is the friend a male or female... (15F) (how manly he is) \nWat",
            "Why is u/N-Word__Count here go away plz",
            "Dudes rock",
            "NTA . It's a bro job not a blow job",
            "When someone gotta put \"really\" before \"straight\", y'know something is probably not right.",
            "YTA, you should've finished to see how strong men finish smh",
            "NTA its not gay if mens empowerment king",
            "yeah you good",
            "Based",
            "I dont see why you WOULD be an asshole for this.... but you can't say this isn't homosexual. Two people of the same gender engaging in sexual acts with each other is basically the definition homosexuality.",
            "I mean, NTA if this is for real but... It just feels like this story is 100% a troll. Gave me a sensible chuckle in either case.\n\nOnly thing I will mention is it's probably not a good thing to make generalizations about an entire gender based on the behavior of a few individuals in your life.",
            "u/N-Word__Count",
            "Clearly a troll post and you morons fell for it",
            "YTA and I hope this is fake",
            "Wrong subreddit lmao",
            "ESH...",
            "NTA your friends are the real \"asshowe\" . It's borderline psychopathic, they're manipulating and gaslighting you into being a homosexual. Throw the whole friend circle out 🚩🚩🚩🚩🚩🚩 RUNNNNN!!",
            "I’m taking a shit and it stinks",
            "Wanna be friends?",
            "Being heterosexual is gay, man. Girls are wussy, dudes are all buff and strong. Reinforcing that is much more masculine than getting all icky with soft lady badness.",
            "You're just helping the homie relieve some stress",
            "YTA, you didn't say no homo and you had your socks off",
            "\"friend (15F)\" sounding a lil fake and gay there, fella",
            "I forgot this was r/copycats for a second",
            "For blowing a dude? No. For being a homophobe? Definitely.",
            "Penis time",
            "as a wise man once said... nta your duck your rules",
            "It says make friend but it shows (15*F*)",
            "Breaking NEWS, you're gay.",
            "INFO: Did you swallow it or spit it out?",
            "We found a trolliest of all troll post",
            "Cursed. This whole sub is cursed. You're all cursed!",
            "Wait where’s cummy? How long has cummybot been gone??",
            "You go, guy!\n\nYasss King!",
            "did u have socks on? and was it on a tuesday?",
            "This is a skit from the Howard Stern show right?",
            "Dear MGTOW,\nIf you hate dating women so much, why don't you just date men?\nCurious.",
            "Lmfao posted this there and got perma banned",
            "just two friends helping each other out i don't see the problem",
            "*w h a t d I d I j u s t r e a d*",
            "14 is too young for intimate relationships",
            "This is what I imagine a guy who complains about OnlyFans and titty streamers sounds like",
            "i just sucked my own dick so it’s not gay",
            "ESH Both of you sucked.",
            "15F",
            "ah yes, (15F), > he took off my pants and told me my penis is praiseworthy for a man. I did the same thing to him and then he asked me if I want to feel in my mouth how manly he is",
            "u/amongusweinerbot",
            "bro I'm 14 and this is funny af 😂😂",
            "Was this actually on r/AITA ? If it was, could you link the post?"
        ]
    },
    {
        "post_id": "bhzv60",
        "author": "Augustine_The_Pariah",
        "title": "Endgame Spoiler",
        "url": "https://www.reddit.com/r/copypasta/comments/bhzv60/endgame_spoiler/",
        "score": 7920,
        "num_comments": 163,
        "created_utc": 1556377051.0,
        "selftext": "Endgame spoiler: Thanos fucking jacks off for 2 hours and 30 minutes with different pan shots and zooms showing his fat, greasy cock and balls and then the last 30 minutes are just him fucking cumming ALL OVER the screen\n\nEdit: credit to u/Raidens_hat",
        "permalink": "/r/copypasta/comments/bhzv60/endgame_spoiler/",
        "comments": [
            "Endgame spoiler: Thanos fucking jacks off for 2 hours and 30 minutes with different pan shots and zooms showing his fat, greasy cock and balls and then the last 30 minutes are just him fucking cumming ALL OVER the screen",
            " \n\nHand full of fuck you. Hope you get fisted by a metal spiked glove. Piece of shit.",
            "I found it weird how the post credits scene is just thanos eating spaghetti for 2 hours.",
            "Thanos fucks Captain Marvel for 3 hours and the avengers fucking watch",
            "Endgame spoiwew: Thanos fucking jacks off fow 2 houws and 30 minutes with diffewent pan shots and zooms showing his fat, gweasy cock and bawws and then the wast 30 minutes awe just him fucking cumming AWW OVEW the scween",
            "r/thanosgonewild",
            " \n\nEverything in my life was going well. I had a loving family, had no financial woes, and enjoyed a quiet and fulfilling middle-class American life. But everything changed after I saw the Endgame spoilers. They popped up on my facebook feed out of nowhere. Immediately I knew that this was the end. I could no longer enjoy this film I had been working on enjoying for 11 years the way the Russos intended. All this hard work from going to the theater in 2008 and seeing Robert Downey Jr. put up his suit as Iron Man to crying while his apprentice died in his arms was now dusted away like my favorite heroes.\n\nI knew I couldn't leave such injustice unpunished. I doxxed my facebook friend from 8th grade that posted the spoilery footage, went to his house, took all of his pokemon cards and burned them in my attic. It should teach him and all the other monsters who ruin precious cinematic experiences a lesson.\n\nYou don't mess with my Marvel movies. You don't spoil one-liners for me. Or I will come after you - and I will avenge my moviegoing experience.\n\nI'm not sure how I will move on after this. Knowing I will never have seen Avengers: Endgame the way the Russos, Kevin Feige and all the thousands of good men and women who worked on the film wanted me too. I thought about therapy, but then realized I couldn't afford it. I thought about bashing my head against a wall to forget the spoilers I saw, but then I realized that my insurance doesn't cover that neither.\n\nI am now doomed to live a life of never seeing Avengers: Endgame the way it was meant to be seen. I am writing this so that you may take measures to protect yourself against those spoilers and so that you may never live the life I now have to live.",
            "Isn’t this directly after he fucks the hulk while eating spaghetti and moaning “mama mia?”",
            "EPIC MOVIE!",
            "but does he do it with the gaunlet",
            "Fuck you dude, I literally came up with this and commented it on somebody elses post and you stole it. At least credit me in the comments or something.",
            "Gun",
            "The hashtag was #washingoffavengerscum so didn’t they jack off on him instead?",
            "🚨DONT CLICK ON THE BOTTOM COMMENT, THERE ARE REAL SPOILERS FOR ENDGAME🚨",
            "Wait that’s illegal",
            "Fucking spoilers",
            "I got scared for a second and I was like EEEE but I realized most of these are stupid",
            "This was a big risk lmao",
            "I'm just gonna copy and paste this whenever someone says not to spoil endgame",
            "Emoji",
            "Goddamn gotta get my hat back from him",
            "Is it ^Parody Endgame in *PornHub*???",
            "Enjoy your ban, faggot.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/trashcandy] [Dad](https://www.reddit.com/r/trashcandy/comments/bi41mf/dad/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "11/10 best picture.",
            "bruh1",
            "Is this a result of his arousal from eating spaghetti throughout infinity war?",
            "I've seen it and can confirm this",
            "Deleted scene- thanos gets arrested",
            "Right story time\nI commented this on my mates picture, gave us a laugh ya know\nBut then I get a DM from my mum\nMy mum fucking saw this and read this with her own eyes\nOh lord i need Jesus please someone send help I can’t face her",
            "[removed]"
        ]
    },
    {
        "post_id": "alept3",
        "author": "jetstreamer123",
        "title": "An extensive list of OwOs and their uses [oc]",
        "url": "https://www.reddit.com/r/copypasta/comments/alept3/an_extensive_list_of_owos_and_their_uses_oc/",
        "score": 7919,
        "num_comments": 289,
        "created_utc": 1548867520.0,
        "selftext": "A collecion of OwOs and their uses:\n\nOwO : Standard use, for noticing bulges \n\nowo : When the bulge isn't as big\n\nuwu : When you're not impressed by the bulge or there isn't one \n\nÒwÓ : Mischievous OwO, for when you're feeling devious \n\n□w□ : The OwO for people who wear glasses\n\n●w● : The OwO if you're wearing sunglasses\n\nOwo : For feeling confused of the bulge\n\n♡w♡ : The legendary OwO, used for bulges so large that you get heart eyes from it. Do not use this emote lightly, for the power of it is great",
        "permalink": "/r/copypasta/comments/alept3/an_extensive_list_of_owos_and_their_uses_oc/",
        "comments": [
            "[deleted]",
            "[removed]",
            "We all have demons OwO\n\nAnd sometimes UwU\n\nThey win  ●w● ",
            "A collecion of OwOs and their uses:\n\nOwO : Standard use, for noticing bulges \n\nowo : When the bulge isn't as big\n\nuwu : When you're not impressed by the bulge or there isn't one \n\nÒwÓ : Mischievous OwO, for when you're feeling devious \n\n□w□ : The OwO for people who wear glasses\n\n●w● : The OwO if you're wearing sunglasses\n\nOwo : For feeling confused of the bulge\n\n♡w♡ : The legendary OwO, used for bulges so large that you get heart eyes from it. Do not use this emote lightly, for the power of it is great",
            "So, what does üwü stand for ?",
            ">!✧w✧!< Nani??????",
            "https://en.m.wikipedia.org/wiki/Battle_of_the_Bulge",
            "What about °w°",
            "👌W👌",
            "OwO\n\nWe all have demons \n\nUwU\n\nAnd sometimes,\n\n⚫️w⚫️\n\nThey win",
            "*notices bulge* OwO\nShaggy: *uses 0.1% of his power bulge is 10x bigger*\n\"hewwo there meat scepter\" ♡w♡\n\nI can't believe I wrote this for arrows.",
            "What about 88w88? The arachnid OwO",
            "O|||||||O is Jeep ",
            "What about ☭w☭?",
            "God is dead and this is the reason why",
            "ಠwಠ\n\n(•w•)\n\n( ͡° w ͡°)\n\n( 。・w・。)人(。・w・。 )\n\n╭( ✖w✖ )╮\n\nᕙ(⇀w↼‶)ᕗ\n\n(╯°w°）╯︵ ┻━┻)\n\n┬─┬ノ( º wºノ) \n\n༼ ༎ຶ w ༎ຶ༽\n\nI had a bunch of emoticons integrated into my app so I desided to... modify them.\n\n👁👄👁\n\n◇w◇\n\n○w○\n\n■w■\n\n♤w♤\n\n♧w♧\n\nAnd bonus OwOs\n\nYou're welcome.",
            "🦶🏻w🦶🏻",
            "😫w😫",
            "❤️〰️❤️",
            "stop",
            "Pulls out meat sceptre",
            "👁‍🗨w👁‍🗨",
            "🌟w🌟",
            "UwO",
            "🅱️w🅱️",
            "What about u/0w0-oWo",
            "ÖwÖ",
            "I don’t know what to feel about this",
            "Degenerates like you belong on a cross",
            "[]w[]",
            "🧿w🧿",
            "👁w👁",
            "What about OwU or ~wO?",
            "👁👄👁",
            "卐w卐",
            "👀W👀 for spiders",
            "☭w☭",
            "Cursed_Copypasta",
            "I can make what I imagine UwU would actually sound like",
            "Thanks",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/theplayfulsuccubus] [An extensive list of OwOs and their uses \\[oc\\]](https://www.reddit.com/r/ThePlayfulSuccubus/comments/bkh7e3/an_extensive_list_of_owos_and_their_uses_oc/)\n\n- [/r/u_the_quinby] [An extensive list of OwOs and their uses \\[oc\\]](https://www.reddit.com/r/u_The_Quinby/comments/alhhlu/an_extensive_list_of_owos_and_their_uses_oc/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Bulges? ",
            "OwO Rawr XD\n\n*nuzzles you*",
            "👁‍🗨👅👁‍🗨",
            "❤️w❤️",
            "oof",
            "👁w👁 for when the bulge is in HD",
            "This is amazing ",
            "Thx",
            "👌w👌",
            "What about 🅱w🅱",
            "Hey guys let me know what you think of my bulge \\*pulls out meat scepter\\*.",
            ">!◇w◇!<",
            "What about ⚡w⚡ ? ",
            "what about 🎃w🎃??",
            "What about UwU",
            "🔞W🔞",
            "the sacred texts",
            "what about ☢️w☢️",
            "I'm gonna break your Nico Nico kneecaps now.",
            "⭕w⭕",
            "(๑╹ω╹๑ ) ?!\n\n･:*+.\\(( °ω° ))/.:+\n\nʕ•ᴥ•ʔ\n\n(´⊙ω⊙`)",
            "Cc, ',",
            "êwê",
            "😩w😩",
            "I wanna be tracer",
            "MAMAAAA OwO\ndidn’t mean to make you cry",
            "u/doctordoom15",
            "(°w°)",
            "QwQ",
            "Lol not at all what I thought it meant",
            "uwu is more of a sassy response tho ",
            "r/coolguides",
            " 🅱️w🅱️",
            "😂w😂",
            "How about \n\n\nUMU!",
            "OwO'd like to kill myself",
            "How about UwO",
            "👱🏿w👱🏿",
            "🗿",
            "🍆w🍆\n\n\nDick eyes",
            "(>ω<)",
            "You have made a powerful enemy out of the weeb community. ÒmÓ",
            "You've made a powerful enemy. ÒmÓ",
            "I decided to add to your list with some art for further understanding(NSFW)\n\n[https://imgur.com/a/S3S5MY7](https://imgur.com/a/S3S5MY7)\n\n&#x200B;\n\n(sorry if this isn't allowed, felt inspired)",
            "👁️‍🗨️w👁️‍🗨️",
            "🍳W🍳",
            "🤠w🤠",
            "Superb work, thanks for creating this helpful guide!",
            "You forgot TwT, the OwO with tears of joy for bulge.",
            "👌w👌",
            "🧿w🧿",
            "🎱w🎱\n\nThe lucky bulge ",
            "🐙w🐙",
            "ÖwÖ",
            "👁👄👁",
            "How about QwQ? ",
            "@w@",
            "<3w<3",
            "Ō\\_Ō (unimpressed owo) ",
            "#ОщО\n       When the bulge is tasty ",
            "🇷🇺w🇷🇺 \n(Oof couldn't find a Soviet flag, good enough)",
            " 𒆙𒉼𒆙 ",
            "!thesaurizethis",
            "🍆W🍆",
            "(° ^w °)",
            "What about ÕwÕ",
            "thankyou",
            "🍔w🍔",
            " O̵̧̕҉w͘̕͟͡O̴̶̸̡",
            "ÕwŌ : Curious about bulge\nÖwŌ : Notched eyebrowo",
            "!Thesurize this",
            "What about Ow🔵",
            "Late but needed   \n\n\nOwÓ  \n\n\nsans owo",
            "-w- if you’re asian",
            "## An extensive list of OwOs and their uses [oc]\n\n📷\n\nA collecion of OwOs and their uses:\n\nOwO : Standard use, for noticing bulges\n\nowo : When the bulge isn't as big\n\nuwu : When you're not impressed by the bulge or there isn't one\n\nÒwÓ : Mischievous OwO, for when you're feeling devious\n\n□w□ : The OwO for people who wear glasses\n\n●w● : The OwO if you're wearing sunglasses\n\nOwo : For feeling confused of the bulge\n\n♡w♡ : The legendary OwO, used for bulges so large that you get heart eyes from it. Do not use this emote lightly, for the power of it is great\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nfor the mobiles",
            "oof",
            "ewO!!",
            "KYS"
        ]
    },
    {
        "post_id": "gpzzdk",
        "author": "ProdRamen",
        "title": "Spotify Ad Copypasta",
        "url": "https://www.reddit.com/r/copypasta/comments/gpzzdk/spotify_ad_copypasta/",
        "score": 7915,
        "num_comments": 320,
        "created_utc": 1590363420.0,
        "selftext": "Thanks for listening to Spotify\n\n\nNo, really\n\n\nYou could've listened to the radio\n\n\nYou could've spun some vinyl\n\n\nYou could've played a cassette tape\n\n\nYou could've listened to an eight track tape, if you knew what an eight track tape looked like\n\n\nBut you listened to Spotify\n\n\nThanks for that\n\n\nAnd you still have hundreds of more playlists to enjoy",
        "permalink": "/r/copypasta/comments/gpzzdk/spotify_ad_copypasta/",
        "comments": [
            "I fucking hate the eight track tape line. I hate it. Where the hell do they get off talking to their patrons like that? The tone in which the woman says it is so demeaning... so condescending... she says it as if she knows me. As if she knows my life. As if she KNOWS my struggles. But no. She doesn’t. She doesn’t know me, and she doesn’t know whether or not I know what an eighth track tape looks like. Nonetheless, it relents. Every time I turn on my 70s easy listening playlist she’s there. Watching. Waiting. Mocking. And every time, she’s there to tell me that I don’t know what an 8 track tape looks like.",
            "What's even the point of that ad even",
            "As a person who has a few 8-tracks and 4-tracks I feel attacked and violated by Spotify and I want a formal apology.",
            " Some guy called Peter managed to jump a skipping rope over 12,000 times in an hour. Really. It's a world record, we looked it up. Well, we think you'd like Spotify Premium. Instead of just six skips an hour, Premium gives you unlimited skips, so you can jump between tracks as much as you like. Learn more about Premium when you tap the banner. Go on, do it for Peter.",
            "Thanks😮😕😢 for4️⃣ listening👂👏 to👏 Spotify\n\n\nNo, really\n\n\nYou could've🤛🏻🤛🏻 listened to💦💦 the👏 radio\n\n\nYou could've🤛🏻 spun some😋❄ vinyl\n\n\nYou could've🤛🏻 played👾👾 a👏👌 cassette➿ tape\n\n\nYou could've🤛🏻 listened to💦 an👏 eight8️⃣ track😎😎 tape,🚧 if☝ you💦 knew💯🤔 what📷😅😦 an👩 eight8️⃣ track💆 tape🚧 looked👎 like\n\n\nBut you👉 listened to2️⃣☝🏽 Spotify\n\n\nThanks for🍆 that\n\n\nAnd you👀👿 still⌛ have🈶 hundreds💯 of👏🏾💦 more➕➕ playlists to👌 enjoy👌",
            "everytime I hear this ad, I really wanna listen to an eight track tape because Spotify girl is being a bitch about it. she always says it so condescending, like I really wanna bash tf out of the person who made this ad.",
            "Thanks fow wistening to Spotify\n\n\nNo, weawwy\n\n\nYou couwd've wistened to the wadio\n\n\nYou couwd've spun some vinyw\n\n\nYou couwd've pwayed a cassette tape\n\n\nYou couwd've wistened to an eight twack tape, if you knew what an eight twack tape wooked wike\n\n\nBut you wistened to Spotify\n\n\nThanks fow that\n\n\nAnd you stiww have hundweds of mowe pwaywists to enjoy",
            "Thanks for listening to Spotify\n\n\nNo, really\n\n\nYou could've listened to the radio\n\n\nYou could've spun some vinyl\n\n\nYou could've played a cassette tape\n\n\nYou could've listened to an eight track tape, if you knew what an eight track tape looked like\n\n\nBut you listened to Spotify\n\n\nThanks for that\n\n\nAnd you still have hundreds of more playlists to enjoy",
            "Those extra five seconds of silence in the ad are really annoying",
            "I *hate* Spotify’s ads so much.  Spotify Free has so many problems in general, but the ads are probably one of the worst.  I can’t stand the one where it says “press this button to listen to a short video for 30 minutes of ad free listening”.  It doesn’t matter if you press the button or wait for that 30 seconds of pain to finish, they’re going to play an ad anyway.  And what’s even worse is that I’m convinced that it isn’t even 30 minutes of ad free music, because after the ads play, you probably get to listen to 2 or 3 songs, then more ads play.  God, Spotify Free sucks.",
            "WHERE IS THE ONE ABOUT PETE WHO SKIPS ROPES",
            "If you like Spotify, you'll *love* Spotify premium",
            "fuck you, and your fucking eight track tape.",
            "i dont know what an eight track tape is but why is the Spotify lady such a fucking bitch about it like shut the fuck up like ugh when i hear her voice i literally want to rip out my ears and eat them",
            "in my language the fucking ad is 10x worse cause the woman sounds like she tried to eat an orange through her nostrils",
            "I fucking hate the Spotify lady\n\nAllow me to set the scene for you: you’re just sitting, chilling and jammin perhaps. Maybe to some mad tunes, some phat beats, whatever tickles your fancy. Your current song just finished. oh!? What will be next? you wonder. You’ve put your playlist on shuffle so you never know what sounds will dance upon your ears next. You clench your butthole in anticipation. But no, that is not what the gods have in store for you today.\n\nIt hits you harder than the cock did on your left cheek last night \n\n“SO MANY THINGS GET IN YOUR WAY: YOUR BOSS, YOUR PARENTS, THOSE SEASONAL ALLERGIES...”\n\nYou get the goddamn point. This stupid fucking lady, in her cheerily, I-am-totally-a-human-trust-me voice is easily among my most hated things in this whole sick bitch of a universe. No, my parents don’t get in my way that much. Stop trying to relate to me, I’m not going to buy Spotify premium. And they have like 30 versions of this dumbass Spotify premium advert with the same calculated stupid piece of shit teen voice to top off the humongous fucking dinosaur shit of attempted teen appeal. My least favorite goes something like this:\n\n“Life is so full of problems nowadays: Did you feed the dog? Did you take a shower? Do you have enough data to take a picture of your dog when it came into the shower?” Her voice gets higher at the third line as if that somehow makes it any more relatable.\n\nWHY THE FUCK WOULD I FORGET TO SHOWER? GODDAMN. FUCK OFF. THERE ARE MORE IMPORTANT ISSUES TO DEAL WITH THAN DATA ON CELLPHONES. SHIT IS DYING AND SUCH. GO FUCKING DIE.\n\nThis singular lady. This singular fucking entity has made me resolute in the decision that I will never buy Spotify premium. I would rather shove my money so far up my ass that I threw it up than give it to the company that engineered this auditory hellscape of an advertisement. I would personally choke every person involved with the creative process if I could. If I were stuck in a room with Hitler, the Devil, and the Spotify advertisement lady, and I were given a gun with two bullets and told I had to give oral sex to the survivor, you best believe Hitler and the Devil are getting the best head of their fucking lives.\n\nThat’s all.",
            "[tap the banner to learn more](https://youtu.be/dQw4w9WgXcQ)",
            "It's such a weird ad. It's like 'instead of supporting a global corporation, you could've bought a hard copy to support your artists directly and also local businesses. So thanks for being a mindless corporate money maker. Also you're so stupid that you don't even know what an 8 track tape is. Dumb bitch'",
            "I get why they made that ad as annoying as it is, and I’m not gonna act like it’s my right to have all the features of Spotify Premium for free, but *WOW* that ad makes me so upset every single time it pops up.",
            "Bruh I was just listening to Fleetwood Mac’s Rumours on 8-track the other day. \n\nMy grandparents have the 8-track player, I’ve a cassette deck, a radio system, a CD player, and a turntable, but not a single music subscription.",
            "This will never be as bad as listening to the same Burger King Rebel Whopper ad 3 times",
            "To be fair, the annoying shitty ads worked on me, when I finally got premium I was so grateful that I wouldn't have to listen to the stupid ads. That's literally the biggest positive for me.\n\nT H E  P E R F E C T  P L A C E  F O R  S O M E  D E E P  H O U S E\n\nD O  I T  F O R  P E T E R\n\nGod, the ads made me want to go diving in an active volcano.",
            "There's little I hate more than Spotify ads. Having my groove interrupted makes them some much more annoying than regular ads.",
            "MAYBE I SHOULD FUCKING LISTEN TO THE FUCKING   RADIO",
            "At first I thought this was an over exaggerated parody of a spotify ad, but after reading the comments, I'm starting to think this is real. I use spotify standard regularly but have never heard this ad, can anyone confirm?",
            "I fucking hate this ad. I out loud said \"not gonna be listening to this much longer if this shit keeps up\"",
            "I've used Spotify free for more than two years and I don't think this is shit enough for me to stop. it's still shit though",
            "HAHA I WAS LISTENING TO SPOTIFY TODAY AND LITERALLY THOUGHT ABOUT WRITING THIS AD HAHA YOU MADE MY DAY BETTER GOD BLESS",
            "and then 10 seconds of silence because they need to stretch it to 30 seconds",
            "The Spotify ads suck massive bird cock and piss and shit cum even",
            "I just want to listen to the mario 64 sound track please stop saying ‘ DID YOU KNOW SPOTIFY MAKES A BRAND NEW PLAYLIST EVERYWEEK, ITS CALLED DISCOVER WEEKLY’",
            "Want a break from the ads? If you tap now to watch a short video, you’ll receive thirty minutes of ad free listening. Yes, really! If you tap now to watch a short video, you’ll receive thirty minutes of ad free music. Thanks for watching, click here for more information. Now, enjoy the next thirty minutes of ad free music.",
            "Shove your eight track tape up your ass you condescending bitch.",
            "What if I'm blind and have no idea what an eight track tape *looks* like but I can still listen to one...",
            "Fuck you.",
            "In the finnish version of this they say \"Aikuisten oikeasti\" which shittily translated is \"Adult really\" as in thats supposed to be more reliable or something",
            "Shut the fuck up woman I'm listening to Soundcloud",
            "Oh FUCK THAT !!!\n\nI use spotify on my ps4 and i have it in spanish and its even more annoying than this cause the woman talking clearly is reading some kind of script and doesnt even know how to say hello in spanish it fos something like\n\nMUCHAS GRACIAS POR ESCUCHAR SPOTIFY\n\nNO ENSERIO TE LO DIGO ENSERIO\n\nPUDISTE HABER PUESTO LA RADIO\n\nESCUCHAR UN CASSETE BUENO MEJOR UN CD\n\nO DESENPOLVAR UN VIEJO DISCO DE VINILO\n\nSI TIENES UN TOCADISCO EN CASA CLARO\n\nPERO DECIDISTE ESCUCHAR SPOTIFY\n\nMuCHas GRaCiaS PoR EsO (it sounds relly weird how she says it like she thinks its english so it sounds really weird)\n\nSIGUE DISFRUTANDO DE LAS PLAYLISTS QUE TENEMOS PARA TI\n\nthe voice ends at 27:00 seconds but the ad ends in 30 seconds\n\nfuck spotify",
            "so lit mobile just sent me this battery pack",
            "YOU DONT EVEN KNOW WHAT AN 8-TRACK TAPE IS DO YOU, YOU LITTLE FUCKING MONKEY BOY!? HUH?! YEAH HOW DOES IT FEEL TO KNOW YOU’LL NEVER KNOW THE JOY OF KNOWING WHAT AN 8-TRACK TAPE LOOKS LIKE?! HAHAHAHAHAHAHHAHAHAHAHAHAHAHAHAHAHAHAH",
            "Wanna know what’s worse than this ad? THE LIT MOBILE BATTERY PACK.",
            "Anybody else get a bunch of pampers ads?",
            "https://youtu.be/Zf8l6NDRekUb I found this video that is a guy saying this script",
            "Spotify premium is like $5 a month for students, and they even gave me a google home mini for free which could be sold to pay for 6 months of Spotify xD",
            "holy shit i just got this ad",
            "And that's why you use a hacked app",
            "There's a German version too. D:",
            "The blatant exclusion of Sony MiniDisc from this list is inexcusable. Do they think we forgot about that? Do they think we'll just let the highest-fidelity recording medium in history just vanish into the ether? No, I say! No! To include eight-track tapes, s blatantly inferior product, when Sony MiniDiscs fall by the wayside is clearly an intentional slap in the face to all *true* audiophiles! They could've said: \"You could've jammed to a MiniDisc\" instead of insulting their listeners' intelligence with that stupid, pointless, and condescending eight-track line. It would've made it clear that Spotify is aware of the one form of media that could've beaten it out, had it had half a chance. But Spotify is afraid. They're afraid that if they give MiniDisc a shot, people will jump ship to that king of recorded media. And they're *right*.",
            "HAHA I WAS LISTENING TO SPOTIFY TODAY AND LITERALLY THOUGHT ABOUT WRITING THIS AD HAHA YOU MADE MY DAY BETTER GOD BLESS",
            "Thank God I dont use spotify.",
            "Haha, vinyl go spin",
            "Can’t they just choose not to run their own ads and make it easier for everyone. I guarantee 100% of the people that use unpaid Spotify know about the existence of Spotify premium.",
            "https://youtu.be/BvQ571eAOZE\n\nBUY SPOTIFY PREMIUM",
            "I was reading it and listening to spotify & guess who popped up, HER ANNOYING ASS",
            "I fucking hate you woman",
            "I hate this with a passion. Fuck this, let it burn in hell. If anything makes me buy premium, its the suffering that this specific ad brings me.",
            "The one I hate is during the Last Podcast episodes. \"So you're a vampire and wanna start a blood sucking business...\" Fucking lame",
            "\\> reads comments.  \n\\> laughs in Spotify premium being included in my cell plan\n\nFor real tho, after reading these comments I'm really really glad and can appreciate that which I've become used to",
            "Y’all are really on Spotify without premium? .......",
            "I emojified it\n\n\nThanks👌 for listening👂🏼to Spotify💚. No🙅‍♀️, really☺️. You👆🏼could’ve listened👂🏼to the radio📻. You could’ve spun🥴 some vinyl💿. You could’ve played👯‍♀️a cassette📼 tape. You could have listened to🤓 an 8track tape💾. IF💁‍♀️you knew🧠what an 8track💾 tape👀LOOKED🤷‍♀️🤦‍♀️like. But you👆🏼 listened to Spotify📱🎶✅. Thanks🙌for that🙏. And🙋🏼‍♀️ there’s still hundreds💯more playlists📲 to enjoy💃🤩.",
            "I have literally never heard this ad on spotify",
            "I already did this.",
            "(if you listen to Spotify on Android, look up JohnEdwardMS)",
            "Is there anywhere to hear this ad lol",
            "ευχαριστουμε που ακουσες το σποτιφυ. αληθεια, το εννοουμε.",
            "Just checking is she Australian for you guys?",
            "I still prefer the Samsung ad they do on spotify",
            "Omg please someone do one about the chocolate swirls go ahead and take it life is better when there’s nothing holding you back AHHHHHHH",
            "I fucking hate this ad with all my heart. What is it advertising? It doesn’t mention Spotify premium, so what the fuck is this piece of shits purpose? It’s literally just to mock me, listing all of the things better than Spotify that I could be doing. At least the other annoying ads advertise something.",
            "*me, over here with premium:* is this some sort of peasant joke I’m too rich to understand?",
            "guys just use bandcamp",
            "The Finnish voice actors sounds like she is talking to children",
            "I want to kill myself after listening to that ad",
            "for anyone wondering what an [8 track tape](https://i.ytimg.com/vi/hB8S6oKjiw8/maxresdefault.jpg) really looks like",
            "This is my least favorite Spotify ad and I have developed a personal vendetta against the person who voiced it.",
            "Found [this](https://researchdirectorinc.com/2019/09/really-spotify/) article about it",
            "everything that bitch says sounds so damn condescending like ok fuck you bitch",
            "by far the worst spotify ad especially that 3 second part or so at the end where its just pure silence",
            "I hate that bitches voice so much\n\nshe sounds like a valley bitch\n\nthe ad makes me  want to throw my phone out of my window",
            "Pro tip close the app when ever there is an add and open it again so it can go away .",
            "!emojify",
            "Upvote this comment if this is a Movie Detail\n\nDownvote this if you feel that it is not.\n\nIf this comment's score falls below a certain number, this submission will be automatically removed.\n\nThese votes are in a trial run period, give your feedback here: https://redd.it/drz5gq",
            "When you have premium and haven't heard the ad, \"I've searched the seven continents, traveled across lands far and wide. I have seen the rise and fall of civilization. I have witnessed the miracle of child birth, and the tragedy of death. Now only one person yet eludes me - after all my travels - and that person just happens to be... The person who asked.\"",
            "[BUY SPOTIFY PREMIUM YOU CHEAP FUCK!](https://www.youtube.com/watch?v=BvQ571eAOZE)",
            "this ad for some reason only plays when i listen to spotify on my sonos roam-",
            "u/cummybot2000"
        ]
    },
    {
        "post_id": "rlnw9c",
        "author": "brbthe1st",
        "title": "My brother thinks that the world runs on hentai logic.",
        "url": "https://www.reddit.com/r/copypasta/comments/rlnw9c/my_brother_thinks_that_the_world_runs_on_hentai/",
        "score": 7907,
        "num_comments": 268,
        "created_utc": 1640119893.0,
        "selftext": "Be me. Accidentally catch my 14 year old brother on Nhentai. Was never gonna bring it up again but the little fuck started acting weird. Apparently he's been browsing the shotacon, incest, milf tags cuz he's recently taken an interest in our aunt. mf isn't even subtle about it. Thinks the world runs on hentai logic. One night when we're sleeping over at her place he wakes up at like 12:00pm and gets out of bed. I'm still awake and follow him. lil bro goes to aunt reading on the couch. He has a massive fucking boner. Pulls the generic hentai \"It suddenly got big\" \"help me\". Whips out his cock and gets closer expecting a fuck. Instead gets screamed at by the aunt and essentially every member of the family the next day, + no internet, TV or videogames for the next year. Serves you right you fucking dumbass",
        "permalink": "/r/copypasta/comments/rlnw9c/my_brother_thinks_that_the_world_runs_on_hentai/",
        "comments": [
            "What a porn addiction does to an mf",
            "r/wholesome r/Awww r/MadeMeSmile",
            "This is just sad.",
            "You're supposed to break your arms first smh",
            "Least horny r/teenagers member",
            "r/teenagers?",
            "nta, aunt should have followed up",
            "i think you mean 12am",
            "He just like me fr",
            "That is a horrible story. Hopefully his interests wan't just a phase for him. Just be careful with him.",
            "MaN oF cUlTuRe",
            "Thank fuck This is a copypasta",
            "I saw this on r/newgreentexts. It's a masterpiece",
            "I really I'm sure my computer. Oh I am not to death feels pointless battle royale! Hoping that is not the career serving dessert in my third chocolate-covered pickle rick sanchez. Like. Rick & 🔪 Leaked Episode I\", Cartmanland)",
            "First time I found this, I laughed so goddamn hard",
            "Was the aunt at least related by marriage?",
            "So I was having online classes with my camera turned off when I started hearing a little whistle from one of the students in the background that seemed very familiar, but I couldn't put my finger on it. The whistling stopped for a couple of minutes until I started hearing it again, and then I knew exactly what it was: it was the chorus of Dream's hit song 'Mask'. I immediately ripped off all my clothes and started furiously stroking my fully erect penis for a good 10 min, even sticking my Dream body pillow up my rectum, imagining that it was Daddy Dream penetrating me while whistling his hit song 'Mask'. It honestly were the greatest 10 minutes of my life, until my libido reached its climax and I let out a gigaload of cum for Daddy Dream that landed on the phone's screen and ended up turning on the mic and camera, and everyone stared horrified at me, screaming at the sight of my honest and earnest love expression to Dream. I was kicked out of the class by the dreamphobic teacher, and today the school principal called me and my parents to a meeting and told us that I may be expelled from the school, merely from expressing my gender and sexuality. What can I do about this?!?!? Was I in the wrong for expressing my gender and identity??!? (Only serious answers, please).",
            "I want to belive that this happened",
            "this is honestly sad",
            "I’ll never stop laughing at this",
            "Honestly wouldn’t be surprised if this was real",
            "How the hell he is so stupid at 14?!! I have a 12 year old brother and he is fucking philosopher, compared to which, his 13-year-old friends are just cretins.\n I don't know what caused it, but it's reads like some kind of nonsense.",
            "im sorry for the aunt honestly",
            "Yeah, kids gotta learn that rape is not how you say hello in Japan.",
            "Loli tags",
            "Dude's got balls, haha",
            "No no no this can't be real",
            "Why can't you copy the fucking text of posts",
            "honestly i want to witness something like that but to be real not like brazzers scenarios",
            "Kids have really been fucked up these days haven’t they.",
            "[removed]",
            "repost",
            "i know this is copypasta but this was a popular post like within the last 5 months",
            "Based",
            "old but gold",
            "Holy shit! I WANT TO FUCKING KILL IT!",
            "I hope this is true",
            "This post gets passed around more than a Kardashian",
            "Could someone unteach me to read please lol",
            "menace to society",
            "Let me guess... r/teenagers ?",
            "Bro your brother need to touch some fucking grass and get out of the fucking computer.",
            "r/nextfuckinglevel",
            "Haven't read the post, but I know this is going to be a good one if it's long.\n\nedit: was expecting a list of action like the \"Kevin\" comment on an ask reddit. But, this suffices.",
            "He sacrificed himself to prove that the world does not run in porn logic\n\nYou will never be forgotten comrade",
            "No you didn’t this is copied from a 4chan greentext",
            "r/repostbot",
            "This isn't real you're making the whole thing up.",
            "I've seen this twice already you retard",
            "Wtf, I saw that already, this is a repost",
            "[removed]",
            "I feel bad for you. Can't believe you have a dumbass of a brother",
            "I think I saw this on another place...",
            "I thought this was fucking real smg",
            "the industrial revolution and its consequences",
            "What being down bad does to an mf 😔",
            "Oh god what have I come across",
            "Thank god I found it again. God bless the algorithm",
            "I want it to be fake but it probably isn't",
            "based and /ss/ pilled",
            "If he's a masochist he can still cum to what they gave him \"punishments\"",
            "Thank god this is r/shitposting",
            "Does anyone know how to un-read something",
            "He woke up at noon?",
            "Please tell me this is a joke  \n\nPlease tell me this is a joke  \n\nPlease tell me this is a joke",
            "i like hentai too but whoever first posted this online has a weird ass brother",
            "Weebs.",
            "Fucking bozo",
            "Literally someone else copy pasted this on my server a few days ago",
            "Wow, of all the days I had the ability to forcefully forget, now? When I lost it? Fuck me",
            "scary shit",
            "Based is a reaction lol.... It's like saying omg. It derives from Based God... Glad to see it's active in the community. When people say based... They Are saying holy fuck essentially",
            "Omg☠",
            "I was 10 when I watched stuff….. and even I was like yeah no way that’s happening ever how does anyone like this shit",
            "xD",
            "It gets worse as you progress for the reader and the character",
            "What if it worked",
            "Fam I got a porn addiction but even I am not that fucking veird XD",
            "L aunt",
            "12:00pm is noon."
        ]
    }
]