[
    {
        "post_id": "ck8ave",
        "author": "Jeanl2",
        "title": "If you're a grown-ass man and you still wipe your ass, you're not a real man.",
        "url": "https://www.reddit.com/r/copypasta/comments/ck8ave/if_youre_a_grownass_man_and_you_still_wipe_your/",
        "score": 7543,
        "num_comments": 192,
        "created_utc": 1564578606.0,
        "selftext": "This should be self explanatory but apparently I have to justify myself.\n\n&#x200B;\n\nThere's nothing more feminine than using a product on your body. Makeup is 100% feminine and by the same logic, so is wiping your ass. I haven't wiped my ass in about 4 years and i've NEVER had any issues. My digestive system is in the top 1% in terms of regularity, functionality, and performance and I've never once felt the need to \"clean up\" after myself.\n\n&#x200B;\n\nIf you shit and you need to wipe, you've got an emasculated GI tract and that's your own issue. Man up and get your shit (literally) together",
        "permalink": "/r/copypasta/comments/ck8ave/if_youre_a_grownass_man_and_you_still_wipe_your/",
        "comments": [
            "Eat the toilet paper so it wipes on the way out",
            "I dont wipe my ass either, i use water to clean it",
            "This should be self explanatory but apparently I have to justify myself.\n\n&#x200B;\n\nThere's nothing more feminine than using a product on your body. Makeup is 100% feminine and by the same logic, so is wiping your ass. I haven't wiped my ass in about 4 years and i've NEVER had any issues. My digestive system is in the top 1% in terms of regularity, functionality, and performance and I've never once felt the need to \"clean up\" after myself.\n\n&#x200B;\n\nIf you shit and you need to wipe, you've got an emasculated GI tract and that's your own issue. Man up and get your shit (literally) together",
            "[deleted]",
            "I thought this was on r/unpopularopinion and I was like wOah buddy calm down",
            "This shouwd be sewf expwanatowy but appawentwy I have to justify mysewf.\n\n&#x200B;\n\nThewe's nothing mowe feminine than using a pwoduct on youw body. Makeup is 100% feminine and by the same wogic, so is wiping youw ass. I haven't wiped my ass in about 4 yeaws and i've NEVEW had any issues. My digestive system is in the top 1% in tewms of weguwawity, functionawity, and pewfowmance and I've nevew once fewt the need to \"cwean up\" aftew mysewf.\n\n&#x200B;\n\nIf you shit and you need to wipe, you've got an emascuwated GI twact and that's youw own issue. Man up and get youw shit (witewawwy) togethew",
            "I just clap my cheeks together and the poo floats away 🍑💨💩 Sometimes a good fart also works.",
            "~OwO~ ***nuzzles you*** Thwis shwould be swelf explanatory bwut apparently I hwave to jwustify myswelf.\n\n&#x200B;\n\nThere's nwothing mwore fweminine thwan using ***nuzzle*** a pwoduct ~OwO~ on your ~OwO~ bwody. Mwakeup is ~OwO~ 100% fweminine ***nuzzle*** and by thwe swame wogic, so is wiping your ass. ~OwO~ ***nuzzle*** I ***pulls out meat scepter*** hwaven't wiped my ass in about 4 ***nuzzle*** years and ~OwO~ i've NWEVER hwad any issues. My ***nuzzle*** dwigestive systwem is in thwe ~OwO~ twop 1% ***nuzzle*** in twerms of ~OwO~ wegularity, fwunctionality, and pwerformance ~OwO~ and I'VE ~OwO~ nwever once fwelt ***nuzzle*** thwe nweed to \"cwean up\" after ~OwO~ myswelf.\n\n&#x200B;\n\nIf you shwit and ***nuzzle*** you nweed to wipe, ~OwO~ you've gwot an ***nuzzle*** emasculated GWI twact and thwat's ~OwO~ your own issue. Mwan up and gwet your ~OwO~ ***nuzzle*** shwit (witerally) twogether",
            "Someone i know insulted this fucking disgusting ass moocher (he only followed us for money) with \"dude, you fucking reek go wipe your ass for once\" and it has spoken to me on a spiritual level",
            "Wait you guys dont catch your shit like this guy?\n\nhttps://youtu.be/gexjlM-jjEc",
            "Is this an ad for a bidet?",
            "Turds stimulate the prostate when exiting, which is gay.  You're a power bottom if you shit *at all*, Nancy.\n\nIf you grew an anus in the first place you've got an emasculated genome and you need to YY up, pillow-biter.",
            "aight..... we're going too taco bell.... and i'm hiding the toilet paper.",
            "[deleted]",
            "r/holup",
            "I have not pooped in the last 14 years",
            "/u/temmie_bot",
            "u/lisptranslator",
            "Top 1% huh.",
            "Just read this on the shitter",
            "This man hasnt touched his butthole in 4 years and claims to be real.  What a virgin.",
            "The person who posted this is the STIIIIINKIEST person with 75% more chance of catching a disease.\n\n&#x200B;\n\n* He doesn't wipe, he smells like shit (literally).\n* He doesn't brush his teeth, his teeth decay and his mouth smells really bad.\n* He doesn't use mouthwash, his mouth smells REALLY bad.\n* He doesn't use deodorant, his whole body smells really bad.\n* He doesn't use soap, his whole body smells REALLY bad.",
            "If you're a grown ass man and you still wipe your ass, then you're not a real man.\nThis should be self explanatory but apparently I have to justify myself.\nThere's nothing more feminine than using a product on your body. Makeup is 100% feminine and by the same logic, so is wiping your ass. I haven't wiped my ass in about 4 years and i've NEVER had any issues. My digestive system is in the top 1% in terms of regularity, functionality, and performance and I've never once felt the need to \"clean up\" after myself.\nIf you shit and you need to wipe, you've got an emasculated GI tract and that's your own issue. Man up and get your shit (literally) together",
            "I’m a female and sometimes I forget to wipe my ass at all.",
            "the guy who invented toilet paper was named gayetti bro",
            "I didn’t know what subreddit i was on and thought it was an r/unpopularopinion",
            "I was so confused as to what subreddit I was in for a second there.",
            " \n\nThis should be self explanatory but apparently I have to justify myself.\n\nThere's nothing more feminine than using a product on your body. Makeup is 100% feminine and by the same logic, so is wiping your ass. I haven't wiped my ass in about 4 years and i've NEVER had any issues. My digestive system is in the top 1% in terms of regularity, functionality, and performance and I've never once felt the need to \"clean up\" after myself.\n\nIf you shit and you need to wipe, you've got an emasculated GI tract and that's your own issue. Man up and get your shit (literally) together",
            "I'm never gonna wipe my butt",
            "lol",
            "Is this the same guy that said taking a shit is gay",
            "Pooping is pretty gay tbh",
            "i thought this was r/unpopularopinion for a sec and i was like \"eh\"",
            "I posted this on my sc story and everyone got so fucking tilted wtf",
            "Instructions unclear. Have applied lipstick to asshole.",
            "Hmmmm...IT guy right? They often smell like ass.",
            "*im a grown-ass man*  \n\n\n[https://www.youtube.com/watch?v=pE27MSkgehY](https://www.youtube.com/watch?v=pE27MSkgehY)",
            "i HoPe ThIs Is A jOkE",
            "I stopped wiping 3 years ago and my T spiked. Since then my dick has seen a growth rate of 4 inches. My biceps are 33 inches around and I’ve since developed the hearing of a Great Horned Owl. Keep your pussy tissue to yourself 🤮👎🏽💩👍🏽💪🏽💯",
            "The obviously superior method is to blast your ass with water at full strength whenever you take a manly shower. Better yet use a hose.",
            "agreed",
            "This is actually a real post from unpopular opinion",
            "I’m assuming you shave your asshole then",
            "r/unpopularopinion",
            "I see this post while wiping my ass with the other hand...",
            "This sounds like a shitpost on r/unpopularopinion",
            "This should be self explanatory but apparently I have to justify myself.\n\n\n\nThere's nothing more feminine than using a product on your body. Makeup is 100% feminine and by the same logic, so is wiping your ass. I haven't wiped my ass in about 4 years and i've NEVER had any issues. My digestive system is in the top 1% in terms of regularity, functionality, and performance and I've never once felt the need to \"clean up\" after myself.\n\n\n\nIf you shit and you need to wipe, you've got an emasculated GI tract and that's your own issue. Man up and get your shit (literally) together\n\nu/uwubot",
            "I thought this is r/unpopularopinion, or at least r/ulpt, but then I read it's r/copypasta and I see no reason to bother :)",
            "....if you dont use a pressure hose set on 10,000 psi....dont even THINK you're a man...",
            "!remindme 18 hours",
            "Top 1% of regularaity",
            "I never use water on my body because I'm a man!",
            "Im a filipino, and i use soap and water to clean my ass.",
            "Bless you sir (or ma’am) for doing this",
            "So this is what this sub finds funny?",
            "Stupid Bitch! Hygiene is equaly musculine as feminine. And girls are nasty slobs as well! Being dirty, unhygienic is as feminine as musculine. Gender doesn't matter! Stop with that sexism! Real men take care of hygiene more than girls."
        ]
    },
    {
        "post_id": "dj4sya",
        "author": "Iamaveryniceguy",
        "title": "My name is Arthur Fleck",
        "url": "https://www.reddit.com/r/copypasta/comments/dj4sya/my_name_is_arthur_fleck/",
        "score": 7540,
        "num_comments": 179,
        "created_utc": 1571310301.0,
        "selftext": "My name is Arthur Fleck I'm 35 years old. My house is in the northeast section of Gotham, where all the houses are, and I am not married. I work as a comic in TV, and I get home every day by 7 PM at the latest. I smoke, but I also occasionally drink. I'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After painting my face like a clown  and doing about twenty minutes of stretches before going to cause chaos, i have no problems sleeping until morning. I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check up at the asylum. I'm trying to explain that I'm a person who wishes to live a very happy life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. I live in a society, and I know that is what brings me happiness. Although, if I were to fight I wouldn't lose to anyone.",
        "permalink": "/r/copypasta/comments/dj4sya/my_name_is_arthur_fleck/",
        "comments": [
            "Stand Master **FLECK ARTHUR**\n\nStand Name **「THE SOCIETY」**",
            "My name is Yoshikage Kira. I’m 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don’t smoke, but I occasionally drink.  I’m in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check-up.  I’m trying to explain that I’m a person who wishes to live a very quiet life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. That is how I deal with society, and I know that is what brings me happiness. Although, if I were to fight I wouldn’t lose to anyone.",
            "My name is Arthur Fleck I'm 35 years old. My house is in the northeast section of Gotham, where all the houses are, and I am not married. I work as a comic in TV, and I get home every day by 7 PM at the latest. I smoke, but I also occasionally drink. I'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After painting my face like a clown  and doing about twenty minutes of stretches before going to cause chaos, i have no problems sleeping until morning. I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check up at the asylum. I'm trying to explain that I'm a person who wishes to live a very happy life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. I live in a society, and I know that is what brings me happiness. Although, if I were to fight I wouldn't lose to anyone.",
            "Guys, this isn't funny 😂, I'm liberal 🏳️‍🌈🌈from bottom of my heart ♥️(Justin Trudeau 🇨🇦for life), and I feel very hurt 🥺😢🤕when you post anti-liberal 🛑🏳️‍🌈content, please stop this nonsense right now😡😡😡😡😡. Or else I ask Daddy Trudeau 🤪😜🤪😜🤪😜🤪😜to deport you😌😌😌😌............. #liberal4life",
            "My name is Awthuw Fweck I'm 35 yeaws owd. My house is in the nowtheast section of Gotham, whewe aww the houses awe, and I am not mawwied. I wowk as a comic in TV, and I get home evewy day by 7 PM at the watest. I smoke, but I awso occasionawwy dwink. I'm in bed by 11 PM, and make suwe I get eight houws of sweep, no mattew what. Aftew painting my face wike a cwown  and doing about twenty minutes of stwetches befowe going to cause chaos, i have no pwobwems sweeping untiw mowning. I wake up without any fatigue ow stwess in the mowning. I was towd thewe wewe no issues at my wast check up at the asywum. I'm twying to expwain that I'm a pewson who wishes to wive a vewy happy wife. I take cawe not to twoubwe mysewf with any enemies, wike winning and wosing, that wouwd cause me to wose sweep at night. I wive in a society, and I know that is what bwings me happiness. Awthough, if I wewe to fight I wouwdn't wose to anyone.",
            "how is this trending",
            "Yo why are the Jojo fans getting downvoted this is literally a reference. It’s basically “Why are you booing me I’m right”",
            "I live in the American Gardens Building on West 81st Street on the 11th floor. My name is Patrick Bateman. I’m 27 years old. I believe in taking care of myself, and a balanced diet and a rigorous exercise routine. In the morning, if my face is a little puffy, I’ll put on an ice pack while doing my stomach crunches. I can do a thousand now. After I remove the ice pack I use a deep pore cleanser lotion. In the shower I use a water activated gel cleanser, then a honey almond body scrub, and on the face an exfoliating gel scrub. Then I apply an herb-mint facial masque which I leave on for 10 minutes while I prepare the rest of my routine. I always use an after shave lotion with little or no alcohol, because alcohol dries your face out and makes you look older. Then moisturizer, then an anti-aging eye balm followed by a final moisturizing protective lotion. There is an idea of a Patrick Bateman. Some kind of abstraction. But there is no real me. Only an entity. Something illusory. And though I can hide my cold gaze, and you can shake my hand and feel flesh gripping yours, and maybe you can even sense our lifestyles are probably comparable, I simply am not there.",
            "iS tHaT a jOjO rEfeReNcE. uWu",
            "My name is Yoshikage Kira. I’m 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don’t smoke, but I occasionally drink. I’m in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check-up. I’m trying to explain that I’m a person who wishes to live a very quiet life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. That is how I deal with society, and I know that is what brings me happiness. Although, if I were to fight I wouldn’t lose to anyone.",
            "Is this a jojo reference",
            "My name is Alvin Flang",
            "What a nice guy",
            "My name is Yoshikage Kira. I'm 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don't smoke, but I occasionally drink. I'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. I was cut in half, destroyed, but through it's Janus Key, the Void called to me. It brought me here and here I was reborn. We cannot blame these creatures, they are being led by a false prophet, an impostor who knows not the secrets of the Void. Behold the Tenno, come to scavenge and desecrate this sacred realm. My brothers, did I not tell of this day? Did I not prophesize this moment? Now, I will stop them. Now I am changed, reborn through the energy of the Janus Key. Forever bound to the Void. Let it be known, if the Tenno want true salvation, they will lay down their arms, and wait for the baptism of my Janus key. It is time. I will teach these trespassers the redemptive power of my Janus key. They will learn it's simple truth. The Tenno are lost, and they will resist. But I, Vor, will cleanse this place of their impurity",
            "Killer Clown has already touched that doorknob.",
            "Did...did you just make a jojo reference",
            "My name is Yoshikage Kira. I'm 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don't smoke, but I ocassionaly drink. I'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check-up. I'm trying to explain that I'm a person who wishes to live a very quiet life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. That is how I deal with society, and I know that is what brings me happiness. Althought, if I were to fight I wouldn't lose to anyone",
            "[https://i.imgur.com/40xdOhN.jpg](https://i.imgur.com/40xdOhN.jpg)",
            "haha yes",
            "Oh no",
            "My nyame is Awthuw Fweck I'm 35 yeaws owd. My house is in the nyowtheast section of Gotham, whewe aww the houses awe, and I am nyot mawwied. I wowk as a comic in TV, and I get home evewy day by 7 PM at the watest. I smoke, but I awso occasionyawwy dwink. I'm in bed by 11 PM, and make suwe I get eight houws of sweep, nyo mattew what. Aftew painting my face wike a cwown and doing about twenty minyutes of stwetches befowe going to cause chaos, i have nyo pwobwems sweeping untiw mownying. I wake up without any fatigue ow stwess in the mownying. I was towd thewe wewe nyo issues at my wast check up at the asywum. I'm twying to expwain that I'm a pewson who wishes to wive a vewy happy wife. I take cawe nyot to twoubwe mysewf with any enyemies, wike winnying and wosing, that wouwd cause me to wose sweep at nyight. I wive in a society, and I knyow that is what bwings me happinyess. Awthough, if I wewe to fight I wouwdn't wose to anyonye.",
            "Stand Master: Joker  \nStand Name: crippling depression and suicidal thoughts",
            "I love this",
            "Hello kira yoshikage",
            "i bet u/Rohan_0ge would like this",
            " \n\nWE LIVE IN A SOCIETY",
            "If Arthur fleck had a zodiac sign, what do you think it would be and why?",
            "STAND PROUD",
            "Wheres cummy?",
            "It was only a matter of time till they fused joker into Kira’s monologue...",
            "The Yoshikage Kira circlejerk is my favorite on yet",
            "Listen 👂🏻👂🏻, my pants👖 accidentally ⚠️⚠️slipped off 💦💨and because I wasn't 🚫⛔🚫wearing underwear🧦👙🥵 my dick💦😝🤦‍♂️🍆🥒 flopped🍆🍆 out. She👱‍♀️👩‍🦰👩‍🦳👷‍♀️ was wearing a high rise skirt👗👠 and as I tripped my hands 🧤👌🏼🖕🏼🖖🏻🤘🏻🤲🏻ripped 💔her clothes🥼🧥🧣👖👚👙 off and my dick 🍆🍆🍆slipped in. After shuffling 🙊👶😿🤺🏊‍♂️💏trying to get up, I accidentally⚠️⚠️⚠️ nutted💦💦😝🥜 on her face. But as she was running 💃🏃‍♀️🧗‍♀️she accidentally ⚠️⚠️⚠️slipped🤸‍♀️ on a banana🍌🍌🍆🍌 peel and cracked her skull 💀☠👻open. \n\nAs a good😇 samaritan😇😇🤠 I wanted to hide the body so it wouldn't have left a gnarly 👌🏼🤟🏻🤙🏻odor🤢🤮👾🛢⚰🧫for the neighbors.😝😎🥰😜😴😴",
            "!thesaurizethis",
            "Society literally broke the entire jojo universe in half smh...",
            " \n\nMy name is Yoshikage Kira. I'm 33 years old. My house is in the northeast section of Morioh, where all the villas are, and I am not married. I work as an employee for the Kame Yu department stores, and I get home every day by 8 PM at the latest. I don't smoke, but I occasionally drink.\n\nI'm in bed by 11 PM, and make sure I get eight hours of sleep, no matter what. After having a glass of warm milk and doing about twenty minutes of stretches before going to bed, I usually have no problems sleeping until morning. Just like a baby, I wake up without any fatigue or stress in the morning. I was told there were no issues at my last check-up.\n\nI'm trying to explain that I'm a person who wishes to live a very quiet life. I take care not to trouble myself with any enemies, like winning and losing, that would cause me to lose sleep at night. That is how I deal with society, and I know that is what brings me happiness. Although, if I were to fight I wouldn't lose to anyone.",
            "HOLLY SHIT IS THAT A JOJO REFERENCE?",
            "r/unexpectedjojo",
            "[deleted]",
            "[deleted]",
            "JoJo bad",
            "Why is this lowkey Yoshikage Kira's backstory",
            "[deleted]"
        ]
    },
    {
        "post_id": "r4r79r",
        "author": "pur__0_0__",
        "title": "I watched my little pony for 6 hours to see some tits.",
        "url": "https://www.reddit.com/r/copypasta/comments/r4r79r/i_watched_my_little_pony_for_6_hours_to_see_some/",
        "score": 7535,
        "num_comments": 109,
        "created_utc": 1638174169.0,
        "selftext": "So I was in 8th or 9th (about 13 or 14) and my ex's sister had a really big crush on me. And I kinda liked her too. Well we're in a Skype call and she's all like \"Hey I want to watch my little pony but I'm scared I'll be made fun of\" and I'm like I'll watch it with you. Fuck it. And she's like aww that's sweet I'll make it up to you. I'll show you my boobs. And blah blah. So we watched *THE FUCKING ENTIRE FRIENDSHIP IS MAGICAL SERIES 6 HOUR YOUTUBE VIDEO* and the video ends and I'm like sweet can you uh. And she's like \"gotta go to sleep\" never did get to see the tits. Kinda still bummed about.",
        "permalink": "/r/copypasta/comments/r4r79r/i_watched_my_little_pony_for_6_hours_to_see_some/",
        "comments": [
            "Title phrasing, christ",
            "It gets better in episode 46 bro trust me bro",
            "r/teenagers?",
            "So I 👁 was in 8th 🎂💥🍕 or 9th (about 💦 13 💯 or 14 🍐®) and my ex's 👎🙅 sister 👱‍♀️ had a really 👌💯 big 🍆 crush 💥💪 on ⤵🔛 me. And I 👁😫 kinda 🙅 liked 😍 her 👩 too. Well 😦 we're in a Skype call 📞 and she's 👩🏻 all 🤬👎😤 like 👍👌😍 \"Hey 👋 I 👁 want 😋🤷♂ to watch 👀 my little 👌 pony 🐴 but 🌏🤔 I'm 💘 scared 😱 I'll 🤫 be made 👑 fun 💃😂😆 of\" and I'm 😼👌💥 like 💖 I'll 📝 watch 👀 it with you 👈. Fuck 👉👌 it. And she's 👩🏾 like 👍 aww 💯 that's ✔ sweet 🍬 I'll 📝 make 💘 it up ☝ to you 👈. I'll 📝 show 📺 you 👉🏼👨 my boobs 🍒. And blah 😞 blah 💬. So we watched 👀 *THE FUCKING 🖕🍑 ENTIRE 🎬🌎 FRIENDSHIP 👫 IS MAGICAL ✨ SERIES 📷 6 🕕 HOUR 😞😳 YOUTUBE 🔫📺 VIDEO 📹* and the video 📼 ends 🔚 and I'm 💘 like 💖 sweet 🍯 can you 👉 uh 😔. And she's 👧 like 😄 \"gotta 👉 go 🏃 to sleep 😴💤\" never ❌ did get 🉐 to see 👀 the tits 🍈. Kinda 🙅 still 🤞🙌 bummed 😢 about 💦.",
            "Down bad",
            "i thought mfer in the story actually watched a pony to see some tits…",
            "[deleted]",
            "At least he was under the illusion of seeing tits in the end, I’ve been subject to the entire show twice just because my niece wants to watch it with me.\n\nI am 32 years old and I know everything about Twilight Sparkle. What the *fuck.*",
            "YTA, most horny redditor ever",
            "You need to remind her",
            "Happens every time I watch My Little Pony to see some tits.",
            "I don't know where this came from but I would 100% believe this actually happened because it sounds like something I would have done back then. Big F for my boy not seeing tiddies.",
            "Dumbass, there’s no tits in the show",
            "what",
            "[removed]",
            "You can just go to her house and see her boobs for yourself",
            "This man is down horrendous",
            "u/uwuwizard",
            "Mans still got a good experience out of it My Little Pony fucking rules",
            "F",
            "u/uwuwizard",
            "i BELIEVE IN THIS",
            "You should have just looked in a mirror",
            "Same",
            "Life lessons",
            "!ThesaurizeThis",
            "Least horny redditor",
            "Expected unicorn tiddies, but not disappointed",
            "shit bro, i got some free ones for you right here.\n\n[NSFW](https://i.imgur.com/Ljh1IlP.jpeg)",
            "Fucking whore",
            "I thought u want to watch some pony's tiddy 😔",
            "Your grammar sucks.",
            "Even if it's fake, shit feels bad...",
            "[removed]",
            "pedo xd",
            "yawn",
            "2 questions \n1)was she your ex even at the time\n2) how old was this sister",
            "Damn",
            "Bro they're are way more then 6 hours of mlp",
            "Everybody talking about the ponies and tits meanwhile im still hung up on fact that its his ex’s sister 😂😂",
            "Next time you see her if you talk to her your a simp.\nJk\n\n\nEdit: I didn’t think the show had boobs but I thought you thought you were gonna see boobs. She’s not worth your time bro unless you wanna date her then you gotta play the role bro\n\nEdit: just noticed this was past tense sorry dude I feel your pain",
            "I smell betrayal 😔",
            "40 year old neckbeards be like \"the show is super deep and has good life lessons\", but the \"deep life lessons and morals of the story\" are just shit like \"don't put raccoons up your ass\" or smthing."
        ]
    },
    {
        "post_id": "ksxolo",
        "author": "UsernameOutOf10",
        "title": "Ben Shapiro asks a girl to prom",
        "url": "https://www.reddit.com/r/copypasta/comments/ksxolo/ben_shapiro_asks_a_girl_to_prom/",
        "score": 7527,
        "num_comments": 121,
        "created_utc": 1610090935.0,
        "selftext": "Ok, so l-let's say, hypothetically, for the sake of the argument, that, perhaps, I, Ben, were to ask you, Stacy, to the prom, right now. Now let me ask you, in that situation, would it not be in your best interest to say yes? I mean the answer is obvious, right? Now let's suppose, that in fact, I was doing so right now, in this room. Now, hypothetically, what would your response be?",
        "permalink": "/r/copypasta/comments/ksxolo/ben_shapiro_asks_a_girl_to_prom/",
        "comments": [
            "id ben d over for you",
            "Ok, so w-wet's say, hypotheticawwy, fow the sake of the awgument, that, pewhaps, I, Ben, was to ask you, Stacy, to the pwom, wight now. Now wet me ask you, in that situation, wouwd it not be in youw best intewest to say yes? I mean the answew is obvious, wight? Now wet's suppose, that in fact, I was doing so wight now, in this woom. Now, hypotheticawwy, what wouwd youw wesponse be?",
            " Well, for that discussion, I can ask Ben, prom, Stacey, now. Let me ask you, isn't that the best thing you can say yes to? I mean right, don't you? I suppose I do this in this room. Why did you answer?",
            "She only dates tall guys",
            "Ok 👌, so l-let's say 🗣, hypothetically, for the sake 😇😩😡 of the argument 🗣, that, perhaps 🤔, I 👥, Ben 👨🏻‍🎓, was to ask ❓❔ you 😰👈, Stacy 👩, to the prom 😪😤😵, right 👌 now. Now let 🙆 me ask ❓ you 👈, in that situation 🎮👾, would it not be in your 🐒👈🏻 best 👌💯 interest 🤔 to say 💬 yes 👍? I 👁 mean 👀👅 the answer 🤤 is obvious 🙄, right 👌💻? Now let's 🙆 suppose 🚫, that in fact 📕, I 👁 was doing so right 👌 now, in this room 💯. Now, hypothetically, what would your 👉 response 📥 be?",
            "Ok, so l-let’s say, hypothetically, for the sake of the argument, that, perhaps, I, Ben, was to ask you, Stacy, to the prom, right now. Now let me ask you, in that situation, would it not be in your best interest to say yes? I mean the answer is obvious, right? Now let’s suppose, that in fact, I was doing so right now, in this room. Now, hypothetically, what would your response be?",
            "Ha bitches I'm taking Stacy's mom to prom",
            "Ben Shapiro went to a boys only Jewish school, do your research. Smh",
            "NTA, your girl, your rules",
            ">I, Ben, was to ask you\n\nwere",
            "Why are the first 15 responses bots, wtf happened to this sub. First it was just cummy, now cummy isn’t even one of them.",
            "I prefer stacy's mom",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿ ⡟⠛⢻⣿⡟⠛⣿⡟⠛⠛⠛⠛⢻⣿⡿⠛⠛⠛⢻⡟⠛⠛⠛⠛⢻⣿ ⡇⠄⠄⢻⡇⠄⣿⣿⣿⠄⠄⣿⣿⡏⠄⣼⣿⣿⣿⡇⠄⣿⣿⣿⣿⣿ ⡇⠄⣧⠄⠄⠄⣿⣿⣿⠄⠄⣿⣿⡇⠄⣿⣿⣿⣿⡇⠄⣥⣥⣥⣿⣿ ⡇⠄⣿⣧⠄⠄⣿⡟⠛⠄⠄⠛⢻⣷⣄⠈⠙⠛⢹⡇⠄⠉⠉⠉⢹⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿",
            "Ok, so l-let's say, hypothetically, for the sake of the argument, that, perhaps, I, Ben, was to ask you, Stacy, to the prom, right now. Now let me ask you, in that situation, would it not be in your best interest to say yes? I mean the answer is obvious, right? Now let's suppose, that in fact, I was doing so right now, in this room. Now, hypothetically, what would your response be?",
            "\"Okay, first off you're my fucking cousin. Second, my name's not Stacy, it's Mara and you know it. And finally, what part of 'restraining order' do you not understand?\"",
            "Oh fuck I may have asked a girl to a dance once in a manner that was like 60% similar to this",
            "Please Abigail",
            "Ben Shapiro is just vsauce politics",
            "Yes Stacy's mom does have it going on and also she do be THICCC",
            "What kind of lazy bitch makes Ben ask *her* to the prom?",
            "Ben Shapiro asks a girl to a porn",
            "Using Judeo-christian logic you can make reasonable assumption as to what Mr Feeney's penis would look and taste like.",
            "Oooo now do one of him asking if he can eat his wife's yummy pussy.",
            "Bem Shapiro is a loser",
            "Ben Shapiro would roast all of you with straight facts 💯",
            "nice.",
            "AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHow did you capture so well?",
            "Why does Ben Shapiro sound like a tsundere in this one?",
            "I’d ask his sister and her big bubongas to prom",
            "Stacy needs that smart boy cock",
            "This is what I like to call a pro gamer move",
            "\" Ok, so l-let's say, hypothetically, for the sake of the argument, that, perhaps, I, Ben, were to ask you, Stacy, to the prom, right now. Now let me ask you, in that situation, would it not be in your best interest to say yes? I mean the answer is obvious, right? Now let's suppose, that in fact, I was doing so right now, in this room. Now, hypothetically, what would your response be?\"    I pressed 2 buttons. Ctrl + C and Ctrl + V.",
            "then Ben will prom with that girl lol",
            "Ok, so let’s say, hypothetically, your mom had it going on"
        ]
    },
    {
        "post_id": "dmeb1e",
        "author": "justanothersonglover",
        "title": "‘Happy’ is one of the most annoying songs ever written.",
        "url": "https://www.reddit.com/r/copypasta/comments/dmeb1e/happy_is_one_of_the_most_annoying_songs_ever/",
        "score": 7518,
        "num_comments": 386,
        "created_utc": 1571911934.0,
        "selftext": "It does not make me happy and I don’t want to clap along. It’s honestly one of the worst songs on earth. I’m sorry to anyone that likes it but I just can’t stand it. It makes me feel really angry when I hear it. That and ‘Roar’ by Katy Perry, which has been played more times on every single radio station than every other song combined it feels. Both of them make me want to rip my own face off.\n\nJust my opinion, you’re welcome to disagree\n\nWhat songs do you find super annoying?\n\nEdit: talking about the song: Happy - Pharrell Williams",
        "permalink": "/r/copypasta/comments/dmeb1e/happy_is_one_of_the_most_annoying_songs_ever/",
        "comments": [
            "i had to listen to this shit everyday of every week of every month back in 6th grade for the 97% of the year",
            "[deleted]",
            "[deleted]",
            "[deleted]",
            "Tell me about it, I had to play it last night in my orchestra concert",
            "sounds like someone feels like a room with a roof",
            "Honestly this copy-pasta isn't that great... The primary reason it has so many upvotes is that it's relatable, but the content of the copy-pasta just sounds like a simple rant more than anything else. :/\n\nAlso, I remember Gnarls Barkely intentionally removed his song \"Crazy\", as to avoid such effects mentioned in the copy-pasta. Link: [https://www.reddit.com/r/todayilearned/comments/9qw7l3/til\\_that\\_in\\_2006\\_gnarls\\_barkley\\_removed\\_their\\_hit/](https://www.reddit.com/r/todayilearned/comments/9qw7l3/til_that_in_2006_gnarls_barkley_removed_their_hit/)",
            "It does not make me happy and I don’t want to cwap awong. It’s honestwy one of the wowst songs on eawth. I’m sowwy to anyone that wikes it but I just can’t stand it. It makes me feew weawwy angwy when I heaw it. That and ‘Woaw’ by Katy Pewwy, which has been pwayed mowe times on evewy singwe wadio station than evewy othew song combined it feews. Both of them make me want to wip my own face off.\n\nJust my opinion, you’we wewcome to disagwee\n\nWhat songs do you find supew annoying?\n\nEdit: tawking about the song: Happy - Phawweww Wiwwiams",
            "While it's overplayed to death and can get pretty annoying, I'd still call it a decent song. Now \"Roar\" on the other hand is just plain terrible, that bland underwhelming piece of trash sucked since day 1.",
            "It does not make me happy and I don’t want to clap along. It’s honestly one of the worst songs on earth. I’m sorry to anyone that likes it but I just can’t stand it. It makes me feel really angry when I hear it. That and ‘Roar’ by Katy Perry, which has been played more times on every single radio station than every other song combined it feels. Both of them make me want to rip my own face off.\n\nJust my opinion, you’re welcome to disagree\n\nWhat songs do you find super annoying?\n\nEdit: talking about the song: Happy - Pharrell Williams",
            "NTA\n\nI hate that song too",
            "Hey! I've seen this one",
            "My elementary school used to harass this shit out of us with Cha Cha Slide, Cupid Shuffle (my least favorite), Cotton Eye Joe, and Happy. They never would stop",
            "I want to crush Kevin, Bob and Stuart into the fucking ground until the bodies are no more.",
            "the worst song of all time is Fight Song, discuss",
            "lmao i saw this shit somewhere",
            "This trash song literally just started playing on the radio when we got in the car after having to put down the dog I grew up with... still bitter about this coincidence",
            "[deleted]",
            "I hate the song and the way people dance in it.  It looks like they have shit in their pants",
            "I think my least favorite song of all time is thunder. Every time I hear it I get one step closer to suicide",
            "Wasn't this on r/unpopularopinion ?",
            "These songs and fucking “Best Day of My Life”.",
            "Tbh never liked it in the first place.\n\nLike the song is just numb, soulless. It feels like it has been written by our AI overlords as an experiment of brainwashing into not committing suicide.",
            "This suddenly brought up a high school memory of a senior who was making a video using the song.\n\nHe had our class in the background doing various things and at one point in a hallway with a bunch of stuff like balloons, pool noodles, etc. While he danced down the hall lip syncing.\n\nThis was meant to be shown during graduation and unfortunately despite him telling us to not be inappropriate, he found out too late (once it was finished, put together, and too close to the deadline to reshoot the scene) that one student was humping a prop in the background and so he couldn't show his video that he worked so hard on anymore.",
            "Had to go to a Christian school for my final year of middle school. For graduation, we had to pick a song to sing in front of all the parents. Some idiot picked See You Again. I don’t think it registered with them that we’d have to actually sing along, and not just listen to it. So graduation comes along, we’re standing in a church in front of our parents, and suddenly the song starts blaring over the speakers. Was the most awkward minutes of my life, as nobody knew the lyrics except for one guy who tried to get everyone to sing it at the start, but nobody even budged. I looked at my father for any sort of help, as I had told him before the graduation that I bet nobody would sing, and it would be overall just painful.",
            "I had to listen to happy for 2 hrs straight during a dissection in 7th grade. I wanted to whip that frog at the teacher",
            "This idiot song wouldn't exist if we lived in a world where Obama wasn't a myth 😔😔😔😔😔😔😔😔",
            "That song by Bruno Mars \"24k Magic\" or that \"Call me Maybe\" song.",
            "NTA",
            "Unironically completely agree.",
            "It's songs like Fight Song, anything by Taylor Swift or Cardi B, and most notoriously: the god awful ear-splitting WatCh mE whIP waTCH me nAe nAE that make me want to kill someone!!",
            "first thought of the Stones song, got hella confused",
            "Welocme to the Jungle, GNR\n\ni used to be a big fan but 30 years later its just brain grinding.",
            "Uptown Funk. That's a definite one",
            "It was my graduation song 🤦🤦",
            "I...                agree",
            "\"Tacky\" is way better.",
            "YTA for not enjoying the song. Just stop being sad smh",
            "You forgot Call me maybe by Carly Rae Jepson",
            "Back in 6th grade, everyone is singing that song like every day on the freaking bus. \n\nUgh, just thinking of that got Happy stuck in my head now. FUCK.",
            "Ok but this is facts I can’t stand that song",
            "That stupid fucking Taylor Swift song,the one that goes \"yA NEed tO CaLm DowN\". It is one of the most bland, corporate, annoying songs I have ever heard.",
            "FULLY AGREE WITH YOU AND THEY PLAY IT AT MY WORK ON THE HOUR 90% OF THE TIME",
            "Now you have both of those songs stuck in my head. Fuck you.",
            "I remember when that song came out and every single radio station would play it constantly.",
            "Ever heard Firework we had to listen to that in 2nd grade almost every day good times",
            "I was in marching band in the HS Pharell went to, and subsequently played that song for every pep rally/football game for a couple years. I hate that song",
            "this but unironically",
            "I have bad memories associated with the song. My first car accident happened when I was listening to this song.",
            "meow",
            "You'll never know pain or hate until you're in a school assembly and Happy is played on loop with minions. We had to wait an entire HOUR with this playing",
            "Well, you’re not wrong about roar",
            "Meow",
            "Epic",
            "🅱️🅾️🅾️**MER**",
            "I like Happy? more.",
            "Dislike Happy, but fuck off I don't think Roar is a catchy tune.\n\nI don't *like* Katy Perry songs, but some just fall into the catchy territory.",
            "smart",
            "At first i thought you were talking about Happy by They Might Be Giants and I was about to get pissed",
            "Original from r/unpopularopinion which btw I strongly disagree.",
            "OH GOD I HATE ROAR SO MUCH. ITS THE ABSOLUTE WORST SONG.",
            "This one was taken from unpopular opinion, gem",
            "Meow",
            "Maybe you will change you mind when you see this? Everybody has a song they like and dislike and that is fine! :) https://youtu.be/WSoTMiRgrjc",
            "Time to copy paste that into r/unpopular opinion",
            "MINIONS.",
            "Hanson - Mmmbop is clearly the worst song ever written. And people dance to it at Christmas parties...like how fucking naive and ignorant do you have to be to the evils of the world to actually dance to that song. No one , at least aware of global financial inequality can find the happiness to dance to the god awful whine.",
            "I get  the feeling y'all like Bo Burnham",
            "Because I’m SAPPY 👏🏻🙄",
            "dang when people talk about their time in elementary school / 6th grade etc. I was like 20 when it came out T-T feeling old as fuck",
            "[deleted]",
            "i actually like the song",
            "My school made a 'parody' of Happy and it was about passing the final exams. I've never felt so much genuine second hand embarassment in my life. It was broadcasted to every classroom in tbr whole school and the mics were terrible.",
            "[deleted]",
            "It might seem crazy what I'm bout to say",
            "Meow",
            "meow",
            "Pharel is so funny to me because he's been a pretty big name in music for a long while, but the dude can't even read music at a base level. Like can't identify eighth notes base level. There's a video somewhere.",
            "Meow",
            "meow",
            "It's a good song, but it was overplayed for you. I first heard it in a depressive episode when I was 30, and I loved it. I got to choose when to listen, and ended up dancing in my boxers.\n\n\nDifferent strokes for different folks.",
            "Makes me want to never go back & listen to Clipse or Neptunes again.",
            "r/unpopularopinion",
            "If it had more variety to its chords, I would maybe be able to tolerate it.",
            "I had to listen to it over 20 times at school for when I volunteered for open house. It was a mistake.",
            "Meow",
            "meow",
            "My mom shares this opinion",
            "My teacher played it everyday in grade 5",
            "Everywhere in 1992:\n\nWOULD I LIE TO YOU BABY\n\nWOULD I LIE TO YOU\n\nOH YEAH\n\nMe in 1992: \n\nFucking kill me.",
            "It’s personally my favorite song but I’ll be willing to have people shit in my mouth",
            "Meow",
            "Roar is pretty bad but it's not nearly at the level that Happy is at",
            "the music video has a minion in it",
            "At my library at my primary school the librarian would always blast Happy over the speakers on repeat. This happened every day.",
            "My class made a music video to this song, for 5th grade graduation",
            "My middle schools ear cancer was Fireflies, which I liked but they played it literally every fucking day",
            "That new fucking Taylor Swift song. Clenching jaw just thinking of it.",
            "does username check out or",
            "Meow",
            "I do not enjoy these songs on my own.\n\nBut when I watch my nieces bop and dance to them, and love them, makes me hate the songs a bit less.",
            "for me, it was uptown funk played nonstop since 5th grade it didn't help that we had to do drama and \n\ndance to that song every day",
            "Meow",
            "Only happy song I like is from the goddess marina https://youtu.be/DCB_MbYyCYQ",
            "[deleted]",
            "It makes the stick in my pants happy",
            "The song is pretty tacky.",
            "i actually remember in 4th or 5th grade when i had to do a performance of roar for a school concert and my mental state lowered quite a bit",
            "Meanwhile happy by marina is one of my favorite songs",
            "Meow",
            "Nice",
            "I couldn't stand the song \"happy\" when it was popular. I hated it.",
            "I think you realize that most pop\nMusic within the 2010 and much of the 2000s is trash.\n\nGood job!",
            "Stream Happy by Mitski instead",
            "Yes , the song is bad . I agree.",
            "i sang this shit for my 5th grade promotion",
            "I wish this started with \"it might seem crazy what i'm about to say\"",
            "God I agree",
            "NTA",
            "Happy is a great song in moderation. The reason why is got so annoying for me is that is was overplayed way too much.",
            "I thought it was the one that goes do doodleoodleoo doodloodleoo doodoo do do do do do",
            "Meow",
            "I hate Happy too but I like roar 🥺 by katy perry",
            "oh i thought he was talking about Happy from Fairy Tail  \n\n\n  \n\n\nsksksksksksk",
            "When my ex broke up with me this song was being played in the radio non-stop. I still can't bear it because it has this \"toxic positivity\" undertone to it.",
            "Meow",
            "I'm very late here but it's because I was searching the internet to see if anyone else felt the need to  skydive at 10,000 feet without a parachute every time Happy by Pharrell Williams come on.  \nI thoroughly love the song \"Can't Stop The Feeling\" by Justin Timberlake because not only is it catchy but brings back amazing memories from college. Some of the best days of my life. SO, The fact that I love that song and then want to fucking out myself out if this universe whenever I hear Happy by Pharrell Williams should say a lot.   \n\n\nThe halloween after 'Happy' came out there was a group of grown ass adult 21 y/o girls that went out to the bar dressed as minions. I was 23 at the time. Not even like the sexy ones either just minions then wore booty shorts. First off don't wear kids characters like that..second off, don't do what I'm about to tell you they did. Ever. I was like oof whatever until they LITERALLY WENT AND REQUESTED the DJ play Happy. I wanted to throw hands. They then grinded to the song on the fucking booth.  \n\n\nI was such a drunk asshole about it. I deadass had never been like this nor have I since. The song pissed me off so much that I roasted the shit out of these 4 girls when the song ended because after they pulled this shit half of the people at the bar had left. Mind you my college was a very nice and well known college in a nice area.. and I say this because there was no 'ratchetness.\"People were just that angered by not only the Minions but even mores this song. Dude I was SO irritated.  \n\n\nI went up to them when they walked outside after the shit they pulled. No one was really there. \"Who the fuck dresses a minions? You're not fucking kids. This is not cute, at all it's fucking cringey and weird!\" I remember one of them saying, \"You don't have to be so mean! We did nothing to warrant this!\" I literally snapped more. \"What? You fucking cleared out half of the BAR! People left because they don't wan't to fucking party with children!\" Then the really quiet one actually stepped up and said, \"It's my Happy song though! We like it. We will do what we want!\" and I literally closed my eyes, took a deep breath, and prayed to glorious God that I could keep composure. \"Normally when people are out with others they can read the room.\" Then this dude chimed in before I could even continue any roasts and he agreed that they were fucking annoying and told them to go home. I'm really glad he did because I literally would have  (Don't drink Jack Daniels btw lol) likely socked someone despite how against that I am. One of the girls looked so upset but I still to this day nearly a decade later do not care. I only felt like shit because I didn't know I had a side of me like that. That me hasn't come back since but still. It's the only time ever that side came out of me and it's the only time I'd never felt guilty....in conclusion it was apparently warranted. \n\nI felt somewhat iffy the next day, but didn't feel bad, at all.    \n\n\nFun fact: I also found out that Jack Daniels died from a fitted rage. He kicked his safe or something like that and died from a toe infection he got following that incident. He 100% was on his own alcohol when he died. It's morbidly funny. Jack Daniels makes you more mean than usual. There are 1 million other drinks but imagine drinking that then dealing with this.\n\n  \nI genuinely felt like punching one of them, but to this day I remain non-violent. I've never been physical with anyone. I don't believe in that. It would take someone like Amy Schumer randomly coming into my house and trying to be funny to make me that annoyed again.\n\nThe combination of Jack Daniels and Happy is absolutely catastrophic.  \n\n\n  \nI. fucking. hate. this. song."
        ]
    },
    {
        "post_id": "ccvizp",
        "author": "DuckGames",
        "title": "Old town road Christian edition (from r/teenagers)",
        "url": "https://www.reddit.com/r/copypasta/comments/ccvizp/old_town_road_christian_edition_from_rteenagers/",
        "score": 7516,
        "num_comments": 260,
        "created_utc": 1563057603.0,
        "selftext": "Yeah, I’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒😎😎😎💯💯💯\nI’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒😎😎😎💯💯💯\n\nI 🙋got the bibles📕📕📕 in the back↩️↩️↩️↩️👈👈👈\nScriptures 📜📜📜📜are attached🔗🔗📎📎🧲🧲\nChairs 💺💺💺💺💺all unstacked\nThe youth 😇😇🙈🙉🙊👦🚸🚸🚸group all at mass👥👥👥👥👥👥🛐🛐🛐🛐🛐\n\nReadin’👓👓👓📖📖📖 His Good Word😊😊😊, ha🤣🤣\nYou can have✊✊👊👊👎👎👎 your world🌍🌎🌏😈😈😈\nI be ☺️☺️☺️🌈🌈with the Savior✝️✝️✝️✝️✝️\nYou ain’t ❌❌❌🙅‍♂️🙅‍♂️🙅‍♂️🚫🚫👎even been to church⛪⛪⛪🕍🕍🛐🛐, now\n\nAin’t🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️ nobody like my Jesus✝️✝️✝️✝️\nNobody❌🚫🙅‍♂️👎 like my Jesus✝️✝️✝️\nAin’t nobody👎🙅‍♂️❌🚫👎 like my Jesus✝️✝️✝️✝️✝️😇😇\nNobody👎🚫🙅‍♂️❌🙅‍♂️ like my Jesus✝️🛐✝️😇😇😇🌈\n\nRidin’🏇🏇🏇🏇 on the Church ⛪⛪⛪Bus🚌🚍🚌🚍🚌🚐🚐🚐\nCommunion🍞🍞🍞🍞🍷🍷🍷🍷🍷👄👄 in my bladder💦💦💦\nPraisin’ 👋👋👏👏👐👐👐with my brothers👫👬👫👬\nClimbin’ 🧗🧗Jacob’s ladder🗼🗼🗼\nMy life 🧬🧬🧬is for Jesus✝️✝️✝️✝️\nFather👴👨‍👦, Son,👶🚼 and Spirit👼👻\nSalvation👐👐👐☦️👼👼 for free, yuh👍👍\nThat’s the Gospel 📰🗞️🗞️🗞️📰, hear it👂👂👂\n\nYeah, I’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯\nI’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯",
        "permalink": "/r/copypasta/comments/ccvizp/old_town_road_christian_edition_from_rteenagers/",
        "comments": [
            "The worst part is if you imagine it to the beat it kinda slaps",
            "is this what praying feels like",
            "Yeah, I’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒😎😎😎💯💯💯\nI’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒😎😎😎💯💯💯\n\nI 🙋got the bibles📕📕📕 in the back↩️↩️↩️↩️👈👈👈\nScriptures 📜📜📜📜are attached🔗🔗📎📎🧲🧲\nChairs 💺💺💺💺💺all unstacked\nThe youth 😇😇🙈🙉🙊👦🚸🚸🚸group all at mass👥👥👥👥👥👥🛐🛐🛐🛐🛐\n\nReadin’👓👓👓📖📖📖 His Good Word😊😊😊, ha🤣🤣\nYou can have✊✊👊👊👎👎👎 your world🌍🌎🌏😈😈😈\nI be ☺️☺️☺️🌈🌈with the Savior✝️✝️✝️✝️✝️\nYou ain’t ❌❌❌🙅‍♂️🙅‍♂️🙅‍♂️🚫🚫👎even been to church⛪⛪⛪🕍🕍🛐🛐, now\n\nAin’t🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️ nobody like my Jesus✝️✝️✝️✝️\nNobody❌🚫🙅‍♂️👎 like my Jesus✝️✝️✝️\nAin’t nobody👎🙅‍♂️❌🚫👎 like my Jesus✝️✝️✝️✝️✝️😇😇\nNobody👎🚫🙅‍♂️❌🙅‍♂️ like my Jesus✝️🛐✝️😇😇😇🌈\n\nRidin’🏇🏇🏇🏇 on the Church ⛪⛪⛪Bus🚌🚍🚌🚍🚌🚐🚐🚐\nCommunion🍞🍞🍞🍞🍷🍷🍷🍷🍷👄👄 in my bladder💦💦💦\nPraisin’ 👋👋👏👏👐👐👐with my brothers👫👬👫👬\nClimbin’ 🧗🧗Jacob’s ladder🗼🗼🗼\nMy life 🧬🧬🧬is for Jesus✝️✝️✝️✝️\nFather👴👨‍👦, Son,👶🚼 and Spirit👼👻\nSalvation👐👐👐☦️👼👼 for free, yuh👍👍\nThat’s the Gospel 📰🗞️🗞️🗞️📰, hear it👂👂👂\n\nYeah, I’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯\nI’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫\nEvangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯",
            "r/dankchristianmemes",
            "Its so hard to read",
            "Yeah, I’m 🙋🙋 gonna take my fwiend👬👬👬 to Sunday🍨🍨 Schoow🏫🏫🏫🏫\nEvangewize 🗣️🗣️📢📢📢🔊🔊‘tiw God👴👴👴✝️✝️✝️ thinks I’m coow🆒🆒🆒😎😎😎💯💯💯\nI’m 🙋🙋 gonna take my fwiend👬👬👬 to Sunday🍨🍨 Schoow🏫🏫🏫🏫\nEvangewize 🗣️🗣️📢📢📢🔊🔊‘tiw God👴👴👴✝️✝️✝️ thinks I’m coow🆒🆒🆒😎😎😎💯💯💯\n\nI 🙋got the bibwes📕📕📕 in the back↩️↩️↩️↩️👈👈👈\nScwiptuwes 📜📜📜📜awe attached🔗🔗📎📎🧲🧲\nChaiws 💺💺💺💺💺aww unstacked\nThe youth 😇😇🙈🙉🙊👦🚸🚸🚸gwoup aww at mass👥👥👥👥👥👥🛐🛐🛐🛐🛐\n\nWeadin’👓👓👓📖📖📖 His Good Wowd😊😊😊, ha🤣🤣\nYou can have✊✊👊👊👎👎👎 youw wowwd🌍🌎🌏😈😈😈\nI be ☺️☺️☺️🌈🌈with the Saviow✝️✝️✝️✝️✝️\nYou ain’t ❌❌❌🙅‍♂️🙅‍♂️🙅‍♂️🚫🚫👎even been to chuwch⛪⛪⛪🕍🕍🛐🛐, now\n\nAin’t🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️ nobody wike my Jesus✝️✝️✝️✝️\nNobody❌🚫🙅‍♂️👎 wike my Jesus✝️✝️✝️\nAin’t nobody👎🙅‍♂️❌🚫👎 wike my Jesus✝️✝️✝️✝️✝️😇😇\nNobody👎🚫🙅‍♂️❌🙅‍♂️ wike my Jesus✝️🛐✝️😇😇😇🌈\n\nWidin’🏇🏇🏇🏇 on the Chuwch ⛪⛪⛪Bus🚌🚍🚌🚍🚌🚐🚐🚐\nCommunion🍞🍞🍞🍞🍷🍷🍷🍷🍷👄👄 in my bwaddew💦💦💦\nPwaisin’ 👋👋👏👏👐👐👐with my bwothews👫👬👫👬\nCwimbin’ 🧗🧗Jacob’s waddew🗼🗼🗼\nMy wife 🧬🧬🧬is fow Jesus✝️✝️✝️✝️\nFathew👴👨‍👦, Son,👶🚼 and Spiwit👼👻\nSawvation👐👐👐☦️👼👼 fow fwee, yuh👍👍\nThat’s the Gospew 📰🗞️🗞️🗞️📰, heaw it👂👂👂\n\nYeah, I’m 🙋🙋 gonna take my fwiend👬👬👬 to Sunday🍨🍨 Schoow🏫🏫🏫🏫\nEvangewize 🗣️🗣️📢📢📢🔊🔊‘tiw God👴👴👴✝️✝️✝️ thinks I’m coow🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯\nI’m 🙋🙋 gonna take my fwiend👬👬👬 to Sunday🍨🍨 Schoow🏫🏫🏫🏫\nEvangewize 🗣️🗣️📢📢📢🔊🔊‘tiw God👴👴👴✝️✝️✝️ thinks I’m coow🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯",
            "[deleted]",
            "I hate this",
            "I was dying mentally inside while singing this. I was ONLY able to sing one sentence before stopping from the pain/suffering that is known as \"singing that song\"",
            "Oui, je vais emmener mon ami à l'école du dimanche Evangéliser \"Dieu\" pense que je suis cool «Je vais emmener mon ami» à l'école du dimanche Evangéliser «Dieu» ✝️ pense que je suis cool🆒🆒🆒😎😎😎💯💯💯\n\n&#x200B;\n\nJe «vois les bibles» dans le dos↩️↩️↩️↩️👈👈👈 Les Écritures moins sont attachées Des chaises 👦🚸🚸🚸groupe tout à la masse👥👥👥👥👥👥🛐🛐🛐🛐🛐\n\n&#x200B;\n\nReadin'👓👓👓📖📖📖 Sa Bonne Parole😊😊😊, ha Tu peux avoir ton monde🌍🌎🌏😈😈😈 Je suis «avec le Sauveur» «Tu n'es même pas allé à l'église», maintenant\n\n&#x200B;\n\nPersonne n'est comme mon Jésus… Personne… comme mon Jésus… Ain ' personne ne ressemble à mon Jésus✝️✝️✝️✝️✝️😇😇 Personne ne ressemble à mon Jésus✝️🛐✝️😇😇😇🌈\n\n&#x200B;\n\nRidin'🏇🏇🏇🏇 sur l'église \"Bus🚌🚍🚌🚍🚌🚐🚐🚐 Communion\" dans ma vessie💦💦💦 Louant 'avec ma frères👫👬👫👬 Climbin '' l'échelle de Jacob 'ma vie est pour Jésus✝️✝️✝️✝️ Père👴👨‍👦, Fils, et Esprit👼👻 Salut Gratuitement, c'est l'Évangile hear, écoute-le!\n\n&#x200B;\n\nOui, je vais emmener mon ami à l'école du dimanche Evangéliser \"Dieu\" pense que je suis cool «Je vais emmener mon ami» à l'école du dimanche Evangéliser «Dieu» ✝️✝️✝️ pense que je suis cool🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯                        \n\n&#x200B;\n\n&#x200B;\n\nTo Canada",
            "How do I remove the emojis?",
            "It sounds like a real thing though",
            "*Hillsong United would like to know your location*",
            "Wait a week and go to church. Someone browsing reddit will have told all the churches nearby and now you've made a horde of Old Town Road Christian Version Singing Priests.",
            ">communion in my bladder,  \n>  \n>praising with my brothers\n\n....",
            "Can't wait for the 456557tth remix",
            "Here's the text without emoji's  \nYeah, I’m gonna take my friend to Sunday School Evangelize ‘til God thinks I’m cool I’m gonna take my friend to Sunday School Evangelize ‘til God thinks I’m cool I got the bibles in the back Scriptures are attached Chairs all unstacked The youth group all at mass Readin’ His Good Word, ha You can have your world I be with the Savior You ain’t even been to church , now Ain’t nobody like my Jesus Nobody like my Jesus Ain’t nobody like my Jesus Nobody like my Jesus Ridin’ on the Church Bus Communion in my bladder Praisin’ with my brothers Climbin’ Jacob’s ladder My life is for Jesus Father, Son, and Spirit Salvation for free, yuh That’s the Gospel , hear it Yeah, I’m gonna take my friend to Sunday School Evangelize ‘til God thinks I’m cool I’m gonna take my friend to Sunday School Evangelize ‘til God thinks I’m cool",
            "I wrote this song for the Christian youth",
            "Where's the part about the private lessons with the pastor",
            "~OwO~ ***nuzzles you*** Yeah, I’M 🙋🙋 gwonna twake my fwiend👬👬👬 to Swunday🍨🍨 Schwool🏫🏫🏫🏫\nevangelize 🗣️🗣️📢📢📢🔊🔊‘twil Gwod👴👴👴✝️✝️✝️ thwinks I’M ***nuzzle*** cwool🆒🆒🆒😎😎😎💯💯💯\nI’m 🙋🙋 gwonna ***nuzzle*** twake my fwiend👬👬👬 to ~OwO~ Swunday🍨🍨 Schwool🏫🏫🏫🏫\nevangelize 🗣️🗣️📢📢📢🔊🔊‘twil Gwod👴👴👴✝️✝️✝️ thwinks ***nuzzle*** I’M cwool🆒🆒🆒😎😎😎💯💯💯\n\nI 🙋gwot thwe bwibles📕📕📕 in thwe bwack↩️↩️↩️↩️👈👈👈\nScriptures 📜📜📜📜ware ~OwO~ attached🔗🔗📎📎🧲🧲\nChairs 💺💺💺💺💺wall unstacked\nThe youth 😇😇🙈🙉🙊👦🚸🚸🚸gwoup ***nuzzle*** all at mwass👥👥👥👥👥👥🛐🛐🛐🛐🛐\n\nReadin’👓👓👓📖📖📖 Hwis Gwood Word😊😊😊, hwa🤣🤣\nYou cwan hwave✊✊👊👊👎👎👎 your ~OwO~ ***nuzzle*** world🌍🌎🌏😈😈😈\nI be ☺️☺️☺️🌈🌈with ***pulls out meat scepter*** thwe ~OwO~ Swavior✝️✝️✝️✝️✝️\nyou ain’t ***nuzzle*** ❌❌❌🙅‍♂️🙅‍♂️🙅‍♂️🚫🚫👎weven bween to chwurch⛪⛪⛪🕍🕍🛐🛐, nwow\n\nAin’t🙅‍♂️🙅‍♂️🙅‍♂️🙅‍♂️ nwobody ***nuzzle*** wike ~OwO~ my Jwesus✝️✝️✝️✝️\nnobody❌🚫🙅‍♂️👎 wike ~OwO~ my ~OwO~ Jwesus✝️✝️✝️\nain’t nwobody👎🙅‍♂️❌🚫👎 wike my Jwesus✝️✝️✝️✝️✝️😇😇\nnobody👎🚫🙅‍♂️❌🙅‍♂️ wike ***nuzzle*** my Jwesus✝️🛐✝️😇😇😇🌈\n\nridin’🏇🏇🏇🏇 on thwe ~OwO~ Chwurch ***nuzzle*** ⛪⛪⛪Bwus🚌🚍🚌🚍🚌🚐🚐🚐\nCommunion🍞🍞🍞🍞🍷🍷🍷🍷🍷👄👄 in my bwadder💦💦💦\nPraisin’ 👋👋👏👏👐👐👐with my bwothers👫👬👫👬\nClimbin’ 🧗🧗Jwacob’s wadder🗼🗼🗼\nMy wife ~OwO~ 🧬🧬🧬wis fwor ***nuzzle*** Jwesus✝️✝️✝️✝️\nfather👴👨‍👦, ***nuzzle*** Swon,👶🚼 and ***nuzzle*** Spwirit👼👻\nsalvation👐👐👐☦️👼👼 fwor fwee, yuh👍👍\nThat’s thwe Gwospel 📰🗞️🗞️🗞️📰, hwear it👂👂👂\n\nYeah, ~OwO~ I’M 🙋🙋 gwonna twake ***nuzzle*** my fwiend👬👬👬 to Swunday🍨🍨 ~OwO~ Schwool🏫🏫🏫🏫\nevangelize 🗣️🗣️📢📢📢🔊🔊‘twil Gwod👴👴👴✝️✝️✝️ thwinks I’M cwool🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯\nI’m 🙋🙋 ~OwO~ gwonna twake ***nuzzle*** my fwiend👬👬👬 to Swunday🍨🍨 ~OwO~ Schwool🏫🏫🏫🏫\nevangelize 🗣️🗣️📢📢📢🔊🔊‘twil Gwod👴👴👴✝️✝️✝️ thwinks I’M cwool🆒🆒🆒🆒🆒😎😎😎😎😎💯💯💯",
            "Ah yes the human species, we've gone from ooga booga to instrumentalized ooga booga",
            "!remind me 69 years",
            "Fr though. This kinda hits hard",
            "Crap, don’t read my old town road copypasta then",
            "Why is this good",
            "😏😏😏😏😏😏😏😏😏😏😏😏😏😏😏😏😏",
            "This hurt my eyes",
            "!thesaurizethis",
            "\"Nobody like my Jesus\" uh I have to agree",
            "!remindme 1 hour",
            "Mmm… yeah.        😍😍😍😍😍😍😍😍😍 Cum in me ooooohhhhhhhh ahhhhhhh yeahhhhhh 😩😩😩😩😩😩😩😍😍😍😍👌😍👌🔫",
            "I got my kids singing;       \nYeah, I’m gonna take my nana to the old folks home.         \nYeah, she can’t wipe her ass no more.        \nMy mum didn’t find it funny",
            "My school literally has a version of this:\n\nImma take my donkey to Jerusalem, I’m gonna preach till I can’t no more\nImma take my donkey to Jerusalem, I’m gonna preach till I can’t no more\nI got disciples in the back, bible is attached\nGod is my man and Jesus’ sandals match.\nJesus can do anything, he made a blind man see\nJesus can do anything, he mad wine from water",
            "I’m a Christian and I have no idea what mass is",
            "Where's the Billy Ray Cyrus verse??",
            "Amazing lol",
            "ah fuck yes",
            "Communion in my bladder.",
            "I read this to the tune of old town road",
            "If you don't praise god Imma shoot and that's on god. If u ain't a christiab imma stab u in the face🙏🙏🙌🙌💍💍🚫🎮🕹🚬🔫🔫🔫🌬",
            "I imagined the Kidz Bop kids singing this.",
            "Is this the kidz bop version?",
            "I can’t read this",
            "!cummybot2000",
            "Ngl this song fucking slaps HARD",
            "u/-ViiRaL- bro I’m sorry if you made this",
            "u/uwutranslator",
            "Was impeccable until the bladder part. I know it's the word in the song but I really think we could have done better.\n\nI'm not mad. I'm just disappointed.",
            "Salvation is truly a free gift from our creator! There are only two choices after we live are life here in earth. Eternity in Hell or eternity in heaven. The rapture of the church can happen at any time. Let us all repent for our sins, have a truly loving relationship with God our father through his son Jesus Christ and be good to another and LOVE one another because love covers a multitude of sins. See you in heaven fellow believers!",
            "gotta comment so i can find this later",
            "!remind me 1 day",
            "I actually sang it to the beat..it actually sounds good.",
            "I want the big death",
            "Yeah, I’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫 Evangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒😎😎😎💯💯💯 I’m 🙋🙋 gonna take my friend👬👬👬 to Sunday🍨🍨 School🏫🏫🏫🏫 Evangelize 🗣️🗣️📢📢📢🔊🔊‘til God👴👴👴✝️✝️✝️ thinks I’m cool🆒🆒🆒😎😎😎💯💯💯",
            "Thanks I hate it",
            "😭 I was an hour late",
            "I cant copy it",
            "How can I copy it? I wanna send it to my grandma! XD",
            "ohhh cummy 💕😤😤",
            "Ah yes, my daily reminder that my lack of a belief in God is despised by almost everyone I know, and will be hidden forever due to fear of isolation",
            "Please tell me this wasn't made unironically",
            "Every day, we move further and further from the Light of the Lord."
        ]
    },
    {
        "post_id": "mp2mi5",
        "author": "None",
        "title": "its 3 am and i fucked up really bad",
        "url": "https://www.reddit.com/r/copypasta/comments/mp2mi5/its_3_am_and_i_fucked_up_really_bad/",
        "score": 7500,
        "num_comments": 142,
        "created_utc": 1618185881.0,
        "selftext": "I was hungry so i decided to eat some bbq wings and watch some anime. there was about 6 of it and i ate 3 and a half. that was when i started to feel a bit funky on my hand and mouth, and i thought to myself \"wow, these bacteria are extra rough today\". i used the flashlight on my phone to see what was going on and there was an army of ants covering my hands and i shit you not, i cough once and my mouth is a shotgun that shoots ants as bullets. i was covered in fear and ants and the urge to scream, but the fear of asian parents is stronger. i can only cry silently in a dark and quiet room, all alone, while being violated by ants.\n\n[source](https://www.reddit.com/r/teenagers/comments/moz2o4/its_3_am_and_i_fucked_up_really_bad/?utm_medium=android_app&utm_source=share) + u/KAMsORn2",
        "permalink": "/r/copypasta/comments/mp2mi5/its_3_am_and_i_fucked_up_really_bad/",
        "comments": [
            "How the fuck did I know it was going to be from r/teenagers",
            "oh god this is awful",
            "Why would you subject us to this?",
            "OP I will give you your karma back tomorrow morning, but for now it’s downvoted to spare someone else’s eyes",
            "I just saw this on r/teenagers",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿⣿⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋⠉⢸ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄⠄⠈ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⢄⣾ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿⣿⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣿⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿⣿⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿⣿⣿",
            "I actually want to throw up but mostly as a distraction so I can focus on something other than the shit I just read",
            "holy fuck I am physically repulsed",
            "I😂was😂hungry😂so😂i😂decided😂to😂eat😂some😂bbq😂wings😂and😂watch😂some😂anime.😂there😂was😂about😂6😂of😂it😂and😂i😂ate😂3😂and😂a😂half.😂that😂was😂when😂i😂started😂to😂feel😂a😂bit😂funky😂on😂my😂hand😂and😂mouth,😂and😂i😂thought😂to😂myself😂\"wow,😂these😂bacteria😂are😂extra😂rough😂today\".😂i😂used😂the😂flashlight😂on😂my😂phone😂to😂see😂what😂was😂going😂on😂and😂there😂was😂an😂army😂of😂ants😂covering😂my😂hands😂and😂i😂shit😂you😂not,😂i😂cough😂once😂and😂my😂mouth😂is😂a😂shotgun😂that😂shoots😂ants😂as😂bullets.😂i😂was😂covered😂in😂fear😂and😂ants😂and😂the😂urge😂to😂scream,😂but😂the😂fear😂of😂asian😂parents😂is😂stronger.😂i😂can😂only😂cry😂silently😂in😂a😂dark😂and😂quiet😂room,😂all😂alone,😂while😂being😂violated😂by😂ants.\n\n[source](https://www.reddit.com/r/teenagers/comments/moz2o4/its_3_am_and_i_fucked_up_really_bad/?utm_medium=android_app&utm_source=share)",
            "I 👁 was hungry 🍆 so i 👁 decided 🤔 to eat 🍚👅💦 some bbq 🍖🥺✨ wings 🍗 and watch 👁👀 some anime 🔥💯. there was about 🤔💭 6 🕕 of it and i 👁 ate 😋🐣 3 ⭕ℹ🕘 and a half 💀. that was when ⏰ i 👥 started 🆕 to feel 😜 a bit 😁 funky 🕺 on 🔛 my hand 🤲 and mouth 💋, and i 👁 thought 🤔 to myself \"wow 😮, these bacteria 🍄🐉 are extra 😄 rough 😖 today 📆\". i 👁 used 🎶 the flashlight 🔦 on 🔛 my phone 🗣 to see 👁 what was going 🏃 on 🔛 and there was an army 💂 of ants 🐜 covering 🍆 my hands ✋👌🤛 and i 👁 shit 💩 you 👈 not, i 👁 cough 🤧🗣 once and my mouth 👄 is a shotgun 🔫 that shoots 🔫 ants 🅱 as bullets 🤷🏽‍♀️. i 👥 was covered 🍆 in fear 😱👻 and ants 🐜 and the urge 😩 to scream 😫, but 🍑 the fear 😰😱 of asian 🍚 parents 👪 is stronger 💪. i 👁 can only cry 😭 silently 🔇 in a dark 🌑 and quiet 🔇 room 💯, all 💯 alone 👤, while being violated 👿 by ants 🐜.   \n  \n[source](https://www.reddit.com/r/teenagers/comments/moz2o4/its_3_am_and_i_fucked_up_really_bad/?utm_medium=android_app&utm_source=share)",
            "r/teenagers is a goldmine",
            "Ants are high in protein though so this was a healthy snack",
            "i knew this was from r/teenagers the moment i saw \"chicken\" and \"funky\"",
            "Holy shit I thought this was from the perspective of a 3 year old",
            "I was hungwy so i decided to eat some bbq wings and watch some anime. thewe was about 6 of it and i ate 3 and a hawf. that was when i stawted to feew a bit funky on my hand and mouth, and i thought to mysewf \"wow, these bactewia awe extwa wough today\". i used the fwashwight on my phone to see what was going on and thewe was an awmy of ants covewing my hands and i shit you not, i cough once and my mouth is a shotgun that shoots ants as buwwets. i was covewed in feaw and ants and the uwge to scweam, but the feaw of asian pawents is stwongew. i can onwy cwy siwentwy in a dawk and quiet woom, aww awone, whiwe being viowated by ants.\n\n[souwce](https://www.weddit.com/w/teenagews/comments/moz2o4/its_3_am_and_i_fucked_up_weawwy_bad/?utm_medium=andwoid_app&utm_souwce=shawe)",
            "Couldn't be real, right? How would you not know you had live ants in your mouth?",
            "This is how OP turns into Antman",
            "One of my coworkers told me a while ago that one day they say down and ate a bowl of cereal (coco crisps or whatever the chocolate rice krispy cereal is called idk) and halfway through the second bowl they realized that the box had a bunch of ants in it. Was not a fun time.",
            "I knew I'd see it here soon enough",
            "I read the titles as \"i am 3 and i fucked up really bad.\" i had to read the whole thing and wonder why tf does a 3 yr old have a phone and watch anime? Then i realized. Bruh",
            "Atleast tag me pls",
            "Reminds me of a coconut fleshlight",
            "r/dildo",
            "This is the worst thing I've ever seen and I've seen dead bodies on here",
            "god.",
            "I came here to laugh, not cum",
            "Whyyyy....",
            "That's why you always eat with the lights on dumbass.",
            "I have watched some weird shit today but this shit is stuck in my brain now",
            "I feel like teenagers is just like, the easiest sub to get vile copypastas from",
            "Well, something like that happened to me actually",
            "Why do you do this to us.",
            "If i were hungry enough to crawl out of bed I would no fucking way eat just 3 and a half chicken wing. What a waste of time and energy.",
            "I feel bad for laughing hysterically at this oh poor guy.",
            "I usually don't feel pain from reading weird shit but this one is just... It's horrific.",
            "I was like \"please be from r/creepypasta please god don't be from r/teenagers I beg you\" before checking the source.  \n\n\n...",
            "I'm leaving this sub, too many spoilers that cannot be stopped, here are the things I spoiled for myself just by being here: spoiled Falcon's titan, Sasha dying, the paths, Eren stopping Ymir, Eren eating the warhammer, Zeke's plan, yeagerist, Zeke's betraying marley and Connie inheriting Eren's Titan, Armin's marrying Eren, Levi impregnating Historia, Levy cheating with Mikasa and dying after nutting by getting eating by her in her titan form",
            "I have no mouth, and I must scream",
            "What if ants crawl into your urethra",
            "I think I vomited when I did read this",
            "Damn, can I buy the ants?",
            "suffering",
            "protein",
            "My balls dropped in fear.",
            "feckin Asian parents",
            "Not as bad as the coconut",
            "How tf did he not notice the ants?",
            "r/teenagers is a cult",
            "u/amonguscockbot",
            "Only stayed for the first line,\nI'm done now",
            "who the fuck decides to get up at 3 am to eat chicken wings???",
            "I did this same thing but with Doritos once, however I think the ants got off the chips when I grabbed them so I didn’t end up eating any",
            "L",
            "Could someone post this shit on the comments so i can copy on my phone?",
            "feels bad man",
            "I saw the original and instantly thought \"yep that'll be a shitpost in a day or two\"",
            "WTF",
            "PrOTeiN",
            "[Looks a lot like this](https://upload.wikimedia.org/wikipedia/en/d/df/Pestilence_%28band%29_-_Consuming_Impulse.jpg)",
            "*crunchy texture*",
            "one time i woke up and ate an old subway cookie sitting on my desk in the morning, it was the double choc one so it was really dark, well it turned out to be covered in ants and I ate half in one bite, still tasted good tho",
            "sounds like r/dph",
            "Maybe his name is ANThony",
            "What the actually fuck",
            "[removed]",
            "Hot",
            "you should kill yourself, to be honest. I'm sorry.",
            "delete this",
            "[deleted]",
            "When the acid hits",
            "[deleted]",
            "u/Amonguscockbot",
            "how",
            "[deleted]"
        ]
    },
    {
        "post_id": "mct687",
        "author": "Jejmaze",
        "title": "Is it true that you become enlightened after having sex?",
        "url": "https://www.reddit.com/r/copypasta/comments/mct687/is_it_true_that_you_become_enlightened_after/",
        "score": 7495,
        "num_comments": 110,
        "created_utc": 1616659801.0,
        "selftext": "It actually is.\n\nWhen I was a virgin I was a right-wing conservative incel puritan with radical extremist fundamentalist fanaticism to my religion\n\nThe day after I lost my virginity it actually made me think a lot and gave me lots of new perspective and I ended up being a left-wing liberal atheist.",
        "permalink": "/r/copypasta/comments/mct687/is_it_true_that_you_become_enlightened_after/",
        "comments": [
            "It actuawwy is.\n\nWhen I was a viwgin I was a wight-wing consewvative incew puwitan with wadicaw extwemist fundamentawist fanaticism to my wewigion\n\nThe day aftew I wost my viwginity it actuawwy made me think a wot and gave me wots of new pewspective and I ended up being a weft-wing wibewaw atheist.",
            "that was some serious post-nut clarity",
            " ***\"Directly after copulation, the devil's laughter is heard\"***",
            "It actually 😳 is.   \n  \nWhen 🍑 I 👁 was a virgin 🔐 I 👁 was a right-wing ⬅🦅 conservative 👨‍💼 incel 😨🤬😱 puritan 👨‍👩‍👧‍👦 with radical 👎🇫🇷 extremist fundamentalist 👍🏽 fanaticism to my religion 🙏   \n  \nThe day 📆🕊 after 👀 I 👁 lost 🏳 my virginity 🇻🇬 it actually 🤔 made 👑 me think 💭 a lot 🍑 and gave 🙌🏻 me lots 💯 of new 🆕 perspective 🛣 and I 💦👁 ended 🔚 up ⬆ being a left-wing liberal 😻 atheist ⛪💒❌.",
            "Source comment. \n\nhttps://reddit.com/r/manga/comments/mcr6gb/_/gs55ck0/?context=1",
            "That's it i will never do the sex",
            "[removed]",
            "From 4-Chan to Twitter in one day",
            "Being fucked in the ass in prison doesn't count!",
            "[CLICK HERE TO CUM](https://www.youtube.com/watch?v=dQw4w9WgXcQ).",
            "I actually don’t remember 🧐 see it’s been such a long time since the first time I had sex and I’ve had so much sex in that time I’ve completely forgotten. Not bad for being 14 😏",
            "This needs to happy to my chud of a cousin",
            "[deleted]",
            "!pekofy",
            "*\"left-wing\"* *\"liberal\"* pick one",
            "I love seeing this and thinking im in a different sub",
            "Damn that got popular fast lmao",
            "First time coming from the source. this feels weird",
            "I wouldn’t know",
            "You can never run out of cum. \n\nI tried.",
            "holy shit lol",
            "Im glad that you found the way!",
            "She fucked god out of him",
            "what no pussy do to a mf",
            "And 100 other ways to tell them that you got AIDS",
            "Does this mean all right wing conservativesare virgins? That explains all.",
            "Based🙌",
            "being a liberal? hah still in dark i guess",
            "Sometimes the extra serotonin can kick-start an otherwise nonfunctional brain...",
            "This but semi-unironically.",
            "It actuawwy is.\n\nWhen I was a viwgin I was a wight-wing consewvative incew puwitan with wadicaw extwemist fundamentawist fanaticism to my wewigion\n\nThe day aftew I wost my viwginity it actuawwy made me think a wot and gave me wots of new pewspective and I ended up being a weft-wing wibewaw atheist.",
            "Are you 12 ?",
            "what the fuck",
            "Wouldn’t know teebs",
            "Wheres is cummy?",
            "thank you for being so brave today",
            "I'm gonna need the original context",
            "!emojify",
            "Bro same 🤣🤣🤣",
            "no it's just the first time you experience post nut clarity and feel some type of way",
            "Idiots can't be enlightened...",
            "I’d give it a 3.1415926535 8979323846 2643383279 5028841971 6939937510 5820974944 5923078164 0628620899 8628034825 3421170679 outta 11",
            "There is a phenomenon called post nut clarity. Does that count?",
            "You only become more enlightend if you go balls deep."
        ]
    },
    {
        "post_id": "p4dlhx",
        "author": "Red_Vienna",
        "title": "A text wall someone sent me after I criticized Elon Musk (TW: homophobia)",
        "url": "https://www.reddit.com/r/copypasta/comments/p4dlhx/a_text_wall_someone_sent_me_after_i_criticized/",
        "score": 7491,
        "num_comments": 548,
        "created_utc": 1628966488.0,
        "selftext": "Firstly, no one cares what you want.  This world doesn't care about you.  Fact of the matter is while you've been plotting your faggy dekulakization fantasy in your basement, he's been sending rockets into space and pushing forward the human race into a new sphere of capability.  Let me ask you again, what the fuck do you contribute to the human race? And I don't give a fuck if he uses child labor for his mines, you know Why?  Because it's worth it.  Every single feat of human progress until the last century has been made using slaves.  It's literally what makes mankind great.  I love the fact that Elon musk is a billionaire, strictly because he gives most of his money to the human race making self driving cars and sustainable energy.  Honestly, I think jealous bitches like you should be rounded up and thrown in a preemptive gulag because that's where class warfare leads inevitably.  You are bitter about his success, even though his work makes your life better in ways you could never comprehend every single sweaty day of your miserable life. If you use the word billionaire apologist, that's communist and I really hope you become a statistic and choke on a bottle of Tylenol pm because you're a faggot and your politics are based on a failed system that uses jealousy as a lever to a elevate the shit tier humans of the world who are literal mongrels at the expense of the 1% who actually move the football of human ingenuity forward. Seriously, I hope you get cancer you fucking commie queer, aids bait faggot.",
        "permalink": "/r/copypasta/comments/p4dlhx/a_text_wall_someone_sent_me_after_i_criticized/",
        "comments": [
            "Holy shit wtf did this guy say to arouse such a response",
            "Sir, please abide by the Reddit amendments:\n\n1. Big Chungus is funny\n2. Keanu Reeves is the second coming of christ\n3. Elon Musk is the third coming of Christ (as well as wholesome 100, he knows Reddit memes)\n4. Fortnite is gay (gay = bad)\n5. Females are dumb while men are cool\n6. Nestle is the worst company ever (as well as the only bad company)\n7. Minecraft is the best game ever made\n8. No emojis allowed (except for 🗿 (yo angelo (it's funny because it's a Jojo reference (if you see someone commit a Jojo reference, you are legally forced to continue the reference chain, if you do not, you will be downvoted)))\n9. Being downvoted means you're wrong, if you think you're being wrongfully downvoted, rethink your comment, and if you still think you were wrongfully downvoted, rethink your comment until you understand what you did wrong\n10. Reddit is the best social media\n\nUntil I have seen major improvements in your behavior, your post will be awarded one downvote (aka Australia upvote, it's funny because Australia is on the opposite side of the globe compared to Europe and America, lol). This is your first and final warning, if you do not abide by these amendments in the future, everyone will dislike that.",
            "This guy's got an oddly specific obsession with hating communism and gays",
            "The person who wrote this would be left behind if Elon  took humanity to space",
            ">because you're a faggot and your politics are based \n\nthank you",
            "If you took the genetic code of a soybean plant and turned it into writing, this is exactly what it would look like",
            "He said slavery is what makes mankind great 😂",
            "Lmao, dude gives off \"finance bro working at macdonalds\" vibes. Also most of the 1% come from generational wealth and do nothing with their power. \"Moving the ball forward\", most of them do nothing.",
            "he is unironically supporting and justifying child and slave labor in his message lmao",
            "> ...his work makes your life **better in ways you could never comprehend** every single sweaty day of your **miserable** life.\n\nHmmm",
            "That guy is a maniac",
            "Reddit moment",
            "guarantee this guy is making minimum wage",
            "NTA, we all know that Elon Musk is the second coming of christ and we should give all of our energy to better his existence.",
            "in this man's perfect world, he is dying in a gulag. what subreddit?",
            "Ok cool, make him a slave worker, let’s see if he likes it then.",
            "elon musk: CHILD LABOR COBALT TOKEN TO THE MOOOOOOOOOOOOON.",
            "Elon Musk ain't gonna have sex with you dude",
            "This guy obviously doesn't know hes going to be conscripted into elons slave army when the class war starts",
            ">Every single feat of human progress until the last century has been made using slaves. It's literally what makes mankind great.\n\nThe fact that this idea exists makes me very sad",
            "i wish elon musk would send his rockets into my ass 😢",
            "Death battle: Elon stans vs Dream stans",
            "Elon musk come up with a transport system not involving “pods” challenge",
            "I love how self-driving cars is on par with, like, the printing press in this guy’s eyes. Literally wouldn’t be necessary if cities were designed better",
            "That last line, Jesus Christ that dude is fatherless",
            "Wholesome 100 elon chungus\n\nGod i hate elon orbiters",
            "Does anyone have it for mobile users",
            "let me guess, white kid, living with his parents until age 40 because he wasted all his money on crypto, n e v e r been touched by a woman (or man who knows what he's into, all that homophobia could be a front lol)",
            "Elon piggybacks on top of creators and actual useful people and calls himself the great inventor, savior of mankind, then he uses this stupid internet persona of \"XDDDD i smoke weed and post memes\" to make stupid bootlicker teenagers horny at the prospect of being enslaved by his corporate global empire built on slavery and abuse.",
            "Yeesh. What flavor does this guy want his boots, huh?",
            "Being a billionaire apologist is literally the opposite of communism-",
            "We now live in a timeline where defending child slavery is seen as almost normal.",
            "Least delusional elon muskrat fan",
            "> firstly no one cares what you think\n\nIf that were true then why respond at all?",
            "\\>It's literally what makes mankind great\n\nHmmm",
            "Musk's fanboys are so delusionnal...",
            "100% satire, “fucking commie queer aids bait faggot” sold me on that",
            "Id bet a dollar that elons bitch ass sent this from an alt account",
            "Mf really said \"slavery makes mankind great\"",
            "name and address, now",
            "No way I’m reading all that but looks funny lol",
            "hes only doing this to bounce off earth, like just him. \n\n\n\nall of \"his inventions\" are hyperass, even the  somewhat good things hes been involved with like tesla, is also kinda really bad, for a couple reasons but for the sake of a grand contribution to humanity, as this man points out. well simply EVs wont help humanity at, its only making a really bad problem slightly less bad while also introducing new problems. \n\n\n\n\nalso fuck mars, im only now realizing that humanity is actually a little serious about going there to begin the new age or whatever, and i just want to say, mars aint it the moon's a lot better.\n\n\neither way personally I'd say how about we solve the problems at home",
            "Wow lol. That guy is crazy.",
            "He is right about a lot in this, but he is obviously a schitzo and is just as retarded as the hypothetical basement dweller he is calling you. He is also a dumb-fuck who inserts his politics into any and every situation which is a whole other problem.",
            "People staning for billionaires is so fucking weird and creepy.",
            "When a 12 year old boy gets possessed by Ayn Rand",
            "!emojify",
            "Oh boy I bet a lot of people are going to bitch about that trigger warning while acting like they're not the one that's offended.",
            "Wow, that dude sounds really American!",
            "Tell me you like licking boots without telling me you like licking boots.\n\n*Inhales*",
            "When twitter users think elon gives a f\\*ck about them lmao",
            "each day it passes, i hate capitalism more",
            "Mods holy fucking shit please lock the comments, it's getting too wild in here!!",
            "Im homophobic but this is too far",
            "People are just sick and Rich assholes fucking up the planet and stealing from the poor, period",
            "The dude is describing himself this entire time, like bro you’re the one on Twitter shithead",
            "Lol he's right tho his class traitor ass is getting thrown in the gulag. \n\nSorry. Let's be kind and put him in a 'Hypergulag' of the future located on an asteroid using all the NASA money SpaceX takes to do anything.",
            "Who's gonna tell this guy that the spaceships that Elon has made would only ever take the wealthy into space?\n\nThe only contribution that Elon makes here is the chance of a spaceship carrying the world's richest suddenly explodes.",
            "you made me leave this sub as you opened my eyes that it's completely lost its original magic",
            "u/uwuwizard",
            "I think homophobia is the least of it lol",
            "Oh my god. This person makes me dislike Elon even more",
            "Wanna name and shame this guy? :p",
            "Wtf r/copypasta has TW now?!",
            "TW lol",
            "I’m a capitalist but god fucking damn.",
            "You tell em OP!",
            "Finally. A necessary trigger warning.",
            "u/uwuwizard",
            "Elon isn’t that great of a character but out of all the billionaires at least he’s more on the Bill Gates side of the alignment chart. He does do a lot of shitty stuff but by and large his contribution to humanity is probably a positive one. He advocates for and advances the adoption of clean energy and cheap space exploration as well as the adoption of crypto currencies in place of centralized money. Of course he also uses child slaves and is an extreme egomaniac. Just like any other public figure he is not immune from criticism but hating on him just to hate on him (NOT what’s happening with the op) isn’t helpful either and we shouldn’t generalize all billionaires as absolute scum when there are people like Gates, Buffet, and Elon running around improving the world. Although this is of course just my opinion. \n\nSidenote: A lot of the hate on Elon also comes from people who don’t actually grasp the real importance of space exploration and most of the space related arguments can honestly just be thrown out immediately because of this.",
            "Is this fake though? I can’t find anything even remotely relating to this outside of this post on your history",
            "[deleted]",
            "They recognized the reality of the existence of class war and honestly decided to be on the side of the bourgeoisie. Less delusional if more insane and evil than most similar assholes.",
            "Are you unironically using “trigger warning”?",
            "Imagine putting a trigger warning on a post in r/copypasta lmfao",
            "what the fuck (thanks for tagging tho)",
            "slavery is literally what makes mankind great - a summary of most pro Elon arguments",
            "What's with the Elon cult? I agree the guy deserves to be praised, but some people take it to another level. I particularly hate how every achievement of Tesla or SpaceX is attributed to him. Or the obnoxious headlines in YouTube \"is game over for the auto industry with this new Tesla invention\", \"Tesla is at least 50 years ahead of the competition\".",
            "That guy LOVES the cock",
            "Based billonaire apologist thinks poor people arent people",
            "this is not homophobic",
            "Lmao I'm going to edit the pasta to remove Elon and use it whenever an alphabet commie from AHS attacks",
            "Lol gigachad",
            "Its gotten to the point that trigger warnings are triggers from me why would people be such pussies that they need TW its so fucking stupid damn (so before you ad TW add a TW before that thnx)  \n\n\n\n\n\n\n/S",
            "I like Elon, I think he's made for some pretty good memes and I love Teslas. They're fucking awesome.\n\nBut like... Advancing the human race with sending rockets into space? No.\nOne argument I can *kind of* see is bringing the cost per launch down, but the only people who are launching rockets atm are Governments and billion dollar companies. (one in the same really) and they don't care how much it costs to launch.\n\nYou aren't ever going to get the cost so low where Jim down the street is gonna be able to launch one from his back garden, are you? Lmao\n\nAt least he's somewhat better than Branson and Bezos. Biggest pissing contest in history those two.\n\nBezos: Ima launch a rocket into space\n\nBranson: N... No I'm GoNnA dO iT bEfOrE u hEHe",
            "Based",
            "[removed]",
            "i think elon is doing a lot of good in the world but child labor isnt an option",
            "Who needs a trigger warning for homophobia?",
            "What is this sub about? Is it stuffed reposted here from elsewhere or is this made up shit",
            "So many run on sentences smh",
            "WTF dekulakization? Like the sweet roll Izuku or what the fuck?",
            "its actually envie not jealousy if it were jealousy you would aso ne a billionaire",
            "This guy: Bro, fuck Elon \n\nElon Fanboy: Allow me to introduce myself",
            "Thanks for the trigger warning, I almost got angry at a fucking copypasta",
            "I swear that's a troll",
            "I swear on my life if I ever saw these billionaires in person I would do everything that I can to end them",
            "Anyone got a source proving that Musk is utilising child labor?",
            "It's a great copypasta! Perfect amount of craziness",
            "r/redditmoment",
            "The fuck does Deku Lakota toon mean\n\nEdit: Autocorrect didn’t like dekulakization",
            "I learned new words",
            "Fuck Space X give NASA money and become stellaris space empire",
            "Is this Elon Musk in the room with us right now?",
            "If someone took the time to write this, they don’t contribute to the human race either",
            "YTA: TLDR but Master Elon is always right, therefore you're the asshole\n😎😎😎😎😎😎😎😎",
            "r/redditmoment for the lowlife that sent you that shit.",
            "Elon Musk defenders Jesus Chris",
            "Jesus, he went all over the political spectrum and then squarely landed on ‘cunt’\n\nWhy are people like this",
            "I mean, he’s kinda right at the first half but it’s not nice to assume that you don’t do anything to give your part to humanity. For as long as we know you could be giving food at a homeless shelter and he sits home all day jerking off to hentai.\n\nHe’s right that Elon does allot for humanity, but he can’t assume stuff about people’s lives",
            "elon musk meatriders are gonna feel so betrayed when elon hops on a spaceship to mars while earth burns lol",
            "This was one of the last subs which were not infested with political discussions. Guess that's over now, too.",
            "topkekkery. would've been based had it not been an elon apologia",
            "I have a similar stalker following me around because I criticized Asmongold. These losers are everywhere.",
            "Fuck Elon musk",
            "Hello mother, is that you? (Except she wouldn’t speak about Elon, it’s the verbal garbage of excuses for the way “life works” is pretty spot on.)",
            "It’s quite obvious that Elon Musk does not care about his fanboys. Based on his behaviour, I doubt he cares about anyone but himself. He was born rich and was lucky with his investment bets. That’s Elon Musk.",
            "New enemy sighted : Elon musk stans",
            "ooh you’ll love this dudes videos https://youtu.be/ACXaFyB_-8s",
            "I think he is in love with Elon",
            "Holy fucking shit",
            "We get it, you want south African billionaire cock, you didn't need to write a book",
            "“Child slavery is what made mankind great”\n- this guy apparently",
            "Man. I've been trying to write a SciFi for a while about a world where all children are slaves to billionaires... But their corporations are the government cause they own the entirety of the new planet they paid to populate... And the YA protagonists will somehow be free to go on an unrelated adventure in this dystopia .... \n\nObviously I have no idea what the plot is but this quote would make an excellent foreword wouldn't it?",
            "At the start I was like \"well, yeah, that's reasonable, he's in fact pushing humanity forward in a way, that's goo- ..slavery, *continues reading*... I think this guy wants to become the new Hitler by worshipping the richest man in the world\"",
            "forgot ppl like this still existed. love the casual support of slavery and child labour added in there.",
            "What sub was this on holy crap",
            "Elon Musk is literally just an investor lmaoo",
            "Based",
            "The virgin homophobic elon fan boy versus the chad elon criticizer.",
            "\"\\[slavery\\] is what makes mankind great\"... \n\n&#x200B;\n\nThat's how you know this copypasta is good.\n\n&#x200B;\n\nAlso what's TW?",
            "What did you even say",
            "Slave - makes mankind great",
            "And the sad thing is that these people.gets paid less to defend him then the slave children in the mines.",
            ">I don't give a fuck if he uses child labor for his mines, you know Why? Because it's worth it. Every single feat of human progress until the last century has been made using **slaves**.  \n>  \n>I love the fact that Elon musk is a billionaire, strictly because **he gives most of his money to the human race** making self driving cars and sustainable energy.\n\nWait, wat?",
            "😮😲😯🙀⚠⚠💥💥TRIGGER WARNING !! 💥💥🧨⚠😮😲😯🙀"
        ]
    },
    {
        "post_id": "h8firy",
        "author": "None",
        "title": "Are you approaching me?",
        "url": "https://www.reddit.com/r/copypasta/comments/h8firy/are_you_approaching_me/",
        "score": 7485,
        "num_comments": 272,
        "created_utc": 1592081333.0,
        "selftext": "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
        "permalink": "/r/copypasta/comments/h8firy/are_you_approaching_me/",
        "comments": [
            "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "Instead of running away, you're coming right to me?",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟",
            "⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⠤⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⢀⠂⠀⣠⣌⣦⢤⣦⡤⠤⠄⠤⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⣸⠀⣀⣉⣽⣷⣶⣾⢶⡖⠀⠀⠀⣤⡀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢠⣾⣿⣿⣿⣿⡿⣿⣿⣿⣷⣄⠀⢀⣴⣿⣿⣆⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠻⣿⣿⣿⣿⡟⢸⣿⣿⣿⣿⣿⣿⣿⣟⣿⣿⣿⡆⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⢸⣷⣿⣿⣿⢻⡇⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡄⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢻⡛⠛⠟⠘⠃⠀⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣧⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢰⡇⢩⣱⠀⠀⠀⠓⠂⣌⠉⢻⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢸⣧⠸⡿⠀⠀⠀⠀⣶⣿⠁⢨⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⢠⣿⠀⠀⠁⢀⡀⠀⠛⠃⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠸⣿⣦⣄⡀⠂⠘⠀⠀⢀⢠⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⣙⠻⠛⠛⠓⠒⠂⠁⠀⠸⠿⢿⣿⣿⣿⣿⣿⣿⡟⠀⠀⠀⠀\n⠀⠂⣀⡄⠐⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢟⠛⠉⠀⠀⠀⠀⠀\n⠠⠊⠀⠀⠑⠈⢄⠕⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠁⠂⢄⠀⠂⠀\n⠈⠄⡀⠀⠀⠀⡘⣩⡐⠂⡀⠀⠀⠀⠠⠀⠰⠉⠨⠴⠀⠈⠒⠂⠁⠀⠀⠱⡐⠀\n⠀⠀⠀⠈⠢⠤⡈⢿⠀⠀⠀⠀⠀⠀⠀⠀⠉⠀⡀⠄⠀⠀⣀⠀⠀⠀⠀⢀⣿⡀\n⠀⠀⠀⠀⠀⠀⠈⠹⠀⠀⠀⠀⠀⠀⠀⠀⠀⠨⠐⢂⣶⣿⣿⡿⠿⣿⣿⣿⠿⠃\n⠀⠀⠀⠀⠀⠀⠀⢰⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠈⢿⣄⠀⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠹⣦⠀⠀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⢰⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢹⣷⡀⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣧⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⡀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⠸⠀⠀⠀⠀⠀⠐█⡔⠀⠀⠀⠀⠀⠀⠀⢸⣿⡏⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⣾⣿⡇⠀⠀⠀⠀\n⠀⠀⠀⠀⠀⠀⠀⡇⠀⠀⠀⠀⠀⠀⢰⠀⠀⠀⠀⠀⠀⠀⢠⣿⣿",
            "‼️‼️HOLY😇 FUCKING💦 SHIT💩‼️‼️‼️‼️ IS THAT👉👉 A MOTHERFUCKING👩‍👧💦 JOJO REFERENCE??????!!!!!!!!!!11!1!1!1!1!1!1! 😱😱😱😱😱😱😱 JOJO 👨‍🎤IS THE BEST🔝🔝 FUCKING 👉👌💦ANIME 🔥🔥🔥🔥💯💯💯💯 JOSUKE IS SO BADASSSSS 😎😎😎😎😎😎😎👊👊👊👊👊 ORAORAORAORAORALORAORAORAORAORAORAORAORAORAORAORAORAORAORAORA 😩😩😩😩😩😩😩😩 😩😩😩😩 MUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDA 🤬😡🤬😡🤬😡🤬🤬😡🤬🤬😡WRYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY😠😠😠😠😠😠 Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Oh you’re approaching me❓❓❓❓❓❓❓❓❓❓But it was me, Dio‼️‼️‼️‼️‼️‼️‼️‼️‼️‼️😂🤣😂🤣😂🤣😂😂😂🤣🤣🤣😂",
            "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣠⣶⡾⠏⠉⠙⠳⢦⡀⠀⠀⠀⢠⠞⠉⠙⠲⡀⠀ ⠀⠀⠀⣴⠿⠏⠀⠀⠀⠀⠀⠀⢳⡀⠀⡏⠀⠀⠀⠀⠀⢷ ⠀⠀⢠⣟⣋⡀⢀⣀⣀⡀⠀⣀⡀⣧⠀⢸⠀⠀⠀⠀⠀ ⡇ ⠀⠀⢸⣯⡭⠁⠸⣛⣟⠆⡴⣻⡲⣿⠀⣸⠀YES⠀ ⡇ ⠀⠀⣟⣿⡭⠀⠀⠀⠀⠀⢱⠀⠀⣿⠀⢹⠀⠀⠀⠀⠀ ⡇ ⠀⠀⠙⢿⣯⠄⠀⠀⠀⢀⡀⠀⠀⡿⠀⠀⡇⠀⠀⠀⠀⡼ ⠀⠀⠀⠀⠹⣶⠆⠀⠀⠀⠀⠀⡴⠃⠀⠀⠘⠤⣄⣠⠞⠀ ⠀⠀⠀⠀⠀⢸⣷⡦⢤⡤⢤⣞⣁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⢀⣤⣴⣿⣏⠁⠀⠀⠸⣏⢯⣷⣖⣦⡀⠀⠀⠀⠀⠀⠀ ⢀⣾⣽⣿⣿⣿⣿⠛⢲⣶⣾⢉⡷⣿⣿⠵⣿⠀⠀⠀⠀⠀⠀ ⣼⣿⠍⠉⣿⡭⠉⠙⢺⣇⣼⡏⠀⠀⠀⣄⢸⠀⠀⠀⠀⠀⠀ ⣿⣿⣧⣀⣿.........⣀⣰⣏⣘⣆⣀⠀⠀",
            "Simp cock Jojo",
            "What is this supposed to be",
            "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣤⣄⠄⡀⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣴⣿⣿⣿⣿⣷⡒⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⡀⣹⣿⣿⣿⣿⣿⣯⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣀⣀⣴⣿⣿⣿⣿⣿⣿⠿⠋⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⢀⣀⣤⣶⣾⠿⠿⠿⠿⣿⣿⣿⣿⣿⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄ ⠄⡶⣶⡿⠛⠛⠉⠉⠄⠄⠄⠄⢸⣿⣿⣿⣿⣿⣿⣿⠃⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠘⠃⠄⠄⠄⠄⠄⠄⠄⠄⢠⣿⣿⣿⣿⣿⡟⠁⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⣤⣾⣷⣿⣿⣿⣿⡏⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⢀⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⠂⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⢀⣤⣴⣾⣿⣿⣿⣿⡿⠛⠻⣿⣿⣿⣿⡇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠸⣿⣿⣿⣿⠋⠉⠄⠄⠄⠄⣼⣿⣿⡿⠇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠈⠻⣿⣿⣆⠄⠄⠄⠄⠄⣿⣿⣿⣷⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠻⣿⣿⣆⡀⠄⠄⠈⠻⣿⣿⣿⣦⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⣀⣌⣿⣿⣿⣦⡄⠄⠄⠄⠙⠻⣿⣿⣦⣀⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠈⠉⠉⠉⠉⠉⠁⠄⠄⠄⠄⠄⠄⠄⠘⠻⣿⢿⢖⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠉⠁⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⣴⣧⣤⣴⡖⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⣰⣿⣿⣿⣿⣿⣷⣀⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠘⠻⢿⣿⣿⣿⣿⣿⣿⣿⣆⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣰⣿⣿⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⢤⣴⣦⣄⣀⣀⣴⣿⡟⢿⣿⡿⣿⣿⣿⣿⣿⣿⡄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠉⠉⠙⠻⠿⣿⡿⠋⠄⠈⢀⣀⣠⣾⣿⣿⣿⣿⣿⡄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠉⠋⠉⠉⠁⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠈⠛⠛⣿⣿⣿⣿⣿⣿⣇⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⢀⣠⣶⣿⣿⠿⢛⣿⣿⣿⣿⣷⣤⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⣶⣷⣿⣿⡉⠄⠄⠄⠄⠉⠉⠉⠉⠉⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠘⠛⠟⢿⣤⣤⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⠄⣠⣶⣶⣷⣿⣶⡊⠄⠄⣀⣤⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⣀⣴⣶⣾⢿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣿⣿⡏⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⢸⣿⡍⠁⠄⠈⢿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠁⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣼⣿⣿⣿⣿⣿⣿⣿⠏⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⡿⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢸⣿⣿⣿⣿⣿⡿⠋⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣿⣿⣿⣿⣡⣶⣶⣄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⣀⣀⣠⣴⣦⡤⣿⣿⣿⣿⡻⣿⣿⡯⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣷⣿⣿⣿⣿⣿⣿⡟⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⢻⣿⣿⡏⠉⠙⠛⢛⣿⣿⣿⣿⠟⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⢿⣿⡧⠄⠄⢠⣾⣿⣿⡿⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠈⣿⣿⣄⣼⣿⣿⣿⠏⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠸⡿⣻⣿⣿⣿⣿⣆⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣻⠟⠈⠻⢿⣿⣿⣆⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠿⠍⠄⠄⠄⠄⠉⠻⣿⣷⡤⣀⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⢻⣿⡿⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⡯⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠸⠃⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⣶⣶⣤⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣾⣿⣿⣿⣿⣿⡞⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⡿⢃⡀⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠘⢿⣿⣿⣿⣿⣿⣿⣿⣧⡀⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢈⣽⣿⣿⣿⣿⣿⣿⣿⢿⣷⣦⣀⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣸⣿⣿⣿⣿⣿⣿⣿⣿⠄⢉⣻⣿⡇⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢠⣿⣿⡉⣀⣿⣿⣿⣿⣋⣴⣿⠟⠋⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⣠⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣏⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⢀⣀⣼⣿⣿⣿⣿⣿⣿⠿⢿⣿⣿⣿⣿⣿⣮⡠⠄⠄⠄⠄ ⠄⠄⠄⠄⢰⣾⣿⣿⡿⠿⠛⠛⠛⠉⠄⠄⠄⠄⠙⠻⢿⣿⣿⣿⣶⣆⡀⠄ ⠄⠄⠄⠄⠄⠹⣿⣿⣦⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢉⣿⣿⣿⣿⣿⠂ ⠄⠄⠄⠄⠄⠄⠈⢿⣿⣇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣴⣾⣿⡿⠟⠉⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠂⢿⣿⣥⡄⠄⠄⠄⠄⢀⣠⣶⣿⣿⠟⠋⠁⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⣀⣤⣾⣿⣿⣷⣿⣃⡀⢴⣿⣿⡿⣿⣍⠄⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠈⠉⠉⠉⠉⠉⠉⠉⠄⠄⠄⠉⠙⠛⠛⠛⠛⠂⠄⠄⠄⠄⠄",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟",
            "[deleted]",
            "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "⣿⣿⣿⣿⣿⣿⣿⡿⠟⠋⠡⠀⠌⠙⠿⣿⡿⠿⠛⠛⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡿⠋⠀⠀⠀⠀⢀⠠⠤⠤⠀⠀⠁⠀⠀⠀⠤⠍⠙⠻⠿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀⠈⢀⣠⣤⣶⣶⠶⣶⣤⡀⢀⣤⣤⣤⡤⢤⣬⣛⣿⣿ ⣿⣿⣿⡿⠃⠀⠀⠀⠀⠘⠻⣿⣿⣿⡏⠀⣤⠈⣿⣿⣾⣿⣿⡏⢀⡄⢹⣿⣿⣿ ⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠈⠻⢿⣷⣤⣤⣴⣿⠟⠈⠛⠿⠷⠤⣴⡿⠿⣿⣿ ⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠂⠠⠄⠀⠀⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿ ⡇⠀⠀⠀⠀⠀⠀⣠⣄⣀⡀⠁⠀⠒⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⢀⠻⣿⣿ ⡇⠀⠀⠀⠀⠀⠐⢿⣏⣛⡻⠷⣶⣦⣬⣅⣀⣀⣀⡀⢀⣀⣀⣀⣠⣤⠴⣚⣿⣿ ⡇⠀⠀⠀⠀⠀⠀⠀⠉⠛⠛⠿⠷⣶⣮⣭⣝⣛⣛⣻⣭⣭⣭⣵⣶⠶⢛⣽⣿⣿ ⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠉⠉⠉⠉⠉⠉⠉⠉⠀⢀⣾⣿⣿⣿ ⡇⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿ ⣧⡀⠀⠂⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣾⣿⣿⣿⣿⣿⣿ ⣿⣿⣷⣦⣤⣀⣐⠂⠀⠠⠤⠤⠁⠀⠀⠀⠠⠀⢀⡸⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣶⣶⣶⣶⣶⣾⣿⣿⣿⣷⡍⠻⣿⣿⣿⣿⣿⣿⣿ ⣿⠿⠿⠿⠿⢿⣿⠿⠿⠿⠿⠿⣿⡿⠿⢿⣿⡿⠿⣿⡿⠿⢿⣿⡿⠿⠿⠿⢿⣿ ⣿⠀⢠⣶⠀⠀⣿⠀⠀⠴⠶⢶⣿⡇⠀⠈⠻⡇⠀⣿⡇⠀⢸⣿⠀⠀⠶⢤⣤⣿ ⣿⠀⢀⣀⣀⣴⣿⠀⠀⣤⣤⣼⣿⡇⠀⣤⡀⠀⠀⣿⡇⠀⢸⡿⠶⢤⣤⡀⠈⣿ ⣿⣀⣸⣿⣿⣿⣿⣄⣀⣀⣀⣀⣿⣇⣠⣿⣷⣤⣀⣿⣧⣀⣸⣿⣦⣀⣀⣀⣴⣿",
            "This must be how blind people watch jojo",
            "Are you approaching me?\n\n⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "Cock",
            "JOTARO",
            "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            " ⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "***ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ******ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***ゴ*** ^***ゴ*** ***ゴ***\n\n\n\n*ＴＨＩＳ 　ＭＵＳＴ 　ＢＥ 　ＴＨＥ 　ＷＯＲＫ 　ＯＦ 　ＡＮ 　ＥＮＥＭＹ ***「ＳＴＡＮＤ」***！！*\n\n　\n\n***ゴ*** ^***ゴ*** ^^***ゴ*** ^^^***ゴ*** ^^^^***ゴ*** ^^^^***ゴ*** ^^^***ゴ*** ^^***",
            "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "Cock 69 obama game",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠛⠛⠛⢛⠻⠿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠉⠐⠄⠄⠄⠄⠠⠄⠄⢀⣀⡈⢻⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠋⡀⠴⢒⡒⠂⠄⢀⡀⢐⡀⡀⠄⠄⢀⠙⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⡿⡡⠪⠶⢿⡭⡉⠄⢀⢣⣖⣶⣬⡱⣄⠄⠄⠄⠸⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⡁⣔⣎⠓⠂⡀⠑⠖⣒⠭⠻⠿⠿⠷⠙⣎⠉⠉⠄⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⢧⢱⣿⣔⣀⠊⠐⢼⣿⣶⣠⠄⠐⡐⠶⡂⣿⣀⡀⠄⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣟⠂⣿⣿⣷⣶⣟⣴⣾⣿⣧⣐⣤⣤⣭⣿⠇⡇⠄⠄⠄⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⢹⠄⣿⣿⣿⣿⡌⠿⣛⣿⣿⣿⣿⣿⣿⢫⡞⡇⠄⠄⢰⣿⣿⣿ ⣿⣿⣿⣿⡿⣫⠞⢀⣿⣿⣿⣥⣤⣌⠙⣿⣿⣿⣿⡟⣽⣿⠁⡇⠒⢒⣾⣿⣿⣿ ⣿⣿⣿⣯⣾⠋⠄⠘⣿⣿⣿⣶⣶⣭⣿⣿⣿⣿⣿⣾⡿⠃⣴⡇⠄⣼⣿⣿⣿⣿ ⡛⡿⣿⣿⣷⣇⠄⠄⡈⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣉⠄⣼⡇⣼⣿⣿⣿⣿⣿ ⠉⠐⣥⡙⠛⠿⠇⢸⠰⠄⠄⠄⠹⠟⠛⠋⢉⣀⢩⢴⠄⢰⣿⣧⢿⣿⣿⣿⣿⣿ ⠄⠄⠄⢱⡀⠄⠄⠇⡰⠄⡐⠄⠰⠰⢿⠃⠈⠉⢠⠄⠄⠻⠿⢾⣿⣿⣿⣿⣿⣿ ⡤⡴⠶⠚⠋⠻⣆⠄⠁⣠⠡⠐⠁⠄⠄⠄⠄⠄⠁⠄⠠⣦⠄⠄⠄⠄⠄⠲⠎⠉",
            "Simp Jojo cock",
            "guys, jojo funny right??",
            "NICE",
            "I have bad eyesight, what's that supposed to picture out?",
            "im waiting for the uwufier",
            "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿⣿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬⣰⣿ ⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩⣿⣿ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧⣿⣿ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿⣿⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "God i fucking hate JoJo",
            "garbage",
            "version for discord mobile\n\n\n⣿⣿⣿⣿⣿⣿⣿⡿⡛⠟⠿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠿⠨⡀⠄⠄⡘⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠿⢁⠼⠊⣱⡃⠄⠈⠹⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⠛⡧⠁⡴⣦⣔⣶⣄⢠⠄⠄⠹⣿⣿⣿⣿⣿⣿⣿⣤⠭⠏⠙⢿⣿⣿⣿ ⣿⡧⠠⠠⢠⣾⣾⣟⠝⠉⠉⠻⡒⡂⠄⠙⠻⣿⣿⣿⣿⣿⡪⠘⠄⠉⡄⢹⣿⣿ ⣿⠃⠁⢐⣷⠉⠿⠐⠑⠠⠠⠄⣈⣿⣄⣱⣠⢻⣿⣿⣿⣿⣯⠷⠈⠉⢀⣾⣿⣿ ⣿⣴⠤⣬⣭⣴⠂⠇⡔⠚⠍⠄⠄⠁⠘⢿⣷⢈⣿⣿⣿⣿⡧⠂⣠⠄⠸⡜⡿⣿ ⣿⣇⠄⡙⣿⣷⣭⣷⠃⣠⠄⠄⡄⠄⠄⠄⢻⣿⣿⣿⣿⣿⣧⣁⣿⡄⠼⡿⣦⣬\n⣿⣷⣥⣴⣿⣿⣿⣿⠷⠲⠄⢠⠄⡆⠄⠄⠄⡨⢿⣿⣿⣿⣿⣿⣎⠐⠄⠈⣙⣩ ⣿⣿⣿⣿⣿⣿⢟⠕⠁⠈⢠⢃⢸⣿⣿⣶⡘⠑⠄⠸⣿⣿⣿⣿⣿⣦⡀⡉⢿⣧ ⣿⣿⣿⣿⡿⠋⠄⠄⢀⠄⠐⢩⣿⣿⣿⣿⣦⡀⠄⠄⠉⠿⣿⣿⣿⣿⣿⣷⣨⣿ ⣿⣿⣿⡟⠄⠄⠄⠄⠄⠋⢀⣼⣿⣿⣿⣿⣿⣿⣿⣶⣦⣀⢟⣻⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡆⠆⠄⠠⡀⡀⠄⣽⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡿⡅⠄⠄⢀⡰⠂⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿",
            "For real, someone has a tutorial how to do these?",
            "what tf is this copypasta supposed to be because I don't see it\n\nedit: y'all are downvoting me because I don't watch jojo lmaooo",
            "Jojo fanboys are scum, and automoderator will agree with me.",
            " #AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA\n\nSTOP TALKING ABOUT JOJO REFERENCES THE MEME IS DEAD IS WAS NEVER ALIVE KILL YOURSELF PLEASE I DONT WANT TO HEAR ABOUT THAT GAY FUCKING SHOW EVER AGAIN\n\nIF I HEAR ONE MORE FUCKING RETARDED BABOON ASK IF SOMETHING IS A JOJO REFERENCE IM GOING TO OPEN FIRE ON AN ORPHANAGE\n\n**Edit:** -69 upvotes *nice*",
            "Is ThIS a JoJO REfErENCE?"
        ]
    }
]