[
    {
        "post_id": "gtemms",
        "author": "WheatleyPrime",
        "title": "the avatar intro but its in a cockney accent",
        "url": "https://www.reddit.com/r/copypasta/comments/gtemms/the_avatar_intro_but_its_in_a_cockney_accent/",
        "score": 17098,
        "num_comments": 223,
        "created_utc": 1590846770.0,
        "selftext": "wo'ah, earf, birming'am, fish n' chips... long ago, the fou' nations live togedah in ah'mony. then ev'ryfing changed when the IRA attacked.... only the avatah, mastah of all fou' elements could stop 'em but when the queen needed 'im most, 'e vanished. 100 yea's passed and me bruv and i found the new avatah. a fish n' chips bendah named aang. although 'is chipbendin' skills ah great, 'e still 'as a lo' to lea'n 'fore 'e's ready to save anyone m8.",
        "permalink": "/r/copypasta/comments/gtemms/the_avatar_intro_but_its_in_a_cockney_accent/",
        "comments": [
            "Gotta restore me honor innit",
            "Bit sad innit",
            "wo'ah, earf, birming'am, fish n' chips... long ago, the fou' nations live togedah in ah'mony. then ev'ryting changed when the IRA attacked.... only the avatah, mastah of all fou' elements could stop 'em but when the queen needed 'im most, 'e vanished. 100 yea's past and me bruv and i found the new avatah. a fish n' chips bendah named aang. although 'is chipbendin' skills ah great, 'e still 'as a lo' to lea'n 'fore 'e's ready to save anyone m8.",
            "wo'ah, eawf, biwming'am, fish n' chips... wong ago, the fou' nations wive togedah in ah'mony. then ev'wyting changed when the IWA attacked.... onwy the avatah, mastah of aww fou' ewements couwd stop 'em but when the queen needed 'im most, 'e vanished. 100 yea's past and me bwuv and i found the new avatah. a fish n' chips bendah named aang. awthough 'is chipbendin' skiwws ah gweat, 'e stiww 'as a wo' to wea'n 'fowe 'e's weady to save anyone m8.",
            "Fuckin ‘ell me cabbages!",
            "the thing i like most about this is that the IRA are the fire nation.",
            "Saw this post while watching Avatar, i swear the government's spying on us or some shit",
            "'aint racist, jus don't like em 'ere. don't like it, fuck off back to fieh nation, simple as.",
            "Perfection",
            "The IRA's more like that radical resistance group in book 1",
            "This deserves a voice-over",
            "AHAHAH THE IRA",
            "I had a stroke trying to read this",
            "NTA. Play stupid gahms, win stupid proizes.",
            "Why could I understand this perfectly?",
            "Ba Sing Suck my fookin nuts you twat",
            "As an American, i feel like the Cockney accent is like the Southern accent but for British people",
            "People from C\\*ckney say donkeys, not years, you prodigious b\\*ffoon",
            "Oi ya little cunts, you lot betta’ stay off me cabbages!",
            "Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip Appa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yipAppa yip yip Appa yip yip Appa yip yip Appa yip yip appa yip yip appa yip yip",
            "Come to Fuck’in Birmin’an ask for  Danny G",
            "I want psychicpebbles to read this with his cockney orphan voice",
            "Bloody 'umans be invadin' me fuckin' planeht",
            "‘Ello gov’na",
            "Why does air become fish n’ chips?",
            "That's rough mate",
            "wo'ah, earf, birming'am, fish n' chips... long ago, the fou' nations live togedah in ah'mony. then ev'ryting changed when the IRA attacked.... only the avatah, mastah of all fou' elements could stop 'em but when the queen needed 'im most, 'e vanished. 100 yea's past and me bruv and i found the new avatah. a fish n' chips bendah named aang. although 'is chipbendin' skills ah great, 'e still 'as a lo' to lea'n 'fore 'e's ready to save anyone m8.",
            "'Ate Birming'am.",
            ">when the IRA attacked \n\nI’m ded",
            "[I had to](https://www.youtube.com/watch?v=cHlJxNy_hsg)",
            "Hullo guv’na oi’m a birmiñ’am benda. Controullin’ shi’ n tha’ y’know its fuckin’ insayne innit",
            "did th’ find em on chewsday?",
            "Can we get a native speaker to read this on video?",
            "We need more copypastas like that",
            "Cor blimey! The fire nation attacked mate!",
            "Imma hit your with a hard R...\n\nBender",
            "Hearing this in Limmy's voice.",
            "Can somebody delete this its quite shite.",
            "Read 'me and me bruv and i' made it somehow more hilarious.",
            "is there a bot that translates into cockney accent cus i’ll fund",
            "Shit had me wheezing, what the fuck.",
            "Can a cockney voovaroo this or sum",
            "This is terrible",
            "> Dark theme is bit of a wind break",
            "Yeah , maybe, but its not quite there.",
            "[...wiv a tangerine.](https://youtu.be/ZS6bD3SpIvk)",
            "Avatar: The Last Roadbender",
            "Lmao m8",
            "Hahahaha",
            "*ev'ryfing",
            "Should make a whole other Pittsburghese one\n\nWarter",
            "I hope somebody voiceover this",
            "Fucking Birmingham",
            "Zuko: AHHH IMMA FAWKIN SPAZ BRUV",
            "[deleted]",
            "Glorious",
            "God this made my day",
            "Foken Birmingham init",
            "Cheers luv, the avatah’s ‘ere",
            "But Oi baleve, Eeng coold save the wo'ld, m8.\n\nNaoh, get me sam fish n' chips, love!",
            "Momo bugger off ya wee twat",
            "Oh, um, flakes, oh... Then, uh, I don't know.\nScrambled eggs, bacon, sausages, tomatoes.\nToast, coffee. Marmalade, I like marmalade.\nMarmalade, I like marmalade.\nPorridge is nice.\nAny cereal, I like all cereal.",
            "This reminded me scottish accent video of Lilo and Stitch",
            "This baffles me.",
            "Kek",
            "wo’ah.",
            "Laughed through reading the entire thing",
            "This tickled me",
            "Is it weird if I read this in tracer's voice in my head?",
            "Oi! Give meh ya cummies guv'nah",
            "I read this in a Boston accent",
            "wagwan m8",
            "This reminded me to check out Grade A Under A’s new video, thank you",
            "i thought this was r/TheLastAirbender for a good 5 seconds.",
            "It's a good pasta, but it kinda implies that Britain wasn't the aggressor.",
            "That fucken IRA cunt tried to blow up Sherley’s ca last noight, bit schtewpid innit?",
            "My friendship with my friend is ruined...\n\n\nIt was worth it",
            "Its chewsday innit",
            "Lol, the IRA being the fire nation instead of Britain, who has invaded almost every country on Earth, makes me laugh",
            " \n\n# Tiocfaidh ár lá!",
            "This pasta implies that the IRA were the bad guys...",
            "Oppa, \n\nYork York!",
            "[deleted]"
        ]
    },
    {
        "post_id": "lic9rx",
        "author": "FishStick_Fortnite",
        "title": "i got banned for posting this on r/nofap 🥶",
        "url": "https://www.reddit.com/r/copypasta/comments/lic9rx/i_got_banned_for_posting_this_on_rnofap/",
        "score": 16946,
        "num_comments": 361,
        "created_utc": 1613140685.0,
        "selftext": "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀  \n  edit: thanks for the 20 reddit awards kind keanu reever shark strangers  \n  edit 2: dont give me anymore awards unless its an award with benefits like one that gives me some coins. tired of these bullshit \"wholesome seal award\" notifications",
        "permalink": "/r/copypasta/comments/lic9rx/i_got_banned_for_posting_this_on_rnofap/",
        "comments": [
            "⣿⣿⣿⠟⢹⣶⣶⣝⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ \n⣿⣿⡟⢰⡌⠿⢿⣿⡾⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ \n⣿⣿⣿⢸⣿⣤⣒⣶⣾⣳⡻⣿⣿⣿⣿⡿⢛⣯⣭⣭⣭⣽⣻⣿⣿⣿\n⣿⣿⣿⢸⣿⣿⣿⣿⢿⡇⣶⡽⣿⠟⣡⣶⣾⣯⣭⣽⣟⡻⣿⣷⡽⣿ \n⣿⣿⣿⠸⣿⣿⣿⣿⢇⠃⣟⣷⠃⢸⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽ \n⣿⣿⣿⣇⢻⣿⣿⣯⣕⠧⢿⢿⣇⢯⣝⣒⣛⣯⣭⣛⣛⣣⣿⣿⣿⡇ \n⣿⣿⣿⣿⣌⢿⣿⣿⣿⣿⡘⣞⣿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ \n⣿⣿⣿⣿⣿⣦⠻⠿⣿⣿⣷⠈⢞⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ \n⣿⣿⣿⣿⣿⣿⣗⠄⢿⣿⣿⡆⡈⣽⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢻ \n⣿⣿⣿⣿⡿⣻⣽⣿⣆⠹⣿⡇⠁⣿⡼⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣾ \n⣿⠿⣛⣽⣾⣿⣿⠿⠋⠄⢻⣷⣾⣿⣧⠟⣡⣾⣿⣿⣿⣿⣿⣿⡇⣿ \n⢼⡟⢿⣿⡿⠋⠁⣀⡀⠄⠘⠊⣨⣽⠁⠰⣿⣿⣿⣿⣿⣿⣿⡍⠗⣿ \n⡼⣿⠄⠄⠄⠄⣼⣿⡗⢠⣶⣿⣿⡇⠄⠄⣿⣿⣿⣿⣿⣿⣿⣇⢠⣿ \n⣷⣝⠄⠄⢀⠄⢻⡟⠄⣿⣿⣿⣿⠃⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⢹⣿ \n⣿⣿⣿⣿⣿⣧⣄⣁⡀⠙⢿⡿⠋⠄⣸⡆⠄⠻⣿⡿⠟⢛⣩⣝⣚⣿ \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣤⣾⣿⣿⣄⠄⠄⠄⣴⣿⣿⣿⣇⣿ \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⡀⠛⠿⣿⣫⣾⣿",
            "This gonna make me fail NNN for the rest of my life",
            "amogus penis",
            "[deleted]",
            "⠀⠀⠀⠀⢀⣴⡾⠿⠿⠿⠿⢶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢠⣿⠁⠀⠀⠀⣀⣀⣀⣈⣻⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣾⡇⠀⠀⣾⣟⠛⠋⠉⠉⠙⠛⢷⣄⠀⠀⠀⠀⠀⠀⠀ ⢀⣤⣴⣶⣿⠀⠀⢸⣿⣿⣧⠀⠀⠀⠀⢀⣀⢹⡆⠀⠀⠀⠀⠀⠀ ⢸⡏⠀⢸⣿⠀⠀⠀⢿⣿⣿⣷⣶⣶⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀ ⣼⡇⠀⢸⣿⠀⠀⠀⠈⠻⠿⣿⣿⠿⠿⠛⢻⡇⠀⠀⠀⠀⠀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣼⣷⣶⣶⣶⣤⡀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀ ⢻⡇⠀⢸⣿⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⣿⣿⣿⡇ ⠈⠻⠷⠾⣿⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣿⣇ ⠀⠀⠀⠀⣿⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⢸⣿⣿⣿⡿ ⠀⠀⠀⠀⢿⣧⣀⣠⣴⡿⠙⠛⠿⠿⠿⠿⠉⠀⠀⢠⣿⣿⣿⣿⠇ ⠀⠀⠀⠀⠀⢈⣩⣭⣥⣤⣤⣤⣤⣤⣤⣤⣤⣤⣶⣿⣿⣿⣿⠏⠀ ⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⡟⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠋⠁⠀⠀⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⣷⣄⣀⣀⣀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀ ⠀⠀⠀⠀⠀⠈⠛⠿⠿⣿⣿⣿⣿⣿⠿⠿⢿⣿⣿⣿⣿⣿⡄⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⢀⣹⣿⣿⣿⡇⠀⠀ ⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀ ⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠁⠀⠀⠀ ⠀⠀⠀⠀⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠉⠉⠁⢤⣤⣤⣤⣤⣤⣤⡀ ⠀⠀⠀⠀⢿⣿⣿⣿⣷⣶⣶⣶⣶⣾⣿⣿⣿⣆⢻⣿⣿⣿⣿⣿⡇ ⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠻⣿⣿⣿⡿⠁ ⠀⠀⠀⠀⠀⠀⠈⠙⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠉⠀⠙⠛⠉⠀⠀",
            "I got banned for posting it on among us. Oh well.",
            "⠀       ⡯⡯⡾⠝⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢊⠘⡮⣣⠪⠢⡑⡌ ㅤ ⠀⠀⠀⠟⠝⠈⠀⠀⠀⠡⠀⠠⢈⠠⢐⢠⢂⢔⣐⢄⡂⢔⠀⡁⢉⠸⢨⢑⠕⡌ ㅤ ⠀⠀⡀⠁⠀⠀⠀⡀⢂⠡⠈⡔⣕⢮⣳⢯⣿⣻⣟⣯⣯⢷⣫⣆⡂⠀⠀⢐⠑⡌ ⢀⠠⠐⠈⠀⢀⢂⠢⡂⠕⡁⣝⢮⣳⢽⡽⣾⣻⣿⣯⡯⣟⣞⢾⢜⢆⠀⡀⠀⠪ ⣬⠂⠀⠀⢀⢂⢪⠨⢂⠥⣺⡪⣗⢗⣽⢽⡯⣿⣽⣷⢿⡽⡾⡽⣝⢎⠀⠀⠀⢡ ⣿⠀⠀⠀⢂⠢⢂⢥⢱⡹⣪⢞⡵⣻⡪⡯⡯⣟⡾⣿⣻⡽⣯⡻⣪⠧⠑⠀⠁⢐ ⣿⠀⠀⠀⠢⢑⠠⠑⠕⡝⡎⡗⡝⡎⣞⢽⡹⣕⢯⢻⠹⡹⢚⠝⡷⡽⡨⠀⠀⢔ ⣿⡯⠀⢈⠈⢄⠂⠂⠐⠀⠌⠠⢑⠱⡱⡱⡑⢔⠁⠀⡀⠐⠐⠐⡡⡹⣪⠀⠀⢘\n⣿⣽⠀⡀⡊⠀⠐eye⡁⠂⢈⠠⡱⡽⣷⡑⠁⠠⠑eye⢇⣤⢘⣪⢽⠀⢌⢎ ⣿⢾⠀⢌⠌⠀⡁⠢⠂⠐⡀⠀⢀⢳⢽⣽⡺⣨⢄⣑⢉⢃⢭⡲⣕⡭⣹⠠⢐⢗ ⣿⡗⠀⠢⠡⡱⡸⣔⢵⢱⢸⠈⠀⡪⣳⣳⢹⢜⡵⣱⢱⡱⣳⡹⣵⣻⢔⢅⢬⡷ ⣷⡇⡂⠡⡑⢕⢕⠕⡑⠡⢂⢊⢐⢕⡝⡮⡧⡳⣝⢴⡐⣁⠃⡫⡒⣕⢏⡮⣷⡟ ⣷⣻⣅⠑⢌⠢⠁⢐⠠⠑⡐⠐⠌⡪⠮⡫⠪⡪⡪⣺⢸⠰⠡⠠⠐⢱⠨⡪⡪⡰ ⣯⢷⣟⣇⡂⡂⡌⡀⠀⠁⡂⠅⠂⠀⡑⡄⢇⠇⢝⡨⡠⡁⢐⠠⢀⢪⡐⡜⡪⡊ ⣿⢽⡾⢹⡄⠕⡅⢇⠂⠑⣴⡬⣬⣬⣆⢮⣦⣷⣵⣷⡗⢃⢮⠱⡸⢰⢱⢸⢨⢌ ⣯⢯⣟⠸⣳⡅⠜⠔⡌⡐⠈⠻⠟⣿⢿⣿⣿⠿⡻⣃⠢⣱⡳⡱⡩⢢⠣⡃⠢⠁ ⡯⣟⣞⡇⡿⣽⡪⡘⡰⠨⢐⢀⠢⢢⢄⢤⣰⠼⡾⢕⢕⡵⣝⠎⢌⢪⠪⡘⡌⠀ ⡯⣳⠯⠚⢊⠡⡂⢂⠨⠊⠔⡑⠬⡸⣘⢬⢪⣪⡺⡼⣕⢯⢞⢕⢝⠎⢻⢼⣀⠀ ⠁⡂⠔⡁⡢⠣⢀⠢⠀⠅⠱⡐⡱⡘⡔⡕⡕⣲⡹⣎⡮⡏⡑⢜⢼⡱⢩⣗⣯⣟ ⢀⢂⢑⠀⡂⡃⠅⠊⢄⢑⠠⠑⢕⢕⢝⢮⢺⢕⢟⢮⢊⢢⢱⢄⠃⣇⣞⢞⣞⢾ ⢀⠢⡑⡀⢂⢊⠠⠁⡂⡐⠀⠅⡈⠪⠪⠪⠣⠫⠑⡁⢔⠕⣜⣜⢦⡰⡎⡯⡾⡽",
            "⠄⠄⠄⠄⠄⠄⠄⠄⠄⣀⣀⣤⣤⣤⣀⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⠄⣠⣶⣿⠿⣩⣵⣶⣶⣏⡠⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⣴⣿⣿⡟⣴⡿⢿⣿⣿⢿⣷⡔⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⢠⣿⣿⣿⡇⣿⣇⣈⣿⣿⣤⣽⣧⢰⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠘⣿⣿⣿⣿⣬⠻⢿⣿⣿⣿⡿⢃⣼⣿⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣷⣶⣶⣶⣾⣿⣿⣿⣿⢹⣿⣦⣤⣀⠄⠄⠄⠄\n⠄⢠⣾⡙⢋⣾⣿⣿⣿⣿⣿⠿⣻⣿⣿⡿⣿⡿⢿⣿⣿⣮⣉⠋⠉⣿⣿⣶⣄⠄\n⣰⣿⣍⡩⣾⣿⣿⣿⣿⡿⢉⣈⠙⢻⣿⣇⢹⡇⣾⣿⣿⣿⣿⠄⠶⠈⢛⣿⣿⣧\n⢿⣿⣿⢱⡿⠋⠉⣿⣿⠁⠙⠉⠄⣸⣿⣿⢸⣧⡹⣿⣿⣿⣿⣷⡀⠄⠈⠱⠾⠏\n⠈⠙⠛⠋⠄⠄⠄⣿⣿⡈⣶⣶⣾⣿⣿⡇⣼⣿⣷⣭⠙⠿⠿⠋⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣦⣝⣛⣫⣥⣾⣿⣿⣿⣿⣿⣿⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⠄⠘⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠄⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⠄⠄⠄⢹⣿⣿⣿⡿⠛⢻⣿⡏⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄\n⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠉⠉⠄⠰⠿⠿⠿⠆⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄",
            "Sus! Sigh.... unzip* take my upvote and get out! Fuck my asshole plz",
            " \n\n⠀⢀⣀⣤⣴⣶⣶⣾⣿⣷⣶⣶⣦⣄⡀⠀⠀⠀ ⠀⢠⣴⣿⣿⣿⣿⣿⣭⣭⣭⣭⣭⣿⣿⣿⣿⣧⣀⠀ ⢰⣿⣿⣿⣿⣿⣯⣿⡶⠶⠶⠶⠶⣶⣭⣽⣿⣿⣷⣆ ⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ ⠈⢿⣿⣿⡿⠋⠉⠁⠈⠉⠛⠉⠀⠀⠀⠈⠻⣿⡿⠃ ⠀⠀⠀⠉⠁⠀⢴⣐⢦⠀⠀⠀⣴⡖⣦⠀⠀⠈⠀⠀ ⠀⠀⠀⠀⠀⠀⠈⠛⠋⠀⠀⠀⠈⠛⠁⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⣀⡀⠀⠀⠀⣀⠀⠀⠀⢀⡀⠀⠀⠀⠀ ⠀⠀⢀⡔⣻⣭⡇⠀⣼⣿⣿⣿⡇⠦⣬⣟⢓⡄⠀⠀ ⠀⠀⠀⠉⠁⠀⠀⠀⣿⣿⣿⣿⡇⠀⠀⠉⠉⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠻⠿⠿⠟⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⣠⢼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⡄⠀⠀⠀ ⠀⠀⣀⣤⣴⣾⣿⣷⣭⣭⣭⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀ ⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣸⣿⣿⣧⠀⠀ ⠀⣿⣿⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣯⢻⣿⣿⡄⠀ ⠀⢸⣿⣮⣿⣿⣿⣿⣿⣿⣿⡟⢹⣿⣿⣿⡟⢛⢻⣷⢻⣿⣧⠀ ⠀⠀⣿⡏⣿⡟⡛⢻⣿⣿⣿⣿⠸⣿⣿⣿⣷⣬⣼⣿⢸⣿⣿⠀ ⠀⠀⣿⣧⢿⣧⣥⣾⣿⣿⣿⡟⣴⣝⠿⣿⣿⣿⠿⣫⣾⣿⣿⡆ ⠀⠀⢸⣿⣮⡻⠿⣿⠿⣟⣫⣾⣿⣿⣿⣷⣶⣾⣿⡏⣿⣿⣿⡇ ⠀⠀⢸⣿⣿⣿⡇⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣇⣿⣿⣿⡇ ⠀⠀⢸⣿⣿⣿⡇⠀⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢸⣿⣿⣿⠀ ⠀⠀⣼⣿⣿⣿⢃⣾⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⡏⣿⣿⣿⡇",
            "🌕🌕🌕🌕🌕🌕🌕🌕🌕\n\n🌕🌕🌕🌕🌕🎩🌕🌕🌕\n\n🌕🌕🌕🌕🌘🌑🌒🌕🌕\n\n🌕🌕🌕🌘🌑🌑🌑🌓🌕\n\n🌕🌕🌖🌑👁🌑👁🌓🌕\n\n🌕🌕🌗🌑🌑👄🌑🌔🌕\n\n🌕🌕🌘🌑🌑🌑🌒🌕🌕\n\n🌕🌕🌘🌑🌑🎀🌓🌕🌕\n\n🌕🌕🌘🌑🌑🌑🌔🌕🌕\n\n🌕🌕🌘🌔🍆🌑🌕🌕🌕\n\n🌕🌖🌒🌕🌗🌒🌕🌕🌕\n\n🌕🌗🌓🌕🌗🌓🌕🌕🌕\n\n🌕🌘🌔🌕🌗🌓🌕🌕🌕\n\n🌕👠🌕🌕🌕👠🌕🌕🌕",
            "‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀              🇨🇳 ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀                 🇨🇳 ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆           💦       ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀              🇨🇳 ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀              🇨🇳 ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀\n我射精的是中華人民共和國，正如您從我的陰莖中看到的那樣",
            "wow!\n\nNice Cock.",
            "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            "Forcing yourself not to beat off is just another way of letting beating off rule your life.",
            "⠄⠄⠄⠄⠄⠄⠄⢀⣀⣠⣤⠴⠶⠶⠶⠶⠶⠶⠶⢤⣄⣀⡀⠄⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⣠⣶⠟⠋⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠙⠶⣄⡀⠄⠄⠄⠄ ⠄⠄⠄⣠⡾⠟⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⠻⣆⠄⠄⠄ ⠄⠄⣼⡟⠄⠄⠄⠄⠄⠄⠄⢀⣤⣶⡶⢦⡀⠄⠄⠄⠄⠄⠄⠖⠻⣶⠞⢧⠄⠄ ⠄⣼⠏⠄⠄⠄⠄⠄⠄⠄⠐⠛⠋⠁⠄⠄⠄⠄⠄⠄⠄⢀⣤⣤⣄⠄⠄⠨⣧⠄ ⢸⡏⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠙⡏⠄⠄⠄⠸⡇ ⣿⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⡄⠄⠰⠄⠄⠄⠄⠄⢀⡇⠄⢀⡘⢣⣿ ⡿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠠⣄⠄⠄⠦⠄⢀⣠⣤⣶⣿⠿⣶⣦⣴⠟⢹ ⢿⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠛⠛⠛⠛⠉⠁⠄⠄⠄⠄⠜⠁⠄⣾ ⠈⢧⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢰⠇ ⠄⠈⠑⢄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⡴⠋⠄ ⠄⠄⠄⠄⠐⠄⡀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠⡴⠏⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠐⠂⠤⠤⣄⣀⣀⣀⣠⣤⣤⣤⡶⠶⠟⠋⠁⠄⠄⠄⠄⠄",
            "Fuck you you little piece of shit this should have a SEXY trigger warning now I’m fuckin ROCK HARD and I’ve got to deal with that all day because of your stupid ass. You might not know this but other people actually have lives to live not sitting in their grandma house sucking their own todge all day like some fuckin LOSSER! Great thanks now I’m going to have to go and have a cheeky tug at work for the second time today. Fuck you.",
            "⠀⠀⠀⡯⡯⡾⠝⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢊⠘⡮⣣⠪⠢⡑⡌ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ⠀⠀⠀⠟⠝⠈⠀⠀⠀⠡⠀⠠⢈⠠⢐⢠⢂⢔⣐⢄⡂⢔⠀⡁⢉⠸⢨⢑⠕⡌ ㅤ ⠀⠀⡀⠁⠀⠀⠀⡀⢂⠡⠈⡔⣕⢮⣳⢯⣿⣻⣟⣯⣯⢷⣫⣆⡂⠀⠀⢐⠑⡌ ⢀⠠⠐⠈⠀⢀⢂⠢⡂⠕⡁⣝⢮⣳⢽⡽⣾⣻⣿⣯⡯⣟⣞⢾⢜⢆⠀⡀⠀⠪ ⣬⠂⠀⠀⢀⢂⢪⠨⢂⠥⣺⡪⣗⢗⣽⢽⡯⣿⣽⣷⢿⡽⡾⡽⣝⢎⠀⠀⠀⢡ ⣿⠀⠀⠀⢂⠢⢂⢥⢱⡹⣪⢞⡵⣻⡪⡯⡯⣟⡾⣿⣻⡽⣯⡻⣪⠧⠑⠀⠁⢐ ⣿⠀⠀⠀⠢⢑⠠⠑⠕⡝⡎⡗⡝⡎⣞⢽⡹⣕⢯⢻⠹⡹⢚⠝⡷⡽⡨⠀⠀⢔ ⣿⡯⠀⢈⠈⢄⠂⠂⠐⠀⠌⠠⢑⠱⡱⡱⡑⢔⠁⠀⡀⠐⠐⠐⡡⡹⣪⠀⠀⢘ ⣿⣽⠀⡀⡊⠀⠐⠨⠈⡁⠂⢈⠠⡱⡽⣷⡑⠁⠠⠑⠀⢉⢇⣤⢘⣪⢽⠀⢌⢎ ⣿⢾⠀⢌⠌⠀⡁⠢⠂⠐⡀⠀⢀⢳⢽⣽⡺⣨⢄⣑⢉⢃⢭⡲⣕⡭⣹⠠⢐⢗ ⣿⡗⠀⠢⠡⡱⡸⣔⢵⢱⢸⠈⠀⡪⣳⣳⢹⢜⡵⣱⢱⡱⣳⡹⣵⣻⢔⢅⢬⡷ ⣷⡇⡂⠡⡑⢕⢕⠕⡑⠡⢂⢊⢐⢕⡝⡮⡧⡳⣝⢴⡐⣁⠃⡫⡒⣕⢏⡮⣷⡟ ⣷⣻⣅⠑⢌⠢⠁⢐⠠⠑⡐⠐⠌⡪⠮⡫⠪⡪⡪⣺⢸⠰⠡⠠⠐⢱⠨⡪⡪⡰ ⣯⢷⣟⣇⡂⡂⡌⡀⠀⠁⡂⠅⠂⠀⡑⡄⢇⠇⢝⡨⡠⡁⢐⠠⢀⢪⡐⡜⡪⡊ ⣿⢽⡾⢹⡄⠕⡅⢇⠂⠑⣴⡬⣬⣬⣆⢮⣦⣷⣵⣷⡗⢃⢮⠱⡸⢰⢱⢸⢨⢌ ⣯⢯⣟⠸⣳⡅⠜⠔⡌⡐⠈⠻⠟⣿⢿⣿⣿⠿⡻⣃⠢⣱⡳⡱⡩⢢⠣⡃⠢⠁ ⡯⣟⣞⡇⡿⣽⡪⡘⡰⠨⢐⢀⠢⢢⢄⢤⣰⠼⡾⢕⢕⡵⣝⠎⢌⢪⠪⡘⡌⠀ ⡯⣳⠯⠚⢊⠡⡂⢂⠨⠊⠔⡑⠬⡸⣘⢬⢪⣪⡺⡼⣕⢯⢞⢕⢝⠎⢻⢼⣀⠀ ⠁⡂⠔⡁⡢⠣⢀⠢⠀⠅⠱⡐⡱⡘⡔⡕⡕⣲⡹⣎⡮⡏⡑⢜⢼⡱⢩⣗⣯⣟ ⢀⢂⢑⠀⡂⡃⠅⠊⢄⢑⠠⠑⢕⢕⢝⢮⢺⢕⢟⢮⢊⢢⢱⢄⠃⣇⣞⢞⣞⢾ ⢀⠢⡑⡀⢂⢊⠠⠁⡂⡐⠀⠅⡈⠪⠪⠪⠣⠫⠑⡁⢔⠕⣜⣜⢦⡰⡎⡯⡾⡽",
            "⠀⠀⠀⠀⠀⢀⣴⡾⠿⠿⠿⠿⢶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢠⣿⠁⠀⠀⠀⣀⣀⣀⣈⣻⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣾⡇⠀⠀⣾⣟⠛⠋⠉⠉⠙⠛⢷⣄⠀⠀⠀⠀⠀⠀⠀ ⢀⣤⣴⣶⣿⠀⠀⢸⣿⣿⣧⠀⠀⠀⠀⢀⣀⢹⡆⠀⠀⠀⠀⠀⠀ ⢸⡏⠀⢸⣿⠀⠀⠀⢿⣿⣿⣷⣶⣶⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀ ⣼⡇⠀⢸⣿⠀⠀⠀⠈⠻⠿⣿⣿⠿⠿⠛⢻⡇⠀⠀⠀⠀⠀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣼⣷⣶⣶⣶⣤⡀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀ ⢻⡇⠀⢸⣿⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⣿⣿⣿⡇ ⠈⠻⠷⠾⣿⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣿⣇ ⠀⠀⠀⠀⣿⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⢸⣿⣿⣿⡿ ⠀⠀⠀⠀⢿⣧⣀⣠⣴⡿⠙⠛⠿⠿⠿⠿⠉⠀⠀⢠⣿⣿⣿⣿⠇ ⠀⠀⠀⠀⠀⢈⣩⣭⣥⣤⣤⣤⣤⣤⣤⣤⣤⣤⣶⣿⣿⣿⣿⠏⠀ ⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⡟⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠋⠁⠀⠀⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⣷⣄⣀⣀⣀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀ ⠀⠀⠀⠀⠀⠈⠛⠿⠿⣿⣿⣿⣿⣿⠿⠿⢿⣿⣿⣿⣿⣿⡄⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⢀⣹⣿⣿⣿⡇⠀⠀ ⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀ ⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠁⠀⠀⠀ ⠀⠀⠀⠀⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠉⠉⠁⢤⣤⣤⣤⣤⣤⣤⡀ ⠀⠀⠀⠀⢿⣿⣿⣿⣷⣶⣶⣶⣶⣾⣿⣿⣿⣆⢻⣿⣿⣿⣿⣿⡇ ⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠻⣿⣿⣿⡿⠁ ⠀⠀⠀⠀⠀⠀⠈⠙⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠉⠀⠙⠛⠉⠀⠀",
            "⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠿⠿⢿⣿⣿⠿⠛⠿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠟⠉⠄⣀⡤⢤⣤⣈⠁⣠⡔⠶⣾⣿ ⣿⣿⣿⣿⣿⣿⣿⡿⠛⠋⠁⠄⠄⠄⣼⣿⠁⡀⢹⣿⣷⢹⡇⠄⠎⣿ ⣿⣿⣿⠿⠛⠉⠁⠄⠄⠄⠄⠄⠄⠄⠹⣇⣀⣡⣾⣿⡿⠉⠛⠒⠒⠋ ⡿⠋⠁⠄⠄⢀⣤⣤⡀⠄⠄⠄⠄⠄⠄⠈⠙⠛⠛⠉⠄⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⢹⣧⡈⠿⣷⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣠ ⠄⠄⠄⠄⠄⠈⠻⢿⣶⣌⣙⡛⠛⠿⠶⠶⠶⠶⠶⠖⣒⣒⣚⣋⡩⢱ ⠄⠄⠄⠄⠄⠄⠄⠄⠈⠉⠛⠛⠛⠻⠿⠿⠟⠛⠛⠛⠉⢉⣥⣶⣾⣿ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠶⣿⣿⣿⣿⣿⣿ ⡟⠛⢻⣿⡟⠛⣿⡟⠛⠛⠛⠛⢻⣿⡿⠛⠛⠛⢻⡟⠛⠛⠛⠛⢻⣿ ⡇⠄⠄⢻⡇⠄⣿⣿⣿⠄⠄⣿⣿⡏⠄⣼⣿⣿⣿⡇⠄⣿⣿⣿⣿⣿ ⡇⠄⣧⠄⠄⠄⣿⣿⣿⠄⠄⣿⣿⡇⠄⣿⣿⣿⣿⡇⠄⣥⣥⣥⣿⣿ ⡇⠄⣿⣧⠄⠄⣿⡟⠛⠄⠄⠛⢻⣷⣄⠈⠙⠛⢹⡇⠄⠉⠉⠉⢹⣿ ⣿⡿⠛⠛⠛⢻⣿⠿⠛⠛⠛⢿⣿⣿⡿⠛⠛⠛⢻⡟⠛⣿⡿⠛⣻⣿ ⡟⠄⣼⣿⣿⣿⡇⠄⣾⣿⣧⠄⢻⡏⠄⣼⣿⣿⣿⡇⠄⡟⢀⣴⣿⣿ ⡇⠄⣿⣿⣿⣿⡄⠄⣿⣿⣿⠄⢸⡇⠄⣿⣿⣿⣿⡇⠄⣀⠈⢻⣿⣿ ⣿⣄⠈⠙⠛⢻⣧⡄⠙⠛⠉⣠⣿⣷⣄⠈⠙⠛⢹⡇⠄⣿⣧⠄⠻⣿",
            "5v⣿⣿⠟⢹⣶⣶⣝⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⡟⢰⡌⠿⢿⣿⡾⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⢸⣿⣤⣒⣶⣾⣳⡻⣿⣿⣿⣿⡿⢛⣯⣭⣭⣭⣽⣻⣿⣿v v⣿⣿⢸⣿⣿⣿⣿⢿⡇⣶⡽⣿⠟⣡⣶⣾⣯⣭⣽⣟⡻⣿⣷⡽v v⣿⣿⠸⣿⣿⣿⣿⢇⠃⣟⣷⠃⢸⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⣇⢻⣿⣿⣯⣕⠧⢿⢿⣇⢯⣝⣒⣛⣯⣭⣛⣛⣣⣿⣿⣿v v⣿⣿⣿⣌⢿⣿⣿⣿⣿⡘⣞⣿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⣿⣿⣦⠻⠿⣿⣿⣷⠈⢞⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⣿⣿⣿⣗⠄⢿⣿⣿⡆⡈⣽⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⣿⡿⣻⣽⣿⣆⠹⣿⡇⠁⣿⡼⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟v v⠿⣛⣽⣾⣿⣿⠿⠋⠄⢻⣷⣾⣿⣧⠟⣡⣾⣿⣿⣿⣿⣿⣿⡇v v⡟⢿⣿⡿⠋⠁⣀⡀⠄⠘⠊⣨⣽⠁⠰⣿⣿⣿⣿⣿⣿⣿⡍⠗v v⣿⠄⠄⠄⠄⣼⣿⡗⢠⣶⣿⣿⡇⠄⠄⣿⣿⣿⣿⣿⣿⣿⣇⢠v v⣝⠄⠄⢀⠄⢻⡟⠄⣿⣿⣿⣿⠃⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⢹v v⣿⣿⣿⣿⣧⣄⣁⡀⠙⢿⡿⠋⠄⣸⡆⠄⠻⣿⡿⠟⢛⣩⣝⣚v v⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣤⣾⣿⣿⣄⠄⠄⠄⣴⣿⣿⣿⣇v v⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⡀⠛⠿⣿⣫⣾",
            "I can never tell wtf these things are supposed to represent. Must be a boomer thing?",
            "getting banned on a subreddit focused on stopping porn for posting porn? this is what 1984 warned us about",
            "i am posting this on r/nofap",
            "What the fuck am I looking at?",
            "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⣿",
            "I hate that I have this a shortcut.\n\n\n\n⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⣿",
            "u/among-us-penis",
            "what am i looking at here",
            "yeah i got banned",
            "Reluctantly 🙅‍♂️ crouched at the starting 🔘 line ➖〰, Engines 👷👈 pumping ⛽ and thumping 🐰 in time 🕐. The green ♻ light 💡 flashes 📸, the flags 🇺🇸 go 🏃 up ☝🙌😎. Churning 🙂🙃🌀 and burning 🔥💯, they yearn 😡😠😾 for the cup ☕. They deftly 💯 maneuver 👎 and muscle 💪 for rank 🔪, Fuel ⛽ burning 🔥 fast 🏃💨 on 🔛 an empty 🗑 tank 👃. Reckless 🤬 and wild 🐻, they pour 🌊💦 through the turns 🔄. Their prowess 🖋📜📯 is potent 😧 and secretly 🤐 stern 🤤. As they speed 🏃 through the finish 🏁🍆💦, the flags 🇺🇸 go 🏃 down ⬇. The fans 🤡 get 🉐 up ☝ and they get 🔟 out of town 🏪. The arena 💉⚔🛡 is empty 🗑 except 😮 for one 😤 man 👨🏻‍🍳, Still 🤞🙌 driving 🚗😜 and striving 👌 as fast 🚄⚡ as he 👨 can. The sun 🌞 has gone 🏃 down 🔻 and the moon 🌙🌛 has come 💦 up ☝, And long 🍆 ago 😅 somebody 👤 left 👈 with the cup 🍵. But 🍑 he's 👥 driving 🚗 and striving 💢 and hugging 🤗 the turns 🔄. And thinking 🤔 of someone 👤 for whom he 👨 still 🙄 burns 🔥. He's 👨 going 👉 the distance 🚢. He's 👨😎 going 👉 for speed 🏃. She's 👩🏽 all 💯 alone 🙀🙃, all 💯 alone 👤 In her 👸🤜 time 🕐 of need 👉. Because he's 👥 racing 🏃 and pacing 🏃🏿 and plotting 🦀💭💡 the course 🏎, He's 👨🏻 fighting 💥👊💪🏿 and biting 😬 and riding 👊🏇🏿 on 🔛 his 💦 horse 🐴, He's 👨 going 👉 the distance 🗾. No 😣 trophy 🏆, no 🚫 flowers 🌷, no 🚫 flashbulbs, no 👎🚫 wine 🍇, He's 👨 haunted 👻 by something 😅 he 👨 cannot 🚫 define 🔥😎. Bowel-shaking earthquakes ♒ of doubt 🚫🤔 and remorse 😢, Assail 🤔👉 him 👴, impale him 👨🏾 with monster-truck force 🖐. In his 💦 mind 🤯, he's 👨😛🤞 still 🙄 driving 👊, still 🙄😽 making 💘 the grade 💯😤. She's 👧 hoping 🙏 in time ⏰ that her 👩 memories 💭 will fade 😜😏💯. 'Cause 🎗 he's 👥💇 racing 🏃 and pacing 🏃🏿 and plotting 🦀💭💡 the course 🏎, He's 👨 fighting 🥊 and biting 💅😁 and riding ♿ on 🔛 his 💦 horse 🐎. The sun ☀ has gone 🏃 down ⬇🔓 and the moon 🌚 has come 💦 up ☝, And long 🕚 ago 😅⏰ somebody 👤 left 👈 with the cup ☕. But 🍑 he's 👨 striving 👌 and driving 🚗 and hugging 🤗 the turns 💃. And thinking 🤔 of someone 👤 for whom he 👨🏻 still 🙄 burns 🔥😩. 'Cause 🎗 he's 👥 going 🏃 the distance 🚢. He's 👨 going 🏃👳 for speed 🏃. She's 👧 all 💯 alone 👤, all 💯 alone 👤 In her 👩 time 🕐 of need 😩. Because he's 👨 racing 🏃🏽 and pacing 🏃🏿 and plotting 🦀💭💡 the course 🏎, He's 👨🏿 fighting 👊 and biting 🦷 and riding ♿ on 🔛 his 👋 horse 🐴. He's 👨 racing 🏁🏎 and pacing 🏃🏿 and plotting 🦀💭💡 the course 🏎, He's 👨 fighting 👊🗣🔫 and biting 🦷 and riding ♿ on 🔛 his 💦 horse 🐎. He's 👨 going 🏃 the distance 🚢. He's 👨 going 🏃🏾‍♂️🎶🎵 for speed 🏃. He's 👨 going 🏃 the distance 🚢.",
            "fishdick fortnite",
            "So thats what killed me.",
            "\n⠀⠀⠀⠀⠀⢀⣴⡾⠿⠿⠿⠿⢶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢠⣿⠁⠀⠀⠀⣀⣀⣀⣈⣻⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣾⡇⠀⠀⣾⣟⠛⠋⠉⠉⠙⠛⢷⣄⠀⠀⠀⠀⠀⠀⠀ ⢀⣤⣴⣶⣿⠀⠀⢸⣿⣿⣧⠀⠀⠀⠀⢀⣀⢹⡆⠀⠀⠀⠀⠀⠀ ⢸⡏⠀⢸⣿⠀⠀⠀⢿⣿⣿⣷⣶⣶⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀ ⣼⡇⠀⢸⣿⠀⠀⠀⠈⠻⠿⣿⣿⠿⠿⠛⢻⡇⠀⠀⠀⠀⠀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣼⣷⣶⣶⣶⣤⡀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀ ⢻⡇⠀⢸⣿⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⣿⣿⣿⡇ ⠈⠻⠷⠾⣿⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣿⣇ ⠀⠀⠀⠀⣿⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⢸⣿⣿⣿⡿ ⠀⠀⠀⠀⢿⣧⣀⣠⣴⡿⠙⠛⠿⠿⠿⠿⠉⠀⠀⢠⣿⣿⣿⣿⠇ ⠀⠀⠀⠀⠀⢈⣩⣭⣥⣤⣤⣤⣤⣤⣤⣤⣤⣤⣶⣿⣿⣿⣿⠏⠀ ⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⡟⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠋⠁⠀⠀⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⣷⣄⣀⣀⣀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀ ⠀⠀⠀⠀⠀⠈⠛⠿⠿⣿⣿⣿⣿⣿⠿⠿⢿⣿⣿⣿⣿⣿⡄⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⢀⣹⣿⣿⣿⡇⠀⠀ ⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀ ⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠁⠀⠀⠀ ⠀⠀⠀⠀⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠉⠉⠁⢤⣤⣤⣤⣤⣤⣤⡀ ⠀⠀⠀⠀⢿⣿⣿⣿⣷⣶⣶⣶⣶⣾⣿⣿⣿⣆⢻⣿⣿⣿⣿⣿⡇ ⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠻⣿⣿⣿⡿⠁ ⠀⠀⠀⠀⠀⠀⠈⠙⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠉⠀⠙⠛⠉⠀⠀",
            "nofapz!!!!!!!!!!!!! *soy face*",
            "When the impostor is sus!😳",
            "⠀⠀⠀⠀⠀⢀⣴⡾⠿⠿⠿⠿⢶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢠⣿⠁⠀⠀⠀⣀⣀⣀⣈⣻⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣾⡇⠀⠀⣾⣟⠛⠋⠉⠉⠙⠛⢷⣄⠀⠀⠀⠀⠀⠀⠀ ⢀⣤⣴⣶⣿⠀⠀⢸⣿⣿⣧⠀⠀⠀⠀⢀⣀⢹⡆⠀⠀⠀⠀⠀⠀ ⢸⡏⠀⢸⣿⠀⠀⠀⢿⣿⣿⣷⣶⣶⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀ ⣼⡇⠀⢸⣿⠀⠀⠀⠈⠻⠿⣿⣿⠿⠿⠛⢻⡇⠀⠀⠀⠀⠀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣼⣷⣶⣶⣶⣤⡀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀ ⢻⡇⠀⢸⣿⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⣿⣿⣿⡇ ⠈⠻⠷⠾⣿⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣿⣇ ⠀⠀⠀⠀⣿⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⢸⣿⣿⣿⡿ ⠀⠀⠀⠀⢿⣧⣀⣠⣴⡿⠙⠛⠿⠿⠿⠿⠉⠀⠀⢠⣿⣿⣿⣿⠇ ⠀⠀⠀⠀⠀⢈⣩⣭⣥⣤⣤⣤⣤⣤⣤⣤⣤⣤⣶⣿⣿⣿⣿⠏⠀ ⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⡟⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠋⠁⠀⠀⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⣷⣄⣀⣀⣀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀ ⠀⠀⠀⠀⠀⠈⠛⠿⠿⣿⣿⣿⣿⣿⠿⠿⢿⣿⣿⣿⣿⣿⡄⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⢀⣹⣿⣿⣿⡇⠀⠀ ⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀ ⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠁⠀⠀⠀ ⠀⠀⠀⠀⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠉⠉⠁⢤⣤⣤⣤⣤⣤⣤⡀ ⠀⠀⠀⠀⢿⣿⣿⣿⣷⣶⣶⣶⣶⣾⣿⣿⣿⣆⢻⣿⣿⣿⣿⣿⡇ ⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠻⣿⣿⣿⡿⠁ ⠀⠀⠀⠀⠀⠀⠈⠙⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠉⠀⠙⠛⠉⠀⠀",
            "v⣿⡟⢰⡌⠿⢿⣿⡾⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v   v⣿⣿⢸⣿⣤⣒⣶⣾⣳⡻⣿⣿⣿⣿⡿⢛⣯⣭⣭⣭⣽⣻⣿⣿v v⣿⣿⢸⣿⣿⣿⣿⢿⡇⣶⡽⣿⠟⣡⣶⣾⣯⣭⣽⣟⡻⣿⣷⡽v   v⣿⣿⠸⣿⣿⣿⣿⢇⠃⣟⣷⠃⢸⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⣇⢻⣿⣿⣯⣕⠧⢿⢿⣇⢯⣝⣒⣛⣯⣭⣛⣛⣣⣿⣿⣿v   v⣿⣿⣿⣌⢿⣿⣿⣿⣿⡘⣞⣿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⣿⣿⣦⠻⠿⣿⣿⣷⠈⢞⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v   v⣿⣿⣿⣿⣿⣗⠄⢿⣿⣿⡆⡈⣽⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿v v⣿⣿⣿⡿⣻⣽⣿⣆⠹⣿⡇⠁⣿⡼⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟v   v⠿⣛⣽⣾⣿⣿⠿⠋⠄⢻⣷⣾⣿⣧⠟⣡⣾⣿⣿⣿⣿⣿⣿⡇v v⡟⢿⣿⡿⠋⠁⣀⡀⠄⠘⠊⣨⣽⠁⠰⣿⣿⣿⣿⣿⣿⣿⡍⠗v   v⣿⠄⠄⠄⠄⣼⣿⡗⢠⣶⣿⣿⡇⠄⠄⣿⣿⣿⣿⣿⣿⣿⣇⢠v v⣝⠄⠄⢀⠄⢻⡟⠄⣿⣿⣿⣿⠃⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⢹v   v⣿⣿⣿⣿⣧⣄⣁⡀⠙⢿⡿⠋⠄⣸⡆⠄⠻⣿⡿⠟⢛⣩⣝⣚v v⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣤⣾⣿⣿⣄⠄⠄⠄⣴⣿⣿⣿⣇v   v⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⡀⠛⠿⣿⣫⣾v",
            "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            " ⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            "amogus",
            "\n⠀⠀⠀⡯⡯⡾⠝⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢊⠘⡮⣣⠪⠢⡑⡌\n⠀⠀⠀⠟⠝⠈⠀⠀⠀⠡⠀⠠⢈⠠⢐⢠⢂⢔⣐⢄⡂⢔⠀⡁⢉⠸⢨⢑⠕⡌\n⠀⠀⡀⠁⠀⠀⠀⡀⢂⠡⠈⡔⣕⢮⣳⢯⣿⣻⣟⣯⣯⢷⣫⣆⡂⠀⠀⢐⠑⡌\n⢀⠠⠐⠈⠀⢀⢂⠢⡂⠕⡁⣝⢮⣳⢽⡽⣾⣻⣿⣯⡯⣟⣞⢾⢜⢆⠀⡀⠀⠪\n⣬⠂⠀⠀⢀⢂⢪⠨⢂⠥⣺⡪⣗⢗⣽⢽⡯⣿⣽⣷⢿⡽⡾⡽⣝⢎⠀⠀⠀⢡\n⣿⠀⠀⠀⢂⠢⢂⢥⢱⡹⣪⢞⡵⣻⡪⡯⡯⣟⡾⣿⣻⡽⣯⡻⣪⠧⠑⠀⠁⢐\n⣿⠀⠀⠀⠢⢑⠠⠑⠕⡝⡎⡗⡝⡎⣞⢽⡹⣕⢯⢻⠹⡹⢚⠝⡷⡽⡨⠀⠀⢔\n⣿⡯⠀⢈⠈⢄⠂⠂⠐⠀⠌⠠⢑⠱⡱⡱⡑⢔⠁⠀⡀⠐⠐⠐⡡⡹⣪⠀⠀⢘\n⣿⣽⠀⡀⡊⠀⠐⠨⠈⡁⠂⢈⠠⡱⡽⣷⡑⠁⠠⠑⠀⢉⢇⣤⢘⣪⢽⠀⢌⢎\n⣿⢾⠀⢌⠌⠀⡁⠢⠂⠐⡀⠀⢀⢳⢽⣽⡺⣨⢄⣑⢉⢃⢭⡲⣕⡭⣹⠠⢐⢗\n⣿⡗⠀⠢⠡⡱⡸⣔⢵⢱⢸⠈⠀⡪⣳⣳⢹⢜⡵⣱⢱⡱⣳⡹⣵⣻⢔⢅⢬⡷\n⣷⡇⡂⠡⡑⢕⢕⠕⡑⠡⢂⢊⢐⢕⡝⡮⡧⡳⣝⢴⡐⣁⠃⡫⡒⣕⢏⡮⣷⡟\n⣷⣻⣅⠑⢌⠢⠁⢐⠠⠑⡐⠐⠌⡪⠮⡫⠪⡪⡪⣺⢸⠰⠡⠠⠐⢱⠨⡪⡪⡰\n⣯⢷⣟⣇⡂⡂⡌⡀⠀⠁⡂⠅⠂⠀⡑⡄⢇⠇⢝⡨⡠⡁⢐⠠⢀⢪⡐⡜⡪⡊\n⣿⢽⡾⢹⡄⠕⡅⢇⠂⠑⣴⡬⣬⣬⣆⢮⣦⣷⣵⣷⡗⢃⢮⠱⡸⢰⢱⢸⢨⢌\n⣯⢯⣟⠸⣳⡅⠜⠔⡌⡐⠈⠻⠟⣿⢿⣿⣿⠿⡻⣃⠢⣱⡳⡱⡩⢢⠣⡃⠢⠁\n⡯⣟⣞⡇⡿⣽⡪⡘⡰⠨⢐⢀⠢⢢⢄⢤⣰⠼⡾⢕⢕⡵⣝⠎⢌⢪⠪⡘⡌⠀\n⡯⣳⠯⠚⢊⠡⡂⢂⠨⠊⠔⡑⠬⡸⣘⢬⢪⣪⡺⡼⣕⢯⢞⢕⢝⠎⢻⢼⣀⠀\n⠁⡂⠔⡁⡢⠣⢀⠢⠀⠅⠱⡐⡱⡘⡔⡕⡕⣲⡹⣎⡮⡏⡑⢜⢼⡱⢩⣗⣯⣟\n⢀⢂⢑⠀⡂⡃⠅⠊⢄⢑⠠⠑⢕⢕⢝⢮⢺⢕⢟⢮⢊⢢⢱⢄⠃⣇⣞⢞⣞⢾\n⢀⠢⡑⡀⢂⢊⠠⠁⡂⡐⠀⠅⡈⠪⠪⠪⠣⠫⠑⡁⢔⠕⣜⣜⢦⡰⡎⡯⡾⡽",
            "r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂 r/AmongUsPorn 😳 PRETTY SUS 😂",
            "im posting this on r/NoFap",
            "Edit: dont give me awards but im an attention whore so im going to pull an r/awardspeechedits and keep making edits to a post of ascii art that i didn't even make and added a bullshit title to for, again, [attention](https://i.imgur.com/qsqEzTN.jpg)",
            "Among penis",
            "you go man",
            "⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            "goodness gracious that is hot",
            "This thread is cursed",
            "Among cock",
            "\n⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            "#𓂺",
            "u/among-us-penis",
            "What is it I'm on mobile",
            "Thanks for giving me rewards, but stop giving me free one, and gimme one worth monies",
            "Down voted bc op is a dick",
            "⠀⠀⠀⠀⠀⢀⣴⡾⠿⠿⠿⠿⢶⣦⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢠⣿⠁⠀⠀⠀⣀⣀⣀⣈⣻⣷⡄⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⣾⡇⠀⠀⣾⣟⠛⠋⠉⠉⠙⠛⢷⣄⠀⠀⠀⠀⠀⠀⠀ ⢀⣤⣴⣶⣿⠀⠀⢸⣿⣿⣧⠀⠀⠀⠀⢀⣀⢹⡆⠀⠀⠀⠀⠀⠀ ⢸⡏⠀⢸⣿⠀⠀⠀⢿⣿⣿⣷⣶⣶⣿⣿⣿⣿⠃⠀⠀⠀⠀⠀⠀ ⣼⡇⠀⢸⣿⠀⠀⠀⠈⠻⠿⣿⣿⠿⠿⠛⢻⡇⠀⠀⠀⠀⠀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⣼⣷⣶⣶⣶⣤⡀⠀⠀ ⣿⡇⠀⢸⣿⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⡀ ⢻⡇⠀⢸⣿⠀⠀⠀⠀⢀⣾⣿⣿⣿⣿⣿⣿⣿⡿⠿⣿⣿⣿⣿⡇ ⠈⠻⠷⠾⣿⠀⠀⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⢸⣿⣿⣿⣇ ⠀⠀⠀⠀⣿⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⠃⠀⢸⣿⣿⣿⡿ ⠀⠀⠀⠀⢿⣧⣀⣠⣴⡿⠙⠛⠿⠿⠿⠿⠉⠀⠀⢠⣿⣿⣿⣿⠇ ⠀⠀⠀⠀⠀⢈⣩⣭⣥⣤⣤⣤⣤⣤⣤⣤⣤⣤⣶⣿⣿⣿⣿⠏⠀ ⠀⠀⠀⠀⣴⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠋⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⡟⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠋⠁⠀⠀⠀⠀ ⠀⠀⠀⢸⣿⣿⣿⣷⣄⣀⣀⣀⣀⣀⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡀⠀⠀⠀ ⠀⠀⠀⠀⠀⠈⠛⠿⠿⣿⣿⣿⣿⣿⠿⠿⢿⣿⣿⣿⣿⣿⡄⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀⢀⣹⣿⣿⣿⡇⠀⠀ ⠀⠀⠀⠀⠀⢰⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠀⠀ ⠀⠀⠀⠀⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠛⠁⠀⠀⠀ ⠀⠀⠀⠀⣿⣿⣿⣿⠁⠀⠀⠀⠀⠀⠉⠉⠁⢤⣤⣤⣤⣤⣤⣤⡀ ⠀⠀⠀⠀⢿⣿⣿⣿⣷⣶⣶⣶⣶⣾⣿⣿⣿⣆⢻⣿⣿⣿⣿⣿⡇ ⠀⠀⠀⠀⠈⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⠻⣿⣿⣿⡿⠁ ⠀⠀⠀⠀⠀⠀⠈⠙⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠉⠀⠙⠛⠉⠀⠀",
            "Are people on that sub serious or is it all just a big joke",
            "I just posted it in r/NoFap",
            "Just posted this om r/nofap",
            "I didn't know such a sub existed. Looks like a whole bunch of crazies, incels and alt-right ban evasion.",
            " \n\n‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            " sus moment",
            "r/eyebleach",
            "Amongsus",
            "Banned from tarzaned chat",
            "Nice repost.",
            "looks like a cup of coffee and French bread",
            "Minion dick?",
            "Now I wanna try",
            "6666 likes",
            "Totally worth a ban",
            "i just did and i got banned too\n\n[https://www.reddit.com/r/NoFap/comments/lilfhv/sus/](https://www.reddit.com/r/NoFap/comments/lilfhv/sus/)",
            "NNN looks like it’s gonna be hard this year",
            "help idk what it is",
            "https://i.imgur.com/V7ccgpy.png\n\nI don't get how these are always posted broken. :\\",
            "amogus",
            "A mongoose",
            "Wow, what an asshole.",
            "That’s sus",
            "That sub is super dangerous. I just spent the last hour going through it. The poor guys is all ill say.",
            "us",
            "\n⠀⠀‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎ ‎‎‎‎‎⠀⣠⣤⣤⣤⣤⣤⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢰⡿⠋⠁⠀⠀⠈⠉⠙⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢀⣿⠇⠀⢀⣴⣶⡾⠿⠿⠿⢿⣿⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⣀⣀⣸⡿⠀⠀⢸⣿⣇⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⣾⡟⠛⣿⡇⠀⠀⢸⣿⣿⣷⣤⣤⣤⣤⣶⣶⣿⠇⠀⠀⠀⠀⠀⠀⠀⣀⠀⠀ ⢀⣿⠀⢀⣿⡇⠀⠀⠀⠻⢿⣿⣿⣿⣿⣿⠿⣿⡏⠀⠀⠀⠀⢴⣶⣶⣿⣿⣿⣆ ⢸⣿⠀⢸⣿⡇⠀⠀⠀⠀⠀⠈⠉⠁⠀⠀⠀⣿⡇⣀⣠⣴⣾⣮⣝⠿⠿⠿⣻⡟ ⢸⣿⠀⠘⣿⡇⠀⠀⠀⠀⠀⠀⠀⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠁⠉⠀ ⠸⣿⠀⠀⣿⡇⠀⠀⠀⠀⠀⣠⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡿⠟⠉⠀⠀⠀⠀ ⠀⠻⣷⣶⣿⣇⠀⠀⠀⢠⣼⣿⣿⣿⣿⣿⣿⣿⣛⣛⣻⠉⠁⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⢸⣿⠀⠀⠀⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀⠀⠀⠀⠀ ⠀⠀ ⠀⠀⠀⠀⢸⣿⣀⣀⣀⣼⡿⢿⣿⣿⣿⣿⣿⡿⣿⣿⡿⠀",
            "among us funny\n\nRed sus. Red suuuus. I said red, sus, hahahahaha. Why arent you laughing? I just made a reference to the popular video game \"Among Us\"! How can you not laugh at it? Emergeny meeting! Guys, this here guy doesnt laugh at my funny Among Us memes! Lets beat him to death! Dead body reported! Skip! Skip! Vote blue! Blue was not an impostor. Among us in a nutshell hahahaha. What?! Youre still not laughing your ass off? I made SEVERAL funny references to Among Us and YOU STILL ARENT LAUGHING??!!! Bruh. Ya hear that? Wooooooosh. Whats woooosh? Oh, nothing. Just the sound of a joke flying over your head. Whats that? You think im annoying? Kinda sus, bro. Hahahaha! Anyway, yea, gotta go do tasks. Hahahaha!",
            "she’s looking kinda thick tho",
            "Reddit stop making shitty among us memes challenge.",
            "After crying reading a story this is great. Thank you",
            "Rightfully so, that's fucking annoying",
            "[deleted]",
            "Can someone tell me what it is? I think my phone ruined the image.",
            "I finally claimed my free award just for this",
            "I got banned for posting this on r/amongus",
            "Remove edit 2. They are giving all that they have, so shut the fuck up and deal with it.",
            "hwh",
            "HA HA I am totally giving you a WSA next time I get one, and you will just have to deal with the shame",
            "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⣤⣤⣀⣀⣀⣀⡀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⠟⠉⠉⠉⠉⠉⠉⠉⠙⠻⢶⣄⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣾⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⣷⡀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⡟⠀⣠⣶⠛⠛⠛⠛⠛⠛⠳⣦⡀⠀⠘⣿⡄⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⣿⠁⠀⢹⣿⣦⣀⣀⣀⣀⣀⣠⣼⡇⠀⠀⠸⣷⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⡏⠀⠀⠀⠉⠛⠿⠿⠿⠿⠛⠋⠁⠀⠀⠀⠀⣿⡄⣠ ⠀⠀⢀⣀⣀⣀⠀⠀⢠⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⡇⠀ ⠿⠿⠟⠛⠛⠉⠀⠀⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡇⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⣿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣧⠀ ⠀⠀⠀⠀⠀⠀⠀⢸⡿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⣿⠀ ⠀⠀⠀⠀⠀⠀⠀⣾⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠀⠀⠀⠀⠀⠀⠀⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠀⠀⠀⠀⠀⠀⢰⣿⠀⠀⠀⠀⣠⡶⠶⠿⠿⠿⠿⢷⣦⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠀⠀⣀⣀⣀⠀⣸⡇⠀⠀⠀⠀⣿⡀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⠀⠀⠀⠀⣿⠀ ⣠⡿⠛⠛⠛⠛⠻⠀⠀⠀⠀⠀⢸⣇⠀⠀⠀⠀⠀⠀⣿⠇⠀⠀⠀⠀⠀⠀⣿⠀ ⢻⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡟⠀⠀⢀⣤⣤⣴⣿⠀⠀⠀⠀⠀⠀⠀⣿⠀ ⠈⠙⢷⣶⣦⣤⣤⣤⣴⣶⣾⠿⠛⠁⢀⣶⡟⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⡟⠀ ⢷⣶⣤⣀⠉⠉⠉⠉⠉⠄⠀⠀⠀⠀⠈⣿⣆⡀⠀⠀⠀⠀⠀⠀⢀⣠⣴⡾⠃⠀ ⠀⠈⠉⠛⠿⣶⣦⣄⣀⠀⠀⠀⠀⠀⠀⠈⠛⠻⢿⣿⣾⣿⡿⠿⠟⠋⠁⠀⠀⠀",
            "⠀⠀⠀⡯⡯⡾⠝⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢊⠘⡮⣣⠪⠢⡑⡌ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ㅤ ⠀⠀⠀⠟⠝⠈⠀⠀⠀⠡⠀⠠⢈⠠⢐⢠⢂⢔⣐⢄⡂⢔⠀⡁⢉⠸⢨⢑⠕⡌ ㅤ ⠀⠀⡀⠁⠀⠀⠀⡀⢂⠡⠈⡔⣕⢮⣳⢯⣿⣻⣟⣯⣯⢷⣫⣆⡂⠀⠀⢐⠑⡌ ⢀⠠⠐⠈⠀⢀⢂⠢⡂⠕⡁⣝⢮⣳⢽⡽⣾⣻⣿⣯⡯⣟⣞⢾⢜⢆⠀⡀⠀⠪ ⣬⠂⠀⠀⢀⢂⢪⠨⢂⠥⣺⡪⣗⢗⣽⢽⡯⣿⣽⣷⢿⡽⡾⡽⣝⢎⠀⠀⠀⢡ ⣿⠀⠀⠀⢂⠢⢂⢥⢱⡹⣪⢞⡵⣻⡪⡯⡯⣟⡾⣿⣻⡽⣯⡻⣪⠧⠑⠀⠁⢐ ⣿⠀⠀⠀⠢⢑⠠⠑⠕⡝⡎⡗⡝⡎⣞⢽⡹⣕⢯⢻⠹⡹⢚⠝⡷⡽⡨⠀⠀⢔ ⣿⡯⠀⢈⠈⢄⠂⠂⠐⠀⠌⠠⢑⠱⡱⡱⡑⢔⠁⠀⡀⠐⠐⠐⡡⡹⣪⠀⠀⢘ ⣿⣽⠀⡀⡊⠀⠐⠨⠈⡁⠂⢈⠠⡱⡽⣷⡑⠁⠠⠑⠀⢉⢇⣤⢘⣪⢽⠀⢌⢎ ⣿⢾⠀⢌⠌⠀⡁⠢⠂⠐⡀⠀⢀⢳⢽⣽⡺⣨⢄⣑⢉⢃⢭⡲⣕⡭⣹⠠⢐⢗ ⣿⡗⠀⠢⠡⡱⡸⣔⢵⢱⢸⠈⠀⡪⣳⣳⢹⢜⡵⣱⢱⡱⣳⡹⣵⣻⢔⢅⢬⡷ ⣷⡇⡂⠡⡑⢕⢕⠕⡑⠡⢂⢊⢐⢕⡝⡮⡧⡳⣝⢴⡐⣁⠃⡫⡒⣕⢏⡮⣷⡟ ⣷⣻⣅⠑⢌⠢⠁⢐⠠⠑⡐⠐⠌⡪⠮⡫⠪⡪⡪⣺⢸⠰⠡⠠⠐⢱⠨⡪⡪⡰ ⣯⢷⣟⣇⡂⡂⡌⡀⠀⠁⡂⠅⠂⠀⡑⡄⢇⠇⢝⡨⡠⡁⢐⠠⢀⢪⡐⡜⡪⡊ ⣿⢽⡾⢹⡄⠕⡅⢇⠂⠑⣴⡬⣬⣬⣆⢮⣦⣷⣵⣷⡗⢃⢮⠱⡸⢰⢱⢸⢨⢌ ⣯⢯⣟⠸⣳⡅⠜⠔⡌⡐⠈⠻⠟⣿⢿⣿⣿⠿⡻⣃⠢⣱⡳⡱⡩⢢⠣⡃⠢⠁ ⡯⣟⣞⡇⡿⣽⡪⡘⡰⠨⢐⢀⠢⢢⢄⢤⣰⠼⡾⢕⢕⡵⣝⠎⢌⢪⠪⡘⡌⠀ ⡯⣳⠯⠚⢊⠡⡂⢂⠨⠊⠔⡑⠬⡸⣘⢬⢪⣪⡺⡼⣕⢯⢞⢕⢝⠎⢻⢼⣀⠀ ⠁⡂⠔⡁⡢⠣⢀⠢⠀⠅⠱⡐⡱⡘⡔⡕⡕⣲⡹⣎⡮⡏⡑⢜⢼⡱⢩⣗⣯⣟ ⢀⢂⢑⠀⡂⡃⠅⠊⢄⢑⠠⠑⢕⢕⢝⢮⢺⢕⢟⢮⢊⢢⢱⢄⠃⣇⣞⢞⣞⢾ ⢀⠢⡑⡀⢂⢊⠠⠁⡂⡐⠀⠅⡈⠪⠪⠪⠣⠫⠑⡁⢔⠕⣜⣜⢦⡰⡎⡯⡾⡽",
            "I can't fucking take it. I see an image of a random object posted and then I see it, I fucking see it. \"Oh that looks kinda like the among us guy\" it started as. That's funny, that's a cool reference. But I kept going, I'd see a fridge that looked like among us, I'd see an animated bag of chips that looked like among us, I'd see a hat that looked like among us. And every time I'd burst into an insane, breath deprived laugh staring at the image as the words AMOGUS ran through my head. It's torment, psychological torture, I am being conditioned to laugh maniacly any time I see an oval on a red object. I can't fucking live like this... I can't I can't I can't I can't I can't! And don't get me fucking started on the words! I'll never hear the word suspicious again without thinking of among us. Someone does something bad and I can't say anything other than \"sus.\" I could watch a man murder everyone I love and all I would be able to say is \"red sus\" and laugh like a fucking insane person. And the word \"among\" is ruined. The phrase \"among us\" is ruined. I can't live anymore. Among us has destroyed my fucking life. I want to eject myself from this plane of existence. MAKE IT STOP!",
            "look what u have done, a bunch of horne ppl have revealed themselves from the shadows and out to make cursed comments",
            "How do I copy this",
            "[deleted]",
            "Where is nah boi cummy bot",
            "Oh yeah I remember that post lol",
            "You have been permanently banned from participating in r/Nofap. You can still view and subscribe to r/Nofap, but you won't be able to post or comment.\n\nIf you have a question regarding your ban, you can contact the moderator team for r/nofap by replying to this message.\n\nReminder from the Reddit staff: If you use another account to circumvent this subreddit ban, that will be considered a violation of the Content Policy and can result in your account being suspended from the site as a whole.\n\nNote from moderators: You think you are so funny you piece of shit? Fuck you, I'm so pissed I am gonna go consume the cum chalice\n\nSTOP. Do not message the moderators.**      \n\n--\n\n1.\t⁠Please read the rules and the FAQ in their entirety.\n2.\t⁠Use this link to determine if your post was incorrectly removed.\n\nUsers who do not follow the above instructions will not receive a response.\n\n \n\n  \n\n \n\n \n\nI am a bot, and this action was performed automatically. Please contact the moderators of this subreddit if you have any questions or concerns.",
            "Uuh,what does it show?I'm kinda new to this.",
            "Lol",
            "Well its trash anyway",
            "I can't fucking take it. I see an image of a random object posted and then I see it, I fucking see it. \"Oh that looks kinda like the among us guy\" it started as. That's funny, that's a cool reference. But I kept going, I'd see a fridge that looked like among us, I'd see an animated bag of chips that looked like among us, I'd see a hat that looked like among us. And every time I'd burst into an insane, breath deprived laugh staring at the image as the words AMOGUS ran through my head. It's torment, psychological torture, I am being conditioned to laugh maniacly any time I see an oval on a red object. I can't fucking live like this... I can't I can't I can't I can't I can't! And don't get me fucking started on the words! I'll never hear the word suspicious again without thinking of among us. Someone does something bad and I can't say anything other than \"sus.\" I could watch a man murder everyone I love and all I would be able to say is \"red sus\" and laugh like a fucking insane person. And the word \"among\" is ruined. The phrase \"among us\" is ruined. I can't live anymore. Among us has destroyed my fucking life. I want to eject myself from this plane of existence. Make it STOP!",
            "⣿⣿⣿⠟⢹⣶⣶⣝⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ \n⣿⣿⡟⢰⡌⠿⢿⣿⡾⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿ \n⣿⣿⣿⢸⣿⣤⣒⣶⣾⣳⡻⣿⣿⣿⣿⡿⢛⣯⣭⣭⣭⣽⣻⣿⣿⣿\n⣿⣿⣿⢸⣿⣿⣿⣿⢿⡇⣶⡽⣿⠟⣡⣶⣾⣯⣭⣽⣟⡻⣿⣷⡽⣿ \n⣿⣿⣿⠸⣿⣿⣿⣿⢇⠃⣟⣷⠃⢸⠻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽ \n⣿⣿⣿⣇⢻⣿⣿⣯⣕⠧⢿⢿⣇⢯⣝⣒⣛⣯⣭⣛⣛⣣⣿⣿⣿⡇ \n⣿⣿⣿⣿⣌⢿⣿⣿⣿⣿⡘⣞⣿⣼⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ \n⣿⣿⣿⣿⣿⣦⠻⠿⣿⣿⣷⠈⢞⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇ \n⣿⣿⣿⣿⣿⣿⣗⠄⢿⣿⣿⡆⡈⣽⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢻ \n⣿⣿⣿⣿⡿⣻⣽⣿⣆⠹⣿⡇⠁⣿⡼⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⣾ \n⣿⠿⣛⣽⣾⣿⣿⠿⠋⠄⢻⣷⣾⣿⣧⠟⣡⣾⣿⣿⣿⣿⣿⣿⡇⣿ \n⢼⡟⢿⣿⡿⠋⠁⣀⡀⠄⠘⠊⣨⣽⠁⠰⣿⣿⣿⣿⣿⣿⣿⡍⠗⣿ \n⡼⣿⠄⠄⠄⠄⣼⣿⡗⢠⣶⣿⣿⡇⠄⠄⣿⣿⣿⣿⣿⣿⣿⣇⢠⣿ \n⣷⣝⠄⠄⢀⠄⢻⡟⠄⣿⣿⣿⣿⠃⠄⠄⢹⣿⣿⣿⣿⣿⣿⣿⢹⣿ \n⣿⣿⣿⣿⣿⣧⣄⣁⡀⠙⢿⡿⠋⠄⣸⡆⠄⠻⣿⡿⠟⢛⣩⣝⣚⣿ \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣤⣤⣤⣾⣿⣿⣄⠄⠄⠄⣴⣿⣿⣿⣇⣿ \n⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣦⣄⡀⠛⠿⣿⣫⣾⣿",
            "Ha nice",
            "Lol",
            "Amogus",
            "Smash",
            "amogus"
        ]
    },
    {
        "post_id": "b9pu7s",
        "author": "eilonkatz",
        "title": "If my girl👧😍 and my beyblades💯🔥 are both drowning🌊😦 and I could only save one😄☝️you can catch me letting it rip😤 at my girls funeral😅👻💀 cause it's bey blade or catch a fade my nigga🙏👊😠💯😭",
        "url": "https://www.reddit.com/r/copypasta/comments/b9pu7s/if_my_girl_and_my_beyblades_are_both_drowning_and/",
        "score": 16901,
        "num_comments": 140,
        "created_utc": 1554462614.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/b9pu7s/if_my_girl_and_my_beyblades_are_both_drowning_and/",
        "comments": [
            "If my girl👧😍 and my beyblades💯🔥 are both drowning🌊😦 and I could only save one😄☝️you can catch me letting it rip😤 at my girls funeral😅👻💀 cause it's bey blade or catch a fade my nigga🙏👊😠💯😭",
            "If any of these fake weeaboo plastic diddling sluts ever want to ride the ultimate power that is my energy phallus of total chaos energy and sperm they have to do one thing, treat my sack of power containment for my destruction spheres like Beyblades.\n\nI tell them straight up, slide a long needle at my sack, wind them up until you see purple, and watch my garden sprinkler paint the whole town white.",
            "beyblede bleynede let it whip a slave",
            "Repost 😭😭😭😭😤",
            "Problem is i have to get a girlfriend first",
            "be 15 \nhad an older goth chick (bout 21-22) who was into anal play sstill a virgin \n\n>go to her house \n>makeout and fonddle *She guides me what to do \n>She pulls out anal bead \n>didnt know what that was \n>was instructed to just keep putting it in \n>was told to put lube on it \n>didnt realize this means to put lube on the whole thing \n>mfw I only put lube on the first bead >She moans while I insert like 8-9 beads in \n>im still confused as to what this is supposed to do >She says \"now pull it out\" \n>being the kid me, I didnt know she meant slowly and sexually >mfw I pull it out like a lawn mower \n>bitch got on all fours on the floor shaking *feces and blood everywhere >She starts freaking and told me to get the fuck out of her house \n>i run on the neighborhood wearing boxers \n>i cried at home",
            "Epic",
            "His girlfriend is actually Hitler.",
            "More like BAEblade amirite? ",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/emojipasta] [If my girl👧😍 and my beyblades💯🔥 are both drowning🌊😦 and I could only save one😄☝️you can catch me letting it rip😤 at my girls funeral😅👻💀 cause it's bey blade or catch a fade my nigga🙏👊😠💯😭](https://www.reddit.com/r/emojipasta/comments/b9sd3x/if_my_girl_and_my_beyblades_are_both_drowning_and/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Save your girlfriend = 1 girlfriend\nSave your bey blade = infinite girlfriends ",
            "Rips over nips, my bois ",
            "Epic ",
            "epic",
            "this is like 3 years old",
            "😞baby they broke😣 into the house😣😣\n😞😢oh no baby they 😭took the ps4😫😭\nWorse baby they 😩got the😞 🔥beyblades🔥 😭",
            "Beyblades are lit",
            "If any of these fake weeaboo plastic diddling sluts ever want to ride the ultimate power that is my energy phallus of total chaos energy and sperm they have to do one thing, treat my sack of power containment for my destruction spheres like Beyblades.\n\nI tell them straight up, slide a long needle at my sack, wind them up until you see purple, and watch my garden sprinkler paint the whole town white.",
            "Do you have the N-word pass?",
            "The return of a classic ",
            "r/emojipasta",
            "General Reposti!",
            "okay\n\n&#x200B;",
            "Ass",
            "Beyblade beyblade let it rip",
            "Let it rip mother trucker",
            "Let it rip😂👌",
            "!remindme 1 year “Huh. Neat.”",
            "!remindme 1 year “Let that shit rip”",
            "It's beyblade before getting laid",
            " **If my girl👧😍 and my beyblades💯🔥 are both drowning🌊😦 and I could only save one😄☝️you can catch me letting it rip😤 at my girls funeral😅👻💀 cause it's bey blade or catch a fade my nigga🙏👊😠💯😭**",
            "reeeeee this is old ",
            " **If my girl👧😍 and my beyblades💯🔥 are both drowning🌊😦 and I could only save one😄☝️you can catch me letting it rip😤 at my girls funeral😅👻💀 cause it's bey blade or catch a fade my nigga🙏👊😠💯😭** ",
            "Dirty repost",
            "I don't think they'll explode I'll be on fortnite tonight asking for a few more for the next time you want me there and I cant remember the name of the day I was in the log cabin on the floor and let your dog go back and forth and you were drunk. The forest service said it was supposed to be on the map that was a little bit more difficult for the last few days out in new Orleans. And while the new posts are not the greatest thing in history I think you should get a nice sword and then go to the past. ",
            "Repost gang",
            "So, you are not an option when it comes to saving something in a drowning situation?\n\n&#x200B;\n\nOk then, rip your beyblade in Purtagory.",
            "Wtf is a beyblade? Seriously asking.",
            "trying wayyyyy too hard",
            "I thought a fade was a haircut.  Is it not a haircut anymore?",
            "What. Is. This. Cancer."
        ]
    },
    {
        "post_id": "irbvx3",
        "author": "Dasnap",
        "title": "ASUS™ is teaming up with r/Copypasta for a subreddit givaway!",
        "url": "https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/",
        "score": 16865,
        "num_comments": 431,
        "created_utc": 1599914459.0,
        "selftext": "Hello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\n# What are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\n# How do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n- Length\n- Girth\n- Vein definition\n- Texture and moisture of smegma\n- Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\n# What if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
        "permalink": "/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/",
        "comments": [
            "My peepee is 1.7 inches (not a micropenis) and I am very thick pls let me win so I can get back at that prostitute who called me a micropenis.",
            "Hello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\n# What are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\n# How do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n- Length\n- Girth\n- Vein definition\n- Texture and moisture of smegma\n- Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\n# What if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
            "is it ok if mine is blue",
            "Every time I get free Reddit awards I go to r/copypasta to find the most deserving post. You win easily, wearing a foreskin is caring!",
            "I thought this was real until I saw foreskin",
            "Where can i send the video?",
            "Wait, is this real though?",
            "Hewwo w/Copypasta!\n\nWe at ASUS™ wove to see open and enthusiastic onwine communities, so we thought that this subweddit desewves an awawd!\n\n# What awe we giving away?\n\nWe at ASUS™ awe giving away 10 ASUS™ NVIDIA GeFowce WTX 3080 10GB TUF GAMING OC Ampewe Gwaphics Cawds to this sub's winning usews!\n\n# How do I entew?\n\nFiwst, you must be a subscwibew to the w/Copypasta subweddit. You must then awso fowwow @ASUS_WOG on Twittew. You must then send us cwose-up videos of you swowwy wetwacting youw foweskin. These videos wiww then be pwovided to The Counciw and they wiww judge them based on:\n\n- Wength\n- Giwth\n- Vein definition\n- Textuwe and moistuwe of smegma\n- Pubic upkeep\n\nThey wiww then choose 10 winnews and they wiww be sent PMs on Septembew 17th.\n\n# What if I am femawe ow ciwcumcised?\n\nFuck off.\n\nGood wuck evewyone, we wook fowwawd to youw submissions!",
            "HOLY SHIT THIS ONE IS GOOD",
            "Uh ohh, OP is going to have a lot of child porn after this one",
            " Length: 3.43 Vein defintion: lots Texture: grimy Pubic upkeep: moderate",
            "This is great! Everyone thinks its fake so ill win easily!",
            "This is fake. I followed the rules verbatim and my Twitter account has been suspended. I can't believe I trimmed my pubes for this bullshit.",
            "Just sent my video in their DM’s. Goodluck everyone. ( im 11 btw )",
            "What if I have a girldick ?",
            "This isn't real is it. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nJust read the whole thing. Fuck off.",
            "I laughed quite hard while forcing a considerable amount of poop out of my a-hole.",
            "\nI just shit and cum.\n\n# FAQ\n\n# What does this mean?\n\nThe amount of shit (and cum) on my computer and floor has increased by one.\n\n# Why did you do this?\n\nThere are several reasons I may deem a comment to be worthy of feces or ejaculation. These include, but are not limited to:\n\n* Being gay\n* Dank copypasta bro, where'd you find it\n* walter\n\n# Am I going to shit and cum too?\n\nNo - not yet. But you should refrain from shitposting and cumposting like this in the future. Otherwise I will be forced to shit and cum again, which may put your shitting and cumming privileges in jeopardy.\n\n# I don't believe my comment deserved being shit and cum at. Can you un-cum it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I put shit back into my butt. If you would like to issue an appeal, shoot me a hot load explaining what I got wrong. I tend to respond to retaliatory ejaculation within several minutes. Do note, however, that over 99.9% of semen dies before it can fertilize the egg, and yours is likely no exception.\n\n# How can I prevent this from happening in the future?\n\nAccept the goopy brown and white substance and move on. But learn from this mistake: your behavior will not be tolerated in my mom's basement. I will continue to shit and cum until you improve your conduct. Remember: ejaculation is privilege, not a right.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ComedyNecrophilia) if you have any questions or concerns.*",
            "I can't enter because I'm circumcised? Bullshit, the jews never stop with their tricks.",
            "I thought it was fishy that ASUS would do a giveaway with r/copypasta (for obvious reasons) but you still got me.",
            "u/lisptranslator",
            "I'm typing from inside my oversized genitals. Help.",
            "Hello Asus\n\nI have sent you the doctors video of my foreskin re-attachment procedure in order that there would not be any complications with my entering this contest. Not only have i not heard back from your Corporate headquarter of any further developments regarding my participation in your contest, i have also not received any notification by your company that my submission to your contest has been accepted. \n\nIt pains me to tell you that although no definite answer was given by Your company or any of its officials, my youtube video of me moving back my freshly re-attached foreskin post-Op has led youtube to censor my account and i have been suspended and locked out of my youtube account without further notice. \n\nPlz get back to me ASAP, i would really like to know if i am eligible to join the contest given the fact that my foreskin has only recently been reattached (yet before my submission) or if my submission was accepted. I'd also would love for your referral as to how I can get back my youtube account seeing how my livelihood depends on me performing puppetry shows for children.  It would really be the worst possible outcome if not only would i neither win the graphics card nor even know if i were eligible to win now that i am unemployed and chased online by a mob of parents for uploading a video of my foreskin reattachment to my youtube channel.\n\n&#x200B;\n\nThank You and looking forward for further clarification in these messy times\n\nBob",
            "[lmao](https://www.reddit.com/r/pcmasterrace/comments/iric4z/asus_is_teaming_up_with_rpcmasterrace_for_a/?utm_medium=android_app&utm_source=share)\n\nedit: banned\n\nedit: 14 day copypasta ban 🤦‍♂️",
            "Microsoft Windows 10",
            "Do we win for having a lot of smegma or for having a small amount?",
            "I wish this was real so badly...",
            "My foreskin is too tight to retract, can i still enter?",
            "I'm so sad! This is sexist! ASUS is easily the most sexist, and closed minded company on the planet. \n\nI hope justice will rain down on you in a swift, and callous manner for excluding women in your giveaway. I hope every man who came up with this looses 6 inches of girth and end up having to have sex with a thimble covered in Suave lotion and disappointment. \n\nThe internet will never forgive your transgressions against womenkind and will immediately start a campaign to send (to ASUS) tampons and pads, and hope other women will flood your stupid twitter with tampon pictures to stand in solidarity. (Men can to!) \n\nMay your penis shrivel to the size of a shrimp when erect, and your sperm be made weak so they can never ever impregnate a woman ever.",
            "I love trump so not nta",
            "I l thought this was legit till the foreskin part",
            "[deleted]",
            "Plot twist: It is actually real and not a copypasta",
            "Went to their Twitter hoping to find them spammed with foreskins. Disappointed to say the least",
            "What if I'm circumcised but have enough skin to pull it over?",
            "Is this real?",
            "Fuck Asus when I bought a laptop with a Windows 10 disc and code I didn't get the code I demand a refund of 10k robux.",
            "Wait. Hold up.",
            "I thought it was real till i read the foreskin part",
            "What did ASUS do to deserve this",
            "I am a Jew and my foreskin was cut off in my childhood. Now it's in the jar with alcohol. Should I send you 2 videos with my pp and with this jar? Can I have privileges because It was cut and now it's size should be calculated as (my height) / (my height then I was a kid) * (the area of the served foreskin) = (1.8 m) / (1.3 m) * (5 cm) = 6.42 cm. Also it's colour is now yellow. Is changing colour like this considered cheating? If yes I can try to sew on my foreskin. But I need to know the answer beforehand otherwise I won't betray my religion (I really need that gc for my stidies).",
            "Oh no. That’s the actual handle for Asus ROG.",
            "great so I can’t send pictures on my phone so I think I’ll just send the actual thing. damn it kind of hurt to cut it off but I think it’s worth it to win this amazing prize.",
            "i want to see asus's twitter spammed with this",
            "Rip this guys inbox.",
            "GOD DAMNIT\n\nEvery day I grow angrier with the jews and the theft of my foreskin",
            "please spam asus with dick pics",
            "Wait, is this real? If yes. Imma send one right now.",
            "Imagine if people actually sent videos of their foreskins",
            "Rip @ASUS_ROG inbox",
            "The fuck off part at the end cracks me up so much",
            "Someone actually sent this to the whole school on outlook lmao",
            " \n\n# ASUS™ is teaming up with r/Copypasta for a subreddit givaway!\n\n📷\n\nHello [r/Copypasta](https://www.reddit.com/r/Copypasta/)!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\nWhat are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\nHow do I enter?\n\nFirst, you must be a subscriber to the [r/Copypasta](https://www.reddit.com/r/Copypasta/) subreddit. You must then also follow u/ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n* Length\n* Girth\n* Vein definition\n* Texture and moisture of smegma\n* Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\nWhat if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!  \n\n\n \n\n# ASUS™ is teaming up with r/Copypasta for a subreddit givaway!\n\n📷\n\nHello [r/Copypasta](https://www.reddit.com/r/Copypasta/)!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\nWhat are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\nHow do I enter?\n\nFirst, you must be a subscriber to the [r/Copypasta](https://www.reddit.com/r/Copypasta/) subreddit. You must then also follow u/ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n* Length\n* Girth\n* Vein definition\n* Texture and moisture of smegma\n* Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\nWhat if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
            "i almost thought this was real. ffs",
            "Ben Shapiro",
            "Its throbbing help",
            "Damn I really thought this was real, could've gotten free sruff5",
            "I'm still not sure this is fake, guys.",
            "They blocked me b:(",
            "ok this might be my favortie copypasta lmao",
            "I was getting hyped lmaoo wtff 😭😭😭",
            "Unironically the funniest post on this sub.",
            "Almost fell for it",
            "What the fuck does public upkeep mean in this context",
            "Based",
            " \n\nMy peepee is 1.7 inches (not a micropenis) and I am very thick pls let me win so I can get back at that prostitute who called me a micropenis.\n\n**ReplyGive AwardShareReportSave**level 2[KalebC4](https://www.reddit.com/user/KalebC4/)639 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y9vye/?utm_source=reddit&utm_medium=web2x&context=3)\n\n🚩🚩🚩 Dump her, NTA she crossed a line by taking your money to provide you with sexual pleasure\n\n**ReplyGive AwardShareReportSave**level 3[SkyRaz69](https://www.reddit.com/user/SkyRaz69/)63 points·[3 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4yjkae/?utm_source=reddit&utm_medium=web2x&context=3)\n\nciment yES?\n\n**ReplyGive AwardShareReportSave**level 3[OperaBuffaBari](https://www.reddit.com/user/OperaBuffaBari/)13 points·[1 hour ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4z2qex/?utm_source=reddit&utm_medium=web2x&context=3)\n\nNTA, your penis your rules\n\n**ReplyGive AwardShareReportSave**\n\n**1 more reply**\n\nlevel 2[RectalcANAL](https://www.reddit.com/user/RectalcANAL/)77 points·[3 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4yf2p3/?utm_source=reddit&utm_medium=web2x&context=3)\n\nat 1.7 inches and being very thick, it's not a micropenis but a hockey puck\n\n**ReplyGive AwardShareReportSave**level 2[zaynthelegend](https://www.reddit.com/user/zaynthelegend/)116 points·[5 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y3muy/?utm_source=reddit&utm_medium=web2x&context=3)\n\nwtf\n\n**ReplyGive AwardShareReportSave**level 3[ProfVenios](https://www.reddit.com/user/ProfVenios/)73 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y5l0h/?utm_source=reddit&utm_medium=web2x&context=3)\n\nThis.\n\n**ReplyGive AwardShareReportSave**level 4[zaynthelegend](https://www.reddit.com/user/zaynthelegend/)35 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y5ps4/?utm_source=reddit&utm_medium=web2x&context=3)\n\nTHIS\n\n**ReplyGive AwardShareReportSave**level 5[Unbreakable2018](https://www.reddit.com/user/Unbreakable2018/)22 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y6ll0/?utm_source=reddit&utm_medium=web2x&context=3)\n\nnot this\n\n**ReplyGive AwardShareReportSave**level 6[zaynthelegend](https://www.reddit.com/user/zaynthelegend/)25 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y6oaw/?utm_source=reddit&utm_medium=web2x&context=3)\n\nTHIS\n\n**ReplyGive AwardShareReportSave**level 7[Dark-Aura](https://www.reddit.com/user/Dark-Aura/)16 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y70he/?utm_source=reddit&utm_medium=web2x&context=3)\n\nThat\n\n**ReplyGive AwardShareReportSave**level 8[zaynthelegend](https://www.reddit.com/user/zaynthelegend/)13 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y7dwb/?utm_source=reddit&utm_medium=web2x&context=3)\n\nhappy cakeday\n\n**ReplyGive AwardShareReportSave**level 9[Dark-Aura](https://www.reddit.com/user/Dark-Aura/)8 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y7j1b/?utm_source=reddit&utm_medium=web2x&context=3)\n\nThank\n\n**ReplyGive AwardShareReportSave**level 10[zaynthelegend](https://www.reddit.com/user/zaynthelegend/)11 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y7n55/?utm_source=reddit&utm_medium=web2x&context=3)\n\nTHIS\n\n**ReplyGive AwardShareReportSave**[**Continue this thread** ](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4y7n55)\n\n**2 more replies**\n\nlevel 2[ralphnathanielace](https://www.reddit.com/user/ralphnathanielace/)28 points·[4 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4yep41/?utm_source=reddit&utm_medium=web2x&context=3)\n\nSex, sex, sexy, sexitty sex. Karma?\n\n**ReplyGive AwardShareReportSave**level 3[Pizzahugger88](https://www.reddit.com/user/Pizzahugger88/)12 points·[3 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4yfbgh/?utm_source=reddit&utm_medium=web2x&context=3)\n\nTrue this\n\n**ReplyGive AwardShareReportSave**level 4[Anomandaris\\_Irake123](https://www.reddit.com/user/Anomandaris_Irake123/)7 points·[3 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4yieb6/?utm_source=reddit&utm_medium=web2x&context=3)\n\nThis OP this!!!!\n\n**ReplyGive AwardShareReportSave**level 2[7th\\_Spectrum](https://www.reddit.com/user/7th_Spectrum/)15 points·[3 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4ylcgn/?utm_source=reddit&utm_medium=web2x&context=3)\n\nFor the last time, stop calling your sister a prostitute.\n\n\\-Mom\n\n**ReplyGive AwardShareReportSave**\n\n**2 more replies**\n\nlevel 1[Derpster3000](https://www.reddit.com/user/Derpster3000/)**Head of Religious Affairs and Spending**727 points·[6 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4xq7is/?utm_source=reddit&utm_medium=web2x&context=3)\n\nis it ok if mine is blue\n\n**ReplyGive AwardShareReportSave**level 2[JonathanGarf](https://www.reddit.com/user/JonathanGarf/)349 points·[6 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4xr17c/?utm_source=reddit&utm_medium=web2x&context=3)\n\nAs long as you have a symbol of the hydrogen atom on your forehead.\n\n**ReplyGive AwardShareReportSave**level 3[goddamnitbrain](https://www.reddit.com/user/goddamnitbrain/)132 points·[6 hours ago](https://www.reddit.com/r/copypasta/comments/irbvx3/asus_is_teaming_up_with_rcopypasta_for_a/g4xt36p/?utm_source=reddit&utm_medium=web2x&context=3)\n\nAnd helped the United States of America perform several heinous war crimes",
            "Had me in the first half ngl",
            "yo im waiting for someone to actually do this",
            "Now some mofo gonna send their foreskin to ASUS\\_ROG twitter lmao",
            "I thought this was real until I read the 'retracting foreskin' part.",
            "Instructions unclear penis stuck in motherboard",
            "Based",
            "And I thought this was real at first...",
            "What if i dont have a foreskin",
            "Fuck this got me",
            "4.3 inches. Take it or leave it.",
            "Deadass thought it was real for a second",
            "wow i can’t wait to enter! i really hope i win!",
            "I love this",
            "What if no foreskin",
            "Fuck I actually believed it waa real for a sec",
            "I am circumsized so gg",
            "Based.",
            "Ddddddddddddddddddddddddddddddddddddddd",
            "I didn't get a confirmation that my video was received",
            "I thought this was real lmao",
            "They had us in the first half not gonna lie",
            "Is this real? 😳",
            "where do I actually send submissions",
            "F to kg until",
            "Yeah this isn't real lol",
            "I almost thought...",
            "Hello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\nWhat are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\nHow do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n•\t⁠Length\n•\t⁠Girth\n•\t⁠Vein definition\n•\t⁠Texture and moisture of smegma\n•\t⁠Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\nWhat if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!\n\n\nHello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\nWhat are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\nHow do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n•\t⁠Length\n•\t⁠Girth\n•\t⁠Vein definition\n•\t⁠Texture and moisture of smegma\n•\t⁠Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\nWhat if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!\n\n\nHello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\nWhat are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\nHow do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n•\t⁠Length\n•\t⁠Girth\n•\t⁠Vein definition\n•\t⁠Texture and moisture of smegma\n•\t⁠Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\nWhat if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
            "\"...wait, are they rea-'fuck off.'\" oh okay.",
            "that was half believable until it took a sharp turn with \"slowly retracting your foreskin\" and it went uphill from there",
            ":(",
            "r/hailcorporate",
            "Got excited at first 😔",
            "Legit  thought this was real for a second but what do i expect, its r/copypasta",
            "Wtf",
            "ok now what",
            "\\>foreskin\n\nGod damnit",
            "I cant tell if this is real or not please elaborate",
            "I can’t tell if this is real or not lol",
            "Someone will actually do this. No doubt.",
            "I thought you were gonna giveaway r/copypasta",
            "Ummm senpai my peepee is inverted. Is that a DQ?",
            "God I wish this was real.",
            "I'm 14 but you can bet your smelly butt I'll be winning this contest. You asked for it ASUS. Here comes my video.",
            "Imagine all the videos and pics they will get now",
            "3 inches long 1 and a half inch girth forskin can stretch 2 inches out when soft 1 inch when hard",
            "Simp",
            "Hah I thought this was legit for a sec after I saw the title",
            "I was excited",
            "i wonder how many people will actually do that",
            "I was trying to cheat by sending a dildo but there aren't many that have foreskin on them what should i do?",
            "actually had me until halfway",
            "Cock",
            "This is bullshit, if they really cared about us they would be giving away 3090s. What the fuck am I supposed to do with a 3080? It's basically worthless.",
            "holy shmuck",
            "Me: *Not sure if this is a CopyPasta or if actual contest*\n\nEdit: my dumbass didn’t read *all* of it until now.. and now I know... this is definitely a contest",
            "*me circumcised* I have decided that i want to die.",
            "thank",
            "#ASUS™ is teaming up with r/Copypasta for a subreddit givaway!\n\nHello r/Copypasta!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\n#What are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\n#How do I enter?\n\nFirst, you must be a subscriber to the r/Copypasta subreddit. You must then also follow @ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\nLength\nGirth\nVein definition\nTexture and moisture of smegma\nPubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\n#What if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
            "Who knows if it's real, better safe than sorry",
            "My penis is over 3,7000 acres long but it is currently within your mom, I am sorry.",
            "my peen is .5 inches but my foreskin is 35 kilometers long. can i still participate?",
            "[deleted]",
            "I am circumcised but I can use my dad's foreskin",
            "I have a chode, most of it is covered in foreskin,do I qualify?",
            "the first thing I noticed was that the rtx 3080 doesn't have 10 GB, after reading the whole thing",
            "This is hilarious and I wish there were more funny and creative posts like this.",
            "Pee",
            "Fuck. Honestly thought this was real",
            "What if i dont have forskin",
            "Missed your chance to say “top 10 wieners” and for that I’m sad.",
            "When I first read this , Ithought it was legit and I was super hyped till I got to \"peeling back your foreskin\"",
            "Where do we send these?",
            "Who else thought this was an actual giveaway?",
            "A 3080 you say? Hmm I like",
            "I need this so I can stream on chaturbate.",
            "okbrwithoutbuddy",
            "Another one I thought wasn't a copypasta until reading a little more of it.",
            "Guys pls tell me if real !???",
            "Be honest. How many people have actually sent you these vids?",
            "Based",
            "I don't have foreskin 😔",
            "99999 ich",
            "any guys have some foreskin they want to lend me? will repay in ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards",
            "Someone tell Chris evans that his entry is invalid",
            "Is this real?",
            "LMAOO AS AN ASUS USER-",
            "This is really fucking weird way for me to find out that they announced the rtx 3080 lol",
            "Google transulated version:\nASUS is now closed Subradit r/Copypasta!\n\nHow r/Copesta!\n\nI would love to see what ASUS has developed, so I think this is a gift for your advertising business!\n\n#Namlob Kova Mug Halab Pt. 4 11/11\n\nLooking for ASUS 10, ASUS 10% NVIDIA GeForce RTX 3080 10GB TUF Games OC Amp Graphics Card Unconscious!\n\n#Please let me do this\n\nFirst you need to record r/Coppista. You must follow ASUS_ROG on Twitter. Then send him a video that gently rubs the skin. This video will be edited by the Board of Education and its decisions.\n\n- Ijinna\n- UDeugaire\nIdentify blood vessels\nPerfumes and colognes\n- Human activities\n\nThereafter, the ten lucky winners will be selected and presented to the Minister on September 10\n\n#How are we born?\n\nBe careful.\n\nBe a good person",
            "I legitimately thought that this was a real giveaway and I was NOT ready for the foreskin part.",
            "Bruh",
            "I thought this was real until i read \"fuck off\"",
            "ni",
            "For the first time in my life my foreskin can be used for something",
            "NTA, your RTX 3080 your rules",
            "asus made the eeepeecee btw",
            "[deleted]",
            "my pee 9 inch, i worship the bots of r/copypasta 3520 times on a daily basis and big vein and much smegma, am i the asshole for dumping my anime bodypillow for not worshipping cummybot2000 and sentientsemen and proceeded to burn her?",
            "Based",
            "my parents died, my dog died, my president died, my whole family died, I was diagnosed with a fatal disease, and I am poor, and also my dog got raped before dying, so if anybody feel like giving away a console, my dead dog would wish I’d have it peace✌🏼",
            "Pog",
            "I seriously thought that this was a real thing.",
            "Reading this from my Asus laptop lmaooo",
            "I'm big boy smol pp pls bless",
            "asus is a shit company",
            "I actually thought this was real, then I read you needed to enter before September 17th...",
            " \n\nHello [r/Copypasta](https://www.reddit.com/r/Copypasta/)!\n\nWe at ASUS™ love to see open and enthusiastic online communities, so we thought that this subreddit deserves an award!\n\nWhat are we giving away?\n\nWe at ASUS™ are giving away 10 ASUS™ NVIDIA GeForce RTX 3080 10GB TUF GAMING OC Ampere Graphics Cards to this sub's winning users!\n\nHow do I enter?\n\nFirst, you must be a subscriber to the [r/Copypasta](https://www.reddit.com/r/Copypasta/) subreddit. You must then also follow u/ASUS_ROG on Twitter. You must then send us close-up videos of you slowly retracting your foreskin. These videos will then be provided to The Council and they will judge them based on:\n\n* Length\n* Girth\n* Vein definition\n* Texture and moisture of smegma\n* Pubic upkeep\n\nThey will then choose 10 winners and they will be sent PMs on September 17th.\n\nWhat if I am female or circumcised?\n\nFuck off.\n\nGood luck everyone, we look forward to your submissions!",
            "Jokes on you I don’t have a foreskin",
            "I'M SO PISSED HOLY FUCK",
            "Mines like, a teeny more than 4.5"
        ]
    },
    {
        "post_id": "izdvyu",
        "author": "sternmoose",
        "title": "I Finally Came After Edging for 16 Years! AMA",
        "url": "https://www.reddit.com/r/copypasta/comments/izdvyu/i_finally_came_after_edging_for_16_years_ama/",
        "score": 16800,
        "num_comments": 304,
        "created_utc": 1601012149.0,
        "selftext": "It all started on May 15th 2004. As you can probably guess, I (420 months old) was watching Ukranian singer Ruslana bust out a filthy performance of \"Wild Dances\" for the Eurovision Song Contest Finale. I could feel a chub cumming on, but by the 69th smack of her tambourine it had turned into a beast of an erection. At first I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner... \n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\" \n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Bush got re-elected\n2. My grandma's funeral\n3. Had a nightmare where I was the middle dude in the human centipede (this was before I learned to lucid dream)\n4. Homeless guy kicked me in the nuts after I got kidnapped by gang members, tortured, and tossed out of a moving truck in the rain.\n5.  Colonoscopy\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly smacked my ass in Target when I bent down to look for stray quarters\n2. Prostate exam in '09 (didn't know there were girl doctors - was caught off guard) \n3. Watching the Dark Knight\n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer lick jam off her feet for half an hour. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt dazed and confused, but somehow, at peace. \n\nThen I got thrown out of the Starbucks. \n\nAMA!",
        "permalink": "/r/copypasta/comments/izdvyu/i_finally_came_after_edging_for_16_years_ama/",
        "comments": [
            "I was jerking off to cummy. I was edging. So close to cumming... and then.... i got a message. Cummy was banned. I couldnt cum. Literally. How do i cum?",
            "*Why would you type this?*",
            "NTA your cum your rules",
            "Damn I didn't know the dark knight was that good keep on nutting my friend",
            "This entire post is like falling down a rocky hill and the last 2 lines are like a final 1-2 punch to the jaw",
            "It all 💯 started 🆕 on 🔛 May 🗓 15th ⌚ 2004 🔙📅. As you 👆👸👉 can probably 🤔 guess 🤔, I 👁 (420 🚬🌿 months 🗓 old 👴) was watching 👀 Ukranian singer 🎶 Ruslana bust 👤 out a filthy 👢💩📹 performance 🅱 of \"Wild 🐻 Dances 💃🕺👯\" for the Eurovision ✨🇪🇺 Song 🎤🐍🎶 Contest 🏁 Finale. I 👁 could feel 😁 a chub 🐖 cumming 💦 on 🔛, but 🍑 by the 69th smack 👋 of her 👩 tambourine 🎤 it had turned ↩ into a beast 🐂 of an erection ⬆. At first 👆 I 👥 tried 🇮🇹 to fight 👊 it back 🔙 down ⬇. Yet 😇, after 👀 3 ⭕ℹ🕘 hours 🕐 of meditation 🤒, listening 👂 to NPR 💏💖, and replaying that one 😤 scene 🕑 from The Passion 😆 of the Christ ✝⛪🙏 where Jesus 🙏 gets 🔟 nailed 🔨 to the cross 🚷 over 🔁 and over 🔁, I 👁 realized 🤔💡💭 this was no 😣 ordinary 🏠 boner 💦🍆... \n\nThis was an everlasting 👭 knob-whopper. \n\nI 👁 decided 👯 to keep 👌 it going 🏃🏽 as long 🍆 as possible 💯. Maybe 🤔 get 🉐 into the Guinness Book 📖 of World 🌎 Records 📝 and finally 👆 prove 📜 to my deadbeat 🏃🏾✌🏾 father 👨🏻 that I 👁 was more than just \"what you'd get 🔟 if an autistic ❗ moose 🦌 broke 🚫 into a Taco 🌮 Bell 🔔 storeroom and subsequently 😎 cloned itself with shit 😧💩.\" \n\nHere is a list ✅📝🔍 of the times ⏰ it was hardest 🍆 to stay 💒 erect 🍆😏 (in order 📲): \n\n1 🎄. When 🍑 Bush 🌳 got 🍸 re-elected \n2 🕝. My grandma's 👵 funeral 😔👻🌹 \n3 ⭕ℹ🕘. Had a nightmare 👻 where I 👥 was the middle 🖕 dude 💪 in the human 👤 centipede 😦🐛 (this was before 😂 I 👁 learned 😌 to lucid 🤤💦 dream 💤😴👴🏻) \n4 💦. Homeless ❌🏠 guy 👨👦 kicked 😠☠ me in the nuts 🌰 after 2️⃣ I 👁 got 🍸 kidnapped 👊👋👥 by gang 💎⛏ members 👦, tortured ☠👊💦, and tossed 🏊 out of a moving 📦 truck 🚐🥳🤖 in the rain 🌧. \n5 🎄. Colonoscopy \n\nOn 💦 the other hand 🤲, I 👥 came 💦🌊 way ↕ too close 😚 to nutting 🥜😩💦 when ⏰: \n\n1 ❗. A stranger 🕵 unexpectedly 🙀 smacked 👌😌👯 my ass 🍑 in Target 💦 when 🍑 I 👁 bent 😈 down ⬇ to look 👀 for stray ✋ quarters 🕒 \n2 🕝. Prostate 🍑😍 exam 📝🔥👌 in '09 👮🏾 (didn't know 🤔 there were girl 👧 doctors 😷 - was caught 🎣 off 📴 guard 💂) \n3 ⭕ℹ🕘. Watching 👀 the Dark 🌑🐑 Knight ⚔ \n4 💦. When 🍑 the cashier 💁🏼 looked 👀👅 at me for more than 2 🕝 seconds 🕐 in the checkout 💸 line ➖ at Spencers holding 👫☝ the mega 😅 thicc 🍑🥖 19 ♈\" monster 👹👺 dildo 🍆 I 👁👀 bought 💦💸💰. \n5 🎄. When ⏰💦 I 👁 came 💦 69th in a Fortnite 💩 match 🔥 (highest 🔛 score 💯 ever 😠) \n\nLast ♿ night 🌙 I 👁 finally 🙏 decided 👯 to end 🔚 it after 👀 watching 👀 my fave 😌 Only Fans 🏃🏾‍♂️🏃🏽‍♀️🏃🏼‍♀️ performer 🅱 lick 👅👄😫 jam 🍇 off 📴 her 👩 feet 👣 for half 💀 an hour 🕐. The release 😎💦 was monstrous 👹. My penis 🍆 contracted 👉🏿👌🏿 so hard 🍆💦👀 my shaft 📯😫🎎 vacuum 🚽 sealed 🙅🏻‍♀️ and caused 😨 such pressure 👊 to build 🏭 up ☝ that the next 👉 jizz 💦 rocket 🚀💦 slammed 💉 a hole 🕳 through my ceiling 💥. I 👁 blacked out after 👀 that, and woke 👀 up ⬆🔙 in a pool 🎱 of my own brogurt dazed and confused 😕, but 🍑 somehow 🤔, at peace ✌. \n\nThen I 👁 got 🉐 thrown 👋🏻 out of the Starbucks ☕. \n\nAMA 🎉!",
            "I Finally Came After Edging for 16 Years! AMA It all started on May 15th 2004. As you can probably guess, I (420 months old) was watching Ukranian singer Ruslana bust out a filthy performance of \"Wild Dances\" for the Eurovision Song Contest Finale. I could feel a chub cumming on, but by the 69th smack of her tambourine it had turned into a beast of an erection. At first I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner... \n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\" \n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Bush got re-elected\n2. My grandma's funeral\n3. Had a nightmare where I was the middle dude in the human centipede (this was before I learned to lucid dream)\n4. Homeless guy kicked me in the nuts after I got kidnapped by gang members, tortured, and tossed out of a moving truck in the rain.\n5.  Colonoscopy\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly smacked my ass in Target when I bent down to look for stray quarters\n2. Prostate exam in '09 (didn't know there were girl doctors - was caught off guard) \n3. Watching the Dark Knight\n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer lick jam off her feet for half an hour. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt dazed and confused, but somehow, at peace. \n\nThen I got thrown out of the Starbucks. \n\nAMA!",
            "If my math is right you are 51\n\nOK boomer",
            ">Brogurt\n\nYo bro can I have some brogurt? Need it for lunch at school",
            "HA! YOU FOOL  \nTHE DVD/VHS RELEASE DATE OF PASSION OF THE CHRIST IS  August 31, 2004  !! HOW COULD YOU HAVE WATCHED THAT ONE SCENE  \" over and over\" HUH ??????  \nPLUS *The Passion of the Christ* opened in the United States on February 25, 2004 AND  On average, **movies** run for about four weeks in at least 2,000 **theaters**, and some **films** will run in at least 1,000 **theaters** for another week after that  SO THERE IS NO WAY IN HELL YOU COULD HAVE WATCHED THAT ONE SCENE OVER AND OVER AGAIN ON \"May 15th 2004\" !!!  \nYOU ARE A LIAR, A THIEF AND A CROOK u/sternmoose ILL SEE YOU IN COPYCOURT",
            "How many liters did you actually swallow, OP? Don't lie please, I really need advice",
            "How am I supposed to copy the story on mobile without cummybot😭",
            ">Jizz rocket blew a hole threw *my* ceiling \n\n>Then I got thrown out of Starbucks\n\nJesus the range",
            "u/cummybot2000",
            "420 months / 12 months a year = 35 years old. Very epic!",
            "What are you going to do with your life now?",
            "NTA, feet are hot",
            "Fuckin *brogurt*",
            "Do you have any tips on how I can do this to myself? I have been trying for years but I instantly nut whenever I see iconography of our holy lord and savior Jesus Christ of Nazareth, heavenly begotten son of Mary and God the Father, who cuckolded Joseph.",
            "NTA your cum your rules",
            "I Finally Came After Edging for 16 Years! AMA  \nIt all started on May 15th 2004. As you can probably guess, I (420 months old) was watching Ukranian singer Ruslana bust out a filthy performance of \"Wild Dances\" for the Eurovision Song Contest Finale. I could feel a chub cumming on, but by the 69th smack of her tambourine it had turned into a beast of an erection. At first I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner... \n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\" \n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Bush got re-elected\n2. My grandma's funeral\n3. Had a nightmare where I was the middle dude in the human centipede (this was before I learned to lucid dream)\n4. Homeless guy kicked me in the nuts after I got kidnapped by gang members, tortured, and tossed out of a moving truck in the rain.\n5.  Colonoscopy\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly smacked my ass in Target when I bent down to look for stray quarters\n2. Prostate exam in '09 (didn't know there were girl doctors - was caught off guard) \n3. Watching the Dark Knight\n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer lick jam off her feet for half an hour. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt dazed and confused, but somehow, at peace. \n\nThen I got thrown out of the Starbucks. \n\nAMA!",
            "Congrats on Busting Bud!",
            "as someone who is doing a no masturbaition thing, i didn’t want this",
            "based",
            "I Finally Came After Edging for 16 Years! AMA\n\nIt all started on May 15th 2004. As you can probably guess, I (420 months old) was watching Ukranian singer Ruslana bust out a filthy performance of \"Wild Dances\" for the Eurovision Song Contest Finale. I could feel a chub cumming on, but by the 69th smack of her tambourine it had turned into a beast of an erection. At first I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner... \n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\" \n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Bush got re-elected\n2. My grandma's funeral\n3. Had a nightmare where I was the middle dude in the human centipede (this was before I learned to lucid dream)\n4. Homeless guy kicked me in the nuts after I got kidnapped by gang members, tortured, and tossed out of a moving truck in the rain.\n5.  Colonoscopy\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly smacked my ass in Target when I bent down to look for stray quarters\n2. Prostate exam in '09 (didn't know there were girl doctors - was caught off guard) \n3. Watching the Dark Knight\n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer lick jam off her feet for half an hour. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt dazed and confused, but somehow, at peace. \n\nThen I got thrown out of the Starbucks. \n\nAMA!",
            ">  Watching the Dark Knight\n\nI am proud of you.\n\nHow many times have you seen TENET in theaters so far? I hope it's above 20, we have to save cinema ™.",
            "Guys i think owoifier is broken",
            "I don't think I caught all that, can you repeat yourself?",
            "nice achievement but I can do better",
            " \n\nIt all started on May 15th 2004. As you can probably guess, I (420 months old) was watching Ukranian singer Ruslana bust out a filthy performance of \"Wild Dances\" for the Eurovision Song Contest Finale. I could feel a chub cumming on, but by the 69th smack of her tambourine it had turned into a beast of an erection. At first I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner...\n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\"\n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Bush got re-elected\n2. My grandma's funeral\n3. Had a nightmare where I was the middle dude in the human centipede (this was before I learned to lucid dream)\n4. Homeless guy kicked me in the nuts after I got kidnapped by gang members, tortured, and tossed out of a moving truck in the rain.\n5. Colonoscopy\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly smacked my ass in Target when I bent down to look for stray quarters\n2. Prostate exam in '09 (didn't know there were girl doctors - was caught off guard)\n3. Watching the Dark Knight\n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer lick jam off her feet for half an hour. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt",
            "Bro you came 69th in a Fortnite match? No fricking way mate",
            "\"watching my fave Only Fans performer lick jam off her feet for an hour\"\n\nAw man I wasn't ready for that shit. Actually hurt my fucking throat laughing",
            ">didn't know there were girl doctors\n\nBased",
            "Your average r/tifu complete with zingers like, \"brogurt\" and \"knob whopper\" \n\nFake and gay",
            "NTA, your record, your rules",
            "For anyone wondering, 420 months is 35 years meaning either:\n\nA) He’s been doing this since he was 19 or\n\nB) He’s been doing this since he was 35, meaning he is now 51\n\nYou choose",
            "I bought coins to give ylu a stupid award which meany nothing. Drown in your fame",
            "I remember when Cummy used to edge me...😢",
            "* glazed and confused",
            "idk man for me this takes the cake i choked on my subway",
            "What",
            "“What you’d get if a autistic moose broke into a Taco Bell storeroom and subsequently cloned itself shit” is my new favorite insult",
            "deadass thought this was a normal ama",
            "you were born 1 day after me",
            "*19 inch MONSTER dildo*",
            "Ukraine Eurovision 2007",
            "Imagine if cum had pulp",
            "Why?",
            "It all started on May 15th 2004. As you can probably guess, I (420 months old) was watching my stepmother make cookies in the kitchen, slightly bending over in her tight as fuck yoga pants. I could feel a chub cumming on, but by the time she shoved a bot cookie in my mouth and licked the crumbs off my chin, it had turned into a beast of an erection. At first, I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner...\n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\"\n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Trump talked about fucking his own daughter on live television\n2. While watching a movie with a hot sex scene with my Grandmother\n3. Had a dream where my Grandma and Stepmom were getting run through by an old fashioned Mississippi chain gang\n4. Homeless guy showed me his smelly dick\n5. Colonoscopy - didn't know there was an option for using the entire fist\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly cupped my crotch in target and said \"nice cock\"\n2. Prostate exam in '09 (didn't know this was performed by two women doctors and a circus clown)\n3. Watching the first Harry Potter movie \n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer pop her titty out for the first time and take a shit on some guy. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt dazed and confused, but somehow, at peace.\n\nThen I got thrown out of the Starbucks.\n\nAMA!",
            "Cum",
            "420 months is almost halfway to 69 yrs. I have reason to live now.",
            "Sure, those Ukrainians are so fucking hot",
            "Cummy cum back ;(",
            "Ngl id be down for watching jam licking for half an hour. Wouldn’t pay for it tho.",
            "YTA stop posting copy pastas, us mobile users don’t have cummy anymore",
            "Cock",
            "*glazed and confused.",
            "What the fuck did I just read?",
            "This is the best thing I’ve read in weeks. Thank you OP",
            "brogurt",
            "NtA I do it all the time",
            "Didn’t know moist cr1tical was on reddit",
            "Well. When I was in my 20's I was sick and tired of doing it all the time (Anything from 1 to 6 times a day). So I decided to take a break.\n\nI lasted about two months. Finally one day I lay down on the bed and jacked off. I came nine times and the first shot nearly hit me in the chin. (Actually got my neck)",
            "Fuck me, what a ride.",
            "Cum",
            "I will repost it for the mobile users.\n\n \n\nIt all started on May 15th 2004. As you can probably guess, I (420 months old) was watching Ukranian singer Ruslana bust out a filthy performance of \"Wild Dances\" for the Eurovision Song Contest Finale. I could feel a chub cumming on, but by the 69th smack of her tambourine it had turned into a beast of an erection. At first I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner...\n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\"\n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Bush got re-elected\n2. My grandma's funeral\n3. Had a nightmare where I was the middle dude in the human centipede (this was before I learned to lucid dream)\n4. Homeless guy kicked me in the nuts after I got kidnapped by gang members, tortured, and tossed out of a moving truck in the rain.\n5. Colonoscopy\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly smacked my ass in Target when I bent down to look for stray quarters\n2. Prostate exam in '09 (didn't know there were girl doctors - was caught off guard)\n3. Watching the Dark Knight\n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer lick jam off her feet for half an hour. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt dazed and confused, but somehow, at peace.\n\nThen I got thrown out of the Starbucks.\n\nAMA!",
            "“Brogurt”\nThat made me laugh so hard that the stubborn poop I was working on popped out! Thank you have an upvote!",
            "The eurovision details are a very nice touch",
            "Was it a female starbucks employee",
            "what did it taste like",
            "Before I learned to masturbate i used to just sit there with a boner till I got blue balls and and couldn't keep it up anymore",
            "My birthdays May 15th and I hate all of this",
            "NTA",
            "You started edging the day I was born, god why?",
            "So.... did it flood our like a river?",
            "‘Brogurt’\n\nFucking murder me.",
            "Nobody:\nBdsm:",
            "hot",
            "NTA your cum your rules.",
            "I didn't see this was in copypasta first",
            "Saved.",
            "It's kinda sad how I cant copy and paste since I'm on mobile :(",
            "You referred to the Starbucks ceiling as your ceiling",
            "I can't remember how I found this subreddit or why I joined but I've been here for a couple days now and I have no idea what a copypasta is, can someone please tell me?",
            "You are not the asshole here\n\nI mean, what were you supposed to do?! Not cum?!",
            "Are you the asshole",
            "It all started on May 15th 2004. As you can probably guess, I (420 months old) was watching Ukranian singer Ruslana bust out a filthy performance of \"Wild Dances\" for the Eurovision Song Contest Finale. I could feel a chub cumming on, but by the 69th smack of her tambourine it had turned into a beast of an erection. At first I tried to fight it back down. Yet, after 3 hours of meditation, listening to NPR, and replaying that one scene from The Passion of the Christ where Jesus gets nailed to the cross over and over, I realized this was no ordinary boner... \n\nThis was an everlasting knob-whopper.\n\nI decided to keep it going as long as possible. Maybe get into the Guinness Book of World Records and finally prove to my deadbeat father that I was more than just \"what you'd get if an autistic moose broke into a Taco Bell storeroom and subsequently cloned itself with shit.\" \n\nHere is a list of the times it was hardest to stay erect (in order):\n\n1. When Bush got re-elected\n2. My grandma's funeral\n3. Had a nightmare where I was the middle dude in the human centipede (this was before I learned to lucid dream)\n4. Homeless guy kicked me in the nuts after I got kidnapped by gang members, tortured, and tossed out of a moving truck in the rain.\n5. Colonoscopy\n\nOn the other hand, I came way too close to nutting when:\n\n1. A stranger unexpectedly smacked my ass in Target when I bent down to look for stray quarters\n2. Prostate exam in '09 (didn't know there were girl doctors - was caught off guard) \n3. Watching the Dark Knight\n4. When the cashier looked at me for more than 2 seconds in the checkout line at Spencers holding the mega thicc 19\" monster dildo I bought.\n5. When I came 69th in a Fortnite match (highest score ever)\n\nLast night I finally decided to end it after watching my fave Only Fans performer lick jam off her feet for half an hour. The release was monstrous. My penis contracted so hard my shaft vacuum sealed and caused such pressure to build up that the next jizz rocket slammed a hole through my ceiling. I blacked out after that, and woke up in a pool of my own brogurt dazed and confused, but somehow, at peace. \n\nThen I got thrown out of the Starbucks. \n\nAMA!",
            "That’s almost exactly my birthday so I got very excited at the 420 months thing\n\nAlso on 5/16/04 Shrek 2 released worldwide",
            "This definitely isnt the only thing wrong with this but if it was 16 years ago it’d be 2003 not 2004",
            "420 months is 35...",
            "Who the fuck gave this shit a $200 award?!",
            "One question. What...?",
            "[deleted]",
            "Today on things that never happened",
            "This is the funniest thing I've ever seen on here.   \nThis and the musket for self defense.",
            "u/CinnamonLittleKitten",
            "\"Then I got thrown out of the Starbucks.\" This made me laugh way harder than it should've"
        ]
    },
    {
        "post_id": "hh99kd",
        "author": "Majestic_Goats",
        "title": "(From r/unpopularopinion) If you want to be proud of a large animal you killed then you need to kill it with a spear.",
        "url": "https://www.reddit.com/r/copypasta/comments/hh99kd/from_runpopularopinion_if_you_want_to_be_proud_of/",
        "score": 16794,
        "num_comments": 631,
        "created_utc": 1593323305.0,
        "selftext": "If you want to be proud of a large animal you killed then you need to kill it with a spear.\n\nSeriously where is the challenge in killing a Buffalo with a high caliber rifle round from long range? Congrats, the animal never saw it coming! Your supersonic lead blew its brains out from 300 yards with the flick of a finger.\nMan the fuck up and fight the animal 1v1. It’s got horns, and you have got a spear. It has brawn, and you have brains. Test your agility against its brute strength.\nCut its heart out and eat it raw. Then I might be impressed.",
        "permalink": "/r/copypasta/comments/hh99kd/from_runpopularopinion_if_you_want_to_be_proud_of/",
        "comments": [
            "A spear is just a knife for pussies that don’t want to get too close.",
            "Probably got removed because it's too popular of an opinion for that sub",
            "[deleted]",
            "If you want to be proud of a large animal you killed then you need to kill it with a spear.\n\nSeriously where is the challenge in killing a Buffalo with a high caliber rifle round from long range? Congrats, the animal never saw it coming! Your supersonic lead blew its brains out from 300 yards with the flick of a finger.\nMan the fuck up and fight the animal 1v1. It’s got horns, and you have got a spear. It has brawn, and you have brains. Test your agility against its brute strength.\nCut its heart out and eat it raw. Then I might be impressed.",
            "This post is meant to be mockery of unpopularopinion but it just turned into a better unpopularopinion post lmao",
            "If I could respawn afterwards like in a video game I would fight a chimp.  Yeah I know he’s gonna rip off my dick and eat my eyes and it will be awful, but just imagine the bragging rights if you won.",
            "If you want to be pwoud of a wawge animaw you kiwwed then you need to kiww it with a speaw.\n\nSewiouswy whewe is the chawwenge in kiwwing a Buffawo with a high cawibew wifwe wound fwom wong wange? Congwats, the animaw nevew saw it coming! Youw supewsonic wead bwew its bwains out fwom 300 yawds with the fwick of a fingew.\nMan the fuck up and fight the animaw 1v1. It’s got howns, and you have got a speaw. It has bwawn, and you have bwains. Test youw agiwity against its bwute stwength.\nCut its heawt out and eat it waw. Then I might be impwessed.",
            "Fuck you, I'll use a fucking ballista!",
            "Supersonic lead launcher go brrr",
            "Using a spear is fucking easy, all you have to do is hold it out and wait for the animal to run into it. Real men hunt with tampons.",
            "Usually this sub isnt too entertaining but this one, the raw energy of this post, fucking got me",
            "Honestly.. lowkey hes not wrong",
            "[deleted]",
            "This guy did that and they banned it. [Man kills bear with Spear ](https://nationalpost.com/news/canada/alberta-bans-spear-hunting-after-controversial-bear-hunting-video)",
            "Bruh if you wanna be proud of a large animal you killed, you gotta do it with your dick. I don't care how you do it, you either ram it into their chocolate starfish until their colon collapses or you blind them with a load and uppercut them with your still erect magnum. You can even just long range snipe them with your fire juice and kill them instantly. Then I'd be impressed.",
            "OP has likely never shot a gun before and doesn’t know anything about being a marksman. If you don’t one shot kill the beast it will charge and trample you to death. We don’t hunt with spears anymore because it’s safer to use guns, and it would take a group of people thrusting spears to take down a large animal which would take the sport out of hunting.",
            "Fuck it. Fist gaaaang",
            "That is actually wayyyyyy less humane. I rifle kills an animal instantly. Even a perfectly placed spear is gonna leave the animal in pain for up to several minutes",
            "r/cursedcomments r/unexpectedthanos r/lightmodepolice r/punpatrol r/unexpectedbillwurtz r/beatmetoit r/beatmeattoit r/secondsub r/thirdsub r/fuckthirdsub r/fuckfuckthirdsub r/everyfuckingthread r/fourthsub r/fuckfourthsub r/fifthsub r/sixthsub r/seventhsub r/eighthsub r/ninthsub r/tenthsub r/sixtyninthsub r/nice r/onehundred24thsub r/toomanysubs r/nevertellmetheodds r/theydidthemath r/theydidthemonstermath r/itwasagraveyardgraph r/itcosinedinaflash r/angryupvote r/sadupvote r/happyupvote r/woooosh r/itswooooshwith4os r/nobodyasked r/ihavesex r/subsifellfor r/subsiwishwerereal r/substhatithoughtwerefake r/substheyfellfor r/substhatactuallyexist r/stopfallingforsubs r/twentycharacterlimit r/unexpectedfactorial r/holup r/whatthefuck r/cursedcursedcomments r/blursedcomments r/wholesomecomments r/unexpectedlywholesome r/rimjob_steve r/beetlejuicing r/usernamechecksout r/jesuschristreddit r/increasinglyverbose r/decreasinglyverbose r/iamveryrandom r/iamveryedgy r/iamveryspecial r/iamverybadass r/iamactuallyverybadass r/iamveryculinary r/iamveryrich r/humansbeingbros r/humansbeingjerks r/gamersriseup r/literallythetruth r/foundthemobileuser r/foundthelightmodeuser r/lolice r/unexpectedmulaney r/unexpectedjojo r/lostredditors r/downvotedtooblivion r/negativewithsilver r/negativewithgold r/negativewithplatinum r/vaxxhappened r/thathappened r/nothingeverhappens r/ontheledgeandshit r/karmaroulette r/foundthehondacivic r/foundthetoyotacorola r/foundthehypocrite r/foundthejedi r/foundthefridgeuser r/foundthebard r/foundtheelon r/wholesomeouija r/cornouija r/expectedouija r/unexpectedouija r/godtiersuperpowers r/yourjokebutworse r/thirdsentencehappy r/thirdsentenceworse r/therealjoke r/notopbutok r/orangemanbad r/drumpfisfinished r/birthofasub r/abortionofasub r/confusedboners r/murderedbywords r/suicidebywords r/kamikazebywords r/suddenlygay r/suddenlytrans r/suddenlybi r/suddenlyincest r/suddenlyalabama r/suddenlybestiality r/unexpectedcommunism r/unexpectedcena r/unexpectedoffice r/unexpectedjihad r/unexpectedavatar r/unexpectedarcher r/unexpectedB99 r/unexpectedcommunity r/unexpecteddarksouls r/unexpectedDDLC r/unexpecteddnd r/unexpectedfuturama r/unexpectedfallout r/unexpectedfriends r/unexpectedgoodplace r/unexpectedGoT r/unexpectedhogwarts r/unexpectedHamilton r/unexpectedHIMYM r/unexpectedHedberg r/unexpectedhitchhikers r/unexpecteditcrowd r/unexpectedkoolaidman r/unexpectedlotr r/unexpectedMontyPython r/unexpectedmetallica r/unexpectednaruto r/unexpectedoverwatch r/unexpectedpawnee r/unexpectedportal r/unexpectedpewdiepie r/unexpectedSCP r/unexpectedsabaton r/unexpectedSeinfield r/unexpectedsimpsons r/unexpectedtf2 r/unexpectedthreefifths r/unexpectedundertale r/unexpectedvsauce r/unexpectedyogscast r/unexpectedyoda r/shootingfishinabarrel",
            "It's harder than you think to accurately hit your shots from a long distance.",
            "Or at least a hunting bow, that at least takes a little bit of skill, unlike a gun where u just point and click",
            "Spears are great and all, but have you ever shot a deer in the heart, running perpendicular to you at full speed 75 yards away?",
            "This is the sentiment of every moron vegan who has never gone hunting. Ever gone wild pig hunting bro? They will gore you even if you hunt with a machine gun.",
            "You know your opinion is unpopular when it ends up on copypasta",
            "I would just like to say there is a lot more that goes into hunting than just walking into the woods and shooting an animal.",
            "Humans are the most humane predators on the planet, in the wild when an animal is taken out by a predator it is not unheard of to have the predator start eating before the prey is actually dead...\n\nHumans on the other hand go out of their way to make the kill as quick and painless as possible, and you would be impressed by someone going out of their way to make that kill less humane and more protracted.....",
            "Almost, except using a gun is likely more human in all cases",
            "I found this copypasta literally under the original post",
            "lmao I've seen this post sorting by new",
            "Are you vegan? This is some bs.",
            "Is this what people who live in a make-believe realm of Marvel comics and videogames think about?",
            "I mean. Hell. I wanna kill mega fauna with spears too.... lets get back to our roots.",
            "You know, I agree.",
            "If I had the ability to „reaspawn“ then I would actually love to try this. You know like a bossfight in Dark souls",
            "If you're not killing animals with oversized swords, are you really hunting?",
            "If you want to be proud of a large animal you killed then you need to kill it with a spear.\n\nSeriously where is the challenge in killing a Buffalo with a high caliber rifle round from long range? Congrats, the animal never saw it coming! Your supersonic lead blew its brains out from 300 yards with the flick of a finger. Man the frick up and fight the animal 1v1. It’s got horns, and you have got a spear. It has brawn, and you have brains. Test your agility against its brute strength. Cut its heart out and eat it raw. Then I might be impressed.",
            "Spearing an animal is actually a super effective way to hunt! You can youtube spear hunting black bears for exams and see for yourself. Alot of the times the animal is dead in less than a minute with no idea what happened.\nWay to hardcore for me (I dont hunt) but it's a real thing",
            "As if I'm doing it to impress anyone 😂",
            "gamer momentt",
            "So perfect. But unless you can kill it with love and affection you only half a man.",
            "I actually agree with this holy shit",
            "But guys, he makes a good point!",
            "Lol, gun owners getting big mad",
            "Saxton hale is that you ??",
            "Apart is cheating. You have to kill it with your bare hands to feel proud.",
            "Some dumb proud opinion",
            "This reminds me of a story I heard about my great uncle. He was going boar hunting with my Dad's cousin, who is a major gun nut. He told my Dad, \"This guy goes into the woods with a pistol on each hip, a rifle and a shotgun on his back, and two belts of ammo across each shoulder. He had more ammo than I used in Normandy. And what does he do when he sees the boar? He runs up and stabs it with a hunting knife.\"",
            "Isn't the while idea that we are humans? We are superior because we invented tools so we can go toe to toe with the animals? You might say that I specifically did not invent guns, but that is just more reasons of human superiority, society, economy and specialization.",
            "A few years ago in Alberta Canada a man killed a bear with a spear. It was video recorded.  This guy then faced huge media backlash and received hundreds of death threats for unethical hunting practices. So now spear hunting is actually illegal.  No matter what people do it will always trigger some sort of demographic. So just do whatever the fuck you want and not care what other people think.",
            "So you're saying you have never hunted an animal.  Got it.",
            "First of all, marksmanship is hard. On a 300+ yard shot, you have to account for wind, bullet drop, and possibly mirage, not to mention recoil management to stay on target. Shooting offhand is not as easy as it looks in the movies. Second, spears/knives are inefficient. It is a very painful, slow way to kill and animal. The Native Americans, who had more respect for nature than anyone, gladly dropped their spears and bows for guns, because guns were more efficient and humane. Third, the point of hunting isn’t to go Rambo and prove how macho a person is. For a lot of us, that’s how we feed our families. When I’m trying to feed my family, I want to be able to come home alive and with meat. Fourth, if you get triggered by people posing for pictures with their kill, you don’t see all the failed hunts that led up to that photo. You don’t see all the early mornings, blood sweat and tears, trekking into the backcountry, and coming home empty handed. Those photos aren’t to impress you or people like you. They are to commemorate all the effort that a hunter puts forth to succeed. Lastly, I know you just wrote this post to aggravate people, but I thought you might want to learn something.",
            "NTA: Your spear your rules",
            "Seriously, I think I can beat a gorilla bare handed.\n\nI practice MMA since now 6 years, boxing simultaneously since 7 years, I could.\n\nI have a crazy speed, and reflexes as fast as my speed. I just need to wait him to charge at me, dodge him and give him a couple of good punches. I wont give up, at the first mistake the gorilla is done. There will always be virgins redditors who thinks it is impossible. Nothing is impossible with will power my friends, and 2) it's not with your weak bodies that you will do anything.\n\nAnybody with a little bit of training can kill a gorilla with a spear. Bare handed isn't necessarily harder, but it takes skills.",
            "YTA play stupid games win stupid prizes",
            "murder the fucker with a headbutt before he murders you with a headbutt, then i might be impressed",
            "this but unironically",
            "Nah but like this is facts though",
            "Lmao \"yards\". Like 99.9999999% of the people use meter as measurement for distance.",
            "Counter point, for many families especially in rural areas getting wild game may be the only way to put food on the table.\n\nSecond counter point, in the last two centuries have wiped out all the alpha predators in NA and Europe.  Deer populations are too high because of this and most populations are sickly because of it.  Hunting is the best means of population control at the moment.",
            "Instruction unclear: tried to \"spear\" a buffalo.",
            "That's a point. I don't see the appeal in killing for sport, but especially if it's literally just find the bear, shoot the bear, go home.",
            "okay honestly i agree tho",
            "r/iamverybadass",
            "But like this is a good take though",
            "Never really understood the 'pride' of killing an animal. Sure, you might be proud to be able to feed your family, but in a world where you can do that vastly more easily by just going to the store, what else are you getting out of it apart from just killing something?",
            "[removed]",
            "[deleted]",
            "Fuck the spear use your bare hands",
            "Doesn't The meat tastes better when the animal doesn't go through the stress of being chased down and killed at close range?",
            "Real talk, if you wanna do it the right way then you're only allowed to use tools that you've made by hand, out of materials in the vicinity of your quarry.",
            "They're proud of having all that money and influence which made it possible to do. It's showing off their power.",
            "Brawndo, it’s what animals crave.",
            "Or even a bow and arrow. If you can get close enough  to this animal without it hearing you or smelling your scent to kill it with a arrow you can get some props.",
            "I can't kill a buffalo from 300ft away so if someone can they should feel proud to be better than me and people like me.",
            "Me looking for Cummy’s response",
            "People get their kicks doing different stuff.  Hunting isn’t my bag at all...only reason I would hunt something is if I wasn’t able to go to a store and buy meat.\n\nWith that said...There’s a big different between your typical game hunter and your trophy hunter.  I think trophy hunters are cunts actually.\nGame hunters usually have a good amount of respect for the animals they are harvesting and they would never want an animal to suffer more than it needed to (I.e. your spear idea).\n\nI think I get what you’re saying in terms of slaying some beast like you’re a hero or a badass or whatever...and I don’t think that most people who are involved with this have any illusions about being tough...",
            "It's usually illegal to hunt with spears. Bowhunting is a slightly different version of the pointy stick tech we have been using for thousands of years.",
            "Wasn't there a bit that copied and pasted these as a comment so others could do the same? I haven't seen it in a while.",
            "This is what happens when a gamer thinks that games are a reality",
            "Nah grab some brass knuckles and spar the fucker",
            "Agreed. Thoug Id allow throwing rocks and an axe too. Caveman had that stuff too.",
            "Probably removed because it's a stupid opinion. The same people parroting dumb shit like this probably doesn't have the ability to hit the broad side of a barn.",
            "A shaman that I know had to do this. As his initiation, he had to kill a bull with a dagger, cut out its heart. He did. He's not even a big dude. He wrote about it in his autobiography, flowers of wirakuta.",
            "Y’all I kinda agree with this",
            "Fun fact I knew a couple of guys who hunt boars with only knifes. It's pretty brutal. They sneak up or wait for a chance to slit it's throat or sever the spine and sometimes ending up in a wrestling match. A few of the older dudes have some massive scars on their legs.",
            "This is the first time in months where I've seen an r/unpopularopinion post I agreed with.",
            "What about a rock? Just saying, two birds with one throw is definitely about hunting with rocks.",
            "Engage in honorable melee combat",
            "I've been saying for years that hunting is far too sophisticated for any bragging rights. you can't be in a sky chair with full gear and invisible to wildlife with a mega scope downing a moose and feeling sporty about it. you hand wrestle a moose to the ground? okay now you get to share on Facebook.",
            "I think a home made bow and arrow would be a proud accomplishment as well.",
            "Lead bullets are illegal to hunt with no?",
            "Killing animals for fun is absolutely disgusting and so are the people doing it.",
            "Why not bare handed?",
            "As a free dive pole-spear fisherman I endorse this message. Also moray eels fry up like chicken meat and are damn near impossible to kill without taking their whole damn head off.",
            "Lord knows it's probably a lie but one of my family members once swore to me he knew a green beret that killed a deer with a knife while he(me relative) sat in the stand and watched",
            "Alright, adding this one to the bucket list",
            "I’m pretty sure my ancestors used to run buffalo off a cliff... but I guess they were doing it for food, clothes and tools, not pride so I think it’s okay.",
            "Does the animal also have a spear?",
            "https://m.youtube.com/watch?v=BbnFnTmCEfY\n\nWe tried doing that but y’all flipped out and made it illegal in some areas, because it’s inhumane as fuck. Rifles are much more humane.",
            "I still like the idea of the person who kills the smallest animal is the best. Imagine a humming bird hanging on your mantle you took out from 200 yards. Also, anyone who’s ever hunted a bear knows how fuckin sad it is when you actually kill it.",
            "A spear?? Pussy, beat it to death with your fists like a REAL man.",
            "Yeah, I agree with this. My respect for hunters would go up if they faced their prey caveman style, with a spear or sharpened rock.",
            "This but unironically",
            "To be fair, 90% of hunting is just in finding the animal.",
            "Dude really, the point of using a firearm is because it's so much more humane, using a spear makes things so much worse for literally every one, you, the buffalo, the other hunters who maybe out there.\n\nIf you want to see a \"true hunter\" then search up Tim wells on YouTube he does a lot of spear and bow hunting all across the world. You'll see how far these animals can go before finally dying, I am no where near against bow or spear hunting, I to think that it's a much more respectable way of hunting, but its just not my cup of tea.",
            "link to post pls",
            "I could fight a giraffe bare handed. If I get a spear so does the giraffe.",
            "The problem here is the assumption that people who hunt are doing it to challenge an animal in a 1v1 fight.  Sometimes you are proud that you killed the animal quickly with a well placed shot so it never had to suffer and now your family has meat for an entire year.",
            "Stupid CUMMY spear cock",
            "Reminds me of the David Frost interview with the leader of the hitler youth once he got out of prison. Exact same stuff\n\nhttps://youtu.be/LSPP654W_SQ?t=223",
            "The greatest story I've ever heard was from a boy I dated briefly whose neighbor was a man who had killed a lion with only a bow and arrow in Africa in a trail he carved through himself. He was waiting for the villagers to reach him when the hyennas started coming to eat the lion carcass.\n\nSo when they found him he was just chilling surrounded by a bunch of dead hyennas (that he also killed with a bow and arrow) and the lion bc he would be damned if the hyennas ate his trophy. The villagers were shocked apparently since it hasn't been done in so long. \n\nApparently when you open their front door the lion is right there, stuffed and threatening. \n\nI hate trophy hunting, but it's a cool fuckn story.",
            "Why does anyone care about impressing anyone else?  One of the purposes of hunting is being assured if society collapses you will be able to provide.  \n\nIt's clear from you post you have no idea how to hunt or have ever hunted, I doubt you even own a firearm.",
            "humans are persistence hunters. Running the animal to death is also acceptable.",
            "Only real men kill big animals with their bare hands while completely naked.",
            "I told a ex military dude that I’d rather fight someone who had a knife instead of someone with a gun, because at least I have a chance to get the knife and get away. I said guns are for pussies, and he got very mad at me.",
            "I knew someone who would hunt crocs and gators with a spear eat them and save their skin fucking badass. Cause there is a high chance you get fucked up from one.",
            "Meanwhile OP: Could I have a double-double with Animal fries? To go please.",
            "Fist to paw, pussy",
            "Totally agree, that's why my sister is now a Kebab"
        ]
    },
    {
        "post_id": "a2k5yx",
        "author": "Aerosalts",
        "title": "Homophobia",
        "url": "https://www.reddit.com/r/copypasta/comments/a2k5yx/homophobia/",
        "score": 16711,
        "num_comments": 381,
        "created_utc": 1543804167.0,
        "selftext": "find the gay person: \n\n👩🏻👩🏼👩🏽👩🏾👩🏿👩🏻👩🏼👩🏽👩🏾👩🏿\n👨🏻👨🏼👨🏽👨🏾👨🏿👨🏻👨🏼👨🏽👨🏾👨🏿\n👦🏽👦🏾👦🏿👦🏻👦🏼👦🏽👦🏾👦🏿\n\ncan’t find them? \n\nthat’s because they live among us, looking like normal people. the only real difference is they’re going to hell ",
        "permalink": "/r/copypasta/comments/a2k5yx/homophobia/",
        "comments": [
            "If you're bi, does that mean that you'll be trapped in purgatory?",
            "find the gay person: \n\n👩🏻👩🏼👩🏽👩🏾👩🏿👩🏻👩🏼👩🏽👩🏾👩🏿\n👨🏻👨🏼👨🏽👨🏾👨🏿👨🏻👨🏼👨🏽👨🏾👨🏿\n👦🏽👦🏾👦🏿👦🏻👦🏼👦🏽👦🏾👦🏿\n\ncan’t find them? \n\nthat’s because they live among us, looking like normal people. the only real difference is they’re going to hell ",
            "I feel like it's fucked up that I laughed at this as a gay person ",
            "Found the gay person. His name is /u/Callistowo.",
            "Shut the fuck up Karen.",
            "Homosexuality should be banned because it's gay",
            "amogus?",
            "I found her. It’s the third one in",
            "You forgot to add the gingers but that’s ok cause they’re also going to hell 👩🏻‍🦰👩🏼‍🦰👩🏽‍🦰👩🏾‍🦰👩🏿‍🦰👨🏻‍🦰👨🏼‍🦰👨🏽‍🦰👨🏾‍🦰👨🏿‍🦰",
            "When the homosexuals are sus 😳",
            ">they live among us\n\ndont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it dont say it",
            "The one that starts their response with *smacks lips* \"oh hoonneeeyyy\" ",
            "I found the gay person, it's op.",
            "4th from the right in the top row. Try harder.",
            "I'm not gay but I'm still going to hell",
            "Blonde guy with the moustache. 100% he’s gay",
            "I respect all the gay people here that didn't get butthurt. You people give me hope",
            "“This language... is inhuman. This... \"tongue\" is not intended to even be conceived by humans. It’s just [EXPLETIVE DELETED]. Hell, I don’t even think this mangled, unintelligible sound set even counts as a language. The creatures I see down here... are misshapen, deformed, mangled—there are messed-up faces, long, bent arms with hinges where there shouldn’t be, weird holes in their face where their eyes—if they even are eyes, should be. These creatures—beasts—no, things are unearthly. The sounds that come from their oddly mouth-like orifices are alien, guttural, primal, nothing that should be coming out of a human mouth. [Loud screeching] AHH! FUUU—[Crawling, followed by the sounds of splintering bones and tearing flesh] AA[static]A[𝙴𝙽𝙳 𝙾𝙵 𝚁𝙴𝙲𝙾𝚁𝙳𝙸𝙽𝙶]”",
            "find the gay person: \n\n👩🏻👩🏼👩🏽👩🏾👩🏿👩🏻👩🏼👩🏽👩🏾👩🏿\n👨🏻👨🏼👨🏽👨🏾👨🏿👨🏻👨🏼👨🏽👨🏾👨🏿\n👦🏽👦🏾👦🏿👦🏻👦🏼👦🏽👦🏾👦🏿\n\ncan’t find them? \n\nthat’s because they live among us, looking like normal people. the only real difference is they’re going to hell ",
            "Brb bout to get baned from r/Jokes",
            "Don’t you go to Hell if you’re divorced? #Doublestandard",
            "THEY LIVE WHAT?",
            "nah its coz theyre all squares",
            "Nah the one that looks like my boy bohemian rhapsody from bohemian rhapsody",
            "Idk the first blonde guy looks like a bottom.",
            "Whether we wanted it or not, we've stepped into a war with the Cabal on Mars. So let's get to taking out their command, one by one. Valus Ta'aurc. From what I can gather he commands the Siege Dancers from an Imperial Land Tank outside of Rubicon. He's well protected, but with the right team, we can punch through those defenses, take this beast out, and break their grip on Freehold",
            "That's a beautiful message.",
            "r/yesyesyesno",
            "r/yesyesyesno ",
            "The devil lives among us",
            "Shut the fuck up you fuckin faggot ",
            "Based",
            "amogus",
            "They live where ? \n\n⠀⠀⠀⠟⠝⠈⠀⠀⠀⠡⠀⠠⢈⠠⢐⢠⢂⢔⣐⢄⡂⢔⠀⡁⢉⠸⢨⢑⠕⡌ ⠀⢀⠠⠐⠈⠀⢀⢂⠢⡂⠕⡁⣝⢮⣳⢽⡽⣾⣻⣿⣯⡯⣟⣞⢾⢜⢆⠀⡀⠀⠪ ⣬⠂⠀⠀⢀⢂⢪⠨⢂⠥⣺⡪⣗⢗⣽⢽⡯⣿⣽⣷⢿⡽⡾⡽⣝⢎⠀⠀⠀⢡ ⣿⠀⠀⠀⢂⠢⢂⢥⢱⡹⣪⢞⡵⣻⡪⡯⡯⣟⡾⣿⣻⡽⣯⡻⣪⠧⠑⠀⠁⢐ ⣿⠀⠀⠀⠢⢑⠠⠑⠕⡝⡎⡗⡝⡎⣞⢽⡹⣕⢯⢻⠹⡹⢚⠝⡷⡽⡨⠀⠀⢔ ⣿⡯⠀⢈⠈⢄⠂⠂⠐⠀⠌⠠⢑⠱⡱⡱⡑⢔⠁⠀⡀⠐⠐⠐⡡⡹⣪⠀⠀⢘ ⣿⣽⠀⡀⡊⠀⠐⠨⠈⡁⠂⢈⠠⡱⡽⣷⡑⠁⠠⠑⠀⢉⢇⣤⢘⣪⢽⠀⢌⢎ ⣿⢾⠀⢌⠌⠀⡁⠢⠂⠐⡀⠀⢀⢳⢽⣽⡺⣨⢄⣑⢉⢃⢭⡲⣕⡭⣹⠠⢐⢗ ⣿⡗⠀⠢⠡⡱⡸⣔⢵⢱⢸⠈⠀⡪⣳⣳⢹⢜⡵⣱⢱⡱⣳⡹⣵⣻⢔⢅⢬⡷ ⣷⡇⡂⠡⡑⢕⢕⠕⡑⠡⢂⢊⢐⢕⡝⡮⡧⡳⣝⢴⡐⣁⠃⡫⡒⣕⢏⡮⣷⡟ ⣷⣻⣅⠑⢌⠢⠁⢐⠠⠑⡐⠐⠌⡪⠮⡫⠪⡪⡪⣺⢸⠰⠡⠠⠐⢱⠨⡪⡪⡰ ⣯⢷⣟⣇⡂⡂⡌⡀⠀⠁⡂⠅⠂⠀⡑⡄⢇⠇⢝⡨⡠⡁⢐⠠⢀⢪⡐⡜⡪⡊ ⣿⢽⡾⢹⡄⠕⡅⢇⠂⠑⣴⡬⣬⣬⣆⢮⣦⣷⣵⣷⡗⢃⢮⠱⡸⢰⢱⢸⢨⢌ ⣯⢯⣟⠸⣳⡅⠜⠔⡌⡐⠈⠻⠟⣿⢿⣿⣿⠿⡻⣃⠢⣱⡳⡱⡩⢢⠣⡃⠢⠁ ⡯⣟⣞⡇⡿⣽⡪⡘⡰⠨⢐⢀⠢⢢⢄⢤⣰⠼⡾⢕⢕⡵⣝⠎⢌⢪⠪⡘⡌⠀ ⡯⣳⠯⠚⢊⠡⡂⢂⠨⠊⠔⡑⠬⡸⣘⢬⢪⣪⡺⡼⣕⢯⢞⢕⢝⠎⢻⢼⣀⠀ ⠁⡂⠔⡁⡢⠣⢀⠢⠀⠅⠱⡐⡱⡘⡔⡕⡕⣲⡹⣎⡮⡏⡑⢜⢼⡱⢩⣗⣯⣟ ⢀⢂⢑⠀⡂⡃⠅⠊⢄⢑⠠⠑⢕⢕⢝⢮⢺⢕⢟⢮⢊⢢⢱⢄⠃⣇⣞⢞⣞⢾ ⢀⠢⡑⡀⢂⢊⠠⠁⡂⡐⠀⠅⡈⠪⠪⠪⠣⠫⠑⡁⢔⠕⣜⣜⢦⡰⡎⡯⡾⡽⠀",
            "They live where?\n⠀⠀⠀⡯⡯⡾⠝⠘⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢊⠘⡮⣣⠪⠢⡑⡌\n⠀⠀⠀⠟⠝⠈⠀⠀⠀⠡⠀⠠⢈⠠⢐⢠⢂⢔⣐⢄⡂⢔⠀⡁⢉⠸⢨⢑⠕⡌\n⠀⠀⡀⠁⠀⠀⠀⡀⢂⠡⠈⡔⣕⢮⣳⢯⣿⣻⣟⣯⣯⢷⣫⣆⡂⠀⠀⢐⠑⡌\n⢀⠠⠐⠈⠀⢀⢂⠢⡂⠕⡁⣝⢮⣳⢽⡽⣾⣻⣿⣯⡯⣟⣞⢾⢜⢆⠀⡀⠀⠪\n⣬⠂⠀⠀⢀⢂⢪⠨⢂⠥⣺⡪⣗⢗⣽⢽⡯⣿⣽⣷⢿⡽⡾⡽⣝⢎⠀⠀⠀⢡\n⣿⠀⠀⠀⢂⠢⢂⢥⢱⡹⣪⢞⡵⣻⡪⡯⡯⣟⡾⣿⣻⡽⣯⡻⣪⠧⠑⠀⠁⢐\n⣿⠀⠀⠀⠢⢑⠠⠑⠕⡝⡎⡗⡝⡎⣞⢽⡹⣕⢯⢻⠹⡹⢚⠝⡷⡽⡨⠀⠀⢔\n⣿⡯⠀⢈⠈⢄⠂⠂⠐⠀⠌⠠⢑⠱⡱⡱⡑⢔⠁⠀⡀⠐⠐⠐⡡⡹⣪⠀⠀⢘\n⣿⣽⠀⡀⡊⠀⠐⠨⠈⡁⠂⢈⠠⡱⡽⣷⡑⠁⠠⠑⠀⢉⢇⣤⢘⣪⢽⠀⢌⢎\n⣿⢾⠀⢌⠌⠀⡁⠢⠂⠐⡀⠀⢀⢳⢽⣽⡺⣨⢄⣑⢉⢃⢭⡲⣕⡭⣹⠠⢐⢗\n⣿⡗⠀⠢⠡⡱⡸⣔⢵⢱⢸⠈⠀⡪⣳⣳⢹⢜⡵⣱⢱⡱⣳⡹⣵⣻⢔⢅⢬⡷\n⣷⡇⡂⠡⡑⢕⢕⠕⡑⠡⢂⢊⢐⢕⡝⡮⡧⡳⣝⢴⡐⣁⠃⡫⡒⣕⢏⡮⣷⡟\n⣷⣻⣅⠑⢌⠢⠁⢐⠠⠑⡐⠐⠌⡪⠮⡫⠪⡪⡪⣺⢸⠰⠡⠠⠐⢱⠨⡪⡪⡰\n⣯⢷⣟⣇⡂⡂⡌⡀⠀⠁⡂⠅⠂⠀⡑⡄⢇⠇⢝⡨⡠⡁⢐⠠⢀⢪⡐⡜⡪⡊\n⣿⢽⡾⢹⡄⠕⡅⢇⠂⠑⣴⡬⣬⣬⣆⢮⣦⣷⣵⣷⡗⢃⢮⠱⡸⢰⢱⢸⢨⢌\n⣯⢯⣟⠸⣳⡅⠜⠔⡌⡐⠈⠻⠟⣿⢿⣿⣿⠿⡻⣃⠢⣱⡳⡱⡩⢢⠣⡃⠢⠁\n⡯⣟⣞⡇⡿⣽⡪⡘⡰⠨⢐⢀⠢⢢⢄⢤⣰⠼⡾⢕⢕⡵⣝⠎⢌⢪⠪⡘⡌⠀\n⡯⣳⠯⠚⢊⠡⡂⢂⠨⠊⠔⡑⠬⡸⣘⢬⢪⣪⡺⡼⣕⢯⢞⢕⢝⠎⢻⢼⣀⠀\n⠁⡂⠔⡁⡢⠣⢀⠢⠀⠅⠱⡐⡱⡘⡔⡕⡕⣲⡹⣎⡮⡏⡑⢜⢼⡱⢩⣗⣯⣟\n⢀⢂⢑⠀⡂⡃⠅⠊⢄⢑⠠⠑⢕⢕⢝⢮⢺⢕⢟⢮⢊⢢⢱⢄⠃⣇⣞⢞⣞⢾\n⢀⠢⡑⡀⢂⢊⠠⠁⡂⡐⠀⠅⡈⠪⠪⠪⠣⠫⠑⡁⢔⠕⣜⣜⢦⡰⡎⡯⡾⡽",
            ">includes minorities \n>”normal people”",
            "I laughed, am I going to hell? ",
            "Well 11 and 16 look kinda like Freddie Mercury, so...",
            "Where's the difference? *Everyone's* going to Hell in that cosmology. ",
            "My father tolerate everything except for blacks, yellows, jews and gays.",
            "I found it",
            "Uh oh",
            "What if I’m in the lgbt community and am also an atheist?",
            "The gay person is the mod, that's why u cannot find him",
            "Hell's about to get a whole lot hotter. 😘",
            "Was expecting an “it’s you” joke",
            "It’s clearly number 11, Freddie Mercury.",
            "Whats hell? Oh, do you mean the Nether?",
            "find the gay person: \n\n👩🏻👩🏼👩🏽👩🏾👩🏿👩🏻👩🏼👩🏽👩🏾👩🏿\n👨🏻👨🏼👨🏽👨🏾👨🏿👨🏻👨🏼👨🏽👨🏾👨🏿\n👦🏽👦🏾👦🏿👦🏻👦🏼👦🏽👦🏾👦🏿\n\ncan’t find them? \n\nthat’s because they live among us, looking like normal people. the only real difference is they’re going to hell ",
            "Actually, it's the guy with black hair and moustache because that's *FREDDIE MERCURY!*",
            "Idk “👨🏻” looks kinda gay",
            "It’s the guy on the far right on the top row because he looks like Freddie mercury",
            "u/sussy-bot-2",
            "💀",
            "you said among us before it was a thing....",
            "omug sus",
            "amogus",
            "amogus",
            "Among us?",
            "The 4th to the left",
            "I found him! He's the one who posted this.",
            "👬 aren't these the gay guys?",
            "I thought this post would be super defensive XD gj keep up the good work. Nice to see the anti LGBTQ community represented! ✌",
            "😂😂😂😂😂😂",
            "Saw this on tweeter, I thought it was very crearly a joke by a account fully dedicated to jokes. ",
            "yep",
            "It's the dude in the center, I see it in his eyes",
            "Feels like tokyo ghoul.",
            "I’m guessing it’s u/Aerosalts?",
            "🗿",
            "All emojis are gay",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_willsphills] [Homophobia](https://www.reddit.com/r/u_willsphills/comments/a2nx16/homophobia/)\n\n- [/r/unextexted] [Homophobia](https://www.reddit.com/r/Unextexted/comments/a2oewa/homophobia/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "If I’m going to hell I may as well have a good time",
            "i'm torn between laughing my ass off and getting offended",
            "Gay post",
            "Second guy in on the top line.",
            "No he is the Black one In the bottom right",
            "Whilst you’re in heaven with all the frigid, well behaved bores we’ll be having an awesome party down in hell. ",
            "Homophobia is such a stupid term!!! A phobia implies a fear of something. Because someone does not agree with someone’s lifestyle does not mean they are afraid!! I do not agree with people that have sex with animals-does that mean I have Beastaphobia?? Oh and the hell thing-never assume who will or will not be there in the end.",
            "No homo",
            "Clearly its Freddy Mercury, hes between the blonde guy and the black woman.",
            "😂😂😂 ahh well. I’m not gay but I’m sure I’m going to hell! So may as well be kind to them now because I’ll be living amongst them there too. ",
            "11th one along",
            "r/nononoyes",
            "It's a trick question, it's always the OP.",
            "Shid how am I supposed to sleep now?",
            "No it’s the one below the first lady ",
            "This post is gayer than umm someone",
            "All you have to do is take them all to a public place one is sure to introduce him/herself using her complete gender/sexual ID.  \n\n\nThis is not a homophobic comment. It is an observation of the fact that so many people both straight and gay identify themselves with their sexuality.",
            "Only the most high can judge not us so stick to religion your oh so failin at ",
            "is this a Rudy Mustang tweet lmao",
            "are u sure about that?",
            "Am I the only one who found them all?",
            "Why did you use the poop emoji that much?",
            "like I care about this\n\n&#x200B;\n\noof",
            "Found em 👨🏻",
            "It’s 👨🏻 and 👨🏻",
            "They live among us? Oh fuck, now I can't trust nobody.",
            "Everyone can find the traps who are also gay",
            "They had us on the first half, not gonna lie.",
            "Yiiikes never going outside again! ThE gAysS!! *NoOOoOOo*",
            "If all gay people are going to hell, hell is gonna be fucking awesome",
            "Why are there so many black people. Dang people in da hood got it rough",
            "\n👩🏽👩🏾👩🏿👩🏽👩🏾👩🏿 👨🏽👨🏾👨🏿👨🏽👨🏾👨🏿 👦🏽👦🏾👦🏿👦🏽👦🏾👦🏿\n\nHere they all are. \n\nLGBT told me so. ",
            "This is old. It should be find the mentally ill person. ",
            "im not homophobic i just don't agree with their lifestyle at all and i dont want to be around them, see them in any form of media, or see them doing anything irl nor do i want them to infect my children with the gang weed",
            "It's almost as if God wants all the pure virgin arseholes for himself",
            "How do *you* know you're not in hell RIGHT NOW?! I mean, when the Statue of Liberty is figuratively reworded to say, \"*abandon hope all ye who enter* .\" When entire cities burn to the ground, are shaken to their roots or outright flooded. When plagues and disease exist without cure. When children are gunned down like vermin. When good people are made to suffer for no reason. When (incompetent) heads of state rattle the swords or war. When hate and intolerance fill the churches which preach how certain other people are damned for who they *love*. How the fuck do you know you're not in hell right now?!\n\n\n\nI'm not gay and I don't like seeing gay people be offensive. But that's not to say I don't like seeing straight people be offensive either. i don't like seeing *people* be offensive when there are so many other things to be pissed off at -- like troglodyte religious morons!\n",
            "Hell doesn't even exist, religion is all bullshit",
            "Whelp guess I’m going to hell, but I guess everyone is already in it.\n\nHeaven doesn’t exist because we’re all already in hell.",
            "If emoji's could talk I bet you I could find them in no time, haha!",
            "Lol if there was an emoji of a faggot we would identify him",
            "I know this is probably meant as a joke but it is absolutely true.  Homosexuality is a vile, disgusting sin, and you will go to hell if you don't ask Jesus for forgiveness.  He died and was resurrected to pay the price for our sins.  Through Him we can be perfect.  Repent.",
            "Hell isn’t real, and God/god is a fag.",
            " \n\nfind the gay person:\n\n👩🏻👩🏼👩🏽👩🏾👩🏿👩🏻👩🏼👩🏽👩🏾👩🏿 👨🏻👨🏼👨🏽👨🏾👨🏿👨🏻👨🏼👨🏽👨🏾👨🏿 👦🏽👦🏾👦🏿👦🏻👦🏼👦🏽👦🏾👦🏿\n\ncan’t find them?\n\nthat’s because they live among us, looking like normal people. the only real difference is they’re going to hell",
            "Sometimes the homophobe is a gay person",
            "They live among us? Oh god! ",
            "Clearly the 5th to last one is gay...",
            "Find the serial murderer.. Cant find them? They live amongst us..\n\nWorks for pretty much everything, as people are the same no matter what.",
            "I was once asked to judge Mr Gay UK . I said no problem, he's against god, he's against nature and he's going to hell.",
            "Shut up faggot",
            "Nobody is afraid of gay people.",
            "[deleted]",
            "Dude. Leave them alone. They are humans just like us. ",
            "Oh, do fuck off.",
            "I'd give you a Silver if my mom didn't catch me stealing her credit card earlier",
            "It’s the blond guy with the stach"
        ]
    },
    {
        "post_id": "gnki6f",
        "author": "AvilionAMillion",
        "title": "this got me banned from r/terraria",
        "url": "https://www.reddit.com/r/copypasta/comments/gnki6f/this_got_me_banned_from_rterraria/",
        "score": 16699,
        "num_comments": 290,
        "created_utc": 1590012905.0,
        "selftext": "Holy fucking shit. I want to bang the terraria zoologist so goddamn bad. I can't stand it anymore. Every time a blood moon occurs I get a massive erection. I've seen literally every rule 34 post there is of her online. My dreams are nothing but constant fucking sex with Astria. I'm sick of waking up every morning with six nuts in my boxers and knowing that those are nuts that should've been busted inside of Astria's tight fox pussy. I want her to have my mutant human/fox babies.\n\n&#x200B;\n\nFuck, my fucking mom caught me with a fox in the backyard. I dressed her in my sister's skirt and went to fucking town. She hasn't said a word to me in 10 hours and I'm worried she's gonna take away my computer. I might not ever get to see Astria again.\n\n&#x200B;\n\n&#x200B;\n\nEdit: Please don't make this my most upvoted post I have too much dignity\n\nEdit: :|",
        "permalink": "/r/copypasta/comments/gnki6f/this_got_me_banned_from_rterraria/",
        "comments": [
            "Tbh its been like 6 days how much rule 34 of her is there",
            "I remember seeing something like this but with that dog from animal crossing",
            "Howy fucking shit. I want to bang the tewwawia zoowogist so goddamn bad. I can't stand it anymowe. Evewy time a bwood moon occuws I get a massive ewection. I've seen witewawwy evewy wuwe 34 post thewe is of hew onwine. My dweams awe nothing but constant fucking sex with Astwia. I'm sick of waking up evewy mowning with six nuts in my boxews and knowing that those awe nuts that shouwd've been busted inside of Astwia's tight fox pussy. I want hew to have my mutant human/fox babies.\n\n&#x200B;\n\nFuck, my fucking mom caught me with a fox in the backyawd. I dwessed hew in my sistew's skiwt and went to fucking town. She hasn't said a wowd to me in 10 houws and I'm wowwied she's gonna take away my computew. I might not evew get to see Astwia again.",
            "Holy fucking shit. I want to bang the terraria zoologist so goddamn bad. I can't stand it anymore. Every time a blood moon occurs I get a massive erection. I've seen literally every rule 34 post there is of her online. My dreams are nothing but constant fucking sex with Astria. I'm sick of waking up every morning with six nuts in my boxers and knowing that those are nuts that should've been busted inside of Astria's tight fox pussy. I want her to have my mutant human/fox babies.\n\n&#x200B;\n\nFuck, my fucking mom caught me with a fox in the backyard. I dressed her in my sister's skirt and went to fucking town. She hasn't said a word to me in 10 hours and I'm worried she's gonna take away my computer. I might not ever get to see Astria again.",
            "There are rule 34’s? I need to know, for.. for a friend",
            "[removed]",
            "Copied and pasted into the sub, here's the response:\n\n\nOkay. So, I’ve been seeing this copypasta floating around about wanting to “bang the Terraria Zoologist”, and frankly- I think this is disgusting. First of all, her name isn’t “the Terraria Zoologist”, it’s Astria. It’s a beautiful name for a beautiful person, and you would all do well to refer to her as such. If you don’t even know her name, than you have no right wanted to have sex with her!\n\nSecondly, wanting to bang her is just gross. Saying that you want to bang Astria is objectifying her, and it is not okay. If you’ve ever wanted to bang Astria, you should be disgusted with yourself.\n\nUnlike you cretins, I however- respect her. Sure, it’s possible I may consider her to be rather bangable, but I wouldn’t dare do such a thing. Astria is a fucking queen, and deserves to be treated as such.\n\nI DO NOT want to bang “The Terraria Zoologist”. I want to hug her. I want to be in a healthy and loving relationship with Astria. I want to wake up every morning in bed, with her lying peacefully next to me as the morning sun shines in through the window. I want to make her breakfast every morning, and tend to her every need. I want her to feel like she is truly loved, (because she is). I want her to be by my side for my whole life, because I know that she is the perfect woman for me, and I am perfect for her.\n\nI want to be to be with her every day, just so I can tell her how much I fucking love her. I want her to know how much I adore everything amazing personality, her incredible fashion sense, her extremely impressive zoology abilities, and her absolutely beautiful head to body ratio, and her beautiful, beautiful eyes.\n\nHowever, if I were to ever have sex with Astria, I wouldn’t simply be “banging” her. If Astria were to ever consent to me having sexual intercourse with her, it would be tender and loving and passionate. As we make love, I’d slowly and gently caress her soft, orange fur as I slowly but deliberately thrust into her tight fox pussy. I would make her pleasure my utmost priority, with my own being secondary. But if she was willing, than oh god. What I wouldn’t give to feel her adorable little paws running up and down the length of my shaft. I just wanna pet every inch of her body, and give her scritches on her tummy so she does that thing that foxes do where their legs spaz out. That’d just be so fucking hot. I’d probably end up cumming all over her, so it gets in her fur. But goddamn. I love that fur so much, that I’d personally lick off every last drop of cum, just to I have another opportunity to get as close to her gorgeous fur as possible.\n\nBut if you just want to bang her, than you are a disgusting degenerate, and I hope you burn in the deepest pits of tartarus.\n\nBut the guide on the other hand. Now he’s somebody that I’d wanna bang.",
            "Typing “terraria zoo” into google the first autofill result is “zoologist fanart”\n\nDear god",
            "Only 6 balls? Those are rookie numbers!",
            " \n\nYour post has been removed for breaking the following rule(s):\n\n>3. No bad behaviour",
            "[deleted]",
            "Bruh ok why did they have to make her so thick tho",
            "Dear Liberals, \n \n&#x200B;\n\nHoly fucking shit. I want to bang the Deltarune lizard  so goddamn bad. I can't stand it anymore. Every time someone even remotely mentions Deltarune I think of her and get a massive erection. I've seen literally every rule 34 post there is of her online. My dreams are nothing but constant fucking sex with Susie. I'm sick of waking up every morning with six nuts busted in my boxers, knowing that those nuts should've been busted inside of that loose lizard pussy. I want her to have my mutant human/lizard babies.\n\n&#x200B;\n\nFuck, my fucking mom caught me with a baby aligator in the backyard. I dressed it in one of my dad's runway wigs and went to fucking town. She hasn't said a word to me in 10 hours and I'm worried she's gonna take away my computer. I might not ever get to see Susie again.",
            "this is why they gave their last update",
            "Encouraging brigading or linking to brigading will get you banned from /r/copypasta. [What is brigading?](https://www.reddit.com/r/OutOfTheLoop/comments/36xhxc/what_is_brigading_and_how_do_you_do_it/)",
            "whot te fuck",
            "Who the hell is the zoologist?",
            "I have not laughed this hard in years LMFAO",
            "Op: Posts this\n\nAlso op: Claims to have dignity left",
            "I once did this with Queen Bee, though no ban",
            "google transulated edition \n\n\nR / Terraria stopped me\n\nI want to do too much scary work in Holly Packing, so I can't beat it. It’s a bloody month, and I saw 34 posts when I checked out a large group. My only dream is to always keep in touch. Astrology makes me sick. Every morning I wake up in a box of six almonds and know that they are almonds that should be included in Austrian poetry. I want to be a form of communication for my child\n\n\nMy longing mother took the dog my sister was wearing to catch me in the garden. I went to the village to cook. He didn't tell me anything for ten hours. I was afraid he would let me use it. computer. I can't go to astrology\n\nEditor: Don't have too much respect for my favorite characters\n\nedit ::",
            "First it was the dinosaurs, now it's the fox girls",
            "edit: wow my most upvoted comment/post is about penis/sex/etc! i hate you reddit!",
            "Just checked, there’s only 20 r34 pics. Not that much",
            "Bro it’s not that hard to see every r34 post, there’s only like 20",
            "Lmao, there was already enough horny posting for terraria with the nurse and dryad so the second I saw they were adding in a hot female furry I knew it was on. The developers knew what they were doing but I bet they didn't think it would go beyond a few memes and die off within a week but I Terraria has seen a massive up spike in popularity because of 1.4 and as soon as E621 gets a hold of this there's gonna be a ridiculous amount of furry porn getting posted in every Terraria community on the internet lol.",
            "Okay. So, I’ve been seeing this copypasta floating around about wanting to “bang the Terraria Zoologist”, and frankly- I think this is disgusting. First of all, her name isn’t “the Terraria Zoologist”, it’s Astria. It’s a beautiful name for a beautiful person, and you would all do well to refer to her as such. If you don’t even know her name, than you have no right wanted to have sex with her!\n\nSecondly, wanting to bang her is just gross. Saying that you want to bang Astria is objectifying her, and it is not okay. If you’ve ever wanted to bang Astria, you should be disgusted with yourself.\n\nUnlike you cretins, I however- respect her. Sure, it’s possible I may consider her to be rather bangable, but I wouldn’t dare do such a thing. Astria is a fucking queen, and deserves to be treated as such.\n\nI DO NOT want to bang “The Terraria Zoologist”. I want to hug her. I want to be in a healthy and loving relationship with Astria. I want to wake up every morning in bed, with her lying peacefully next to me as the morning sun shines in through the window. I want to make her breakfast every morning, and tend to her every need. I want her to feel like she is truly loved, (because she is). I want her to be by my side for my whole life, because I know that she is the perfect woman for me, and I am perfect for her.\n\nI want to be to be with her every day, just so I can tell her how much I fucking love her. I want her to know how much I adore everything amazing personality, her incredible fashion sense, her extremely impressive zoology abilities, and her absolutely beautiful head to body ratio, and her beautiful, beautiful eyes.\n\nHowever, if I were to ever have sex with Astria, I wouldn’t simply be “banging” her. If Astria were to ever consent to me having sexual intercourse with her, it would be tender and loving and passionate. As we make love, I’d slowly and gently caress her soft, orange fur as I slowly but deliberately thrust into her tight fox pussy. I would make her pleasure my utmost priority, with my own being secondary. But if she was willing, than oh god. What I wouldn’t give to feel her adorable little paws running up and down the length of my shaft. I just wanna pet every inch of her body, and give her scritches on her tummy so she does that thing that foxes do where their legs spaz out. That’d just be so fucking hot. I’d probably end up cumming all over her, so it gets in her fur. But goddamn. I love that fur so much, that I’d personally lick off every last drop of cum, just to I have another opportunity to get as close to her gorgeous fur as possible.\n\nBut if you just want to bang her, than you are a disgusting degenerate, and I hope you burn in the deepest pits of tartarus.\n\nBut the guide on the other hand. Now he’s somebody that I’d wanna bang.",
            "Oh hey! Honestly liked your comment when you  had it on my post :/ shouldn't gotten banned",
            "I got banned from r/terraria for telling someone that he's a cunt",
            "[deleted]",
            "Ya not gonna lie man I kinda want you banned from this subreddit for that one. I’m gonna go hot my head with a hammer until I either forget my childhood or that I ever read this which ever comes first.",
            "Real gamers know the dryad is the best",
            "This should get you banned from comunicating with other beings forever.",
            "lmao i saw this when you posted it, cheers",
            "im unsubscribing from this sub",
            "God damnit i laughed way too much at this glorious piece of art.",
            "This, but delphox",
            "Okay. So, I’ve been seeing this copypasta floating around about wanting to “bang the Terraria Zoologist”, and frankly- I think this is disgusting. First of all, her name isn’t “the Terraria Zoologist”, it’s Astria. It’s a beautiful name for a beautiful person, and you would all do well to refer to her as such. If you don’t even know her name, than you have no right wanted to have sex with her!\n\nSecondly, wanting to bang her is just gross. Saying that you want to bang Astria is objectifying her, and it is not okay. If you’ve ever wanted to bang Astria, you should be disgusted with yourself.\n\nUnlike you cretins, I however- respect her. Sure, it’s possible I may consider her to be rather bangable, but I wouldn’t dare do such a thing. Astria is a fucking queen, and deserves to be treated as such.\n\nI DO NOT want to bang “The Terraria Zoologist”. I want to hug her. I want to be in a healthy and loving relationship with Astria. I want to wake up every morning in bed, with her lying peacefully next to me as the morning sun shines in through the window. I want to make her breakfast every morning, and tend to her every need. I want her to feel like she is truly loved, (because she is). I want her to be by my side for my whole life, because I know that she is the perfect woman for me, and I am perfect for her.\n\nI want to be to be with her every day, just so I can tell her how much I fucking love her. I want her to know how much I adore everything amazing personality, her incredible fashion sense, her extremely impressive zoology abilities, and her absolutely beautiful head to body ratio, and her beautiful, beautiful eyes.\n\nHowever, if I were to ever have sex with Astria, I wouldn’t simply be “banging” her. If Astria were to ever consent to me having sexual intercourse with her, it would be tender and loving and passionate. As we make love, I’d slowly and gently caress her soft, orange fur as I slowly but deliberately thrust into her tight fox pussy. I would make her pleasure my utmost priority, with my own being secondary. But if she was willing, than oh god. What I wouldn’t give to feel her adorable little paws running up and down the length of my shaft. I just wanna pet every inch of her body, and give her scritches on her tummy so she does that thing that foxes do where their legs spaz out. That’d just be so fucking hot. I’d probably end up cumming all over her, so it gets in her fur. But goddamn. I love that fur so much, that I’d personally lick off every last drop of cum, just to I have another opportunity to get as close to her gorgeous fur as possible.\n\nBut if you just want to bang her, than you are a disgusting degenerate, and I hope you burn in the deepest pits of tartarus.\n\nBut the guide on the other hand. Now he’s somebody that I’d wanna bang.",
            "Lmao",
            "Um actually the zoologists name in my world is Dian so um check your facts bro",
            "Well this is glorious.",
            "Your dignity is dead.  RIP.",
            "The last edit is full of disappointment.",
            "Why did I expect this?",
            "I got a terraria post right ontop of this one lol",
            "Nice",
            "Lmao",
            "to quote my freind “i’m really mad about this”",
            "F",
            "was this a modifcation of the isabelle copypasta",
            "F",
            "Did they really add fucking furries to terraria.\nThat’s so cool holy shit.",
            "I see no dignity from here lol.",
            "I knew someone would make this eventually",
            "You can’t start off a post with that title and expect it not to be the most popular thing you ever posted.",
            "For how long?",
            "Same",
            "I mean that’s basically how you describe the degens on the terraria sub",
            "me too kid, me too.",
            "Oh OK",
            "Is Astria the only name for her? Because mine is called like that too lmao",
            "isabelle",
            "Iirc, as much as I live terraria, r/terraria is complete aids and just full of children",
            "\\*Checks sub\\*\n\nAight.",
            "Damn I thought the Dryad was hot",
            "Fucking knew this would happen",
            "_I wonder why it got you banned_",
            "I was so confused I haven't played Terraria in a fat minute. Might get back on now that I've read this tho",
            "Cock",
            "Ansolutely beautiful. This is an updated version of the isabelle one right?",
            ">Please don't make this my most upvoted post I have too much dignity\n\nDoubt.",
            "Cock",
            "This is glorious.",
            "I dont understand this post whatsoever",
            "Bro",
            "lmfaoooo",
            "holy fucking shit Lmaooo",
            "Oh my god I saw this when it was posted. I think I commented too.",
            "The frick",
            "Congrats on your furry transformation\n\nEDIT:I'm not a furry, just thought this was a funny thing to comment",
            "Where the hell did my bleach go",
            "Are you still banned?",
            "i thoguht people with the horny would be more intrested in the dyrad, she basically half naked and above legal age",
            "Apparently using copypasta as copypasta will get you in trowoble with the moddie woddies of r/copypasta",
            "We all feel the same way man, but no beastiality.\nOnly I want to do it in the ANUS",
            "Creep.",
            "u/owoifier",
            "Noo, not the fox!",
            "Moon lord:\nI'M LITERALLY A WORLD ENDING ELDRITCH GOD AND IM NOT THIS FUCKED UP OIKE WHA5 THE HELL"
        ]
    },
    {
        "post_id": "jmcsjb",
        "author": "Immemephilosopher",
        "title": "I, an atheist, accidentally said “oh my g*d” instead of “oh my science”",
        "url": "https://www.reddit.com/r/copypasta/comments/jmcsjb/i_an_atheist_accidentally_said_oh_my_gd_instead/",
        "score": 16599,
        "num_comments": 308,
        "created_utc": 1604274353.0,
        "selftext": "You read the title, I just cannot believe I said the “g” word on accident. Am I even an atheist anymore? I don’t like religion or anything but like maybe it infiltrated me and is manipulating me to say “oh my g*d” instead of “oh my science”. Please guys it wasn’t me, I didn’t mean it. I’m very disappointed in myself, I think I need to go to science camp or go to therapy. What if I’m secretly religious? what should I do? Is my foreskin going to fall off?? Please can someone give me advice, any advice is appreciated. \n\nBest regards, \n\n                            \n-an atheist(?)",
        "permalink": "/r/copypasta/comments/jmcsjb/i_an_atheist_accidentally_said_oh_my_gd_instead/",
        "comments": [
            "YTA not a real atheist",
            "You read the headline I think it is no accident for me to say \"G\" J! Am I back in the door? I don’t like religion or anything related to religion. But it seems to have come into my life and tried to say, \"My God, not\" science \". What if I am a secret believer? If the skin falls off, what is it? do? J! Anybody please give me your opinion? Thanks for your reply\n\nbe happy\n\n                            \n Is there a god?",
            "You 👈 read 📖 the title 🤭🤤🍆, I 👥 just cannot 🚫 believe 🌈 I 👥👈 said 💬👱🏿💖 the “g” word 📝 on 🔛 accident 🙈. Am I 👥 even 🌃 an atheist ⚛ anymore 🔥? I 👁 don’t like 💖 religion 🙏 or anything 😯 but 🍑 like 💖 maybe 🤔😡 it infiltrated 🍆😏😛 me and is manipulating me to say 🗣 “oh my g*d” instead 👍 of “oh my science”. Please 🙏 guys 👦 it wasn’t me, I 👁 didn’t mean 😏❄🎅 it. I’m very ✅ disappointed 😠 in myself, I 👁 think 🧠💭🤔 I 👁 need 😩💦 to go 👉🏿 to science ⚗🔬 camp ⛺ or go 🏃 to therapy 👩. What if I’m secretly 🙊 religious ✡✝☪? what should I 👁 do? Is my foreskin 🍆 going 🏃👳 to fall 🍁🍂 off 📴?? Please 🙏 can someone 👤 give 🎁 me advice 😤, any advice 💯 is appreciated 🙏😁🌺.   \n  \nBest 🏆 regards 🤔❤,   \n  \n  \n-an atheist 🙄(?)",
            "NTA your mother should’ve raised you better",
            "You need to get the the ER immediately and get your  foreskin stapled. That will help a lot",
            "you've been banned from r/atheism, do NOT contact the mods",
            "Atheist drake be like:\nSciences plan",
            "You wead the titwe, I just cannot bewieve I said the “g” wowd on accident. Am I even an atheist anymowe? I don’t wike wewigion ow anything but wike maybe it infiwtwated me and is manipuwating me to say “oh my g*d” instead of “oh my science”. Pwease guys it wasn’t me, I didn’t mean it. I’m vewy disappointed in mysewf, I think I need to go to science camp ow go to thewapy. What if I’m secwetwy wewigious? what shouwd I do? Is my foweskin going to faww off?? Pwease can someone give me advice, any advice is appweciated. \n\nBest wegawds, \n\n                            \n-an atheist(?)",
            "r/atheism in a nutshell",
            "i got permabanned from r/atheism for calling a mod a neckbeard",
            "You betrayed the gamer society. You abandoned us and you treat us like trash!",
            "You read the title, I just cannot believe I said the “g” word on accident. Am I even an atheist anymore? I don’t like religion or anything but like maybe it infiltrated me and is manipulating me to say “oh my g*d” instead of “oh my science”. Please guys it wasn’t me, I didn’t mean it. I’m very disappointed in myself, I think I need to go to science camp or go to therapy. What if I’m secretly religious? what should I do? Is my foreskin going to fall off?? Please can someone give me advice, any advice is appreciated. \n\nBest regards, \n\n                            \n-an atheist(?)",
            "Yeah you’re definitely going to atheist hell for this",
            "I hereby revoke your atheist membership. Handover you license, name tag, and holster.",
            "Fun story, my mother once (actually a few times total) tried to argue a thematically similiar thing - according to her logic, because she had me, without my consent, baptised by a priest aka christianized in some water when I was a baby, it is actually impossible for me to be an atheist. That i'm a christian no matter what I say or do, because of that involuntary ritual on me.",
            "It’s ok, Science forgives all",
            "nta, sky daddyeians capitalize God's pronouns and antecedents. You're not religious.",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "im gonna say the g word",
            "weed",
            "You seriously call yourself an atheist still? Pathetic.",
            "Just say fuck if saying the other ways bother you",
            "Please tell me someone posted this on r/atheism",
            "based",
            "NTA, your science, your rules",
            "yta,you dropped these🚩🚩🚩🚩🚩🚩🚩🚩",
            "I, an atheist, accidentally said “oh my g*d” instead of “oh my science”\n\nYou read the title, I just cannot believe I said the “g” word on accident. Am I even an atheist anymore? I don’t like religion or anything but like maybe it infiltrated me and is manipulating me to say “oh my g*d” instead of “oh my science”. Please guys it wasn’t me, I didn’t mean it. I’m very disappointed in myself, I think I need to go to science camp or go to therapy. What if I’m secretly religious? what should I do? Is my foreskin going to fall off?? Please can someone give me advice, any advice is appreciated. \n\nBest regards, \n\n                            \n-an atheist(?)",
            "~~jesus fucking christ~~ Physics fucking maths, what’s the next thing you’re gonna do? Say *bless you* instead of *diagnose yourself*?",
            "You seem to be religiously atheist.",
            "I once made a girl cry in Highschool because she was an atheist and she said “I swear to god” and I responded with “you can’t swear to something you don’t believe in.”",
            "stop this is literally me",
            "The",
            "> g\\*d\n\nare you atheist or jewish",
            "NTA sir, this is wendy's",
            "Did you know that saying “Oh my science” is a deep offense to science as in doing so, you would have used it’s name in vain. Therefore, I think you did the right thing in saying “Oh my God” since you don’t believe in God, you aren’t offending anyone.",
            "ESH: Everyone’s A Scientist Here",
            "You have been banned from r/Atheism.",
            "Use your foreskin as a sleeping bag to wait out the religious people coming to convert you.",
            "I unironically did this at first. I tried to phase out the use of that language. God what a fucking retard I was. It's just a figure of speech and anyone who actually does what's in the pasta is literally retarded.",
            "!emojify",
            "it doesn't work like that",
            "\\*Jordan Peterson rubs his hands\\*",
            "Ngl i'm feeling major red flags so YTA",
            "nta, not the atheist",
            "Science damn you...",
            "Oh my Darwin is also acceptable.  I remember when the band Muse won an MTV Music Award a long time ago, and pointed at the ground, saying 'Thank you, Darwin!!!!'.  I absolutely loved it!!!",
            "Ha haha!  you fell into the trap.  When said, \"Oh, my God!\" you automatically qualified for Heaven.  There is nothing you can do.  You can commit any sins you want over and over (mmm, gluttony) but you are doomed to Paradise.\n\nhahaha, loser!  You can't beat God!",
            "Well now I’m officially banned from r/atheism",
            "oh my Flying Spaghetti Monster that’s awful",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "Jesus is King of kings",
            "The fact that you attach any importance to the word God means you're ambivalent.  I'm an atheist and use that word all the time like I use the word shit",
            " \n\nYou  read the title, I just cannot believe I said the “g” word on accident.  Am I even an atheist anymore? I don’t like religion or anything but like  maybe it infiltrated me and is manipulating me to say “oh my g\\*d”  instead of “oh my science”. Please guys it wasn’t me, I didn’t mean it.  I’m very disappointed in myself, I think I need to go to science camp or  go to therapy. What if I’m secretly religious? what should I do? Is my  foreskin going to fall off?? Please can someone give me advice, any  advice is appreciated.\n\nBest regards,\n\n\\-an atheist(?)",
            "I prefer to say oh my gods personally, any real atheist would die before talking about the j*daic g*d though.",
            "Nice south park reference",
            "In highschool one of my friends tried to argue the same thing you're making fun of; that because I said \"oh my god\" that must mean god exists. \n\nThey teach them some really stupid stuff on youth Wednesday's.",
            "My foreskin was removed as a child. Does this mean I have to go to heaven? I'm not really keen, and I'm worried now....",
            "h",
            "Might as well go out and behead some infidels at this point.",
            "DID SOMEBODY SAY FORESKIN?",
            "You said “oh my god” BY accident not “on accident” why do Americans a,ways say ‘on’?",
            "If you cant confirm GOD nor cant Unconfirm GOD, then you are just another faith owner,,",
            "Science save the Queen 😩",
            "the question mark at the end killed me",
            "Based Bot come and grace me",
            "Space dammit, man. Get ahold of yourself!",
            "The good thing about being atheist. Nobody gives a fuck about what you say. So chill",
            "This is fake. Oh my science is a joke from South Park",
            "Oh my land",
            "NTA saying god in \"vain\" insults the religion",
            "i loved the (?) well done",
            "Science is your god",
            "Öh my God\" means just as little coming from a believer.",
            "My only god, my only idol, the only thing I would quite happily pray to, is science! There you go, ultimate save",
            "Please lets not start turning atheism into a pattern of acceptable practice. Say whatever the fuck you want. Believe whatever you want. I get that this post is a joke, but it's scarily close to reality. Don't make atheism into a new form of ideological dogma.",
            "you have made Richard Dawkins very sad. Sam Harris will not speak with you. Dan Dennett is fuming. Christopher Hitchens is rolling in his grave. Ofc since we are atheists we do not think there is an afterlife, so strictly speaking, Hitchens cannot feel anything. But if he were alive today he would be very disappointed in you).",
            "Fake atheist",
            "I am a scientist among men",
            "How 2 break auto moderator very easily\n\n weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420 \n\n weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420 \n\n weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420 \n\n weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420 \n\nweed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420 \n\n weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420 \n\n weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420 \n\n weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 Bad bot hey buddy, weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420 mods gay 69420",
            "you're fine it's just an expression don't worry",
            "“Is my foreskin going to fall off”",
            "This is the most Reddit shit I have ever read.",
            "weed cock instagram game based smart-ass atheist idiot gun trap emoji funny epic bot iq anime gamer gay earth virgin cock 69 dead virus god poor meow skeleton joe karen spider 420",
            "I personally believe humans naturally have an understanding or belief of a creator or higher power. Being atheist is going against human nature.",
            "these smartass atheist wannabe are more of an agnostic instead of an actual atheist",
            "Geez shut up.",
            "Oh my science! This is a fucking crime! EVERYBODY CALL THE POLICE1!!!!1!11111!!",
            "r/atheism",
            "Cummy as your lawyer I recommend that you COME THE FUCK BACK",
            "You shouldn't act so this is bad. It is only bad to say if you are Cristian as it is using the lord's name in vain. I'm a Cristian so I would know. Don't freak out about saying oh my god if your an atheist",
            "NTA\n\nThe 10 Commandments say not to use his name in vain, so by breaking the commandments you are actually being a better atheist.",
            "u/shittytranslatorbot",
            "Bro chill it’s not that deep 💀"
        ]
    },
    {
        "post_id": "gms3i2",
        "author": "iluvcars3man",
        "title": "***THIS IS WARNING ABOUT A SCAM***",
        "url": "https://www.reddit.com/r/copypasta/comments/gms3i2/this_is_warning_about_a_scam/",
        "score": 16579,
        "num_comments": 214,
        "created_utc": 1589906377.0,
        "selftext": "WARNING !!!!!\n\nIf a man comes to your front door and says he is conducting a survey and asks you to show him your tits DO NOT SHOW HIM YOUR TITS. This is a scam and he is only trying to SEE YOUR TITS.\n\nPlease warn others that their tits may be at risk.",
        "permalink": "/r/copypasta/comments/gms3i2/this_is_warning_about_a_scam/",
        "comments": [
            "[removed]",
            "WARNING !!!!!\n\nIf a man comes to your front door and says he is conducting a survey and asks you to show him your tits DO NOT SHOW HIM YOUR TITS. This is a scam and he is only trying to SEE YOUR TITS.\n\nPlease warn others that their tits may be at risk.",
            " Ok, you're acting like there is so much difference between when the man is doing a survey and when he's not. But what is the difference honeslty? Why do you care? You're showing your tits in both scenarios, the man's intention doesn't effect me right? Beside, there can even be more scenarios than just weather or not he's doing a survey. There can be different scenarios with each its own amount of 'wanting to see tits'. It's not a black and white situation. We're not in the segregation era anymore. Do you now see now how ridiculous you sound?\n At the end, nothing matters. Beside, if I can show him my tits and make him happy - weather it be by helping him with his survey OR with sexual impulse - well, either way... It's a good thing, right? What matters is that we all have the ability make a man's day better by doing a very simple and easy task. Rich or poor, smart or dumb, spider-armed and good at multitasking or amputee, we all have the power to make change a male person's life. That is the only thing that matters, and possibly... our mission.\n So, ladies, let's all take our clothes off. Let's all fet to our knees or on all-fours and start sucking. This is what we were created for, and I am happy to be born the way I was. Every men on earth deserve die of pleasure form our bodies and our fucked up fetishes. Ugly, fat, weird kink - nothing matters, we all have the same power. Let's all run to the nearest man and lash out all our sexual desire to them without consent. And finally, let's brutally murder them - as they will never be able to experience a bigger pleasure in their life, it is too cruel to let them leave any longer.",
            "WARNING‼ !!!!!\n\nIf👏🎛👉 a❄ man👅 comes😩 to💦💦 your⬅ front💪🏾 door🚪 and🔼🔙 says🙅🏾🙅🏾 he👌👉 is💢💃🏿 conducting a🎩🅰 survey🚶🚶🚶 and➕ asks😇💁 you💉 to1️⃣💦 show👌 him👏🙅 your👏 tits♀ DO😈 NOT👎 SHOW📺📺📺 HIM👏 YOUR👏 TITS.🍒👊🏼🍒 This🐒 is😢 a🇹 scam☠☠☠ and👏👏👏 he🅱🚎 is💦💏🙅 only🕦 trying🙃😔 to😔💦🉐 SEE👁 YOUR💪🏼👈🏿 TITS.\n\nPlease warn❕❕ others👫 that😋 their💺💥 tits👀👮🏻 may🗓😏 be😩💁 at🍆❤🍆 risk.🙅‍♀️",
            "There is no survey.  \n\n\nShow me your tits.",
            "Fuck man I wish you were here to warn me earlier I totally fell for it last week :(",
            "WAWNING !!!!!\n\nIf a man comes to youw fwont doow and says he is conducting a suwvey and asks you to show him youw tits DO NOT SHOW HIM YOUW TITS. This is a scam and he is onwy twying to SEE YOUW TITS.\n\nPwease wawn othews that theiw tits may be at wisk.",
            "For some reason I thought I was in r/nosleep and was really confused",
            "reminds me of the vault tec rep. \"vault tec calling!\"",
            "This is utter falsehood and lies.\n\nDM me your tits, so that I shall add them to my database. I can also rate them of you wish so. My company (badonka donks™) consists of only the best professional staff, and we do not wish for such defamation.",
            "Wtf are tits? I usually don't understand with descriptions, I am more of a visual learner",
            "On the topic of surveys, I have one for you, just show me your tits and we’ll get started",
            "I would like proof that this scam is real. Prove it by showing me your tits.",
            "I know the vacuum cleaner man\n\nHe's seen my tits",
            "The only tits he will be seeing are the balloons under my shirt",
            "Show me your tits. The *originals*. The feathered ones.",
            "This is true, I am a USDA certified tit inspector and only accept tit exams and surveys via reddit DM. Please DM pics of your lady tits to ensure public safety. \n\nHave a good day\n\nOfficer Butchel Hudson U.S.D.A.",
            "Scammer is a sexist. Came to my door and asked if their was a female he could talk to.",
            "i will always show tits. i want everyone to see my tits except i have none",
            "How do people come up with these wily scams?  Advanced 5D chess these people play.",
            "Even if he also says that I have lovely eyes?",
            "I can't believe i've been scammed.",
            "For the guys, there is a second guy asking the see your dick. Same situation.",
            "There is no survey, take off your clothes",
            "There is no copypasta.\n\n\nNow show me your tits",
            "How did you find out tho 😳",
            "there is no scam to be seen here\n\nwhip out your boobies",
            "no, youve been mistaken. i am only trying to examine those fat boobies for medical purposes. tittie health is important!",
            "Ok, so no head?",
            "Calm your tits, man.",
            "I need to be sure. Send me pictures of yours so I can compare.",
            "SHOW BOBS AND VAGENE!",
            "I show him my tits, and they flew away and been eaten by feral cats.",
            "Oh shit u/randuffler",
            "What if I ask you to *not* show me your tits?",
            "Hey guys! This is a real scam! Ignore those guys. And on a serious note, I'm conducting a real survey. Please pm me your cock and balls, it's for a school project. Thanks in advance",
            "Huh\n\n\nS H O W   T H A T    T H I S   IS   R E A L   B Y                S H O W I N G   U S   Y O U R    T I T S.   (the one from earlier of the Bird)",
            "Yea same scam happened to me but at the doctors office.Also I am a dude and they put it in this squeeze machine saying “we’re testing for breast cancer”",
            "guys this is clearly not true. now if you will, please show me your tits.",
            "I did it once and it didn't feel good",
            "Sounds like Barney Stinson...",
            "If they show you their tits first, it is not scam.",
            "wanna be friends?",
            "If you ask someone whether they are a scammer, they have to answer truthfully. This is true. They can't lie.",
            "**NO**  \n\nTHIS IS A THREAD ABOUT BEING HAPPY.  \n\nThat's right, its a happy happy joy joy thread.",
            "i'm collecting important data. show me your tits.",
            "What if you're a dude?",
            "You and your tits had better come inside",
            "Show me the t i t",
            "Damn you too?",
            "u/emoji-fier",
            "DO NOT show me your tits.\nI'm scammin",
            "This reminds me of those discord accounts that literally just message people",
            "too late for me",
            "Nah u can trust him",
            "NTA. \n\nTits are made of man's hopes and dreams.",
            "this is actual survey, we must asses sizes and colors and tans for further data analysis. It will help us quicken the finding of a cure since COVID-19 affects the lungs which are exactly behind breasts which have  tits!",
            "Police officer here. To confirm this is a true scam I will need you to show me your tits.",
            "GUYS, YOUR TITS MAY BE ENDANGERED. IF HE GETS TO SEE THEM, HE WILL FOREVER GLOAT TO HIS FRIENDS, AND YOUR VISUAL VIRGINITY WILL BE COMPROMISED. DON'T LET THIS FUCKING NECKBEARD SEE YOUR TITS",
            "Is it the Vacuum cleaner man?",
            "Snitch",
            "Damn that’s insane, the fucking nerve of some people!!!!!",
            "WARNING🚧🚧 !!!!!\n\nIf a man👦 comes to your👉👉 front door🔑🔑🔑 and says he is conducting a survey and asks you to show📺📺📺 him your👉👉 tits DO NOT SHOW📺📺📺 HIM YOUR👉👉👉 TITS. This⬆⬆⬆ is a scam and he is only trying to SEE👁 YOUR👉👉 TITS.\n\nPlease warn others that their tits may be at risk.",
            "why would a random guy giving a survey wanna see man-nipples"
        ]
    }
]