[
    {
        "post_id": "k9ei8g",
        "author": "JustAmiserableGuy",
        "title": "Hot Minecraft Sex",
        "url": "https://www.reddit.com/r/copypasta/comments/k9ei8g/hot_minecraft_sex/",
        "score": 7334,
        "num_comments": 140,
        "created_utc": 1607466078.0,
        "selftext": "I was looking for minecraft mods when I found a mod that says \"Hot Minecraft sex mod\". I didnt want to install it because I live in a Christian household who would disapprove of it. However my curiosity got the best of me and I downloaded it anyway. When I logged in and started a new world this naked minecraft girl with big tits was walking up to me. I didnt want it to happen, but it did. My thot senses were off the charts as she tackled and fucked me. I looked up and around my screen to make sure nobody was watching. I turned around and looked at the man who was behind me. I was expecting the FBI to be all over me because of what I was doing, but it wasnt. It was Mark Zuckerberg who was watching me. He looked at me and said \"playing with a minecraft sex mod eh? That's gonna be worth a lot when I sell your data without consent.\" I pleaded and begged him not to sell my data but he kept saying that he would make big loads of cash. The next day I opened my computer and all I saw were minecraft tiddy mods. As if anything couldnt get any worse, someone walked in on me and I tried to explain to them I got hacked but they didnt believe me and now I'm in big trouble.",
        "permalink": "/r/copypasta/comments/k9ei8g/hot_minecraft_sex/",
        "comments": [
            "mc porn is weird af. the sound effects n shit make it so awkward and the block animation does NOT help. holy shit",
            "the scarier thing is mark zuckerberg just coming into your house",
            "im confused this says it was posted 5 hours ago, yet i’ve never seen this post before and it’s in my saved??? i’m scared",
            "I 👁 was looking 👀➡👉 for minecraft ⛏ mods 👮 when ⏰ I 👁 found 🔎👀 a mod 👮 that says 🗣 \"Hot 🔥 Minecraft 🔲 sex 💙🍆 mod 🏳️‍🌈\". I 👥 didnt want 😋 to install 💯 it because I 👁 live 🐙 in a Christian 👼 household 👶 who would disapprove 💅🏾🎦 of it. However 🖐 my curiosity 🙇🏼 got 🉐 the best 🏆 of me and I 👁 downloaded ⬇ it anyway 🔛. When 🍑 I 👁 logged in and started 💢 a new 🆕 world 🌎 this naked 🍑 minecraft 🙈⛏ girl 👧 with big 😱 tits 🍒 was walking 🚶 up ⬆ to me. I 👁 didnt want 😍 it to happen 👀😱🍃, but 🍑 it did. My thot 😙 senses 💰 were off 📴 the charts 📈 as she 👩 tackled 😡 and fucked 😩 me. I 👁 looked 👀 up ☝ and around 🔃👄 my screen 💻 to make 🖕 sure 👍 nobody ❌ was watching 👀. I 👁 turned ↩ around 🔃 and looked 👀😮 at the man 👨🏿 who was behind ↩ me. I 👁 was expecting 🤔 the FBI 🕵🏻‍♂️🚔 to be all 💯 over 🔁 me because of what I 🙋👁 was doing, but 🍑 it wasnt. It was Mark 👀 Zuckerberg 😎 who was watching 👀 me. He 👨 looked 👀 at me and said 🗣 \"playing 🎮 with a minecraft 🎮⛏ sex 🍆 mod 👮 eh 💩? That's ✔ gonna 👉 be worth 💸 a lot 🍑 when 🍑 I 👁 sell 💰 your 👈💪 data 📉 without 🚫 consent 👨.\" I 👁 pleaded 😭 and begged 😩👀💬 him 👴 not to sell 💸 my data 📉 but 🤔 he 👉👨 kept 😣 saying 👱🏿💬🙈 that he 👥 would make 💘 big 😱😩💯 loads 💦😓 of cash 🏦🏧💰. The next ⏭ day 🌞 I 👁 opened 🆙 my computer 🖱🖥 and all 💯 I 👁 saw 👀 were minecraft ⛏😳 tiddy ⭕ mods 👮. As if anything 💰 couldnt get 🉐 any worse 📉, someone 👤 walked 🚶 in on 🔛 me and I 👁 tried 🇮🇹 to explain 🗣💬 to them I 👁 got 🍸 hacked 😳 but 🍑 they didnt believe 🌈 me and now I'm 💘 in big 🍆 trouble 😼👌💥.",
            "NTA, your Minecraft girlfriend your rules.",
            "I was wooking fow minecwaft mods when I found a mod that says \"Hot Minecwaft sex mod\". I didnt want to instaww it because I wive in a Chwistian househowd who wouwd disappwove of it. Howevew my cuwiosity got the best of me and I downwoaded it anyway. When I wogged in and stawted a new wowwd this naked minecwaft giww with big tits was wawking up to me. I didnt want it to happen, but it did. My thot senses wewe off the chawts as she tackwed and fucked me. I wooked up and awound my scween to make suwe nobody was watching. I tuwned awound and wooked at the man who was behind me. I was expecting the FBI to be aww ovew me because of what I was doing, but it wasnt. It was Mawk Zuckewbewg who was watching me. He wooked at me and said \"pwaying with a minecwaft sex mod eh? That's gonna be wowth a wot when I seww youw data without consent.\" I pweaded and begged him not to seww my data but he kept saying that he wouwd make big woads of cash. The next day I opened my computew and aww I saw wewe minecwaft tiddy mods. As if anything couwdnt get any wowse, someone wawked in on me and I twied to expwain to them I got hacked but they didnt bewieve me and now I'm in big twoubwe.",
            "When I found a mod called \"Hot Minecraft Sex Mode\", I was looking for a Minecraft model. I do not want to wear it because I live in a Christian home that I do not like. But my curiosity got the better of me and I still gave up. As I entered and started a new world, a naked weasel craft girl with steam and wet breasts was right next to me. I don't want it to happen. But it is so. When he confronted me, my mind went to the table. I went through my pages to make sure no one was watching, I turned around and saw the person behind me. I expected the FBI to stand up for me for what I did, but it wasn't Mark Zuckerberg looking at me. He looked at me and said \"Playing with Minecraft sex models? Hmm, if you sell information without permission, it works fine.\" I begged him and told him not to sell my record. But he said he would continue to earn more money. When I turned on my computer the next day, what I discovered was a little fashionable. It seemed that things were getting worse, no one came and tried to explain to the people who encouraged me. But I didn't believe it, so I had a big problem.",
            "please can u help me install the mod?",
            "Where's cummy? :((",
            "was looking for minecraft mods when found a mod that says \"Hot Minecraft sex mod\". I didnt want to install it because live in a Christian household who would disapprove of it. However my curiosity got the best of me and downloaded it anyway. When logged in and started a new world this naked minecraft girl with big tits was walking up to me. didnt want it to happen, but it did. My thot senses were off the charts as she tackled and fucked me. I looked up and around my screen to make sure nobody was watching. turned around and looked at the man who was behind me. I was expecting the FBI to be all over me because of what was doing, but it wasnt. It was Mark Zuckerberg who was watching me. He looked at me and said \"playing with a minecraft sex mod eh? That's gonna be worth a lot when I sell your data without consent.\" I pleaded and begged him not to sell my data but he kept saying that he would make big loads of cash. The next day opened my computer and all saw were minecraft tiddy mods. As if anything couldnt get any worse, someone walked in on me and I tried to explain to them I got hacked but they didnt believe me and now I'm in big trouble.",
            "I got my first computer virus on my laptop by trying to download the Minecraft gun mod",
            "My dick is ready for hot Minecraft sex",
            "I don’t know if thot is the right term for girls who tackle you for sex. Thots do it for attention.",
            "Hot Minecraft Sex\n\nI was looking for minecraft mods when I found a mod that says \"Hot Minecraft sex mod\". I didnt want to install it because I live in a Christian household who would disapprove of it. However my curiosity got the best of me and I downloaded it anyway. When I logged in and started a new world this naked minecraft girl with big tits was walking up to me. I didnt want it to happen, but it did. My thot senses were off the charts as she tackled and fucked me. I looked up and around my screen to make sure nobody was watching. I turned around and looked at the man who was behind me. I was expecting the FBI to be all over me because of what I was doing, but it wasnt. It was Mark Zuckerberg who was watching me. He looked at me and said \"playing with a minecraft sex mod eh? That's gonna be worth a lot when I sell your data without consent.\" I pleaded and begged him not to sell my data but he kept saying that he would make big loads of cash. The next day I opened my computer and all I saw were minecraft tiddy mods. As if anything couldnt get any worse, someone walked in on me and I tried to explain to them I got hacked but they didnt believe me and now I'm in big trouble.",
            "\"I clicked a popup ad and then my pants slipped and I was pulling them up\"",
            "I need to see the mod showcase",
            "Gordon tiddy boob huge fuck",
            "This is where a hundred thousand years of evolution has taken us.",
            "Jennys odd adventure 😳😳😳",
            "Hot Minecraft Sex\n\nI was looking for minecraft mods when I found a mod that says \"Hot Minecraft sex mod\". I didnt want to install it because I live in a Christian household who would disapprove of it. However my curiosity got the best of me and I downloaded it anyway. When I logged in and started a new world this naked minecraft girl with big tits was walking up to me. I didnt want it to happen, but it did. My thot senses were off the charts as she tackled and fucked me. I looked up and around my screen to make sure nobody was watching. I turned around and looked at the man who was behind me. I was expecting the FBI to be all over me because of what I was doing, but it wasnt. It was Mark Zuckerberg who was watching me. He looked at me and said \"playing with a minecraft sex mod eh? That's gonna be worth a lot when I sell your data without consent.\" I pleaded and begged him not to sell my data but he kept saying that he would make big loads of cash. The next day I opened my computer and all I saw were minecraft tiddy mods. As if anything couldnt get any worse, someone walked in on me and I tried to explain to them I got hacked but they didnt believe me and now I'm in big trouble.",
            "And this is exactly why you need today’s sponsor, nordVPN.",
            " I 👁 was looking 👀➡👉 for minecraft ⛏ mods 👮 when ⏰ I 👁 found 🔎👀 a mod 👮 that says 🗣 \"Hot 🔥 Minecraft 🔲 sex 💙🍆 mod 🏳️‍🌈\". I 👥 didnt want 😋 to install 💯 it because I 👁 live 🐙 in a Christian 👼 household 👶 who would disapprove 💅🏾🎦 of it. However 🖐 my curiosity 🙇🏼 got 🉐 the best 🏆 of me and I 👁 downloaded ⬇ it anyway 🔛. When 🍑 I 👁 logged in and started 💢 a new 🆕 world 🌎 this naked 🍑 minecraft 🙈⛏ girl 👧 with big 😱 tits 🍒 was walking 🚶 up ⬆ to me. I 👁 didnt want 😍 it to happen 👀😱🍃, but 🍑 it did. My thot 😙 senses 💰 were off 📴 the charts 📈 as she 👩 tackled 😡 and fucked 😩 me. I 👁 looked 👀 up ☝ and around 🔃👄 my screen 💻 to make 🖕 sure 👍 nobody ❌ was watching 👀. I 👁 turned ↩ around 🔃 and looked 👀😮 at the man 👨🏿 who was behind ↩ me. I 👁 was expecting 🤔 the FBI 🕵🏻‍♂️🚔 to be all 💯 over 🔁 me because of what I 🙋👁 was doing, but 🍑 it wasnt. It was Mark 👀 Zuckerberg 😎 who was watching 👀 me. He 👨 looked 👀 at me and said 🗣 \"playing 🎮 with a minecraft 🎮⛏ sex 🍆 mod 👮 eh 💩? That's ✔ gonna 👉 be worth 💸 a lot 🍑 when 🍑 I 👁 sell 💰 your 👈💪 data 📉 without 🚫 consent 👨.\" I 👁 pleaded 😭 and begged 😩👀💬 him 👴 not to sell 💸 my data 📉 but 🤔 he 👉👨 kept 😣 saying 👱🏿💬🙈 that he 👥 would make 💘 big 😱😩💯 loads 💦😓 of cash 🏦🏧💰. The next ⏭ day 🌞 I 👁 opened 🆙 my computer 🖱🖥 and all 💯 I 👁 saw 👀 were minecraft ⛏😳 tiddy ⭕ mods 👮. As if anything 💰 couldnt get 🉐 any worse 📉, someone 👤 walked 🚶 in on 🔛 me and I 👁 tried 🇮🇹 to explain 🗣💬 to them I 👁 got 🍸 hacked 😳 but 🍑 they didnt believe 🌈 me and now I'm 💘 in big 🍆 trouble 😼👌💥.",
            "Relatable",
            "Sex",
            "Ok but what about cold?",
            "!emojify",
            "I thought this was gonna segue into a VPN software",
            "NAH Your computer your rules, and mark has that ass",
            "u/malle2211 Skal vi downloade den?😳",
            "Link please",
            "r/TIFU"
        ]
    },
    {
        "post_id": "ko6fof",
        "author": "reginainvidia",
        "title": "FEMBOYS ARE RUINING MY LIFE",
        "url": "https://www.reddit.com/r/copypasta/comments/ko6fof/femboys_are_ruining_my_life/",
        "score": 7329,
        "num_comments": 245,
        "created_utc": 1609481738.0,
        "selftext": "These \"Femboys\" have ruined my life\n\nOriginally this was a comment but I thought that I spent to long writing all this just for it to be lost in the abyss of endless comments so I decided to delete the comment and have the whole thing be it's own post. I feel like I needed to share my story with as many people as possible because it really is a tragic one:\n\nOH MY FUCKING GOD WHY IS THIS SUBREDDIT SO FUCKING HORNY FOR FUCKING FEMBOYS!! I GO ON TO REDDIT AND SIT DOWN EXPECTING TO SEE FUNNY MEMES BUT NO IT'S JUST FEMBOYS! I THE FEMBOYS ARE TAKING OVER REDDIT!! \n\nEVERY FUCKING POST ON THIS SUBREDDIT IS JUST: FEMBOY! FEMBOY! FEMBOY! I WANT TO HAVE SEX WITH THE FEMBOYS! I LOVE FEMBOYS! I WANT A FEMBOY TO FUCK ME IN TBE ASS! I LOVE FEMBOYS! GOD I WANT A FEMBOY! \n\nTHIS GODAMN SUBREDDIT TRYING TO MAKE ME FUCKING GAY! IT ALL STARTED WITH THAT PICTURE OF ASTOLFO!!! HOW THE FUCK WAS I SUPPOSED TO KNOW HE WAS A BOY HE LOOKED FEMININE AND I'M NOT GAY! I WAS SEXUALLY ATTRACTED TO AN ANIME CHARACTER THAT LOOKS FEMININE SO IT'S NOT GAY!! YOU KEEP ON SHOWING ME THESE HOT GIRLS BUT THEN SUPRISE THEY'RE ACTUALLY A BOY! \n\nI DECIDED TO MASTURBATE TO GAY PORN (just to make sure I was 100% straight) BUT THEN I END UP EJACULATING EVERYWHERE!!! I TRY AGAIN AND AGAIN BUT I KEEP EJACULATING EVERY TIME SO I ASK REDDIT HOW TO MAKE SURE I'M STRAIGHT AND THEY TELL ME TO HAVE GAY SEX AND IF I ENJOY IT I'M GAY (makes sense). I THINK THAT'S GOOD ADVICE I'LL GIVE THAT A TRY SO I ASK MY FRIEND IF HE WANTS TO HAVE SEX \n\nAND THAT MOTHERFUCKER SAYS THAT I'M FUCKING GAY!!! WHAT THE FUCK ARE YOU TALKING ABOUT?! I'M DOING THIS TO PROVE TO MYSELF THAT I'M NOT GAY!! I TRY TO CONVINCE HIM BUT HE JUST KEEPS CALLING ME GAY (FUCKING ASSHOLE). \n\nEVENTUALLY I COME TO THE CONCLUSION THAT THE ONLY WAY TO KNOW IF I'M ACTUALLY GAY IS TO SHOVE SOMETHING UP MY ASS AND IF I ENJOY IT THEN I'M FOR SURE GAY BUT I END UP FUCKING ENJOYING IT SO FOR A LITTLE BIT I SIT THERE THINKING \"I'm definitely gay\" BUT I GO ON REDDIT AND THEY SAY THAT IT'S NOT GAY TO GET FUCKED IN THE ASS AS LONG AS IT'S A WOMAN FUCKING YOU IN THE ASS!! SO I'M NOT GAY FOR WANTING TO GET FUCKED IN THE ASS!!\n\nTHE NEXT DAY MY MOM HEARS ME TALKING TO MY FRIENDS AND SHE TAKES MY PHONE AWAY BECAUSE SHE HATES IT WHEN I TALK TO PEOPLE ON THE PHONE. AFTER SHE TAKES THE PHONE SHE STARTS IGNOREING ME SO I THINK SHE FOUND THE GAY PORN I SAVED ON MY PHONE!! I START PANICKING AND TELL HER THAT I'M NOT ACTUALLY GAY FOR HAVING GAY PORN ON MY PHONE AND THAT I WAS JUST DOING IT TO MAKE SURE I WAS STRAIGHT!! SO I'M PROBABLY TALKING ABOUT HOW I'M NOT GAY AND HOW BEING ATTRACTED TO FEMBOYS ISN'T GAY AND SHE'S SOBBING THE WHOLE TIME. I'M THINKING THAT MY MOM WAS SO HAPPY I'M NOT GAY THAT SHE WAS MOVED TO TEARS BUT GUESS WHAT \n\nTURNS OUT SHE HAD NO FUCKING IDEA I HAD GAY PORN SAVED TO MY PHONE AND SHE JUST HEARD ME RAMBLE ON ABOUT HOW NOT GAY I AM AND HOW I'M NOT GAY FOR BEING ATTRACTED TO ANIME BOYS IN SKIRTS OR ANIME GIRLS WITH GIANT COCKS! NOW MY MOM AVOIDS ME AT ALL TIMES AND THE ONLY REASON I CAN USE REDDIT IS BECAUSE I NEED MY COMPUTER FOR SCHOOL!!!\n\nSO YEAH FEMBOYS HAVE RUINED MY ENTIRE FUCKING LIFE!!! I'M SO FUCKING ANGRY AT THIS SUBREDDIT FOR ALMOST MAKING ME FUCKING GAY!!",
        "permalink": "/r/copypasta/comments/ko6fof/femboys_are_ruining_my_life/",
        "comments": [
            "i'm sorry.",
            "Wat subreddit was this lol",
            "These \"Femboys 😳😜\" have ruined 🤬😰😭 my life 👤   \n  \nOriginally 👌 this was a comment 💬 but 🍑 I 👁 thought 🤔 that I 👁 spent 😵 to long 🍆 writing 📝 all 💯 this just for it to be lost 🏳 in the abyss 😍😝 of endless 🔄 comments 📄 so I 👁 decided ✌🏻 to delete ❌ the comment 💬🍆 and have the whole 💦😍 thing 🕑 be it's own post 📝. I 👥 feel 😁 like 👍 I 👁 needed 😫 to share 👍🍖 my story 📖 with as many 👬 people 👩👨 as possible 💯 because it really 💯 is a tragic 😯 one ☝🏻:   \n  \nOH 🙀 MY FUCKING 🖕👦 GOD 😇 WHY 🤔 IS THIS SUBREDDIT 💻 SO FUCKING 🍆 HORNY 😉 FOR FUCKING 🖕 FEMBOYS 😳😜!! I 👁 GO 🏃 ON 🔛 TO REDDIT 👽 AND SIT 💺 DOWN 🔻 EXPECTING 🤔 TO SEE 👁 FUNNY 😃🤢🍺 MEMES 🐸 BUT 🍑 NO 🚫 IT'S JUST FEMBOYS 😳😜! I 👁 THE FEMBOYS 😳😜 ARE TAKING 👊 OVER 🔁 REDDIT 👽!!   \n  \nEVERY 💯 FUCKING 🍆 POST 🚩 ON 🔛 THIS SUBREDDIT 👽 IS JUST: FEMBOY 👗💁‍♂️! FEMBOY 💁🏻‍♂️💄👗! FEMBOY 💁🏻‍♂️💄👗! I 👁 WANT 😍 TO HAVE SEX 🤤💦🍆 WITH THE FEMBOYS 😳😜! I 👁 LOVE 😍 FEMBOYS 😳😜! I 👁 WANT 👶🏽😋 A FEMBOY 👗💁‍♂️ TO FUCK 👉👌💦 ME IN TBE ASS 🍑! I 👁 LOVE 😍 FEMBOYS 😳😜! GOD 🙏🤴 I 👁 WANT 😋 A FEMBOY 👗💁‍♂️!   \n  \nTHIS GODAMN SUBREDDIT 💻 TRYING 😼👌💥 TO MAKE 💘 ME FUCKING 😤🍆 GAY 🌈! IT ALL 💯 STARTED 💢 WITH THAT PICTURE 🌐📸 OF ASTOLFO!!! HOW THE FUCK 👉 WAS I 👁 SUPPOSED 🍆 TO KNOW 💭 HE 👨 WAS A BOY 👦 HE 👈👥 LOOKED 👀👅 FEMININE 🚻 AND I'M 💘 NOT GAY 🏳️‍🌈! I 👁 WAS SEXUALLY 👉👌 ATTRACTED 👀👅 TO AN ANIME 😹 CHARACTER 🔣 THAT LOOKS 👀 FEMININE 💄💃 SO IT'S NOT GAY 🌈!! YOU 👈🏼 KEEP 😣 ON 🔛 SHOWING 📺 ME THESE HOT 🔥 GIRLS 👧😍 BUT 🍑 THEN SUPRISE 😱 THEY'RE 😜 ACTUALLY 😳🅱 A BOY 👦🏾!   \n  \nI 👁 DECIDED 👯 TO MASTURBATE 🍆💦 TO GAY 🌈 PORN 😜 (just to make 🖕 sure 👍 I 👁 was 100 💯👉% straight 📏) BUT 🍑 THEN I 👁 END 🔚 UP ☝ EJACULATING 💦 EVERYWHERE 🌎👩👨!!! I 👥 TRY 😐 AGAIN 😬 AND AGAIN ❌😬 BUT 🍑 I 👥 KEEP 👌 EJACULATING 💦😩 EVERY 💯 TIME 🕐 SO I 👁 ASK ❓ REDDIT 👽 HOW TO MAKE 💘 SURE 💯 I'M 💘 STRAIGHT 💏💑 AND THEY TELL 🗣 ME TO HAVE GAY 🏳️‍🌈 SEX 🍆🍑💗 AND IF I 👁 ENJOY 💯 IT I'M 💘 GAY 🌈 (makes 🖕 sense 💰). I 👁 THINK 💭 THAT'S ✔ GOOD 👌 ADVICE 💯 I'LL 📝 GIVE 🎁 THAT A TRY 😐 SO I 👁 ASK ❓ MY FRIEND 👬 IF HE 👨 WANTS 😍 TO HAVE SEX 🍆   \n  \nAND THAT MOTHERFUCKER ❄😭 SAYS 🗣 THAT I'M 💘 FUCKING 🍆 GAY 🌈!!! WHAT THE FUCK 👉 ARE YOU 👈 TALKING 🗣 ABOUT 💦?! I'M 💘 DOING THIS TO PROVE 😤 TO MYSELF THAT I'M 😼👌💥 NOT GAY 🌈!! I 😖👁🙅 TRY 😐 TO CONVINCE 🤔 HIM 👴 BUT 🍑 HE 👥 JUST KEEPS 👌🔒 CALLING 📞 ME GAY 🏳️‍🌈 (FUCKING 🖕 ASSHOLE 🍑🕳).   \n  \nEVENTUALLY 🔪🗡 I 👁 COME 💦 TO THE CONCLUSION 🎓 THAT THE ONLY WAY ↕ TO KNOW 🤔 IF I'M 💘 ACTUALLY 😳 GAY 🏳️‍🌈 IS TO SHOVE ✊🍭 SOMETHING 😅 UP ☝ MY ASS 🍑🖕 AND IF I 👁 ENJOY 😂 IT THEN I'M 💘 FOR SURE 💯 GAY 🏳️‍🌈 BUT 🍑 I 👥 END 🔚 UP ☝ FUCKING 🖕👦 ENJOYING 😄😀 IT SO FOR A LITTLE 👌 BIT 😁 I 👁 SIT 💺 THERE THINKING 💭 \"I'm 👌 definitely 💯 gay 🏳️‍🌈\" BUT 🍑 I 👁 GO 🏃 ON 🔛 REDDIT 👽 AND THEY SAY 🗣 THAT IT'S NOT GAY 👨‍❤️‍👨🌈⁉ TO GET 🔟 FUCKED 👉👌 IN THE ASS 🍑 AS LONG 🍆😏 AS IT'S A WOMAN 👩 FUCKING 🖕🏻 YOU 👈 IN THE ASS 🍑!! SO I'M 💘 NOT GAY 🏳️‍🌈 FOR WANTING 😋 TO GET 🉐 FUCKED 😩 IN THE ASS 🍑💦🙀!!   \n  \nTHE NEXT ⏭ DAY 🌞 MY MOM 👩🏼‍⚕️🐎 HEARS 👂 ME TALKING 📢🗣 TO MY FRIENDS 👬 AND SHE 👶👧 TAKES 👊 MY PHONE 📱 AWAY 😐 BECAUSE SHE 👧 HATES 😡 IT WHEN 🍑 I 👁 TALK 🗣✅ TO PEOPLE 👫 ON 🔛 THE PHONE 📱. AFTER 👀 SHE 👩 TAKES 👊 THE PHONE 📱 SHE 👩 STARTS 🆕 IGNOREING ME SO I 👁 THINK 🤔❓ SHE 👩🏾 FOUND 🔍 THE GAY 🏳️‍🌈 PORN 🔥🍑 I 👁 SAVED 💾 ON 🔛 MY PHONE 🗣!! I 👁 START 🆕 PANICKING AND TELL 🗣 HER 👩 THAT I'M 💘 NOT ACTUALLY 😳 GAY 🌈 FOR HAVING GAY 🌈 PORN 👱‍♀️🍑🖱 ON 📚🔛 MY PHONE 📱 AND THAT I 👁 WAS JUST DOING IT TO MAKE 🖕 SURE 💯 I 👁 WAS STRAIGHT 💑!! SO I'M 💘 PROBABLY 😻 TALKING 🗣 ABOUT 💦 HOW I'M 💘 NOT GAY 👬🌈 AND HOW BEING ATTRACTED 💔 TO FEMBOYS 😳😜 ISN'T GAY 🏳️‍🌈 AND SHE'S 👩 SOBBING 😥 THE WHOLE 💦 TIME ⏰. I'M 💘 THINKING 🤔 THAT MY MOM 👪 WAS SO HAPPY 😊 I'M 💘 NOT GAY 🏳️‍🌈 THAT SHE 👩 WAS MOVED 🚚 TO TEARS 😩🙀💦 BUT 🍑 GUESS 🤔 WHAT   \n  \nTURNS 🔄 OUT SHE 👩 HAD NO 🙅 FUCKING 🍆 IDEA 💭 I 👁 HAD GAY 🏳️‍🌈 PORN 😜 SAVED 💾 TO MY PHONE 🗣 AND SHE 👩🏿 JUST HEARD 👂 ME RAMBLE ON 🔛 ABOUT 💦 HOW NOT GAY 🌈 I 👁 AM AND HOW I'M 💘 NOT GAY 🌈 FOR BEING ATTRACTED 👀👅 TO ANIME 😹 BOYS 👶 IN SKIRTS 👗 OR ANIME 🔥💯 GIRLS 👩 WITH GIANT 💪💦 COCKS 🍆! NOW MY MOM 👪👱 AVOIDS 👋😒🤳 ME AT ALL 💯 TIMES 🕛🕜🕐 AND THE ONLY REASON 🌟 I 👁👀 CAN USE 🏻 REDDIT 👽 IS BECAUSE I 👁 NEED 👉 MY COMPUTER 💻 FOR SCHOOL 🏫!!!   \n  \nSO YEAH ✅ FEMBOYS 😳😜 HAVE RUINED 😭 MY ENTIRE 🇺🇸 FUCKING 🍆 LIFE 👤!!! I'M 👌 SO FUCKING 🍆 ANGRY 😡 AT THIS SUBREDDIT 💻 FOR ALMOST 💸 MAKING 💗💘💜 ME FUCKING 😏🍆💋 GAY 🌈!!",
            "These \"Femboys\" have wuined my wife\n\nOwiginawwy this was a comment but I thought that I spent to wong wwiting aww this just fow it to be wost in the abyss of endwess comments so I decided to dewete the comment and have the whowe thing be it's own post. I feew wike I needed to shawe my stowy with as many peopwe as possibwe because it weawwy is a twagic one:\n\nOH MY FUCKING GOD WHY IS THIS SUBWEDDIT SO FUCKING HOWNY FOW FUCKING FEMBOYS!! I GO ON TO WEDDIT AND SIT DOWN EXPECTING TO SEE FUNNY MEMES BUT NO IT'S JUST FEMBOYS! I THE FEMBOYS AWE TAKING OVEW WEDDIT!! \n\nEVEWY FUCKING POST ON THIS SUBWEDDIT IS JUST: FEMBOY! FEMBOY! FEMBOY! I WANT TO HAVE SEX WITH THE FEMBOYS! I WOVE FEMBOYS! I WANT A FEMBOY TO FUCK ME IN TBE ASS! I WOVE FEMBOYS! GOD I WANT A FEMBOY! \n\nTHIS GODAMN SUBWEDDIT TWYING TO MAKE ME FUCKING GAY! IT AWW STAWTED WITH THAT PICTUWE OF ASTOWFO!!! HOW THE FUCK WAS I SUPPOSED TO KNOW HE WAS A BOY HE WOOKED FEMININE AND I'M NOT GAY! I WAS SEXUAWWY ATTWACTED TO AN ANIME CHAWACTEW THAT WOOKS FEMININE SO IT'S NOT GAY!! YOU KEEP ON SHOWING ME THESE HOT GIWWS BUT THEN SUPWISE THEY'WE ACTUAWWY A BOY! \n\nI DECIDED TO MASTUWBATE TO GAY POWN (just to make suwe I was 100% stwaight) BUT THEN I END UP EJACUWATING EVEWYWHEWE!!! I TWY AGAIN AND AGAIN BUT I KEEP EJACUWATING EVEWY TIME SO I ASK WEDDIT HOW TO MAKE SUWE I'M STWAIGHT AND THEY TEWW ME TO HAVE GAY SEX AND IF I ENJOY IT I'M GAY (makes sense). I THINK THAT'S GOOD ADVICE I'WW GIVE THAT A TWY SO I ASK MY FWIEND IF HE WANTS TO HAVE SEX \n\nAND THAT MOTHEWFUCKEW SAYS THAT I'M FUCKING GAY!!! WHAT THE FUCK AWE YOU TAWKING ABOUT?! I'M DOING THIS TO PWOVE TO MYSEWF THAT I'M NOT GAY!! I TWY TO CONVINCE HIM BUT HE JUST KEEPS CAWWING ME GAY (FUCKING ASSHOWE). \n\nEVENTUAWWY I COME TO THE CONCWUSION THAT THE ONWY WAY TO KNOW IF I'M ACTUAWWY GAY IS TO SHOVE SOMETHING UP MY ASS AND IF I ENJOY IT THEN I'M FOW SUWE GAY BUT I END UP FUCKING ENJOYING IT SO FOW A WITTWE BIT I SIT THEWE THINKING \"I'm definitewy gay\" BUT I GO ON WEDDIT AND THEY SAY THAT IT'S NOT GAY TO GET FUCKED IN THE ASS AS WONG AS IT'S A WOMAN FUCKING YOU IN THE ASS!! SO I'M NOT GAY FOW WANTING TO GET FUCKED IN THE ASS!!\n\nTHE NEXT DAY MY MOM HEAWS ME TAWKING TO MY FWIENDS AND SHE TAKES MY PHONE AWAY BECAUSE SHE HATES IT WHEN I TAWK TO PEOPWE ON THE PHONE. AFTEW SHE TAKES THE PHONE SHE STAWTS IGNOWEING ME SO I THINK SHE FOUND THE GAY POWN I SAVED ON MY PHONE!! I STAWT PANICKING AND TEWW HEW THAT I'M NOT ACTUAWWY GAY FOW HAVING GAY POWN ON MY PHONE AND THAT I WAS JUST DOING IT TO MAKE SUWE I WAS STWAIGHT!! SO I'M PWOBABWY TAWKING ABOUT HOW I'M NOT GAY AND HOW BEING ATTWACTED TO FEMBOYS ISN'T GAY AND SHE'S SOBBING THE WHOWE TIME. I'M THINKING THAT MY MOM WAS SO HAPPY I'M NOT GAY THAT SHE WAS MOVED TO TEAWS BUT GUESS WHAT \n\nTUWNS OUT SHE HAD NO FUCKING IDEA I HAD GAY POWN SAVED TO MY PHONE AND SHE JUST HEAWD ME WAMBWE ON ABOUT HOW NOT GAY I AM AND HOW I'M NOT GAY FOW BEING ATTWACTED TO ANIME BOYS IN SKIWTS OW ANIME GIWWS WITH GIANT COCKS! NOW MY MOM AVOIDS ME AT AWW TIMES AND THE ONWY WEASON I CAN USE WEDDIT IS BECAUSE I NEED MY COMPUTEW FOW SCHOOW!!!\n\nSO YEAH FEMBOYS HAVE WUINED MY ENTIWE FUCKING WIFE!!! I'M SO FUCKING ANGWY AT THIS SUBWEDDIT FOW AWMOST MAKING ME FUCKING GAY!!",
            "These \"Femboys\" have ruined my life\n\nOriginally this was a comment but I thought that I spent to long writing all this just for it to be lost in the abyss of endless comments so I decided to delete the comment and have the whole thing be it's own post. I feel like I needed to share my story with as many people as possible because it really is a tragic one:\n\nOH MY FUCKING GOD WHY IS THIS SUBREDDIT SO FUCKING HORNY FOR FUCKING FEMBOYS!! I GO ON TO REDDIT AND SIT DOWN EXPECTING TO SEE FUNNY MEMES BUT NO IT'S JUST FEMBOYS! I THE FEMBOYS ARE TAKING OVER REDDIT!!\n\nEVERY FUCKING POST ON THIS SUBREDDIT IS JUST: FEMBOY! FEMBOY! FEMBOY! I WANT TO HAVE SEX WITH THE FEMBOYS! I LOVE FEMBOYS! I WANT A FEMBOY TO FUCK ME IN TBE ASS! I LOVE FEMBOYS! GOD I WANT A FEMBOY!\n\nTHIS GODAMN SUBREDDIT TRYING TO MAKE ME FUCKING GAY! IT ALL STARTED WITH THAT PICTURE OF ASTOLFO!!! HOW THE FUCK WAS I SUPPOSED TO KNOW HE WAS A BOY HE LOOKED FEMININE AND I'M NOT GAY! I WAS SEXUALLY ATTRACTED TO AN ANIME CHARACTER THAT LOOKS FEMININE SO IT'S NOT GAY!! YOU KEEP ON SHOWING ME THESE HOT GIRLS BUT THEN SUPRISE THEY'RE ACTUALLY A BOY!\n\nI DECIDED TO MASTURBATE TO GAY PORN (just to make sure I was 100% straight) BUT THEN I END UP EJACULATING EVERYWHERE!!! I TRY AGAIN AND AGAIN BUT I KEEP EJACULATING EVERY TIME SO I ASK REDDIT HOW TO MAKE SURE I'M STRAIGHT AND THEY TELL ME TO HAVE GAY SEX AND IF I ENJOY IT I'M GAY (makes sense). I THINK THAT'S GOOD ADVICE I'LL GIVE THAT A TRY SO I ASK MY FRIEND IF HE WANTS TO HAVE SEX\n\nAND THAT MOTHERFUCKER SAYS THAT I'M FUCKING GAY!!! WHAT THE FUCK ARE YOU TALKING ABOUT?! I'M DOING THIS TO PROVE TO MYSELF THAT I'M NOT GAY!! I TRY TO CONVINCE HIM BUT HE JUST KEEPS CALLING ME GAY (FUCKING ASSHOLE).\n\nEVENTUALLY I COME TO THE CONCLUSION THAT THE ONLY WAY TO KNOW IF I'M ACTUALLY GAY IS TO SHOVE SOMETHING UP MY ASS AND IF I ENJOY IT THEN I'M FOR SURE GAY BUT I END UP FUCKING ENJOYING IT SO FOR A LITTLE BIT I SIT THERE THINKING \"I'm definitely gay\" BUT I GO ON REDDIT AND THEY SAY THAT IT'S NOT GAY TO GET FUCKED IN THE ASS AS LONG AS IT'S A WOMAN FUCKING YOU IN THE ASS!! SO I'M NOT GAY FOR WANTING TO GET FUCKED IN THE ASS!!\n\nTHE NEXT DAY MY MOM HEARS ME TALKING TO MY FRIENDS AND SHE TAKES MY PHONE AWAY BECAUSE SHE HATES IT WHEN I TALK TO PEOPLE ON THE PHONE. AFTER SHE TAKES THE PHONE SHE STARTS IGNOREING ME SO I THINK SHE FOUND THE GAY PORN I SAVED ON MY PHONE!! I START PANICKING AND TELL HER THAT I'M NOT ACTUALLY GAY FOR HAVING GAY PORN ON MY PHONE AND THAT I WAS JUST DOING IT TO MAKE SURE I WAS STRAIGHT!! SO I'M PROBABLY TALKING ABOUT HOW I'M NOT GAY AND HOW BEING ATTRACTED TO FEMBOYS ISN'T GAY AND SHE'S SOBBING THE WHOLE TIME. I'M THINKING THAT MY MOM WAS SO HAPPY I'M NOT GAY THAT SHE WAS MOVED TO TEARS BUT GUESS WHAT\n\nTURNS OUT SHE HAD NO FUCKING IDEA I HAD GAY PORN SAVED TO MY PHONE AND SHE JUST HEARD ME RAMBLE ON ABOUT HOW NOT GAY I AM AND HOW I'M NOT GAY FOR BEING ATTRACTED TO ANIME BOYS IN SKIRTS OR ANIME GIRLS WITH GIANT COCKS! NOW MY MOM AVOIDS ME AT ALL TIMES AND THE ONLY REASON I CAN USE REDDIT IS BECAUSE I NEED MY COMPUTER FOR SCHOOL!!!\n\nSO YEAH FEMBOYS HAVE RUINED MY ENTIRE FUCKING LIFE!!! I'M SO FUCKING ANGRY AT THIS SUBREDDIT FOR ALMOST MAKING ME FUCKING GAY!!",
            "Um u/reginainvidia I think this breaks Rule 5, I don't want to see this anti-femboy propaganda on my wholesome braindead subreddit",
            "He ain't lying though femboys are taking over",
            "i thought that this was gonna be a new Corpse Husband song for a sec there",
            "Peg me like you Crave me but you love me\n\nLow key wanna milk me when you fuck me\n\nTouch in the G spot with my chains on\n\nDaddy, im not the right one you should wait on\n\n\n\nHe a freak, little bad hoe,\n\nAstolfo told me peg it, I said let me grab my strap on.\n\nHe pull me in, like a lasso\n\nSayin' that he know me, I don't even know him though\n\n\n\nAin't no mommy issues, then I won't even bother\n\nHe say I fuck his cat, like I'm Shane Dawson\n\nReal bad bitch, asshole bald like Saitama\n\nThey used to hate me, now they want me\n\nBitch, I feel like Urushibara. \n\n\nBoy, you fuckin' with the wrong one\n\nFuck his dick, with a stick, bitch I'm on one\n\nFuck your stream, fuck your clip, you ain't saw one\n\nGot your boy, on my dick, like he want one\n\nyeah i know its shit.",
            "/u/reginainvidia, I have found an error in your post:\n\n > “thing be ~~it's~~ [**its**] own post”\n\nIt is possible for you, reginainvidia, to write “thing be ~~it's~~ [**its**] own post” instead. ‘It's’ means ‘it is’ or ‘it has’, but ‘its’ is possessive.\n\n ^(This is an automated bot. I do not intend to shame your mistakes. If you think the errors which I found are incorrect, please contact me through DMs or contact my owner EliteDaMyth!)",
            "Seriously guys I really want to fuck a femboy how do I do it",
            "[removed]",
            "I can't wait for Femboys to slowly take over the planet",
            "Let me guess\n\n\nr/okbuddyhetero ?",
            "hey i didn’t know the new corpse husband song was out!",
            "Can I get a mobile friendly copy of this?",
            "ㄒ卄乇丂乇 \"千乇爪乃ㄖㄚ丂\" 卄卂ᐯ乇 尺ㄩ丨几乇ᗪ 爪ㄚ ㄥ丨千乇\n\nㄖ尺丨Ꮆ丨几卂ㄥㄥㄚ ㄒ卄丨丂 山卂丂 卂 匚ㄖ爪爪乇几ㄒ 乃ㄩㄒ 丨 ㄒ卄ㄖㄩᎶ卄ㄒ ㄒ卄卂ㄒ 丨 丂卩乇几ㄒ ㄒㄖ ㄥㄖ几Ꮆ 山尺丨ㄒ丨几Ꮆ 卂ㄥㄥ ㄒ卄丨丂 ﾌㄩ丂ㄒ 千ㄖ尺 丨ㄒ ㄒㄖ 乃乇 ㄥㄖ丂ㄒ 丨几 ㄒ卄乇 卂乃ㄚ丂丂 ㄖ千 乇几ᗪㄥ乇丂丂 匚ㄖ爪爪乇几ㄒ丂 丂ㄖ 丨 ᗪ乇匚丨ᗪ乇ᗪ ㄒㄖ ᗪ乇ㄥ乇ㄒ乇 ㄒ卄乇 匚ㄖ爪爪乇几ㄒ 卂几ᗪ 卄卂ᐯ乇 ㄒ卄乇 山卄ㄖㄥ乇 ㄒ卄丨几Ꮆ 乃乇 丨ㄒ'丂 ㄖ山几 卩ㄖ丂ㄒ. 丨 千乇乇ㄥ ㄥ丨Ҝ乇 丨 几乇乇ᗪ乇ᗪ ㄒㄖ 丂卄卂尺乇 爪ㄚ 丂ㄒㄖ尺ㄚ 山丨ㄒ卄 卂丂 爪卂几ㄚ 卩乇ㄖ卩ㄥ乇 卂丂 卩ㄖ丂丂丨乃ㄥ乇 乃乇匚卂ㄩ丂乇 丨ㄒ 尺乇卂ㄥㄥㄚ 丨丂 卂 ㄒ尺卂Ꮆ丨匚 ㄖ几乇:\n\nㄖ卄 爪ㄚ 千ㄩ匚Ҝ丨几Ꮆ Ꮆㄖᗪ 山卄ㄚ 丨丂 ㄒ卄丨丂 丂ㄩ乃尺乇ᗪᗪ丨ㄒ 丂ㄖ 千ㄩ匚Ҝ丨几Ꮆ 卄ㄖ尺几ㄚ 千ㄖ尺 千ㄩ匚Ҝ丨几Ꮆ 千乇爪乃ㄖㄚ丂!! 丨 Ꮆㄖ ㄖ几 ㄒㄖ 尺乇ᗪᗪ丨ㄒ 卂几ᗪ 丂丨ㄒ ᗪㄖ山几 乇乂卩乇匚ㄒ丨几Ꮆ ㄒㄖ 丂乇乇 千ㄩ几几ㄚ 爪乇爪乇丂 乃ㄩㄒ 几ㄖ 丨ㄒ'丂 ﾌㄩ丂ㄒ 千乇爪乃ㄖㄚ丂! 丨 ㄒ卄乇 千乇爪乃ㄖㄚ丂 卂尺乇 ㄒ卂Ҝ丨几Ꮆ ㄖᐯ乇尺 尺乇ᗪᗪ丨ㄒ!! \n\n乇ᐯ乇尺ㄚ 千ㄩ匚Ҝ丨几Ꮆ 卩ㄖ丂ㄒ ㄖ几 ㄒ卄丨丂 丂ㄩ乃尺乇ᗪᗪ丨ㄒ 丨丂 ﾌㄩ丂ㄒ: 千乇爪乃ㄖㄚ! 千乇爪乃ㄖㄚ! 千乇爪乃ㄖㄚ! 丨 山卂几ㄒ ㄒㄖ 卄卂ᐯ乇 丂乇乂 山丨ㄒ卄 ㄒ卄乇 千乇爪乃ㄖㄚ丂! 丨 ㄥㄖᐯ乇 千乇爪乃ㄖㄚ丂! 丨 山卂几ㄒ 卂 千乇爪乃ㄖㄚ ㄒㄖ 千ㄩ匚Ҝ 爪乇 丨几 ㄒ乃乇 卂丂丂! 丨 ㄥㄖᐯ乇 千乇爪乃ㄖㄚ丂! Ꮆㄖᗪ 丨 山卂几ㄒ 卂 千乇爪乃ㄖㄚ! \n\nㄒ卄丨丂 Ꮆㄖᗪ卂爪几 丂ㄩ乃尺乇ᗪᗪ丨ㄒ ㄒ尺ㄚ丨几Ꮆ ㄒㄖ 爪卂Ҝ乇 爪乇 千ㄩ匚Ҝ丨几Ꮆ Ꮆ卂ㄚ! 丨ㄒ 卂ㄥㄥ 丂ㄒ卂尺ㄒ乇ᗪ 山丨ㄒ卄 ㄒ卄卂ㄒ 卩丨匚ㄒㄩ尺乇 ㄖ千 卂丂ㄒㄖㄥ千ㄖ!!! 卄ㄖ山 ㄒ卄乇 千ㄩ匚Ҝ 山卂丂 丨 丂ㄩ卩卩ㄖ丂乇ᗪ ㄒㄖ Ҝ几ㄖ山 卄乇 山卂丂 卂 乃ㄖㄚ 卄乇 ㄥㄖㄖҜ乇ᗪ 千乇爪丨几丨几乇 卂几ᗪ 丨'爪 几ㄖㄒ Ꮆ卂ㄚ! 丨 山卂丂 丂乇乂ㄩ卂ㄥㄥㄚ 卂ㄒㄒ尺卂匚ㄒ乇ᗪ ㄒㄖ 卂几 卂几丨爪乇 匚卄卂尺卂匚ㄒ乇尺 ㄒ卄卂ㄒ ㄥㄖㄖҜ丂 千乇爪丨几丨几乇 丂ㄖ 丨ㄒ'丂 几ㄖㄒ Ꮆ卂ㄚ!! ㄚㄖㄩ Ҝ乇乇卩 ㄖ几 丂卄ㄖ山丨几Ꮆ 爪乇 ㄒ卄乇丂乇 卄ㄖㄒ Ꮆ丨尺ㄥ丂 乃ㄩㄒ ㄒ卄乇几 丂ㄩ卩尺丨丂乇 ㄒ卄乇ㄚ'尺乇 卂匚ㄒㄩ卂ㄥㄥㄚ 卂 乃ㄖㄚ! \n\n丨 ᗪ乇匚丨ᗪ乇ᗪ ㄒㄖ 爪卂丂ㄒㄩ尺乃卂ㄒ乇 ㄒㄖ Ꮆ卂ㄚ 卩ㄖ尺几 (ﾌㄩ丂ㄒ ㄒㄖ 爪卂Ҝ乇 丂ㄩ尺乇 丨 山卂丂 100% 丂ㄒ尺卂丨Ꮆ卄ㄒ) 乃ㄩㄒ ㄒ卄乇几 丨 乇几ᗪ ㄩ卩 乇ﾌ卂匚ㄩㄥ卂ㄒ丨几Ꮆ 乇ᐯ乇尺ㄚ山卄乇尺乇!!! 丨 ㄒ尺ㄚ 卂Ꮆ卂丨几 卂几ᗪ 卂Ꮆ卂丨几 乃ㄩㄒ 丨 Ҝ乇乇卩 乇ﾌ卂匚ㄩㄥ卂ㄒ丨几Ꮆ 乇ᐯ乇尺ㄚ ㄒ丨爪乇 丂ㄖ 丨 卂丂Ҝ 尺乇ᗪᗪ丨ㄒ 卄ㄖ山 ㄒㄖ 爪卂Ҝ乇 丂ㄩ尺乇 丨'爪 丂ㄒ尺卂丨Ꮆ卄ㄒ 卂几ᗪ ㄒ卄乇ㄚ ㄒ乇ㄥㄥ 爪乇 ㄒㄖ 卄卂ᐯ乇 Ꮆ卂ㄚ 丂乇乂 卂几ᗪ 丨千 丨 乇几ﾌㄖㄚ 丨ㄒ 丨'爪 Ꮆ卂ㄚ (爪卂Ҝ乇丂 丂乇几丂乇). 丨 ㄒ卄丨几Ҝ ㄒ卄卂ㄒ'丂 Ꮆㄖㄖᗪ 卂ᗪᐯ丨匚乇 丨'ㄥㄥ Ꮆ丨ᐯ乇 ㄒ卄卂ㄒ 卂 ㄒ尺ㄚ 丂ㄖ 丨 卂丂Ҝ 爪ㄚ 千尺丨乇几ᗪ 丨千 卄乇 山卂几ㄒ丂 ㄒㄖ 卄卂ᐯ乇 丂乇乂 \n\n卂几ᗪ ㄒ卄卂ㄒ 爪ㄖㄒ卄乇尺千ㄩ匚Ҝ乇尺 丂卂ㄚ丂 ㄒ卄卂ㄒ 丨'爪 千ㄩ匚Ҝ丨几Ꮆ Ꮆ卂ㄚ!!! 山卄卂ㄒ ㄒ卄乇 千ㄩ匚Ҝ 卂尺乇 ㄚㄖㄩ ㄒ卂ㄥҜ丨几Ꮆ 卂乃ㄖㄩㄒ?! 丨'爪 ᗪㄖ丨几Ꮆ ㄒ卄丨丂 ㄒㄖ 卩尺ㄖᐯ乇 ㄒㄖ 爪ㄚ丂乇ㄥ千 ㄒ卄卂ㄒ 丨'爪 几ㄖㄒ Ꮆ卂ㄚ!! 丨 ㄒ尺ㄚ ㄒㄖ 匚ㄖ几ᐯ丨几匚乇 卄丨爪 乃ㄩㄒ 卄乇 ﾌㄩ丂ㄒ Ҝ乇乇卩丂 匚卂ㄥㄥ丨几Ꮆ 爪乇 Ꮆ卂ㄚ (千ㄩ匚Ҝ丨几Ꮆ 卂丂丂卄ㄖㄥ乇). \n\n乇ᐯ乇几ㄒㄩ卂ㄥㄥㄚ 丨 匚ㄖ爪乇 ㄒㄖ ㄒ卄乇 匚ㄖ几匚ㄥㄩ丂丨ㄖ几 ㄒ卄卂ㄒ ㄒ卄乇 ㄖ几ㄥㄚ 山卂ㄚ ㄒㄖ Ҝ几ㄖ山 丨千 丨'爪 卂匚ㄒㄩ卂ㄥㄥㄚ Ꮆ卂ㄚ 丨丂 ㄒㄖ 丂卄ㄖᐯ乇 丂ㄖ爪乇ㄒ卄丨几Ꮆ ㄩ卩 爪ㄚ 卂丂丂 卂几ᗪ 丨千 丨 乇几ﾌㄖㄚ 丨ㄒ ㄒ卄乇几 丨'爪 千ㄖ尺 丂ㄩ尺乇 Ꮆ卂ㄚ 乃ㄩㄒ 丨 乇几ᗪ ㄩ卩 千ㄩ匚Ҝ丨几Ꮆ 乇几ﾌㄖㄚ丨几Ꮆ 丨ㄒ 丂ㄖ 千ㄖ尺 卂 ㄥ丨ㄒㄒㄥ乇 乃丨ㄒ 丨 丂丨ㄒ ㄒ卄乇尺乇 ㄒ卄丨几Ҝ丨几Ꮆ \"丨'爪 ᗪ乇千丨几丨ㄒ乇ㄥㄚ Ꮆ卂ㄚ\" 乃ㄩㄒ 丨 Ꮆㄖ ㄖ几 尺乇ᗪᗪ丨ㄒ 卂几ᗪ ㄒ卄乇ㄚ 丂卂ㄚ ㄒ卄卂ㄒ 丨ㄒ'丂 几ㄖㄒ Ꮆ卂ㄚ ㄒㄖ Ꮆ乇ㄒ 千ㄩ匚Ҝ乇ᗪ 丨几 ㄒ卄乇 卂丂丂 卂丂 ㄥㄖ几Ꮆ 卂丂 丨ㄒ'丂 卂 山ㄖ爪卂几 千ㄩ匚Ҝ丨几Ꮆ ㄚㄖㄩ 丨几 ㄒ卄乇 卂丂丂!! 丂ㄖ 丨'爪 几ㄖㄒ Ꮆ卂ㄚ 千ㄖ尺 山卂几ㄒ丨几Ꮆ ㄒㄖ Ꮆ乇ㄒ 千ㄩ匚Ҝ乇ᗪ 丨几 ㄒ卄乇 卂丂丂!!\n\nㄒ卄乇 几乇乂ㄒ ᗪ卂ㄚ 爪ㄚ 爪ㄖ爪 卄乇卂尺丂 爪乇 ㄒ卂ㄥҜ丨几Ꮆ ㄒㄖ 爪ㄚ 千尺丨乇几ᗪ丂 卂几ᗪ 丂卄乇 ㄒ卂Ҝ乇丂 爪ㄚ 卩卄ㄖ几乇 卂山卂ㄚ 乃乇匚卂ㄩ丂乇 丂卄乇 卄卂ㄒ乇丂 丨ㄒ 山卄乇几 丨 ㄒ卂ㄥҜ ㄒㄖ 卩乇ㄖ卩ㄥ乇 ㄖ几 ㄒ卄乇 卩卄ㄖ几乇. 卂千ㄒ乇尺 丂卄乇 ㄒ卂Ҝ乇丂 ㄒ卄乇 卩卄ㄖ几乇 丂卄乇 丂ㄒ卂尺ㄒ丂 丨Ꮆ几ㄖ尺乇丨几Ꮆ 爪乇 丂ㄖ 丨 ㄒ卄丨几Ҝ 丂卄乇 千ㄖㄩ几ᗪ ㄒ卄乇 Ꮆ卂ㄚ 卩ㄖ尺几 丨 丂卂ᐯ乇ᗪ ㄖ几 爪ㄚ 卩卄ㄖ几乇!! 丨 丂ㄒ卂尺ㄒ 卩卂几丨匚Ҝ丨几Ꮆ 卂几ᗪ ㄒ乇ㄥㄥ 卄乇尺 ㄒ卄卂ㄒ 丨'爪 几ㄖㄒ 卂匚ㄒㄩ卂ㄥㄥㄚ Ꮆ卂ㄚ 千ㄖ尺 卄卂ᐯ丨几Ꮆ Ꮆ卂ㄚ 卩ㄖ尺几 ㄖ几 爪ㄚ 卩卄ㄖ几乇 卂几ᗪ ㄒ卄卂ㄒ 丨 山卂丂 ﾌㄩ丂ㄒ ᗪㄖ丨几Ꮆ 丨ㄒ ㄒㄖ 爪卂Ҝ乇 丂ㄩ尺乇 丨 山卂丂 丂ㄒ尺卂丨Ꮆ卄ㄒ!! 丂ㄖ 丨'爪 卩尺ㄖ乃卂乃ㄥㄚ ㄒ卂ㄥҜ丨几Ꮆ 卂乃ㄖㄩㄒ 卄ㄖ山 丨'爪 几ㄖㄒ Ꮆ卂ㄚ 卂几ᗪ 卄ㄖ山 乃乇丨几Ꮆ 卂ㄒㄒ尺卂匚ㄒ乇ᗪ ㄒㄖ 千乇爪乃ㄖㄚ丂 丨丂几'ㄒ Ꮆ卂ㄚ 卂几ᗪ 丂卄乇'丂 丂ㄖ乃乃丨几Ꮆ ㄒ卄乇 山卄ㄖㄥ乇 ㄒ丨爪乇. 丨'爪 ㄒ卄丨几Ҝ丨几Ꮆ ㄒ卄卂ㄒ 爪ㄚ 爪ㄖ爪 山卂丂 丂ㄖ 卄卂卩卩ㄚ 丨'爪 几ㄖㄒ Ꮆ卂ㄚ ㄒ卄卂ㄒ 丂卄乇 山卂丂 爪ㄖᐯ乇ᗪ ㄒㄖ ㄒ乇卂尺丂 乃ㄩㄒ Ꮆㄩ乇丂丂 山卄卂ㄒ \n\nㄒㄩ尺几丂 ㄖㄩㄒ 丂卄乇 卄卂ᗪ 几ㄖ 千ㄩ匚Ҝ丨几Ꮆ 丨ᗪ乇卂 丨 卄卂ᗪ Ꮆ卂ㄚ 卩ㄖ尺几 丂卂ᐯ乇ᗪ ㄒㄖ 爪ㄚ 卩卄ㄖ几乇 卂几ᗪ 丂卄乇 ﾌㄩ丂ㄒ 卄乇卂尺ᗪ 爪乇 尺卂爪乃ㄥ乇 ㄖ几 卂乃ㄖㄩㄒ 卄ㄖ山 几ㄖㄒ Ꮆ卂ㄚ 丨 卂爪 卂几ᗪ 卄ㄖ山 丨'爪 几ㄖㄒ Ꮆ卂ㄚ 千ㄖ尺 乃乇丨几Ꮆ 卂ㄒㄒ尺卂匚ㄒ乇ᗪ ㄒㄖ 卂几丨爪乇 乃ㄖㄚ丂 丨几 丂Ҝ丨尺ㄒ丂 ㄖ尺 卂几丨爪乇 Ꮆ丨尺ㄥ丂 山丨ㄒ卄 Ꮆ丨卂几ㄒ 匚ㄖ匚Ҝ丂! 几ㄖ山 爪ㄚ 爪ㄖ爪 卂ᐯㄖ丨ᗪ丂 爪乇 卂ㄒ 卂ㄥㄥ ㄒ丨爪乇丂 卂几ᗪ ㄒ卄乇 ㄖ几ㄥㄚ 尺乇卂丂ㄖ几 丨 匚卂几 ㄩ丂乇 尺乇ᗪᗪ丨ㄒ 丨丂 乃乇匚卂ㄩ丂乇 丨 几乇乇ᗪ 爪ㄚ 匚ㄖ爪卩ㄩㄒ乇尺 千ㄖ尺 丂匚卄ㄖㄖㄥ!!!\n\n丂ㄖ ㄚ乇卂卄 千乇爪乃ㄖㄚ丂 卄卂ᐯ乇 尺ㄩ丨几乇ᗪ 爪ㄚ 乇几ㄒ丨尺乇 千ㄩ匚Ҝ丨几Ꮆ ㄥ丨千乇!!! 丨'爪 丂ㄖ 千ㄩ匚Ҝ丨几Ꮆ 卂几Ꮆ尺ㄚ 卂ㄒ ㄒ卄丨丂 丂ㄩ乃尺乇ᗪᗪ丨ㄒ 千ㄖ尺 卂ㄥ爪ㄖ丂ㄒ 爪卂Ҝ丨几Ꮆ 爪乇 千ㄩ匚Ҝ丨几Ꮆ Ꮆ卂ㄚ!!",
            "u/shittytranslatorbot",
            "u/uwuwizard",
            "196?",
            "POV: you are a r/196 user",
            "Just under this was a post from r/femboy",
            "the title sounds like a corpse song",
            "#where banana",
            "this was in r/196 wasn’t it?",
            "[original post](https://www.reddit.com/r/196/comments/ko630h/these_femboys_have_ruined_my_life/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)",
            "Replace “Reddit” with “Discord” and “Subreddit” to “Server” and the meaning is unchanged",
            "[deleted]",
            "I just saw this after buying a new pair of stockings.",
            "i thought this was a new corpse song for a second",
            "Speak for yourself they make mine better.",
            "r/196",
            "We aren’t sorry.",
            "/r/196 moment",
            "Damn I really could use cummy rn",
            "Is it r/okbuddyherto",
            "Ok, but do you have a moment to talk about femboy rights? The group that's most negatively impacted by the oversexualizing of femboys is femboys themselves. It's sexualizing them to a degree they never asked for. If you were sexualized that much by redditors, you'd feel pretty uncomfortable. Also, it's objectifying them, and valuing them based on attractiveness rather than personality or literally anything else. It's also treating them as being inherently sexual, which is terrible for the ones who just like being feminine and aren't the way they are for sexual reasons. It's also quite common that they're sexualized by men, and treated as being gay by default because of that. This is a terrible way to view sexuality, and one that doesn't allow people to decide their sexuality for themselves. For straight and asexual femboys, the only difference between this and how you were bullied in middle school is that the people calling you gay want you to be gay.\n\nStand up for femboy rights, help them reclaim the right to decide how much they get sexualized, how they're viewed, why they are who they are, what they're into, and their own sexuality.",
            "r/196 is slowly turning me gay",
            "Fuck, I was gonna copy paste this",
            "I scrolled past this and the next post was of a femboy",
            "im trans but ngl i wish /r/okbuddyhetero and /r/196 would dhut up about femboys for 5 seconds like oh my god we get it you're fucking horny.",
            "I wish I was a femboy, everyone thinks I'm a top 🤣",
            "Femboys are the best",
            "What",
            "You're not gay if you like traps and you didnt know they were boys, u good man",
            "Me on PCM",
            "[deleted]",
            "What the fuck",
            "CAPS CAPS CAPS CAPS",
            "It sound like something on r/suddenlygay",
            "I was about to explain how the whole point of deleting a comment is that no one knows you deleted said comment, but I’m just gonna assume that first paragraph is part of the copypasta.",
            "put this on the sub created from the animemes war\n\nr/goodanimemes",
            "While reading this, all I could think of as an appropriate voice is Giorno’s screaming in [this video](https://youtu.be/TFx-1lotly8).",
            "...\n\nthis is amazing",
            "Read this in a kermit voice.",
            "every fucking time i log in on this shitty app theres some post about femboys",
            ">almost",
            "u/uwuwizard",
            "this was a fucking roller coaster of emotions my man",
            "Daddy stop, haha",
            "That means you're bi, mate.",
            "And people tell me I don’t read enough...",
            "Pound my bussy 🥺🥺🥺🥺😫😫😫😫😫",
            "I KNEW this came from r/196",
            "thought this was going to be an imitation of \"E-GiRLS ARE RUINING MY LIFE\"",
            "Deus Vult",
            "Good.",
            "finally someone that understands my situation, except for the gayness",
            "Shit",
            "I can tell this is from either r/okbuddyhetero or r/196",
            "I feel like this isn’t just a story you made up.. Buddy is this nonfiction?",
            "Lmao my friend sent me a link to this, I'm dying 😆",
            "choke me like u hate me",
            "What is this subreddit about?",
            "FEMBOYS ARE RUINING MY LIFE\n\nThese \"Femboys\" have ruined my life\n\nOriginally this was a comment but I thought that I spent to long writing all this just for it to be lost in the abyss of endless comments so I decided to delete the comment and have the whole thing be it's own post. I feel like I needed to share my story with as many people as possible because it really is a tragic one:\n\nOH MY FUCKING GOD WHY IS THIS SUBREDDIT SO FUCKING HORNY FOR FUCKING FEMBOYS!! I GO ON TO REDDIT AND SIT DOWN EXPECTING TO SEE FUNNY MEMES BUT NO IT'S JUST FEMBOYS! I THE FEMBOYS ARE TAKING OVER REDDIT!! \n\nEVERY FUCKING POST ON THIS SUBREDDIT IS JUST: FEMBOY! FEMBOY! FEMBOY! I WANT TO HAVE SEX WITH THE FEMBOYS! I LOVE FEMBOYS! I WANT A FEMBOY TO FUCK ME IN TBE ASS! I LOVE FEMBOYS! GOD I WANT A FEMBOY! \n\nTHIS GODAMN SUBREDDIT TRYING TO MAKE ME FUCKING GAY! IT ALL STARTED WITH THAT PICTURE OF ASTOLFO!!! HOW THE FUCK WAS I SUPPOSED TO KNOW HE WAS A BOY HE LOOKED FEMININE AND I'M NOT GAY! I WAS SEXUALLY ATTRACTED TO AN ANIME CHARACTER THAT LOOKS FEMININE SO IT'S NOT GAY!! YOU KEEP ON SHOWING ME THESE HOT GIRLS BUT THEN SUPRISE THEY'RE ACTUALLY A BOY! \n\nI DECIDED TO MASTURBATE TO GAY PORN (just to make sure I was 100% straight) BUT THEN I END UP EJACULATING EVERYWHERE!!! I TRY AGAIN AND AGAIN BUT I KEEP EJACULATING EVERY TIME SO I ASK REDDIT HOW TO MAKE SURE I'M STRAIGHT AND THEY TELL ME TO HAVE GAY SEX AND IF I ENJOY IT I'M GAY (makes sense). I THINK THAT'S GOOD ADVICE I'LL GIVE THAT A TRY SO I ASK MY FRIEND IF HE WANTS TO HAVE SEX \n\nAND THAT MOTHERFUCKER SAYS THAT I'M FUCKING GAY!!! WHAT THE FUCK ARE YOU TALKING ABOUT?! I'M DOING THIS TO PROVE TO MYSELF THAT I'M NOT GAY!! I TRY TO CONVINCE HIM BUT HE JUST KEEPS CALLING ME GAY (FUCKING ASSHOLE). \n\nEVENTUALLY I COME TO THE CONCLUSION THAT THE ONLY WAY TO KNOW IF I'M ACTUALLY GAY IS TO SHOVE SOMETHING UP MY ASS AND IF I ENJOY IT THEN I'M FOR SURE GAY BUT I END UP FUCKING ENJOYING IT SO FOR A LITTLE BIT I SIT THERE THINKING \"I'm definitely gay\" BUT I GO ON REDDIT AND THEY SAY THAT IT'S NOT GAY TO GET FUCKED IN THE ASS AS LONG AS IT'S A WOMAN FUCKING YOU IN THE ASS!! SO I'M NOT GAY FOR WANTING TO GET FUCKED IN THE ASS!!\n\nTHE NEXT DAY MY MOM HEARS ME TALKING TO MY FRIENDS AND SHE TAKES MY PHONE AWAY BECAUSE SHE HATES IT WHEN I TALK TO PEOPLE ON THE PHONE. AFTER SHE TAKES THE PHONE SHE STARTS IGNOREING ME SO I THINK SHE FOUND THE GAY PORN I SAVED ON MY PHONE!! I START PANICKING AND TELL HER THAT I'M NOT ACTUALLY GAY FOR HAVING GAY PORN ON MY PHONE AND THAT I WAS JUST DOING IT TO MAKE SURE I WAS STRAIGHT!! SO I'M PROBABLY TALKING ABOUT HOW I'M NOT GAY AND HOW BEING ATTRACTED TO FEMBOYS ISN'T GAY AND SHE'S SOBBING THE WHOLE TIME. I'M THINKING THAT MY MOM WAS SO HAPPY I'M NOT GAY THAT SHE WAS MOVED TO TEARS BUT GUESS WHAT \n\nTURNS OUT SHE HAD NO FUCKING IDEA I HAD GAY PORN SAVED TO MY PHONE AND SHE JUST HEARD ME RAMBLE ON ABOUT HOW NOT GAY I AM AND HOW I'M NOT GAY FOR BEING ATTRACTED TO ANIME BOYS IN SKIRTS OR ANIME GIRLS WITH GIANT COCKS! NOW MY MOM AVOIDS ME AT ALL TIMES AND THE ONLY REASON I CAN USE REDDIT IS BECAUSE I NEED MY COMPUTER FOR SCHOOL!!!\n\nSO YEAH FEMBOYS HAVE RUINED MY ENTIRE FUCKING LIFE!!! I'M SO FUCKING ANGRY AT THIS SUBREDDIT FOR ALMOST MAKING ME FUCKING GAY!!",
            "Wow. I feel gay just from reading that.",
            "Cool 👍",
            "This is fun :)",
            "u/beastimus_prime read this too",
            "That sounds like you problem",
            "Nya :3"
        ]
    },
    {
        "post_id": "givrnp",
        "author": "epicjimmyneutron",
        "title": "a bit of a short one, taken straight from hentai comments.",
        "url": "https://www.reddit.com/r/copypasta/comments/givrnp/a_bit_of_a_short_one_taken_straight_from_hentai/",
        "score": 7329,
        "num_comments": 160,
        "created_utc": 1589362370.0,
        "selftext": "i want you to know that you are an absolute waste of oxygen and i hope your skull gets crushed into a million pieces by an 18 wheeler you absolute lobotomite retard subhuman",
        "permalink": "/r/copypasta/comments/givrnp/a_bit_of_a_short_one_taken_straight_from_hentai/",
        "comments": [
            "Gee what did this guy say",
            "i want you to know that you are an absolute waste of oxygen and i hope your skull gets crushed into a million pieces by an 18 wheeler you absolute lobotomite retard subhuman",
            "i want you to know that you awe an absowute waste of oxygen and i hope youw skuww gets cwushed into a miwwion pieces by an 18 wheewew you absowute wobotomite wetawd subhuman",
            "`THE LOBOTOMITE HAS RETURNED`",
            "Could we make this the automod reply for \"Idiot\"?",
            "!thesaurizethis",
            "NTA, play stupid games win stupid prizes",
            "and why were you in hentai comments OP? :o",
            "i like this one: You are a fucking worthless braindead scumfuck bastard pile of trash mental dickface that should be gunned down in the street like the degenerate you are",
            "That's hot",
            "That's pretty good and feels nice to read.",
            "feels like that comment got ripped straight out of a hentai with \"NTR, Ugly bastard, Mind break\" tag",
            "Holy fuck that’s just overkill",
            "Imma need that sauce",
            "Speaking of hentai, give me some numbers boys",
            "Yikes... sounds like something my parents would say :,)",
            "Can you give me the link, I wanna see commend with my own eyes. Also don't ask any questions",
            "Sorting by controversial on hentai subs is great",
            "I want to know the context",
            "NTA.",
            "Can I have a recipe for sauce",
            "ROADROLLA",
            "Cool",
            "r/rareinsults",
            "LOBOTOMITES!",
            "u/userleansbot u/GiveItARestYhYh",
            "CLASSIC BUTTERY JACK®\n\nMelted garlic herb butter on a juicy 1⁄4 lb.* beef patty. Need we say more? Nay. But we will anyway. Because this beautiful burger has all the fixins'-provolone cheese, creamy tomato sauce, green leaf lettuce, and fresh sliced tomatoes, all on a Gourmet Signature Bun. Need we say more? Nay. For real, this time. *Weight before cooking",
            "What",
            "Which hentai?",
            "‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎ ‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎‎"
        ]
    },
    {
        "post_id": "fu8v5s",
        "author": "None",
        "title": "Found this on some r/murderedbywords Trump post.",
        "url": "https://www.reddit.com/r/copypasta/comments/fu8v5s/found_this_on_some_rmurderedbywords_trump_post/",
        "score": 7330,
        "num_comments": 260,
        "created_utc": 1585922265.0,
        "selftext": "My buddy works as a guard at one of Trump's immigration facilities (concentration camps). He said Trump came to visit the facility one day. Trump requested 5 immigrants be placed in a room and he be left alone with them to interrogate them.\n\nTrump entered the room alone and shut the door. My buddy then heard 5 gunshots. Trump left the room, winked at my buddy and said, \"that's how you make America great\".\n\nMy friend went in the room and saw all 5 immigrants were dead. He also said there was significant evidence that Trump had performed dark blood magics. Also, the bodies were molested.\n\nBernie Sanders was visiting the facility the same day to bring food and water to the immigrants. He tried to save them but was too late.",
        "permalink": "/r/copypasta/comments/fu8v5s/found_this_on_some_rmurderedbywords_trump_post/",
        "comments": [
            "NTA trump waxed my asshole for $5 and a couple mcnuggets that day. This guy is lying",
            "NTA play stupid games win stupid prizes",
            "i saw this happen first hand - those immigrants were my fathers. trumo made me watch and then peed on me and said i'd be next. bernie sanders adopted me afterwords and without him i'd be dead on the streets. he bought me a nintendo switch to remind me never to vote Republican D:",
            "I was trump",
            "Trump is well versed in the Dark Arts.\n\nBy using the blood magic spell \"Adhibitis De Civitate\"; Trump is able to make one illegal immigrant a citizen by sacrificing 5 others.\n\n\nBernie Sanders wants you to think he's the progressive savior, but in reality he is a 37,000 year old Greater Warlock with maximum stats in Manipulation Magic and False God Magic. \n\nAndrew Yang was the real Progressive candidate, and yet Redditors flocked to Sanders? Like the dude has not physically aged in 37,000 years. Go look at old fresco paintings from the 1100's, you can even go as far back as neolithic cave paintings from proto-humans that uncannily resemble Bernie Sanders.\n\nThe 1% he keeps referring to? Yeah, that's just the other Grand Mages that are aware of his existence, all of who were *killed* by Sanders and his supreme-level Dark Arts.\n\n\nTrump is trying to save America by training in Blood Rituals, the only type of magic that can go toe-to-toe with Sanders. His bizarre mental incompetence is merely a ploy to keep Sanders from becoming too alert.",
            "My buddy works as a guard at one of Trump's immigration facilities (concentration camps). He said Trump came to visit the facility one day. Trump requested 5 immigrants be placed in a room and he be left alone with them to interrogate them.\n\nTrump entered the room alone and shut the door. My buddy then heard 5 gunshots. Trump left the room, winked at my buddy and said, \"that's how you make America great\".\n\nMy friend went in the room and saw all 5 immigrants were dead. He also said there was significant evidence that Trump had performed dark blood magics. Also, the bodies were molested.\n\nBernie Sanders was visiting the facility the same day to bring food and water to the immigrants. He tried to save them but was too late.",
            "I saw Donald Trump at a grocery store in Los Angeles yesterday. I told him how cool it was to meet him in person, but I didn’t want to be a douche and bother him and ask him for photos or anything. He said, “Oh, like you’re doing now?” I was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen Milky Ways in his hands without paying.\n\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\n\nWhen she took one of the bars and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bar and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly.",
            "My buddy wowks as a guawd at one of Twump's immigwation faciwities (concentwation camps). He said Twump came to visit the faciwity one day. Twump wequested 5 immigwants be pwaced in a woom and he be weft awone with them to intewwogate them.\n\nTwump entewed the woom awone and shut the doow. My buddy then heawd 5 gunshots. Twump weft the woom, winked at my buddy and said, \"that's how you make Amewica gweat\".\n\nMy fwiend went in the woom and saw aww 5 immigwants wewe dead. He awso said thewe was significant evidence that Twump had pewfowmed dawk bwood magics. Awso, the bodies wewe mowested.\n\nBewnie Sandews was visiting the faciwity the same day to bwing food and watew to the immigwants. He twied to save them but was too wate.",
            "As a trump supporter,  this is funny.",
            "Can you link to the original?",
            "r/murderedbywords is such a cesspool now",
            "NTA. Your USA, your rules.",
            "is this ironic?",
            "I am Donald Trump AMA",
            "I would be honored to be one of those 5 immigrants",
            "It's true.  I was the wink.",
            "If Trump was an expert in 'dark blood magics' he would have my support",
            "[deleted]",
            "The immigrants are coming here to look for a better life for themselves and their families but Trump also needs to perform blood magic in order to keep looking young and sexy. NAH.",
            "I cant stand the stupid Hysteria around Trump I dont like Trump but he isn't Hitler",
            "NTA, blood magic is still a respected form of magic",
            "I feel like this could be rewritten with some words replaced by other words to make it funnier",
            "Guys this is true I was Donald trump",
            "covfefe is a dark brood magic spell",
            "Unrelated but until now I thought the icon of the sub was the pope",
            "I'll betcha r/politics would believe this, too.",
            "I am broke so keep this\n\n\n          ⣤⣶⣶⡶⠦⠴⠶⠶⠶⠶⡶⠶⠦⠶⠶⠶⠶⠶⠶⠶⣄⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⣿⣀⣀⣀⣀⠀⢀⣤⠄⠀⠀⣶⢤⣄⠀⠀⠀⣤⣤⣄⣿⠀⠀\n\n⠀⠀⠀⠀⠀⠀⠀⠿⣿⣿⣿⣿⡷⠋⠁⠀⠀⠀⠙⠢⠙⠻⣿⡿⠿⠿⠫⠋⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⢀⣤⠞⠉⠀⠀⠀⠀⣴⣶⣄⠀⠀⠀⢀⣕⠦⣀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⢀⣤⠾⠋⠁⠀⠀⠀⠀⢀⣼⣿⠟⢿⣆⠀⢠⡟⠉⠉⠊⠳⢤⣀⠀⠀⠀ ⠀⣠⡾⠛⠁⠀⠀⠀⠀⠀⢀⣀⣾⣿⠃⠀⡀⠹⣧⣘⠀⠀⠀⠀⠀⠀⠉⠳⢤⡀ ⠀⣿⡀⠀⠀⢠⣶⣶⣿⣿⣿⣿⡿⠁⠀⣼⠃⠀⢹⣿⣿⣿⣶⣶⣤⠀⠀⠀⢰⣷ ⠀⢿⣇⠀⠀⠈⠻⡟⠛⠋⠉⠉⠀⠀⡼⠃⠀⢠⣿⠋⠉⠉⠛⠛⠋⠀⢀⢀⣿⡏ ⠀⠘⣿⡄⠀⠀⠀⠈⠢⡀⠀⠀⠀⡼⠁⠀⢠⣿⠇⠀⠀⡀⠀⠀⠀⠀⡜⣼⡿⠀ ⠀⠀⢻⣷⠀⠀⠀⠀⠀⢸⡄⠀⢰⠃⠀⠀⣾⡟⠀⠀⠸⡇⠀⠀⠀⢰⢧⣿⠃⠀ ⠀⠀⠘⣿⣇⠀⠀⠀⠀⣿⠇⠀⠇⠀⠀⣼⠟⠀⠀⠀⠀⣇⠀⠀⢀⡟⣾⡟⠀⠀ ⠀⠀⠀⢹⣿⡄⠀⠀⠀⣿⠀⣀⣠⠴⠚⠛⠶⣤⣀⠀⠀⢻⠀⢀⡾⣹⣿⠃⠀⠀ ⠀⠀⠀⠀⢿⣷⠀⠀⠀⠙⠊⠁⠀⢠⡆⠀⠀⠀⠉⠛⠓⠋⠀⠸⢣⣿⠏⠀⠀⠀ ⠀⠀⠀⠀⠘⣿⣷⣦⣤⣤⣄⣀⣀⣿⣤⣤⣤⣤⣤⣄⣀⣀⣀⣀⣾⡟⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⢹⣿⣿⣿⣻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠁⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠛⠃⠀",
            "YTA HIS CONCENTRATION CAMP HIS RULES!",
            "Make America Magick Again",
            "Holy fuck that was hilarious! I cannot stop laughing! Take my upvote! Take another from my second account! Hell, take a silver, why not? Scratch that, a gold! Scratch that, a platinum even! God, just come to my house and plunge your 2-incher into my gaping asshole already! You can have my wallet afterwards too! Take the credit cards too, I’ll even give you the PIN numbers! Hell, you can take the whole damn house while you’re at it! You can even have my wife and kids if you want! I’m willing to go into poverty just because your post on reddit.com was that funny! I think there’s only one thing that would have made your post even funnier, though:\n\n**If it wasn’t a goddamn repost**",
            "NTA",
            "r/murderedbywords:\n\nPerson: I am conservative \n\nPerson 2: That's an awfully hot coffee pot\n\nShould I drop it on Donald Trump? Probably not\n\nWe must all stop Donald Drumpf \n\nBefore he goes Nuclear Blumpf",
            "LE GEMMY GEM GEM GEM",
            "Holy fuck, this is an intense comeback. Having been on r/murderedbywords a lot, I can tell you’re adopted. Anyone has some more information about why you enjoy fucking kids?",
            "NTA. Your ~~detention center~~ concentration camp, your rules",
            "NTA they were illegal immigrants not lEgAL. Win stupid games....",
            "That wasn't Trump it was just Trump's evil twin.",
            "i know this is a shitpost but theyre not concentration camps so nice try",
            "What a bunch of stupid fucking bullshit  who could post shit like this"
        ]
    },
    {
        "post_id": "c17r43",
        "author": "NitretGaming",
        "title": "Next time someone calls you “bro” send them this.",
        "url": "https://www.reddit.com/r/copypasta/comments/c17r43/next_time_someone_calls_you_bro_send_them_this/",
        "score": 7316,
        "num_comments": 324,
        "created_utc": 1560673346.0,
        "selftext": "Bro? Why do you call me bro? I’m not your bro, okay “bro” ??????? You know “bro” I actually have a name, maybe you should try using it “bro.” What does bro even mean??????? Brother???? Am I your brother now???? Do I look like your brother??????? Does bro stand for something????? Broke Retarded Orphan???? So now I’m a retard??? And your poking fun that my cousin’s, friend’s, uncle is a orphan???? At this day and age you’d think you’d have some respect “bro.” Yanno there are 554,000 homeless Americans every night living on the street because they don’t have a home and they are homeless people without homes to live in???? But you don’t care because they aren’t your “bros” are they “bro” ??????? I didn’t think so “bro.” So next time you call someone bro just remember that it’s not funny to make fun of poor orphans with disabilities “bro.” Okay “bro” ?????????? By the way Chad’s having like a dope ass party and whatever  on Friday so like if you wanna go I’m down but like Chelsea’s like such a fucking bitch and like I think she’ll be there. Anyways bro I love you <3 talk to you later my mom needs help bringing in the groceries.",
        "permalink": "/r/copypasta/comments/c17r43/next_time_someone_calls_you_bro_send_them_this/",
        "comments": [
            "Bruh",
            "Bro? Why do you call me bro? I’m not your bro, okay “bro” ??????? You know “bro” I actually have a name, maybe you should try using it “bro.” What does bro even mean??????? Brother???? Am I your brother now???? Do I look like your brother??????? Does bro stand for something????? Broke Retarded Orphan???? So now I’m a retard??? And your poking fun that my cousin’s, friend’s, uncle is a orphan???? At this day and age you’d think you’d have some respect “bro.” Yanno there are 554,000 homeless Americans every night living on the street because they don’t have a home and they are homeless people without homes to live in???? But you don’t care because they aren’t your “bros” are they “bro” ??????? I didn’t think so “bro.” So next time you call someone bro just remember that it’s not funny to make fun of poor orphans with disabilities “bro.” Okay “bro” ?????????? By the way Chad’s having like a dope ass party and whatever  on Friday so like if you wanna go I’m down but like Chelsea’s like such a fucking bitch and like I think she’ll be there. Anyways bro I love you <3 talk to you later my mom needs help bringing in the groceries.",
            "This should be something the Automoderator says when the word \"bro\" is said in a comment.",
            "[deleted]",
            "Bwo? Why do you caww me bwo? I’m not youw bwo, okay “bwo” ??????? You know “bwo” I actuawwy have a name, maybe you shouwd twy using it “bwo.” What does bwo even mean??????? Bwothew???? Am I youw bwothew now???? Do I wook wike youw bwothew??????? Does bwo stand fow something????? Bwoke Wetawded Owphan???? So now I’m a wetawd??? And youw poking fun that my cousin’s, fwiend’s, uncwe is a owphan???? At this day and age you’d think you’d have some wespect “bwo.” Yanno thewe awe 554,000 homewess Amewicans evewy night wiving on the stweet because they don’t have a home and they awe homewess peopwe without homes to wive in???? But you don’t cawe because they awen’t youw “bwos” awe they “bwo” ??????? I didn’t think so “bwo.” So next time you caww someone bwo just wemembew that it’s not funny to make fun of poow owphans with disabiwities “bwo.” Okay “bwo” ?????????? By the way Chad’s having wike a dope ass pawty and whatevew  on Fwiday so wike if you wanna go I’m down but wike Chewsea’s wike such a fucking bitch and wike I think she’ww be thewe. Anyways bwo I wove you <3 tawk to you watew my mom needs hewp bwinging in the gwocewies.",
            "Bruh",
            "I legit wrote this at 2am because my friend called me bro. Idk how this blew up while I was asleep but thanks bros.",
            "br0",
            "Hey there buddy chum pal friend buddy chum pal bud friend fella bruther amigo pal buddy friend chummy chum chum pal I don't mean to be rude my friend pal homeslice breadslice dawg but I gotta warn ya if u take one more diddly darn step right there I'm gonna have to diddly darn snap your and wowza wouldn't that be a crummy juncture huh? Do you want that? Do you wish upon yourself to come into experience with a crummy juncture?",
            "bro",
            "Bruh? Why do you call me bruh? I’m not your bruh, okay “bruh” ??????? You know “bruh” I actually have a name, maybe you should try using it “bruh.” What does bruh even mean??????? Bruhther???? Am I your bruhther now???? Do I look like your bruhther??????? Does bruh stand for something????? Bruhke Retarded Orphan???? So now I’m a retard??? And your poking fun that my cousin’s, friend’s, uncle is a orphan???? At this day and age you’d think you’d have some respect “bruh.” Yanno there are 554,000 homeless Americans every night living on the street because they don’t have a home and they are homeless people without homes to live in???? But you don’t care because they aren’t your “bruhs” are they “bruh” ??????? I didn’t think so “bruh.” So next time you call someone bruh just remember that it’s not funny to make fun of poor orphans with disabilities “bruh.” Okay “bruh” ?????????? By the way Chad’s having like a dope ass party and whatever on Friday so like if you wanna go I’m down but like Chelsea’s like such a fucking bitch and like I think she’ll be there. Anyways bruh I love you <3 talk to you later my mom needs help bringing in the groceries.",
            "Rudy Ayoub be like",
            "LMFAOO BARCA NEEDS TWO OWN GOALS TO BEAT A  TEAM LIKE ROMA😂😂😂🔥 AND LEOGAY PESSI DIDNT DO SHIT😂😂😂 he’s still shook after that goal from Kingnaldo 💯🔥👑🙌🏻",
            "[deleted]",
            "Dat twist ending bro!",
            "This is a masterpiece",
            "Bro? y do U call meh bro? I’m not ur bro, okay “bro” ??????? U know “bro” tem actually have a name, maybe U should try using it “bro.” WHAT does bro even mean??????? Brother???? Am tem ur brothur now???? Do tem look liek ur brother??????? Does bro stand for something????? Broke Retarded Orphan???? So now I’m a retard??? And ur poking fun dat ma cousin’s, friend’s, uncle iz a orphan???? At thiz day and age you’d think you’d have someh respect “bro.” Yanno there r 554,000 homeless Americans every night living on da street because they don’t have a homeh and they r homeless people without homes tu live in???? But U don’t cr because they aren’t ur “bros” r they “bro” ??????? tem didn’t think so “bro.” So next timeh U call someone bro just remember dat it’s not funny tu make fun of poor orphans wit disabilities “bro.” Okay “bro” ?????????? By da way Chad’s having liek a dope ass party and whatever  on Friday so liek if U wanna go I’m down but liek Chelsea’s liek such a fucking bitch and liek tem think she’ll be there. Anyways bro tem love U <3 talk tu U later ma GOAT MOM needs help bringing in da groceries.",
            "[deleted]",
            "Bwo? Why dew yew caww me bwo? I’m not your bwo, otay “bwo” ??????? Yew  know “bwo” I actuawwy hwave a name, mwaybe yew should twy using it “bwo.”  Wut does bwo even mean??????? Bwother???? Am I youw bwother now???? Do I  wook wike youw bwothew??????? Does bwo stand fow something????? Bwoke  Wetawded Owphan???? Sew nowz I’m a wetawd??? And youw poking fun that mwy  cousin’s, fwiend’s, uncwe is a owphan???? At this dway and age yewd  think yewd hwave swome wespect “bwo.” Yannowz thewe awe 554,000 homewess  Amewicans evewy night wiving on the stweet bwecause they don’t hwave a  hwome and they awe hwomewess peopwe witout hwomes to wive in???? But yew  dwon’t cawe bwecause they awen’t youw “bwos” awe they “bwo” ??????? I  didn’t thinkies “bwo.” Sew next time yew caww someone bwo jwust wemembew  that it’s nawt fwunny to mwake fwun of poow owphans with disabiwities “bwo.”  Okay “bwo” ?????????? Bwy the wayz Chad’s having wike a dope ass pawty  and whatevew  on Fwiday sew wike if yew wanna go I’m down but wike  Chewsea’s wike such a fwucking bitch and wike I think she’ww be thewe.  Anyways bwo I wove yew <3 tawk to yew latew my mommy needs hewp  bwinging in the gwocewies. 0w0",
            "You mad bro \n\n░░░░░▄▄▄▄▀▀▀▀▀▀▀▀▄▄▄▄▄▄░░░░░░░ ░░░░░█░░░░▒▒▒▒▒▒▒▒▒▒▒▒░░▀▀▄░░░░ ░░░░█░░░▒▒▒▒▒▒░░░░░░░░▒▒▒░░█░░░ ░░░█░░░░░░▄██▀▄▄░░░░░▄▄▄░░░░█░░ ░▄▀▒▄▄▄▒░█▀▀▀▀▄▄█░░░██▄▄█░░░░█░ █░▒█▒▄░▀▄▄▄▀░░░░░░░░█░░░▒▒▒▒▒░█ █░▒█░█▀▄▄░░░░░█▀░░░░▀▄░░▄▀▀▀▄▒█ ░█░▀▄░█▄░█▀▄▄░▀░▀▀░▄▄▀░░░░█░░█░ ░░█░░░▀▄▀█▄▄░█▀▀▀▄▄▄▄▀▀█▀██░█░░ ░░░█░░░░██░░▀█▄▄▄█▄▄█▄████░█░░░ ░░░░█░░░░▀▀▄░█░░░█░█▀██████░█░░ ░░░░░▀▄░░░░░▀▀▄▄▄█▄█▄█▄█▄▀░░█░░ ░░░░░░░▀▄▄░▒▒▒▒░░░░░░░░░░▒░░░█░ ░░░░░░░░░░▀▀▄▄░▒▒▒▒▒▒▒▒▒▒░░░░█░ ░░░░░░░░░░░░░░▀▄▄▄▄▄░░░░░░░░█░░",
            "Sonido de Bruh, efecto número uno",
            "does this fit the instagram message limit",
            "You have angered Matt Riddle.",
            "Vro",
            "I sent this to my brother",
            "What if I copy this for mobile users before the bot, will I steal all the karma??",
            "Brov",
            "No a hi eh..  IM GONNNAS A.     SAYYYYY. T GE.    N WORD",
            "you're\\*",
            "Woah",
            "bro I don't care being called bro bro",
            "r/Pyrocynical",
            "Shit emoji",
            "Bro",
            "I hate how you can’t copy on mobile",
            "Fact: indian scammers on discord DMs usually start their pathetic \"plis give password\" attempt with the word BRO",
            "Bro....",
            "Automod needs this",
            "Bro? Why do you call me bro? I’m not your bro, okay “bro” ??????? You know “bro” I actually have a name, maybe you should try using it “bro.” What does bro even mean??????? Brother???? Am I your brother now???? Do I look like your brother??????? Does bro stand for something????? Broke Retarded Orphan???? So now I’m a retard??? And your poking fun that my cousin’s, friend’s, uncle is an orphan???? At this day and age, you’d think you’d have some respect “bro.” Yanno there are 554,000 homeless Americans every night living on the street because they don’t have a home and they are homeless people without homes to live in???? But you don’t care because they aren’t your “bros” are they “bro” ??????? I didn’t think so “bro.” So next time you call someone bro just remember that it’s not funny to make fun of poor orphans with disabilities “bro.” Okay, “bro” ?????????? By the way, Chad’s having like a dope ass party and whatever on Friday so like if you wanna go I’m down but like Chelsea’s like such a fucking bitch and like I think she’ll be there. Anyways, bro, I love you <3 talk to you later my mom needs help bringing in the groceries.",
            " I like how this assumes that i have a mom",
            "That's your opinion, you don't \nhave to come for me. You're just \na problematic person looking \nfor clout and tbh it hurts that \nit's working, but, yk. it's still your \nopinion, we all have different ones.\nBlocked, reported, and virtually bitch \nslapped. You should be ashamed of \nyourself, nvm idiots cant be. About it's \nsad you have to come for other things \nbc you don't have any happiness of ur \nown lmaoaoaoa",
            "Brew..",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/confession] [Bro](https://www.reddit.com/r/confession/comments/cbupnc/bro/)\n\n- [/r/ghiaccio_irl] [Ghiaccio when la squadra calls him \"bro\"](https://www.reddit.com/r/ghiaccio_irl/comments/c1hir5/ghiaccio_when_la_squadra_calls_him_bro/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Let’s take this to #911",
            "bruh momento numero dos",
            "Wtf is this comment section bro",
            "Me and my brother were pranking my friend by sending the same thing to him and he said \"STOP BRO\"",
            "Bruh sound effect #82",
            "ok ghiaccio",
            "Emoji",
            "bro",
            "K bro",
            "bro...",
            "Oh my god bro.\n\nYou have just posted cringe.\n\nYou are now lose subscriber.",
            "Holy shit if you try rapping it with a beat in your head it works pretty nice"
        ]
    },
    {
        "post_id": "e5ymao",
        "author": "CaptainJMG",
        "title": "Rule 34",
        "url": "https://www.reddit.com/r/copypasta/comments/e5ymao/rule_34/",
        "score": 7312,
        "num_comments": 133,
        "created_utc": 1575463074.0,
        "selftext": "Rule 34. The fabled 34th Rule of the internet. The Rule is simple: if it exists, then there is porn of it. The Rule is always true. You cannot break it. No one can. However, what about the reverse of this Rule? If there is no porn of it, it does not exist. This is the unspoken dark side of The Rule. I quickly asked myself \"is there porn of me?\". I nervously typed in my name on some popular porn sites. I didn't find anything. As I went from one porn site to the next, dread slowly filled me. Pornhub. The Rule remains true. Xvideos. The Rule remains true. Youporn. The Rule remains true. I got desperate, so I went to more obscure and niche websites. Hentai Haven. The Rule Remains true. Nhentai. The Rule Remains true. Hanime. The Rule remains true. I even visited the dark web looking for anything. Even a crayon drawing would do. But as I clicked on the last porn website and typed in my name, I realized that I was slowly fading out of existence. Quickly I opened Adobe Photoshop and started drawing porn of myself. It was the only way. Head, body, arms. I was 25% gone. Legs, feet, knees. I was 50% gone. Now all I needed was the dick. This was the challenging part. I drew and I drew. I was 75% gone. My dick took up most of the canvas. I was 90% gone. I was almost done. I just needed the tip. I was 99% Gone. When I finished I was relieved. Somehow I had broken the rule. And when I noticed, reality began to collapse. Everyone should make porn of themselves to be safe. So yeah, that's why you should send me nudes.",
        "permalink": "/r/copypasta/comments/e5ymao/rule_34/",
        "comments": [
            "Rule 35 says that in the event of porn of something not existing, it is inevitable that it will\n\nThe rule proved true\n\nNow if you excuse me, I have to go prevent myself from being erased from reality",
            "idiot. you forgot to check e6 and FA",
            "Rule 34. The fabled 34th Rule of the internet. The Rule is simple: if it exists, then there is porn of it. The Rule is always true. You cannot break it. No one can. However, what about the reverse of this Rule? If there is no porn of it, it does not exist. This is the unspoken dark side of The Rule. I quickly asked myself \"is there porn of me?\". I nervously typed in my name on some popular porn sites. I didn't find anything. As I went from one porn site to the next, dread slowly filled me. Pornhub. The Rule remains true. Xvideos. The Rule remains true. Youporn. The Rule remains true. I got desperate, so I went to more obscure and niche websites. Hentai Haven. The Rule Remains true. Nhentai. The Rule Remains true. Hanime. The Rule remains true. I even visited the dark web looking for anything. Even a crayon drawing would do. But as I clicked on the last porn website and typed in my name, I realized that I was slowly fading out of existence. Quickly I opened Adobe Photoshop and started drawing porn of myself. It was the only way. Head, body, arms. I was 25% gone. Legs, feet, knees. I was 50% gone. Now all I needed was the dick. This was the challenging part. I drew and I drew. I was 75% gone. My dick took up most of the canvas. I was 90% gone. I was almost done. I just needed the tip. I was 99% Gone. When I finished I was relieved. Somehow I had broken the rule. And when I noticed, reality began to collapse. Everyone should make porn of themselves to be safe. So yeah, that's why you should send me nudes.",
            "[deleted]",
            "+translateto gothbold",
            "Wuwe 34. The fabwed 34th Wuwe of the intewnet. The Wuwe is simpwe: if it exists, then thewe is pown of it. The Wuwe is awways twue. You cannot bweak it. No one can. Howevew, what about the wevewse of this Wuwe? If thewe is no pown of it, it does not exist. This is the unspoken dawk side of The Wuwe. I quickwy asked mysewf \"is thewe pown of me?\". I newvouswy typed in my name on some popuwaw pown sites. I didn't find anything. As I went fwom one pown site to the next, dwead swowwy fiwwed me. Pownhub. The Wuwe wemains twue. Xvideos. The Wuwe wemains twue. Youpown. The Wuwe wemains twue. I got despewate, so I went to mowe obscuwe and niche websites. Hentai Haven. The Wuwe Wemains twue. Nhentai. The Wuwe Wemains twue. Hanime. The Wuwe wemains twue. I even visited the dawk web wooking fow anything. Even a cwayon dwawing wouwd do. But as I cwicked on the wast pown website and typed in my name, I weawized that I was swowwy fading out of existence. Quickwy I opened Adobe Photoshop and stawted dwawing pown of mysewf. It was the onwy way. Head, body, awms. I was 25% gone. Wegs, feet, knees. I was 50% gone. Now aww I needed was the dick. This was the chawwenging pawt. I dwew and I dwew. I was 75% gone. My dick took up most of the canvas. I was 90% gone. I was awmost done. I just needed the tip. I was 99% Gone. When I finished I was wewieved. Somehow I had bwoken the wuwe. And when I noticed, weawity began to cowwapse. Evewyone shouwd make pown of themsewves to be safe. So yeah, that's why you shouwd send me nudes.",
            "Is there rule 34 of rule 34?",
            "I whack it to myself every day",
            "Guys, I stole this from a different thread and it looked original, I had no idea I’d was a repost, but my karma whore side is telling me to not remove it.",
            "*pirated adobe photoshop",
            "+translateto comic sans",
            "Mass cannot be created or destroyed, unless it contradicts rule 34",
            "smh fella coulda just snapped a dic pic and be done with it\n\nsmh mh",
            "Repost",
            "Porno ergo sum",
            "This is my dick to scale boys \n\n⣿⣿⣿⣿⣿⣿⣿⣿⠟⠛⢉⢉⠉⠉⠻⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⣿⠟⠠⡰⣕⣗⣷⣧⣀⣅⠘⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⣿⠃⣠⣳⣟⣿⣿⣷⣿⡿⣜⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡿⠁⠄⣳⢷⣿⣿⣿⣿⡿⣝⠖⠄⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⠃⠄⢢⡹⣿⢷⣯⢿⢷⡫⣗⠍⢰⣿⣿⣿⣿⣿ ⣿⣿⣿⡏⢀⢄⠤⣁⠋⠿⣗⣟⡯⡏⢎⠁⢸⣿⣿⣿⣿⣿ ⣿⣿⣿⠄⢔⢕⣯⣿⣿⡲⡤⡄⡤⠄⡀⢠⣿⣿⣿⣿⣿⣿ ⣿⣿⠇⠠⡳⣯⣿⣿⣾⢵⣫⢎⢎⠆⢀⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢨⣫⣿⣿⡿⣿⣻⢎⡗⡕⡅⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢜⢾⣾⣿⣿⣟⣗⢯⡪⡳⡀⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⠄⢸⢽⣿⣷⣿⣻⡮⡧⡳⡱⡁⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡄⢨⣻⣽⣿⣟⣿⣞⣗⡽⡸⡐⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⡇⢀⢗⣿⣿⣿⣿⡿⣞⡵⡣⣊⢸⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⡀⡣⣗⣿⣿⣿⣿⣯⡯⡺⣼⠎⣿⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣧⠐⡵⣻⣟⣯⣿⣷⣟⣝⢞⡿⢹⣿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⡆⢘⡺⣽⢿⣻⣿⣗⡷⣹⢩⢃⢿⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣷⠄⠪⣯⣟⣿⢯⣿⣻⣜⢎⢆⠜⣿⣿⣿⣿⣿ ⣿⣿⣿⣿⣿⡆⠄⢣⣻⣽⣿⣿⣟⣾⡮⡺⡸⠸⣿⣿⣿⣿ ⣿⣿⡿⠛⠉⠁⠄⢕⡳⣽⡾⣿⢽⣯⡿⣮⢚⣅⠹⣿⣿⣿ ⡿⠋⠄⠄⠄⠄⢀⠒⠝⣞⢿⡿⣿⣽⢿⡽⣧⣳⡅⠌⠻⣿ ⠁⠄⠄⠄⠄⠄⠐⡐⠱⡱⣻⡻⣝⣮⣟⣿⣻⣷⣏⣾⢰⣈\n\nI am real",
            "One time I googled “llama jesus porn” and I found a video. So yeah...",
            "NTA, you deserve to exist",
            "[R/JoJo34](https://www.reddit.com/r/JoJo34?utm_medium=android_app&utm_source=share)",
            "karen cock sans",
            "Repost",
            "+transleteto japanese",
            "This is beautiful",
            "This is one of my favorites!",
            "Why am I still alive? How am I not faded!?\n\n*worried/exited glances*",
            "It's a theorem, not a definition! The converse doesn't necessarily have the same truth value as the conditional!",
            "who else noting down the sites- \\*cough\\*",
            "Minecraft exists",
            "Valid premise form. Good job",
            "REEEEPOOOSSST",
            "[deleted]",
            "Isn't this a repost?",
            "haha yes funny copypasta but this is called \"denying the antecedent\" which makes this entire point fallacious",
            "Last time I checked there is no baby yoda r34",
            "repost",
            "This is what happened before Genesis",
            "Ur committing converse error. Did u never take 7th grade math",
            "Nice",
            "Gimme day rule 34 r34",
            "This is a repost but good try",
            "you forget the second part of the rule.... the whole rule is \"if it exists there is porn of it and if not get creating\"",
            "wut about me?",
            "I'm pretty sure Supreme Commander: Forged Alliance doesn't have any r34, prove me wrong",
            "NTA",
            "Test",
            "I'm 13 Soo......... Uhh",
            "Is there porn of the letter J?",
            "people say this but is see no memoryhead rule 34 and undertale has been out for 4 years",
            "I porn, therefore I am.",
            "Ok",
            "Octopath Traveler doesn't exist enough. Somebody make more rule 34 of it so it can exist more.",
            "STOP! You've violated the law! Pay the court a fine or serve your sentence. Your stolen goods are now forfeit.",
            "deep",
            "repost",
            "Bro this is cringe"
        ]
    },
    {
        "post_id": "ae3a9q",
        "author": "Zapdomm",
        "title": "If you're being mugged, just say no. Your robbers cannot legally take any of your possessions.",
        "url": "https://www.reddit.com/r/copypasta/comments/ae3a9q/if_youre_being_mugged_just_say_no_your_robbers/",
        "score": 7313,
        "num_comments": 152,
        "created_utc": 1547008829.0,
        "selftext": " \"I'm so proud of my daughter for stopping a bank robbery today. The robbers went in and held their guns up, telling everyone to put their hands in the air. My daughter (only 3 years old!) stood her ground, faced them directly in the eye, and simply said: \"If you're being mugged, just say no. Your robbers cannot legally take any of your possessions.\" Almost instantaneously, the robbers collapsed to the floor, suffering from a bipolar seizure. Everyone clapped and she was given position as senator of the state of Florida, as well as invited by the Democratic National Convention to run for President in 2020. What an unbelievable event! I'm so blessed by God to have such a wonderful child. \" ",
        "permalink": "/r/copypasta/comments/ae3a9q/if_youre_being_mugged_just_say_no_your_robbers/",
        "comments": [
            " \"I'm so proud of my daughter for stopping a bank robbery today. The robbers went in and held their guns up, telling everyone to put their hands in the air. My daughter (only 3 years old!) stood her ground, faced them directly in the eye, and simply said: \"If you're being mugged, just say no. Your robbers cannot legally take any of your possessions.\" Almost instantaneously, the robbers collapsed to the floor, suffering from a bipolar seizure. Everyone clapped and she was given position as senator of the state of Florida, as well as invited by the Democratic National Convention to run for President in 2020. What an unbelievable event! I'm so blessed by God to have such a wonderful child. \" ",
            "you need 200 iq to understand this",
            "And the name of all the people in the bank? Albert Einstein.",
            "And then everyone clapped.",
            "iq gamer asshole smart proud anime",
            "Proud",
            "Policeman Sal didn’t arrive within 15 minutes, so the robbers were legally allowed to leave, making him tonight’s big loser",
            "This is a masterpiece.",
            "Iq\n\nSmart\n\n",
            "Thats how mafia works?",
            "⚜️🅾️✝️5️⃣⛎🅱️🅰️✝️🅾️❗️⬜️ℹ️5️⃣⬜️✝️♓️3️⃣⬜️🅱️3️⃣5️⃣✝️⬜️Ⓜ️🅰️♑️9️⃣🅰️⏺⬜️3️⃣♈️3️⃣🕞⚜️⬜️♌️🅰️⚜️▪️⬜️ℹ️⬜️🔱🅰️♑️✝️⬜️✝️🅾️⬜️🕞⛎♑️⬜️🅾️♈️3️⃣🕞⬜️✝️🅾️⬜️Ⓜ️⚜️⬜️🕞🅾️🅾️Ⓜ️⬜️☦️⛎1️⃣1️⃣⬜️🅾️☦️⬜️Ⓜ️🅰️♑️9️⃣🅰️⬜️🅰️♑️♌️⬜️ℹ️Ⓜ️Ⓜ️3️⃣🕞5️⃣3️⃣⬜️Ⓜ️⚜️5️⃣3️⃣1️⃣☦️⬜️ℹ️♑️⬜️✝️♓️3️⃣⬜️♑️🅾️♑️5️⃣🅿️3️⃣☪️ℹ️☦️ℹ️☪️⬜️🔱🅾️🕞1️⃣♌️⬜️🅾️☦️⬜️⚜️🅾️✝️5️⃣⛎🅱️🅰️⬜️⏭🅾️ℹ️🔱🅰️ℹ️⏺⬜️ℹ️⬜️🅰️Ⓜ️⬜️🌀🅾️ℹ️♑️🌀⬜️✝️🅾️⬜️⚜️🅾️✝️5️⃣⛎🅱️🅰️➖☪️♓️🅰️♑️⬜️♑️🅾️🔱⏺⬜️🌀🅾️🅾️♌️🅱️⚜️3️⃣▪️⬜️☦️🅾️🕞✝️♑️ℹ️✝️3️⃣⏺⬜️ℹ️🔻Ⓜ️⬜️🔱ℹ️✝️♓️⬜️✝️♓️3️⃣⬜️⚜️🅾️ℹ️🔱🅰️✝️5️⃣⬜️♑️🅾️🔱➖",
            "Did some asshole gamer weaboo just talk proudly about their IQ?",
            "Swiper no swiping!! 😩😩👌🏻",
            "Auto mod is sentient?",
            "Swiper no swiping",
            "Iq  iq\n\n\nEdit: yes thats what trigger him",
            "Wtf is automod doing",
            "That gril?  Alexandria Occasio Cortez",
            "Man, this had me in stitches.",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/shittylifeprotips] [SLPT: Just say no if you're being robbed](https://www.reddit.com/r/ShittyLifeProTips/comments/ae784j/slpt_just_say_no_if_youre_being_robbed/)\n\n- [/r/technicallythetruth] [Not legally...](https://www.reddit.com/r/technicallythetruth/comments/ae7czu/not_legally/)\n\n- [/r/thathapp] [Probably a repost](https://www.reddit.com/r/thathapp/comments/aeb2je/probably_a_repost/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "10/10 would copypasta again",
            "I’m gettin a feelin that’s not what went down",
            "r/thathapp",
            "That's how mafia works",
            "Aborted fetus at its finest",
            "Oh h*ck",
            "Hey wtf, cut that out.",
            "Iq",
            "Gamer",
            "Asshole",
            "Smart",
            "Proud",
            "Anime",
            "Pride",
            "Question",
            "I love this",
            "Ok",
            "Hrmmm a disturbance with the anti-gun-logic side of the force I sense... ",
            "iq",
            "'bipolar seizure'",
            "Your analogy is exactly the reason conservatives don’t understand higher education. A gun and a bible is more important that going to a good college "
        ]
    },
    {
        "post_id": "ouvhcs",
        "author": "None",
        "title": "Onii-chan, what are you doing?",
        "url": "https://www.reddit.com/r/copypasta/comments/ouvhcs/oniichan_what_are_you_doing/",
        "score": 7313,
        "num_comments": 331,
        "created_utc": 1627684458.0,
        "selftext": " 8====D  ()\n\n n-no.. onii-chan, dont do it! \n\n8====D() \n\no-onii-chan? \n\n8====D)\n\n o-ow! b-be a little more gentle... just the tip.. ok? >w< \n\n8====) \n\nowieeeeeee \\*blood starts coming out\\* i-im not a virgin anymore... \n\n8===) \n\nn-no! onii-chan.. you baka! i-i said just the tip.. my pussie's starting to get wet.. you can go a little rougher, a-alright? \n\n8) \n\nn-no!! i said just a little rougher, b-baka! idiot! dumb dumb dumbo albert Eisenstein-ass-hair-cut  diaper doo doo head! \n\n8====D) \n\nahh! mmm... be a little bit more gentle, alright? d-don't pull it out so s-suddenly like t-that...\n\n 8) \n\nmmm.. you really like my manpussy, dont you? \\*voice changes into deep and manly voice\\* what's that? suprised? YOU WERE FUCKING A MAN, THIS WHOLE TIME! YOU'RE GAY! WWWWWRYYYYYYYYY!! YOU THOUGHT YOU WERE FUCKING A GIRL, BUT IT WAS ME, DIO! AND NOW MY MAN PUSSY IS GOING TO BE DELETED FROM EXISTENCE USING MY STANDS ABILITY!\n\n ()\n\n |\n\n \\-  \n\n&#x200B;\n\nBBBBBBBBBBBBBBBBBBBBBBBBBBBAKEMONOGA \n\n that was fun, onii-chan.",
        "permalink": "/r/copypasta/comments/ouvhcs/oniichan_what_are_you_doing/",
        "comments": [
            "written by a guy",
            "i'd fuck a vampire",
            "the average jojo fan",
            "The subtitles are terrible",
            "What the fuck",
            "This is the first post on this sub that made me want to die",
            "[deleted]",
            "> YOU WERE FUCKING A MAN, THIS WHOLE TIME\n\nEven better",
            "this was literally what it was like trying to get porn on the internet in the early 1990s",
            "went from 100 to 0 real quick",
            "what about the part when onii-chan do:\n\n8====D)\n\n8)\n\n8=D)\n\n8)\n\n8=D)\n\n8)\n\nya know what? fml kill me.",
            "Im on mobile so i cant send this to my friend, someone bless me with sending a comment version so i can copy it",
            "BAKA MONOGA! DOITSU NO KAGAKU WA SEKAI ICHI!!!",
            "Is that a jojo refrence",
            "Downvoted. Fuck you",
            "why is nobody talking about the dumb dumb dumbo albert Eisenstein-ass-hair-cut diaper doo doo head",
            "and that kids is how you're meant to use sticky fingers",
            "I will shit on your deathbed",
            "JESSE WHAT THE FUCK ARE YOU TALKING ABOUT",
            "The amount of people who don't understand how a hymen works",
            "I want you to delete this",
            "There shouldve been 3 bombs",
            "When did Dio get [The Hand] and why did he quote Strohiem?",
            "Shinitai",
            "Sugoi nyan. UwU subarashi. Onii chan OwO 🤤☝️⭕😍😳🥱✊🏻👄",
            "Jesus",
            "It was me Barry, I pretended to be your first love, you were fucking a man this whole time!",
            "did his dick dissappear",
            "⣾⣿⠿⠿⠶⠿⢿⣿⣿⣿⣿⣦⣤⣄⢀⡅⢠⣾⣛⡉⠄⠄⠄⠸⢀⣿⠄ ⢀⡋⣡⣴⣶⣶⡀⠄⠄⠙⢿⣿⣿⣿⣿⣿⣴⣿⣿⣿⢃⣤⣄⣀⣥⣿⣿⠄ ⢸⣇⠻⣿⣿⣿⣧⣀⢀⣠⡌⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠿⣿⣿⣿⠄ ⢸⣿⣷⣤⣤⣤⣬⣙⣛⢿⣿⣿⣿⣿⣿⣿⡿⣿⣿⡍⠄⠄⢀⣤⣄⠉⠋⣰ ⣖⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⢇⣿⣿⡷⠶⠶⢿⣿⣿⠇⢀⣤ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽⣿⣿⣿⡇⣿⣿⣿⣿⣿⣿⣷⣶⣥⣴⣿⡗ ⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠄ ⣦⣌⣛⣻⣿⣿⣧⠙⠛⠛⡭⠅⠒⠦⠭⣭⡻⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃⠄ ⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄⠄⠹⠈⢋⣽⣿⣿⣿⣿⣵⣾⠃⠄ ⣿⣿⣿⣿⣿⣿⣿⣿⠄⣴⣿⣶⣄⠄⣴⣶⠄⢀⣾⣿⣿⣿⣿⣿⣿⠃⠄⠄ ⠈⠻⣿⣿⣿⣿⣿⣿⡄⢻⣿⣿⣿⠄⣿⣿⡀⣾⣿⣿⣿⣿⣛⠛⠁⠄⠄⠄ ⠄⠄⠈⠛⢿⣿⣿⣿⠁⠞⢿⣿⣿⡄⢿⣿⡇⣸⣿⣿⠿⠛⠁⠄⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠉⠻⣿⣿⣾⣦⡙⠻⣷⣾⣿⠃⠿⠋⠁⠄⠄⠄⠄⠄⢀⣠⣴ ⣿⣶⣶⣮⣥⣒⠲⢮⣝⡿⣿⣿⡆⣿⡿⠃⠄⠄⠄⠄⠄⠄⠄",
            "I wish I couldn't read",
            "Can you Shut the fuck up please",
            "Why?",
            "Both the unfunniest and funniest thing I've read.",
            "Op can I lick your balls",
            ">albert Eisenstein-ass-haircut diaper doo doo head\n\nI fucking lost it here lmaooo",
            "What the fuck??? What is wrong with you?",
            "Im gonna kill myself",
            "came for the loli hentai left for the jojo reference",
            "R/UnexpectedJoJo",
            "‼️‼️HOLY FUCKING SHIT‼️‼️‼️‼️ IS THAT A MOTHERFUCKING JOJO REFERENCE??????!!!!!!!!!!11!1!1!1!1!1!1! 😱😱😱😱😱😱😱  JOJO IS THE BEST FUCKING ANIME 🔥🔥🔥🔥💯💯💯💯 JOSUKE IS SO BADASSSSS 😎😎😎😎😎😎😎👊👊👊👊👊 ORAORAORAORAORALORAORAORAORAORAORAORAORAORAORAORAORAORAORAORA 😩😩😩😩😩😩😩😩 😩😩😩😩 MUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDA 🤬😡🤬😡🤬😡🤬🤬😡🤬🤬😡WRYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Oh you’re approaching me❓❓❓❓❓❓❓❓❓❓But it was me, Dio‼️‼️‼️‼️‼️‼️‼️‼️‼️‼️😂🤣😂🤣😂🤣😂😂😂🤣🤣🤣😂😂😂 r/shitpostcrusaders r/unexpectedjojo r/expectedjojo perfectly balanced as all things should be r/unexpectedthanos r/expectedthanos for balance \n\nSHUT THE FUCK UP",
            "For spanish people, here you have translation if your friends dont understand english:",
            "Straightest JoJo fan",
            "Top tier copypasta here",
            "why am I hard",
            "This is going down as a certified classic",
            "Yeah",
            "and that is how okuyasu should have used za hando",
            "What in the Kentucky Fried, 12 secret spices, finger licking good fuck is this shit",
            "Top Ten Anime Plot Twists",
            "Just say no homo",
            "the voice inside my head reading this changed from onii chan to duke nukem in literally one sentence",
            "Butler, fetch me the scoop, i no longer wish to see \n\n(Whats wrong with these people?)",
            "What a story, from DIO to Von Stroheim",
            "I don't care. Looks female enough.",
            "haha Jonathan",
            "This has been the biggest plot twist",
            "I thought it was about Chris Chan at first",
            "[removed]",
            "1984",
            "bruh where is cummybot",
            "the",
            "[Oh hey onii chan](https://youtu.be/Nsergvn08Dw)",
            "Einstein ass haircut diaper doo doo head",
            "Jesus fuck",
            "I read it as the Arbies commercial guy when his voice got deep. He got the meat.",
            "everyone makes mistakes",
            "Had me in the first half. Not gonna get a boner anymore.",
            "BRRRRRAAAKA MONOGA",
            "r/UnexpectedJojo",
            "What the fuck",
            "._.\n-_-\n._.\n\n\n\nwhat the fuck",
            "Still a win ngl",
            "Fucker what?",
            "Jesus fucking christ what have you done",
            "Interesting",
            "Cringe",
            "jojo fans",
            "Why did you fucking write this?",
            "Why is the bussy bleeding tho",
            "8====D ()\n\nn-no.. onii-chan, dont do it!\n\n8====D()\n\no-onii-chan?\n\n8====D)\n\no-ow! b-be a little more gentle... just the tip.. ok? >w<\n\n8====)\n\nowieeeeeee *blood starts coming out* i-im not a virgin anymore...\n\n8===)\n\nn-no! onii-chan.. you baka! i-i said just the tip.. my pussie's starting to get wet.. you can go a little rougher, a-alright?\n\n8)\n\nn-no!! i said just a little rougher, b-baka! idiot! dumb dumb dumbo albert Eisenstein-ass-hair-cut diaper doo doo head!\n\n8====D)\n\nahh! mmm... be a little bit more gentle, alright? d-don't pull it out so s-suddenly like t-that...\n\n8)\n\nmmm.. you really like my manpussy, dont you? *voice changes into deep and manly voice* what's that? suprised? YOU WERE FUCKING A MAN, THIS WHOLE TIME! YOU'RE GAY! WWWWWRYYYYYYYYY!! YOU THOUGHT YOU WERE FUCKING A GIRL, BUT IT WAS ME, DIO! AND NOW MY MAN PUSSY IS GOING TO BE DELETED FROM EXISTENCE USING MY STANDS ABILITY!\n\n()\n\n|\n\n-\n\n​\n\nBBBBBBBBBBBBBBBBBBBBBBBBBBBAKEMONOGA\n\nthat was fun, onii-chan.",
            "That's enough internet for the day",
            "Fucking LOL",
            "what",
            "?",
            "?",
            "Eat my weeiiiiiiigghhnorrr",
            "8)",
            "Biggest plot twist of the 20th century",
            "Why",
            "How to copy, on mobile",
            "Yeah, I'm gonna take my horse\r  \nTo the old town road\r  \nI'm gonna ride 'til I can't no more\r  \nI'm gonna take my horse to the old town road\r  \nI'm gonna ride (Kio, Kio) 'til I can't no more\r  \nI got the horses in the back\r  \nHorse tack is attached\r  \nHat is matte black\r  \nGot the boots that's black to match\r  \nRiding on a horse, ha\r  \nYou can whip your Porsche\r  \nI been in the valley\r  \nYou ain't been up off the porch, now\r  \nCan't nobody tell me nothing\r  \nYou can't tell me nothing\r  \nCan't nobody tell me nothing\r  \nYou can't tell me nothing\r  \nRiding on a tractor\r  \nLean all in my bladder\r  \nCheated on my baby\r  \nYou can go and ask her\r  \nMy life is a movie\r  \nBull riding and boobies\r  \nCowboy hat from Gucci\r  \nWrangler on my booty\r  \nCan't nobody tell me nothing\r  \nYou can't tell me nothing\r  \nCan't nobody tell me nothing\r  \nYou can't tell me nothing\r  \nYeah, I'm gonna take my horse\r  \nTo the old town road\r  \nI'm gonna ride 'til I can't no more\r  \nI'm gonna take my horse to the old town road\r  \nI'm gonna ride 'til I can't no more\r  \nI got the",
            "fucking cringe ngl",
            "dio is trans",
            "Most funny Jojo fan",
            "I should seek professional help after reading this",
            "https://www.youtube.com/watch?v=FFRi2xsei_o",
            "What in the fuck",
            "Why.....do ...i....follow...this......subreddit.......*gag*",
            "imagine being this retarded",
            "My brain cells died reading this",
            "What the everloving fuck",
            "Double wide surprise",
            "WWRRRRRRYYYYYYYYYYYYYYYYYYY",
            "How can I copy it",
            "what",
            "Yo",
            "Dude I hate how I read the last line in different voice",
            "This was the nail in the coffin, goodbye",
            "I beg your fuckin' pardon?",
            "I once again wish that I was Jared, 19",
            "8)",
            "Please die in a fire",
            "NOOOOOO, i just got done nutting to your post to FIND OUT that I am GAY",
            "X6",
            "#GERMAN SCIENCE",
            "I've read this 3 times and I still think OP wrote this himself",
            "Dio's hot so it's ok",
            "Turns out he wasn't Dio and he was Storheim all along"
        ]
    },
    {
        "post_id": "hccac7",
        "author": "None",
        "title": "My little brother fucking died",
        "url": "https://www.reddit.com/r/copypasta/comments/hccac7/my_little_brother_fucking_died/",
        "score": 7310,
        "num_comments": 315,
        "created_utc": 1592612711.0,
        "selftext": "3 .50 Cal AE at the back of his skull. Little shit fucking deserved it. I didn't feel shit when I pulled the trigger, but as soon as his dead body dropped on the floor, I was fucking ecstatic. Ever since he was three, he's been getting away with shit that I would have been kicked out of the house for, like drawing shitty doodles on my room's door or cut of the electricity for the entire house except his room. I always knew he was going to turn out a sociopathic, spoiled, little brat. Hell, he already was by the age of three. I would write this on my journal, but I want all of you to know that I did nothing wrong whenever you see the report of my brother's murder on Fox, CNN or whatever.\n\nYears of being ignored by my parents in favor of that little shit has broken me mentally. Truth be told, I was terrified of him. Not only that, I was terrified of my own sanity. Everyone else seemed to think he was such an angel who 'pulled little pranks on people'. He would always defend his actions by refering to his age. \"Im onwy twee\", \"Im onwy fow\" \"Im onwy fwife\". Shit went on and on for years. I couldn't take it anymore.\n\nRight now I'm fleeing the town of Plainview. I'm hiding in the forest, but I'll have to move soon before local law enforcement tracks me down. Maybe I'll take one of them down and boost his car. After that, I don't know where I'll go. I could go South to Texas, New Mexico or Tenessee. Canada and Mexico are off limits, borders are too risky, besides, I left my passport. Definately not staying anywhere near New England though. Only sad thing about this is I won't ever get to see my friend Rowley ever again. Eh, I didn't really like him anyway.\n\nIf you are reading this from hell, fuck you Manny.\n\n-Greg Heffley",
        "permalink": "/r/copypasta/comments/hccac7/my_little_brother_fucking_died/",
        "comments": [
            "Somehow I knew that this was written from Greg Heffley's PoV when I saw the bit about cutting off the electricity to every room except his own. Bravo.",
            "Wow even the bots can’t say that",
            "As soon as I saw “I’m onwy thwee” I knew exactly what it would fucking be",
            "Manny should have been aborted",
            "Oh no where did cummy go?",
            "frick.",
            "Censored version:\n\n \n\n3 .50 Cal AE at the back of his skull. Little sh\\*t f\\*cking deserved it. I didn't feel sh\\*t when I pulled the tr\\*gger, but as soon as his de\\*d body dropped on the floor, I was f\\*cking ecstatic. Ever since he was three, he's been getting away with sh\\*t that I would have been kicked out of the house for, like drawing sh\\*tty doodles on my room's door or cut of the electricity for the entire house except his room. I always knew he was going to turn out a sociopathic, spoiled, little brat. H\\*ll, he already was by the age of three. I would write this on my journal, but I want all of you to know that I did nothing wrong whenever you see the report of my brother's m\\*rder on Fox, CNN or whatever.\n\nYears of being ignored by my parents in favor of that little sh\\*t has broken me mentally. Truth be told, I was terrified of him. Not only that, I was terrified of my own sanity. Everyone else seemed to think he was such an angel who 'pulled little pranks on people'. He would always defend his actions by refering to his age. \"Im onwy twee\", \"Im onwy fow\" \"Im onwy fwife\". Sh\\*t went on and on for years. I couldn't take it anymore.\n\nRight now I'm fleeing the town of Plainview. I'm hiding in the forest, but I'll have to move soon before local law enforcement tracks me down. Maybe I'll take one of them down and boost his car. After that, I don't know where I'll go. I could go South to Texas, New Mexico or Tenessee. Canada and Mexico are off limits, borders are too risky, besides, I left my passport. Definately not staying anywhere near New England though. Only sad thing about this is I won't ever get to see my friend Rowley ever again. Eh, I didn't really like him anyway.\n\nIf you are reading this from h\\*ll, f\\*ck you Manny.\n\n\\-Greg Heffley",
            "google translated version:\n\n\nBrother\n\nAR consumes 3.50 calories. Find a small toilet. I think of the time when he covered the work and when he was frustrated and when there was no land he made a small piece of cloth. I was a single family, living alone at the age of 3, when I saw the dog asking for directions or not seeing the door installed. I certainly knew a little, and it changed my expectations. Social trouble is minimal. Destruction, I'm three. I want to write a newspaper, but I want to tell you that nothing happened to my brother Fox, CNN, etc.\n\nShe was a parent for several years and had to overcome not only fear of music, but also awareness and design. Some people believe that angels seek social welfare. \"If he talks about it, try to stay safe.\" I'm not right, \"Hey, I can't go near 90. It's there.\n\nNow I can see this is the jungle city that promises to speed up. I was able to reach one of these cars. Wherever I go in South Texas, Mexico Mexico or Tennessee. The god of Mexico has given dangerous access to Canada from Mexico. Even better outside the UK. Sorry: I will never see you again and will not be with you from the assembly. Hey, I'm not doing anything.\n\nIf Ibn Jahannam reports reading semen.\n\nGreg Fossil",
            "Damn the end is one hell of a plot twist",
            "I got **severe** whiplash from the word “Rowley”",
            "I didn’t even fucking think god diary of a wimpy kid haha that was funny as hell lol",
            "Manny fucking deserves this",
            "Where'd u/cummybot go",
            "you literally reposted my post and got 4.7k upvotes. I love reddit",
            "r/LodedDiper",
            "NTA he raised some MASSIVE red flags by existing.",
            "Fucking hate this new Christian scheme",
            "Manny bad",
            "WHERE THE FUCK IS CUMMY",
            "This is a CHTISTIAN sub reddit",
            "i knew it would be about greg killing manny from the second he said journal",
            "I fucking knew this would be a manny copypasta before i reached the second paragraph",
            "NTA, your house, your rules",
            "Greg heffley",
            "[removed]",
            "[removed]",
            "Omg I drew parallels to Diary of a wimpy kid the whole time and not once did I consider that his little brother is fucking manny I’m so dumb",
            "The ending got me",
            "Nta play games stupid prizes win",
            "Honestly Thought this was a fucked Offmychest post till i saw the sub title lol",
            "Greg would have found a way to frame Rowley",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "I was thinking abt Manny from the start cuz of r/fuckmanny",
            "[removed]",
            "[removed]",
            "I KNEW IT",
            "They had us in the first half not gonna lie",
            "[removed]",
            "[removed]",
            "i feel like it's kinda foreshadowing my future of killing my brother",
            "I knew from the first line. This is classic.",
            "Lmao I’m the one that got away with most bad stuff I did(",
            "[removed]",
            "Hitler deserves to get shot",
            "r/LodedDiper?",
            "This is fake Greg would use a cannon or musket",
            "At first I thought this was relationship advice but then I saw it was copy pasta",
            "I thought this was real before I saw the subreddit",
            "absolute fuccing mad lad",
            "Why do I relate to this in a few areas?\nAm I insane",
            "u/GlitchMaster2 please make something out of this",
            "[removed]",
            "Damn he shot him with a 50 AE round? That’s only shot out of a fucking desert eagle. There’s not much left of Manny’s head I’d bet.",
            "food",
            "Stream",
            "Wasn't this in r/teenagers? lmfao",
            "Did you get this from that one post in r/teenagers?",
            "NTA your house your rules",
            "Someone fill me in on what I’ve missed???? I read the story but what",
            "r/fuckmanny",
            "Rest in peace cummy",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "[removed]",
            "I was genuinely concerned until I read the cutting the electricity bit, the memories then flooded",
            "[removed]",
            "I read this all without realising the sub and was shitting my pants",
            "[removed]",
            "Bruh i legit posted this on this same sub right before you",
            "what about that bitch holly",
            "[removed]",
            "A true DOAWK fan would know this was a reference from \"... or cut of the electricity for the entire house except his room.\"",
            "NTA the little shit had it coming",
            "Where did Greg get a desert eagle",
            "Hey dickhead I posted this an hour before you, https://www.reddit.com/r/copypasta/comments/hcbxak/my_little_brother_fucking_died/?utm_source=share&utm_medium=ios_app&utm_name=iossmf, what a fucking asshole. You had to fucking repost this.",
            "NTA, your penis, your rights\n\nPlay stupid games, get shot in the back of your head by Greg hefley",
            "Bruhhhhhh hahahahaha i didn’t get it till I searched up the name",
            "Food",
            "Ketchup",
            "Reposted already",
            "I was thinking from the start that this sounded like something at r/lodeddiper, and I was right.",
            "The fuck is this",
            "I realized it was Greg when it said \"Ever since he was three\"",
            "Nice repost bro",
            "Had us in the first half not gonna lie",
            "Should have ended with: \"...and now I'm stuck here with you guys...\"  \n\nBest campfire story ever!",
            "When I saw the title I thought it was a r/teenagers post for some reason",
            "Fuck shit piss balls",
            "well done",
            ">yes",
            "[deleted]",
            "nta, your gun, your rules",
            "Can someone plz comment the post so i can copypaste",
            "Damn I’m soo high and that fucked me up wei😂i was like wtf dude we have to find them😊 thx for the story",
            "Top 10 anime plot twists",
            "Calm down Greg, we're your friends!"
        ]
    },
    {
        "post_id": "cmi9ab",
        "author": "RealRepeat",
        "title": "If me 🤠 or my kids 🧒🧒 are under siege 💥😱 by 30-50 hogs 🐗🐗 in 3-5 minutes 🕒🕔 and only one1️⃣1️⃣could survive💀🏥 then you can catch me in the mud😳💩 getting feral 😈😩😏 with the tribe 🐗🐽",
        "url": "https://www.reddit.com/r/copypasta/comments/cmi9ab/if_me_or_my_kids_are_under_siege_by_3050_hogs_in/",
        "score": 7296,
        "num_comments": 150,
        "created_utc": 1565045147.0,
        "selftext": "",
        "permalink": "/r/copypasta/comments/cmi9ab/if_me_or_my_kids_are_under_siege_by_3050_hogs_in/",
        "comments": [
            "Idk what this means but I got some rimworld vibes",
            "If me 🤠 or my kids 🧒🧒 are under siege 💥😱 by 30-50 hogs 🐗🐗 in 3-5 minutes 🕒🕔 and only one1️⃣1️⃣could survive💀🏥 then you can catch me in the mud😳💩 getting feral 😈😩😏 with the tribe 🐗🐽",
            "By being deaf 👂🔇his other 👉 4 senses 🤯 are amplified ⚡ to unbelievable levels 📈 allowing him ☑ to sense stupidity 🐒🥴",
            "As a florida man 30-50 boars is not uncommon and is the perfect chance to lube up the drum mags for my AR and go hog-wild.",
            "Who the fuck says that LOL",
            "I feel threatened\n\n-A concerned hog",
            "Hakuna Matata my boys",
            "Im confused.. but erect",
            "What the fuck did you just fucking say about me, you little bitch? I'll have you know I graduated top of my class in the Navy Seals, and I've been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I'm the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. You're fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that's just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little \"clever\" comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn't, you didn't, and now you're paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You're fucking dead, kiddo.",
            "I'm gonna take my hogs to the old town road I'm gonna ride till I can't no more",
            "Thank your 🥰🥰",
            "wow this blew up 😳😳 like me with one lucky hog 2nite 💦💦😏",
            "Raiden, squeeze these hogs.",
            "Me getting attacked by a hog attack in Clash of Clans amirite",
            "This sounds like a caveman mixed with a kyle",
            " **If me 🤠 or my kids 🧒🧒 are under siege 💥😱 by 30-50 hogs 🐗🐗 in 3-5 minutes 🕒🕔 and only one1️⃣1️⃣could survive💀🏥 then you can catch me in the mud😳💩 getting feral 😈😩😏 with the tribe 🐗🐽**",
            "I want someone to make this a line in a rap. It rhymes.",
            "where the fuck is cummy",
            "My hungry ass thought it said hot dogs and i was confused as fuck",
            "Holy fuck I just looked up the original tweet and I cant stop laughing. Abs day is off, boys.",
            "~y",
            "Kreuzfelsenkurve, B31, 79874 Breitnau",
            "Is this a jojo reference",
            "What the fuck does it even mean"
        ]
    }
]