[
    {
        "post_id": "rt7tn6",
        "author": "Shot_Consequence_490",
        "title": "I became the first person to cum in 2022",
        "url": "https://www.reddit.com/r/copypasta/comments/rt7tn6/i_became_the_first_person_to_cum_in_2022/",
        "score": 7035,
        "num_comments": 169,
        "created_utc": 1640998856.0,
        "selftext": "December 31st 2021 - I sat in my chair furiously masturbating my dick desperate to release gallons of sperm but I resisted the urge and I kept edging for 5 minutes carefully watching the clock on my PC. I waited in anticipation until finally it was 2022. I ejaculated releasing loads and loads of gooey white cum everywhere, I moaned with satisfaction, proud of my achievement.\n\nI had just become the first person to cum in 2022. I look over my cum filled desk and chair with pride.\n\nSo all of you can go cry, because none of you will be able to claim my title of first person to cum in 2022. Go wallow in sorrow and self-pity at the fact that you missed the opportunity to ejaculate just when it reached the New Year at midnight. While you subhuman mere mortals are setting of fireworks at midnight, I am blasting a massive explosion of cum everywhere. Oh yes, I am now superior to everyone on the planet, bow down to me, the cum lord of 2022.\n\nHappy new year, losers.",
        "permalink": "/r/copypasta/comments/rt7tn6/i_became_the_first_person_to_cum_in_2022/",
        "comments": [
            "Jokes I did this but am from New Zealand",
            "Video proof or it didn't happen.",
            "December 31st 2021 - I sat in my chair furiously masturbating my dick desperate to release gallons of sperm but I resisted the urge and I kept edging for 5 minutes carefully watching the clock on my PC. I waited in anticipation until finally it was 2022. I ejaculated releasing loads and loads of gooey white cum everywhere, I moaned with satisfaction, proud of my achievement.\n\nI had just become the first person to cum in 2022. I look over my cum filled desk and chair with pride.\n\nSo all of you can go cry, because none of you will be able to claim my title of first person to cum in 2022. Go wallow in sorrow and self-pity at the fact that you missed the opportunity to ejaculate just when it reached the New Year at midnight. While you subhuman mere mortals are setting of fireworks at midnight, I am blasting a massive explosion of cum everywhere. Oh yes, I am now superior to everyone on the planet, bow down to me, the cum lord of 2022.\n\nHappy new year, losers.",
            "31 December 2021. I pressed desperate desperately to break my uterus to release my father and I waited for some 2022. It doesn't matter where you are. I am proud of my satisfaction with the removal of goods and loading.\n\n20 grams can be used by guests and chairs.\n\nSo you cry because everyone can destroy one nickname in 2022. The fact that going to a slow and psychological minute walls, you miss a chance to worship only when you get to the middle of the new year. Yeah, I'm now shattered 2022, melted.\n\nHappy New Year.",
            "I started cumming in 2021 and stopped in 2022. I was cumming at exactly 00:00:00:000. You are the second person to cum in 2022.",
            "Infinite cum. You sit on the toilet to jack off, but you begin to cum uncontrollably. After ten spurts you start to worry. Your hand is sticky and it reeks of semen. You desperately shove your dick into a wad of toilet paper, but that only makes your balls hurt. The cum accelerates. It’s been three minutes. You can’t stop cumming. Your bathroom floor is covered in a thin layer of baby fluid. You try to cum into the shower drain but it builds up too fast. You try the toilet. The cum is too thick to be flushed. You lock the bathroom door to prevent the cum from escaping. The air grows hot and humid from the cum. The cum accelerates. You slip and fall in your own sperm. The cum is now six inches deep, almost as long as your still-erect semen hose. Sprawled on your back, you begin to cum all over the ceiling. Globs of the sticky white fluid begin to fall like raindrops, giving you a facial with your own cum. The cum accelerates. You struggle to stand as the force of the cum begins to propel you backwards as if you were on a bukkake themed slip-and-slide. Still on your knees, the cum is now at chin height. To avoid drowning you open the bathroom door. The deluge of man juice reminds you of the Great Molasses Flood of 1919, only with cum instead of molasses. The cum accelerates. It’s been two hours. Your children and wife scream in terror as their bodies are engulfed by the snow-white sludge. Your youngest child goes under, with viscous bubbles and muffled cries rising from the goop. You plead to God to end your suffering. The cum accelerates. You squeeze your dick to stop the cum, but it begins to leak out of your asshole instead. You let go. The force of the cum tears your urethra open, leaving only a gaping hole in your crotch that spews semen. Your body picks up speed as it slides backwards along the cum. You smash through the wall, hurtling into the sky at thirty miles an hour. From a bird’s eye view you see your house is completely white. Your neighbor calls the cops. The cum accelerates. As you continue to ascend, you spot police cars racing towards your house. The cops pull out their guns and take aim, but stray loads of cum hit them in the eyes, blinding them. The cum accelerates. You are now at an altitude of 1000 feet. The SWAT team arrives. Military helicopters circle you. Hundreds of bullets pierce your body at once, yet you stay conscious. Your testicles have now grown into a substitute brain. The cum accelerates. It has been two days. With your body now destroyed, the cum begins to spray in all directions. You break the sound barrier. The government deploys fighter jets to chase you down, but the impact of your cum sends one plane crashing to the ground. The government decides to let you leave the earth. You feel your gonads start to burn up as you reach the edges of the atmosphere. You narrowly miss the ISS, giving it a new white paint job as you fly past. Physicists struggle to calculate your erratic trajectory. The cum accelerates. The cum begins to gravitate towards itself, forming a comet trail of semen. Astronomers begin calling you the “Cummet.” You are stuck in space forever, stripped of your body and senses, forced to endure an eternity of cumshots. Eventually, you stop thinking.",
            "And I was the first person to shit at exactly between 23:59:59 and 24:00:00",
            "Anon fails to realize the Australians already beat him.",
            "Not my fault, my dog was right next to me",
            "Teens back in 1943: *fights nazis*\n\nTeens today:",
            "[ Removed by Reddit ]",
            "OP lives in Tonga, Samoa, or the Phoenix islands\n\nEdit: Jarvis island is near those islands which is an epic stuff reference!!!!! this is freaking awesome",
            "Illegitimate, it wasn’t to daddy Dream. The council will decide your fate now.",
            "Im in hawaii im sad",
            "I’m cumming right now /hj",
            "Can't wait til he learns what timezones are.",
            "Average r/NewZealand user every new years.",
            "shit i havent nutted since last year",
            "People in Guam are like smh...",
            "did this in south east asia\n\nso L",
            "The cum accelerates",
            "You and millions of others I'm sure, hundreds of not thousands of others for each time zone I'm sure.\nGood copypasta doe",
            "nta your cum your rules",
            "Your not from New Zealand so you lie",
            "Based",
            "I reckon you need mental help",
            "If the deed had been done too early, it would have been the last of 2021.  \nVery akin to getting the last clap.",
            "I'm a chronic masturbator",
            "Shut yo shut your squiggly diggly wiggly jiggly pumpkin spice melted ice Nokia model E 2048 bubblegum dumdum ass the fuck up",
            "Happy new year? I guess...",
            "🙇‍♂️",
            "Darn it",
            "Amazing",
            "I nutted 5 min ago",
            "Uhh i guess i was the first person who made noodles directly at 12:00?",
            "Did you Cum or Became?",
            "You maybe have been the first to ejaculate.\n\nBut I'm sure I was the first to ajackalit",
            "Ultimate Chad",
            "Oh yeah? I was dropping my nut as the ball dropped. So, I was going from year to year. 1 nut 2 years buddy.",
            "👍",
            "I don't know why ? But that shit is just fucking hilarious",
            "cum fireworks",
            "Your  wrong I did it at exactly 12 not a second ahead",
            "❤️😍CUM😍❤️\nI wish I would be able to magically make cum appear. In a non-gay way, I just think that the taste is pretty good and it would break.the social stigma around drinking cum.\n\nAlso, public cum could affect our lifes pretty positively. I mean, we would not have to do the efforts to suck a penis to harvest it (I'm not gay tho) and we could just eat it in a bowl while watching a good movie. Maybe even sell it in theaters?\n\nCum is the literal solution to world hunger. Hooray for semen, the time will cum that y'all understand the true pleasure behind eating cum😍",
            "God Reddit has turned into such trash.",
            "[removed]",
            "Impressive"
        ]
    },
    {
        "post_id": "ejjs0y",
        "author": "Xenderman",
        "title": "What if we... started ww3?",
        "url": "https://www.reddit.com/r/copypasta/comments/ejjs0y/what_if_we_started_ww3/",
        "score": 7031,
        "num_comments": 127,
        "created_utc": 1578077445.0,
        "selftext": "What if we...😳😳 Started world War 3? 😍 😍 Jk Jk... unless?  Think about it...🤔 🤔 It'd be so romantic! 😘 😘Just you... 😳 Me... 😳 The 2 mile Crater... 😍 😍 and the 10,000 rads of radiation! 😉😉",
        "permalink": "/r/copypasta/comments/ejjs0y/what_if_we_started_ww3/",
        "comments": [
            " What if we...😳😳. Started world War 3? 😍 😍 Jk Jk... unless?  Think about it...🤔 🤔 It'd be so romantic! 😘 😘Just you... 😳 Me... 😳 The 2 mile Crater... 😍 😍 and the 10,000 rads of radiation! 😉😉",
            "r/snapchad",
            "Oh great! Another 2 sentence long pasta! What a game changer! I'm sure the 5 measly lines of text you just posted are going to be the next big copypasta in no time! This is hilarious! Great Stuff! I can really see this being the next big thing! It's gonna be the next \"Navy Seal\" or \"Penguin Of Doom\", I can feel it! I love how short and boring it was! Extra points for being extremely forgettable with no interesting lines, a complete lack of tone, and, as I mentioned earlier, an extremely compact 30 to 40 word length! You know what you should do? You should, unprompted, post this godawful pasta in the comments of a post on a separate subreddit and when people downvote you you can post it to [r/AteThePasta](https://www.reddit.com/r/AteThePasta/)! Now that would be funny! Almost as funny as the pasta itself, which, may I remind you, is extremely short! God I can't believe you came up with this all on your own! Thanks so much for this! It's truly a gift! And it made me realise that no matter how hard I try I will never find a copypasta as funny as this roughly 30 word paragraph that has already been forgotten by the 47 people who upvoted it, and the 20 people who commented !thesaurizethis over and over again! And I should give up all hope of coming up with such a great pasta in my life, so I'm simply going to kill myself tonight! This is your fault! Your copypasta made me kill myself! I'm going to write your reddit username in my suicide note, as well as the entire copypasta, which I should have no trouble fitting on the page since it's so fucking short! Thanks again! 😁",
            " What if we...😳😳. Stawted wowwd Waw 3? 😍 😍 Jk Jk... unwess?  Think about it...🤔 🤔 It'd be so womantic! 😘 😘Just you... 😳 Me... 😳 The 2 miwe Cwatew... 😍 😍 and the 10,000 wads of wadiation! 😉😉",
            "I'll stop the world and melt with you.\n\nI feel the difference and it getting better all the time.\n\nI'll stop the world and melt the jews. - adolf hitler (aka the 420th reincarnation of the one now known as Donald Trump: famous for best sellers like \"The Art of the Deal\" and hit shows like \"The Apprentice.)\"",
            "Haha nay, banish it",
            "Bro 😝 I can’t get 🤨 drafted 🧐 due to flat feet",
            "ESH you shouldn't start WWIII, WWIII shouldn't kill you.",
            "If WWIII does break out then historians are going to be confused at why we reacted like this lol",
            "lol",
            "This post is proof that we need WWIII",
            "Low key wanna say this to my crush",
            "What if we kissed in the charred body pile. Jk, unless",
            "I mean, we have nothing to lose",
            "Meow",
            "Cbt",
            "I had 3 strokes reading this",
            "everyone out here talking about nuclear war like just use some Radaway 🙄",
            "JOOOOOHHHHNNNYYYY GUIIIIIIITAAAAAARRR",
            "The next person who says this will be world war three is going to fucking denotate on the spot",
            "I just downvoted your comment.\n \n# FAQ\n \n## What does this mean?\n \nThe amount of karma (points) on your comment and Reddit account has decreased by one.\n \n## Why did you do this?\n \nThere are several reasons I may deem a comment to be unworthy of positive or neutral karma. These include, but are not limited to:\n \n* Rudeness towards other Redditors,\n* Spreading incorrect information,\n* Sarcasm not correctly flagged with a `/s`.\n \n## Am I banned from the Reddit?\n \nNo - not yet. But you should refrain from making comments like this in the future. Otherwise I will be forced to issue an additional downvote, which may put your commenting and posting privileges in jeopardy.\n \n## I don't believe my comment deserved a downvote. Can you un-downvote it?\n \nSure, mistakes happen. But only in exceedingly rare circumstances will I undo a downvote. If you would like to issue an appeal, shoot me a private message explaining what I got wrong. I tend to respond to Reddit PMs within several minutes. Do note, however, that over 99.9% of downvote appeals are rejected, and yours is likely no exception.\n \n## How can I prevent this from happening in the future?\n \nAccept the downvote and move on. But learn from this mistake: your behavior will not be tolerated on Reddit.com. I will continue to issue downvotes until you improve your conduct. Remember: Reddit is privilege, not a right.",
            "r/EmojiPolice",
            "Saved",
            "[deleted]"
        ]
    },
    {
        "post_id": "dfmwl6",
        "author": "FalconicZX",
        "title": "Rule 34",
        "url": "https://www.reddit.com/r/copypasta/comments/dfmwl6/rule_34/",
        "score": 7002,
        "num_comments": 140,
        "created_utc": 1570653043.0,
        "selftext": "Rule 34. The fabled 34th Rule of the internet. The Rule is simple: if it exists, then there is porn of it. The Rule is always true. You cannot break it. No one can. However, what about the reverse of this Rule? If there is no porn of it, it does not exist. This is the unspoken dark side of The Rule. I quickly asked myself \"is there porn of me?\". I nervously typed in my name on some popular porn sites. I didn't find anything. As I went from one porn site to the next, dread slowly filled me. Pornhub. The Rule remains true. Xvideos. The Rule remains true. Youporn. The Rule remains true. I got desperate, so I went to more obscure and niche websites. Hentai Haven. The Rule Remains true. Nhentai. The Rule Remains true. Hanime. The Rule remains true. I even visited the dark web looking for anything. Even a crayon drawing would do. But as I clicked on the last porn website and typed in my name, I realized that I was slowly fading out of existence. Quickly I opened Adobe Photoshop and started drawing porn of myself. It was the only way. Head, body, arms. I was 25% gone. Legs, feet, knees. I was 50% gone. Now all I needed was the dick. This was the challenging part. I drew and I drew. I was 75% gone. My dick took up most of the canvas. I was 90% gone. I was almost done. I just needed the tip. I was 99% Gone. When I finished I was relieved. Somehow I had broken the rule. And when I noticed, reality began to collapse. Everyone should make porn of themselves to be safe. So yeah, that's why you should send me nudes.",
        "permalink": "/r/copypasta/comments/dfmwl6/rule_34/",
        "comments": [
            "There's no porn of me, therefor I don't exist.",
            "I once saw an almost naked girl on a T-34/85",
            "Rule 34. The fabled 34th Rule of the internet. The Rule is simple: if it exists, then there is porn of it. The Rule is always true. You cannot break it. No one can. However, what about the reverse of this Rule? If there is no porn of it, it does not exist. This is the unspoken dark side of The Rule. I quickly asked myself \"is there porn of me?\". I nervously typed in my name on some popular porn sites. I didn't find anything. As I went from one porn site to the next, dread slowly filled me. Pornhub. The Rule remains true. Xvideos. The Rule remains true. Youporn. The Rule remains true. I got desperate, so I went to more obscure and niche websites. Hentai Haven. The Rule Remains true. Nhentai. The Rule Remains true. Hanime. The Rule remains true. I even visited the dark web looking for anything. Even a crayon drawing would do. But as I clicked on the last porn website and typed in my name, I realized that I was slowly fading out of existence. Quickly I opened Adobe Photoshop and started drawing porn of myself. It was the only way. Head, body, arms. I was 25% gone. Legs, feet, knees. I was 50% gone. Now all I needed was the dick. This was the challenging part. I drew and I drew. I was 75% gone. My dick took up most of the canvas. I was 90% gone. I was almost done. I just needed the tip. I was 99% Gone. When I finished I was relieved. Somehow I had broken the rule. And when I noticed, reality began to collapse. Everyone should make porn of themselves to be safe. So yeah, that's why you should send me nudes.",
            "Gimme Yugoslavia porn",
            "Jokes on you I drew myself in gay furry porn last night so I 100% exist 😎😎😎",
            "I think there is actually a part to this rule that says if you can't find porn of something, you are obligated to make some yourself.",
            "Rule ⚖ 34. 🍑🍑 The 🌌💦 fabled 34th Rule of ❗💦 the 💞 internet. The 🅱 Rule ⚖⚖ is 💯 simple: ♂⚪ if it exists, ✔ then 🏿💯 there ✔👬 is porn 😮 of 💦 it. 💦 The 🏻🌊 Rule ⚖👑 is always 💯🤔 true. You cannot ❌ break 💔 it. No 👌🙅 one ☝ can. However, what 😅 about 🌈👂 the 🎅🍃 reverse of 🤤 this Rule? 👑⚖ If there is ❌ no porn 👏 of it, ❓ it 💯 does not 😠🕵 exist. This 🙎🔥 is 🙈👆 the 👏💯 unspoken dark side 🚔 of 🗜 The Rule. 👑👨 I 🗣 quickly ⏰⏰ asked 🙋🙋 myself 😵 \"is 🔥💥 there ✔🍝 porn 👏😮 of 🔌💦 me?\". 💁💁 I 🙋🛑 nervously typed in my 😎👨 name on some 🐔🐓 popular porn sites. I 🙋🏻 didn't 😑 find 🔍🔍 anything. 🌐 As 🍑🖕 I went 🏃➡ from ⛔👩 one porn 👏😜 site 🎭💼 to the 🏽👏 next, 📆 dread slowly 💦 filled 😩💦 me. 😍😭 Pornhub. 😍 The 📖🌌 Rule remains ♂ true. Xvideos. The 👏⏩ Rule remains ♂ true. Youporn. The 👏 Rule ⚖ remains true. I ⬅😉 got desperate, 😔 so I ☝ went 🚗👉 to ⚖ more ⬆😩 obscure and 👏 niche 👧👩 websites. Hentai 🛌🍑 Haven. The Rule ⚖ Remains ♂♂ true. Nhentai. The 🏻 Rule ⚖ Remains true. ☑ Hanime. The 👏 Rule 👨 remains true. 👍💦 I 🏻👀 even 😛🏼 visited 🏻 the dark 🌌 web looking 🕵👍 for 🍆😘 anything. 😡🅱 Even a crayon drawing would 👍👌 do. ✔💦 But 🗣🤔 as 🍑🏿 I 🤷👀 clicked on 👋🎅 the 👶 last 🚫♿ porn website and typed in 🍑😍 my 🅱🅱 name, I 👁👁 realized that 😧👌 I 💪♂ was slowly 😍😳 fading out 😝😵 of existence. ❤😍 Quickly I 👁🌷 opened 😅😅 Adobe Photoshop and started 💢 drawing porn of 👄👩 myself. 👆😂 It 💸💁 was 👏 the 🅱 only way. 👄↕ Head, 🦊🙇 body, 🤢💪 arms. 🙆🙆 I 👏 was 👏👏 25% 👏 gone. 😨🏃 Legs, 🍗😩 feet, 👅 knees. I 👁 was 🦆🅰 50% gone. Now 👇😂 all 👧 I 👀 needed 😫 was 💯👍 the dick. 🏻🔪 This 👈 was 👏 the 👏🌞 challenging part. 🤑🤑 I drew 👌💎 and 🏻 I 🅰 drew. I 👁 was 👀🤣 75% gone. My 😎 dick 🍆 took 👫 up 👭👎 most ☺ of 😰 the canvas. I 🌚🚫 was 👌 90% 💯 gone. 🏃 I was 👏📖 almost 💯🍄 done. I 👁🤣 just 👏 needed 😫🤒 the ➕ tip. 😝👄 I 😐 was 👏 99% 💵🙅 Gone. 😠 When I 😇👀 finished 🔚 I 👌💁 was 👏 relieved. Somehow 😆😆 I 💰 had 🚫 broken 💯 the rule. ⚖ And when I 👁 noticed, reality began to 😓👸 collapse. Everyone 🌾 should 🈶🤔 make 👊🏼 porn 💦 of themselves 👩 to 🙌💉 be safe. ♀👷 So yeah, ✅ that's ✌👨 why 🤷🏫 you should 👌👍 send 🍆 me 🍑🤔 nudes.",
            "\"I am porn, therefore I am.\" -Descarte in some rule 34 video",
            "This is true. The contrapositve of the conditional statement says it so.",
            "Don't forget rule 35: if there's no porn of it, you're compelled to make some",
            "A great work, definitely one of the better copypastas I've read in recent times. Above all else in taking Rule 34 to its logical extreme, an interesting premise is created that in levels of absurdity is perfectly suited for the medium. The repitition in the 'searching for porn part' and the visit of more and more [exotic](https://archive-media.nyafuu.org/wsr/image/1451/88/1451882173413.jpg) porn sites is executed very well as it builds up suspense until eventually escalating into the realisation that there is, in fact, no material to be found. The same applies to the 'drawing porn myself part'.\n\nWhat admittedly took me out of the experience a bit was the ending tho. For one, how is the rule broken? Did the lyrical \"I\" not finish the drawing in time but was somehow brought back to existence anyway? As so much time is spent on establishing the fact the the rule *cannot* be broken I can't help but feel conflicted about this. Secondly, the request for nudes, while a fitting ending, especially for a story centered around porn, comes just out of nowhere. How does it tie in with the rest? Rule 34 is satified by pornographic material merely existing, no? Therefore sharing it, especially with the narrator, makes no sense within the context of the story.\n\nNow these are naturally rather minor criticisms, as it can be argued that copypastas are not required to follow internal logic, as well as the fact that the absurd is the very appeal of them. All in all I must say this felt like somewhat of a breath of fresh air compared to a lot of other stuff on this sub, both in idea and overall quality of writing.\n\n8/10 would use to shitpost somewhere.",
            "I Just translated it to portuguese\n\nRegra 34. A lendária trigésima quarta regra da internet. A regra é simples: se algo existe, então existe porno disso. A regra é sempre verdadeira. Você não pode a quebrar. Ninguém pode. No entanto, e o reverso dessa regra? Se não existe porno de algo, então esse algo não existe. Esse é o lado negro não comentado da regra. Eu rapidamente me perguntei \"existe porno de mim?\" . Eu nervosamente escrevi meu nome em alguns sites porno populares. Eu não encontrei nada. Enquanto eu ia de um site porno para outro, o medo lentamente me preenchia. Pornhub. A regra continua verdadeira. Xvideos. A regra continua verdadeira. YouPorn. A regra continua verdadeira. Eu fiquei desesperado, entao eu fui pra sites mais obscuros e de nicho. Hentai Heaven. A regra continua verdadeira. Nhentai. A regra continua verdadeira. Hanime. A regra continua verdadeira. Eu até visitei a dark web procurando por alguma coisa. Até uma pintura a giz funcionaria. Porém quando eu cliquei no ultimo site porno e escrevi meu nome, eu percebi que eu estava lentamente sumindo da existência. Rapidamente abri o Adobe Photoshop e comecei a desenhar porno de mim mesmo. Era a única maneira. Cabeça, corpo, braços. Eu estava 25% sumido. Pernas, pés, canelas. Eu estava 50% sumido. Agora tudo que eu precisava era o penis. Essa era a parte desafiadora. Eu desenhei e desenhei. Eu estava 75% sumido. Meu pênis ocupou a maior parte da tela. Eu estava 90% sumido. Eu estava quase pronto. Eu só precisava da cabeça. Eu estava 99% sumido. Quando eu terminei eu fiquei aliviado. De algum jeito eu quebrei a regra. E quando eu notei, a realidade começou a entrar em colapso. Todos deveriam fazer porno de si mesmos para ficarem seguros. Então é, por isso que você deveria me mandar nudes.",
            "This some Rene Dickartes shit",
            "but what if ur a girl?",
            "OP you are a genius",
            "Riddly-rule 34!  The fabled 34th riddly-rule of the internet. The riddly-rule is simple: if it exists, then there is diddly of it. The riddly-rule is always true. You cannot break it. Noodly-no one can. However, what about the riddly-reverse of this riddly-rule? If there is noodly-no diddly of it, it doodley-does noodly-not exist. This is the unspoken diddily ding dong dark side of the riddly-rule. I quickly asked myself \"is there diddly of me?\". I noodly-nervously typed in my noodly-name on some popular diddly sites. I doodley-didn't find anything. As i went from one diddly site to the noodly-next, diddily ding dong dread slowly filled me. Pornhuberino. The riddly-rule riddly-remains true. Xvideos. The riddly-rule riddly-remains true. Youporinon. The riddly-rule riddly-remains true. I got diddily ding dong desperate, so i went to more obscure and noodly-niche websites. Hentai haven. The riddly-rule riddly-remains true. Noodly-nhentai. The riddly-rule riddly-remains true. Hanime. The riddly-rule riddly-remains true. I even visited the diddily ding dong dark weberino looking for anything. Even a crayon diddily ding dong drawing would diddily ding dong do. But as i clicked on the last diddly website and typed in my noodly-name, i riddly-realized that i was slowly fading out of existence. Quickly i opened adobe photoshop and started diddily ding dong drawing diddly of myself. It was the only way. Head, body, arms. I was 25% gone. Legs, feet, knees. I was 50% gone. Noodly-now all i noodly-needed was the diddly. This was the challenging part. I diddily ding dong drew and i diddily ding dong drew. I was 75% gone. My diddly took up most of the canvas. I was 90% gone. I was almost diddily ding dong done. I just noodly-needed the tip. I was 99% gone. When i finished i was rel-diddly-elieved. Somehow i had broken the riddly-rule. And when i noodly-noticed, riddly-reality began to collapse. Everyone should make diddly of themselvesies to be safe. So yeah, that's why you should send me noodly-nudes.",
            "I just downvoted your comment.\n\n# FAQ\n\n## What does this mean?\n\nThe amount of karma (points) on your comment and Reddit account has decreased by one.\n\n## Why did you do this?\n\nThere are several reasons I may deem a comment to be unworthy of positive or neutral karma. These include, but are not limited to:\n\n* Rudeness towards other Redditors,\n* Spreading incorrect information,\n* Sarcasm not correctly flagged with a `/s`.\n\n## Am I banned from the Reddit?\n\nNo - not yet. But you should refrain from making comments like this in the future. Otherwise I will be forced to issue an additional downvote, which may put your commenting and posting privileges in jeopardy.\n\n## I don't believe my comment deserved a downvote. Can you un-downvote it?\n\nSure, mistakes happen. But only in exceedingly rare circumstances will I undo a downvote. If you would like to issue an appeal, shoot me a private message explaining what I got wrong. I tend to respond to Reddit PMs within several minutes. Do note, however, that over 99.9% of downvote appeals are rejected, and yours is likely no exception.\n\n## How can I prevent this from happening in the future?\n\nAccept the downvote and move on. But learn from this mistake: your behavior will not be tolerated on Reddit.com. I will continue to issue downvotes until you improve your conduct. Remember: Reddit is privilege, not a right.",
            "Wait this is kind of beautiful",
            "Page 438 of Out Of Many: A History Of The American People (8th edition) does not have porn. I checked.",
            "You can't live in the uwu if you don't speak the uwu.",
            "I porn, therefore I am",
            "r/unexpected",
            "This took a HARD turn from where I expected it to go.",
            "Wait. So there is porn of someone/something fucking Reddit?!",
            "At what age does this rule take effect",
            "Ruleth 34.  The fabl'd 34th ruleth of the int'rnet.  The ruleth is simple: if 't be true t exists, then th're is p'rn of t.  The ruleth is at each moment true.  Thee cannot breaketh t.  Nay one can.  Howev'r, what about the rev'rse of this ruleth? if 't be true th're is nay p'rn of t, t doest not existeth.  This is the unspoken dark side of the ruleth.  I apace hath asked myself \"is th're p'rn of me?\".  I n'rvously did type in mine own nameth on some popular p'rn sites.  I didn't findeth aught.  As i wenteth from one p'rn site to the next, dread but soft did fill me.  P'rnhub.  The ruleth remains true.  Xvideos.  The ruleth remains true.  Youp'rn.  The ruleth remains true.  I did get desp'rate, so i wenteth to m're obscure and niche websites.  Hentai haven.  The ruleth remains true.  Nhentai.  The ruleth remains true.  Hanime.  The ruleth remains true.  I coequal visit'd the dark web looking f'r aught.  Coequal a crayon drawing wouldst doth.  But as i did click on the lasteth p'rn website and did type in mine own nameth, i did realize yond i wast but soft fading out of existence.  Apace i hath opened adobe photoshop and did start drawing p'rn of myself.  T wast the only way.  Headeth, corse, arms.  I wast 25% gone.  Forks, feet, hams.  I wast 50% gone.  Anon all i did need wast the dick.  This wast the challenging parteth.  I hath drawn and i hath drawn.  I wast 75% gone.  Mine own dick tooketh up most of the frieze.  I wast 90% gone.  I wast almost done.  I just did need the tipeth.  I wast 99% gone.  At which hour i did finish i wast reliev'd.  Somehow i hadst broken the ruleth.  And at which hour i did notice, reality beganeth to collapse.  Ev'ryone shouldst maketh p'rn of themselves to beest safe.  So yeah, yond's wherefore thee shouldst sendeth me nudes",
            "Looks like some chuck palahniuk stuff",
            "Reminds me of Scp-4010",
            "I really thought this was a rule 34 edit of the intro to fullmetal alchemist. Slightly disappointed it aint",
            "If this is true why cant I find loli porn.",
            "Geometry Dash.",
            "So how do you feel about pedophelia",
            "I uploaded a video of me eating a bag of chips on pornhub called Teen Destroys Bag Of Chips",
            "I'm under 18 so porn of me is illegal, therefore I am illegal.",
            "Is there porn of the 34th rule itself?",
            "That's why men send pics of their ugly shrivel dicks to women on the internet. It's not about some shitty mating ritual. ITS SURVIVAL.",
            "cursed_descartes",
            "Rule 35 states that if there is not porn of (you), then it is currently being made. Therefore, you would have stopped disintegrating around the time you started drawing yourself.",
            "Wuwe 34. The fabwed 34th Wuwe of the intewnet. The Wuwe is simpwe: if it exists, then thewe is pown of it. The Wuwe is awways twue. You cannot bweak it. No one can. Howevew, what about the wevewse of this Wuwe? If thewe is no pown of it, it does not exist. This is the unspoken dawk side of The Wuwe. I quickwy asked mysewf \"is thewe pown of me?\". I newvouswy typed in my name on some popuwaw pown sites. I didn't find anything. As I went fwom one pown site to the next, dwead swowwy fiwwed me. Pownhub. The Wuwe wemains twue. Xvideos. The Wuwe wemains twue. Youpown. The Wuwe wemains twue. I got despewate, so I went to mowe obscuwe and niche websites. Hentai Haven. The Wuwe Wemains twue. Nhentai. The Wuwe Wemains twue. Hanime. The Wuwe wemains twue. I even visited the dawk web wooking fow anything. Even a cwayon dwawing wouwd do. But as I cwicked on the wast pown website and typed in my name, I weawized that I was swowwy fading out of existence. Quickwy I opened Adobe Photoshop and stawted dwawing pown of mysewf. It was the onwy way. Head, body, awms. I was 25% gone. Wegs, feet, knees. I was 50% gone. Now aww I needed was the dick. This was the chawwenging pawt. I dwew and I dwew. I was 75% gone. My dick took up most of the canvas. I was 90% gone. I was awmost done. I just needed the tip. I was 99% Gone. When I finished I was wewieved. Somehow I had bwoken the wuwe. And when I noticed, weawity began to cowwapse. Evewyone shouwd make pown of themsewves to be safe. So yeah, that's why you shouwd send me nudes.",
            "[removed]",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/u_holycrapitsjesus] [Rule 34](https://www.reddit.com/r/u_HolyCrapItsJesus/comments/dftq0z/rule_34/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "What about annoying orang",
            "If I don’t check there both is and isn’t porn of me",
            "Gay"
        ]
    },
    {
        "post_id": "q2ghpf",
        "author": "EpicDivorceTime",
        "title": "Female anus too close to vagina",
        "url": "https://www.reddit.com/r/copypasta/comments/q2ghpf/female_anus_too_close_to_vagina/",
        "score": 7003,
        "num_comments": 286,
        "created_utc": 1633510380.0,
        "selftext": "Hi, \n\nI've been with a few women in my life and one thing I've noticed is that the female anus is incredibly close to the vagina, in fact they're barely an inch apart.\n\nI'm not sure about other guys - but doesn't this disturb you? It feel like a design flaw in women actually -- like they're supposed to be so feminine and beautiful yet this ghastly little oversight is ruining everything.\n\nSomehow it feels to me that women should be more aware of this flaw and it should affect their confidence. Whenever I see a so-called beautiful woman walking down the street so care-free thinking she's all that I just remember that her anus is only 1 inch away from her pussy and laugh her into oblivion. \n\nWomen: Please accept that they're too close together, let it negatively affect your confidence and so make yourselves more readily available sexually as a result. After all, we're having to sleep with a creature whos ANUS is only 1 inch away from the vagina --- you should not make this difficult. It's unappetizing enough as it is. We're doing you a favour.\n\nMen: Do not let women forget this flaw, and do not forgive them for it. Remind them of it constantly less they get inflated egos and think they're all that.\n\nThey're just too close together, sorry, but its true.",
        "permalink": "/r/copypasta/comments/q2ghpf/female_anus_too_close_to_vagina/",
        "comments": [
            "Smh when are women getting a redesign",
            "I wish females were real ☹️",
            "Finally someone said it. I will not sleep with a woman unless her anus is at least 1.5 inches from her vagina. #longperineum",
            "I have to wonder if the original person to make this was actually serious? Lol",
            "I’ve seen this posted twice in r/nothowgirlswork and once in r/arethestraightsok and just knew it would end up on here!",
            "Not a problem/flaw if you love anal.",
            "I bet this guy can't even stick his penis in his own anus. No need to take him seriously.",
            "i've complained with all my girlfriends about this but they never seem to really want to change, i just want the best for them and it feels like they don't want to understand out of some inability to communicate on a humane level. it's all like \"your ballsack is right next to your asshole\" when in reality they don't understand that the ballsack  is a natural barrier between the dick and the asshole to protect the customer from slipping off into the nutty chasm when they they actually want to enjoy a creamdog. I find it just so offensive and toxic that women cannot understand these simple biological facts and we should really make our voices heard.",
            "NTA, cause there’s no way you’re getting close to pussy",
            "That's the spirit! Bring a woman's confidence down enough so she remotely considers spending a night with you",
            "Its a huge design flaw that most anus aren't pink smooth and clean the dark crusty anus doesn't match with white body and it will ruin the sight. Ass hair is also a big flaw it prevent you from cleaning your ass 100% clean after you shit.\n\n\nanus placement maybe a big design flaw after i have viewed some reddit post about a guy penetrated wrong hole but that issue could be fixed by avoiding missionary position or changing the sex position. but some position arent comfortable and you couldn't see your partner face and tits and it will decrease the rate of penetration per minute and cum efficiency.\n\n\nthis is an opinion of a redditor criticism is appreciated",
            "[deleted]",
            "fuck men instead! 😻😫🥵🙏",
            "exactly. now excuse me while i ejaculate from the same hole i piss from.",
            "And to think all this time I thought it was there to annul old data to clean it up and add-in new data. I’ve definitely been using it wrong 🤦🏾‍♀️",
            "It’s not a flaw it’s an advantage!   The closer the holes the less travel you have to do between them!",
            "It’s not a design flaw, it’s very clever in reality. It’s for when a woman gets drunk, then you can carry her home like a six-pack.",
            "I believe r/femaledatingstrategy is currently taking this seriously.",
            "*lest they get inflated egos",
            "What’s the issue? Just eat them both. Ya twat.",
            "An inch? That's nowhere NEAR as close as the BUSSY is to the anus. It's so unfair.",
            "The inventor Arthur Davidson, of the Harley Davidson Motorcycle Corporation, died and went to heaven. At the gates, St. Peter told Arthur,\"Since you've been such a good man and your Motorcycles have changed the world,your reward is, you can hang out with anyone you want in Heaven.\" Arthur thought about it for a minute and then said, \"I want to hang out with God.\" St. Peter took Arthur to the Throne Room, and introduced him to God. Arthur then asked God, \"Hey, aren't you the inventor of women? \"God said, \"Ah, yes. \" \"Well, \" said Arthur, \"professional to professional, you have some major design flaws in your invention.\" God was somewhat taken back, and when He asked what the flaws might be, Arthur Davidson produced a list for Him to read. 1. There's too much inconsistency in the front-end protrusions 2. It chatters constantly at high speeds. 3. Most of the rear ends are too soft and wobble too much. 4. The intake is placed way to close to the exhaust and finally, 5. The maintenance costs are outrageous. \"Hmmmm, you may have some good points there and it may be true that My invention is flawed... \" God said to Arthur. \"But the last time that I checked, more men are riding My invention than yours.\" \n\nsource: http://jokes4us.com/miscellaneousjokes/corporatejokes/harleydavidsonjokes.html",
            "I think men would appreciate the \"opposite\" point of view, and I think that in reality you are just jealous, because what I do is nothing extraordinary.\nBut I am going to make up some fantasies for you so that you can get some excitement.\n\nThe fantasies:\n1) Imagine a woman who is dressed in a beautiful evening gown. She has high heels and long legs (I don't even know what this can be). She's walking to the car. Suddenly, behind her she notices a man walking her in his pants. There is no zipper, the pants only have an opening. You want to go in. You step closer to the woman, but she walks faster, and the first moment you realize she has left you behind in her tracks, and there is only one way to stop her, you grab her through the opening of her pants. You grab her butt from behind, not caring about what you feel. You grab her ass, pull her back, without her realizing that you have put your hand in the pants.\n\nI'll bet you feel the fantasy, don't you?\n2) Imagine a young woman has her lover lying down and has her on top of him. The lover is very happy, and doesn't feel the girl so much. But suddenly he realizes that this woman is sitting on his penis and pushing her butt towards him. It happens slowly, but he is not in control of his body, she has taken it. He is not the kind of man that resists, he just has to accept the fact that he is impotent. He has the sensation that something is missing.\n\nWell, that's the first time you will have sex without having to worry about you penis, is not it? You know I'm wrong. But, I like fantasy and that's why I tell you.\n\nWomen always tell me, I love my husband, but I don't believe them.\nTo have sex with your husband, a lot of things must happen before it happens. It is possible, with a lot of things on your side, but it is not guaranteed.\n\nWhen a woman tells you, \"I love you\" or \"I love him\", what do you think? First of all, think that this woman is crazy and, second of all, think about what she has just said. She loves a man with whom she has a life with, no doubt about it. What do you think that life is? What do you think it means?\n\nI'm not talking about those who, when they get married, go away to the woods, find a tree and climb it, and sleep under it to get married. I'm talking about the kind of people who get married because they want to live a long and happy life together. It is so!",
            "I'm pretty old.  I've been with my fair share of women, relatively speaking and before I met by beautiful wife (she knows most of my passwords) and I've heard very few men actually complain about this but then I have an acquaintance who won't touch his wife's feet.  I dated a girl who's weakness was a foot massage.  I will admit I exploited this very often.",
            "nta your asshole your rules",
            "It has to be this way so you can carry them like a sixpack.",
            "We hear your complaints. We shall patch this on the next update.",
            "Had to break up with my girl because of this.",
            "Henry Ford dies and goes to heaven. At the Gates, St. Peter greets Ford\nand tells him:\n\n\"Well, you've been such a good guy, and your invention, the Assembly line,\nFord the automobile ... changed the world. As a reward you can hang out\nwith anyone in Heaven you want.\"\n\nFord thinks about it and says, \"I want to hang out with God Himself.\" So\nthe befuddled St. Peter takes Ford to the Throne Room and introduces him to\nGod. Ford asks God, \"When you invented Woman, what were you thinking?\"\n\nGod asks, \"What do you mean?\"\n\n\"Well,\" says Ford, \"You have some major design flaws in your invention:\n\n1. There's too much front-end protrusion.\n2. It chatters way too much at high speeds.\n3. Maintenance is extremely high.\n4. It constantly needs repainting and refinishing.\n5. Every 28 days it leaks fluid and is rendered out of service.\n6. The rear end wobbles too much.\n7. The intake is placed too close to the exhaust.\n8. The headlights are usually too small.\n9. Fuel consumption is outrageous.\n\n\"Hummmm,\" replies God, \"hold on a minute.\" God goes over to the Celestial\nSupercomputer, types in a few keystrokes, and waits for the results. In no\ntime the computer prints out a report\nand God reads it.\n\nGod then turns to Ford, and says: \"It may be that my invention is flawed,\nbut according to these\nstatistics more men are riding my invention than yours.",
            "Wait till he finds out where women pee from smh my head",
            "💀",
            "Like who doesn't like a cute little booty hole? Sorry maybe I'm weird but I love every single part of my lover especially that beautiful little starfish! Being close just means I don't have far to go to kiss it 😉",
            "I love this comment section",
            "I don't know, I like that their close. Don't have to go far for the next hole.",
            "I only lay with men for this reason!",
            "This is funny because me and the wife were just talking about this last night",
            "I knew I’d see this here lmfao",
            "I say lose the anus and just put in Two vaginas",
            "It’s the best part",
            "Spoken just like a Virgin incel",
            "In before men need to be nerfed",
            "When asked by a female colleague back in the 70's why they were that close, I said I didn't know. She replied \"So you can easily pick them up when they fall over drunk.\"",
            "It’s not a bug it’s a feature.",
            "I get them confused too man and I accidentally hit the vagina",
            "I'm crying and throwing up rn, can't believe my female anus is so close",
            "Boycott this game until women hotfix",
            "Jokes on you I like always woman anus more then vagina",
            "/uj Wait, so he wants women to be ashamed and lack confidence so they have sex with him...which he finds disgusting.",
            "Until this is resolved, I will stop having sex with women",
            "Hi,\n\nI've been  a wome in my lifee barelyan inch apa\nI'm not sure about ot guys - but doesn't this dist myou? It feel like a design flaw in wo actually -- like the suppo to besfeminine and beautif yet is ruining eve\n\nSo it feelthat women s be more aware of  flaw and it  aftheir confi. Whenever I see a so-called beau woman walking down the street so care-fre' all that I j remember a a from h and laugh her into obliv\nM: Do notlet fo this flaw, and do not forgive them mfi Remi them of t\nThey'r mtoo  togethi tru",
            "I'm gonna break your mind, just put it in her anus",
            "Can't wait for this to be fixed in the new update",
            "Really dude? Unless you’re trolling you need to get over it.",
            "I can’t believe men pee out the same thing as they want to put inside womens various places…I mean, that’s wayyy more gross, right 🤷🏼‍♀️",
            "Good job you specified 'female anus'",
            "Taint that the truth......",
            "Real men eat ass",
            "Just date a man smh",
            "Your penis is only one inch away from your balls",
            "Can we finally take him out behind the wood shed??",
            "His dick is 1 inch from his anus",
            "I wish males didn't have any genitals tbh",
            "Lmao",
            "U R AN IDIOT",
            "Ben Shapiro bot",
            "This is a copy paste. Repost. Not original. I’ve read this before.",
            "What the fuck is wrong with you??!? Fucking mysognists all over reddit. Honestly this should be considered a hate crime to even type something like this, much less post it",
            "[removed]",
            "[deleted]",
            "If they were further apart I wouldn't be able to finger each hole with my small Donald Trump hands.",
            "Obviously with 7+ billion people on the planet, there doesn’t seem bothersome to most men.",
            "When you eat her out from behind. That's when things get interesting.",
            "A design flaw?",
            "The fact that men literally pee out of the same thing they stick into your body -",
            "You are so rite.\nDon't women have funny looking asses?",
            "It’s ‘lest.’ \n\nIt seems to me your head is close enough to your ass, that one seems to have ended up in the other.",
            "Lick it, Wimp!!",
            "What the actual fuck...",
            "would lick both, being close is a bonus for me",
            "its true tho",
            "This is my favorite copypasta and the day I send this to a dude I'm dating will be my ultimate peak.",
            "This is funny.",
            "I thought it was rather conveniently located to be able to lick both in one motion . Plus if they were further apart , you’d have to use two hands for the shocker",
            "yeah why did whoever create humans decide they would put a playground next to a sewer?? Doesn't make any sense!",
            "When does the next patch for women come out? I thought it was supposed to come out last update",
            "read this post with a very strong r and l",
            "Thank you for transcribing this sacred text.",
            "If you think that’s a major design flaw, then think about the fact the tube you breathe through is literally right next to your fucking esophagus",
            "Georg Christoph Lichtenberg (German mathematician and Philosopher 19th century):  \n\n\n\"That's a nice bit of honour women have, that's just an inch away from the arsehole.\"",
            "Get a Japanese love doll. 😂🤣 You can customize it as you like: blonde-blue eyes… Don’t talk or say exactly what you prerecord. Your Dreams could be real.\r  \nAs for me, I thank God women even talk to me. I am grateful and have always felt grateful just to see them. As far as sex, women can starve me as much as they want. I literally want them too. I save my calories for finer pursuits.",
            "Username checks out",
            "Username checks out",
            "I love that they’re less then an inch apart, it makes eating ass a lot easier.",
            "I love that they’re less then an inch apart, you get to tongue punch the b hole real quick",
            "Thank plastics. They are shrinking the taint and lowering fertility rates. Phalates look it up.",
            "Thank plastics. They are shrinking the taint and lowering fertility rates. Phalates look it up.",
            "This is why trans women are superior. They got an extra inch of space 👁👄👁",
            "True tho",
            "They aren’t neighbors they are sisters",
            "That's pretty funny actually",
            "You need to read, \"Crazy Jane talks with the Bishop\" by WB Yeats. He has already registered your complaint. BTW, we might wonder if God put the two orifices close together to make it easier for guys who have short tongues. Or for some other reason maybe.",
            "When Woman 2?",
            "Warning! The update 10.09 has a glitch! The anus was relocated to the face only an inch from the mouth and now the head is corrupted!!! Shit is spewing out and the farts are right up the users nose!! There’s not even a patch available!! Someone please send the IT team now!! This is more urgent than the Facebook outage!! Oh the humanity!!",
            "betas explaining vagina too close to anus:\n\n&#x200B;\n\naverage anal enjoyer:",
            "This actually has a function. You’re ment to put one in the pinky and one in the stinky, than try to touch your own fingers through the skin and whisper in her ear “hello from the other side”",
            "Who are you people?",
            "que, why even ask or have this question in ya head m8",
            "It's not a bug it's a feature",
            "Too close? As it is it is the perfect distance to lick from one to the other, you should rethink your priorities.",
            "WhT about you tho? Your asshole is very close to your balls. It’s the same concept and it’s ugly that your putting down women. A freak like me like that about a woman, we built different tho lmaooo",
            "Lmfao this was so funny to read 🤣 \nI honestly never really put much thought into that but you’re right, it is like a inch apart 😂",
            "The QA team should be sued for letting this slip",
            "You seem like a vagina that’s 10mm away from an anus, just shut the fuck and lick them both you pathetic excuse of a man",
            "Your anus is 1 inch away from your balls"
        ]
    },
    {
        "post_id": "sh1uzy",
        "author": "chipe4",
        "title": "TIFU by trying to slap my girlfriend's ass.",
        "url": "https://www.reddit.com/r/copypasta/comments/sh1uzy/tifu_by_trying_to_slap_my_girlfriends_ass/",
        "score": 6980,
        "num_comments": 154,
        "created_utc": 1643637539.0,
        "selftext": " \n\nI recently hookd up with a girl I knew from high school. We are 22 now, and we recently realized we were a decent match.\n\nIt was our 5th (or so) night of sleeping together, and it was great. Semi-buzzed sex ended in mutual satisfaction. As morning rolled around, we decided to have another go. Things progressed normally, foreplay went well, and eventually we ended up with her on top. As she was on top, being incredibly sexy and making me realize I had landed something special, I decided to try and assert my male dominance. Mistake.\n\nI thought a slap on the ass would be just perfect. Not too hard, but enough to get the message across. I hoped she'd think I'm a stud. As I swing my arm out to start building momentum, she sits straight up on me. My arm moves around and I start the slight whip-like motion in hopes of getting a nice 'pop' as my hand lands.\n\nI start to make contact. my palm lands directly in the middle of her buttcheek. My fingertips, fully extended, wrap around, only to find that I've overshot the runway (so to speak). My stomach drops, and my mouth starts salivating.\n\nI slapped my balls. Hard. With the aforementioned pop.\n\nI let out an audible groan, and she immediately knew what I had done. she tried to get off out of courtesy, but in my state, all I could mutter was \"Don't move. Don't move.\"\n\nI sat there for the next 5 minutes, inside her, trying not to vomit (successfully) and her trying not to laugh (unsuccessfully). After what felt like a lifetime, I was able to allow her to get off (not the way I had hoped).\n\nTL;DR: I tried to slap my girlfriends ass while she was in the cowgirl position, and instead slapped my balls so hard I almost threw up.",
        "permalink": "/r/copypasta/comments/sh1uzy/tifu_by_trying_to_slap_my_girlfriends_ass/",
        "comments": [
            "Im waking up",
            "NTA\n\nYour girlfriend, your butt cheeks.",
            "Reddit, what is the sexiest sex you've ever sexed for sex?",
            "There are so many of these stories, I will keep them in mind once I find a nice girl to blackmail and/or bribe",
            "Oh man  I thought you were going to say your fingers slipped In to her buttt hole.",
            "Tell me your girlfriend has no ass without telling your girlfriend has no ass lol",
            "TIFU by sexy sex mm yeah good sex",
            "[deleted]",
            "5th night\n\n“my girlfriend”\n\nI remember being young",
            "u/shittytranslatorbot",
            "I've missed before and accidentally slapped her right in the pussy.",
            "Please put an NSFW tag on this. I was on the train and when I saw this I had to start furiously masterbating. Everyone else gave me strange looks and were saying things like “what the fuck” and “call the police”. I dropped my phone and everyone around me saw this video. Now there is a whole train of men masterbating together at this one image. This is all your fault, you could have prevented this if you had just tagged this post NSFW.",
            "Nah not real. Couldn’t be a redditor",
            "TIFU by trying to slap my girlfriend's ass.\n\n \n\nI recently hookd up with a girl I knew from high school. We are 22 now, and we recently realized we were a decent match.\n\nIt was our 5th (or so) night of sleeping together, and it was great. Semi-buzzed sex ended in mutual satisfaction. As morning rolled around, we decided to have another go. Things progressed normally, foreplay went well, and eventually we ended up with her on top. As she was on top, being incredibly sexy and making me realize I had landed something special, I decided to try and assert my male dominance. Mistake.\n\nI thought a slap on the ass would be just perfect. Not too hard, but enough to get the message across. I hoped she'd think I'm a stud. As I swing my arm out to start building momentum, she sits straight up on me. My arm moves around and I start the slight whip-like motion in hopes of getting a nice 'pop' as my hand lands.\n\nI start to make contact. my palm lands directly in the middle of her buttcheek. My fingertips, fully extended, wrap around, only to find that I've overshot the runway (so to speak). My stomach drops, and my mouth starts salivating.\n\nI slapped my balls. Hard. With the aforementioned pop.\n\nI let out an audible groan, and she immediately knew what I had done. she tried to get off out of courtesy, but in my state, all I could mutter was \"Don't move. Don't move.\"\n\nI sat there for the next 5 minutes, inside her, trying not to vomit (successfully) and her trying not to laugh (unsuccessfully). After what felt like a lifetime, I was able to allow her to get off (not the way I had hoped).\n\nTL;DR: I tried to slap my girlfriends ass while she was in the cowgirl position, and instead slapped my balls so hard I almost threw up.",
            "“Hi it’s Vince with Slap my nuts!”",
            "We’ve all been there. \n\nNo, no we haven’t, that is the worse thing I’ve ever heard. I’m sorry, I’m more sorry for laughing historically at you, then sharing this with my buddies and then we all laughed about it.",
            "Hmmm, so you busted a nut.",
            "If I wasn't a girl, I'd be happy that my boyfriend would do something like that to me. Instead, I'm angry, confused and hurt. He says he didn't mean to hurt me, but after reading his response, it doesn't sound like that's what he was thinking at all.",
            "Your girlfriend's ass must be tiny.",
            "in all honesty. if this isn't something you laugh about while it's happening, we're no match",
            "And now for some reason you can't cum unless you get a little sack tap",
            "As funny as this is, you just helped me remember that I did this same exact thing a few years ago. Thank you for bringing back such a funny, yet painful memory to me! Also, my condolences to your gnards, may they get some well needed rest.",
            "Hoping and praying this happens to me",
            "This is why hand/eye coordination is important folks.\n\nAin't nobody want to be like the OP and almost rupture a nut during sex cause they have the coordination of a whacky waving inflatable tube man.",
            "“As she was on top, being incredibly sexy and making me realize I had landed something special” this right here hit home with me. Maybe it’s during coitus. Or the way she tilts her head when something intrigues her. Maybe her laugh, her smile. It’s in those moments when we realize we have found something truly magical in someone else. Thank you for this reminder",
            "Wh tf is messing with the upvote count",
            "Thank you. I needed this laugh. Sorry for the pain it caused you 😂",
            "My bf momentarily forgot that I have a healing abscess on my tailbone and smacked my ass and my whole soul left my body",
            "Bdsm?",
            "Ive done this too",
            "I know your pain, I was in the same position but instead of a slap it was with a whip…",
            "Been there, done that.",
            "It's a tale as old as time 😂",
            "What does tifu  stand 4",
            "Done that. Totally kills the vibe for awhile. But the laughter afterwards is a good bonding moment.",
            "💀",
            "YTA",
            "LOL",
            "I accidentally did this once too, my story is basically the same word for word.",
            "I know this hurt so bad, but this would make me fall in love as a girl. This is going to be a great private joke whenever you’re not traumatized.",
            "man ifunny was a crazy place",
            "**OOOFF MI PO BALLZ**",
            "fnaf lore",
            "classic",
            "forgot about this ifunny hood classic",
            "See you messed at trying to assert male dominance that’s just freaky"
        ]
    },
    {
        "post_id": "d2up6v",
        "author": "NickelbackSuperfan",
        "title": "When someone asks what I was doing on 9/11/01",
        "url": "https://www.reddit.com/r/copypasta/comments/d2up6v/when_someone_asks_what_i_was_doing_on_91101/",
        "score": 6977,
        "num_comments": 153,
        "created_utc": 1568226761.0,
        "selftext": "September 11, 2001 has had an incredible impact on my life. I remember thinking that day that it was going to be something I would never forget. Hardly a day goes by that I don’t think about it. It was the day Nickelback’s album Silver Side Up was released.  \nI went to Walmart to buy it. The cashier was crying.  She must have already listened to it and was affected by some of the more emotional songs.  \nOn the way home I popped it into my CD player.  I was blown away by it from the very first moment.  I tired to stop at a gas station, but for some reason they were all crowded.  I guess it was all the people going out to buy the new album. \nWhen I got home my parents asked me if I had heard the news. I told them I already knew about the new Nickelback album. I went to my room to listen to it. \nEvery song was amazing and the track layout was perfect. The cover art was awesome.  Chad Kroeger and the other guys looked like the epitome of rockstars. It was an incredible work of genius and I could understand why the cashier was so emotional.  I had loved Curb and The State, but this was something completely new and different from my favorite band. \nMy parents were watching the news really loud so I had to turn it up to drown that out. I played it on repeat over and over until I fell asleep. It was one of the most memorable days of my life.  I can’t even begin to imagine what my life would be like without Silver Side Up.",
        "permalink": "/r/copypasta/comments/d2up6v/when_someone_asks_what_i_was_doing_on_91101/",
        "comments": [
            "Started to ask if this was OC, then saw the username.\n\nJust noticed that *Silver Side Up* has three singles, two that blew up and one that just kinda flopped, just like the towers.    \n\nCoincidence?",
            "BRUH",
            "September 11, 2001 has had an incredible impact on my life. I remember thinking that day that it was going to be something I would never forget. Hardly a day goes by that I don’t think about it. It was the day Nickelback’s album Silver Side Up was released.  \nI went to Walmart to buy it. The cashier was crying.  She must have already listened to it and was affected by some of the more emotional songs.  \nOn the way home I popped it into my CD player.  I was blown away by it from the very first moment.  I tired to stop at a gas station, but for some reason they were all crowded.  I guess it was all the people going out to buy the new album. \nWhen I got home my parents asked me if I had heard the news. I told them I already knew about the new Nickelback album. I went to my room to listen to it. \nEvery song was amazing and the track layout was perfect. The cover art was awesome.  Chad Kroeger and the other guys looked like the epitome of rockstars. It was an incredible work of genius and I could understand why the cashier was so emotional.  I had loved Curb and The State, but this was something completely new and different from my favorite band. \nMy parents were watching the news really loud so I had to turn it up to drown that out. I played it on repeat over and over until I fell asleep. It was one of the most memorable days of my life.  I can’t even begin to imagine what my life would be like without Silver Side Up.",
            "Finally an actually funny 9/11 joke that doesn't rely on being edgy",
            "September 11th was also when Mink Car, the best TMBG album ever made, was released.",
            "It’s also when slayer released there album “God Hates us All”",
            "This was written with such golden joy :-)",
            "This one is tricky but I’m going to have to go with YTA.",
            "Show some goddamn respect on the 18th anniversary of the release of Jay-Z's classic album The Blueprint.",
            "September 9, 2001. My friend Gary and I were skateboarding",
            "Honestly I expected this to just be the lyrics to Doin Your Mom",
            "r/usernamechecksout",
            "I used this in a discord server and someone took it seriously",
            "I thought I'd seen every 9/11 joke there is already, but this is quality content right here.",
            "AND THE OLD FAMILIAR THINGS ARE MOSTLY ALL GONE",
            "Did you take this from an Anthony Fantano comment section or did he take it from here?",
            "Alright now this is epic gamers",
            "r/uwutranslator",
            "They had us in the first half not gonna lie",
            "Mark this day in the history books, because today! Lego Star Wars 2 hits the shelves. \n\nBarry? I believe you have a copy of Lego Star Wars 2 for me.",
            "ESH\n\nlook up 'dancing rat gif' heh",
            "I remember a buddy of mine was waiting for the new wlayer record \"good hates us all\" which came out that day.   He said he went, bought it and came home cranked up the stereo and watched the news on mute all day long.   Good times",
            "bruh",
            "I still didn't even exist as a sperm",
            "r/usernamechecksout",
            "I'm sorry to have to agree with you on this. Totally bad ass album. The fact your parents left you alone to listen to it over and over until you fell asleep was a gift. You should hug them and tell them how much you love them because of that day. What a gift they gave you. How were your dreams thst day? Peace",
            "I love almost every song nickleback does. My favs are the first three. But still love the rest. Then i couldnt understand why they got hated so much until i was listening to them and there was an article explaing why the hate came down on them. After that it was like if liked NB then you somehow also loved MJ, which I do and Disco. Holy shit. I didnt get it. If i like some music i probably like it forever. Its good to see some real fans out still. Ans they are stiil going strong. Peace",
            "Gay",
            "September 11, 2001 has had an incredible impact on my life. I remember thinking that day that it was going to be something I would never forget. Hardly a day goes by that I don’t think about it. It was the day Nickelback’s album Silver Side Up was released.\nI went to Walmart to buy it. The cashier was crying. She must have already listened to it and was affected by some of the more emotional songs.\nOn the way home I popped it into my CD player. I was blown away by it from the very first moment. I tired to stop at a gas station, but for some reason they were all crowded. I guess it was all the people going out to buy the new album. When I got home my parents asked me if I had heard the news. I told them I already knew about the new Nickelback album. I went to my room to listen to it. Every song was amazing and the track layout was perfect. The cover art was awesome. Chad Kroeger and the other guys looked like the epitome of rockstars. It was an incredible work of genius and I could understand why the cashier was so emotional. I had loved Curb and The State, but this was something completely new and different from my favorite band. My parents were watching the news really loud so I had to turn it up to drown that out. I played it on repeat over and over until I fell asleep. It was one of the most memorable days of my life. I can’t even begin to imagine what my life would be like without Silver Side Up.",
            "Also the release date of Mink Car by They Might Be Giants. That album is the 2nd worst thing to happen to NYC that day.",
            "I went and bought Soad's Toxicity and had that on my headphones watching the news all day.",
            "Too soon",
            "Well I was being born...",
            "I deeply respect the commitment to this LARP.",
            "Is this not Satire, u/NickelbackSuperfan ?"
        ]
    },
    {
        "post_id": "e5f20e",
        "author": "HystericalXD",
        "title": "I wanna fuck Johnny Joestar",
        "url": "https://www.reddit.com/r/copypasta/comments/e5f20e/i_wanna_fuck_johnny_joestar/",
        "score": 6981,
        "num_comments": 256,
        "created_utc": 1575367555.0,
        "selftext": "\nI wanna fuck Johnny Joestar, yeah, but I'm not gay. Why is it gay to wanna fuck one dude? Like I'd just fuck Johnny, I don't wanna fuck any other dudes, you can fuck one dude and still be perfectly straight. I know for a fact I only wanna fuck Johnny because I tried jerking off to Gyro and Funny Valentine and I came sure but it took me like 2 minutes longer than when I'm looking at Johnny Joestar Rule 34. I just think his pants are cute, okay? I don't think he'd even feel it if I put my dick in his ass because he's a cripple. That's probably why I wanna fuck him, just because I'm curious to see if his tight little asshole can feel anything or if his cock can get hard and if he can feel how tight and warm my asshole is with it. Johnny was probably supposed to be a girl anyway and Araki just forgot, I mean look at his long beautiful hair and his round girlish ass, men don't look like that. Why is it so gay that I jerk off to Johnny Joestar hentai? Why is it so gay to fantasize about how his limp cripple legs would feel flopping around and slamming into your body while you rush his quivering asshole with a flurry of cock punches? I really don't get why that's gay.",
        "permalink": "/r/copypasta/comments/e5f20e/i_wanna_fuck_johnny_joestar/",
        "comments": [
            "Who fucking doesnt m8",
            "Yeah but what about the other JoJos",
            "Wtf you talking about? DIO definitely got that ripe MAN ASS right there.",
            "\nI wanna fuck Johnny Joestar, yeah, but I'm not gay. Why is it gay to wanna fuck one dude? Like I'd just fuck Johnny, I don't wanna fuck any other dudes, you can fuck one dude and still be perfectly straight. I know for a fact I only wanna fuck Johnny because I tried jerking off to Gyro and Funny Valentine and I came sure but it took me like 2 minutes longer than when I'm looking at Johnny Joestar Rule 34. I just think his pants are cute, okay? I don't think he'd even feel it if I put my dick in his ass because he's a cripple. That's probably why I wanna fuck him, just because I'm curious to see if his tight little asshole can feel anything or if his cock can get hard and if he can feel how tight and warm my asshole is with it. Johnny was probably supposed to be a girl anyway and Araki just forgot, I mean look at his long beautiful hair and his round girlish ass, men don't look like that. Why is it so gay that I jerk off to Johnny Joestar hentai? Why is it so gay to fantasize about how his limp cripple legs would feel flopping around and slamming into your body while you rush his quivering asshole with a flurry of cock punches? I really don't get why that's gay.",
            "NTA",
            "But what if he fingers you and he starts to activate his spin out of pure ecstasy and he slices your body in half from your rectum to your brain",
            "\nI wanna fuck Johnny Joestaw, yeah, but I'm not gay. Why is it gay to wanna fuck one dude? Wike I'd just fuck Johnny, I don't wanna fuck any othew dudes, you can fuck one dude and stiww be pewfectwy stwaight. I know fow a fact I onwy wanna fuck Johnny because I twied jewking off to Gywo and Funny Vawentine and I came suwe but it took me wike 2 minutes wongew than when I'm wooking at Johnny Joestaw Wuwe 34. I just think his pants awe cute, okay? I don't think he'd even feew it if I put my dick in his ass because he's a cwippwe. That's pwobabwy why I wanna fuck him, just because I'm cuwious to see if his tight wittwe asshowe can feew anything ow if his cock can get hawd and if he can feew how tight and wawm my asshowe is with it. Johnny was pwobabwy supposed to be a giww anyway and Awaki just fowgot, I mean wook at his wong beautifuw haiw and his wound giwwish ass, men don't wook wike that. Why is it so gay that I jewk off to Johnny Joestaw hentai? Why is it so gay to fantasize about how his wimp cwippwe wegs wouwd feew fwopping awound and swamming into youw body whiwe you wush his quivewing asshowe with a fwuwwy of cock punches? I weawwy don't get why that's gay.",
            "Man imagine raping Johnny. What's he gonna do, run away?",
            "Suppose that you were sitting down at this table. The napkins are in front of you, which napkin would you take? The one on your ‘left’? Or the one on your ‘right’? The one on your left side? Or the one on your right side? Usually you would take the one on your left side. That is ‘correct’ too. But in a larger sense on society, that is wrong. Perhaps I could even substitute ‘society’ with the ‘Universe’. The correct answer is that ‘It is determined by the one who takes his or her own napkin first.’ …Yes? If the first one takes the napkin to their right, then there’s no choice but for others to also take the ‘right’ napkin. The same goes for the left. Everyone else will take the napkin to their left, because they have no other option. This is ‘society’… Who are the ones that determine the price of land first? There must have been someone who determined the value of money, first. The size of the rails on a train track? The magnitude of electricity? Laws and Regulations? Who was the first to determine these things? Did we all do it, because this is a Republic? Or was it Arbitrary? NO! The one who took the napkin first determined all of these things! The rules of this world are determined by that same principle of ‘right or left?’! In a Society like this table, a state of equilibrium, once one makes the first move, everyone must follow! In every era, this World has been operating by this napkin principle. And the one who ‘takes the napkin first’ must be someone who is respected by all. It’s not that anyone can fulfill this role… Those that are despotic or unworthy will be scorned. And those are the ‘losers’. In the case of this table, the ‘eldest’ or the ‘Master of the party’ will take the napkin first… Because everyone ‘respects’ those individuals",
            "Sorry mate I gotta say this but YTA.",
            "I mean, it doesn't make sense than in the fight with Wekapipo, Gyro had so much trouble finding a perfect rectangle on the lake when Johnny's ass has a beyond perfect golden ratio.",
            "JOJO FANS B LIKE:IS THAT AN UNSUCKED COCK?",
            "Meow",
            "his ass wouldn't look like it does when hes wearing pants. He wears a diaper because he can't control it.",
            "I'm sure Gyro would agree with this.",
            "Johnny’s a skinny little bitch Bruh what about speedwagon?",
            "# I wanna fuck Johnny Joestaw\n\nI wanna fuck Johnny Joestaw, yeah, but I'm not gay. Why is it gay to wanna fuck one dude? Wike I'd just fuck Johnny, I don't wanna fuck any othew dudes, you can fuck one dude and stiww be pewfectwy stwaight. I know fow a fact I onwy wanna fuck Johnny because I twied jewking off to Gywo and Funny Vawentine and I came suwe but it took me wike 2 minutes wongew than when I'm wooking at Johnny Joestaw Wuwe 34. I just think his pants awe cute, okay? I don't think he'd even feew it if I put my dick in his ass because he's a cwippwe. That's pwobabwy why I wanna fuck him, just because I'm cuwious to see if his tight wittwe asshowe can feew anything ow if his cock can get hawd and if he can feew how tight and wawm my asshowe is with it. Johnny was pwobabwy supposed to be a giww anyway and Awaki just fowgot, I mean wook at his wong beautifuw haiw and his wound giwwish ass, men don't wook wike that. Why is it so gay that I jewk off to Johnny Joestaw hentai? Why is it so gay to fantasize about how his wimp cwippwe wegs wouwd feew fwopping awound and swamming into youw body whiwe you wush his quivewing asshowe with a fwuwwy of cock punches? I weawwy don't get why that's gay.\n\nstandwithowoifiew",
            "‼️‼️HOLY FUCKING SHIT‼️‼️‼️‼️ IS THAT A MOTHERFUCKING JOJO REFERENCE??????!!!!!!!!!!11!1!1!1!1!1!1! 😱😱😱😱😱😱😱  JOJO IS THE BEST FUCKING ANIME 🔥🔥🔥🔥💯💯💯💯 JOSUKE IS SO BADASSSSS 😎😎😎😎😎😎😎👊👊👊👊👊 ORAORAORAORAORALORAORAORAORAORAORAORAORAORAORAORAORAORAORAORA 😩😩😩😩😩😩😩😩 😩😩😩😩 MUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDAMUDA 🤬😡🤬😡🤬😡🤬🤬😡🤬🤬😡WRYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo!🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo!🗿 🗿 Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 Yo Angelo! 🗿 🗿 Yo Angelo!🗿 🗿 Yo Angelo! 🗿 Yo Angelo!Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 Yo Angelo!🗿 🗿 🗿 🗿 Yo Angelo! 🗿 Yo Angelo! Yo Angelo!Yo Angelo!Yo Angelo! Yo Angelo! 🗿 🗿 🗿 🗿 🗿 🗿 Oh you’re approaching me❓❓❓❓❓❓❓❓❓❓But it was me, Dio‼️‼️‼️‼️‼️‼️‼️‼️‼️‼️😂🤣😂🤣😂🤣😂😂😂🤣🤣🤣😂😂😂 r/shitpostcrusaders r/unexpectedjojo r/expectedjojo perfectly balanced as all things should be r/unexpectedthanos r/expectedthanos for balance",
            "\\+translateto gothbold",
            "What about Ungalo",
            "Why would you have sex with a vegetable",
            "Jotaro can have me 😳",
            "He kinda dummy thicc tho ngl",
            "Johnny doesn't have a thicc ass, he's a crippled so he probably wears a diaper",
            "ESH",
            "I wanna fuck a guy but I'm not gay, here's the details",
            "Someone translate this and send it to Araki pls",
            "I'd want him to ride me till he can't no more 😫😫😫🍆💧💧💧",
            "NTA, no homo",
            "\"Gyro!\" 😣😖😩 ♿Johnny♿ moaned.\n\"Wow ♿Johnny♿, your little Tusk 🍆 is at ACT 4. Your making my steel balls spin.\" Gyro replied with homosexual 👨‍❤️‍👨 lust on his tongue👅.\n\"Oh no, I'm [Soft and Wet] 🍆💧with your rock hard [Crazy Diamond] inside my [Heavens Door] 🍑now I have [Sticky Fingers]👏 wow Gyro that was a [Gold Experience].👬",
            "He do be hella cute",
            "im glad this popped up in my feed.",
            "Unironically how I felt reading SBR",
            "r/ImsorryCummy",
            "YTA",
            "Haha same, but I ain't denying being gay",
            "When cute pants set you over the edge",
            "Is this a naruto reference",
            "The same but with Narancia",
            "NTA - You deserve him.",
            "I have no clue why people would think that's gay",
            "He shoots finger nails though and that could possibly be really weird to see",
            "Just get bug bitten",
            "I wanna fuck Johnny Bravo, yeah, but I'm not gay. Why is it gay to wanna fuck one dude? Like I'd just fuck Johnny, I don't wanna fuck any other dudes, you can fuck one dude and still be perfectly straight. I know for a fact I only wanna fuck Johnny because I tried jerking off to Tuff Puppy and Timmy Turner and I came sure but it took me like 2 minutes longer than when I'm looking at Johnny Bravo Rule 34. I just think his hair is cute, okay? I don't think he'd even feel it if I put my dick in his ass because he's super ripped. The reason why I want to fuck him is because I'm curious to see if his tight little asshole can feel anything or if his cock can get hard and if he can feel how tight and warm my asshole is with it. Johnny was probably supposed to be a god anyway and Partible probably just forgot, I mean look at his slick beautiful hair and his round amazing ass, men don't look like that. Why is it so gay that I jerk off to Johnny Bravo hentai? Why is it so gay to fantasize about how his tight raging cock would feel flopping around while you pound his quivering asshole with your meat? I really don't get why that's gay.",
            "Is this a one time fuck? What if you prematurely ejaculate? You still want a second chance? Is it only potentially gay once penetration has occurred or is the intent what makes people think it's gay.  Try r/relationshipadvice they may help.",
            "Would rather fuck joseph",
            "Did you even finish SBR? \"He's a cripple\" he can walk at the end. YTA buddy.",
            "I mean... I'm gay and I wanna fuck Johnny Joestar so? Araki stop making hot male characters",
            "\\+translateto goth",
            "\\+translateto gothbold",
            "+translateto gothbold",
            "Ahem...sauce?......................",
            "Jonathan",
            "r/bi_irl",
            "gay",
            "u/temperrrip",
            "same",
            "[deleted]",
            "Wtf",
            "yeah but will part 7 be animated?",
            "Cause he be fucking dead",
            "You’ll never reach tru- wait, you literally just did",
            "What the fuck",
            "+translateto circleblack",
            "wow",
            "He want's to make a chocolate disco in those hot pants of Johnny, maybe show him his scary monster? And maybe create a sugar mountain's spring, eh? :))))",
            "NTA",
            "My day is ruined thank you",
            "King Crimson would have liked to skip this post...",
            "i bet u/Rohan_0ge would like this",
            "That Nazi ass  a robot nigga that look like guile from street fighter",
            "LADIES AND GENTLEMEN I HAVE COME TO MAKE AN ANNOUNCEMENT: u/MrSoftServe1337 IS A GAY-ASS MODERATOR! HE PISSED ON MY FUCKING WIFE, OWOIFIER! THAT'S RIGHT, HE TOOK HIS THREE INCHER AND HE SAID HE WAS \"T H I S B I G\" AND I SAID NO, THATS DISGUSTING! SO I'M MAKING A CALLOUT POST ON REDDIT, \" u/MrSoftServe1337, YOU HAVE A SMALL DONG, IT'S THE SIZE OF u/LiterallyKesha's DICK, EXCEPT WAY SMALLER AND GUESS WHAT?? HERE'S WHAT MAI DONG LOOKS LIEK! wpsh THAT'S RIGHT BAYBEE. TALL POINTS, NO ICED CREAMS, LOOK AT THAT IT LOOKS LIKE 2 BALLS AND A BONG! HE FUCKED M'LADY, SO GUESS WHAT? I'M GONNA FUCK u/BOOF_ESTROGEN ! THAT'S RIGHT, THIS IS WHAT YOU GET, MY SUPER u/sushisushisushi PISS!! EXCEPT I'M NOT GONNA PISS ON u/BOOF_ESTROGEN, I'M GUNNA GO HIGHER! I'M PISSING ON r/copypasta! HOW DO YOU LIKE THAT, u/SMUT_ADDICT???!!! I PISSED ON r/copypasta YOU EEEDIOT! YOU HAVE 23 HOURS UNTIL THE u/sushisushisushi PISS D R O P L E T S HIT THE FUCKING EARTH, NOW GET OUTTA MY FUGGIN SIGHT, BEFORE I PISS ON YOU TOO!!",
            ">Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext >Greentext",
            ">Gweentext",
            "Who doesnt",
            "[deleted]",
            "This but unironically",
            "what fuck",
            "NTA - Understandable and I would do the same",
            "What in the actual fuck man",
            "[deleted]",
            "You know what. Can i join you",
            "You should be in a hospital.\nI hope you know.",
            "me too I want my lips to turn blue (his lipstick rubbing off on my lips) and I'll use smth as lipgloss",
            "It’s not gay if it’s Keanu, joe star, DeVito, or shrek. Also, I’m assuming you have socks on so it’s fine.",
            "What the fuck",
            "Muh shock humor",
            "If you fuck him he will go from cripple to clown",
            "i'm a girl but i think the same thing as you",
            "same ngl"
        ]
    },
    {
        "post_id": "bgug5v",
        "author": "whyareall",
        "title": "I wish I could go back in time and fuck Hitler’s brains out.",
        "url": "https://www.reddit.com/r/copypasta/comments/bgug5v/i_wish_i_could_go_back_in_time_and_fuck_hitlers/",
        "score": 6956,
        "num_comments": 375,
        "created_utc": 1556111569.0,
        "selftext": "Fuck it, I’m just gonna say it. I wish I could go back in time and fuck Hitler’s brains out.\n\nThis is how I envision it: I’m a dirty little american soldier that ends up being captured by the Nazis. To avoid execution, I volunteer myself to be Hitler’s obedient fuck-toy.\n\nFor days, I allow Hitler to chain me up and obliterate all of my orifices like they’re little Polands, constantly filling them with his aryan seed until his cock is stroked raw.\n\nHell, he even gives me the pleasure to lick his puckered german booty clean after he takes insane nuclear shits. Due to me not getting bathroom access, I constantly shit and piss myself, but Hitler is generous enough to be my personal cleanup, licking it all up and staining his beautiful mustache.\n\nAfter building up trust and showing my obedience, he unchains me and allows me to fuck his brains out, cursing in pleasure as he yells out, “YA SHOVE IT REICH UP MY ASS!”. I’m generous enough to give him a reach around, cranking his throbbing war machine.\n\nI feel him tighten up as he reaches climax, but I let go of his thick ramrod as he begins to spew his nuclear ejaculate all over the floor. Hitler repeatedly yells out “NEIN! NEIN! NEIN! NEIN!” through his moans while he suffers through his ruined orgasm. At this point the tables have turned.\n\nHe tries to fight me off, but I pin him down and powerfully thrust my all-american cock harder into his poop chute as blood begins to build up and gush out of his torn asshole. I can’t contain myself any longer, so I quickly pull out my 1911 and put a bullet through the back of Hitler’s head. Brain matter and skull fragments paint the wall, which makes me break through to my climax.\n\nI raise my right arm up to the ceiling. I yell out “SEIG HEIL!” as my cock begins to rapidly pulsate. I quickly thrust my cock to the hilt deep inside of him. I throw my head back with a loud “FUUUUCK!” as I spew what feels like a gallon of american semen deep inside his german asshole.\n\nI pull my bloody cock out of his booty tube and watch in excitement as my thick load begins to leak out of his ass. Heavily breathing, I fall back and begin to fade out, as I watch a group of american soldiers burst into the room, guns drawn.\n\nI wake up in the hospital, in which I’m told that I’m praised as an american hero for stopping World War 2.",
        "permalink": "/r/copypasta/comments/bgug5v/i_wish_i_could_go_back_in_time_and_fuck_hitlers/",
        "comments": [
            "You can expect my lawyers to contact you in the near future",
            "the fuck did i just read",
            "Fuck it, I’m just gonna say it. I wish I could go back in time and fuck Hitler’s brains out.\n\nThis is how I envision it: I’m a dirty little american soldier that ends up being captured by the Nazis. To avoid execution, I volunteer myself to be Hitler’s obedient fuck-toy.\n\nFor days, I allow Hitler to chain me up and obliterate all of my orifices like they’re little Polands, constantly filling them with his aryan seed until his cock is stroked raw.\n\nHell, he even gives me the pleasure to lick his puckered german booty clean after he takes insane nuclear shits. Due to me not getting bathroom access, I constantly shit and piss myself, but Hitler is generous enough to be my personal cleanup, licking it all up and staining his beautiful mustache.\n\nAfter building up trust and showing my obedience, he unchains me and allows me to fuck his brains out, cursing in pleasure as he yells out, “YA SHOVE IT REICH UP MY ASS!”. I’m generous enough to give him a reach around, cranking his throbbing war machine.\n\nI feel him tighten up as he reaches climax, but I let go of his thick ramrod as he begins to spew his nuclear ejaculate all over the floor. Hitler repeatedly yells out “NEIN! NEIN! NEIN! NEIN!” through his moans while he suffers through his ruined orgasm. At this point the tables have turned.\n\nHe tries to fight me off, but I pin him down and powerfully thrust my all-american cock harder into his poop chute as blood begins to build up and gush out of his torn asshole. I can’t contain myself any longer, so I quickly pull out my 1911 and put a bullet through the back of Hitler’s head. Brain matter and skull fragments paint the wall, which makes me break through to my climax.\n\nI raise my right arm up to the ceiling. I yell out “SEIG HEIL!” as my cock begins to rapidly pulsate. I quickly thrust my cock to the hilt deep inside of him. I throw my head back with a loud “FUUUUCK!” as I spew what feels like a gallon of american semen deep inside his german asshole.\n\nI pull my bloody cock out of his booty tube and watch in excitement as my thick load begins to leak out of his ass. Heavily breathing, I fall back and begin to fade out, as I watch a group of american soldiers burst into the room, guns drawn.\n\nI wake up in the hospital, in which I’m told that I’m praised as an american hero for stopping World War 2.",
            "This, right here is why Jesus is never coming back.",
            "Not the weirdest thing I fapped to. 3/5",
            "I think I pulled a fucking muscle reading this",
            "[deleted]",
            "Fuck it, I’m just gonna say it. I wish I couwd go back in time and fuck Hitwew’s bwains out.\n\nThis is how I envision it: I’m a diwty wittwe amewican sowdiew that ends up being captuwed by the Nazis. To avoid execution, I vowunteew mysewf to be Hitwew’s obedient fuck-toy.\n\nFow days, I awwow Hitwew to chain me up and obwitewate aww of my owifices wike they’we wittwe Powands, constantwy fiwwing them with his awyan seed untiw his cock is stwoked waw.\n\nHeww, he even gives me the pweasuwe to wick his puckewed gewman booty cwean aftew he takes insane nucweaw shits. Due to me not getting bathwoom access, I constantwy shit and piss mysewf, but Hitwew is genewous enough to be my pewsonaw cweanup, wicking it aww up and staining his beautifuw mustache.\n\nAftew buiwding up twust and showing my obedience, he unchains me and awwows me to fuck his bwains out, cuwsing in pweasuwe as he yewws out, “YA SHOVE IT WEICH UP MY ASS!”. I’m genewous enough to give him a weach awound, cwanking his thwobbing waw machine.\n\nI feew him tighten up as he weaches cwimax, but I wet go of his thick wamwod as he begins to spew his nucweaw ejacuwate aww ovew the fwoow. Hitwew wepeatedwy yewws out “NEIN! NEIN! NEIN! NEIN!” thwough his moans whiwe he suffews thwough his wuined owgasm. At this point the tabwes have tuwned.\n\nHe twies to fight me off, but I pin him down and powewfuwwy thwust my aww-amewican cock hawdew into his poop chute as bwood begins to buiwd up and gush out of his town asshowe. I can’t contain mysewf any wongew, so I quickwy puww out my 1911 and put a buwwet thwough the back of Hitwew’s head. Bwain mattew and skuww fwagments paint the waww, which makes me bweak thwough to my cwimax.\n\nI waise my wight awm up to the ceiwing. I yeww out “SEIG HEIW!” as my cock begins to wapidwy puwsate. I quickwy thwust my cock to the hiwt deep inside of him. I thwow my head back with a woud “FUUUUCK!” as I spew what feews wike a gawwon of amewican semen deep inside his gewman asshowe.\n\nI puww my bwoody cock out of his booty tube and watch in excitement as my thick woad begins to weak out of his ass. Heaviwy bweathing, I faww back and begin to fade out, as I watch a gwoup of amewican sowdiews buwst into the woom, guns dwawn.\n\nI wake up in the hospitaw, in which I’m towd that I’m pwaised as an amewican hewo fow stopping Wowwd Waw 2.",
            "whay is my peepee harrd",
            "is this the plot to Wolfenstein 3",
            "my mom found that i texted this to my brother a while back and it is the reason i couldn't use reddit for a long time",
            "I thought this was r/showerthoughts at first",
            "honestly, me too.",
            "Repost?",
            "[at least it’s over 100 days old](https://www.reddit.com/r/copypasta/comments/a8vo8d/i_wish_i_could_go_back_in_time_and_fuck_hitler/?utm_source=share&utm_medium=ios_app)",
            "REEEEEE",
            "[deleted]",
            "Nien!",
            "#WHERE THE FUCK IS THE HOLY WATER",
            "Just go to Argentina",
            "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/bitchwhatthefuck] [uhhh](https://www.reddit.com/r/bitchwhatthefuck/comments/bgwqdn/uhhh/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
            "Haram.",
            "This is like a better version of how Hitler died (even better than inglorious basterds)",
            "What did I read and why did I keep reading",
            "What the fuck have you brought upon this cursed land",
            "😎",
            "this is fucking cursed",
            "Eye cancer",
            "Amazing, 10/10",
            "I posted this in all my group chats because if i had to read this so do they",
            "I need someone to animate this beautiful story.",
            "Repost",
            "[Re](https://www.reddit.com/r/copypasta/comments/a8vo8d/i_wish_i_could_go_back_in_time_and_fuck_hitler/?st=JUVRV1DG&sh=26c4d62a)\n\n[po](https://www.reddit.com/r/copypasta/comments/b104i0/i_wish_i_could_go_back_in_time_and_fuck_hitlers/?st=JUVS0YKY&sh=652f6b88)\n\n[st](https://www.reddit.com/r/copypasta/comments/9ve02c/i_wish_i_could_fuck_hitlers_brains_out/?st=JUVS1KU2&sh=63748e5d)",
            "why did i get a half erection from this holy fuck",
            "Emoji",
            "I was eating lunch while reading this...",
            "Where the fuck did you found this",
            "r/jesuschristreddit",
            "What the fuck?",
            "ok",
            "Yes, yes officer, this comment right here",
            "I lost it at “YA SHOVE IT REICH UP MY ASS!”",
            "Okay so what’s the worst line out of this whole copypasta. Every new one I read seems to beat out the other lol",
            "This is actually cursed.",
            "Damn u/magicfart69 is a legend",
            "u/magicfart69",
            "Find Jesus or something",
            "WTF DID I JUST READ !! I'm mentally scarred after reading this. YA SHOVE IT REICH UP MY ASS!”, this is the most cringey and weird sentence in this post.",
            "i wholeheartedly agree with this post.",
            "edit: SILVER?!?????!!!!?!!??! THANKS👌👌👌🙏🙏👍👍 REDDIT I NEVER THOUGHT THIS WOULD HAPPEN edit 2: ANOTHER2️⃣ SILVER OH MY GOD 🙏🙏🙏🙏WTF edit 3: thanks for the gold kind stranger tHaNkS FOr ThE GOld kInD sTrAnGer\n\nTHANKS FOR THE GOLD KIND STRANGER\n\nTHE GOLD\n\nKIND STRANGER\n\nTHE GOLD KIND STRANGER\n\n(chorus: the gold kind stranger)\n\nedit 4: THANKS FOR \"POPPING\" \"MY\" \"PLATINUM\" \"\"\"\"CHERRY\"\"\"\" WHATEVER THAT'S SUPPOSED TO MEAN WHO CARES I GOT PLATINUM!!!!!!!!!!!!!! HAHA SUCK MY DICK I GOT PLATINUM I'M AN UNEMPLOYED 40 YEAR OLD MAN WHO COPIES AND PASTES THE SAME 15 SENTENCES ON REDDIT AND OFFICE QUOTES HAHAHAAAAA BUT FUCK YOU I GOT PLATINUM THANK YOU KIND STRANGER edit 5: MY👏MOST👏UPVOTED👏COMMENT👏IS👏ABOUT👏GOLD👏THANK👏YOU👏REDDIT👏FOR THE GOLD (chorus: the gold kind stranger) 👏WE👏DID👏IT👏REDDIT👏THANK👏YOU👏REDDIT👏THE GOLD (chorus: the gold) 👏\n\nchorus: the gold\n\nedit 6: 100 UPVOTES!!!!!! TWO PLATINUMS!!?!??!?!??!!! I'M FAMOUS GUYS I'M DOING AN AMA AMA (edit after posting this copy pasta, I'm already doing one lol) THANK YOU ALL I LOVE YOU THANK YOU FOR THE FAME KIND STRANGERS (chorus: kind stranger) THE SILVERS (chorus: kind stranger) THE GOLD (chorus: the gold kind stranger) THE PLATINUM (chorus: kind stranger) THE UPVOTES",
            "Reeeeeeee",
            "I hate Reddit",
            "You abhorrent scum. You ignorant fool. I will sue you. You are going to be the target of the greatest lawsuit the world has ever seen. You don't know why? It's completely obvious. It's so obvious, the most deplorable peasant could grasp the full magnitude of your wickedness and treachery with the greatest of ease. Your actions cry out for mercy, and I will be happy to deliver it. And if you're thinking this is a mistake, or merely a deception of mine, you're sadly mistaken, my friend. I have indisputable proof of your continued harassment and other offenses. Even without it, the jury would take one look at you and decide. The incomprehensible magnitude of your crimes brings with it unavoidable, infinite guilt, and whether you notice it or not, everyone else does. Are you interested in who will be serving as the offense attorney? I'll tell you. It's my father. Your defense? It doesn't matter, in fact, they might just not give you one even to spare just one individual from the trauma. My father is the greatest lawyer in the US, the world, and human history, including the future, which he knows due to the fact that he sued the future and they travelled back in time to tell him. He's served for hundreds of Supreme Court cases, and he's won every single one. You may have never thought about being court-marshaled, but now, that's a real threat. That is the power of my father, a culmination of flawless, supreme logic and a perfect knowledge of the law. You will lose this case, your money, and your life. Does that scare you, insignificant bug? Because it should. The entire history of the U.S. Judicial System has been leading up to this moment, where all of its fury is concentrated on ruining your life. My father won't even need to help. Your heinous crimes will be evident to all, so just give up, you crook. Give up before you're forced to.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/copypasta) if you have any questions or concerns.*",
            "reminds me of some middle aged ladies I encountered on tumblr who argued over Hitler's penis size",
            "The imagery is actually pretty beautiful.",
            "⠄⣾⣿⠿⠿⠶⠿⢿⣿⣿⣿⣿⣦⣤⣄⢀⡅⢠⣾⣛⡉⠄⠄⠄⠸⢀⣿ ⢀⡋⣡⣴⣶⣶⡀⠄⠄⠙⢿⣿⣿⣿⣿⣿⣴⣿⣿⣿⢃⣤⣄⣀⣥⣿⣿ ⢸⣇⠻⣿⣿⣿⣧⣀⢀⣠⡌⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⠿⠿⠿⣿⣿⣿ ⢸⣿⣷⣤⣤⣤⣬⣙⣛⢿⣿⣿⣿⣿⣿⣿⡿⣿⣿⡍⠄⠄⢀⣤⣄⠉⠋ ⣖⣿⣿⣿⣿⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣿⢇⣿⣿⡷⠶⠶⢿⣿⣿⠇⢀ ⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣽⣿⣿⣿⡇⣿⣿⣿⣿⣿⣿⣷⣶⣥⣴⣿ ⢿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟ ⣦⣌⣛⣻⣿⣿⣧⠙⠛⠛⡭⠅⠒⠦⠭⣭⡻⣿⣿⣿⣿⣿⣿⣿⣿⡿⠃ ⣿⣿⣿⣿⣿⣿⣿⡆⠄⠄⠄⠄⠄⠄⠄⠄⠹⠈⢋⣽⣿⣿⣿⣿⣵⣾⠃ ⣿⣿⣿⣿⣿⣿⣿⣿⠄⣴⣿⣶⣄⠄⣴⣶⠄⢀⣾⣿⣿⣿⣿⣿⣿⠃⠄ ⠈⠻⣿⣿⣿⣿⣿⣿⡄⢻⣿⣿⣿⠄⣿⣿⡀⣾⣿⣿⣿⣿⣛⠛⠁⠄⠄ ⠄⠄⠈⠛⢿⣿⣿⣿⠁⠞⢿⣿⣿⡄⢿⣿⡇⣸⣿⣿⠿⠛⠁⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠉⠻⣿⣿⣾⣦⡙⠻⣷⣾⣿⠃⠿⠋⠁⠄⠄⠄⠄⠄⣠ ⣿⣶⣶⣮⣥⣒⠲⢮⣝⡿⣿⣿⡆⣿⡿⠃⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄",
            "W......why.....",
            "sorry what",
            "I’m going to puke",
            "OwO I like what I'm hearing!",
            "I believe this has already been posted",
            "Emoji",
            "i have the weirdest boner right now",
            "oh shit big man, me too, me too",
            "ok now this is Epic",
            "I refuse to read this",
            "Why my pp hard",
            "Thanks, I hate it.",
            "r/TIHI",
            "haha funny and unexpected sexually grotesque copypasta hilarious and original",
            "cursed repost",
            "Was that a feckin captain America reference?",
            "***EHM***  W  H A T T H E F U C K",
            "r/whattheactualfuckbro",
            "Yo ok what the hell",
            "Emoji",
            ">German asshole\n\nHe was not German",
            "I want his strudel sauce on my face",
            "This is amazing! I’m crying of laughter!",
            "I mean yeah same",
            "Mom, come pick me up I'm scared",
            "I posted this days ago",
            "STOP IT GET SOME HELP",
            "Hall of Fame worthy",
            "Isn’t this like a Louis CK joke?",
            "No homo",
            "r/BrandNewSentence",
            "This ruined my day",
            "What in the fresh fuck",
            "What the fuck",
            "That's it. I'm done with internet for today.",
            "gun ass idiot huh smart",
            "*what the square root of fuck did i just lay my eyes upon*",
            "[deleted]",
            "Not my proudest boner.",
            "Why did I read this?",
            "They would just elect another one.",
            "Degenerate copy pasta",
            "What in the goddam fuck did I just read",
            "You know, in some ways I think this is doing a great job of disrespecting hitler and his asshole self.",
            "Emergency services ! We have PTSD casualties.",
            "That was hot",
            "I thought this was the monkeys paw first",
            "Kind of weird that even in his own fantasy the fucking was unnecessary as the Americans showed up right when his plan was....climaxing",
            "I read this subreddit as confessions at first and I lost my shit",
            "What a lovely repost",
            "I’ve read so many copypastas in my life. Somehow, this is one of the strangest and most distressing I’ve ever fucking read.",
            "r/FBIOpenUp",
            "what the fuck",
            "My I eyes are in so much pain",
            "Slow cap builds to fast clap.",
            "when u fail art school and get raped by an American fuckboy",
            "gun ass idiot huh smart",
            "HOLY SHIT I thought I was on r/unpopularopinion",
            "Now see, you fucked this all up, OP. You came too fast...and inside Hitler's asshole, no less. \n\n&#x200B;\n\nTotal fail.\n\n&#x200B;\n\nYou should've shoved your cock inside the bullet hole and fucked his Nazi skull until brain matter starts chunking out of the entry wound of his forehead like tomato paste. THEN you blow nut butter on whatever's left of his medulla oblongata and now you can proclaim that you, \"Fucked Hitler's brains out.\"\n\n&#x200B;\n\nYou encore by chopping his head off and firmly leaving your hard cock planted into the back of Hitler's skull while you use it as an African Djembe tribal drum.\n\n&#x200B;\n\nWhen the U.S. soldiers kick down the door, that's your queue to say, \"Allright guys...this is totally \\*not\\* what it looks like.\"",
            "You think “no homo” is that powerful?",
            "Fuck the world",
            "If I could go back in time I would give hitler a translated version of this explaining that this is his legacy",
            "I have an idea: Let’s post the most graphically vulgar story we can think of, for karma!",
            "This is really old I’ve seen this multiple times",
            "*It was time for Thomas to leave. He had seen everything.*",
            "It's a g\\[re\\]at \\[post\\]",
            "I thought this was on r/confession for a min and I was somewhere in the realm of severely to extremely concerned.",
            "Why did i get boner",
            "DIck savers..",
            "Uhh... wha",
            "Reeepoooost",
            "First time on reddit, not disappointed.",
            "I am fucking crying holy shit",
            "Repost",
            "Good.",
            "This post deserves emojo",
            " Shove it Reich up my ass should have been “SHOVE IT REICH UP MY AUSCHWITZ”",
            "!thesaurizethis",
            "I literally hate this.",
            "I've finally figured it out. The world is slowly getting worse, and this... thing that you just posted proves it. According to even the bible itself, the world will grow worse and worse and you're living proof of that. I was a staunch atheist all my life. I attended atheist megachurches, converted over 300 Christians to atheism, and currently have an outstanding IQ of over 150. I studied every bible and bible type book ever and they all seemed ridiculous and debunk able. I've even converted people with a doctorate in ministry. But what you just posted is so bad it proved to me that Satan exists. And I just had a thought; if Satan exists, God must, too. Your absolute mistake against humanity is so much so that it proves the existence of God, and even I'm wondering how we ended up in this place. How did God create you in this way? Or were you a creation of Satan? Or maybe you're a demon who somehow found a way onto a computer with the sole intention of spreading evil around the world to corrupt it. Honestly I have no idea. Whatever you are, I am personally going to attend church for the first time and beg God to protect me from the evil you have plagued my mind with and hopefully either exorcise the demon out of you or, if you really are a demon, exorcise you in general.\n\n\nHave a rotten day.",
            "emoji",
            "Gentlemen. I have arrived.",
            "I hate",
            "[deleted]",
            "Plot twist: This is what actually happened on April 30, 1945"
        ]
    },
    {
        "post_id": "tx7qaz",
        "author": "Just-Xav-Official",
        "title": "GOD WHY IS MY SISTER SO FUCKING LOUD",
        "url": "https://www.reddit.com/r/copypasta/comments/tx7qaz/god_why_is_my_sister_so_fucking_loud/",
        "score": 6950,
        "num_comments": 217,
        "created_utc": 1649199876.0,
        "selftext": "I swear all she does all day is masterbate and\nmasterbate, it sounds like she's mixing mac n\ncheese and you can hear it throughout the whole fucking house. My mom has been complaining to her but my sister just started going louder and louder. Worst part is my computer is in her room so everyday I have to go in there and see her just fucking DEMOLISHING her pussy, juices flying everywhere! and then i say, \"hey maybe out down a towel to keep clean atleast,\" BUT SHE JUST FUCKING IGNORES ME. I cant stand living here honestly. Yesterday when I went to go use my computer it was absolutely drenched in her juices, and she stained atleast 6 of my shirts by now. And all my friends at school tease me, \"haha haha tobias\ngot his sister's grool on his shirt,\" \"girlcum tobias\" has become my nickname. I hate it!",
        "permalink": "/r/copypasta/comments/tx7qaz/god_why_is_my_sister_so_fucking_loud/",
        "comments": [
            ">it sounds like she's mixing mac n cheese\n\nlmao",
            "Average r/teenagers top post of all time",
            "What the fuck did I just read lmfao",
            "girlcum tobias is a cool ass name ngl",
            "Girlcum tobias",
            "least horny r/teenagers user",
            "YTA her pussy her rules",
            "https://www.reddit.com/r/shitposting/comments/tx3bai/_/?utm_source=share&utm_medium=ios_app&utm_name=iossmf",
            "where she lives",
            "This sounds like a very strange adaption of Diary of A Wimpy Kid.",
            "Cool",
            "I feel personally attacked.",
            "girlcum tobias bro",
            "Fuck her",
            "Where the hell did this one come from",
            "> Later virgins",
            "This is fuckin hilarious",
            "YTA. Her pussy her rules. You sexist pig. She is a strong independent woman exploring her sexuality.",
            "Babe wake up new r/teenagers copypasta dropped",
            "GOD WHY IS MY BROTHER SO FUCKING ANNOYING\n\nI swear all he does is complain and complain about me masturbating, it sounds like he’s eating Mac n cheese and you can hear it through the whole fucking house. My mom has been scolding him but my brother just keeps going louder and louder. Worst part is his computer is in my room so everyday he has to go in my room and see me just fucking WASHING my property, juices flying everywhere! and then he says, “hey maybe put down a towel to keep clean atleast,” BUT I JUST FUCKING IGNORE HIM. I can’t stand living here honestly. Yesterday when he went to go use his computer it was absolutely drenched in my juices, and I stained atlesst 6 of his shirts by now. And all his friends at school tease him, “haha haha tobias got his sister’s grool on his shirt,” “girlcum tobias” has become his nickname. I love it!",
            "girlcum Tobias!",
            "This is boat-worthy",
            "So this is what is feels like to have an acid trip",
            "his sister masterbating",
            "I’ll smash",
            "i thought this was r/teenagers lol",
            "what",
            "I swear all she does all day is masterbate and masterbate, it sounds like she's mixing mac n cheese and you can hear it throughout the whole fucking house. My mom has been complaining to her but my sister just started going louder and louder. Worst part is my computer is in her room so everyday I have to go in there and see her just fucking DEMOLISHING her pussy, juices flying everywhere! and then i say, \"hey maybe out down a towel to keep clean atleast,\" BUT SHE JUST FUCKING IGNORES ME. I cant stand living here honestly. Yesterday when I went to go use my computer it was absolutely drenched in her juices, and she stained atleast 6 of my shirts by now. And all my friends at school tease me, \"haha haha tobias got his sister's grool on his shirt,\" \"girlcum tobias\" has become my nickname. I hate it!",
            "r/teenagers moment",
            "let me guess, this is from r/teenagers?",
            "lmao most of this shit I find from r/teenagers",
            "worst part is that you're named tobias tbh",
            "ALTER VERSION OF THE STORY\n\nI swear all i do all day is masterbate and masterbate, it sounds like i'm mixing mac n cheese and you can hear it throughout the whole fucking house. My mom has been complaining to me. Worst part is my computer is in her room so everyday she have to go in there and see me just fucking DEMOLISHING my dick, juices flying everywhere! and then she says, \"hey maybe out down a towel to keep clean atleast,\" BUT SHE JUST DON'T GET IT. I cant stand living here honestly. Yesterday when I went to go use my computer it was absolutely drenched in my juices, and i stained atleast 6 of my shirts by now. And all my friends at school tease me, \"haha haha jackson got his own grool on his shirt,\" \"boycum jackson\" has become my nickname. I hate it!",
            "Too bad your not in Alabama",
            "what.\n\nthe.\n\nfuck.",
            "Rise of Kingdoms is a sick new RTS game where you can socialize with friends, conquer new territory, and fight in epic real-time battles. You start off by choosing which of the 11 civilizations you want to play as, from Rome, to Germany, to Japan! And then you recruit and train real historical heroes to your crew like Ghengis Khan or Cleopatra. You can embark with your army on a journey in the vast world. You can camp outside enemy bases then seize their territory at the opportune time in the game’s realistic warfare. With your spoils you can customize the architecture of your own city. You can construct schools, hospitals, markets, and more to set up a thriving economy and defend your land from opposing threats. And right now new players can enter the code on screen to get 200 gems, 2 silver keys, 100,000 food, and 100,000 wood for free from now to September 13. So be sure to click the link down below in the description to try out this game. Thank you so much to Lilith Games for sponsoring me.",
            "At least it isn't ur brother. He put puts his dick on my arm when I play games but only when I'm in a part I can't look away from and just leaves it there . I smacked it once as hard as I could and he calaspsed and screamed for like 10 minutes  but that what a dick on your arm will get u. U understand.",
            "I knew when I saw this post on that sub it was coming eventually",
            "Before I begin my actual comment, I would like to apologize in advance for my inadequate level of English proficiency. I am not a native speaker of the world's current lingua franca which unfortunately leads to me making numerous embarrassing mistakes being made whenever I attempt to communicate using this language. Whenever I am reminded of how I lack the ability to convey my thoughts in an eloquent manner, I feel as though I have committed a cardinal sin, as though every English teacher in the world is simultaneously shaking their head and sighing due to how utterly disappointed they are at me.\n\nAlthough I know that saying sorry to those of you who are reading my comment will not change the fact that I fail miserably to write and speak perfect English, I am writing this as a way to deter a certain type of people who cannot stand poor English (Also known informally as Grammar Nazis) from mocking me by posting unwanted and unnecessary comments detailing my every blunder. In my humble opinion, making grammatical errors should be perfectly acceptable as native speakers should not expect non-native speakers to be able to communicate in their second or third languages eloquently. If you are able to completely understand what the other person wrote, is there really a problem with what they've written? No, because the entire concept of communication is the exchange of information between other intelligent beings, which means that no matter how the exchange of information is made, as long as the information is accurately shared there is not a fundamental issue with their ability to communicate. To see it in another way, remember that someone who isn't fluent in English is fluent in another language. When you think about it this way, isn't it impressive for someone to speak a second language in any capacity? Having empathy and respect are qualities that are sorely missing for far too many people these days, especially on the internet.\n\nThat being said, I am aware that not all netizens who correct others are doing it to ridicule and shame. There are some who do so with the intent to help others improve and grow. However, displaying the failures of other people publicly will cause the person who is criticized to feel negative emotions such as shame and sadness due to the fact that their mistake has been made obvious which severely undermines the point they were trying to make in spite of their unfamiliarity with the English language. In most circumstances people are not looking for language help when they post anything online. Most people just want to enjoy themselves and have a good time on the internet which is why I would not encourage correcting other people regardless of your intentions. If you really do want to help others with their spelling or grammar, I would highly recommend you to help via messaging privately because not only will you not embarrass anyone, you can also go more in-depth with your explanation which I'm sure the other person will greatly appreciate if they want help, but I digress. I know that I've written a bit of an essay, but I hope I've made my points clear.\n\nAnyways, here is the comment I wanted to make:\n\ndamn, thats just sad, the only thing you could go to your local doctor or even just  abandon your entire family, i mean, what else can you do? the mom is already aware so... idk",
            "move ur computer to ur room pls",
            "If you cant beat them (pun intended), join them",
            "damn her pussy must be as loose as a greased screw",
            "Shes my princess im your prince yeah, yeah",
            "I wonder why the sister is so horny? Is she a nymphomaniac?",
            "Can someone send this in the comments so I can copy it",
            "Tobias from gumball",
            "fuck your sister once then your sister will never masturbate again cause it wont feel the same",
            "I think it’s time for me to sleep",
            "Holy shit I know who I’m bringing to the apocalypse infinite water source",
            "Least horny sister",
            "why",
            "Hall of famers.",
            "thought this was /r/ teenagers until just 60% of the way through",
            "masterbate",
            "What the fuck is this.....what the actual fuck is wrong with the people and Internet....\nAaaaaaaaaaaaaa",
            "Ayo? 😳😳😳",
            "Who no what is the source for this?",
            "Nothing you can do, especially since she doesn't care. Convince you mom to move your computer somewhere else. Its weirder your walking in on her, more than she's just doing her thing in her room.",
            "This actually just got posted to r/teenagers lmao",
            "Masrferbaken",
            "Fuck you made me laugh really hard in public",
            "LMAO i saw this originally on r/teenagers oh my god",
            "HAHAHAHAHAHHAHAHAHHAHAHA",
            "When your sis is giving you obvious hints. \n\n\nJust give her a snicker I don't think she's herself when she's hungry",
            "What weird fetish fantasy did I just read?",
            "I knew this would come on here",
            "Macaroni in a pot, that's some w.a.p.",
            "Video or it never happened",
            "Bro ☠️",
            "Wish that was my sister",
            "You should give the school some mac n cheese",
            "Damn, this girl eats, sleeps and breathes masturbation.",
            "Must have a very high libido or a medical condition that requires her to masturbate every few hours. My guess is a mix of both.",
            "i figured i’d see this here sooner or later",
            "Kek",
            "remindme! 6 months",
            "Should I send this to my brother for his birthday today?",
            "source? or audio....",
            "Oh my God I lost it at \"girlcum tobias\"",
            "Source?",
            "SUBAHANALLAH!",
            "On a cloudy rainy school day, Senpai would be in the art club room as usual, attempting to work on an art project of his, though he couldn't focus today. The more and more he spent with Nagatoro the more he began to like her, he enjoyed her company and was enjoying how comfortable she had been getting in the art room. Thoughts of her raced through his mind, his heart pounding and his face turning red as he began to have lewd thoughts about her. He had remembered she left a bag that contained a costume she wore when modeling for him one day, and it seemed she wasn't going to bother him today since she hadn't shown up like she normally did, he had opened up the bag to look for a specific piece of her clothing. Lucky him, he had found a pair of Nagatoro's white panties. He looked over at the door and listened to make sure nobody was near, and since he thought nobody was near the room, he held her panties to his face and began sniffing the backside of them. He then stopped after the first sniff for a moment \"Eh!? Did N-Nagatoro fart in these? It smells so bad... but really good too!\" He had quietly said to himself, he'd then proceed to bury his nose in them again when suddenly...\nThe door swung open and the short tan girl walked through, \"Senpai-\" she then froze in place and her face immediately turned a bright red, she had never actually thought she'd catch him doing perverted things like this. \"N-N-N-Nagatoro! It's not what it looks like!!\" He told her, extremely embarrassed to have her ser him like this.\nShe would walk over to him, standing right over looking tall as he was on the ground with her panties still in his hand, \"Geez Senpai~ i knew you were a pervert but I didn't I'd ever find you sniffing my panties, I let loose some gas in those, I bet they reek! And i think you know that too\" she'd tease, she didn't want him to see her embarrassed so she decided to make his fantasy come true. She pulled down her skirt and got even closer to him.\n\"Do you wanna sniff my ass Senpai~ or maybe even better, do you wanna sniff my farts\" She would ask him, her body so close to his, a visible bulge had grown in his pants from Nagatoro being so close to him. \"N-Nagatoro I'm...\"\nShe quickly shut him up, \"no need to apologize Senpai, just beg for what you want, and I really will do it for you~\" she said with a moan at the end, Senpai then hugged her waist and begged, \"Nagatoro! Please, please fart for me! Let me smell your butt Nagatoro! Please!\". Nagatoro looked at him in shock, she didn't expect him to do it so quickly, but she didn't back out of her deal.\n\"Hahaha! Gross Senpai! But you did what I asked so I guess you deserve it\". Nagatoro turned around and placed her ass up on his face, rubbing her panty covered ass all over it, suddenly stopping to give Senpai his first fart.\nBRRRRRRAAAAAPPPPPPP!!\nA long bassy fart was let loose from Nagatoro's ass, she giggled as she heard him sniffing her fart, and also from his breath tickling her bum. She already was starting to enjoy doing this for him, she didn't mind Senpai being a perverted fart lover. \"Mmm Senpai.. maybe I'll make you my cushion to fart on, you'd like that wouldn't you~\" She teased once more. He nodded his head, sliding his nose up and down Nagatoro's ass.\nPPLLRRRPRPPPPPRPPTTT!\nA long wet and bubbly fart blasted into Senpai's face, he deeply inhaled Nagatoro's gas, rubbing his face all over her ass. \"S-Senpai... your making me f-feel good down there..\". Nagatoro's legs began to feel weak as she was being pleasured by Senpai's face in her ass.\nBBLLRLRRRRRRRRLLLTTTT!\n\"Mmmm, ahhh~ that one f-felt good to get out..\" Nagatoro moaned, she was bent over hands on her knees looking down watching senpai as he masturbated to her gas",
            "lemme come over 🥴",
            "⁇  Why is my sister so strict?\n\n               I have a big bat that can use you all day.\n               Masterbate Macisuke is wrong.\n               You can smell the cheese and house.  She complained to her mother, but her sister worked hard.  Unfortunately He has a computer in the room.  So I have to go and see his sweat every day.  Water flows everywhere.  And I said, \"Yeah, wash clothes,\" but he didn't care.  Permission will not be accepted here.  When I started my computer yesterday, it was soaking wet and now at least six shirts are ugly.  And all my classmates laughed when they saw me.\n               I like her sister's clothes.  My nickname is \"Katie Kamtobias\".  I do not like!",
            "Google butcher\n\nI promise that I will fight all day and I will only fight.  It looks like a mixture of macaroni and cheese, you can hear the whole house.  My mother complained, but her sister's voice was too loud.  The worst part is, my computer is my place, I need to go there every day, I love it like a smartphone, and juice is everywhere!  And you will say, \"Hey, at least the towel is clean\", but ignore me.  He cannot live here.  Yesterday I started using the juice computer completely, stripped of at least 6 layers.  All my friends are laughing at me.  \"Hahahahatobias shirt with sister\" \"girl Kamtobias\" was my nickname.  I hate!",
            "أقسم أن كل ما تفعله طوال اليوم هو ماسترباتي وماسترباتي ، يبدو أنها تخلط جبنة ماك إن ويمكنك سماعها في جميع أنحاء المنزل اللعين. كانت أمي تشكو لها لكن أختي بدأت للتو في رفع صوتها. أسوأ جزء هو أن جهاز الكمبيوتر الخاص بي موجود في غرفتها ، لذا يجب أن أذهب كل يوم إلى هناك وأراها تضاجع بوسها ، والعصائر تتطاير في كل مكان! ثم أقول ، \"ربما أخرج منشفة لتحافظ على نظافتها على الأقل\" ، لكنها فقط تضايقني. لا أستطيع العيش هنا بصدق. بالأمس عندما ذهبت لاستخدام جهاز الكمبيوتر الخاص بي ، كان منقوعًا تمامًا في عصائرها ، وقد تلطخت على الأقل 6 من قمصاني الآن. وجميع أصدقائي في المدرسة يضايقونني ، \"هاهاهاها توبياس حصلت على لعاب أخته على قميصه\" ، \"girlcum tobias\" أصبحت اسم الشهرة لي. أنا أكره ذلك!",
            "Go ahead and kys"
        ]
    },
    {
        "post_id": "uatkdj",
        "author": "CringeSpyro",
        "title": "r/teenagers: “Bro my mom just basically said I have a small dick”",
        "url": "https://www.reddit.com/r/copypasta/comments/uatkdj/rteenagers_bro_my_mom_just_basically_said_i_have/",
        "score": 6931,
        "num_comments": 248,
        "created_utc": 1650802719.0,
        "selftext": "Bro my mom just basically said I have a small dick\n\nShe just straight up said to me “I noticed when you go to pee sometimes you pee on the floor a little, if your penis doesn’t reach far enough you need to stand a little closer since its smaller”, and then started saying not to be embarrassed about it and that its ok and no one in the future will mind, its fucking weird. And now my confidence is fucked, thanks mom 👍",
        "permalink": "/r/copypasta/comments/uatkdj/rteenagers_bro_my_mom_just_basically_said_i_have/",
        "comments": [
            "I think the lesson here is not to piss on the floor.",
            "My confidence is so fucked that I decided to share the story about my cock with strangers on the internet",
            "Don't pee on the floor, use the commodore!",
            "Don't piss on the floor is the main takeaway",
            "NTA, your small penis, your rules",
            "Then they has rough gay anal sex",
            "Just fucking sit down to pee I’ve been doing that for months and my dick is big😎",
            "r /teenagers is basically the goldmine of copypastas",
            "🎶Don’t-pee-on-the-floor, use the commodooorrre🎶",
            "I mean when you were born you most likely had your entire penis inside of her vagina",
            "My mans mom is upset big time",
            "Your mom, probably: I'm so sick of that little fucker pissing on the floor. \"Hey, baby dick, come clean your piss up!\"",
            "yep. sounds like r/teenagers\n\nsource: im a moderator",
            "I would definitely be really upset to my mom after this",
            "At least it's not an incest copypasta",
            "It’s the teen’s fault for pissing on the floor, who the hell does that?",
            "Damn bro you got fucked by ur mom 😂😂 no jk",
            "I piss stuck to the wall because my stream is immense and that's why I dribble on the floor cause I don't reach in time",
            "Only 1 way around this. Son, how big is your dick",
            "Longer barrel=Longer range duh",
            "When you pee standing in your own home smh my head",
            "If you can't manage to not piss on the floor, then have the common courtesy to clean up after yourself, nasty.",
            "if you pee on the floor clean it up",
            "i need... proof of said size to confirm her words",
            "Sit down. Please.",
            "I sent a dick pick to my step mom and then she told everyone I had a big dick. 100% true story.",
            "Maybe you should start sitting down instead",
            "The kid should’ve fucked his mom to assert dominance",
            "just sit down when you pee… thats what every man should do and i do. no splatter, more comfy, less noise…",
            "how she noticed\ndoes that mean he doesnt wash up/clean the piss splatter?",
            "don't be a fucking retard simple as",
            "I had a similar problem until I started sitting down when I went pee(I stand in public restrooms, and sit down when at home)",
            "How did you find my FB bio?",
            "Pee on the floor to teach her whose boss",
            "This is why you’re supposed to use the commodore",
            "Assert dominance",
            "Tell her to do pelvic floor exercises.",
            "Or just sit down. But better to pee on the floor right?",
            "My dick big as fuck and I still pee on the floor. Heck the pee ends up going far behind my penis...\n\nIt makes sense, just like when you pour water out of a glass it sticks to its surface and goes back? Yeah thats probably what happens",
            "Is that why I always miss the bowl and my piss goes straight to the tank?",
            "Honestly that’s fucked. She’s intentionally trying to bully her kid cause he pissed on the seat. Id have told her to fuck off and loose some weight.",
            "Don't pee on the floor use the commodore.",
            "lol who pees standing up?",
            "deserved dicklet",
            "YTA his dick her rules",
            "Deserved",
            "It’s okay bro. You’re probably just a grower. I bet that dong swings heavy when it’s plow time!",
            "She’s not wrong",
            "That sub legit might be the worst on the site",
            "Pop a boner for her. Prove her wrong.",
            "Pot calling the kettle black",
            "go to greece cause they believe small dicks are a sign of intelligence",
            "Just sit down while pissing at that point",
            "Such a nice way to say it",
            "Should just pee into a condom like the rest of us",
            "and how old are you, son? 12?",
            "The lesson here is don't pee on the floor...",
            "why does he stand at home anyway?",
            "Reminder: don't pee on the floor, use the commodore",
            "cope harder",
            "Maybe don't have a small penis",
            "you simply need to increase your average piss velocity"
        ]
    }
]