[
    {
        "post_id": "f9orzd",
        "author": "None",
        "title": "Written in response to a furry comic on a video game subreddit.",
        "url": "https://www.reddit.com/r/copypasta/comments/f9orzd/written_in_response_to_a_furry_comic_on_a_video/",
        "score": 6913,
        "num_comments": 155,
        "created_utc": 1582697015.0,
        "selftext": "I have viewed various pieces of hardcore gay pornographic material, yet none of them have been as gay as this fucking image. You have taken something normal and respectable, and have shat all over it with your furry, “owospeak” garbage. This makes me want to gouge my eyes out. I have purchased 500 gallons of nitric acid in order to disintegrate me and everything I own because of this image. I am willing to bet my life savings you are not allowed anywhere near a preschool. Fuck.\n\nedit: no, it wasn't an nsfw comic.",
        "permalink": "/r/copypasta/comments/f9orzd/written_in_response_to_a_furry_comic_on_a_video/",
        "comments": [
            "I have viewed various pieces of hardcore gay pornographic material, yet none of them have been as gay as this fucking image. You have taken something normal and respectable, and have shat all over it with your furry, “owospeak” garbage. This makes me want to gouge my eyes out. I have purchased 500 gallons of nitric acid in order to disintegrate me and everything I own because of this image. I am willing to bet my life savings you are not allowed anywhere near a preschool. Fuck.",
            "\nBetter Version\n\nI(36m) have viewed various pieces of hardcore gay pornographic material(18m, 18m), yet none of them have been as gay as this fucking image(1 day m). You have taken something normal and respectable(2m), and have shat all over it with your furry(3m), “owospeak” garbage. This makes me(43f) want to gouge my eyes out. I have purchased 500 gallons of my(at least 7f) nitric acid in order to disintegrate me(m) and everything I() own because of this image. I(50h) am willing to bet my life savings(3 dollars CAD) you are not allowed anywhere near a preschool(6m). Fuck.",
            "[deleted]",
            "I have viewed vawious pieces of hawdcowe gay pownogwaphic matewiaw, yet none of them have been as gay as this fucking image. You have taken something nowmaw and wespectabwe, and have shat aww ovew it with youw fuwwy, “owospeak” gawbage. This makes me want to gouge my eyes out. I have puwchased 500 gawwons of nitwic acid in owdew to disintegwate me and evewything I own because of this image. I am wiwwing to bet my wife savings you awe not awwowed anywhewe neaw a pweschoow. Fuck.",
            "Anyone have a link to the original thread?",
            "Link to original thread OP?",
            "Normal horses are better.\n\nHorse pussy is honestly a gift from god. Yesterday I was tending to my mares and just noticed that Beffica (my strongest white purebred) had the wettest equine pussy I had ever laid my peepers on. I immediately dove in headfirst and started eating her out. She whinnied in pleasure as I devoured her horsey snatch. Soon I could feel her about to horse cum so I reverse-vored myself inside her and tickled her ovaries until she unleashed a torrent of horse squirt on my eager face. I was far from done though, and so I decided to whip out my genetically engineered horse cock and give her a round two. Beffica looked at me with a horse lust in her eyes and I pounded the absolute shit out of her. Before long, all four of her horse legs were on their horse knees and his cock was 26 inches deep inside her. I felt a tightening in my whole body before surreptitiously unloading an absolutely monstrous explosion of ejaculate that emptied my sack and completely filled Beffica to burst. My seed started to leak out around my balls and Beffica collapsed in a cummy heap. My phallus retracted back into my lower intestine and I collapsed in exhaustion. All of a sudden, I was flipped on my stomach and my pants were ripped from me. It was Beffica! I craned my head to the left and noticed something I hadn’t seen before. A monstrous horse donger was cradled in between her legs. I shuddered, never having gotten to 7th base (pegging) before. I had barely a second to prepare myself before what felt like at least 30 inches of rock hard femcock entered my tight virgin asshole, ripping me nearly in two. It honestly felt like I was being ripped in half, and of course after 3 or so hours she came. And when I say she came, I mean she came! I had filled her dripping wet Hussy with cum, no doubt almost a litre. She, on the other hand, unleashed what had to be at least a milk jug’s worth of cum into my raw and bleeding asshole. I honestly didn't expect it to be as hot as it was, which definitely made up for being raped by a horse. I crawled to my knees, horse batter dripping from my pooter and shivered slightly. I still needed to tend to the other horses and it was already 7pm. Sigh. I pulled my ripped cowboy jeans back on and placed my leather cap on my head, and made my way to the door, I gave a wink to sweet Beffica, and she simply neighed and shot another glob of cum in my direction. I caught it, and used it to smoothen my hair. Did you know that horse cum is great for the skin, scalp, dandruff and as a hair gel? I learned that yesterday too.",
            "bideo gane",
            "I (3m) owoowowowowowowoowowoowowowoowowowowowowowooowowowoowowowowowowowowowowowoowoowowowowowowowowowowoowowowoowowowowoowowowowowowowoowowowoowowowooowowowowoowoowoowoowowowowowoowow\n\nI hate minorities and women upvotes to the left",
            "Sauce?",
            "Source for research purposes?",
            "Virgin god cock",
            "Doing god's work\n.̶̷̷̩̬̣̮̦̣̪̗̙̺̞̱͙̰͉͍͚ͤ̀͋͗̿ͭ̐ͯ͑̊͆͗̾̂͋͌ͮ͘͝ͅ.̧͉͖̙͎̠̬̻̤͖͍̤̼̯ͥ̎̍̓͑̋͌ͧ̋͊̿̕͘͢͢.̷̧̛̛͇̜̯̳̥͇̤̗͇͛̃̍ͮͥ̇̎ͥ̐ͫͧ͆̽̍̅̈͗́̅.̶̵̪͚̘̖̰͇̭͙̩̟̭̟ͤ̓ͯ̍ͪ̀̑̓̐̓͢.̶̶̛̳̺̳̩͍̥̿ͮ̈́̓̆ͨ̎́ͬ̓ͯ.ͣͪ̄̿̐ͬ́͑͝͏̪̫̺̹̗͉͓̠̳̯͓̻͖̳.̶̸̰̟͉̠̯̤͇͈̅ͨͯ̐́ͅ.̡̨̛͍̹̥̣͉̖̬̹̟͍̰̯͖̯̳̗͉̭̓̌͊ͬ͢͡.̶̢̹̠̩͕̋͛̍͒͛̂ͨ̐͑̌̚.̵̧̛̦̫͔͚̤͈̠̩͈͚̼̬͇͎̗̱ͦͫͯ͋ͬͦ̄͠.̖̗͔͙͒̀ͭ͋̈̐ͫ̃̀̽ͣ̆̓ͯͬͪ̽́̚͟͟͞.̵̛̛̹̗̻̯̺͔̥̩̿ͫͫ̉ͨ͘͡.̈́̈̉ͨ͌̽̄ͯͭ̿͌̌͂̓̇̈́ͦ͏̶̧̬̬͉̫̣̘̥̝̟̝̯̮̝͇̣̀͝.̸̣̦̱͙̦̯̱̬̲͓̘ͬ͗̏́̌͆̆̅ͩ̉̒͗ͭ͘.̔ͥͦ̓̉̐̏̔̒̐̂ͭ̔͢͏̸̖̞̝̗̩̜̮̩̰̕.̛͚̲̱̦̺̦͑̌̒͊̀͜͟.̨͉̳̟̭͇͍̖͎̆͑́̌̄ͣ̒́̀́͟͞.̶̲̦̘͎͖͈͍͕͇̦̹̰͇̠ͪ͋̋̓̊ͬ̽ͮͧ͂̾̐̀͋̂̎ͫ̔̚͝ͅ.̸̛̬̠̟͎͔͖̹̞̯̗̣̮̼̖͕̈̀̈́̊͡.̵̡̺̝̞̯̞̬͗ͩ̃́͌ͤ̃͞ͅ.ͮ̏ͦͩ͝҉̢̖̱̻̱̫ͅ.̵̢͙̮̓͒̒ͯ̓̍͐ͣͪ͛͑ͦ̇̚͠͡͞ͅ.̵̷̵͍͚̯̪̬͙̭̲̻͚̣̭̻͎͔͇͈̫̐ͥ̃͊͌̓͗̽ͣ̚͡.̶̷̵̧̳̯̖̺̟̖̝̭̙͙͎̝͈̤̥ͭͮͧ͌̓̉̂̈́͝.̪̮̖̹͈͇̩̟͕̟̖͐ͦ͐̅ͤͣ̇̓͢͝͡.̶̢͕͎͎͍̠͓̙͈̺̪͖̦͋̒̅̏͛͊̂̀͘͟.̶̡̡̮̠̥ͭ͋̆͗̐̊ͮͧ͒̄̾̉̑̄͠ͅ.͇̩̙͔ͬͣ̽̏ͤͩ̈ͩ̇͐ͩ͒̉̓́̚͘͘͠.̷̹̠̙̻̥̤͚̦̠̯͓̲̙͚͙̌̽͒͂͌ͣͣ͗ͦ̎ͫͬ̽ͭ̂͌̾̀̀͟͠.̴̵̛̯̹͕̝͖̮͔̤̓̐̿̃́͛̌ͫ͆̄̃͛ͨ̿̓́͜.̡̧̬͕̭͚͙̠̼͍̞̹͙̫̞͈̤̫̀̔ͩ̒́͘̕.̹͔͎̟̞̗̻̫̳̯̣̣̻̫̺͇͖̘̯̑̀̏̋͋ͫ̄̒̈̔͌̇̆͐̕͝.̷̸̺̝̖̘̻̭͆͂ͧͧ͒̀̀̾ͬ̒̐ͣͅ.̍̂͒̊͒̏ͮ͛ͧͫͣ͑ͦ͊̐ͥ̍͏̷̭̜̖͉̠̹͉̙͓͕̝.̶̨̛̮̞̰̩̆ͬ̾ͩ̊̓̅̀.̴̫̤̮̝̺͈̯̼̼̟͓̫̗͈̻͖̜̘̒ͪ̏̂̿ͤ̃́͡.̭̖̼͓͎̲̯̻͕͑ͭ̈́͋̄̚̕͢ͅ.̡̘̪̟͓̺̰̘̖̼̺̿̋̆ͬͧ͗͑͋́̒̾͆͌ͪ̀̕.̵̷̡̠̰͕̰̦͍̃ͮ͐̋ͭ͐ͭ̔ͭͦ̓̀͋ͫ̊̉̅͞ͅ.̸̢̛̪̣̰͚̖̫̜͉̭̅̾̽̏̑̂̒̏̍ͨ̈͌̎͋̋̇͊̚͜͞.̸̡̡̟͚͍̞̜̺̲̑̈́͗́̎̐͋̀̒ͯ̀̚͞.̶́̋ͤ͋̽ͪͮ͒̓̀̀ͩ̋̍͑ͣ̏̈̚͝҉̵̤͙̦͉͇̮̪͠.͔̲̩̱̳̥̹͇̤͍͚̗̮̟̩̲ͭ̐̄͋̃̈́͋́ͪͯ͒̋͠.̇̾ͫͮͭ̔̐̀ͮͪ͌̃ͦ̏͂͗͏̶̵̫͍͎̦̞͈̥̖̼̭͔͎̖̀͢.̴̟͖͖̞̣̺̠̝͓̃͊ͤ͐̀ͮ̆ͩ̈́͆̇̈͑̚͢͜͡.̛͂͐͌́͠҉̢̥̼̙̗̘̭͚̯̫.̎ͥ̒ͣ̍̒̉ͤ͝͏͖͓̹̳̗̙͖͎̲̼͈͞.̴͖̘̰͍ͣ̑̏̒̓̀ͬ̔ͪͭ̒̑̽̌̽͘.͊̈́̾͋ͦ̂͏̺̫̩͚̫́͠ͅ.̸̶̴̛͈̰͕̯͎̞͕̺͕̭̘̠͓͎͉̓͑̎͌̂̏̔̇͠.̧͙͎̤͍̜̹̠̩̪͕̪͙͊͊̈̎̽̍ͧͫ̓̋̓̀͗̓̀ͫ̌͞ͅ.̄̉́ͤͮ͌͌ͥ͐̀ͦ͗̐̽ͧ̚̕҉̠̲̖̪̝̹̮̹̟͉͎̥͓̘̪̩̮̕ͅ.̸͈̮̞̙̭͎̟͎͓͓̽͂ͮ̔ͧ̃.̍̓̉͐̈̍ͨ̽ͧ͛ͤ̑͌͐̄ͤͪ͝҉̵̬̮͈͚̱͜.̛̉̎ͮ̅͝͏̭̰̰͔͇.̵̩̪̦̟̹̞͕̲̟̤͙̹̠͈͓̳̞͔̈́́ͩ̀͟͞.̴̸̨̛̯̦͇͖̞͍̳̤͈̝͇͎͎̩̙̤͈̏̒̐ͯ̓͊̋ͩ̒ͯ͆ͨ̐ͯ͌͒̚͜ͅ.͌͌͌͆ͤͮͯ̾͏̴͜҉̜͈̲̻̭̱͔̤͈͍͙̱̤̫͟.̢̛̼̞̞̞̳̙ͥ͒̍̾̓ͭ͗̉̈́ͨͤ̏̌͟͞.͌̓̈ͬͯͧ̐ͣ͛́ͤ̃ͩ̇̊̀͠͏͏̭̜̬̤.ͮ͛ͯ̂ͫͧ̂́͊̂͋͂ͦ̄̕҉̷̶͍͎̦͉̣́.̘̟͍̼̜͍̮̝̇͂͗ͥ̇͊́͑̂͊ͨ͋ͣ̀̚͘̕.̡̧̯̯͔̣͔̲͈͔̟͖̻̫̮̗̘ͦ̅̓ͯ̿̊̾ͯ̇̒̆̍̈̓.̡̧̨͖̙̬̝͕́͒̓̉̽̽̐̓̎̓ͪ̈̓̎̄̏̄̓͊.̶̳̪̲͉̮̦̫̓ͧͨ̾̈́̈́ͯ͆ͪ͐̅̂́̌͛͑ͩ̚.̷̠̟̘͇̙͇̱̹̎̍̍̅ͥ̿̃̌̔̚.̨̡̏ͮͮͤͩ̈́̉ͣͯ̏̇̆ͯ̽̃͗̄͆ͫ͜͏̖̣̭̗̮̖͓̪͈͔̱̱ͅ.̧̢̜̣̮̼̦̱͈̑̈ͫ́͛ͣ̀̀̓̒̿́̚͢͝.̛͔̹̖̻͈̲͚̤͋ͣ̿͋͡.̴͛͒͗̈̎ͣ̇ͧ̽̒̄̂̃̈́͐̽̚͏͢͏̮͍̗̰̫̟̰̼͇͚̭̠̜̪̜̭̜.̧̙͓̤͎̦͖̥̦̤̜̲̣͙̠̱̗̱̤͒̍̌ͣ͊ͩ̾̃͒́ͤ̾̕͟͠.̷̴̜̗͉̺̥̘̙̒͛̃ͨ͜.̲̤̣̀ͬ̔̂ͧ̈́̚͜͡.̨ͣ̎͆̂ͩͬͬ̾ͮ̽̓͘͏̡͙̞̜͍͎͕̯̜̙̘̣̰̞̳̫̥͡.̶̛̮̭̤͎̰̗͕̮̗̥̦̱̖̩͖̹̼̮ͯͪͭ̇́͑̀.̴̜͓̪͕̬͓̫͚̩̝̰͓͒͒̓̍̀ͫ͗͊ͤ̾̏̎̉ͤ͠.̵ͩ͊̒ͨ̍̋̎̋̿ͯ̍̊̒ͥ͂̎̀̕͏͙͙͉̹̮̖̭̮̠̭̬̻͙͎̮̗̼̭.̶̧̳̗͚͈̜͕̜̄̎͊̉̽͆͛ͪ̾̆̓̾̾̃ͥ́̕͝.̒̌ͦͥ̅̊͛ͫ͏̨͖̰̳̖̜͎̀.̵̙͓͎̣͓̞͎͐̈̓̀̂̂̂̂̍̊̀ͭ̾ͣ̀̕.̿͛̌͛̅͆̀͆ͧ̚҉̶̢̖̳̥̦͍̹̖̫̻̜͟.̸̷̛͇͙̜͍̲̳̥̎̍͋̒ͬͨ̿͒̎̈́ͪ͠ͅ.̔ͣͤ́̋ͧ̋̀̈́̔̒̓̂̒ͪͨ͏̵̭͇̩̗̠͖͎̪̺̲͕̗͓̕͜͡ͅ.̴̴̬̼̙̏ͤ̌̏͗ͦ̄͒ͯ̓̍̈́̍̐̀ͫͧ͌̕͜ͅ.͉̝̲͇̟̱̘̗͖̽ͨ̓̃͋ͮ̓̒͌ͬ̔́̌ͤ͜ͅ.͙̝͎͓̠̦̜͔̬̠̣̊̊͐͑̍́̿̑ͮ́͞.̷̨͇̫̙̰̘̞͔͎̦͚ͫͣͦ̑ͤ̿̕̕.̧̬̹͓̠̙̙͕̏̀̒̒̄̓͊ͮ̇ͮ̓ͭ̑͝.̡̢̣̗̫͚̯̉̓ͮͦ̽͑̊ͣͧ̽ͣ̔̍̿̽̍̅̚.̸̘̥̩̱͖̙̞͚͙̖͙̗͓̄̿ͦͯ̚̕.̘͈̱͔̲̑̄̂̓͗͊̔̆ͨͧ̓̊ͫ̕͢͝.̢̡̠͕̠̟̩͖͖̺̦̬͓̭͚͓̳ͣ̃ͧ̑̍̎̈́̉̏̍͑̓̈́͐̎͋͛͢͡͠ͅͅ .̶̷̷̩̬̣̮̦̣̪̗̙̺̞̱͙̰͉͍͚ͤ̀͋͗̿ͭ̐ͯ͑̊͆͗̾̂͋͌ͮ͘͝ͅ.̧͉͖̙͎̠̬̻̤͖͍̤̼̯ͥ̎̍̓͑̋͌ͧ̋͊̿̕͘͢͢.̷̧̛̛͇̜̯̳̥͇̤̗͇͛̃̍ͮͥ̇̎ͥ̐ͫͧ͆̽̍̅̈͗́̅.̶̵̪͚̘̖̰͇̭͙̩̟̭̟ͤ̓ͯ̍ͪ̀̑̓̐̓͢.̶̶̛̳̺̳̩͍̥̿ͮ̈́̓̆ͨ̎́ͬ̓ͯ.ͣͪ̄̿̐ͬ́͑͝͏̪̫̺̹̗͉͓̠̳̯͓̻͖̳.̶̸̰̟͉̠̯̤͇͈̅ͨͯ̐́ͅ.̡̨̛͍̹̥̣͉̖̬̹̟͍̰̯͖̯̳̗͉̭̓̌͊ͬ͢͡.̶̢̹̠̩͕̋͛̍͒͛̂ͨ̐͑̌̚.̵̧̛̦̫͔͚̤͈̠̩͈͚̼̬͇͎̗̱ͦͫͯ͋ͬͦ̄͠.̖̗͔͙͒̀ͭ͋̈̐ͫ̃̀̽ͣ̆̓ͯͬͪ̽́̚͟͟͞.̵̛̛̹̗̻̯̺͔̥̩̿ͫͫ̉ͨ͘͡.̈́̈̉ͨ͌̽̄ͯͭ̿͌̌͂̓̇̈́ͦ͏̶̧̬̬͉̫̣̘̥̝̟̝̯̮̝͇̣̀͝.̸̣̦̱͙̦̯̱̬̲͓̘ͬ͗̏́̌͆̆̅ͩ̉̒͗ͭ͘.̔ͥͦ̓̉̐̏̔̒̐̂ͭ̔͢͏̸̖̞̝̗̩̜̮̩̰̕.̛͚̲̱̦̺̦͑̌̒͊̀͜͟.̨͉̳̟̭͇͍̖͎̆͑́̌̄ͣ̒́̀́͟͞.̶̲̦̘͎͖͈͍͕͇̦̹̰͇̠ͪ͋̋̓̊ͬ̽ͮͧ͂̾̐̀͋̂̎ͫ̔̚͝ͅ.̸̛̬̠̟͎͔͖̹̞̯̗̣̮̼̖͕̈̀̈́̊͡.̵̡̺̝̞̯̞̬͗ͩ̃́͌ͤ̃͞ͅ.ͮ̏ͦͩ͝҉̢̖̱̻̱̫ͅ.̵̢͙̮̓͒̒ͯ̓̍͐ͣͪ͛͑ͦ̇̚͠͡͞ͅ.̵̷̵͍͚̯̪̬͙̭̲̻͚̣̭̻͎͔͇͈̫̐ͥ̃͊͌̓͗̽ͣ̚͡.̶̷̵̧̳̯̖̺̟̖̝̭̙͙͎̝͈̤̥ͭͮͧ͌̓̉̂̈́͝.̪̮̖̹͈͇̩̟͕̟̖͐ͦ͐̅ͤͣ̇̓͢͝͡.̶̢͕͎͎͍̠͓̙͈̺̪͖̦͋̒̅̏͛͊̂̀͘͟.̶̡̡̮̠̥ͭ͋̆͗̐̊ͮͧ͒̄̾̉̑̄͠ͅ.͇̩̙͔ͬͣ̽̏ͤͩ̈ͩ̇͐ͩ͒̉̓́̚͘͘͠.̷̹̠̙̻̥̤͚̦̠̯͓̲̙͚͙̌̽͒͂͌ͣͣ͗ͦ̎ͫͬ̽ͭ̂͌̾̀̀͟͠.̴̵̛̯̹͕̝͖̮͔̤̓̐̿̃́͛̌ͫ͆̄̃͛ͨ̿̓́͜.̡̧̬͕̭͚͙̠̼͍̞̹͙̫̞͈̤̫̀̔ͩ̒́͘̕.̹͔͎̟̞̗̻̫̳̯̣̣̻̫̺͇͖̘̯̑̀̏̋͋ͫ̄̒̈̔͌̇̆͐̕͝.̷̸̺̝̖̘̻̭͆͂ͧͧ͒̀̀̾ͬ̒̐ͣͅ.̍̂͒̊͒̏ͮ͛ͧͫͣ͑ͦ͊̐ͥ̍͏̷̭̜̖͉̠̹͉̙͓͕̝.̶̨̛̮̞̰̩̆ͬ̾ͩ̊̓̅̀.̴̫̤̮̝̺͈̯̼̼̟͓̫̗͈̻͖̜̘̒ͪ̏̂̿ͤ̃́͡.̭̖̼͓͎̲̯̻͕͑ͭ̈́͋̄̚̕͢ͅ.̡̘̪̟͓̺̰̘̖̼̺̿̋̆ͬͧ͗͑͋́̒̾͆͌ͪ̀̕.̵̷̡̠̰͕̰̦͍̃ͮ͐̋ͭ͐ͭ̔ͭͦ̓̀͋ͫ̊̉̅͞ͅ.̸̢̛̪̣̰͚̖̫̜͉̭̅̾̽̏̑̂̒̏̍ͨ̈͌̎͋̋̇͊̚͜͞.̸̡̡̟͚͍̞̜̺̲̑̈́͗́̎̐͋̀̒ͯ̀̚͞.̶́̋ͤ͋̽ͪͮ͒̓̀̀ͩ̋̍͑ͣ̏̈̚͝҉̵̤͙̦͉͇̮̪͠.͔̲̩̱̳̥̹͇̤͍͚̗̮̟̩̲ͭ̐̄͋̃̈́͋́ͪͯ͒̋͠.̇̾ͫͮͭ̔̐̀ͮͪ͌̃ͦ̏͂͗͏̶̵̫͍͎̦̞͈̥̖̼̭͔͎̖̀͢.̴̟͖͖̞̣̺̠̝͓̃͊ͤ͐̀ͮ̆ͩ̈́͆̇̈͑̚͢͜͡.̛͂͐͌́͠҉̢̥̼̙̗̘̭͚̯̫.̎ͥ̒ͣ̍̒̉ͤ͝͏͖͓̹̳̗̙͖͎̲̼͈͞.̴͖̘̰͍ͣ̑̏̒̓̀ͬ̔ͪͭ̒̑̽̌̽͘.͊̈́̾͋ͦ̂͏̺̫̩͚̫́͠ͅ.̸̶̴̛͈̰͕̯͎̞͕̺͕̭̘̠͓͎͉̓͑̎͌̂̏̔̇͠.̧͙͎̤͍̜̹̠̩̪͕̪͙͊͊̈̎̽̍ͧͫ̓̋̓̀͗̓̀ͫ̌͞ͅ.̄̉́ͤͮ͌͌ͥ͐̀ͦ͗̐̽ͧ̚̕҉̠̲̖̪̝̹̮̹̟͉͎̥͓̘̪̩̮̕ͅ.̸͈̮̞̙̭͎̟͎͓͓̽͂ͮ̔ͧ̃.̍̓̉͐̈̍ͨ̽ͧ͛ͤ̑͌͐̄ͤͪ͝҉̵̬̮͈͚̱͜.̛̉̎ͮ̅͝͏̭̰̰͔͇.̵̩̪̦̟̹̞͕̲̟̤͙̹̠͈͓̳̞͔̈́́ͩ̀͟͞.̴̸̨̛̯̦͇͖̞͍̳̤͈̝͇͎͎̩̙̤͈̏̒̐ͯ̓͊̋ͩ̒ͯ͆ͨ̐ͯ͌͒̚͜ͅ.͌͌͌͆ͤͮͯ̾͏̴͜҉̜͈̲̻̭̱͔̤͈͍͙̱̤̫͟.̢̛̼̞̞̞̳̙ͥ͒̍̾̓ͭ͗̉̈́ͨͤ̏̌͟͞.͌̓̈ͬͯͧ̐ͣ͛́ͤ̃ͩ̇̊̀͠͏͏̭̜̬̤.ͮ͛ͯ̂ͫͧ̂́͊̂͋͂ͦ̄̕҉̷̶͍͎̦͉̣́.̘̟͍̼̜͍̮̝̇͂͗ͥ̇͊́͑̂͊ͨ͋ͣ̀̚͘̕.̡̧̯̯͔̣͔̲͈͔̟͖̻̫̮̗̘ͦ̅̓ͯ̿̊̾ͯ̇̒̆̍̈̓.̡̧̨͖̙̬̝͕́͒̓̉̽̽̐̓̎̓ͪ̈̓̎̄̏̄̓͊.̶̳̪̲͉̮̦̫̓ͧͨ̾̈́̈́ͯ͆ͪ͐̅̂́̌͛͑ͩ̚.̷̠̟̘͇̙͇̱̹̎̍̍̅ͥ̿̃̌̔̚.̨̡̏ͮͮͤͩ̈́̉ͣͯ̏̇̆ͯ̽̃͗̄͆ͫ͜͏̖̣̭̗̮̖͓̪͈͔̱̱ͅ.̧̢̜̣̮̼̦̱͈̑̈ͫ́͛ͣ̀̀̓̒̿́̚͢͝.̛͔̹̖̻͈̲͚̤͋ͣ̿͋͡.̴͛͒͗̈̎ͣ̇ͧ̽̒̄̂̃̈́͐̽̚͏͢͏̮͍̗̰̫̟̰̼͇͚̭̠̜̪̜̭̜.̧̙͓̤͎̦͖̥̦̤̜̲̣͙̠̱̗̱̤͒̍̌ͣ͊ͩ̾̃͒́ͤ̾̕͟͠.̷̴̜̗͉̺̥̘̙̒͛̃ͨ͜.̲̤̣̀ͬ̔̂ͧ̈́̚͜͡.̨ͣ̎͆̂ͩͬͬ̾ͮ̽̓͘͏̡͙̞̜͍͎͕̯̜̙̘̣̰̞̳̫̥͡.̶̛̮̭̤͎̰̗͕̮̗̥̦̱̖̩͖̹̼̮ͯͪͭ̇́͑̀.̴̜͓̪͕̬͓̫͚̩̝̰͓͒͒̓̍̀ͫ͗͊ͤ̾̏̎̉ͤ͠.̵ͩ͊̒ͨ̍̋̎̋̿ͯ̍̊̒ͥ͂̎̀̕͏͙͙͉̹̮̖̭̮̠̭̬̻͙͎̮̗̼̭.̶̧̳̗͚͈̜͕̜̄̎͊̉̽͆͛ͪ̾̆̓̾̾̃ͥ́̕͝.̒̌ͦͥ̅̊͛ͫ͏̨͖̰̳̖̜͎̀.̵̙͓͎̣͓̞͎͐̈̓̀̂̂̂̂̍̊̀ͭ̾ͣ̀̕.̿͛̌͛̅͆̀͆ͧ̚҉̶̢̖̳̥̦͍̹̖̫̻̜͟.̸̷̛͇͙̜͍̲̳̥̎̍͋̒ͬͨ̿͒̎̈́ͪ͠ͅ.̔ͣͤ́̋ͧ̋̀̈́̔̒̓̂̒ͪͨ͏̵̭͇̩̗̠͖͎̪̺̲͕̗͓̕͜͡ͅ.̴̴̬̼̙̏ͤ̌̏͗ͦ̄͒ͯ̓̍̈́̍̐̀ͫͧ͌̕͜ͅ.͉̝̲͇̟̱̘̗͖̽ͨ̓̃͋ͮ̓̒͌ͬ̔́̌ͤ͜ͅ.͙̝͎͓̠̦̜͔̬̠̣̊̊͐͑̍́̿̑ͮ́͞.̷̨͇̫̙̰̘̞͔͎̦͚ͫͣͦ̑ͤ̿̕̕.̧̬̹͓̠̙̙͕̏̀̒̒̄̓͊ͮ̇ͮ̓ͭ̑͝.̡̢̣̗̫͚̯̉̓ͮͦ̽͑̊ͣͧ̽ͣ̔̍̿̽̍̅̚.̸̘̥̩̱͖̙̞͚͙̖͙̗͓̄̿ͦͯ̚̕.̘͈̱͔̲̑̄̂̓͗͊̔̆ͨͧ̓̊ͫ̕͢͝.̢̡̠͕̠̟̩͖͖̺̦̬͓̭͚͓̳ͣ̃ͧ̑̍̎̈́̉̏̍͑̓̈́͐̎͋͛͢͡͠ͅͅ .̶̷̷̩̬̣̮̦̣̪̗̙̺̞̱͙̰͉͍͚ͤ̀͋͗̿ͭ̐ͯ͑̊͆͗̾̂͋͌ͮ͘͝ͅ.̧͉͖̙͎̠̬̻̤͖͍̤̼̯ͥ̎̍̓͑̋͌ͧ̋͊̿̕͘͢͢.̷̧̛̛͇̜̯̳̥͇̤̗͇͛̃̍ͮͥ̇̎ͥ̐ͫͧ͆̽̍̅̈͗́̅.̶̵̪͚̘̖̰͇̭͙̩̟̭̟ͤ̓ͯ̍ͪ̀̑̓̐̓͢.̶̶̛̳̺̳̩͍̥̿ͮ̈́̓̆ͨ̎́ͬ̓ͯ.ͣͪ̄̿̐ͬ́͑͝͏̪̫̺̹̗͉͓̠̳̯͓̻͖̳.̶̸̰̟͉̠̯̤͇͈̅ͨͯ̐́ͅ.̡̨̛͍̹̥̣͉̖̬̹̟͍̰̯͖̯̳̗͉̭̓̌͊ͬ͢͡.̶̢̹̠̩͕̋͛̍͒͛̂ͨ̐͑̌̚.̵̧̛̦̫͔͚̤͈̠̩͈͚̼̬͇͎̗̱ͦͫͯ͋ͬͦ̄͠.̖̗͔͙͒̀ͭ͋̈̐ͫ̃̀̽ͣ̆̓ͯͬͪ̽́̚͟͟͞.̵̛̛̹̗̻̯̺͔̥̩̿ͫͫ̉ͨ͘͡.̈́̈̉ͨ͌̽̄ͯͭ̿͌̌͂̓̇̈́ͦ͏̶̧̬̬͉̫̣̘̥̝̟̝̯̮̝͇̣̀͝.̸̣̦̱͙̦̯̱̬̲͓̘ͬ͗̏́̌͆̆̅ͩ̉̒͗ͭ͘.̔ͥͦ̓̉̐̏̔̒̐̂ͭ̔͢͏̸̖̞̝̗̩̜̮̩̰̕.̛͚̲̱̦̺̦͑̌̒͊̀͜͟.̨͉̳̟̭͇͍̖͎̆͑́̌̄ͣ̒́̀́͟͞.̶̲̦̘͎͖͈͍͕͇̦̹̰͇̠ͪ͋̋̓̊ͬ̽ͮͧ͂̾̐̀͋̂̎ͫ̔̚͝ͅ.̸̛̬̠̟͎͔͖̹̞̯̗̣̮̼̖͕̈̀̈́̊͡.̵̡̺̝̞̯̞̬͗ͩ̃́͌ͤ̃͞ͅ.ͮ̏ͦͩ͝҉̢̖̱̻̱̫ͅ.̵̢͙̮̓͒̒ͯ̓̍͐ͣͪ͛͑ͦ̇̚͠͡͞ͅ.̵̷̵͍͚̯̪̬͙̭̲̻͚̣̭̻͎͔͇͈̫̐ͥ̃͊͌̓͗̽ͣ̚͡.̶̷̵̧̳̯̖̺̟̖̝̭̙͙͎̝͈̤̥ͭͮͧ͌̓̉̂̈́͝.̪̮̖̹͈͇̩̟͕̟̖͐ͦ͐̅ͤͣ̇̓͢͝͡.̶̢͕͎͎͍̠͓̙͈̺̪͖̦͋̒̅̏͛͊̂̀͘͟.̶̡̡̮̠̥ͭ͋̆͗̐̊ͮͧ͒̄̾̉̑̄͠ͅ.͇̩̙͔ͬͣ̽̏ͤͩ̈ͩ̇͐ͩ͒̉̓́̚͘͘͠.̷̹̠̙̻̥̤͚̦̠̯͓̲̙͚͙̌̽͒͂͌ͣͣ͗ͦ̎ͫͬ̽ͭ̂͌̾̀̀͟͠.̴̵̛̯̹͕̝͖̮͔̤̓̐̿̃́͛̌ͫ͆̄̃͛ͨ̿̓́͜.̡̧̬͕̭͚͙̠̼͍̞̹͙̫̞͈̤̫̀̔ͩ̒́͘̕.̹͔͎̟̞̗̻̫̳̯̣̣̻̫̺͇͖̘̯̑̀̏̋͋ͫ̄̒̈̔͌̇̆͐̕͝.̷̸̺̝̖̘̻̭͆͂ͧͧ͒̀̀̾ͬ̒̐ͣͅ.̍̂͒̊͒̏ͮ͛ͧͫͣ͑ͦ͊̐ͥ̍͏̷̭̜̖͉̠̹͉̙͓͕̝.̶̨̛̮̞̰̩̆ͬ̾ͩ̊̓̅̀.̴̫̤̮̝̺͈̯̼̼̟͓̫̗͈̻͖̜̘̒ͪ̏̂̿ͤ̃́͡.̭̖̼͓͎̲̯̻͕͑ͭ̈́͋̄̚̕͢ͅ.̡̘̪̟͓̺̰̘̖̼̺̿̋̆ͬͧ͗͑͋́̒̾͆͌ͪ̀̕.̵̷̡̠̰͕̰̦͍̃ͮ͐̋ͭ͐ͭ̔ͭͦ̓̀͋ͫ̊̉̅͞ͅ.̸̢̛̪̣̰͚̖̫̜͉̭̅̾̽̏̑̂̒̏̍ͨ̈͌̎͋̋̇͊̚͜͞.̸̡̡̟͚͍̞̜̺̲̑̈́͗́̎̐͋̀̒ͯ̀̚͞.̶́̋ͤ͋̽ͪͮ͒̓̀̀ͩ̋̍͑ͣ̏̈̚͝҉̵̤͙̦͉͇̮̪͠.͔̲̩̱̳̥̹͇̤͍͚̗̮̟̩̲ͭ̐̄͋̃̈́͋́ͪͯ͒̋͠.̇̾ͫͮͭ̔̐̀ͮͪ͌̃ͦ̏͂͗͏̶̵̫͍͎̦̞͈̥̖̼̭͔͎̖̀͢.̴̟͖͖̞̣̺̠̝͓̃͊ͤ͐̀ͮ̆ͩ̈́͆̇̈͑̚͢͜͡.̛͂͐͌́͠҉̢̥̼̙̗̘̭͚̯̫.̎ͥ̒ͣ̍̒̉ͤ͝͏͖͓̹̳̗̙͖͎̲̼͈͞.̴͖̘̰͍ͣ̑̏̒̓̀ͬ̔ͪͭ̒̑̽̌̽͘.͊̈́̾͋ͦ̂͏̺̫̩͚̫́͠ͅ.̸̶̴̛͈̰͕̯͎̞͕̺͕̭̘̠͓͎͉̓͑̎͌̂̏̔̇͠.̧͙͎̤͍̜̹̠̩̪͕̪͙͊͊̈̎̽̍ͧͫ̓̋̓̀͗̓̀ͫ̌͞ͅ.̄̉́ͤͮ͌͌ͥ͐̀ͦ͗̐̽ͧ̚̕҉̠̲̖̪̝̹̮̹̟͉͎̥͓̘̪̩̮̕ͅ.̸͈̮̞̙̭͎̟͎͓͓̽͂ͮ̔ͧ̃.̍̓̉͐̈̍ͨ̽ͧ͛ͤ̑͌͐̄ͤͪ͝҉̵̬̮͈͚̱͜.̛̉̎ͮ̅͝͏̭̰̰͔͇.̵̩̪̦̟̹̞͕̲̟̤͙̹̠͈͓̳̞͔̈́́ͩ̀͟͞.̴̸̨̛̯̦͇͖̞͍̳̤͈̝͇͎͎̩̙̤͈̏̒̐ͯ̓͊̋ͩ̒ͯ͆ͨ̐ͯ͌͒̚͜ͅ.͌͌͌͆ͤͮͯ̾͏̴͜҉̜͈̲̻̭̱͔̤͈͍͙̱̤̫͟.̢̛̼̞̞̞̳̙ͥ͒̍̾̓ͭ͗̉̈́ͨͤ̏̌͟͞.͌̓̈ͬͯͧ̐ͣ͛́ͤ̃ͩ̇̊̀͠͏͏̭̜̬̤.ͮ͛ͯ̂ͫͧ̂́͊̂͋͂ͦ̄̕҉̷̶͍͎̦͉̣́.̘̟͍̼̜͍̮̝̇͂͗ͥ̇͊́͑̂͊ͨ͋ͣ̀̚͘̕.̡̧̯̯͔̣͔̲͈͔̟͖̻̫̮̗̘ͦ̅̓ͯ̿̊̾ͯ̇̒̆̍̈̓.̡̧̨͖̙̬̝͕́͒̓̉̽̽̐̓̎̓ͪ̈̓̎̄̏̄̓͊.̶̳̪̲͉̮̦̫̓ͧͨ̾̈́̈́ͯ͆ͪ͐̅̂́̌͛͑ͩ̚.̷̠̟̘͇̙͇̱̹̎̍̍̅ͥ̿̃̌̔̚.̨̡̏ͮͮͤͩ̈́̉ͣͯ̏̇̆ͯ̽̃͗̄͆ͫ͜͏̖̣̭̗̮̖͓̪͈͔̱̱ͅ.̧̢̜̣̮̼̦̱͈̑̈ͫ́͛ͣ̀̀̓̒̿́̚͢͝.̛͔̹̖̻͈̲͚̤͋ͣ̿͋͡.̴͛͒͗̈̎ͣ̇ͧ̽̒̄̂̃̈́͐̽̚͏͢͏̮͍̗̰̫̟̰̼͇͚̭̠̜̪̜̭̜.̧̙͓̤͎̦͖̥̦̤̜̲̣͙̠̱̗̱̤͒̍̌ͣ͊ͩ̾̃͒́ͤ̾̕͟͠.̷̴̜̗͉̺̥̘̙̒͛̃ͨ͜.̲̤̣̀ͬ̔̂ͧ̈́̚͜͡.̨ͣ̎͆̂ͩͬͬ̾ͮ̽̓͘͏̡͙̞̜͍͎͕̯̜̙̘̣̰̞̳̫̥͡.̶̛̮̭̤͎̰̗͕̮̗̥̦̱̖̩͖̹̼̮ͯͪͭ̇́͑̀.̴̜͓̪͕̬͓̫͚̩̝̰͓͒͒̓̍̀ͫ͗͊ͤ̾̏̎̉ͤ͠.̵ͩ͊̒ͨ̍̋̎̋̿ͯ̍̊̒ͥ͂̎̀̕͏͙͙͉̹̮̖̭̮̠̭̬̻͙͎̮̗̼̭.̶̧̳̗͚͈̜͕̜̄̎͊̉̽͆͛ͪ̾̆̓̾̾̃ͥ́̕͝.̒̌ͦͥ̅̊͛ͫ͏̨͖̰̳̖̜͎̀.̵̙͓͎̣͓̞͎͐̈̓̀̂̂̂̂̍̊̀ͭ̾ͣ̀̕.̿͛̌͛̅͆̀͆ͧ̚҉̶̢̖̳̥̦͍̹̖̫̻̜͟.̸̷̛͇͙̜͍̲̳̥̎̍͋̒ͬͨ̿͒̎̈́ͪ͠ͅ.̔ͣͤ́̋ͧ̋̀̈́̔̒̓̂̒ͪͨ͏̵̭͇̩̗̠͖͎̪̺̲͕̗͓̕͜͡ͅ.̴̴̬̼̙̏ͤ̌̏͗ͦ̄͒ͯ̓̍̈́̍̐̀ͫͧ͌̕͜ͅ.͉̝̲͇̟̱̘̗͖̽ͨ̓̃͋ͮ̓̒͌ͬ̔́̌ͤ͜ͅ.͙̝͎͓̠̦̜͔̬̠̣̊̊͐͑̍́̿̑ͮ́͞.̷̨͇̫̙̰̘̞͔͎̦͚ͫͣͦ̑ͤ̿̕̕.̧̬̹͓̠̙̙͕̏̀̒̒̄̓͊ͮ̇ͮ̓ͭ̑͝.̡̢̣̗̫͚̯̉̓ͮͦ̽͑̊ͣͧ̽ͣ̔̍̿̽̍̅̚.̸̘̥̩̱͖̙̞͚͙̖͙̗͓̄̿ͦͯ̚̕.̘͈̱͔̲̑̄̂̓͗͊̔̆ͨͧ̓̊ͫ̕͢͝.̢̡̠͕̠̟̩͖͖̺̦̬͓̭͚͓̳ͣ̃ͧ̑̍̎̈́̉̏̍͑̓̈́͐̎͋͛͢͡͠ͅͅ .̶̷̷̩̬̣̮̦̣̪̗̙̺̞̱͙̰͉͍͚ͤ̀͋͗̿ͭ̐ͯ͑̊͆͗̾̂͋͌ͮ͘͝ͅ.̧͉͖̙͎̠̬̻̤͖͍̤̼̯ͥ̎̍̓͑̋͌ͧ̋͊̿̕͘͢͢.̷̧̛̛͇̜̯̳̥͇̤̗͇͛̃̍ͮͥ̇̎ͥ̐ͫͧ͆̽̍̅̈͗́̅.̶̵̪͚̘̖̰͇̭͙̩̟̭̟ͤ̓ͯ̍ͪ̀̑̓̐̓͢.̶̶̛̳̺̳̩͍̥̿ͮ̈́̓̆ͨ̎́ͬ̓ͯ.ͣͪ̄̿̐ͬ́͑͝͏̪̫̺̹̗͉͓̠̳̯͓̻͖̳.̶̸̰̟͉̠̯̤͇͈̅ͨͯ̐́ͅ.̡̨̛͍̹̥̣͉̖̬̹̟͍̰̯͖̯̳̗͉̭̓̌͊ͬ͢͡.̶̢̹̠̩͕̋͛̍͒͛̂ͨ̐͑̌̚.̵̧̛̦̫͔͚̤͈̠̩͈͚̼̬͇͎̗̱ͦͫͯ͋ͬͦ̄͠.̖̗͔͙͒̀ͭ͋̈̐ͫ̃̀̽ͣ̆̓ͯͬͪ̽́̚͟͟͞.̵̛̛̹̗̻̯̺͔̥̩̿ͫͫ̉ͨ͘͡.̈́̈̉ͨ͌̽̄ͯͭ̿͌̌͂̓̇̈́ͦ͏̶̧̬̬͉̫̣̘̥̝̟̝̯̮̝͇̣̀͝.̸̣̦̱͙̦̯̱̬̲͓̘ͬ͗̏́̌͆̆̅ͩ̉̒͗ͭ͘.̔ͥͦ̓̉̐̏̔̒̐̂ͭ̔͢͏̸̖̞̝̗̩̜̮̩̰̕.̛͚̲̱̦̺̦͑̌̒͊̀͜͟.̨͉̳̟̭͇͍̖͎̆͑́̌̄ͣ̒́̀́͟͞.̶̲̦̘͎͖͈͍͕͇̦̹̰͇̠ͪ͋̋̓̊ͬ̽ͮͧ͂̾̐̀͋̂̎ͫ̔̚͝ͅ.̸̛̬̠̟͎͔͖̹̞̯̗̣̮̼̖͕̈̀̈́̊͡.̵̡̺̝̞̯̞̬͗ͩ̃́͌ͤ̃͞ͅ.ͮ̏ͦͩ͝҉̢̖̱̻̱̫ͅ.̵̢͙̮̓͒̒ͯ̓̍͐ͣͪ͛͑ͦ̇̚͠͡͞ͅ.̵̷̵͍͚̯̪̬͙̭̲̻͚̣̭̻͎͔͇͈̫̐ͥ̃͊͌̓͗̽ͣ̚͡.̶̷̵̧̳̯̖̺̟̖̝̭̙͙͎̝͈̤̥ͭͮͧ͌̓̉̂̈́͝.̪̮̖̹͈͇̩̟͕̟̖͐ͦ͐̅ͤͣ̇̓͢͝͡.̶̢͕͎͎͍̠͓̙͈̺̪͖̦͋̒̅̏͛͊̂̀͘͟.̶̡̡̮̠̥ͭ͋̆͗̐̊ͮͧ͒̄̾̉̑̄͠ͅ.͇̩̙͔ͬͣ̽̏ͤͩ̈ͩ̇͐ͩ͒̉̓́̚͘͘͠.̷̹̠̙̻̥̤͚̦̠̯͓̲̙͚͙̌̽͒͂͌ͣͣ͗ͦ̎ͫͬ̽ͭ̂͌̾̀̀͟͠.̴̵̛̯̹͕̝͖̮͔̤̓̐̿̃́͛̌ͫ͆̄̃͛ͨ̿̓́͜.̡̧̬͕̭͚͙̠̼͍̞̹͙̫̞͈̤̫̀̔ͩ̒́͘̕.̹͔͎̟̞̗̻̫̳̯̣̣̻̫̺͇͖̘̯̑̀̏̋͋ͫ̄̒̈̔͌̇̆͐̕͝.̷̸̺̝̖̘̻̭͆͂ͧͧ͒̀̀̾ͬ̒̐ͣͅ.̍̂͒̊͒̏ͮ͛ͧͫͣ͑ͦ͊̐ͥ̍͏̷̭̜̖͉̠̹͉̙͓͕̝.̶̨̛̮̞̰̩̆ͬ̾ͩ̊̓̅̀.̴̫̤̮̝̺͈̯̼̼̟͓̫̗͈̻͖̜̘̒ͪ̏̂̿ͤ̃́͡.̭̖̼͓͎̲̯̻͕͑ͭ̈́͋̄̚̕͢ͅ.̡̘̪̟͓̺̰̘̖̼̺̿̋̆ͬͧ͗͑͋́̒̾͆͌ͪ̀̕.̵̷̡̠̰͕̰̦͍̃ͮ͐̋ͭ͐ͭ̔ͭͦ̓̀͋ͫ̊̉̅͞ͅ.̸̢̛̪̣̰͚̖̫̜͉̭̅̾̽̏̑̂̒̏̍ͨ̈͌̎͋̋̇͊̚͜͞.̸̡̡̟͚͍̞̜̺̲̑̈́͗́̎̐͋̀̒ͯ̀̚͞.̶́̋ͤ͋̽ͪͮ͒̓̀̀ͩ̋̍͑ͣ̏̈̚͝҉̵̤͙̦͉͇̮̪͠.͔̲̩̱̳̥̹͇̤͍͚̗̮̟̩̲ͭ̐̄͋̃̈́͋́ͪͯ͒̋͠.̇̾ͫͮͭ̔̐̀ͮͪ͌̃ͦ̏͂͗͏̶̵̫͍͎̦̞͈̥̖̼̭͔͎̖̀͢.̴̟͖͖̞̣̺̠̝͓̃͊ͤ͐̀ͮ̆ͩ̈́͆̇̈͑̚͢͜͡.̛͂͐͌́͠҉̢̥̼̙̗̘̭͚̯̫.̎ͥ̒ͣ̍̒̉ͤ͝͏͖͓̹̳̗̙͖͎̲̼͈͞.̴͖̘̰͍ͣ̑̏̒̓̀ͬ̔ͪͭ̒̑̽̌̽͘.͊̈́̾͋ͦ̂͏̺̫̩͚̫́͠ͅ.̸̶̴̛͈̰͕̯͎̞͕̺͕̭̘̠͓͎͉̓͑̎͌̂̏̔̇͠.̧͙͎̤͍̜̹̠̩̪͕̪͙͊͊̈̎̽̍ͧͫ̓̋̓̀͗̓̀ͫ̌͞ͅ.̄̉́ͤͮ͌͌ͥ͐̀ͦ͗̐̽ͧ̚̕҉̠̲̖̪̝̹̮̹̟͉͎̥͓̘̪̩̮̕ͅ.̸͈̮̞̙̭͎̟͎͓͓̽͂ͮ̔ͧ̃.̍̓̉͐̈̍ͨ̽ͧ͛ͤ̑͌͐̄ͤͪ͝҉̵̬̮͈͚̱͜.̛̉̎ͮ̅͝͏̭̰̰͔͇.̵̩̪̦̟̹̞͕̲̟̤͙̹̠͈͓̳̞͔̈́́ͩ̀͟͞.̴̸̨̛̯̦͇͖̞͍̳̤͈̝͇͎͎̩̙̤͈̏̒̐ͯ̓͊̋ͩ̒ͯ͆ͨ̐ͯ͌͒̚͜ͅ.͌͌͌͆ͤͮͯ̾͏̴͜҉̜͈̲̻̭̱͔̤͈͍͙̱̤̫͟.̢̛̼̞̞̞̳̙ͥ͒̍̾̓ͭ͗̉̈́ͨͤ̏̌͟͞.͌̓̈ͬͯͧ̐ͣ͛́ͤ̃ͩ̇̊̀͠͏͏̭̜̬̤.ͮ͛ͯ̂ͫͧ̂́͊̂͋͂ͦ̄̕҉̷̶͍͎̦͉̣́.̘̟͍̼̜͍̮̝̇͂͗ͥ̇͊́͑̂͊ͨ͋ͣ̀̚͘̕.̡̧̯̯͔̣͔̲͈͔̟͖̻̫̮̗̘ͦ̅̓ͯ̿̊̾ͯ̇̒̆̍̈̓.̡̧̨͖̙̬̝͕́͒̓̉̽̽̐̓̎̓ͪ̈̓̎̄̏̄̓͊\n^((trimmed due to comment size limit)^)",
            "Can’t wait to use this everyday, everywhere.",
            "I would love to know the original thread.",
            "Bruh I think we need the source to the gay furry porn in question",
            "Link",
            "If you fuck real animals dressed as an animal, are you still a furry? Asking for a friend.",
            "This but unironically",
            "Have you ever heard the tragedy of Darth Plagueis the Wise? I thought not. It's not a story the Jedi would tell you. It's a Sith legend. Darth Plagueis was a Dark Lord of the Sith, so powerful and so wise he could use the Force to influence the midichlorians to create life. He had such a knowledge of the dark side that he could even keep the ones he cared about from dying. The dark side of the Force is a pathway to many abilities some consider to be unnatural. He became so powerful, the only thing he was afraid of was losing his power, which eventually, of course, he did. Unfortunately, he taught his apprentice everything he knew, then his apprentice killed him in his sleep. Ironic... He could save others from death, but not himself.",
            "Was that comic porn or????",
            "Gay",
            "What is the original thread",
            "Link?",
            "[deleted]",
            "god",
            "God",
            "Cock",
            "NTA Your body your rules",
            "i thought",
            "i love this sibrebbit",
            "[deleted]",
            "This but unironically",
            "[removed]"
        ]
    },
    {
        "post_id": "tpicl5",
        "author": "None",
        "title": "My penis",
        "url": "https://www.reddit.com/r/copypasta/comments/tpicl5/my_penis/",
        "score": 5755,
        "num_comments": 216,
        "created_utc": 1648381857.0,
        "selftext": "\nEver since I was a wee lad, I noticed my penis was a bit large. I thought it was normal, untill my mom bathed me with my brother and I saw his little wee wee compared to mine, I couldn't help but point at it and mock it. A few months later when I started kindergarden, the teacher inspected our cocks for the monthly cock inspection, and noticed my large dick. I was very young but I could still see he was very envyous of my humongous cock, knowing he will never be as big, he called my mom and told her a doctor should see my penis. The doctor said he had never seen such an amazing specimen of a dong, that was the first moment I saw pride in my mom's eyes. I cherish these memories, as the cock inspection was the pinnacle of any month for me, seeing all the other pathetic little weiners. I loved watching the other kids take quick glances of my cock in fear and shame.\n\nA few years later when I was about 11 years old, my penis has started to become a burden for me. Having a 24.089 inch dick in 6th grade is no joke, I had to come up with creative ideas of where to hide the magnificent beast. Usually I hid it inside the right leg of my pants, kids always thought it was weird how my right leg was so \"muscular\" compared to my other, which meant I had to workout only my left leg in order to not arouse suspicion. I remember I went home depressed one day, crying to god on why did he curse me with such a shaft. I was tearing my pants with anger, when I started to feel tingly sensation in my penis. I started rubbing it, and suddenly it GREW EVEN LONGER, I was devestated because I thought it was already too large, but the feeling I had when I was rubbing it was too good to stop. I started holding it with both my hands and stroking it, but it was not enough, I could not satisfy my monster with mere hands, so I began using my feet too. The feeling was incredible, god was on my side again. As I was rubbing it faster and faster, I thought of my science teacher. My cock was throbbing, my nipples erect, my eyes wide and open. I was on my bed at the time, and I felt my Johnson about to erupt with tremendous force, I didn't know what to do so I hid under the bed, and then I came. It was like 4th of july. At first the stream was steady, of white cream in about 1 liter per second, then it was chaos. My penis was going up and down dancing with explosions of cum(Only later that day I found out my grandpa died at that moment of a heart attack because the sounds reminded him of bastogne when he was fighting the Germans). After a few second I realized I might drown because my juice covered the whole floor about two inch deep, I quickly slid across pools of cum gasping for air, I stood up and finally my cum gun started to relax. My mom came into the room shocked and disgusted, she yelled at me that I must see a doctor and get my manhood shortend or even removed. We had a fight for about three hours not noticing my grandpa was awfully quiet.\n\nThe day after my grandfather's funeral, I came to the doctor's office, and told him my story. After a lengthy cock inspection, he said that I have a rare condition, which makes my cock grow exponentially with each year, width and length. He calculated that my cock would weigh 200 kg when I turn 30, which is about the maximum weight my spine can support, beyond that and it would fracture and I'll die. I asked him if I could remove it, but he said no because I would die of blood loss. He also said I need to do blood transfusions everyday to feed my absolute unit of a scholng the blood it needs. Needless to say I was devestated, my once blessing, became a curse, again.\n\nOne day when I was 16, I was in my math class when I heard a terrible noise, it reminded me of the first time I was beating my meat, but it turns out it was just a gunshot. Kids all around me where shouting that there was a school shooter. I immediately got up and ran to the door, carrying my pack with my hands. Suddenly I heard shots very close to my ears, and saw dead bodies on the ground, so I ran into the closest door which was the janitor's room, closed the door and hid under the table making as little noise as possible. Little did I know, my crush was under the same table, hiding there in fear, when she saw me she almost screamed, but I put my hand over her mouth and told her to be quiet. I heard the shooter opening the door slowly and looking for me. I was completely silent, but then I noticed my crush's incredible bajongas, and I felt my cock starting to throb and expand. She seemed to notice, and I could see that she was impressed with my goofy goober. Her facial expression made my ding dong enlarge even more and I could feel my pants starting to tear apart. My shclong abong seemed to send electro-magnetic waves all over the room because the light above us started to flicker with every throb of my cock. The shooter noticed that and walked to our table. I knew I had to do something quickly or me, my crush, and my beaver basher would all die. Then it hit me, and I knew what I had to do. I looked over to my crush, and I started playing with her milkers. At first she was trying to resist, but then she figured out what I was trying to do and played along. My cock grew more and more, and when I felt it about to burst out of my pants. I got up and looked straight at the shooter. He hesitated for a single moment, which cost him his life. My pants exploded as my sexcalibur shot out a single hardened white cum shaped like a 7.62 mm sniper bullet right into the shooter's head. I was about to celebrate but then I noticed the smell of smoke in the air, turns out my massive cock shot not only the shooter, but also a gas pipe that was in the vicinity. Fire was all around us, as I held my crush close, I knew there was no way both of us would get out of there, so there was only one option. \"Get in!\" I said. \"What?\" She asked. \"Get in! There is no time!\" I said and pointed to my foreskin. She climbed inside the pocket between my foreskin and my cock. And I started running, breathing smoke and caughing, kicking doors and running through hallways, longing for fresh air. Finally I got out of the school, and I saw everyone looking at me and my dong. I slowly walked to the benches, and sat down to breath. Then I saw my crush's mother, and she asked me where her daughter is. I got up, and said \"I know where she is!\". I pulled my foreskin and there she was. I expected to hear claps and cheers, but when I didn't, I looked at my crush and saw she was dead. Turns out she suffocated inside my yogurt hose. The police arrested me, and here I am, with my massive schlong and 15 years in prison.\n\nIf your penis is small, do not despair, for at least you did not have to go through what I did. Farewell.",
        "permalink": "/r/copypasta/comments/tpicl5/my_penis/",
        "comments": [
            "Why do i exclusively love reading copypastas but anything else no",
            "This is gold",
            "what in the actual",
            "My penis by C4ActhaupYT",
            "Modern version of the Iliad",
            "what a day to be alive",
            "Literary masterpiece",
            "Best penis story I've ever read",
            "🐓",
            "What the fuck",
            "I think I almost died reading this",
            "Why did I read the entire thing \nWhat?\n\n⣿ ⠉⠉⠉⣿⡿⠿⠛⠋⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⠉⣻⣩⣉⠉⠉ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣀⣀⣀⣀⣀⣀⡀⠄⠄⠉⠉⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣠⣶⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣶⣤⠄⠄⠄⠄ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⢤⣾⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡀⠄⠄⠄ ⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠄⠉⠉⠉⣋⠉⠉⠉⠉⠉⠉⠉⠉⠙⠛⢷⡀⠄⠄ ⣿⡄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠠⣾⣿⣷⣄⣀⣀⣀⣠⣄⣢⣤⣤⣾⣿⡀⠄ ⣿⠃⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣹⣿⣿⡿⠿⣿⣿⣿⣿⣿⣿⣿⣿⢟⢁⣠ ⣿⣿⣄⣀⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠉⠉⣉⣉⣰⣿⣿⣿⣿⣷⣥⡀⠉⢁⡥⠈ ⣿⣿⣿⢹⣇⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠒⠛⠛⠋⠉⠉⠛⢻⣿⣿⣷⢀⡭⣤⠄ ⣿⣿⣿⡼⣿⠷⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⢀⣀⣠⣿⣟⢷⢾⣊⠄⠄ ⠉⠉⠁⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠈⣈⣉⣭⣽⡿⠟⢉⢴⣿⡇⣺⣿⣷ ⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠁⠐⢊⣡⣴⣾⣥⣿⣿⣿ ⣿",
            "Ever since I was a wee lad, I noticed my penis was a bit large. I thought it was normal, untill my mom bathed me with my brother and I saw his little wee wee compared to mine, I couldn't help but point at it and mock it. A few months later when I started kindergarden, the teacher inspected our cocks for the monthly cock inspection, and noticed my large dick. I was very young but I could still see he was very envyous of my humongous cock, knowing he will never be as big, he called my mom and told her a doctor should see my penis. The doctor said he had never seen such an amazing specimen of a dong, that was the first moment I saw pride in my mom's eyes. I cherish these memories, as the cock inspection was the pinnacle of any month for me, seeing all the other pathetic little weiners. I loved watching the other kids take quick glances of my cock in fear and shame.\n\nA few years later when I was about 11 years old, my penis has started to become a burden for me. Having a 24.089 inch dick in 6th grade is no joke, I had to come up with creative ideas of where to hide the magnificent beast. Usually I hid it inside the right leg of my pants, kids always thought it was weird how my right leg was so \"muscular\" compared to my other, which meant I had to workout only my left leg in order to not arouse suspicion. I remember I went home depressed one day, crying to god on why did he curse me with such a shaft. I was tearing my pants with anger, when I started to feel tingly sensation in my penis. I started rubbing it, and suddenly it GREW EVEN LONGER, I was devestated because I thought it was already too large, but the feeling I had when I was rubbing it was too good to stop. I started holding it with both my hands and stroking it, but it was not enough, I could not satisfy my monster with mere hands, so I began using my feet too. The feeling was incredible, god was on my side again. As I was rubbing it faster and faster, I thought of my science teacher. My cock was throbbing, my nipples erect, my eyes wide and open. I was on my bed at the time, and I felt my Johnson about to erupt with tremendous force, I didn't know what to do so I hid under the bed, and then I came. It was like 4th of july. At first the stream was steady, of white cream in about 1 liter per second, then it was chaos. My penis was going up and down dancing with explosions of cum(Only later that day I found out my grandpa died at that moment of a heart attack because the sounds reminded him of bastogne when he was fighting the Germans). After a few second I realized I might drown because my juice covered the whole floor about two inch deep, I quickly slid across pools of cum gasping for air, I stood up and finally my cum gun started to relax. My mom came into the room shocked and disgusted, she yelled at me that I must see a doctor and get my manhood shortend or even removed. We had a fight for about three hours not noticing my grandpa was awfully quiet.\n\nThe day after my grandfather's funeral, I came to the doctor's office, and told him my story. After a lengthy cock inspection, he said that I have a rare condition, which makes my cock grow exponentially with each year, width and length. He calculated that my cock would weigh 200 kg when I turn 30, which is about the maximum weight my spine can support, beyond that and it would fracture and I'll die. I asked him if I could remove it, but he said no because I would die of blood loss. He also said I need to do blood transfusions everyday to feed my absolute unit of a scholng the blood it needs. Needless to say I was devestated, my once blessing, became a curse, again.\n\nOne day when I was 16, I was in my math class when I heard a terrible noise, it reminded me of the first time I was beating my meat, but it turns out it was just a gunshot. Kids all around me where shouting that there was a school shooter. I immediately got up and ran to the door, carrying my pack with my hands. Suddenly I heard shots very close to my ears, and saw dead bodies on the ground, so I ran into the closest door which was the janitor's room, closed the door and hid under the table making as little noise as possible. Little did I know, my crush was under the same table, hiding there in fear, when she saw me she almost screamed, but I put my hand over her mouth and told her to be quiet. I heard the shooter opening the door slowly and looking for me. I was completely silent, but then I noticed my crush's incredible bajongas, and I felt my cock starting to throb and expand. She seemed to notice, and I could see that she was impressed with my goofy goober. Her facial expression made my ding dong enlarge even more and I could feel my pants starting to tear apart. My shclong abong seemed to send electro-magnetic waves all over the room because the light above us started to flicker with every throb of my cock. The shooter noticed that and walked to our table. I knew I had to do something quickly or me, my crush, and my beaver basher would all die. Then it hit me, and I knew what I had to do. I looked over to my crush, and I started playing with her milkers. At first she was trying to resist, but then she figured out what I was trying to do and played along. My cock grew more and more, and when I felt it about to burst out of my pants. I got up and looked straight at the shooter. He hesitated for a single moment, which cost him his life. My pants exploded as my sexcalibur shot out a single hardened white cum shaped like a 7.62 mm sniper bullet right into the shooter's head. I was about to celebrate but then I noticed the smell of smoke in the air, turns out my massive cock shot not only the shooter, but also a gas pipe that was in the vicinity. Fire was all around us, as I held my crush close, I knew there was no way both of us would get out of there, so there was only one option. \"Get in!\" I said. \"What?\" She asked. \"Get in! There is no time!\" I said and pointed to my foreskin. She climbed inside the pocket between my foreskin and my cock. And I started running, breathing smoke and caughing, kicking doors and running through hallways, longing for fresh air. Finally I got out of the school, and I saw everyone looking at me and my dong. I slowly walked to the benches, and sat down to breath. Then I saw my crush's mother, and she asked me where her daughter is. I got up, and said \"I know where she is!\". I pulled my foreskin and there she was. I expected to hear claps and cheers, but when I didn't, I looked at my crush and saw she was dead. Turns out she suffocated inside my yogurt hose. The police arrested me, and here I am, with my massive schlong and 15 years in prison.\n\nIf your penis is small, do not despair, for at least you did not have to go through what I did. Farewell.",
            ">We had a fight for about three hours not noticing my grandpa was awfully quiet.\n\nGolden",
            "24.089/10 Newcock times best seller.",
            "Thanks to your pasta I desire to live again. It pulled my out of long depression. \n\nThese crashes… they’re always fucking up your life",
            "I have a love hate relationship with this",
            "The fuck",
            "A tragedy",
            "this is the best thing ive read this week",
            "Man the shit you see in r/teenagers",
            "best thing i have read today",
            "Awesome. Just awesome",
            "🗿",
            "google translated version \n\nMy chicken\n\n\nFrom a young age, I realized that my penis was a little tall. I thought it would be nice to have my mom take a shower with her sister and see the little one with me, and I couldn’t help but smile at her. A few months later, when I won kindergarten, the kindergarten teacher checked the principal on a monthly basis and found that he was in a lot of pain. I was too young, but I was still hated when my older brother found out he was fine, so my mom called and asked the doctor to check on my uterus. The doctor said he had never seen such a strange wax, but it was the first time he had seen it in his mother's eyes. Enjoy this memory, I have seen chickens on TV before because I saw another poor carpet. I love seeing other kids soon with fear and embarrassment.\n\nA few years later, when I was 11, my penis became heavier. It's not a 24,089-inch flying joke in the sixth grade, so you need to find some creative ideas to hide. I hide under my right foot, and children often wonder why their right foot is \"more muscular\" than their other leg, as they often have to train their left foot. I remember one day when I went home crying in fear of God because he was insulting me in the hands of such a saint. When I felt pressure on my penis, I angrily dropped my pants. The shutdown began abruptly. I began to press with both hands, but it was not enough, I could not satisfy the animal with my hands, and I began to use my feet. God made me feel good again. When I was growing up, I was thinking of a master's degree. He saw a slightly swollen bird and his eyes wide. I was in bed, I thought Johnson was very upset, I didn't know what to do, I hid under the bed. The same thing happened on July 4th. At first the flow is smooth, about 1 liter of white cream per second, and then it is made from kebabs. The pen moved and she danced (I only knew that my grandfather had died of a heart attack that day because his voice reminded me that I was against Germany). A few seconds later I felt like I was drowning, because the juice covered the entire floor a few inches, I woke up in the tank and the gun finally started to rest. My shocked and tired mother went into the room and then took me to the doctor, who told her to reduce or eliminate masculinity. His grandfather, the sailors, fought for three hours.\n\nThe day after Anna's funeral, I went to the doctor, who told the same story as me. During a long penis scan, he revealed that he had been suffering from a supernatural disease that had been growing for years. My grandfather died of a fracture, 200 pounds, 30 pounds, thinking he could carry the maximum weight of his spine. I asked him if I could get rid of him, but he didn't tell me I was going to die for his blood. He also told me that I needed a blood transfusion every day. Needless to say, my curse was cursed again.\n\nOne day, when I was 16, I heard a horrible sound in a math class that reminded me of the first time I had hit my body, but only one bullet. The kids around the school yelled at me. I immediately got up and took the bag in my hand and went to the door. When I heard this, I immediately fell to my ears and saw my body lying on the ground, and I went to the side door of the house, to a locked room, closed the door, and hid under the table, and there was a faint sound. . . Little did I know that my love was under the table. I heard the sniper slowly open the door and look at me. I was devastated, but later lost my temper and realized that I had lost my friend. Bashar has passed away. Then he hit me, and I knew what to do. Seeing anger, I started playing with the milkmaid. At first I tried to resist, but I realized that this was just the game I was trying to play. His pants came out and I noticed that my penis was getting bigger. I got up and saw a security guard who had just stopped committing suicide. My target was a 7.62mm shotgun, a black and white cat hit his head and his pants exploded. I noticed that the smell of smoke in the air illuminates not only the chickens in the garden, but also the gas pipes around them. One of the reasons for this is that we know that we will not leave when we are surrounded by fire. -He offers! I said. \"What?\" They asked. \"Enter! I don't have time!\" I wanted to say. He put his hand between the cooks. Then I started running, taking a deep breath, knocking on the door, and starting to breathe fresh air. When I finally graduated from school, I saw a boat and everyone was looking at me. I sat down slowly and took a deep breath. So where was the girl when she saw her mother upset? I got up and said, \"I know where he is!\" I said. You reached out and stood there. I wanted to thank him, but when I couldn't hear his voice, I looked into his heart and saw him dead. I ate a bite of yogurt soup. He was arrested by police and sentenced to 15 years in prison.\n\nYou don't have a little sex, but you don't do what I do. Is happy",
            "What the Heck did I just read.",
            "this hits too close to home",
            "Ever since I was a wee lad, I noticed my penis was a bit large. I thought it was normal, untill my mom bathed me with my brother and I saw his little wee wee compared to mine, I couldn't help but point at it and mock it. A few months later when I started kindergarden, the teacher inspected our cocks for the monthly cock inspection, and noticed my large dick. I was very young but I could still see he was very envyous of my humongous cock, knowing he will never be as big, he called my mom and told her a doctor should see my penis. The doctor said he had never seen such an amazing specimen of a dong, that was the first moment I saw pride in my mom's eyes. I cherish these memories, as the cock inspection was the pinnacle of any month for me, seeing all the other pathetic little weiners. I loved watching the other kids take quick glances of my cock in fear and shame.\n\nA few years later when I was about 11 years old, my penis has started to become a burden for me. Having a 24.089 inch dick in 6th grade is no joke, I had to come up with creative ideas of where to hide the magnificent beast. Usually I hid it inside the right leg of my pants, kids always thought it was weird how my right leg was so \"muscular\" compared to my other, which meant I had to workout only my left leg in order to not arouse suspicion. I remember I went home depressed one day, crying to god on why did he curse me with such a shaft. I was tearing my pants with anger, when I started to feel tingly sensation in my penis. I started rubbing it, and suddenly it GREW EVEN LONGER, I was devestated because I thought it was already too large, but the feeling I had when I was rubbing it was too good to stop. I started holding it with both my hands and stroking it, but it was not enough, I could not satisfy my monster with mere hands, so I began using my feet too. The feeling was incredible, god was on my side again. As I was rubbing it faster and faster, I thought of my science teacher. My cock was throbbing, my nipples erect, my eyes wide and open. I was on my bed at the time, and I felt my Johnson about to erupt with tremendous force, I didn't know what to do so I hid under the bed, and then I came. It was like 4th of july. At first the stream was steady, of white cream in about 1 liter per second, then it was chaos. My penis was going up and down dancing with explosions of cum(Only later that day I found out my grandpa died at that moment of a heart attack because the sounds reminded him of bastogne when he was fighting the Germans). After a few second I realized I might drown because my juice covered the whole floor about two inch deep, I quickly slid across pools of cum gasping for air, I stood up and finally my cum gun started to relax. My mom came into the room shocked and disgusted, she yelled at me that I must see a doctor and get my manhood shortend or even removed. We had a fight for about three hours not noticing my grandpa was awfully quiet.\n\nThe day after my grandfather's funeral, I came to the doctor's office, and told him my story. After a lengthy cock inspection, he said that I have a rare condition, which makes my cock grow exponentially with each year, width and length. He calculated that my cock would weigh 200 kg when I turn 30, which is about the maximum weight my spine can support, beyond that and it would fracture and I'll die. I asked him if I could remove it, but he said no because I would die of blood loss. He also said I need to do blood transfusions everyday to feed my absolute unit of a scholng the blood it needs. Needless to say I was devestated, my once blessing, became a curse, again.\n\nOne day when I was 16, I was in my math class when I heard a terrible noise, it reminded me of the first time I was beating my meat, but it turns out it was just a gunshot. Kids all around me where shouting that there was a school shooter. I immediately got up and ran to the door, carrying my pack with my hands. Suddenly I heard shots very close to my ears, and saw dead bodies on the ground, so I ran into the closest door which was the janitor's room, closed the door and hid under the table making as little noise as possible. Little did I know, my crush was under the same table, hiding there in fear, when she saw me she almost screamed, but I put my hand over her mouth and told her to be quiet. I heard the shooter opening the door slowly and looking for me. I was completely silent, but then I noticed my crush's incredible bajongas, and I felt my cock starting to throb and expand. She seemed to notice, and I could see that she was impressed with my goofy goober. Her facial expression made my ding dong enlarge even more and I could feel my pants starting to tear apart. My shclong abong seemed to send electro-magnetic waves all over the room because the light above us started to flicker with every throb of my cock. The shooter noticed that and walked to our table. I knew I had to do something quickly or me, my crush, and my beaver basher would all die. Then it hit me, and I knew what I had to do. I looked over to my crush, and I started playing with her milkers. At first she was trying to resist, but then she figured out what I was trying to do and played along. My cock grew more and more, and when I felt it about to burst out of my pants. I got up and looked straight at the shooter. He hesitated for a single moment, which cost him his life. My pants exploded as my sexcalibur shot out a single hardened white cum shaped like a 7.62 mm sniper bullet right into the shooter's head. I was about to celebrate but then I noticed the smell of smoke in the air, turns out my massive cock shot not only the shooter, but also a gas pipe that was in the vicinity. Fire was all around us, as I held my crush close, I knew there was no way both of us would get out of there, so there was only one option. \"Get in!\" I said. \"What?\" She asked. \"Get in! There is no time!\" I said and pointed to my foreskin. She climbed inside the pocket between my foreskin and my cock. And I started running, breathing smoke and caughing, kicking doors and running through hallways, longing for fresh air. Finally I got out of the school, and I saw everyone looking at me and my dong. I slowly walked to the benches, and sat down to breath. Then I saw my crush's mother, and she asked me where her daughter is. I got up, and said \"I know where she is!\". I pulled my foreskin and there she was. I expected to hear claps and cheers, but when I didn't, I looked at my crush and saw she was dead. Turns out she suffocated inside my yogurt hose. The police arrested me, and here I am, with my massive schlong and 15 years in prison.\n\nIf your penis is small, do not despair, for at least you did not have to go through what I did. Farewell.",
            "Lolll",
            "This is a masterpiece.",
            "The cum accelerates.",
            "NTA your foreskin your rules",
            "Movie when?",
            "Skakespearian levels of quality",
            "This might be an hentai plot",
            "What a wonderful day to be literate.",
            "I can imagine this being in a museum in the year 2500",
            "*coughing",
            "ಠ_ಠ",
            "Monthly cock inspection",
            "i read the whole thing and i regret it",
            "\"And here I am, with my massive schlong and 15 years in prison.\"",
            "If this isn’t my essay topic on the AP exam, I’m not going.",
            "Sometimes, it's not great to be literate",
            "Perfection",
            "mike penis",
            "BIG MOTHAFUCKIN PENIS!",
            "Godzilla had a stroke trying to read this and fucking died",
            "Actually the funniest thing I’ve ever read",
            "huge plot :0",
            "I've finally found him, the reincarnation of Shakespeare. What a fascinating and heartbreaking story. Brings a tear to my eye.",
            "I went looking for gold and I found eye cancer.",
            "I noticed from the beginning of my life that my penis is enlarged. I think it was normal, but I couldn't, until my mother and brother took a bath and saw me a little. A few months later, when I was a child, the teacher looked at my penis for my menstrual tests and saw my big penis. I'm small, but I think he's jealous of his big cock and knowing it wasn't that big, he called my mother and told her to go to the doctor to get my penis. The doctor said he had never seen such a beautiful dong character and wanted this to be my first pantomime. I like this memory, because it's above a cocoa clock, the life of everyone who sleeps there. I want to show my children in my coats that I see fear and pain quickly.\r  \n\r  \nA few years later, when I was 11, I started blaming him. 24,089 fingers raw and not a first class game, I have ideas to feel beautiful. When I look at my right foot, children often ask me if my right foot is more muscular than others, that is, to train more than my left foot in the mirror. I remember one day when I came home shocked, I cried out to God because I had cursed myself with such a stick. When I first felt the color of my penis, he was briefly angry. I started washing and it immediately took a long time",
            "Plz stop",
            "This is a bot, counting clicks. I would put Money on it.",
            "Dick with foreskin looks dumb as fuck",
            "I wish i has gold to give this",
            "Damnit you beat me to it",
            "Like dawg",
            "What the fuck",
            "I just saw this 4 mintues ago",
            "I-",
            "Great reading thank you very much",
            "This sub never disappoints",
            "u/RelationshipSmooth44",
            "What",
            "Help",
            "Story",
            "Masterpiece",
            "This is the single most beautiful thing I have ever seen in my entire life",
            "I have I have I have a very big pp 🥺",
            "what a good read. 10/10",
            "How can I copy this?",
            "tldr",
            "This is art",
            "What the shit",
            "My penis\n\n\nEver since I was a wee lad, I noticed my penis was a bit large. I thought it was normal, untill my mom bathed me with my brother and I saw his little wee wee compared to mine, I couldn't help but point at it and mock it. A few months later when I started kindergarden, the teacher inspected our cocks for the monthly cock inspection, and noticed my large dick. I was very young but I could still see he was very envyous of my humongous cock, knowing he will never be as big, he called my mom and told her a doctor should see my penis. The doctor said he had never seen such an amazing specimen of a dong, that was the first moment I saw pride in my mom's eyes. I cherish these memories, as the cock inspection was the pinnacle of any month for me, seeing all the other pathetic little weiners. I loved watching the other kids take quick glances of my cock in fear and shame.\n\nA few years later when I was about 11 years old, my penis has started to become a burden for me. Having a 24.089 inch dick in 6th grade is no joke, I had to come up with creative ideas of where to hide the magnificent beast. Usually I hid it inside the right leg of my pants, kids always thought it was weird how my right leg was so \"muscular\" compared to my other, which meant I had to workout only my left leg in order to not arouse suspicion. I remember I went home depressed one day, crying to god on why did he curse me with such a shaft. I was tearing my pants with anger, when I started to feel tingly sensation in my penis. I started rubbing it, and suddenly it GREW EVEN LONGER, I was devestated because I thought it was already too large, but the feeling I had when I was rubbing it was too good to stop. I started holding it with both my hands and stroking it, but it was not enough, I could not satisfy my monster with mere hands, so I began using my feet too. The feeling was incredible, god was on my side again. As I was rubbing it faster and faster, I thought of my science teacher. My cock was throbbing, my nipples erect, my eyes wide and open. I was on my bed at the time, and I felt my Johnson about to erupt with tremendous force, I didn't know what to do so I hid under the bed, and then I came. It was like 4th of july. At first the stream was steady, of white cream in about 1 liter per second, then it was chaos. My penis was going up and down dancing with explosions of cum(Only later that day I found out my grandpa died at that moment of a heart attack because the sounds reminded him of bastogne when he was fighting the Germans). After a few second I realized I might drown because my juice covered the whole floor about two inch deep, I quickly slid across pools of cum gasping for air, I stood up and finally my cum gun started to relax. My mom came into the room shocked and disgusted, she yelled at me that I must see a doctor and get my manhood shortend or even removed. We had a fight for about three hours not noticing my grandpa was awfully quiet.\n\nThe day after my grandfather's funeral, I came to the doctor's office, and told him my story. After a lengthy cock inspection, he said that I have a rare condition, which makes my cock grow exponentially with each year, width and length. He calculated that my cock would weigh 200 kg when I turn 30, which is about the maximum weight my spine can support, beyond that and it would fracture and I'll die. I asked him if I could remove it, but he said no because I would die of blood loss. He also said I need to do blood transfusions everyday to feed my absolute unit of a scholng the blood it needs. Needless to say I was devestated, my once blessing, became a curse, again.\n\nOne day when I was 16, I was in my math class when I heard a terrible noise, it reminded me of the first time I was beating my meat, but it turns out it was just a gunshot. Kids all around me where shouting that there was a school shooter. I immediately got up and ran to the door, carrying my pack with my hands. Suddenly I heard shots very close to my ears, and saw dead bodies on the ground, so I ran into the closest door which was the janitor's room, closed the door and hid under the table making as little noise as possible. Little did I know, my crush was under the same table, hiding there in fear, when she saw me she almost screamed, but I put my hand over her mouth and told her to be quiet. I heard the shooter opening the door slowly and looking for me. I was completely silent, but then I noticed my crush's incredible bajongas, and I felt my cock starting to throb and expand. She seemed to notice, and I could see that she was impressed with my goofy goober. Her facial expression made my ding dong enlarge even more and I could feel my pants starting to tear apart. My shclong abong seemed to send electro-magnetic waves all over the room because the light above us started to flicker with every throb of my cock. The shooter noticed that and walked to our table. I knew I had to do something quickly or me, my crush, and my beaver basher would all die. Then it hit me, and I knew what I had to do. I looked over to my crush, and I started playing with her milkers. At first she was trying to resist, but then she figured out what I was trying to do and played along. My cock grew more and more, and when I felt it about to burst out of my pants. I got up and looked straight at the shooter. He hesitated for a single moment, which cost him his life. My pants exploded as my sexcalibur shot out a single hardened white cum shaped like a 7.62 mm sniper bullet right into the shooter's head. I was about to celebrate but then I noticed the smell of smoke in the air, turns out my massive cock shot not only the shooter, but also a gas pipe that was in the vicinity. Fire was all around us, as I held my crush close, I knew there was no way both of us would get out of there, so there was only one option. \"Get in!\" I said. \"What?\" She asked. \"Get in! There is no time!\" I said and pointed to my foreskin. She climbed inside the pocket between my foreskin and my cock. And I started running, breathing smoke and caughing, kicking doors and running through hallways, longing for fresh air. Finally I got out of the school, and I saw everyone looking at me and my dong. I slowly walked to the benches, and sat down to breath. Then I saw my crush's mother, and she asked me where her daughter is. I got up, and said \"I know where she is!\". I pulled my foreskin and there she was. I expected to hear claps and cheers, but when I didn't, I looked at my crush and saw she was dead. Turns out she suffocated inside my yogurt hose. The police arrested me, and here I am, with my massive schlong and 15 years in prison.\n\nIf your penis is small, do not despair, for at least you did not have to go through what I did. Farewell.",
            "average r/teenagers post. copy paste for mobile?",
            "ＳＯＬＩＤＤＯＮＧ",
            "[deleted]",
            "i read the whole thing, and i do not regret it",
            "This is a masterpiece this is the copypasta of copypastas",
            "Were do i even start....",
            "...that was a Rollercoaster",
            "Can somebody post this in comments for mobile pls?",
            "what the hell",
            "Is this real?",
            "This is the best thing I've ever read",
            "wow...",
            "i read through this whole thing and honestly it's the most poetic thing i've seen all week.",
            "Bajongas",
            "Boo go for the war.....snipe enemies and save people from your foreskin",
            "Man create his own personal 2 inch waterfall",
            "Wtf did i just read?",
            "Beautiful, just truly beautiful.",
            "NOTHING could've prepared me for that ending. NOTHING.",
            "This should be a nyt bestseller",
            "this is beautiful",
            "what",
            "u/shittytranslatorbot",
            "Sucks that your grandpa died. Salute to the mans grandpa. BUT HAVING A 24 INCH COCK IN 6TH!?!?!? JESUS THATS BIG",
            "part 2 please",
            "I love reading long copypastas fr",
            "Sounds like you've got a bad case of OCD (Oversized Cock Syndrome)",
            "What?"
        ]
    },
    {
        "post_id": "9pnlyz",
        "author": "vektorog",
        "title": "the jolly rancher story",
        "url": "https://www.reddit.com/r/copypasta/comments/9pnlyz/the_jolly_rancher_story/",
        "score": 4937,
        "num_comments": 1048,
        "created_utc": 1539980779.0,
        "selftext": "Nothing tops the Jolly Rancher story.\n\nSteve and his girlfriend Samantha went off to college in August. She went to Florida State, he went to Penn. So, she decides to fly to PA to visit him. He was really happy to see her so he decided to give her some oral action.\n\nHe had done this numerous times before and he always enjoyed doing it...but for some reason, this time, she smelled really horrible, and she tasted even worse. He didn't want to offend her though because he hadn't seen her in months...so he put a Jolly Rancher in his mouth to cover it up, even though it didn't do much to help.\n\nIn the course of eating her out, he accidentally pushed the candy inside of her... and stuck a finger in to grab it out. He took it out, and put it back into his mouth and bit it. Only...it wasn't the Jolly Rancher.\n\nIt was a nodule of gonorrhea.\n\nAs in, the blister-like structure that gonorrhea makes filled with diseased pus was the size of a fucking Jolly Rancher and the poor guy BIT it. I guess it was really dark in the room. He freaked out and started vomiting all over the place when it exploded in his mouth...\n\nHe demanded to know what was going on, turns out she had cheated on him at a club like, the first week of college, and fucked some random guy and the stupid bitch had no clue what was wrong with her. She noticed a strange smell though.\n\nSo now, Steve is freaking out that he now has gonorrhea of the mouth and God knows what else.",
        "permalink": "/r/copypasta/comments/9pnlyz/the_jolly_rancher_story/",
        "comments": [
            "Someone told me not to look this up and I should've listened.",
            "Nothing tops the Jolly Rancher story.\n\nSteve and his girlfriend Samantha went off to college in August. She went to Florida State, he went to Penn. So, she decides to fly to PA to visit him. He was really happy to see her so he decided to give her some oral action.\n\nHe had done this numerous times before and he always enjoyed doing it...but for some reason, this time, she smelled really horrible, and she tasted even worse. He didn't want to offend her though because he hadn't seen her in months...so he put a Jolly Rancher in his mouth to cover it up, even though it didn't do much to help.\n\nIn the course of eating her out, he accidentally pushed the candy inside of her... and stuck a finger in to grab it out. He took it out, and put it back into his mouth and bit it. Only...it wasn't the Jolly Rancher.\n\nIt was a nodule of gonorrhea.\n\nAs in, the blister-like structure that gonorrhea makes filled with diseased pus was the size of a fucking Jolly Rancher and the poor guy BIT it. I guess it was really dark in the room. He freaked out and started vomiting all over the place when it exploded in his mouth...\n\nHe demanded to know what was going on, turns out she had cheated on him at a club like, the first week of college, and fucked some random guy and the stupid bitch had no clue what was wrong with her. She noticed a strange smell though.\n\nSo now, Steve is freaking out that he now has gonorrhea of the mouth and God knows what else.",
            "I used to be an ER nurse and had a guy with a sore throat had his strep culture come back as gonorrhea. It took me a minute to figure out how that could happen… and I was like . Eeeewwww.",
            "Dude probably still hates cheese",
            "This is fucking disgusting but a part of me wishes this was real.",
            "A",
            "[deleted]",
            "The Dantavius video told me not to look this up, but I just did and I regret nothing.",
            "joe balls",
            "I should’ve listened",
            "After hearing stories like the Poop Knife and Cumbox I thought I’d have become immune to these kinds of stories but no..",
            "Poor Steve. I bet till this day my mans is still traumatized to eat a girl out",
            "I remember reading this what feels like years ago and as soon as Dantavius said jolly rancher, I knew, and oh god how I wish I didn’t",
            "Fuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuckkkkk. No. Just no! What the fuck?",
            "So many of us were warned, yet like a horror train wreck we could not ignore our curiosity. \n\nWhat's worse is as a nurse I could actually smell this story...I will be drinking bleach",
            "i see why Dantavius said not to search this one",
            "Some guy on youtube told me not to look this up. Eh. I could be mentally insane, but this isn't too disgusting to read, just the possibility of it happening is more disgusting. Also, can someone explain to me why this isn't archived?",
            "Not one single time have I read or heard a story that made me gag. I don’t have a weak stomach & I have some background in medical. This.. THIS made me gag to the point I would full on puke had I had anything to eat today. Someone suggested to look this up while a couple others who were familiar with this story strongly advised otherwise. One day I’ll learn to listen.. today may be the day.",
            "So he left the jolly rancher in her?",
            "Oh. My. God.",
            "OH MY GOOD",
            "Omg omg OMFG I wish I'd listened and NOT looked this up!",
            "Why did I Google this?",
            "I was to curious.",
            "I love this story",
            "soooo worth the read 😂😂 if someone tells me not to do read something i HAVE TO.",
            "I don't know why I listen to you people. First the coconut and now this. I don't feel so good.",
            "I can't eat a jolly rancher anymore",
            "not such a terrible story just a bitch bein disloyal and the other well he now has gonorrhea",
            "!emojify",
            "Hey op I wanna remind you of this post you made",
            "Mmmmmmmmmm, clapmouth.\n\nI think I'll use this for a video idea...I think I can work some cottage cheese in there...maybe with a bit of yellow and/or green dye...",
            "If you ever served this a story you already heard many times…. Support the troops… Please, they need your compassion…",
            "Please put me down like old yeller",
            ">>C",
            "H",
            "The link did not have a warning. This is traumatizing.",
            "Golden",
            "Dantavius Why😭🙏🏻",
            "😲",
            "Things like this are what make me pray for a new Tower of Babel",
            "Why didn't I listen. I saw this once years ago and had somehow managed to block it out. Now I've been reminded and I'm filled with regrets.",
            "WOW I'm a sucker for crazy stories and this one I wouldn't have guessed! I thought maybe an old tampon that got stuck but DAMNNNNNNN!",
            "If a girl smells it usually means she recently had sex",
            "I will be using bleach as mouth wash haha what the actual fruckerkety is thisssss",
            "🤢🤮🤦🏽‍♀️",
            "WTF",
            "i’m so angry about someone suggesting to come read this post",
            "Nodule. I now fucking hate this word.",
            "Dantavirse warned me not to search it up.",
            "Is that even possible? A gonorrhea nodule?? What?\nIs this for real??",
            "Just like most things on reddit, this sounds like stupide made up bullshit.",
            "This story is way overhyped.\n\nThis is not so bad.",
            "I've seen and heard way worse and this isnt that bad",
            "I don't know what gonorrhea is and I don't want to find out",
            "What flavor do you think the nodule would identify as (provided it was sentient)?",
            "Cox",
            "mmmm jolly rancer",
            "Lmao. Why it’s not archived?",
            "dusty thread",
            "N",
            "😋",
            "Stay careful out there folks",
            "shi I wouldve told the girl that her pussy smells awful and to go wash it",
            "Dear lord, I should have listened to the video",
            "😧",
            "Dude what the fuck",
            "EW WTF😦",
            "I have never genuinely been this disgusted at something in my entire life...",
            "daddy chill\\~",
            "Dan warned me, I regret everything",
            "I remember being told this story from a friend back in 2005 or 2006! Except they said it was a herpes sack",
            "Man, I really should've listened",
            "I’ve said it once and I will say it again, “Reddit is a godd*mn curse and a blessing at the same time”",
            "Oh hey my classmate told me this story like 3 years ago",
            "Never should have traced the story.",
            "How you doing OP?",
            "god i should have listened to Dantavius",
            " From now on if someone tells me to not look something up I'll listen",
            "I should’ve listened to Dantavius when he told me not to look it 🤢",
            "hey not that bad",
            "Cursed candy",
            "WTF why did i follow the link?",
            "Someone said tgis is really bad he was right",
            "I was prepared for worse. Still disgusting, but not that bad",
            "I’m sorry wtf",
            "I was watching a fucking video and was told not to look this up, I regret my decision horribly",
            "Should have listen to dantavirus",
            "That's pretty bad.",
            "Reading this shit makes me feel sick but I still read it",
            "ive read worse",
            "God I should of listened",
            "I should of listened",
            "What did I just read ....welp that's enough reddit for today. Shoulda listened to the warning .",
            "Oh, the shit you can never unread!",
            "i want to jump off a building after reading this",
            "Ho ho holyshit",
            "Honestly not as bad as I thought itd be by peoples reactions..... maybe I've been on the internet for too long and my threshold is just way high these days.",
            "why did I do this to myself?",
            "🗿",
            "I thought “I’ve seen some really awful shit on the internet, this can’t be so bad” and while this isn’t the worst I’ve seen, its close",
            "I don't like the person that posted the link on the post I was just in",
            "Well thats not what i was expecting....i cant believe she cheated on him lol",
            "This isn't THAT bad..",
            "WHY GOD WHY WHY WHY DID I LOOK THIS UP NOOOOOOO AAAAAAAAAAAAAAAAAAAAAAAAA",
            "AH FUCK WHY",
            "NO PLEASE ERASE THIS FROM MY HEAD",
            "I just might kill myself.",
            "Everyday. We stray further from god.",
            "LMAO",
            "^(OH.)\n\n^(MY.)\n\n^(FUCKING.)\n\n***GOD.***",
            "I’m here for leyendas legendarias",
            "Came from Dantavius channel",
            "Should have LISTENED Dantavious and NOT search this.",
            "What flavor was the jolly rancher?",
            "oh so this is where the polish mentos pasta came from",
            "What the fuck",
            "why... just why would you do write this... i dont understand",
            "hannahthehorrible anyone?",
            "I’m gonna cry more thx",
            "Anyone Here from Dantavius? I am lol",
            "Some dude told me this story like 5 years ago in JROTC and I was wondering where tf he got it from cause he sure as hell wasn’t smart enough to make that up. Guess my side quest is complete.",
            "i n t r e s t i n g",
            "bro wtf",
            "Relatable",
            "I- what the actual fuck did I just read?",
            "I should've listened to dantavirus 🕺🏾",
            "!remindme 1 year",
            "I should have listened to dantavious’s video",
            "10/10 an absolute banger\n\nSeriously though what the fuck",
            "wasnt too bad, thought i was boutta see some gore",
            "I should have listened",
            "WHY DID I NOT LISTEN TO DANTAVIUS AAAAAAAAAAAAAAAAAAH",
            "I regret googling this",
            "Well Dantavius was right that’s for sure",
            "Same",
            "I saw a YouTube video saying not to look this up, I wish I would have lissiond",
            "Pasta o mentosie",
            "Nodule of Gonorrhea. 🤢🤮🤮🤮",
            "They said not to look this up, I'm happy to know that it was just as disgusting as I had hoped.",
            "Still not as bad as the coconut guy.",
            "Should've listened and never looked at it :/",
            ":(",
            "\"16 people are here\" Reddit says.. \nAnd with that, 16 lives will be changed forever.",
            "Oh shit, I'm about to have a delicious dinner and I have just clicked the link.\n\nFuck.",
            "Why the fuck did I do this to myself",
            "Meh\n\nI mean, this is pretty bad, but ive heard and seen stuff more gross than this",
            "Eeewwwww!",
            "IMMEDIATELY running to the bathroom to brush my teeth, wash my mouth with soap and alcohol and all, then rushing to the hospital. He’ll be fine .",
            "It's like my brain tries to forget and I'm sent here back by random reddit comments... \nGod, when would I learn!!",
            "Won't be able to eat my girl's pussy after reading this. Absolutely horrific.",
            "Holy Shit and all that's holy.",
            "I'm not often a fan of calling women bitches in Amy context. I'm not gonna fight this one. Nope. I'm going to leave, and pretend I don't feel like throwing up.",
            "Oh it’s not as bad as I thought lol",
            "Why Didn't I listenWhy Didn't I listenWhy Didn't I listenWhy Didn't I listen",
            "I'm the new guy who didn't pay heed to the warning not to look this up",
            "Oh my god why did I not hear your warnings redditors",
            "I should have listened",
            "Should've listen to Dantavius",
            "WHEN MY FRIEND TOLD ME TO READ THE REDDIT JOLLY RANCHER STORY I KNEW IT'D BE BAD BUT NOT LIKE THIS",
            "😟😟",
            "Oh dear god i am going to gouge out my eyes with a spork",
            "Oh hell naw",
            "How can I unremember this?",
            "Bye now, I'm gonna go puke",
            "I hate TikTok for this! So many regrets",
            "💔💔😭😭😭",
            "If there are just a few jolly ranchers left, and you want them.  Just tell the rest of the people in the room to look this up.",
            "Fuck TikTok for making me look this up",
            "Im here from tic tok , and idk if I’m really grossed out or if I actually want to see his be turned into a short film. Where he turns into a zombie",
            "What a horrible day to have eyes.",
            "Literally same and I regret it now",
            "Yess",
            "oh my god",
            "i don’t know what i was expecting but this was far from it",
            "Fuck me for being curious",
            "How do I forget I ever read something?",
            "That is fucking disgusting. But what doesn't make sense is that gonorrhea is an infection that causes a sort of like blister on the vagina \nOr a liquid substance. It does not make sense that a noodle of that stuff is solid. He would have to rip off some of her flesh to have a peice of it if it was in blister form. Either that or it was in  liquid form and it gotten hard or something. Idk tell me whats going on please",
            "fuck he was right i shouldnt have looked it up",
            "I should have listened to Dantavius",
            "Ngl this is so relatable",
            "Yup I should have listened and NOT looked this up",
            "anyone here from dantavirus? and am i the only one who did not get grossed out on this?",
            "this is mind fucking.",
            "Oh God why",
            "Can’t do this",
            "Fck",
            "It ain't that bad, well at least for me. Someone told me to not look this up, I was expecting worse",
            "Bruh I’m eating fucking jolly ranchers. Just had to ruin it.",
            "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
            "Same",
            "Same",
            "Noooooooooo",
            "Ya I should’ve just not went searching for this one. I was warned. Sigh.",
            "Gotcha",
            "If it's a real woman I sincerely hope she's suicidal for living so negligently and whorishly. She should be so disgusted by herself that she wants to die, not only for her degenerate whorishness but her stupidity in thinking hemroids on her vagina filled with dumpster juice smelling pus is normal.\n\n&#x200B;\n\nvile rat",
            "Someone said not to search this. I should have listened lol.",
            "I wonder if mouthwash would’ve helped his mouth situation, if applied quickly enough.",
            "What a fucking masterpice!",
            "I wish I listened when they told me not to look it up",
            "I should've listened to dantavius",
            ":c",
            "Hell nah",
            "Jit discussing",
            "My stupid ass looked up pictures of gonorrhea.\n\n*How do I clear my brain's watch history?*",
            "Gotta be honest. Not as traumatized as I was expecting to be.",
            "what the fuck",
            "FUCKING ARCHIBE THIS REDDIT!!!!!",
            " Ode",
            "I hate myself for being stupid enough to look this shit up. What the fuck.",
            "Dantavius was right… why did I search it up",
            "Blueberry yogurt",
            "This story is bullshit lmao you don't have solid chunks of gonorrhea like that 🤣",
            "My soul needs a bath",
            "Not my proudest wank.",
            "I was told this was disgusting, and yet here I am. Why didn't I listen 🤮",
            "OK. New view. Still awful. Argh. Shoulda woulda coulda...",
            "I hope Steven fucked her up 💀",
            "This is the most fucking disgusting thing I have heard on Reddit so far 🤢🤮",
            "Penis",
            "D:",
            "My brother told me to look this up. I should’ve known not to but I think he accomplished his goal of ruining my night.",
            "i wish i never looked this up",
            "Bruh",
            "Fuck🤢🤮",
            "Absolutely 💯 false. I am an RN on med surg and I PROMISE there is no * nodule of gonorrhea.  Never, ever, ever.",
            " I should have listened not to come here",
            "Thanks for converting me to abstinence",
            "*Kink obtained*",
            "Hey everybody whats up😋the name's Steve",
            "I'll bill you for my therapy sessions🥺👍",
            "I don’t think that’s how it works but ok",
            "Yummy 🤢🤮",
            "I don't know what I was expecting... but it wasn't this.",
            "Remembered this from another post. I had the exact same wince and stomach heave.",
            "WHY DID I READ THIS SHIT. NO. ABSOLUTELY NOT.",
            "Fuck. I saw how short the story was and thought it couldn’t be that bad.\n\n\nIt was that bad. Fuck.",
            "Dantavius was right",
            "Oh god WHY DO I KEEP LOOKING UP THINGS I SHOULDNT BE",
            "Fuck's sake man. My curiosity got the better of me again and I fucking regret it.",
            "What a horrible day to know how to use google",
            "[deleted]",
            "Same",
            "Thanks @corganart",
            "gosh how glad i am to have know this story",
            "Bro what the hell 😂",
            "Eating a jolly rancher rn 💀",
            "Does anyone else not regret looking this up?",
            "Dantavious was right 😔",
            "Bro got a gusher instead 💀",
            "Same...",
            "WHY DID I READ THIS?!!!?",
            "Ceftriaxone and doxycycline will get him right",
            "Waaaaaiiiiit. Issss...is this real?!\n\nIf so, did I just gonorrhea from reading this?\n\nFuck me",
            "Chat is this real?",
            "i should *not* have read this",
            "i feel sick.",
            "And a murder case",
            "God this makes me so glad im monogamous🤮",
            "This has given me a special kind of depression.",
            "Same 😩",
            "God someone just linked this and made me speechless",
            "What in TARNATION?!",
            "My friends, family, and even therapist have advised me not to look this up. I should have listened to them",
            "Why did I not listen, dry retching at the thought of it 🤢🤮🤣😖🤮",
            "Whoops.",
            "i stopped at the first gross part",
            "Not the weirdest thing I've eaten.",
            "GOD DAMMIT! I should have followed the instruction to not look this story up. GD it.",
            "God damn falafel guy.MF",
            "Why did I look this story up",
            "DAMN YOU FENELIOUS FAFEL",
            "This is tepid water compared to what is talked about in my work place.",
            "Same",
            "Damn you falafel 😠.",
            "Wth did I just read 🙃",
            "☠️",
            "Im here cuz of a tik tok video",
            "Why did Marshal Patrick have to appropriate Falafel's  hurricane skit.",
            "@feloniusfalafel damn you",
            "yall are acting like this is bad? seriously? i have read worse",
            "What a  horrible day to have eyes",
            "Not the best Jolly Rancher pitch but I still bought a bag",
            "Did anyone ever find out what happened to the Jolly Rancher?",
            "I shall remember this story for the rest of my days. One day, my children will get married, and I will include this story in my speech and put my son or daughter in it. Or I will wait until I'm old and senile and attend the funeral of a long-time friend and tell the story there. This must spread. I will spread it. I will also never think of jolly ranchers the same way again. Thank you, author. You have given me a mission.",
            "So glad I read this.",
            "Well, now I get why I was told to not look this up. Why do I always have to look up things I'm old not to look up smh",
            "It’s so much worse than I thought omfg",
            "Same",
            "Someone told me not to look this up and I should’ve listened.",
            "Damn feloniousfalafel you really wanting to find out this story and now I regret my decisions",
            "☹️",
            "I have a really strong stomach, but this… this tested me.",
            "God I just finished eating too I really wished I listened to dantavius when he said don’t look it up",
            "I saw this being mentioned and it sounded sketchy i dident have to look this up\n\nBut im stupid   so next up streetlamp lamoose",
            "Do NOT google what a nodule of gonorrhea looks like. I will never have sex again. Or eat.",
            "Same",
            "Now I'm nauseous, I should not have looked it up...",
            "TROLLED!!!!!!",
            "So did they break up?",
            "Who’s here from happy hour 😜"
        ]
    }
]